{"duration": 0.8747134208679199, "input_args": {"text": "'In his lengthy interview with AFP on Thursday, Syrian President Bashar Assad mused that the American “Deep State” was more responsible for pelting his Sharyat airbase with 59 cruise missiles than President Donald Trump. [When the interviewer proposed that the retaliatory missile strike marked a drastic change in Trump’s position on Syria, Assad insisted the U. S. and Syria could still be partners in fighting terrorism, once Trump wrested control of Washington away from the   complex.  “If they are serious in fighting terrorists, we’re going to be partners, and I said not only the United States. Whoever wants to fight the terrorists, we are partners,” said Assad, in the transcript provided by Syria’s SANA news service. “This is basic for us, basic principle, let’s say,” he continued: Actually, what has been proven recently, as I said earlier, that they are hand in glove with those terrorists, the United States and the West, they’re not serious in fighting the terrorists, and yesterday some of their statesmen were defending ISIS. They were saying that ISIS doesn’t have chemical weapons. They are defending ISIS against the Syrian government and the Syrian Army. So, actually, you cannot talk about partnership between us who work against the terrorists and who fight the terrorism and the others who are supporting explicitly the terrorists. Assad said the American missile strike was “the first proof that it’s not about the President of the United States  —   it’s about the regime and the Deep State, or the deep regime in the United States. ” He said the Deep State “is still the same, it doesn’t change. ” “The president is only one of the performers on their theatre, if he wants to be a leader, he cannot, because as some say he wanted to be a leader, Trump wanted to be a leader, but every president there, if he wants to be a real leader, later he’s going to eat his words, swallow his pride if he has pride at all, and make a 180 degree   otherwise he would pay the price politically,” said Assad. Asked if he anticipated another U. S. attack, Assad replied: As long as the United States is being governed by this   complex, the financial companies, banks, and what you call deep regime, and works for the vested interest of those groups, of course. It could happen anytime, anywhere, not only in Syria. Assad lamented that his military could not retaliate against the American ships that fired cruise missiles at Syria but expressed hope the Russians might do it for him. “For us, as a small country, yeah, of course it is, everybody knows that. It’s out of reach. I mean, they can have missiles from another continent. We all know that. They are a great power, we’re not a great power. Talking about the Russians, this is another issue,” he said.'"}, "time": 1742562987.9922733}