{"duration": 0.08117890357971191, "input_args": {"text": "'Apple built an empire on hermetically sealed systems with sleek, minimalist designs. Nowhere was its strategy more evident than in iMessage, the company’s instant messaging system that offered a free, elegant chatting solution exclusive to Apple devices. Until last week, that is, when Apple updated its software, cracked open iMessage and allowed the ephemera of the outside internet to seep in. Now, click on an unassuming arrow in the chat window, and you’ll throw open a junk drawer of digital tchotchkes scavenged from web properties new and old. GIFs, stickers and supersized emoji dominate this digital playground, while text  —   actual words  —   becomes almost an afterthought. But unlike the freewheeling world of the outside web, where we grab and go as we please, Apple is steering users toward a tightly curated selection of   toys. None would look out of place at a   ’s birthday party. Many come at a price. Welcome to Apple’s sanitized, monetized version of internet culture. Apple’s extreme messaging makeover gives us a suite of new visual effects  —   throw confetti, release balloons and shoot lasers across the text screen  —   that recall the crude,   décor of   GeoCities sites. Another set of tricks turns the text box into a kind of slick, improvised web video: The “loud” effect makes the chat bubble stretch and tremble as it’s delivered, while the “gentle” effect shrinks it down to visualize a whimper. The most superfluous piece of flair is the “digital touch” feature, which conjures a beating heart or a sizzling fireball when you press on the screen just so. These features mimic the aesthetics of the open internet, which is obsessed with nostalgia and is not exactly subtle. But they can’t replicate the feeling of collecting digital miscellany in our travels across the internet, remixing the material and sending it along to friends who might appreciate the find. The programmatic iMessage sucks the spontaneity from the experience. It standardizes the strange. Several new features, meanwhile, blow up iMessage’s intimate chat experience to help it compete with the social networks. A handy GIF keyboard jumps off the   empire that Tumblr built, calling up video loops of broadly accessible cultural references (Honey Boo Boo dancing, two Minions giggling) to convey a range of emotional states. Another feature lets you   directly onto your photos, just like you can on Snapchat. But mostly, this thing feels like Facebook. A new class of iMessage apps  —   yes, apps within an app  —   lets chatters play Words With Friends, send money through Square or make dinner reservations on OpenTable, all right within the chat window. It feels like iMessage is trying to swallow the rest of your phone. The camera is in here, and so too can be Fandango, ESPN, and, if you want, Carrot, a snarky robot that reads you the weather report for $3. 99. In many of these cases, the service is so slight that exchanging actual words would work just fine: Want to see “Snowden” at 10:15? Did you catch the Nats game? It’s 77 and sunny  —   greeaaaaat. It’s not clear why every shade of human interaction needs to be mediated by its own app. Here’s one theory: Each tap into the iMessage world sends you further away from your chat bubbles and deeper into Apple’s labyrinth of special features. Follow the path to its inevitable conclusion, and all of a sudden, you’re no longer talking with your friends. You’re shopping. Five clicks into iMessage, you’ll arrive at Apple’s   sticker shop. Offering colorful sets of illustrations to drag and drop into your chats, it’s one of iMessage’s most tantalizing new destinations. If our chat windows function as modern living rooms, stickers offer the opportunity to appoint our walls with art from   digital creators. Too bad Apple is most excited to highlight stuff created by brands. This past weekend, the app store showcased sticker packs sponsored by Pokémon, Star Wars and Disney. Other top offerings came from the Powerpuff Girls, Marvel, Sesame Street, Sephora, the Backstreet Boys and Ellen DeGeneres, who’s charging $1. 99 for a set of illustrations including an avocado in a top hat and a cucumber in a snapback cap. The products are ads for other products. iMessage is the iPhone’s most trafficked feature. Its chats facilitate an endless combination of social interactions and emotional expressions. But Apple’s shop suggests that all conversations would improve from a Party   redecoration, with generic celebratory sentiments and   flair. “Stickers” sound inherently childish, but they don’t have to be. The stickerification of chats was pioneered by Line, a Japanese chat giant that swept Asia and is lately making a bid for western audiences. Line loves corporate synergy, too, heralding sticker sets starring Snoopy, Super Mario and Hello Kitty. But even as it attempts world chat domination, Line services online subcultures. Dozens of sticker sets feature gay characters, and more than one  —   “Fangirl’s Activities” and “I Love KPOP”  —   depicts anime girls in various states of obsession. Then there’s the sex stuff. The “UMAOTOKO” sticker shows two men in horse costumes, uh, stretching together. The most risqué sticker I could find in Apple’s version was in a set called “Failmoji. ” It’s a   butt with the caption “FART! !” Apple’s chat overhaul ushers elements of internet creativity into the company’s tightly controlled  . But the most truly creative expression to unfurl inside iMessages so far has been made in opposition to Apple’s imposed boundaries. Madison Malone Kircher, a writer at the New York magazine tech blog Select All, wrote a handy guide to using iMessage to “annoy the hell out of your friends. ” When the tech writer Casey Johnston updated her phone and the new iMessage, she posted screenshots of herself and a friend virtually vandalizing their chat window with smarmy pregnancy stickers,    effects and graphics layered so high the images became unintelligible. As Ms. Johnston put it: “The race to find the worst thing iOS can possibly do is on. ” May I suggest this celebrity sticker pack created in the image of the white rapper  ?'"}, "time": 1742562737.9283395}