{"duration": 0.1467900276184082, "input_args": {"text": "'SEOUL, South Korea  —   North Korea launched a ballistic missile toward the sea off its eastern coast on Sunday, in what South Korea called the North’s first attempt to test President Trump’s policy on the isolated country. A projectile believed to be a modified version of the North’s   ballistic missile Musudan took off at 7:55 a. m. from Banghyon, a town near North Korea’s northwestern border with China, and flew 310 miles before falling in the sea, the South Korean military said. Earlier, the United States Strategic Command issued a statement identifying the missile as a   or   system that “did not pose a threat to North America. ” South Korea condemned the missile launching, saying that it violated a series of United Nations Security Council resolutions that bar North Korea from developing or testing ballistic missile and nuclear weapons technologies. It also said the North had launched the missile to raise tensions over its weapons programs and to use it as leverage in dealing with the Trump administration. “We see this as part of an attempt by the North to grab attention by demonstrating its nuclear and missile capabilities and to counter the new United States administration’s strong policy line against North Korea,” the South Korean military said in its statement. The missile launch came as Mr. Trump is hosting Japan’s prime minister, Shinzo Abe, on an official visit, but it was unclear if the test was intended as a political message. Mr. Trump and Mr. Abe hastily arranged a joint appearance in response. “North Korea’s most recent missile launch is absolutely intolerable,” Mr. Abe said, calling on the country to comply with all relevant United Nations Security Council resolutions. Looking grim, Mr. Trump said nothing about the missile launch, but pledged to staunchly back Japan. “I just want everybody to understand and fully know that the United States of America stands behind Japan, its great ally, 100 percent,” he said. The two leaders are at    Mr. Trump’s club in Palm Beach, Fla. where they are meeting over the weekend. The United States Strategic Command statement identified the missile North Korea launched as “a   or   ballistic missile. ” “The missile was tracked over North Korea and into the Sea of Japan,” the statement added. “The North American Aerospace Defense Command determined the missile launch from North Korea did not pose a threat to North America. ” South Korea’s Foreign Ministry said the test, the first by the North this year, demonstrated the “maniacal obsession” of the North Korean leader, Kim   with developing a   ballistic missile. The test came less than two days after Mr. Trump said on Friday that defending against the nuclear and missile threats from North Korea was a “very, very high priority. ” Mr. Trump made the comment at a news conference with Mr. Abe at the White House. In their joint statement, the two leaders had urged North Korea “to abandon its nuclear and ballistic missile programs and not to take any further provocative actions. ” The test of an   system would have been especially provocative because it would mean that North Korea was trying to develop the ability to strike the United States. South Korean officials said they believed that the North has been using the Musudan, its   missile, to develop and test some intercontinental ballistic missile, or ICBM, technologies. North Korea has deployed and often tested   Scud and midrange Rodong ballistic missiles that can reach most of South Korea and Japan, but it has had a spotty record in   the Musudan, its only missile with a range long enough to reach American military bases in the Pacific, including those on Guam. North Korea’s last Musudan test ended in failure in October. In a New Year’s Day speech, Mr. Kim said his country had reached a “final stage” in preparing to conduct its first test of an ICBM. That drew a Twitter post the next day from Mr. Trump that said, “It won’t happen!” North Korea has since warned that it could   an ICBM “anytime and anywhere,” in its first challenge to the new American president. The American defense secretary, Jim Mattis, visited South Korea on his first official trip abroad and agreed with South Korea to boost the allies’ joint defense abilities against North Korea. The two allies also agreed to push ahead with their plan to deploy an advanced American missile defense system known as Thaad in South Korea by the end of the year, despite a strong protest from China. Although North Korea has vowed to develop the ability to attack the United States with nuclear warheads and has tested missiles that can reach throughout the Korean Peninsula and its vicinity, it has never tested a   missile that could fly across the Pacific. It remains unclear how close North Korea has come to building a reliable ICBM, although it has boasted of successfully testing crucial technologies in the past year, such as   missile engines and heat shields for an ICBM.'"}, "time": 1742563315.540688}