{"duration": 0.06347775459289551, "input_args": {"text": "'By Adalia Woodbury on Sun, Oct 30th, 2016 at 1:43 pm A Trump supporter sporting a “Hillary for Prison” t-shirt chanted “Jews S-A” in support of his candidate during a rally in Arizona on Saturday. The target was the pen of reporters who have been fodder for Trump’s rhetoric at every rally. Share on Twitter Print This Post \\nA Trump supporter sporting a “Hillary for Prison” t-shirt chanted “Jews S-A” in support of his candidate during a rally in Arizona on Saturday. \\nThe target was the pen of reporters who have been fodder for Trump’s rhetoric at every rally. \\nThe context: While the crowd was chanting “USA” one man chanted “Jews S-A”. Words like that can’t be spun or read into. The intent and meaning were obvious to everyone. \\nWatch here on video obtained by The Huffington Post . \\nThis sort of thing comes as no surprise considering that Donald Trump spent the last year spewing hate filled venom in every possible direction. It may seem superfluous to restate every category of people for which Trump has shown contempt, but it is not. \\nMuslims, Jews, immigrants, labor, taxpayers, Latinos, Hispanics, Mexicans, African-Americans, women, POW’s, veterans, people with disabilities, Gold Star Families, and the military have felt the sting of Trump’s words and the disdain in his heart. \\nThroughout this campaign season, the vitriol against Hillary Clinton saw no limit. Signs and T-shirts too disgusting to quote in this article. Chants of “lock her up” at the Republican convention and since. Trump promised his base of thugs, lowlifes, and haters he would weaken the first amendment, strengthen the second and establish the alt-right utopia. \\nHillary Clinton was already the most qualified candidate in this race. She also proved to have more stamina than any previous candidate needed. Not only was she competing against a vicious and pathological liar, she was competing for who we are and who we could be. For all the Trump claims that the media is rigged in Clinton’s favor, it was Trump who got free advertising, who framed the narrative and whose words were the primary “news” stories of the campaign. \\nThere is no doubt that Hillary Clinton will keep her promise to fight for us. She has been doing it from the beginning of this campaign. Every time Hillary Clinton called out Donald Trump’s sexist comments, she was fighting for all women who were attacked, humiliated and sexually abused by men like Trump. Every time Clinton shamed Trump’s horrific and disgusting comments about the Khan family she was standing up for every Gold Star family. She was also standing up for every Muslim-American. The same is true every time Clinton condemned Trump for mocking a disabled reporter or resorted to alt-right stereotypes about African-Americans, inner-cities, and African-American communities. \\nEvery time Trump spewed hate in whatever direction, Hillary Clinton defended the target. \\nSo no, this isn’t about choosing the lesser of two evils. Like every election, this is about choosing our next president. More importantly, it’s about voting for who we are and who we aspire to be. \\nImage: Screengrab from video.'"}, "time": 1742561800.5124893}