{"duration": 0.07976484298706055, "input_args": {"text": "'We Are Change \\nAccording to the Code of Ethics for Journalism (yes we have one of those):\\n“A journalist should behave in such a way as not to become a victim of a collision of real or hidden interests.\\nHe/she should reject privileges or presents which could influence his/her opinion or create such an impression. They should not take part in activities that endanger his/her professional integrity.The professional status of the journalist is not compatible with occupying a position in state bodies, or in the headquarters of political parties and other political organizations. If work in political parties causes conflict of interests, raises or may raise the question of objectivity of mass media, it is not acceptable. Conflicts of interests damage the prestige of mass media.” \\nThat being said, award winning journalist and The Huffington Post founder Arianna Huffington sought a ‘useful’ role in the Democratic party, and pledged to use HuffPost to ‘Echo [the DNC’s] Message’.\\nThe part-time media tycoon and full-time socialite sought to play a “useful” role within the Democratic Party establishment by using her website to quote “echo” the party message, according to emails published by WikiLeaks.\\n\\nIn an April 2008 email to top Democratic operatives, including Paul Begala, Stan Greenberg, David Brock, and current Hillary Clinton campaign chairman John Podesta, Democratic operative Susan McCue relayed a discussion she had with Huffington about advancing the Democratic cause in an official capacity.\\nHuffington, explained McCue, suggested that she would be more comfortable in a role of covert influence, and “using Huffpo to echo our message.” The media tycoon “has a point,” McCue conceded.\\nBack in October a HuffPo writer by the name of David Seamen went public that HuffPo and Arianna, was editing and censoring his material. https://youtu.be/hIcImy1MKuc Funny thing is that just prior to David going public the DNC held an “Off-the-Record” party for main stream reporters, news anchors, and editors. Guccifer 2.0 provided The Intercept with emails revealing “friendly and highly useful relationships” between the Clinton campaign and the U.S. media. Those emails showed that the Clinton campaign held a private, “off-the-record” dinner with “influential reporters, anchors and editors” No wonder only 6 percent of Americans trust the media. Here is the full list of RSVPs:\\n\\nBack in 2011, Huffington praised Wikileaks, saying: “If I ruled the world, my first goal would be to make it easier to cut through to the facts. At the moment, we are all drowning in spin, smokescreens and lies. Those who perpetrated the two biggest policy disasters of the past ten years—the Iraq war and the financial crisis—could not have pulled their work off without a lack of transparency. So greater transparency would be at the top of my agenda..The internet has already shown great promise in cutting through spin. YouTube, Twitter, email, and turbocharged search engines have made it easier to expose our leaders’ distortions. But if I were in charge, I’d go much further to protect the rights of disclosure and free speech on the internet, and challenge the press—particularly in America—to break its addiction to faux objectivity.”\\nIn the video below Arianna Huffington, founder of The Huffington Post, gets confronted by Luke Rudkowski of WeAreChange about censoring Jesse Ventura’s 9/11 article.\\nhttps://youtu.be/J-5JgDG7HcY The post Arianna Huffington Exposed Colluding With DNC in New WikiLeaks Emails appeared first on We Are Change .\\n'"}, "time": 1742562788.4158666}