{"duration": 0.013916254043579102, "input_args": {"text": "'Get short URL 0 1 0 0 Following the US Navy’s latest provocative patrol near land reclamation projects in the South China Sea, China has ordered nonmilitary to avoid the region as it prepares to launch new military drills. \\nLast week, the US Navy conducted its latest \"freedom of navigation\" exercise near Beijing’s artificial islands in the Paracel chain. The Chinese defense ministry called the move both\"illegal\" and \"provocative.\" Phillipines Deal With China to \\'Ease Tensions in the South China Sea\\' \\nIn response, a statement released by the country’s Maritime Safety Administration indicates that Beijing will conduct military drills near the Paracels throughout the day on Thursday, according to the Japan Times . \\nThe US and its Pacific allies have objected to the construction of the islands, claiming it’s an attempt by Beijing to establish an air defense zone. China has denied these allegations and maintains that it has the right to build within its own territory and that the islands will use primarily for humanitarian purposes. \\nThe South China Sea is a highly-contested region through which roughly $5 trillion in international trade passes annually. Most of it is claimed by China, but there are overlapping claims by Brunei, Taiwan, the Philippines, Vietnam, and Malaysia. © AP Photo/ Bullit Marquez China Sensitive About Appearance of US Containment in Region - Intelligence \\nLast week’s maneuver by the USS Decatur was the fourth of its kind within the last year, as part of the Pentagon’s effort to challenge China’s \"excessive maritime claims.\" It also came amid recent statements from Philippine President Rodrigo Duterte that Manila would move away from its US obligations as part of an effort to increase ties with China and Russia. \\n\"I announce my separation from the United States. Both in military, not maybe social, but economics also,\" Duterte said. \"I’ve realigned myself in your ideological flow and maybe I will also go to Russia to talk to [President Vladimir] Putin and tell him that there are three of us against the world – China, Philippines, and Russia.\" © Flickr/ Naval Surface Warriors Waning Influence: Washington Losing Its Grip and Its Allies in Asia Pacific \\nNew provocations are likely a sign of the US losing its influence in the Pacific. \\n\"Washington has suffered geopolitical setbacks in virtually every nation in Asia Pacific, including those now led by regimes it has meticulously organized, funded, and backed for decades. It is also waning, however, among those nations considered long-time and crucial US allies,\" geopolitical researcher Tony Cartalucci wrote in an article for New Eastern Outlook, pointing out that Thailand is also drawing away from the US. \\n\"What used to be a military dominated by American hardware and military exercises, is transforming with the acquisition of Chinese tanks, European warplanes, Middle Eastern assault rifles, Russian helicopters, and Thai-made armored vehicles.\" ...'"}, "time": 1742628494.1818788}