{"duration": 0.13755154609680176, "input_args": {"text": "'When the anchor Gretchen Carlson filed a bombshell lawsuit accusing the Fox News chairman Roger Ailes of sexual harassment, Fox’s corporate masters moved fast. A major law firm was hired to investigate. Two weeks later, Mr. Ailes was gone, ousted from the network he ran for two decades. Rupert Murdoch stepped in as chairman, sending a clear message: This is a fresh start. But the grim tales about life under Mr. Ailes keep coming. More women have come forward  —   the latest was a former daytime host, Andrea Tantaros  —   describing a culture of intimidation and misogyny, and telling of settlements they received to leave the network. Some of Mr. Ailes’s top deputies who remain in charge at Fox News have been accused of aiding his behavior. Inside the newsroom, employees are still on edge about what new stories might surface and which executives could be ensnared. If the Murdoch family wanted to leap ahead of this scandal, it is now at risk of falling behind. Some people at Fox News are asking if meaningful change can occur inside a workplace still stocked with loyalists to Mr. Ailes. “People are waiting to see,” one staff member said. Leaders at 21st Century Fox, eager to contain the fallout from Mr. Ailes’s departure  —   and keep the profitable news network humming during a   election  —   have remained quiet amid the new accusations. The company is also facing scrutiny over whether it knew, or should have known, about Mr. Ailes’s alleged behavior. “What this has illustrated quite well is, if it wasn’t understood before, there was clearly a corporate control problem with respect to Fox News,” said Brian Wieser, a media industry analyst at Pivotal Research in New York. A spokesman for 21st Century Fox, Nathaniel Brown, said in a statement on Wednesday, “The fact is, we have a robust compliance structure and strong controls embedded across our company. ” In response to questions about the claims of a hostile work environment made by other female employees after Ms. Carlson filed her lawsuit, Mr. Brown said: “We have demonstrated a willingness to act. ” The calculus for Mr. Murdoch and his management team is, to say the least, complex. Officials at 21st Century Fox think that removing Mr. Ailes sent an unequivocal signal  —   to employees and the outside world  —   that the company is taking harassment concerns seriously. They say that lawyers from Paul, Weiss are pursuing an aggressive internal investigation. Investigators so far have been focused on accusations of improper behavior by Mr. Ailes, not by others, according to people briefed on the inquiry. But the people have said the investigation is also looking at others who might have known of that behavior and not acted on it. Several women who have come forward with accusations said that investigators had not contacted them. In an interview, Ms. Tantaros, a former daytime host, said that the former chairman, in    meetings, complimented her figure, asked questions about her dating life and requested a hug, making her uncomfortable. Ms. Tantaros said that Fox News managers dismissed her complaints, then demoted her. Fox News officials denied this, saying that Ms. Tantaros was removed after publishing a book without previous approval, a breach of contract. “The real issue that makes women so fearful and so afraid is what comes next,” she said. “At Fox, you have a company that not only sexually harasses, but is willing to empower its executives and use company resources to carry out ongoing harassment in the form of retaliation. ” Complicating matters for 21st Century Fox, Ms. Tantaros claimed that several Ailes lieutenants ignored her concerns, including the current general counsel, Dianne Brandi, and Bill Shine, a veteran producer who is now overseeing Fox’s newsroom alongside Mr. Murdoch. Ms. Tantaros said in the interview that she complained about Mr. Ailes’s behavior and subsequent retaliation to Mr. Shine, who she said told her, “Don’t fight this. ” Through a spokeswoman, Mr. Shine replied: “Andrea never made any complaints to me about Roger Ailes sexually harassing her. ” Ms. Brandi also disputed Ms. Tantaros’s assertion. Mr. Shine is a popular figure with some of the network’s veteran anchors. Removing Mr. Shine, temporarily or not, could reagitate the newsroom just as the fall presidential campaign begins, with tens of millions of dollars in advertising on the line. Corporate governance and ethics experts say that 21st Century Fox and its board ought to have been aware of problems involving sexual harassment accusations at the network, as well as any payouts related to them. If the parent company was unaware of the settlement, it would indicate “lax oversight,” Lucy P. Marcus, a corporate governance expert, wrote in an email. “If they had been aware of it, they should have investigated it years ago. The board and executive team needs to dig deeper into the culture to root out the cliques and culture that allowed this to carry on for so long. ” Of particular issue is a $3. 15 million settlement that Laurie Luhn, a former booker at the network, said she received in 2011. In an interview with New York magazine, Ms. Luhn said that Mr. Ailes forced her into a yearslong sexual relationship. Executives at 21st Century Fox have said they were only made aware of the settlement recently. On Wednesday, when asked to clarify exactly when it learned of it, the company declined to respond. “One would hope that a $3 million settlement for sexual harassment would flow up the line to somebody in corporate management,” said Kirk O. Hanson, executive director of the Markkula Center for Applied Ethics at Santa Clara University. “At least today, that kind of settlement should come to the attention of the audit committee of the board. ” Mr. Hanson added: “The question is, did they have procedures in place to look at issues like this? And secondly, did they have someone try to report this that was then quashed by Rupert Murdoch or anyone else?” Fox News officials said that Ms. Tantaros reported accusations of sexual harassment  —   and not directed toward Mr. Ailes  —   only after she was informed that she was in breach of contract for publishing a book, featuring a provocative cover, without advance approval. Barry Asen, an outside counsel for Fox News, said in an interview that the network investigated her claims and found them baseless. “We wound up interviewing 12 or 15 people, all of whom denied everything she was alleging,” Mr. Asen said. Ms. Tantaros maintains that she was within the terms of her contract and that the network is using it as an excuse to diminish her complaints about sexual harassment. Fox’s parent, 21st Century Fox, is a global corporation, with $27. 3 billion in revenue and thousands of employees. Some on Wall Street have appeared unbothered by the scandal, which merited little mention on a recent earnings call. “Most investors would just hope that there wasn’t a bigger problem and move on to the next thing,” said Mr. Wieser, the media analyst. The company’s stock closed on Wednesday at $25. 58 a share, down nearly 8 percent since Mr. Ailes’s ouster.'"}, "time": 1742563590.98616}