{"duration": 1.3171579837799072, "input_args": {"text": "'Bill White November 16, 2016 What’s With The Electoral College? \\nOnce again, the Democrats are on one of their favorite hobby horses, that of eliminating the Electoral College. The last time this was an issue was when George W. Bush won the elections in 2000. \\nIn that case, like this one started out to appear, Bush won the electoral vote, without winning the popular vote. But in this case, the early indications have been refuted and Donald Trump won both the popular election and it is presumed that he will win the electoral vote. \\nOf course, Democrats cry “foul” whenever their candidate doesn’t win the presidency. In their world view, they are the majority and there is no possibility of anyone else winning what they are convinced is their rightful seat in the White House. \\nThis is actually somewhat humorous, when you consider how much voter fraud the Democrats propagate every election. They started early this time, stealing the primaries from Bernie Sanders and then went on to create millions of votes of fraud for the general election. \\nBut even with that, Trump still managed to beat out Hillary in the election . \\nAccording to those who want to do away with the Electoral College, the only reason it exists is to disenfranchise voters. But then, they say the same about requiring identification and requiring U.S. citizenship to vote as well. So, that makes it a little hard to buy their story. Even so, the truth is that the Electoral College prevents citizens from being disenfranchised, rather than what they are claiming. \\nOf course, with most people not understanding this truly ingenious mechanism of American politics, it’s easy to sell the idea of the Electoral College disenfranchising people’s vote, as on the surface, it appears that the only vote which counts, is the 538 votes of the Electors. \\nIn fact, the Electoral College does the opposite. Democracy is mob rule. It’s two wolves and a sheep voting on what to eat for lunch. It means that the majority decides and shoves their decision down the throat of everyone else. In doing so, it makes it so that the vote of many people doesn’t count, as the votes of people living in high population centers makes the decisions. \\nCoincidentally, the big cities, where the majority of the population lives, are almost exclusively controlled by Democrats. So, their push for eliminating the Electoral College really isn’t as altruistic as they would want us to believe. In reality, it’s a means for them to gain control and ensure that Democrats win every presidential election. \\nOf course, that’s what Democrats want, as they do better at appealing to the mob than the Republicans do. They want a system that allows them to gain control and keep it, regardless of what they have to do. \\nThey lie, hire violent protesters, co-opt the media and engage in extensive voter fraud, all in the name of partisan politics. Yet all the while, in their minds, they are justified in those actions. \\nThe Electoral College – How It Works And Myths Debunked \\nSo, let’s debunk this idea that the Electoral College is hurting the American people and taking away their right to vote. To begin, we need to understand the Electoral College and how it works. \\nThe first myth that needs to be debunked in this process is that we hold a nationwide presidential election every four years. We don’t. What we hold is 51 consecutive but separate presidential elections; one for every state in the Union and one for the District of Columbia. \\nWhat that election does is decide the votes of the Electoral College. Each state has as many electoral votes as they have members of Congress. So, higher population states, like California and Texas, have more electoral votes; but there aren’t enough electoral votes there to win the presidency; candidates need to win a majority of the electoral votes, which means that they need to win a sizeable number of the other states as well. \\nThe Electoral Votes go to the candidate that won that state. Basically, the party who won state’s presidential election gets to send their electors to Washington, where they will vote for their party’s candidate. \\nAbout the only way that can be corrupted , is for individual electors to be bribed or corrupted and change sides between the time of the several states elections and the vote of the Electoral College. In such a case, they might vote for the opposite party; for which they would be forced to pay a fine. \\nInterestingly enough, Clinton’s backers and quite possibly her campaign staff, are calling for the Electoral College to do just that. As they have with many other things, they want to break the rules and have Republican electors, who come from states that Donald Trump won, vote for Clinton, and they’re willing to pay those electors to do just that. \\nHerein we find the true beauty of the Electoral College system. It forces presidential candidates to pay attention to all the states, as they can’t win the election by concentrating on just the major population areas. If we elected presidents based upon the popular vote alone, the Democrats would start out with a huge advantage, in that their voter base is concentrated in the big cities, which also happen to have the majority of the population. \\nThe top ten cities in the country contain just about half the population. If a candidate could win those ten cities in the popular election, the votes of the rest of the nation wouldn’t matter. Quite literally, the rest of the population would become disenfranchised, as the high-population cities dictated our country’s politics to the rest of the country. \\nWhat is jokingly referred to as “flyover country” would truly become flyover country then, especially for the Democrats. They wouldn’t have any reason to bother campaigning in those states, because they wouldn’t need to. On the other hand, about the only way that a Republican candidate would have a chance of winning the election would be to win all those states, as well as a large number of votes in the high population states. \\nBut it could become even worse than that. Right now, presidents need to take into consideration the needs of the entire country, so that they can get votes from the entire country. If they only needed to concern themselves with the votes of the highest population centers, they could literally take from the “less important” states, in order to give to those that support them. In this, a popular vote helps promote political corruption, rather than doing away with it. \\nIn fact, the Electoral College system is one of the best protections against voter fraud that we have. With it in place, a political candidate or party must rig the vote in a number of states, in order to win each of those elections. \\nOn the other hand, with a popular vote, they could concentrate all their efforts in one place, essentially forcing the voter fraud in that one place to dictate the outcome for the nation. \\nYet, even with the safeguards it offers, many people feel that the Electoral College is a rigged system. As part of that, they believe that the swing states (sometimes referred to as battleground states) decide the election for the rest of us. But, once again, that’s because they don’t understand the system. \\nSwing states are such, not because they are any more important than any other state, but rather because they might swing either way in the election. They aren’t states that either political party can count on for their vote. As such, those states receive a lot of attention by the candidates and a lot of attention in the media, but their vote is no more important than any other state. \\nNew Hampshire is considered a swing state, and as such, it receives a lot of attention. But New Hampshire only has three electoral votes. That makes it one of the least important states in the nation, as far as elections are concerned. It’s on par with Montana, Wyoming, South Dakota and North Dakota; but none of those states receive much attention, as they are strongly Republican states. So the outcome of the vote is all but guaranteed before campaigning even starts. \\nSo, states are only swing states because the population of those states is fairly evenly divided between the two primary political parties. This means that the swing states can change over time, which in fact they do. In fact, California was once a Republican State and Texas was once a Democrat one. \\nWhile we’re debunking here, let me hit on a couple of other arguments that are used against the Electoral College. \\nWe’ve already looked at the false narrative that the swing states have control. One of the biggest of these is that the Electoral College is supposedly obsolete. According to this argument, the Electoral College was created because of the difficulty in getting the vote count to Washington in a timely manner, back in the 1700s. \\nIf that’s the case, then I have to ask how it was easier to get the electors to Washington, than it was to get the news of the vote count to Washington. Obviously, it’s not. It takes the same amount of travel time for several electors carrying their state’s votes to Washington, DC as it takes for an individual or small party to carry that news. \\nOnce again, this is an argument which is counting on people’s ignorance. The implication is made that the electors are a group of people in Washington, rather than traveling to Washington after the state elections. Such a group would disenfranchise voters, exercising complete control over the election. \\nFinally, the idea of one person, one vote, which is the motto of the anti-Electoral College crowd, doesn’t mean one vote per citizen, it means one vote per person. In other words, all 20 million illegal aliens who are currently in the country should be allowed a vote, according to them. \\nOf course, they want that because it gives the Democrats an advantage, just like voter fraud does – the advantage of 20 million more votes, from people who have no right to vote in our elections. \\n  Bill White for Survivopedia. \\nReferences:'"}, "time": 1742563569.487824}