{"duration": 0.10137176513671875, "input_args": {"text": "'Vice President Mike Pence took the argument for the House Republican Leadership’s “American Health Care Act” to Americans on a warehouse floor in Kentucky on Saturday morning, admitting that there would be a “battle” in Washington, D. C. over the bill and that they “need every Republican in Congress” to get it passed. [Pence called Kentucky “a textbook example of Obamacare’s failures” as he spoke to the crowd of about 100 on the floor of a Harshaw Trane warehouse. Kentucky Gov. Matt Bevin introduced Pence, and Pence returned praise for Bevin during his speech that centered around the new healthcare bill.  He made the statement after highlighting health insurance woes from around the country like premiums up 25 percent on average around the country in just 2016. He said millions have lost their insurance and their doctors, and he spoke of   of American counties with only one insurance company available to them, “which essentially means they have no choice at all. ” “The Obamacare nightmare is about to end,” Pence promised the Kentucky crowd on Saturday. “Virtually every promise of Obamacare has been broken. ” The vice president detailed premium increases of an average 24 percent last year in Kentucky. He added that some plans spiked more than 47 percent. Pence continued: Nearly half of the state has only one health insurer to choose from and next year, Humana, headquartered right here in Louisville, is pulling out of Kentucky’s Obamacare exchange. Today, one third of the state is on Medicaid, and as your governor has said over and over again, it’s unsustainable, and Medicaid here is Kentucky is threatening to bankrupt this state. Debate over the bill has come from both conservative Republicans and Democrats. House and Senate conservatives have proclaimed that the leadership’s new bill, released on Monday, does not fully repeal and replace the Obamacare plan that Democrats continue to cling to. Members of the House Freedom Caucus, including Sen. Dr. Rand Paul and others, have introduced their own clean repeal and replace bills. President Donald Trump has welcomed discussions for better solutions as his administration has voiced support for the House Republican Leadership bill. Pence publicly thanked Kentucky Congressman Brett Guthrie, who was in attendance, for his strong support for Obamacare repeal and replace. The vice president said that he knows not every politician supports the plan. Kentucky Congressmen Andy Barr was also in attendance. He pledged that the plan would repeal the taxes and individual and employer mandates and penalties of Obamacare. Conservative members of Congress have criticized the House Leadership plan for provisions that they say create new mandates and penalties. Pence said that the House leadership plan will remove 500 billion dollars of Obamacare tax increases. Pence assured that there would be tax credits to help Americans afford health insurance, that   conditions will still be covered, and American adult children can remain on their parents’ health insurance until they are 26. Each have been lauded as popular aspects of Obamacare. He declared that the states will be given freedom and flexibility with Medicaid. Vice President Pence added, “It’s competition between the states that will give the American people better healthcare choices” and “finally allow Americans to purchase health insurance across state lines the way you buy life insurance, the way you buy car insurance. ” “The way to lower the price of health insurance is to create a national marketplace and give Americans more choices to buy the insurance they want, not the insurance that the government mandates them to have,” said Pence. “This is going to be a battle in Washington, D. C.,” he resolved. “For us to seize this opportunity to  repeal and replace Obamacare once and for all, we need every Republican in Congress, and we’re counting on Kentucky. ” Pence continued: I want to assure the people of Kentucky who might be looking on this morning. We’re going to work with the Congress and work with our agency at Health and Human Services, and we’re going to have an orderly transition to a better healthcare system that makes affordable, high quality health insurance available for every American. We’re going to make the best healthcare system in the world even better. Pence went on to laud the president’s plans to cut taxes for working families and small businesses, roll back regulations, and “rebuild America” to provide the best bridges, highways, and airports we have ever had. He highlighted Trump’s concern for the safety and security of Americans, support for law enforcement, and the military. He reassured that the administration is working with Immigration and Customs Enforcement to get criminal illegal aliens off American streets. The vice president lauded Trump’s choice of Neil Gorsuch to replace the late Antonin Scalia on the Supreme Court of the United States. In the course of the speech, Pence also heralded new jobs numbers that revealed 235, 000 jobs were added in the month of February alone, Trump’s first full month as President of the United States. “This economy is coming back and coming back strong,” said Pence. “We’ve come to a pivotal moment in our nation’s history,” the vice president said as he closed. Pence implored the crowd and all Americans to join in the effort to move the House Republican Leadership plan to repeal and replace Obamacare. “We need every   American to join with us in this effort to Make America Great Again. We need all of you to stand up, speak out, to let your voice be heard. ” “We need you to tell the world that we can do better,” Pence said, referring to health care, a growing economy, and standing tall and strong in the world. “We can restore this country  —   put it back to a path to a brighter future. ” Follow Michelle Moons on Twitter @MichelleDiana.'"}, "time": 1742562955.2440877}