{"duration": 0.045798301696777344, "input_args": {"text": "'A heated social media battle between singer Chris Brown and rapper Soulja Boy will apparently now be settled in a reported $1 million celebrity boxing match. [“It’s going down! ,” Soulja Boy wrote on Instagram announcing the   fight. “Signed my contract I’m leaving the fight with $1, 000, 000. ”  Soulja Boy, whose real name is DeAndre Cortez Way, also said the fight is being promoted by   world champion boxing great Floyd Mayweather Jr. and is being promoting by his Mayweather Promotions.  It’s going down! Signed my contract I’m leaving the fight with $1, 000, 000 I got the best ever my big bro @floydmayweather training me damn😈👊🏾 #TMT #SODMG March in Vegas !! On TV, A photo posted by Soulja Boy (@souljaboy) on Jan 4, 2017 at 9:19pm PST,  Brown confirmed the fight from his Instagram account. “Now that we have your undivided attention. Boxing match set. Legally,” the “Royalty” singer wrote. “We in the ring. Take your bets now. Challenged accepted. Earlier this week, rapper and professional boxing promoter 50 Cent encouraged Soulja Boy to settle his beef with Brown in the ring. “Tell Soulja I said stop apologizing,” 50 Cent wrote on Instagram. “Get the Draco out build up the hype for the fight. ” The New York rapper confirmed the event Wednesday in a   Instagram post. “Mayweather promotions is gonna promote the fight. This is the shut up, or put the money up challenge. ”  We talking money now, BIG MONEY CHAMP said he will take the bet. Mayweather promotions is gonna promote the fight. This is the shut up, or put the money up challenge.  #wherethebagat, A video posted by 50 Cent (@50cent) on Jan 4, 2017 at 4:26pm PST,  Maywheather shared a promotional digital flyer for the fight on Thursday. The graphic says the   fight will to place in March in Las Vegas and will be available on   .   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742563260.38878}