{"duration": 0.08318281173706055, "input_args": {"text": "'SANA, Yemen  —   Large speakers played verses from the Quran as hundreds of mourners filed through the fanciest reception hall in Sana, the capital, to pay their respects to a prominent family after the death of its patriarch. Then there was a roar, the hall shook, and the guests were knocked to the floor and enveloped in fire and smoke. Some rushed for the exits as parts of the ceiling collapsed, trapping others under the rubble. “We did not think they would attack a funeral,” said Abdulla   27, a clothing salesman who was in the hall at the time. “We did not think they would be so vile. ” The attack on Saturday, which Yemeni officials and witnesses said was a series of airstrikes by the military coalition led by Saudi Arabia, killed more than 100 people and unleashed political forces that could drastically change the course of Yemen’s war. “This really might be the watershed,” said April Longley Alley, an analyst with the International Crisis Group who follows events in Yemen. The carnage in the heart of the capital could hamper any return to talks aimed at ending the conflict, while galvanizing support in northern Yemen for military escalation against Saudi Arabia, Ms. Alley said. The United States will conduct “an immediate review” of its support for the   coalition, with possible adjustments “to better align with U. S. principles, values and interests,” according to a statement from Ned Price, the National Security Council spokesman. “U. S. security cooperation with Saudi Arabia is not a blank check,” Mr. Price’s statement said. “Even as we assist Saudi Arabia regarding the defense of their territorial integrity, we have and will continue to express our serious concerns about the conflict in Yemen and how it has been waged. ” Secretary of State John Kerry also spoke by phone on Sunday with top Saudi officials and called for an immediate “cessation of hostilities,” the State Department said in a statement. Mohammed bin Salman, the Saudi deputy crown prince, said his government was prepared to “institute a renewable   cessation as soon as possible, provided the Houthis will agree,” the State Department added. Initially, Saudi Arabia denied that jets from its coalition had been involved in the attack. But in a statement on Sunday, the Saudis announced an investigation into “reports about the regrettable and painful bombing. ” The conflict in Yemen broke out in 2014 when rebels known as the Houthis seized the capital and sent the government into exile. The Houthis are allied with army units loyal to a former president, Ali Abdullah Saleh they have been fighting for control of the country against groups at least nominally loyal to the current president, Abdu Rabbu Mansour Hadi, who is backed by Saudi Arabia and its Persian Gulf allies. In March 2015, the   coalition began a campaign of airstrikes aimed at turning the tide against the   alliance. The campaign has largely failed, while reports of civilian deaths have grown common, and much of the country is on the brink of famine. The airstrikes on Saturday followed a period of escalation since August, when the last round of internationally backed peace talks broke down. Both sides have sought to bolster their positions since then. Over the summer, the Houthis announced the creation of a political council to govern their areas. Mr. Hadi, the exiled president, decreed that he was relocating the country’s central bank from Sana to the southern port city of Aden, where his government has a presence. It is not clear where the bank will obtain funds or how it will function in Aden, and the move could worsen the country’s economic crisis, said Peter Salisbury, who studies Yemen as an associate fellow at Chatham House, a think tank based in London. “The decree has really created a limbo state, where we don’t know what is going to happen, and what you really don’t want in a time of civil war is instability in the banking sector,” Mr. Salisbury said. Diplomats, including Mr. Kerry, have struggled to restart peace talks, a possibility that appeared remote after Saturday’s strikes. Yemeni leaders who supported peace talks were among those killed in the airstrike, along with ordinary civilians. Yousif   who sells insurance, was in the reception hall in Sana when the first strike hit, filling the hall with smoke and causing a stampede. “It was like a movie, when all of a sudden the roof started falling on the gathering,” Mr. Emad, 27, said from his bed in a Sana hospital. When he heard a second strike, he jumped from a window to escape, breaking his leg. Then he hid in a bathroom as a third strike hit. He lost six friends and one cousin in the attack, and he now feels nothing but anger at Saudi Arabia, saying that Yemenis should stage counterattacks along the   frontier. “There is nothing for us to do but to go to the fronts at the border,” he said. “That is the only weapon at our disposal. ” Tamim   a spokesman for the Yemeni Health Ministry, said that hospitals had received at least 114 bodies from the airstrikes and that more than 600 people had been wounded. In a statement on Saturday, the United Nations said more than 140 had been killed in all. Mr. Shami said the higher figure probably included victims who had not been taken to medical facilities. “Some bodies were shredded to pieces, an ear here, a head there,” Mr. Shami said. The dead included many members of prominent tribes from northern Yemen. Ms. Alley, the analyst with the International Crisis Group, said those tribes might now ally with the rebels in new attacks on Saudi Arabia. Also killed were Abdulqader Hilal, the mayor of Sana, and a number of other political and military leaders who not only supported peace talks with the exiled government, but also had the credibility to put an accord into effect. “They killed and injured several important moderate leaders who were working with them, who wanted a deal,” Ms. Alley said of the   coalition. “Now the desire for revenge is high, and militants will be empowered, which puts us in a situation where a compromise might not be possible. ” The attack occurred at a time of growing tension between the United States and Saudi Arabia. Their   alliance has been strained by the United States’ push for a nuclear agreement with Iran, a bitter Saudi enemy, as well as by American policy in Syria. American officials have stepped up public and private criticism of the   air campaign. Several expressed frustration that the campaign continued to inflict grievous harm on civilians despite American warnings and growing international condemnation, and some suggested that the attack on Saturday could be something of a last straw between Washington and Riyadh. One senior American official, who spoke about internal administration deliberations on the condition of anonymity, said that after several private warnings about airstrikes that killed civilians, the latest attack was the most serious so far, and the administration needed to review the situation. The official said there was no evidence that the coalition had deliberately tried to hit civilians rather, the official said, shortcomings in intelligence and targeting procedures were the most likely explanation. The United States has sold billions of dollars’ worth of military hardware and munitions to Saudi Arabia over the years, and a new arms deal worth $1. 15 billion was approved this year, despite efforts by dozens of members of Congress to block it. The United States does not provide the   coalition with targeting information for strikes within Yemen, but it does help Saudi Arabia guard its borders and provides training and refueling for the Saudi Air Force. It is this support that could be curtailed after a policy review. Some analysts argue that the United States should use this leverage to press Saudi Arabia and its allies for changes in how they are fighting in Yemen. “I’m sick at the current situation in Yemen  —   we have to take more responsibility for it,” Thomas C. Krajeski, a former United States ambassador to Yemen, said in an email. “We can put a lot of pressure on the Saudis. It’s time to do it. They have to know that this war is going badly for them, if not on the ground then in the arena of world opinion. ” In Iran, the Islamic Revolutionary Guards Corps strongly condemned the airstrikes, calling them a “U.   joint plot,” the semiofficial Tasnim News Agency reported. In a statement, the Revolutionary Guards predicted that the Houthis would seek revenge and said that Saudi leaders would suffer the same fate as that of “dictators” like the former Iraqi president Saddam Hussein and the former Libyan leader Col. Muammar  . For Ali   a Yemeni journalist who fled the reception hall after the first strike and watched it unfold from nearby, the toll on his community continues to mount. “Every hour that goes by, I learn that someone I knew was either killed or wounded,” he said. “We are getting worse by the hour. That was like our little Hiroshima. ”'"}, "time": 1742628464.8385937}