{"duration": 0.13534116744995117, "input_args": {"text": "'Mass shootings happen in public spaces and private offices. They happen at places of worship and study, work and play. And increasingly, they happen onstage  —   in fictional tragedies and verbatim dramas that explore the psychology of the shooters and the consequences for the affected individuals and communities. The past several years have seen Jessica Dickey’s “The Amish Project” Stephen Karam and PJ Paparelli’s “columbinus” Simon Stephens’s “Punk Rock” Scott Z. Burns’s “The Library” David Greig’s “The Events” Julia Cho’s “Office Hour” Rajendra Ramoon Maharaj, Adam Mace and Christian Lee Branch’s “Mother Emanuel” and a host of    —   each instigated by one or more instances of gun violence. This month brings three new plays inspired by the 2012 events in Newtown, Conn. in which a man opened fire at Sandy Hook Elementary School, killing 26 children and adults before taking his own life. Eric Ulloa’s “26 Pebbles,” presented by the Human Race Theater Company in Dayton, Ohio, is a documentary drama in the style of Tectonic Theater Project’s “The Laramie Project. ” Mr. Ulloa, an actor turned writer, based the play on the more than 60 interviews he did with Newtown residents. By contrast, Martín Zimmerman’s “On the Exhale” and Courtney Baron’s “When It’s You” use the Newtown catastrophe as a stimulus for anguished fictions. Mr. Zimmerman’s play, which opens on Sunday at the Roundabout Underground, is a monologue voiced by a nameless literature professor who finds herself fixated on a weapon used in a mass shooting. Ms. Baron’s piece, a Keen Company production that begins performances on Feb. 28 and is also a solo show, uses a multiple murder to meditate on what we owe to one another. The New York Times spoke to these writers about representing gun violence onstage and their own experiences with firearms. These are edited excerpts from the conversations. What inspired your play? I was tired of my own complacency whenever something horrific happens that I can’t understand, this being a traumatic one because it was   and   old children. I was tired of doing Facebook posts with my personal comments about how angry I am and sending it into the void. I wanted to see if I could offer anything as a writer. Have you ever shot a gun or had experience with gun violence? I was not raised in a gun house. My dad owned a gun because he was a   manager. I’m pretty common sense on gun control: I believe that people have the right to own a personal handgun for safety if they feel the need to. I don’t feel the need to. There’s a good police force out there that will do it for me. How do you as a playwright handle violence onstage?  We use a very theatrical conceit when the moment happens, it’s an actual giant shattering of glass. I promised every person I interviewed that I would never try to make this a piece of sensationalism. I don’t want to see that. We’re dealing with children, and that’s some touchy ground. That’s not the story I’m trying to tell. Do you think your play will register differently in the Trump era?  I would never thank him for anything. But I’ve got to thank him because the climate he’s created in this country has made this piece relevant. I had students on opening weekend saying, “It made me realize that I want to become an activist. ” This    liberal heart was in heaven. What inspired your play? I knew that nothing legislative was going to happen after Sandy Hook it filled me with such boiling rage. I really just couldn’t imagine how furious you would be if you lost a child like that. That was the seed. Also, I’ve been   fascinated with the contradictions over what it means to operate a weapon, that in order to do it effectively you need to be calm, almost meditative. Have you ever shot a gun or had experience with gun violence? I’ve shot a rifle  —   a   rifle at Boy Scout camp. I have never encountered any gun violence personally in Chicago, where I live. But I have read articles about someone living in my neighborhood, driving a route that I drive all the time and seeing someone get shot in the head. How do you as a playwright handle violence onstage?  I have yet to see realistic violence rendered onstage that didn’t take me out of the experience: I’m so aware that what I’m watching is not real. We do ourselves a disservice when we try to make theater a literal space. It’s always way more effective to enlist an audience’s imagination. When you see weapons onstage, your eyes just go to them. It’s troubling, but they’re really fascinating, seductive, complex machines. If we put them onstage, you’re just going to be waiting for that thing to discharge, waiting for that sound. Do you think your play will register differently in the Trump era? I don’t know if this is still true in the age of Trump, but I would say that   gun control was the issue about which I felt the greatest despair. These objects are so seductive it’s almost impossible to control ourselves around them. Once you have access to this really powerful machine that gives you the illusion of power, it becomes really difficult to imagine yourself separated from it. You have to acknowledge that clearly there is some emotional connection going on, some deep fears and deep longings and deep love. What inspired your play? When Sandy Hook happened, my daughter had just turned 7. I think it woke me up. I grew up in a political family and my dad was very, very wrapped up in politics, but I had never taken on anything on my own. The only way I know how to write is the smallest, most microcosmic way. I had attempted to write something more overtly political, more of a polemic, and it didn’t feel true to me. Have you ever shot a gun or had experience with gun violence? I grew up in Dallas. It wasn’t odd to see gun racks in trucks. I shot rifles at summer camp just like everybody else did. Many of the families in the neighborhood I grew up in had guns. We didn’t think, like, “Oh, there are weapons of murder in our homes. ” They were kind of casually for protection. When I was in college, my girlfriend and I were like, “Well, what happens at a gun show?” So we went to one. And it was kind of spectacular. First of all, there was a bar. And there were guns for ladies, which was the craziest thing to me  —   little, pretty guns specifically for ladies. And the ladies were lined up. How do you as a playwright handle violence onstage?  Violence is more about entertainment than it is about the reality of what happens to people. It’s like sex onstage. It doesn’t work. I studied with Romulus Linney at Columbia, and he was always like: “Don’t put a gun onstage. It’s going to be horrible. ” Do you think your play will register differently in the Trump era?  I think it has to do with personal culpability as a member of society. In light of the election, whatever one’s political bent is, we have to take on social responsibility. I don’t think we should carry the bag of guilt in the heaviest way, but we are culpable. You cannot live in a vacuum. So you have to examine what’s important to you and what you can do about it.'"}, "time": 1742562015.3281083}