{"duration": 0.08739757537841797, "input_args": {"text": "'CLAIM: Watching scary movies could help boost your immune system and promote weight loss \\n  Vicki Batts Tags: scary movies , immune system , weight loss (NaturalNews) Who doesn\\'t love a good horror flick, right? There may actually be some health benefits to be found in watching scary movies, too. Experts say that when you watch something frightening, it engages your fight or flight response. This in turn raises the amount of adrenaline pumping through your veins, which can be pretty good for your body.Psychologist Mark Griffiths, a professor of behavioral addiction at Nottingham Trent University, says that there are a number of reasons why people typically seek out fear-inducing films. While the desire to experience something unusual isn\\'t totally health related, Griffiths also commented on the potential healthy release some people may experience. \"Watching such films \\'may also be cathartic, providing an emotional release for pent-up frustrations,\\'\" he told the UK\\'s Daily Mail .But there could be more to it than just that, at least according to some new research. Evidence indicates that the fear you experience while watching a scary movie could help to temporarily bolster your immune system .Scientists from Coventry University took blood samples from a group of test subjects before, during and after they either watched a scary movie or spent time in a quiet room. Their findings, which were published in the journal Stress , revealed that white blood cell counts were increased in those who saw the horror film . Normally, white blood cells respond in this way when there is a sign of infection.According to Natalie Riddell, an immunologist at University College London, this is all part of our evolutionary process, which has been \"geared to promote the survival of the individual.\" Getting scared can engage the \"fight or flight\" response, which in turn, causes the release of adrenaline.The surge of adrenaline then launches the immune system into action – leading to an increased white blood cell count.That\\'s not all adrenaline can do, either. The survival hormone also elevates your heart rate and boosts your metabolic rate – the speed at which your body burns calories. You may think that the number of calories you could burn by watching horror movies is negligible, but studies have shown that you can actually burn a surprising amount of energy just by being scared. That\\'s right, watching horror movies could help support your weight loss efforts.In 2012, researchers from the University of Westminster conducted an experiment to see how many calories volunteers could burn off while watching 10 classic scary films. On average, each film scared the participants into torching about 113 calories – which is equivalent to walking for about 30 minutes. The researchers found that the best horror movie for burning calories was none other than a classic Steven King film. That\\'s right, when people watched The Shining directed by Stanley Kubrick, they burned away a whopping 184 calories.The classic films Jaws and The Exorcist came in second and third place, respectively, for total calorie burning. Dr. Richard Mackenzie, senior lecturer and specialist in cell metabolism and physiology at the university commented that each of the 10 films sent hearts beating and pulses racing. He explained, \"As the pulse quickens and blood pumps around the body faster, the body experiences a surge in adrenaline. It is this release of fast-acting adrenaline, produced during short bursts of intense stress (or in this case, brought on by fear), which is known to lower the appetite, increase the basal metabolic rate and ultimately burn a higher level of calories.\"Overall, calorie burning increased by about one-third while the study participants watched the films. Of course, this doesn\\'t mean that you should watch a movie instead of exercising or eating healthfully . But the next time you sit down to watch a movie, you might want to pick one from the horror genre. Sources:'"}, "time": 1742564432.3993173}