{"duration": 0.07034921646118164, "input_args": {"text": "'Yoshinori Ohsumi, a Japanese cell biologist, was awarded the Nobel Prize in Physiology or Medicine on Monday for his discoveries on how cells recycle their content, a process known as autophagy, a Greek term for “ . ” It is a crucial process. During starvation, cells break down proteins and nonessential components and reuse them for energy. Cells also use autophagy to destroy invading viruses and bacteria, sending them off for recycling. And cells use autophagy to get rid of damaged structures. The process is thought to go awry in cancer, infectious diseases, immunological diseases and neurodegenerative disorders. Disruptions in autophagy are also thought to play a role in aging. But little was known about how autophagy happens, what genes were involved, or its role in disease and normal development until Dr. Ohsumi began studying the process in baker’s yeast. The process he studies is critical for cells to survive and to stay healthy. The autophagy genes and the metabolic pathways he discovered in yeast are used by higher organisms, including humans. And mutations in those genes can cause disease. His work led to a new field and inspired hundreds of researchers around the world to study the process and opened a new area of inquiry. “Without him, the whole field doesn’t exist,” said Seungmin Hwang, an assistant professor in the department of pathology at the University of Chicago. “He set up the field. ” Dr. Ohsumi, who was born in 1945 in Fukuoka, Japan, and received a Ph. D. from the University of Tokyo in 1974, floundered at first, trying to find his way. He started out in chemistry but decided it was too established a field with few opportunities. So he switched to molecular biology. But his Ph. D. thesis was unimpressive, and he could not find a job. His adviser suggested a postdoctoral position at Rockefeller University in New York, where he was to study in vitro fertilization in mice. “I grew very frustrated,” he told the Journal of Cell Biology in 2012. He switched to studying the duplication of DNA in yeast. That work led him to a junior professor position at the University of Tokyo where he picked up a microscope and started peering at sacks in yeast where cell components are degraded  —   work that eventually brought him, at age 43, to the discoveries that the Nobel Assembly recognized on Monday. Dr. Ohsumi later moved to the National Institute for Basic Biology, in Okazaki, and since 2009, he has been a professor at the Tokyo Institute of Technology. “All I can say is, it’s such an honor,” Dr. Ohsumi told reporters at the Tokyo Institute of Technology after learning he had been awarded the Nobel, according to the Japanese broadcaster NHK. “I’d like to tell young people that not all can be successful in science, but it’s important to rise to the challenge. ” “He is a quiet man,” said Dr. Beth Levine, director of autophagy research at the University of Texas Southwestern Medical Center in Dallas. But he also is quietly daring. “Unfortunately, these days, at least in Japan, young scientists want to get a stable job, so they are afraid to take risks,” he told the Journal of Cell Biology. “Most people decide to work on the most popular field because they think that is the easiest way to get a paper published. ” As for himself, he said: “I am not very competitive, so I always look for a new subject to study, even if it is not so popular. If you start from some sort of basic, new observation, you will have plenty to work on. ” Dr. Ohsumi’s Nobel Prize “was inevitable,” Dr. Levine said. Dr. Ohsumi, she said, “is venerated in the autophagy field. ” Autophagy researchers around the world were delighted by the recognition. “This is an exciting day for all of us,” said Dr. Ana Maria Cuervo, an autophagy researcher and   of the Institute for Aging at Albert Einstein College of Medicine in the Bronx. “His work is some of the most elegant you can imagine for the knowledge and the beauty of how cells work. ” Kay F. Macleod, a cancer researcher at the University of Chicago, said, “It is super exciting that autophagy has been recognized in and of itself. ” Even more so, she added, because Dr. Ohsumi’s work was basic research. When Dr. Ohsumi and his colleagues began, she said, “I doubt they for one moment thought that this fundamental process would ultimately be shown to be so important in disease mechanisms and potential therapies. ” Dr. David H. Perlmutter, dean of the School of Medicine at Washington University in St. Louis, said Dr. Ohsumi’s work opened a field that has now exploded, with implications that are “the stuff of science fiction. ” If the autophagy system is knocked out, he said, the result is premature aging, with ailments like cardiovascular disease, skeletal weakness, glucose intolerance and cognitive decline. Now drugs that stimulate this system are being studied. “If you take a drug and stimulate the system, you will make the organism live longer in a   way,” he said. The Japanese prime minister, Shinzo Abe, called Dr. Ohsumi to congratulate him, saying “your research gave light to the people who suffer from serious diseases. ” Speculation had it that the Nobel would go to researchers whose work was instrumental in developing new treatments that unleash the immune system to attack cancer cells. The list is long.   had included James P. Allison at the University of Texas M. D. Anderson Cancer Center Craig B. Thompson of Memorial Sloan Kettering Cancer Center in New York Gordon J. Freeman of   Cancer Institute and Tasuku Honjo of Kyoto University. Another scientist often mentioned as a Nobel contender is Jeffrey Bluestone of the University of California, San Francisco, who works on the immune system in disorders in which it attacks normal cells. William C. Campbell, Satoshi Omura and Tu Youyou were recognized for their use of modern laboratory techniques to discover   drugs long hidden in herbs and soil. Five more will be awarded in the days to come: ■ The Nobel Prize in Physics will be announced on Tuesday in Sweden. Read about last year’s winners, Takaaki Kajita and Arthur B. McDonald. ■ The Nobel Prize in Chemistry will be announced on Wednesday in Sweden. Read about last year’s winners, Tomas Lindahl, Paul L. Modrich and Aziz Sancar. ■ The Nobel Peace Prize will be announced on Friday in Norway. Read about last year’s winners, the National Dialogue Quartet of Tunisia. ■ The Nobel Memorial Prize in Economic Science will be announced on Monday, Oct. 10, in Sweden. Read about last year’s winner, Angus Deaton. ■ The Nobel Prize in Literature will be announced on Thursday, Oct. 13, in Sweden. Read about last year’s winner, Svetlana Alexievich.'"}, "time": 1742628423.1274633}