{"duration": 0.13229060173034668, "input_args": {"text": "'If you ask me, God has a humongous sense of humor. I mean think about it, all of the situations that we find ourselves in that seem to spark introspection and give us a favorable outlook on life. We all find ourselves looking back on things thinking, “I am surely better by experiencing the thing I did not like at the time.” Such was the case this morning when a random song on the music app Pandora left me pondering life, success, and even my connection to a local church.\\nLet me set the scene, one day a week I am away from the office where I spend the morning preparing my schedule, returning phone calls and just overall strategy sessions. I usually have music in the background as it creates an atmosphere conducive to productivity. As I flipped through, I landed on a Hip Hop station that had Kanye West as its first artist. Random, right? However, earlier this week my wife and I spent a day driving and talking about inspirational people.\\nKanye, while egotistical and arrogant, cannot be denied as a music genius and major contributor to current culture. In the realm of fashion, music, and pop artistry, he is a constant mainstream focus. Therefore, we cited how his place in modern history was vital. So here I am listening to his song off the “Life of Pablo” project titled “Waves.” Stay with me, this is where it gets interesting.\\nFive years ago, after relocating to the Hampton Roads area, my wife and I were privileged to find a new church to worship with and share our passion for service to the community. We found a home at Wave Church in Virginia Beach. Since day one, we have been plugged into a vision to touch the world with the compassion of Christ that mirrored our own values. From the senior pastor down, we have created lasting relationships and been challenged to be better people. For that, we are grateful tremendously.\\nSo we go to a church named Wave, I’m sitting here jamming to a song called “Waves” with a lyric that says:\\nWaves don’t die\\nLet me crash here for the moment\\nI don’t need to own it\\nNo lie.\\nThat kept swimming around in my head all morning. Later I had a flashback from a seventh-grade science class – earth science to be exact. If you recall, earth science was all about nature, cool projects, and movies about how the world has evolved. Oceanography was a section I enjoyed. Once a teacher brought in a wave machine that showed how they form and flow until we meet them at the beach’s edge. In fact, out of curiosity, I Googled waves to see what I had forgotten. What I found left me with a beautiful allegory of how success flows into our lives and what we can do to position ourselves to reap its benefits to the fullest.\\nWaves mean there is positive motion present in your life: the ocean’s entire surface is in motion. The waves are just the disturbance of the water surface; waves themselves represent a restoring force to calm the surface. The standard example is the rock-in-the-pond scenario. Many get frustrated or confused in times of motion. Nevertheless, remember motion also represents momentum. In addition, once you get momentum behind you, you can easily be swept into the success you are seeking. Waves do not run from conflict or confrontations: Check this out, as waves approach landmasses, the wave’s base begins to contact the sea floor, and the wave’s profile begins to change. This friction slows the circular orbital motion of the wave’s base, but the top continues at its original speed. In effect, the wave begins leaning forward as it approaches the shore. In other words, waves are willing to crash against anything standing in its way. We cannot allow obstacles to define our level of success. We are built to collide with our destiny! Waves are formed by strong winds. Therefore, waves are comfortable with being uncomfortable: In my opinion, being okay with the process is the number one key to success. What I have learned from years of this journey and many mentors, which includes Pastor Steve Kelly of Wave Church, is that success will be anything but an easy road. Coming from Australia over 17 years ago to a country he had not seen since a child, and to take over a church filled with people he barely knew had to be uncomfortable. Additionally, to grow that church with strong leadership to become an international influence with eight different campuses has left him with wisdom on just what success really costs. What I have learned from him is when you carry a vision, you also have to carry a certain level of restraint in order to fulfill it. Many possess the passion for success but lack the discipline to last the trip to success. Waves exist from the source of chaos. Wind disturbances striking the ocean’s surface forms waves that can have motion for miles. What we get at the beach is the result of what happened out at sea. In the context of success, there will be people who feel the effects of you for miles and miles. Why? Because you made the decision to out-live the struggle and become a wave of success. I think this poem best sums up what we should strive to be.\\nFate whispers to the warrior, “You cannot withstand the storm.” \\nThe Warrior whispers back, “I am the storm.” \\nOpinion By Early Jackson\\n(Edited by Cherese Jackson) \\nSource:\\nAZ Lyrics: Kanye West Lyrics – Wave\\nPhoto Credits:\\nTop Image Courtesy of New Direction Coaching Associates\\nInline Image Courtesy of Theophilos Papadopoulos – Flickr License\\nFeatured Image Courtesy of Andy Tolsma – Flickr License    waves'"}, "time": 1742628393.1819906}