{"duration": 0.06091165542602539, "input_args": {"text": "'MIND-BLOWING LIVE Facebook POLL comments show Trump winning 95%! (90k comments+) … This is PROOF we need if election is rigged. by IWB · October 27, 2016 Tweet \\nAnother Facebook poll showing Trump winning 90% of votes, 90,000 comments — look at these comments, stunning — from all over the country. Unbiased poll… I have yet to see Hillary produce ANY Facebook poll where she wins. \\nThis coincides with the other 500,000 FB comment poll posted on GLP a while back, also showing Trump winning 90% of comments: \\n\\n\\nMinnesota’s 8th District – traditionally Democrat working class \\nThe eighth Congressional District of Minnesota is a working class area in Eastern Minnesota. It has voted for a Democrat in the last four Presidential elections. It has a Democrat Congressman and will likely be the most expensive Congressional race this year. \\nUsually, a Democrat Presidential candidate would win. But a recent poll held a shock: \\nDonald Trump is up 12 points! \\nAnd more: Trump is winning among women. And the Democrat Party is losing members. They’re becoming Independents. \\nWhat The Data Says did this analysis of the Eighth Congressional District of Minnesota: \\n– Trump is beating Hillary by 12 points: “Our poll shows Republican Donald Trump with a 12-point lead over Clinton, 47 percent to 35 percent“ – Trump is winning with women: “leading Clinton 41 percent to 39 percent.” – Dems are crossing over: “the number of Democrats dropped from 34 percent in 2014 to 27 percent in 2016. The number of independents jumped from 31 percent two years ago to 41 percent this year.“ \\nWHY CAN’T HILLARY PRODUCE ANYTHING CLOSE TO A WINNING FACEBOOK COMMENT POLL? \\nAMISH VOTERS Rally for DONALD TRUMP in Pennsylvania (VIDEO) thousands in the rain for Trump rally…incl Amish!Lancaster Co., PA pic.twitter.com/pB7XaMAsV2 \\n— Chris Pontius (@cpFNC) October 1, 2016 AMISH COME OUT FOR TRUMP IN PA. GOD BLESS TRUMP!!! pic.twitter.com/hAAypaL6PV'"}, "time": 1742563116.853477}