{"duration": 0.043395042419433594, "input_args": {"text": "'NEWARK  —   A defense lawyer tried to undermine the credibility of the confessed culprit in the George Washington Bridge lane closings in federal court on Thursday, suggesting that he was a serial schemer and braggart who had hoped to take credit for the scheme  —   but now, as the star witness for the prosecution, could not keep his story straight. In   the lawyer argued that Gov. Chris Christie and top aides in his office  —   not his client, Bill Baroni  —   were the ones calling the shots at the Port Authority of New York and New Jersey, which runs the bridge. The witness, David Wildstein,   as Mr. Christie’s “enforcer” at the Port Authority, conceded that the governor and his office had used the authority as a piggy bank to buy endorsements for his   in 2013, yelling when the money did not come fast enough. But Mr. Wildstein resisted attempts to veer from the prosecution’s charges: that he had conspired with two top Christie aides, Mr. Baroni, the governor’s former top staff appointee at the Port Authority, and Bridget Anne Kelly, a former deputy chief of staff to the governor, to close the lanes for four days in September 2013 to create a traffic jam they knew would punish a mayor who had declined to endorse the governor’s  . Repeatedly, over five hours in court, he replied, “No sir, that’s not correct,” as Michael Baldassare, a lawyer for Mr. Baroni, accused Mr. Wildstein of embellishing or changing his accounts. As the trial of Mr. Baroni and Ms. Kelly moved toward the end of its second week, the testimony again pulled back the curtain on the unseemly politics of New Jersey, particularly under Mr. Christie, a Republican, as he sought endorsements from Democratic mayors to help win a broad   victory in 2013 in the hopes that it could propel his presidential campaign in 2016. In one case, Mr. Wildstein testified, Mr. Christie pushed for the authority to grant $1. 5 million to the pet cause of a state senator the governor’s office was trying to convince not to run for mayor of Jersey City  —   because the governor wanted to clear a path for another Democrat that his administration believed was all but certain to endorse his   bid. In another case, “seven figures,” Mr. Wildstein testified, went to a project sought by a Democratic county executive who not only endorsed the governor, but also brought on board a slate of Democratic mayors to do the same. Prosecutors have said Mr. Baroni and Ms. Kelly were part of the team steering money for endorsements. But Mr. Baldassare pushed Mr. Wildstein, who worked for Mr. Baroni at the authority, to pin responsibility on the governor, who had to approve the money, and Mr. Christie’s chief of staff at the time, Kevin O’Dowd. Asked if he recalled Mr. O’Dowd screaming at Mr. Baroni for not getting the county executive the money fast enough, Mr. Wildstein replied, “Yes, sir, I do. ” “The governor wanted the Port Authority to give that money to the Hudson Urban League so that Sandy Cunningham wouldn’t run against Steven Fulop, right?” Mr. Baldassare asked. “That is my understanding, yes sir,” Mr. Wildstein replied. Mr. Baldassare attempted to discredit Mr. Wildstein by asking him to recount how he had bragged to friends about some of his more colorful political exploits. He stole Senator Frank R. Lautenberg’s suit jacket before a debate, so the senator would be uncomfortable as he debated the candidate Mr. Wildstein was working for. When a local newspaper endorsed a rival candidate, Mr. Wildstein said he went out early in the morning and bought every paper in town so no one would read it. He offered to deliver petitions for a candidate opposing him in a local election, then threw them out so that he could win. And once, in a phone call, Mr. Wildstein said he pretended to be a representative of the actor Alan Alda, to try to convince an adversary that Mr. Alda wanted to run for the United States Senate in New Jersey. Mr. Baldassare argued that Mr. Wildstein had begun the bridge scheme with the hopes of bragging that he had moved the cones to change the lanes. And once he had been caught, he tried to drag in Mr. Baroni and Ms. Kelly. “Sir, I never had the intention of bragging about the cones,” Mr. Wildstein said. Mr. Wildstein began working with prosecutors the week after the scheme to close the lanes became public in January 2014, when a legislative subpoena revealed an email to him from Ms. Kelly a month before the lane closings: “Time for some traffic problems in Fort Lee. ” Mr. Baldassare, the lawyer for Mr. Baroni, argued that Mr. Wildstein’s version of events had changed as he met with prosecutors over the next two years: “Your role as described by you decreased and Mr. Baroni’s increased, correct?” “Sir, I don’t know if that’s correct,” Mr. Wildstein replied. Reviewing a set of emails presented by the prosecution, Mr. Baldassare pushed Mr. Wildstein, unsuccessfully, to say that Mr. Baroni had reason to believe that the lane closings were a traffic study, which prosecutors and Mr. Wildstein said was a  . Mr. Baldassare pushed, saying that there was no documentary evidence to back up some of Mr. Wildstein’s accounts of his conversations with Mr. Baroni and others about the lane closings. “So we have to take your word as to what was said in those conversations, right?” Mr. Baldassare asked. Mr. Wildstein seemed unfazed. “I can’t say you have to do anything,” he replied.'"}, "time": 1742628555.7263272}