{"duration": 1.7695822715759277, "input_args": {"text": "\"Home This Month Popular Is Western Civilization Worth Saving? Is Western Civilization Worth Saving? Beau Albrecht \\nMy father was a high-ranking student radical poobah and still thinks Castro is the bees' knees. Although this makes me technically a red diaper baby, I rejected all that baloney early on. These days, I write stories - mostly comedy science fiction - as well as maintain a blog mainly about dating advice, political commentary, and my writing projects. November 4, 2016 Politics \\nBy 2050, it’s predicted the USA will no longer have a white majority, which in 1960 was 90%. For this, we can thank Ted Kennedy’s Immigration and Nationality Act of 1965, which the politicians swore up and down wouldn’t change the American ethnic composition. In Europe, due to declining native birth rates and mass immigration , this will eventually come to pass for several other nations later this century, all according to the Coudenhove-Kalergi Plan . The leftists, with their really big hearts , think all this will be wonderful. \\nGlobalism and cultural Marxism are the driving forces behind population replacement policies, but unawareness and apathy are almost as much of a problem . Some think that if Western civilization will go down the toilet, they should just “go with the flow” and enjoy the ride all the way down the tubes. Thanks to media propaganda and educational indoctrination, they have no idea that their own civilization is worth anything, and don’t have the slightest concern for their own posterity. Still, they’re pretty naive to believe that things can’t turn far worse within their own lifetimes. Why this is bad (for those who need reminding) In the future, is this going to get better, or worse? \\nIf trends continue unabated, the founding peoples will lose control over their destiny. History shows that when this happens, the results are not good. Pillaging and plundering is a more genteel affair in modern times (though not always ) but you’re still not going to like it. Will your new rulers say, “Since things have changed so much, how about we abolish Affirmative Action and set-asides to show we’ve transcended race?” Don’t count on it. More likely, they’ll double down on these preferential treatment programs, and come up with new ones, and you will have no chance to block the spoils systems. \\nThat’s just the beginning, too. The “ diversification ” of cities for the last several decades has been bad—Detroit, need I say more?—and riots really are getting out of hand. Now imagine what it will be like when you have no hope of influencing things like Section 8 housing moving into your neighborhood, or if you’ll get any real police protection. \\nThis is what we’re facing if the Aztlán crowd takes over the Southwest, the community agitators get in charge of the big cities, and together their constituency has an electoral majority controlling the Federal government. (Also remember that they’ve been told since the 1960s that you’re evil oppressors responsible for all their problems.) Parts of “flyover country” might be able to hold out for a while, but nothing short of forming their own country will stop the advance of “progress”. If it were ever to come to secession, they’ll be surrounded, outnumbered, and outgunned. Let’s keep things from getting to that point. Is there any hope? “Refugees” have taken on the characteristics of invaders \\nI’ve painted a grim picture, but I have to be realistic. As for what will happen later, things only look worse; Jean Raspail’s Camp Of The Saints describes a bleak future like that. This isn’t just the USA on the line, but Western Europe too, and perhaps Eastern Europe and Australia in time. If we want to keep from disappearing into the endless night, the time to act is now. \\nSometimes, with luck, sovereignty can be regained: for example, the Spanish Reconquista, or the nations of the Balkans rising after a few centuries under the Turkish yoke. However, the results aren’t guaranteed; some nations may never recover. In these examples, the “dhimmis” were subjugated under military occupation, but they were not outnumbered in their own lands. The founding populations must not allow themselves to be dispossessed in their own countries in the first place. \\nGranted, the dark forces of globalism are very powerful—and they’d like us to think they’re invincible—but they must be stopped. They also want you to think they’re smarter than you and know what’s good for you . (If they’d simply focus on getting richer, and cease their social engineering, they’d have far less to answer for.) Not only has our political establishment failed us, they’re working against the public . It won’t be easy, but we must reassert control over our destiny. Do we deserve to be dispossessed? Brainwashed SJWs welcoming their own destruction \\nSome will even say—often with haughty condescension—that if we lose our countries, then we deserve this fate. Ignoring for a moment the sheer snottiness, as well as the “might makes right” argument incongruent with the usual rhetoric of fairness by the “prepare to be assimilated, resistance is futile” crowd, let’s consider the following facts: In the 1920s, a Communist propaganda campaign was launched in the Western world. In the 1930s, this mutated into cultural Marxism and kicked into high gear during the 1960s. Most people have no idea of the scope of it all, or where things like political correctness came from. Only senior citizens remember what it was like living in a fairly normal country. Even fewer never grew up exposed to this propaganda in one form or another. The rest of us have been indoctrinated from an early age by the mass media and educational establishment. The Western political tradition lately is about openness and democracy. For this reason, we don’t conduct political change by torches and pitchforks these days. We play fair, even if our enemies often don’t . Further, political correctness encourages the “disadvantaged” to have solidarity, but vilifies the same in the majority. This is one reason why we’re on the defensive, and (for now) usually losing. Most people only have a vague idea about the extent of managed democracy and sheer corruption. Those against population replacement policies mostly put their faith in the mainstream opposition parties, not realizing that they’ve sold out to deep-pockets globalists too. “Mainstream” conservatism is a controlled opposition , providing token resistance at best. \\nSo with that extent of treachery, disinformation, limited options for resistance, and managed democracy, it’s grotesquely dishonest for the defeatists to tell us that we’re losing a fair fight! As for their opinion that we should just give up, I have one word: No. \\nWhenever you hear the defeatists crowing that this is inevitable or that we “deserve” it, remember that they want to demoralize you and anyone else listening. (The same goes for when they tell you that loving your people and wanting your posterity to survive is “hatred”.) Suppose someone is losing his home by a devious swindle, orchestrated by crooks widely lauded for their fairness, caring, and honesty. It would be the height of arrogance to tell the defrauded that he deserved it and should shut up about it and let it happen. The depopulation and population replacement agenda “First, the EU has to accept at least a million asylum-seekers annually for the foreseeable future… The EU should provide 15,000 euros ($16,800) per asylum-seeker for each of the first two years to help cover housing, health-care and education costs—and to make accepting refugees more appealing to member states.” \\nDon’t be fooled: this isn’t happening because some vague, invisible force called “progress” is pushing things inevitably in this direction. No, it’s being actively promoted by globalist interests that have adopted cultural Marxism as a means of control. \\nWhy are native fertility rates declining below replacement level? The major factors are: Women are encouraged to spend their 20s partying and their 30s trying to get rich in a cube farm. Encouraging them to to make starting a family last priority often leaves them very unhappy over the long term, and many will miss the chance to begin. Good economy tends to be positively correlated with higher fertility rates. During recessions, births go down. The implications are obvious. If less tax money was taken from working citizens for costly social services programs and spit-in-your-eye wars, then they’d be able to afford more children. Sending the guilty to prison (instead of bailing them out) when they crash the economy might be a good indirect measure too. About a third of American babies conceived end up aborted . (Thanks, feminism!) The same leftists who think this is wonderful will scream bloody murder whenever a savage killer on Death Row is executed, but all that’s another matter. \\nBecause of declining fertility rates, the globalists tell us that we must open the floodgates of Third World immigration to prop up the population and support the aging citizens. So they’ve fed us poison, and to soothe the symptoms, they want to feed us another kind of poison. To hell with that! \\nGranted, keeping Social Security going in the USA will be a challenge. Still, it’s pretty uncertain that newly-arriving immigrants—if they become the majority—will be able or willing to support millions of elderly “gringos”. As for future European retirees, will they be well cared for by “refugees” from Africa and the Middle East? The way things are now, many of them prefer rioting , looting, and collecting welfare over working. So these are going to be the people propping up the European retirement programs? \\nDispossession is inevitable only if we let it happen. For now, we must educate the rest of the public about what’s going on, and convince them that their future is worth saving and their posterity is worth preserving. Once we’ve achieved critical mass, we can confront the political establishment and get the government to start working for us rather than against us What’s in it for us? Whenever someone writes that Western civilization is nothing but injustice and oppression, they’re using technology we invented to complain about us. \\nIt’s fashionable—especially in academia—to bash Western civilization. We’re not perfect, but nobody else is either. The truth is that we’re a creative, dynamic, and industrious people. Some of us are under the impression that we don’t have any culture (only other people do) but that’s mistaken. I could spend all day listing our major artists, composers, poets, philosophers, writers, theologians, and the like, but I only would scratch the surface. \\nOther cultures have made notable contributions—particularly East Asia and the Middle East—but the fact is that the majority of science and technology that makes life comfortable today originated in the Western world. Electricity, motorized transportation, refrigeration, telecommunications, computers (need I go on)? Yep, that was us. We shared our medical advances with the rest of the world, increasing longevity and quality of life around the globe. Whether the world’s future looks more like Star Trek or more like Blade Runner may have a lot to do with whether or not our people survive. \\nFinally, most of us are going to live out our lives in our native countries. Do we want them to stay the same nations we grew up in? Some time in the future, today’s youth will be running the show while we’re elderly. What kind of a place do we want it to be by then? Western civilization is great; let’s keep it going.\""}, "time": 1742564176.7532778}