{"duration": 0.02697896957397461, "input_args": {"text": "'German magazine Der Spiegel has begun a series of articles entitled “The New Arrivals” claiming in one piece that mass migration can revive declining birth rates in small Spanish towns. [The German publication told the story of a Moroccan migrant from Tangier named Said al Ghoury who moved with his family to the small Spanish town of Visiedo with his family and claims he “rescued” the village from demographic decline.  Since 1998 the number of immigrants flowing into Spain has increased ten times and in the last year alone the figure increased by 12. 2 percent. In real numbers around 4. 6 million people, many from North Africa, have flooded into Spain. The small village of Visiedo is located in the province of Teruel which has experienced a decline in its Spanish population from 136, 000 in 1998 to 123, 000 today and around 14, 000 migrants have moved to the area. Rosario Sampedro, a migration sociologist at the University of Valladolid said in some rural regions of the country the, “population was rejuvenated,” by mass migration but added, “the situation is still tense in the remote areas. ” In Teruel, the population is already ageing with   of the population being over the age of 60. Vicente Gonzalvo of the “New Ways” program actively promotes the idea of sending migrants to these small villages where they would replace the ageing native Spanish. “We want to revive the dying villages,” he said adding, “The native Spaniards in the countryside must realise that they too will benefit when their communities gain new inhabitants. ” Hassan Bellahmama is another Moroccan who moved to a small town in Spain, choosing to become a shepherd in the town of Alfambra. “There are only a few Spaniards who want to do this job. Most cattle farmers in the province employ foreigners,” said Pedro José Escusa who employs Bellahmama. In Germany, experts have said that sending migrants into rural communities would not just help the dwindling populations, but would also act as an “integration laboratory” as well. Wolfgang Borst, major of the Bavarian village of Hofheim sees mass migration as an “opportunity” saying, “We are very satisfied. We are gaining a lot more villagers. ” Others like Klaus Poelitz say the main problem is the “prejudice” of the locals in rural communities. The migrant crisis hasn’t been all positive for many small towns as some have been driven into enormous amounts of debt to provide food and shelter for migrants. Some residents have reacted strongly against proposals to house large amounts of migrants in their communities. When Joachim Kebschull, the    mayor of Oersdorf planned to welcome migrants into the town of only 900 several locals beat him unconscious before a meeting of the town’s urban planning committee. In France,   migration mayor of Béziers Robert Ménard was fined 1, 800 euros for mentioning the changing demographics of his town. Ménard mentioned the theory of the “great replacement” coined by prolific French author Renaud Camus who said that mass migration will lead to the cultural and demographic transformation of European societies.'"}, "time": 1742628457.710108}