{"duration": 0.043082475662231445, "input_args": {"text": "'By Paul Craig Roberts on November 3, 2016 Hillary’s crimes might cost her the election, but she won’t go to jail. \\nby Dr. Paul Craig Roberts The Federal Bureau of Investigation is reviewing another slew of emails related to Hillary Clinton’s private server. \\nAren’t you surprised that Hillary and the presstitutes haven’t blamed Putin for FBI director Comey’s reopening of the Hillary email case? But the presstitutes have done the next best thing for Hillary. They have made Comey the issue, not Hillary. \\nAccording to US Senator Harry Reid and the presstitutes, we don’t need to worry about Hillary’s crimes. After all, she is only a political woman feathering her nest, just as political men have done for ages. Why all this misogynist talk about Hillary? \\nThe presstitutes’ cry is that Comey’s alleged crime is far more important. This woman-hating Republican violated the Hatch Act by telling Congress that the investigation he said was closed is now reopened. A very strange interpretation of the Hatch Act. During an election it is OK to announce that a candidate for president is cleared but it is not OK to say that a candidate is under investigation. \\nIn July 2016 Comey violated the Hatch Act when he, on orders from the corrupt Obama Attorney General, announced Hillary clean. In so doing, Comey used the prestige of federal clearance of Hillary’s violation of national security protocols to boost her standing in the election polls. \\nActually, Hillary’s standing in the polls is based on the pollsters over-weighting Hillary supporters in the polls. It is easy to produce a favorite if you overweight their supporters in the poll questions. If you look at the crowds attending the two candidate’s public appearances, it is clear that the American people prefer Donald Trump, who is opposed to war with Russia and China. War with nuclear powers is the big issue of the election. \\nHillary’s problem has the ruling American Oligarchy, for which Hillary is the total servant, concerned. \\nWhat are they going to do about Trump if he wins? Will his fate be the same as John F. Kennedy, Robert Kennedy, Martin Luther King, George Wallace? Time will tell. Or will a hotel maid appear at the last minute in the way that the Oligarchy got rid of Dominique Strauss-Kahn? Dominique Strauss Kahn indicted by Grand Jury and out on six million dollar bailout, but could he have been set up? \\nAll of the American and Western feminists, progressives, and left-wing remnant fell for the obvious frame-up of Strauss-Kahn. After Strauss-Kahn was blocked from the presidency of France and resigned as Director of the IMF, the New York authorities had to drop all charges against Strauss-Kahn. But Washington succeeded in removing Strauss-Kahn as a challenge to its French vassal, Sarkozy. \\nThis is how the American Oligarchy destroys those it suspects might not serve its interests. The corrupt self-serving Oligarchy makes sure that it owns the government and the media, the think tanks and increasingly all of the major universities, and, of course, through the presstitutes, Americans’ minds. \\nThe Oligarchs are now hard-pressed to rescue Hillary as US president, so let’s see if the Oligarchs can once again deceive the American people. \\nWhile we wait, let’s concern ourselves with another important issue. The Clinton crime syndicate in the closing years of the 20th century allowed a small handful of mega-corporations to consolidate the US media in a few hands. This vast increase in the power of the Oligarchy was accomplished despite US anti-trust law. The media mergers destroyed the American tradition of a dispersed and independent media. \\nBut really, what does federal law mean to the One Percent. Nothing whatsoever. The One Percent’s power makes them immune to law. Hillary’s crimes might cost her the election, but she won’t go to jail. \\nNot content with 90% control of the US media, the Oligarchy wants more concentration and more control. Looks like they will be getting it, thanks to the corrupt US government. The Federal Trade Commission is supposed to enforce US anti-trust law. Instead, the federal agency routinely violates US anti-trust law by permitting monopoly concentrations of business interests. \\nBecause of the failure of the federal government to enforce federal law, we now have “banks too big to fail,” unregulated Internet monopoly, and the evisceration of a dispersed and independent media. \\nNot so long ago there was a field of economics known as anti-trust. Ph.D. candidates specialized in and wrote dissertations about public control of monopoly power. I assume that this field of economics, like the America of my youth, no longer exists. \\nIn the article below, Rahul Manchanda, explains that “yet again another huge media conglomerate is being swallowed and acquired by another huge media conglomerate, to create another gargantuan media outlet, in another consolidation of the enormous power, money, wealth, intimidation, conspiracy and control” that eviscerates the US Constitution and the First Amendment.'"}, "time": 1742628595.8385315}