{"duration": 0.13641810417175293, "input_args": {"text": "' Saudi Arabia \\x91Deliberately Targeting Impoverished Yemen\\x92s Farms\\nIncreasing evidence suggests Kingdom is not merely bombing civilians in neighbouring country, but systematically targeting infrastructure survivors will need to avoid starvation when the war is over\\nBy Robert Fisk \" The Independent \" - The Yemen war uniquely combines tragedy, hypocrisy and farce. First come the casualties: around 10,000, almost 4,000 of them civilians. Then come those anonymous British and American advisers who seem quite content to go on \\x93helping\\x94 the Saudi onslaughts on funerals, markets and other obviously (to the Brits, I suppose) military targets.\\nThen come the Saudi costs: more than $250m (Ł200m) a month, according to Standard Chartered Bank \\x96 and this for a country that cannot pay its debts to construction companies. But now comes the dark comedy bit: the Saudis have included in their bombing targets cows, farms and sorghum \\x96 which can be used for bread or animal fodder \\x96 as well as numerous agricultural facilities.\\nIn fact, there is substantial evidence emerging that the Saudis and their \\x93coalition\\x94 allies \\x96 and, I suppose, those horrid British \\x93advisers\\x94 \\x96 are deliberately targeting Yemen\\x92s tiny agricultural sector in a campaign which, if successful, would lead a post-war Yemeni nation not just into starvation but total reliance on food imports for survival. Much of this would no doubt come from the Gulf states which are currently bombing the poor country to bits.\\nMundy points out that a conservative report from the ministry of agriculture and irrigation in the Yemeni capital Sana\\x92a, gathered from its officers across the country , details 357 bombing targets in the country\\x92s 20 provinces, including farms, animals, water infrastructure, food stores, agricultural banks, markets and food trucks.\\nThese include the destruction of farms in Yasnim, the Baqim district of Saadah province and in Marran. Mundy has compared these attacks with figures in the Yemen Data Project, which was published some weeks ago. Her verdict is a most unhappy one.\\n\\x93According to the Food and Agriculture Organisation, 2.8 per cent of Yemen\\x92s land is cultivated,\\x94 Mundy says. \\x93To hit that small amount of agricultural land, you have to target it.\\x94 Saudi Arabia has already been accused of war crimes, but striking at the agriculture fields and food products of Yemen in so crude a way adds merely another grim broken promise by the Saudis.\\nThe kingdom signed up to the additional protocol of the August 1949 Geneva Conventions which specifically states that \\x93it is prohibited to attack, destroy, remove or render useless objects indispensable to the survival of the civilian population, such as foodstuffs, agricultural areas for the production of foodstuffs, crops, livestock for the specific purpose of denying them for their sustenance value to the civilian population whatever the motive \\x94\\nThe fact that Yemen has long been part of Saudi Arabia\\x92s proxy war against Shiites and especially Iran \\x96 which has been accused, without evidence, of furnishing weapons to the Shia Houthi in Yemen \\x96 is now meekly accepted as part of the Middle East\\x92s current sectarian \\x93narrative\\x94 (like the \\x93good\\x94 rebels in eastern Aleppo and the \\x93very bad\\x94 rebels in Mosul). So, alas, have the outrageous bombings of civilians. But agricultural targets are something altogether different.\\nAcademics have been amassing data from Yemen which strongly suggests that the Saudis\\x92 Yemen campaign contains a programme for the destruction of rural livelihood.\\nMartha Mundy, emeritus professor at the London School of Economics, who is currently working in Lebanon with her colleague Cynthia Gharios, has been researching through Yemeni agriculture ministry statistics and says that the data \\x93is beginning to show that in some regions, the Saudis are deliberately striking at agricultural infrastructure in order to destroy the civil society\\x94.\\nIn a lecture in Beirut, Mundy has outlined the grievous consequences of earlier economic policies in Yemen \\x96 cheap American wheat from the 1970s and the influx of food from other countries which discouraged farmers from maintaining rural life (terracing of farms, for example, or water husbandry) \\x96 and the effect of Saudi Arabia\\x92s war on the land. \\x93The armies and above all air forces of the \\x91oil-dollar\\x92,\\x94 she said, have \\x93 come to destroy physically those products of Yemeni labour working with land and animals that survived the earlier economic devastation.\\x94\\nThere are photographs aplenty of destroyed farms, factories and dead animals lying in fields strewn with munitions \\x96 effectively preventing farmers returning to work for many months or years. Poultry and beehive farms have been destroyed.\\nEven today, more than half the population of Yemen relies in part \\x96 or wholly \\x96 on agriculture and rural husbandry. Mundy\\x92s research through the files of other ministries suggests that technical support administration buildings for agriculture were also attacked. The major Tihama Development Authority on the Red Sea coastal plain, which was established in the 1970s \\x96 and houses, as Mundy says, \\x93the written memory of years of \\x91development\\x92 interventions\\x94 \\x96 is responsible for a series of irrigation structures. It has been heavily bombed twice.\\nBut I guess that one war \\x96 or two \\x96 in the Middle East is as much as the world can take right now. Or as much as the media are prepared to advertise. Aleppo and Mosul are quite enough. Yemen is too much. And Libya. And \\x93Palestine\\x94\\nA picture and its story: Severe malnutrition in Yemen\\nBy Abduljabbar Zeyad | HODAIDA, Yemen\\n \" Reuters \" - The emaciated frame of 18-year-old Saida Ahmad Baghili lies on a hospital bed in the red sea port city of Hodaida, her suffering stark evidence of the malnutrition spread by Yemen\\'s 19-month civil war.\\nBaghili arrived at the Al Thawra hospital on Saturday. She is bed-ridden and unable to eat, surviving on a diet of juice, milk and tea, medical staff and a relative said.\\n\"The problem is malnutrition due to (her) financial situation and the current (war) situation at this time,\" Asma Al Bhaiji, a nurse at the hospital, told Reuters on Tuesday.\\nThe 18-year-old is one of more than 14 million people, over half of Yemen\\x92s population, who are short of food, with much of the country on the brink of famine, according to the United Nations.\\nHer picture is a reminder of the humanitarian crisis in the Arabian Peninsula\\'s poorest country where at least 10,000 people have been killed in fighting between Saudi-led Arab coalition and the Iran-allied Houthi movement.\\nBaghili is from the small village of Shajn, about 100 km (60 miles) southwest of the city of Hodaida, and used to work with sheep before developing signs of malnutrition five years ago, according to her aunt, Saida Ali Baghili.\\n\"She was fine. She was in good health. There was nothing wrong with her. And then she got sick,\" Ali Baghili told Reuters.\\n\"She has been sick for five years. She can\\x92t eat. She says her throat hurts.\"\\nAfter the war began, Baghili\\'s condition deteriorated with her family lacking the money for treatment.\\nShe lost more weight and in the last two months developed diarrhoea.\\n\"Her father couldn\\x92t (afford to) send her anywhere (for treatment) but some charitable people helped out,\\x94 Ali Baghili said, without elaborating who the donors were.\\n(Writing by Patrick Johnston in LONDON Editing by Alison Williams)'"}, "time": 1742564411.5968938}