{"duration": 0.10590028762817383, "input_args": {"text": "'Most College Students Think America Invented Slavery, Professor Finds Kate Hardiman, College Fix, October 31, 2016 \\nFor 11 years, Professor Duke Pesta gave quizzes to his students at the beginning of the school year to test their knowledge on basic facts about American history and Western culture. \\nThe most surprising result from his 11-year experiment? Students’ overwhelming belief that slavery began in the United States and was almost exclusively an American phenomenon, he said. \\n“Most of my students could not tell me anything meaningful about slavery outside of America,” Pesta told The College Fix . “They are convinced that slavery was an American problem that more or less ended with the Civil War, and they are very fuzzy about the history of slavery prior to the Colonial era. Their entire education about slavery was confined to America.” \\nPesta , currently an associate professor of English at the University of Wisconsin Oshkosh, has taught the gamut of Western literature–from the Classics to the modern–at seven different universities, ranging from large research institutions to small liberal arts colleges to branch campuses. He said he has given the quizzes to students at Purdue University, University of Tennessee Martin, Ursinus College, Oklahoma State University, and University of Wisconsin Oshkosh. \\n{snip} \\nBefore even distributing the syllabus for his courses, Pesta administered his short quizzes with basic questions about American history, economics and Western culture. For instance, the questions asked students to circle which of three historical figures was a president of the United States, or to name three slave-holding countries over the last 2,000 years, or define “capitalism” and “socialism” in one sentence each. \\nOften, more students connected Thomas Jefferson to slavery than could identify him as president, according to Pesta. On one quiz, 29 out of 32 students responding knew that Jefferson owned slaves, but only three out of the 32 correctly identified him as president. Interestingly, more students–six of 32–actually believed Ben Franklin had been president. \\n{snip} \\nWhat’s more, he began to observe a shift in his students’ quiz responses in the early 2000s. Before that time, Pesta described his students as “often historically ignorant, but not politicized.” Since the early 2000s, Pesta has found that “many students come to college preprogrammed in certain ways.” \\n“They cannot tell you many historical facts or relate anything meaningful about historical biographies, but they are, however, stridently vocal about the corrupt nature of the Republic, about the wickedness of the founding fathers, and about the evils of free markets,” Pesta said. “Most alarmingly, they know nothing about the fraught history of Marxist ideology and communist governments over the last century, but often reductively define socialism as ‘fairness.’” \\nPesta also noted that, early on, his students’ “blissful ignorance was accompanied by a basic humility about what they did not know.” But over time he said he increasingly saw “a sense of moral superiority in not knowing anything about our ‘racist and sexist’ history and our ‘biased’ institutions.” \\n“As we now see on campus,” Pesta said, “social justice warriors are arguing that even reading the great books of Western culture is at best a micro-aggression, and at worst an insidious form of cultural imperialism and indoctrination.” \\n{snip}'"}, "time": 1742563727.5901473}