{"duration": 0.20817303657531738, "input_args": {"text": "'Mary McCormack Hughes has a vivid recollection of the phone call she got 35 years ago this week from Robert Durst, her   . “Have you seen Kathie?” he asked. Kathie was Kathleen Durst, Ms. Hughes’s younger sister, who at 29 was in the final months of medical school. Her marriage to Mr. Durst, the eccentric scion of a prominent New York real estate family, had splintered under Mr. Durst’s efforts to control her, repeated rounds of quarreling and, finally, violence. No, Ms. Hughes, said she had responded, but I’ve been meaning to talk to you about Kathie. Mr. Durst cut her off, saying he was going to the police, and abruptly ended the call, she said. Ms. Hughes remembers that as she hung up the phone in her East Side apartment that February evening in 1982, she turned to her husband, Tom Hughes, and said, “I think he killed her. ” Today, Mr. Durst, 73, sits in Los Angeles County Jail awaiting trial on a charge of murder  —   not of Kathie, but of Susan Berman, a confidante who, investigators say, knew his secrets and shielded him from newspaper reporters after his wife vanished. John Lewin, a deputy district attorney in Los Angeles, claims that Mr. Durst shot Ms. Berman in the back of her head at her Los Angeles home in December 2000, fearing that she would cooperate with a newly revived investigation into Ms. Durst’s disappearance. Mr. Durst was never charged with his wife’s killing, nor was anyone else. (Ms. Durst’s body has never been recovered.) He and his battery of lawyers have insisted that he did not kill Ms. Berman and does not know what happened to his first wife. Ms. Hughes has not paid much attention to events in Los Angeles. “I think it’s going to be a disaster,” she said, with bitterness, of the coming trial during her first interview in more than three decades, at an Upper East Side apartment building where her sister once lived with Mr. Durst. A large photograph of Kathie Durst dressed in an Annie   dress and a   hat from the Wild West hung over the fireplace. “Hollywood and publicity,” Ms. Hughes said. “They’re not really interested in my sister  —   they’re interested in Bob. I just want to find out what happened to my sister. ” The obsession nearly destroyed her. Kathie was the youngest daughter and the fifth child of a telephone company representative, who died in 1966, and a working mother. After graduating from high school in New Hyde Park on Long Island, Kathie trained as a dental hygienist and moved to a building owned by the Durst family on the East Side of Manhattan. Mr. Durst oversaw the building and when the two met, there was an instant attraction. “It was a mutual attraction, a chemistry,” Ms. Hughes recalled. “He had a magnetism. Kathie had the same thing. ” The Hugheses liked Mr. Durst when he started dating Kathie, then 19, in early 1971. He was nine years older and from another world. His father, Seymour Durst, presided over a Manhattan real estate company whose towers formed the skyline. The Dursts were low key, not the stereotypical    developers. For a while, Ms. Hughes said, her sister was unaware just how wealthy the Durst family was. After their second date, Mr. Durst asked Kathie to move with him to Vermont to run a health food store. But after a short time in Vermont, the couple returned to New York, and Mr. Durst resumed working at the family real estate business. They were married in a private ceremony on his birthday, April 12, in 1973. The couple partied at Studio 54, the   disco that was a haunt for celebrities and others. They sailed on the Mediterranean Sea and traveled to Thailand. Bob and Kathie socialized with Mary and Tom, even buying a racehorse together from a friend who was a breeder. “He heard it was a tax deduction,” Tom Hughes said. “I think he liked that part of it. ” But the Dursts’ relationship took a dark turn after 1976, when Mr. Durst forced his wife to have an abortion. He didn’t want children she did. “That’s when it went south,” Mr. Hughes said. Ms. Durst sought independence, enrolling in nursing school in Danbury, Conn. The couple bought a cottage nearby, on Lake Truesdale in South Salem, N. Y. in northern Westchester County, but also had a   on Riverside Drive in Manhattan and rented an apartment on the East Side. After graduating from nursing school, Ms. Durst immediately started medical school at Albert Einstein College of Medicine in the Bronx, hoping to become a pediatrician. “She was excited to be a medical student,” recalled a classmate, Dr. Alicia  . “She worked hard. She always took a seat in the front row and took notes. ” By 1980, the couple quarreled frequently, Ms. Hughes said, adding that her sister often called her with accounts of their latest fight. Ms. Durst contacted a divorce lawyer. She gathered damaging material about her husband and the Durst family, she told friends and her sister. Mr. Durst has long acknowledged his marijuana use, and his wife used cocaine, according to friends and members of her family. Both had affairs, his and her friends and relatives say. Mr. Durst, they say, cut off her credit cards to keep her close. “Bob’s possessiveness was escalating into physical violence,” said a nursing school classmate of Ms. Durst’s, Eleanor Joy Schwank, during an interview in 2000. “I never witnessed it, but Kathie would call me saying, ‘Bobby is really violent. ’” Mr. Durst, impatient to leave a McCormack family gathering, yanked his wife’s hair, shocking her family, Ms. Hughes said. On another occasion, he stormed into their East Side apartment, where Ms. Durst was talking with friends, and kicked an acquaintance in the face. The man later settled a lawsuit over the episode with Mr. Durst. Three weeks before Ms. Durst disappeared, she was treated at Jacobi Medical Center in the Bronx for bruises she suffered during an argument with her husband, according to several friends and medical records later recovered by investigators. Ms. Durst told her sister, her friends and virtually anyone who would listen, “If anything happens to me, don’t let Bob get away with it. ” Geraldine McInerney, a friend of Ms. Hughes’s, said she had met Ms. Durst at the couple’s East Side apartment on Jan. 29, 1982. Ms. Durst wanted someone she knew to sublet the apartment so that if “the situation between her and Durst became too threatening, she would have an alternative place to stay,” Ms. McInerney said in a 1983 affidavit. It was the last time Ms. McInerney saw her. A week later, Mr. Durst walked into a Manhattan police station to file a missing person’s report. He carried a copy of New York magazine with his father’s picture and the headline “The Men Who Own New York. ” Mr. Durst told the police that he had put his wife on a train to Manhattan from Westchester County on Sunday night so that she could attend school the next day. He said he had later spoken to her by phone, after she arrived at their Riverside Drive  . Soon, the story was splashed across New York’s tabloids. Mr. Durst, who hired detectives and offered a reward, told his family, friends and the police that his wife might have run away with a drug dealer. Her family found that implausible, since she was only months away from graduating. “She always wanted to take care of children,” Mr. Hughes said. Decades later, in an interview with the producers of the   HBO documentary “The Jinx: The Life and Deaths of Robert Durst,” Mr. Durst acknowledged that much of what he had told the police was a lie. Why did he lie? “I wanted them to leave me alone,” he explained to Mr. Lewin, the Los Angeles prosecutor, during an interrogation after his 2015 arrest in New Orleans on gun charges. “I wasn’t used to somebody questioning my veracity. ” Frustrated by what they regarded as a desultory investigation by New York City detectives, Ms. Hughes and a small band of friends became amateur sleuths, tracking sightings of her sister and Mr. Durst and scouring phone records. By March 1982, they were making furtive   visits to what they believed was the scene of the crime, the stone cottage at the edge of Lake Truesdale. On one trip, Mr. Hughes found an ominous list in Mr. Durst’s handwriting in a garbage can: “town dump, bridge, dig, boat” and “shovel. ” They found Ms. Durst’s diamond earrings in her drawer at the Riverside Drive apartment, which Mr. Durst had told the police she was wearing when she disappeared. To this day, Ms. Hughes is shocked that New York City detectives never searched the cottage. Ms. Hughes and Ms. McInerney pored over pages and pages of phone records from the cottage, the apartments and the Durst Organization that they had gotten from the detectives. Night after night, the two women matched the phone numbers to names until they discovered that Mr. Durst had made collect calls to his family’s business from Ship Bottom, N. J. shortly after his wife vanished. The calls, coupled with the list of words, led them to suspect that Ms. Durst might be buried somewhere in the nearby Pine Barrens of New Jersey. Ms. Hughes and Ms. McInerney borrowed a car and drove the investigating detectives down to Ship Bottom. But the detectives seemed uninterested, Ms. Hughes said, and the case was no longer generating headlines. Mr. Durst was not charged with any crime. Ms. Hughes and her family wrestled with Mr. Durst in Surrogate’s Court for control of Ms. Durst’s estate, but suffered another defeat in 1983. “I was just so fed up,” Ms. Hughes said. “I broke down. I couldn’t do it anymore. ” For a long time, she refused to drive a car or even leave her apartment. She focused on her two daughters, whom she had long neglected. In the end, Ms. Hughes was left without answers as to her sister’s fate. But she never lost her conviction about Mr. Durst’s culpability. Ms. Hughes, her husband and Ms. McInerney cooperated with an investigation into Ms. Durst’s disappearance that was started in 2000 by an enterprising State Police investigator, Joe Becerra, only to be disappointed again when the local district attorney did not indict Mr. Durst. In recent years, Ms. Hughes and other members of her family have gone back to Surrogate’s Court to fight Mr. Durst and to have her sister declared dead as of Jan. 31, 1982. Their mother, Ann McCormack, died in May at 102, without knowing what happened to Kathie. “It’s absurd that after 35 years New York has not charged him with murder,” Robert Abrams, whose law firm, Abrams Fensterman, is representing Ms. Durst’s family, said of Mr. Durst. “If they’re not going to do it criminally, we’ll do it civilly. ” Whatever happens in Los Angeles, Mr. Durst will return to federal prison to serve the remaining time on a   gun conviction. “We want some sort of peace, some answers as to where she’s at,” Ms. Hughes said. “Why couldn’t he just tell us? He has nothing to lose. He’s going to stay in jail. ”'"}, "time": 1742563039.8634715}