{"duration": 0.03163862228393555, "input_args": {"text": "\"UK royals in Bahrain amid crackdown Wed Nov 9, 2016 9:9AM Persian Gulf Britain's Prince Charles speaks to Bahrain's Crown Prince Salman bin Hamad bin Isa Al Khalifa upon arriving in the Bahraini capital Manama on November 8, 2016. (Photo by AP) \\nBritain’s Prince Charles and his wife Camilla have arrived in Bahrain on a three-nation tour of the Persian Gulf states amid strong criticism of London’s continued arms sales to the repressive regime in Manama. \\nThe plane carrying the British royals touched down at Sakhir Air Base in central Bahrain on Tuesday on the last leg of the tour, which had already taken them to Oman and the United Arab Emirates. \\nThey were received by Bahrain’s Crown Prince Salman bin Hamad bin Isa Al Khalifah and then taken to a nearby palace to meet with the country’s King Hamad bin Isa Al Khalifah. \\nSince 2011, the United Kingdom has sold 55 million dollars worth of arms to Bahrain. The year saw the eruption of peaceful anti-regime protests on the island. \\nLondon has been under fire by international rights organizations for selling military equipment to Manama, which is involved in a harsh and deadly crackdown on opposition activists. \\nIt was reported late last month that the UK will open a massive permanent military base in Bahrain and deploy warships to the Persian Gulf. A Bahraini protester shouts slogans during clashes with regime forces in the village of Sitra, south of Manama, on February 12, 2015. (Photo by AFP) \\nThe military base, which is the first such facility being opened by Britain in 40 years in the Persian Gulf region, will be launched next month, Britain’s Express newspaper reported. \\nBritain will station around 600 military forces at the Royal Navy Facility and will deploy its warships to patrol the surrounding waters and guard oil and gas shipments in the waters. \\nWhen Britain kicked off the project in 2014, Defense Secretary Michael Fallon described it as “a permanent expansion of the Royal Navy’s footprint” in the Persian Gulf. The project has bypassed the parliament. \\nAccording to data released by the UK Trade and Investment in September, the UK government has become the world’s second biggest arms dealer, with bulk of its weapons fueling deadly conflicts in the Middle East. Loading ... \""}, "time": 1742561958.8254843}