{"duration": 0.11095833778381348, "input_args": {"text": "'  \\nNorth Korea’s fifth nuclear test produced an explosion fury and hysteria around the world, more empty threats against the Hermit Kingdom, and a giant sell-off in stock markets by foolish investors. \\nNo wonder gleeful North Korean leader Kim Jong-un was having such a big laugh. It’s not often that a small nation of only 24.8 million can defy the mighty United States, Japan, South Korea and even its sole ally, China. But Kim did, and survived the experience. \\nNorth Korea fired off its fifth underground nuclear device estimated at 15-20 kilotons. The detonation was estimated at around the same size as the US nuclear devices that destroyed Hiroshima and Nagasaki in 1945. \\nWhat made this test different was the announcement by Pyongyang that it had ‘standardized’ production of nuclear warheads and, even more important, reduced their size and weight so they could be fitted atop medium and long-ranged missiles. Previous North Korean nuclear devices were believed too heavy and bulky to be delivered by missiles. \\nWestern experts believe North Korea will have 20 nuclear warheads by the end of this year, though how many of them can be delivered by missile is not known. The North has no long-ranged missiles that can hit North America, contrary to this week’s hysteria. Its new submarine-launched missile, a real potential threat to the US mainland, is still many years away from deployment. No one seems to care that India has ICBM’s and sea-launched SLBM’s that can hit the US today. \\nNorth Korea’s missile force is not designed to attack the United States but rather to deter any invasion or nuclear strike by US forces. The US Air Force underlined this potential threat by flying two nuclear-capable B-1 heavy bombers near the border with North Korea. \\nFor North Korea, most of South Korea is too close for potential nuclear attack. Radiation would blow back over North Korea. Only the South’s most important southern port, Busan, through which any invading US forces would pass, might be a viable target. \\nEven if North Korean missiles could strike the mainland United States, there would be an immediate US nuclear riposte from Guam, Japan and the powerful 7th Fleet that would turn North Korea to radioactive dust. Kim Jong-un is neither mad nor suicidal. \\nBut the North’s growing force of medium-ranged missiles could hit Japan’s home islands, Okinawa, and Guam, America’s primary Asian military bases. Three or four N Korean nuclear weapons could cripple Japan. \\nIn effect, North Korea holds Japan a nuclear hostage. Japan has no leak-proof defense against nuclear missiles. Its lack of nuclear weapons means that Japan is naked before the North Korean threat and must rely on the uncertain US nuclear umbrella and unproven anti-missile systems. \\nThat’s why presidential candidate Donald Trump proposed that Japan be allowed to acquire nuclear weapons. It’s unacceptable for the world’s third largest economy to be held in thrall by pipsqueak but nasty North Korea. \\nJapan has considered developing nuclear weapons for decades but US pressure and anti-militarist public opinion have prevented Tokyo from doing so. \\nJapan could produce a nuclear weapon in three months if it so decided. But it won’t, and so remains vulnerable to North Korea and to nuclear-armed China with which Japan is in a serious confrontation in the South China Sea and off the Ryuku Islands. \\nThe US and South Korea have staged their annual Fall military exercises that mimic an invasion of North Korea. Each year, North Korea blows its top when this provocation occurs. There’s no military need – it’s merely primitive chest-thumping by Washington and Seoul and tantrum-time for the North. Call it North Asian Primeval Scream Therapy. \\nInterestingly, this time South Korea’s conservative government led by PM Park Geun-hye joined the all-Korean threat-a-thon by vowing to turn Pyongyang ‘to ashes’ if it was seen preparing a nuclear attack on the South. In fact, South Korea lacks this military capability in spite of recent additions of new artillery missiles. Seoul’s threats were more designed to placate angry right-wing South Korean Christian voters than to intimidate the North. \\nBut it’s also worth recalling that in the late 1970’s, the US forced the current prime minister’s father, President Park Chung-he, to halt his secret nuclear weapons program. Today, South Korea still has good reasons to develop a few nukes, though much of North Korea is too close for retaliatory strikes. Both sides in Korea would be better off with small, tactical nuclear weapons. \\nIt’s always fun watching the hot-tempered Koreans hurl threats at one another and the US. Yet one of these days, threats could turn to real shooting on the Peninsula. Think of the Japanese nuclear melt-down at Fukushima…and then multiply by 150.  '"}, "time": 1742563655.7031562}