{"duration": 0.07328581809997559, "input_args": {"text": "'WASHINGTON, D. C. —  President Donald Trump on Friday signed a new executive order on an   Offshore Energy Strategy as he proclaimed, “It’s going to lead to a lot of great wealth for our country and a lot of great jobs for our country. ”[From the Roosevelt Room of the White House, President Trump thanked Secretaries Wilbur Ross and Ryan Zinke, lauded their job performance, then told those gathered:  This is a great day for American workers and families, and today we’re unleashing American energy and clearing the way for thousands and thousands of   American energy jobs. Our country is blessed with incredible natural resources, including abundant offshore oil and natural gas reserves. But the federal government has kept 94 percent of these offshore areas closed for exploration and production.  And when they say closed, they mean closed. This deprives our country of potentially thousands and thousands of jobs and billions of dollars in wealth. I pledged to take action, and today I am keeping that promise. The President stated that the order initiates “opening offshore areas to   energy exploration,” which reverses an Obama Administration Arctic leasing ban. “It reverses the previous administration’s Arctic leasing ban, and directs Secretary Zinke to allow responsible development of offshore areas that will bring revenue to our Treasury and jobs to our workers. ”   Barack Obama seized this last days’ opportunity to shore up his environmental policy in December 2016. The Washington Post reported that he banned offshore oil and gas drilling in hundreds of millions of acres of federal land in the Arctic and Atlantic Oceans. The ban was coordinated with a related move by Canadian Prime Minister Justin Trudeau. The report cited a White House aide, who claimed regarding the Section   of the 1953 act withdrawals, “There is no authority for subsequent presidents to     …     I can’t speak to what a future Congress will do. ” After the   Arctic leasing ban was announced, Sen. Ted Cruz ( ) responded in a tweet the Post cited, “Yet another Obama abuse of power. Hopefully, on[e] that will be reversed  …    exactly one month from today. ” Trump added that the order, “will enable better scientific study of our offshore resources and research that has blocked everything from happening for far too long. ” The result, according to Trump, will be energy cost reduction and job creation, while making the country more secure and energy independent. “It’s going to lead to a lot of great wealth for our country and a lot of great jobs for our country,” said Trump. Ahead of the President’s speech, Vice President Mike Pence called the order “an important step toward American energy independence. ” The entire executive order can be found at WhiteHouse. gov. Follow Michelle Moons on Twitter @MichelleDiana '"}, "time": 1742628306.2913542}