{"duration": 0.10203719139099121, "input_args": {"text": "\"Getty - Mark Makela \\nIvanka Trump's Instagram account stands apart from her father's candidacy. It's the public feed of Ivanka, the brand. “American wife, mother & entrepreneur. EVP at the Trump Organization. Founder of IvankaTrump.com and #WomenWhoWork,” her bio says. \\nScrolling through, it sometimes feels like an alternate reality. When Donald Trump's presidential campaign is in free fall, or facing controversy, Ivanka is posting a mix of inspirational quotes, family pics, and the occasional selfie. Photos of her on the campaign trail are far and few between. \\nThat's on purpose. \\n“My Women Who Work initiative and my brand, was launched far before the presidential cycle commenced and will continue long afterwards,” she said this month at the Fortune Most Powerful Women Summit. \\nStill, the Donald Trump campaign and Ivanka Trump brand do coexist, and it's often jarring to witness them side-by-side. This is the story of the 2016 campaign, juxtaposed with @ivankatrump. \\nJune 16, 2016: \\nDonald Trump announces his presidential campaign at Trump Tower in New York City. Ivanka introduces him as “a man who needs no introduction.” Actors are paid to wear shirts and pretend to be supporters. Trump accuses Mexico of sending drugs, rapists, and murders across the border and promises to build a wall on the southern border. \\nIvanka posts a photo of her introduction. See her speech on IvankaTrump.com (link in profile). A photo posted by Ivanka Trump (@ivankatrump) on Jun 16, 2015 at 4:55pm PDT \\nDecember 7, 2015: \\nDonald Trump calls for a “total and complete shutdown of Muslims entering the United States” following an ISIS-inspired shooting in San Bernardino. \\nIvanka posts five black and white photos to promote her Ivanka Trump Jewelry campaign. “I love the idea of elevating an otherwise simple look with stunning accessories,” she writes. A photo posted by Ivanka Trump (@ivankatrump) on Dec 7, 2015 at 10:56am PST \\nFebruary 18, 2016: \\nDonald Trump calls Pope Francis “disgraceful” after his comment that anyone who wants to build a wall is “not Christian.” \\n“No leader, especially a religious leader, has the right to question another man’s religion or faith,” Trump says. \\nIvanka posts a photo with the (Link in profile) to her next #dinner #menu. “The #recipes are sure to warm you up when it's cold outside!” she writes. A photo posted by Ivanka Trump (@ivankatrump) on Feb 18, 2016 at 2:15pm PST \\nMarch 13, 2016: \\nDonald Trump says he will pay the legal fees of a man accused of assaulting a protester at his rally in North Carolina. \\n“From what I heard, there was a lot of taunting and a certain finger was placed in the air,” he says on “Meet The Press.”“I don't condone what he did. But you know what, not nice for the other side, either.” \\nIvanka posts that she finally [email protected] the previous night and was blown away. \\n“Definitely a must-see!” she writes, with two thumbs up emoji. A photo posted by Ivanka Trump (@ivankatrump) on Mar 13, 2016 at 6:58pm PDT \\nMarch 30, 2016: \\nDonald Trump defends his then-campaign manager Corey Lewandowski, who the day before was charged with battery after being accused of grabbing then-Breitbart reporter Michelle Fields. Trump tells “Today” Fields lied. \\nIvanka posts an inspirational #WomenWhoWork quote from Dorit Jaffee about tranquility. A photo posted by Ivanka Trump (@ivankatrump) on Mar 16, 2016 at 6:37am PDT \\nSeptember 30, 2016: \\nDonald Trump goes on an early morning tweetstorm, attacking Hillary Clinton and Alicia Machado, a former Miss Universe contestant Trump once called “Miss Piggy” and “Miss Housekeeping,” between 3 a.m. to 5 a.m. He accused Machado of being in a sex tape, which she was not. \\nIvanka posts a photo of a woman with a card in her purse that reads “Women Who Do It All” and writes “The weekend is calling your name! #WomenWhoWork.” A photo posted by Ivanka Trump (@ivankatrump) on Sep 30, 2016 at 11:03am PDT \\nOctober 22, 2016: \\nDuring a policy speech in Gettysburg, Pennsylvania, Donald Trump threatens to sue the women who have accused him of sexual misconduct. \\n“Every woman lied when they came forward to hurt my campaign,” he says. “Total fabrication. The events never happened. Never. All of these lill be sued after the election is over.” \\nIvanka posts a looping video of her feet in front of a toasty fire. Oct 22, 2016 at 7:52pm PDT \""}, "time": 1742561877.6099677}