{"duration": 0.1481478214263916, "input_args": {"text": "'The first time I saw Josephine Baker up close I was in London. I went to the Alexander Calder exhibition at the Tate Modern and there, at the entrance to the exhibition, was a wire sculpture of Baker. You can see why it was one of the very first wire sculptures that Calder made  —   the subject demanded a new medium. With all due respect to Beyoncé, Josephine Baker has the most famous physique in showbiz history  —   a body so often compared to a spring, it’s only natural that an artist would try to capture her in that form, complete with spiraling breasts. Four months later, I left for a writer’s retreat in the Périgord region of France, no longer thinking about Josephine Baker. This is an area comparatively light on American tourists. It’s not that it’s lacking in visual splendor  —   the Dordogne River, Marqueyssac gardens, the medieval town of    and Castelnaud Valley, fittingly named considering its collection of castles perched on cliffs  —   but no beaches were stormed, no patron saints burned, no water lilies painted. The region’s primary claim to fame is the prehistoric caves of Font de Gaume, Grotte de Rouffignac and Lascaux (Lascaux 4, the latest reproduction of the original, opens in December). The area’s other extremely popular attraction happens to be the Château des Milandes, a breathtaking Renaissance castle overlooking the Dordogne. This, it turns out, is where Josephine Baker, who was born in St. Louis in 1906, lived during the second half of her life. She married and raised her children here. “I have two loves,” sang the queen of the Jazz Age in “J’ai Deux Amours,” her most enduring tune, “my country and Paris. ” If she had recorded a    remake, she might have added a third love to the list: Milandes. And seeing as how I was staying a mere 15 minutes away, in the   town of Les     I decided to pay it a visit. I thought perhaps I could learn more about Baker’s passionate relationship with France  —   and its mutual fascination with her. The chateau is up a twisting, idyllic road bordered by   trees and stone walls. When you walk in the front door, you are greeted by the sound of radio interviews with Baker and an exhibition of her stage costumes. There are over a dozen gowns, bustiers and jumpsuits, most involving crystals, all in size   . I was not prepared for such a display. Because most French chateaus are privately owned (including this one, currently inhabited by the Sarlat native Angélique de   whose husband is a relative of “The Little Prince” author) most are limited in access. But here visitors may wander through a labyrinth of children’s bedrooms furnished with gramophones and trunks, Art Deco bathrooms, a huge kitchen and a vaulted gun room (not the official name of the room, but there’s a rifle on a tripod pointed at your head as you enter). There are also cases of military medals and a commendation letter from Charles de Gaulle for Baker’s efforts during World War II. Baker was a spy for her adopted country. She hid weapons for the French Resistance and smuggled documents across the border, tucking them beneath gowns like the ones on the first floor. The crown jewel of the tour is Baker’s famous banana belt, which she wore  —   along with nothing else  —   in the Danse Sauvage at the   in 1926. Baker did more for the sexualization of bananas than the collective   class demonstrations of the last century. The bananas are gold, not yellow  —   something impossible to tell in the black and white footage. As I admired the belt, a British tourist next to me turned to her husband and said: “She wasn’t actually naked all that much, it’s just what everybody chooses to remember. ” “Everybody” included me. It’s exactly what I saw when I looked at the Calder piece and it’s probably what Calder saw when he looked at Josephine Baker: an outline. But on the 110th anniversary of her birth, it’s worth noting that there is so much more to Baker  —   and to Baker’s France  —   than meets the eye. In addition to being a performer and a spy, she was the last speaker before the Rev. Dr. Martin Luther King Jr. at the 1963 march on Washington. Slightly less celebrated is the fact that, in her 40s, she began adopting children from different countries. There were 12 in all and they would come to be known as the Rainbow Tribe. For Baker, they were the living embodiment of a Utopian racial ideal. The easy contemporary parallel would be Angelina Jolie  —   except that when Baker’s children became an attraction for tourists, she fully embraced the gawking. Then, after World War II, Baker firmly settled at Milandes. She employed half the town. Her brother married the postwoman. Unlike her hectic nights of performing, her days in the Périgord were peaceful. Or as peaceful as anyone’s days can be with 12 small children, multiple monkeys and a pet cheetah. Once I started listening for Josephine Baker, I heard her everywhere. Back in Les Eyzies, I ran into Josette Garrigue, the    woman who owns the farm down the road. I told her where I had been and she nodded and smiled. “I remember her well,” she said, “Back then, this place was only little roads, just a romantic spot where she could drive around in her old cars. It’s tragic what happened to her. ” What happened was bankruptcy. Baker, who once claimed to be the richest woman in the world, fell into insurmountable debt, despite the help of   friends like Grace Kelly and Brigitte Bardot. In 1968, she was forced to give the chateau over to creditors. After the bananas, the second most famous image of Baker is of her sitting in the rain, locked out of her home by the new owner. The local loyalty to her is unwavering to this day Ms. de   referred to the new owner in an email as “a bad guy. ” “I don’t want to speak about him!” she responded quickly. “Josephine sold because she was without money, and a lot of people exploited the situation. ” That evening, I sat at my neighbor’s kitchen table with her friend, Michel Salon, a retired career waiter who has served everyone from Serge Gainsbourg to the king of Belgium. “The first time I saw her was a Sunday,” Mr. Salon, 70, recalled. “She was cleaning dishes in the castle cafe. A little girl was watching her and Josephine called to her, picked her up and hugged her. She loved children but couldn’t have any of her own. The girl’s mother yelled at her husband for not bringing a camera. “Oh, she was so famous. But she was an artist and she didn’t know how to manage money. She employed people who billed her for projects she didn’t order. I know one waiter who would steal money from the cafe while Josephine was in Paris. Can you imagine someone doing something like that to her in Paris?” I could not. Then again, I imagined Baker’s life as a young woman in Paris was light on the dishwashing in general  —   but who knew? So after seeing where she spent the latter half of her life, I decided to head back to the beginning. I contacted Julia Browne, who runs Walk the Spirit Tours: Black Paris and Beyond, which offers specialized tours with themes like “Pioneers of the Left Bank,” “Great Black Music Walk” and, of course, “Josephine Baker. ” Ms. Browne paired me with David Burke, 79, an American author and film producer who is working on a documentary about Baker. Thirty years ago, he and his wife decided to live in Paris for a year  —   and they never left. We met outside the boutique Hotel Joséphine, right at the Baker epicenter of Montmartre and Pigalle. “It’s funny,” Mr. Burke said, “Josephine wasn’t really a jazz person and she was a dreadful singer at first, but she was involved with the whole Jazz Age community. She’s the most famous person in the whole group, the most famous of any American to ever live in France. ” I raise my eyebrows. Really? Mr. Burke mostly gives Lost Generation tours: Hemingway, Stein, Fitzgerald. “Really. ” We begin our walk on the Rue Fontaine, which leads to the Moulin Rouge. Mr. Burke described the area in its heyday as being “like 52nd Street back in the bebop days. ” The street used to be dotted with jazz clubs, none of which still exist. It took a bit of an imaginative leap to picture the scene our conversation took place between a nail salon and a pizzeria. The one structure still standing is the former Le Grand Duc, where Langston Hughes was employed as a busboy and where Ada Smith, a. k. a. Bricktop, who later took Baker under her wing, first performed. Six Degrees of Josephine Baker would be too easy a game to play in France. Or in America, for that matter. Baker was a star even before she arrived in Paris (starring in “Shuffle Along,” one of the first   musicals, a revival of which opened on Broadway in April). But Paris made her a megastar. “People just went wild for her,” Mr. Burke said. “There was a need for something fresh and Josephine brought this combination of Africa, jazz, humor and America in her presentation. And she was personable. Everyone loved her. ” Well, not everyone. I broach the subject of “The Hungry Heart,” a scathing portrait of Baker I read on the train up to Paris. It’s written (with a  ) by   Baker, her unofficial 13th son, who met Josephine when he was already a young man. Mr. Burke said he finds the book “unreliable and worrisome. ” I can see why. In it, Baker is an oversexed fabulist who, “like a black Chaplin,” stepped on anyone “to get where she wanted to get. ” She answers the door naked for Balanchine and repeatedly refers to Marlene Dietrich as “that German cow. ” He recommended I read “Josephine Baker in Art and Life” by Bennetta   instead. I eventually did, and it was twice as sophisticated and half as fun. We turned onto the Rue de Clichy. The   arch of the Casino de Paris  —   Baker’s third musical hall home, where she performed with feathered wings  —   rose up in the distance. “Josephine almost never played an American,” Mr. Burke said. “She was always playing a woman of color from somewhere else. So she would play a Vietnamese girl who was in love with a French planter in occupied Vietnam. ” “That’s quite the colonial fantasy,” I said. “ ‘Thank you for occupying us, how can we serve you?’ ” “And it was Josephine,” Mr. Burke said, “so it’s everyone’s fantasies at once. ” Next, we make our way over to the Avenue Montaigne off the   a   and   stretch that was familiar to Baker. One side effect of immense fame is a fluency in fashion: Josephine was beloved by designers like Balmain and Dior. Were she alive now, she surely would have had her own line of perfume. Instead, she had the lucrative Baker Fix, a hair pomade inspired by her own shellacked curls. But the area also symbolizes the end and the beginning of Baker’s Parisian life. At one end of the street is the lovely Théâtre des  . It was here, in October 1925, that Baker performed in La Revue Nègre, her first performance in Paris. And a short walk away is L’Église de la Madeleine, the site of her funeral procession in April 1975 she was given full French military honors and drew over 20, 000 mourners. Mr. Burke and I attempted entry, but it was the middle of the afternoon and all efforts to talk an usher into opening the doors were thwarted. We were left on the outside, looking in  —   a bit like I felt at the end of the tour. As informative as it was, it was more walk and less spirit. I finished with a greater sense of where Baker led her life, but why she could be considered the most famous American expat remained a mystery. So I did what anyone would do: I contacted a man who has devoted the majority of his professional life to paying homage to Josephine Baker on stage. The cabaret singer and choreographer Brian Scott Bagley, 37, hails from Baltimore like Mr. Burke, he came to Paris temporarily  —   in 2006  —   and simply never left. I met him on the bustling Boulevard Beaumarchais in the Marais and we took a stroll through the neighborhood, Mr. Bagley’s    patent leather shoes clicking along. The Marais is not Josephine Baker’s Paris, but it is, objectively, a good place to get lunch. “Honey boo,” Mr. Bagley said, taking my arm. “I dream in French now. I have different accents for American people and for French people. I’m kind of like a spy in that way, like our girl. ” Mr. Bagley believes that Baker’s charisma was so stupendous, it still “latches on” to performers like him (“I am the love child of Sammy Davis Jr. and Liza Minnelli adopted by Josephine Baker”). She brings people together from the great beyond. I expressed a healthy degree of skepticism about this  —   right before “J’ai Deux Amours” came dripping out of some cafe speakers and Mr. Bagley and I discovered that we were born the same day of the same year. O. K. maybe. Once seated, we flipped through his collection of vintage Paris Matches with Baker on the cover and he elaborated on what makes her so important. “Everybody imagines something different when they come to Paris, but it’s the Harlem of Paris that not everyone knows about but should, because that’s where the energy is still so potent. Josephine was the center of it,” he said. “She came here and  —   boom  —   she could live in a world without segregation. Boom, she was a major star. She lived that European dream we all want, of liberation and sexual freedom. We all want to come here and meet some amazing French guy, make love in some chambre de bonne and then fall in love with some European aristocrat. ” Paris had long been “the Bermuda triangle of the muses,” as Mr. Bagley put it, one of the world’s great magnets for writers, painters and musicians. But like Mr. Burke, he thinks that Baker was much more than an artist. She was a lifestyle. She was “the ultimate connector,” inspiring fellow performers, sitting with audience members and chatting long after the curtain closed. And, she “did everything. ” He, too, has his preferred Baker narratives (he’s partial to “Remembering Josephine Baker” by Stephen Papich). “But it doesn’t matter what you read,” he said. “What matters is embracing Paris the way she embraced it. ” (Mr. Bagley was recently named assistant artistic director of le Parc de Josephine Baker, an events space and resort, complete with   pool, just down the road from the Château des Milandes.) Baker’s last show was  . She was 69, and she died in her sleep a few days later. But Mr. Bagley is right  —   she’s not gone. Not just in the sense that she is remembered or in the sense that there is a square named after her in Montparnasse, but in the sense that she is present. There are still many walls up for black performers around the globe but, as Mr. Bagley noted, “Josephine broke down a ton of them. ” Like Paris itself, Baker is at once idolized and familiar  —   once you fall in love with her, you both want to share that love and keep it for yourself. This is evidenced by the fact that not a single person with whom I spoke referred to her by her last name, as they did with Hemingway, Fitzgerald, Stein and Porter. Everyone feels as if Josephine was theirs.'"}, "time": 1742628553.7589638}