{"duration": 1.2480363845825195, "input_args": {"text": "'Black Emanuelle fixed all that in 1976. Attila \\nSpeaking of Europeans Colonialism/exploitation and the Ottomans. Your Europe is only Western Europe. Eastern European countries were not colonizers. They never adventured outside of the continent either and never been in the slavery business. They were colonized, brutalized and saved by Asians inducing the Mongol Empire and the Muslim Ottoman Empire. So please refer to Western Europe only when you speak of Europe. Eastern Europeans were often the victims of none-whites and Islamic imperialism. Ever wondered why Hungary is not accepting any Muslim migrants? Attren \\nAtilla, will you please be so kind as to reference some quality literature on this subject? I am most interested and want to learn more (eastern european). Thank you, brother. Attila \\nGoogle the Mongol invasion of Hungary and Eastern Europe also the Ottoman period in Eastern Europe. Bob Btme \\nI’m familiar with the story of the guy playing the trumpet in Poland who got the arrow in the neck. The history of the ancient cannabis- using Scythian marauders is also interesting, Bob Btme \\nthanks Attila for educating us on that, I love history and barely received any during my 17 years spent in the USA public school system Rod \\nThe reason your not taught accurate history in school is that the book writers are formerly propaganda and car salesmen teachers. All one has to do is research the history of said companies like McGraw Hill and such. Sloane \\nAttila is half telling the truth and half over-simplifying/lying Sloane \\nAttila is clearly deranged. You shouldn’t believe much of what he writes. Daniel Sandman \\nhmm.. wouldn’t the Visigoths count as eastern Europeans? They brought down the west roman empire and colonized it. And what about those Vandals? Attila \\nThere were many ethnic groups living in the Carpathian base or what is now Eastern Europe before Christian Europe was born. There were the Avars, Cumans, Gepids and many others who were pagans and did not have a state. They came and left. When Hungary and other Eastern European accepted Christianity and formed their own country that’s the time they joined Europe and stayed and had their kingdoms. That’s when countries become accountable. I’m concerned about Christian Europe because that’s what Europe is today. That’s what we protected and sacrificed so much for. Alejandra \\nWhat do you think about your christian europe and the genocide at america? Attila \\nYou mean Western European colonial powers? As an Eastern European who’s people suffered genocide from Asians ans Muslims and were left alone to defend Europe and betrayed by Western Europe I say some of those countries owe us a apology. France formed the Franco-Ottoman alliance basically legalizing our enslavement by the Muslim Ottomans. They betrayed Christian Europe and us Hungarians and the Serbians, Bulgarians, Romanians and Poles. France and some of the Western European colonial countries were not true Christians. If they were they would not let us to be enslaved by the Islamic Ottoman Empire. Funny how France was the first congratulating Suleiman the Magnificent after he defeated the Hungarians at Mohacs in 1526. Yes slavery was legal in the Ottoman Empire and France had no problem teaming up with our slave master and have our country turn in to a wasteland. Eastern Europeans don’t think highly of Western Europeans. Eastern Europeans whites are proud people. niels groenbaek \\nThis old Europe was bad. France, Belgium did leave every country/territory in a mess Attila \\nJust imagine. Europe was under threat of being conquered by the Ottomans. The sultans openly expressed their desire to conquer Europe and convert i it to Islam. They dreamed of converting the Vatican in to a mosque. Then you have France who formed and alliance with them. They truly betrayed not only the Eastern European countries who came under Islamic terror but Europe and Christianity as well. chris VN \\nThey’ve stopped dreaming about it and have been doing it by stealth for the last 50 or so years. John L. Wildman \\nYou need to shut the fuck up till you know what you’re talking about. Simona Mamo \\nThe Raiders of the Ottoman empire also regularly raided Malta. We are a small island in the middle of the Mediterranean sea and stole the locals for slaves. Besides butchering and pillaging. Rod \\nMuch like columbus did to us native american “indians” I suppose. Simona Mamo \\nLol. Well previous to the Spanish invasion for lack of a better word, they themselves had just liberated the Iberian peninsula(Spain) from the Moorish empire. Sad how people who have themselves had to fight for so long to free themselves from a conqurer yoke so easily become conquers themselves. In fact I believe I read somewhere that Isabella sent Colombus off in the hope of new trade routes to India as she needed money for her continuing war against the Ottoman empire.Trouble in one region always seems to spread. Diesel67 \\nWar against the Ottoman Empire took a back seat to getting rid of Jews. Much of the Spanish Jews expelled in 1492 migrated to the Ottoman lands, so much so that the Ottoman sultan said in substance: Ferdinand calls himself a clever king but he enriches my kingdom even as he impoverishes his own. Of course all that changed when the Spanish conquered most of the Americas, plundered its resources and enslaved or killed the indigenous population (no worse than any other conquering empire throughout history). Simona Mamo \\nLol. Colombus actually took a Jew with him on his voyage of exploration. Sloane \\nWell wouldn’t geography play a big part in colonization? From what port could Hungary go and control a colony in Africa? Do you count Russians as Eastern Europeans? If so, then you can’t say Eastern European countries were not colonizers. Attila \\nMost of Russia is in Asia just like Turkey. Russia didn’t slave or colonized African countries and was not in the slave trade at all. They didn’t commit genocide against non Russians either as a colonizer. They didn’t go further then some of their neighboring countries. The Soviet Union was bad but a different animal all together. Russia is not on the radar of progressive liberals and black activist who are the most vocal about the crimes of Colonialism. If you insist maybe I could say countries that are in Eastern Europe only or entirely Eastern European or central-East European countries. Sloane \\nRussia didn’t slave or colonize African countries but part of that is that they couldn’t because of the Western Europeans already there (Russians DID attempt to try to expand into/colonize parts of Africa – https://www.reddit.com/r/AskHistorians/comments/1rpfwp/russian_colonialism_in_africa/ ). My point is that you’re oversimplifying history and victimizing Eastern Europeans in a thread about the Congo? Why? Have some respect and take your tirade elsewhere. Your post started with “Speaking of Europeans Colonialism/exploitation and the Ottomans.” This article wasn’t speaking about colonialism or the ottomans in general. You brought it in. “Hungary had ports on the Adriatic see for hundreds of years.” And you just proved how expansionist the Hungarians were! And people are supposed to have sympathy for poor E. Europeans because they didn’t get the chance to commit atrocities like their Western European counterparts? Give me a break! Attila \\nYou are one of those “useful idiots” aren’t you? Here is my solution for the idiots that includes many of the commentators also: Two words should not be used and those are WHITES and EUROPEANS. Instead use words like Western Europeans, Western European Colonial powers, Colonial Americans, Colonial Spain, England or what ever countries were the culprits. In the USA they should use words like European Americans, Western European Immigrants or Colonial Americans. Understand that your history is not our history and your crimes are not our crimes. Generalizing white Caucasians puts Eastern Europeans into the same category as a white slave keeper in colonial America hundreds of years ago or a Belgian murderer in Africa. It seems you have a sick need to drag down all white people and equal them to those who violated non-Whites. We are from the other half of Europe, from other countries with a totally different historical background and we have absolutely nothing to do with colonization and slavery. Do you understand the difference between Eastern Europe and Western Europe? To put it simple: West was the colonizer vs. East which was colonized. I’m asking you to be considerate of us and stop the anti-white bigotry.\\ufeff If progressives keep using terms such as legacy of European exploitation, white racism and many other insults I encourage that you talk to Eastern Europeans such as Poles, Czechs, Croats, Slovaks and Hungarians and ask them what they think about the practice of generalizing whites and Europeans. They will tell you that you are embarrassing and you don’t talk on their behalf. Don’t be surprised if they express their disgust if you try to patronize them like you are trying me. Believe me the the West have no idea just how low opinion Eastern Europeans have for the West because the anti-white narrative and views the West holds. The more Eastern European EU countries become mainstream the more we are going to oppose you and will not going to put up with racism that we don’t deserve. You can bet on it.\\ufeff You attempt to get sympathy for the victims of Congo while you trash Europe will not get any respect from us. As per your comment about having a port on the Adriatic sea at the expense of other nations just shows how little you know. Hungarians never treated Croatia as colony and certainly didn’t oppress or violated Croatians. It was a union that benefited both countries especially protecting the borders against the Islamic Imperialist. Why don’t you ask Croatians about what they think about it, you useful idiot. Sloane \\nUhh I am half-Croatian,half-Bosnian, born in Dubrovnik, you fascist waste of air. I never generalized white Caucasians or “trshed” Eastern Europeans. Look at my comments again and you’ll see who was the idiot. I’ll save you the trouble – it’s you 🙂 I entered into a conversation with you to see just how bad your historical knowledge is – and that is VERY bad. Your original comments hinted at your xenophobia and racism and your further comments proved it. I wish you the best, I wish you would read decent history books from ALL OVER eastern Europe, not just Hungary. You may learn something, you may learn to be less fearful of change. Fear is the worst thing and your comments are brimming with fear – fear of migrants, muslims, etc. Bye Attila \\nBosnian? That explains it: you are a Muslim or a Muslim sympathizer. That explains why are in denial and trying to push your agenda. You are just another progressive liberal who protects islamo fascist agenda because that’s your heritage. Islam is the ideology of our former slave master and pure evil ideology. You know we were called infidel dogs by your kind for 150 years. Even now all you can do is just freak out and bark like we were still dogs. Why not put yourself together and give an honest argument and a fact based debate. But I don’t think you can. Sloane \\nYou lack basic reading comprehension. I am half Croatian, half-Bosnian. I am Catholic, not Muslim LOL. You have mental issues. Attila \\nMuslim sympathizer on your Bosnian Muslim side is enough for me. That explains why you are in the same hate camp with the libshits. Good combo! Since you are talking about mental issues please take your medication and do yourself a favor and don’t skip again! Sloane \\nWhat Bosnian Muslim side and hate camp? Do you even understand English? Do you know ANYTHING? Read my comments again. I am 100% Catholic. I told you to read up on history books, you are trying to defend Eastern European history when you don’t even know it. Croatia is 90% Catholic, Bosnia is Muslim, Orthodox and Catholic. I am half Bosnian Croat half Croat Catholic, so 100% Catholic. You retard. We in Dubrovnik remained independent and will continue to remain independent so we don’t have to fear the muslims like you do. The ones that are the most foreign, like you Asiatic Hungarians, are the ones most afraid of immigrants and are full of complexes as your messages have show. Goodbye now bozgor. Attila \\nStill trying the fool me. Christian Croats live in Herzegovina and not the Bosnian side. Nice but a stupid try. It may have worked with someone else. I like your way of using the word Bozgor because it fits you. Really expresses your true intention and bigotry. I guess I should thank you for that. You know it’s not a bad thing to fear Muslims when they slaved and killed us and turned the country in to a wasteland just because we were Christians. I guess it does something to the psyche. Say hello to you Muslims neighbors and friends in Bosnia aIm sure you enjoy your time with them. John L. Wildman \\nI agree. The more Atilla talks, the more stupid he sounds. Scooter McHeadshot \\nTrying to include the US as a primary culprit shows your lack of knowledge and history. The US was at best a 3d string team when it came to colonies and military adventurism overseas. The ENTIRE problem of the middle east and africa can be lain squarely at the feet of the europeans, most notably the English and French, with honorable mention to the Germans, Dutch and Portuguese (and in the 20th century the Soviets) If you really think the Ottomans were 1.) holding arabia together and 2.) kept it peaceful, you have some reading to do. The Ottomans were barely hanging on the last 300 years of their reign, and fought against countless rebellions and foreign invasions due to the nature of their “empire”. Try reading “A Peace to End All Peace: The Fall of the Ottoman Turkish Empire and the Making of the Modern Middle East” by David Fromkin. Also read “The Arabs” by Eugene Rogan, it has a decent overview of the problems and shortcomings of the Ottomans. Diesel67 \\nThe Ottomans lost their empire because they backed the wrong horse in World War I and because of local disgust with their corrupt misrule. Their fault. BTW, the Arabs and other Muslims they ruled over were not Turks and did not speak Turkish. Arutima \\n10 millions? That’s cute. The British have beaten that just with the Indian Rebellion of 1857. Where they used musket balls covered with pork tallow and fat, and buried Mughal Muslim troops alive with pork carcasses. Steve Haden \\nWell, it worked….. sabelmouse \\nthe british had more colonies as well. all the colonials need to answer for their deeds. Rufus McBoofus \\nI didn’t realize it was competition…. Eugene Collins \\nhttps://uploads.disquscdn.com/images/52a0cbfbe393bf6e6cf61d3d503745b3a13562b222bf83141a66a0fbfedf8de6.jpg Alex \\nThe reason this is forgotten is because it happened in the 1800s, with no radio, not a lot of press even, and certainly no cinema. The Congolese that survived probably mostly stayed in Congo. They were also black, so few white people at the time cared (they should, but in the 1800s didn’t) and few other people knew (they should but in the 1800s didn’t). \\nThe Holocaust in Europe happened to a very educated people (not judging, just stating a fact) of the which most survivers migrated to Israel and North America which means they talked and talked about it but not just among themselves but on radio in the USA, on movies like Schindler’s List and set museums not in Congo but in New York and established a state called Israel that made it a policy to spread awareness of the Holocaust. The Jews are also a people that are central to world affairs and always have been – again, just stating a fact without judgement (that’s true in science, politics, and many other areas). \\nTherefore it’s not just an arbitrary or a racist fact, but the differences in both tragedies, that made the Congolese genocide (and many others) be forgotten and the one perpetrated to the Jews remembered. \\nCompare that to Darfour, in the 2000s and yes, a lot more people know and have heard of such a genocide. So it is not just race, it is also time and place that determined memorability. Arron Frazier \\nYour comment about whites calling themselves Jews being educated is attempted back hand slap at African people being unintelligent which is typical propaganda of white supremacist. First of the so-called Holocaust was plain and simple white on white crime and violence. The whites of Europe WW2 and back to the start of the Catholic Church committed alot crime violence and killing against each. It was constant warring disputes and etc. They where always trying to rule over each other or trying to rule of thew world know at that time. African people had nothing to do with that at all. Second the Congo and Africa have been the economic engine of western civilization since the 1400’s with slavery colonialism imperalism and now Neo-colonialism. Third your notion whites calling themselves Jews are and have always been central to world affairs is a lie. They are central today because of white supremacy leaving Europe in the 1400’s with slavery colonialism and imperailism. Whites calling themselves Jews where right in the middle of everything and in many cases controlling and leading things. Prior to that whites calling themselves Jews have been central to the affairs of empires civilization and peoples of the America’s Africa and Asia. They had nothing to do with the Aztec Incas Olmecs Mayans and varies tribes and nations of North America. They had nothing to do with Africa with ancient Egypt Nubia Ethopia Great Zimbabwe Congo empires Ashanti Zulus Nok and etc. They had nothing to do with Asia with the Chinese dynasties civilization empire nor the Japanese India Anka Wat and etc. What happen in Europe was nothing more than white or white crime which was common practice among whites WW2 going back over a 1000 years. Naten Vos \\nBut this genocide was not forgotten at the time itself. English journalists documented this genocide at the time which forced Leopold II to sell his colony to Belgium. So it’s not true that there was no press and no information. Of course it is true that information was much more limited than now or than information of Europe during WOII. It is ‘forgotten’ or less known now maybe because our interest is fading. And that is a sad thing. Btw: David Van Reybrouck wrote a history on Congo. Interesting read, also available in english. sabelmouse \\nthe holocaust had films, photos, super documentation. would that we had the same regarding colonial misdeeds, slave ships, and plantations. maybe people would pay more attention. i do often link pics from india during the late victorian holocausts, people being starved, and worked to death by the british empire. junktex \\nAnd then there’s the Holodomor.Bolsheviks illed over 10 million Ukrainians.One might research the ethnicity of most of the Bolsheviks. Stefaan Van Damme \\nhttps://www.youtube.com/watch?v=aS_TbWbqkSU Pooua \\nThe first few paragraphs do little more than harangue the reader and our educational system for not being familiar with an obscure king of a tiny European country more than a century ago who did horrible things in one of the most remote and impoverished parts of Africa. This is despite the fact that of the hundreds of nations that have existed in this world, many have done truly horrible things, but our educational system can barely cover our own country, with little mention beyond about a half-dozen others. Just how broad and deep do you think our educational system ought to cover world and human events? Speaking of which, what was the Ottoman Empire doing at the same time as this king? Irina Godunko \\nYou don’t have to go that far in history to see what “Caucasians” did and doing in the richest continent on Earth. Just watch “Power Principal” on Youtube. Robert Ede \\nwhat about the mohammedan slave trade of Africans for Labour and of White women for sex slaves? tom \\nThe west didn’t erase anything from history. I and my siblings grew up in the Netherlands on the border with Belguim and some were educated in the Netherlands and others in Belgium, in both countries this subject together with other colonial subjects (Indonesia, Suriname etc.) is a big part of the history curriculum. Simone Lisa \\nWonder why he is suddenly of interest, precisely Belgian. TecumsehUnfaced \\nDid you know that Leopold’s main man in the Congo, Emile Francqui, was a good friend of Herbert Hoover? They met in China, while taking turns looting the Chinese. Francqui also help Hoover run the the Belgian Relief con game to keep Germany fed and fighting. They both had their bankster links. Hoover was brought back to th e States to play patsy in the bankster engineered 1929 crash. David Acosta Juan \\n“European capitalist monarchs” Dude, capitalism is an economic system that, by its very nature, goes against slavery, oppression, and even against monarchy. Capitalism is about freedom: without freedom there’s no free-market, and without free-market there’s no capitalism. Do yourself a favor a identify the right enemy: the State. Leopold was no capitalist: he was an arrogant aristocratic despot in charge of a colonialist state. TecumsehUnfaced'"}, "time": 1742562932.6093657}