{"duration": 0.045635223388671875, "input_args": {"text": "'On Saturday, former Vice President Joe Biden railed against the “disorienting” and “disheartening” “forces of populism” at home and abroad and implied that Donald Trump legitimized “hate speech” during the 2016 presidential election.  Speaking at Cornell University’s Convocation ceremony, Biden conceded that “globalization has cost some” people their livelihoods” and that is why the last election proved that “playing to their fears rather than their hopes and better angels” can still be a “powerful political tool. ” He spoke about the “the forces of populism not only here but around the world” that called “to close our nation’s gates against the challenges of a rapidly changing world. ” Though he said the rise of populism was “disorienting” and “disheartening,” Biden argued that it was just a “temporary state of affairs. ” Biden then implied that Trump, in the last election, “churned up some of the ugliest realities that still remain in our country” along with the “coarsest rhetoric” and “darkest emotions. ” “I thought we had passed the days where it was acceptable for political leaders at local and national levels to bestow legitimacy on hate speech and fringe ideologies,” Biden said. He said since the “world is changing so rapidly, there are a lot of folks out there who both are afraid and susceptible to this kind of negative appeal. ” “The immigrant, the minority, the transgender —  anyone not like me became a scapegoat,” Biden said, again taking swipes at Trump without naming him. “Just build a wall. Keep Muslims from coming into the United States. ” He also urged the graduating seniors to “fight the urge to build a     and   echo chamber of yourself online. ” “Living in your screens encourages shallow and antiseptic relationships that make it too easy to reduce the other to stereotypes,” he said. Last week, Biden, who may decide to run for president in 2020 and would need strong support from black Democrats if he does indeed make a run at the White House, echoed similar themes when he addressed graduates of Morgan State University, a historically black college. Biden implied that Trump stoked “our darkest emotions” and added that “we saw just how much of a grip racism and sexism has on America” in the last election, “Even you were surprised that by the way racism was embraced as a political tool on a national level,” Biden told the students at the historically black college. Biden told the audience that “black lives do matter” and “it has to be said. I’m not being solicitous. ” The former vice president said last week that racism “is still deeply embedded in our culture” and spoke about racism in police departments, education, housing, and the hiring process. “No one has to tell you about the daily indignities of discrimination,” Biden said, telling the graduates that he knew they lived it in “subtle ways. ”'"}, "time": 1742563563.6977723}