{"duration": 0.24806547164916992, "input_args": {"text": "'Nuclear weapons In fact, Russia is not about to go to war with America. Much of its language is no more than bluster. But it does pose a threat to stability and order. And the first step to answering that threat is to understand that Russian belligerence is not a sign of resurgence, but of a chronic, debilitating weakness. Vlad the invader As our special report this week sets out, Russia confronts grave problems in its economy, politics and society. Its population is ageing and is expected to shrink by 10% by 2050. An attempt to use the windfall from the commodity boom to modernise the state and its economy fell flat. Instead Mr Putin has presided over a huge increase in government: between 2005 and 2015, the share of Russian GDP that comes from public spending and state-controlled firms rose from 35% to 70%. Having grown by 7% a year at the start of Mr Putin’s reign, the economy is now shrinking. Sanctions are partly to blame, but corruption and a fall in the price of oil matter more. The Kremlin decides who gets rich and stays that way. Vladimir Yevtushenkov, a Russian tycoon, was detained for three months in 2014. When he emerged, he had surrendered his oil company. Mr Putin has sought to offset vulnerability at home with aggression abroad. With their mass protests after election-rigging in 2011-12, Russia’s sophisticated urban middle classes showed that they yearn for a modern state. When the oil price was high, Mr Putin could resist them by buying support. Now he shores up his power by waging foreign wars and using his propaganda tools to whip up nationalism. He is wary of giving any ground to Western ideas because Russia’s political system, though adept at repression, is brittle. Institutions that would underpin a prosperous Russia, such as the rule of law, free media, democracy and open competition, pose an existential threat to Mr Putin’s rotten state. For much of his time in office Mr Obama has assumed that, because Russia is a declining power, he need not pay it much heed. Yet a weak, insecure, unpredictable country with nuclear weapons is dangerous—more so, in some ways, even than the Soviet Union was. Unlike Soviet leaders after Stalin, Mr Putin rules alone, unchecked by a Politburo or by having witnessed the second world war’s devastation. He could remain in charge for years to come. Age is unlikely to mellow him. Mr Obama increasingly says the right things about Putinism—he sounded reasonably tough during a press conference this week—but Mr Putin has learned that he can defy America and come out on top. Mild Western sanctions make ordinary Russians worse off, but they also give the people an enemy to unite against, and Mr Putin something to blame for the economic damage caused by his own policies. Ivan the bearable What should the West do? Time is on its side. A declining power needs containing until it is eventually overrun by its own contradictions—even as the urge to lash out remains. Because the danger is of miscalculation and unchecked escalation, America must continue to engage in direct talks with Mr Putin even, as today, when the experience is dispiriting. Success is not measured by breakthroughs and ceasefires—welcome as those would be in a country as benighted as Syria—but by lowering the chances of a Russian blunder. Nuclear miscalculation would be the worst kind of all. Hence the talks need to include nuclear-arms control as well as improved military-to-military relations, in the hope that nuclear weapons can be kept separate from other issues, as they were in Soviet times. That will be hard because, as Russia declines, it will see its nuclear arsenal as an enduring advantage. Another area of dispute will be Russia’s near abroad. Ukraine shows how Mr Putin seeks to destabilise countries as a way to stop them drifting out of Russia’s orbit (see article ). America’s next president must declare that, contrary to what Mr Trump has said, if Russia uses such tactics against a NATO member, such as Latvia or Estonia, the alliance will treat it as an attack on them all. Separately the West needs to make it clear that, if Russia engages in large-scale aggression against non-NATO allies, such as Georgia and Ukraine, it reserves the right to arm them. Above all the West needs to keep its head. Russian interference in America’s presidential election merits measured retaliation. But the West can withstand such “active measures”. Russia does not pretend to offer the world an attractive ideology or vision. Instead its propaganda aims to discredit and erode universal liberal values by nurturing the idea that the West is just as corrupt as Russia, and that its political system is just as rigged. It wants to create a divided West that has lost faith in its ability to shape the world. In response, the West should be united and firm. This article appeared in the Print Edition with the headline: Putinism \\nCrosslinked at the Moscow-Beijing Express: http://thesaker.is/putin-and-xi-in-western-propaganda-why-does-xjp-get-off-so-lightly/ Podcast is available on SoundCloud or at the bottom of this webpage: https://soundcloud.com/44-days/putin-and-xi-in-western-propaganda-why-does-xjp-get-off-so-lightly-161029 \\nA recent cover and main article in the Economist , pictured above, reminds me of just how hyperbolic and ideological is the West’s propaganda against Russian President Vladimir Putin. While maybe good polemical fodder as a cartoon on the editorial page, the fact that this demonic caricature merits front cover status, indicates just how programmed and institutionalized Western mainstream media is. Westerners love to insult the Anti-West press for being “party organs” and “government mouthpieces”. But, why travel so far? They only need to stay home with their national New York Times, Radio France and BBC , to really appreciate Bernaysian psyops being passed off as serious journalism (as in Edward Bernays). I don’t call it living behind the Great Western Firewall for nothing. \\nI have a friend whose email signature is “Blame it on Putin”. For a while, he changed it to “Blame it on China”. But that didn’t last long and he recently changed it back. As we have seen with the most depressing predictability, President Putin, specifically, and Russia in general are the voodoo pin dolls of Western racism and demonization of another people (Slavs) and other religions (Orthodox Christianity, as well as widespread Islam and Buddhism in Siberia). http://chinarising.puntopress.com/2015/10/01/slavs-and-the-yellow-peril-are-niggers-brutes-and-beasts-in-the-eyes-of-western-empire-the-saker-44-days-radio-sinoland-2015-10-1/ \\nWhat is so remarkable is how unhinged and psychopathic the West’s racist propaganda is against Putin & Co., compared to the attacks on China’s President Xi Jinping (XJP) and the Chinese people. It transgresses irrational fear, to the point of being sick, black humor. Yet, about the most polemical front cover against XJP was Time magazine in April, 2016, seen below. Making China’s leader look like a Mao Zedong- Blade Runner replicant is tame and almost quaint, compared to the Orwellian “Emmanuel Goldstein” tsunami being launched nonstop against Putin. \\n\\nPretty tame stuff, this, compared to the racist feeding frenzy that Western propaganda is ginning up against Russian President Vladimir Putin and his Slavic countrymen. \\nTrue, Russia has the longest border with what in now considered “Europe”, and there is tremendous historical Western precedence to keep Germany from forming any kind of economic or geopolitical alliance with Russia. As well, the West’s Ukrainian color revolution turned out to be a total genocidal failure, with Russia reintegrating Crimea and Donbass biding its time for a hopeful remarriage in the years to come. Needless to say, the revenge factor, and if there is anything that Western tyranny loves more, it’s to avenge its long list of failed chaos and extermination around the world. \\nBut, Russia is officially a capitalist country. Its current constitution was largely written by American fifth columnists. The Russian Central Bank is widely presumed to be under the thumb of the West’s oil banking families. In spite of widespread ignorance around the world, on these two counts, China can definitely list itself in the opposing column. http://chinarising.puntopress.com/2016/10/18/so-called-communist-china-an-exclusive-article-for-the-all-china-review-16-10-17/ . Given America’s post-1917, deranged, hysterical fear of, and untold billions spent to crush any communist expression at home and around the world, you would think that red China and Xi would be Public Enemy Number One. But no, it’s Putin and the Russians. \\nOne factor might be Western perceptions of Russia’s and China’s military strength. Russians have shown off their powerful, well-run army, navy and air force in Syria and the Black Sea. The West is probably in a bit of an historic rut, when looking at China’s rapidly modernizing People’s Liberation Army (PLA), like back to the Korean War, when the just liberated New China had no air force, no navy and no nuclear missiles, yet still kicked the pants off Uncle Sam, using mostly World War I vintage arms. But then again, nobody in the West will ever admit that they lost the Korean War in the first place. http://chinarising.puntopress.com/2016/09/04/from-may-9th-in-moscow-to-september-3rd-in-beijing-the-anti-west-order-comes-full-circle-reprint/ . I can tell you that here in China, just like 1950-1953, XJP and the PLA do not fear American military power, not one iota. Respect it, yes. Fear it, never. President Xi has put the PLA on combat ready war footing and he means it. http://www.globaltimes.cn/content/966932.shtml \\nBut there is a new gadfly in America’s imperial ointment, one who may push President Xi and the Chinese people up the racist hate-o-meter, to Slavic levels, and that menace is the Philippines’ new president, Rodrigo Duterte. http://chinarising.puntopress.com/2016/09/17/puppet-japan-saves-uncle-sams-face-in-south-china-sea-after-philippines-principled-stand-vs-imperialism-jeff-j-brown-on-press-tv/ . This plainspoken, no bullshit world leader is Uncle Sam’s worst nightmare. He is calling American empire what it is: genocidal, dictatorial and rapacious. Not once, but day after day, meeting after meeting, press conference after press conference. \\nAt September 8-9, 2016’s ASEAN summit in Laos, Duterte showed a colonial era photo and talked about the genocide that the US committed, as it brutally conquered the Philippines, 1899-1913, killing an estimated 1.25 million people, about 25% of the nation’s population. Western media censored it like the plague (they have been anyway, for over a century) and even semi-friendly outlets like the South China Morning Post were aghast that he actually associated the West with genocide. Heaven forbid! This, in spite of the fact the easily 80-90% of history’s genocides and exterminations were and are being perpetrated by Eurangloland, including of course Israel. Behind the Great Western Firewall, genocide is exclusively reserved for powerless, dark skinned people and unrepentant socialists, like Serbia’s framed and destroyed Slobodan Milosevic. President Rodrigo Duterte shows images of the Bud Dajo massacre during his speech at the 2016 Metrobank Foundation’s Outstanding Filipinos awarding ceremony in Malacañan’s Rizal Hall on September 12. REY BANIQUET/PPD \\nSpeaking truth to imperial power, Duterte gives a blunt lesson on Western genocide, during the recent ASEAN summit in Laos. How dare you tell it like it is! (Image by Baidu.com) \\nDuterte is a semi-official socialist-populist. His cabinet is inclusive and consultative, with former imprisoned and exiled political opposition leaders, including communists and Muslims. He clearly can’t stand America’s grotesque, imperial arrogance and tyranny, in a country that has been a pliant doormat for US mayhem and exploitation in Asia, going back to the turn of the 19 th -20 th century. When Duterte’s hometown of Davao was hit with a very suspicious, false flag smelling public market bombing, on September 2, 2016, he suggested that the automatic-to-blame Abu Sayyef Group, a Muslim independence outfit on his island of Mindanao, is controlled by US Special Forces based there, which is of course true. But, world leaders aren’t supposed to speak truth to power, especially “little brown brothers”, as Filipino Foreign Minister Perfecto Yasay has described America’s attitude to his long suffering and abused nation. http://www.philstar.com/headlines/2016/09/17/1624575/dfa-chief-philippines-no-little-brown-brother-us \\nAfter signing with XJP more than three times as many development deals ($15 billion), as the US has totally invested to date in the Philippines ($4.7 billion), Duterte declared to the world that the “US has lost” and that his country was realigning with Baba Beijing. His official government/trade delegation had an unprecedented 300 members and another 150 business people paid their own way to join the Asian lovefest. The two sides set up bilateral committees to discuss and negotiate their South China Sea claims, which is anathema to Uncle Sam, who always insists on being the rabid Rottweiler in the middle. Next stop was US prostitute Japan, where he further declared that the Philippines would be free of all foreign military (meaning US marines and special forces), something that has not happened since 1521, when Spain began colonizing and raping the archipelago. \\nThis is all very powerful, history changing geopolitics. Almost every other world leader who has talked and acted like this, has either been overthrown and/or murdered by the West, sooner than later. Clearly, from the perspective of the West, Duterte’s visionary, regional reset is closely tied to President Xi and China. It is for this reason that XJP may be getting the Slavic-Putin treatment on an accelerated schedule, in a desperate attempt to trash China’s deep, historical leadership and trust role in Asia. \\nThe old story about people being able to see that the emperor is not wearing any clothes, is very apropos to Duterte. He is shouting out to the world that Western empire is a colossal failure and humiliation for his impoverished, exploited citizens, and by extension, equally so for every other member of humanity outside Eurangloland. http://chinarising.puntopress.com/2016/07/16/communist-china-vs-capitalist-philippines-vs-imperial-france-china-rising-radio-sinoland-160716/ . Once one person pierces the veil, it emboldens others to finally have the courage to pile on. \\nFor Uncle Sam, it’s already happening. Malaysian Prime Minster Najib Razak is visiting XJP and Co. in Beijing, October 31-November 6, 2016, an unusually long state visit by a world leader. Najib has declared that Malaysia is committed to strengthening friendship with China and pushing ties to “new highs”. http://www.reuters.com/article/us-malaysia-china-idUSKCN12R0ZU . As more and more countries embrace China’s history founding One Belt One Road plan, in which the whole world is and will benefit into the 22 nd century, including Eurangloland, expect ever more desperate, racist demonization and dehumanization of Xi Jinping and the Chinese people, along the lines of Putin and the Russians. Maybe the CIA-MI6 can dig up that old 19 th century chestnut, “The Yellow Peril”, and give it a modern day makeover. Stay tuned to the New York Times, Radio France and the BBC , as the propaganda psyops campaign takes shape. \\nAs more and more world leaders are emboldened to speak out against Western tyranny, thanks to Filipino President Rodrigo Duterte’s courage to make a public stand, President Xi Jinping can expect his face to morph into Putin’s, who is diabolically pictured above on a January, 2014 Newsweek cover. \\nABOUT JEFF BROWN Jeff J. Brown—TGP’s Beijing correspondent— is the author of 44 Days (2013), Reflections in Sinoland – Musings and Anecdotes from the Belly of the New Century Beast (summer 2015), and Doctor WriteRead’s Treasure Trove to Great English (2015). He is currently writing an historical fiction, Red Letters – The Diaries of Xi Jinping , due out in 2016. In addition, a new anthology on China, China Rising, Capitalist Roads, Socialist Destinations , is also scheduled for publication this summer. Jeff is commissioned to write monthly articles for The Saker and The Greanville Post , touching on all things China, and the international political & cultural scene In China, he has been a speaker at TEDx , the Bookworm Literary Festival, the Capital M Literary Festival, the Hutong, as well as being featured in an 18-part series of interviews on Radio Beijing AM774 , with former BBC journalist, Bruce Connolly. He has guest lectured at international schools in Beijing and Tianjin. Jeff grew up in the heartland of the United States, Oklahoma, and graduated from Oklahoma State University. He went to Brazil while in graduate school at Purdue University, to seek his fortune, which whet his appetite for traveling the globe. This helped inspire him to be a Peace Corps Volunteer in Tunisia in 1980 and he lived and worked in Africa, the Middle East, China and Europe for the next 21 years. All the while, he mastered Portuguese, Arabic, French and Mandarin, while traveling to over 85 countries. He then returned to America for nine years, whereupon he moved back to China in 2010. He currently lives in Beijing with his wife, where he writes, while being a school teacher in an international school. Jeff is a dual national French-American. \\nChina Rising Radio Sinoland Outlets CHINA RISING ON RADIO. CLICK HERE FOR INFO'"}, "time": 1742563114.5480988}