{"duration": 0.21973133087158203, "input_args": {"text": "\"[Photo: Before and after mountain top removal for coal extraction. Devastation brought to you by the Koch Brothers. Credit: Earth Justice.] =By= The Real News Network Editor's Note \\nWe are at the point in Earth history, the breaking point. Humanity, (let’s be fair shall we?) western “civilization” has virtually killed the only home we have. There is no place for homeless humanity to go when this home becomes habitable only for cockroaches and similarly hardy beasts. Those in the worst offender nation, the United States, have allowed themselves to be pacified into disbelief that we are, or even can, destroy the only home we have. Much of that willing disbelief is founded on a welll orchestrated propaganda campagn carried out by the fossil fuel industry and the owners of it such as the Koch Brothers. The video below examines this decades long campaign that has been waged to lead a willing populace to the graveyard of humanity. \\nWe are literally at a point where days matter in reversing course. We (humanity) does not have centuries to address this problem. We don’t even have decades. Some argue that if something significant is not done by 2017 to radically reduce the production of global warming gasses that it will be too late to avoid the worst that is coming at us. We are talking months – not years. Recognizing the urgency, many organizations and publications are devoting major effort to addressing the destruction of our world. The Real News Network is starting a Global Climate Change Bureau. The Greanville Post and Uncommon Thought Journal are dedicated to bringing you consistent news, analysis, and engagement opportunities focused on ACD ( Anthropogenic Climate Disruption ) – as Dahr Jamail argues, ACD clear puts the blame for the problem on humans. Please join us in this effort and send pertinent materials to Rowan Wolf at managing.ed@greanvillepost.com . \\nFrom The Real News Network \\nScientists say Temperatures Will Rise to Critical 2° by 2050 \\nThe Real News Network is Building a Global Climate Change Bureau \\n2014 and 2015 each set the record for hottest calendar year since scientists began measuring surface temperatures over 150 years ago, and 2016 is shaping up to be even warmer. This will be the first time that we’ve seen three consecutive years with record-breaking temperatures. \\nA temperature increase of two degrees Celsius (3.6 degrees Fahrenheit) above pre-industrial levels will now be reached much sooner than earlier predicted according to a report by seven leading climate scientists. \\n“The 1.5°C target could be reached by the early 2030’s and the 2°C target by 2050” says the report that included Sir Robert Watson, former Chair of the Intergovernmental Panel on Climate Change (IPCC). The scientists say that even if all the pledges made by the signatory countries to the Paris agreement are fully implemented, climate will pass this dangerous mark in 34 years. \\nThis is a threshold that most scientists have warned cannot be crossed without dire consequences, including a rise in sea levels of several feet that would flood many coastal cities in the U.S., longer droughts, more intense heat waves that cause a major disruption in the world’s food supply, and large migrations of people from countries of the global south. \\nIt is also a point where it becomes far more difficult to reverse the warming trend. Some scientists suggest temperatures by the end of the century could rise as much as 4-6°C above pre-industrial levels. [1°C equals 1.8°F, so this is a temperature rise of 7.2-10.8°F] \\nThe report titled The Truth About Climate Change says, “Much of the public believes that climate change is only going to happen by the end of the century,” and that this is a misunderstanding of the urgency. Unless there is a dramatic change in current public policy, most people alive today will live to see the 2°C threshold crossed. \\nThe report continues: “Climate change is happening now, and much faster than anticipated.” Climate change related floods, droughts, more intense storms, heat waves, and wildfires have already had devastating effects on livelihoods, infrastructure, and lives.” \\nIf the 2°C threshold is to be avoided, the report calls for far more aggressive targets than those set by the Paris Agreement and for that action to begin immediately. The report says, “To meet the 2°C target, global CO2 emissions should be net zero by 2060-2075.” \\nThe threat is catastrophic, the science overwhelming. So why aren’t solutions to the climate change crisis at the top of the political agenda? \\nWhy don’t we see millions of people in the streets demanding decisive action? Why isn’t this a major issue in the election debates? Why are politicians who deny the existence of human-caused climate change even elected to office? \\nThe lack of American public engagement in the climate crisis is a global concern. If U.S. policy doesn’t change, human life as we know it and thousands of other species will not survive. \\nAccording to a Yale survey, 70% of Americans now believe global warming is real. If so, why isn’t there more political pressure to face up to the crisis? \\nDig further into the numbers and the state of public opinion is more fully revealed. Of those who believe climate change is real, only half (53%) think that global warming is mostly human caused. One in three (34%) believe it is due mostly to natural changes in the environment. Only about one in ten Americans understand that nearly all climate scientists (more than 90%) are convinced that human-caused global warming is happening. Over half of Americans (58%) say they are at least “somewhat worried” about global warming, but only 16% say they are “very worried.” \\nWhy are only 16% of people surveyed very worried about what 90% of scientists think is a catastrophic threat? \\nThe Koch Brothers’ war on science certainly plays a major role in promoting doubt about the overwhelming scientific evidence of human-caused climate change. They spend millions financing witch hunts against climate scientists and funding “research” designed to confuse public opinion. \\nThe Kochs and other billionaires with a vested interest pour hundreds of millions into the coffers of politicians willing to obstruct legislation that would regulate fossil fuel and promote a green sustainable economy. \\nPerhaps as responsible for the gap between public opinion and scientific evidence is corporate television news, “The gatekeeper of public consciousness.” \\nFirstly, they ignore the crisis. The report cited above was not the lead story on television newscasts. We can’t find evidence it was carried by any U.S. television news outlet at all . \\nAccording to a Media Matters report, the four major corporate TV networks aired a total 146 minutes of climate change coverage in 2015. ABC only aired 13 minutes of coverage and Fox’s coverage consisted mostly of “criticism of efforts to address climate change.” \\nThe report continues: CNN aired almost five times as much oil industry advertising as climate change-related coverage in the one-week periods following the announcements that 2015 was the hottest year on record and February 2016 was the most abnormally hot month on record. \\nOnly 16% of Americans are “very worried” about global warming because corporate TV news doesn’t want us to worry about it. \\nLarry Wilkerson, former chief of staff to Secretary of State Colin Powell, says: While US foreign policy is mostly responsible for the growth of militant terrorist groups, the threat of a nuclear terrorist attack is existential. Think about what we’ll do when 500,000 people are killed in New York City. We will declare martial law nationwide. We will be the most draconian tyranny you’ve ever seen on the face of this earth. But still I consider climate change a greater danger because it is a threat to the very survival of the human race. \\nWhat are the reasons for corporate TV’s lack of interest in the major news story of the century?The obvious answers are pressure from certain advertisers, the interests of corporate ownership, and the political intrigues of the fossil fuel industry. \\nBut I think it goes even deeper. \\nIn 2009, two years after the Fourth IPCC Assessment Report said, “Warming of the climate system is unequivocal,” TV coverage of climate change was at its height – a whopping 205 minutes for the entire year. Even former Republican Speaker of the House Newt Gingrich appeared in an ad with Democratic Speaker of the House Nancy Pelosi calling for action on climate warming. \\nThen something happened. \\nA large section of the elites looked at what it would really take to meet the target scientists said was necessary to mitigate and stop the terrible consequences of climate change. They said, “No way.” \\nThe transformation required to drastically reduce the use of fossil fuels and move to a green economy would change who has power and how business is done. There is no way to achieve the necessary reduction in carbon emissions without serious government regulation, a strengthening of the public sector, and massive public investment. All this requires a reduction in the political power of the fossil fuel industry and the financial elites associated with it. \\nGingrich renounced the Pelosi ad in 2011. \\nThe majority of the billionaires who control the commanding heights of the economy and politics are more interested in short-term profits and immediate personal gratification than some “long-term” threat. They either fight against all climate change legislative action or support relatively weak measures to reduce carbon emissions – better than nothing, but far from what scientists say is required. \\nFor most people of wealth it comes down to a simple calculation: My family and I will be ok . As the IPCC puts it: “Risks are unevenly distributed and are generally greater for disadvantaged people and communities in countries at all levels of development.” \\nPeople who understand the scale of the systemic risk are marginalized by corporate media and thus are marginalized in politics. \\nA critical task in engaging large numbers of ordinary people in fighting and voting for a rational climate change policy is breaking the corporate monopoly on daily video news. We must create an independent, uncompromising source of global climate change news and investigative reports. \\nThe very first story ever produced by TRNN in 2007 was an interview series with George Monbiot on the urgent climate change threat. We produced a series titled “Who Cares About Bangladesh” soon afterwards. \\nWe reported directly from the COP21 Climate Conference in Paris. \\nWe did in-depth interviews with climatologists like Dr. Alan Robock and Dr. Michael Mann who both worked on the United Nations’ Intergovernmental Panel on Climate Change. \\nEconomist Robert Pollin has appeared in numerous interviews with specific proposals for a transition to a green economy. \\nWe recently interviewed the esteemed actor Emma Thompson while she was onboard a Greenpeace vessel in the Arctic. \\nWe’ve reported on environmental activism from all over the world. \\nWe will soon be releasing the documentary “The Doubt Machine: The Koch Brothers War on Climate Science” narrated by Emma Thompson. \\nWith our limited resources we have produced more than 535 reports on climate change since the fall of 2007 when we started our service. In 2015, we produced 1029 minutes of programming about climate change. That’s more than seven times of all the major networks combined . \\nWe have produced more than 10,000 reports and interviews overall since we began our daily production. We also cover international and national news and now have a bureau in Baltimore reporting on the problems and solutions to the crisis of urban America. Millions of people have watched. We average 1.5 million views per month. \\nWhile we have worked hard to keep a focus on climate change, what we have accomplished is far from enough. We need a Climate Bureau with sufficient resources to become a major daily video climate news service for online and TV. \\nThe power of daily video news is what shapes most people’s world view and the field is dominated by news organizations that will not seriously address the problem or are in fact, part of the “doubt machine.” \\nIt is clear that a radical change in the way the world produces and uses energy is required. Currently, about 82% of energy produced in the world is obtained by burning fossil fuels. How we produce energy without burning fossil fuels will be critically important as the world population is expected to grow by 40% to 10 billion by 2050. \\nPlease go to The Real News in order to read the rest of their plans for their new Global Climate Change Bureau (GCCB).\""}, "time": 1742561885.1607606}