{"duration": 0.15698742866516113, "input_args": {"text": "'When Sofia Richie chopped her hair and visited a doctor’s office recently, Us Weekly was there. Not to be outdone, People heralded Mindy McKnight as “the voice for millennial moms. ” And In Touch offered an “adorable” picture of Sarah Wright Olsen’s infant napping next to a plush rabbit. Meet the striving celebrity underclass that has risen to dominate the gossip machine. Aspiring models,   reality show stars,    actors, YouTube vloggers and viral news subjects can now all curry coverage just by replenishing their social media accounts with photos of their babies, their butts or both. These are people you’ve probably never heard of  —   or have a nagging suspicion you might have, but don’t quite know why. For the record, Ms. Richie is a teenager best known for appearing on Justin Bieber’s Instagram account (not to mention being Lionel Richie’s daughter). Ms. McKnight films hair tutorials on YouTube. And because In Touch didn’t bother to explain who Ms. Wright Olsen even is, I Googled it. Turns out that after a supporting role on the   NBC sitcom “Marry Me,” she now runs a parenting blog. These   have crept onto our radar through our supermarket tabloids and Facebook news feeds, and a crop of publications has emerged to cover them, whether sincerely or satirically. The relentless Instagram gossip outpost The Shade Room airs their dirty laundry, the deliciously absurd podcast “Who? Weekly” pokes fun at their claims to fame, and Time Inc. ’s shiny new digital celebrity site, Instant. me, hopes to build on their brands. It used to be that the only way a   person could land in the pages of the glossy celebrity magazines was to lose 100 pounds, serve as some heartwarming testimony to    American values, or be murdered. But in the early aughts, the magazines started diversifying their coverage of Hollywood’s leading Jens and Bens with stories on the romantic dupes and plastic surgery nightmares of reality television. Now, as the rise of social media demolishes the leverage that celebrity tabloids once had over their most famous subjects, the gossip industry keeps defining celebrity downward. (After all, no magazine can match the reach of Taylor Swift’s more than 90 million Instagram fans or Kim Kardashian West’s 47 million Twitter followers.) When Ms. Kardashian West first rose to prominence, commentators sneered that she was “famous for nothing. ” The accusation seems quaint now: Tabloids have moved on from covering reality television stars like Ms. Kardashian West to following reality TV supporting characters, former reality TV stars, friends and exes of former reality TV stars  —   even people who post their own family dramas straight to YouTube. These days, gossip sites are also fueled by figures largely famous for doing nothing much. Jeremy Meeks, whose image went viral when Twitter swooned for his hot mug shot, has popped up on the websites of Us Weekly and People since his release from prison earlier this year. Instagram models like Ms. Richie, Sahara Ray and Bronte Blampied can milk months of coverage out of a couple of shots of themselves posing with Mr. Bieber. And Refinery29 recently ran a   spread on the “Gucci Gang,” a group of four stylish      Parisian girls whose central accomplishment is attracting a combined 50, 000 Instagram followers. As the de facto crew leader, Angelina Woreth, put it, “It’s easy to hate us, actually, because we are not doing something, we’re not really doing anything. ” Across the web, a new gossip press further enables these lesser celebrity castes. Drama generated by the young stars of YouTube, Vine and Musical. ly churns through nimble aggregation centers like Superfame and Trending All Day. The freewheeling Guru Gossip forum cuts through the glittery facade of online beauty gurus, while Get Off My Internets deflates the egos of the   set. And The Shade Room, a   gossip site focusing on black celebrities, pulls in 6. 1 million Instagram followers. While it posts plenty of news on known quantities (Beyoncé, Drake, Kevin Durant) it recognizes that some of the juiciest material comes from the smaller players (Tameka Harris, Karlie Redd, Keke Wyatt) who keep their names circulating on Twitter by spilling their guts on Instagram. Then there is “Who? Weekly,” the cutting podcast in which the hosts, Lindsey Weber and Bobby Finger, guide listeners through celebrity’s confounding new frontier. The podcast’s name derives from the typical reaction of a layperson to reading a noncelebrity’s name in the news. As the hosts explained in a handy primer published in July, “the subjects of gossip coverage can be divided into two categories: Whos (as in: *furrows brow* Who?) and Thems (as in: ‘Oh, them. ’)” On a recent episode, they take on Brittany Farrar, the   of Aaron Rodgers’s little brother, Jordan Rodgers (who is now dating the “Bachelorette” star JoJo Fletcher) who recently accused Jordan of cheating in a series of Instagram posts. “Why are we still hearing about her?” Ms. Weber asked. Mr. Finger replied: “Because she wants us  —   she did her due diligence in making sure we talked about her. ” And just like that: A Who was born. Legacy media companies are dancing as fast as they can to keep up. In May, Time Inc. debuted Instant. me, dedicated to covering the foot soldiers of social media. Instant sells its subjects  —   a constellation of YouTube creators, Snapchat fitness models and   pets  —   as “The New Famous. ” It’s illustrated with a Tumblr aesthetic (dancing pizzas, glimmering diamonds, waving koalas) and littered with   emoji. The institutional voice is synergetic   like: “We’re hungryyyyyy and these slow cooker chicken tamales from Cooking Light sound amazinggggg. ” (Cooking Light is a Time Inc. property.) The site is sponsored exclusively by Degree, and every few minutes, Instant. me’s social stars jump eagerly into a deodorant ad. Instant’s prerogative is to constantly surface social faces (the recurring segment “Who to Follow” offers dossiers on emerging talents) while inspiring Instant viewers to join their ranks (“Just the Tip,” another segment, gives advice on how to build your own social fandom). A   can watch Instant. me for hours without seeing a recognizable name, and that’s kind of the point. “The goal with Instant is for my grandmother to be able to go onto the site and enjoy herself and get caught up,” Kirstin Benson, Instant’s editorial director, told Adweek in July. Time Inc. has started a kind of   publication on the   just as the internet has atomized celebrity into a zillion tiny fandoms. Few people are typically energized by the generic category of “social media figure. ” They get their kicks by closely following a select few of their favorite stars, the stars’ friends and family, and a network of (often infighting) fans. The obsessive monitoring of all these channels drums up sufficient drama to create an enduring story line, even if only a few thousand people can manage to follow along. Plus, the setup provides fans the illusion of power in determining which Whos become Thems (Blac Chyna, a rap video vixen engaged to Rob Kardashian, is on her way toward   recognition) and which seem destined to fade into permanent obscurity (I’m sorry, Sarah Wright Olsen). But these modern fandoms produce grist for   too. There’s something deliciously surreal about monitoring the online movements of the barely famous, a class of people who are just unpolished, desperate and savvy enough to act mad, sloppy and sexy. The fact that publications like People and Us Weekly are covering it with a straight face adds another absurd layer. Besides, these people are assaulting our social feeds every day whether we like it or not. Outlets like The Shade Room and “Who? Weekly” have managed to extract bits of hilarity, delight and shame out of that arid media landscape. They have intuited what the traditional tabloids don’t quite get: The pursuit of celebrity has emerged as a grand tabloid narrative in and of itself.'"}, "time": 1742562557.553354}