{"duration": 0.0835261344909668, "input_args": {"text": "'Share This Sadiq Mohammad, 20, thought it would be funny to dress up as a clown and terrorize civilians. Unbeknownst to him, he would be the one getting the scare of his life. \\nAfter hearing about the creepy clown trend sweeping the nation, a Muslim man decided to start off Halloween by donning a “killer clown” costume and attacking unsuspecting victims. However, as soon as he approached his next target, he quickly realized that not every infidel is going to take his idiocy lying down. \\nJust last year, a Muslim prankster thought it would be funny to use his inherently violent and historically deadly religion to terrorize innocent civilians for laughs and views on his social media accounts. In December, a group of YouTube tricksters, dubbed the Jalals, dressed in traditional Arab attire and hurled suspicious packages at random strangers , making them think they were about to be bombed. Drawing from this idea, a fellow YouTuber decided to hone in on the creepy clown trend, chasing down petrified bystanders for his own entertainment. Unfortunately for him, he got his own dose of terror when he picked on the wrong man. \\nSadiq Mohammad, the 20-year-old Muslim mind behind the YouTube channel HoodClips, donned a sinister-looking clown mask and filmed himself stalking unsuspecting onlookers on the streets of Stockton, California. As expected, most of his targets ran away in horror. However, one man decided not only to fight back but turn the terror back on Mohammad. \\nGuns.com reports that Mohammad was given a brutal taste of his own medicine after his intended target pulled out a firearm and pistol-whipped him in the head. The Muslim prankster leaped out of the bushes in an attempt to startle the unknown man, immediately discovering that he would be the one fearing for his life. \\n“Why you gonna play that s**t in Stockton, brother?” the man asks. “That s**t done-a** played out, bro,” he adds, referring to the recent spate of clown pranks. “I ought to pop your dumb a**.” \\nAccording toÂ Daily Mail , Mohammad instantly regretted his bullying attempt, running for cover as the hooded individual graciously allowed him to retreat without further injury. Realizing that some people don’t find his joke at their expense amusing, Mohammad has now sworn to hang up his clown costume for good. \\n“Lesson learned is, people donâ\\x80\\x99t play with the clown stuff,” Mohammad told KCRA . “Like, people really will shoot anybody.” \\nUnfortunately, there are some who say that the man’s reaction wasn’t justified. Sacramento attorney Kresta Daly alleges that “pulling a gun was too much” since Mohammad claimed that the tactics were just part of a prank. Of course, Daly refuses to acknowledge that just because a threatening individual says that their behavior is part of a prank doesn’t mean they’re telling the truth. \\nJust 2 days ago, a San Diego man told police that he was stabbed multiple times by 4 people dressed up as clowns. The victim was left with gashes in his left cheek, right shoulder, and lower abdomen but is expected to make a full recovery. \\nSimilarly, a 16-year-old was stabbed and killed by an assailant in a clown mask in Reading, Pennsylvania in September. The teen was attending a party when a fight broke out, prompting an unknown suspect in the costume to repeatedly stab him. \\nMohammad is lucky to be alive after his incredibly idiotic stunt. Of course, it’s probably not going to stop him from abusing innocent civilians if it means he can make money from their misfortune. After all, it was the Islamic prophet Muhammad, after whom the YouTuber is named, who exclaimed that he has “been made victorious through terror.”'"}, "time": 1742561993.0561519}