{"duration": 0.15783023834228516, "input_args": {"text": "'SAN JUAN, P. R.  —   Before she played in her last tennis tournament, Mónica Puig was pretty much like anyone else at San Juan International Airport. Her grandparents would drop her off curbside and she would wait at the gate area flipping though her phone just like anyone else, save for the occasional moments when someone recognized her and asked for a photo. But after her last tournament, at the Rio Olympics, no trip to Puerto Rico will be the same. When she landed at the airport this week, carrying the first Olympic gold medal in Puerto Rico’s history, she was met by thousands of cheering fans, a retinue of three beefy security guards and an escort of several police cars and motorcycles with lights flashing. As her motorcade drove through San Juan, people poured into the streets to greet her, even as it passed the hardscrabble Luis Llorens Torres housing project, where baseball and basketball players and boxers are usually the most idolized stars. But in the span of a week, Puig went from a   curiosity here  —   the girl born in San Juan who went to Miami and became a professional tennis player  —   to a hero, with the island’s first gold medal around her neck at age 22. “I was stunned,” Puig said in an interview at her San Juan hotel, about a mile from her grandmother’s apartment, where she spent summers as a girl. “The support I am getting here is just indescribable. I didn’t fully understand the weight of my actions until I got here. ” Puig’s impromptu parade from the airport was followed by an organized version through the streets of San Juan on Tuesday that drew thousands of supporters. It was intended to commemorate the efforts of the entire Puerto Rican Olympic squad, but without Puig, there would have been no parade. With the United States Open set to begin Monday, Puig had only a few days to soak in the appreciation of Puerto Rico and the fans who had fallen in love with her. She stood at the front of a roofless   bus, her gold medal dangling over the side, singing along with Puerto Rican pop tunes and waving to a grateful island. Waving back were grandmothers and   little girls holding red, white and blue flags gritty bikers business people pouring out of office buildings and truckers, parked in their rigs and honking their horns. There were teenagers in tank tops doctors, nurses, schoolchildren in uniform and nuns in habits. One elderly man wore a crisp, new   with an image of Puig celebrating her gold medal victory and her motto Pica Power. He held a small cardboard sign that read, “Gracias, Monica. ” “It was the most incredible experience of my life,” Puig said. “Obviously, I was overcome with emotion because you saw me crying up there. I could see it on their faces, what it meant to everyone. I felt so proud. ” Puig’s historic success came at an opportune moment for Puerto Rico, a commonwealth of the United States that is enduring hard times. The economy is faltering under the crushing weight of more than $70 billion in government debt, morale is low and fears over the Zika virus caused Major League Baseball to cancel a   series. People are leaving the island to seek their fortunes elsewhere, and it seems that the populace is divided about whether to push for statehood or become an independent nation. But Puerto Ricans here and abroad were united each time Puig took the court in Rio, the momentum building with every win. Unseeded and ranked No. 35, Puig drew scant interest for the first match she played. By the second match, people began to take notice. After she crushed No. 3 Garbiñe Muguruza, the French Open champion, in the third round, Puig had Puerto Rico’s full attention. By the time she beat the   Wimbledon champion Petra Kvitova in the semifinals, she had captivated an island. Gigi Fernández, also from San Juan, won gold in doubles in the 1992 and the 1996 Olympics, but she did it representing the United States. Before the Rio Games, Puerto Rico had captured only eight medals since it first entered the Olympics in 1948  —   two silver and six bronze. When Puig stepped onto the court to play   Angelique Kerber in the gold medal match on Aug. 13, the streets across Puerto Rico were silent and empty, according to numerous reports and accounts of dozens of people here. But when she won, people came out on the balconies of apartment buildings waving flags and shouting, cars honked their horns and people in bars and restaurants danced and hugged. “The whole island came together,” she said. “I feel like I united the island. ” She added: “I know that in Puerto Rico, not many people watch tennis or know what it is all about. But it is amazing how much a moment like that can mean for so many people. ” After Puig’s victory, Puerto Rican celebrities sent out congratulatory tweets, including the entertainers   Miranda, Jennifer Lopez, Ricky Martin, Marc Anthony and Puig’s friend Carlos Correa, the star shortstop of the Houston Astros. But this, at its core, was a victory for the average Puerto Ricans to revel in. Javier   a    puppeteer from Bayamón, was on a church mission in Nicaragua for the final, but found an internet signal and watched on his phone. “It is the greatest thing to happen to Puerto Rico,” he said Wednesday near the beautiful public tennis courts in Parque Barbosa in San Juan. “That a young woman from Puerto Rico set her mind to a goal and reached it, it gives us hope. The people here are frustrated. But it feels like everyone in Puerto Rico has a gold medal because of her. ” Puig’s sudden popularity is more remarkable considering tennis is not a big sport here. Baseball is considered the passion of the island, and basketball and boxing are immensely popular. Soccer, volleyball and maybe even judo and   may rank higher than tennis. But Puig’s mother, Astrid, played it as a girl in San Juan and earned a top ranking as a junior on the island, although she never played professionally. The Puig family moved to Miami when Monica was 1, but she and her brother returned regularly to spend summers with their grandparents. As her daughter’s tennis improved in her teenage years, Astrid said, the family decided she would play for Puerto Rico, which offered more financial support than the United States Tennis Association did. But the money was contingent upon Puig’s winning medals in events like the Pan American Games and the Central American Games. That may have etched the importance of medals in her mind. At 16, she won gold in the Central American Games, played in Puerto Rico, and last year she won bronze at the Pan American Games in Toronto. “Playing for Puerto Rico was the best decision I ever made,” Puig said. “I am so proud of my Puerto Rican roots. To pay off like this just reaffirms it. ” Puig struggled in 2015, and her ranking, once in the top 40, fell to No. 92 at the end of the year. This season, though, her road to Rio was paved with success. She reached the final at the Sydney event in January and the semifinals at Eastbourne in June to bring her into the top 40. Players are no longer awarded ranking points at the Olympics, but she seized something just as valuable there: confidence. It was buoyed after her     victory over Muguruza and then soared when she stunned Kvitova in three sets in the semifinals. In the final, against Kerber, Puig said her nerves cost her the second set. But when she led,   in the third, she promised herself she would remain calm. “That was a big, fat lie,” she said. “It was definitely the moment of my life. The most   scary, exciting mix of emotions I have ever felt. My hands were shaking. ” Her next stop is the United States Open, next week in New York. Puig knows she enjoys great support from people of Puerto Rican descent and from Caribbean nations. But she noted that now, after Rio, her appeal may broaden. “I know this will probably be one to remember,” she said. “I hope I can go far enough to make it a good memory. ” In less than a month, she obtained a lifetime of memories. On Tuesday in San Juan, the   parade in her honor ended at the Coliseum of Puerto Rico, where she and the other Olympians danced and sang on stage in a jubilant celebration in front of thousands. Puig cried during her speech. Carlos Nido, a    public defense lawyer from San Juan, took his two little girls to watch. “They are very young,” he said. “But maybe someday they will play tennis, too. ”'"}, "time": 1742562281.8961897}