{"duration": 0.04785752296447754, "input_args": {"text": "'Bloomberg reported : \\nTo compensate for this, Trump’s campaign has devised another strategy, which, not surprisingly, is negative. Instead of expanding the electorate, Bannon and his team are trying to shrink it. “We have three major voter suppression operations under way,” says a senior official. They’re aimed at three groups Clinton needs to win overwhelmingly: idealistic white liberals, young women, and African Americans. Trump’s invocation at the debate of Clinton’s WikiLeaks e-mails and support for the Trans-Pacific Partnership was designed to turn off Sanders supporters. The parade of women who say they were sexually assaulted by Bill Clinton and harassed or threatened by Hillary is meant to undermine her appeal to young women. And her 1996 suggestion that some African American males are “super predators” is the basis of a below-the-radar effort to discourage infrequent black voters from showing up at the polls—particularly in Florida. \\nThe effort was obvious, and according to the polling, it is failing. \\nVoter turnout among young women is expected to rise according to the latest Harvard IOP young voters poll. Sanders started flocking towards Clinton in August , and haven’t left, and early voting statistics show that African-American turnout is solid in swing states. \\nThe Trump campaign has realized that they don’t have enough supporters to win, so they are adopting tactics that run contrary to the heart of democracy to shrink the electorate in critical states. \\nHowever, for voter suppression efforts like Trump’s to be effective, the campaign must have a credible messenger. Donald Trump is not a credible messenger to any of the voters that he is trying to deter, and he has no effective surrogates that are capable of delivering his message. \\nA voter suppression effort was expected from the Trump campaign. What is unexpected is that the campaign would publicly brag about it. \\nPeople on all sides of the political spectrum who care about basic democratic institutions should be alarmed by Trump’s public attack on democracy. \\nThe good news for all Americans is that Democrats are already fighting back , and the Trump campaign’s dark efforts to steal an election appear to be failing.'"}, "time": 1742564416.7643037}