{"duration": 0.11101293563842773, "input_args": {"text": "'The media, and the left in general, are taking pride in sales of Orwell’s Nineteen   as if these confirm their fantasies about Donald Trump as a totalitarian leader. One wonders if they have read the book. [The regime in George Orwell’s “1984” declared “War is Peace  —   Freedom is Slavery  —   Ignorance is Strength. ” The dystopian fiction drew flocks of book buyers after Trump advisor Kellyanne Conway’s comment about “alternative facts. ”  —   Los Angeles Times, Jan. 25, 2017, Orwell’s novel is an attack on socialism, and particularly on the media’s role in an imagined socialist state.  The lead character, Winston Smith, is a bureaucrat in the Ministry of Truth whose role it is to rewrite history to suit the political preferences of the Party, and to destroy historical evidence that contradicts the official narrative. (It is a state, interestingly, that suppresses gender roles to control sex. Only in a forbidden, and subversively traditional, sexual liaison does Smith briefly find refuge.) One hopes, therefore, that the people rushing to buy Nineteen   because they see it as some kind of talking point against the Trump administration will actually read the novel. Perhaps they will be shocked by the parallels between the Two Minutes Hate  —   an organized demonstration of outrage against a largely imagined adversary  —   and the unhinged   protests last weekend. Perhaps they will be alarmed at the degree to which our media also serve a “Party”  —   voluntarily. More likely, however, their new copies of Nineteen   will sit on their relatively empty bookshelves, right next to the U. S. Constitutions they bought after Khizr Khan waved his copy from the podium at the Democratic National Convention. Nothing in the Constitution prevents the U. S. from excluding aliens on the basis of objectionable religious or political beliefs  —   indeed, we do it already and have done it for decades  —   but you have to read the thing to know that, and few apparently did. The “hook” on which the supposed Orwellian analogy hangs is “Kellyanne Conway’s comment [to NBC’s Chuck Todd] about ‘alternative facts. ’” The phrase has been distorted to mean the opposite of what Conway intended. In any legal dispute, opposing sides will present the court with alternative versions of the facts in the case. That is clearly what Conway meant. But the media, and the left, spun “alternative facts” as if she meant “alternatives to fact,” i. e. deliberate lies, reckless disregard of the truth. Recall that NBC  —   the network on which Conway appeared  —   was the network that selectively edited the audio of the 911 call by George Zimmerman to police in February 2012 to make it appear that Zimmerman had targeted Trayvon Martin because of his race. That deliberate lie put Zimmerman’s liberty at risk and inflamed race relations nationwide. More recently, it was Todd himself who declared in October  —   citing Republicans, but clearly in agreement  —   that the presidential race was “over. ” It is true that Trump is prone to exaggeration. It is also true that there is usually some basis for his claims. Recall the furore over his claim that “thousands” of Muslims in New Jersey celebrated the   terror attacks. The media treated the claim as if Trump had simply made it up. But it turned out to be based on a kernel of truth: there had, in fact, been some limited   celebrations. And Trump correctly recalled that there had been a local news report that had shaped his impression of events. Likewise with the crowd size at the inauguration. From the steps of the Capitol, and even near the front of the ceremony, it would have been nearly impossible to see any gaps in the crowd. A   photograph by CNN confirms that fact. And yet the gaps did exist: Trump’s crowd on the Mall was almost certainly not as large as Obama’s in 2009. But that cannot, and does not, negate the administration’s claim that more people watched overall, through electronic media. Both can be true. Sometimes you need the “alternative facts”  —   what journalists used to call “both sides of the story”  —   to paint the full picture. But the mainstream media presume that the Trump administration doesn’t have a side  —   nor do Trump’s voters and supporters. Instead, the mainstream media have taken the other side. They dress it up in platitudes about holding the new administration accountable  —   as if, just like Nineteen   the past eight years of servility can be shoved down the “Memory Hole. ” While the mainstream media were nitpicking over crowd size, and fabricating stories like the Dr. Martin Luther King, Jr. bust, Breitbart News  —   falsely impugned as Trump’s “Pravda”  —   was taking the administration to task over its failure to address the immigration issue on day one. Earlier, Breitbart reported Trump’s broken promise to pursue Hillary Clinton’s email scandal. The truth is that the mainstream media, collectively, are Big Brother. Unlike Winston Smith, we have finally been liberated. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742562657.8314059}