{"duration": 0.05226492881774902, "input_args": {"text": "'Across New York City, cellphones blared on Monday morning with the dissonant but familiar tone of an emergency alert, typically used for   advisories or abducted children. But this was different. For what is believed to be the first time, the nation’s Wireless Emergency Alerts system was deployed as an electronic wanted poster, identifying a    man sought in connection with the bombings in Manhattan and New Jersey over the weekend. Suddenly, from commuter trains to the sidewalks of the city, millions were enlisted in the manhunt. The message was simple: “WANTED: Ahmad Khan Rahami,    male. See media for pic. Call    if seen. ” In an instant, the reach and ubiquity of law enforcement in an age of terrorism and digital technology became apparent. The system, in place for several years, has been used to assist the authorities in moments of chaos and potential danger: after the Boston bombing in 2013, when the Boston suspects were still at large, and last month in Los Angeles, during an active shooter scare at the airport. In both cases, those receiving the message were told to    or were given safety updates. The “wanted” message sent Monday appeared to be the first widespread attempt to transform the citizens of a major American city into a vigilant and nearly omnipresent eye for the authorities. It added new meaning to the notion of “see something, say something,” even as it raised some concern that innocent people could be mistakenly targeted. “This is a tool we will use again in the future,” Mayor Bill de Blasio of New York said at a news conference. “No more wanted posters on the precinct house wall. This is a modern approach that really engaged a whole community. ” The alert messages are targeted to a cellphone’s location using nearby towers, so the alert on Monday was received by people in and around New York City, including some in New Jersey. Frank DiGirolamo was stepping out of a Manhattan deli on 37th Street and Seventh Avenue on his way to work when the alert went out. “All of a sudden, I heard the phones from people walking in every direction,” he said. “Even the fruit stand guy’s went off. ” There are three broad types of alerts in the national system: emergency alerts for storms and other threats to public safety   Amber Alerts, which seek to enlist people in a search for an abducted child and those issued by the president. Cellphone users can opt to block all but the presidential alerts. To date, the president has not sent an alert using the system. The system has been used in New York City several times since 2012, according to officials: three times during Hurricane Sandy, once for a travel ban during a winter storm in 2015 and twice during the Chelsea bombing  —   the broad alert on Monday, and a more limited one on Saturday night, warning people in the Chelsea area to stay away from windows as the police cleared an unexploded device from 27th Street. Eric F. Phillips, a spokesman for Mr. de Blasio, said the decision to send the alert on Monday required a high degree of evidence that Mr. Rahami was connected to the bombing. By early Monday, the authorities were confident enough to publicly identify Mr. Rahami. Around 7 a. m. John J. Miller, the deputy commissioner for intelligence and counterterrorism at the New York Police Department, directed his public affairs office to disseminate the information. The office then contacted the city’s emergency management agency staff members there quickly decided to send out a Wireless Emergency Alert, or W. E. A. “This was somebody they considered to be extremely dangerous,” Nancy Silvestri, press secretary for the emergency management agency, said. It took about 15 minutes for officials to agree on the language for an alert, and give approval for the message that was sent across the city at 7:57 a. m. Brittany Rocco was in a kinesiology class at Manhattan College in the Bronx when seemingly every phone sounded at once. “I thought, ‘Oh wow, I guess I should pay attention today,’” she said. Xinyue Zhang, a pianist who lives in New Brunswick, N. J. said she and her fiancé were planning to go to New York City’s Marriage Bureau on Monday to get married when the alert made her family concerned for their safety. They decided to postpone the wedding until Tuesday. Not everyone believes the use of such cellphone alerts is appropriate. “It was very troublesome,” said Bandana Kar, a professor of geography at the University of Southern Mississippi who has studied the alert system. “The alert was very unspecific and ” she added. “By encouraging people to go to the media to look at a picture, what if someone had identified the wrong person?” When Shuja Haider heard the alert in his home in the Bushwick section of Brooklyn, he initially panicked, wondering if his building was on fire or under imminent threat. His parents called from Pakistan, concerned that he might have been in the area of the blast. But they had also expressed concern that their son might be affected by racial targeting in the aftermath of the episode. When Mr. Haider saw the man’s name and age, he immediately searched for an image  —   to see if the suspect looked like him. He was relieved to see no resemblance. “Today, brown guys like me are walking around worrying about the threat of terrorism like everyone else,” Mr. Haider said. “But we’re also worried about being blamed for it. ” The emergency alerts can be sent to the national system by federal, state or local authorities who have been authorized to do so. In a paper recently published in The Journal of Contingencies and Crisis Management, a group of professors investigated how people interpreted the W. E. A.s during an unfamiliar event, such as a fictional situation in which a dirty bomb went off. The results were not encouraging: Study participants found the messages  —   which are limited to 90 characters  —   confusing as well as  . The key to success is to use the alerts at the appropriate times and not to overuse them, said Josh Gottheimer, who was a point person at the Federal Communications Commission during the creation of the alert system in New York City, which started in 2011. “Obviously if we have a   terrorist on the loose, I consider that an exigent circumstance,” said Mr. Gottheimer, who is now running for Congress in New Jersey. By late morning, Mr. Rahami had been captured. By then, nearly every New Yorker, and many others around the country, already knew his face.'"}, "time": 1742628536.3333533}