{"duration": 0.48996710777282715, "input_args": {"text": "'FBI Closes In On Hillary! Posted on Home » Headlines » World News » FBI Closes In On Hillary! \\nWe now have 5 separate FBI cases probing the Hillary-Bill Clinton inner circle. Here is the background on those 5 cases and all of the major players that we are going to cover: \\n\\nFIVE INVESTIGATIONS UNDERGOING BY THE FBI ON CLINTON, THE CLINTON FOUNDATION AND INNER CIRCLE/TRUMP SURPASSES CLINTON IN THE POLLS/DEUTSCHE BANK STOCK PLUMMETS AGAIN/DB’S CHIEF ECONOMIST BLASTS THE ECB AGAIN: THEY MUST BE HURTING!/569,000 OZ ADDED TO THE SLV/2.67 TONNES ADDED TO THE GLD \\nGold closed at $1306.40 up $20.40 \\nsilver closed at $18.66 or up 47 cents. \\nAccess market prices: THE DAILY GOLD FIX REPORT FROM SHANGHAI AND LONDON \\n. \\nThe Shanghai fix is at 10:15 pm est and 2:15 am est \\nThe fix for London is at 5:30 am est (first fix) and 10 am est (second fix) \\nThus Shanghai’s second fix corresponds to 195 minutes before London’s first fix. \\nAnd now the fix recordings: \\nShanghai morning fix Nov 2 ( 10:15 pm est last night): $ 1294.53 \\nNY ACCESS PRICE: $1289.70 (AT THE EXACT SAME TIME) \\nShanghai afternoon fix: 2: 15 am est (second fix/early morning):$ 1296.08 \\nNY ACCESS PRICE: 1291.70 (AT THE EXACT SAME TIME/2:15 am) \\nHUGE SPREAD TODAY!! 4 dollars \\n\\nLondon Fix: Nov 2: 5:30 am est : $1295.85 (NY: same time: $1296.10: 5:30AM ) \\nLondon Second fix Nov 2: 10 am est : $1303.75 (NY same time: $1301.75 , 10 AM ) \\nShanghai premium in silver over NY: 59 cents. \\nIt seems that Shanghai pricing is higher than the other two , (NY and London). The spread has been occurring on a regular basis and thus I expect to see arbitrage happening as investors buy the lower priced NY gold and sell to China at the higher price. This should drain the comex. \\nAlso why would mining companies hand in their gold to the comex and receive constantly lower prices. They would be open to lawsuits if they knowingly continue to supply the comex despite the fact that they could be receiving higher prices in Shanghai. \\nend \\nNOTICES FILINGS FOR NOVEMBER CONTRACT MONTH: 381 NOTICES FOR 38,100 OZ TONES \\nNOTICES FOR NOVEMBER CONTRACT MONTH FOR SILVER: 12 NOTICES OR 60,000 OZ \\n\\nLet us have a look at the data for today \\n. \\n\\nIn silver, the total open interest ROSE by 4181 contracts UP to 196,912. The open interest FELL AS the silver price was UP 63 cents in yesterday’s trading .In ounces, the OI is still represented by just less THAN 1 BILLION oz i.e. .985 BILLION TO BE EXACT or 141% of annual global silver production (ex Russia &ex China). \\nIn November, in silver, 12 notice filings: FOR 60,000 OZ \\nI \\nIn gold, the total comex gold ROSE by 12,920 contracts WITH THE RISE in price of gold ($14.90 YESTERDAY) . The total gold OI stands at 521,506 contracts. The bankers supplied the necessary non backed paper trying to quell gold’s advance. \\nIn gold for November: we had 381 notices filed for 38,100 oz \\n\\nWith respect to our two criminal funds, the GLD and the SLV : \\nGLD \\nTODAY WE HAD A BIG CHANGE AT THE GLD OUT OF THE GLD/A DEPOSIT OF 2.67 TONNES OF GOLD INTO THE GLD \\nTotal gold inventory rests tonight at: 945.26 tonnes of gold \\nSLV \\nwe had ANOTHER BIG CHANGE at the SLV/ \\nA DEPOSIT OF 569,000 OZ \\nTHE SLV Inventory rests at: 361.242 million oz \\n. \\nFirst, here is an outline of what will be discussed tonight: \\n1. Today, we had the open interest in silver ROSE by 4181 contracts UP to 196,912 as the price of silver rose by 63 cents with yesterday’s trading.The gold open interest ROSE by 12,920 contracts UP to 521,506 as the price of gold ROSE $14.90 IN YESTERDAY’S TRADING. \\n(report Harvey). \\n2.a) The Shanghai and London gold fix report \\n(Harvey) \\n2 b) Gold/silver trading overnight Europe, Goldcore \\n(Mark O’Byrne/zerohedge \\n3c FRBNY gold movement report \\n(Harvey) 3. ASIAN AFFAIRS \\ni) Late TUESDAY night/WEDNESDAY morning: Shanghai closed DOWN 19.7 POINTS OR 0.63%/ /Hang Sang closed DOWN 336.57 OR 1.45%. The Nikkei closed DOWN 307.72 POINTS OR 1.76% Australia’s all ordinaires CLOSED DOWN 1.19% /Chinese yuan (ONSHORE) closed UP at 6.7611/Oil FELL to 45.96 dollars per barrel for WTI and 47.45 for Brent. Stocks in Europe: ALL IN THE RED Offshore yuan trades 6.7652 yuan to the dollar vs 6.7611 for onshore yuan. \\nTHE SPREAD BETWEEN ONSHORE AND OFFSHORE NARROWS QUITE A BIT AS MORE USA DOLLARS ATTEMPT TO LEAVE CHINA’S SHORES / CHINA SENDS A MESSAGE TO THE USA TO NOT RAISE RATES IN DECEMBER. REPORT ON JAPAN SOUTH KOREA NORTH KOREA AND CHINA 3a)THAILAND/SOUTH KOREA \\ni)Deutsche bank stock is falling along with with rising credit default swaps \\n( zero hedge) \\nii)Strange one!! Deutsche bank’s chief economist Landau accuses the ECB of creating asset bubbles and most importantly expropriating savers plus other goodies as they come clean. \\nThey must be hurting real bad… \\n( zero hedge/Deutsche bank/Landau) 5. RUSSIAN AND MIDDLE EASTERN AFFAIRS \\nnone today 6.GLOBAL ISSUES \\ni)As a proxy for the upcoming election, the fall in the Peso is a good sign that Hillary is in trouble at the polls \\n( zero hedge) \\nii) Another humourous story from the Philippines. After Duterte used much vulgar language against the USA, the Americans decided to stop shipments to them. He again called the Americans: “Monkeys” \\n( zero hedge) 7.OIL ISSUES \\nLast night we got a huge inventory build from API. Today from DOE also confirms a huge buildup. Oil retreats: \\n(courtesy zero hedge) \\nVenezuela’s currency disintegrates by 20% in just one week. Hyperinflation rages on \\n( zero hedge) 9.PHYSICAL STORIES \\ni)The CME is to start London gold contracts in total competition with ICE and LME .. Too many folks are abandoning the manipulated USA gold forum \\n( Bloomberg/GATA) \\nii)The story behind the huge Grasberg mine \\n( The Guardian from London) \\n\\niii) Silver’s rise is showing that there is a real flight to safety going on \\n(courtesy Dave Kranzler/IRD) 10.USA STORIES WHICH MAY INFLUENCE THE PRICE OF GOLD/SILVER \\ni) We now have 5 separate FBI cases probing the Hillary-Bill Clinton inner circle: \\nHere is the background on those 5 cases and all of the major players that we are going to cover. \\n(the Daily Mail) \\nii)Trump and Hillary are basically tied in latest ABC poll \\n( zero hedge) \\niii)Citibank states what even if Hillary wins the election, it will be marked by continuous investigations and an impeachment risk. \\n( Citibank/zerohedge) \\niv) a. The Dept of Justice guy, Peter Kadzik who is leading the investigation into the Clinton scandals has now been exposed with colluding with the Clinton campaign. What a mess!! Yesterday, in my commentary I wrote that this was this biggest conflict of interest possible and it has now become reality. \\n( zero hedge) \\n\\niv b. The DOJ responds: finds nothing wrong..so move on…Kadzik is nothing but a huge conflict of interest here! \\n( zerohedge) \\nv)Trump now surpasses Clinton as the rats abandon ship ( Nathan McDonald/Sprott Money) \\nvi)Unusual for these guys to report such a negative repot: the ADP employment sinks to its weakest level for over 2 years: \\n( ADP/zero hedge) \\nvii)The New York, ISM mfg index contracts for the 3rd consecutive month: \\n\\nviii)The Fed holds again but states that the rate hike in December “strengthens” \\n( zero hedge) Let us head over to the comex: \\nThe total gold comex open interest ROSE BY 12,920 CONTRACTS to an OI level of 521,506 as the price of gold ROSE $14.90 with YESTERDAY’S trading.The bankers were on full alert supplying the necessary non backed gold paper keeping the gold price contained.In the front month of November we had 494 notices standing for a GAIN of 19 contracts. We had 13 notices served upon yesterday so we GAINED 32 contracts or 3200 ADDITIONAL oz will stand for delivery in November. The next contract month and the biggest of the year is December and here this month showed a increase of 8,987 contracts up to 369,645. Today, we had 381 notice(s) filed for 38,100 oz of gold.'"}, "time": 1742561619.3491051}