{"duration": 1.427408218383789, "input_args": {"text": "'By wmw_admin on November 30, 2013 Rebel of Oz — Nov 30, 2013 For over a century, the Jewish World Almanac has been widely regarded as the most authentic source for the world’s Jewish population numbers. Academics all over the world, including the editors of the Encyclopedia Britannica, used to rely on the accuracy of those numbers. Here is what the World Alamanacs of 1933 and 1948 had to say about the world population of Jews. World Almanac 1933 World Almanac 1948 In other words, according to the World Almanac the world population of Jews increased (!) between 1933 and 1948 from 15,315,000 to 15,753,000. If the German government under Adolf Hitler had – as alleged – murdered six million Jews those losses should have been reflected in the Jewish population numbers quoted in the World Almanac. The suspicions raised by above numbers concerning the veracity of the allegations made against the Hitler government are confirmed by the official three-volume report by the International Committee of the Red Cross, released 1948 in Geneva, according to which 272,000 concentration camp inmates died in German custody, about half of them Jews. The following article elaborates. A Factual Appraisal Of The ‘Holocaust’ By The Red Cross The Jews And The Concentration Camps: No Evidence Of Genocide There is one survey of the Jewish question in Europe during World War Two and the conditions of Germany’s concentration camps which is almost unique in its honesty and objectivity, the three-volume Report of the International Committee of the Red Cross on its Activities during the Second World War, Geneva, 1948. This comprehensive account from an entirely neutral source incorporated and expanded the findings of two previous works: Documents sur l’activité du CICR en faveur des civils détenus dans les camps de concentration en Allemagne 1939-1945 (Geneva, 1946), and Inter Arma Caritas: the Work of the ICRC during the Second World War (Geneva, 1947). The team of authors, headed by Frédéric Siordet, explained in the opening pages of the Report that their object, in the tradition of the Red Cross, had been strict political neutrality, and herein lies its great value. The ICRC successfully applied the 1929 Geneva military convention in order to gain access to civilian internees held in Central and Western Europe by the Germany authorities. By contrast, the ICRC was unable to gain any access to the Soviet Union, which had failed to ratify the Convention. The millions of civilian and military internees held in the USSR, whose conditions were known to be by far the worst, were completely cut off from any international contact or supervision. The Red Cross Report is of value in that it first clarifies the legitimate circumstances under which Jews were detained in concentration camps, i.e. as enemy aliens. In describing the two categories of civilian internees, the Report distinguishes the second type as “Civilians deported on administrative grounds (in German, “Schutzhäftlinge”), who were arrested for political or racial motives because their presence was considered a danger to the State or the occupation forces” (Vol. 111, p. 73). These persons, it continues, “were placed on the same footing as persons arrested or imprisoned under common law for security reasons.” (P.74). The Report admits that the Germans were at first reluctant to permit supervision by the Red Cross of people detained on grounds relating to security, but by the latter part of 1942, the ICRC obtained important concessions from Germany. They were permitted to distribute food parcels to major concentration camps in Germany from August 1942, and “from February 1943 onwards this concession was extended to all other camps and prisons” (Vol. 111, p. 78). The ICRC soon established contact with camp commandants and launched a food relief programme which continued to function until the last months of 1945, letters of thanks for which came pouring in from Jewish internees. Red Cross Recipients Were Jews The Report states that “As many as 9,000 parcels were packed daily. >From the autumn of 1943 until May 1945, about 1,112,000 parcels with a total weight of 4,500 tons were sent off to the concentration camps” (Vol. III, p. 80). In addition to food, these contained clothing and pharmaceutical supplies. “Parcels were sent to Dachau, Buchenwald, Sangerhausen, Sachsenhausen, Oranienburg, Flossenburg, Landsberg-am-Lech, Flöha, Ravensbrück, Hamburg-Neuengamme, Mauthausen, Theresienstadt, Auschwitz, Bergen-Belsen, to camps near Vienna and in Central and Southern Germany. The principal recipients were Belgians, Dutch, French, Greeks, Italians, Norwegians, Poles and stateless Jews” (Vol. III, p. 83). In the course of the war, “The Committee was in a position to transfer and distribute in the form of relief supplies over twenty million Swiss francs collected by Jewish welfare organisations throughout the world, in particular by the American Joint Distribution Committee of New York” (Vol. I, p. 644). This latter organisation was permitted by the German Government to maintain offices in Berlin until the American entry into the war. The ICRC complained that obstruction of their vast relief operation for Jewish internees came not from the Germans but from the tight Allied blockade of Europe. Most of their purchases of relief food were made in Rumania, Hungary and Slovakia. The ICRC had special praise for the liberal conditions which prevailed at Theresienstadt up to the time of their last visits there in April 1945. This camp, “where there were about 40,000 Jews deported from various countries was a relatively privileged ghetto” (Vol. III, p. 75). According to the Report, “‘The Committee’s delegates were able to visit the camp at Theresienstadt (Terezin) which was used exclusively for Jews and was governed by special conditions. From information gathered by the Committee, this camp had been started as an experiment by certain leaders of the Reich … These men wished to give the Jews the means of setting up a communal life in a town under their own administration and possessing almost complete autonomy. . . two delegates were able to visit the camp on April 6th, 1945. They confirmed the favourable impression gained on the first visit” (Vol. I, p . 642). The ICRC also had praise for the regime of Ion Antonescu of Fascist Rumania where the Committee was able to extend special relief to 183,000 Rumanian Jews until the time of the Soviet occupation. The aid then ceased, and the ICRC complained bitterly that it never succeeded “in sending anything whatsoever to Russia” (Vol. II, p. 62). The same situation applied to many of the German camps after their “liberation” by the Russians. The ICRC received a voluminous flow of mail from Auschwitz until the period of the Soviet occupation, when many of the internees were evacuated westward. But the efforts of the Red Cross to send relief to internees remaining at Auschwitz under Soviet control were futile. However, food parcels continued to be sent to former Auschwitz inmates transferred west to such camps as Buchenwald and Oranienburg. No Evidence Of Genocide One of the most important aspects of the Red Cross Report is that it clarifies the true cause of those deaths that undoubtedly occurred in the camps toward the end of the war. Says the Report: “In the chaotic condition of Germany after the invasion during the final months of the war, the camps received no food supplies at all and starvation claimed an increasing number of victims. Itself alarmed by this situation, the German Government at last informed the ICRC on February 1st, 1945 … In March 1945, discussions between the President of the ICRC and General of the S.S. Kaltenbrunner gave even more decisive results. Relief could henceforth be distributed by the ICRC, and one delegate was authorised to stay in each camp …” (Vol. III, p. 83). Clearly, the German authorities were at pains to relieve the dire situation as far as they were able. The Red Cross are quite explicit in stating that food supplies ceased at this time due to the Allied bombing of German transportation, and in the interests of interned Jews they had protested on March 15th, 1944 against “the barbarous aerial warfare of the Allies” (Inter Arma Caritas, p. 78). By October 2nd, 1944, the ICRC warned the German Foreign Office of the impending collapse of the German transportation system, declaring that starvation conditions for people throughout Germany were becoming inevitable. In dealing with this comprehensive, three-volume Report, it is important to stress that the delegates of the International Red Cross found no evidence whatever at the camps in Axis occupied Europe of a deliberate policy to exterminate the Jews. In all its 1,600 pages the Report does not even mention such a thing as a gas chamber. It admits that Jews, like many other wartime nationalities, suffered rigours and privations, but its complete silence on the subject of planned extermination is ample refutation of the Six Million legend. Like the Vatican representatives with whom they worked, the Red Cross found itself unable to indulge in the irresponsible charges of genocide which had become the order of the day. So far as the genuine mortality rate is concerned, the Report points out that most of the Jewish doctors from the camps were being used to combat typhus on the eastern front, so that they were unavailable when the typhus epidemics of 1945 broke out in the camps (Vol. I, p. 204 ff) – Incidentally, it is frequently claimed that mass executions were carried out in gas chambers cunningly disguised as shower facilities. Again the Report makes nonsense of this allegation. “Not only the washing places, but installations for baths, showers and laundry were inspected by the delegates. They had often to take action to have fixtures made less primitive, and to get them repaired or enlarged” (Vol. III, p. 594). Not All Were Interned Volume III of the Red Cross Report, Chapter 3 (I. Jewish Civilian Population) deals with the “aid given to the Jewish section of the free population,” and this chapter makes it quite plain that by no means all of the European Jews were placed in internment camps, but remained, subject to certain restrictions, as part of the free civilian population. This conflicts directly with the “thoroughness” of the supposed “extermination programme”, and with the claim in the forged Höss memoirs that Eichmann was obsessed with seizing “every single Jew he could lay his hands on.” In Slovakia, for example, where Eichmann’s assistant Dieter Wisliceny was in charge, the Report states that “A large proportion of the Jewish minority had permission to stay in the country, and at certain periods Slovakia was looked upon as a comparative haven of refuge for Jews, especially for those coming from Poland. Those who remained in Slovakia seem to have been in comparative safety until the end of August 1944, when a rising against the German forces took place. While it is true that the law of May 15th, 1942 had brought about the internment of several thousand Jews, these people were held in camps where the conditions of food and lodging were tolerable, and where the internees were allowed to do paid work on terms almost equal to those of the free labour market” (Vol. I, p. 646). Not only did large numbers of the three million or so European Jews avoid internment altogether, but the emigration of Jews continued throughout the war, generally by way of Hungary, Rumania and Turkey. Ironically, post-war Jewish emigration from German-occupied territories was also facilitated by the Reich, as in the case of the Polish Jews who had escaped to France before its occupation. “The Jews from Poland who, whilst in France, had obtained entrance permits to the United States were held to be American citizens by the German occupying authorities, who further agreed to recognize the validity of about three thousand passports issued to Jews by the consulates of South American countries” (Vol. I, p. 645). As future U.S. citizens, these Jews were held at the Vittel camp in southern France for American aliens. The emigration of European Jews from Hungary in particular proceeded during the war unhindered by the German authorities. “Until March 1944,” says the. Red Cross Report, “Jews who had the privilege of visas for Palestine were free to leave Hungary” (Vol. I, p. 648). Even after the replacement of the Horthy Government in 1944 (following its attempted armistice with the Soviet Union) with a government more dependent on German authority, the emigration of Jews continued. The Committee secured the pledges of both Britain and the United States “to give support by every means to the emigration of Jews from Hungary,” and from the U.S. Government the ICRC received a message stating that “The Government of the United States … now specifically repeats its assurance that arrangements will be made by it for the care of all Jews who in the present circumstances are allowed to leave” (Vol. I, p . 649). Biedermann agreed that in the nineteen instances that “Did Six Million Really Die?” quoted from the Report of the International Committee of the Red Cross on its Activities during the Second World War and Inter Arma Caritas (this includes the above material), it did so accurately. A quote from Charles Biedermann (a delegate of the International Committee of the Red Cross and Director of the Red Cross’ International Tracing Service) under oath at the Zündel Trial (February 9, 10, 11 and 12, 1988).'"}, "time": 1742563932.3783998}