{"duration": 0.0451662540435791, "input_args": {"text": "'Every Friday, pop critics for The New York Times weigh in on the week’s most notable new songs and videos  —   and anything else that strikes them as intriguing  —   in the Playlist. You can listen to this playlist on Spotify here. Like this format? Let us know at theplaylist@nytimes. com. Back in the pop arena after her detour into show tunes and pop standards, Lady Gaga unleashes her great big voice on a perennial pop subject:   fury and disillusionment. “Mistaken for   wasn’t love, it was a perfect illusion,” she belts, angry and tremulous. Lady Gaga and three producers  —   Mark Ronson, Tame Impala’s Kevin Parker and BloodPop  —   go for a     hybrid, with a Motown beat underpinning both electronics and guitars and an   Top 40 key change into the last verse. But the influence Lady Gaga still can’t escape is Madonna the climax of the chorus, the words “perfect illusion,” use the same melodic line as “keeping my baby” in Madonna’s “Papa Don’t Preach. ” JON PARELES The narrator is a prisoner  —   incarcerated in some verses, brutalized by corrupt capitalism in others  —   in “Digging for Windows,” the first solo song in a decade from the Zack de la Rocha, the rapper who fronted Rage Against the Machine. Produced by   (who had Mr. de la Rocha as a guest with his project Run the Jewels) the track pounds away, mostly on one relentlessly repeated note, thickening and eventually bringing in a loud guitar to match the mounting anger. Part of the message is arguable  —   “Won’t mark the name on a ballot” this year?  —   but the fury is convincing. J. P. It was 2004, another election year, when Green Day released “American Idiot,” its blast at the quiescence of the George W. Bush years. “Revolution Radio” is the title song of its album due Oct. 7, and Green Day’s tools and attitude haven’t changed: punk propulsion, guitar hooks and barreling drums behind pop melody carrying a call for “a rebel’s lullaby under the stars and   the lost souls that were cheated. ” The band’s old energy endures so does the frustration. J. P. The   rapper Mykki Blanco temporarily sets aside her usual bravado in “Loner,” one of the more melodic tracks on her debut album, “Mykki. ” With Jean Deaux cooing a chorus alongside her, she testifies to deep insecurities within the fishbowl of social media. “I need help, I’m so sad,” she confesses, but she can’t resist broadcasting her problems: “I’m standing wasted on  ’m naked. ” It’s the plaint of someone who’s never sure which followers are also friends. J. P. “Veil Scans” is less than five minutes long but evokes eternity. The electronic composer Tim Hecker deals in dread, repetition, density and depth, opening dark chasms in the soundscape. A loop of what sounds like a string orchestra, sliding upward through just one whole tone, runs nearly all the way through “Veil Scans” around it are warped echoes and reflections, clouds of static, deep bass murmurs, distant voices, eerie keenings. It’s not so much a   track as a glimpse into some inexorable evolutionary process. J. P. A decade ago the pianist Eric Lewis was that rare thing: a promising young musician who, of his own volition, had stepped away from a coveted post in the house orchestra of Wynton Marsalis’s Jazz at Lincoln Center. He soon became something even rarer: a jazz artist with the profile and bearing of a certain kind of pop star. Rebranding himself as ELEW, he wowed a range of audiences, from the TED Conference to the White House, with hyperdynamic covers of songs by Coldplay, the Killers and Linkin Park. So what to make of his new acoustic trio album, “And to the Republic,” made with one of Mr. Marsalis’s old rhythm sections? Whatever else you want to say, it doesn’t smack of cynicism. Mr. Lewis crowds the track list with acts of tribute: to his romantic partner (“Lil Luba”) to a former mentor (“Tones for Elvin Jones”) to a couple of lodestars (“Ornette,” “Monk”) to a formative sound (“The Philly Groove”). And he connects handily with the bassist Reginald Veal and the drummer Jeff (Tain) Watts, favoring a     polyrhythmic swagger. You hear it on the opening track, “Medicine Man,” which works a childlike melodic line into something like an expedition. At the same time, Mr. Lewis finds a place for something from the ELEW wheelhouse: a chiming arrangement of “Heartbeats,” by the Swedish electronic duo the Knife. NATE CHINEN Having Peter Gabriel write the song for Oliver Stone’s “Snowden,” the film about the computer systems administrator who revealed the extent of secret government surveillance, was a match so neat it seems almost inevitable. Mr. Gabriel realized the implications of the internet early on, and well before that his songs had reckoned with the ways that larger systems grind down individual liberty. He’s also a master of shadowy, suspenseful,   production, like the ticking percussion and staggered bits of melody he uses in “The Veil. ” The lyrics are on topic: “Some say you’re a patriot, some call you a   American hero or a traitor that deserves to Die. ” But Mr. Gabriel finds the broader implications, too, as he sings, “There’s no safe place to go. ” J. P. Carly Rae Jepsen recently released “Emotion: Side B,” a companion to her critically adored 2015 album “Emotion” and a   late applicant to your poolside summer soundtrack. “First Time” is the album’s most irrepressibly gleaming track: a product of the Swedish   complex, evoking 1980s bubble gum like Debbie Gibson. Ms. Jepsen, true to form, mixes some hope into her heartbreak. “But if you stay here,” she sings, “we could away the goodbye. ” N. C. The close of summer lends both a backdrop and a metaphor to Jason Aldean’s new single, in strong rotation on country radio. It’s a tune of stoical yearning, the yawp of a dude bemoaning the end of a seasonal romance. “She might have stayed   never ever left these arms,” he brays, “If only I had a little more summertime. ” It’s an efficient burst of feeling from Mr. Aldean’s seventh studio album, “They Don’t Know,” due on Friday. N. C.'"}, "time": 1742628542.213716}