{"duration": 0.09914183616638184, "input_args": {"text": "'  Ian Greenhalgh is a photographer and historian with a particular interest in military history and the real causes of conflicts. His studies in history and background in the media industry have given him a keen insight into the use of mass media as a creator of conflict in the modern world. His favored areas of study include state sponsored terrorism, media manufactured reality and the role of intelligence services in manipulation of populations and the perception of events. Victoria Gotti: ‘King Con’ Donald Trump Should Take His Pig Self Back to ‘Dump Tower’ By Ian Greenhalgh on October 27, 2016 She explains in inimitable fashion why she gives ‘that lady Hillary my respect’ while ‘King Con’ gets none. \\n[Editor’s note: Mrs Gotti obviously knows a thing or two about gangsters and the mafia, well, more than a thing or two, considering who her husband was. \\nHer assessment of Trump as a ‘a full of himself spoiled rich brat’ and a ‘crude obnoxious megalomaniacal mutt’ is right on the money, she also correctly identifies his campaign as a massive con job. \\nAlso, her assessment that the Russians must be laughing their arses off at US politics is most likely accurate too, she could have added just about every other country is too; that is the result of allowing someone so utterly unqualified, such a total fraud and thoroughly disgusting in so many ways to even run. \\nTrump has done huge damage to America’s image in the world, which was already less than positive; he has made a mockery of US politics and his pandering to the worst, dumbest and most unpleasant sectors of US society has revealed to the world that there are still a lot of incredibly stupid and highly racist assholes in America; that far from being ‘exceptional’ a large part of the US population would better be described as ‘excreable’. \\nAs Gordon pointed out, the normal, sensible American majority has taken note of who the Trump supporters are and won’t forget that they wanted a serial sex abuser, con artist and criminal to ‘Make America Great Again’. Great for everyone except blacks, asians, muslims, Mexicans, women, in fact, anyone who isn’t part of the organised crime elite that Trump is part of. \\nI understand the burning desire for change, I share that emotion, but I remain utterly shocked and aghast at the level of pure dumbfuckery that has been displayed by those who have been fooled into thinking Trump is the one who can deliver it. Ian] Victoria Gotti: ‘King Con’ Donald Trump Should Take His Pig Self Back to ‘Dump Tower’ \\nDonald Trump has had dealings with members or associates of at least three Mafia families, but you can be sure that he never never groped their wives, girlfriends, or daughters. \\nThe widow of Gambino family boss John Gotti makes clear that she would not have allowed her own husband even to speak as Trump did on the now infamous Access Hollywood outtake. \\n“I was married to #1 gangster and would have cut his throat if he ever said such a foul thing to me,” Victoria Gotti said in an email to a longtime pen pal at The Daily Beast whom she has nicknamed “Dimples.” \\nShe noted in the email that she and her family had been the subject of various false accusations, adding, “Dimples, It’s hard to tell anymore as to what is ‘truth or fiction.’” But she had reached a decision regarding Trump. \\n“No, definitely not for Trump, a full of himself spoiled rich brat.” \\nShe said she will be voting for Hillary Clinton, though “I am so disappointed by the choice.” She added, “my man is Joe Biden, ‘Class act.’” \\nShe said of Trump, “what an embarrassment to the country. My mothers side is from Russia, they must be laughing their ‘arses’ off,.at our politics.” \\nVictoria made her view of The Donald even clearer in a post on Facebook, writing: \\n“Hoping you women out there who have any ‘class or dignity’ remember what this ‘crude obnoxious megalomaniacal mutt’ really thinks about women, someone needs to pull him by that useless twinkie he thinks is worth gold, Rosie is a disgusting pig you pos.” \\nVictoria was back on Facebook about Trump following the third presidential debate, on Oct. 19 in Las Vegas. The assertion by the man she dubbed “dUMP” that the election was rigged roused her to ALL CAPS: \\n“IF ACCORDING TO dUMP, THE ELECTION IS RIGGED , WHY DID HE WASTE TIME AND MEGA BUCKS GOING IN? FOR WHAT? SHOULD HE LOSE TO WHINE, AND SAY I DIDNT WIN BECAUSE ITS RIGGED? GIVE ME A GODAMN BREAK WITH THIS SPOILED BRAT. HES A SICKENING ABUSIVE PERSONALITY.” \\nShe went on, “HE NEEDS TO GET ON HIS HORSE & GIDDYAP BACK TO HIS GILDED BIRD CAGE IN DUMP TOWER.HE HAS NO INTEREST AT HEART BUT HIS OWN , KING CON IS HIS GAME.” \\nIn one of her most recent posts, Victoria stood up for Hillary Clinton. \\n“I’m totally sick of the vicious Hillary haters, did Bill cheat,? more than likely, so the fuck what? ‘he’ ran the country, his ‘pecker’ didn’t…” \\nVictoria noted, “from what I read the dump is a serial cheater as well, can he run the country? highly ‘doubtful’ I believe this bull will be getting divorced before any term is up, hope we get there without a war during his reign, should he win.” \\nShe returned her attention to Hillary. \\n“I give that lady Hilary my respect that she stayed with Bill and kept her family together, I don’t think I would have that kind of fortitude ,there were some stories of the same ilk in regard to John G .he use to tell me he needed a ‘steel dick’ to service all the women government and media put him with, at the end of the day it was ‘me’ he came home to.” \\nShe then summed it all up as seen by someone who has seen it all. \\n“so you just can’t believe all the vitriol, you either love him enough to keep your family together or you don’t, and Hilary did, and does, more than i can say for dump. End of story!” Related Posts: No Related Posts The views expressed herein are the views of the author exclusively and not necessarily the views of VT, VT authors, affiliates, advertisers, sponsors, partners, technicians, or the Veterans Today Network and its assigns. LEGAL NOTICE - COMMENT POLICY Posted by Ian Greenhalgh on October 27, 2016, With 165 Reads Filed under Politics . You can follow any responses to this entry through the RSS 2.0 . Both comments and pings are currently closed.'"}, "time": 1742562130.4533184}