{"duration": 0.2665576934814453, "input_args": {"text": "'The Modern History of ‘Rigged’ US Elections October 27, 2016 \\nSpecial Report: Donald Trump claims the U.S. presidential election is “rigged,” drawing condemnation from the political/media establishment which accuses him of undermining faith in American democracy. But neither side understands the real problem, says Robert Parry. \\nBy Robert Parry \\nThe United States is so committed to the notion that its electoral process is the world’s “gold standard” that there has been a bipartisan determination to maintain the fiction even when evidence is overwhelming that a U.S. presidential election has been manipulated or stolen. The “wise men” of the system simply insist otherwise. \\nWe have seen this behavior when there are serious questions of vote tampering (as in Election 1960) or when a challenger apparently exploits a foreign crisis to create an advantage over the incumbent (as in Elections 1968 and 1980) or when the citizens’ judgment is overturned by judges (as in Election 2000). Presidents Richard Nixon, George H.W. Bush and Ronald Reagan photographed together in the Oval Office in 1991. (Cropped from a White House photo that also included Presidents Gerald Ford and Jimmy Carter.) \\nStrangely, in such cases, it is not only the party that benefited which refuses to accept the evidence of wrongdoing, but the losing party and the establishment news media as well. Protecting the perceived integrity of the U.S. democratic process is paramount. Americans must continue to believe in the integrity of the system even when that integrity has been violated. \\nThe harsh truth is that pursuit of power often trumps the principle of an informed electorate choosing the nation’s leaders, but that truth simply cannot be recognized. \\nOf course, historically, American democracy was far from perfect, excluding millions of people, including African-American slaves and women. The compromises needed to enact the Constitution in 1787 also led to distasteful distortions, such as counting slaves as three-fifths of a person for the purpose of representation (although obviously slaves couldn’t vote). \\nThat unsavory deal enabled Thomas Jefferson to defeat John Adams in the pivotal national election of 1800. In effect, the votes of Southern slave owners like Jefferson counted substantially more than the votes of Northern non-slave owners. \\nEven after the Civil War when the Constitution was amended to give black men voting rights, the reality for black voting, especially in the South, was quite different from the new constitutional mandate. Whites in former Confederate states concocted subterfuges to keep blacks away from the polls to ensure continued white supremacy for almost a century. \\nWomen did not gain suffrage until 1920 with the passage of another constitutional amendment, and it took federal legislation in 1965 to clear away legal obstacles that Southern states had created to deny the franchise to blacks. \\nIndeed, the alleged voter fraud in Election 1960, concentrated largely in Texas, a former Confederate state and home to John Kennedy’s vice presidential running mate, Lyndon Johnson, could be viewed as an outgrowth of the South’s heritage of rigging elections in favor of Democrats, the post-Civil War party of white Southerners. \\nHowever, by pushing through civil rights for blacks in the 1960s, Kennedy and Johnson earned the enmity of many white Southerners who switched their allegiance to the Republican Party via Richard Nixon’s Southern strategy of coded racial messaging. Nixon also harbored resentments over what he viewed as his unjust defeat in the election of 1960. \\nNixon’s ‘Treason’ \\nSo, by 1968, the Democrats’ once solid South was splintering, but Nixon, who was again the Republican presidential nominee, didn’t want to leave his chances of winning what looked to be another close election to chance. Nixon feared that — with the Vietnam War raging and the Democratic Party deeply divided — President Johnson could give the Democratic nominee, Vice President Hubert Humphrey, a decisive boost by reaching a last-minute peace deal with North Vietnam. President Richard Nixon with his then-National Security Advisor Henry Kissinger in 1972. \\nThe documentary and testimonial evidence is now clear that to avert a peace deal, Nixon’s campaign went behind Johnson’s back to persuade South Vietnamese President Nguyen van Thieu to torpedo Johnson’s Paris peace talks by refusing to attend. Nixon’s emissaries assured Thieu that a President Nixon would continue the war and guarantee a better outcome for South Vietnam. \\nThough Johnson had strong evidence of what he privately called Nixon’s “treason” — from FBI wiretaps in the days before the 1968 election — he and his top advisers chose to stay silent. In a Nov. 4, 1968 conference call , Secretary of State Dean Rusk, National Security Advisor Walt Rostow and Defense Secretary Clark Clifford – three pillars of the Establishment – expressed that consensus, with Clifford explaining the thinking: \\n“Some elements of the story are so shocking in their nature that I’m wondering whether it would be good for the country to disclose the story and then possibly have a certain individual [Nixon] elected,” Clifford said. “It could cast his whole administration under such doubt that I think it would be inimical to our country’s interests.” \\nClifford’s words expressed the recurring thinking whenever evidence emerged casting the integrity of America’s electoral system in doubt, especially at the presidential level. The American people were not to know what kind of dirty deeds could affect that process. \\nTo this day, the major U.S. news media will not directly address the issue of Nixon’s treachery in 1968, despite the wealth of evidence proving this historical reality now available from declassified records at the Johnson presidential library in Austin, Texas. In a puckish recognition of this ignored history, the library’s archivists call the file on Nixon’s sabotage of the Vietnam peace talks their “X-file.” [For details, see Consortiumnews.com’s “ LBJ’s ‘X-File’ on Nixon’s ‘Treason. ’”] \\nThe evidence also strongly suggests that Nixon’s paranoia about a missing White House file detailing his “treason” – top secret documents that Johnson had entrusted to Rostow at the end of LBJ’s presidency – led to Nixon’s creation of the “plumbers,” a team of burglars whose first assignment was to locate those purloined papers. The existence of the “plumbers” became public in June 1972 when they were caught breaking into the Democratic National Committee’s headquarters at the Watergate in Washington. National Security Adviser Walt Rostow shows President Lyndon Johnson a model of a battle near Khe Sanh in Vietnam. (U.S. Archive Photo) \\nAlthough the Watergate scandal remains the archetypal case of election-year dirty tricks, the major U.S. news media never acknowledge the link between Watergate and Nixon’s far more egregious dirty trick four years earlier, sinking Johnson’s Vietnam peace talks while 500,000 American soldiers were in the war zone. In part because of Nixon’s sabotage — and his promise to Thieu of a more favorable outcome — the war continued for four more bloody years before being settled along the lines that were available to Johnson in 1968. [See Consortiumnews.com’s “ The Heinous Crime Behind Watergate .”] \\nIn effect, Watergate gets walled off as some anomaly that is explained by Nixon’s strange personality. However, even though Nixon resigned in disgrace in 1974, he and his National Security Advisor Henry Kissinger, who also had a hand in the Paris peace talk caper, reappear as secondary players in the next well-documented case of obstructing a sitting president’s foreign policy to get an edge in the 1980 campaign. \\nReagan’s ‘October Surprise’ Caper \\nIn that case, President Jimmy Carter was seeking reelection and trying to negotiate release of 52 American hostages then held in revolutionary Iran. Ronald Reagan’s campaign feared that Carter might pull off an “October Surprise” by bringing home the hostages just before the election. So, this historical mystery has been: Did Reagan’s team take action to block Carter’s October Surprise? President Ronald Reagan, delivering his Inaugural Address on Jan. 20, 1981, as the 52 U.S. hostages in Iran are simultaneously released. \\nThe testimonial and documentary evidence that Reagan’s team did engage in a secret operation to prevent Carter’s October Surprise is now almost as overwhelming as the proof of the 1968 affair regarding Nixon’s Paris peace talk maneuver. \\nThat evidence indicates that Reagan’s campaign director William Casey organized a clandestine effort to prevent the hostages’ release before Election Day, after apparently consulting with Nixon and Kissinger and aided by former CIA Director George H.W. Bush, who was Reagan’s vice presidential running mate. \\nBy early November 1980, the public’s obsession with Iran’s humiliation of the United States and Carter’s inability to free the hostages helped turn a narrow race into a Reagan landslide. When the hostages were finally let go immediately after Reagan’s inauguration on Jan. 20, 1981, his supporters cited the timing to claim that the Iranians had finally relented out of fear of Reagan. \\nBolstered by his image as a tough guy, Reagan enacted much of his right-wing agenda, including passing massive tax cuts benefiting the wealthy, weakening unions and creating the circumstances for the rapid erosion of the Great American Middle Class. \\nBehind the scenes, the Reagan administration signed off on secret arms shipments to Iran, mostly through Israel, what a variety of witnesses described as the payoff for Iran’s cooperation in getting Reagan elected and then giving him the extra benefit of timing the hostage release to immediately follow his inauguration. Then-Vice President George H.W. Bush with CIA Director William Casey at the White House on Feb. 11, 1981. (Photo credit: Reagan Library) \\nIn summer 1981, when Assistant Secretary of State for the Middle East Nicholas Veliotes learned about the arms shipments to Iran, he checked on their origins and said, later in a PBS interview: \\n“It was clear to me after my conversations with people on high that indeed we had agreed that the Israelis could transship to Iran some American-origin military equipment. … [This operation] seems to have started in earnest in the period probably prior to the election of 1980, as the Israelis had identified who would become the new players in the national security area in the Reagan administration. And I understand some contacts were made at that time.” \\nThose early covert arms shipments to Iran evolved into a later secret set of arms deals that surfaced in fall 1986 as the Iran-Contra Affair, with some of the profits getting recycled back to Reagan’s beloved Nicaraguan Contra rebels fighting to overthrow Nicaragua’s leftist government. \\nWhile many facts of the Iran-Contra scandal were revealed by congressional and special-prosecutor investigations in the late 1980s and early 1990s, the origins of the Reagan-Iran relationship was always kept hazy. The Republicans were determined to stop any revelations about the 1980 contacts, but the Democrats were almost as reluctant to go there. \\nA half-hearted congressional inquiry was launched in 1991 and depended heavily on then-President George H.W. Bush to collect the evidence and arrange interviews for the investigation. In other words, Bush, who was then seeking reelection and who was a chief suspect in the secret dealings with Iran, was entrusted with proving his own guilt. \\nTired of the Story \\nBy the early 1990s, the mainstream U.S. news media was also tired of the complex Iran-Contra scandal and wanted to move on. As a correspondent at Newsweek, I had battled senior editors over their disinterest in getting to the bottom of the scandal before I left the magazine in 1990. I then received an assignment from PBS Frontline to look into the 1980 “October Surprise” question, which led to a documentary on the subject in April 1991. PBS Frontline’s: The Election Held Hostage, co-written by Robert Parry and Robert Ross. \\nHowever, by fall 1991, just as Congress was agreeing to open an investigation, my ex-bosses at Newsweek, along with The New Republic, then an elite neoconservative publication interested in protecting Israel’s exposure on those early arms deals, went on the attack. They published matching cover stories deeming the 1980 “October Surprise” case a hoax, but their articles were both based on a misreading of documents recording Casey’s attendance at a conference in London in July 1980, which he seemed to have used as a cover for a side trip to Madrid to meet with senior Iranians regarding the hostages. \\nAlthough the bogus Newsweek/New Republic “London alibi” would eventually be debunked, it created a hostile climate for the investigation. With Bush angrily denying everything and the congressional Republicans determined to protect the President’s flanks, the Democrats mostly just went through the motions of an investigation. \\nMeanwhile, Bush’s State Department and White House counsel’s office saw their jobs as discrediting the investigation, deep-sixing incriminating documents, and helping a key witness dodge a congressional subpoena. \\nYears later, I discovered a document at the Bush presidential library in College Station, Texas, confirming that Casey had taken a mysterious trip to Madrid in 1980. The U.S. Embassy’s confirmation of Casey’s trip was passed along by State Department legal adviser Edwin D. Williamson to Associate White House Counsel Chester Paul Beach Jr. in early November 1991, just as the congressional inquiry was taking shape. \\nWilliamson said that among the State Department “material potentially relevant to the October Surprise allegations [was] a cable from the Madrid embassy indicating that Bill Casey was in town, for purposes unknown,” Beach noted in a “ memorandum for record ” dated Nov. 4, 1991. \\nTwo days later, on Nov. 6, Beach’s boss, White House counsel C. Boyden Gray, convened an inter-agency strategy session and explained the need to contain the congressional investigation into the October Surprise case. The explicit goal was to ensure the scandal would not hurt President Bush’s reelection hopes in 1992. C. Boyden Gray, White House counsel under President George H.W. Bush. \\nAt the meeting, Gray laid out how to thwart the October Surprise inquiry, which was seen as a dangerous expansion of the Iran-Contra investigation. The prospect that the two sets of allegations would merge into a single narrative represented a grave threat to George H.W. Bush’s reelection campaign. As assistant White House counsel Ronald vonLembke, put it , the White House goal in 1991 was to “kill/spike this story.” \\nGray explained the stakes at the White House strategy session. “Whatever form they ultimately take, the House and Senate ‘October Surprise’ investigations, like Iran-Contra, will involve interagency concerns and be of special interest to the President ,” Gray declared, according to minutes . [Emphasis in original.] \\nAmong “touchstones” cited by Gray were “No Surprises to the White House, and Maintain Ability to Respond to Leaks in Real Time. This is Partisan.” White House “talking points” on the October Surprise investigation urged restricting the inquiry to 1979-80 and imposing strict time limits for issuing any findings. \\nTimid Democrats \\nBut Bush’s White House really had little to fear because whatever evidence that the congressional investigation received – and a great deal arrived in December 1992 and January 1993 – there was no stomach for actually proving that the 1980 Reagan campaign had conspired with Iranian radicals to extend the captivity of 52 Americans in order to ensure Reagan’s election victory. Former Rep. Lee Hamilton, D-Indiana. \\nThat would have undermined the faith of the American people in their democratic process – and that, as Clark Clifford said in the 1968 context, would not be “good for the country.” \\nIn 2014 when I sent a copy of Beach’s memo regarding Casey’s trip to Madrid to former Rep. Lee Hamilton, D-Indiana, who had chaired the October Surprise inquiry in 1991-93, he told me that it had shaken his confidence in the task force’s dismissive conclusions about the October Surprise issue. \\n“The [Bush-41] White House did not notify us that he [Casey] did make the trip” to Madrid, Hamilton told me. “Should they have passed that on to us? They should have because they knew we were interested in that.” \\nAsked if knowledge that Casey had traveled to Madrid might have changed the task force’s dismissive October Surprise conclusion, Hamilton said yes, because the question of the Madrid trip was key to the task force’s investigation. \\n“If the White House knew that Casey was there, they certainly should have shared it with us,” Hamilton said, adding that “you have to rely on people” in authority to comply with information requests. But that trust was at the heart of the inquiry’s failure. With the money and power of the American presidency at stake, the idea that George H.W. Bush and his team would help an investigation that might implicate him in an act close to treason was naïve in the extreme. \\nArguably, Hamilton’s timid investigation was worse than no investigation at all because it gave Bush’s team the opportunity to search out incriminating documents and make them disappear. Then, Hamilton’s investigative conclusion reinforced the “group think” dismissing this serious manipulation of democracy as a “conspiracy theory” when it was anything but. In the years since, Hamilton hasn’t done anything to change the public impression that the Reagan campaign was innocent. \\nStill, among the few people who have followed this case, the October Surprise cover-up would slowly crumble with admissions by officials involved in the investigation that its exculpatory conclusions were rushed , that crucial evidence had been hidden or ignored , and that some alibis for key Republicans didn’t make any sense . \\nBut the dismissive “group think” remains undisturbed as far as the major U.S. media and mainstream historians are concerned. [For details, see Robert Parry’s America’s Stolen Narrative or Trick or Treason: The 1980 October Surprise Mystery or Consortiumnews.com’s “ Second Thoughts on October Surprise. ”] \\nPast as Prologue \\nLee Hamilton’s decision to “clear” Reagan and Bush of the 1980 October Surprise suspicions in 1992 was not simply a case of miswriting history. The findings had clear implications for the future as well, since the public impression about George H.W. Bush’s rectitude was an important factor in the support given to his oldest son, George W. Bush, in 2000. President George W. Bush is introduced by his brother Florida Gov. Jeb Bush before delivering remarks at Sun City Center, Florida, on May 9, 2006. (White House photo by Eric Draper) \\nIndeed, if the full truth had been told about the father’s role in the October Surprise and Iran-Contra cases, it’s hard to imagine that his son would have received the Republican nomination, let alone made a serious run for the White House. And, if that history were known, there might have been a stronger determination on the part of Democrats to resist another Bush “stolen election” in 2000. \\nRegarding Election 2000, the evidence is now clear that Vice President Al Gore not only won the national popular vote but received more votes that were legal under Florida law than did George W. Bush. But Bush relied first on the help of officials working for his brother, Gov. Jeb Bush, and then on five Republican justices on the U.S. Supreme Court to thwart a full recount and to award him Florida’s electoral votes and thus the presidency. \\nThe reality of Gore’s rightful victory should have finally become clear in November 2001 when a group of news organizations finished their own examination of Florida’s disputed ballots and released their tabulations showing that Gore would have won if all ballots considered legal under Florida law were counted. \\nHowever, between the disputed election and the release of those numbers, the 9/11 attacks had occurred, so The New York Times, The Washington Post, CNN and other leading outlets did not want the American people to know that the wrong person was in the White House. Surely, telling the American people that fact amid the 9/11 crisis would not be “good for the country.” \\nSo, senior editors at all the top new organizations decided to mislead the public by framing their stories in a deceptive way to obscure the most newsworthy discovery – that the so-called “over-votes” in which voters both checked and wrote in their choices’ names broke heavily for Gore and would have put him over the top regardless of which kinds of chads were considered for the “under-votes” that hadn’t registered on antiquated voting machines. “Over-votes” would be counted under Florida law which bases its standards on “clear intent of the voter.” \\nHowever, instead of leading with Gore’s rightful victory, the news organizations concocted hypotheticals around partial recounts that still would have given Florida narrowly to Bush. They either left out or buried the obvious lede that a historic injustice had occurred. Former Vice President Al Gore. (Photo credit: algore.com) \\nOn Nov. 12, 2001, the day that the news organizations ran those stories, I examined the actual data and quickly detected the evidence of Gore’s victory. In a story that day, I suggested that senior news executives were exercising a misguided sense of patriotism. They had hid the reality for “the good of the country,” much as Johnson’s team had done in 1968 regarding Nixon’s sabotage of the Paris peace talks and Hamilton’s inquiry had done regarding the 1980 “October Surprise” case. \\nWithin a couple of hours of my posting the article at Consortiumnews.com, I received an irate phone call from The New York Times media writer Felicity Barringer, who accused me of impugning the journalistic integrity of then-Times executive editor Howell Raines. I got the impression that Barringer had been on the look-out for some deviant story that didn’t accept the Bush-won conventional wisdom. \\nHowever, this violation of objective and professional journalism – bending the slant of a story to achieve a preferred outcome rather than simply giving the readers the most interesting angle – was not simply about some historical event that had occurred a year earlier. It was about the future. \\nBy misleading Americans into thinking that Bush was the rightful winner of Election 2000 – even if the media’s motivation was to maintain national unity following the 9/11 attacks – the major news outlets gave Bush greater latitude to respond to the crisis, including the diversionary invasion of Iraq under false pretenses. The Bush-won headlines of November 2001 also enhanced the chances of his reelection in 2004. [For the details of how a full Florida recount would have given Gore the White House, see Consortiumnews.com’s “ Gore’s Victory ,” “ So Bush Did Steal the White House ,” and “ Bush v. Gore’s Dark American Decade. ”] \\nA Phalanx of Misguided Consensus \\nLooking back on these examples of candidates manipulating democracy, there appears to be one common element: after the “stolen” elections, the media and political establishments quickly line up, shoulder to shoulder, to assure the American people that nothing improper has happened. Graceful “losers” are patted on the back for not complaining that the voters’ will had been ignored or twisted. U.S. Supreme Court Justice Antonin Scalia. \\nAl Gore is praised for graciously accepting the extraordinary ruling by Republican partisans on the Supreme Court, who stopped the counting of ballots in Florida on the grounds, as Justice Antonin Scalia said, that a count that showed Gore winning (when the Court’s majority was already planning to award the White House to Bush) would undermine Bush’s “legitimacy.” \\nSimilarly, Rep. Hamilton is regarded as a modern “wise man,” in part, because he conducted investigations that never pushed very hard for the truth but rather reached conclusions that were acceptable to the powers-that-be, that didn’t ruffle too many feathers. \\nBut the cumulative effect of all these half-truths, cover-ups and lies – uttered for “the good of the country” – is to corrode the faith of many well-informed Americans about the legitimacy of the entire process. It is the classic parable of the boy who cried wolf too many times, or in this case, assured the townspeople that there never was a wolf and that they should ignore the fact that the livestock had mysteriously disappeared leaving behind only a trail of blood into the forest. \\nSo, when Donald Trump shows up in 2016 insisting that the electoral system is rigged against him, many Americans choose to believe his demagogy. But Trump isn’t pressing for the full truth about the elections of 1968 or 1980 or 2000. He actually praises Republicans implicated in those cases and vows to appoint Supreme Court justices in the mold of the late Antonin Scalia. Republican presidential nominee Donald Trump. \\nTrump’s complaints about “rigged” elections are more in line with the white Southerners during Jim Crow, suggesting that black and brown people are cheating at the polls and need to have white poll monitors to make sure they don’t succeed at “stealing” the election from white people. \\nThere is a racist undertone to Trump’s version of a “rigged” democracy but he is not entirely wrong about the flaws in the process. He’s just not honest about what those flaws are. \\nThe hard truth is that the U.S. political process is not democracy’s “gold standard”; it is and has been a severely flawed system that is not made better by a failure to honestly address the unpleasant realities and to impose accountability on politicians who cheat the voters. \\nInvestigative reporter Robert Parry broke many of the Iran-Contra stories for The Associated Press and Newsweek in the 1980s. You can buy his latest book, America’s Stolen Narrative, either in print here or as an e-book (from Amazon and barnesandnoble.com ).'"}, "time": 1742628347.5857677}