{"duration": 0.19784927368164062, "input_args": {"text": "'Ancient Script Found: The Nephilim Once Walked On Earth Please scroll down for video \\nAncient manuscript tells of ancient giant race visiting Earth. \\nThe Qumran caves in the West Bank have been considered a veritable treasure trove for historians, particularly those specialising in ancient literature and mythology. Sixty years ago, archaeologists unearthed an ancient book in these caves which is referred to as ‘The Book of Giants’. This text gives the details about an ancient race of otherworldly creatures who existed and eventually died out on Earth. \\nAt this current time, there is very little that historians can deduce about the authorship of ‘The Book of Giants’. However, it has been noted that there are remarkable crossovers between this mysterious text and other known ancient manuscripts such as the Mesopotamian epic of Gilgamesh and the apocryphal Book of Enoch. Related Articles Dogs mysteriously fall ill after being walked in British UFO location Rendlesham Forest \\n[Mahway] mounted up in the air like strong winds, and flew with his hands like eagles […he left behind] the inhabited world and passed over Desolation, the great desert […]and Enoch saw him and hailed him, and Mahway said to him […] hither and thither a second time to Mahway […]The Giants await your words and all the monsters of the earth. If […]has been carried […] from the days of […]their […] and they would be added […] we would know from you their meaning […] two hundred trees that from heaven came down… \\nThe Book of the Giants describes the creatures as ‘two hundred trees from heaven’ which came down and populated the planet Earth. They are described as a corrupt and debased species, prone to hideous acts of violence and unnatural acts with animals and human beings. After a period of years, one of the giants Mahway, started to experience prophetic dreams. These dreams saw a tablet bearing the names of everyone on Earth being submerged beneath the water. When the tablet rose again, all but three of the names had been washed away by the waves. This particular passage has been interpreted as referring to the survival of Noah and his family after the great flood. \\nIt was when Mahway shared these visions with his fellow giants that they realised the futility of attempting to resist the forces of heaven. They decided to seek out Enoch and ask him to plead to God on their behalf. Enoch is an ancient Jewish mythological figure believed to be the great-grandfather of Noah. He has a reference in the Book of Genesis where he is described as having a special, personal relationship with God. He lived for an astonishing three hundred and sixty-five years before simply disappearing with God one day. Enoch interceded on behalf of the Giants and delivered a damning judgement to them from God. However, he promised them that there was some hope for their redemption. \\nIt is assumed that the Giants were washed away in the great flood that devastated the world several generations after that. What the race did in the interim is still a matter of great mystery. Another mystery is what this giant race could have been. The fact that they are described as coming down from heaven strongly suggests that there were of an extra-terrestrial origin, which has led some to speculate that the ‘giants’ may have been the heavily mythologised race of ancient aliens called the Nephilim. \\nThe Book of Giants explains how the Nephilim caused chaos on Earth and changed everything during that time. A summary statement of the descent of the wicked angels, bringing both knowledge and havoc. Compare Genesis 6:1-2, 4. \\n1Q23 Frag. 9 + 14 + 15 2[ . . . ] they knew the secrets of [ . . . ] 3[ . . . si]n was great in the earth [ . . . ] 4[ . . . ] and they killed manY [ . . ] 5[ . . . they begat] giants [ . . . ] \\nThe angels exploit the fruifulness of the earth. \\n4Q531 Frag. 3 2[ . . . everything that the] earth produced [ . . . ] [ . . . ] the great fish [ . . . ] 14[ . . . ] the sky with all that grew [ . . . ] 15[ . . . fruit of] the earth and all kinds of grain and al1 the trees [ . . . ] 16[ . . . ] beasts and reptiles . . . [al]l creeping things of the earth and they observed all [ . . . ] |8[ . . . eve]ry harsh deed and [ . . . ] utterance [ . . . ] l9[ . . . ] male and female, and among humans [ . . . ] \\nThe two hundred angels choose animals on which to perform unnatural acts, including, presumably, humans. \\n1Q23 Frag. 1 + 6 [ . . . two hundred] 2donkeys, two hundred asses, two hundred . . . rams of the] 3flock, two hundred goats, two hundred [ . . . beast of the] 4field from every animal, from every [bird . . . ] 5[ . . . ] for miscegenation [ . . . ] \\nThe outcome of the demonic corruption was violence, perversion, and a brood of monstrous beings. Compare Genesis 6:4. \\n4Q531 Frag. 2 [ . . . ] they defiled [ . . . ] 2[ . . . they begot] giants and monsters [ . . . ] 3[ . . . ] they begot, and, behold, all [the earth was corrupted . . . ] 4[ . . . ] with its blood and by the hand of [ . . . ] 5[giant’s] which did not suffice for them and [ . . . ] 6[ . . . ] and they were seeking to devour many [ . . . ] 7[ . . . ] 8[ . . . ] the monsters attacked it. \\n4Q532 Col. 2 Frags. 1 – 6 2[ . . . ] flesh [ . . . ] 3al[l . . . ] monsters [ . . . ] will be [ . . . ] 4[ . . . ] they would arise [ . . . ] lacking in true knowledge [ . . . ] because [ . . . ] 5[ . . . ] the earth [grew corrupt . . . ] mighty [ . . . ] 6[ . . . ] they were considering [ . . . ] 7[ . . . ] from the angels upon [ . . . ] 8[ . . . ] in the end it will perish and die [ . . . ] 9[ . . . ] they caused great corruption in the [earth . . . ] [ . . . this did not] suffice to [ . . . ] “they will be [ . . . ] \\nThe giants begin to be troubled by a series of dreams and visions. Mahway, the titan son of the angel Barakel, reports the first of these dreams to his fellow giants. He sees a tablet being immersed in water. When it emerges, all but three names have been washed away. The dream evidently symbolizes the destruction of all but Noah and his sons by the Flood . \\n2Q26 [ . . . ] they drenched the tablet in the wa[ter . . . ] 2[ . . . ] the waters went up over the [tablet . . . ] 3[ . . . ] they lifted out the tablet from the water of [ . . . ] \\nThe giant goes to the others and they discuss the dream. \\n4Q530 Frag.7 [ . . . this vision] is for cursing and sorrow. I am the one who confessed 2[ . . . ] the whole group of the castaways that I shall go to [ . . . ] 3[ . . . the spirits of the sl]ain complaining about their killers and crying out 4[ . . . ] that we shall die together and be made an end of [ . . . ] much and I will be sleeping, and bread 6[ . . . ] for my dwelling; the vision and also [ . . . ] entered into the gathering of the Giants 8[ . . . ] \\n6Q8 [ . . . ] Ohya and he said to Mahway [ . . . ] 2[ . . . ] without trembling. Who showed you all this vision, [my] brother? 3[ . . . ] Barakel, my father, was with me. 4[ . . . ] Before Mahway had finished telling what [he had seen . . . ] 5[ . . . said] to him, Now I have heard wonders! If a barren woman gives birth [ . . . ] \\n4Q530 Frag. 4 3[There]upon Ohya said to Ha[hya . . . ] 4[ . . . to be destroyed] from upon the earth and [ . . . ] 5[ . . . the ea]rth. When 6[ . . . ] they wept before [the Giants . . . ] \\n4Q530 Frag. 7 3[ . . . ] your strength [ . . . ] 4[ . . . ] 5Thereupon Ohya [said] to Hahya [ . . . ] Then he answered, It is not for 6us, but for Azaiel, for he did [ . . . the children of] angels 7are the Giants, and they would not let all their poved ones] be neglected [. . . we have] not been cast down; you have strength [ . . . ] \\nThe Giants realize the futility of fighting against the forces of heaven. The first speaker may be Gilgamesh. \\n4Q531 Frag. 1 3[ . . . I am a] giant, and by the mighty strength of my arm and my own great strength 4[ . . . any]one mortal, and I have made war against them; but I am not [ . . . ] able to stand against them, for my opponents 6[ . . . ] reside in [Heav]en, and they dwell in the holy places. And not 7[ . . . they] are stronger than I. 8[ . . . ] of the wild beast has come, and the wild man they call [me]. \\n9[ . . . ] Then Ohya said to him, I have been forced to have a dream [ . . . ] the sleep of my eyes [vanished], to let me see a vision. Now I know that on [ . . . ] 11-12[ . . . ] Gilgamesh [ . . . ] \\nOhya’s dream vision is of a tree that is uprooted except for three of its roots; the vision’s import is the same as that of the first dream. \\n6Q8 Frag. 2 1three of its roots [ . . . ] [while] I was [watching,] there came [ . . . they moved the roots into] 3this garden, all of them, and not [ . . . ] \\nOhya tries to avoid the implications of the visions. Above he stated that it referred only to the demon Azazel; here he suggests that the destruction isfor the earthly rulers alone. \\n4Q530 Col. 2 1concerns the death of our souls [ . . . ] and all his comrades, [and Oh]ya told them what Gilgamesh said to him 2[ . . . ] and it was said [ . . . ] “concerning [ . . . ] the leader has cursed the potentates” 3and the giants were glad at his words. Then he turned and left [ . . . ] \\nMore dreams afflict the giants. The details of this vision are obscure, but it bodes ill for the giants. The dreamers speak first to the monsters, then to the giants. \\nThereupon two of them had dreams 4and the sleep of their eye, fled from them, and they arose and came to [ . . . and told] their dreams, and said in the assembly of [their comrades] the monsters 6[ . . . In] my dream I was watching this very night 7[and there was a garden . . . ] gardeners and they were watering 8[ . . . two hundred trees and] large shoots came out of their root 9[ . . . ] all the water, and the fire burned all 10[the garden . . . ] They found the giants to tell them 11[the dream . . . ] \\nSomeone suggests that Enoch be found to interpret the vision. \\n[ . . . to Enoch] the noted scribe, and he will interpret for us 12the dream. Thereupon his fellow Ohya declared and said to the giants, 13I too had a dream this night, O giants, and, behold, the Ruler of Heaven came down to earth 14[ . . . ] and such is the end of the dream. [Thereupon] all th e giants [and monsters! grew afraid 15and called Mahway. He came to them and the giants pleaded with him and sent him to Enoch 16[the noted scribe]. They said to him, Go [ . . . ] to you that 17[ . . . ] you have heard his voice. And he said to him, He wil1 [ . . . and] interpret the dreams [ . . . ] Col. 3 3[ . . . ] how long the giants have to live. [ . . . ] \\nAfter a cosmic journey Mahway comes to Enoch and makes his request. \\n[ . . . he mounted up in the air] 41ike strong winds, and flew with his hands like ea[gles . . . he left behind] 5the inhabited world and passed over Desolation, the great desert [ . . . ] 6and Enoch saw him and hailed him, and Mahway said to him [ . . . ] 7hither and thither a second time to Mahway [ . . . The giants awaig 8your words, and all the monsters of the earth. If [ . . . ] has been carried [ . . . ] 9from the days of [ . . . ] their [ . . . ] and they will be added [ . . . ] 10[ . . . ] we would know from you their meaning [ . . . ] 11[ . . . two hundred tr]ees that from heaven [came down . . . ] \\nEnoch sends back a tablet with its grim message of judgment, but with hope for repentance. \\n4Q530 Frag. 2 The scribe [Enoch . . . ] 2[ . . . ] 3a copy of the second tablet that [Epoch] se[nt . . . ] 4in the very handwriting of Enoch the noted scribe [ . . . In the name of God the great] 5and holy one, to Shemihaza and all [his companions . . . ] 61et it be known to you that not [ . . . ] 7and the things you have done, and that your wives [ . . . ] 8they and their sons and the wives of [their sons . . . ] 9by your licentiousness on the earth, and there has been upon you [ . . . and the land is crying out] 10and complaining about you and the deeds of your children [ . . . ] 11the harm that you have done to it. [ . . . ] 12until Raphael arrives, behold, destruction [is coming, a great flood, and it will destroy all living things] 13and whatever is in the deserts and the seas. And the meaning of the matter [ . . . ] 14upon you for evil. But now, loosen the bonds bi[nding you to evil . . . ] l5and pray. \\nA fragment apparently detailing a vision that Enoch saw. \\n4Q531 Frag. 7 3[ . . . great fear] seized me and I fell on my face; I heard his voice [ . . . ] 4[ . . . ] he dwelt among human beings but he did not learn from them [ . . . ] \\nThe Book of the Giants By W. B. HENNING: \\nThis article (Ancient Script Found: The Nephilim Once Walked On Earth) is free and open source. You have permission to republish this article under a Creative Commons license with full attribution and a link to the original source on Disclose.tv Related Articles'"}, "time": 1742562274.1622877}