{"duration": 0.22631072998046875, "input_args": {"text": "'Email \\nOn November 4, the National Rifle Association (NRA) called on Americans concerned about the future of the right to keep and bear arms to focus their attention on electing pro-Second Amendment senators in the upcoming federal elections. \\nThese senators, the NRA explains, will be the last obstacle standing between the United Nation\\'s Arms Trade Treaty\\'s (ATT) forced civilian disarmament and the continuation of gun rights in America. But that’s just the beginning. As you know, the U.S. Senate also ratifies international treaties. Right now, at the United Nations, the Arms Trade Treaty — which could subject American gun owners to international gun registration, monitoring and global gun-control “norms” that would be defined on the fly — is just waiting, like unexploded ordnance, for an anti-gun U.S. Senate to call it in. Under President Obama, Secretary of State John Kerry signed onto the Arms Trade Treaty. All the treaty needs to become the law of the land is for the U.S. Senate to ratify it. \\nWhile it is certainly wise to fill the Senate (and the House, for that matter) with representatives committed to upholding the Constitution, there are other, surer and more constitutionally sound ways of blocking the unconstitutional confiscation of weapons and ammunition that would be carried out should the UN\\'s Arms Trade Treaty by enforced in the United States. \\nThe most powerful check citizens of the states have on the seizure of weapons by the UN or its American allies is the nullification of any and all unconstitutional acts of the federal government. \\nNullification is the exercise by states of their retained authority to hold as null, void, and of no legal effect any act of the federal government that exceeds its constitutionally enumerated powers. This availability of this tactic is proclaimed and protected by the 10th Amendment to the U.S. Constitution. \\nThe NRA is correct, though, that the ATT is so offensive to the preservation of the right to keep and bear arms that it is an understatement to call it unconstitutional. As The New American has reported, several provisions of this treaty significantly diminish the scope of this basic right. \\nFirst, the Arms Trade Treaty grants a monopoly over all weaponry in the hands of the very entity (government) responsible for over 300 million murders in the 20th century. \\nFurthermore, the treaty leaves private citizens powerless to oppose future slaughters. \\nAn irrefutable fact of armed violence unaddressed by the UN in its gun grab is that all the murders committed by all the serial killers in history don\\'t amount to a fraction of the brutal killings committed by \"authorized state parties\" using the very weapons over which they will exercise absolute control under the terms of the Arms Trade Treaty. \\nArticle 2 of the treaty defines the scope of the treaty’s prohibitions. The right to own, buy, sell, trade, or transfer all means of armed resistance, including handguns, is denied to civilians by this section of the Arms Trade Treaty. \\nArticle 3 places the “ammunition/munitions fired, launched or delivered by the conventional arms covered under Article 2” within the scope of the treaty’s prohibitions, as well. \\nArticle 4 rounds out the regulations, also placing all “parts and components” of weapons within the scheme. \\nPerhaps the most immediate threat to the rights of gun owners in the Arms Trade Treaty is found in Article 5. Under the title of “General Implementation,” Article 5 mandates that all countries participating in the treaty “shall establish and maintain a national control system, including a national control list.” \\nThis list should “apply the provisions of this Treaty to the broadest range of conventional arms.” \\nArticle 12 adds to the record-keeping requirement, mandating that the list include “the quantity, value, model/type, authorized international transfers of conventional arms,” as well as the identity of the “end users” of these items. \\nIn very clear terms, ratification of the Arms Trade Treaty by the United States would require that the U.S. government force gun owners to add their names to the national registry. Citizens would be required to report the amount and type of all firearms and ammunition they possess. \\nSection 4 of Article 12 of the treaty requires that the list be kept for at least 10 years. \\nFinally, the agreement demands that national governments take “appropriate measures” to enforce the terms of the treaty, including civilian disarmament. If these countries can’t get this done on their own, however, Article 16 provides for UN assistance, specifically including help with the enforcement of “stockpile management, disarmament, demobilization and reintegration programmes.” \\nIn fact, a “voluntary trust fund” will be established to assist those countries that need help from UN peacekeepers or other regional forces to disarm their citizens. \\nThere is no way that the men and women of the United States can hope to maintain their hard-won liberty — liberty that cost the lives, fortunes, and sacred honor of some of the greatest men of the 18th century — without the ability to put up an armed resistance to tyrants and to their armed enforcers. \\nThe truth is, though, the Senate — in collusion with the president and the Supreme Court — has shrunk the scope of the Second Amendment despite the fact that the plain language of the Second Amendment explicitly forbids any infringement on this right that protects all others. \\nIn fact, the reason for inclusion of the Second Amendment in the Bill of Rights had little to do with the British and more to do with future attempts by an out-of-control, all-powerful central authority disarming the American people as a step toward tyranny. \\nTake, for example, statements by our forefathers regarding the purpose of the passage of this amendment. In commenting on the Constitution in 1833, Joseph Story wrote: The right of the citizens to keep and bear arms has justly been considered, as the palladium of the liberties of a republic; since it offers a strong moral check against the usurpation and arbitrary power of rulers; and will generally, even if these are successful in the first instance, enable the people to resist and triumph over them.\" \\nIn his own commentary on the works of the influential jurist Blackstone, Founding-era legal scholar St. George Tucker wrote: This may be considered as the true palladium of liberty.... The right of self defense is the first law of nature: in most governments it has been the study of rulers to confine this right within the narrowest limits possible. Wherever standing armies are kept up, and the right of the people to keep and bear arms is, under any color or pretext whatsoever, prohibited, liberty, if not already annihilated, is on the brink of destruction. \\nWriting in The Federalist , Alexander Hamilton explained: If the representatives of the people betray their constituents, there is then no resource left but in the exertion of that original right of self-defense which is paramount to all positive forms of government, and which against the usurpations of the national rulers, may be exerted with infinitely better prospect of success than against those of the rulers of an individual state. \\nTo accomplish this urgent task of protecting this \"true palladium of liberty,\" it would be better if Americans adopted a two-pronged attack on the Arms Trade Treaty, rather than relying alone on senators in Washington, D.C. to stand steadfastly against those who would confiscate the firearms from Americans. \\nFirst, as the NRA suggests, we must elect federal senators who will refuse to ratify the globalists\\' gun grabbing scheme. \\nSecond, and perhaps most important and effective, Americans should elect state representatives and governors who will refuse to cooperate with the federal government in any unconstitutional program, particularly one that would leave citizens at the mercy of the government\\'s monopoly on arms that would be created by the enforcement of the Arms Trade Treaty.  '"}, "time": 1742563050.9492784}