{"duration": 0.036704063415527344, "input_args": {"text": "'BERLIN (AP)  —   Rabbi Yehuda Teichtal doesn’t get much sleep these days, but says it’s well worth it. The community rabbi and head of the Jewish outreach group Chabad in Berlin has been campaigning relentlessly to turn his dream of creating a Jewish campus in Germany into a reality. [For years, he’s lobbied the German authorities, raised millions of euros (dollars) in funds and bought a 3, 000 square meter (32, 000 square feet) plot of land next to Chabad’s synagogue in the German capital’s Wilmersdorf district.  More than just a new facility, Teichtal sees the center as a step toward Chabad’s goal of   a vibrant Jewish community in the former Nazi capital, in part by welcoming and integrating Jewish immigrants from the former Soviet Union and encouraging interactions with  . “Everyone in Europe talks about fears and uncertainties, we’re talking about going forward,” said the    orthodox rabbi, looking across the large empty plot where a few containers have been set up as a temporary extension of Chabad’s kindergarten. The planned   building will be dedicated to Jewish education, culture and sports, the first of its kind in Germany. If all goes to plan, the groundbreaking is scheduled for September and the entire campus is slated to be finished in late 2019. German authorities approved some of the   permissions earlier this month. “With all the challenges we’re facing today, building this campus is a signal: We’re here to stay  —   otherwise we wouldn’t build,” says Teichtal, who wears a traditional beard, a velvet kippah and a black caftan. Germany has experienced a strong influx of Jews in recent decades and Berlin has the biggest Jewish community in Germany, with about 40, 000 members. Those numbers are still a far cry, however, from Germany’s flourishing Jewish community of more than 500, 000 before the Nazi period, with some 120, 000 Jews in Berlin alone. Overall, some six million European Jews were murdered by the Nazis in the Holocaust. Because of its history, Germany took in some 200, 000 Jews from the former Soviet Union since the fall of communism in 1989  —   most of them secular and with only little knowledge about their own religion. When Rabbi Teichtal and his wife Leah set out from Brooklyn to Berlin 20 years ago, they came with the goal of reaching out to this group, but also to the established German Jewry. Though New York based, Chabad members are sent out as “Jewish messengers” around the globe with the aim of getting mostly unaffiliated Jews in touch with their religion. In the last two decades, the Chabad community in Berlin has kept growing and there are now around 600 to 700 families who regularly take part in the community’s offerings, Teichtal said. Chabad has a synagogue, an educational center, a kindergarten, an elementary and high school  —   but the facilities are spread over the city and so popular that the Jewish group can’t offer places to all the applicants. With the establishment of the new 7, 000   (75, 300  ) campus, all Chabad schools will all be united under one roof and also offer more facilities, including a library, cafeteria, movie theater, concert hall and a ballroom for weddings and other festivities. The sports center will include an indoor basketball court and opportunities for soccer and other ball games. Outside, there’ll be a playground and a garden. The cost of the entire campus is projected at around 18 million euros ($20. 3 million). It’s being funded by the federal government, Berlin’s state government, several German foundations and private donations. Unlike most Jewish institutions in Germany, which are behind fences and tightly guarded against   attacks, Teichtal says he wants the Jewish campus to be open to everyone. “It should become a place where Jews and   can come together and meet,” he said.'"}, "time": 1742628543.2679217}