{"duration": 0.19034790992736816, "input_args": {"text": "'Email \\n“We learn from history that we do not learn from history,” observed German philosopher Georg Hegel. Perhaps nothing illustrates this better than a new survey showing that far too many “millennials” are not just cool to “capitalism,” but are actually cool with communism. As MarketWatch reports : Of the 2,300 Americans polled by YouGov , 80% of baby boomers and 91% of the elderly agree with the statement that “communism was and still is a problem” in the world today. Millennials? Only 55%. Furthermore, almost half of Americans between the ages of 16 and 20 said they would vote for a socialist, while 21% would go so far as to back a communist. Capitalism, on the other hand, is viewed favorably by 64% of those over the age of 65, compared with only 42% of millennials. \\nCiting these results, the Victims of Communism Memorial Foundation’s Marion Smith stated, as quoted by MarketWatch , “One of the concerns [the foundation] has had since its establishment is that an emerging generation of Americans has little understanding of the collectivist system and its dark history.” For sure. This was evidenced when a teenager once naively asked me, “What’s so bad about communism?” Another registered a look of shock when I gave him part of the answer: During the 20th century, Marxist governments exterminated approximately 100 million people, making them history’s most murderous ideologues. \\nRelated to this, MarketWatch also tells us that “a third of millennials say they believe more people were killed under George W. Bush than Joseph Stalin,” clearly oblivious to Stalin’s psychopathic actions having accounted for upwards of 20 million of the above number. Of course, 82 percent of millennials at least knew who Stalin was. This cannot be said regarding Chinese leader Mao Tse-tung; 42 percent of millennials were unfamiliar with this mass murderer of approximately 60 million. Forty percent didn’t know who Argentine Marxist and major Cuban Revolution figure Che Guevara was. With respect to Vladimir Lenin and Karl Marx, the “unacquainted with” figures were, respectively, 33 and 32 percent. \\nNot surprisingly, this ignorance goes beyond history. While it’s troubling that almost half of those aged 16 to 20 would support a socialist, there’s good and bad news here. And they’re the same thing: \\nThese young people generally don’t know what socialism is. \\nAs I wrote in February, “People 18 to 29 just helped vault Senator Bernie Sanders to a resounding New Hampshire primary victory, not at all deterred by his socialist label. But while they view that positively, they don’t believe in socialist (in Sanders’) wealth redistribution. In fact, this research shows that they cotton to it little more than do average Americans and no more than their age group did 20 years ago. In other words, millennials may like the word socialism, but, as with so many others, they don’t understand well what it signifies or the nature of those for whom they vote.” \\nIn reality, the label “socialism” is applied loosely today, yet it has a firm definition. Note that socialism was popularized via Karl Marx’s and Friedrich Engels’ Communist Manifesto . And under Marxist doctrine, “socialism” — or the socialist revolution — is the transitional phase that extinguishes economic freedom and ushers in communism. Moreover, there are no communist governments because “communism” is the culmination of socialism, the stage where, the fanciful theory goes, the government has melted away and everyone lives happily and harmoniously in a state of economic equality-induced bliss. \\nThis is why the Iron Curtain-disgorging evil empire could, with a straight collective face, call itself the Union of Soviet Socialist Republics. And it’s why we should see a red flag (pun intended) when a politician such as Bernie Sanders calls himself a socialist. Maybe he’s more wizened than wise and doesn’t really know what the word means — or, perhaps, he knows full well — and is capitalizing on the fact that others don’t. \\nWhatever the case, it would be a mistake to view socialist seduction as solely a “millennial” problem, as this only sparks intergenerational squabbling. For there are old fools and young fools and much foolishness in-between. Yet while we recognize that people are largely products of their upbringing, we nonetheless will analyze a given generation as if it’s a breed apart as opposed to what it almost always is: the next iteration in a pattern. \\nConsider how 80 percent of Boomers consider communism a problem. While a high number, it’s still a statistically significant drop from their elders’ 91 percent figure. And this is just part of a pattern, with the percentage of each age group that views “socialism” positively being as follows: age 65+, 13 percent; 50-64, 25 percent; 30-49, 34 percent; 18-29, 49 percent ( Pew Research Center , Dec. 28, 2011). Evident here isn’t an overnight sea-change, but steadily increasing ignorance. \\nTragically, this is a worldwide phenomenon. Marxism has to an extent taken hold in Japan , Spain , and elsewhere, and Karl Marx is more popular than he has been in decades. As I wrote in 2013, “Sales of The Communist Manifesto (the best-selling book in history next to the Bible) and Das Kapital have soared since the 2008 financial crisis. Karl Marx was voted ‘favorite philosopher’ by BBC radio listeners, beating out contenders such as Plato, Aristotle, Socrates, and Thomas Aquinas. And in an irony akin to having Marx’s picture on a Bible tract, his image is the one most often chosen by customers of Germany’s Sparkasse Chemnitz Bank — for their credit cards.” \\nGiven the above, it’s not surprising that what inspired mockery of late Senator Joe McCarthy has become reality: Marxist types abound in our government. New York City elected “Bolshevik” Bill de Blasio, who raised money for the Sandinistas, subscribed to their newsletter, and honeymooned in Cuba. John Drew, a former Barack Obama acquaintance and reformed Marxist with whom I’ve spoken personally, revealed that when he knew Obama, Obama was an “ardent Marxist-Leninist” who “was in 100 percent, total agreement with [his] Marxist professors”; this is no surprise because Obama’s mentor, Frank Marshall Davis, was a card-carrying member of the Communist Party USA. \\nThen there are Obama’s appointees, such as former “Green Jobs Czar” and self-proclaimed communist Van Jones; former communications director Anita Dunn, who said that Mao Tse-tung was one of her “two favorite philosophers”; “Manufacturing Czar” Ron Bloom, who said in a speech, “We agree with Mao”; and “Global Warming Czar” Carol Browner, who was until recently listed as a leader of the socialist organization “Commission for a Sustainable World Society.” \\nAnd, finally, there’s the woman who wants to succeed Obama, Hillary Clinton. Former Clinton operative Larry Nichols tells us that when he first met her, in the 1970s, she was wearing a medal around her neck stating, “Proud member of the American Communist Party” (video here ; forward to 6:07). No wonder the Communist Party USA is “all in” for Hillary . \\nIt’s also no wonder that Clinton is beating Donald Trump by 28 points among under-30 voters. But tolerance for socialism/communism is intolerable. If we learned that almost half of young Americans would vote for a fascist and 21 percent would go so far as to back a Nazi, we’d rightly be aghast. Instead, they’re warming to the ideological descendants of even more prolific killers. Hey, what’s 100 million victims between comrades?  '"}, "time": 1742561748.4651146}