{"duration": 0.04499983787536621, "input_args": {"text": "\"Obama Won’t Go Away After He’s Done. That’s Good News. By: November 21, 2016 \\nSo, soon-to-be-ex-President Obama won’t be going away anytime soon. \\nAfter George W. Bush left office, he essentially went silent. He had no criticism for President Obama; he didn’t sound off about Mitt Romney or Donald Trump. He went away. Not so for Obama. It seems that Barack Obama will follow the Jimmy Carter pathway to Annoyingland: he’ll be commenting whenever possible. After acknowledging that Bush “could not have been more gracious to me when I came in,” Obama said, “As an American citizen who cares deeply about our country, if there are issues that have less to do with the specifics of some legislative proposal or battle or go to core questions about our values and ideals, and if I think that it’s necessary or helpful for me to defend those ideals, I’ll examine it when it comes.” \\nThis comes as welcome news for Republicans. Obama’s policy unpopularity – and his tendency to lecture from on high to Americans in rural areas – means that he’ll suck all the oxygen out of the room when it comes to criticizing Trump and Republicans. Middle Americans voted for Trump in order to sound off against Obama’s obvious scorn for them. Here’s what Obama had to say about those who didn’t vote for Trump in today’s Der Spiegel : \\nIf you look at the new generation of Americans, they reflect the vision that I spoke about. They're diverse. They believe in tolerance. They're accepting of things like same-sex marriage. They believe in integration. The problem, though, is that young people are less likely to vote than older people. What results is a situation in which sometimes the elections don't fully reflect the views of the American population. Essentially, the president-elect was supported by about 27 percent of the American population. One of our challenges, historically, is that we have very low voting rates, even during presidential elections. \\nThis sort of language drove Americans to Trump. And if Obama continues to critique Trump from the outside with this sort of language, not only will he be doing Trump a favor, he’ll be preventing any other Democrat from taking a leading role in opposing Trump. He’ll become the point of resistance for his own party – and his party won’t be able to escape his shadow. \\nObama’s ego has already cost his party the presidency, the Senate, the House, a bevy of state legislators and governor’s mansions. Now it may cost them the future. \\nExcellent. \""}, "time": 1742564295.774583}