{"duration": 0.05010700225830078, "input_args": {"text": "'Tuesday on ABC’s “The View,”   Whoopi Goldberg wondered if  the “values” of Trump administration are “really much different than the Taliban’s?”  Goldberg said, “We also keep hearing about terrorists hating our American values. We had this conversation yesterday. So let me ask you now —   now, we have had a leader who’s repeatedly demeaned women, wants to defund organizations that benefit woman, calling on the media to shut up, specifically wants to give preferential treatment based on religion, are these values really much different than the Taliban’s?” When asked if she was talking about Trump’s values, Goldberg continued, “Well no, the values that we are listening to. One of the things that you read yesterday was the piece of the  …    the language in the ban, which was about if you disrespect women. So yesterday I was thinking about this. All of these things that I have been hearing, have our values changed? What’s happened? Are we still fighting  —   She continued, “I feel like, listen, if you’re saying to the media shut up  —   that’s what they do. Maybe they didn’t start out chopping people’s heads off, maybe they started out differently. I’m asking. It, it feels like it’s tricky. Because we’re saying to people, here are our American values, and then we’re saying on the same token stuff that sounds exactly like the stuff we’re fighting. ” She concluded, “That brings me back to this question, it brings me back to the question. So the question is, when you put some of these things side by side —  what kind of religion you’re supposed to have, you’re supposed to have one religion  …    When he says there’s preferential treatment for Christians, forgetting the other religions out there  …    You know here’s the thing, we have a Constitution that says these are the things that we don’t do. This is what makes us different from everybody else. Our media, nobody tells our media to shut up and just take it. Nobody. That’s not American. That is the Taliban  …    My question is, what’s happening?” Follow Pam Key on Twitter @pamkeyNEN'"}, "time": 1742562078.6048453}