{"duration": 0.06290054321289062, "input_args": {"text": "'What is your job now? I don’t have one, really. I’ve got a consulting company with a handful of clients  —   a couple of nonprofits, a universe of businesses and executives whose instincts are good. Sometimes they just want to kibitz. During the week of the Democratic National Convention, you appeared on both Stephen Colbert’s and Bill Maher’s shows. What’s your current philosophy on media exposure? I’m more experiential. When you do media as an elected official or as a candidate, you have a very clear message that you’re trying to impart and an idea of who you’re talking to. Now I don’t have all that. It’s more just to say what I think. You’re an unusual public figure in that you are known as a former member of Congress and candidate for mayor  —   and now you’re a guy who had an embarrassing sex scandal featured in a recent documentary. Do people approach you differently? The interactions I have with people have gotten clouded lately because of the movie. The movie seems very much to be a Rorschach test of what people thought about the thing itself. Some people approach me, and they’re like, “Oh, you got a raw deal. ” Some people approach me saying, “Oh, man, I wish you hadn’t messed up. ” Some people approach me and say, “Man, you are such an idiot. ” Have you or your wife, Huma Abedin, seen it? No. Do you regret giving access to the filmmakers? Obviously, when I agreed to do the movie, I anticipated a different outcome. Does anything hurt your feelings anymore or are you kind of immunized by what you’ve been through? To some degree, the same thing that made me successful and that allowed me to survive stuff is that my emotional wiring isn’t fully connected. I have a very thick skin. Without going down a rabbit hole here, you could argue that some of my emotional wiring wasn’t working terribly well. That is how I can survive having 40 cameras outside my house. Are you still engaging in the activities that got you in trouble? I’m not going to go down the path of talking about any of that. But I will say this: There’s no doubt that the Trump phenomenon has led a lot of people to say to me, “Boy, compared to inviting the Russians to come hack someone’s email, your thing seems almost quaint. ” I would think a great number of your former Republican colleagues in Congress must have some regrets about what’s really going on in their party, but most of them can’t say anything. Do you think that might change now that the conventions are behind us? No. The reason they don’t say anything is because they think it fractures their base. But I’m far enough away from this that I doubt my judgment. Recently, you said that if Donald Trump Jr. ran for mayor of New York, you might run yourself, just so you could beat him “like a rented mule. ” I never understood that expression. Why would a rented mule get beaten worse than a regular mule? I don’t know. I grew up listening to Don Imus, who would use that expression all the time. It’s colorful. Do you miss politics? I always had this philosophy when I was an elected official that I shouldn’t be a pundit, but now I’m called upon to be one every once in a while. Notwithstanding the flames I went down in, I’m pretty good at this stuff. Have you thought about running campaigns or being a political consultant? Almost weekly, some candidate will call and ask for advice. I’ve weirdly become a little bit of an elder statesman. Shouldn’t you get paid for it then? No, I don’t want to make a life out of it. Also, no one would want me. Why not? Would you really want the distraction of having me as your campaign manager?'"}, "time": 1742563429.2479181}