{"duration": 0.052301645278930664, "input_args": {"text": "'WASHINGTON  —   Under extreme pressure from conservative activists, House Republican leaders and the White House have restarted negotiations on legislation to repeal the Affordable Care Act. But efforts to revive the legislation in the House could take weeks, lawmakers conceded, as Congress moves forward with a full plate of other   issues. And the renewed push did not meet with much enthusiasm from Senate Republicans, who said they had other priorities at the moment. Nonetheless, Speaker Paul D. Ryan vowed to renew efforts to repeal the law, despite last week’s crushing setback when House Republicans tossed aside a repeal bill because they lacked the votes to pass it. Just days after President Trump said he was moving on to other issues, senior administration officials said they still hoped to score the kind of big legislative victory that has so far eluded the White House. Vice President Mike Pence was dispatched to Capitol Hill on Tuesday for lunchtime talks. “We’re not going to retrench into our corners or put up dividing lines,” Mr. Ryan said after a meeting of House Republicans was dominated by talk of how to restart health negotiations. “There’s too much at stake to get bogged down in all that,” he added. Democrats had celebrated what they thought was the demise of the repeal bill on Friday. But the House Republican whip, Steve Scalise of Louisiana, said on Tuesday, “Their celebration is premature. ” “I think we’re closer today to repealing Obamacare than we’ve ever been before, and surely even closer than we were Friday,” Mr. Scalise said. It is not clear what political dynamics might have changed since Friday, when a coalition of   conservatives and more moderate Republicans torpedoed legislation to repeal President Barack Obama’s signature domestic achievement. “I don’t know what has changed,’’ said Representative Jim McGovern, Democrat of Massachusetts. “The bill went down because it was too bad for Republican moderates and not bad enough for their conservatives. I don’t know how they reconcile the divides within their own conference, never mind find any Democratic votes. ” The Republicans’ repeal bill, according to the Congressional Budget Office, would have left an additional 24 million Americans without insurance by 2026, a major worry for moderate Republicans. It would also have left in place regulations on the health insurance industry that are anathema to conservatives. Mr. Ryan declined to say what might be in the next version of the Republicans’ repeal bill, nor would he sketch any schedule for action. But he said Congress needed to act because insurers were developing premiums and benefit packages for health plans to offer in 2018, with review by federal and state officials beginning soon. The new talks, which quietly began this week, involve Stephen K. Bannon, the president’s chief strategist, and members of two Republican factions that helped sink the bill last week, the   Freedom Caucus and the more centrist Tuesday Group. Any deal would have to overcome significant differences about how to rework a law that affects about   of the American economy. Those differences were so sharp that they led Mr. Trump and Mr. Ryan to pull the bill just before the House was to vote on it. Still, Republican members of Congress said they were hopeful. “I think everyone wants to get to yes and support President Trump,” said Representative Dave Brat of Virginia, a Freedom Caucus member. “There is a package in there that is a  . ” Representative Raúl R. Labrador of Idaho, also a Freedom Caucus member, said he hoped the discussions would yield a compromise after a divisive debate that revealed deep fissures within the party. “I think we will have a better, stronger product that will unify the conference,” Mr. Labrador said. Mr. Trump has sent mixed signals in recent days, at times blaming the Freedom Caucus, outside groups and even, it appeared, Mr. Ryan for the health bill’s failure. On Monday, for instance, he said in a   Twitter post that the Freedom Caucus was able to “snatch defeat from the jaws of victory. ” But then Mr. Trump suggested that he could also cut a deal with Democrats, a move that would almost certainly make more conservative members of the House balk. “Do not worry,” he said on Twitter, “we are in very good shape!” At a White House reception for senators on Tuesday night, Mr. Trump called for Republicans and Democrats to work together as he predicted that “we are all going to make a deal on health care. ” “That’s such an easy one,” Mr. Trump said. “I have no doubt that that’s going to happen very quickly. ” Lawmakers who attended the meeting of House Republicans on Tuesday said it was a lively exchange at which members of the Freedom Caucus were put on the defensive. “There were a lot of unhappy people who got to vent, got to share their frustration,” said Representative Randy Weber of Texas, a member of the Freedom Caucus. “People said the Freedom Caucus owes us an explanation. ” In the Senate, the majority leader, Mitch McConnell of Kentucky, an inveterate foe of the 2010 health care law, said, “Where we are on Obamacare, regretfully, at the moment is where the Democrats wanted us to be, which is with the status quo. ” Democrats “ought to be pretty happy about that, because we have the existing law in place, and I think we’re just going to have to see how that works out,” Mr. McConnell said. “We believe it will not work out well, but we’ll see. ” Senator John Thune of South Dakota, the No. 3 Senate Republican, said he believed the House would take up another repeal bill. “It’s not a question of if, it’s a question of when,’’ he said. Senator John McCain, Republican of Arizona, said: “Obamacare is imploding in my state. Something has to be done. ” Asked if he could vote for a bill that did not include a full repeal of the Affordable Care Act, Mr. McCain said, “I would be willing to examine all options to protect the citizens of my state. ” Mr. Ryan said he hoped to foster a consensus through conversations like the one House Republicans had on Tuesday. “I don’t want us to become a factionalized majority,” he said. “I want us to become a unified majority, and that means we’re going to sit down and talk things out until we get there, and that’s exactly what we’re doing. ” Seizing a possible opportunity, the House Democratic leader, Nancy Pelosi of California, asked members of her caucus to suggest ways of improving the Affordable Care Act. Blocking the repeal bill was a “thrilling success,” she said in a letter to House Democrats. She asked them to suggest ways to “improve and update” the law, which she pushed through the House in 2010 without any Republican votes. Suggestions, she said, could be used in discussions with other members of Congress and “perhaps even with the president. ”'"}, "time": 1742628473.818493}