{"duration": 0.07908916473388672, "input_args": {"text": "'License DMCA \\nThe play develops with the .1% quarterback doing a reverse pivot (causing the progressive linebackers to hold their position instead of rushing to sack the QB), faking a quick toss to the left outside, where only the down ballot players are located, turns and runs toward the right, threatening to keep the ball, pitch it to Icame/HenowDed or throw downfield to MSM. \\nMSM does one hell of a fake job getting the gullible and other gatekeepers to concentrate on stopping the OrangeOne, while the down ticket no names streak down the left side of the field in a space created by sleight of hand of the .1%. Many in the crowd could see what was developing, but they were mesmerized and sickening quiet as the .1% dollars reverse flowed to those down ticket of Orange the Dickless. Barrel of Dollars from the Quantitative Facilities. License DMCA - Advertisement - \\nI have no right to complain even though I suspected a trick play as the .1% came up to the line. Why would the.1% risk having a blabber mouth plant the idea that NATO had outlived its usefulness? Or that the trade deals were a bunch of crap for the 99.99%, certainly the 50%? No, it would not have been prudent. The .1% is not yet prepared to go for total population control this early in their Plan that a Trumpet presidency would cause: riots in the American cities and countryside and the resulting roll out of permanent martial law and surveillance. Their plate was full and their cup runneth over with the likes of a failed coup in Turkey for whom they and their western cohorts must pay the chump change of a couple of billion dollars in extortion demanded by Erdogan or face his unleashing of leased terrorists in European cities. Yes their bloody hands were full from bombed and drone attacked civilians in funeral processions, and UN humanitarian convoys, patients, doctors and nurses in hospitals one of which where those anti-globalist doctors without borders were aiding the sovereign government, droning on and on to Libya, Yemen with a drone strike here and there, keeping a peering eye on Mo-uglies friends in Mogadishu, trying to pave a road to Tehran, while prepping the former Russian protectorates for turmoil and division, aka The Stans, and talking smack to the Russians about the Crimea, as they move to conduct war execercises in Poland and place missile systems in not only Poland but Romania all the while letting the Chinese know that they are pivoting toward them with Australia and the Philippines in tow -- That\\'s a lot all right. I could have edumacated myself about who was running down ticket and yelled and screamed and organize but I was too focused on the fact that the .1% was so obvious that everyone would know to vote downtown to throw out the .1% cronies. \\nUnfortunately the .1% has a deep bench, and the defense was unprepared. Sucked in by the expectation that the court of referees would throw yellow flags against the .1% for voter interference, personal fouls, holding and widespread unsportsmanlike conduct of the Clinton primaries, I now watch in disbelief as the refs picked up their god damn flags and put them back into their pockets with only seconds left, while the .1% cronies stroll down field pushing barrels of quantitatively eased dollars to win over the brain dead including those with no brains. \\nI don\\'t think I can stuff any more allegory into this sports analogy, I could talk about the after game show, arm chair quarterbacking by the losing team, but by now I think you have got the freakin picture. \\nPerhaps someone would like to take a crack along similar lines of the big bad wolf huffing and puffing? We can leave any time we want, so don\\'t cry for us. License DMCA \\nSo to all those including myself, as I step up from my soap box to my high horse, tanks a lot\"no really. Tank you very, very much. If we are alive four years from now, perhaps we will remember what happened this tiime and be prepared -- nah, ain\\'t gonna happen, our memories will be wiped or our heads chopped off.'"}, "time": 1742561871.4090433}