{"duration": 0.07898163795471191, "input_args": {"text": "'0 comments He and Huma Abedin interned for the Clintons and rose to power. Now WikiLeaks has exposed the truth about all of them… At age 22, Doug Band started interning for President William Jefferson Clinton. Later, he earned a law degree, and became Bill Clinton’s top assistant. He is Bill Clinton’s version of Huma Abedin, and the connections between Band and Abedin are also tightly woven in to the fabric of the Clinton story. He became a talented negotiator. According to the bio on his company website (Teneo,) Doug Band was “part of the negotiation team that handled all aspects of Hillary Clinton’s becoming secretary of state.” Prior to that, in 2005, Band himself conceived the idea of the Clinton Global Initiative. The money flowed in like a tidal wave. In a scandal that has been brewing for more than a decade now, it is said that Doug Band “shook down” countless donors. The pitch was simple: give to the Clinton Global Initiative/The Clinton Foundation, and reap the benefits of Bill and Hillary Clinton’s influence. The pitch worked. In a memo entitled, “Leveraging Teneo For The Foundation,” Doug Band listed millions of dollars in donations that he solicited for The Clinton Foundation. He also listed moneys for speaking engagements: It appears that the deals listed above were only the beginning. ZeroHedge reports: \\nFurther, the head of Teneo also offered the following commentary on the “$50 million in for-profit activity” he was able to secure for Bill Clinton (as of November 2011) as well as the “$66 million in future contracts, should he choose to continue with those engagements.” \\nIn effect, what Band was doing, as the NYT’s Nick Confessore summarized , “ was selling his clients on idea that giving to foundation was, in essence, a way to bolster their influence. Clinton & Band built a platform for executives to bolster their companies’ images, bathe in BC’s praise, and do some good, while Teneo extracted earnings for Band and, depending on what you see in these e-mails, Clinton himself. Teneo paid Clinton until late ’11. “ \\nAs Confessore also pointed out, “I guess you can wave it all off as a nothingburger. But Chelsea Clinton and some of Clinton’s other aides were clearly freaking out.” \\nAnd he concluded by saying “Generally, the emails show Clinton’s *own closest aides* troubled or horrified by things that her surrogates have spent years waving off. “ \\nThe entire operation was money-making, and extremely suspicious. \\nIt is no wonder that Band wrote the following in a 2011 email to Cheryl Mills and John Podesta. Via WikiLeaks: \\nNeed get this asap to them although I’m sure cvc (Chelsea Clinton) won’t believe it to be true bc she doesn’t want to Even though the facts speak for themselves. John, I would appreciate your feedback and any suggestions \\nI’m also starting to worry that if this story gets out, we are screwed. Dk and I built a business. 65 people work for us who have wives and husbands and kids, they all depend on us. Our business has almost nothing to do with the clintons, the foundation or cgi in any way. The chairman of ubs could care a less about cgi. Our fund clients who we do restructuring and m and a advising the same just as bhp nor tivo do. These are real companies who we provide real advice to through very serious people. Comm head for goldman, dep press secretary to bloomberg, former head of banking, and his team, from morgan stanley for asia and latin am. I realize it is difficult to confront and reason with her but this could go to far and then we all will have a real serious set of other problems. I don’t deserve this from her and deserve a tad more respect or at least a direct dialogue for me to explain these things. She is acting like a spoiled brat kid who has nothing else to do but create issues to justify what she’s doing because she, as she has said, hasn’t found her way and has a lack of focus in her life. I realize she will be off of this soon but if it doesn’t come soon enough…. \\nIn light of the recent events surrounding the FBI’s renewed investigation and Anthony Weiner’s involvement, it is hard to predict the amount of attention Doug Band’s story will get. \\nOn the other hand, many of these issues are tied together so tightly that that all could come crashing down at once. \\nWith WikiLeaks and others preparing to release more information, next week could be a crazy one!'"}, "time": 1742628519.7697525}