{"duration": 0.13449907302856445, "input_args": {"text": "'Waking Times \\nI find it easy to imagine a better world, one in which compassion and brotherhood reign supreme. Where greed has been dethroned and truth is respected and revered. A world where our resources are applied creatively, where technology liberates people instead of killing them, and where the natural world is as precious as the human body. \\nOn and on it goes. It’s a beautiful vision. \\nIt’s simple to imagine, because it resonates so deeply with what we know to be true about humans: at our root, we are beings of love. What’s difficult, though, seemingly impossible at times, is to envision the transition from today’s world to this high vision. \\nWhat is the missing link? What is the secret? Must we overthrow something or someone? Is a revolution in order? Against whom, precisely? Or do we just start building amid the chaos, division and decay surrounding us? How do we get there from here? \\nIf you follow the thread of scientific reason on human consciousness all the way to its essence, you eventually arrive at the revelation that we create reality , and that the world at large is a macrocosmic representation of the experiences of the individual. Everything conscious and unconscious that lives and breathes within the self, is mirrored as fractals in our collective experience. In this way we share each other’s pain, and in this way we contribute to each other’s greatness. \\nObservation of the world in this light is a diagnosis of the individual. The sicknesses manifest in our shared reality are to be found within the mind and spirit of all people. When we grasp this as the true nature of reality, the path to a better world suddenly appears. The healing of the one is the healing of the whole. The way is clear now. False Cures and Phony Pharmaceuticals \\nWe live in the age of phony solutions, misplaced hopes and false cures. Shallow is the new deep. Substance is nothing in the company of style. Medicines don’t heal, they harm by making themselves necessary. Cures now perpetuate disease, and the root is rarely unearthed, the source rarely revealed. \\nThe disease that keeps us on the path of self-destruction is a spiritual one, for, each and every human being is a container for personal and collective history, trial and trauma. The contents of our past help to color our future. Suffering buried within creates disharmony without. This is one of the fundamental truths about the spiritual essence of human beings. We carry our past with us, never thinking to let go of that which no longer serves us well. \\nOur heritage as beings of nature includes the medicines which can release us suffering. These are mother nature’s spiritual medicines which serve as tools for personal, community and planetary renewal . Medicines to explore consciousness and one’s truest nature, but deemed illegal in the matrix, and now only available to those who seek them out. For those that do, a glimpse of the deepest areas of the self is possible, bringing extraordinary understanding of the value and meaning in life. “You find peace not by rearranging the circumstances of your life, but by realizing who you are at the deepest level.” ~ Eckhart Tolle First Let Go, Then Receive, Then Integrate \\nMy personal experience with shamanic plant medicines in their proper ceremonial context has led me to the understanding that to be happy one must be free. And to be free, one must be unencumbered and unaffected by fear. To be unaffected by fear, one must have looked intently into the darkest regions of oneself, thereby expanding the range of the possible, so that a rebound can occur allowing for a unfathomably grand new vision of the self. \\nI have a good friend who works to preserve the culture and medicine traditions of an Amazonian tribe who is being driven into extinction by our consumeristic way of life. I’ve seen firsthand how their sacred plant medicine tradition can positively and permanently change someone’s life, rescuing them from victimhood, and releasing them to their true purpose and greatness. \\nAnother friend of mine, a shaman whose work with a powerful plant medicine tradition from the African rainforest , works everyday providing an opportunity for people like you and I to explore the vast depths of consciousness and memory, Creating a space that allows us to hold communion with our very own souls and letting us see the full depth, richness and vividness of contents stored in the subconscious mind. READ: Matrix Deprogramming and the Prohibition of Nature’s Red Pill \\nThese sacred healing traditions are mostly unknown and widely misunderstood in the culture of contemporary consciousness. These are the spiritual medicines and experiences outlawed by the matrix . Verboten because they have the power to free us from the death grip of self-destruction . \\nThe core message of these plant medicines, as I’ve come to see it, is three-fold: let go, receive, integrate. \\nFirst you are called to let go of that which weighs you down, of the fear which prevents you from accepting truth, and of the expectation of having control. \\nThen to receive. Receive knowledge of self, both sacred and profane. Receive knowledge of the natural world, without which we are nothing. And receive knowledge of the infinitely complexity, and inspiration inherent in the cosmos within. \\nThen we must integrate these lessons or they are meaningless. We have to walk with these teachings and these revelations, carrying them with each day, in each interaction with others, forever forward as our lives grow more rich. We must actively rise to the challenge of creating the highest versions of ourselves. Final Thoughts \\nThis is the age of chaos, division and decay, when the sickness within colors darkly the world without. \\nCulture has worked itself into a destructive and frustrating loop, and as the pattern of stress repeats itself, it leads us ever further away from our true nature. Largely cut off from spiritual medicine and deep spiritual experience, we don’t know which direction to turn for inspiration and strength, and are unable to see the way towards that great vision of our future. Yet, to dig ourselves out of the current trap of destruction the individual must be healed. Read more articles by Dylan Charles . About the Author \\nDylan Charles is a student and teacher of Shaolin Kung Fu, Tai Chi and Qi Gong, a practitioner of Yoga and Taoist arts, and an activist and idealist passionately engaged in the struggle for a more sustainable and just world for future generations. He is the editor of WakingTimes.com , the proprietor of OffgridOutpost.com , a grateful father and a man who seeks to enlighten others with the power of inspiring information and action. He may be contacted at . This article ( Spirit Medicine for the Age of Chaos, Division and Decay   Dylan Charles    '"}, "time": 1742562207.7379143}