{"duration": 0.11289191246032715, "input_args": {"text": "'Tweet (Image via youtube.com) \\nDeepavali is here, which naturally means plenty of sweets and crackers and, even more naturally, a visit to the doctor due to overeating or burn-related injuries for some of you. \\nBut this column firmly believes it is always better to be safe than try to be spectacular and look for some smart-Aleck jokey end to this sentence. Keeping in line with this thinking, we urge you celebrate the upcoming festival in a responsible manner without going overboard on festivities or snacking. \\nAnd here is a simple recipe for a healthy Deepavali sweet, oats peanut ladoo (ugh), and a small emergency reckoner on what to do when bursting crackers (Scream). \\nOats peanut ladoo: \\nBefore you get down to make this, you have to answer the very basic question whether it is ladoo or laddu. No, the actual question you should be asking is: Why oats ladoo? To be precise, why at all oats? When the world eventually is destroyed, global warming or ecology disasters will not be the cause, oats is most likely to be the culprit. Rampant use of oats in food will make many people give up the all-important desire to live. But oats is expected to figure in anything that is deemed to be healthy (come to think of it, oats soap and shampoo may not be far away). \\nBut wait, we are here to make ladoo and not rant against the rising problems of oats. \\nIngredients for oats peanut ladoo: 1 cup oats, 1 cup peanut, 2 cups of grated jaggery, cardamom, cashewnuts, 1 cup and a standard instagram account. \\n1. Heat the oats in low medium flame until it gets golden brown. Have you ever noticed that whatever you are trying to make, the recipe always tells you to heat whatever you are trying to heat till it becomes golden brown? \\n2. Now heat the peanut in similar low flame until it becomes peacock blue. Just kidding. Heat till golden brown only. \\n3. Luckily, jaggery is kind of golden brown. No need to heat it. \\n4. Put the oats and peanut together into a mixie and run the blender. \\n5. Oops, wait. In your hurry to get on with it, you ran the blender without closing it. Now go clean the mess you created. \\n6. Close the lid firmly and run the blender till the oats and peanut are finely commingled. \\n7. Wonder what the heck is commingled. \\n8. Now remove a portion of oats-peanut mix and keep it aside. Add to the remaining portion in the jar some jaggery. Run the blender till they are finely mixed. Now make a similar blend out of the removed portion too. \\n9. Spread the fresh mix on a plate and start making ladoo balls out of them. Since you are making them the balls will come off and not stick together. \\n10. No worries, nobody gets it right on the first attempt. Also, it is a good excuse not to consume oats peanut ladoo, which, to tell you a fact, was never going to taste great. \\nPS : In the few seconds they stay as ladoo balls, make sure to photograph them and put it on your instagram account. \\nPS 2: Not that it would have mattered, but we forgot to add cardamom and cashew to the mix. \\nNow, dos and don’ts during bursting crackers: \\n1. It is always advisable to burn crackers in an open and spacious place. Ideally, take on rent MA Chidambaram Stadium. \\n2. If your neighbours have pets, out of the general kindness to those hapless animals, ask your neighbours to take them elsewhere so that you can burst crackers in peace. Those infernal dogs, at any rate, are never going to stop barking when you are busy preparing notes for your presentation. So there! \\n3. Don’t set off fireworks near electrical transformers unless otherwise your idea is to set off even more spectacular fireworks that will make the entire neighbourhood watch transfixed. \\n4. Whenever you set out to burst crackers, have a bucket of water nearby so that it will come handy for you to trip over it when running away from the splinters of that saram . Statistically, more persons are treated for injuries after sprawling down than for fire burns on Deepavali. \\n5. In the event of burn injuries, take care to roll the victim in a wet rug and throw him/her into a swimming pool. If the injury is not serious, he/she should emerge out quickly. If he/she sinks, either the injury is serious or he/she doesn’t know swimming. Either way you are innocent. \\n6. Prepare a small medical kit with plasters and Burnol in them well ahead of Deepavali and keep it aside, so that when you set out to burst crackers on the Deepavali day you can basically spend your time looking for it. \\n7. Avoid vengaiya vedis . Remember those ball-shaped vengaiya vedis are banned. Most likely because they resembled oats ladoo. \\nPS : Happy Deepavali!'"}, "time": 1742564072.7249606}