{"duration": 0.057157278060913086, "input_args": {"text": "'Sonoma County California Just Voted to Create the Largest GMO Free Zone in America Nov 14, 2016 0 0 \\nJust when it seemed the biotech industry couldn’t get any more gargantuan, with the threat of a Bayer-Monsanto merger , not only were the TTIP and TPP pronounced dead , but Sonoma County California just passed a successful ban on the cultivation on genetically modified crops, creating the largest GMO-Free zone in America . \\nMeasure M passed with 55.9% of the vote in favor of banning crop cultivation. The vote transpired on the same day as the U.S. presidential election. The ban will affect a whopping 13,734 square miles bridging Sonoma, Humboldt, Marin, Mendocino, Santa Cruz and Trinity Counties. \\nMonsanto, Syngenta, Bayer, BASF, and DuPont all descended on Sonoma County to fight Measure M, but local farmers largely wanted an opportunity to grow organic, non-GMO crops without the fear of contamination through cross-pollination. (You can see who supported a ‘yes’ note and who supported a ‘no’ vote, here .) \\n“My right to grow non-GMO should not be threatened by someone else’s business practices that are harmful to mine. Millions of dollars in lost export revenue has occurred from GMO contamination,” says Joey Smith , owner/manager of Let’s Go Farm in Santa Rosa. “Because people growing genetically engineered crops are not required to register, we don’t know exactly how many genetically engineered crops are growing here in Sonoma County.” he explains. “We don’t want GMO crops proliferating here, so that’s why we are taking action. The Measure is carefully written to be fair to all farmers. Measure M is really about being proactive, just like the GMO growing bans in the five other CA counties.” \\nAlready, 80% of Sonoma County’s dairy farms are certified organic, and the wine-making industry has been trying to go organic as well. \\nMeasure M will make it much easier for farmers growing a multitude of crops to do so without using herbicides, pesticides, fungicides, and petroleum-based fertilizers, but also without their hard-earned yield going to waste due to GM contamination. \\nThe measure will protect farmland, pastureland, and surrounding green spaces, and hopefully the almost 14 thousand square miles which are now to be GM-free, will eventually expand to cover an even larger area. \\nWhen this area is tied to others in the U.S. which have smaller GMO-Free zones, we can start to see a patchwork of resistance that has paid off. \\nConnecticut and Maine have passed GMO labeling laws as of May of 2013 , but are still waiting on triggering states for those laws to go into effect. \\nMaui, Hawaii has successfully passed a GMO moratorium which took effect in March of 2015. \\nBoth Josephine and Jackson Counties in Oregon have banned GMOs, though they are said to be in conflict with a state law. Vermont fought hard against the GM industry and passed a law that requires ALL GMO food to be labeled as of July 1, 2016. \\nSan Juan County in Washington has also banned GM crops. \\nThe GMO-Free movement has grown slowly, but surely over the years, and Sonoma’s recent addition of GM-Free lands is a shining example of what grassroots movements can do to fight against the trillion-dollar biotech machine. It isn’t impossible, but it has been hard as heck. \\nConsider purchasing some Sonoma County organic wine or fresh produce over the holidays to toast their successful endeavors.'"}, "time": 1742561663.241301}