{"duration": 0.09799981117248535, "input_args": {"text": "'Written by Peter Van Buren   You may have seen the stories last week — President-elect Donald Trump was shocked to learn he needs to hire over 4,000 political appointees by January 20, or that people in Washington may refuse to work in a Trump administration, or that Trump, as a newcomer to politics, may not know enough people to get down to the business of hiring. I doubt any of those statements are true, and the task is easier than you think.Trump was well aware if he won he would need to do some hiring, and if he was not keeping lists of potential candidates, you can be sure others around him were. Far from some kind of chore, political organizations stretching back to Tammany Hall if not ancient Rome live for this task — handing out jobs is one of the prizes the election winner takes home. And as a businessperson, Trump himself is no stranger to the concept of hiring. The standing bureaucracy Washington oversees these transitions every four to eight years, as do the national party offices. Trump, though he is new to government, is not beginning from a cold start.But when it gets down to the actual work of filling positions, exactly how will Trump do it? I worked in a non-politically appointed position for the State Department for 24 years worth of transitions. Trump will fill positions pretty much the same way as every other modern president before him has.Trump starts with the big jobs, such as transition head Vice President-elect Mike Pence, and Chief of Staff Reince Priebus, former chair of the Republican National Committee. Soon after that will come the Secretaries of State, Treasury, Defense, the head of the Central Intelligence Agency, and an Attorney General.Those appointees will then fill in below them, the deputy and assistant secretaries, U.S. attorneys and advisors who do most of the work of government. Rudy Giuliani, for example, who has been in politics for some time, will have plenty of people he will want to work for him. Given the number of employees he knows and trusts from his business empire, Trump himself may seed in some mid-level individuals, particularly in agencies like Treasury and Commerce. These positions, give or take, amount to about one-fourth of the jobs that need to be staffed quickly. And of those, maybe fewer than 100 are critical for Day One.One important point: the first few layers of political appointees require Senate confirmation. A good strategy to both ease that process and to locate experienced people quickly is to turn to Senators and Congresspeople for recommendations. They are more than happy to help friends and allies into positions in the White House and, for Congresspeople who have lost their seats, find jobs for their soon-to-be-unemployed staffers.With those Senate confirmation jobs lined up, Trump’s transition team will move to the other positions. These jobs include any number of economic, national security, and other advisers. Many of those will be drawn from the campaign staff, people already advising Trump, or selected out of think tanks, lobbying groups, and academics. The nice thing about those pools of talent is that they are already ideologically vetted based on their association and/or past work. Had Hillary Clinton won, it is likely she would have also drawn staff from the Clinton Foundation.And don’t believe what you might read about people in Washington, including those who criticized Trump during the campaign, refusing to work in his White House. Oh, there will be a few, whose stories will get media attention. But the currency of Washington is power, and members of official Washington will kneel on broken glass before any would turn down a job in the West Wing. Trump (or Clinton, or…) will never lack for candidates. Don’t be surprised if even a few of those high-profile Republican national security officials who signed letters in March and August spring saying they’ll never work for Trump change their minds, “for the good of the country.”The largest category of jobs left to fill include people who do scheduling, subject matter experts, special counsels, and staff assistants. Many will trickle down as associates from the layer of appointees above them, or be pulled from the cadre of campaign volunteers and interns — why do you think someone spent two months sleeping in cheap motels? Just so they could knock on voters’ doors an Iowa winter?The last way Trump will staff up his administration is via application. In fact, you can go right now to President-elect Trump’s “Serve America” web site and complete an online application. Many people will also be submitting applications through their local Republican party office, their Congressional representatives, or just about anyone who knows someone who knows someone. And yes, it is a long shot.One more thing: while it is not common, Trump’s team can ask some current staffers to stick around, especially those in technical positions that are less ideological. And not every job has to be filled by Inauguration Day; there are layers of career civil servants who can fill in as needed, same as when the boss goes on vacation. The president can also appoint a temporary acting head of an agency while awaiting a confirmation hearing. In fact, many administrators don’t complete their first cycle of appointments for months . Reprinted with permission from WeMeantWell.com . Related'"}, "time": 1742563197.9057379}