{"duration": 0.017801761627197266, "input_args": {"text": "'  Donald Trump’s plan to build a border wall along with U. S.  Border will be challenged through environmental lawsuits, according to California’s   official. [California Lt. Gov. Gavin Newsom said in an interview with ‘The Golden State Podcast’ that he would use specific environmental laws in the state to stop the border wall from being built, at least in southern California.  “There’s something called CEQA in California —  NEPA at the federal level,” Newsom told the podcast host. “There’s indigenous lands and autonomies relating to governance on those lands. There are all kinds of obstructions as it relates to just getting zoning approval and getting building permits. All those things could be made very, very challenging for the administration. ” Newsom hinted that if he could not actually stop the construction of the border wall in California, he would at least try to tie it up in bureaucratic battles. Trump’s border wall is reportedly in the works, as he explained at a press conference at Trump Tower today that he would not be waiting on payment from Mexico and begin construction immediately. “I could wait about a year and a half until we finish our negotiations with Mexico, which will start immediately after we get into office,” Trump said as Breitbart News reported earlier. “But I don’t want to wait. Mike Pence is leading an effort to get final approvals through various agencies and through Congress for the wall to begin. ” “I don’t feel like waiting a year or year and a half. We’re going to start building,” Trump continued. “Mexico, in some form, and there are many different forms, will reimburse us. And they will reimburse us for the cost of the wall,” Trump said. “That will happen, whether it’s a tax or whether it’s a payment. Probably less likely that it’s a payment. But it will happen. ” John Binder is a contributor for Breitbart Texas. Follow him on Twitter at @JxhnBinder.'"}, "time": 1742628516.9107177}