{"duration": 0.18545246124267578, "input_args": {"text": "'Tweet Home » Headlines » World News » “IN ONE DAY IT WILL BURN”: Chilling 30 Year Old Prophesy Warns Russia Will Nuke America Even now they are preparing an attack against America. When America believes there is peace and safety, the Russians will lead an all-out attack . They already have it planned! “The Heavenly Messenger showed me all of California, Las Vegas, New York, and Florida, and said, ‘This is Sodom and Gomorrah. All of This – In ONE DAY It Will BURN…’ “ Surely the Lord GOD will do nothing, unless He reveals his secret to his servants the prophets. – Amos 3:7 In 1984, a Romanian Pastor who had been mercilessly tortured by Soviet Bloc Communists for smuggling Bibles into Romania received a Chilling Warning from the Almighty: America – the Land of the Free – would be destroyed in a SINGLE DAY by the Russians in a fiery judgement – unless she repented for her great sins: Dumitru Duduman was a Romanian pastor who smuggled Bibles in his native land of Romania for 25 years. \\nIn 1984, God called him out of Romania to the land of America – telling Duduman He had an important warning for His people there. Duduman, unable to speak a word of English, arrived with his family in New York and subsequently Fullerton, California without as much as a play to lay their heads. \\nNearly immediately after arriving in the Land of the Free, Duduman received an Angelic Visitation, which he describes in Through the Fire Without Burning: \\nIt seemed we were over California. The angel said, “There is San Francisco. There is Sacramento and Modesto. Soon we will see Los Angeles.” I had no idea there were such places in California, or even in the world. But I still remember the exact names. At last we were over Fullerton where we now live. “You can go home,” the angel said, “but I want to tell you what will happen. You have seen a number of cities. \\nThe day will come when I will punish the citizens of those cities because of their sins. Their sin has reached into heaven. God will punish them just as he punished Sodom and Gomorrah.” \\nHow will this happen? Surely they are able to defend themselves against any imaginable invasion. \\n“That is your opinion, not the mind of God. The Russian government will have all the information regarding the whereabouts of American missiles. They will have the exact locations of the weapons factories. Even now they are preparing an attack against America. When America believes there is peace and safety, the Russians will lead an all-out attack. They already have it planned! They plan to attack from such remote bases as Cuba, Nicaragua, Central America, Mexico, and the ocean. They have had these plans for a long time, but God has not yet allowed them to be fulfilled. Nevertheless, the day will come when America will be punished for her sins by fire.” \\nDumitru responded to the vision by fasting for 21 days, requesting it would be repeated if it was truly from God. At the conclusion of his fast, Dumitru received a second vision: \\nSuddenly a bright light came toward me…from the light I head the same voice that I had heard so many times in prison. He said, “Dumitru, why are you so despaired?” \\nI said, Why did you punish me? Why did you bring me to this country? I have nowhere to lay my head down. I can’t understand anybody.” He said, \\n“Dumitru, didn’t I tell you I am here with you also? I brought you to this country because this country will burn.”.. \\nI was not asleep. It was not a dream. It was not a vision. I was awake just as I am now. He showed me all of California and said, \\n“This is Sodom and Gomorrah ! All of this, in one day it will burn! I t’s sin has reached the Holy One.” \\nThen he took me to Las Vegas. \\n“This is Sodom and Gomorrah! All of this, in one day it will burn!” \\nThen he showed me the state of New York. “Do you know what this is?” He asked. \\nI said, No. \\nHe said, “This is New York. This is Sodom and Gomorrah! In one day it will burn!” Then he showed me all of Florida. “This is Florida. This is Sodom and Gomorrah! In one day it will burn!”… Dumitru stated he was told America would burn because if it’s sin: This country will burn! \\nI said, what will you do with the Church? He said, \\n“I want to save the Church, but the churches have forsaken Me …The people praise themselves. The honor that the people are supposed to give Jesus Christ, they take upon themselves. In the churches there are divorces. There is adultery in the churches. There are homosexuals in the churches. There is abortion in the churches; and all other sins that are possible. \\nBecause of the sin, I have left some of the churches. You must yell in a loud voice that they must put an end to their sinning. They must turn toward the Lord. The Lord never gets tired of forgiving. They must draw close to the Lord, and live a clean life. If they have sinned until now, they must put an end to it, and start a new life as the Bible tells them to live.” Dumitru asked how these things would happen: \\n“Remember this, Dumitru. The Russian spies have discovered where the nuclear warehouses are in America. When the Americans will think that it is peace and safety – from the middle of the country, some of the people will start fighting against the government. The government will be busy with internal problems. Then from the ocean, from Cuba, Nicaragua, Mexico,… (He told me two other countries, but I didn’t remember what they were) … they will bomb the nuclear warehouses. When they explode, America will burn!” \\nWhat will you do with the Church of the Lord? How will you save the ones that will turn toward you? I asked. He said, \\n“Tell them this: how I saved the three young ones from the furnace of fire, and how I saved Daniel in the lions den, is the same way I will save them.”… \\n“Israel doesn’t want to recognize Jesus Christ. They put their faith in the Jewish people in America. But, when America burns, the Lord will raise China, Japan, and other nations to go against the Russians. They will beat the Russians and push them all the way to the gates of Paris. Over there they will make a treaty, and appoint the Russians as their leaders. They will then unite against Israel. \\nWhen Israel realizes she does not have the strength of America behind her, she will be frightened. That’s when she will turn to the Messiah for deliverance. That’s when the Messiah will come. When I heard all of this I said, “If you are truly the angel of the Lord, and everything you have told me is true, then all you have said must be written in the Bible.” \\nHe said, “Tell everyone to read from Jeremiah 51:8-15, Revelation Chapter 18, and Zechariah Chapter 14 , where Christ fights against those who possess the earth. Only a few short years ago, Duduman’s chilling prophetic warning seemed unfathomable. The Cold War was over. Russia and America were no longer enemies. \\nThanks to Barack Obama, John Kerry, and Hillary Clinton, war with Russia is on the horizon again, if not imminent. We are reminded the fact that judgement begins with the house of God . 1 Peter 4:17 \\nWill God’s people in America repent, and delay God’s wrath? \\nIf My people, who are called by My Name, will humble themselves and pray and seek My face and turn from their wicked ways , then I will hear from heaven, and I will forgive their sin, and I will heal their land. 2 Chronicles 7:14 Ahead of the elections, we call on God’s people in America to take Saturday 10/29 as a day of repentance with sackcloth, ashes, and fasting. Behold, the Lord ’s hand is not shortened, That it cannot save; Nor His ear heavy, That it cannot hear. But your iniquities have separated you from your God ; And your sins have hidden His face from you , So that He will not hear . For your hands are defiled with blood, And your fingers with iniquity; Your lips have spoken lies, Your tongue has muttered perversity. No one calls for justice, Nor does any plead for truth… \\nTheir feet run to evil, And they make haste to shed innocent blood; Their thoughts are thoughts of iniquity; Wasting and destruction are in their paths. The way of peace they have not known, And there is no justice in their ways; They have made themselves crooked paths; Whoever takes that way shall not know peace… \\nWe look for justice, but there is none; For salvation, but it is far from us. For our transgressions are multiplied before You, And our sins testify against us; For our transgressions are with us, And as for our iniquities, we know them: In transgressing and lying against the Lord , And departing from our God, Speaking oppression and revolt, Conceiving and uttering from the heart words of falsehood. Justice is turned back, And righteousness stands afar off; For truth is fallen in the street , And equity cannot enter. So truth fails, And he who departs from evil makes himself a prey… Then the Lord saw it, and it displeased Him That there was no justice. He saw that there was no man, And wondered that there was no intercessor; Therefore His own arm brought salvation for Him; And His own righteousness, it sustained Him. For He put on righteousness as a breastplate, And a helmet of salvation on His head; He put on the garments of vengeance for clothing, And was clad with zeal as a cloak. According to their deeds, accordingly He will repay , Fury to His adversaries, Recompense to His enemies; The coastlands He will fully repay. So shall they fear The name of the Lord from the west , And His glory from the rising of the sun; When the enemy comes in like a flood, The Spirit of the Lord will lift up a standard against him. “The Redeemer will come to Zion, And to those who turn from transgression in Jacob,” Says the Lord . – Isaiah 59 Dumitru’s full amazing story Through the Fire Without Burning can be found here : Excerpts from Through the Fire Without Burning by Dumitru Duduman, Published by Hand of Help, Inc . This entry was posted in World News and tagged Is America Mystery Babylon , Mystery Babylon , nuclear war , Putin WW 3 , Repent , repentance , Russia WW 3 , Teshuva , WW 3 . Bookmark the permalink . Post navigation'"}, "time": 1742563388.5183034}