{"duration": 0.21986842155456543, "input_args": {"text": "'Email \\nThe sun will rise on Wednesday November 9 on a new American landscape, the same way it rose on a new American landscape almost exactly 8 years ago. \\nThat was the dawn of Obama-time. Millions of Americans had dined delightedly on Obama’s rhetoric of dreams and preened at his homilies about the inherent moral greatness of the American people. Obama and the Democrats triumphed at the polls. The pundits hailed a “tectonic shift” in our national politics, perhaps even a registration of the possibility that we had entered a “post-racial” era of progressive politics and economics. \\nBut the realities of American politics don’t change much from year to year. After years of Obama, the nation remains bogged down in at least 8 different wars and the national divisions of wealth and resources have grown wider today than they have been at any time since the late 1920s. For many of us, the post-electoral dawn will shine its light on an eerily familiar assemblage of characters: Hillary and Bill, John Podesta and Robert Rubin, Ken Salazar and Cheryl Mills. The same people who engineered the deregulation of the American economy will be back in the control room, ready for another round of looting. \\nFew journalistic enterprises have followed the Clintons as closely as CounterPunch. CounterPunch was literally born with the rise of the Clintons in 1993. My first encounter with Alexander Cockburn came in a telephone call in 1992, when Alex rang me up to question me about a story I’d written on Bill’s grim environmental record in Arkansas. Over the next 8 and half years, Alex and I wrote about the Clintons almost every week and we never held back. \\nTwenty-four years later, we still aren’t holding our fire. We’ve told it straight about the Clintons and Trump and we won’t stop. \\nNow that the biennial democratic pretense here in the U.S.A. has almost run its course, can we talk about something serious? Like the future of CounterPunch. We can? Good. \\nEvery year we run a fundraiser. We’ve been running these end-of-the-year appeals since we went online in 1999, at the ragged end of the first Clinton era. As you know, we’re doing one right now. But in all of those years, we’ve never been as close to the edge as we are right now. Never before have we been 5 weeks into a fund drive and still $25,000 short of where we need to be. \\nI won’t reiterate grim details. Becky Grant, our business manager all these years, has laid them out for you in stark detail. \\nIf you’ve been reading the CounterPunch website or magazine for a while you’ve no doubt noticed that every year we’ve continued to offer you the full menu and that the thickness and diversity of the menu continues to grow. Maybe you think we shout “wolf” only to scare the money out of your pockets. \\nHere are the realities of 2016. We shout “wolf” because the wolves are real. We operate on a razor thin margin. That means that money can get tight for us, very quickly. We’re not sitting on big reserves, we literally live check to check, PayPal to PayPal. \\nWe know that money is tight for many of you, too. These are tough times. For most of the Great Recession never ended. Our readership is higher than it’s ever been. We have more donors to CounterPunch than we’ve ever had, though in smaller and smaller amounts. But if you’re passing up your usual check to us at fundraising time, or writing a much smaller check than usual, or postponing your subscription renewal to our CounterPunch magazine, forgive me if I give you an urgent nudge. \\nMany websites on the progressive side of the spectrum are cut-and-paste affairs, a mix of columns culled from mainstream newspapers, weeklies, blogs and so forth. Every day our CounterPunch site offers you up to a dozen original articles, and often twenty across our three-day weekend site. \\nJust glancing back across recent months, we’ve run marvelous pieces from Alan Nasser on Hillary Clinton’s policy toward the first-strike use of a new generation of nuclear weapons; from Christopher Ketcham on corrupt prosecutors from Coast-to-Coast; from Mark Schuller about Haiti after Hurricane Matthew, from Andrew Cockburn about drone warfare in Obama’s Af-Pak wars; from John Pilger on Wikileaks and Julian Assange; Diana Johnstone on Hillary Clinton’s bloody foreign policy. \\nThere’s no need to go anywhere else for coverage of the neoliberal/Wall Street onslaughts. Here, week by week, you read Michael Hudson, Paul Craig Roberts, Mike Whitney, Mark Weisbrot, Dean Baker, Ellen Brown, Pete Dolack and Jack Rasmus. \\nCounterPunch writers file regularly from Israel, Gaza, the West Bank, Afghanistan, Iraq, Yemen, Venezuela, South Africa, India… On the Middle East, indeed, no site offers more resolute, consistent coverage of the monstrous war waged by Israel, the U.S. and Europe on Palestinians’ just demands. \\nOn our site and in our magazine we give you truly original voices: Chris Floyd, Ishmael Reed, JoAnn Wypijewski, Yvette Carnell, Kathy Kelly, Kevin Alexander Gray, Lee Ballinger, Peter Linebaugh, Jennifer Lowenstein, Ruth Fowler, Nancy Schemer-Hughes, Daniel Raventos, Pepe Escobar, Eric Draitser and Margaret Kimberly. I don’t have to go on. You’re probably familiar with the names. CounterPunch is where the global left comes to air its grievances. \\nWe’re not part of the Twitter Left, spraying tweets into the blathersphere. We still think issues, like oil pipelines, the economy, the climate and the war, are worth more than 140 characters. With the participation of hundreds of CounterPunchers as writers, and hundreds of thousands of CounterPunchers as engaged readers, we’ve built up CounterPunch as a vital, thoughtful, vivid and above all, radical presence in the U.S. and – about a third of our audience – across the world. \\nWe can only do this with your financial support. There’s no safety net. No waste to prune. Enough said. Your money is our lifeblood. Every dollar you can manage really is vital. \\nThank you, Jeffrey St. Clair \\nPlease, use CP’s secure shopping cart to make a tax-deductible donation to CounterPunch or purchase a subscription to our magazine and a gift sub for someone or one of our explosive books . Show a little affection for subversion: consider an automated monthly donation . (We accept checks, credit cards, PayPal and cash…) \\nCall us at 1-(800) 840-3683, or mail a check to: \\nCounterPunch'"}, "time": 1742628396.468501}