{"duration": 0.05224943161010742, "input_args": {"text": "'Some Democrats prepare to withhold paying federal taxes in potentially the biggest tax boycott since the Vietnam War, according to a report from The Guardian. [The National War Tax Resistance Coordinating Committee (NWTRCC) which campaigns for federal tax boycotts, says there has “renewed interest in war tax resistance following Trump’s inauguration,” with the website’s traffic doubling in the past month.  “Something has clicked in the minds of thousands of people across the country  …     we don’t want to pay for Trump’s agenda! While many of the reasons people are fed up —  extreme militarism, mass incarceration, police brutality, and mass deportations —  are part of the foundation of our country, it is exciting to see many new people contacting NWTRCC and wanting to organize in their communities,” the website reads. The boycott has also attracted the interest of celebrities, with Mia Farrow saying “I refuse to pay a penny of my taxes toward Trump’s insane, insulting wall. ” Feminist activist Gloria Steinhem also pledges her support, telling The Guardian that she will deduct from her tax return money she believes should be going to Planned Parenthood. I refuse to pay a penny of my taxes toward Trump’s insane, insulting wall.  #IstandwithMexico,  —   Mia Farrow (@MiaFarrow) January 26, 2017,  In December, Time magazine published a column entitled “65 Million Americans Should Threaten to Not Pay Taxes,” urging the “approximately 65 million Democrats who voted for Hillary Clinton [to] pledge that in the future if a Republican wins the presidency with fewer votes than a Democrat for the third time in our era, we won’t pay taxes to the federal government. ” California Democrats have already threatened to “cut off the feds” by withholding taxes, with former State Assembly Speaker Willie Brown claiming the state could become “an organized ” in a state of “  with the federal tax code. ” Before the election, dozens of celebrities promised to effectively boycott America by leaving the country should Donald Trump be elected. The list included singers Barbara Streisand and Miley Cyrus, the actor Bryan Cranston and the comedienne Amy Schumer. Since his election, none of their plans have materialized. You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742563346.3342948}