{"duration": 0.12747931480407715, "input_args": {"text": "'World Socialist Web Site \\nAT&T, the telecommunications and cable TV colossus, announced Saturday that it has struck a deal to acquire the pay TV and entertainment giant Time Warner. The merger, if approved by the Justice Department and US regulatory agencies under the next administration, will create a corporate entity with unprecedented control over both the distribution and content of news and entertainment. It will also mark an even more direct integration of the media and the telecomm industry with the state. \\nAT&T, the largest US telecom group by market value, already controls huge segments of the telephone, pay-TV and wireless markets. Its $48.5 billion purchase of the satellite provider DirecTV last year made it the biggest pay-TV provider in the country, ahead of Comcast. It is the second-largest wireless provider, behind Verizon. \\nTime Warner is the parent company of such cable TV staples as HBO, Cinemax, CNN and the other Turner System channels: TBS, TNT and Turner Sports. It also owns the Warner Brothers film and TV studio. \\nThe Washington Post on Sunday characterized the deal as a “seismic shift” in the “media and technology world,” one that “could turn the legacy carrier [AT&T] into a media titan the likes of which the United States has never seen.” The newspaper cited Craig Moffett, an industry analyst at Moffett-Nathanson, as saying there was no precedent for a telecom company the size of AT&T seeking to acquire a content company such as Time Warner. \\n“A [telecom company] owning content is something that was expressly prohibited for a century” by the government, Moffett told the Post . \\nRepublican presidential candidate Donald Trump, in keeping with his anti-establishment pose, said Saturday that the merger would lead to “too much concentration of power in the hands of too few,” and that, if elected, he would block it. \\nThe Clinton campaign declined to comment on Saturday. Democratic vice-presidential candidate Tim Kaine, speaking on the NBC News program “Meet the Press” on Sunday, said he had “concerns” about the merger, but he declined to take a clear position, saying he had not seen the details. \\nAT&T, like the other major telecom and Internet companies, has collaborated with the National Security Agency (NSA) in its blanket, illegal surveillance of telephone and electronic communications. NSA documents released last year by Edward Snowden show that AT&T has played a particularly reactionary role. \\nAs the New York Times put it in an August 15, 2015 article reporting the Snowden leaks: “The National Security Agency’s ability to spy on vast quantities of Internet traffic passing through the United States has relied on its extraordinary, decades-long partnership with a single company: the telecom giant AT&T.” \\nThe article went on to cite an NSA document describing the relationship between AT&T and the spy agency as “highly collaborative,” and quoted other documents praising the company’s “extreme willingness to help” and calling their mutual dealings “a partnership, not a contractual relationship.” \\nThe Times noted that AT&T installed surveillance equipment in at least 17 of its Internet hubs based in the US, provided technical assistance enabling the NSA to wiretap all Internet communications at the United Nations headquarters, a client of AT&T, and gave the NSA access to billions of emails. \\nIf the merger goes through, this quasi-state entity will be in a position to directly control the content of much of the news and entertainment accessed by the public via television, the movies and smart phones. The announcement of the merger agreement is itself an intensification of a process of telecom and media convergence and consolidation that has been underway for years, and has accelerated under the Obama administration. \\nIn 2009, the cable provider Comcast announced its acquisition for $30 billion of the entertainment conglomerate NBCUniversal, which owns both the National Broadcasting Company network and Universal Studios. The Obama Justice Department and Federal Communications Commission ultimately approved the merger. \\nOther recent mergers involving telecoms and content producers include, in addition to AT&T’s 2015 purchase of DirecTV: Verizon Communications’ acquisition of the Huffington Post , Yahoo and AOL; Lionsgate’s deal to buy the pay-TV channel Starz; Verizon’s agreement announced in the spring to buy DreamWorks Animation; and Charter Communications’ acquisition of the cable provider Time Warner Cable, approved this year. \\nThe AT&T-Time Warner announcement will itself trigger a further restructuring and consolidation of the industry, as rival corporate giants scramble to compete within a changing environment that has seen the growth of digital and streaming companies such as Netflix and Hulu at the expense of the traditional cable and satellite providers. \\nThe Financial Times wrote on Saturday that “the mooted deal could fire the starting gun on a round of media and technology consolidation.” Referring to a new series of mergers and acquisitions, the Wall Street Journal on Sunday quoted a “top media executive” as saying that an AT&T-Time Warner deal would “certainly kick off the dance.” \\nThe scale of the buyout agreed unanimously by the boards of both companies is massive. AT&T is to pay Time Warner a reported $85.4 billion in cash and stocks, at a price of $107.50 per Time Warner share. This is significantly higher than the current market price of Time Warner shares, which rose 8 percent to more than $89 Friday on rumors of the merger deal. \\nIn addition, AT&T is to take on Time Warner’s debt, pushing the actual cost of the deal to more than $107 billion. The merged company would have a total debt of $150 billion, making inevitable a campaign of cost-cutting and job reduction. \\nThe unprecedented degree of monopolization of the telecom and media industries is the outcome of the policy of deregulation, launched in the late 1970s by the Democratic Carter administration and intensified by every administration, Republican or Democratic, since then. In 1982, the original AT&T, colloquially known as “Ma Bell,” was broken up into seven separate and competing regional “Baby Bell” companies. \\nThis was sold to the public as a means of ending the tightly regulated AT&T monopoly over telephone service and unleashing the “competitive forces” of the market, where increased competition would supposedly lower consumer prices and improve service. What ensued was a protracted process of mergers and disinvestments involving the destruction of hundreds of thousands of jobs, which drove up stock prices at the expense of both employees and the consuming public. \\nDallas-based Southwestern Bell was among the most aggressive of the “Baby Bells” in expanding by means of acquisitions and ruthless cost-cutting, eventually evolving into the new AT&T. Now, the outcome of deregulation has revealed itself to be a degree of monopolization and concentrated economic power beyond anything previously seen.'"}, "time": 1742562411.5844831}