{"duration": 0.28624844551086426, "input_args": {"text": "\"1202 Views November 15, 2016 No Comments SITREPs Scott \\nPart 1 – The Russian navy modernisation program \\n“I would like to emphasize that we have commissioned 42 warships in the past three years, from 2013 to 2016. From 2016 to 2018 we are planning to commission more than 50 warships, ” Russian naval CINC, Admiral Vladimir Korolyov said . Read more \\nWith only an estimated 48% of the Russian military has been modernised so far, it is certain that the Russian Navy is lagging behind. An interview with retired Deputy CINC Admiral Vasilyev provides more details on the scope of modernisation in all the regions of Russia, especially in the Arctic. RIA Novosti in Russian , in English \\nIt is good to see that the Navy is getting its lion share at last. Despite some highly visible setbacks, (notably with the French pulling out from the Mistral class contract in 2014), this modernisation program truly heralds in a new era for the navy, on a scale not seen since the time of the Soviet Union, more than 35 years ago. Here’s a prime example of the latest type of warship to enter into service: the – “ Admiral Grigorovich ” LINK \\nThe Russian Navy is focusing on new ships as part of the backbone of its green-water capabilities, while at the same time older Soviet era ships also get modernised & upgraded, the latest being the Marshal Ustinov , part of the Northern Fleet. Maintaining & deploying some of the older ships & as well as refitting such ships, underpins the blue-water naval component. Link to Ustinov Russian Navy Marshal Ustinov Cruiser Undergoes Final Tests in White Sea https://t.co/eDlwMyIoTI pic.twitter.com/C2YiSiZByG \\n— NavyRecognition (@NavyRecognition) November 10, 2016 \\nPart 2 – The Syrian operations \\n“ Today the main thing — to increase the level of training of all categories of personnel in combat conditions at sea. And combat duty at sea is the best school and the best Academy for a sailor of any level and rank. ” Admiral (Rtd) Ivan Vasiliev. \\nThe Dutch submarine and the Kuznetsov fleet \\nThere is more to last week’s Dutch submarine incident than meets the eye, but I just can’t put my finger on what. Whatever happened officially, it was a very serious incident indeed. Routine tracking/surveillance missions by submarines don’t usually end up in the news. Unless the Russian MOD publicised this event to make a clear point to NATO, about its ability to detect & track NATO submarines. \\nMore here \\nIn spite of all of the disparaging memes about its smoke & breaking down, as officially reported on Russian TV on Saturday, the Kuznetsov’s air wing flies daily sorties off the Syrian coast, carrying out training & reconnaissance flights. ( Rossiya 1 – Vesti v subbotu ). Yet, MSM feathers are ruffled again, as the Kuznetsov is still causing moments of agitation in some circles. But even the US Pentagon states that the Russian naval jets aren’t carrying ordnance . Link \\nThe Russian MOD confirmed that a naval MIG-29K crashed into the Med while returning to the carrier, off the Syrian coast, fortunately the pilot ejected and rescued by a SAR helicopter. Link \\nSouth Front produced this article on the deployment of the naval helicopters in Syria, which reportedly will make a vital contribution in a mass missile strike. \\nThe missile types & capabilities onboard the Russian Navy fleet currently in the eastern Med is outlined in the infographic below: LINK \\nNaval movements \\nIn other naval news, the Russian Navy’s Yug Class Oceanographic Research Vessel, Donuzlav, went south bound in October into the Mediterranean, so maybe it is playing a part in the Tartus naval base expansion. It is also likely that the Russian Navy Black Sea Fleet’s Nanuchka class guided missile corvette (617) is also stationed off Syria, as part of the expanded Russian fleet. It is however not known whether it has joined the core Kuznetsov group. Rumours state that the 3 Russian submarines operating in the Med are: the “Lipetsk” -“Vyborg”& “St. Petersburg”. \\nThe latest addition to the Syrian Express is Tapir Class LST “Nikolay Filchenkov” (152) & the Alexander Shabalin (110) both southbound en route to Tartus. Heading back home is the Tsezar Kunikov (158). \\nAs of the 12th Nov, the Kuznetsov’s oiler Osipov, the tug Nikolai Chiker and the SB Prof. Muru are in Tartus. Also present is a general cargo ship, the STARSHINA DEROV N.G, with a Hazard A cargo, (explosives). There is another ship loaded with Dangerous Goods, the LADY EMAN, at anchorage. The logistics and supply aspect of the Syrian campaign is very busy, mostly preparation for the forthcoming campaign in the Aleppo region. \\nIn other news, Syrian rebel linked social media claimed that a Russian warship fired a ballistic missile on the outskirts of Dana in the night of the 10th Nov. There has been no confirmation from Russian sources whatsoever. \\n\\nPart 3- NATO’ s backyard \\nNATO announced on the 9th Nov the start of a ‘newish’ Operation Sea Guardian in the central Med area. It has been in the making since July, but evidently the timing or circumstances of this latest deployment don’t have a connection to the fact that the Russian Navy has just muscled in on NATO’s perceived “hallowed turf” with a significant naval presence in the eastern Med. [Sarc off] \\nWasn’t this supposed to be the belated response to the migrant crisis that peaked last year in the Aegean Sea? NATO really took their time to assemble this. So far the Operation currently involves the Bulgarian, Italian, Greek and Spanish and Turkish navies. This is also the additional presence of a Greek & German submarine, as well as aircraft. According to the press statement : “ Operation Sea Guardian will help maintain an accurate picture of daily activity in the Mediterranean to help identify possible security concerns .” The mission can be broken down into 3 parts: LINK \\n1. Security & counter-terrorism \\n3. Capacity building \\n(Memo to NATO: Can I have that in plain English please?) \\nThere is another aspect to this Operation Sea Guardian , since the core tasks can also be expanded to include freedom of navigation and interdiction tasks, amongst others. [ Ding ding.. alarm bells are ringing…. “freedom of navigation “ ? Ah, maybe stretching the mission a bit, to denying “freedom of navigation” to certain countries in the future?] As a stated by NATO, the aim of this Operation could change; to be tied in with Operation Sophia. So sometime in the future, it could conveniently include official monitoring of events in Syria & the Russian Navy in the Med. LINK \\nSo on paper it looks like a well-oiled machine swinging into action, but judging from the tone of the title this Greek newspaper, “ NATO operation starts amid Greek-Turkish tensions “, the reality isn’t so rosy in the Aegean. LINK \\nLastly, Obama will shortly visit Greece. Rumours state that the hidden agenda may include forcing Greece to block Russian warships from port calls. This thorny issue is seen as one of the stumbling blocks for the US & NATO. The Avaaz led campaign whirlwind stopped Spain and Malta from allowing the Russian warships to call in, but not Greece. The Russian foreign ministry replied to the pressures made on Spain & Malta to deny port calls to Russian naval ships. . @mfa_russia 's #Zakharova on the arrival of the #Russian Navy’s aircraft carrier group in the Mediterranean | #Malta https://t.co/G45qg8tErP pic.twitter.com/FIS4a6r5Gv \\n— RussianEmbassy Malta (@RusEmbMalta) November 11, 2016 \\nUS & NATO Surveillance \\nStanding NATO Maritime Group 2 (SNMG2) appears to be tasked with watching over the Russian navy in the eastern Med. Further to my initial briefing, this includes the Canadian warship- Charlottetown (now in Toulon), Danish warship – Absalon and the Spanish oiler – Cantabria (A15). All have taken turns to watch the Kuznetsov fleet deployment. \\nAdditionally, a USN P-8A Poseidon plane reportedly took off on the 10th Nov, from the Sigonella airbase in Sicily and monitored the activities of the Russian flotilla off Syria. This is not the first nor will it be the last either that the US Navy snoops on the Russians in the area. LINK \\nOnce more the German navy’s warship, Braunschweig, (designated as “UN warship” on AIS), patrolling includes taking a cursory peek at the Russian navy off Tartus. F260 is part of UNIFIL in Lebanon. Yet it is an interesting turn of events, since back in October, the Braunschweig seemed to be also keeping an eye on the Russian ship Yantar. To whose benefit was it being done? The UN’s? \\n\\nPart 4 – Further afield \\nBab Al Mandeb and Yemen \\nThe UK has ‘quietly’ deployed one of its latest class of warship , HMS Daring, to keep a watch on merchant shipping off Yemen. This comes after the October missile attacks against an UAE naval ship & 3 US warships on station there. Bab Al Mandeb is known as a maritime chokepoint and is a busy commercial route. LINK \\nThis ties in nicely to my next topic, the Yantar, since it recently transited this area and so did the UK warship. The Yantar was last reported on AIS as ‘stationary’ in the middle of the Gulf, off Kharg, Iran, quite likely near to the GBICS submarine cable. As previously mentioned last week, it is probably looking for others nations’ ‘taps’ or ASW arrays in the area. \\nThe Russian Pacific Fleet detachment \\nA group of Pacific Fleet ships left Vladivostok for the Indian Ocean on 17 Oct, consisting of the Admiral Tributs (564 ), ASW warship, Bystriy, a destroyer, a tug “Alatau” & oiler “Boris Batuma”. They were in Indonesia at the beginning of November on a goodwill visit . \\nIt was rumoured that they would head for the Syria, but the latest unconfirmed rumour is that they are on exercise with the Chinese Navy again. \\nChinese visit by Russian Navy CINC \\nLast week, the head of the Russian Navy ,Vladimir Korolyov, recently made a working visit to China. link \\nThis comes on the back of China’s first ever invitation to the Russian Navy to participate in a “joint-military-exercise ” in the South China Sea back in October. \\nThe visit by the Russian naval CINC , included China’s aircraft carrier the Liaoning during a working visit to China. Russian naval CINC Vladimir Korolyov visits #China 's aircraft carrier the Liaoning during a working visit to China, Nov 5 pic.twitter.com/kbvgz6i1no \\n— People's Daily,China (@PDChina) November 8, 2016 \\nOriginally a sister ship of the Kuznetsov, the Varyag, (Riga), was never finished, & was left to Ukraine which then sold it to China. Lately, the Russian CINC met his counterpart ADM Wu Shengli. Link in Chinese \\nWhat the Russian CINC made of the condition and life onboard compared to that of the Kuznetsov is not publicly known, although I suspect a few Russian ‘matros’ would be green with envy though (link to life onboard site). Are the Chinese pulling the leg of the Russians? (Look at the date of the article). Tour the Liaoning here : \\nThank you for your time, \\nLeDahu The Essential Saker: from the trenches of the emerging multipolar world $27.95\""}, "time": 1742561734.0589643}