{"duration": 0.04392695426940918, "input_args": {"text": "'European and North African countries met in Rome Monday to discuss the migrant crisis, which saw more than 150, 000 migrants land on Italian shores in 2016 and thousands killed in dangerous conditions on the Mediterranian Sea. [The European Union already backs Libya’s government with €200 million worth of support to tackle people smugglers  —   who provide the unseaworthy craft which carry thousands of migrants north into the waiting arms of European coastguards and volunteer ‘rescue’ missions  —   but now the country is requesting more.  Libya’s fragile,   “unity government” has now asked for an additional €800 million worth of equipment for their patrol efforts including ships, helicopters,   vehicles, and radar. The Italian government is already providing Libya with ten patrol craft, to be delivered before the summer. The Libya Herald reports Libyan Prime Minister Fayez   flew to Rome with a “shopping list” of demands, including the call for more money and equipment, in the wake of some 20, 000 having made the crossing this year alone. An estimated 3, 000 migrants were rescued in the Mediterranean in just the past weekend. The new agreement struck Monday with Italy and other European nations agreeing to help Libya patrol her coast and keep the smuggler boats from setting off was short on actual detail or a plan to improve the situation, but instead showed a will, said the Italian interior minister. Democratic party minister Marco Minniti said of the meeting: “Naturally we haven’t resolved the problem because it’s clear no one has the definitive solution to the problem in their pockets. “But we have common will. And this common will has a common objective: to not chase or suffer illegal migration but govern it. ” Austrian interior minister Wolfgang Sobotka praised the movement with Libya, telling press: “We have to do everything we can to stop the illegal migration across the Mediterranean” reports Kronen Zeitung. The spending of British and European money in Libya has come under considerable criticism this year, as the poor conditions of migrant camps set up in the country courted criticism. Future spending may see camps established in other North African nations. While a not insignificant amount of money, the €800 million now discussed will be dwarfed by coming European contributions if a new “African Marshall Plan“ an aid package designed to boost African nations, is put into place. President of the European Parliament Antonio Tajani said if the bloc doesn’t start pumping cash into the continent immediately, “20 million Africans are going to come to Europe in the coming years”.'"}, "time": 1742561768.5968645}