{"duration": 0.06356191635131836, "input_args": {"text": "'Rep. Louie Gohmert ( ) told Breitbart News Daily he was “excited” by President Donald Trump’s choice of Neil Gorsuch for the Supreme Court. [“This is exactly why I got behind Donald Trump,” he told SiriusXM host Alex Marlow. “This is why I was excited election night, is because we all expected Trump to keep his word. He has. He picked somebody from the list, and, in fact, he didn’t just pick somebody from the list he may have picked the very best person from the list. ”  “This is a man that, as far as we know, has not ruled on an abortion case, but we know from what he has ruled on that he believes in the Constitution,” Gohmert noted. “He believes that we have a right to religious freedom. Just as the government’s not to establish a religion, they’re not to prohibit the free exercise. We’ve had some justices  —   we’ve still got them on the court  —   that believe that the government can restrict the peaceful exercise and they can force people to go against their religious beliefs. If Hillary Clinton had made this selection, I think our religious freedom would be over. But it’s not. ”  “We have a good man. This guy is such a good candidate,” he declared. “I know the President and others have said he may be able to rule as a Supreme Court justice for maybe 30 more years. I’m hoping 40 years! I’m going to be praying for his good health. ” “And I’m simply praying that the Senate will do their jobs and get this guy confirmed. They confirmed him ten years ago,” Gohmert pointed out. “They had reviewed for anything that they’d like to bring against him ten years ago because he was going to be on the Court of Appeals, and those are critically important positions. There wasn’t anything there ten years ago. Once he’s on the Court of Appeals, then every Court of Appeals justice has in the back of their minds, ‘You know, I could be on the Supreme Court someday. I’d better keep my nose clean.’ And so it ought to be a very uneventful hearing. ” Gohmert recalled that he was originally a supporter of Senator Ted Cruz ( ) for president in 2016, having “fought in the trenches” with him, but now, he wondered how any serious conservative could complain about President Trump’s selection of Gorsuch for the Supreme Court. In light of this nomination, he pronounced the “NeverTrump” movement among some conservatives a “disastrous mistake. ” “Thank goodness those who said, ‘Never Trump’ did not keep him from being president because that would have been the end of too much,” he said. “So those who were NeverTrumpers, fine everybody’s entitled to your opinion, but at least you ought to get out there and acknowledge now, ‘Well, I wasn’t for Trump, but thankfully, he actually did keep his word, and we can all be grateful for that. ’” Gohmert said friends in the Senate told him they will make sure Gorsuch gets through the confirmation process, along with President Trump’s remaining cabinet nominees. One senator told him it was important to give Majority Leader Mitch McConnell space and time to shepherd the nominations through in his own way, rather than pressuring him for swift action and fiery confrontations with the Democrats. “The thing about this nomination, it’s replacing Antonin Scalia,” he said of Gorsuch. “The Left was pretty well getting their way with the courts, even with Scalia on there, being as conservative and originalist as he was. ”  “There’s a kind of feeling that I’m hearing about among some of the Democrats, especially those that are in states that voted for Trump, that, look, this shouldn’t be the one that we fight over,” he added. “If it’s Ginsburg, then we fight to the death to prevent a conservative, but this is Scalia. We’re not losing anything by getting somebody that might be close to being as conservative as Scalia. So this shouldn’t be where we fight to the death to keep him from being a vote, and this also could be the one that brings those senators that are Democrats in states that voted for Trump, it could be just what brings them down and turns their seat Republican. ” Gohmert did not think much of the Democrat claim that Gorsuch is an illegitimate nominee for a seat that was “stolen” from President Barack Obama’s designated successor to Scalia, Merrick Garland. “Last night, I came by the Supreme Court about 9:15, and they already had a massive demonstration out there, signs they were ready to go. They had their magic markers. They were ready to put whoever’s name had been cited by Trump as being terrible,” he observed. “You know, Have Poster Board, Will Travel. There they were. They were ready to condemn anybody, no matter who had been picked. If Trump had named the most   person in the country, they were out there ready to condemn. ” “This is fake news. This is people who are just out there to create the appearance of obstruction,” he said. “You know, Patrick Poole, remember back in one of the demonstrations on the Mall, caught one of the guys: ‘Hey, how much are you getting paid?’ He said, ‘$15 an hour. I thought everybody was getting that.’ They’re getting paid. The Soros money gets spread around. And actually, unfortunately, sometimes it’s our own government money that’s funding some of the obstructionism. But we have got to see this country through this and get Gorsuch confirmed so that this country will go on and still have a chance to survive, with our freedom intact,” he urged. Gohmert noted that every Democrat seems to be reading from a script that Gorsuch’s prospective Supreme Court seat “was supposed to be Obama’s seat to fill,” as Marlow noted. “They have the mantra. They might as well have been carrying their statements on a sign, and all they had to do was fill in the blank for the name,” he said, predicting that virtually every Democrat statement about Gorsuch will be prefaced with   “garbage. ” “I’m thanking God he got elected, and he’s keeping his word,” Gohmert said of President Trump. “It’s a day to rejoice for any Republican, anyone who’s a moderate, because otherwise, we get a leftist, and we’re done. So it’s a great day for America. It just really is. ” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742628532.3139124}