{"duration": 0.09709501266479492, "input_args": {"text": "'(7 fans) - Advertisement - Amid mounting anger against the US-client government of Field Marshal Abdel Fattah Al-Sisi because of tax rises, soaring food prices, inflation and cuts in state subsidies, a kangaroo court in Cairo has confirmed a 20-year prison sentence against Mohamed Morsi, the first democratically elected President who was deposed by Al-Sisi in July 2013. \\nIn April 2015, a Cairo court had sentenced Morsi to 20 years in prison for inciting violence against protesters who had staged a sit-in outside the Ittihadiya presidential palace in December 2012, when Morsi was still in power. \\nTwenty-year jail sentences were also confirmed against other senior figures from Morsi\\'s Muslim Brotherhood, including Mohamed el-Beltagy and Essam el-Erian. The men were convicted in April 2015 on charges including kidnapping, torture and the killings of protesters during unrest in 2012. \\nMorsi, elected in 2012 and overthrown in 2013, is facing several trials. After a controversial trial, he was sentenced to death in May 2015 for allegedly participating in violence against the police during the 2011 uprising against former President Hosni Mubarak, but his court appointed lawyers have appealed that verdict. \\nAn Egyptian court cancelled the life sentences on Tuesday (Oct 25) handed out to former president Mohamed Morsi and Muslim Brotherhood chief Mohamed Badie along with 15 other leaders of the banned group in an espionage case and ordered a retrial. \\nThe court also cancelled death sentences handed out to 16 other Muslim Brotherhood members, including top leaders Khyrat el-Sharer and Mohamed el-Beltagy Ahmed Abdel Aty. Thirteen of the 16 were sentenced in absentia. The defendants were accused of spying, funding terrorism and disclosing national security. \\nTurkey\\'s president, Tayyip ErdoÄ\\x9fan, had criticized the death sentence for Morsi and accused the west of hypocrisy. \"The popularly elected president of Egypt, chosen with 52% of the vote, has unfortunately been sentenced to death,\" ErdoÄ\\x9fan said at a rally in Istanbul. \\n\"Egypt is turning back into ancient Egypt,\" he said, referring to the Pharaonic rule of the land that ended more than two millennia ago. \"The west, unfortunately, is still turning a blind eye to Sisi\\'s coup,\" he added. \"While they abolished the death penalty in their own countries, they just look on as spectators at this execution in Egypt.\" - Advertisement - \\nMorsi, who has also been sentenced to 25 years in prison after being convicted of leaking state secrets to Qatar, has not appointed a lawyer to defend himself and has refused to recognize the legitimacy of the court proceedings, saying he remains Egypt\\'s legitimate president. \\nThe Muslim Brotherhood has been blamed for the unrest in Egypt, which has resulted in the death of hundreds of people. Al-Sisi\\'s government designated the Muslim Brotherhood a terrorist group in December 2013, making even verbal expressions of support punishable by imprisonment. \\nHundreds of people have been sentenced to death in a crackdown following Morsi\\'s overthrow. Seven have been executed, including six defendants sentenced to death by a military court for allegedly participating in militant attacks. \\nMore than three years after Sisi ousted Morsi, his promise to restore stability is wearing thin. Desperation and anger among Egyptians is mounting due to increase in food prices, while the double-digit inflation rate squeezes poor Egyptians. \\nAccording to the Middle East Monitor, core inflation is at seven-year-highs, near 14 percent, as a foreign exchange shortage and a hike in customs duties bite hard in a country that imports everything from sugar to luxury cars. The government raised electricity prices by 25-40 percent in August and is phasing in a 13 percent value-added tax approved by parliament in the same month. - Advertisement - \\nAs part of reforms aimed at clinching a $12 billion IMF loan needed to plug its gaping budget deficit, the government is also expected to cut petrol subsidies and devalue the Egyptian pound, prompting a further cycle of inflation in Egypt, where tens of millions rely on state-subsidized bread, the Middle East Monitor said adding: \"Dollar rationing at banks has driven businesses toward the black market where the dollar is now selling for more than 15.5 pounds -- a huge mark-up from the official rate of about 8.8. Rumors have spread that Friday Nov. 11 will be a day of protest over economic conditions, the Middle East Monitor reported. Police have already detained about 70 people for inciting protests, accusing many of loyalty to the banned Muslim Brotherhood.'"}, "time": 1742562253.9151063}