{"duration": 0.02847576141357422, "input_args": {"text": "'A battle is brewing in the heart of New York City’s financial district and it’s not about money. It’s a conflict between the artist who created the iconic three and a half ton bronze bull as a symbol of American strength and perseverance, and a   high bronze girl planted in his path by an investment company. [The artist, Arturo Di Modica, paid for, created, and installed his piece without permission in front of the New York Stock Exchange in 1987. Eventually moved to nearby Bowling Green Park, the girl was placed directly facing the bull last month to mark International Women’s Day.  The company that installed Fearless Girl claims it did so because of its commitment to empowering women. “In honor of International Women’s Day, State Street Global Advisors celebrated the power of women in leadership, and the potential of the next generation of women leaders, by installing a bronze statue of a confident young ‘Fearless Girl’ in the heart of New York City’s financial district,” the company’s website states, adding that gender diversity creates “stronger financial performance” in business organizations. But the artist behind the bull disagrees and has hired an attorney to make his case as to why the girl should be removed. In a letter sent to Mayor Bill de Blasio on Tuesday, the artist said not only does the girl sculpture infringe on his rights under the Visual Artists Rights Act of 1990 but was installed to generate commercial gain for the investment company. The letter states: On or about March 8, 2017, State Street Global Advisors (SSGA) had the statue of a young girl placed directly in the path of the Charging Bull. The statue was commission and finance by State Street Global Advisors as part of a marketing campaign devised by McCann New York and was accompanied by a plaque stating “Know the power of women in leadership. SHE makes a difference. ” “SHE is the ticker for one of SSGA”s   funds. The statue is first and foremost an for SSGA and specifically for SSGA’s SHE fund. The statue of the young girl becomes the ‘Fearless Girl’ only because of the Charging Bull: the work is incomplete without Mr. Di Modica’s Charging Bull, and as such it constitutes a derivative work on Charging Bull. De Blasio responded to the letter, which said the artist hopes the girl will be removed, making any legal action unnecessary, by tweeting his support for the female statue: Men who don’t like women taking up space are exactly why we need the Fearless Girl. https:  .   —   Bill de Blasio (@NYCMayor) April 12, 2017,  Normal Siegel, the attorney representing the artist, told PBS NewsHour that he was not amused by the tweet. “[De Blasio] is not addressing the issues here, of whether or not there is copyright or trademark infringement, and what due diligence did the city of New York do to granting the permit,” Siegel said. “Shouldn’t they address those issues instead of making some kind of political statement?” “De Blasio’s office responded to a request for further comment by pointing NewsHour back to the mayor’s tweet,” PBS NewsHour reported, adding that SSGA said in a statement it was “grateful” people in New York City support what the girl represents: “the power and potential of having more women in leadership. ” “Siegel told NewsHour they would try to reach an agreement outside of court, and if not, decide whether to litigate the issue,” according to PBS. In 1989, the New York Times wrote about Charging Bull’s arrival in the city. Wall Street awoke to a gigantic bull on its doorstep yesterday  —   a 3       bronze sculpture by an artist from SoHo who deposited it outside the New York Stock Exchange and declared it a Yuletide symbol of the ‘strength and power of the American people.’ Hundreds of people walked around, gawked at, admired and stroked the     bull, the image of a surging market in the lore of high finance. But the symbolism was apparently lost on the Police Department, which said the work had no permit and was obstructing traffic at the busy intersection of Wall and Broad Streets, and even on the stock exchange, which hired a trucking company and had the humongous thing carted away. The article said Di Monica, who was born in Italy, worked on the bull for two years in his Soho studio before presenting it to the city. ”He wanted to encourage everybody to realize America’s power,” said Kim Stippa, his assistant.'"}, "time": 1742628492.5230923}