{"duration": 0.1127476692199707, "input_args": {"text": "'My    lives far away. She calls to check in every week or so and runs through a laundry list of topics: her husband, their kids, their dog. She has a million stories. Trouble is, by the time she’s finished, her time is up: “Gotta go!” This leaves no room for me to share my news. So while I know her son’s ACT scores, she wouldn’t be able to tell you the first thing about my family. This has been going on for over a year. Is there a way to point out the imbalance that won’t make me sound needy or her  ? VALERIE, CONN. I have a newish therapist, and I’m going away for a spell this summer. So I asked if he would consider phone sessions. “Absolutely not!” he said, with a look that verged on repulsion. In his experience, patients on the phone often interpret silence as a signal to keep talking, leading to 50 minutes of blather. Perhaps this notion, combined with the fact that your    seems to be initiating all these calls, explains her conversational dominance. (Or maybe she’s a narcissistic witch.) One idea: Try dialing the phone yourself. It’s conceivable that your    will back off a little, and you will become “Charles in Charge” for the length of the calls that you place. If not, here’s another: Though I have preached for years that we should pick up the phone at the first sign of trouble in our   do the opposite here. After your next   call, send her an email: “Your story about Charlie’s ACT’s made me think of a funny one from when Sarah took them. Remind me to tell you when we next speak. ” Then do so at the beginning of your next call. She may get the hang of taking turns. Now, this advice is predicated on the assumption that your    is a good person with an annoying phone tic, and that normal attempts to jostle your way into the conversation have failed. But we may have different definitions of jostling. There’s no crime in saying: “Hang on! You won’t believe what your brother did,” after she tells you a story about her husband. Not every conversationalist will lay out the red carpet for us. Sometimes we have to make our own breaks. My husband and I married last September. We have a surprising number of friends who attended the wedding but have not yet sent gifts. We had a small registry that sold out quickly, so some folks probably saw that it was sold out, made a mental note to buy something else, then forgot. It’s not a big deal to us. But we’re worried that some friends got us gifts that may have been lost at the wedding or in the mail, and they are now wondering why we haven’t sent them   notes. What should we do? DAVID, NEW YORK I applaud the mental gymnastics of trying to turn your “surprising number” of    friends into victims of the United States Postal Service. (You and your hubby should head to Rio for spots on the Olympic tumbling squad.) For every package that is not delivered, millions are. And absent some catastrophic event at your wedding reception, I suspect you are in possession of all of the presents left for you there, too. Don’t obsess over tiny risks. The trick here is turning your friends’ attendance at your wedding into the big prize. Because that’s all you’re getting. Sorry. If you want to send them   notes for being part of your big day, knock yourself out. But it seems over the top to me. For what it’s worth, your assessment of the situation  —     registry leading to giftlessness  —   seems about right. Next time, register for everything in sight. (Books, anyone?) I came across a travel package to Japan that sounded perfect for my husband and me. He mentioned it to his running buddy, who immediately said that he and his wife were in: “We’d love to join you. ” Philip, they weren’t invited! It’s a   trip, and we’ve never traveled together before. More important, they are not adventurous eaters, and I don’t want to spend my limited travel time scouting for Americanized food in Asia. Fortunately, the trip was sold out. Now, another has come up, but I’m afraid that Japan is off the table if we want to travel alone. Isn’t it too risky to book the trip and try to keep it top secret? C. S. NEW JERSEY Has anyone else noticed that it seems to be masochist week at Social Q’s? Don’t let impromptu statements by your husband’s running buddies dictate your travel schedule. Book your vacation and hold your head high. No need for secrecy. When your husband (inevitably) mentions the trip to his friend, coach him to say, “We decided to make it a second honeymoon and go alone. ” Your objections to   travels with this couple sound sensible, but no reason is required. Propose a long weekend to the Berkshires instead. (But only if you want to go with them.)'"}, "time": 1742564277.603568}