{"duration": 0.11142086982727051, "input_args": {"text": "'0 \\nThe question may have occured to many of us: \\n”Why do we need to suffer so much in our life, why is there so much suffering on Earth?” \\nAs if the whole world has conspired against us, almost everything causes suffering to us. We suffer when we are ill, we suffer when things do not work out the way we like or plan. We suffer when we have lost something, we have lost our money or we are left by a loved person. We suffer when we are not loved, not appreciated, when our performance is underestimated. We suffer when we see our loved ones suffer and we are unable to alleviate their suffering. We could go on a loing way, continuing the list of things causing us suffering. On the other hand, there is so little joy in our life. \\nWhat sense does all this suffering have? Does it have a meaning at all? Or is it just a bad joke of an evil Universe? Our Own Heaven \\nLet us imagine a life free of any kind of suffering. It is easy to imagine a life in which we do not suffer, where we are healthy, everything we do is successful, when all our wishes are fulfilled, everybody loves and respects us whoever we meet. In this private heaven of ours we could be happy. \\nBut there are 7 billion other people on Earth, who share the Earth with us. Would they also be happy in our imagined heaven? Would they also escape suffering? \\nWe cannot be fully certain about it, as in our isolated existence we are not sure, only guess what makes other people happy. In our isolated state we always use our own experience as a starting point, and assume that what is good for us must be good for others as well, and others suffer from the same thing we suffer from. Extending this logic makes us believe that once we no longer suffer, other people will also have a good time in our imagined heaven. \\nThe reality is, however, that the earthly heaven we imagine, and which is free of suffering for us, would cause a lot of suffering for a lot of other people, and would be even a real hell for many. \\nThe seven billion people living on Earth today would create seven billion different and separate earthly heavens if they had a chance to do so. They are in an isolated state of consciousness, and though there would quite a lot of similar heavens, they would still be different. \\nA common feature of all these heavens would be, however, that suffering would be present in every one of them. The Deeper Sense of Suffering \\nWe must conclude therefore that suffering–no matter how much we would like to avoid it–is a part of the life of every single human being. When we are suffering, we never say that ”my body is suffering,” but we say that ”I am suffering” or ”my heart is broken with sorrow.” Suffering is ours, because we ourselves are the suffering itself. And we suffer because we identify with the suffering . \\nOur daily sufferings point out to us that suffering us such is the result from our turning away from the Miracle and our identification with the separate state of consciousness. \\nIt is only possible to understand all this when the intensity of our identification with the body and the psychological Self is weakened a little bit, and we are–even only for brief periods–able to step out of the small prison of our thoughts and mind, and enter the endless space of the Consciousness. \\nSuffering in that sense is the wake-up call that prevents Consciousness from finally sinking into the dream of separatedness. Suffering is what actually stops us from finally and irrevocably identify with a body and a personal identity. \\nWhen we place our sufferings in the light of Consciousness , we no longer try to run away from them in despair, and no longer dream of a heaven free of suffering. We are now aware that oure sufferings are in fact our helpers and they may accelerate the process through which the Consciousness wakes up in the body we formerly and mistakenly considered our own. \\nRead more articles from Frank M. Wanderer Vote Up Frank M. Wanderer PhD Frank M. Wanderer Ph.D is a professor of psychology, a consciousness researcher and writer. Frank is the author of the books \" The Revolution of Consciousness: De-conditioning the Programmed Mind \", \" Ego - Alertness - Consciousness: The Path to Your Spiritual Home \" and several books on consciousness . With a lifelong interest in the mystery of human existence, Frank’s work is to help others wake up from identification with our personal history and the illusory world of the forms and shapes, and to find our identity in what he calls “the Miracle”, the mystery of the Consciousness. You can also follow his blog HERE'"}, "time": 1742564288.6249518}