{"duration": 0.09530019760131836, "input_args": {"text": "'A gunman shot and killed an imam and his assistant on the street near their mosque in a   corner of Queens on Saturday afternoon, the police said. The police said the imam, whom they identified as Alauddin Akonjee, 55, and the assistant, Thara Miah, 64, were shot shortly before 2 p. m. near the mosque,   Jame Masjid, in the Ozone Park neighborhood. Officers found them with gunshot wounds to their heads when they arrived at the scene, at the corner Liberty Avenue and 79th Street. The police said that both men were taken to Jamaica Hospital Medical Center, where they died. The crime, during a wave of   hostility across the country, unsettled many in the neighborhood, an enclave that area leaders described as a growing hub of Muslim families from Bangladesh that straddles the border between Brooklyn and Queens. The two men had just left a prayer session at the mosque, according to Misba Abdin, 47, who attends the mosque and is a leader of an area nonprofit that works with Bangladeshi residents. Mr. Abdin and other congregants said that Mr. Akonjee, originally from Bangladesh, lived in the area. The police said it appeared that Mr. Akonjee and Mr. Uddin were targeted but did not immediately release a motive for the shooting. They were wearing religious garb, and Mr. Akonjee was carrying more than $1, 000, the police said. The money was not taken. They were approached from behind by a man wearing a dark polo shirt and shorts as they were turning onto Liberty Avenue, according to witnesses and video footage from the area, the police said. Witnesses saw a man running away with a gun, the police said, and they released a sketch of the suspect on Sunday morning. The police said that they were investigating what led to the shooting, saying they did not know whether it was related to a botched robbery, a dispute or anything tied to their religion or race. “There’s nothing in the preliminary investigation that would indicate that they were targeted by their faith,” said Henry Sautner, a deputy inspector in the New York Police Department. A law enforcement official, speaking on the condition of anonymity because of the active investigation, said that the crime did not fit any existing pattern and cautioned that the motive was still wide open. “What it does seem is that it was planned, to some extent,” the official said. “It looks more like a targeted shooting than anything else. ” Detectives have not found video footage of the shooting itself, nor have they located an eyewitness, the official said. That video shows the gunman following the two victims. “There is no question that he was targeting them,” the official said. “But it’s hard to say why. ” One snippet of video shows the victims walking, with the suspected gunman following deliberately behind, the official said. Then, they go out of the frame of the camera. Around 15 seconds later, another video shows the same man “running back,” alone, after the shooting, the official said. “Unfortunately, because we don’t have yet good video coverage of the actual shooting, it’s hard to say what transpired,” the official said. “Witnesses said they heard several shots. They saw the guy running with the gun in his hand. ” No one has said they heard the gunman speak during the shooting. Hundreds of Ozone Park residents rallied Saturday evening at the crime scene, a nondescript block underneath elevated subway tracks, to denounce the shooting. “We want justice!” they chanted over the sounds overhead of the subway and helicopters. A few hours later, another group of residents, religious leaders and members of   groups gathered in front of the mosque several blocks away. Mohammed Abu Yusuf, 67, a travel consultant and a longtime resident, said he came out because the shooting had angered him. “Here, it is surprising,” he said. Many people said that the nature of the shooting, in the middle of the day with no obvious motive, led them to conclude that the men were targeted because of their race or religion. “It could have been me over here,” said Kobir Chowdhury, 40, the president of Masjid   a nearby mosque in Brooklyn. Zead Ramadan, the board president of the Council on   Relations in New York, connected it to the current political discourse, where   rhetoric and a rise in Islamophobia have left many feeling strained. “This is a crime against humanity,” he said. In the United States, there has been an average of 12. 6 suspected   hate crimes a month in recent years, according to an analysis of F. B. I. statistics, but that number appeared to spike late last year. “Of course we’re afraid,” said Jamil Kahn, 38, who has attended Mr. Akonjee’s mosque and who works in the neighborhood. Those who knew and worshiped with Mr. Akonjee described him as a quiet and pious man. “He doesn’t talk, unless he acts,” Mr. Abdin said. “He just comes to the mosque and comes home. ” Out of many imams, Mr. Chowdhury said, “he was a imam who you would want to hear his sermon. ”'"}, "time": 1742562980.8768868}