{"duration": 0.10570621490478516, "input_args": {"text": "'Comments \\nYet another one of the obnoxiously ostentatious monuments to Trump’s ego is going under. The Trump International Hotel in Toronto is filing for bankruptcy, a mere four years after it opened. \\nThe champagne and caviar toned tower will be auctioned off after a Canadian bankruptcy judge placed the building into receivership on Tuesday. \\nIn a story that is now very familiar to all of us , the $310 million project was beset with lawsuits from the start from angry investors who claim that Trump and his partners lied to them with “wildly overstated projections of Trump Toronto’s performance,” telling investors the “worst case” scenario for occupancy rates would be 55%, when in fact court documents show it varied between 15% and 45%. POLITICO details just how hard Trump screwed his investors: \\nIt is clear from affidavits in the fraud cases and the bankruptcy case that the buyers have taken a financial beating. A warehouse supervisor named Sarbjit Singh, who was earning about $55,000 a year, testified that he borrowed money from his father, a retired welder, for the deposit on his hotel unit; he never closed on the deal, but he says he still lost $248,000. Se Na Lee, a homemaker who was married to a mortgage underwriter, borrowed money for her deposit from her parents; she did close, and ended up losing $990,000 through December 2014, she says. \\nTrump licensed his name for the project to Talon International, owned by a Russian-born oligarch, Alexander Shnaider. “The whole business model has been overpromise and underdeliver, and it’s Trump’s name on the thing” said an insider to POLITICO. \\nThe hotel has been the site of numerous protests against the racist rabble-rouser, and a city Councillor of Toronto has publicly demanded the Trump name be removed from the building, saying in a statement to the project managers that: \\nThere are some who may suggest that Canadians should just ignore Mr. Trump, or that he doesn’t matter because he is a political figure in another country. \\nHowever, recent attacks against Muslims in Toronto, and other Canadian cities, show that we are not immune to hateful actions against peaceful people. As well, the Canadian government’s similar internment of Japanese-Canadians is a part of our past that is still very painful for many. \\nTo have the Trump name displayed so prominently on our skyline signals a tacit acceptance of hateful and divisive views. \\nSuch is the legacy of Donald Trump, disgraced businessman and divisive race-baiting sexual predator: angry citizens, angry investors, bankruptcy, and a prominent stain where the letters of his name once stood.'"}, "time": 1742564314.3950207}