{"duration": 0.18589520454406738, "input_args": {"text": "\"[World socialist flag by Frankoko.] Andre Vltchek – from Moscow Itinerant Philosopher and Journalist Editor's Note Andre Vltchek’s analysis here points out important erosions of left activism, and left activists bear partial responsibility for the tumble into chaos. Hit critiques takes on extra bite in the context of the rise of racism and xenophobia, misogyny, and the crassest brutality, in the United States. It would do everyone well to wake up and carefully look at what is happening to the left. P eople all over the world are fed up with capitalism. They don’t always know how to formulate their aversions anymore (the result of a confusing ‘education’ and disinformation campaign pouring out of the West), but intuitively they are increasingly longing for socialism or even Communism; definitely for some humane, compassionate system based on social justice, kindness and anti-imperialist principles.\\nSuch sentiments are everywhere, in countries as diverse as the Philippines and Bolivia, South Africa and Kirgizstan. \\nThe rulers and propagandists in the West are well aware of this ‘dangerous trend’, and they are trying to reverse it with increasing determination – even with brutal force. \\nIn the past, they used to simply try to fully ideologically discredit all socialist and Communist thoughts. Billions of dollars were spent on propaganda and disinformation, on ‘re-education’ of the masses in all corners of the globe, on targeted scholarships and tactics aimed at dividing the Left. This approach was successful, but only to a certain degree. All over the world, the leftist revolutionary ideas would lose some ground for a while, but then they would re-emerge again, often under some new labels and banners. \\nLately, the Empire has begun changing its strategy. Instead of trying to contain its main adversaries, it has decided to exterminate them ‘intellectually’ once and for all. And how better to do it than by what it always does the best – by spreading confusion, nihilism and chaos! \\n* \\nInstead of attacking socialism and Communism directly, the Empire has begun its massive campaign to discredit most of the countries that are being governed by left-wing governments and movements. This is of course by itself nothing new. What is ‘innovative’ is that this time Western propaganda has actually began arguing that the anti-imperialist countries are essentially not left wing at all, that they are more capitalist than the West itself, that they are ‘anti-people’, and sometimes even fascist. \\nNew derogatory and thoroughly grotesque terms like ‘state capitalism’ have been invented and put to destructive work. These terms have then been repeated so often that they have become normalized, and eventually been adopted by the Western ‘soft left’, the liberal media and academia, as well as by the countless ‘progressive’ but anti-Communist movements – including anarchists. \\nWhile I was told by some of the greatest revolutionary figures like Eduardo Galeano and Pramoedya Ananta Toer, that it is time for ‘un-dusting the old flags and symbols’ (and they were clearly talking about the socialist and Communist ones), the Western official propaganda and much of the Western ‘left’ were busy spreading their vitriolic but contagious doctrines that ‘the labels’ should be once and for all declared obsolete. “I don’t want to be part of any political party or any movement”, one hears increasingly from millions of couch and cafe revolutionaries in cities like London or Paris. “I don’t like to be labeled”. Or typically so in those places: “I have my own mind”. \\nExcept where there are no structures, no strong organization, no labels or flags, there can be no true victory. \\nBut who cares about victory? Soon it became clear that the ‘progressive’ Western ‘opposition’ was not truly seeking to take power or to implement real revolutionary changes. It wanted to ‘improve things at home’, instead of abolishing the entire monstrous world order. It felt cozy and comfortable being a toothless discussion club, hating everything that was truly fighting, risking life while trying to stop imperialism and the Empire from devouring the Planet. \\nThus was born the grand quiet alliance of the Western establishment (the Empire), the liberals and of those undefined (or of loosely defined) movements like the anarchists. It was directly antagonistic to almost all the countries where the Left was by now holding power. It ‘distrusted’ leading revolutionary figures. Needless to say – the criticism of the world revolutions has been based strictly on Western liberal values and doctrines. \\nThose countries that decided to face the Western Empire were generally labeled as un-democratic, as being arch violators of human rights. Socialist nations became the main target of the propaganda. Their every move has been scrutinized, each error blown out of proportion. Grotesquely, the West was, as mentioned above, now criticizing them for ‘not being socialist enough, or socialist at all’. It is because the demagogues in London, New York and Paris knew perfectly well that socialism, even Communism, is once again, for many people all over the world a great asset, not liability. \\nIn the meantime, millions of ‘purists’ from the pseudo-Left in the West got engaged in endless and pointless theoretical debates about what was or not true socialism and Communism. \\n“Is socialism, the Chinese way, truly socialism?” they are repeating, like parrots, all over Europe and North America. “Is Russia socialist at all, or is it governed by a strongman and by a bunch of selfish oligarchs?” And of course: “How socialist are countries like Iran or South Africa?” \\nThe verdict of the purists is always extremely stern. Almost nobody manages to survive the scrutiny! The purists in the West don’t hold power, and it is apparent that they don’t really want to. They bark. They philosophize. They throw sticks into the wheels of those who are truly and determinedly fighting for a better world. They ridicule the revolutions and any powerful left-leaning state. \\nVictorious and actively militant anti-imperialist governments and nations make them feel irrelevant, obsolete, embarrassing. \\nAnd the Empire knows it. It understands. It uses the soft Western left against the arch socialist and Communist enemies. \\nIt is using soft left effectively because it is selfish, cowardly and it lacks discipline. But above all, because it is self enamored. \\n* \\nAnd so, in great unison with the Western Empire’s palace propagandists, the soft Western anti-Communist ‘left’ is arguing that the governing Left all over the world is not really true left, that the countries that call themselves socialist are in fact more capitalist than the West, and the world can only be saved by some extremely vaguely defined and abstract system of collective production means (unrealistic and utopian, as nowhere except in the West and in a handful of countries inhabited by European descendants, like Argentina, would such concepts be supported by the masses). \\nThe new alliance is against China, Russia, South Africa, North Korea, Venezuela, Cuba, Syria, Iran, Eritrea; it is basically against all countries that are still opting for an independent, anti-imperialist course. \\nAll these countries are ‘wrong’. All of them are brutally ‘oppressing their people’ and in almost all of them the local ‘oligarchs are more brutal than in the West’. \\nYou look closer, and it’s all manipulation and lies, or at best half-truths. However, ‘falsehoods repeated a thousand times have a tendency of becoming the truth’, as an ‘icon’ of German Nazism explained many decades ago. And so it goes… \\nFabrications are sinking deeper and deeper into the sub-conscience of the people, in the West but also in countries that are being targeted. Nobody dares to protest, to scream loudly: “Nonsense! These countries are actually socialist!” \\nWhat eyes are seeing and what the brains are conditioned to ‘conclude’ are suddenly two thoroughly different things. \\nThe strategy of the Western Empire is clear: it makes things thoroughly confused, too complex to understand, lacking in transparency. \\n“Capitalist China, right-wing Russia, anti-black South Africa, state-capitalist Venezuela, monolithic and Fascist DPRK. Who would want to follow their examples? Better to accept the familiar Western fundamentalist capitalism and imperialism”. That’s what the world is being maneuvered into thinking. \\nBrilliant indoctrination strategy! Except… Red flags, fresh from being washed, are proudly waving all over the world, once again. In China and Russia, in South Africa and in so many other places, people are proudly returning to the old labels. \\nNot everyone can understand, anymore, but many are still able too feel, instinctively, and as a result of these basic human impulses, a violent clash between depressing deceit and simple human desires and dreams will soon become imminent. \\nOriginally published by NEO . \\nAndre Vltchek Philosopher, novelist, filmmaker and investigative journalist, Andre Vltchek has covered wars and conflicts in dozens of countries. Three of his latest books are revolutionary novel “Aurora” and two bestselling works of political non-fiction: “ Exposing Lies Of The Empire ” and “ Fighting Against Western Imperialism ” . View his other books here . Andre is making films for teleSUR and Al-Mayadeen. After having lived in Latin America, Africa and Oceania, Vltchek presently resides in East Asia and the Middle East, and continues to work around the world. He can be reached through his website and his Twitter . \\nPLEASE COMMENT AND DEBATE DIRECTLY ON OUR FACEBOOK GROUP INSTALLATION Note to Commenters Due to severe hacking attacks in the recent past that brought our site down for up to 11 days with considerable loss of circulation, we exercise extreme caution in the comments we publish, as the comment box has been one of the main arteries to inject malicious code. Because of that comments may not appear immediately, but rest assured that if you are a legitimate commenter your opinion will be published within 24 hours. If your comment fails to appear, and you wish to reach us directly, send us a mail at: editor@greanvillepost.com \\nWe apologize for this inconvenience. =SUBSCRIBE TODAY! NOTHING TO LOSE, EVERYTHING TO GAIN.= free • safe • invaluable If you appreciate our articles, do the right thing and let us know by subscribing. It’s free and it implies no obligation to you— ever. We just want to have a way to reach our most loyal readers on important occasions when their input is necessary. In return you get our email newsletter compiling the best of The Greanville Post several times a week. [email-subscribers namefield=”YES” desc=”” group=”Public”] Nauseated by the Had enough of their lies, escapism, omissions and relentless manipulation?\""}, "time": 1742563919.4199283}