{"duration": 0.043103933334350586, "input_args": {"text": "'Store When CIA and NSA Workers Blow the Whistle, Congress Plays Deaf It’s pretty clear that those intelligence agencies — not the elected representatives of the people — are running the show in Washington Patrick G. Eddington | The Intercept - October 27, 2016 Comments \\nDO THE COMMITTEES that oversee the vast U.S. spying apparatus take intelligence community whistleblowers seriously? Do they earnestly investigate reports of waste, fraud, abuse, professional negligence, or crimes against the Constitution reported by employees or contractors working for agencies like the CIA or NSA? For the last 20 years, the answer has been a resounding “no.” \\nMy own experience in 1995-96 is illustrative. Over a two-year period working with my wife, Robin (who was a CIA detailee to a Senate committee at the time), we discovered that, contrary to the public statements by then-Chairman of the Joint Chiefs Colin Powell and other senior George H. W. Bush administration officials (including CIA Director John Deutch), American troops had in fact been exposed to chemical agents during and after the 1991 war with Saddam Hussein. While the Senate Banking Committee under then-Chairman Don Riegle, D-Mich., was trying to uncover the truth of this, officials at the Pentagon and CIA were working to bury it. \\nAt the CIA, I objected internally — and was immediately placed under investigation by the CIA’s Office of Security. That became clear just days after we delivered the first of our several internal briefings to increasingly senior officials at the CIA and other intelligence agencies. In February 1995, I received a phone call from CIA Security asking whether I’d had any contacts with the media. I had not, but I had mentioned to CIA officials we’d met with that I knew that the CBS newsmagazine “60 Minutes” was working on a piece about the Gulf War chemical cover-up. This call would not be the last I’d receive from CIA Security about the matter, nor the only action the agency would take against us. \\nIn the spring of 1995, a former manager of Robin’s discreetly pulled her aside and said that CIA Security agents were asking questions about us, talking to every single person with or for whom either of us had worked. I seemed to be the special focus of their attention, and the last question they asked our friends, colleagues, and former managers was, “Do you believe Pat Eddington would allow his conscience to override the secrecy agreement he signed?”'"}, "time": 1742563840.670576}