{"duration": 0.03808879852294922, "input_args": {"text": "'Four counties in the state of Oregon have declared sanctuary status, saying they will not enforce the universal background checks which Democrats heaved upon the state in 2015. [The law requires all gun sales —  retail or private —  to be conducted via the auspices of a Federal Firearms License holder (FFL).  When the law took effect in August 2015 it immediately placed a strain on those charged with enforcing it and a number of sheriffs in the state quickly made known that it would not be a priority for their departments. The Statesman Journal quoted Polk County Sheriff Bob Wolfe saying, “Right now, I don’t know if I even have enough people to enforce it. We’ll have to evaluate it on a case by case basis until we can get some staff on and figure out if we even have the resources to really deal with it. ” KTVZ reports that since then “four counties have passed a measure known as the Second Amendment Preservation ordinance. ” This ordinance declares that the sheriffs of the four counties are not obligated to enforce the gun control measure. And “commissioners in Malheur, Union and Lake counties” have all heard proposals for the same ordinance during recent weeks. Gun control advocate Penny Okamoto says counties are not allowed to take such action because of Oregon’s preemption law. Because of this, she says the ordinance barring enforcement of gun control is “largely very symbolic. ” But Coos County’s Rob Taylor —  a chief proponent of Second Amendment Preservation ordinances —  begs to differ. He wants Oregon to have “sanctuary counties” where the Second Amendment is free from gun control enforcement in much the same way that the state “has become a sanctuary state for immigration. ” AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742628424.3023524}