{"duration": 0.031537532806396484, "input_args": {"text": "'The editor of Think Progress, the publication of the progressive Center for American Progress, slammed Audi on Sunday for pandering to feminists by airing a Super Bowl ad advocating gender pay equality while its board of directors is all male. [“Audi, new champion of women’s equity at work, has no women on their board,” editor Judd Legum wrote on Twitter:  Audi, new champion of women’s equity at work, has no women on their board pic. twitter.   —   Judd Legum (@JuddLegum) February 6, 2017,  No women sit on Audi’s Management Board, but its   team of American executives includes two women. Legum was not alone in his criticism of the ad 25 percent of the comments on the ad across social media were negative, Business Insider reports. The ad begins with a father watching his daughter in a race, asking himself, “What do I tell my daughter?” “Do I tell her that her grandpa is worth more than her grandma? That her dad is worth more than her mom?” the narrator asks. The father wonders how he can tell his daughter that despite “her education, her drive, her skills, her intelligence,” she still runs the risk of “being valued less than every man she ever meets. ” At the end, his daughter wins the race, and she and her father walk to an Audi right before the slogan “progress is for everyone” flashes across the screen. The company decided to make a statement about gender pay equality on Twitter by saying, “At Audi, we are committed to equal pay for equal work. ” Despite what Audi claims in the ad, the gender pay gap is not wide. According to the Daily Beast, the   gender pay gap is merely the difference between the average earnings of all men and women working fulltime. The statistic does not take into account factors such as differences in occupations, positions, education, job tenure, or hours worked per week. Once those factors are included, the wage gap is only a   difference, and no one knows whether the cause is discrimination or some other    difference between the genders.'"}, "time": 1742562551.8795843}