{"duration": 0.13816404342651367, "input_args": {"text": "'Posted on October 27, 2016 by Dr. Eowyn | 10 Comments \\nIf we go by most of the MSM/corporate polls, Hillary Clinton will win on November 8. \\nBut there are dissenting voices. Among them is Dilbert cartoonist Scott Adams , who’s still predicting a 98% chance of not just a Trump win, but a landslide. Interestingly, the dissenters also include a flaming leftist — docu-maker Michael Moore. \\nMoore is loathsome, but I don’t think anyone has captured or articulated the reasons why so many Americans resonate to Trump’s anti-globalism as well as Moore. \\nBelow is an excerpt from a recent speech Moore delivered, followed by my transcription: \\n“I know a lot of people in Michigan that are planning to vote for Trump…. They don’t necessarily like him that much and they don’t necessarily agree with him. They’re not racists and rednecks certainly; they’re actually pretty decent people. And so I wanted to, after talking to a number of them, I wanted to write this. \\nDonald Trump came to the Detroit Economic Club and stood there in front of the Ford Motor executives and said, ‘If you close these factories you’re planning to do in Detroit and build them in Mexico, [when I’m President] I’m going to put a 35% tariff on those cars when you send them back and nobody’s gonna buy them.’ \\nIt was an amazing thing to see. No politician, Republican or Democrat, had ever said anything like that to these executives, and it was music to the ears of people in Michigan and Ohio and Pennsylvania, in Wisconsin, the Brexit states. You live here in Ohio, you know what I’m talking about. \\nWhether Trump means it or not is kind of irrelevant because he’s saying the things to people who are hurting. That’s why every beaten-down, nameless, forgotten working stiff — what used to be part of what was called the middle class — loves Trump. He is the human Molotov cocktail that they’ve been waiting for, the human hand grenade that they can legally throw into the system that stole their lives from them. And on November 8th, Election Day, although they lost their jobs, although they’ve been foreclosed on by the bank, next came the divorce, and now the wife and kids are gone, the car’s been repo’ed, they haven’t had a real vacation in years, they’re stuck with the shitty Obamacare plan when you can’t even get a fucking [inaudible]. They’ve essentially lost everything they had, except one thing. The one thing that doesn’t cost them a cent and is guaranteed to them by the American Constitution — the right to vote. \\nThey might be penniless, they might be homeless, they might be fucked over and fucked up. It doesn’t matter because it’s equalized on that day. A millionaire has the same number of votes as the person without a job — one. And there’s more of the former middle class than there are in the millionaire class. \\nSo on November 8th, the dispossessed will walk into the voting booth, be handed a ballot, close the curtain and take that lever or felt pen or touchscreen and put a big fucking X in the box by the name of the man who is threatening to upend and overturn the very system that has ruined their lives: Donald J. Trump. \\nThey see that the elites who ruined their lives hate Trump. Corporate America hates Trump. Wall Street hates Trump. The career politicians hate Trump. The media hates Trump, after they loved him and created him and now hate him. Thank you, media. \\nThe enemy of my enemy is who I’m voting for on November 8. Yes, on November 8, you, Joe Blow, Steve Blow, Bob Blow, Billy Blow, Billy Bob Blow — all the Blows get to blow up the whole goddamn system because it’s your right. Trump’s election is going to be the biggest fuck-you ever recorded in human history, and it will feel good.” \\nPerversely, after articulately so beautifully the profound alienation of so many Americans and why Trump speaks for them, Michael Moore then proceeded to make a whole-hog defense and endorsement of Hillary Clinton. \\nHere’s a screenshot from a video showing “Jabba the Hut” Michael Moore making the speech you heard and read above. \\nWhat if Trump loses? \\nBelow are excerpts from a powerful essay, “ The Elite ‘Have No Idea’— Society is Near the Breaking Point ,” written by a guy who calls himself Chindit13 for ZeroHedge : \\n“What I find most surprising today is that the insiders and the elite have no idea what is percolating just beneath the surface . Okay, maybe their arrogance actually produces its own fog, so it should not come as a surprise that they are blinded. They do not look at the calendar, which, if one really looks, says ‘1788’ on it. Something is close. Very close. Society is near the breaking point. \\nMy own experience is that Hillary’s so-called Deplorables are actually the most reserved, most polite, and most honest demographic in the country . They are more informed, more self-reliant, and among other things, better armed. Regarding their arms, they are incredibly responsible, and not the source of the violence for which the implement, and not the person, is too often blamed. The Deplorables have the longest fuse. It is, however, a fuse. […] \\nThe Deplorables, however, are not possessed of infinite patience. Like a capacitor, there is a charge building, and at some point it will be released into the circuitry of society. \\nThe media and other insiders believe themselves to be immune. That thought no doubt results from being immersed inside a cocoon where dissonant voices are not allowed. When the levee breaks, or the capacitor releases its charge, they are going to be gob smacked. \\nPrecious few of them are anywhere near as immune as they believe themselves to be. Additionally, what they might think, or hope, is their support, their security, their safe space, doesn’t really exist. \\nMost of society’s guardians, whether they are law enforcement or military, are card-carrying members of the Deplorables. \\nFrance was similarly constructed in the late 1780s. The elite were isolated only in thought, not in reality. Their protection was of a Potemkin Village nature: not actually there, but merely a facade that gave them false comfort. \\nThey paid dearly for their arrogance and ignorance. \\nHistory may not repeat, but it does rhyme. The calendar really does seem to say 1788, so 1789—and 1792–are not as far off as some would like to believe. \\nThis is not a call to arms, but it is a call to reality. Ignore it at your own peril. \\nSome may see these words as a threat. They are not. They are, however, a warning, and a warning from someone who is a student of history. \\nEvery society eventually reaches a breaking point. Ours is nearly there. Some of those who might feel threatened, the so-called elite and insiders, think that they can buy protection as easily as they can buy a Gulfstream. How naïve! Who are the private security contractors? Who are the various SOGs? Like law enforcement and the rest of the military, they are the Deplorables. The Deplorables will take your money, but you will not take their lives. Better said, they won’t give up their lives for you or your family. The security you believe you have purchased is an illusion. Make that delusion. Best to get that out front here and now. \\nSome might think this is all Trump’s fault. Again, that shows a degree of ignorance and naïveté which characterizes the elite. Trump is a symptom, not a cause. He might even be a salve, as the changes he could bring might defuse some of the current anger. \\nOn the other hand, Hillary is a lit match in a room of dynamite. She, like many of the self-important, thinks her very existence is a favor to the rest of us. She epitomizes the absolute worst of what America has become. Above the law, wealthy not through accomplishment, but through influence peddling only, and a bull in a china shop in terms of her effect on both the country and the world—and I apologize to bulls for that analogy. The world is more unstable because of her. \\nAmerica is less safe because of her. Russia and the US—the two largest nuclear powers—are more at odds because of her. With her in power, we will reach the breaking point at home and internationally, perhaps leading to ‘accidental’ nuclear war, as the heightened rhetoric impacts clear thinking. Society is more stratified because of her. Race relations have deteriorated because of her (and Obama). \\nThere are few current ills in society and in geopolitics that cannot be laid at her feet, at least to some extent. The Great Deceiver to many, who exhibits an astonishing aversion to truth telling, is enough to make even an agnostic wonder if the anti-Christ hasn’t finally arrived for its three and a half years of rule. \\nA recently hacked email of John Podesta finds him saying ‘she (Hillary) has begun to hate everyday Americans’. No doubt the same feelings were voiced by [Romania dictator] Nicolas Ceaucescu. It turned out the feeling was mutual. […] \\nElect Hillary, and continue with business as usual, and it is likely this warning will become an epitaph for the America we know. Society may collapse regardless, because the rot is already very great, but she will hasten the day of reckoning. […]” \\nSee also:'"}, "time": 1742562041.457312}