{"duration": 0.19763946533203125, "input_args": {"text": "'Las frases “off the record” de Suárez durante la entrevista no emitida con Victoria Prego HA CONFESADO QUE FUE ÉL QUIEN COLOCÓ A KODRO EN EL BARÇA Victoria Prego \\nLa publicación de una entrevista que el expresidente de España, Adolfo Suárez, concedió en 1995 a Antena 3 ha revelado que usó una triquiñuela legal para evitar un referéndum sobre la monarquía. Esta trascendental información ha eclipsado el resto de declaraciones del documento recuperado, que son tanto o más graves. \\nEstos son algunos de los extractos más impactantes de la entrevista. \\n“Había una posibilidad real de que la ciudadanía votara en contra de la Casa Real. Y eso no podía ser, por una razón que no te puedo contar. (Se tapa el micro) Mira, éramos muy colegas. La primera vez que (ininteligible) a Sofía, fue conmigo”. \\n“¿Hay un maletín mío por ahí? El gris. El que tiene un revólver dentro”. \\n“Perdona Victoria, hago un paréntesis para aclarar una cosa que no te puedo contar. (Se tapa el micro) Cuando he dicho antes que, cuando el Rey le puso (ininteligible) a Sofía fue conmigo, no me refiero a que lo hiciera conmigo, no sé si me explico… Vamos, que yo no (ininteligible). Por ahí jamás (ininteligible) nadie. Sin embargo, el Rey (ininteligible) . Sí, por eso mismo”. \\n“Mi labor como Director general de Radiodifusión y Televisión se caracterizó por las acertadas decisiones que tomé. A ver, hay algunas cosillas, pero no te las puedo decir. (Se tapa el micro) Lo de Iñaki. Te habrán llegado voces. Esa no es su voz. Contratamos a un ventrílocuo, Iñaki solo movía los labios (se tapa la mano que tapa el micro) Por un lado está Iñaki y por otro lado está su voz, son cosas distintas”. \\n“¿Hay una riñonera mía, por ahí? La de cuero. La que tiene una navaja ensangrentada”. \\n“Fue entonces cuando sugerí la creación de los Premios Ondas, pero eso es un tema que no quiero tratar. (Se tapa el micro) ¿Tú quieres uno, Victoria? Yo te consigo un Ondas. Los premios TP no, yo ahí no pinto nada, pero Ondas, los que quieras”. \\n“La unidad de España es un tema que me preocupa mucho, y así lo transmití durante mi mandato. Diálogo y respeto con todas las comunidades. Y no me tires más de la lengua. (Se tapa el micro) Menos con Cataluña. Es que no puedo con los catalufos… Sólo te digo una cosa: yo fui el que les colocó a Kodro en el Barça”. \\n“¿Esto para qué cadena es? Antena 3… Ah, muy bien, muy bien. Tengo muy buena relación con el director de la cadena. Ayer mismo tuvimos una conversación que no puedo revelar. (Se tapa el micro) Le dije: pon Los Simpson a todas horas. A la gente le gusta la gente amarilla. Mira los chinos, son muy divertidos. Así rellenas horas de programación y todo eso que te ahorras en sueldos”. \\n“La televisión debe ofrecer calidad y variedad siempre. Siempre. En eso soy tajante. (Se tapa el micro) Ja ja ja, es mentira. Acabo de hablar con Netflix y les he dicho que no hace falta que pongan pelis nuevas. La gente va a pagar igual”. \\n“¿Hay una mariconera mía, por ahí? La negra. La que tiene cloroformo dentro”. \\n“Sí, claro que hay ciertos periódicos que han criticado mi gestión, pero en eso se basa la libertad de expresión. (Se tapa el micro) A ver lo que publicas, ¿eh, Victoria? No me hagas llamar otra vez a Exuperancia”. \\n“El cine español goza de una gran salud, gracias a la creatividad y a la independencia de nuestros directores. De casi todos, claro, pero no quiero dar nombres. (Se tapa el micro) Santiago Segura. Le dije: haz más torrentes, que a mi sobrino le gustan mucho”. \\n“No me gusta hablar de mi vida privada, pero créeme: no tengo nada que ocultar. (Se tapa el micro) A ver, como a todo el mundo, me gusta divertirme. (Ininteligible) ¡Deberías llamarte Torbe! Ja ja ja”. \\n“Mi labor era conducir al país a la democracia, siempre desde la ley, claro. Cierto es que me tomé algunas licencias, pero no te las puedo explicar. (Se tapa el micro) Lo de Felipe. Le dije: mi cuñado es encofrador. Si quieres cal… (ininteligible) Eso puede con todo (ininteligible) Por encima un poco y ya está”. \\n“Las nuevas tecnologías son el futuro. Hay que estar atentos a ver hacia dónde nos llevan. (Se tapa el micro) ¿Tienes ordenador? Pues adivina de quién fue la idea de que el navegador predeterminado sea Internet Explorer (Guiña un ojo) .” \\n“Amo la democracia por encima de todo. Y en eso, nadie me puede cuestionar nada. (Se tapa el micro) Pero bueno, que tuve un buen trabajo durante el franquismo, eso es así. (ininteligible) De él sólo se ha contado lo malo. (ininteligible) Extraordinaria placidez”. \\n“Me gusta mucho estar al día en temas de informática. Me gusta programar páginas web, pero eso pertenece al ámbito privado. (Se tapa el micro) La web de RENFE la he programado yo, enterita. (ininteligible) En dos horas la he hecho (ininteligible) Netscape, claro”. \\n“¿Hay un macuto por ahí? El beige, el que tiene el aguilucho bordado”. \\n“En el 23F tiré de agallas. Sabía que si me mostraba débil, el Golpe triunfaría. Pero es un tema que mejor no remover. (Se tapa el micro) Me oriné encima. Si te fijas, cuando Tejero forcejea con Gutiérrez Mellado, se puede ver cómo Calvo Sotelo me ofrece sus pantalones y nos los intercambiamos”. \\n“Tejero era un títere, no sabía muy bien qué estaba haciendo allí. Aun así, había que tratarle con cautela. Sí, charlamos durante el Golpe, pero es una conversación que no aporta nada. (Se tapa el micro) Voy y le digo: “La pistola cuando se saca es pa disparar, el que la saca pa enseñarla es un parguela”. \\n“El 23F no estaba preparado por las altas esferas. Eso es rotundamente falso. Ni yo ni nadie imaginaba qué iba a ocurrir. Y zanjemos ya el tema de una vez. (Se tapa el micro) Ahora, una cosa te digo: en los ensayos quedó mejor”. \\n“El papel del Rey durante el golpe de Tejero fue fundamental. Fundamental. Él salvó España aquella noche desde Zarzuela. Pero no estoy autorizado a revelar secretos de Estado. (Se tapa el micro) El mensaje estaba grabado desde el aeropuerto de Barajas. Parece su despacho, pero es McDonald’s de la Terminal 1. En cuanto le dieron la noticia, hizo las maletas con la intención de ir a Londres, a casa de Sofía. Lo divertido es que se olvidó a Elena en Palacio. De ahí saqué la idea del guión de ‘Solo en Casa’, que posteriormente vendí a Hollywood”. \\n“Odio la corrupción política. Jamás, jamás, he usado mi cargo privilegiado para conseguir nada. (Se tapa el micro) Otra cosa es que, en una conversación casual con gente poderosa pues haya dicho que me gustaría que le pusieran mi nombre al aeropuerto de Barajas”. \\n“¿Hay un saco de tela mío, por ahí? El marrón, el que tiene el símbolo del dólar bordado”.'"}, "time": 1742563894.2888663}