{"duration": 0.049118757247924805, "input_args": {"text": "'At a press conference on Wednesday, NASA announced the “Parker Solar Probe,” which will be sent on a mission to examine and research the Sun up close. [The mission, which is being launched next year, “will gather data about the sun’s outermost atmosphere known as the corona where temperatures can reach up to 500, 000C, much higher than those in the sun’s core,” according to The Telegraph, and is named after astrophysicist Eugene Parker.  “This is the first time NASA has named a spacecraft for a living individual,” said Thomas Zurbuchen, associate administrator for NASA’s Science Mission Directorate in Washington. “It’s a testament to the importance of his body of work, founding a new field of science that also inspired my own research and many important science questions NASA continues to study and further understand every day. I’m very excited to be personally involved honoring a great man and his unprecedented legacy. ” Eugene Parker himself also expressed excitement about the mission, declaring, “I’m sure there will be some surprises. There always are. ” “The solar probe is going to a region of space that has never been explored before,” he explained. “It’s very exciting that we’ll finally get a look. One would like to have some more detailed measurements of what’s going on in the solar wind. ” Nicola Fox, a scientist involved with the Parker Solar Probe project, claimed that the probe “is going to answer questions about solar physics that we’ve puzzled over for more than six decades. ” “It’s a spacecraft loaded with technological breakthroughs that will solve many of the largest mysteries about our star, including finding out why the sun’s corona is so much hotter than its surface,” she claimed. “And we’re very proud to be able to carry Gene’s name with us on this amazing voyage of discovery. ” According to NASA’s official website, “NASA missions are most often renamed after launch and certification. ” “In this case, given Parker’s accomplishments within the field, and how closely aligned this mission is with his research, the decision was made to honor him prior to launch, in order to draw attention to his important contributions to heliophysics and space science,” they declared. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742561968.6879163}