{"duration": 0.07145547866821289, "input_args": {"text": "'Donate Whose Fake News Gets a Pass? NYT Advocates Internet Censorship The New York Times wants a system of censorship for the Internet to block what it calls “fake news,” but the Times ignores its own record of publishing “fake news” By Robert Parry / consortiumnews.com \\nIn its lead editorial on Sunday, The New York Times decried what it deemed “The Digital Virus Called Fake News” and called for Internet censorship to counter this alleged problem, taking particular aim at Facebook founder Mark Zuckerberg for letting “liars and con artists hijack his platform.” \\nAs this mainstream campaign against “fake news” quickly has gained momentum in the past week, two false items get cited repeatedly, a claim that Pope Francis endorsed Donald Trump and an assertion that Trump was prevailing in the popular vote over Hillary Clinton. I could add another election-related falsehood, a hoax spread by Trump supporters that liberal documentarian Michael Moore was endorsing Trump when he actually was backing Clinton. \\nBut I also know that Clinton supporters were privately pushing some salacious and unsubstantiated charges about Trump’s sex life, and Clinton personally charged that Trump was under the control of Russian President Vladimir Putin although there was no evidence presented to support that McCarthyistic accusation. \\n\"The problem is that while some falsehoods may be obvious and clear-cut, much information exists in a gray area in which two or more sides may disagree on what the facts are. And the U.S. government doesn’t always tell the truth although you would be hard-pressed to find recent examples of the Times recognizing that reality.\" \\nThe simple reality is that lots of dubious accusations get flung around during the heat of a campaign – nothing new there – and it is always a challenge for professional journalists to swat them down the best we can. What’s different now is that the Times envisions some structure (or algorithm) for eliminating what it calls “fake news.” \\nBut, with a stunning lack of self-awareness, the Times fails to acknowledge the many times that it has published “fake news,” such as reporting in 2002 that Iraq’s purchase of aluminum tubes meant that it was reconstituting its nuclear weapons program ; its bogus analysis tracing the firing location of a Syrian sarin-laden rocket in 2013 back to a Syrian military base that turned out to be four times outside the rocket’s range; or its publication of photos supposedly showing Russian soldiers inside Russia and then inside Ukraine in 2014 when it turned out that the “inside-Russia” photo was also taken inside Ukraine, destroying the premise of the story. \\nThese are just three examples among many of the Times publishing “fake news”– and all three appeared on Page One before being grudgingly or partially retracted, usually far inside the newspaper under opaque headlines so most readers wouldn’t notice. Much of the Times’“fake news” continued to reverberate in support of U.S. government propaganda even after the partial retractions. \\nWho Is the Judge? \\nSo, should Zuckerberg prevent Facebook users from circulating New York Times stories? Obviously, the Times would not favor that solution to the problem of “fake news.” Instead, the Times expects to be one of the arbiters deciding which Internet outlets get banned and which ones get gold seals of approval. \\nThe Times lead editorial, following a front-page article on the same topic on Friday, leaves little doubt what the newspaper would like to see. It wants major Internet platforms and search engines, such as Facebook and Google, to close off access to sites accused of disseminating “fake news.” \\nThe editorial said, “a big part of the responsibility for this scourge rests with internet companies like Facebook and Google, which have made it possible for fake news to be shared nearly instantly with millions of users and have been slow to block it from their sites. … \\n“Facebook says it is working on weeding out such fabrications. It said last Monday that it would no longer place Facebook-powered ads on fake news websites, a move that could cost Facebook and those fake news sites a lucrative source of revenue. Earlier on the same day, Google said it would stop letting those sites use its ad placement network. These steps would help, but Facebook, in particular, owes its users, and democracy itself, far more. \\n“Facebook has demonstrated that it can effectively block content like click-bait articles and spam from its platform by tweaking its algorithms, which determine what links, photos and ads users see in their news feeds. … Facebook managers are constantly changing and refining the algorithms, which means the system is malleable and subject to human judgment.” \\nThe Times editorial continued: “This summer, Facebook decided to show more posts from friends and family members in users’ news feeds and reduce stories from news organizations, because that’s what it said users wanted. If it can do that, surely its programmers can train the software to spot bogus stories and outwit the people producing this garbage. … \\n“Mr. Zuckerberg himself has spoken at length about how social media can help improve society. … None of that will happen if he continues to let liars and con artists hijack his platform.” \\nGray Areas \\nBut the problem is that while some falsehoods may be obvious and clear-cut, much information exists in a gray area in which two or more sides may disagree on what the facts are. And the U.S. government doesn’t always tell the truth although you would be hard-pressed to find recent examples of the Times recognizing that reality. Especially over the past several decades, the Times has usually embraced the Official Version of a disputed event and has deemed serious skepticism out of bounds. \\nThat was the way the Times treated denials from the Iraqi government and some outside experts who disputed the “aluminum tube” story in 2002 – and how the Times has brushed off disagreements regarding the U.S. government’s portrayal of events in Syria, Ukraine and Russia. Increasingly, the Times has come across as a propaganda conduit for Official Washington rather than a professional journalistic entity. \\nBut the Times and other mainstream news outlets – along with some favored Internet sites – now sit on a Google-financed entity called the First Draft Coalition , which presents itself as a kind of Ministry of Truth that will decide which stories are true and which are “fake.” \\nIf the Times’ editorial recommendations are followed, the disfavored stories and the sites publishing them would no longer be accessible through popular search engines and platforms, essentially blocking the public’s access to them. [See Consortiumnews.com’s“ What to Do About ‘Fake News.’ ”] \\nThe Times asserts that such censorship would be good for democracy – and it surely is true that hoaxes and baseless conspiracy theories are no help to democracy – but regulation of information in the manner that the Times suggests has more than a whiff of Orwellian totalitarianism to it. \\nAnd the proposal is especially troubling coming from the Times, with its checkered recent record of disseminating dangerous disinformation. © 2016 Consortium News \\nRobert Parry broke many of the Iran-Contra stories in the 1980s for the Associated Press and Newsweek. His latest book, Neck Deep: The Disastrous Presidency of George W. Bush , was written with two of his sons, Sam and Nat. His two previous books are Secrecy & Privilege: The Rise of the Bush Dynasty from Watergate to Iraq and Lost History: Contras, Cocaine, the Press &\\'Project Truth\\' . 0.0 ·'"}, "time": 1742628516.890908}