{"duration": 0.04757380485534668, "input_args": {"text": "'0 Add Comment \\nTHE OUTPOURING of anger, fear and frustration in Ireland at Donald Trump’s election victory has been brought into sharper focus as people to voice to their vehement opposition to many of the things the president-elect has said and done. \\nIrish citizens were served a sharp shock last week when they woke up to learn that the country they live in had elected a man who stood for all that is wrong with the world. Countless thousands of people took to social media to admonish the billionaire, but people will be shocked to learn more can be done to avoid the tyrant-in-waiting from damaging Ireland during his 4-year term. \\nIt cannot be denied that Trump is probably the most reviled and debated person in Ireland today, with his proposed policies having a massive effect on many millions of people living here in Ireland. WWN has 5 things you can do to challenge Trump’s presidency and the legitimacy of many of his most controversial opinions and ideas. \\n1) His treatment of minorities must be stopped. Act now \\nDonald Trump, a xenophobe at heart and the source of all evil in this world, has previous when it comes to spreading hate. Not many people are aware of this fact, but Trump set up Direct Provision centres in Ireland, where asylum seekers are forced to live in a prison-like existence and live off an allowance of €19 a week. To question Donald Trump directly on this click HERE . \\n2) He is a misogynist \\nIf you found yourself irate at his ‘grab them by the pussy’ comments, you will lose your shit when you discover Trump is in charge of a number of compensation schemes operated by the Irish government, which see the women of the Magdalene Laundries and Survivors of Symphysiotomy denied their payments and justice due to a slow and dysfunctional system. Just what is it about Trump and his utter contempt for women? Don’t bother tweeting Trump directly on this one, as he’s quite busy at the moment. However, his Nobody Has More Respect For Women Than Me office can be reached HERE . \\n3) Trump thinks homelessness, specifically in Ireland, is hilarious \\nTrump has endlessly tweeted about how he enjoys the plight of Ireland’s homeless, finding the increase in the cost of property and rent to be a source of joy. What better way to get back at that orange troglodyte than by volunteering for a homeless charity. You never know, if you give whatever time, money or resources you can afford to a charity you may even get a disparaging Twitter response from the president-elect. To piss off Donald Trump click HERE . \\n4) Make Ireland Great Again \\nIreland’s 45th president is for tax breaks for the rich, ending universal insurance cover and an ill advised overhaul of the education system and so much more which could well lead to hardship for future generations. However, Ireland will hope it can safeguard previous policies of cutting social welfare for the under 25s, normalising free labour through an internship scheme, increasing the price of college education and smiling broadly at a 15% youth unemployment rate. If you’d like to urge your local representatives to make the case for changing nothing, you know where to find them.'"}, "time": 1742564261.3919532}