{"duration": 0.05687141418457031, "input_args": {"text": "'“Hundreds” of people are reportedly set to protest at Facebook CEO Mark Zuckerberg’s Hawaiian $100 million estate in response to the billionaire’s large perimeter wall and reports that locals were allegedly “harassed and intimidated by security” for walking nearby. [“In June 2016, Zuckerberg constructed a   wall along part of his property, despite protests from locals, who called it a ‘monstrosity’ and not neighborly,” wrote McClatchyDC. “Now, more than six months later, around 200 locals are expected to march in protest along the wall this Saturday. ”  Numerous locals have also “attempted to use an old trail that passes through the property, only to be harassed and intimidated by security,” according to the site. “Some have even filed police complaints. ” “Although Zuckerberg owns control over the land, he is not the only one with rights to it,” they continued. “In particular, several parcels of land, totaling less than eight acres of the 700, belong in part to families who inherited the land through the Kuleana Act, a    Hawaiian law. ” “People are furious down here with him,” said protest organizer and farmer Joe Hart. “We just want to bring this issue to light. He’s made his money stealing everyone’s information, which we’ve let him do, but to come down here and start suing everyone, that’s not going to fly down here. ” “We were walking along [a beach] and they tried to say that this was private,” Hart continued. “I’ve been walking on this since I was a little kid. ” Zuckerberg defended his Hawaiian estate in a post to Facebook last week, claiming, “There have been some misleading stories going around today about our plans in Hawaii. ” “We are working with a professor of native Hawaiian studies and long time member of this community, who is participating in this quiet title process with us,” Zuckerberg wrote. “It is important to us that we respect Hawaiian history and traditions. We love Hawaii and we want to be good members of the community and preserve the environment. We look forward to working closely with the community for years to come. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742562158.6108925}