{"duration": 0.128739595413208, "input_args": {"text": "'There Are A Lot Of Born-Again Women Who Are Closet Hillary Supporters (TWEETS) By Darrell Lucus   Hillary Clinton at the 2014 United Methodist Women Conference ( image courtesy United Methodist Women, available under a Creative Commons BY-NC-ND license) \\nFor much of the campaign, there was talk that Donald Trump’s support was a lot greater than it seemed because of a large number of closet Trump supporters–a bloc of support for the Donald that isn’t showing up in most polls. That seems hard to believe. After all, you would have thought that those secret Trump backers would have come out of hiding during Hillary Clinton’s bad week in September. Even then, Hillary never dropped below 54 percent in the FiveThirtyEight average –and Nate Silver’s model responds fairly strongly to sharp changes in good polls. \\nA much more plausible scenario comes from Lyz Lenz, a freelance writer who is also one of the embedded liberals at her evangelical church in her small Iowa town. In a revealing piece for Marie Claire, Lenz tells us that there are a considerable number of born-again women who are backing Hillary–but just keeping quiet about it. \\nIt’s not hard to see why. Hillary has been one of the religious right’s pet hates for almost three decades. This was true long before Bill Clinton was ensnared in the Monica Lewinsky scandal, for which many born-agains still haven’t forgiven him. Additionally, in much of the evangelical world, women are expected to follow their husband’s lead in virtually all matters–including politics. \\nAdd it up, and it’s no wonder that a number of evangelical Hillary supporters feel they have to stay in the closet–and even feign support for Trump. This is particularly true in red-tinted small towns across America. Lenz describes this as the “spiral of silence”–fear of being shunned when you voice an unpopular opinion. \\nLenz saw this first-hand. When she went to caucus for Hillary, she was surprised to see her friend “Melody,” the former head of a Christian non-profit and one of the most respected leaders in her town’s evangelical circle, was also heading for the Hillary section. Over the next few months, she’s met several other women in her town who are secretly backing Hillary. \\nOne of them, “Jennifer,” works at a faith-based non-profit that helps women in need. The prevailing mentality there is that the GOP is “the only acceptable choice” on election day. For that reason, she has to bite her tongue even when one of her coworkers shares nasty anti-Hillary memes on Facebook. Most of the time, she lets her colleagues believe she’s supporting Trump as well, since most evangelicals assume that “others are like them.” My girlfriend can attest to this; she once told me that when she went to her precinct at the time–a church–she mused about how everyone in line would react if they knew she was voting for Obama. \\nEven in households where both spouses back Hillary, the prospect of getting bombarded with twenty questions is enough for some women to keep their support for Hillary secret. One of them, “Susan,” has gotten in a number of knock-down, drag-out arguments with friends, co-workers, and family members who can’t understand how her husband can support Hillary. As a result, she feels she doesn’t have “the energy to go there” and reveal she supports Hillary as well. \\nFortunately, these closet Hillary voters aren’t alone. A number of private “Secret Hillary Clubs” have mushroomed on Facebook, and offer support and encouragement for Hillary supporters in fire-engine red areas. One woman in this club, “Amy,” remembers how her parents frequently called Hillary a “liar” or a “bitch” when she appeared on TV. Since she still lives near them in Ohio, she finds it “very difficult to openly support Hillary.” \\nHowever, the release of the “Access Hollywood” tapes seems to have prompted more evangelical women to speak out against Trump. For instance, one of the first evangelical leaders to blast Trump’s debauchery was author and speaker Beth Moore. She made her feelings loud and clear in an epic tweetstorm on October 9. Wake up, Sleepers, to what women have dealt with all along in environments of gross entitlement & power. Are we sickened? Yes. Surprised? NO \\n— Beth Moore (@BethMooreLPM) October 9, 2016 Try to absorb how acceptable the disesteem and objectifying of women has been when some Christian leaders don\\'t think it\\'s that big a deal. \\n— Beth Moore (@BethMooreLPM) October 9, 2016 I\\'m one among many women sexually abused, misused, stared down, heckled, talked naughty to. Like we liked it. We didn\\'t. We\\'re tired of it. \\n— Beth Moore (@BethMooreLPM) October 9, 2016 \"Keep your mouth shut or something worse will happen.\" Yes. I\\'m familiar with the concept. Sometimes it\\'s terrifyingly true. Still, we speak \\n— Beth Moore (@BethMooreLPM) October 9, 2016 \\nRussell Moore (no relation to Beth), the president of the Southern Baptist Convention’s Ethics and Religious Liberty Commission and a prominent member of the “Never Trump” crowd,” told The Daily Beast that a number of evangelical women have privately told him that they were “horrified” and disgusted how so many Christian leaders continued to rally behind Trump. Many of them, Russell Moore said, have spent years teaching girls to “find their identity in Christ and not in an American culture that sexualizes and objectifies them,” and are disgusted that their male counterparts are still backing a man who seems to be doing both. \\nIn some circles, however, the opening began long before 2016. My low-key charismatic church in Charlotte, for instance, is split almost down the middle politically; the sizable klatch of liberals there–including yours truly–don’t feel pressured to keep our views in the closet. I started dating my current girlfriend during the primaries, and she was a Bernie Sanders supporter. When I first brought her to my church, no one raised an eyebrow at her Bernie bumper sticker–or my Hillary sticker. Hopefully this is a sign that evangelical women who are leaning toward the Democrats can finally come out of the shadows. About Darrell Lucus \\nDarrell is a 30-something graduate of the University of North Carolina who considers himself a journalist of the old school. An attempt to turn him into a member of the religious right in college only succeeded in turning him into the religious right\\'s worst nightmare--a charismatic Christian who is an unapologetic liberal. His desire to stand up for those who have been scared into silence only increased when he survived an abusive three-year marriage. You may know him on Daily Kos as Christian Dem in NC . Follow him on Twitter @DarrellLucus or connect with him on Facebook . Click here to buy Darrell a Mello Yello. Connect'"}, "time": 1742562125.4971602}