{"duration": 0.02988433837890625, "input_args": {"text": "\"EDITOR'S CHOICE VonDerFront 13.11.2016 - 189 views 0 ( 0 votes) Huthi-Saleh Allianz erlangt Kontrolle über weitere Ortschaften in Saudi-Arabiens Provinz Jizan 0 out of 5 based on 0 ratings. 0 user reviews. Huthi-Saleh Allianz erlangt Kontrolle über weitere Ortschaften in Saudi-Arabiens Provinz Jizan Donate \\nDie Huthi-Saleh Allianz hat die Kontrolle über mehrere strategische Dörfer in der Region al-Khobeh übernommen und Dutzende saudische Soldaten getötet und dessen militärische Ausrüstung zerstört. \\nDie Huthi-Saleh Allianz setzte in der im Süden gelegenen Saudi-Arabischen Provinz Jizan ihre Vorstöße fort und übernahmen die Kontrolle über mehrere strategische Ortschaften in der Region al-Khobeh, berichten arabischsprachige Medien am Samstag unter Berufung des ranghohen Kommandanten der Ansarullah, Nasreddin Amer \\nLaut Ameri verlor das saudische Militär Soldaten im zweistelligen Bereich und Dutzende flohen nach den 12 Stunden andauernden Kämpfen mit der Allianz. Er fügte hinzu, dass “sechs Infanterie-Kampffahrzeuge vom Typ Bradley und zwei Kampfpanzer des Typs Abrams der saudischen Armee zerstört wurden, während weitere militärische Ausrüstung der saudischen Streitkräfte durch die jemenitischen Truppen in Brand gesetzt worden”. \\nIn der vergangenen Woche wurden Saudi-Arabiens Militärbasen in den Provinzen Assir, Jizan und Najran von der Artillerie der Huthi-Saleh Allianz beschossen, was zu erheblichen Verlusten unter dem saudischen Truppen führte. \\nLaut Berichten attackierten jemenitische Kämpfer und ihre Verbündeten saudische Truppen im nördlichen Teil der Midi-Wüste nahe der Ortschaft al-Mousem in der Provinz Jizan. Die im Süden des Königreiches gelegene saudische Militärbasis Mosan sowie der Grenzübergang Manfaz in der Provinz Assir wurden von der Allianz ebenfalls attackiert. Als Folge der Angriffe wurde eine große Anzahl von saudischen Soldaten getötet. Zwei gepanzerte Fahrzeuge des saudischen Militärs wurden von der Huthi-Saleh Allianz am Grenzübergang al-Khazra zerstört. Alle Mitglieder der Besatzung wurden getötet. \\nAnfang November berichtete die Webseite al-Ahad des 60 % der Bewohner von Siedlungen nahe der Grenze zum Jemen von Grenzsoldaten des Königreichs evakuiert worden waren. Nach Angaben des Oberbefehlshabers der al-Arezeh-Grenzwachen in der Provinz Jizan, Leutnant Ali al-Amri, wurde die Evakuierung auf Anordnung von Hochrangigen saudischen Beamten durchgeführt. \\nDonate\""}, "time": 1742628389.1509972}