{"duration": 0.06368708610534668, "input_args": {"text": "'Chinese J-20 stealth fighter debuts in skies of Zhuhai November 01, 2016 China unveils its J-20 stealth fighter on an air show in Zhuhai, Guangdong Province, China, November 1, 2016. China Daily/via REUTERS \\nChina publicly debuted the Chengdu J-20 stealth fighter on Tuesday, a 21st century comparable to the US F-22 and F-35 fighter jet. J-20 was shown at Airshow China in southern city of Zhuhai. J-20’s swept over dignitaries, hundreds of spectators and industry executives gathered at the show\\'s opening ceremony. Chinese President Xi Jinping has pushed to toughen the armed forces amid South China Sea row. Bradley Perrett of Aviation Week: \"It is clearly a big step forward in Chinese combat capability.” State-owned Commercial Aircraft Corporation of China (COMAC) estimates Chinese market will need 6,865 new aircraft worth $930 billion over the next 20 years. Boeing Co and Airbus Group matched the COMAC forecast: China would make up almost 1/5 of global demand, 40,000 planes over the next two decades. Analysts: Brief and relatively cautious J-20 routine answered few questions, pilots did not open weapon bay doors, or perform low-speed passes. Sam Roggeveen, a senior fellow at the Sydney-based Lowy Institute: \"It\\'s a change of tactics for the Chinese to publicly show off weapons that aren\\'t in full squadron service yet and demonstrates a lot of confidence in the capability, and also a lot of pride.\" Also displayed: Latest Chinese weapon systems, radar and drones, included the Xian Y-20 strategic airlifter, and what organizers say is the largest amphibious plane now in production - the AG600. 150-seater COMAC C919 passenger jet was absent from the airshow schedule. COMAC: China Eastern Airlines will be the launch customer for the C919, which may take first test flight late 2016 or early 2017. COMAC secured 23 new orders for C919 at Airshow, taking total orders to 570. \\n(ZHUHAI, CHINA) China showed its Chengdu J-20 stealth fighter in public for the first time on Tuesday, opening the country\\'s biggest meeting of aircraft makers and buyers with a show of its military clout. \\nAirshow China, in the southern city of Zhuhai, offers Beijing an opportunity to demonstrate its ambitions in civil aerospace and to underline its growing capability in defense. China is set to overtake the U.S. as the world\\'s top aviation market in the next decade. \\nTwo J-20 jets, Zhuhai\\'s headline act, swept over dignitaries, hundreds of spectators and industry executives gathered at the show\\'s opening ceremony in a flypast that barely exceeded a minute, generating a deafening roar that was met with gasps and applause and set off car alarms in a parking lot. \\nExperts say China has been refining designs for the J-20, first glimpsed by planespotters in 2010, in the hope of narrowing a military technology gap with the United States. President Xi Jinping has pushed to toughen the armed forces as China takes a more assertive stance in Asia, particularly in the South China and East China seas.'"}, "time": 1742561666.294448}