{"duration": 0.06664228439331055, "input_args": {"text": "'With the United Nations designating 2017 as the International Year of Sustainable Tourism for Development, there has never been a better time to be more environmentally conscious when traveling. And, it’s not hard to do, according to Costas Christ, the director of sustainability for the luxury travel network Virtuoso. “Being greener on vacation doesn’t take a lot of effort or mean sacrificing pleasure,” he said. Below, Mr. Christ’s top tips on traveling green: Book Hotels With Green Practices  Many properties include green efforts on their websites, or you can ask the concierge or reservations department about the hotel’s green programs. “It could be an extensive recycling program, using LED lighting or having power systems that expend less energy,” he said. Two of his favorite properties with a green footprint include the Brando in French Polynesia, which is operated on renewable energy, and Three Camel Lodge in Mongolia, which composts its kitchen waste for use in a solar greenhouse producing fresh ingredients for the restaurant. Carry a Reusable Shopping Bag Traveling with a reusable bag is a way to avoid contributing to plastic bag pollution, a significant concern in many parts of the world. Use the bag to carry the souvenirs you buy on your trip. Locals will welcome it, too. Mr. Christ said that when he was buying fruit at a roadside stand in Belize in January, the vendor thanked him for bringing his own bag and told him it saves her money because she has to buy fewer bags for her shoppers, and it makes for less litter, too. Say ‘No’ to Plastic Water Bottles They are readily and inexpensively available, but the waste from plastic bottles clogs up landfills and pollutes the ocean. Mr. Christ advised either taking a reusable bottle from home or asking your tour operator or hotel for one and refilling it with purified water. Transportation Can Be Green, Too. Relying on biking or walking to explore your destination helps the environment because both create minimal carbon emissions. They also give the traveler a better sense of place. If you’re flying to your destination, use a reputable carbon offset provider, like MyClimate, a nonprofit group that supports   projects, and pick nonstop flights versus connections  —   fewer flights mean fewer carbon emissions. Also, go for a   rental car, an option with many companies today. Hertz, for example, has the Green Traveler Collection, a fleet of hybrid cars that are affordable to rent. Eat Local Enjoying meals that emphasize local ingredients, Mr. Christ said, means fewer fossil fuels are involved because they didn’t travel far to reach your plate. Also, he suggested avoiding shrimp. “Unless otherwise specified, a lot of shrimp comes from aquaculture ponds bulldozed out of tropical mangrove forests,” he said. “Basically, the environment was destroyed to produce that shrimp. ”'"}, "time": 1742564613.736638}