{"duration": 0.12924480438232422, "input_args": {"text": "'Diabetes is one of the most rampant diseases of our time. According to the American Diabetes Association, in 2012, 29.1 million Americans, or 9.3% of the population, had diabetes. [1] \\n\\nIn fact, diabetes is growing at a fairly fast rate. A study completed by the CDC & Research Triangle Institute concluded that If recent trends in diabetes prevalence rates continue linearly over the next 50 years, future changes in the size and demographic characteristics of the U.S. population will lead to dramatic increases in the number of Americans with diagnosed diabetes. [2] \\n\\nAccording to the current mainstream approach, the major goal in treating diabetes is to minimize any elevation of blood sugar (glucose) without causing abnormally low levels of blood sugar. Type 1 diabetes is treated with insulin, exercise, and a diabetic diet. Type 2 diabetes is treated first with weight reduction, a diabetic diet, and exercise. [3] Currently the belief is “Diabetes is a chronic disease that has no cure.”– The American Diabetes Association. \\n\\nBut what if we could not only prevent diabetes before it happened, but also reverse it once it shows up? \\n6 Test Subjects Reverse Diabetes In 30 Days \\nIn the film Simply Raw: Reversing Diabetes in 30 Days, six test subjects were used, all of whom had varying lifestyles and conditions but were all diabetic- five type 2, and one type 1. Each subject was taking insulin. \\n\\nBefore we get into the results of this film, let’s take note of what is established about type 1 and type 2 diabetes. This information is from The National Diabetes Education Program: \\n\\nType 1 diabetes – the body does not make insulin. Insulin helps the body use glucose from food for energy. People with type 1 need to take insulin every day. \\n\\nType 2 diabetes – the body does not make or use insulin well. People with type 2 often need to take pills or insulin. Type 2 is the most common form of diabetes. \\n\\nThe participants of the program were as follows: \\n-Austin (age 25) was not only a type 1 diabetic, but he also had a drinking problem. -Kirt (age 25) had a blood sugar reading of 1200. Normal is below 100. His doctor told him, “You should be dead.” -Bill (age 58) was seeing a cardiologist and had neuropathy. He could not feel his feet. -Michelle (age 36) was quite obese. -Henry (age 58) took insulin plus 9 pills daily. Blood sugar was at 464. -Pam (62) was quite obese. Her father, brother and sister are also diabetic. \\nThe Method \\nThe approach Gabriel Cousens takes to cure people of diabetes is all about changing their diet. He states that research shows that in terms of health, meat eaters have 4 times more breast cancer, 3.6 times more prostate cancer, 4 times more diabetes, and much more in general chronic disease. If you’re just having milk, that’s 3 times more leukemia. [4] \\n\\nGiven his position on diet, he believes in taking a mainly raw approach to eating and consuming a plant based diet. His team prepares raw, well-balanced and whole meals for the test subjects throughout the 30 day period. The food becomes their medicine. \\n\\nWith medical supervision, all of the subjects took their medication as needed and ate the food that is provided to them by Gabriel and his team at the Tree Of Life Rejuvenation Center. \\nResults \\nBy Day 3 of the program Kirt, Bill and Henry were able to stop taking insulin and medication. Their blood sugar levels had already dropped to the normal range after just 3 days of changing their diet. Pam was able to cut her insulin intake by 1/3. Austin, the type 1 diabetic, was able to cut his insulin intake down to half. And Michelle saw her blood sugar at around 362. This discouraged her to the point where she didn’t want to stay in the program any longer, although she did. \\n\\nBy day 12 of the program, Henry’s blood sugar had dropped 256 points compared to day 1. He was not using medication to lower his blood sugar levels. Although he was seeing great results, Henry felt he was too old for the program and requested to go home. His family arrived on day 17 and he went home. By that time, he was no longer taking 17 medications, he had lost 30 pounds and his blood pressure had decreased. In Henry’s case, his addiction to the food he used to eat was too difficult to overcome. \\n\\nBy the very last day, day 30, incredible results were seen that intensely challenges the current belief that diabetes has no cure. \\n-Kirt no longer needed medications. His blood sugar had dropped 214 points to as low as 73 (normal) without medication. It was later found out he was type 1 diabetic since the beginning. Status : Within normal range. -Bill stopped taking 19 medications and lost 32 pounds. His blood sugar dropped 214 points to 74 (normal) without medication or insulin. Status : Within normal range. -Michelle stopped taking all of her medications and lost 23 pounds. Her blood sugar dropped from 291 to 109 without the use of medication. Status: Within normal range. -Pam lost 26 pounds while her blood sugar dropped 167 points down to 112 without medication. Status: Within normal range. -Austin, who is type 1 diabetic, lost 20 pounds and reduced his insulin from 70 units down to 5. Status: Drastic improvement in diabetic condition. \\n\\nAs you can see, all participants had drastic turn-arounds in their health and all had their diabetes either completely reversed or severely under control. A type 1 diabetic (Kirt) had his diabetes completely cured -something that is considered impossible. All type 2 diabetics no longer needed insulin. \\nWhat Does This Tell Us? \\nLike many things in modern medicine, we don’t have all of the answers and in a lot of cases we have a difficult time admitting that what is currently mainstream isn’t always the best course of action. \\n\\nPeople everywhere are taking alternate routes to achieve results equal to and sometimes better than what is made available to them through mainstream voices like doctors and government appointed professionals. I feel it’s important that people know their options and have a fair chance of hearing them out. I know many people with diabetes who aren’t aware of the power of food in transforming their condition yet are taking insulin and following mainstream ideas as if it’s the only truth. \\n\\nIt isn’t to say that the mainstream is bad, it’s simply that we are missing out on other options in a big way. After all, the American Diabetes Association makes claims about there being no cures yet the above results would suggest there is more to that story. \\n\\nHave you ever tried raw food to cure your diabetes? We are curious to hear some real live results from others.'"}, "time": 1742561835.135042}