{"duration": 0.04727768898010254, "input_args": {"text": "'Britney Spears strives mightily to be   on “Glory,” her ninth studio album. But Ms. Spears has plenty of back story she’s a    working mother, the headliner in her own Las Vegas spectacle and a performer who has weathered teenage fame, backlash, public meltdowns and wave after wave of tabloid headlines. “Glory,” her first album since 2013, is her latest attempt to reclaim her place on the pop charts, which are now crowded with younger performers who have studied her the way Ms. Spears studied Madonna. Her latest strategy is relentless and unambiguous: Stick to sexy. Ms. Spears’s albums in the 2000s, like “Blackout” and “Femme Fatale,” showed that she and her advisers know something about the dynamics of celebrity and media, as she toyed with provocation and selective revelation. Hits like “I’m a Slave 4 U” and “Toxic” teased at the power dynamics of lust and romance. But “Glory” has shallower aims it’s all   and promises of pleasure, as if the only intimacies that matter are physical ones. “To know each other   your love all over me,” she coos in “Invitation,” the breathy, Janet    Glass enticement that opens the album. For songwriting and production, Ms. Spears drew from the talent pool that also supplies material for her pop peers and rivals, among them Selena Gomez, Nick Jonas, Fifth Harmony, Demi Lovato and, yes, Madonna. Her vocal producer, Mischke, has a résumé stretching from Michael Jackson and the Spice Girls to Gwen Stefani. Unlike Will. i. am, the producer who filled Ms. Spears’s 2013 album “Britney Jean” with   clichés, her new collaborators make musical space for her. They look toward the melting tones, echoey hollows and   constructions of recent releases by Ms. Gomez and Justin Bieber. Heavy bass lines and kick drums are all but banished, perhaps to return in remixes. Instead, syncopations are sketched in the midrange by handclaps, keyboard chords, electronic plinks or bits of guitar. The album’s peppiest song, “What You Need,” matches a track that sounds like     Motown to a vocal that flaunts its electronic warbles. Throughout the album, Ms. Spears’s voice  —   no doubt still processed, but far less obviously robotic  —   has emphatically returned to the foreground. In verses, she recalls the flirty singer, with the knowing scratch in her   voice, who conquered 1990s pop. She sounds more involved, more present, than she has in a decade. Choruses, like those in “Make Me  …   ” sometimes layer her voice into an ecstatic choir. Yet even with her voice upfront, Ms. Spears isn’t singing anything particularly personal. “Glory” is one long, often catchy, announcement of availability. Ms. Spears declares “nobody should be alone if they don’t have to be” in the   “Do You Wanna Come Over?” “Slumber Party,” which eases into a   chorus, promises, “We ain’t gonna sleep tonight. ” In “Love Me Down,” she says, “You say we don’t talk any more  ’m thinking we talk too much,” preferring communication by touch. A song on the deluxe version of this album, “Change Your Mind (No Seas Cortés),” sets out to seduce a guy who is “trying to be a gentleman” and doesn’t want to “cross the line” by urging, in Spanish, “don’t be polite,” adding “I’m   desperate. ” And often, behind the sleek electronics and the tidy vocals, a certain desperation comes through. “Just Luv Me,” one song, begs. Ms. Spears’s previous album, “Britney Jean,” was her commercial nadir, and the singles preceding the release of “Glory”  —   “Make Me. .. ” and “Pretty Girls,” a collaboration with Iggy Azalea that’s not on this album  —   weren’t smashes. Another preview, “Private Show,” was introduced alongside a new perfume of the same name. It casts the singer as a stripper: “Slide down my   me spin it and twerk it. ” Working for others, the songwriters behind “Glory” have come up with other messages, particularly for female singers. Teen pop now abounds with   messages of doubts overcome, of pride, of confidence, of empowerment that doesn’t depend on pleasing a guy. Ms. Spears, with turbulent decades of experience, might connect her life with her songs, as divas do, and find herself forging a stronger bond with listeners. But “Glory” doesn’t make that reach. It’s as if, after all her fans and fame, Ms. Spears can still only present herself as that most generic pop commodity: a sexpot.'"}, "time": 1742628594.7773948}