{"duration": 0.1327071189880371, "input_args": {"text": "'US impunity erodes world justice By Nicolas J S Davies Posted on October 27, 2016 by Nicolas J S Davies \\nIn the past week, Burundi and South Africa have joined Namibia in declaring their intention to withdraw from the jurisdiction of the International Criminal Court (ICC). They are likely to be followed by a parade of other African countries, jeopardizing the future of an international court that has prosecuted 39 officials from eight African countries but has failed to indict a single person who is not African. \\nIronically, African countries were among the first to embrace the ICC, so it is a striking turnaround that they are now the first to give up on it. \\nBut it is the United States that has played the leading role in preventing the ICC from fulfilling the universal mandate for which it was formed, to hold officials of all countries accountable for the worst crimes in the world: genocide; crimes against humanity; and war crimes—not least the crime of international aggression, which the judges at Nuremberg defined as “the supreme international crime” from which all other war crimes follow. \\nAs the ICC’s founding father, former Nuremberg prosecutor Benjamin Ferencz, lamented in 2011 , “You don’t have to be a criminologist to realize that if you want to deter a crime, you must persuade potential criminals that, if they commit crimes, they will be hauled into court and be held accountable. It is the policy of the United States to do just the opposite as far as the crime of aggression is concerned. Our government has gone to great pains to be sure that no American will be tried by any international criminal court for the supreme crime of illegal war-making.” \\nThe U.S. has not only refused to accept the jurisdiction of the ICC over its own citizens. It has gone further, pressuring other countries to sign Bilateral Immunity Agreements (BIA), in which they renounce the right to refer U.S. citizens to the ICC for war crimes committed on their territory. \\nThe U.S. has also threatened to cut off U.S. aid to countries that refuse to sign them. The BIAs violate those countries’ own commitments under the ICC statute, and the U.S. pressure to sign them has been rightly condemned as an outrageous effort to ensure impunity for U.S. war crimes. \\nResistance to U.S. impunity \\nTo the credit of our international neighbors, this U.S. strategy has met with substantial resistance. The European Parliament overwhelmingly passed a resolution stating that BIAs are incompatible with E.U. membership, and urged E.U. member states and countries seeking E.U. membership not to sign them. \\nFifty-four countries have publicly refused to sign BIAs , and 24 have accepted cut-offs of U.S. aid as a consequence of their refusal. Of 102 countries that have signed a BIA , only 48 are members of the ICC in any case, and only 15 of those countries are on record as having ratified the BIAs in their own parliaments. \\nThirty-two other ICC members have apparently allowed BIAs to take effect without parliamentary ratification, but this has been challenged by their own country’s legal experts in many cases. \\nThe U.S. campaign to undermine the ICC is part of a much broader effort by the U.S. government to evade all forms of accountability under the laws that are supposed to govern international behavior in the modern world, even as it continues to masquerade as a global champion of the rule of law. \\nThe treaties that U.S. policy systematically violates today were crafted by American statesmen and diplomats, working with their foreign colleagues, to build a world where all people would enjoy some basic protections from the worst atrocities, instead of being subject only to the law of the jungle or “might makes right.” \\nU.N. Convention on the Rights of the Child and other multilateral treaties that our country ignores, violates or refuses to ratify. \\na billion dollars per year on public relations or, more bluntly, propaganda, including $600 million from the Pentagon budget. The work of its P.R. teams and contractors is laundered by U.S. newspapers and repeated and analyzed ad nauseam by monolithic, flag-waving TV networks. \\n“information warfare” machine presents the United States as a global leader for democracy, human rights and the rule of law, even as it systematically and catastrophically undermines those same principles. It enables our leaders to loudly and persuasively demonize other countries and their leaders as dangerous violators of international law, even as the U.S. and its allies commit far worse crimes. \\nsimilar assault on Mosul . Both attacks are killing civilians and reducing much of a city to rubble; the rationale is the same, counterterrorism; and there are many more people in the line of fire in Mosul than in east Aleppo. \\nU.N. Charter to attack at least eight countries (Yugoslavia, Afghanistan, Iraq, Pakistan, Yemen, Somalia, Libya and Syria), and the resulting wars have killed about two million people . \\nate new interventions and escalations as if we are the fire brigade not the arsonists. (By contrast, the U.S. government and the Western media are quick to accuse Russia or other countries of “aggression” even in legally murky situations, such as after the U.S.-backed coup in 2014 that ousted the elected president of Ukraine.) \\nare an integral part of U.S. war-making. Most are shrouded in secrecy, and the propaganda machine spins the atrocities that slip through into the public record as a disconnected series of aberrations, accidents and “bad apples,” instead of as the result of illegal rules of engagement and unlawful orders from higher-ups. \\nhis Nobel lecture to speak about the real role that the U.S. plays in the world and how it whitewashes its crimes. Pinter recounted a meeting at the U.S. Embassy in London in the 1980s in which a senior embassy official, Raymond Seitz, flatly denied U.S. war crimes against Nicaragua for which the U.S. was in fact convicted of aggression by the International Court of Justice (ICJ). Seitz went on to serve as Assistant Secretary of State, U.S. Ambassador to the U.K., and then vice-chairman of Lehman Brothers. \\nnducted throughout the world. It was never-ending. And it is as if it never happened. \\n“The United States supported and in many cases engendered every right-wing military dictatorship in the world after the end of the Second World War. I refer to Indonesia, Greece, Uruguay, Brazil, Paraguay, Haiti, Turkey, the Philippines, Guatemala, El Salvador, and, of course, Chile. The horror the United States inflicted upon Chile in 1973 can never be purged and can never be forgiven. \\n“Hundreds of thousands of deaths took place throughout these countries. Did they take place? And are they in all cases attributable to US foreign policy? The answer is yes they did take place and they are attributable to American foreign policy. But you wouldn’t know it. \\n“It never happened. Nothing ever happened. Even while it was happening it wasn’t happening. It didn’t matter. It was of no interest. The crimes of the United States have been systematic, constant, vicious, remorseless, but very few people have actually talked about them. You have to hand it to America. It has exercised a quite clinical manipulation of power worldwide while masquerading as a force for universal good. It’s a brilliant, even witty, highly successful act of hypnosis.” \\nIf in 2016 the world seems to be more violent and chaotic than ever, it is not because the United States lacks the will to use force or project power, as both major party candidates for president and their military advisers appear to believe, but because our leaders have placed too much stock in the illegal threat and use of force and have lost faith in the rule of law, international cooperation and diplomacy. \\nAfter a century of commercial dominance, and 75 years of investing disproportionately in weapons, military forces and geopolitical schemes, perhaps it is understandable that U.S. leaders have forgotten how to deal fairly and respectfully with our international neighbors. But it is no longer an option to muddle along, leaving a trail of death, ruin and chaos in our wake, counting on an elaborate propaganda machine to minimize the blowback on our country and our lives. \\nSooner rather than later, Americans and our leaders must knuckle down and master the very different attitudes and skills we will need to become law-abiding global citizens in a peaceful, sustainable, multipolar world. \\nNicolas J S Davies is the author of “Blood On Our Hands: the American Invasion and Destruction of Iraq.” He also wrote the chapters on “Obama at War” in “Grading the 44th President: a Report Card on Barack Obama’s First Term as a Progressive Leader.” Commentary . Bookmark the permalink .'"}, "time": 1742628402.596124}