{"duration": 0.05518007278442383, "input_args": {"text": "'. Soros-Funded Anarcho-Terrorists Plotting to Overthrow the US Government Dave Hodges from The Commonsense Show interviewed Mike Adams a few days ago about how the radical vi... Print Email http://humansarefree.com/2016/11/soros-funded-anarcho-terrorists.html Dave Hodges from The Commonsense Show interviewed Mike Adams a few days ago about how the radical violent left plans to destroy the coming Trump administration and overthrow the Republic to put their own criminal cronies into power. The video, which is embedded below (and also available at this link ), is a nearly one hour discussion of the tricks and tactics that will be invoked by the criminal left ( the Clintons, Obama, George Soros, John Podesta, etc. ) to try to nullify the outcome of the election and seize power in Washington. The discussion covers the truth of how Hillary Clinton had planned to arrest, silence or execute all the conservatives in the media in order to eliminate opposition and create a one-party state run as a totalitarian leftist regime. But \"alt media\" truth overcame the lies of the mainstream media, and the People marched to the ballot box to end the Clinton nightmare for America once and for all. Soros now funding left-wing terrorist groups that seek to overthrow the government Now, international anarcho-terrorist money man George Soros is funding domestic terrorism , [through] organizations like MoveOn.org and Black Lives Matter to try to stage a leftist uprising that they hope will result in the mass murder of white people and conservatives. Their ultimate goal is to march on Washington and overthrow the legitimate government , but as I explain in this interview, the activation of the Second Amendment will stop them in their tracks. Listen to this stunning interview to learn why American patriots are prepared to defend the Republic at all costs, including challenging leftist anarcho-terrorists with kinetic engagement to defend America against their attempted communist coup. The is a MUST-LISTEN interview for those who want to know what\\'s next in this battle for liberty and the Republic: References: Natural News ; Common Sense Show  '"}, "time": 1742562272.0412834}