{"duration": 0.1691572666168213, "input_args": {"text": "'  \\nIn between nearly daily campaign stops shilling for Hillary, President Barack Obama has been promoting his record as Head of State. To Obama’s credit, he talks nice and appears to be both thoughtful and rational, qualities that were not always evident in his predecessor in office. But the hype about what was achieved in his eight years appears to be more than a bit overblown, particularly if one considers the flagship domestic project, Obamacare. It is a program in which the government forces individuals to buy a product that has been crafted together by private, for profit companies. If the people do not buy, they will be penalized by the government. The companies in turn have learned that it is tough to make money insuring people who are actually sick so they are leaving the program while those individuals who have to buy their own coverage without government subsidies are discovering that the significant annual price increases mean that they cannot afford insurance at all. Donald Trump is right that the program is in crisis, is “over,” and should be repealed. \\nAgainst that, what has Obama accomplished domestically? I will not consider the constant pandering on gender and race because that is, after all, what Democrats do. But if one considers immigration a part of domestic policy, he is responsible for refusing to enforce immigration law, letting Haitians stay illegally in the U.S. as compensation for a hurricane that occurred in 2010, while also failing to deport whole categories of Hispanics who are in the country without visas or residency permits. Domestic would also include the continuation of several types of surveillance of citizens by the NSA and FBI, the hounding and prosecution of whistleblowers, and the increased reliance on the State Secrets privilege to derail the use of the judicial system to pushback against government overreach. And in a just concluded parole hearing involving a Guantanamo detainee who had been repeatedly tortured, the Obama Administration has now determined that some individuals can be held in prison forever without ever being charged with a crime or convicted. \\nBut it is in the foreign and national security policy areas that Obama has been most visibly active as he has a relatively free hand based on what he considers to be his own “unitary executive” authority. In his famous Cairo speech delivered to the Muslim world in 2009 he promised change but basically did not deliver, though there have actually been several successes in foreign policy that date to the past year. He should get full credit for confronting the Israel Lobby and Congress (essentially the same thing) to obtain a nuclear program agreement with Iran. Likewise, he went against the Cuban Lobby and GOP in Congress (also essentially the same thing) to ease relations with Havana. He still might do the right thing by the Palestinians and allow the U.S. to recognize their statehood at the United Nations later this month or even support the French plan for a multinational conference to create a Palestinian state but I wouldn’t want to bet on it, particularly as the incoming Administration headed by Hillary Clinton will be firmly in the Israeli pocket and Obama would presumably defer to her before doing anything dramatic. \\nAnd Obama should also get credit for some things that he didn’t do. He did not exacerbate tensions with Russia by arming Ukraine with game changing offensive weapons in spite of intense pressure from Congress and the media and he did not get involved in a new land war involving tens of thousands of American soldiers in Asia even though some of his advisers were urging him to do so in Syria. But by the same measure starting yet another war by proxy, in Libya, was a complete failure, though it did not involve American boots on the ground. It was a war that might in part be attributed to the aggressive advocacy of Hillary Clinton, who was Secretary of State at the time. \\nAnd while it should also be recalled to Obama’s credit that he made no effort to maintain a troop presence in Iraq, he was unable to extricate U.S. forces from America’s longest war in Afghanistan, which continues and is likely to be on the presidential agenda for the next decade or even longer. Nor could he dissuade the Saudis from initiating their brutal and senseless war on Yemen, which has had devastating consequences with more to come for the entire region. And President Obama has also failed to closed Guantanamo prison in spite of promises made eight years ago to do so. \\nPresident Obama has also changed the actual mechanics of America’s intervention in the world, using drones and aerial bombardment instead of soldiers on the ground to enforce Washington’s diktat. A Pentagon press release in September boasted how over Labor Day weekend U.S. warplanes attacked targets in six countries. The United States was not at war with any of them. And then there is Anwar al-Awlaki and his son, American citizens who were executed in Yemen by drone without any legal process, by executive order, after they were placed on a “kill list” compiled by the White House. \\nBut Obama’s poorest grades relate to his handling of Russia, Syria and Israel, all three of which might plausibly be seen as linked issues as Secretary Clinton once commented that Syria’s government would have to be brought down to benefit Israel while Russia is Syria’s most important ally. The problem with Syria is the policy itself. The only serious direct threat emanating from the country is ISIS, which has the capability to send suicide bombers and other dedicated terrorists to strike targets in the United States and Europe. To be sure, Washington is operating against ISIS, providing intelligence, equipment and training to its proxies and the “moderate” rebels that it supports in the country, but the effort is a mish mash, involving as it does feckless allies and clashing loyalties. The Pentagon and CIA have meanwhile been training batches of dubious recruits, some of whom turn their weapons over to the crazies at first opportunity. The Defense Department deflected completely accurate charges that it was supporting terrorists by changing the names of the groups involved. Amid the chaos, President Obama has even conceded that there are no moderate rebels. \\nDefeating ISIS would be relatively simple if everyone were on the same page, but the White House persists in seeing the removal of Syrian president Bashar al-Assad as the top priority, as if creating a power vacuum in Damascus would be a solution to what ISIS has been doing. And pressuring al-Assad also creates and feeds the ongoing problems with Russia. As the beltway groupthink goes, Syria minus al-Assad and Vladimir Putin would magically become a place where all the moderate, nation-building and democratically inclined forces would be able to come together and form a new government that would immeasurably benefit the Syrian people. \\nThat formulation is, of course, complete nonsense and it is Moscow that has a clear understanding of what is at stake, not Washington. The reality is that creating a power vacuum is precisely what provides the opportunity for militant groups to settle in and expand their authority. It is how al-Qaeda and ISIS both came into prominence. It happens because, as in Iraq and Libya, the Washington interventionists have no idea what might succeed as a post-civil war political system in Syria. Nor do they have any real plan for achieving a functioning polity. \\nU.S. administrations have already tried decapitation of existing leadership in Afghanistan, Iraq and Libya with catastrophic results but one of the delights of the American political system is that all the key policy players change every four to eight years meaning that lessons learned are lost and have to be discovered a second time around, repeating as necessary. That regime change would work any better in Syria defies belief but it is nevertheless what Washington chooses to believe and by seeing al-Assad as an enemy it is hampering the effort against ISIS’s most effective asset: the Syrian Army backed up by Russian air support. \\nAnd then there is Israel. Israel is, according to many Congressmen and the media, America’s best friend and greatest ally. It is a judgment that also defies belief as Tel Aviv and more particularly its Prime Minister Benjamin Netanyahu have been persistently pursuing policies that are nominally opposed by the United States government, most particularly the expansion of its settlements. It has also interfered in U.S. internal politics during elections and did not hesitate to exploit political divisions in Congress when Netanyahu was invited by GOP leaders to speak to a joint session to provide his perception of President Obama’s “misguided” negotiations with Iran. Israel is no friend of the United States even if it does receive an annual handout currently running at in excess of $3 billion and unlimited political cover in international bodies. Obama reportedly hates Netanyahu but did not have the courage to do anything about him. \\nSo the Obama record is a mixed bag, but mostly a disappointment. His presidency will be somewhat untouchable by those who do retrospectives, as least for a while, protected by Obama’s status as America’s first black president. It would have been nice to see real health care reform, a backing off from police state norms in the war on terror, and less lethal engagement in other people’s quarrels overseas, but I suppose Obama would argue that GOP obstruction and the Establishment consensus caused him to support policies and engage in compromises that he really wanted to avoid. There may be some truth to that but ultimately Obama comes across as yet another morally deficient head of state who presumably saw the folly in the status quo but ultimately decided that loyalty to his party and dedication to its continuation in power was more important than doing what was right. Ultimately, the acquisition of money and power are everything in our system of government and the brief trajectory of Barack Hussein Obama is no exception to that rule.'"}, "time": 1742563143.2623305}