{"duration": 0.03476595878601074, "input_args": {"text": "'Administrators at UC Berkeley have reversed their decision on Thursday afternoon to cancel an upcoming lecture by Ann Coulter. [However, Berkeley now wish to move the date of her appearance from April 27 to May 2, in a week when there are no classes at the college. Coulter has rejected the proposed change, and plans to speak on the original date as planned.  In addition to facts: We’ve already spent $ for   Berkeley spc  I can’t do May 2  …    THERE ARE NO CLASSES AT BERKELEY THE WEEK OF MAY 2! !!  —   Ann Coulter (@AnnCoulter) April 21, 2017,  Following violence that occurred at several political protests, Berkeley administrators announced on Wednesday that they had elected to cancel Coulter’s upcoming visit for the sake of protecting student safety. Coulter said in an email to The Washington Post on Wednesday that the university had been “imposing ridiculous demands” on the event but that she and the UCB College Republicans still agreed “to all of their silly requirements. ” She said she believes that her speech “has been unconstitutionally banned” by the “public,    . ” “They just up and announced that I was prohibited from speaking anyway,” Coulter said, noting that her speech topic was to be immigration, the subject of one of her books. “I feel like the Constitution is important and that   university should not be using public funds to violate American citizens’ constitutional rights. ” Despite the administration’s decision to cancel the event, Coulter announced that she would plan to speak anyway. “What are they going to do? Arrest me?” she said late Wednesday on the Fox News show “Tucker Carlson Tonight. ” UC Berkeley\\u200b shuts down . @AnnCoulter\\u200b’s planned speech. Ann: I AM giving the speech. What will they do? Arrest me? pic. twitter.   —   Tucker Carlson (@TuckerCarlson) April 20, 2017,  Berkeley spokesman Dan Mogulof fired back at critics who claimed that the school was stripping Coulter of her right to speak at the public university, arguing that the event was canceled to protect the safety of the speaker and the members of the Berkeley community. “Everything we’re doing is so the speaker and students can actually exercise their rights without disruption,” UCB spokesman Dan Mogulof said. “It’s unfortunate that there are people who think the university’s efforts to keep students and the speaker herself safe are ‘silly.’ ” “It has nothing to do with anyone’s political views. We believe in unqualified support to the First Amendment. But we also have an unqualified focus on safety of our students,” Mogulof said. “We are going to be making a concerted effort to explain the reasons behind this. ” Berkeley professor Robert Reich, who has previously served the Secretary of Labor under President Bill Clinton, condemned administrators for canceling Coulter’s event. “This is a grave mistake,” Reich said in a Facebook post. He said universities should “do everything possible to foster and protect” free speech, writing that students should be allowed to hear Coulter’s arguments and question them. “It’s one thing to cancel an address at the last moment because university and local police are not prepared to contain violence.   …     It’s another thing entirely to cancel an address before it is given, when police have adequate time to prepare for such eventualities,” he added. On Thursday, administrators claimed that they had found a venue where Coulter could hold her event on campus. The event’s date was moved from the originally scheduled date, April 27, to May 2. An administrator claimed that Coulter’s plan to speak on campus regardless forced him to search for “appropriate, protectable venue. ” UPDATE: Ann Coulter says she will not accept the changed date, and will speak at Berkeley on April 27 as originally planned. GOOD NEWS FOR CA TAXPAYER! You won’t be required to pay $$$$ to compensate me  my crew for rebooked airfare  hotels. I’m speaking on  . https:  .   —   Ann Coulter (@AnnCoulter) April 20, 2017,  I’m speaking at Berkeley on April 27th, as I was invited to do and have a contract to do. https:  .   —   Ann Coulter (@AnnCoulter) April 20, 2017,  Tom Ciccotta is a libertarian who writes about economics and higher education for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com'"}, "time": 1742628437.330934}