{"duration": 0.14640045166015625, "input_args": {"text": "'film , deutschland und russland Der neue Film des Regisseurs Alexei Misgirew zeigt Russland im 19. Jahrhundert. Sankt Petersburg sprach damals schon Deutsch. Quelle:Kinopoisk.ru \\nAlexei Misgirews Film „Duellant“ (The Duelist) stieß schon während der Produktion auf große Resonanz in der internationalen Filmindustrie. Seine Weltpremiere feierte der Streifen schließlich auf dem Toronto Film Festival. Eine Kooperation mit IMAX ermöglicht nun seinen Verleih in den USA und einigen anderen Ländern. Bis zu diesem Erfolg hatte Misgirew in Russland den Ruf eines „Regisseurs der zweiten Reihe“. Seine Filme kamen alle nur in den begrenzten Verleih, wo sie ein Publikum von wenigen Tausend Zuschauern erreichten. Jetzt realisierte Misgirew zusammen mit dem Produzenten Alexander Rodnianski („Jayne Mansfield’s Car“, „Cloud Atlas“, „Leviathan“) eines der größten Projekte der Geschichte des neueren russischen Kinos. \\n„The Duelist“ ist ein in den 1860er-Jahren spielendes Kostümdrama über einen Auftragsmörder. Der Held des Films, der Offizier Jakowlew, duelliert sich stellvertretend für andere. Aus unerklärlichen Gründen kann ihn keine Kugel töten, und so gewinnt er jeden seiner Zweikämpfe. Vor dem Start des internationalen Verleihs sprach Misgirew mit RBTH über seinen neuen Film. RBTH: Bisher waren Sie im Autorenfilm mit kleinem Budget zuhause. Wie geht es Ihnen jetzt als Regisseur eines Films, der für die Verhältnisse der russischen Filmindustrie richtig teuer ist? \\nAlexei Misgirew: Das werde ich oft gefragt. Anfangs hat mich diese Frage aus dem Konzept gebracht. Ich wusste keine Antwort, weil ich selbst keinen großen Unterschied gemerkt habe. Natürlich hatten wir bei den Dreharbeiten für „The Duelist“ keine finanziellen Probleme, zum Beispiel mit den Requisiten und Kostümen. Wir haben dort gedreht, wo wir es wollten, ohne an irgendeiner Ausstattung sparen zu müssen. Was aber den Prozess selbst betrifft, gab es keinen Unterschied zu meinen anderen Projekten. Ich habe meine Arbeitsweise nicht geändert und mich niemandem untergeordnet. Das ist überhaupt das oberste Prinzip von Alexander Rodnianski in seiner Zusammenarbeit mit Regisseuren – sich nicht in den kreativen Prozess einzumischen und Kompromisse zu finden. Wir standen dauernd im engen Austausch über bestimmte Fragen, es gab aber keinerlei Vorgaben. Uns war beiden klar, dass es im Film Serienproduktionen und Einzelproduktionen gibt. Und „The Duelist“ ist eine Einzelproduktion, für die Individualität und filmischer Autorenstil besonders wichtig sind; neben einer spannenden Geschichte und einem zeitgemäßen visuellen Konzept. \\nDer Regisseur Alexei Misgirew. Foto: Ekaterina Chesnokova/RIA Novosti Ihre früheren Arbeiten hatten alle einen sehr sozialkritischen Charakter und erzählten aus dem Leben im heutigen Russland. Und hier tauchen wir in eine Welt der Bälle, Kostüme, Duelle und Adeligen in Camisolen ein. Woher das Interesse an dieser Epoche? \\nDas Budget für „The Duelist“ betrug 16,5 Millionen US-Dollar, rund 15,1 Millionen Euro. Jeder Regisseur des Autorenfilms wünscht sich ein Millionenpublikum. Wenn er aber nur ein bis zwei Millionen US-Dollar ausgeben kann, wird er kaum einen bildgewaltigen und spektakulären Film drehen können. Natürlich will er es, es ist aber aus objektiven Gründen nicht möglich. So ist das Interesse an der Gegenwart zu erklären. Teilweise ist es erzwungen, weil es keinen großen Aufwand für teure Kulissen und Computereffekte erfordert.\\nDie Idee für „The Duelist“ kam mir vor einigen Jahren. Sie lag als schriftliche Notiz von nicht mehr als zwei Absätzen einfach in einer Schublade. Und plötzlich machte es „Klick“– und ich wusste, dass ich mein Vorhaben jetzt realisieren musste. Und obwohl es bis zu seiner Umsetzung noch ein langer Weg war, wusste ich irgendwie, dass meine größten Probleme in diesem Fall nicht finanzieller Art sein würden. \\nEine Szene aus dem Film \"The Duelist\". Bild: kinopoisk.ru Welche Probleme meinen Sie? \\nSie betreffen das 19. Jahrhundert, und um genau zu sein: das Bild, das die audiovisuelle Kunst dieser Epoche geprägt hat. Während meiner Vorarbeiten für „The Duelist“ habe ich unzählige Quellen über diese Zeit durchforstet. Ich stellte fest, dass wir überhaupt nichts darüber wissen. Tatsächlich redeten, aßen, tranken und kleideten sich die Leute ganz und gar nicht so, wie wir landläufig denken. Der Zuschauer von heute assoziiert mit dem 19. Jahrhundert Geschichten aus der Mottenkiste und ehrwürdige Dramen aus dem Provinztheater. Ich wollte diese Stereotype aufbrechen und die Zeit so zeigen, wie es noch niemand vor mir getan hat – schrill, brutal und mit Verweisen auf die Gegenwart. Das war natürlich unglaublich viel Arbeit, aber die hat mich nicht abgeschreckt. Vielmehr haben mich die möglichen Reaktionen der Zuschauer auf diesen neuen Stil im Rückblick auf alte Zeiten beunruhigt. Hier werden tradierte Muster radikal in Frage gestellt. \\nIm Film von Misgirew erscheint Sankt Petersburg als grau, schwarz und schmutzig. Bild: kinopoisk.ru Bezogen auf sein visuelles Konzept wurde „The Duelist“ schon mehrfach mit Guy Ritchies „Sherlock Holmes“ und Pitofs „Vidocq“ verglichen. Gefallen Ihnen diese Parallelen? \\nSolche Vergleiche sind zulässig. Hier werden allerdings sehr artifizielle Filme herangezogen, echte Genre-Werke. „The Duelist“ hat aber doch einen etwas anderen Zuschnitt, unter anderem wenn wir über sein visuelles Konzept sprechen. \\nDie schöne Fürstin Marfa Tutschkowa (l.) wird zur Geliebten des Duellants. Bild: kinopoisk.ru Im Zusammenhang mit „The Duelist“ werden Sie immer wieder nach dem Motiv der Ehre befragt, das sich wie ein roter Faden durch den Film zieht. Sie antworten erwartungsgemäß, Ehre sei eine zeitlose Idee. Die Geschichte verweise daher zwangsläufig auf die Gegenwart. Man hat aber den Eindruck, dass der Fatalismus, der alle Helden auszeichnet, in Ihrem Film nicht weniger bedeutend ist. Die Betonung der unausweichlichen Verbindungen der Figuren mit ihrem Schicksal ist wohl kein Zufall? \\nJa, das ist ein weiteres wichtiges Motiv dieses Films. Während meiner intensiven Beschäftigung mit Geschichten über Duelle bin ich auf ein sehr beeindruckendes Detail gestoßen: Im Heimatland der Duelle, in Frankreich, hatten diese im 19. Jahrhundert praktisch keine Bedeutung mehr. Gleiches lässt sich auch von viele anderen Ländern sagen. Der Grund war die Verbreitung der Schusswaffe, die den tödlichen Ausgang des Kampfes weitaus wahrscheinlicher machte als der Degen, und die Chancen der Gegner einander anglich. In Russland ließ gerade das die Kultur der Duelle aufblühen. Ich denke, das hängt mit dem Fatalismus zusammen, der bis heute eines der markantesten Merkmale der russischen Mentalität ist. „Held oder Verderben“– das ist eine sehr russische Entgegensetzung, selbst wenn es um Leben und Tod geht. Und genau darum geht es in „The Duelist“. RBTH-Check: \\nIn „The Duelist“ wird viel deutsch gesprochen. In zwei wichtigen Rollen – denen des deutschen Barons und Duellanten-Vermittlers sowie der Großfürstin Alexandra Iosifowna – sind mit Martin Wuttke und Franziska Petri deutsche Filmstars zu sehen. Alle Rechte vorbehalten'"}, "time": 1742563363.3339443}