{"duration": 0.07045364379882812, "input_args": {"text": "'  \\nHey, we’ve all been there. You make a judgment call at work, it blows up in your face and you go home humiliated and stewing. Only in James Comey’s case, you’re the director of the FBI, and you may have just wrongfully influenced the presidential election with a single baffling mistake. “Whoops” doesn’t cover it. \\nComey set off a firestorm of controversy with the release of an open letter to Congress, letting them know that the FBI would be “reopening” the case into Hillary Clinton’s emails, despite clearing her of any wrongdoing several months ago. Republicans handled the news with something approaching orgasmic ecstasy. Finally , they thought, Hillary Clinton is going down and Trump’s double digit polling deficit can be erased . \\nTrump himself seemed to believe this letter was the key to victory. Less than an hour after it was spread around the internet, Trump was boldly claiming it to be “bigger than Watergate”– a statement as ludicrous as it was premature. \\nWithin two hours, the entire new story fell apart. The emails were not sent by Hillary Clinton. They were not stored on her private server. They appeared to contain no incriminating information. Despite the lack of any story, the media ran with it. Republican hacks like Speaker of the House Paul Ryan were breathlessly demanding Clinton lose her right to classified briefings. Trump’s campaign manager was taking a victory lap. Conservatives were saying this proved Clinton was a crook. \\nAll of it was nonsense. And nobody seemed to realize how crazy this reaction was than Comey himself, who reportedly sent a second letter that day, this time to his staff, basically saying “I fucked up. I’m so sorry.” FBI Dir. Comey sent a second letter today – to FBI employees. He seems to have some doubts about what he did (via WashPost) pic.twitter.com/IagFJRZYyU \\n— West Wing Reports (@WestWingReport) October 29, 2016 \\nComey seemed to understand what many critics had been saying all day: This email announcement was misleading and pointless, and gave Republicans a ton of free ammunition in their disingenuous fight against Hillary Clinton. It’s unclear just how much it would affect the election, but the very fact that it could affect the election was a serious issue. The FBI, as a rule, is not supposed to use their department to sway voters. Comey, whether intentionally or not, was doing just that. \\nThe fact that Comey had these misgivings and still sent his first letter raises serious questions about his judgment. As a lifelong Republican (albeit one who has distinguished himself as a man of strong integrity with respect on both sides of the aisle), one has to wonder if he would have been so flippant in publishing a letter that would wrongfully damage the campaign of a Republican candidate. \\nIronically, it is the question raised around Comey which seem more pressing for the national interest than a few new emails found on a computer not used by Hillary Clinton. Let’s hope we get some answers. \\nFeatured image via Win McNamee/Getty Images Share this Article!'"}, "time": 1742562293.4359157}