{"duration": 0.06089377403259277, "input_args": {"text": "'Comments \\nIn exactly one week from today, millions of Americans will join a mass exodus to various polling places around the nation to select new city and state officials, mayors, judges, sheriffs, congressional representatives, and of course the next President of the United States. \\nHowever, some find themselves locked out of the process not from a lack of desire to participate, but because they have responsibilities as parents and can not find the time, or the resources, to leave their offspring alone so that they may go to the ballot box. \\nWith lines at some polling stations reaching up to 5 to 8 hours during the primary a few months ago, in Arizona for example, voting can be rightly seen as out of reach for those who have more to do than stand around chewing the fat with their neighbors while they wait for their turn to pull a lever. \\nThe YMCA has offered to do their part to help alleviate some of this inconvenience by offering free child car services on election day. The USA President and CEO of the YMCA, Kevin Washington, issued this decree : \\n“Election Day is arguably one of the most important days in the U.S. this year — the ultimate opportunity for Americans to make their voices heard through the democratic process. Unfortunately, many people who want to vote find it challenging because they have to take children with them. The Y’s hope is that Zoe’s Kids Day Out initiative enables those parents and caregivers to exercise their right to vote, and ensures children can spend their time in a safe, nurturing environment. \\nNow not every single YMCA location across the nation is offering this fantastic service, so please be sure to check with your local chapter beforehand. \\nWhile the YMCA deserves applause and recognition for their commitment to furthering American democracy through inclusion, what they are offering is a band-aid to a systemic problem. \\nTo correct this issue entirely the American people deserve election day to be a national holiday. Sen. Bernie Sanders (D-VT) proposed a bill to create “Democracy Day” which would codify into law the right for all Americans to have a day off to vote. Presently there are no legal requirements for employers to give their employees time off to vote, although hundreds of large corporations have voluntarily allowed their workers time to vote without fear of penalty or repercussion, but this is not enough. \\nOnly around 54% of eligible voters turned out to polling places in 2012, and that cannot be entirely blamed on voter apathy, but also on the reality that many do not have the time or resources to cast a ballot despite their deep desire to do participate in the democratic process. The American people deserve better, and our government must do more to ensure that everyone who wishes to vote has the ability to do exactly that.'"}, "time": 1742563676.7722583}