{"duration": 0.08294272422790527, "input_args": {"text": "'More than two decades before he died on Sunday at age 53, George Michael was publicly struggling with the trappings of fame. And when he spoke out about his concerns about the nature of celebrity, Frank Sinatra pulled out his stationery and responded. A 1990 story by The Los Angeles Times focused on Mr. Michael’s refusal to promote his music by making videos which, at the height of MTV, was a risky move at best, and career suicide at worst. “I’m not stupid enough to think that I can deal with another 10 or 15 years of major exposure,” Mr. Michael said at the time. “I think that is the ultimate tragedy of fame. ” He added: “People who are simply out of control, who are lost. I’ve seen so many of them, and I don’t want to be another cliché. ” Mr. Sinatra, who was then in his   and had experienced the ups and downs of celebrity, gently admonished the younger star in a letter that appeared in The Los Angeles Times a week later. The letter was later published by the online museum Letters of Note. “Come on, George,” Mr. Sinatra wrote. “Loosen up. Swing, man. Dust off those gossamer wings and fly yourself to the moon of your choice and be grateful to carry the baggage we’ve all had to carry since those lean nights of sleeping on buses and helping the driver unload the instruments. ” Mr. Sinatra, who died of a heart attack in 1998 at age 82, knew something about the other side of fame. After years of soaring popularity, Mr. Sinatra, a   baritone, saw his career slide in the late 1940s. By the early 1950s, he had retooled his musical persona and won a string of acting roles. To call it a career revival was an understatement: Sinatra had transformed himself from a fledgling wartime singer into a pop culture titan. “The tragedy of fame is when no one shows up and you’re singing to the cleaning lady in some empty joint that hasn’t seen a paying customer since Saint Swithin’s day. ” Mr. Sinatra wrote. “And you’re nowhere near that you’re top dog on the top rung of a tall ladder called Stardom, which in Latin means     who were there when it was lonely. ” Mr. Sinatra finished the letter succinctly: “Trust me. I’ve been there. ” As the letter resurfaced after Mr. Michael’s death, it quickly spread on social media. In 1990, not all readers had taken Mr. Sinatra’s side, either. One urged for a more compassionate treatment of Mr. Michael, whose struggle with fame continued until his death. “For Mr. Sinatra to trivialize George Michael’s statements and make them seem superfluous or   indicate his grasp of the downside of ‘the business’ is minuscule. A performer is, foremost, a human being, not a commodity, a windup toy or machine,” a reader, Mike Sekulic, wrote to The Los Angeles Times on Sept. 23, 1990.'"}, "time": 1742561675.0860496}