{"duration": 0.057578086853027344, "input_args": {"text": "'FAIRVIEW, Tenn.  —   Representative Marsha Blackburn may have expected to draw a friendly crowd by scheduling a town   meeting in a Tennessee community that had voted overwhelmingly for President Trump, but she instead faced a   blast of disapproval on Tuesday. Ms. Blackburn, an   Republican, was sharply questioned about a wide range of issues that have unsettled Mr. Trump’s first month in office, including health care, the environment, education and the president’s links to Russia. At many moments, her replies elicited boos or shouts to “tell the truth. ” “We’re not stupid you have to do better,” Renee Armand said at one point, interrupting Ms. Blackburn as she was defending the new education secretary, Betsy DeVos, for bringing “a true love of education reform. ” Ms. Blackburn, who represents a safe Republican seat west of Nashville, was among the latest wave of Washington lawmakers to face angry constituents in what, inevitably but perhaps prematurely, has been called a progressive echo of the Tea Party anger that boiled over in town halls eight years ago. During the first weeklong recess of the new Congress, many Republicans have chosen not to hold events at all, wary of protests that might greet them. Others gamely faced the music, including Representative Dennis A. Ross of Florida and Senator Charles E. Grassley of Iowa, who faced largely hostile audiences on Tuesday in districts that, like Ms. Blackburn’s, had strongly endorsed Mr. Trump at the polls. At one point, Mr. Grassley, a   senator, was offered a gift from a    Democratic pig farmer named Chris Petersen: a bottle of Tums. “You’re going to need them in the next few years,” Mr. Petersen told the senator, drawing laughter from a crowd packed into a room at a firehouse in Iowa Falls, north of Des Moines. Mr. Grassley later quipped that “the only time I need Tums is when I have chocolate ice cream before I go to bed. ” Anxious and agitated constituents of Mr. Grassley’s clapped and yelled out in frustration in a rural county that voted overwhelmingly for Mr. Trump. Mr. Petersen, the vice chairman of the Iowa Democratic Party’s Rural Caucus, gave a stern warning about the repeal of the Affordable Care Act. “With all due respect, sir, you’re the man that talked about the death panels,” Mr. Petersen said. “We’re going to create one great big death panel in this country. ” Republicans have accused the protesters who have roiled town   meetings of not representing a true   outpouring but instead being an AstroTurf movement paid by shadowy groups. Mr. Trump added his own voice to the criticism on Tuesday. The forums have faced threats of violence, prompting some lawmakers, citing security concerns, to cancel events after being briefed by law enforcement. But Mr. Grassley suggested the crowds were no less bona fide than the more friendly ones he usually gets when he makes his annual tour of all 99 Iowa counties. “I want to make clear it’s all legitimate,” he told reporters after his second meeting of the day, in Garner, Iowa. “If Hillary Clinton had been elected president, there’d be people from the conservative end of the spectrum to probably be doing the same thing. ” Mr. Ross, one of the most conservative members of Congress and an enthusiastic defender of Mr. Trump’s, was called a liar by participants in his town hall in Clermont, Fla. about 20 miles west of Orlando. They held signs reading “Disagree,” “Nyet My President” and “No Pipeline. ” Elected in 2010 as part of the Tea Party wave that challenged the political establishment and fought to repeal the Affordable Care Act, Mr. Ross has embraced Mr. Trump’s agenda, including securing the nation’s borders. A few supporters of Mr. Ross’s walked out of his meeting, saying they were upset that the congressman was unable to talk without catcalls. One protester tried to reason with the passionate crowd, urging people to let Mr. Ross speak and adding that if they were angry, the correct response was to vote. “But in the meantime, let him talk so we can hold him accountable,” she added. “This is democracy in action,” Mr. Ross said at one point. “There are a lot of people who want to participate in the dialogue. I only ask that you give them that respect and civility. ” But most of the people in the crowd wanted to be heard, loud and clear, on a litany of issues. One woman said she could not understand how Mr. Ross could oppose the presence of undocumented immigrants, given that the district was dependent on agriculture. “It’s so detrimental to our identity as a state and to the economy,” she said before disappearing into the crowd. Back in Tennessee, a number of those facing Ms. Blackburn were rallied by the local branch of Indivisible, a national movement started by Democratic activists. The group had held two meetings to discuss which issues to raise. One of the organizers, Elizabeth TeSelle, a university administrator, disavowed the Tea Party comparison. She said Indivisible supporters were not seeking to push moderate Democrats further to the left, or to oust them by running more extreme candidates against them in primaries. “My concern is what the Tea Party ended up spawning was Trump,” Ms. TeSelle said. Ms. Blackburn, one of Mr. Trump’s   supporters in the House of Representatives during last year’s campaign, defended him on nearly every issue raised by critics. One man called Stephen K. Bannon, the president’s chief strategist, “a notorious white nationalist. ” Ms. Blackburn replied, “My interactions with him have all been fine. ” A high school senior, Taylor Ayres, asked how she could support Ms. DeVos, “someone who doesn’t have real knowledge in the education field. ” Ms. Blackburn said coolly, “She is going to do a fine job. ” Bruce Sullivan asked why Republicans had no real replacement for the Affordable Care Act after seven years. Ms. Blackburn referred him to a   video from 2010 in which she and other Republicans had met with President Barack Obama to seek a bipartisan program. “I appreciate that,” Mr. Sullivan said, a hint of sarcasm in his voice. “You are showing us you have been in Washington too long. ” At least one lawmaker, Senator Bill Cassidy of Louisiana, had a quieter day. Appearing before a few hundred residents in a high school cafeteria in Denham Springs, La. after the students had spilled out into a warm afternoon, Mr. Cassidy, a Republican, spoke to anxious residents mostly about their more pressing concern: flood relief. Their parish, Livingston, had received more than 25 inches of rain in three days during a catastrophic flood in August, overwhelming the rivers and devastating the city. Protesters said they had steered clear of Mr. Cassidy’s forum out of respect for the flood victims. As Mr. Cassidy answered queries submitted on slips of paper, a woman asked if he would take questions from the floor, saying she worried they had been screened. As if to prove that they were not, Mr. Cassidy read aloud a question about Mr. Trump’s tax returns, eliciting applause and cheers from many of those assembled. “Looks like we have some folks who don’t like Donald Trump,” he said to more cheers. “A lot of us do. ”'"}, "time": 1742628563.723835}