{"duration": 0.1164557933807373, "input_args": {"text": "'NIGHT OF FIREBy Colin Thubron361 pp.   Publishers. $26. 99. The first oddity lies in the precise accuracy of the title. Those three words convey no coy metaphor for passion or anger, no euphemistic allusion to military bombardment. Colin Thubron’s “Night of Fire” is literally about a house that burns down at night, killing all its inhabitants. Lest you think I am a killjoy for giving away the plot, let me assure you that plot is the least of what this book has to offer. Structurally, it’s unlike any other novel I’ve read. It starts over at every chapter with a new character, and yet the fates of the seven central characters are so intimately linked that the story feels cumulative. The resemblance of each chapter to the next  —   intense memories, followed by death  —   should feel repetitious, but it doesn’t. Instead, the sensation is rather like reading a long, dirgelike poem in which the refrain comes back again and again. We do not exactly welcome these expected deaths, but we somehow become used to them. Time and place remain vague. An opening assertion that the rickety old house was built “years ago, at the end of the Victorian century,” along with a   reference to Bakelite sockets and dustbins and common English shrubs, combines with other details in the lives of the individual characters to put the location somewhere in Britain and the period somewhere near ours. There are no mentions of cellphones or internet searches or other   markers, and some of the tenants’ memories hark back to midcentury childhoods. On the other hand, the science of neurosurgery is being practiced in its modern form here, so we can’t be too much farther back than the last few years of the 20th century. The story itself is not exactly a timeless fable (as in, say, Hanya Yanagihara’s “A Little Life,” where 30 or 40 years pass without external, historical changes) but it nonetheless refuses to be pinned down to a particular night of fire in a particular place. This hankering after a generalized condition comes to make more and more sense as the chapters progress. At first, we think we are simply being introduced to each victim in turn: the landlord who lives at the top of the house, the priest who lives on the ground floor, the neurosurgeon who lives just above him, the photographer who occupies the basement. But by the time we get to the photographer, things have begun to seem less distinct. All of these people have a dead mother, usually one who died when the character was still young. What are the chances of that in the general population? Other elements, too, begin to recur: fondly recalled girlfriends with eyes that slant upward at the sides brain tumors whose excision leaves memory gaps a boy who hangs himself a beloved black woman a lesbian professor of biology. The memory pool, initially sharp and distinct for each character, starts to blur together. Still, we never stop believing in each as a separate individual. The strength of Thubron’s method is that it allows for strongly established characters, with their own histories and quirks, even as it enacts a discernible process of authorial repetition. Always beginning in the   voice, each chapter at some point moves into the first person, almost without our noticing the shift  —   until, just before the character’s death, the perspective moves back to the third person again. In no case, though, is anyone truly seen from the outside. We do not experience the moments after each victim’s death, nor do we learn anything about these people that they could not have told us themselves. As we come to see, these seven people have more in common than their separate professions or chapter titles would suggest. Aside from the landlord’s sick wife, who makes a brief appearance at the end, only one of the central characters, labeled “Naturalist,” is a woman. Yet she’s just as convincing in her reality, just as persuasive in her perspective, as the male characters who borrow their author’s gender (and presumably some of his memories). Moreover, because she shares so many other things with her fellow fire victims  —   the early loss of a mother, the ability to focus on visual detail, the obsession with youthful memories, a certain withdrawal from the general adult routine of getting and spending  —   the difference in sex comes to seem unimportant. These victims of the fire are all “isolatos,” to use Herman Melville’s term: They are at odds with the larger society and its patterns. That is how they’ve ended up as single renters in this decrepit, unsafe house. And while their life stories are not all equally compelling  —   I was gripped by the neurosurgeon’s taut moral dilemmas, somewhat bored by the priest’s more meandering ones  —   each is essential to the group portrait. We start to notice the strange overlaps about halfway through the novel, but it is only when we get to the “Traveller” chapter, just before the final one, that we are offered a rationale for them. In the course of journeying through India, this character, a retired, divorced schoolteacher, undergoes a transformative spiritual experience rather like the revelation that descends on the central English figure in E. M. Forster’s “A Passage to India,” or for that matter, in Geoff Dyer’s “Jeff in Venice, Death in Varanasi. ” Thubron’s traveler, when exposed firsthand to the religious practices of the subcontinent, begins to grasp, if only tentatively, the possibility of his unity with everyone and everything else. “If there is no God, what survives death?” he asks a Buddhist monk with whom he is conversing in Sarnath. “’u200a‘Something inherited,’ the monk answered. ‘Something waiting to be perfected.’ His hands unfurled from his chest. ‘But the previous life cannot be found again.’ “’u200a‘It has no memory . ’u2008. ’u2008.’ “’u200a‘’u2009If it has memory, it does not know it. Sometimes a person is reminded after many years, maybe prompted by chance. There are stories . ’u2008. ’u2008. ’’u200a” In his closing remarks to the Englishman, the monk, patting his arm “in encouragement,” observes that from the path of meditation one can never return to a singleness of self: “You’d lose too much! Ha, ha! You’d die back into suffering. We say that life is a burning house. ” This is not so much a clue to the book’s meaning or even its method as it is a life vest thrown to floundering readers. We are not being offered answers here. Instead, we are being soothed with recurring themes and motifs, in the manner of a musical composition. And what are those themes? Among others, the idea that death is the end of the individual but perhaps not the end of everything. The dissolved, burned bodies in the fiery house will become part of the elements that make up the universe, just as the ceremonially burned bodies in the Ganges, as witnessed by the traveling Englishman, become part of the river itself. And the memories that fleetingly pass through each mind in its final moments are both individual and shared, forming a common thread that may not even exist (“It has no memory”) or may exist only on an inaccessible level (“If it has memory, it does not know it”). This is not consolation as we normally know or seek it  —   “Night of Fire” is a coldly contemplative book rather than a comforting one  —   but it is an interesting idea for fiction, which normally depends so heavily on the notion of individual consciousness. Perhaps only Christopher Isherwood, in “A Single Man,” has attempted anything quite like this, and he did it with just a single character, not a multitude of them. I can’t be sure, after a first reading, that I wholeheartedly like Colin Thubron’s novel. But I am absolutely certain that I admire it.'"}, "time": 1742561999.5891597}