{"duration": 0.06180167198181152, "input_args": {"text": "'Waking Times \\nThe rise in health conditions such cancer, diabetes, asthma, obesity, autoimmune diseases and even mental disorders like ADHD, run parallel with the rise in usage of chemicals in agriculture and industry. Our environment is highly contaminated, the average person now has thousands of chemicals in their body that their grandparents did not have, and many people intentionally put hundreds of chemicals on and in their bodies each day . \\nOne of the most dangerous chemicals in use, atrazine , is the second most commonly used herbicide in the United States, and although it was banned in the European Union over a decade ago, lobbyists for the agro-chemical industry have ensured that Americans will continue to be exposed to it. \\nAs a known endocrine system disruptor, it is known to cause deformities in frogs and rats, to severely decrease their fertility, and to even cause gender changes in some frogs. \\n“Atrazine is a common agricultural herbicide with endocrine disruptor activity. There is evidence that it interferes with reproduction and development, and may cause cancer. Although the U.S. Environmental Protection Agency (EPA) approved its continued use in October 2003, that same month the European Union (EU) announced a ban of atrazine because of ubiquitous and unpreventable water contamination. The authors reviewed regulatory procedures and government documents, and report efforts by the manufacturer of atrazine, Syngenta, to influence the U.S. atrazine assessment, by submitting flawed scientific data as evidence of no harm, and by meeting repeatedly and privately with EPA to negotiate the government’s regulatory approach. Many of the details of these negotiations continue to be withheld from the public, despite EPA regulations and federal open-government laws that require such decisions to be made in the open.” [ Source ] \\nShockingly, the agro-chemical industry in the United States expends significant financial resources in ensuring that atrazine will not be banned in the U.S. \\n“The European Union (EU) banned atrazine in 2005, as suspicions of health problems and environmental damage mounted. In the U.S., atrazine use continued unabated, in large part due to powerful lobbying efforts by Syngenta. In 2005, Syngenta spent $250,000 on lobbying in Minnesota alone, to keep atrazine sales going.” [ Source ] Big Ag Targets a Truth Teller \\nBiologist, Tyrone Hayes is a soft-spoken professor at the University of California with a big message. One of the most commonly used pesticides in agriculture, atrazine, is responsible for feminizing amphibians, according to his research. More importantly, the chemical is effectively eliminating male chromosomes at an alarming rate, ate levels which are three times lower than what are currently appearing in our drinking water. It isn’t just lead and fluoride we need to be concerned about, but a known endocrine disruptor, created by Syngenta , that is utterly changing our gene pool. \\nHayes has been fighting Syngenta, to report the harmful effects of Atrazine for decades now . His scientific papers describe how Atrazine demasculinizes male gonads producing testicular lesions associated with reduced germ cell numbers in teleost fish, amphibians, reptiles, and mammals, and induces partial and/or complete feminization in fish, amphibians, and reptiles. These effects are strong (statistically significant), consistent across vertebrate classes , and specific. Reductions in androgen levels and the induction of estrogen synthesis – demonstrated in fish, amphibians, reptiles, and mammals – represent plausible and coherent mechanisms that explain these effects. [ Source ] \\nOne of greatest concerns for Americans regarding exposure to atrazine may be what the chemical does to the developing male, as evidenced in what we see taking place among frogs and fish. \\n“It turns males into egg-laying females by inducing an enzyme called aromatase, which causes overproduction of estrogen. Even more disturbing, it produced male frogs with TWO sets of each sex organ, meaning two sets of testes and two sets of ovaries. \\nThe voice box in male frogs also did not develop properly, indicating that testosterone was not being produced at appropriate levels for development. \\nNormally, the male testes make testosterone. Atrazine “turns on” the enzyme aromatase, which converts testosterone into estrogen. As a result, the male frogs lose their testosterone; they’re essentially chemically castrated, and are feminized as a result of the excessive estrogen being produced. \\nRecent testing has revealed 85 percent of male smallmouth bass in 19 American wildlife refuges are now carrying eggs. Like amphibians, smallmouth bass are known to be very sensitive to pollutants, hence, researchers use them as an “indicator species” when evaluating the ecological impact of environmental pollutants.” [ Source] \\nOther concerns listed by Haynes and other researchers include certain types of cancer, among other things, as briefly mentioned here: \\nAtrazine may be involved in the development of breast cancer, for example, since many breast cancers are triggered by the overproduction of estrogen and are regulated by the enzyme aromatase. \\nAs noted by Hayes, aromatase is so important in the development of breast cancer, the cancer drug Letrozole works by blocking aromatase, which in turn blocks estrogen production. Ironically, Letrozole is also produced by Syngenta, the same company that brought us atrazine. \\nAccording to Hayes, recent research published by an international team of scientists, including himself, shows atrazine causes sexual reproductive problems in a wide range of animals, including mammals, birds and fish, not just amphibians, which was the focus of his earlier research. \\nOne study also linked atrazine exposure in utero to impaired sexual development in young boys, causing genital deformations, including microphallus (micropenis). \\nThe evidence 3 , 4 also suggests atrazine exposure may contribute to a number of different cancers, specifically ovarian cancer, non-Hodgkin’s lymphoma, hairy-cell leukemia and thyroid cancer. \\nElevated concentrations of atrazine in drinking water have been associated with birth defects, including abdominal defects, gastroschisis (in which the baby’s intestines stick outside of the baby’s body) and others. [ Source ] More On Atrazine \\nIn the following TED talk , Dr. Tyrone Hayes and Penelope Jagessar Chaffer, director of the documentary Toxic Baby , discuss the latest research into atrazine and what it is doing to Americans.   Alex Pietrowski . About the Author \\nAlex Pietrowski is an artist and writer concerned with preserving good health and the basic freedom to enjoy a healthy lifestyle. He is a   Offgrid Outpost , a provider of storable food and emergency kits . Alex is an avid student of Yoga and life. \\nThis article ( Banned in the EU, What is This Dangerous Chemical Doing to Americans?   Alex Pietrowski   \\n '"}, "time": 1742628549.8088408}