{"duration": 0.05337023735046387, "input_args": {"text": "'Montag, 31. Oktober 2016 Gruselig: FC Bayern verkleidet sich zu Halloween als HSV München (dpo) - Ob sich ihre Fans von diesem Schreck jemals erholen? Wie Sport Postillon soeben exklusiv erfuhr, wird der FC Bayern München heute auf der vereinsinternen Halloween-Feier geschlossen als HSV verkleidet auftreten. Für den Gruselspaß hat sich die Mannschaft einen kompletten Trikotsatz des künftigen Zweitligisten besorgt. Wie schaurig die Kostümierung auf den eigenen Anhang wirkt, zeigt eine Szene von heute Mittag, als die Münchner für ein Mannschaftsfoto (s.o.) posierten, um den aufwendigen Halloween-Streich zu dokumentieren. Drei Bayern-Fans wurden zufällig Zeugen der Aktion. Mannschaftsfotograf Uli Höpfer: \"Die wurden kreidebleich. Zwei rannten schreiend weg, der dritte begab sich in Fötusstellung und wippte wimmernd hin und her.\" Er wird derzeit psychologisch betreut. Heute Abend geht es dann zu einer vereinsinternen Halloween-Feier in einem bekannten Münchener Szeneclub. Die Mannschaft bereitet sich bereits intensiv auf die Rolle als HSV vor: \"Wir trinken jeder schon mal zwei Maß und ein paar Kurze, bevor wir überhaupt auf die Feier gehen\", erklärt Thomas Müller, dessen Idee die gruselige Maskerade war. \"Dadurch gleichen wir unseren Bewegungsablauf an den des HSV an.\" Auch einige Running Gags haben sich die Münchner überlegt: Trainer Carlo Ancelotti etwa werde auf der Feier alle 30 Minuten das Outfit zwischen Jogging- und Maßanzug wechseln und sich mit verschiedenen Vornamen wie Bruno, Armin, Michael, Thorsten, Mirko, Bert, wieder Bruno oder Markus ansprechen lassen. Manuel Neuer wird ständig Dinge zugeworfen bekommen, die er dann durch seine Handschuhe rutschen lässt und eine eigens aufgestellte Torwand soll von allen Schützen verfehlt und schließlich umgegrätscht werden. Gegen 1 Uhr soll der Spuk dann vorbei sein. Alle Spieler erhalten einen Platzverweis und fahren nach Hause oder steigen irgendwo ab. ssi, dan'"}, "time": 1742563209.5994763}