{"duration": 0.019193410873413086, "input_args": {"text": "'BREAKING: Hillary Just LOST The Black Vote… Trump Is Going ALL THE WAY To The White House Hillary Just Lost The Black Vote To a Black Lives Matter mom’s outrage and a pharmaceutical bro’s whims. Here’s how: \\nBrett MacDonald | Twitter | Facebook | \\nNEW YORK — Today was not a great day for the Clinton campaign. Recently leaked emails from within the Clinton campaign have reached the ears of some prominent members of the Black Lives Matter community — members whom the emails were about. They are particularly upset about a series of emails that seems how to best “use” the victims of gun violence while making sure those victims were black. Understandably, some of the members have taken to speaking out against her campaign now. In a word, they’re pissed. \\nErica Garner, the daughter of controversial man who died after being put in “chokehold” by a New York officer has been one of the most vocal critics. “I’m troubled by the revelation that you and this campaign actually discussed ‘using’ Eric Garner …. Why would you want to ‘use’ my dad?” she tweeted. \\nThat was way earlier today. She hasn’t stopped since: “If you vote for her (Clinton) by default you are endorsing her and whatever she does. Remember her hiding being Negros(sic) that supported the crime bill?” If you vote for her by default you are endorsing her and whatever she does. Remember her hiding being Nergos that supported the crime bill? \\n— officialERICA GARNER (@es_snipes) October 27, 2016 \\nBut here’s the real kicker: “I don’t care what BLM activists endorse #Hillary … They WILL continue more of the same, they don’t care about Black lives and I got proof!” I dont care what BLM activists endorse #Hillary … They WILL continue more of the same, they dont care about Black lives and I got proof! \\n— officialERICA GARNER (@es_snipes) October 27, 2016 \\nBut that’s not the only setback the Clinton campaign saw today. Martin Shkreli, the controversial “pharma-bro” and top-tier troll, had a very alarming announcement for the music community: if Trump wins, he will release his previously unheard music from the Beatles, Nirvana, and, mot importantly to the black community, Wu-Tang. If Trump wins, my entire unreleased music collection, including unheard Nirvana, Beatles, and of course, Wu-Tang, comes out, for free. \\n— Martin Shkreli (@MartinShkreli) October 27, 2016 This article was written by Brett MacDonald. If you enjoyed this story or did not, hate mail can be left in the comments below and the author totally won’t ignore it. Compliments or questions may be sent to @ TweetBrettMac . on Twitter! VOTE FOR DONALD J. TRUMP! TOGETHER WE WILL MAKE AMERICA GREAT AGAIN! Please like and share on Facebook and Twitter! 5.7K SHARES '"}, "time": 1742628532.7179098}