{"duration": 0.08664464950561523, "input_args": {"text": "'A   old inmate was in a southeast Virginia jail for about three months when he became ill in August, suffering from uncontrolled fainting spells, coughing and vomiting. “I don’t know what cause the blackouts,” the man, Henry C. Stewart, wrote on a form used by inmates to ask for medical help at Hampton Roads Regional Jail. “I can’t hold water down or food. ” That was Aug. 4. Two days later, Mr. Stewart was found dead in the jail in Portsmouth, Va. the second man to die in custody there within a year, the authorities said. The deaths of Mr. Stewart and the other inmate, Jamycheal Mitchell, 24, have renewed calls this month by legislators and state officials for better scrutiny and oversight of the state’s regional jails. Mark R. Herring, Virginia’s attorney general, has asked for a federal civil rights investigation, saying the “lack of clarity” over what happened to the men was troubling. “I write to you with urgency,” Mr. Herring said in letter to United States Attorney General Loretta E. Lynch. The Sept. 6 letter, provided Wednesday by his office, contained details about Mr. Stewart’s death. The state “is once again confronted with significant questions about the provision of medical care at this regional jail,” Mr. Herring wrote. The Justice Department replied in an email that it had received Mr. Herring’s letter and was “in the process of reviewing the request. ” Gov. Terry McAuliffe, Democrat of Virginia, was asked about the men’s deaths in a video published on Sept. 1 by The  . “You bet I have concerns,” Mr. McAuliffe replied. “I have a lot of questions,” the governor added. “This is why we’re going to propose legislation in the upcoming General Assembly” which starts in January. “No one is taking responsibility,” he said. Virginia’s regional jails are operated by local, rather than state, authorities. The Hampton Roads jail is run by sheriffs, city managers and city council members from the five cities  —   Newport News, Hampton, Norfolk, Portsmouth and Chesapeake  —   in its jurisdiction. Brian Coy, a spokesman for the governor, said on Thursday that any proposed legislation would aim to give state agencies the authority to investigate regional jails when events like the deaths of the two men occur. Currently, the state and the Portsmouth city police are investigating the jail deaths, Mr. Coy said. “The law can be more clear in terms of the process going forward,” Mr. Coy said. “Who, if anyone, has the authority to oversee and investigate local jails. “There is no clear authority about who investigates when there is a death in the local or regional jails,” he said. Last week, an investigation by The Richmond   showed that inmates died nearly nine times more often in custody at Hampton Roads Regional Jail than at other local or regional jails in Virginia during the past three years. The newspaper analyzed statistics from two state agencies showing that 12 of the 6, 716 inmates who have been locked up at the   jail have died since June 2013. Statewide, 129 inmates died across Virginia in the same time period. Lt. Col. Eugene Taylor III, the jail’s assistant superintendent, responded to the newspaper’s report, saying five cities that send inmates to the jail send their sickest, and the jail cannot refuse them. “If you have cancer, if you have H. I. V. you’re coming to Hampton Roads Regional Jail,” he was quoted as saying. The jail’s superintendent, David Simons, and the jail’s lawyer, Jeff Rosen, were not available for comment or did not return calls on Wednesday and early Thursday. The attorney general’s letter requesting the federal investigation after Mr. Stewart’s death was first reported by local media, including The   and WAVY. com, which have also published documents online detailing the jail’s response to Mr. Mitchell’s death. One of the jail’s documents shows a timeline of occasions when Mr. Mitchell sometimes refused food, treatment and medicine. The jail superintendent, Mr. Simons, has said the facility was cooperating with investigators in the Mitchell case, according to a letter he sent to Mr. Herring in June, a copy of which was provided in an email from Mr. Herring’s office. Mark Krudys, a lawyer for Mr. Stewart’s family, said Mr. Herring’s request for a federal investigation shows the jail “has a very significant problem on its hands in both dealing with the mentally ill and dealing with people who need medical help. ” He said in a telephone interview on Thursday that Mr. Stewart was being held and accused of violating probation. He said that he anticipated filing a lawsuit after receiving information, including the medical examiner’s determination of the cause of death There was no immediate information on Mr. Stewart’s original complaint. After Mr. Stewart died, the grievance form that he used to ask for medical help was included in the package of his belongings and returned to the family, and then it was published in media reports, Mr. Krudys said. It confirmed details about what former inmates had told the family after Mr. Stewart died, he said. The form shows that Mr. Stewart was told to wait for an appointment for medical help, a service that was the responsibility of an independent contractor for the jail, Mr. Krudys said. Mr. Mitchell was put in the Hamptons Road jail in May 2015 after being arrested and accused of stealing snacks from a  . While awaiting mental health treatment before a trial on the misdemeanor charges, he was not given enough medicine and food and was poorly treated by corrections officers, the lawsuit filed on behalf of Mr. Mitchell’s family said. It quoted interviews with former inmates for some of the details. Mr. Mitchell was found dead in his cell on August 19, 2015. The cause of his death was “probable cardiac arrhythmia accompanying wasting syndrome of unknown etiology,” said Donna Price, from the medical examiner’s office, in a report by The  .'"}, "time": 1742561730.5977616}