{"duration": 0.08400702476501465, "input_args": {"text": "'Japanese troops deploy to South Sudan risking first overseas conflict since World War 2 The move risks pulling the troops into conflict for the first time in more than seven decades By Michael Krieger - 11.21.2016 @1:18 PM EST \\nThe re-miliarization of Japan has been on my radar and caused me much concern in recent years. I’ve covered the topic on several occasions, with the most recent example published over the summer in the post, Japanese Government Shifts Further Toward Authoritarianism and Militarism . Here are the first few paragraphs: One of the most discomforting aspects of Neil Howe and William Strauss’ seminal work on generational cycles, The Fourth Turning (1997), is the fact that as far as American history is concerned, they all climax and end with massive wars. To be more specific, the first “fourth turning” in American history culminated with the Revolutionary War (1775-1783), the second culminated with the Civil War (1861-1865), while the third ended with the bloodiest war in world history, World War II (1939-1945). The number of years between the end of the Revolutionary War and the start of the Civil War was 78 years, and the number of years between the end of the Civil War and the start of World War II was 74 years (76 years if you use America’s entry into the war as your starting date). Therefore, if Howe & Strauss’ theory holds any water, and I think it does, we’re due for a major conflict somewhere around 75 years from the end of World War II. That brings us to 2020. The more I look around, the more signs appear everywhere that the world is headed into another major conflict. From an unnecessary resurgence of a Cold War with Russia, to increased tensions in the South China Sea and complete chaos and destruction in the Middle East, the world is a gigantic tinderbox. All it will take to transform these already existing conflict zones into a major conflagration is another severe global economic downturn, something I fully expect to happen within the next 1-2 years. Frighteningly, this puts on a perfect collision course with the 2020 area. \\nAlthough I felt World War 3 was a virtual lock under Hillary Clinton, the election of Trump does not negate historical cycles or current geopolitical trends, and the world continues to move in a very dangerous direction. \\nWhile the below snippet from a Reuters article published today may not seem like a big deal, it’s just a small part of a much larger trend. \\nVia Reuters : A contingent of Japanese troops landed in South Sudan on Monday, an official said – a mission that critics say could see them embroiled in their country’s first overseas fighting since World War Two. The soldiers will join U.N. peacekeepers and help build infrastructure in the landlocked and impoverished country torn apart by years of civil war. But, under new powers granted by their government last year, they will be allowed to respond to urgent calls for help from U.N. staff and aid workers. There are also plans to let them guard U.N. bases, which have been attacked during the fighting. The deployment of 350 soldiers is in line with Japanese security legislation to expand the military’s role overseas. Critics in Japan have said the move risks pulling the troops into conflict for the first time in more than seven decades. \\nAll it would take is a sharp global economic downturn to push world “leaders” towards overseas conflict in order to distract from problems at home. The risk is very real.'"}, "time": 1742628342.4391525}