{"duration": 0.08014488220214844, "input_args": {"text": "'Most Russians wan to ignore criticism from the West 08.11.2016 | Source: AP photo One should not pay much attention to the criticism of Russia that comes from the West, more than half of Russians (59%) said in a recent opinion poll conducted by Levada Center, Interfax reports.The West perceives Russia as a competitor in an attempt to weaken the Russian Federation, 43% of respondents said. Thirty-five percent of respondents said that the criticism of the West was hostile. Every fourth (25%) respondent believes that Western critics often criticize Russia for what they should be criticized themselves . Every fifth respondent (21%) said that Europe and the US have little understanding of life in Russia, \"but they still want to teach us.\"Critical remarks against Russia from Western countries are not worthy of attention, 30% of respondents said. The survey was conducted on October 21-24 among 1,600 people in 137 settlements of Russia.The majority of respondents 74% noted that the West wants to weaken and humiliate Russia by tightening sanctions against the country. According to 13 percent of respondent, the sanctions were imposed on Russia in an attempt to restore the geopolitical balance after Russia reunited with the Crimea. Another five percent believe that the sanctions policy of the West is aimed at ending the war in the east of Ukraine, while eight percent were undecided.At the same time, opinion polls conducted in the last days of October showed an increase in the ratings of the president and the government. The survey showed that the approval rating of the president rose from 78.7 to 81.8% from August to October. Positive assessments of the government\\'s work increased from 53.6 to 58.3%.The Russian parliament\\'s approval rating rose from 39.7% in September to 45.5%.Russia\\'s armed forces have the support of 83.5% of the Russian population. The figure has doubled in ten years - from 44% in October 2006. Pravda.Ru Read article on the Russian version of Pravda.Ru Russians name their main enemies'"}, "time": 1742564485.3227715}