{"duration": 0.044084787368774414, "input_args": {"text": "'Pinterest \\nFinally some good has come from disgraced former New York Congressman Anthony Weiner’s disturbing sexting scandals — something that nearly makes up for the images burned into the brains of millions of Americans thanks to “Carlos Danger” and his mongoose like strength… well, almost. \\nThe FBI announced on Friday that they were reopening their investigation into former Secretary of State Hillary Clinton’s email scandal, and now we know that she has the investigation into Weiner’s sexts with an underage girl to blame for it. \\nThe New York Times reported : \\nFederal law enforcement officials said Friday that the new emails uncovered in the closed investigation into Hillary Clinton’s use of a private email server were discovered after the F.B.I. seized electronic devices belonging to Huma Abedin, a top aide to Mrs. Clinton, and her husband, Anthony D. Weiner. \\nThe F.B.I. is investigating illicit text messages that Mr. Weiner sent to a 15-year-old girl in North Carolina. The bureau told Congress on Friday that it had uncovered new emails related to the Clinton case — one federal official said they numbered in the thousands — potentially reigniting an issue that has weighed on the presidential campaign and offering a lifeline to Donald J. Trump less than two weeks before the election. \\nFBI Director James Comey referenced these emails in his letter to Congress announcing that the Clinton case had been reopened: “In connection with an unrelated case, the FBI has learned of the existence of emails that appear to be pertinent to the investigation.” \\nComey wrote that while it was unclear how long it would take to conduct the investigation in light of the new information or whether or not it would prove to be “significant,” he wanted to inform Congress of the development. He added: \\nIn previous congressional testimony, I referred to the fact that the Federal Bureau of Investigation (FBI) had completed its investigation of former Secretary Clinton’s personal email server. Due to recent developments, I am writing to supplement my previous testimony. \\nAt a New Hampshire rally, Donald Trump commented on the reopened investigation and even said that the election “might not be as rigged” as he had thought it was. Trump went on to praise the FBI and the Department of Justice, who he said had the “courage to right the horrible mistake that they made.” \\nWell, we might not want to go that far yet. Hopefully Trump’s optimism is correct, but I’m a bit more cynical. I’ll believe that the wrong has been righted when I see it. \\nRight now, I’m more apt to believe that the reopened investigation has an angle that is set to benefit Clinton. At this point, I find it hard to believe that anything is going to be done to actually hold Clinton accountable — not under the Obama administration and not after what we’ve seen. \\nTime will tell, and hopefully my cynical side will be proven wrong.'"}, "time": 1742562075.9689844}