{"duration": 0.05712628364562988, "input_args": {"text": "'by Onan Coca, Freedom OutPost : \\nIn a speech from August that is now making waves across the country, president-elect Donald Trump’s National Security Adviser designate, Lt. General Michael Flynn (retired) told the Dallas chapter of ACT! For America that “Islam is a political ideology, it is a political ideology. It definitely hides behind this notion of it being a religion.” \\nThe comments are sure to be brought back up when Flynn goes before the Senate to testify during his confirmation hearings. However, Flynn’s personality and his public persona lead me to believe that he’s not worried about facing tough questions from hostile Democrat Senators. \\nIn his speech, Flynn further commented on the differences between Christianity and Islam before making some even more controversial comments about world Islam today. \\n“Islam is a political ideology, it is a political ideology. It definitely hides behind this notion of it being a religion. I have a very, very tough time because I don’t see a lot of people screaming ‘Jesus Christ’ with hatchetsor machetes or rifles shooting up clubs or hatcheting, literally axing families on a train. \\nOr like they just killed a couple of police officers with a machete. I mean, it’s unbelievable. So we have a problem. \\nIt’s like cancer. I’ve gone through cancer in my own life. And so it’s like cancer, and it’s like a malignant cancer, though in this case that has metastasized. \\nIt’s like I just said in the number of attacks in 22 countries in just the last 45 days. When I look back over the last 10 years or 15 years of my life and the things that I’ve seen and the things that I’ve witnessed against this very vicious threat. \\nThe folks at MRC TV cut video of Flynn’s speech with an interview he gave to MSNBC where the topic of discussion was Russia. In the interview Flynn explains why the current liberal stance towards Russia is all wrong – while Russia may not be a “good guy” in the narrative, they’re certainly preferable to the Muslim terrorists that we’re both fighting against. \\n“We have to deal with Russia,” he said. “We cannot make Russia an enemy. Russia is a nation that is deeply involved in the Middle East. Right now, the Middle East is totally unstable. We have over 5,000 of our own troops there in Iraq trying to fight the rise of ISIS.” \\n“Russia’s directly involved,” he said. “So we have to figure out ways to work with them instead of making them an antagonist.”'"}, "time": 1742564502.2294056}