{"duration": 0.044703006744384766, "input_args": {"text": "'Israelis pride themselves on the revival of ancient Hebrew, which had not been widely spoken for almost two millenniums before the Zionist movement that led to the state’s founding in 1948. It is a binding part of the identity in a nation built by immigrants. But despite the richness of the language, this   nation can find itself at a loss for contemporary terms. The venerated Academy of the Hebrew Language is always working to update a vocabulary inscribed on parchment for the digital era. Among the academy’s latest crop, announced on Twitter this month, were Hebrew words for shaming (“biyush,” an outgrowth of an existing verb, to shame) hashtag (“tag hakbatza”  —   literally, group tag) and big data (“netunei atek”). Israel’s health minister recently made some enemies in the   industry when he came up with his own word for junk food: “McDonald’s. ” The academy offered an alternative: “zlolet”  —   a combination of “zlila,” or gluttony, and “zol,” which means cheap. The experts also seek public comment, as in a recent plea for a new word to replace “peripheria,” from the English periphery, used to refer to geographical areas or socioeconomic groups that, the academy said, “are not central, or are far from the center. ” In general Israeli parlance, “peripheria” is often a synonym for governmental neglect. People were asked to vote online for or against the academy’s suggestion: “shula,” derived from the word for margin. But Israelis overwhelmingly disapproved, noting that this term had the same negative connotations, and suggested alternatives. The most popular were variations on the word “heikef,” denoting scope or girth. Even for   correct grammar and pronunciation can be a matter of dispute or guesswork since Hebrew is mostly written without “nikkud,” or vowel signs. The academy says it receives more than 1, 300 queries a month from people working in government, the military and the legal system, and from teachers, translators, poets and even children. Some are hoping to win a bet about correct usage. Others are seeking help drafting invitations for happy occasions  —   or, conversely, crafting inscriptions for tombstones.'"}, "time": 1742562034.523317}