{"duration": 0.23777341842651367, "input_args": {"text": "'at 11:54 am 4 Comments \\nWhen it comes to the Clintons, where there’s smoke, there’s usually a structure fire. I doubt Haiti is any different. \\nWith that in mind, I wanted to flag an article published earlier today at the BBC , What really happened with the Clintons in Haiti? \\nHere are some excerpts: Donald Trump has said the work of Bill and Hillary Clinton in Haiti was a “disgrace”. What really happened? \\n“The Clinton family, they are crooks, they are thieves, they are liars,” says Haitian activist Dahoud Andre. \\nHe has been leading protests outside the Clinton Foundation headquarters in Manhattan and Hillary Clinton’s presidential campaign base in Brooklyn for the last two years. \\nHe said protesters from his small activist group, the Committee to Mobilize Against Dictatorship in Haiti, will continue to level their allegations – so far all unproven – if the Democratic candidate wins the White House. \\nMrs Clinton retorted that she was proud of the foundation’s work, and pointed out her rival’s namesake charity had spent money on a lifesize portrait of himself. \\nThe Clintons’ history with the world’s first black republic dates back to their 1975 honeymoon, when they met a voodoo priest and visited a hotel where Ernest Hemingway once stayed. \\nMr Andre is not alone among his compatriots in blaming the once-and-perhaps-future first couple for a litany of ills in Haiti. \\nKim Ives, editor of Haiti Liberte newspaper, told the BBC: “A lot of Haitians are not big fans of the Clintons, that’s for sure.” \\n“The fact the Clintons kind of took over things after the earthquake and did a pretty poor job of it translates to why the Haitians have a pretty dim view of them,” he added. \\nSo what happened? \\nMrs Clinton was Secretary of State and Mr Clinton was UN Special Envoy to Haiti when the January 2010 earthquake struck, killing an estimated 220,000 people. \\nSome $13.3bn (£10.9bn) was pledged by international donors for Haiti’s recovery. \\nMr Clinton was appointed co-chairman of the Interim Haiti Recovery Commission (IHRC), along with Haitian Prime Minister Jean-Max Bellerive. \\nBut the IHRC found itself under fire as frustrations mounted at the slow pace of recovery. \\nIts mandate was not renewed by the Haitian parliament in 2011. \\nHow about this graphic… \\nA US Government Accountability Office report discovered no hint of wrongdoing, but concluded the IHRC’s decisions were “not necessarily aligned with Haitian priorities”. \\nThe GAO must have a peculiar definition of “wrongdoing.” \\nMr Clinton’s own office at the UN found 9% of the foreign aid cash went to the Haitian government and 0.6% to local organizations. \\nThe bulk of it went to UN agencies, international aid groups, private contractors and donor countries’ own civilian and military agencies. \\nFor example, the Pentagon billed the State Department hundreds of millions of dollars for sending US troops to hand out bottled water and keep order on the streets of Haiti’s ravaged capital, Port-au-Prince. \\nJake Johnston, an analyst with the Center for Economic and Policy Research, a nonpartisan group that has studied the quake reconstruction, told the BBC “it’s hard to say it’s been anything other than a failure”. \\nBut he believes the State Department and IHRC simply replicated the mistakes of the whole foreign aid industry by chasing short-term gains instead of building longer-term capacity on the ground. \\n“They relied too much on outside actors,” Mr Johnston says, “and supplanted the role of the Haitian government and domestic producers.” \\nAfter the earthquake, disaster capitalists flocked to the nation of 10 million people, which is about the size of the US state of Massachusetts. \\nPrivate contractors were eager to sell services, in what one US envoy described in a Wikileaks-disclosed diplomatic cable as a “gold rush”. \\nIn email exchanges with top Clinton Foundation officials, a senior aide to Mrs Clinton, who was then-secretary of state, kept an eye out for those identified by the abbreviations “FOB” (friends of Bill Clinton) or “WJC VIPs” (William Jefferson Clinton VIPs). \\n“Need you to flag when people are friends of WJC,” wrote Caitlin Klevorick, a senior State Department official who was vetting incoming offers of assistance coming through the Clinton Foundation. \\nThe emails, which were obtained through a Freedom of Information Act lawsuit by the Republican National Committee, have fuelled claims the Clintons were running a pay-to-play operation, though no hard evidence of this has emerged. \\nHouse Republicans are already laying the groundwork for a volley of congressional hearings into the Clinton Foundation in the event the Democratic candidate wins the White House in a week’s time. \\nPossibly the most enduring criticism of the Clinton Foundation’s work in Haiti stems from its signature project, a garment factory known as the Caracol Industrial Park. \\nThe foundation, working with the Clinton State Department, helped arrange a US-subsidised deal with the Haitian government to build the $300m factory complex in 2012. \\nSeveral hundred farmers were evicted from their land to make way for the 600-acre manufacturing site, which produces clothes for retailers such as Old Navy, Walmart and Target. \\nSouth Korean textile giant Sae-A Trading Co, which is the main employer at the facility, subsequently donated between $50,000 to $100,000 to the Clinton Foundation. \\nMr Clinton declared 100,000 jobs would be created “in short order”. \\nBut the Caracol Industrial Park has created only 8,000 jobs. \\nIn the Little Haiti neighbourhood of Miami that was visited by Mr Trump this September, the head of a local women’s advocacy group has questions for Mrs Clinton. \\nMarleine Bastien, executive director of Fanm Ayisyen Nan Miyami, believes that Clinton-backed projects have helped global investors more than they have benefited poverty-stricken Haitians. \\nShe told the BBC: “The more Secretary Clinton refrains from responding to the concerns and questions from the people of Haiti, this perception that she’s trying to evade responding will continue. \\n“Instead of allowing these questions to linger and fester, why not come clean? The questions will not go away, they will continue.” \\nCome clean? This is the Clintons we’re talking about. \\nFor more on the Clinton Foundation, see:'"}, "time": 1742561684.7523925}