{"duration": 0.21347260475158691, "input_args": {"text": "\"A brave mother fought off a mountain lion that attacked her 5-year-old son outside their home in northwest Aspen, Colorado. (4 hours ago) \\nWhen people asked Veronica Aguilar where her son was, she told them he had been placed in an institution in Mexico, according to court records. Only her three other children — two of whom slept on a bed just outside the closet door — knew the truth, and they said they were forbidden by their mother from saying anything, authorities say. \\nYonatan Daniel Aguilar’s tortured life came to an end in August. Police later found the 11-year-old’s battered, malnourished 34-pound body in the bedroom closet of the family’s tiny Echo Park home. \\nThe grim details are laid out in records The Times obtained from Los Angeles County Juvenile Court this week. The records help explain how the people charged with his well-being — school officials, police, social workers and therapists — lost track of him despite earlier allegations of abuse. But they also raise new questions about whether more could have been done to save the boy who, court records suggest, might have been autistic and thus was treated differently. \\nLos Angeles police detectives investigating the case believed Aguilar’s efforts to hide the boy were so effective that even the boy’s stepfather, Jose Pinzon, didn’t know Yonatan lived with them all along. \\nThe day of Yonatan’s death, Moses Castillo, the supervising LAPD detective on the case, placed Pinzon and Yonatan’s siblings together in a room “to see the reaction,” Department of Children and Family Services records state. As detectives and a county social worker stood by, Pinzon “immediately confronts the children that he had no idea that minor [Yonatan] was living in the house the whole time they were there,” records state. Recommended \\nMost of the mass shootings in the last twenty years, and multiple other instances of suicide and isolated shootings all share one thing in common, and it's not the weapons used. (4 hours ago) \\n“How can you do this to me?” he asked. \\nOne of the children replied: “You were always at work, so you didn’t know.” \\nPinzon then started crying. \\n“I carry a photo of him in my wallet,” he said, according to the records. “I’m the only one that cared for him.” \\nOn Aug. 22, Aguilar told Pinzon that Yonatan had died and asked him to care for her other children. He assumed she would be going to Mexico to bury the boy. Recommended VIDEO: The Woman Who Has Lived Off The Grid For 30 Years In A $3000 House \\nWhen she was just 5 years old, Jill Redwood decided she wanted to live like a hermit. For the last 30 years, Redwood has lived off the grid in a house she made herself out of reused and recycled material. The home's walls are made from cow dung and timber offcuts. (4 hours ago) \\nInstead, she led him to the bedroom closet. According to authorities, Yonatan’s body was wrapped in a blanket and covered in pressure sores from lying on the tile floor. There was foam in his nose and medicinal cups of pink and red liquid near his body. He was going bald. \\n“I took care of the problem by ruining my life,” Aguilar told Pinzon, according to the court records. Police say Pinzon then ran out of the house to a nearby 7-Eleven, where he called authorities. \\nAguilar, 39, is facing murder charges and has pleaded not guilty. \\nR. Lawrence Tripp, Aguilar’s public defender, said Thursday that he had not yet seen a completed coroner’s report and was awaiting more information about Yonatan’s death. \\n“My client is innocent until proven guilty,” he said. Recommended John Travolta Lookalike Evaded Justice For 34 Years \\nA John Travolta fantasist has been found guilty of rape and murder of a girl in north London in 1982. Police using DNA evidence tracked down James Warnock and linked him to the horrific murder of a 17-year-old teenage girl 34 years ago. (4 hours ago) \\nThe Times petitioned the court to release DCFS case records, as well as police and coroner’s reports regarding Yonatan. Michael Levanas, the presiding judge of L.A. County’s Juvenile Court, ordered the release of more than 160 pages of partially redacted records, saying they “shed light on what was going on in the family’s home” and why the boy was left in his mother’s care. \\nYonatan’s family had been the subject of six reports to DCFS alleging possible abuse or neglect, records show. Yonatan’s risk of abuse at home had been marked as “high” four times from 2009 to 2012 by a computerized program intended to gauge social workers’ level of intervention. Social workers, records show, declined to open a case, saying the allegations of physical abuse were inconclusive or unfounded. \\nDCFS Director Philip Browning said that the department had investigated several reports of abuse and neglect and that everyone interacting with the child and his family, including medical workers, teachers and police, thought “the child was in a safe environment.” \\n“We talked to the school nurse, the school doctors, school counselors, the teachers, everyone, including the LAPD investigators, who all said everything was OK,” Browning said, “We were very surprised what occurred here. Our social workers were very distraught. … There is no way to predict this occurring.” \\nUnder the law, he said, the department has the authority to investigate abuse and neglect, but the oversight comes to an end once a determination is made that there is no ongoing issue. Recommended Father & Son Spend 41 Years Hiding In Vietnam Jungle Fearing US Airstrikes \\nA Vietnamese father and son escaped the horrors of the Vietnam war after their village was wiped out in a US airstrike by fleeing and hiding in the jungle for over four decades. Ho Van Lang and his father Ho Van Thanh spent 40+ years living in a tree-house deep in the jungles of the Tay Tra district of Quang Ngai, believing the Vietnam war was still going on. (4 hours ago) \\n“We don’t have the legal authority to follow up,” Browning said. \\nOfficials with the LAPD’s Juvenile Division said that although allegations of physical abuse regarding Yonatan also were reported to police, no police investigation was launched. \\nThe final contact DCFS had with Yonatan came in spring 2012, when teachers made two separate reports about him, saying that he had come to school with a black eye and that he was hungry and hoarding food. \\nAfter that, the boy disappeared. He was pulled out of school and kept hidden as the family moved from home to home, documents show. DCFS officials said they received no further reports about the boy and had no legal right to inquire about him without a report. \\nThe department’s contact with the family began in 2002, before Yonatan’s birth. Aguilar had locked herself in a bathroom and cut her wrist because she was upset with her children’s biological father over his drinking, DCFS records state. Recommended 9/11 WTC Tower Had Power Turned Off For 36 Hours Weekend Before Attack \\nA former data center worker who worked at one of the World Trade Center (WTC) buildings before the 9/11 attacks has come forward with bombshell information that suggests explosives were planted in the buildings in the weeks prior to the attacks on September 11, 2001. (4 hours ago) \\nIn recent months, the four children lived with their mother and stepfather in the cramped one-bedroom house on Santa Ynez Street. Aguilar and Pinzon slept in the living room, and one child slept in a shed in the backyard. Two children shared a bed in the bedroom, while Yonatan — who was reportedly autistic — stayed in the bedroom closet, records state. \\nPinzon told detectives that he had not seen the boy in several years and that Aguilar had told him she sent him to Mexico, according to a coroner’s investigator’s report. The day before Yonatan’s death, Pinzon went to a dollar store to buy school supplies for the children, DCFS records state. Aguilar asked him to buy purple-colored jarabe, Spanish for syrup. \\n“He said that any time he would go to the store, the mother would ask him to bring the syrup,” DCFS records state. “He would ask her why she was buying syrup, if they did not have money.” \\nYonatan’s oldest brother, who is 18, told authorities that the family recently moved to the Echo Park home but that they were able to hide Yonatan in the closet at a previous home as well. \\nIn an interview with police the day after Yonatan’s death, the brother initially lied about knowing Yonatan’s whereabouts, saying he worked a lot and wasn’t home much, the records show. Recommended Three Mile Island Nuclear Meltdown Happened 37 Years Ago \\nMonday marked the 37th anniversary of the Three Mile Island nuclear accident, the first major nuclear power plant emergency to rattle the U.S. and the world. On March 28, 1979, a minor incident at a nuclear power plant in Harrisburg, Pennsylvania quickly turned into a major nuclear accident with the world holding its breath as the reactor core went into meltdown. (4 hours ago) \\n“My mom does not talk about him because he is a troublemaker,” the brother told police. He accused Yonatan of acting out at school and pointed to a social worker observing the interview, saying: “You guys know about it. He has done so many crazy things.” \\nThe older sibling, whose name is redacted in the records, told police Yonatan “was very smart” and “knew what he was doing.” When he was younger, a therapist came to the home almost daily to provide services to Yonatan, the brother said. Yonatan Daniel Aguilar\""}, "time": 1742563149.5367072}