{"duration": 0.09646463394165039, "input_args": {"text": "'Rep. Ron DeSantis ( ) joined SiriusXM host Alex Marlow to highlight five key facts about the GOP’s Obamacare replacement bill on Thursday’s Breitbart News Daily. [The new plan is closer to full repeal than the old GOP bill was. “The original Ryan bill left the architecture of Obamacare in place, which is responsible for driving up premiums and deductibles for millions and millions of Americans,” DeSantis recalled.   “Conservatives looked at that and said that’s the main reason people hate Obamacare, we’ve got to deal with that. The problem, though, that we had is that we have a critical mass of members who, even though they campaigned on repealing Obamacare, did not want to roll back the architecture of Obamacare, so we were kind of at a standstill,” he explained. “And then, with the work of people like Mark Meadows and Tom McArthur from New Jersey, what we were able to do is say, ‘Let’s at least give the states the ability to opt out of the Obamacare regulatory structure and set up functioning markets, which will obviously allow people to have cheaper policies and will lower premiums for people. ’” “That’s not ideal,” DeSantis conceded. “We should just repeal it all. That would be the easiest thing. ” It shows Republicans can work together to craft a replacement bill. “I think the big upshot from this debate, what its revealed, is that people had always said ‘oh, these Republicans, they had seven years to come up with a replacement and they can’t do it.’ That’s not really the issue. I mean, there’s issues with the replacement that I would change if I could, but it is what it is. I think most members are fine with it,” said DeSantis.  He pointed out the political reality that Republicans “don’t have the 216 votes to repeal” Obamacare outright.  “Even though we voted to do it time after time, now we’re here, the iron’s hot, and we have some members that don’t want to do that. That’s why we ended up in this compromise situation. But I believe, and other conservatives believe, that this is as good as we can do right now, given where our votes are,” he said.  It will lower insurance premiums. DeSantis said the new bill “provides a path to lower premiums in a way that the original bill I think did not. ” “Actually there was a good argument that that original bill, by retaining the Obamacare regulations and insurance mandates, but defunding the individual mandate for healthy people to purchase insurance, actually may have created more adverse selection in the insurance markets, which would have of course raised premiums,” he noted. “I think this bill corrects for that and gives governors the ability to really put some market forces back into their insurance markets. That’s what we’re looking to do. ” It takes care of people with   conditions. “I think it’s important to point out, people act like before Obamacare there was no coverage for   conditions. The fact is, if you either got your insurance through employer, Medicare. V. A.  —   pretty much everything but the individual market  —     conditions were covered. It wasn’t an issue,” DeSantis contended.  “Now in the individual insurance market there were roughly, between 2010  —   2014, Obamacare had a   insurance program before the exchanges stood up,” he recalled. “There were about 130, 000 people that signed up for that who were either denied coverage, or denied coverage that was even remotely affordable for them. ” “That’s a legitimate issue, but it’s a very discrete issue,” he said. “It’s frustrating when the media will act like without Obamacare, you wouldn’t have any protection for   conditions for 300   Americans. That’s just not true. Second of all, if you really said   was the reason you needed Obamacare, you didn’t need to do a   bill. You could have done a   bill. You could have appropriated money for those folks. This way, you would have saved all the crippling premium increases and deductible increases, and the plan cancellations, and all the stuff that’s happened with Obamacare.  It cleans up the expensive morass of Obamacare regulations. “Our plan has always been as Republicans  —   whether it’s Tom Price’s plan, whether it’s Paul Ryan’s Better Way, anything that had been proposed  —   was you have to fully repeal Obamacare,” DeSantis said.  “The regulatory structure is dysfunctional. It leads to insolvent markets,” he explained. “And then when you replace it, you do provide continuous coverage protection so that the insurance companies can’t kick you off if you get sick, or jack up your rates, as long as you’re paying your premiums. ”  “If people are not paying premiums and are effectively uninsurable, you still provide a backstop for them, but it’s a general public fund, rather than imposing those costs on the premium holders and jacking up their rates,” he added. “So it’s a way to deal with folks who are not insurable under the traditional definition of insurance that also spares policyholders and the individual market. ” “I mean right now, eHealth. com just came out with how much it costs right now, and then they sell individual market plans unsubsidized, for a family of four the average   and premium costs right now: $14, 300,” DeSantis noted. “That’s more than some people’s mortgage payments, depending on what part of the country you live in, so that’s not a sustainable system. That is being driven because of the dysfunctional Obamacare regulatory structure. ”  “This bill, it not only deals with   conditions, it deals with it three different ways. There’s a massive $100 billion fund. Then there was a   $15 billion fund that is modeled after the main invisible   program. And then there is another $8 billion just with this Fred Upton stuff,” he said, the latter a reference to Rep. Fred Upton’s ( ) decision to support the bill after an $8 billion amendment to protect people with   conditions was added.  “So you’re talking about probably 100, 000 to 130, 000 people, but maybe even less because anyone that has a policy now, it doesn’t matter if you have   conditions, you can renew it and they’re not going to jack up your rates. So it’s taken care of in multiple ways, but basically the media sets a narrative, and I think some Republicans unfortunately accept this, that Obamacare is the only way to deal with   conditions. We’ve never accepted that previous to this debate. We shouldn’t accept it,” DeSantis urged.  “Actually, Obamacare is not good for   conditions because if you’re in Iowa and you have a   condition, and the insurers are totally fleeing the market now, guess what? Nobody gets issued a policy at all,” he added. “So yes, under the law you can’t be discriminated against because of that, but if no one’s issuing a policy to anybody, a lot of good that does you. The first thing you have to have if you want to protect both healthy and sick people is a functioning, solvent market, and Obamacare clearly doesn’t deliver that. ” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742563613.7782075}