{"duration": 0.05888938903808594, "input_args": {"text": "'\\nDr. Matthew Tossman is the principal of Manhattan Early College School for Advertising in New York. \\nDuring a typical school day, Tossman came across a student blasting music through his headphones just a little too loudly in the hallway. \\nAs any principal would do, Tossman asked 18-year-old student Luis Penzo to turn down the music. \\nWhen Penzo refused, Tossman tried to take the headphones off the student\\'s head — and that\\'s when things backfired. \\nAccording to CBS 2 , Penzo punched the principal in the face, and then repeatedly struck him until someone was able to intervene and stop the altercation. Image Credit: Screenshot/CBS News \\nThe principal was left bloodied and severely beaten. The student was arrested and charged with second-degree assault. \\nTossman, who\\'s recovering in his home, wrote a letter to his well-wishers on campus, thanking them for their kind words: \\n\"As many of you know, I was injured yesterday during an incident in school. \\nI am writing to thank you for the outpouring of support that I received from this community; your phone calls, emails, and kind words have lifted my spirits.” \\nHe also noted that he will return to school as soon as he is able. Image Credit: Facebook \\nLittle is known about the student who assaulted Tossman, but the student\\'s lawyer told the New York Post that he has been unable to cope with his emotion since his mother passed away a year ago from a brain aneurysm. \\nPenzo\\'s attorney claimed the student\\'s violent reaction was an outburst fueled by his inability to properly grieve. \\nRegardless, this is yet another incident of student-on-teacher violence, a worrying trend in the United States that\\'s becoming all too common. \\nFor example, a teen brutally attacked a teacher in Memphis back in May. \\nThe whole incident was caught on camera: \\nA similar incident happened in Georgia at Mt. Zion High School just this week when a 68-year-old female teacher was assaulted by a 17-year-old male student. \\nThe teacher\\'s daughter, Anna Rodriguez, described the beating to 11 Alive : \\n“He jumped up and started screaming at her and started swearing at her, and kept, like, bucking up on her. So she put her arms up to brace herself, so he grabbed both of her breasts and twisted them very hard, and then threw her to the ground.” \\nPenzo is currently being held on a $5,000 bond. '"}, "time": 1742563324.3655858}