{"duration": 0.01594400405883789, "input_args": {"text": "'Negroes in Italy: “We Want Armani and Boss” \\nAndrew Anglin Daily Stormer October 28, 2016 \\nYou’ve seen Pakistanis demand better internet connections, you’ve seen Afghanis demand bigger TVs, you’ve seen North Africans demand better and more hookers – now witness Black Africans demand designer clothing. \\nThese videos of helpless “asylum seekers” demanding luxury goods and services will never, ever get old. \\nIl Giornale : \\nWhen they get “standard” cloths from Caritas or the asylum seeker reception system it makes them unhappy because they are not designer clothes. They want Armani or Boss clothes, or perhaps also Pirelli shoes. \\nThis was revealed by the president of the Sar.ha Cooperative. He has been hosting migrants at the Hotel Byron in Malcontenta (Venice region). In recent days a controversy broke out about the coop’s decision to put padlocks on the windows to prevent migrants escaping during the night. The immigrants protested in the street, also against the food which they considered to be not good. Apparently there was also something else behind it. The migrants are demanding brand-name clothes, from high-fashion designer labels. Not normal jeans: they want Armani or Boss. \\n“Unfortunately they come to Italy with the asylum reception systems of northern Europe as a model,” saod Lorenzo Chinellato, presidente of the Sar.ha cooperative Sar.ha, “when they arrived we gave them clothes, standard clothes. They want brand-name clothes, Armani and Boss, they asked for Pirellli shoes. These are their models. When they came to us, they didn’t have clothes, but they all had smartphones”. \\nTranslation via Diversity Macht Frei . \\nIn the video you can also hear the standard complaints about the food only being “pasta and rice,” with one colored person actually complaining about how there are too many refugees. \\nJust as all women literally believe that all men exist to serve their personal needs, all colored people believe Whites exist for the sole purpose of giving them free everything. And not just any free everything – the highest quality of free everything. \\nBut whereas it is perfectly natural for women to believe that men exist only to serve them, as this is a part of their hardwired psychology (as well as in some simple way absolutely true – the primary male purpose in life is to protect and raise off-spring and women have to be taken care of in order to make this happen), these colored people have developed this attitude based on our pandering to them, bowing down to them, treating them as superior beings. We have presented ourselves as existing only to serve them, and they have taken us at our word.'"}, "time": 1742628450.8082047}