{"duration": 0.1446230411529541, "input_args": {"text": "'The artist Pedro Reyes is a biting social critic whose pieces often hold out hope  —   in the face of overwhelming evidence to the contrary  —   that things will get better. In “Palas por Pistolas” (“Shovels for Guns”) in 2008, he set up a program that allowed residents of Culiacán, Mexico, a city devastated by shootings, to trade in their guns for food stamps or household appliances the guns, more than 1, 500 of them, were melted down and turned into shovels. In a 2013 work with similar implications for good but a much higher threshold for rethinking, he came up with the   a burger made with plentiful, crunchy grasshopper protein instead of beef. But when he and the New York public art organization Creative Time began discussing a piece to coincide with the homestretch of the American presidential campaign, Mr. Reyes settled on an idea that allowed little in the way of light: the professional haunted house, an essentially American creation (by way of Grand Guignol and Victorian ghostiana) for generating shock and fear. “The haunted house has never really been considered an art form, but it’s a true folk art  —   every town has one at Halloween,” said Mr. Reyes, whose own version, “Doomocracy,” opens Friday within the sprawling Brooklyn Army Terminal in the Sunset Park neighborhood. “Haunted houses don’t have a narrative or make sense. You’re there to be terrified, to be a masochist. So those are the limits I decided to work within for this. ” Or, as Nato Thompson, Creative Time’s artistic director, puts it: “We sometimes joke that this is a     where no matter which path you choose you always die. ” If that seems like a bleak metaphor for Clinton vs. Trump  —   or “Brexit,” or the failed Syrian   or the surprise electoral defeat of the Colombian peace plan or any number of world political morasses  —   it well could be. “The strange thing about this project is that the worse things are in the news, the better it is for us,” Mr. Reyes, 44, said early this week in Brooklyn, preparing for final   with a group of nearly 50 actors, under the direction of Meghan Finn, who will play all manner of ghouls  —   business executives, police officers, poll workers, drone pilots, overprescribing doctors  —   within the haunted house. But Mr. Reyes added that the house’s   fright scenarios are less about the failures of political leaders and more about systems at work in the world economy  —   the military complex, the financial industry, the gun industry, the   industry and Big Pharma, just to name some headliners  —   that have become so vast they seem to govern themselves, rendering political control almost ineffectual. And making satire a tall order. For example, one room of “Doomocracy” (through Nov. 6, groups of a dozen will be led through the rooms at timed intervals beginning at 6 p. m.) is a cozy, profoundly creepy funeral home, presided over by an   undertaker who explains that the home specializes in coffins made in the shape of the   item most loved by the deceased. A   coffin in the shape of a   Twinkie dominated the room on a recent visit. And during a rehearsal in September, an actor tinkled the organ keys, intoning earnestly: “I’d like to think that in the afterlife, kids can taste their coffins and they’re happy,” enjoying “the milkshake coffin, the fried chicken coffin” and many other available flavors. Then he crooned: “Every kid wants a candy coffin. ” In the interest of avoiding spoilers (something a   reporter rarely has to worry about) some of the scenarios in the piece are probably best undescribed. But it might give an idea of the range of topical phantasmagoria to say that one room involves cheerleaders singing about abortion. Another features a kind of Tupperware party for handguns. (“I think for a lot of liberal people who have never been around guns, it’s going to be a pretty tense situation,” Mr. Reyes said.) There will be a classroom presided over by a racially   computer avatar spouting corporate   through a large computer screen  —   “I Googled ‘classroom of the future,’ and that’s pretty much what it looked like,” Mr. Reyes said  —   and a fake cocktail party hosted by a rich couple who are having their own spaceship built. “They just have so much money that they’re into racing space rockets,” said Mr. Reyes, a compact, bespectacled man who comes off in person like a philosophy professor moonlighting as a   comedy host. “They asked Zaha Hadid to design their spaceship, but then she died, so of course they got Frank Gehry, who’s done most of their houses. ” Ms. Finn, who once directed a play that took place inside a New York City taxi and along the streets it traversed, said that compared even with those logistical challenges, Mr. Reyes’s project “is crazy, totally nuts  —   in the best possible way. ” The actors will have to repeat their parts, written by the playwright Paul Hufker  —   some of them highly emotional and physically demanding  —   40 times over the course of a night. “When I enlisted people to be in this, I told them that it was going to be an act of political rigor,” Ms. Finn said. “It really is endurance performance. ” Katie Hollander, Creative Time’s executive director, said that the organization hadn’t planned earlier in the year to present a major fall piece. But when Mr. Reyes proposed a “  haunted house,” she said, “the idea stuck with us, and as the political climate became more and more terrifying to a certain extent, it just became more and more relevant, and we knew that the time this had to happen was now. So we jumped from the frying pan into the fire. It’s not a usual thing for us to do something of this complexity in such a short period of time. ” The Army Terminal, once the largest military supply base in the United States and now a center for light manufacturing, plays a starring role itself. Its towering main atrium, punctuated by concrete balconies once used for transfer of wartime supplies from train to ship, looks like a dystopian backdrop from “Brazil” or “Metropolis. ” And the terminal’s   emptiness will contribute, Mr. Reyes said, to a sense of isolation almost impossible to find in the city. “It’s really pretty freaky here at night. ” Especially against the backdrop of this election, Mr. Thompson said, the project made a kind of perverse sense in 2016, the centennial of the birth of the Dada art movement. “I think that’s the kind of moment we’re in,” he said. “It seems like a joke but the joke is really not funny at all. ” Mr. Reyes acknowledged that the piece would probably be received far differently were it presented in suburban Ohio or rural Tennessee he knows he is preaching mostly to a choir of liberal art lovers who oppose many of the   demons he holds up to ridicule. “But I still very much hope I can offend at least a few people,” he said. “And it’s going to be so intense that I think people are going to be shaken and pretty worn out after the hour they’re inside. ” Which might be worth something in itself. “This piece’s inner logic isn’t about hope, but that doesn’t mean that I’ve lost hope in art’s ability to help change things,” Mr. Reyes said. “I still think it’s crucial to keep a critical muscle that mocks the motivations of the system  —   to say, ‘Why are we doing this?’ and to say, ‘This is crazy. ’”'"}, "time": 1742563959.8825564}