{"duration": 0.06079745292663574, "input_args": {"text": "'on November 16, 2016 4:56 pm · \\nIt was just a few days ago that Bernie Sanders responded to Trump’s election win with the perfect message from Democrats. He said : \\n“If Donald Trump takes people’s anger and turns it against Muslims, Hispanics, African Americans and women, we will be his worst nightmare.” \\nAnd from what was just announced, it seems that Sanders has every intention of making good on that warning. Earlier today, the Vermont Senator was named chair of outreach during a closed-door Senate Democrat caucus meeting, according to The Hill . In his new role, Sanders will lead outreach to blue-collar voters — the very voters who became Trump supporters this year. Sanders will also be the ranking member on the Senate Budget Committee. Acknowledging that he has a “heavy responsibility to help shape the priorities of the United States government,” Sanders said: “I’m going to do everything that I can to make sure that the budget that leaves the United States Congress is a budget that represents the needs of working families and a shrinking middle class and not billionaires.” With the announcement of Sanders’ new position, Trump is definitely going to be a nervous wreck. He’s spent his entire presidential campaign claiming that he would help the working class, and now Sanders is in the position to challenge him and hold him to it for the next four years. By elevating Sanders to this new role, Democrats are moving to a more grassroots message, fully aware that Sanders’ presidential campaign and vision for America resonated with many voters. As we saw with Sanders’ popularity in the primaries, the Vermont Senator struck a nerve with workers and families, making him the perfect candidate to go up against Trump as he takes office. Sen. Debbie Stabenow (D-Mich.) commented on Sanders’ new responsibility: “We want to expand on that, and he will be reaching out to all our allies. We have a tremendous amount of talent in our caucus and we want to make sure everyone is contributing.” Sanders hardly needed this promotion to upset Trump, as he’s been one of the most outspoken politicians on Twitter since Trump’s win: Twitter Twitter Twitter \\nHowever, Sanders’ new role is great news for our country, and we know he’s going to give Trump hell. \\nFeatured image via Zach Gibson and Alex Wong / Getty Images Share this Article! Author: Vera My passion is bringing attention to human rights and equality issues. In addition to writing for Addicting Info, I also run a website and digital magazine dedicated to social issues and promoting equality in all forms. Search '"}, "time": 1742563757.796669}