{"duration": 0.02341485023498535, "input_args": {"text": "'Emails and Groping: Our Halloween Election Keeps Scaring Us to Death   \\nInformed Comment. \\nAll Hallow’s Eve, contracted now to Halloween, became conflated with the Scottish and Irish pagan Samhain, the harvest festival marking the end of autumn and the beginning of winter. It was an in-between time, when the barrier between this world and the next shimmered and let in decrepit old sprites and gods and monsters that had begun slipping away into the aether with the advent of Christianity. And, the souls of the dead of the past year intruded to visit their homes before being shunted off to the netherworld, as well. Since Celts thought power resided in the head, they often beheaded defeated enemies, so All Hallow’s Eve was the occasion for a fair amount of fumbling about on the part of those who had died violently. \\nThe 2016 election is very much like Samhain, i.e. like Halloween, in breaking down ordinary time and reality, and letting ogres of the past into our daily lives. \\nSo we can’t get out of our minds the image of those tiny hands, back in 1982, and 1996, and 1998, grabbing parts of strangers’ anatomy. The simulacrum of the grabber and kisser and predator has popped out into 2016 and wants to replace George Washington and Ike Eisenhower. We are being asked, with a straight face, to elect a groper in chief. A puritan people who drove Gary Hart from politics for some hanky panky on The Monkey Business and impeached Bill Clinton even though he never got to third base, is now all right with making president someone who groped a porn star and then offered to drop $10,000 when he couldn’t get his way. We are entranced and willing to give our fates into the hands of a weird combination of Frankenstein’s monster and the Vampire Lestat. \\nAdvertisement Square, Site wide \\nThe horror of Halloween always lies in the evil deeds of the past now resurrected, as with Syrian director Moustapha Akkad’s “Halloween” films. \\nAnd we’ve had to hear again about the soiled blue dress and the conquests of Bill. \\nAnd again about the Anthony Weiner sexting. And to learn what we never wanted to know, that the FBI is investigating him for sexting with a minor. I mean, if that isn’t a Halloween horror movie I don’t know what is. \\nAnd Herbert Hoover has come back to tell us we’re in a Great Depression and the only way to get out of it is to halt budget deficits and tighten our belts and lower taxes on the rich (the opposite of how FDR actually got us out of the Depression). The creepy dead and the blighted fading deities of old have come crowding through our 2016 rift in the time space continuum. Long-since failed and discredited trickle down economics has been cheekily resurrected. Why, if only you give more of the nation’s money to the super-rich, they’ll make you rich too. You’ll see. Just wait. And wait. And wait. \\nIt is as though the worst nightmares of the old Soviet Communists finally came through, but with all the irony of history, only after they themselves had faded into the netherworld. \\n( Human Rights \\nAnd then there is the revived horror of the Japanese internment and the exclusion of Holocaust-threatened Jews from the United States, only with the perverse magic of Samhain the Japanese have become Mexicans and the Jews have become their spiritual cousins, the Muslims, the other Abrahamians. \\nSo no wonder Hillary Clinton’s emails can’t be killed. They are Undead emails, slipping in at the fraying of dimensional reality in this season of resurrected monsters and corpses, to haunt us. \\nOnly the silver stake of an actual election can finally kill these spiteful specters, and save us from this long night of phantasy horror. TAGS:'"}, "time": 1742628576.63581}