{"duration": 1.3960630893707275, "input_args": {"text": "'After learning she had a high genetic risk for breast cancer, Dane’e McCree, like a growing number of women, decided to have her breasts removed. Her doctor assured her that reconstructive surgery would spare her nipples and leave her with   breasts. It did. But while Ms. McCree’s rebuilt chest may resemble natural breasts, it is now completely numb. Her nipples lack any feeling. She cannot sense the slightest touch of her breasts, perceive warmth or cold, feel an itch if she has a rash or pain if she bangs into a door. And no one warned her. “I can’t even feel it when my kids hug me,” said Ms. McCree, 31, a store manager in Grand Junction, Colo. who is raising two daughters on her own. Plastic surgeons performed more than 106, 000 breast reconstructions in 2015, up 35 percent from 2000. And they have embraced   techniques to improve the appearance of reconstructed breasts and give them a more natural “look and feel”  —   using a woman’s belly fat to create the new breast, sparing the nipple, minimizing scarring with creative incisions and offering enhancements like larger, firmer lifted breasts. Doctors often promise patients that their reconstructed breasts will look even better than the breasts they had before. But they often describe the potential consequences of the surgery in ambiguous terms. Women say the fact that sensation and sexual arousal will not be restored is not made clear. The main problem is using the word “feel,” said Dr. Clara Lee, an associate professor of plastic surgery at Ohio State University who does reconstructive breast surgery. Surgeons who use a woman’s own tissue to recreate a breast might tell the patient that it will “feel” like a natural breast, referring to how it feels to someone else, not the woman. “We don’t always mean what’s important to the patient,” Dr. Lee said. “Our focus has been on what women look like,” said Dr. Andrea L. Pusic, a plastic surgeon at Memorial Sloan Kettering Cancer Center who specializes in breast reconstruction and studies patients’ quality of life after breast surgery. “What it feels like to the woman has been a kind of blind spot in breast surgery. That’s the next frontier. ” The focus on how breasts look and feel to other people, rather than how they feel to the patient, speaks to the fact that women are still largely judged by their appearance, said Victoria   a professor and the head of feminist, gender and sexuality studies at Wesleyan University. “There’s such a strong cultural gaze at women’s breasts,” Dr.   said. “It does raise the question: Who is breast reconstruction for?” Adding to the confusion has been the excitement over surgical innovations, particularly “ ” mastectomies. During a traditional mastectomy, doctors remove the nipple and scoop out breast tissue, causing considerable nerve damage. But now, in certain cases, the nipple can be spared, raising hopes that some feeling will be preserved. The actress Angelina Jolie wrote about her   preventive double mastectomy in a New York Times   in 2013, inspiring other women at high risk of breast cancer to have their breasts removed. But the   surgery has yet to fulfill its promise, and in most cases, sensation is not restored. For many women, the loss of sensation in their breasts can be devastating. “No one said, ‘You will not have sexual arousal in your chest again,’” Ms. McCree said. “I thought that because I was able to keep my nipples and the blood supply, I’d keep my feeling. ” Eve Wallinga, 60, a cancer survivor from St. Cloud, Minn. said many women who choose   mastectomies believe that reconstructive surgery will make them “whole” again and are not told that the sensation lost during the surgery is unlikely to come back. “They go into it thinking everything will be the same when they come out  —   they’ll just have   stuffing in their breasts,” Ms. Wallinga said. “Some are very angry and upset, and say, ‘Why wasn’t I told?’ They feel very betrayed. ” The lack of sensation is potentially dangerous. Women who have had mastectomies and reconstruction surgery have sustained severe burns on their breasts from heating pads, hair dryers, curling irons, sunbathing and overly hot showers. Several women interviewed recounted times when they had not realized a bra was cutting into their skin until they saw blood. Many described embarrassing “wardrobe malfunctions,” when a bathing suit or   shifted to reveal part of their breast without their knowing because they did not feel the air on their exposed skin. A doctor recalled a patient who had burned herself while draining hot pasta for dinner she did not realize she was hurt until she saw red marks on her skin in the shower several hours later. Some women described losing the sense of the position of their breasts. “It’s not just about the sexual arousal, it’s the awkwardness,” said Cathy Balsamo of Berkeley Heights, N. J. “You can’t figure out your space  —   almost like you’re bigger than you really are. It’s a bizarre feeling. ” She added, “When I put on a sports bra, I have to look in the mirror and focus on the breasts to make sure they’re in the pocket where they belong. ” Nerve damage during mastectomies can create   pain syndrome. Some women experience tingling sensations, and others have debilitating pain. Patients say physicians minimize the condition, even though it is fairly common, affecting anywhere from 25 percent to 60 percent of mastectomy patients, according to published studies. Michelle Lamon Romero, 45, of East Longmeadow, Mass. said she had been incapacitated by pain since having a double mastectomy two years ago. She lost her job and now relies on a cocktail of five drugs to keep the pain at a manageable level. “The surface of the skin is numb  —   if you run a needle over it, I can’t feel it,” Ms. Romero said. “But I can feel the pain underneath just radiating everywhere. ” She added that her plastic surgeon had told her that she was an anomaly and that “this isn’t real, it’s all in your head. ” Other patients Ms. Romero has met through Facebook have had the same experience. “So many women who join are just relieved to know they’re not alone,” Ms. Romero said. “They all start out the same way: ‘My doctor told me I was crazy. ’” Most surgeons agree that the best chance for sensory restoration after a mastectomy is a procedure that uses a woman’s own body tissue rather than an implant because nerves have a better chance of regenerating in natural tissue. The procedure has produced modest results. If sensation returns, it is usually limited to the perception of pressure, without improved sensation related to touch, temperature or sexual arousal. “It’s a shadow of the degree of sensation that people had before,” said Dr. Edwin G. Wilkins, a plastic surgeon at the University of Michigan who is running a large study on reconstruction outcomes and complications with Dr. Pusic. “It’s a poor substitute. ” Dr. Aldona J. Spiegel, a plastic surgeon in Houston who has pioneered techniques to reconnect nerves in the breast and restore sensation, said the procedure remained promising. “I tell patients that if I am able to reconnect nerves in the reconstructed breast, it will improve the sensation. But I never tell them it will be normal,” Dr. Spiegel said. She added that many of her patients had shown “very significant improvement. ” One of her patients, Karen Holt, 65, a retired principal from Houston, had her left breast removed and reconstructed from her own tissue 14 years ago. Ms. Holt knows she’s unusual, she said, but claims she has “just about as much erogenous sensation in the left breast as in the right. ” But doctors say such results are rare. “You don’t want to give people false hope,” said Dr. Frank J. DellaCroce, a plastic surgeon and a founder of the Center for Restorative Breast Surgery in New Orleans. Restoring sensation is “one of those things that’s regarded as the holy grail of breast reconstruction,” he said. “But no one has shown in any scientific article to date that we’re able to return sensation in any reliable way. ” Dr. Christine Laronga, a breast oncologist at the Moffitt Cancer Center in Tampa, Fla. said she tried to make clear to patients that feeling would not be restored after reconstruction, telling them, “It may look like a breast, but it won’t feel like a breast. ” While doctors agree on the need for a mastectomy procedure that spares nerves, they note that the goal of the surgery is to make sure the cancer is gone. There is also a risk that efforts to restore sensation will trigger a pain syndrome. “It’s a very tricky area,” said Dr. Ida K. Fox, a plastic surgeon at Washington University in St. Louis who specializes in breast and hand surgery. “You don’t want to restore sensation and give someone chronic pain. ” Ms. Balsamo, 50, who had a double mastectomy after testing positive for a genetic mutation that increases breast cancer risk, said she did not regret the surgery, but wished she had been better informed. “I just wish I had known,” Ms. Balsamo said. “They said there’s going to be a difference in the sensation  —   not that there wouldn’t be any. Before you go in, shouldn’t you know the facts?”'"}, "time": 1742563551.730079}