{"duration": 0.054802894592285156, "input_args": {"text": "\"Does Golf Lead To Uncontrollable Rage? By Tanner Bisbee on March 14, 2015 Subscribe \\nWe all have a friend who’seems to be constantly frustrated or instigated easily and we assume they have some type of anger issue.?But finding out if they really have an anger problem may be as simple taking them out on the Golf Course. Public Domain Image \\nGolf, a widely played sport seems to be worst?fuel for those who get ticked off easily.?Golf forces us to rely on our own skill, proper technique and the idealistic expectation of always sending the small white ball 300 yards down the fairway, however for most of us?it doesn’t work out this way. For the vast majority of us the result is a ball that slices 50 yards in the woods or only makes 100 yards down the fair. \\nAnd for many of us this result isn’t a problem, but for those that have godly expectations or temper issues, it’s catastrophic. The very first tell tale sign is the immediate reaction after the mishit ball. Just watch your friend as soon the ball leaves the tee. Their is a very good chance that if the ball starts to shift or bend one way in the air, his face will go still and his arm will go the top of his head. \\nBut what next? For many of us, we walk to our bag in disbelief wondering why we botched that hit, but we ultimately let it go. However, for the temperamental person they will walk off in a huff and throw their club in the bag and keep going. And after awhile the rage begins to build up until they snap. It happens to many of us, especially on days where the ball just won’t roll our way, \\nThis moment can also be one of the funniest moments for the other player or spectator.?Watch as your friend unhappily steps up to the ball. Watch as he hits the ball, if the shot is bad look directly back at your friend. See as his discouragement only turns into anger. It’s almost like something in his mind just got tangled. Now the truly temperamental person will take one of three?actions: starts screaming and swearing throw his club in the woods snap the club in half, my personal favorite \\nLike this guy did: \\nSo what should you do when your friend freaks out? Film it. At least my first reaction is too film it, because everybody on YouTube loves a freak out. So step aside cute kittens, there is a new viral video coming to town. \\nAbout Tanner Bisbee \\nTanner Bisbee hails from the great State of Maine. He's a full time college student and serves on the football staff at school. His most notable work to date is his book Modern Day Sports Blog. To read more check out my blog http://moderndaysportsandpolitics.blogspot.com/ Connect\""}, "time": 1742561944.056551}