{"duration": 0.05874133110046387, "input_args": {"text": "'WASHINGTON  —   President Trump lashed out at the nation’s intelligence agencies again on Wednesday, saying that his former national security adviser, Michael T. Flynn, was brought down by illegal leaks to the news media, on a day of new disclosures about the Trump camp’s dealings with Russia during and after the presidential campaign. “From intelligence, papers are being leaked, things are being leaked,” Mr. Trump said at a White House news conference with Benjamin Netanyahu, the prime minister of Israel. “It’s a criminal action, criminal act, and it’s been going on for a long time before me, but now it’s really going on. And people are trying to cover up for a terrible loss that the Democrats had under Hillary Clinton. ” With his statement and a burst of   posts he made on Twitter, Mr. Trump tried to shift attention from damaging questions about contacts with Russia by Mr. Flynn and others close to the president, arguing that the outrage is not those contacts, but the leaks about them. He revived his charge that the allegations of a “Russian connection” were nothing more than a Democratic conspiracy, fed to a receptive news media to distract from the mistakes made by Mrs. Clinton during the campaign. The White House has said that Mr. Trump demanded Mr. Flynn’s resignation on Monday night, after it was revealed that Mr. Flynn, a retired   Army general, had misled Vice President Mike Pence and other officials about his conversations with a Russian diplomat. But on Wednesday, the president said that Mr. Flynn had “been treated very, very unfairly by the media,” undercut by “documents and papers that were illegally  —   I’d stress that, illegally  —   leaked. ” Earlier, he had posted on Twitter, “Information is being illegally given to the failing @nytimes  @washingtonpost by the intelligence community (NSA and FBI? ). Just like Russia” The New York Times and The Washington Post had reported on the contacts Mr. Flynn had with Russia’s ambassador to Washington, Sergey I. Kislyak. Mr. Flynn initially told Mr. Pence and others that he and Mr. Kislyak did not discuss matters of substance, like United States sanctions against Russia, but in the days after Mr. Trump’s inauguration, the Justice Department notified the White House that he had not been forthright about the conversations. The Times also disclosed broader contacts between Russian intelligence officials and people with ties to the Trump campaign and Mr. Trump’s business empire during and after the campaign, and other news organizations followed with similar reports. The president declined to address that revelation and, as he has at other times in recent days, took questions at his news conference only from conservative news organizations and ignored more challenging questions shouted to him as he left the podium. So far, the White House has had little success in trying to shift the narrative from the Russian contacts to accusations about the leaking of sensitive information by the intelligence agencies, as well as by the F. B. I. Mr. Trump used a similar strategy during the transition, after disclosures that the intelligence agencies presented him with a dossier containing potentially compromising  —   but unsubstantiated  —   information that Russian officials had collected on him during his travels to Russia. On Wednesday, Mr. Trump said on Twitter, “The fake news media is going crazy with their conspiracy theories and blind hatred. @MSNBC  @CNN are unwatchable. @foxandfriends is great!” The president also praised a column by Eli Lake of Bloomberg View, which criticized the selective leaking of intercepted communications between Mr. Flynn and Mr. Kislyak. Mr. Lake went on to suggest, however, that Mr. Flynn had been sacrificed to protect other officials, potentially including the president himself. Mr. Trump, as he has before, rejected allegations that his policy toward Russia was being compromised. “Crimea was TAKEN by Russia during the Obama Administration. Was Obama too soft on Russia?” he posted on Twitter.'"}, "time": 1742564059.1885228}