{"duration": 0.0731503963470459, "input_args": {"text": "'Michael D’Antonio never planned to release the recordings of his interviews with Donald J. Trump. The intimate conversations, which totaled five hours, were a research tool for his 2015 biography of the real estate mogul. But something changed. A year later, Mr. Trump decided to run for president. And Mr. D’Antonio was deeply alarmed by the kind of campaign that Mr. Trump decided to wage. So a few weeks ago, the biographer allowed me to listen to the taped interviews. Those recordings, which capture Mr. Trump in unusually candid, searching and unguarded ways, are the basis for a special   episode of The  . In both, Mr D’Antonio and I explore Mr. Trump’s emotional life, pyschology and behaviors, relying heavily on Mr. Trump’s own words from the tapes. The recordings reveal dimensions of Mr. Trump we rarely see. He describes his lust for fighting in high school. He revels in the first time his name was mentioned in a newspaper. And he acknowledges a fear that the adoration of strangers, a sustaining force in his life, may someday fade away. Episode No. 1 focuses on Mr. Trump’s reluctance to confront the traumas of his childhood: his parents’ decision to send him off, at age 13, to a distant and discplined miliary academy his difficult relationship with his father and the tragic death of his older brother. “What’s kind of tragic about Donald is, he doesn’t know himself and he really doesn’t want anyone else to know him,” Mr. D’Antonio tells me in Episode No. 1. He goes on: Mr. D’Antonio expands on that idea of a superficial reality later in our interview, as we talk about Mr. Trump’s lavish lifestyle. “I think there is something about him that pursues this display of luxury as a signal to the world,” he says. “He thinks that we think that this is what a billionaire’s life is supposed to look like. So it’s not even Donald Trump’s life that he’s living. What he’s living is the life of an imaginary billionaire. ” Episode No. 2 further explores the grown man Mr. Trump became: fixated on his own celebrity, anxious about losing his status and contemptuous of those who fall from grace. That episode also tackles the question of why Mr. Trump decided to run for president. “Donald Trump is a bottomless pit of need, and the presidency was the only object big enough that he could imagine seizing to fill up that hole,” Mr. D’Antonio says. “It’s not going to be enough, were he to win. “And the fact that he’s perhaps going to lose is going to be so trying for him to absorb, and it’s going to mean that that big space remains empty and unfilled,” Mr. D’Antonio continued. “He is likely to go around the world trying to seek attention in the style of a president  —   even though he’s not actually holding the office  —   in an attempt to compensate for it. “If we think we’ve seen and heard a lot from Donald Trump this year, I think we haven’t seen or heard anything yet. ” From a desktop or laptop, you can listen by pressing play on the button above. Or if you’re on a mobile device, the instructions below will help you find and subscribe to the series. On your iPhone or iPad: 1. Open your podcast app. It’s a   app called “Podcasts” with a purple icon. (This link may help.) 2. Search for the series. Tap on the “search” magnifying glass icon at the bottom of the screen, type in “The  ” and select it from the list of results. 3. Subscribe. Once on the series page, tap on the “subscribe” button to have new episodes sent to your phone free. You may want to adjust your notifications to be alerted when a new episode arrives. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, tap on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode. On your Android phone or tablet: 1. Open your podcast app. It’s a   app called “Play Music” with an    icon. (This link may help.) 2. Search for the series. Click on the magnifying glass icon at the top of the screen, search for the name of the series and select it from the list of results. You may have to scroll down to find the “Podcasts” search results. 3. Subscribe. Once on the series page, click on the word “subscribe” to have new episodes sent to your phone free. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, click on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode.'"}, "time": 1742561797.880273}