{"duration": 0.11299800872802734, "input_args": {"text": "' White Supremacy Elected Trump? By Paul Craig Roberts\\nNovember 10, 2016 \" Information Clearing House \" - The American electorate\\x92s preference for Donald Trump and Bernie Sanders has established two facts. One is that the majority of the American people do not believe the media presstitutes. The other is that only the \\x93progressives\\x94 and \\x93liberals\\x94 who inhabit the Atlantic Northeast and Pacific West coasts believe the presstitutes.\\nTrump\\x92s election to the presidency has confirmed these holier-than-thou souls in their strongly held belief that America is a white trash racist country. They have told us this all day long today.\\nFrom these people and from the presstitutes we hear that white supremacy elected Trump. This is their propaganda, the intention of which is to discredit a Trump administration before it is inaugerated. Funny how white supremacy elected black Obama twice previously.\\nTruthout has lost it completely. John Knefel declares \\x93The David Dukes of the World Prevail.\\x94\\nKelly Hayes declares \\x93White Supremacy Elected Donald Trump.\\x94\\nWilliam Rivers Pitt declares \\x93We have elected a fascist that Mussolini would have recognized on sight.\\x94\\nHillary carried only a handful of states, the states that comprise the One Percent\\x92s stomping grounds. Yet Amy Goodman of Democracy Now sees meaning in political writer John Nichols claim that as Hillary carried New York and California, she won the popular vote and should be in the White House. I remember a few days ago George Soros saying that Trump would win the popular vote, but that the electoral vote would go to Hillary, thus ridding the oligarchs of Trump.\\nEarth Justice promises to hold Trump accountable. Trump who promises to end the threat of nuclear war with Russia and China, thereby doing more to save animal and human life than the entirety of the Democratic Party and environmental organizations, is going to be held accountable by an organization that allegedly is beyond politics and is dedicated to preserving animals from destruction.\\nThe ACLU, of which I am a member, has also put \\x93on notice\\x94 the president-elect who has said he will save us from nuclear war. Faced with this idiocy from the ACLU, I will not renew my membership.\\nFeminists tell us that we are \\x93grieving, scared, and in shock,\\x94 and that \\x93it is critical that we stand together and support each other.\\x94\\nJeremy Ben-Ami of the J Street Jewish Community tells us that it is \\x93an incredibly sad and difficult day. For tens of millions of Americans who share a core belief in tolerance, decency and social justice, the election results are a severe shock. In this challenging moment, we turn to one another for comfort and community. During this election, J Street made unequivocally clear our conviction that Donald Trump is not fit to be president of the United States.\\x94\\nVan Jones, a CNN commentator, said that Trump\\x92s election is a nightmare, \\x93a deeply painful moment,\\x94 a \\x93whitelash\\x94 against minorities. While he bemoaned the pain inflicted upon poor little presstitute Van Jones, he didn\\x92t mind insulting the American electorate and the President-elect of the United States. After all, Van Jones sees that as his racist prerogative.\\nAnd so, the holier-than-thou crowd prefers Hillary, despite her unambigious position that she would maximize conflict with Russia and China, provoke direct military conflict between the US and Russia by imposing a no-fly zone in Syria, attack Iran and other of Israel\\x92s targets, further enrich her Wall Street handlers by privatizing Social Security, and prevent any dissent from the lowly people class of her high-handed ways. If William Rivers Pitt sees Trump as a Mussolini fascist, Trump is too mild for Pitt. He prefers Hillary, a Hitler to the third power.\\nThe progressives have totally discredited themselves just as the presstitutes have done. Their need for a bogyman to nourish their hysteria indicates serious psychological disturbance. They actually prefer the risk of Armageddon to peace among nuclear powers. As their 501(c)3s live off corporate contributions, they prefer globalist corporate profits to jobs for ordinary Americans.\\nThese are the people who think of themselves as our instructors and our betters.\\nIf only Trump could exile the lot of them. They are anti-American to the core.\\nThe Working Class Won The Election\\nBy Paul Craig Roberts\\nNovember 10, 2016 \" Information Clearing House \" - The US presidential election is historic, because the American people were able to defeat the oligarchs. Hillary Clinton, an agent for the Oligarchy, was defeated despite the vicious media campaign against Donald Trump. This shows that the media and the political establishments of the political parties no longer have credibility with the American people.\\nIt remains to be seen whether Trump can select and appoint a government that will serve him and his goals to restore American jobs and to establish friendly and respectful relations with Russia, China, Syria, and Iran.\\nIt also remains to be seen how the Oligarchy will respond to Trump\\x92s victory. Wall Street and the Federal Reserve can cause an economic crisis in order to put Trump on the defensive, and they can use the crisis to force Trump to appoint one of their own as Secretary of the Treasury. Rogue agents in the CIA and Pentagon can cause a false flag attack that would disrupt friendly relations with Russia. Trump could make a mistake and retain neoconservatives in his government.\\nWith Trump there is at least hope. Unless Trump is obstructed by bad judgment in his appointments and by obstacles put in his way, we should expect an end to Washington\\x92s orchestrated conflict with Russia, the removal of the US missiles on Russia\\x92s border with Poland and Romania, the end of the conflict in Ukraine, and the end of Washington\\x92s effort to overthrow the Syrian government. However, achievements such as these imply the defeat of the US Oligarchy. Although Trump defeated Hillary, the Oligarchy still exists and is still powerful.\\nTrump said that he no longer sees the point of NATO 25 years after the Soviet collapse. If he sticks to his view, it means a big political change in Washington\\x92s EU vassals. The hostility toward Russia of the current EU and NATO officials would have to cease. German Chancellor Merkel would have to change her spots or be replaced. NATO Secretary General Jens Stoltenberg would have to be dismissed.\\nWe do not know who Trump will select to serve in his government. It is likely that Trump is unfamiliar with the various possibilities and their positions on issues. It really depends on who is advising Trump and what advice they give him. Once we see his government, we will know whether we can be hopeful for the changes that now have a chance.\\nIf the oligarchy is unable to control Trump and he is actually successful in curbing the power and budget of the military/security complex and in holding the financial sector politically accountable, Trump could be assassinated.\\nTrump said that he will put Hillary in prison. He should first put her on trial for treason and war crimes along with all of the neoconservatives. That would clear the decks for peace with the other two major nuclear powers over whom the neoconservatives seek hegemony. Although the neoconservatives would still have contacts in the hidden deep state, it would make it difficult for the vermin to organize false flag operations or an assassination. Rogue elements in the military/security complex could still bring off an assassination, but without neocons in the government a coverup would be more difficult.\\nTrump has more understanding and insight than his opponents realize. For a man such as Trump to risk acquiring so many powerful enemies and to risk his wealth and reputation, he had to have known that the people\\x92s dissatisfaction with the ruling establishment meant he could be elected president.\\nWe won\\x92t know what to expect until we see who are the Secretaries and Assistant Secretaries. If it is the usual crowd, we will know Trump has been captured.\\nA happy lasting result of the election is the complete discrediting of the US media. The media predicted an easy Hillary victory and even Democratic Party control of the US Senate. Even more important to the media\\x92s loss of influence and credibility, despite the vicious media attack on Trump throughout the presidential primaries and presidential campaign, the media had no effect outside the Northeast and West coasts, the stomping grounds of the One Percent. The rest of the country ignored the media.\\nI did not think the Oligarchy would allow Trump to win. However, it seems that the oligarchs were deceived by their own media propaganda. Assured that Hillary was the sure winner, they were unprepared to put into effect plans to steal the election.\\nHillary is down, but not the Oligarchs. If Trump is advised to be conciliatory, to hold out his hand, and to take the establishment into his government, the American people will again be disappointed. In a country whose institutions have been so completely corrupted by the Oligarchy, it is difficult to achieve real change without bloodshed.\\nTrump Faces Assassination\\nBy Paul Craig Roberts:\\nNovember 10, 2016 \" Information Clearing House \" - \" Pravda \" - The US presidential election is historic, because the American people were able to defeat the oligarchs. Hillary Clinton, an agent for the oligarchy, was defeated despite the vicious media campaign against Donald Trump. This shows that both the political establishment of both political parties and the media no longer have credibility with the American people.\\nIt remains to be seen whether Trump can select and appoint a government that will serve him and his goals to restore American jobs and to establish friendly and respectful relations with Russia, China, Syria, and Iran.\\nIt also remains to be seen how the oligarchy will respond to Trump\\'s victory. Wall Street and its agent, the Federal Reserve, can cause an economic crisis in order to put Trump on the defensive. Rogue agents in the CIA and Pentagon can cause a false flag attack that would disrupt friendly relations with Russia.\\nTrump could make a mistake and retain neoconservatives in his government.\\nWith Trump there is at least hope. Unless Trump is obstructed by bad judgment and obstacles put in his way, we should expect an end to Washington\\'s orchestrated conflict with Russia, the removal of the US missiles on Russia\\'s border with Poland and Romania, the end of the conflict in Ukraine, and the end of\\nWashington\\'s effort to overthrow the Syrian government. However, achievements such as these imply the total defeat of the oligarchy. Although Trump defeated Hillary, the oligarchy still exists and is still powerful.\\nTrump said that he no longer sees the point of NATO 25 years after the Soviet collapse. If he sticks to his view, it means a big political change in Washington\\'s EU vassals. The hostility toward Russia of the current EU and NATO officials would have to cease.\\nWe do not know who Trump will select to serve in his government. It is likely that Trump is unfamiliar with the various possibilities and their positions on issues. It really depends on who is advising Trump and what advice they give him. Once we see his government, we will know whether we can be hopeful for the changes that now have a chance.\\nIf Trump is actually successful in curbing the power and budget of the military/security complex and in holding Wall Street politically accountable, he could be assassinated.\\nDr. Paul Craig Roberts was Assistant Secretary of the Treasury for Economic Policy and associate editor of the Wall Street Journal. He was columnist for Business Week, Scripps Howard News Service, and Creators Syndicate. He has had many university appointments. His internet columns have attracted a worldwide following. Roberts\\' latest books are The Failure of Laissez Faire Capitalism and Economic Dissolution of the West , How America Was Lost , and The Neoconservative Threat to World Order . Donald Trump\\'s unexpected win ignites massive protests across the US : Anti-Trump activists launched impromptu protests criticizing the racism, sexism and xenophobia that they say the president-elect has made mainstream.\\nProtesters block entrance to Trump Tower, stop traffic on Lake Shore Drive : Thousands of protesters angry over Donald Trump\\'s election victory massed outside Trump Tower in Chicago on Wednesday evening before taking to downtown streets in an angry show of opposition to the president-elect.\\nDemonstrators gather outside White House to protest Donald Trump: A crowd of more than 1,000 people showed up in front of the White House \\x96 in the early hours of Wednesday morning . Some demonstrators reportedly began chanting \\x93F--- Donald Trump.\\x94\\nAnti-Trump protests erupt in major US cities : Video'"}, "time": 1742628449.650174}