{"duration": 0.045537710189819336, "input_args": {"text": "\"Comments \\nDemocratic Rep. Elijah Cummings (D-MD) was the ranking minority member on the House Benghazi committee, so he knows firsthand how Republican witch-hunts work from up close personal experience. \\nOn CNN’s New Day this morning, he revealed the real motivation behind the FBI Director’s stunningly improper memo to Congress last week. \\n“I don’t think the American people have a clue how hard the Republicans – particularly on my committee – have been on the FBI. This is a man – Director Comey – who they loved. They said he was the greatest thing in the world, very honorable.” \\n“When he came out with the decision in July to not prosecute Mrs. Clinton, they suddenly turned against him. He knows that if he makes any misstep, the Republicans are going to be all over him and they’re going to try and bring harm to him. The thing that he did say in our hearing, and it stuck with me, is that ‘there should not be a double standard to the disadvantage of Mrs. Clinton.'” \\nCummings is heavily implying that the FBI Director was so intimidated by Congressional Republicans and the threat of being dragged in front of a Congressional investigation committee himself that he caved in and fed them the kind of vaguely worded red meat memo the Trump campaign desperately needed to keep their failing campaign on life support. \\nEven Comey himself admitted that his memo was going to be widely misinterpreted , which is probably why CNN’s host began her interview with Congressman Cummings by saying, “Trump is lying about the email probe.” \\nIt hasn’t taken long for the roof to cave in on Comey’s career anyway, as his obvious meddling in the election has drawn bipartisan complaints about illegal electioneering by the FBI Director, his former boss to condemn his actions and for the Senate minority leader Harry Reid to demand answers from the FBI about the Republican candidate’s love affair with Russian dictator Vladimir Putin. Reid’s point was not lost on the Congressman from Maryland who told CNN: \\n“There has been a lot of information out there about Mr. Trump, Mr. Manafort and the Russian government and alleged attempts to take over our election. Members of Congress have asked for months, for the FBI to provide us with information if Mr. Trump, Mr. Manafort and any elements of the Russian government have any coordination or connection with each other.” \\n“They have not given us one syllable. So the question here is: Do we have a double standard here?” \\nOf course there’s a double standard! \\nThe FBI has a responsibility to keep certain things secret, and when it comes to partisan elections that responsibility is key to the ability of our electoral democracy’s basic functioning. Newsweek’s Kurt Eichenwald pointed out cogently that Republican George W. Bush was investigated by the FBI in 1996, prior to running for President. Yet, the Clinton White House didn’t grab his FBI file and air all of the dirty laundry claiming a very partisan need for transparency during an election. Otherwise, the FBI could decide to influence every election in America, and over time the FBI would pick the elected officials to their liking. \\nNothing can un-ring the bell that FBI Director Comey struck by letting loose his vague memo, but everyone can understand there is a sexist, partisan and blatant double standard at play by Republicans celebrating a vague memo, which only happened because an official sworn to be non-partisan decided he valued his political career more than the integrity of our electoral system. \\nWatch it here:\""}, "time": 1742563088.5525777}