{"duration": 0.053705692291259766, "input_args": {"text": "'PIEDRAS NEGRAS, Coahuila  —   Authorities in this border city continue to probe a failed kidnapping that turned into a triple murder outside of a local junkyard. While local media have claimed that the murder was a gang hit, the victim’s relatives revealed that the case was something else. [Preliminary information points to the victims decorating a local business for a party in the Laguito Mexicano neighborhood when the shooting happened. The victims have been identified as    Jorge “Copetes” Rosales and his employees Aaron “N” and El Pepo. The murder scene is approximately six miles from this city’s downtown area.   According to the victim’s relatives, two vehicles with gunmen followed Rosales to his business where they tried to kidnap him in an apparent effort to collect a ransom. The victim tried to fight back while two of his employees rushed to his aid. The gunmen shot them and fled the area. Days after the murder, local residents reported that a second kidnapping attempt had taken place but the victims had managed to escape unharmed.  According to local residents, they have recently seen a spike in the number of kidnappings at the hands of organized crime members who are trying to supplement their incomes. As Breitbart Texas revealed, the area of Piedras Negras is famous for the kidnapping and murder of more than 300 between 2011 and 2013 in the state’s northern region. Most of the victims were incinerated inside a state prison. Editor’s Note: Breitbart Texas traveled to the Mexican States of Tamaulipas, Coahuila and Nuevo León to recruit citizen journalists willing to risk their lives and expose the cartels silencing their communities.  The writers would face certain death at the hands of the various cartels that operate in those areas including the Gulf Cartel and Los Zetas if a pseudonym were not used. Breitbart Texas’ Cartel Chronicles are published in both English and in their original Spanish. This article was written by “J. M. Martinez” from Piedras Negras, Coahuila. '"}, "time": 1742561745.2429843}