{"duration": 0.03782391548156738, "input_args": {"text": "'Good for them : \\nâ\\x80\\x9cPORTLAND, Ore. (AP) â\\x80\\x93 A federal jury has found Ammon Bundy and his six co-defendants not guilty on all charges for taking over a federal wildlife refuge in eastern Oregon earlier this year. \\nStandoff leaders Ammon and Ryan Bundy and five others were charged with conspiring to impede federal workers from their jobs at the Malheur National Wildlife Refuge. Several also were charged with possessing a firearm in a federal facility. â\\x80Ś \\nOn emotional grounds, Ammon Bundy and other defendants argued that the takeover was an act of civil disobedience against an out-of-control federal government that has crippled the rural West. \\nFederal prosecutors took two weeks to present their case, finishing with a display of more than 30 guns seized after the standoff. An FBI agent testified that 16,636 live rounds and nearly 1,700 spent casings were found. \\nBundy testified in his defense, spending three days amplifying his belief that government overreach is destroying Western communities that rely on the land â\\x80Śâ\\x80\\x9d \\nHereâ\\x80\\x99s a toast to their acquittal! The acquittal of Bundy brothers in #oregonstandoff is the epitome of white privilege. Two different justice systems! https://t.co/F3GmNgYLrW \\nâ\\x80\\x94 Cenk Uygur (@cenkuygur) October 28, 2016 White privilege, 2016: \\nHeavily armed militants just acquitted in #oregonstandoff as unarmed #NoDAPL protestors are attacked by riot police. pic.twitter.com/ZdVyEgUXTq \\nâ\\x80\\x94 David Harris-Gershon (@David_EHG) October 28, 2016 The #Bundytrial #Oregonstandoff jury just delivered a message to the Bureau Of Land Management. \\nIt went something like this. pic.twitter.com/5vzkAQZmWN \\nâ\\x80\\x94 Bob Owens (@bob_owens) October 28, 2016 The \"Bundy Standoff\" was an FBI hoax. It was drama created by informants. All defendants – not guilty! https://t.co/HeiLCjNHhX'"}, "time": 1742564137.8001611}