{"duration": 0.10494685173034668, "input_args": {"text": "'  groups leased a big orange tour bus to highlight the big obvious  —   but perhaps temporary  —   fact that a person’s male or female sex is decided by biology, not by politics. [But before the bus could get out of New York, two attackers smashed several windows, punched holes in the side, and   political demands  —   “trans rights now!” and “trans liberation”  —   over the huge    message on the side of the bus, which says:  It’s Biology, Boys are boys   …     and always will be, Girls are girls  …     and always will be. You can’t change sex. Respect all.  The attack was inflicted after the conservative organizers had “call[ed] on all Americans to respect the free speech rights of citizens to debate these issues without fear of being demeaned, harassed, or threatened with retaliation. ” The #FreeSpeechBus tour began Thursday in New York, and it is being led by the National Organization for Marriage (NOM) International Organization for the Family, and CitizenGO. “We filed a police report and there is video surveillance” of the two attackers damaging the bus and attacking the bus driver, Brian Brown, the director of the National Organization for Marriage, told Breitbart News. The attack took place near the United Nations building.  “They should be punished to the full extent of the law,” he said. ‘“It is a hate crime   …     if it was motivated by our religious or political beliefs, it is under the statutes to be prosecuted as a hate crime. ” The attack “proves our point  —   that some on the other side don’t believe in tolerance, they want to shut us down   …    . [but] we’re not stopping the bus tour,” he said.  The bus tour is needed to spread the message nationwide that government must not promote the false claim that people can change their sex, said Brown.  “We’re seeing actual legislation trying to force schools to accept that boys can go into girls’ restrooms  —   that’s absolute insanity,” he said. State and federal approval of the transgender claim that people can and should be allowed to change their sex have created a   of medical specialists who are performing radical surgery on children, he said. “We’re taking young children and essentially mutilating them   …     this is horrific, and people need to stand up against this. ” Political advocates for the “gender ideology” idea say that biological sex has nothing to do with feelings of “gender,” that people can and should be allowed to change their legal sex as often as they wish and also that government can and should force other people to comply with the changing preferences of people who say they want to live as members of the other sex. For example, these activists say that biological men should be legally invited to use women’s   and sports leagues, and children should be forced to refer to a boy as a girl if the other child wants them to do so.  The overall goal for the transgender activists is a “genderless society” which no longer allows any social, civic or legal recognition of the   different, equal and complementary preferences of the two distinct heterosexual sexes, including the normal view of marriage as a man and a woman joining to become parents for the next generation of people. “The end of the [transgender] road is to say that fundamental reality is simply a subset of our wishes  —   that if I wake up one day and say ‘I’m a boy [then] I’m a boy,’   …     that’s the big lie here,” he said.    libertarians should recognize that “if you [allow government to] change the fundamental nature of male or female persons, it can change anything  —   and the government can try to coerce people to buy into their false version of reality,” he said. The orange bus was leased to help share this argument with Americans and media outlets around the nation, he said  “The ‘gender identity’ activists have scared people from stating the obvious truth,” said Brown. “The bus is letting people know they should not be afraid to stand against this nonsense,” he added.  Polls show fewer than   of Americans support the claim that people should be allowed to freely change their legal sex without surgery or legal paperwork. Other polls show lopsided public opposition to demands that   bathrooms be replaced by shared bathrooms.   Advocates say that only 0. 6 percent of people are transgender. Critics highlight a study of the 2010 census which showed that only 89, 667 adults had changed their names from one sex to another. That’s roughly 1 in 2, 500 adults. '"}, "time": 1742563666.6479843}