{"duration": 0.06921124458312988, "input_args": {"text": "'  “honour crimes” have risen by 40 per cent in five years in London, with the number of forced marriages doubling in the same period. [According to the figures, obtained by the Evening Standard, some of the children involved in the abuse were younger than   .  Since 2012, honour crimes reported to the Metropolitan Police rose to 1, 081 and those relating to forced marriages shot up to 367. Women and girls were the victims in the vast majority of reported incidents, with over half coming from “Asian” backgrounds, the paper reports. Knives and guns were involved in more than 70 incidents, and dozens of rapes and other sexual crimes were reported. Detective Chief Inspector Sam Faulkner, of the Met’s Community Safety Unit, said the crimes stem from communities using “cultural   religious justifications for male violence against women and girls and other people”. They were often based on traditions whereby “an individual, family and community’s honour is weighted on women and girls” he said, including refusing to go along with a marriage. “We see an increase in these types of offences as a positive step, an indication that victims have more confidence to report offences to police and seek the support they need” he added. Politicians today called the findings “troubling” “shocking” and “abhorrent”. Labour MP Yvette Cooper, chair of the Commons Home Affairs Select Committee, told the Evening Standard: “Too many of these awful crimes are still hidden. There is no ‘honour’ in violence against women, rape, torture or abuse of a family member. “These are deadly crimes and there is still too little protection, too few prosecutions and too much stigma which prevents people coming forward. “It’s vital that when victims do speak out they get proper help from support groups and from the police to keep them safe. ” The figures, obtained using Freedom of Information requests, show that “violence against the person” was the most common “honour” attack, accounting for 85 per cent of incidents. Sexual violence was the second largest category, with 56 rapes and 11 “other sexual” crimes. 84 per cent were perpetrated against women, with “Asian” women accounting for more than half.'"}, "time": 1742563811.5044637}