{"duration": 0.08154058456420898, "input_args": {"text": "'Home › HEALTH › SURGEONS ADMIT THAT MAMMOGRAPHY IS OUTDATED AND HARMFUL TO WOMEN SURGEONS ADMIT THAT MAMMOGRAPHY IS OUTDATED AND HARMFUL TO WOMEN 0 SHARES \\n[10/28/16] ETHAN A. HUFF – Every year, millions of women flock to their doctors to get their annual mammograms, a breast cancer screening procedure that involves pressing a woman’s breasts between two metal platforms to scope out tumors. But surgeons everywhere are starting to question the controversial practice , which studies show isn’t even an effective screening tool, and is actually harmful to the bodies of women who receive it. \\nThe public is told that mammograms are the only way to catch breast cancer early, but a review of eight scientific trials evaluating the procedure, found that mammography is neither effective nor safe. After looking at data on more than 600,000 women between the ages of 39 and 74 who underwent the procedure on a routine basis, researchers found that many women are misdiagnosed. Many of these same women are consequently mistreated with chemotherapy , resulting in their rapid demise. \\nAs published in the Cochrane Database of Systematic Reviews , the review concluded that mammography causes more harm than good , because many more women end up being misdiagnosed and mistreated than those actually avoiding the development of terminal breast cancer. Thus, the procedure known as mammography is an outdated scourge that belongs in the history books of failed medical treatments, and not at the forefront of women’s medicine. \\n“If we assume that screening reduces breast cancer mortality by 15% and that overdiagnosis and overtreatment is at 30%, it means that for every 2000 women invited for screening throughout 10 years, one will avoid dying of breast cancer and 10 healthy women , who would not have been diagnosed if there had not been screening, will be treated unnecessarily,” the authors concluded. Group of top medical experts admits mammography does more harm than good \\nOne year after this review was published, a second one published in The New England Journal of Medicine (NEJM) came to a similar conclusion. A team of medical professionals that included a medical ethicist, a clinical epidemiologist, a pharmacologist, an oncologic surgeon, a nurse scientist, a lawyer and a health economist, decided that the medical industry’s claims about the benefits of mammography are essentially bunk. \\nThey found that for every 1,000 women screened in the U.S. over a 10-year annual screening period beginning at age 50, one breast cancer death would be prevented, while a shocking 490 to 670 women would have a false positive, while 70 to 100 would undergo an unnecessary biopsy. Between three and 14 of these women, the study found, would also be over-diagnosed for a non-malignant form of cancer that never even would have become “clinically apparent.” \\nThis study out of Switzerland corroborates another out of Canada – the 2014 Canadian National Breast Screening Study – which concluded in lockstep with the others that mammography screenings do not reduce mortality rates from breast cancer any better than a simple physical examination. In other words, the procedure is completely unnecessary, and in many cases exceptionally harmful . \\nAnd on and on the list goes, with data out of Norway and elsewhere confirming that mammography isn’t all that it’s cracked up to be. U.S. data spanning the course of nearly 40 years shows that more women are over- or misdiagnosed with breast cancer because of mammograms than are successfully early-diagnosed with breast cancer in such a way as to protect against metastasization. This represents an exceptionally poor track record that calls into question why mammography continues to be used when it clearly doesn’t work. \\n“I believe that if you did have a tumor, the last thing you would want to do is crush that tumor between two plates, because that would spread it,” says general practitioner Dr. Sarah Mybill, as quoted in the documentary film The Promise . Post navigation'"}, "time": 1742561708.845748}