{"duration": 0.12868857383728027, "input_args": {"text": "'syrien Die Dokumentarfilmerin Maria Iwanowa hat in Syrien gedreht. Quelle:Elena Kern / Pressebild \\nWas hat Sie dazu bewegt, in den Nahen Osten aufzubrechen, um dort einen Film über Flüchtlinge zu drehen? \\nDie Dreharbeiten begannen in einem Flüchtlingslager in Berlin. Ich war auf der Suche nach einer Protagonistin. Man sagte mir aber, dass junge Frauen aus Syrien nicht alleine fliehen – entweder mit ihren Männern, oder mit Verwandten. \\nDann schaute ich mich einfach nach interessanten Gesichtern um. So fand ich meinen Protagonisten, den 14-jährigen Muhamed, der von seinen Eltern nach Deutschland geschickt worden war. Er hat den gesamten Weg alleine zurückgelegt, um später einen rechtlichen Anspruch auf Familiennachzug zu haben und seine Verwandten aus Syrien nachzuholen. \\nWährend der Dreharbeiten ist mir klar geworden, dass ich weiter nach Damaskus muss, wo Muhameds Eltern geblieben sind. Wegen Problemen mit dem Visum mussten mein Kameramann und ich über Beirut nach Syrien fliegen, weil der Libanon für Russen visumsfrei ist. „Angriff? Kaffeepause!“: Was russische Reporter in Syrien erlebt haben Als wir auf einer Schnellstraße unterwegs waren, da wusste ich: Zehn Kilometer von uns entfernt ist der IS, ganz nah. Wir fuhren 200 Kilometer in der Stunde und als unser Fahrer ein Motorrad sah, drehte er abrupt um und fuhr in die Gegenrichtung. Ich fragte nachher, warum er das gemacht habe. Er sagte, dass die Terroristen öfter mit Motorrädern unterwegs seien. \\nSo kamen wir nach Damaskus. Die Heizung in unserer Wohnung funktionierte nicht. Es gab keinen Strom und kein heißes Wasser, wir schliefen auf einer Art Sofa – im Nahen Osten hat man keine richtigen Betten. Um drei Uhr morgens hörte ich Bombenangriffe. \\nSieht es so in der gesamten Stadt aus? \\nIch war im Süden und da hat man Angst, sein Haus zu verlassen. Man kann die Angst in den Augen der Menschen sehen und die Atmosphäre ist sehr bedrückt. \\nHaben sie die Eltern Muhameds letztendlich finden können? Konnten sie mit ihnen Kontakt aufnehmen? \\nSie empfingen uns sehr herzlich und luden uns zum Abendessen ein. Sie haben alles, um in Kontakt zu bleiben, sie nutzen soziale Netzwerke. Nach dem Treffen kehrten wir nach Beirut zurück, um von da aus in Flüchtlingslager in den Bergen zu fahren. Dort haben wir dann nochmal zwei Wochen lang gedreht. \\nGibt es Unterschiede zwischen den Flüchtlingslagern im Libanon und in Deutschland? Schlacht um Mossul: Steht ein zweites Aleppo bevor? Aber sicher. Im Libanon gibt es kaum Annehmlichkeiten. Im Film geht es unter anderem um einen Mann, der 17 Kinder hat. Er wohnt in einem Zelt, das er einfach in verschiedene Räume geteilt hat. Er flickt, wenn etwas kaputtgeht, sie schlafen auf dem Boden. Obwohl diese Menschen in schrecklichen Bedingungen leben, haben sie versucht, etwas für uns zu kochen. Sie haben Oud – ein orientalisches Musikinstrument – gespielt, haben Witze gemacht: Sie leben und hoffen, dass sie irgendwann nach Hause können. Alle denken nur daran. Viele wollen natürlich nach Europa und haben schon einen Antrag gestellt. Aber nicht jeder wird aufgenommen.\\nDer Libanon ist ein sehr interessantes Land. Stellen Sie sich das mal vor: Auf einem Gebiet, das kleiner als das Verwaltungsgebiet Moskau ist, leben 18 religiöse Bewegungen, vier Millionen Menschen und anderthalb Millionen Flüchtlinge zusammen. Ich habe trotzdem keine Konflikte gesehen, zum Beispiel zwischen Christen und Muslimen. Alle gehen in dieselben Restaurants und Kinos. Alles ist friedlich. \\nSpürt man im Libanon etwas vom Krieg im Nachbarland? \\nMan spürt den alten Krieg, also den Bürgerkrieg: Es gibt zum Teil zerbombte Gebäude, viel Militärpersonal, Kontrollposten. Manchmal sieht man Transportpanzer. Gleichzeitig sieht man aber auch eine Halle für moderne Kunst gleich neben den Soldaten, und ein Stück weiter ein modernes Kino. Es ist ein Patchwork-Land und sehr vielfältig. \\nIch bin mit dem Auto und einem Fahrer gereist und habe schöne Städte, Berge und eine Weinproduktion gesehen. Ich war auf einem Apfelfest. Angst hatte ich keine. Es gibt einen modernen Flughafen, Taxis, Hotels, sehr gute Restaurants, Strände und Kinos. Aber derzeit kann Ihnen niemand garantieren, dass Sie hundertprozentig sicher sind – das gilt übrigens auch für Frankreich oder Deutschland. Der Libanon unterscheidet sich in diesem Sinne nicht von Europa. RBTH-Check \\nDer Film feierte am 24. Oktober im Rahmen des Russischen Filmfestivals “Fünf Jahre in fünf Tagen” in Beirut Premiere. \\nDieser Beitrag erschien zuerst bei RIA Nowosti . Alle Rechte vorbehalten'"}, "time": 1742563319.268656}