{"duration": 0.04327201843261719, "input_args": {"text": "'in: Government , Petitions , Special Interests The rigged investigation into the new batch of Hillary Clinton-related emails just got epically more rigged. Well, the folks doing research over at Zero Hedge have completely outdone themselves with this discovery that will never reach the mainstream. “Ironically”, that is the same Peter Kadzik who has proven his “impartiality” in multiple WikiLeaks emails including this newly released bombshell in which Kadzik provides a very helpful “heads up” about Hillary’s email server investigation. This is what Kadzik emailed to John Podesta (via gmail) on May 19, 2015: There is a HJC oversight hearing today where the head of our Civil Division will testify. Likely to get questions on State Department emails. Another filing in the FOIA case went in last night or will go in this am that indicates it will be awhile (2016) before the State Department posts the emails. Perhaps Mr. Kadzik could explain to our readers – and the American public – why this particular message was delivered via his private, gmail account rather than his official DOJ email account? Go and r ead the article to learn of Kadzik’s background . It’s positively incestuous with ties to the Clintons and Podestas. Here’s what you can do. Contact the Department of Justice. Be civil because screaming, swearing, and threatening never accomplished anything. Let them know that you want to see an independent investigation into these emails and into the Clinton Foundation. Let them know that you will also be contacting your local media to make them aware of this conflict of interest. Here is the contact information for the DoJ. Make phone calls and send emails. Department Comment Line: 202-353-1555 Department of Justice Main Switchboard: 202-514-2000 Executive Office for United States Attorneys Main Line – (202) 514-2000 DoJ Criminal Investigation email address: [email protected] Feel free to use this email as a template: RE: Peter Kadzik When I learned of the close connections between Peter Kadzik and Hillary Clinton, I was appalled that he would be in charge of the new investigation into the emails. In no way does this reflect well on the DoJ. It’s an insult to the American people that this blatant collusion is allowed and presented as “justice.” This is especially appalling considering this email he sent Podesta during the last investigation with the subject line “Heads up” https://wikileaks.org/podesta-emails/emailid/43150 I will be notifying my local media of this debacle and sharing it everywhere I can reach via social media. People are learning of this collusion rapidly – you might want to read this article published on Zero Hedge and put on the front page of the Drudge Report – keeping in mind that Drudge gets millions of page views per day and is one of the biggest websites in America. http://www.zerohedge.com/news/2016-11-02/more-collusion-between-clinton-campaign-and-doj-kadzik-provides-heads-podesta The American people don’t trust the government anymore, and it is actions like this, putting John Podesta’s close friend in charge of an investigation that all eyes are on, that is like spitting in the face of every person in America who hopes that justice is indeed blind, even when the recipient of it is Hillary Rodham Clinton. Please do the right thing. This investigation needs to be independent of anyone with ties to the Clintons and any figure in their campaign. Sincerely, If you use social media, get on it. Share this article and the one from Zero Hedge and do not shut up about it until our mission is accomplished. If you don’t use social media, forward emails to everyone in your address book. If you’re on the computer reading this, I’m pretty sure you have email too. Contact your local media through letters to the editor, comments on their websites, and phone calls to anyone who will listen. If you sit there and do nothing, you get nothing. Now is the time to stand up to corruption. Now is the time that your voice can be heard. Make it count. Article first posted at DaisyLuther.com Submit your review'"}, "time": 1742562710.885541}