{"duration": 0.035848379135131836, "input_args": {"text": "'Friday during a news conference, House Speaker Paul Ryan ( ) offered remarks on his decision not to proceed ahead with a vote on the American Health Care Act, which would have according to Ryan began the process of repealing and replacing the Affordable Care Act, also know as Obamacare.  During the question and answer session, Ryan was asked about the prospect of another stab at repealing and replacing Obamacare, to which he said, “We’re going to be living with Obamacare for the foreseeable future. ” Partial transcript as follows: I don’t know what else to say other than Obamacare’s the law of the land. It’s going to be remain the law of the land until it’s replaced. We did not have quite the votes to replace this law. And so, yeah, we’re gonna be living with Obamacare for the foreseeable future. I don’t know how long it’s gonna take us to replace this law. My worry is Obamacare is  —   is going to be getting even worse. Actually, I think we were probably doing the Democrats a favor. I think we are doing the architects of Obama a favor by passing this law before it gets even worse. Well, I guess that favor’s not going to be given to them and it’s going to get worse. And so, I don’t think the architects of Obamacare  —   I’m sure they may be pleased right now. But when they see how bad this thing gets, they said all the projections were being told by  —   by the plans that are participating in Obamacare. I don’t think they’re gonna like that either. Look, five states you got one plan left, one choice. Over a third of the counties in America, one plan left. And the kinds of projections we’re being told from the people providing health insurance to these people in plans, it’s gonna get even worse. And so, I don’t think the architects of Obamacare envisioned this future. It’s certainly not one we want for the American people. And I wish we had the kind of consensus we needed to bring a bill to the floor to pass and replace it but we just don’t have that right now. Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742563368.191088}