{"duration": 0.031481027603149414, "input_args": {"text": "'Calling Trump Moscow’s favorite is nonsense created by media – Putin Calling Trump Moscow’s favorite is nonsense created by media – Putin By 0 71 \\nThe idea that Russia has a favorite in the US election was deliberately created by the media, Russian President Vladimir Putin said, adding that Moscow is “largely unconcerned” about the outcome of the vote and is ready to work with any future president. \\n“The image [that Russia supports a candidate in the US presidential election] was created by the media,” Putin said at the Valdai Discussion Club in Sochi on Thursday, adding that it was done deliberately and on purpose. \\nRead more \\n“This idea was planted into the US public consciousness… with only one goal… to protect the interests of the Democratic candidate in her competition with the candidate of the Republicans, in this case – with Mr. Trump,” the Russian president stressed. \\nThe US media “first portrayed Russia as an enemy and then said that Trump is our [Russia’s] favorite,” Putin said, denouncing these tactics as “absolute nonsense.” “This is complete and utter rubbish, and it is just a method of internal political struggle, as well as a way of manipulating the public consciousness ahead of the US presidential elections,” he added. \\nHe went on to say that Russia is not interested in a victory of any particular candidate and is ready to cooperate with any of them. “Generally speaking, we are more or less unconcerned about it,” the Russian leader said. \\nAt the same time, he stressed that Russia welcomes words and intentions concerning normalization of relations between the US and Russia, “whoever expresses them.” He also said that it is “hard” to work with the current US administration as it does not fulfill its obligations under any agreements, adding that Russia is ready to start working with a new US president. Trump’s extravagant behavior is thought-out political strategy \\nDonald Trump “has chosen his own method to get through to voters’ hearts,” Vladimir Putin said at a meeting of the Valdai Discussion Club, adding that the Republican candidate must have a reason behind his extravagant behavior. \\nRead more \\n“He [Trump] just represents ordinary people and portrays himself as an ordinary guy, who criticizes those who have been in power for decades,” Putin said, adding that only voting will show if this strategy is effective. \\nAt the same time, Putin stressed once again that Moscow will work with every US president who is chosen by the US people and is willing to cooperate with Russia. \\nEarlier, Putin also dismissed all accusations concerning Moscow’s alleged meddling in the US presidential elections, saying that the ‘Russian card’ was used during the election campaign to distract voters from the real internal problems of the US. \\nHe also sharply criticized the US and the EU for attempts to portray Moscow as an enemy and stressed that “Russia is not going to attack anybody.” \\nPutin and Russia have often been mentioned during the US presidential race. Democratic candidate Hillary Clinton has not only accused Donald Trump of being actively supported by Moscow, but also claimed that WikiLeaks, which repeatedly released documents hacked from Clinton campaign chair John Podesta and the Democratic National Convention, of working for the Kremlin. \\nVia RT . This piece was reprinted by RINF Alternative News with permission or license.'"}, "time": 1742628498.840277}