{"duration": 1.772672414779663, "input_args": {"text": "'Mon, 24 Oct 2016 08:13 UTC © Nutrition Review Mold toxin in cereals, coffee and wine inhibits cell regeneration in the brain. Chronic sinus problems, brain fog, unrelenting fatigue, ice pick headaches, increased gut permeability, and prone to static shocks may be signs of trouble with mold allergies and mold toxins. Sources of molds can easily come from fall foliage decay, water damage from heavy rains, floods, and hurricanes, and even several foods. Exposure to mold leads to not only the common respiratory symptoms, but can cause increased gut permeability and more severe immune disorders like CIRS and Mold-Related Illness. Mold toxins are ubiquitous and must be managed for health. Mold Allergies Mayo Clinic describes mold allergy as similar to other types of upper respiratory allergies. Common symptoms include sneezing, runny or stuffy nose, cough and postnasal drip, itchy eyes, nose and throat, watery eyes, and dry, scaly skin. Mold allergy problems may lead to asthma, fungal sinus infections, and allergic reactions in the lung like allergic bronchopulmonary aspergillosis and hypersensitivity pneumonitis. In this context, the mold allergies recognized are IgE reactions. IgE reactions reflect immunological inflammation caused by immediate or acute hypersensitivity. This is the same response as someone who eats peanuts or strawberries and develops hives or has anaphylactic symptoms. Treatment focuses on nasal corticosteroids like Flonase and Omnaris along with antihistamines. Natural support for acute allergic mold symptoms focus on antihistamines, reducing congestion, and blocking immune system chemicals like leukotrienes that lead to excess mucus. A number of antihistamine drugs are modeled after the nutrient quercetin, a natural antihistamine and bioflavonoid found in apples, onions, and other natural foods. Carnosine, chlorella, arabinogalactan, B vitamins, vitamin C, D, tocotrienols and DHA help reduce histamine release, help stabilize the immune (mast) cells that release histamine, and help lymphatic congestion. Antihistamine medications are not without side effects. Benadryl affects acetylcholine and may increase the risk for dementia. Mold Toxins In addition to mold allergies, there is the concern of mold toxins impacting the health of the gut and immune system. Changes in childhood growth, increased gut permeability, autoimmune disorders, and even systemic autoimmune inflammatory reactions, known as Chronic Inflammatory Response Syndrome (CIRS) may occur as a result of mold biotoxins or mycotoxins. Mold emits toxins that the body must detoxify. These substances, known as volatile organic compounds or VOCs, produce the musty odor of mold. Some of the gases produced include hexane, benzene, acetone and methylene chloride. These gases are known for their role in upper respiratory inflammation and sick building syndrome. Another toxic substance produced by mold is trichothecenes. Trichothecenes are toxic metabolites or mycotoxins produced by mold or fungus. They are found in the agricultural and food industry worldwide, which poses health hazards for animals and humans alike. Trichothecenes decrease macrophage activity in the immune system, which may increase the susceptibility to bacteria and viruses. Macrophages are a type of white blood cell that helps clean up cellular debris, germs, cancer cells, etc. It is the pac-man garbage collector of the immune system. Mold Toxins and Gut Changes Foods contaminated with molds are of concern around the globe. Mycotoxins , like aflatoxin, deoxinivalenol (DON), and fumonisins, etc. effect the intestines and cause significant damage to the gut lining and function. The direct impact includes decreased intestinal cell viability, reductions in short chain fatty acid (SCFA) concentrations elimination of beneficial bacteria, increased expression of genes involved in promoting inflammation and counteracting oxidative stress. Researchers report that as technology is able to better measure food contamination to mold toxins, they find \"that a significant proportion of the human population is chronically exposed to DON doses exceeding the provisional maximum tolerable daily dose.\" Recent research demonstrates just how powerful these mold biotoxins are, affecting intestinal function but also damaging immune, endocrine, and neurological function, and stunting the growth process in children . Animal and human studies focus on three major mycotoxins - aflatoxin (AF), fumonisin (FUM), and deoxynivaenol (DON). These different toxins have distinct actions, but they all cause intestinal damage, affect protein synthesis and create inflammation. As a result of consuming foods contaminated with mycotoxins, children in this study experienced environmental enteropathy. This is a low grade chronic condition of the small intestine that causes poor absorption of nutrients and increased intestinal permeability (Leaky Gut Syndrome). The mycotoxin contaminated food causes a breakdown in the villi or fingerlike projections of the gut resulting in inflammation affecting the entire body. Researchers believe that the chronic exposure to mycotoxins in the food supply contributed significantly to loss of growth, wasting, and stunting in these children. This concern is widely present in third world countries, but it certainly raises questions for all, even in affluent countries. Common Mold Toxins in Foods Aflatoxins may be present in many different types of foods. This includes cereals, tree nuts, corn, peanuts/peanut butter, pistachios, Brazil nuts, chilies, black pepper, dried fruit and figs. Milk, cheese, and dairy products may be contaminated with aflatoxins. Fumonisins are primarily found in corn-based products like yellow cornmeal, blue cornmeal, corn muffin mix, and mixed grain cereals. The mold mycotoxin DON (deoxynivaenol) is frequently found infecting grains in the field or during storage . Humans are exposed to it with the consumption of cereal grains like corn, wheat, oats, barley, and rice. Researchers note that it has been detected in buckwheat, popcorn, sorghum, triticale, and other food products including flour, bread, breakfast cereals, noodles, infant foods, pancakes, malt and beer. Pointing out these foods is not meant to make one \"food phobic\" but rather it is to realize that these toxins are ubiquitous and they can be problematic especially if they are a staple to the diet. Certain foods will have more or less amounts than others. Individuals who struggle with mold toxins, leaky gut syndrome, and insufficient antioxidants may need to limit or avoid these foods while their body heals. CIRS - Chronic Inflammatory Response Syndrome Mold biotoxins can have a severe impact on health in those who are genetically susceptible. These biotoxins commonly occur in the environment from water damaged buildings and as noted above from the food supply, etc. Once the source of mold toxins has been removed and the damaged structure repaired, many individuals are able to clear these mold toxins out of the body without trouble. However, it is estimated that almost 25 percent of the population is genetically susceptible to chronic mold illness, which is known as Chronic Inflammatory Response Syndrome or CIRS. An older name is \"mixed mold exposure\" . CIRS occurs because of genetic susceptibility with the HLA DR/DQ genes. Individuals who have this gene and the protein (MHC Class II protein) that it commands, fail to recognize mold toxins or biotoxins. The mold biotoxins stay activated in the body and continue to cause inflammation and damage. Until the toxins are cleared out, the chronic inflammation stays smoldering . The same genes also affect how the MHCII proteins recognize Lyme biotoxins. Lab Tests for Severe or Unresolved Concerns If you wonder why you can\\'t get rid of chronic respiratory concerns, ongoing fatigue, and feel like your losing your memory, you may want to look into testing for the HLA DR/DQ (DRB1, DRB3, DRB4, DRB5 and DQ) mold susceptibility genes. Other labs of great value include TGF-beta, MSH, VEGF, VIP, C4a, C3a, anti-gliadin (gluten) intolerance, ADH, MMP-9, and leptin. Estrogen, progesterone, thyroid and adrenal hormones are also affected by mold toxins leading to deficient or imbalanced levels. Common lab tests that measure inflammation, i.e. CRP and SED rate, are not elevated with mold biotoxins. What Does CIRS Look Like? Symptoms or common diagnoses associated with or affected by CIRS and mold toxins includes Chronic Fatigue Syndrome, ulcerative colitis , fibromyalgia, Lyme disease , Hashimoto\\'s thyroiditis, chronic EBV and other herpes viruses, rheumatoid arthritis , brain fog, brain fatigue , Crohn\\'s disease, Celiac disease, poor memory, exercise intolerance, respiratory problems, chronic sinusitis, blood sugar problems, and poor oxygenation . Fatigue, muscle aches, muscle cramps, ice pick headaches/sharp stabbing pain in the head, light sensitivity, morning stiffness, word finding difficulties, decreased academic or work performance, frequent or increased static shocks, appetite changes, vertigo, body temperature dysregulation, diarrhea, and other symptoms may be present. Autoimmune disorders and neurological inflammation should raise the question of mold toxicity. Sudden increase in weight after moving into water damaged building or new work environment may occur due to the inflammatory overload to the brain that leads to leptin resistance . Elevated leptin and weight gain in this context will fail to respond to dietary changes and physical activity. Removal of oneself from the toxic environment is critical followed by mold remediation of the building. Removal of dust particles saturated with mold VOCs is important as these circulate through the air and will continue to affect the mold toxin susceptible individual. Work with mold experts if you suspect or have CIRS and live or work in a water damaged building. How to Help Ease the Toxic Burden One of the most important things that you can do to help your body, i.e. your liver, gut, brain deal with these toxins is to ensure healthy glutathione levels, detoxification and removal of these substances from the body, and gut repair . Support and treatment of mold toxins includes several different nutrients. Mold toxins must be detoxified through the liver and the cytochrome P450 pathway. This detox system relies heavily on adequate glutathione and SOD enzymatic antioxidant pathways which require several nutrients. This includes B vitamins, NAC, MSM sulfur, acetyl-l-carnitine, lipoic acid, taurine, choline, glycine, glutamine, arginine, manganese, iron, coenzyme Q10, zinc, copper, silymarin, omega 3 fish oils, vitamin A, C, and E, and others. It is also helpful to support healthy gall bladder and bile acid function to help bind onto and clear mold toxins. Friendly flora/gut bacteria, fiber , lipoic acid, oregano oil , chlorella , or d-limonene help support this process. By supporting glutathione, cytochrome P 450 system, bile acids and gall bladder, the body stands a better chance in clearing out the VOCs and inflammatory compounds that mold exposure creates. Rebuilding and healing of the damaged gut lining is just as essential as the detoxification of mold toxins to stop autoimmune, endocrine, and neurological injury. Leaky Gut Syndrome repair relies heavily on vitamin D, vitamin A, glutamine, omega 3 oils, the good omega-6 oil GLA, and probiotics. Curcumin, boswellia, and resveratrol provide vital anti-inflammatory support for the gut and also the brain. Use enough digestive enzyme support to help breakdown all food types and reduce the strain on the gut and immune system. For those who have CIRS, other steps and medical support may be needed. Mold toxins are invariably present. It is a matter of how we handle their toxic effects or if we struggle under the burden of this environmental challenge. Genetics, exposure amounts, and efficiency and efficacy of the detoxification pathways determine the outcome of this equation. If you feel worse in certain environments or by consuming foods with these toxins, then it may be time to remediate the damaging effects of mold. Nutritional Options Chlorella - This blue-green algae super food packs power when it comes to detoxification. Chlorella binds onto toxins in a safe manner without stressing the liver, gut, or gall bladder. Quality of chlorella varies in the industry. Choose only chlorella grown indoors that is free of environmental toxins. A very thin or semi-permeable cell membrane is preferred over a broken cell membrane. B Vitamins - B vitamins are essential for detoxification and the cytochrome P 450 system. Several of the B vitamins are required for glutathione production and antioxidant function. Given the demands of today\\'s world, B vitamin replenishment and support is a must. Omega-3 and -6 oils - The omega-3 oil DHA and the omega-6 oil GLA are critical in protecting the brain and body from inflammation. The gut lining requires DHA and GLA to heal when increased permeability exists. Vitamin A - This often overlooked vitamin is essential for the epithelial lining of the gut as well as the mucosal lining of the sinuses and lungs. Without adequate vitamin A, the immune system struggles to maintain integrity. Those who struggle with thyroid concerns may not be able to convert beta carotene into vitamin A. Oregano Oil - This spice provides powerful anti-fungal support. It also demonstrates anti-inflammatory and antihistamine benefits. We have used oregano oil for many chronic sinus and respiratory concerns for nearly 25 years with great results. Many low quality forms of oregano oil add olive, soy, or other oils. It is best to use a product free of added, unnecessary ingredients. Silymarin - Silymarin is the active ingredient of milk thistle extract. It has been shown highly protective to the liver and is essential for the cytochrome P 450 system. In addition to its benefits for detoxification, it helps to recycle glutathione and acts a natural anti-inflammatory compound for the liver and brain. Fiber - Fiber is critical to binding onto toxins dumped into the gut. This includes the toxins from the liver and gall bladder. Arabinogalactan fiber and oat bran fiber provide excellent forms of soluble and insoluble fibers. In order to clear toxins and keep the bowels moving, it is often very helpful to increase fiber intake to 30 - 50 grams of fiber per day. Today\\'s diets often have very low fiber intakes of 8-10 grams per day.'"}, "time": 1742563111.183397}