{"duration": 0.0317990779876709, "input_args": {"text": "'  comedian Larry Wilmore had a meltdown during MILO’s appearance on Overtime, the online segment of Real Time With Bill Maher, eventually telling MILO to “go f*** yourself. ”[  Following a heated discussion about the discrimination of homosexuals in society, MILO suggested to Bill Maher that he invited guests with higher IQ’s onto the show. Wilmore, visibly infuriated by MILO’s comments, said “hang on a second, you can go f*** yourself alright,” to rapturous applause and squealing from Maher’s audience. “Your argument is that these people are stupid, you didn’t hear a word what this man said earlier in this segment because he can talk circles around your pathetic, douchey little ass,” he continued. Wilmore then challenged MILO’s theory that Ghostbusters actress Leslie Jones is barely literate. ” “Leslie Jones is not barely litterate, you can go f*** yourself again for that one,” Wilmore said. “She’s a very thoughtful person and very funny. ” Why is the goofy white boy coming thru!! The announcers won’t even call him lebron. The jamesing like a Muthafucka! Wake up James!!  —   Leslie Jones (@Lesdoggg) June 3, 2016,  “You should check her twitter feed, she can barely spell,” MILO responded. Despite not receiving support from Maher’s   audience, Georgian Congressman Jack Kingston did come to MILO’s defense. “Larry, I’m a great fan of yours man, but we are all about the First Amendment here and MILO, go for it brother, because I think what they did you to in Berkeley was atrocious. ” Watch MILO’s appearance on Real Time with Bill Maher at this link, and watch his Overtime appearance below. MILO wears camouflage jeans by True Religion,  $189. 99. Grey tank top by All Saints, $38. Flower embroidered bomber jacket by All Saints, $415. Leather high top sneakers with lion by Gucci, $695. Glasses by Givenchy, $350. Jewelry by Swarovski. Pearls: model’s own.  You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742564425.352431}