{"duration": 0.08511900901794434, "input_args": {"text": "'  THE BIG UPSET: Democrats Go Into Shock As Donald Trump Pulls Even With Crooked Hillary In Michigan Trump and Clinton both received 44 percent support from respondents in a poll conducted Nov. 3 in Michigan. Libertarian candidate Gary Johnson received 4 percent support, while Green party nominee Jill Stein received 3 percent. One percent of the respondents said that they were supporting someone else, and five percent said they were still undecided.   Republican nominee Donald Trump is tied with Democratic nominee Hillary Clinton in Michigan, according to a Strategic National Poll. \\nThe Michigan statewide poll revealed Trump is now dead even with Clinton , in a state that has not voted for a Republican presidential candidate since 1988. \\nTrump and Clinton both received 44 percent support from respondents in a poll conducted Nov. 3, which was obtained by The Daily Caller News Foundation. Libertarian candidate Gary Johnson received 4 percent support, while Green party nominee Jill Stein received 3 percent. One percent of the respondents said that they were supporting someone else, and five percent said they were still undecided. \\nThe survey , conducted by Strategic National , a Republican leaning consulting firm based in Michigan, contacted 573 likely voters in the State of Michigan on Nov. 3. The survey reported that 39 percent of the respondents were affiliated with the Democratic Party, 34 percent affiliated with the GOP, 21 percent affiliated with an independent or third party, and 5 percent said they were “unsure” of their party affiliation. Donald Trump MASSIVE Rally in Warren, Michigan: \\nClinton is scheduled to make an appearance in Detroit Friday afternoon. Clinton will attempt to inject enthusiasm into reliable Democratic Party voters that came out for President Barack Obama in full force both in 2008 and 2012. Trump appeared at two rallies in the state Monday, and his children, Donald Jr. and Ivanka stumped around the state this week. \\nTexas Sen. Ted Cruz appeared at a campaign rally with vice presidential candidate Mike Pence Thursday in Portage, Mich. on the state’s west side — an area where Cruz and Ohio Gov. John Kasich performed well in the GOP primary. \\nBoth candidates have made “ six-figure ” advertising purchases in the state in the last days before the election. Clinton’s campaign dumped $2.5 million in Michigan in two days alone, according to tabloid news outlet TMZ . Laura Ingraham on Why Trump Can Pull Off an Election Upset Over Clinton on Tuesday: \\nClinton enjoyed as much as a 13-point advantage over Trump in Michigan just two weeks ago. The Democratic nominee has not made Michigan a regular campaign stop while Trump has focused on the state and other rust belt states as a potential path to victory. \\nWhile Michigan hasn’t voted for a Republican candidate for president since President George H. W. Bush in 1988, the state is home to vast swaths of conservative-leaning precincts and a well-established state party apparatus. Michigan’s governor and both legislative chambers are controlled by Republicans and the state’s congressional delegation is made up of nine Republicans and five Democrats. \\nDemocrats have been able to win presidential elections by “running up the score” in its urban areas and population bases, something Clinton hoped would keep the state safely in her corner without diverting resources and time from other battleground states. \\n“Trump is over performing in key segments of the electorate especially in rural areas and Macomb County while Clinton is failing to get the numbers she needs out of the city of Detroit,” John Yob, CEO of Strategic National, who conducted the poll, reported. \\nOut of the poll’s respondents , 75 percent were contacted by landline, while 25 percent were contacted over cellular phone. The poll was conducted through landlines, using Interactive Voice Response and the margin of error for the poll is 4.09 percent. source \\n '"}, "time": 1742562393.5645425}