{"duration": 0.057503700256347656, "input_args": {"text": "'Warning : array_key_exists() expects parameter 2 to be array, null given in /home/content/p3pnexwpnas07_data02/05/3222705/html/wp-content/plugins/widget-options/core/functions.widget.display.php on line 182 Home › ECONOMIC › HERITAGE COLLEGE CLOSING ALL 10 OF ITS CAMPUSES HERITAGE COLLEGE CLOSING ALL 10 OF ITS CAMPUSES 0 SHARES \\n[11/3/16] The Kansas Board of Regents confirms all 10 of Heritage College’s locations, including those in southeast Wichita and Kansas City, Mo. are closed. The board or regents says the school is closed effective “immediately” and “indefinitely.” \\nTuesday afternoon, Eyewitness News heard from a student at the college’s location on South Rock Road in Wichita, who was preparing to graduate. \\nThe student says there was a note on the door of the school that they weren’t letting anyone in. The note read that the school went bankrupt, the student says. She says neither students nor staff received notice of the shutdown. Some learned of the closure by finding the notes, others heard from classmates. \\n“I actually got a text message from a classmate and then I called the school several times and couldn’t get an answer so I decided to come up here,” said Machelle Hatter, who went to Heritage. \\nMany students say they feel angry and confused. \\n“I don’t know where I’m going, I don’t know what’s going on with my loans, I don’t know what to do next,” said Stephanie Hermrack, who attended Heritage College. \\nHermrack said now she and many others who attended Heritage are left with only a partial education and thousands of dollars in student loans. \\n“So I don‘t know if I owe the government $20,000 now even though I didn’t get a degree out of this or what,” added Joshua Anderson, another Heritage student. Post navigation Warning : array_key_exists() expects parameter 2 to be array, null given in /home/content/p3pnexwpnas07_data02/05/3222705/html/wp-content/plugins/widget-options/core/functions.widget.display.php on line 182 Warning : array_key_exists() expects parameter 2 to be array, null given in /home/content/p3pnexwpnas07_data02/05/3222705/html/wp-content/plugins/widget-options/core/functions.widget.display.php on line 182 Warning : array_key_exists() expects parameter 2 to be array, null given in /home/content/p3pnexwpnas07_data02/05/3222705/html/wp-content/plugins/widget-options/core/functions.widget.display.php on line 182 Warning : array_key_exists() expects parameter 2 to be array, null given in /home/content/p3pnexwpnas07_data02/05/3222705/html/wp-content/plugins/widget-options/core/functions.widget.display.php on line 182 RESOURCES'"}, "time": 1742562027.006214}