{"duration": 0.05399894714355469, "input_args": {"text": "'Opponents of French presidential candidate Marine Le Pen have launched an “Obama17” campaign to draft the former U. S. President to run against her. [Frustrated with the choice of candidates running against the Eurosceptic,   candidate, organisers are hoping to draft President Obama as a last resort.  One campaign organiser, who chose only to give the name ‘Antoine’ told CNN: “It’s totally crazy, but the cool thing is that once you get past that, you start thinking that maybe it’s possible. Who cares that he’s not French? He’s Barack Obama. ” The campaign has so far put up 500 posters around Paris and has launched a website with the slogan “Oui on peut!” [Yes we can]. They are aiming to get one million people to sign a petition urging the former U. S. President to run, although the organisers admit the prospects are low. “We want to show that people are fed up with the politicians here. People are tired about it and they like this joke. It gives people a little fun amid all these scandals,” Antoine said. France goes to the polls in late April in the first round of the presidential election. If no candidate wins 50 per cent of the vote, the top two go through to a     two weeks later. Marine Le Pen, leader of the populist   immigration Front National is favourite to win the first round, although she is unlikely to win outright. Antoine says he is not a fan of the   frontrunner: “We are so fed up with what Marine Le Pen is doing, and with the fact that we weren’t able to find a candidate to vote for, only one to vote against,” he said. “We started talking about that and it came up that Obama is free  —   so why not hire him?” Although he admits the campaign started as a joke, he said supporters have been getting in touch with serious suggestions as to how they could get around basic problems, such as the fact President Obama is not French. “We’ve had some funny emails from lawyers telling us how it could be possible. He would have to be naturalized by the president of the French Assembly. ” Ms Le Pen hailed the victory of Donald Trump last November as a “victory of the people against the elites” and said a “global revolution” was underway against “unfettered globalisation”.'"}, "time": 1742563240.8175445}