{"duration": 0.07985925674438477, "input_args": {"text": "'Forbes Magazine is promoting Iran as one of “The 10 Coolest Places to Go in 2017,” based on a review by Melissa Biggs Bradley, founder of the travel website Indagare. [“Indagare founder Melissa Biggs Bradley is excited about the trip she just completed, to Tehran, Isfahan, Shiraz and Persepolis,” the Forbes article states. “The country seemed to be on the verge last year, and that panned out.  “Tourism has doubled in the past year, Biggs Bradley notes, thanks to the 2015 nuclear agreement along with regular flights from London, Paris, Vienna, Istanbul, Dubai and Doha. ” “Visitors to Iran understand that they must adapt to Sharia law and customs, under which alcohol is strictly forbidden and women must wear hijabs, or headscarves, outside their rooms,” Biggs Bradley wrote. “Advanced visas are required for Americans, who must be accompanied by Iranian guides and may not visit Iranians in their homes. Visitors must also “skip alcohol and put up with basic hotels,” Biggs Bradley wrote in the review published early this year. “This is a destination for history buffs and connoisseurs of decorative arts who don’t mind basic rooms and food,” Biggs Bradley wrote. “It is not for sybarites [defined by Oxford Dictionary as “a person who is   in their fondness for sensuous luxury”] looking for nightlife or spas. ” Biggs Bradley wrote that first impressions when arriving in the country are “wholly inaccurate. ” “On the day that our Indagare Insider Trip arrived in Iran, the cover of the Tehran Times featured a photo of a march marking the anniversary of the United States embassy takeover,” Biggs Bradley wrote. “The next morning, we passed a giant mural on the side of a building depicting an American flag with falling rockets in the place of stripes and bearing the slogan ‘Down with the U. S.,’ “This jarringly inauspicious start to our trip proved a wholly inaccurate foreshadowing of what the rest of our weeklong experience in Iran would be,” Biggs Bradley wrote. “Throughout our stay, people on the streets, in bazaars, at museums and monuments would come up to our group to greet us, ask our impressions and thank us for coming. “I have never felt more genuinely welcomed by the local people in any of the more than 100 countries I have visited,” Biggs Bradley wrote. Biggs Bradley credited the nuclear deal brokered by the Obama administrations and others in the West for the increase in tourism in Iran. “According to the Tehran Times, the number of foreign tourists arriving in Iran has doubled since it signed a nuclear deal with six Western countries, including the United States, in January 2016, leading to the lifting sanctions,” Biggs Bradely wrote. According to the U. S. Department of State, Iran is not an ideal travel destination because of it being designated as the No. 1 state sponsor of terror through its ongoing funding and arming of terrorists groups around the world and its human rights abuses against its own citizens and visitors. The State Department’s travel warning on its website states its purpose is to: “Reiterate and highlight the risk of arrest and detention of U. S. citizens, particularly dual national  . Foreigners, in particular dual nationals of Iran and Western countries including the United States, continue to be detained or prevented from leaving Iran. U. S. citizens traveling to Iran should very carefully weigh the risks of travel and consider postponing their travel. U. S. citizens residing in Iran should closely follow media reports, monitor local conditions, and evaluate the risks of remaining in the country. Iranian authorities continue to unjustly detain and imprison U. S. citizens, particularly   including students, journalists, business travelers, and academics, on charges including espionage and posing a threat to national security. Iranian authorities have also prevented the departure, in some cases for months, of a number of   citizens who traveled to Iran for personal or professional reasons. U. S. citizens traveling to Iran should very carefully weigh the risks of travel and consider postponing their travel. ” The State Department’s Countrys Report on Terrorism 2015 details Iran’s ties to the most ruthless terrorism around the world. “Iran remained the foremost state sponsor of terrorism in 2015, providing a range of support, including financial, training, and equipment, to groups around the world  —   particularly Hizballah. Iran continued to be deeply involved in the conflict in Syria, working closely with the Asad regime to counter the Syrian opposition, and also in Iraq where Iran continued to provide support to militia groups, including Foreign Terrorist Organization Kata’ib Hizballah. In addition, it was implicated for its support to violent Shia opposition group attacks in Bahrain. Iran was joined in these efforts by Hizballah, which continued to operate globally, as demonstrated by the disruption of Hizballah activities in Peru in 2014 and Cyprus in 2015. ”'"}, "time": 1742561930.3594177}