{"duration": 0.0805823802947998, "input_args": {"text": "'Military Operation to Retake Mosul From Daesh ( 91 ) 0 13 0 0 Hundreds of Yazidi hostages are being held captive by Daesh in Mosul, and the Yazidis hope the impending operation there will liberate them, Yezidi representative of the Regional Government of Iraqi Kurdistan Xeyri Bozan told Sputnik Turkiye. © AFP 2016/ Safin Hamed \\'Their Persecution Never Stops\\': The Forgotten Yazidis Still Held by Daesh Thousands of Yazidi hostages are still in the hands of Daesh, more than two years after the terror group attacked the predominantly Yadizi town of Sinjar , in north-west Iraq. \\nIn August 2014 Daesh overran the town and the surrounding areas, massacred 5,000 Yazidi men and took thousands of people hostage. \\nMore than 40,000 Yazidis were forced to flee to the Sinjar mountains, where they were surrounded by Daesh forces and dependent on helicopter drops of food and water. \\nXeyri Bozan, Yezidi representative of the Office of Religious Affairs of the Regional Government of Iraqi Kurdistan , told Sputnik Turkiye that dozens of Yazidis from Sinjar were rescued during recent anti-terror operations in Iraq and Syria. \\n\"We were able to carry out a special operation to free 70 Yazidis held captive by Daesh. The majority of them are women and children,\" Bozan said. \"The militants were holding them in Mosul, Hawija and Tall Afar in Iraq, and Raqqa in Syria. The Yazidis who were saved were residents of Sinjar. We brought them home to their relatives and close ones. Some of them, in accordance with their wishes, were taken to refugee camps,\" Bozan said. \\nOn the second anniversary of the Sinjar attack on August 3, the UN reported that more than 3,200 women and children are still held by the terror group and being subjected to almost-unimaginable violence. \\nBozan said that many of them are being held in Mosul, approximately 120 km east of Sinjar. EXCLUSIVE VIDEO: Yazidi Activists Release Daesh Prisoner From Sex Captivity The Iraqi army, Kurdish Peshmerga fighters and allied forces have been advancing for more than a week in preparation for an assault on Mosul, the terror group\\'s last major urban stronghold in Iraq. \"More than 3,000 Yazidis are still being held by Daesh fighters, who are waiting to be rescued. In particular, hundreds of Yazidi prisoners are being held in Mosul. We intend to make every effort to ensure their release as soon as possible,\" Bozan said. \\nAs well as the Iraqi National Army and the Peshmerga, several other groups are supporting the assault on Mosul, including the largely Shiite Popular Mobilization Units, which are reportedly bombing Daesh tunnels. Yazidi self-defense forces have also taken up arms against the Daesh terror group, including an all-female battalion . ...'"}, "time": 1742563241.6612303}