{"duration": 1.4745903015136719, "input_args": {"text": "\"(Before It's News) King of Shambhala\\nalso see here for me…. I belong to an old Norwegian aristocratic ROYAL family including Count Tolstoy (Leon Tolstoy, the famous Anarchist theorician inspired the Russian Revolution but at the same time was the scion of the Chernigov Princes – 11th cent. – by far the oldest Russian royalty) , Henrik Ibsen, Papal and Royal Chamberlains, many Members of the Royal Household, (Mistresses of the Robe) barons and counts, ambassadors. All those who fail to heed heaven’s voice (the lottery draw of 666 below) will be thrown into hell in the end times says the Bible. Well, heaven has spoken. On the day after Obama’s election the lottery in his homestate drew 666. The 666 lottery-draw also reveals that Obama’s Mark of 666 means his money. Check the lottery numbers in Obama’s homestate here : the Pick 3 of Nov 5, 2008 was 666, less than 24 hours after Obama’s election!! Because I’m alone in revealing the lottery draw of 666, the Mark of the Beast that everybody knows is the Antichrist, that makes me the Messiah and Jesus’ Second Coming . Tibetan Tantric Buddhism is the highest form of culture in the world and I follow it’s Kalachakra creed. Buddhism and Hinduism never carried out war like Christianity and Islam (That’s the worst thing existing in the world.) I’m working on revealing myself and my message to the world fast now so the Apocalypse blows. My message of truth and that shows the way, must be revealed not only here at BIN (the only place in the world where speech is free), but worldwide! The lying Antichrist Camp is infesting my articles with trolling from such criminal orgs as “Organizing for Action” so don’t follow anyone opposing me here!\\nCAUGHT ON TAPE: Bill Clinton Tells Alleged Mistress to Deny He Got Her State Job\\nNEW YORK – Speaking in a series of recorded phone conversations in 1991 with his alleged mistress Gennifer Flowers, Bill Clinton can be heard telling Flowers to deny that he aided her in obtaining a state job. “If they ever asked if you’d talked to me about it, you can say no,” Clinton can be heard saying in the audio.\\nListen to the audio here:\\nClinton was referring to news media inquiries about Flowers’ alleged affair with Clinton and Flowers’ concern that the media could raise questions about how she landed her job as administrative assistant for the Arkansas Appeal Tribunal.\\nClinton can also be heard advising Flowers on how to handle a grievance filed by a woman who applied for the same position and alleged that she was more qualified that Flowers. The complainant implied that Flowers was only hired because of her alleged relationship with Clinton.\\n From December 1990 to December 1991, Flowers famously recorded a series of conversations with Clinton during the period he was Governor of Arkansas and considering a run for the presidency.\\nOn October 1991, Clinton announced his bid for the Oval Office, with rumors of extramarital affairs threatening to derail his campaign.\\nFlowers recently provided this reporter with complete original cassette recordings of her taped conversations with Clinton, recordings that take on renewed significance as the issue of Clinton’s alleged treatment of women has reemerged during the 2016 presidential campaign.\\nThe sections of the audio recordings related to the state job are not exclusive to Breitbart News. Those excerpts were played for the news media in 1992, one day after Bill and Hillary Clinton appeared side by side on 60 Minutes , where Bill denied a relationship with Flowers.\\nClinton later admitted to one sexual encounter with Flowers in a 1998 deposition for the Paula Jones lawsuit.\\nThe audio segments about the state job were widely reported by the news media in the 1990’s. However, the details may warrant revisiting amid numerous Clinton financial scandals that have since surfaced alleging pay-for-play, including those tied to the Clinton Foundation and Clinton Global Initiative.\\nIn one section of the audio, which can be heard above, Flowers discusses the grievance filed against her and informs Clinton that she was being questioned about how she obtained the position.\\nClinton says “Good for you,” when Flowers tells him that she found out about the job from a newspaper advertisement and pursued it from there.\\nHere is a transcript of that part of the audio:\\nGF – But anyway, then Wednesday, there was a grievance filed in my office when I got the job by a girl who felt like she should have gotten it, a black girl named (deleted). And they called me as a witness. So I go in and uh, nothing big came of it. It’s just that they were questioning me about how I found out about the job. And I said, “Well, that personnel said it that it was a possibility there would be a position,” and then uh, “they told me that it would be advertised in the newspaper. And it was and I pursued it from there.\\nBC – Good for you.\\nGF – Well, it caught me off guard ‘cause I… at first I just didn’t know… I just didn’t expect that for some reason. I thought about a whole lot of things about my qualifications and all that business, but I didn’t think about that.\\nBC – Yeah.\\nIn the next section of the audio, Flowers expresses concern that the news media, which was asking her questions about the alleged affair, could find out about the state job.\\nGF: Yeah. We had a little bit of a scare recently because she had a spot on an X-ray. And she went and had it checked again and it wasn’t cancer. And it’s been almost, it’ll be two years in May that she’s now diagnosed cancer free. My stepfather has been through two angioplasties, but he’s doing good. And I am, I’m really, Bill what I’m afraid of is that if somebody in the press finds out that I’m working for the state.\\nBC – Yeah.\\nGF – They’re going to make a big deal of it.\\nBC – Yeah.\\nIn a subsequent conversation, Clinton specifically counsels Flowers to say “no” if she is asked about whether she discussed the state job with him.\\nHere is a transcript:\\nGF – Well the only thing that concerns me, where I’m, where I’m concerned at this point is the state job.\\nBC – Yeah. I never thought about that, but as long as you say you’ve just been looking for one, you’d uh, check on it. If they ever asked if you’d talked to me about it, you can say no.\\nGF – Well and I would. But I’m… here is the thing I’ve got to consider, too, is I’ve gotta go in there to work every day. You know what I mean?\\nBC – Yep.\\nGF – And if, and if these people start talking or someone in the press…\\nBC – Well, have they been nice to you there?\\nGF – Yeah they have been. But I don’t, you know, I mean, I just want you to know what’s going on. And I’ll be glad to hang in there.\\nBC – Has the, has the…\\nGF – But if it gets real…\\nBC – Has the grievance committee ruled yet?\\nGF – No. Not that I am aware of. Uh, I forget the guy’s name that appeared to be the head of it. Dudley or Dewey. Is there a Dudley or a Dewy or somebody? Do you know?\\nBC – I don’t know.\\nGF – Don Barnes was there. And of course…\\nBC – Is he happy with you?\\nGF – Well sure. (Laughter.) I’m good. I’m good at what I do, Bill.\\nBC – I know.\\nGF – But Don was, you know. He… He pretty much… When this guy was trying to beat up on me a little, said, “hey, I don’t see the relevance of this” and dadada. And then the head of the grievance committee said “I don’t either and I think we need to go on and you know go, not go along with this line of questioning.” And then that was about it except for just some other minor questions. But I found that curious that he would ask me how I found out about the job.\\nBC – Yeah.\\nGF – Now maybe at this point I’m paranoid but I mean no one has mentioned anything about it to me at all but I just found that, that I found interesting.\\nBC – Yeah.\\nIn another conversation, Clinton tells Flowers that he will “nose around” to see if he can find out more about the issue, and he asked her whether the person who filed the grievance was being represented by a lawyer.\\nBC – Alright. I’m gonna nose around, if I find out anything I’ll call you. And meanwhile, uh, I can understand this grievance thing. I’ll, I’ll run that down.\\nGF – Well I don’t think there’ll be any problem there from what I understand, you know, that her deal was to either have my job or for them to create a position equal to mine.\\nBC – Uh huh.\\nGF – But it’s my understanding that then it’ll go to… even if they say yes, created position for her.\\nBC – Uh huh.\\nGF – That’s the same as Gennifer’s. Don Barnes can always say, “No, I won’t” and period. That’s it.\\nBC – That’s right. I mean that’s my understanding. So…\\nBC- Yeah. And then she could sue, but I doubt if she will. Was she there with a lawyer or a representative of any kind?\\nGF – She had a guy that works for the tribunal represent her which I thought was very inappropriate.\\nBC – Uh huh. Well, I guess maybe they do that for people…\\nContacted yesterday by Breitbart News, Flowers explained why she says she turned to Clinton for help securing the state job.\\nShe stated:\\nI found out my Mom had cancer and decided I wanted a regular job so I would have my weekends to spend with her. I was performing six nights a week and wouldn’t of had time. I asked to get me the job and he did.\\nIn her deposition for the Paula Jones case, Flowers detailed Clinton’s alleged involvement in helping her secure the state job.\\nHere is her affidavit on that matter:\\nIn early 1990 I told Bill Clinton that I wanted a job with the state. Bill Clinton told me to contact his assistant Judy Gaddy who would assist me with the application for employment. I met with Judy Gaddy in her office and she provided me with the details of what needed to be on the application. Judy Gaddy also told me to contact Clara Clark who set up a job interview for me. I was eventually employed by the state as an administrative assistant for the Arkansas Appeal Tribunal.\\nShortly after I was employed by the state, another woman who had applied for my job filed a grievance or some sort of complaint in which she alleged that she was more qualified and implied that the only reason I got the job was because I had had an affair with Bill Clinton. I was called to testify before a panel in connection with this proceeding. When I learned that I would have to testify, I did not know what to do, so I called Bill Clinton. I told him that I had been called to testify and asked what I should say. He told me to deny that we had ever had an affair. During the proceeding, when questions came up about my relationship to Bill, Don Barnes, his appointee and head of the commission, stopped the questioning.\\nIn 1992, Michael Isikoff reported at the Washington Post that Clinton’s office admitted that it helped Flowers obtain the job in June 1991, while denying allegations that Flowers was Clinton’s mistress. Clinton’s office maintained that Clinton only helped Flowers because the politician felt bad that she was being hounded by the media over the sex allegations.\\nIsikoff reported:\\nGov. Bill Clinton’s office said today that Clinton assigned a member of his staff to help Gennifer Flowers find a state job in September 1990 after she asked for his assistance.\\nMichael Gauldin, Clinton’s press secretary, also released two handwritten notes he said Flowers had written to Clinton. The first, in 1986, said she would appreciate his help in finding a job. The second, dated Feb. 23, 1991, complained that the assistant assigned to help her was not being very “successful.” …\\nGauldin said Clinton was interested in helping her in part because he “felt responsible for all the women” who were being hounded by reporters after they were named in an unsuccessful 1990 lawsuit in which a state employee alleged the governor had used state funds in furtherance of extramarital affairs.\\nIn the 1986 letter, Flowers enclosed a resume, said she “certainly enjoyed speaking with you by phone,” and said “anything you can do” to help with employment would be “appreciated.”\\nIn the 1991 “Dear Bill” letter, Flowers complained that the staff aide Clinton assigned to the matter, special assistant Judy S. Caddy, “has not been very successful in the job hunting area.”\\n“Bill, I’ve tried to explain my financial situation to you and how badly I need a job,” Flowers wrote. She said she was enclosing “some correspondence that will be of interest to you” – a letter written by a lawyer she had hired threatening to sue a local radio station for repeating the 1990 allegations. The letter, which had previously been released by Clinton, said the allegations were untrue.\\n“Unfortunately, it looks like I will have to pursue the law suit to hopefully, get some money to live on until I can get employment,” Flowers ended the note. “Please be in touch.”\\nIn 1998, the Washington Post again reported on the matter:\\nFlowers said her affair with Clinton had been over for at least a year but that about the time of the Nichols suit, she was looking for a job and turned to the governor.\\nClinton agreed to help find her a position at an Arkansas state agency, Flowers said, and enlisted a political appointee named Don Barnes. Efforts to contact Barnes last night were unsuccessful.\\n“I don’t know Vernon Jordan, and I don’t know whether he is or is not telling the truth,” Flowers said. “But it reminds me of [1990] in regard to a position that Vernon Jordan supposedly arranged for Monica Lewinsky.”\\nFlowers was hired by the Arkansas Appeal Tribunal, a state agency, after an interview Barnes arranged and sat in on, according to Flowers’ 1995 written account of her relationship with Clinton.\\nhttp://www.scoopnest.com/user/TPoliticmanager/791321070535966720\\nTrump threatened Hillary with bringing on Gennifer Flowers last month to the debate.\\nMike Pence Gennifer Flowers Wont Be at Debate Trump Was Just Mocking Clinton Camp\\nAll Stories By King of Shambhala Click Here!\""}, "time": 1742563920.8971682}