{"duration": 0.10678339004516602, "input_args": {"text": "'Comments \\nAuthor George R. R. Martin’s books inspired the hit HBO TV series Game of Thrones , and he’s no stranger to political intrigues. Even the legendary fantasy writer Martin never imagined an American demagogue, who could blithely step on every third rail of American politics and survive in the race until the general election. But the man who wrote television’s most hated character – Joffrey Baratheon – just took to his blog to explain definitively why Donald Trump will never be fit to sit on the Iron Throne be president. \\nIn my lifetime, there has never been a presidential candidate more unfit to lead this nation. \\nYou don’t need to like Hillary. You don’t need to listen to what Hillary says about Trump, or what I say about Trump. You just need to listen to Trump. If you can do that, and still consider voting for him… well… \\nMartin’s book “Song of Fire and Ice” inspired the hit TV series, which is loosely based on the War of The Roses , as the warring clans of Westeros fight for control of the Iron Throne. For much of the series, the throne has been captured by golden haired Joffrey Baratheon, whose endless list of offensive behaviors begins as a callous child, and continues through his disastrous reign. Like the fictional boy-king, Donald Trump loves to sit on fancy, throne-like chairs and using his family’s wealth and influence to play at being king. \\nThe author Martin described the highly unusual nature of this year’s presidential election by zeroing in on the striking difference between negative advertisements for the two candidates. He shrewdly pointed out that Donald Trump’s attack ads are standard political ad hominem affairs – lots of selective editing and bluster, no substance – while Democratic nominee Hillary Clinton doesn’t even create traditional attack ads. \\nMartin’s list of the many Clinton attack ads doubles as a fine reason that nobody in their right mind, should choose the Republican nominee for President this upcoming Tuesday, November 8th: \\nHillary does not need to use the sort of hoary attack ads that Trump is using. She only needs to present him as he is, and let his own words condemn them. \\nAnd they do. \\nNo one has to accuse Trump of anything, he has laid it all out there in public for the world to see. \\nYes, he mocked a disabled reporter. There he is, doing it. \\nYes, he told Billy Bush he liked to kiss women without their consent and grab them by their pussies. There he is, boasting about it. When you’re a star, you can do anything. \\nNo need to accuse Trump of going into the dressing rooms of Miss Universe and Miss Teen USA pagaents when the contestants were changing so he could see them naked. There’s Trump himself, telling Howard Stern about it. \\nYes, he said women should be punished for having abortions. There he is, telling Chris Matthews. His own words, his own face. \\nYes, he said he wants to ban all Muslims from entering the US. Here, see the clip. \\nYes, he’s in favor of Japan and Saudi Arabia and South Korea having nukes, here’s the clip where he says so. \\nAnd on and on and on and on. The Gold Star family, the bad hombres, Judge Curiel, the Miss Universe contestant… his own speeches, his own tweets, his own words. \\nMartin even remarked that for a man whose campaign resembles a nastier version of George Wallace, it is eerily starting to look like his braggadocious claim was correct, when in January, Trump said he could shoot a man on Fifth Avenue in New York and get away with it. If there’s any one moment in the Republican’s campaign that could be described as Joffrey-esqe, that was the one, where like the fictional, twisted boy king , Donald Trump reveled openly in a threat to kill senselessly, and kill with impunity. \\nThe dastardly character Joffrey’s Uncle described him in a way that anyone watching Donald Trump might describe the oddly coiffed Republican candidate, “We’ve had vicious kings, and we’ve had idiot kings, but I don’t think we’ve ever been cursed with a vicious idiot for a king!” \\nThe same harsh words equally apply to Republican nominee Donald Trump’s disastrous fall as the standard bearer of his failed party, the GOP. \\nWe agree with George R. R. Martin, all any voter needs to do is listen rationally to the irrational Trump speak, and realize that he’s not Presidential material, and has a personality only fit to be an erratic boy-king, and certainly never to sit in the chair behind the Resolute Desk in the Oval Office. \\nWatch a hilarious mashup here:'"}, "time": 1742564594.428052}