{"duration": 0.08593511581420898, "input_args": {"text": "'Good morning.  Here’s what you need to know: • An intense manhunt is on across Europe for a young Tunisian man whose identity card was in the truck that rammed into a Christmas market in Berlin on Monday, Germany’s worst terrorist attack in decades. The authorities said they had been watching him on suspicion of plotting an attack and almost deported him in June. The attack has rendered Chancellor Angela Merkel, the prime defender of the European Union and one of the bloc’s last bulwarks against   populism, even more vulnerable as national elections approach in 2017. _____ • The choking smog that has blanketed China’s northeast should ease today. A photograph of hundreds of children in Henan Province, taking a test outdoors in dense, filthy air became a flash point for public anger. _____ • A news service with ties to the Syrian government said that evacuations from the last   enclaves of Aleppo could be finished within hours. Turkey’s president, Recep Tayyip Erdogan, literally embraced one of the evacuated families: that of Bana   7, who became famous for Twitter messages describing life in a war zone. _____ • South Korea’s Constitutional Court begins hearings on the impeachment of President Park  . The panel of nine judges has up to 180 days to decide whether to uphold or reject the National Assembly’s motion. _____ • Intense jockeying for ambassadorships in the coming administration of Donald J. Trump has begun among donors, loyalists and others. We look at how Mr. Trump’s choice for secretary of state, the Exxon chief Rex W. Tillerson, a   critic, cultivated a relationship with Vladimir Putin. _____ • “The Great Wall,” a pioneering joint production between Hollywood and China has made a strong $82 million since its Chinese opening on Friday. The   epic opens in North America in February, and producers are gambling that Western audiences will pay for a movie that is very much Chinese, even if it does have a bankable American star, Matt Damon.  • Cyrus Mistry, the ousted chairman of Tata Sons, deepened his fight with the Indian giant, filing a request to block Ratan Tata, the son of the company’s founder, from attending board meetings. Mr. Mistry, above right, with Mr. Tata in 2012. • The U. S.  Trade Representative restored Alibaba to its annual “notorious markets” blacklist, reserved for websites and markets that proliferate in fake goods. • Hyundai Motor America removed its top executive in a surprise move that comes as the South Korean automaker struggles to boost U. S. sales. • Australia’s   housing market is showing signs of cooling. • In a blow to Didi Chuxing, China’s   leader, Beijing and Shanghai ruled that only local residents could be hired as drivers. • A Singaporean banker faces sentencing today on four counts of obstructing justice in a case related to the looting of the Malaysian state investment fund 1MDB. • U. S. stocks were mostly lower. Here’s a snapshot of global markets. • A chain of explosions at Mexico’s largest fireworks market  —   certified last month “the safest in all of Latin America”  —   killed at least 27 people and injured scores. [The New York Times] • Taiwan said the tiny West African island nation of Sao Tome and Principe had made “astronomical” aid requests before ending diplomatic recognition  —   one report put the demand at $100 million. Taiwan now has just 21 diplomatic partners. [Bloomberg] • India’s prime minister, Narendra Modi, visits the city of Varanasi, his political base, for the first time since his ban on   bank notes disrupted the economy. [NDTV] • James Taylor, the American   canceled a concert in Manila to protest the Philippines’ brutal antidrug campaign. [The New York Times] • And a reporter went out with Philippine police officers to see, from their perspective, the effects of the nation’s crackdown on drug users. [The New York Times] • In Canberra, a van packed with gas canisters rammed into the office of a Christian political action group and exploded overnight. Only the driver was reported injured. [Australian Broadcasting Corporation] • China and Europe are moving away from using paraquat, a chemical weedkiller that has been linked to Parkinson’s disease. But both still allow its production for export, and use in the United States is growing. [The New York Times] • An extreme winter in Mongolia is decimating livestock and sending temperatures to minus 56 degrees Celsius (minus 70 Fahrenheit). Aid groups warn of a possible humanitarian crisis. [Associated Press] • The lives they lived: We remember Muhammad Ali, David Bowie, Natalie Cole, Prince and more of those we lost in the past year. • More than a billion people regularly use WhatsApp to send text messages and make phone calls for free over the internet. Founded by a Ukrainian who immigrated to the U. S. as a teenager, the app has helped transform the experience of migrant life around the world. • A   wig and puckered lips are not all it takes for Alec Baldwin, an outspoken liberal, to get into character to impersonate Mr. Trump in his running skit on “Saturday Night Live. ” The momentous changes in Cuba  —   a warming relationship with the U. S. and the recent death of Fidel Castro  —   have been accompanied by a surge in tourism. But   visitors should be warned. Their vocabulary might not seamlessly translate to the streets of Havana. Want to know “What’s up?” The usual “Qué tal?” is “qué bola?” People head home to “el gao” rather than “la casa,” and a carless Cuban rides el chivo, not la bicicleta. Language is fluid, and borders tightly controlled since 1961 blocked some linguistic seepage from the rest of the Hispanosphere. Such distinctions, shaped by geography and history, play out worldwide. There’s the French of Canada, which to the citoyens of France can sound archaic. The Portuguese of Portugal versus that of its colonial heirs, including Brazil, Angola and Mozambique. English, carried by colonialism and capitalism, is all over the place. There are lesser known cases, too. Hungarian isn’t limited to Hungary. The Szeklers, in Romania, and the Paloc, in Slovakia, speak distinct versions. And in some places, languages marry when they meet. In Brazil, a tongue derived from German immigrants, Riograndenser Hunsrückish, blends Portuguese words with Teutonic suffixes and the lilt of Italian. Sandra E. Garcia and Palko Karasz contributed reporting. _____ Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742563241.4186008}