{"duration": 0.14159178733825684, "input_args": {"text": "'Mises.org October 28, 2016 \\nA recent op-ed piece in The New York Times urged the Republican Party not to “throw away free enterprise” and embrace populism. Arthur C. Brooks, the author of the article, makes two bold but erroneous claims. First, he asserts that populist moments throughout history — including the Trumpian moment in the US — are triggered by severe financial crises that result in protracted and uneven recoveries that exacerbate existing income and wealth disparities. \\nIn resorting to naïve economic determinism to explain populism, Brooks completely overlooks the awakening of the broad American middle class to political institutions and policies that have been designed by the entrenched elites of both parties to oppress and plunder them. The never-ending and immensely costly war against “terror;” the Federal bailout of multi-billion dollar financial institutions both domestically and abroad; the ineffective and grossly expensive war on drugs; the pandemic of political correctness unleashed by Federal mandates and regulations that has infected American colleges and universities, and the egregious and unrestrained spying on American citizens by the bloated US security apparatus. All of these issues seem to count for nothing in Brooks’s simplistic analysis. For Brooks, “The real issue is weak, unevenly shared growth.” Brooks’s attribution of the rise of populism in the US and elsewhere almost exclusively to increasing income and wealth inequality is not only peculiar but absurd on the face of it and I will refrain from further comment on it. \\nThe second claim that Brooks makes is more commonly accepted and is fervently promoted by the mainstream media, and academics and political analysts of the “responsible” left and right. This claim is that populism comprises specific ideological positions and policies. Thus, Brooks refers to “populist positions on issues such as trade and immigration” and to “populists who specialize in identifying culprits: rich elites who are ripping you off; immigrants who want your job; a free trade that’s killing our nation’s competitiveness.” According to Brooks, populist policies thus “involve some combination of increased redistribution, protectionism, and restrictionism.” In other words, on economic issues at least, populism is the polar opposite of classical liberalism and libertarianism. \\nLeft-wing and Right-wing Populists \\nBut nothing could be further from the truth. For populism is not a right-wing ideology but a strategy that may be used by any ideological group whose political agenda differs radically from that of the ruling class. Surely, Brooks has heard of left-wing populists such as Juan and Eva Perón, Huey Long, the “Radio Priest” Father Charles Coughlin, Fidel Castro, and Hugo Chávez. And what about classical-liberal and libertarian populists such as Thomas Paine and Samuel Adams, Richard Cobden and John Bright, and more recently, Dr. Ron Paul? Lately, we have seen the dramatic rise in popularity of the populist Pirate Party in Iceland , which may win the next election and whose membership is ideologically diffuse and comprises libertarians, hackers, Web geeks, and anti-globalist anarchists. \\nAlthough populism may be either ideologically left or right, libertarian or statist, it is always hated and feared by the political center. The reason is that the center is occupied by those individuals and groups comprising the “moderate” left wing and right wing who are allies in defending the political status quo and take turns ruling and operating the levers of power to distribute privilege and wealth to themselves and their cronies. \\nWhat Populists Stand For \\nRegardless of ideological bent, populist thinkers and movement builders take to heart, at least implicitly, the profound insight of great political theorists from La Boétie and David Hume to Mises and Rothbard that there is no such thing as an unpopular government. They thus set about exposing the moderates who run the State apparatus as a powerful and wealthy elite whose interests are inherently opposed to those of the masses of productive workers and entrepreneurs. In order to grab the attention of people who are not yet fully conscious that they are being exploited — or in Marxian terms, to help them develop a class consciousness — it is only natural that populist leaders employ extreme, emotional, and embittered rhetoric. Such inflammatory rhetoric is especially necessary for the US today and most European countries where the mainstream media, while ostensibly free, operate as a privileged mouthpiece for government and spew non-stop propaganda designed to camouflage State exploitation of the productive class and to discredit dissenting political movements. \\nHarsh and extreme populist rhetoric, such as that used by Donald Trump, strikes a responsive chord among the US electorate, but not because Americans are subject to irrational bouts of envy, xenophobia, and insecurity brought on by crises and recessions, as Brooks would have us believe. Rather, Americans are being awakened to the cold, hard fact that they have been plundered and oppressed by the “moderate” American globalist political establishment since World War Two. What Rothbard said about the populist French Poujadist movement of the early 1950s applies to the US and other interventionist democratic states today: \\n[T]here’s a lot to be bitter about: crushingly high taxes on businesses and individuals, submergence of national sovereignty in international organizations and alliances, fumbling and incompetent government, endless fighting in colonial wars. Especially taxes. \\nA final point: once it has penetrated into the public discourse, populism — precisely because it is the only effective political strategy for radical political change — will not wither away as a result of a few more percentage points of “evenly distributed” economic growth. Trump’s threat to contest the election, Brexit, the continuing growth of right-wing populist movements throughout Europe, all attest to the fact that populism is here to stay. This should be cause for celebration among the libertarians who for the first time since its inception in the mid-1960s have at their disposal an effective strategy for rolling back the US welfare-warfare State. \\nNote: The views expressed on Mises.org are not necessarily those of the Mises Institute. The Best of Joseph T. Salerno Tags: Joseph Salerno [ ] is academic vice president of the Mises Institute , chairman of the graduate program in economics at Pace University, and editor of the Quarterly Journal of Austrian Economics .'"}, "time": 1742562500.2036412}