{"duration": 0.0472867488861084, "input_args": {"text": "'Pedro Sánchez sigue llorándole a Jordi Évole en el bar horas después de la emisión de “Salvados” EL PROPIETARIO DEL BAR LES HA PEDIDO QUE CIERREN AL ACABAR Salvados \\nCon la mesa repleta de vasos vacíos de whisky, un destrozado Pedro Sánchez lleva más de treinta horas llorando delante de Jordi Évole y continúa contestando la entrevista para ‘Salvados’ que se emitió el pasado domingo por la noche. Han informado de ello dos miembros del equipo de Salvados que han logrado abandonar el bar. \\n“Pedro está agarrando a Évole muy fuerte del brazo mientras explica cómo la gestora truncó sus planes de futuro”, explica el realizador del programa. Según dice, Sánchez lleva pidiendo “una última copa” desde ayer al mediodía para poder seguir hablando con alguien. \\nÉvole ha podido dormir tres horas esta madrugada mientras Pedro Sánchez le explicaba cómo le habían sentado los artículos de opinión publicados en El País en los que le atacaban. \\n“Al final la gente… la gente mira por lo suyo y ya está”, ha explicado Pedro Sánchez ante las cámaras, apagadas desde ayer a las seis de la tarde. \\n“Yo qué sé. ¿Me compensa todo esto? Pues no sé… Yo… No sé. De todo se aprende y se me pasará, claro, pero no sé si me compensa o no”, ha declarado Sánchez ignorando por completo si el programa se había emitido ya o no. \\n“Yo… no sé”, ha insistido Pedro Sánchez ante un agotado Jordi Évole. \\n“Estoy genial, esto es una oportunidad”, ha dicho entre lágrimas un total de 159 veces, según las fuentes. El propietario del bar en el que se ha grabado la entrevista les ha entregado la cuenta un total de 17 veces. \\nDurante toda la mañana, Sánchez ha intentado convencer a Évole de que se una a él y a Pablo para formar un partido político porque “le gustamos a la gente”. “El PSOE nació en un bar como este, Jordi, con gente joven y con empuje como nosotros”, decía el exdiputado socialista. \\n“Mira, lo hemos hablado ya mucho, pero yo creo que al final… la gente hace lo que puede y algunos tienen más suerte y otros no tanta. El País, González… la gente hace lo que puede, ¿entiendes?”, ha insistido Sánchez durante toda la tarde. \\n“Contigo se puede hablar, no como con esa gente, tú eres el único que me escucha”, le ha dicho Sánchez a Évole mientras éste intentaba no dar cabezadas. \\nSegún los testigos, el presentador hace tres horas que ya ni se molesta en decirle a Sánchez “ahora tienes que intentar protegerte, a nivel personal, emocional”, como le decía esta mañana. \\nA última hora, fuentes de La Sexta han informado de que Pedro Sánchez ha pedido dos últimas últimas copas de whisky. “Y luego me ayudas a enviarle un WhatasApp a la gente del partido y me ayudas a decidir qué les pongo”, ha dicho.'"}, "time": 1742562297.3780446}