{"duration": 0.020042896270751953, "input_args": {"text": "'Protestants get ready to grovel By Gilad Atzmon Posted on November 9, 2016 by Gilad Atzmon \\nThis week we learned that Jewish institutions insist upon the Protestant Church apologising for its founder’s views of the Jews. The Jewish Algemeiner writes that “the 500th anniversary of the Reformation would be the ‘perfect time’ for Protestant leaders to recognise and apologise for the ‘horrific antisemitism’ of their movement’s founder, Martin Luther.” \\nThe truth of the matter is that Martin Luther didn’t know about Zionism, Israeli criminality, Alan Dershowitz, Bernie Madoff, Jeffrey Epstein, or Sir Philip Green but he still had a serious problem with the Jews. Back in 1543 he wrote On The Jews and their Lies , a book notorious for its opposition to Jews and their religion. \\nRabbi Abraham Cooper—associate dean of the Simon Wiesenthal Centre—wants the Protestants to disown the founding father of their church or at least to “directly address the issue (of anti-Semitism) in the overall context of what they’re celebrating in terms of this anniversary,” \\nDavid Michaels of B’nai B’rith insists that the churches reject some of their founder’s teachings. “This reality requires committed Lutherans and other Christians to ensure that there is fitting recognition and rejection of Luther’s hateful beliefs about Jews, wherever these persist.” \\nThe Protestant world is clearly being subjected to an institutionalized assault Judaism. But there is one thing the Jewish Algemeiner fails to do. It fails to brief us about Luther’s argument against the Jews. The truth of the matter is that Luther’s animus towards Jewry wasn’t at all racially driven. His arguments against Jews were purely theological rather than biological. Thus, using the term ‘anti-Semitism’ in reference to Luther is misleading. It leaves one wondering whether Bnai B’rith and the Simon Wiesenthal Centre are lying consciously when they refer to Luther as an ‘anti-Semite’? If they do, we may actually need to seek the assistance of Luther’s book in order to grasp Rabbi Cooper and Michaels’ conduct. \\nGilad Atzmon is an Israeli jazz musician, author and political activist. His new book, “The Wandering Who,” may be ordered from amazon.com or amazon.co.uk . This entry was posted in Religion . Bookmark the permalink .'"}, "time": 1742628569.9327424}