{"duration": 1.6872320175170898, "input_args": {"text": "\"Another Trump Surrogate Admits Trump Won’t Build That Effing Wall (VIDEO) By Darrell Lucus on October 26, 2016 Subscribe Trump foreign policy surrogate and adviser Walid Phares with several Ethiophian-American Trump supporters ( image courtesy Phares’ Facebook) \\nJust after the Republican National Convention, I told you that a number of Donald Trump’s top surrogates have known for some time that the Donald’s signature policy proposal–a massive wall along the Mexican border– only exists in Trump’s mind . They have all but admitted what we already know–a 2,000-mile physical wall is simply not feasible. \\nWell, we got more confirmation earlier this week from another prominent Trump surrogate. Specifically, his chief foreign policy adviser admitted what we have long suspected–when Trump declares, “I’m building a wall,” he’s just engaging in campaign hype. \\nPeople for the American Way’s Right Wing Watch noticed that on Monday, veteran foreign policy and terrorism expert Walid Phares sat down with France 24’s Surabhi Tandon to discuss Trump’s approach to foreign policy. Phares served as a top foreign policy adviser to the Mitt Romney campaign, and took up the same role with Trump. He is best known as an ardent Islamophobe who had close ties to extremist militia groups during the civil war in his native Lebanon. \\nThe conversation soon turned to Trump’s wall. Right Wing Watch got a clip. \\nTandon asked Phares how Trump’s planned wall would affect the United States’ relationship with Mexico; Trump has let it be known that one way or another, Mexico will foot the bill for the wall. Phares replied that Trump plans to build the wall along the American side of the border. However, as far as he knows, it won’t be a brick-and-mortar wall. “Now, will we see a physical wall on hundreds and hundreds of miles of border? I don’t know, and I don’t think so.” \\nAccording to Phares, what Trump has in mind is something like what exists in Ceuta and Melilla, two Spanish enclaves in north Africa. He claimed that there was a simple concept in place in those cities for anyone who wanted to cross into Spain via Morocco–“you come, you knock on the door, you have your paper, and you come in.” \\nTandon pounced, reminding Phares that Trump has been clamoring for a physical wall for the entire campaign. But this major Trump surrogate apparently didn’t get the memo. Phares claimed that Trump only talked about building a wall “to raise the attention.” However, since then, Phares has said that Trump has “evolved the concept” of a wall. How so? “Meaning, ‘If nothing is done, I’m going to go back to square one and build a wall. But if I can start talking with the Mexicans, I may not have to do all the wall everywhere because the Mexican government is going to finally send troops to stop these cartels.'” \\nBut wait a minute. Trump himself has declared the wall will stretch along the entire border. And he even managed to get the wall into the Republican platform. See for yourself , on page 26: “(W)e support building a wall along our southern border and protecting all ports of entry. The border wall must cover the entirety of the southern border and must be sufficient to stop both vehicular and pedestrian traffic.” \\nAnd yet, a major Trump surrogate–indeed, his top surrogate on foreign policy–has effectively left his candidate on an island. \\nWatch the whole thing here ; the exchange about the wall begins at the 6:30 mark. As I write this on Wednesday night, I can find no evidence that either Trump or the RNC has spoken up to correct the record. And I can find no evidence that Phares himself has tried to clarify his remarks. I can only conclude one thing–Trump himself knows he’s not building a wall. About Darrell Lucus \\nDarrell is a 30-something graduate of the University of North Carolina who considers himself a journalist of the old school. An attempt to turn him into a member of the religious right in college only succeeded in turning him into the religious right's worst nightmare--a charismatic Christian who is an unapologetic liberal. His desire to stand up for those who have been scared into silence only increased when he survived an abusive three-year marriage. You may know him on Daily Kos as Christian Dem in NC . Follow him on Twitter @DarrellLucus or connect with him on Facebook . Click here to buy Darrell a Mello Yello. Connect\""}, "time": 1742564386.0183635}