{"duration": 0.025525808334350586, "input_args": {"text": "'The Environmental Protection Agency (EPA) removed several web pages about climate change and greenhouse gas emissions from its homepage as the agency announced Friday that it would be “undergoing changes” to better reflect the Trump administration’s priorities. [Officials took down one website that appeared to contradict EPA administrator Scott Pruitt’s statements on climate change and removed another that provided information about the Clean Power Plan, an initiative of the Obama administration, the Washington Post reported.  “As EPA renews its commitment to human health and clean air, land, and water, our website needs to reflect the views of the leadership of the agency,” J. P. Freire, the agency’s associate administrator for public affairs, said in a statement. “We want to eliminate confusion by removing outdated language first and making room to discuss how we’re protecting the environment and human health by partnering with states and working within the law. ” The agency also said it would archive pages from the previous administration. The climate change website now redirects to a page that says that “this page is being updated” and that “we are currently updating our website to reflect EPA’s priorities under the leadership of President Trump and Administrator Pruitt. ” The page also links to an archive of how the web page looked on January 19, the day before Trump’s inauguration. Pruitt reportedly approved the changes to the EPA’s website, according to a staffer who spoke to the Post on condition of anonymity. The staffer also added that Pruitt’s aides “found a number of instances” where the information on the EPA’s website contradicted the policies of the administration. EPA sources told Reuters in January that administration officials asked the agency to take down the climate change page, but EPA staff fought to keep the page up.'"}, "time": 1742563809.398509}