{"duration": 0.0638279914855957, "input_args": {"text": "'Stanford University, one of America’s most prestigious institutions of higher learning, has reportedly accepted the application of a Muslim teenager whose application included the repition of the slogan “blacklivesmatter” exactly 100 times. [According to The Independent, Muslim senior high school student Ziad Ahmed repeated the slogan in response to the following question in Stanford’s application process: “What matters to you, and why?”  Ahmed posted a picture of his acceptance letter from Stanford on Twitter. In the letter, a Stanford representative said everyone who reviewed his application was “inspired” by Ahmed’s “passion, determination, accomplishments, and heart. ” The letter goes on to invite Ahmed to join a “diverse, joyful, and welcoming campus community. ” I submitted this answer in my @Stanford application,  yesterday, I was admitted  …    #BlackLivesMatter pic. twitter.   —   Ziad Ahmed (@ziadtheactivist) April 1, 2017,  In a comment to   online publication Mic. com, Ahmed said “my unapologetic progressivism is a central part of my identity, and I wanted that to be represented adequately in my application. ” Ahmed emphasized that his “blacklivesmatter” answer was not the only part of his application. Nevertheless, this part of his application has been trumpeted by   and mainstream publications including The Independent, Mic, the BBC, and the Huffington Post. Also, it’s important to note that this response was one answer on one application. Not my college essay or etc. There’s a lot more to it.  —   Ziad Ahmed (@ziadtheactivist) April 4, 2017,  Ahmed, 18, appears to be making rapid strides in the world of   activism. His Twitter profile includes pictures with former President Barack Obama and former Secretary of State and failed 2016 presidential candidate Hillary Clinton.  Ahmed was, as his bio claims, listed on MTV’s “Top 9 Teens Changing The World” in 2015. He is the founder of Redefy, an activist organization which aims to “boldly defy stereotypes, embrace acceptance and tolerance, redefine our perspectives positively, and create an active community. ” According to MTV, Ahmed attended the White House Iftar Dinner in 2015, during which he “chatted” with   Obama. “[The President and I] talked about   …     counterterrorism and Palestine and Israel. And we talked about education girls’ education,” Ahmed told MTV. “It was just the most enlightening and intellectual and informative conversation I could ever be part of. It reminded me of what I’d said before: Teens don’t realize we need to be in this conversation, injustice is our fight too. ” Ziad Ahmed’s personal website is called ziadtheactivist. com. He describes himself as a “speaker, thinker, and  ” who “stands unapologetically for justice. ” You can follow Allum Bokhari on Twitter and add him on Facebook. Email tips and suggestions to abokhari@breitbart. com.'"}, "time": 1742563915.7056634}