{"duration": 0.06828856468200684, "input_args": {"text": "'Facebook Caught Selling Targeted Advertisement Which Excludes Different Races \\nAndrew Anglin Daily Stormer October 29, 2016 \"This is massively illegal,\" said one lawyer when shown Facebook\\'s ad targeting system allows excluision by race. https://t.co/bCn8fLT529 pic.twitter.com/i62jKP5b8W \\nThis is so, so funny. \\nThe top SJW kike himself, Mark Zuckerberg, has been caught using logical means to sell advertisements. \\nBut logic, we goyim have been told, is pure hatred. \\nNo idea why they thought they could get away with this. \\nRT : \\nA scandal is brewing over the discovery that advertisers on Facebook can â\\x80\\x9cnarrowâ\\x80\\x9d their audience by race and ethnicity, allowing them to remove their ads from the feeds of selected demographics, including African American, Asian and Hispanic. \\nMicro-targeting, which assigns an ethnicity to users based on their page activity, is designed by Facebook to be used to target niche audiences, but it also allows for exclusion. Facebook claims advertisers are prohibited from abusing the tool, such as using it to discriminate. \\nAn ad purchased by ProPublica gave them the option to remove certain ethnic groups from viewing a housing ad. \\nâ\\x80\\x9cThis is horrifying. This is massively illegal. This is about as blatant a violation of the federal Fair Housing Act as one can find,â\\x80\\x9d civil rights lawyer John Relman told the publication. \\nFacebook responded to ProPublicaâ\\x80\\x99s report saying they believed, â\\x80\\x9cmulticultural advertising should be a tool for empowerment,â\\x80\\x9d adding that they expect advertisers to use the service in compliance with the law. \\nâ\\x80\\x9cWhen World Cup 2014 became a big focus throughout the US Hispanic community, a business developed a campaign to reach people who had shown interest in that community in order to create a positive association between its brand and the worldâ\\x80\\x99s most popular sport. This meant more relevant ads to those audiences about the World Cup,” the social media giant said, pointing out an example of micro-targeting being used successfully. \\nFacebook also said that ads in different languages were another example of the feature being useful for its clients. \\nIt was a clever troll. \\nI am in awe. \\nI of course don’t think this should be illegal – it is absolutely nonsensical to make it illegal to prefer certain races over another in any context. Even if you believe “race doesn’t exist,” the fact remains that the different races statistically act very differently from each other, so very much can be determined about a person by knowing their race. \\nBut it is so funny to see the SJW Jew Zuckerberg caught in his own Jew web of nonsensical gibberish.'"}, "time": 1742561731.6299887}