{"duration": 0.07343530654907227, "input_args": {"text": "'  Von wegen Staatsbesuch: Barack Obama ist offenbar auf Wohnungssuche Berlin (dpo) - Plant da jemand einen Umzug? Bei seinem letzten Deutschlandbesuch als US-Präsident häufen sich die Hinweise darauf, dass Barack Obama nicht etwa hier ist, um mit Angela Merkel eine seiner wichtigsten Verbündeten ein letztes Mal zu treffen, sondern heimlich nach einer neuen Wohnung sucht. Das melden mehrere Quellen aus dem Umfeld der Bundeskanzlerin. Schon kurz nach Obamas Landung in Berlin war Beobachtern aufgefallen, dass sich der US-Präsident bei Merkel auffällig oft nach Immobilienpreisen erkundigte und einzelne Räume von Gebäuden, die er besuchte, mit einem Zollstock ausmaß. Auch für Parkmöglichkeiten sowie Entfernungen zu Schulen und Supermärkten habe sich Obama immer wieder brennend interessiert. \"How much is the house behind us, Mr. Sour?\" \"Auf mich wirkt das schon ein wenig verdächtig, dass der Präsident so kurz vor dem Ende seiner Amtszeit und quasi direkt nach Donald Trumps Wahlsieg ganz plötzlich noch einmal dringend nach Europa muss\", erklärt eine Mitarbeiterin des Kanzleramts, der an der Planung von Obamas Deutschlandaufenthalt beteiligt war. \"Er hat sogar einen kleinen Stapel mit Proben verschiedener Tapetenmuster dabei, die er in fast jedem Raum an die Wand hält.\" Außerdem habe Obama Merkel gefragt, ob er einige sperrige Möbelstücke, die er nach eigener Aussage \"zufällig\" in der Air Force One mit sich führte, vorübergehend im Kanzleramt \"zwischenlagern\" dürfe. Spätestens im Januar wolle er sie wieder abholen. Auch beim Programm der First Lady gab es verdächtige Momente, etwa als sich Michelle Obama von Merkels Gatten Joachim Sauer deutsche Immobilien-Apps zeigen ließ und sich nach dem Unterschied zwischen Kalt- und Warmmieten erkundigte. Eine persönliche Erklärung des US-Präsidenten zu den Gerüchten steht noch aus – es ist jedoch davon auszugehen, dass er auf der für heute geplanten Pressekonferenz mit Angela Merkel im Kanzleramt Stellung beziehen wird. Mehrere Mitarbeiter wollen Obama bereits dabei beobachtet haben, wie er vor einem Spiegel die berühmten Worte seines Amtsvorgängers John F. Kennedy einübte: \"Ick bin ein Berliner!\" dan, ssi; Foto [M]: picture alliance / empics / Shutterstock Artikel teilen:'"}, "time": 1742564551.2711728}