{"duration": 0.11957502365112305, "input_args": {"text": "'On Friday’s Breitbart News Daily, Breitbart News Senior    Peter Schweizer looked forward to the G7 summit in Sicily as President Trump’s “first big meeting where he’s dealing with major allies and very complex issues. ”[“A lot of times, if you look at presidents in the past, these first meetings take on extreme importance because they set the tone for how the relationship is going to go later on,” Schweizer told SiriusXM host Alex Marlow.   “The audience is probably   with during the Cold War how Soviet leaders would test the resolve of people like President Kennedy and Ronald Reagan, to see what they were made of,” he recalled.  “Well, our allies kind of do the same thing  —   not with the same hostility, but when you have contentious issues they’re going to be looking, in their interactions with Donald Trump, at how wedded is he to the positions he staked out on climate change? How wedded is he on issues of immigration? Is there flexibility, is he going to move? And if he is going to move, how best to do it?” he anticipated.  Schweizer said it would be interesting to watch the reaction from world leaders to their interactions with Trump, looking for indications they are willing to move toward his position on contentious issues, or that they believe he is willing to move toward theirs. “We’ll get a pretty good sense in the next couple of days precisely what their assessment is of the new American president,” he predicted. Marlow asked for Schweizer’s take on the news that President Trump’s    Jared Kushner has become a focus of the investigation into possible Russian interference with the 2016 election. “First of all, Jared Kushner has significant ties to people in Russia, meaning financial ties, deals that have been done,” Schweizer responded. “Some of those are direct ties with investors where he shares investments in a company. In other instances, they’re people that perhaps are investors that are now based out of Israel, but are very tied commercially to Russia. That’s the first part of it. ” “The second part of it, though, is what’s kind of emerged is that some of the individuals that popped up initially in the Russia investigation  —   Paul Manafort, for example  —   we now know that actually Paul Manafort, one of the reasons he was hired or brought into the Trump circle was in part because Jared Kushner thought it would be a good idea,” he continued. “That’s really the main reason why the FBI is looking,” he said. “To be very clear, when the FBI uses the term ‘person of interest,’ that does not mean that they’re saying they’ve committed a crime. What they’re looking for is for him to talk and share with them about what he knows, as it relates to individuals, actions, deals that might have been done. They’re simply saying, ‘this is a guy that is going to have interesting things to say to us, and will help us in the investigation. ’”  “We want to be clear and make sure people know it does not mean that there’s guilt. It does not mean that he is obstructing or not cooperating. They are simply saying, ‘this is an individual that we are talking to,’” Schweizer stressed. “I think the accounts are so far that he is talking to them and trying to be cooperative. ”  “But it’s a major change and shift in the investigation, really for a couple of reasons,” he noted. “First of all, it means they’ve moved away from simply looking at Paul Manafort and Carter Page  —   people that are no longer part of Trump’s inner circle, that were essentially let go during the campaign. It second of all means that you now have a family member that they are saying played some kind of role, in some way, in negotiations or discussions with individuals that might be tied to the Russians. ” Marlow asked if it was surprising to see the media swarm on Kushner when “by all accounts, he seems like a guy who agrees mostly with the worldview of the establishment press. ” Schweizer saw it as important evidence against the notion that “if you appease the political Left on certain political views, they’re going to leave you alone. ” “It doesn’t work that way, because the political Left wants everything,” he contended. “They don’t want something, they want everything, which means they want their people in there. That’s how the game is played. ” “I think the reason that Jared Kushner is getting a lot of attention is simply because he is viewed by many people as perhaps the most powerful person in the White House, other than the president himself,” Schweizer speculated. “Now, that of course is subject to debate, but that I think is the perception. Part of that is not just because of the real power, but because he’s related to the president. You can’t fire your    per se. He’s always going to have a seat at the table. ” Referring to a New York Times piece on Kushner’s real estate holdings, Schweizer observed that Kushner owns a large number of   residential properties. “The company that he owns has a reputation for being very, very tough on renters. If their rent payment is a couple of hours late, they will get a notice of eviction claims from tenants that they’re not very responsive to repairs,” Schweizer observed.  “But something that I think is overlooked in this very long article is really one sentence, which talks about the fact that he procured thousands of these apartments in 2011, really at   prices, with the financial backing of Freddie Mac  —   which is the federal government’s financing agency,” he said. “To me, that sets off alarm bells because you have an instance here where it looks like Jared Kushner benefited from this sort of crony capitalism government program. A business professional who benefits from these kinds of programs, it automatically raises concerns that they now become advocates for those types of government programs,” he noted.  “I think part of it is, you do have this issue with   apartments, people complaining about draconian management agencies and the unfairness. Of course, there’s two sides to those stories. We don’t know where the truth lies. But the issue of the crony capitalism to me is the bigger concern, because again when it comes to the very difficult question of cutting government programs, particularly crony capitalism programs, perhaps there’s going to be more reluctance for supporting those initiatives by Jared Kushner because he’s benefited from them,” said Schweizer. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. '"}, "time": 1742561943.7692308}