{"duration": 0.17020606994628906, "input_args": {"text": "'Obama’s Secret Muslim List Why enemies of Israel and Iran’s “go-to guy” appeared on the list. November 2, 2016 Daniel Greenfield \\nDaniel Greenfield, a Shillman Journalism Fellow at the Freedom Center, is a New York writer focusing on radical Islam. \\nLike a warped Islamic version of Santa Claus, Obama had a secret Muslim list. And his people checked it at least twice. The list was of Muslims who were prospects for important jobs and appointments. \\nIt included a Muslim who had described Israel as an “Apartheid State,” Iran’s “go-to guy in New York financial circles” and a number of figures linked to the Muslim Brotherhood. \\nIt was the ultimate religious test from an administration that had vocally rejected them. \\nObama had claimed that having religious tests for migration was “shameful” and “not American.” \\n“When I hear folks say that, well maybe we should just admit the Christians but not the Muslims,” he huffed from Turkey. His Muslim host country was run by a bigoted sponsor of Islamic terror. \\n\"We don’t have religious tests,” he insisted. \\nExcept we did and we do. Obama also had religious tests. His religious tests excluded Christians and favored Muslims. That is why his Syrian refugees were between 98% and 99% Muslim with only 68 Christians and 24 Yazidis, even though both groups are real victims of the Muslim religious war. \\nSyria is 10% Christian and hundreds of thousands have been displaced. Yet only 68 have made it past Obama’s iron curtain. That’s either an Islamic religious test or the world’s greatest coincidence. \\nBut would the man who piously lectured us on the evils of religious tests really have a religious test? \\nOf course he would. \\nThe hacked emails include a list of “Muslim American candidates for top Administration jobs, sub-cabinet jobs, and outside boards/agencies/policy committees.” \\nThe list was sent to John Podesta who headed the Obama-Biden Transition Project. It had been put together by a woman who had sat on the Commission on International Religious Freedom, but boasted that she had, “Excluded those with some Arab American background but who are not Muslim (e.g., George Mitchell). Many Lebanese Americans, for example, are Christian.” \\nHow “shameful.” How “not American” of Barack Hussein Obama. \\n“Most who are listed appear to be Muslim-American, except that a handful (where noted) may be Arab American but of uncertain religion (esp. Christian),” she assured Podesta. \\nReligious tests are only out of line when they exclude Muslims. Not when they exclude Christians. \\nThat’s the pattern which emerged from the Obama-Biden Transition Project and Obama’s refugee policy. There has been a clear pattern of administration bias against Christians and Jews. And in favor of Muslims. That bias has been obvious in a foreign policy which backed Islamic supremacist groups such as the Muslim Brotherhood over more moderate governments at the expense of non-Muslim populations. \\nThis policy led to the displacement and death of countless Christians, and the persecution of entire communities, by an administration which then denied safe harbor to the victims of its own policies. \\nAdministration bias replicated that same bigoted policy at home when it favored Islamic candidates. \\nObama appointed Farooq Kathwari, the first name on the “Muslim list” sent to Podesta, to the President\\'s Advisory Commission on Asian Americans and Pacific Islanders. \\nThe “Muslim list” email had warned that, “Kathwari’s then 19-year-old American-educated son Irfan (aka Imran), was killed in 1992 fighting Jihad against the Russians in Afghanistan.” The actions of his son, who may have been with the Mujahedeen but was also apparently outraged over India’s defense of Kashmir, is of less relevance than Kathwari’s appearance at an ISNA conference and another conference co-sponsored by the Muslim Students Association. Both groups are linked to the Muslim Brotherhood. \\nHe co-chaired the American Muslim Task Force whose members included Salam Al-Marayati , Director of the Muslim Public Affairs Council, which has defended Hamas and Hezbollah, Yahya Basha, president of the American Muslim Council and a former board member of the Muslim Public Affairs Council, and assorted other Islamists . Its report complained that Muslims were inhibited from donating to “charities” run by Islamic terrorist groups such as Hezbollah. Yahya Basha also appeared on Obama’s Muslim list. \\nAlso listed was MPAC’s Aslam Abdullah who had claimed that “Zionists,” Christians and Hindus were behind the War on Terror. He had described Israel as an “apartheid state” and a “racist state.” \\nThe second Muslim on the list, Cyrus Amir-Mokri, was named assistant treasury secretary. He became the first Iranian to be named to such a high position and defended the Iran nuclear sellout. Mokri attended a meeting with members of the Iran Lobby at the White House. He also reportedly advised Obama on Iranian sanctions. \\nObama had famously told NASA boss Bolden that one of his three tasks at the space agency was Muslim self-esteem. But Bolden almost didn’t make it in. The Muslim list included two alternative candidates for NASA administrator. One of them, Dr. Charles Elachi of JPL was dismissed as “possibly Christian.” Indeed Elachi, who grew up admiring John Wayne and believes that American success is possible because it isn’t \"held back by the long-standing, ingrained systems and beliefs found in the Middle East\" would have been a rather poor fit. But it is deeply shameful and un-American that his potential NASA appointment questioned his religion. That is an inappropriate religious test that Obama must apologize for. \\nThe other name on the list however is Firouz Naderi, an Iranian board member of the Public Affairs Alliance of Iranian Americans which advocated in support of the Iran nuke sellout. \\nEboo Patel, whose name would frequently appear on lists of Islamists in the Obama administration, first made an appearance on the Muslim List. Despite his Islamist ties, he got the posting at the Advisory Council on Faith-Based Neighborhood Partnerships. Also listed were Keith Ellison, Andre Carson and Larry Shaw. Shaw sits on the board of CAIR. \\nDilawar Syed, the first name to appear on the list of possible appointments, was named to Obama’s Advisory Commission on Asian Americans and Pacific Islanders. Syed is a co-founder and chair of the Asian Americans and Pacific Islander Victory Fund which has come out for Hillary Clinton. The secret Muslim list describes him as “animated by policy issues relating to the Muslim world.” A similar description is appended to the bio for Kashif Zafar who served as a Co-Chair of the South Asian American Leadership Council at the DNC. \\nAlso on the list was Hamid Biglari. Bloomberg described Biglari as \"Iran\\'s Man in New York” and as the Iranian president’s “go-to guy in New York financial circles.” Biglari was a key Iran Lobby figure. \\nThe recently revealed secret Muslim list is deeply troubling. There should be no religious test for political appointments. Yet Obama had one. And his people sought to screen out Christians and favor Muslims. \\nThis represents behavior that is in Obama’s own words, “shameful” and “not American.” One can’t help but conclude that, based on his own principles, Obama is shameful and not American.'"}, "time": 1742561930.0495317}