{"duration": 0.14547443389892578, "input_args": {"text": "'UK May Prosecute Top Banking Officials in Public Sham   27, 2016 \\nImagine Jailing the Central Bankers Who Saved the world … The U.K. may be on the verge of an unprecedented experiment in public accountability. The courts may soon be invited to consider the following question: Should government officials face prosecution if the actions they took to support the financial system during the credit crisis stink in hindsight? – Bloomberg \\nFinally central bankers are going to be investigated. But the investigation won’t involve the system itself or why central banks are given monopoly powers to print money. \\nAccording to this Bloomberg article, banks and central bankers have been facing a potential day in court because banking officials coordinated monetary giveaways in 2007-2008. \\nSay what? With all the immense corruption surrounding central banks, what’s under investigation has to do with whether banks were pressured to behave in a certain way so as to avoid public panic? \\nMore: \\nIn late 2007 and early 2008, with markets in a meltdown and the health of British banks under relentless scrutiny, the Bank of England belatedly pumped money into the financial system. \\nWith money markets seized up and liquidity hard to find, banks were invited to trade assets for central bank cash. \\nAt issue is whether officials nudged, steered or ordered — take your pick — financial firms to act in unison, ensuring that no single bank looked more desperate for assistance than its peers. In other words, were these transactions rigged? \\nThis is a truly incredible question. The world’s monetary system is rigged from top to bottom and thanks to central bank monetary manipulation is basically in an almost decade-long quasi-depression. \\nWorse, most of the world’s central banks are doing something that’s never been considered in the history of money: either charging negative interest rates or seriously considering it. \\nWhen central banks get through adjusting interest rates to even more thoroughly distort economies, they can move toward banning cash, worldwide, something that needs to be done in concert with negative interest rates. \\nA ban on cash has never been tried in the whole of history. But these central bankers and their handpicked government officials are an ambitious bunch. Uruguay, for instance, has already banned cash for gasoline purchases and several European countries are embarked on even more ambitious programs. \\nHow about the fiddling relative to money metals? Central banks surely collude to reduce the price of gold and silver as regards other currencies. Also, many Western countries claim to have gold and silver that they evidently do not actually possess. \\nInterest rate malfeasance? Savers and investors have lost trillions because of determinedly low interest rates. How about suing bankers for monopoly money manipulation? \\nOr how about suing to bust-up the obvious monopoly regime exercised out of Switzerland where the Bank for International Settlements meets regularly with top central banks representing most of the money in the world. \\nPut China, the US, Britain and the European Central Bank around a conference table and you’ve maybe 70 percent of the world’s money supply represented. Decisions taken at that table can change the direction of world history – and probably do on a regular basis. \\nSir Paul Tucker, the former deputy governor of the Bank of England, was interviewed this year as part of an investigation by the Serious Fraud Office, the Financial Times reported this week … \\nDan Davies, a senior research adviser at Frontline Analysts, [says]: “It’s a disproportionate amount of effort to put into a ‘crime’ that was not only victimless but socially useful.” \\nMiddle classes in the US supposedly have about $1,000 on hand in savings and well over $100,000 in debt. And surely the same sort of situation is present in Europe. \\nSince the beginning of the Federal Reserve in 2013, the US dollar has been virtually destroyed: It’s reportedly only worth some two cents of its original value. Other major currencies are similarly debased. \\nThe world is facing a series of catastrophes that are much greater than a secret orchestration of banks so that one banking problem didn’t seem greater than another. \\nThe debt levels of countries, industries and individuals is so high that the William White – a former top official for the BIS – said early this year that there was no way out of a global default. What was necessary, he said, was a debt jubilee similar to ones that have taken place in the past. \\nBut British officials are worried about whether British banks and the Bank of England secretly colluded to avoid a public panic. This is the best they can come up with regarding central bank criminality? \\nIt’s a kind of meme, in fact. Propaganda. With the world’s economy in shreds, British bank officials are supposedly worried that their central bankers did things that “stink” in order to stabilize – “save” – the system. \\nPeople are supposed to look at this investigation and conclude that there is no other criminality worth investigating and that in any event British officials are indeed serious about holding banks responsible for some sort of wrongdoing. \\nWhat will be broadcast, if there is a trial, is the concern of bankers and central bankers that public panic be damped at the source – for the good of the public. \\nIn fact, one can visualize a scenario where any bankers brought up on these charges will look sympathetic to the public because their actions were supposedly taken to stabilize public perceptions and avoid a panic. \\nEconomies around the world are melting down. They are one market-crash away from nearly universal bankruptcy. The system has bestowed literally trillions of dollars of wealth on a handful of global central bank controllers while stripping almost everyone else of solvency. \\nBut the best British officials can do is investigate central bankers for supposedly trying to avoid making individuals banks the target of bank runs. \\nThe reality of central banking and its ongoing horrendous destruction will likely never be subject to real criticism until it’s too late. This sort of investigation illustrates this exactly. \\nIronically, when the world is decimated and millions, or even billions, starve due to a breakdown of the monetary economy, the same individuals now “investigating” the manipulation of public banking will suggest a global consolidation of the system. \\nConclusion: The goal is to make central bankers look endlessly sympathetic and caring to the general public. When the catastrophe finally occurs, suggestions will be made to repose even more power in these same individuals and institutions. This investigation is nothing more than a public relations sham, It is probably designed to elicit public sympathy for those it indicts, if it comes to that.'"}, "time": 1742564160.0042834}