{"duration": 0.2490241527557373, "input_args": {"text": "'posted by Eddie Without much comment or fanfare, I am going to present a note sent to me by a DEA informant who I have had a large amount of contact with over the last two years. My long-time readers may recall that during the Central American immigration invasion, I had contact with two DEA agents working independently. The information provided to me has stood the test of time. Everyone has to make up his/her mind as to the authenticity of this account. However, I want to reiterate, I have had extensive contact with this person and their information has always been first rate. Dear Mr. Hodges, As you will recall, I had intermittent contact with you during the so-called Central American immigration crisis during May-July of 2014 in which I shared my experiences with you as a result of my work with the DEA. I am sure you will recall that I introduced you to the inner workings of terrorist training base camps operating in El Salvador as well the planned influx of MS-13 trained assassins into the United States which was accomplished with the oversight of DHS. These forces will soon come into prominence in the coming weeks and months. We are going to see violence in this country on an unprecedented scale just as we are seeing in Europe with the Muslim immigration, the local police will be powerless to act because they are ultimately controlled by federal agencies like DHS who will roadblock normal law enforcement. I am telling you it is hard to not believe that the real goal is to perpetuate massive civil unrest so that more formal uses of governmental power can be brought to bear against and potential American dissident movement which has really mushroomed since the beginning of the Trump candidacy My purpose for writing to you today is to let you know that I have contact with DOJ and in particular many FBI officials as a result of daily activities. I have to watch my ass and it is not as it was two years ago when we first communicated. I am determined to see the release of certain information prior to the election because I believe you and others are correct when you say, the criminal cabal that seems to have taken over key positions in our government are poised to change America and my children and yours will have to try and survive what is coming and then they will have live in this shit hole. I am playing this very close to the vest. Responding to this email will be pointless as all of our future conversations will have to remain one-sided but I am not writing anything that I do not want released. Please release everything I am sending to you. To a person my colleagues feel betrayed by the present FBI Director and Attorney General, but I am telling you that Obama is controlling the activities through his appointed CIA operatives who have infiltrated the DOJ as well as military, generally, and the FBI, specifically. The tone of the influence is decidedly pro-“Radical” Muslim and anti-American in the traditional sense. This undue influence often seeks to perpetuate the activities of those people of privilege who seem to be beyond the reach of traditional law enforcement. Their activities include gun running and drug dealing. This has reached into your area because Maricopa County Sheriff Joe will be/is the victim of election fraud because the certain people want him out because he will not look the other way when it comes to cartel drug activity in Arizona which is key because Arizona is a border state. Your reporting of the corrupt voting machines in your area seems to be correct but Arpaio is more of a target than Trump because he is an impediment to drug trafficking in your area. You have to remember that your Sheriff was at one time one of us, so we know what we are seeing. Yes- I am saying that Obama’s DOJ is protecting the drug dealers by going after Arpaio. The persecution of the Sheriff has nothing to do with the violations of the civil rights of immigrants and has everything to do with his refusal to cooperate with the Obama administration by looking the other way when it comes to both cartel and the intertwined activities of terrorists that have crossed our borders in great numbers since 2010. Most will never know who these people are until they act. They live among us, work with us and their children even go to school our children. When they are arrested, DHS shows up to intervene and the issue is cloaked under the guise of racial prejudice and border agents and local law enforcement who are over-stepping their bounds. The police are so discouraged that they have basically given up. This is actually a case of thinly disguised criminal enterprise corruption and DHS always runs the interference. This is a lot of what you see in these inexplicable catch and release activities. The bigger the drug and gun fish that is apprehended, the quicker they are released to repeat the same actions. A case in point from the past: Do you remember when Congressman Bridenstine tried to enter a holding facility for immigrants at Ft. Sill during the 2014 immigration crisis and he was told by DHS to come back and make an appointment? DHS was attempting to shield what was truly going on which was the introduction of foreign operatives into mainstream America. West African terrorists are also coming across our border with bad intentions, not just people from Central America and the Middle East. I have every indication that these forces are ready to unleash massive waves of destruction in our country as their drug activities have increased exponentially in the past several months. They are raising money for purposes that extend far beyond mere living expenses. You have written that you expect the left to unleash terror attacks should Mrs. Clinton not win the election through whatever means is at her disposal. You are correct, but I think this may be a moot point. Speaking of Mrs. Clinton, the Foundation is the most criminal enterprise organization on the face of the earth. They avoid detection because of the use of their shell corporations which gives them at least 2-3 degrees of separation. When the President of the Philippines executed thousands of drug dealers he was upsetting the balance of trade in the drug industry and I believe he was cutting into Foundation activities. This is why Obama was going to Manila to personally speak with him until Obama was attacked with a tirade of insults and name-calling by this newly elected President. This politician will not be in power for long. The CIA has a way of taking the massive protests that we see in the news and turning it on whomever they want to displace. The people of the Philippines are protesting the military presence in the Philippines today but this could be turned into revolutionary force tomorrow. This is why this rogue President is moving towards aligning with China and you have picked up on that in an arti0cle I read. This President is looking for protection and he should be. The world war that is coming has a lot to do with drug wars, not just Syria. There are clear divisions in the world that are firming up along these lines and it would be a mistake to ignore these developments. The DEA is just as corrupted as the FBI, as we are still honoring our under-the-table agreement with the Sinolas in which we agree to only interdict 20% of the drug shipments into the United States in exchange for some unknown amount of intelligence information. How many terrorist cells do you think we are knowingly letting in along with the drugs? It was during the same time frame that you and I were talking that Judicial Watch came across the ISIS and drug cartel base camp near El Paso. I am sure you asked yourself how many facilities like this one exist and if there are any inside of the United States? There are and they are now working with foreign entities inside the United States. When we make our token busts, we frequently come upon the involvement of Russian and Chinese national who are in this country and they are immediately released by DOJ and DHS. It is starting to look like one big and happy criminal enterprise family that is international in scope but does enjoy the protection of the Obama administration. Your article about a multi-pronged attack including a Red Dawn element is close to what I know to be a real possibility and this is the advanced force designed to disrupt command and control in the coming war. The sad thing is that many agents suspect this and we are powerless to expose it. Congress has been tipped off and they show no interest. A lot of the reason that I think you are correct about what you have recently written, are the paramilitary base camps in and around San Salvador which have now spread to Honduras. this is a growing problem and growing concern. These terrorists have been trained on stingers and 50 cal weapons. They are also serving as drug transport entities. In the past couple of days since Director Comey announced he was reopening the investigation on Mrs. Clinton, I have had several advanced warnings of what was coming. The Clintons have fallen into disfavor with important entities- groups. My colleagues believe that more than Mrs. Clinton is being targeted and that there are unknown actors looking to commit a hostile takeover of the Clinton Foundation because the Clintons have stepped on important toes in the international drug and gun trade, in particular, in Peru, which is the conduit between Middle East terrorists and the cartels. As I have told you before, my associates on the FBI drug task force(s) tell me that this reopening of the investigation is not the result of Director Comey being pressured to act against Mrs. Clinton from within the FBI, as many publications have insinuated. The sudden turning of Director Comey against Mrs. Clinton is motivated by forces outside of the FBI. At least that is what we are being led to believe and I think it is so. Any agent that would launch an investigation into any of the areas that I have mentioned here would be finished or worse. I have spoken with some who participated in the original email investigation. When the emails led to guns and drugs, the emails were destroyed and this line of the investigation was reduced to a series of meaningless leads. I know this for a fact because we had some of the same information. Everyone of the agents will privately admit that the first FBI investigation was designed to produce exoneration for Mrs. Clinton. My people are aware of this because some of the subject matter involved money laundering from drug and gun operations. Don’t make the mistake in believing that this present investigation is any more or any less honest that the last one. Of course, you should also not believe what you are reading and seeing in the press. The Clinton duo is being taken down for reasons that are unknown to me by forces that I have to come to believe control Director Comey and AG Lynch. In one of your most recent articles you talked about Clinton being elected and then indicted. This opens an endless universe of possibilities about how the transition of power will be handled in January. Many of us believe that the United States is about to become a thinly veiled narco terrorist state, the biggest in the history of the world. I could see cartel members, of their representatives visiting the White House in this next administration. At present in the DEA, we are most often cast into the role of blocking legitimate investigations in these areas. Some fear that we will soon become facilitators. To date that role has always been fulfilled by the CIA. However, we think it is going to permeate the ranks of my agency. By the way Dave, you have claimed to have contact with another DEA source during the time we were speaking. Be careful, trolls abound with false information. I strongly believe that Hillary could be indicted. I think that what you have written about the possible scenarios following an indictment is possible, but that part is unknown and unconfirmed from my perspective. I do know that the FBI investigators with our assistance are still being limited in what they can look at. I have been contacted for information related to past drug investigations only to have the requests prepared and the FBI no longer shows any interest in the information, particularly if it is drug related. Any investigation that includes drug trafficking and money laundering seems to still be out of bounds. The Weiner angle is laughable but they may make it stick. It appears to some that it is open season on Hillary Clinton at the Bureau with regard to these emails. It is my belief that if Mrs. Clinton survives this latest round, and I do not think she will, we are going to see a massive purge in the government like this country has ever seen. I have given you a lot to digest so I am going to close for now. Based on what we already know, this information that earth-shattering. I look at this as business as usual and our election process and ultimately the welfare of our country is up for grabs and money is the ultimate reason why. source:'"}, "time": 1742628411.8879669}