{"duration": 0.06942367553710938, "input_args": {"text": "'\\nIt appears that threatening Republican Electoral College electors with death and violence if they don’t flip their votes to Hillary isn’t the only strategy being implemented by the Democrats and Clinton campaign.\\nAccording to computer security experts, the election was rigged in favor of Donald Trump in the key states of Michigan, Wisconsin and Florida, and they are urging Clinton to demand a recount:\\nHillary Clinton could have been robbed of the presidency by hackers, a group of experts claims – and now they’re calling for her to demand a recount.\\nThe team, which includes voting rights experts and computer security buffs, says it has compelling evidence that Wisconsin, Michigan, and Pennsylvania could have been hacked to artificially lower turnout . \\nThey’re now pressuring the Clinton group to call for an independent recount that could swing the needle of the election in the Democrats’ favor, New York magazine reported.\\n…\\nAccording to their calculations, such a hack could have cost Clinton 30,000 votes in Wisconsin. She lost that state – and its ten Electoral College votes – by 27,000.\\nMichigan was too close to call with a gap of 11,000, denying Clinton its 16 Electoral College votes, and she lost Pennsylvania’s 20 Electoral College votes by 68,236.\\nThough there’s been no suggestion of possible culprits in the potential hacking, the DNC blamed Russia for mid-election-season hacks of Democrat email accounts.\\nIf an independent investigation could prove hacking – and a recount granted Clinton those three states – then she would be made President after all.\\nFull Report: The Daily Mail \\nAhead of the election unnamed sources in the U.S. intelligence and law enforcement communities spoke to the mainstream media and warned that, while the electronic voting machines used to register a candidate were completely safe, Russia could try to undermine U.S. elections by releasing fraudulent documentation showing that the election was hacked. As we reported at the time :\\nAccording to Reuters, U.S. voting authorities are now warning that while the Russians may not actually hack the Presidential election, they may fake hacking the Presidential election .\\nWhat they’re saying without actually saying it is that if Hillary Clinton wins the election and Trump supporters show proof of any fraudulent activity, the “proof” will have been fabricated\\nIt sounds almost too crazy to believe, but this is now being disseminated to the public via mainstream pipelines:\\n….\\nU.S. intelligence and law enforcement officials are warning that hackers with ties to Russia’s intelligence services could try to undermine the credibility of the presidential election by posting documents online purporting to show evidence of voter fraud. \\nThe officials, who spoke on condition of anonymity, said however, that the U.S. election system is so large, diffuse and antiquated that hackers would not be able to change the outcome of the Nov. 8 election. \\nBut hackers could post documents, some of which might be falsified, that are designed to create public perceptions of widespread voter fraud, the officials said. ( Reuters )\\nFull report: It’s A Setup: U.S. Officials Warn That Russians Will Undermine Elections With Fake Documents Showing Voter Fraud \\nIn short, when the media expected a Hillary Clinton landslide the public was told that any “evidence” of wrong-doing was completely false, as hacking the U.S. election system was impossible.\\nFollowing Trump’s win, this has apparently changed. The “experts” say our voting systems were, in fact, compromised by hackers and they were able to change the outcome of the election in favor of Donald Trump.\\nSo who do we believe? The experts, who claim they have evidence of voter fraud? Or the Obama administration’s intelligence apparatus, which claimed that any such post-election hacking evidence would be a fraudulent attempt to undermine voter confidence?\\n'"}, "time": 1742563236.2592432}