{"duration": 0.08662724494934082, "input_args": {"text": "'“During the period of the past century that I call Night,” Elie Wiesel wrote in a 2005 essay, “medicine was practiced in certain places not to heal but to harm, not to fight off death but to serve it. In the conflict between Good and Evil during the Second World War, the infamous Nazi doctors played a crucial role. They preceded the torturers and assassins in the science of organized cruelty that we call the Holocaust. ” The quintessence of that evil was embodied in Josef Mengele, the Auschwitz physician who not only sent countless men, women and children to the gas chambers, but also performed grotesque experiments on selected prisoners  —   especially twins, whom he eagerly sought out upon arrival. Though the children he selected were spared immediate death, they were subjected to monstrous surgeries and deliberately infected with diseases he injected chemicals into eyes, in an effort to change their color, and kept some of his subjects in tiny cages. Of about 1, 500 pairs of twins in Mengele’s “Zoo,” fewer than 200 individuals survived the war. Mengele’s crimes form the backdrop of Affinity Konar’s affecting new novel, “Mischling,” which takes its title from the term the Nazis used to denote people of mixed heritage. The novel draws heavily  —   even in granular detail  —   on the 1991 nonfiction book “Children of the Flames,” by Lucette Matalon Lagnado and Sheila Cohn Dekel, and on Robert Jay Lifton’s “The Nazi Doctors. ” Its    twin heroines seem to have been partly inspired by the twins Eva and Miriam Mozes (whose story Eva told in “Echoes From Auschwitz: Dr. Mengele’s Twins”). Yet for all her novel’s indebtedness to source material, Ms. Konar makes the emotional lives of her two spirited narrators piercingly real, as they recount, in alternating chapters, the harrowing story of their efforts to survive: Pearl, once the more outgoing of the sisters, becomes more methodical, more focused on memories to get through each day while Stasha grows feistier and more cunning  —   “a creature capable of tricking her enemies and rescuing her loved ones. ” What is most haunting about the novel is Ms. Konar’s ability to depict the hell that was Auschwitz, while at the same time capturing the resilience of many prisoners, their ability to hang on to hope and kindness in the face of the most awful suffering  —   to remain, in Mr. Wiesel’s words, humane “in an inhumane universe. ” The world Ms. Konar depicts is straight out of Hieronymus Bosch  —   a place of torture, cruelty and anguish, where death is everywhere and the sky is literally red with fire and ash. It’s a place that robs Stasha and Pearl of their innocence and childhood, and threatens to indelibly change their very sense of who they are. The girls, inseparable in their past life, find themselves growing apart  —   fiercely devoted to one another, but broken in different ways by Mengele’s hideous experiments, which damage Stasha’s hearing and sight and leave Pearl in a cage, her ankles snapped and her feet smashed. Mengele, who alternates displays of avuncular concern with chilling sadism, seems to take pleasure in watching what effect separation will have on the sisters. The second half of “Mischling” largely takes place after the advance of the Soviet Army and the liberation of Auschwitz. Pearl is taken care of by Miri, a Jewish doctor whom Mengele forced to work as his assistant, while Stasha finds herself wandering, with a friend named Feliks, through a blasted,   landscape that can’t help but remind the reader of Cormac McCarthy’s “The Road. ” Survival  —   simply finding food, water and shelter  —   is paramount, but Stasha becomes increasingly obsessed with hunting down Mengele and exacting revenge. Such plot points can seem melodramatic and contrived, and Ms. Konar’s prose occasionally eddies into   pretty writing: “For eight months we were afloat in amniotic snowfall, two rosy mittens resting on the lining of our mother. ” These passages call to mind the philosopher Theodor Adorno’s warning of the dangers of making art out of the Holocaust (“through aesthetic principles or stylization,” he argued, “the unimaginable ordeal” is “transfigured and stripped of some of its horror”) but these doubts are steamrollered by Ms. Konar’s ability to powerfully convey the experiences of her heroines: their resourcefulness and will to survive their resilience and faith in a future even in the face of extermination and Pearl’s remarkable determination to embrace forgiveness. Forgiveness “did not remove my pain or blunt my nightmares,” she says. “It was not a new beginning. It was not, in the slightest, an end. My forgiveness was a constant repetition, an acknowledgment of the fact that I still lived it was proof that their experiments, their numbers, their samples, was all for naught  —   I remained, a tribute to their underestimations of what a girl can endure. In my forgiveness, their failure to obliterate me was made clear. ”'"}, "time": 1742562093.9167497}