{"duration": 0.21419143676757812, "input_args": {"text": "'The world is coming to an end, and they’re all singing “Jingle Bells. ” That may not be your idea of a great musical selection for Armageddon. But as performed by a ragtag chorus of displaced persons in Theater for a New Audience’s spirited revival of Thornton Wilder’s “The Skin of Our Teeth,” the choice of song feels fitting, resourceful, valiant and  —   for just those reasons  —   very moving. The scene comes near the end of the first act of this wobbly mammoth of a play, which opened on Tuesday night at the Polonsky Shakespeare Center in Brooklyn. And as often happens in the director Arin Arbus’s heartfelt interpretation of Wilder’s 1942 cosmic comedy, the sequence’s elements register as both exceedingly whimsical and disturbingly familiar. What’s being portrayed, after all, is an earth succumbing to climate change, which means that although it is high summer, a glacier is advancing on Excelsior, N. J. where a home has become a haven for a swarm of refugees, whose admittance was a subject of angry argument among the family that lives there. And what may be the last fire on the planet is about to go out. It is hardly a cause for celebration that the alarm bells being rung here sound as resonant today as they must have in the early 1940s, when the United States was on the brink of world war. Yet a celebratory glow pervades this   portrait of a single family’s survival against the odds through freeze, famine and war. “The Skin of Our Teeth” can be quaint, creaky and tedious. But it feels as perversely suitable to 2017 as “Jingle Bells” does to the Ice Age. When the play first opened, with a dazzling cast led by Fredric March and Tallulah Bankhead, Brooks Atkinson wrote in The New York Times that it stood “head and shoulders above the monotonous plane of our moribund theater. ” Atkinson particularly admired Wilder’s “mischievous ideas about the informality of good theater. ” But while he adored the first third of “Skin,” he was less enamored of the two other acts. He wasn’t wrong. That first act, which places a    American family on the edge of extinction in the Ice Age, still feels as fresh as morning and as old as Moses (who happens to appear in it). But as it continues to follow the allegorical Antrobus clan in its   struggle for survival (through a   flood on the boardwalks of Atlantic City and a   world war) “Skin” can wear thin. Recent revivals  —   including a misguided whopper in Central Park in 1998, starring John Goodman  —   have suggested that the play had gone the way of its singing dinosaurs. Wilder’s starker “Our Town” and robust “The Matchmaker” (the basis for the musical “Hello, Dolly! ”) seemed far more likely candidates for survival. Ms. Arbus  —   whose fruitful association with Theater for a New Audience has yielded a bright string of cleareyed productions of classics  —   doesn’t entirely restore “Skin” to newborn sprightliness. But she makes you appreciate why its first audiences cherished it. Her production does particularly well by Wilder’s inspired notion to have the improvisatory spirit of “theater, interrupted” reflect the   persistence of life itself. From its first moments (and it’s all in the script) the production is troubled by falling scenery, electrical blackouts and a temperamental actress who refuses to stay in character. That’s the woman who plays Sabina, the Antrobus’s mantrap of a maid, embodied with original comic flair by Mary Wiseman, who brings to mind not so much Ms. Bankhead (who created the part) as a young Lucille Ball with an attitude. It is Sabina who guides us  —   irascibly and apologetically  —   through the willful anachronisms of the play. Its central archetypal clan is made up of Mr. and Mrs. Antrobus (David Rasche and Kecia Lewis) and their children Gladys (Kimber Monroe) and Henry (Reynaldo Piniella) who was originally named Cain. Mr. Antrobus is an inventor of genius (his contributions include the wheel, the lever and the alphabet) while his wife is a fierce defender of family. As for Sabina, she’s basically Lilith, the eternal temptress, there to lead good men like Mr. Antrobus astray. In its sexual politics (and its Oedipal confrontations) “Skin” can feel agonizingly dated. And despite solid performances by Mr. Rasche and Ms. Lewis, the configuring of this eternal triangle occupies entirely too much stage time. It’s as a   production that this “Skin” captures, tickles and distresses the imagination. Ms. Arbus has enlisted a crackerjack production team  —   including Riccardo Hernandez (sets) and Cait O’Connor (the commedia dell’  costumes and puppets)  —   and a diverse cast of nearly three dozen (including a fierce Mary Lou Rosato as a boardwalk soothsayer) to fill Wilder’s   canvas. The production deploys them with wit and efficiency, while retaining an endearing air of ramshackle spontaneity. The script has updated its anachronisms (Trader Joe’s instead of A  P) and features some stirring contemporary songs by César Alvarez about the search for home. “So many years I have been dreaming, dreaming, dreaming of a place to call my own,” the refugees sing, toward the first act’s end. By that point, it’s looking as if they may all freeze to death. So when Ms. Wiseman steps out of character to ask the audience to bring its chairs to the stage to stoke the fire, there’s no question that were we able to oblige, we would. At such moments, “Skin” becomes a welcome pep rally for a world that could use some reassurance that it will, despite everything, carry on.'"}, "time": 1742562790.303339}