{"duration": 0.05817866325378418, "input_args": {"text": "'Home / Be The Change / Government Corruption / Govt Corruption So Rampant, FBI Buys Billboards Asking Public to Rat Out Criminal State Agents Govt Corruption So Rampant, FBI Buys Billboards Asking Public to Rat Out Criminal State Agents Andrew Emett January 30, 2016 112 Comments \\nAlbany, NY – Instead of issuing Amber alerts for missing children or escaped fugitives, New York billboards are now asking government employees and ordinary civilians to report any state corruption directly to the FBI. Since 2012, at least 17 corrupt New York lawmakers have left office due to ethical or criminal issues. \\nEarlier this month, billboards appeared along interstates throughout the capital city urging citizens to report corrupt politicians instead of drunk drivers. The FBI along with the New York Public Corruption Task Force and state Attorney General set up the billboards in an effort to delve deeper into the systemic subornation plaguing Albany. Prior to posting the anti-corruption billboards in New York, the FBI erected them last year in Connecticut and Kentucky. \\n“The public plays an integral role in helping law enforcement root out corruption,” Andrew Vale, the FBI’s special agent in charge at the Albany division, told the Associated Press . “Which is why we try to make it easier to come forward and report suspected abuse.” \\nBut Assemblyman Daniel O’Donnell, a Manhattan Democrat who once headed the Assembly Ethics Committee, explained to the NY Daily News , “It seems to me that if someone is aware of corruption in any form, they don’t need a billboard to tell them. It’s not like the people don’t know what the FBI is and what they’ve been doing. But maybe I’m wrong.” \\nIn the last four years, at least 17 New York lawmakers have left office due to criminal or ethical issues. On December 11, 2015, former New York State Senate Majority Leader Dean Skelos and his son, Adam Skelos, were convicted of fraud, extortion, and soliciting bribes. On November 30, 2015, former New York Assembly Speaker Sheldon Silver was convicted of seven counts, including conspiracy, fraud, extortion, and accepting roughly $4 million in bribes and kickbacks. \\nOn November 24, 2015, former New York State Senator Tom Libous was sentenced to six months of house arrest for lying to an FBI agent. On September 14, 2015, former New York State Assemblyman William Scarborough was sentenced to prison for wire fraud and theft. On July 24, 2015, New York State Senator John Sampson was convicted of obstruction of justice and making false statements to federal agents. \\nLast summer, former FBI agent and New York Congressman, Michael Grimm, was sentenced to eight months in prison after pleading guilty to tax fraud. In connection with his guilty plea, Grimm admitted to exploiting immigrant workers, underreporting wages, and repeatedly lying under oath. Grimm was also caught on video threatening to throw NY1-TV reporter Michael Scotto off the balcony of the U.S. Capitol building and break him in half. Assemblymen Micah Kellner, Dennis Gabryszak, and Vito Lopez either resigned or failed to seek re-election due to allegations of sexual harassment. Assemblymen William Boyland Jr. and Eric Stevenson along with State Senator Carl Kruger were convicted of multiple counts of bribery. \\nAt least 34 New York legislators have left office due to corruption or misconduct since 2000, including 17 corrupt state officials since 2012. As Assemblyman Daniel O’Donnell explained, “Anybody who is a lawmaker who is unaware that the FBI is looking at us has other cognitive problems.” \\nWith a pervasive culture of corruption, New York now apparently requires billboards to remind government employees and civilians that the FBI desperately needs their help in catching the plethora of crooked politicians. Heaven forbid someone might take it upon themselves to tackle government abuse without the FBI’s assistance. The last contracted government employee to try that was Ed Snowden. \\nAndrew Emett is a Los Angeles-based reporter exposing political and corporate corruption. His interests include national security, corporate abuse, and holding government officials accountable. Andrew’s work has appeared on Raw Story, Alternet, Activist Post, and many other sites. You can follow him on Twitter @AndrewEmett and on Facebook at Andrew Emett . Share'"}, "time": 1742628499.6856997}