{"duration": 0.07325434684753418, "input_args": {"text": "'LOS ANGELES  —   “Jason Bourne” easily won the latest box office race, but the posse in “Bad Moms” more than held its own. It was the first Bourne movie in nine years to star Matt Damon, and his   return helped “Jason Bourne” collect a stout $60 million over the weekend at North American theaters  —   roughly 50 percent more than initial results for “The Bourne Legacy,” which was released in 2012 and starred Jeremy Renner. Nonetheless, turnout for “Jason Bourne” (Universal) was lighter than for Mr. Damon’s previous two outings in the lead role. “The Bourne Ultimatum” arrived to about $80 million in ticket sales in 2007, after accounting for inflation. “The Bourne Supremacy” had about $67 million in 2004. Overseas, “Jason Bourne,” which cost about $120 million to make, collected an additional $50. 1 million, a strong result. “Star Trek Beyond” (Paramount) was second at the domestic box office, taking in an estimated $24 million, for a   total of $105. 7 million, according to comScore, which compiles ticketing data. The raunchy comedy “Bad Moms,” which cost STX Entertainment and its financing partners about $20 million to make, arrived to $23. 4 million in ticket sales. Starring Mila Kunis, Kristen Bell and Kathryn Hahn (in what many critics described as a breakout performance) “Bad Moms” received an A grade in CinemaScore exit polls, the first   comedy to achieve that result since “The Hangover” in 2009. Coincidentally  —   or not  —   “Bad Moms” and “The Hangover” were both written by the screenwriting duo of Jon Lucas and Scott Moore. “Bad Moms” attracted an audience that was overwhelmingly female (82 percent) STX said on Sunday. If positive word of mouth can persuade men to attend in the coming weeks, as STX hopes, “Bad Moms” could well become a sleeper hit.'"}, "time": 1742564398.3393342}