{"duration": 0.015951156616210938, "input_args": {"text": "'Dutch prosecutors have announced they will not be pursuing charges against firebrand Dutch politician Geert Wilders for a speech he made in Austria in 2015. [Prosecutors rejected an appeal from an Austrian Muslim association to prosecute the populist politician for incitement after he made a strong   speech in Vienna in 2015. The Dutch prosecutors said the content of Mr. Wilders’ speech was not punishable by Dutch law and that they will not pursue the matter any further, NU. nl reports.  Wilders was invited by the   migration Freedom Party of Austria (FPÖ) in 2015 to give a speech on Islamisation at the Hofburg palace. During the speech, Wilders said: “Islam calls on people to become terrorists  —   the Quran leaves no doubt about it. ” He also stated: “Islam is an ideology of war and hatred. ” Wilders wrote a reply to the allegations saying that the charges were a “legal jihad” and “while the elites are to blame for the existential crisis we are currently in, with their open   and unprecedented love for Islam and their cultural relativism, they sell us out completely and put our freedom and security at stake. ” The Dutch prosecutor explained their decision saying: “Only if a statement focuses on a group characterised by a belief may be punishable. ” “Wilders spoke on this occasion about Islam, not about Muslims, a group characterised by their Islamic faith. This falls under criticism in Dutch law and is not as insulting a group of people. ” Wilders reacted to the decision on Twitter writing: “Beautiful. The only right decision. The truth must be said and can be correct about Islam!” Mooi. De enige juiste beslissing. De waarheid moet gezegd kunnen worden, juist over de islam! https:  .   —   Geert Wilders (@geertwilderspvv) June 7, 2017,  The attempt to have Wilders brought to court for hate speech charges is not the first time the Party for Freedom (PVV) leader has been charged with incitement. Earlier this year, he was found guilty and fined 5, 000 euros for a speech he made in 2011 talking about the crime rates of Morrocan migrants in the Netherlands. Wilders’ PVV made substantial gains in the Dutch national elections earlier this year becoming the second largest party in the country. As the coalition talks stall, Wilders has said the PVV is “fully available” to take part in a new coalition government. Current Dutch Prime Minister Mark Rutte has consistently said that he would not work with the PVV, as have other parties. If coalition talks continue to break down, the Netherlands could face the option of calling another election.'"}, "time": 1742628552.6239493}