{"duration": 0.13851618766784668, "input_args": {"text": "'Trump and Brexit: Directed History Proceeds Apace? By Daily Bell Staff - November 09, 2016 \\nThe American voters have Brexited, leaving behind their global dominance America has Brexited. It’s an imperfect comparison. The United States can’t leave itself. But on Wednesday, with the election of Donald Trump, it withdrew from a number of agreements it long ago entered, some more enduring than others. The American people have voted to leave behind the late 20th century consensus on free trade and open immigration. -SMH \\nThe populism versus globalism meme is in full effect today and given the thousands of references to it currently, it’s an honor to have been the first publication to have identified this particular element of propaganda as you can see here. \\nWe also predicted several times throughout the recent months that Donald Trump might win the election and then, as a populist, face a good deal of elite retribution. \\nInfowars has an article today dealing with this, and we wrote about it again yesterday as you can see here. \\nThe difference between our interpretations and others is that we have a very difficult time believing that all of this is spontaneous. \\nOf course, Trump’s victory has unfolded in a logical way, providing justifications for those who believe that any inference that we are watching a scripted even is just so much “conspiracy theory.” \\nOn the other hand, his victory immediately provides critics with opportunities to assert the benefits and superior moral value of globalism. \\nMore: \\nThe 1992 candidacy of Pat Buchanan was a bellwether for Trump, a call for “America First” paired with a move toward economic protectionism and closed borders. \\nBuchanan lost his bid for the Republican nomination, and his ideas were muted, ignored. Not by everyone – not by the populists who carried his banner, who marched sometimes with the Republicans and sometimes with the Democrats and sometimes with third-party candidates like Ross Perot. \\nBut the GOP ignored them, and to a lesser extent, the Democrats as well. The parties agreed, more or less, and until tonight, they were comfortable in their agreement. \\nThe American people have likewise voted to leave behind the nation’s global dominance and its global partnerships. \\nWe can see in this excerpt the predictable references to populism and the characterization of the US’s current situation as one in which it is in the midst of repudiating its “global dominance and global partnerships.” \\nThis doesn’t seem right to us. It just seems like rhetoric but we are fairly convinced that the next four years will feature this rhetoric both in the US and in Britain – throughout the West, in fact. \\nAgain, we have a hard time believing it’s a coincidence. The idea from our point of view, as we have been stating over and over in the past few months, is that this rhetorical stance is the gateway to further elite, globalist consolidation. \\nIt may seem strange to make a statement that the elite forces of this world intend to “win” by losing. But everything we understand about their employment of the Hegelian dialectic gives us a sense that this is just what’s going on. \\nTop banking elites functioning out of the City of London have never reigned overtly. They have always set up two opposing sides and then gradually steered the world in the direction they want it to go. \\nThat direction is toward a globalist empire. It is simply incontrovertible. The two world wars of the 20 th century were evidently manufactured – the internet shows us that – and after both wars gigantic leaps towards globalism occurred. \\nAfter World War II, the UN was created along with the International Monetary Fund and the World Bank. The control of the Bank for International Settlements that runs central banking was updated. \\nNow in Britain, Brexit is in force. And in the US Donald Trump has won. The “populists” are in power and we are given to understand this is a “peasant revolt” of the first magnitude. \\nBut history shows us in the past few hundred years that important societal processes are strictly controlled. At a lower level, perhaps, you can be “free.” But events at the highest level are not free. \\nWe simply cannot imagine that Trump made up`his mind to run for president and did so successfully as an independent candidate and without the silent acquiescence of those who remain in power behind the scenes. \\nMaybe we’re wrong, but let us state for the record, as we often do, that the world’s power base is located among trillionaires in London who invented and control the world’s central banks. \\nThis group has been leading the way, worldwide, not for hundreds but probably for thousands of years, first in Sumer, then Babylon, then Egypt, then Rome, then Venice and finally in England where members intermarried with Royals. \\nSince the Civil War, anyway, this group has been tightening its grip on a every sector of the US from education to the military to politics and industry. \\nIt has control in Europe too – and we would make the argument that at the very top, elites in Russia and China work together as well. This is one reason we continue to make arguments against the standard history of nuclear weapons. \\nWe think it is a kind of shared lie around the world that will eventually prove clearly that the global narrative is a manufactured one on many levels. \\nTo believe that this history – if you do believe it – has been turned upside down by a single election in the 21 st century is, for us, a bridge too far. \\nAs we predicted more than a decade ago, the Internet, like the Gutenberg Press before it, has made the elite’s secretive control impossible to sustain. They need another way of influencing events. \\nThe easiest way is to provoke a public argument over the merits of populism (versus globalism) and then to use directed history to ensure people get the message loud and clear that “populism” (read freedom and self-determination) doesn’t work. \\nFor this reason we continue to expect a variety of catastrophes to continue and deepen – mostly from an economic and military standpoint. \\nWe will also be surprised if Trump’s larger vision for the revitalization of the US is going to be especially successful. It will have to be discredited along with Brexit. \\nIt could be that Trump – and Hillary – are unaware of these trends. Not everything has to be a gigantic conspiracy at all levels. But one way or another, first Brexit and now Trump seem to be creating a kind of “directed history,” \\nConclusion: Add the sudden appearance of the populism vs. globalism meme and you have rhetoric married, sooner or later, to action. One or two of these elements would be coincidental. All three or not. These events seem arranged.'"}, "time": 1742563757.1673381}