{"duration": 0.09455084800720215, "input_args": {"text": "'According to reports, scientists have come up with a never-before-seen system that has the ability to predict big events on our planet hours before they actually occur. \\n\\nAfter over half a decade of research, several scientists claim they have uncovered the existence of a so-called ‘collective consciousness.’ They are calling it the ‘Noosphere,’ and it exists all around us.\\n\\nAs it states on their website :\\n\\nThe Global Consciousness Project is an international, multidisciplinary collaboration of scientists and engineers. We collect data continuously from a global network of physical random number generators located in up to 70 host sites around the world at any given time. The data are transmitted to a central archive which now contains more than 15 years of random data in parallel sequences of synchronized 200-bit trials generated every second. \\n\\nOur purpose is to examine subtle correlations that may reflect the presence and activity of consciousness in the world. We hypothesize that there will be structure in what should be random data, associated with major global events that engage our minds and hearts.\\n\\nSubtle but real effects of consciousness are important scientifically, but their real power is more immediate. They encourage us to make essential, healthy changes in the great systems that dominate our world. Large scale group consciousness has effects in the physical world. Knowing this, we can intentionally work toward a brighter, more conscious future. \\n\\n\\nThe revolutionary system is called the Global Consciousness Project and its a revolutionary results acquired after more than 50 years of extensive studies.\\n\\nExperts strategically positioned electronic circuits around the globe which act as ‘coin flippers’ but instead of coins being flipped, the flip bits – digital bits.\\n\\nIn the experiment, scientists characterized ‘heads’ as being 1s and ‘tails’ as being 0s. The system generates random sequences of 1s and 0s.\\n\\nSo what did scientists actually do? To get the system starting, scientists asked people to focus their mind so the system could generate more 1’s. Results showed that ‘somehow’ aft the end of the study, the system registered spikes in the random number generator RNG which came up with more 1s than 0s.\\n\\nAfter years of tests and studies, experts discovered there were biases showing in the randomness. The system that should behave ‘randomly’ no longer behaved so when people interact mentally with them.\\n\\nThese fascinating results –which many people find impossible— gave scientists an idea to create so-called RNG eggs around the globe. These ‘devices constantly work and acquire data.\\n\\nSo far there are around 60 of these ‘devices, aka eggs.’ They are located all around the globe: Europe, the US, Canada, India, Fiji, New Zealand, Japan, China, Russia, Brazil, Africa, Thailand, South America, and Australia.\\n\\nThat’s fascinating but how does it work? Ok, so you have these RNG ‘eggs’ which are basically like receivers. Imagine each egg is flipping a coin and trying to guess the outcome. Every time it guesses correctly, it’s interpreted as a ‘hit.’ The ‘eggs’ can do this 100 times every second.\\n\\nExperts behind the Global Consciousness Project found that they obtain a large number of hits, more than what can be attributed to pure chance, which coincides with MASSIVE global events.\\n\\nAccording to reports, hours before tragedy struck the United States and the first place crashed into the WTC on 9/11, researchers noticed huge spikes in the number of registered hits. Apparently, this anomaly was first noticed then Princess Diana died.\\n\\nThese spikes would appear around different noteworthy global events.\\n\\nAfter 20 years of tracking these events, expert’s realized that the results were far above random and that they were onto something.\\n\\n\\nReports indicate that over the 426 pre-determined events measured in the entirety of the project, the recorded probability of a hit was greater than 1 in 2. In fact, the probability is one in a trillion that the effect is due to chance.\\n\\nMany people believe that these results are the ultimate evidence that some sort of collective, entity or consciousness exists on planet Earth.\\n\\nToday, the Global Consciousness projects is an international multidisciplinary collaboration of scientists and experts in different fields. They monitor and collect data from a global network of random number generators around the planet.\\n\\nA mobile app has been created which can notify you when there is a spike somewhere near you, or on a global scale.\\n\\nThe mobile apps can also be used to track the activity of RNG around the globe.\\n\\nDean Radin, a scientist that participates in the project explains in the video below: \\n\\nAncient-Code SOURCE '"}, "time": 1742564315.208337}