{"duration": 0.04761981964111328, "input_args": {"text": "'Posted on October 30, 2016 by Graywolf Published on Oct 17, 2016 by Leo Stratton 10-16-16 Portland Or, City Hall, Laz and Shawna Cox present newly uncovered evidence of the co-conspiritors in the murder of LaVoy Finicim Hedge Funds, greed, power, its all exposed here in this, part 1 of this series Published on Oct 18, 2016 by Leo Stratton 10-16-16 Portland Or, City Hall, this is part 2 of “new evidence Lavoy Finicim murderers” Laz and Shawna disclose documents and information with details pertaining to purchase of land for 10 $/ acre, the Bentz Family and their corruption, and the many Officials benifiting from the theft of our land, liberty, and freedoms. Published on Oct 18, 2016 by Leo Stratton 10-16-16 Portland Or, City Hall, previously in videos 1 and 2 Laz and Shawna present the newly discovered documents pointing to the monetary gains, via hedge funds, executive orders, and other means that led to the land seizure of innocent ranchers, and the murder of LaVoy Finicim, this further explains details. Published on Apr 20, 2016 by Leo Stratton 4-20-2016 you are watching video 4 the conclusion to the “BOMBSHELL” videos, as i was filming a Stand with LaVoy Finicim and our Patriots event in Portland Or, in front of the Federal Courthouse where many of the individuals from the Compound near Burns Oregon are being held without bail, i filmed an individual with a very powerful message, i posted it to my channel and it became popular, He contacted me because he was flattered, and subsequently invited me among the inner circle of Patriots joining him to expose the documents he has tirelessly gathered to implicate the true villains and exonerate the ranchers and other individuals simply trying to make an honest living Published on Oct 18, 2016 by Leo Stratton 10-16-16 Portland Or, City Hall, as the first 3 videos in this series state, LaVoy Finicim was assassinated to cover up the greed and wealth grab by Politicians who make their own laws, and believe they are aboe guilt, Laz and Shawna’s intent is to present documents that prove beyond a reasonable doubt, their collusion destroy many Families lives and to make sure it does not continue. \\nwww.pcta.org Proxy Highlight \\nThe Pacific Crest Trail is one of the best trail experiences on Earth. We’re on a mission to protect it forever. Join us. \\nWestern Oregon Plan Revision Final EIS Archive Oregon … If you would like to download the entire document please use the links below. It might take a significant amount of time to download each volume. The following … \\nweb.pdx.edu/~stipakb/download/PerfMeasures/OregonBenc… Proxy Highlight \\nwhat was really involved in the Oregon Benchmark system? What were the major elements? How was the public involved in setting them? What was the …'"}, "time": 1742561663.5624018}