{"duration": 0.06670737266540527, "input_args": {"text": "'Scientists on Friday debunked a widely circulated news media report suggesting that recent   global temperatures were unrelated to climate change. The report, which first appeared in The  Mail on Sunday and was summarized in Breitbart News, the   opinion and news site, cited incomplete data and drew incorrect conclusions, the scientists said. Federal and international agencies have said that 2016 will likely be the hottest year on record, eclipsing the record set last year. In its report, The Mail on Sunday cited a recent decline in temperatures over land since the weather phenomenon known as El Niño ended this year, and said that El Niño, and not climate change, was responsible for the record heat. But scientists said that while the recent El Niño did contribute to the record warmth, climate change played a major role, too. “Nobody said the record temperatures were exclusively the result of climate change,” said Mike Halpert, the deputy director of the National Oceanic and Atmospheric Administration’s Climate Prediction Center. Deke Arndt, the chief of the climate monitoring branch at the NOAA’s National Centers for Environmental Information, said that the   warming trend was quite clear, and that the impact of El Niño was in addition to what were already higher temperatures. “You can have both climate change and a goose from El Niño,” he said. In an El Niño, water temperatures increase in the eastern equatorial Pacific, affecting air temperatures and weather worldwide. Sea surface temperatures have declined since their peak earlier this year, and now the opposite condition  —   La Niña, with water temperatures lower than normal  —   prevails. Scientists are not surprised that some global temperatures are falling and expect that temperatures next year will be below those of the past two years because of La Niña. “But it’s still likely to be quite a bit warmer than average,” Mr. Halpert said. Scientists said the news media reports were also faulty in that they cited only temperatures over land, which account for about 30 percent of Earth’s surface. Temperatures over land are much more variable than those over water because land stores relatively little heat. “If you’re going to be making   assessments,” Dr. Arndt said, “you need to be looking at   data. ” Global data show a slower decline in temperatures than   data, scientists said. The House Committee on Science, Space and Technology posted about the Breitbart News report on Twitter on Thursday. The committee’s Republican chairman, Representative Lamar Smith of Texas, has accused the Obama administration of having a “suspect climate agenda. ” The House committee’s Twitter post drew sharp rebukes from scientists and others, including Senator Bernie Sanders of Vermont, who wrote on Twitter referring to an academic expert cited in the article. The Mail on Sunday report, which was written by David Rose, was also strongly disputed online. One blogger headlined a post on the subject: “How Stupid Does David Rose Think You Are?”'"}, "time": 1742563308.7508368}