{"duration": 0.09472107887268066, "input_args": {"text": "'MASONVILLE, Iowa  —   Lavern Kelchen stood in the back of a church hall in jeans and a   shirt, tapped his left index finger on his leg and placed the winning bid on a   farm here in eastern Iowa. It marked the seventh auction he had attended in the last five years and, with a bid of $9, 000 an acre, his first win. “I’m just getting a really good start,” said Mr. Kelchen, 51, who farms 2, 400 acres near Edgewood, Iowa. “I plan to go as long as I possibly can. ” For farmers like Mr. Kelchen, whose work is a   lifestyle, retirement seems more like a sentence than a prize. “The first two days I’d probably be all right,” he said. “But after that, I’d be going haywire. ” Mark Francois, 64, a farmer who also bid on the farm, echoed that sentiment. “I can only play so much golf,” he said, seated beside his son. “I don’t look forward to retirement. I look forward to doing fieldwork. ” Even Dean Vaske, 52, the farmer whose late parents’ land was being auctioned off, agreed. “I’m glad retirement is far away,” he said. “I love what I do, so why would I want to quit?” Farmers tend to work longer than most Americans, and recent statistics show they are farming even later in life, driven by work that is their identity, aided by technology that lightens its physical toll, and spurred by solid profits off record yields. According to the Department of Agriculture’s latest census, conducted in 2012, the average age of principal farm operators in the United States is 58, up from 50. 5 in 1982. One third are at least 65, the traditional retirement age, and 12 percent are 75 or older. Ask baby boomer farmers here how they are planning for retirement and the likely answer is: They are not. Fifteen percent of Iowa farmers never intend to retire, according to a 2014 farm poll by Iowa State University Extension and Outreach and the state agriculture department. Another 20 percent said they plan to eventually   continuing to provide some managerial control or labor to their farms. Many do not have a formal retirement fund. The land, they say, is their 401( k). The same fierce independence that drew them to farming characterizes their retirement approach: free of pensions, unions and   experts, just how they like it. “We’re on our own,” Mr. Francois said. “All you have to do is ask for advice, but we don’t. ” Only 49 percent of Iowa farmers have identified a successor to eventually run their farms, according to the 2014 farm poll. Many avoid the topic because they equate retirement with mortality. They are quick to relay stories of farmers who died shortly after retiring  —   presumably, they imply, because of a loss of purpose. Even those who have selected a successor are loath to pick a retirement date and actively prepare for it. It took a tornado for Dean Vaske’s father, Art, to retire and move into town. He had been milking cows twice a day until his early 70s. Then the tornado wiped out another son’s farm buildings, prompting Art to invite that son to move onto his farm. Looking back, Dean Vaske said, the transition was smooth. “We couldn’t have planned it much better,” he said. Farmers here assume retirement will work itself out. “If everyone’s raised right, the next generation will take care of us when we get to the point that we can’t farm ourselves,” said Jim Hogan, 66, a   farmer from Monticello, Iowa, whose father never retired. Mr. Hogan has two sons who farm with him and “no idea” how he will structure his retirement income when he scales back from daily operations. Yet he admits that his father’s lack of succession planning (the farm was ultimately left in the control of Mr. Hogan’s mother when his father died) was not ideal, limiting what Mr. Hogan and his brothers can now do with the land, which is still owned by his mother in a trust controlled by a law firm. David W. Baker, a farm transition specialist from Iowa State Extension and Outreach, said that when he counsels families to help them begin discussing retirement, 90 percent of his meetings bring someone to tears. “There are strong feelings about the farm, about what grandpa and grandma did, about my son or daughter having no interest in my farm,” Mr. Baker said. Amanda Van Steenwyk, who leads a   program for the Iowa Farm Bureau, said the   scenario can be devastating. “From the lack of planning, the farm will get split up  —   or even worse, the family will get split up,” she said. A farmer’s retirement is determined by whether an adult child is involved in the operation. This is the case for 31 percent of Iowa farmers, according to the farm poll, which means they will typically sell or rent the land to their farming child upon retirement. Arriving at an equitable arrangement for the nonfarming children can be a challenge, experts say. Meanwhile, there is pressure on the child operating the family farm, said Matt Hein, 61, a Monticello farmer. “You’re actually working with your father’s retirement plan,” he said. “You to go to bed at night thinking, ‘That’s a retirement plan. ’” For Jack Kintzle, 73, a retired   farmer near Cedar Rapids, Iowa, the fact that his children chose not to farm made him wistful at first, but ultimately simplified his retirement equation. “It helped me make a cleaner break,” he said. Now Mr. Kintzle lives off his 700 acres. Some retired farmers   leasing their land and splitting the crop between owner and operator. Others set up a   lease in which another operator pays a fixed price per acre to work the land and keep all of its income. Last year’s average rate was $235 per acre, according to Iowa State data. But farmers are in no rush, guided by a reversal of conventional wisdom on retirement. While many Americans fear they could work themselves to death, farmers see their livelihood as their lifeline. Success does not allow them to quit earlier, it prods them to keep going. And they don’t envy retirees  —   they feel sorry for them. “It’s sad when people have a countdown to retirement,” Mr. Francois said. “They obviously don’t love their job. My friend who worked at the Postal Service had it right down to the hours till he could quit. Now he spends a lot of time just reading. He doesn’t get outside as much. I don’t think he even looks good. ”'"}, "time": 1742562740.9989963}