{"duration": 0.06595039367675781, "input_args": {"text": "'Share This When 3 female Hillary supporters decided to steal dozens of Trump-Pence signs, they had no idea whose attention they caught. \\nThree liberal women were so upset over Donald Trump’s rising poll numbers that they decided to go around stealing the Republican candidate’s campaign signs off of citizens’ lawns. However, just as they were celebrating their bounty on the side of the road, they were instantly smacked with a perfect dose of American justice. \\nLiberals are all for free speech unless you disagree with them. In that case, they’ll instantly shut down the conversation by labeling you a racist bigot who hates women. If they’re feeling especially unpatriotic, they’ll let you know that your opinion is hate speech. This is exactly what a group of liberal feminists is claiming after they were recently caught depriving others of their freedom of expression. \\nElizabeth “Betta” Stothart, Martha Murdick, and Heidi Kendrick were apparently so angry about Trump’s “locker room talk” leaked just in time for the election that they decided to take matters into their own hands. The cowardly trio headed down Route 1 in Falmouth, Maine, plucking Trump-Pence signs from people’s yards and tossing them into their vehicle. What the entitled misandrists didn’t realize was that a heaping dose of karma was headed their way. \\nFox News reports that the women pulled over on the side of the road on October 14, proudly admiring their unlawful deed, when suddenly a police officer approached the guilty party. Tipped off by their late-night suspicious behavior, the officer confiscated 36 stolen signs and made a report of the crime. \\nHumiliated that their own ridiculous conduct was found out, the 3 thought that a warning would be the end of their embarrassment. Adding to their dismay, David Jones, the chairman of the Making Maine Great Again political action committee, heard about the sign thieves and immediately pressed charges of theft against all 3 women. Elizabeth “Betta” Stothart (pictured) and her accomplices, Martha Murdick and Heidi Kendrick, are scheduled to appear in court. \\n“I have a lot of explaining and apologizing to do,” Stothart wrote. “I also have advice for anyone who might be on the verge of doing something stupid. It’s not worth it. Find a healthy way to express your outrage.” \\nThe Hillary supporters are scheduled to appear in court on December 15, they still can’t believe that stealing is breaking the law and, surprisingly to them, they are not above the law like their beloved candidate. \\nThe women have been charged with theft and it’s reported that the chairman isn’t letting this go so easily. As cases of campaign sign theft are on the rise, these 3 are likely to be made the example to other potential political thieves. \\nIn fact, Mad World News reported last week that a Democratic activist was arrested for stealing dozens of Trump-Pence signs in Northfield, Illinois. However, he was only charged with driving with a suspended license and was allowed to keep the stolen property. \\nAs expected, one of the women made a pathetic attempt to excuse her juvenile behavior. In a Washington Post opinion piece, Stothart whines that she was “angry” about the women who have accused Trump of sexual harassment and abuse. Of course, she has no outrage over the women and children that Bill Clinton has sexually assaulted, not to mention the victims Hillary threatened and harassed to protect her sexual predator husband. \\nFurther insulting actual victims of assault, Stothart likens her selective outrage over Trump signs to being “assaulted,” adding that it is “rude” for Trump supporters to place signs expressing their political stance on their private property but not equally as offensive for Democrats to show their support for heinous crimes like, say, butchering partially-birthed babies or voting for a woman who laughed about defending a child rapist who she knew was guilty. \\nLeftist hacks like Stothart and her gang of mid-life crisis buddies give women a bad name, contributing to the stereotype that the female gender cannot control their emotions. Ending on a comical note, Stothart tells readers “for God’s sake, please, vote.” That’s right. A voter for the party that booed God’s name 3 times at their national convention is telling everyone to vote — unless, of course, you’re voting for Trump. In that case, her tolerance extends as far as your front lawn.'"}, "time": 1742564112.2079048}