{"duration": 0.03171682357788086, "input_args": {"text": "'Days after the government of Venezuela published a bizarre “proof of life” video of a man claiming to be opposition leader Leopoldo López, his wife and attorneys say they have yet to be allowed to see him in person. [The Organization of American States (OAS) has stepped in, demanding that its head, Luis Almagro, be allowed to meet with López in person.  López has been in solitary confinement for over a month and his health status remains a mystery. On Wednesday evening, Senator Marco Rubio ( ) confirmed on Twitter that he had information that López’s health was in “very serious” condition and had been transferred to a military hospital. The government responded by denying the rumors and airing the video in question. Almagro made his demand to be allowed into Venezuela and confirm López’s wellbeing on Twitter, following nearly two days of speculation that the opposition leader, who turned 46 in prison last week, may be close to losing his life. I demand to visit @leopoldolopez based on the commitments that #Venezuela has with the   System of Human Rights @OAS_official pic. twitter.   —   Luis Almagro (@Almagro_OEA2015) May 4, 2017,  “The government of Venezuela has refused to confirm political prisoner Leopoldo López’s state of health,” Almagro added. Almagro has long been a thorn in the side of the Venezuelan government, using his power as the head of the regional organization to demand that Venezuela adhere to the OAS’s democratic charter. The organization has a right to suspend or expel nations that do not adhere to democratic standards, as it did with Cuba in the 1960s. In response to pressure from the OAS to adhere to its own constitution and hold presidential elections, the Venezuelan government officially petitioned to leave the group altogether last week. Venezuela’s withdrawal from the OAS would take at least two years, however, which means Almagro is in his right to demand to see López. On Thursday night,   protesters held a candlelight vigil outside the notorious Ramo Verde prison in which López is serving a   sentence for organizing peaceful protests in 2014. Leading the vigil was Lilian Tintori, his wife, and Antonieta López, his mother, who say they have not been permitted to visit López in over a month and demand to see him in person and confirm his good health. The government has also barred López’s attorneys from visiting him. Tintori posted regular updates on Twitter from the gates of Ramo Verde, confirming that the government had dispatched a line of soldiers to block her and supporters from crossing into the prison. 11:18 pm DENUNCIO estoy en la cárcel militar de Ramo Verde, no me dejan pasar. Leopoldo López tiene 32 días incomunicado. pic. twitter.   —   Lilian Tintori (@liliantintori) May 5, 2017,  “I denounce  —   I am at the Ramo Verde military prison, they do not let me in,” she wrote on Twitter. “Leopoldo López has been incommunicado 32 days. ” In addition to calls from Almagro to allow international observers to confirm López’s health status, the opposition leader’s father, Leopoldo López Gil, has requested that the International Committee of the Red Cross (ICRC) send a representative to Venezuela to check on his son. Other international organizations, such as Amnesty International, have weighed in to demand López be allowed to see his family. On Wednesday night, news spread on social media that López’s condition at the prison had deteriorated so much that he had been transferred to a military hospital. Shortly after those rumors began, National Assembly minority leader and suspected drug kingpin Diosdado Cabello, who was hosting a live state television program at the time, announced that López  —   who he referred to as “the Ramo Verde monster”  —   was healthy and published a bizarre video of a man claiming to be López confirming his good health. The man in the video appeared significantly muscular and wore a belt around his waist, which some on social media noted would violate the rules of Ramo Verde. He also appeared to be in daylight, while claiming the time of the video to be 9:00PM local. Tintori denounced the video as “false” on Twitter and wrote, “The only proof of life we accept is to see Leopoldo. ”'"}, "time": 1742628499.627521}