{"duration": 0.06999778747558594, "input_args": {"text": "'Sometimes going home for the holidays is hard (there’s a reason liquor sales swell during these occasions!). Often, Thanksgiving dinners bring far-flung family members together at a single table under one roof, and that, even in the best of circumstances, can lead to stress and awkward conversations. Add in the fact that this is an election year and you’re bound to encounter some strain while you pass those mashed potatoes across vastly different ideologies. I’ve heard from more than one friend or family member that they won’t be attending holiday dinners this year, and I think that’s really a shame.\\nI’d encourage anyone thinking about going that route to reconsider; the following tips can help to make your Thanksgiving dinner manageable and enjoyable and can help you focus on your families’ similarities, rather than differences.\\nRemember the Golden Rule of Polite Conversation If you’re an activist of any sort this may be difficult to adhere to, but the two topics that are best to leave on the coat hook are your religious and political views. Remember last year when Uncle Joe successfully convinced everyone at the table to convert to his exact religious and political beliefs? Yeah, that didn’t happen. No matter how zealous your convictions, if you truly want to make the two hours of Thanksgiving dinner comfortable, you need to skip that kind of talk. Now is no time to be passive-aggressive either: leave the political-themed hats and t-shirts at home. Focus instead on the personal: how people are doing in their jobs, what hobbies they are participating in, how their kids are doing.\\nIf someone tries to bait or lead you into a conversation that approaches one of the two danger zones, be nice but don’t engage. I once escaped a horrible conversation with a distant cousin by complimenting her earrings. Really, this is no different than abstaining from talk about your digestive issues or the road kill you saw on the drive over—it’s just plain rude to go there. And if your family happens to all hold the exact same beliefs and convictions, well, how nice for you! (Though you should know that for years my family assumed I shared their same political opinions when I absolutely did not—consider this might be the case for the person next to you at the table.)\\nThankful for Place Settings When I host Thanksgiving dinner at my house, each place setting has a little piece of paper with the subject heading “I am thankful for:” and 5 blank lines. I also give out fountain pens like these as a little gift to my guests. As everyone is seated, they fill out their lists. We take turns over the course of the dinner reading our lists. This is a great way to focus on what really matters to us and to help us share in our gratitude.\\nDo Your Part Preparation is key in all situations, so having a couple of talking points in your conversation arsenal is smart. Avoid lulls in conversation by contributing. Think about something positive or meaningful that happened to you recently—a beautiful place that you visited or a great (non-political!) book or movie that you saw—and have an anecdote ready.\\nWhen all else fails, you can always talk about the food: what your favorite part of the meal is, how certain dishes were prepared, and how good the wine is (but go easy on the wine!). \\nPamela Bofferding is a native Texan who now lives with her husband and sons in New York City. She enjoys hiking, traveling, and playing with her dogs.\\nThis information has been made available by Ready Nutrition \\nOriginally published November 17th, 2016 Southern Girl’s Survival Guide to Thanksgiving – The Thanksgiving Club Sandwich Negotiate Like a Pro With These 5 Powerful Tips How to Spot the Sociopath in Your Midst What to Do If Your Partner Thinks Prepared = Paranoid '"}, "time": 1742628298.0291784}