{"duration": 0.04960966110229492, "input_args": {"text": "'French   presidential candidate Emmanuel Macron has said German Chancellor Angela Merkel’s   mass migration policy has “saved our collective dignity,” and warned that criticism of Merkel was a “disgusting simplification. ”[Macron affirmed that even after the Islamic State attack in Berlin, committed by Tunisian migrant Anis Amri, he supports the migrant policy of Chancellor Merkel.  Expressing his admiration for Germany, he told German newspaper Süddeutsche Zeitung, “Chancellor Merkel and the whole of German society were at the same level of our [French] common values. They saved our collective dignity, by accepting, accommodating, and educating distressed refugees. ” The former economy minister, who announced his presidential candidacy in   added it was a “disgusting simplification” when Merkel was accused of surrendering her own capital and the whole of Europe with the admission of over one million migrants from the Middle East and Africa. In response to questions of securing the continent against terrorism, Macron called for more European Union (EU) integration, including an expansion of the European Border Agency. He said EU nations “also need to overcome national unwillingness and create a joint intelligence system. ” Macron is deemed the election’s “third man” behind the Republicans’ François Fillon and Front National’s Marine Le Pen. The former Socialist Party member and protégé of François Hollande claimed he is “neither on the left nor on the right” and that his policies are a “progressive” appeal to voters who want France to be “open” and  . In October, Macron had said he believed France, after over a year of deadly terror attacks including in Nice and Paris, had disproportionately ‘targeted’ Muslims and suggested the country should be less stringent in applying its rules on secularism. Macron’s comments come following the New Year’s addresses of French President Hollande and German Chancellor Merkel, whose countries’ citizenries are set to go to the polls this year. Merkel, who is running for a fourth term as chancellor, defended her migrant policy, telling the German people that Germany will fight the “hatred” of terrorism with “humanity” and “unity. ” Hollande denounced nationalism in his address, his comments roundly criticised by presidential candidate Le Pen who stated that after the populist victories of Trump and Brexit, the French share the worldwide “aspiration for independence” in the fight against globalism.'"}, "time": 1742562091.5207465}