{"duration": 0.15932965278625488, "input_args": {"text": "'in: General Health , News Articles , Toxins Halloween is creeping near, are you prepared? Before you make a mad dash to the nearest costume shop, consider this—do you know what’s in your costume? Your masks and makeup? Terrifying toxins! Catastrophic chemicals! Horrifying harbingers of–ok, alright. You probably get the idea. Festive Halloween accouterments can be loaded with harmful chemicals and toxic metals. It can be difficult to resist a low-price costume produced with cheaply-sourced goods, but there are a few good reasons why you should consider more than price when deciding which Halloween products to buy. Chemicals in Costumes, Accessories, and Decorations Costumes, accessories, and decorations from most major national Halloween retailers contain chemicals and additives that have been linked to health issues such as reproductive problems, developmental delays, and even cancer. [ 1 ] PVC, Phthalates, and Dioxins In one evaluation of nearly 150 Halloween products, one-third contained PVC (polyvinyl chloride), a known endocrine disruptor. [ 1 ] Additionally, PVC fabric is frequently treated with chemicals known as phthalates . Children are susceptible to the ill-effects of phthalates which include premature puberty, birth defects, liver problems, and testicular cancer later in life. [ 2 ] PVC products also contain dioxins, chemicals that are classified carcinogens and cause reproductive issues and learning delays. [ 3 ] Lead Contamination Lead is another toxin that often contaminates cheap foreign goods, especially Chinese imports, including food and children’s toys. [ 4 ] It shouldn’t be a surprise that lead’s insidious reach extends to Halloween products. In 2012, the US federal government seized over 1400 Halloween costumes of Chinese origin due to lead levels that were 10 times higher than the allowed maximum. [ 5 ] Many lead-contaminated costumes or props have a piece or two that will, at some point, find its way into a child’s mouth. The seized items included pirate costumes that had an eye patch that contained over 40 times the legal maximum limit for lead. [ 6 ] Lead poisoning is exceptionally hazardous to children. It interferes with calcium, is toxic to proteins, and has a severely negative effect on nerve function. Exposure to lead is even linked to cognitive and hearing impairment. Lead exposure threatens fetal development as well. Pregnant women who have been exposed to lead may experience miscarriage, premature birth, or have undersized babies. [ 7 ] Flame Retardants Fabrics that have been treated with flame retardants are another concern with respect to Halloween costume safety. Such fabrics are often contaminated with antimony [ 8 ] and other dangerous chemicals . Exposure to antimony trioxide, a common flame retardant applied to fabrics, is linked to sharp increases in peripheral arterial disease (PAD), [ 9 ] which is a condition that causes atherosclerotic plaque to form in the arteries. [ 10 ] Some flame retardants are especially dangerous to children because their chemical structure is similar to developmental neurotoxins, like organophosphate pesticides, which affect brain development. [ 11 ] Toxic Makeup and Glow Sticks Many people don’t consider that the skin is their largest organ and one of the first contact points for toxins. Makeup, in general, is something to watch out for, as toxic metals frequently contaminate cosmetics . [ 12 , 13 ] Some face painting kits for children also contain high levels of lead, arsenic, mercury, cadmium, and antimony, all of which are especially toxic to the kidneys and the immune, reproductive, and nervous systems. [ 14 ] Glow sticks and glow jewelry seem like a harmless way to stay visible while trick-or-treating, but the chemicals in those plastic tubes do pose a threat. Dibutyl phthalate (DBP) and anthracene, two chemicals found in glow sticks, can be poisonous. But, to be fair to glow sticks, the amount contained is usually too small to cause problems in humans. A more likely scenario is a child or pet getting DBP in their eyes, mouth, or on their skin. For children, the effects range from skin irritation or mild chemical burns to nausea and vomiting if ingested. [ 15 ] Pets have a similar reaction—they may drool profusely, retch, vomit, or paw at their mouths if they made the mistake of chewing on a stray glow bracelet. [ 16 ] A sick pet or child can ruin your evening, so forego the glow sticks or make sure no one tries to cut (or bite) them open. How to Have a Healthy, Happy Halloween We’re not here to ruin Halloween for you—we want you to have the safest, healthiest, and happiest Halloween possible! There are safe alternatives that render the hazardous options completely unnecessary. Of course, you could perform a full body detox , but reducing your exposure to toxins in the first place is a better strategy. When assembling your costume, examine the labels before purchasing. Or, better yet, make your own costumes and accessories yourself with non-toxic materials. The Top 5 Ways To Ensure a Toxin-Free Halloween Look for makeup kits labeled non-toxic, and make sure they are produced in a country with strict regulations on consumer goods. Wash off makeup before bed. Wear a wig instead of temporary spray-on hair color, as they often contain VOCs. [ 17 ] Avoid plastic teeth as they tend to be softened with phthalates. [ 18 ] Check labels on costumes and accessories for vinyl (polyvinyl chloride or PVC) and flame retardants. Limit candy consumption, avoid corn syrup and synthetic food dyes . Healthy Treats Are Important, Too Toxic costumes aren’t the only potential problem. Conventional Halloween fare is too sugary, over-processed, and full of preservatives and stabilizers. It’s difficult to resist all the Halloween cakes, cookies, and candy, but you can easily find recipes that recreate the traditional treats with legitimately healthy ingredients like cashews, chia seeds, and dark chocolate. Autumn is a time to be indulgent — in a healthy way. Try our dessert recipes for great-tasting and good-for-you alternatives, like the vegan custard-stuffed pumpkin . Do you have any tips for enjoying a happy, healthy Halloween? Leave a comment below and share your thoughts. References'"}, "time": 1742563300.1257539}