{"duration": 0.13600420951843262, "input_args": {"text": "'…not since the mini-skirt has there been something worn by so many women who should never have it on in the first place… \\n— Alan Sorrentino, a sexagenarian gay man, in his letter to a local Rhode Island newspaper\\nA senior citizen and self-described “short, little gay Italian” in Rhode Island has been the victim of a vicious intimidation campaign by feminists with too much time on their hands. After he wrote a newspaper letter saying that women over 20 should not wear yoga pants, the backlash against Alan Sorrentino was vitriolic. 300 women marched on his home, which was publicly shared, using the excuse that it was just a “neighborhood protest.”\\nIn retaliation for exercising his First Amendment rights, which you might have incorrectly thought encouraged violence given the heavy-handed feminist response, Sorrentino received threatening calls and explicit death threats. Publications such as The Washington Post regarded the shameful intimidation of an old man as some kind of fun outing. Rabid social media users and the protesters themselves also lost sight of the context of Sorrentino’s letter and later comments, which pointed out that men rocking up to supermarkets in Speedos would be considered inappropriate, too.\\n“Violent” gay man whose fashion prescriptions in a newspaper reaching only a few thousand people are capable of disemboweling feminists and ejecting them into space.\\nIf anything, the moronic march on Sorrentino’s home and throughout his neighborhood demonstrates the paucity of real issues women have to complain about. For all the talk of the “misogyny” and “patriarchy” that triggered the march (pun intended), these women were able to assemble freely in one of the most liberal states in America and harass, without interruption, an old white male, albeit not a straight one. They evidently did not feel the fear they continually reference in their diatribes. Where were the Saudi-style female dress code police or the rape squads of the rape culture they always talk about to teach them a lesson? Alas, the dastardly misogyny and patriarchy must have chosen to remain invisible again!\\nWomen tell men what to wear all the time I didn’t see anyone staking out Jennie Price’s home for telling her husband and other men what to wear. Image attribution: Martin Spaven.\\nIt goes without saying that one of the biggest criticisms leveled by women towards their boyfriends or husbands is their allegedly bad fashion sense. Even beyond their relationships, women have a penchant for sticking their noses into what a man wears, from his sporting clothing and clubbing attire to his choice of bathing suit. Here in Australia, an entire media sub-industry emerged to criticize our former conservative Prime Minister, Tony Abbott, for wearing so-called “budgie smugglers” whilst swimming and keeping fit.\\nBecause Alan Sorrentino had 300 women obviously stalk his home for his fashion comments, should men have stalked the residence of one Jennie Price, a hack journalist from The Daily Mail ? Instead of celebrating her husband’s decision to resist middle-age decline and obesity through cycling, Price penned a ridiculous piece in 2014 decrying so-called MAMILs (middle-aged men in lycra).\\nShe joined BBC “journalist” Dominic Casciani, who equated men taking up the amateur sport with a mid-life crisis . Notwithstanding that men in lycra wouldn’t get I or my readers off, at least men wearing this fabric actually engage in exercise when they don it (in the morning, too, when fewer folks are awake to see them!). By contrast, yoga pants seem to be the default female fashion option for non-exercise more than physical exertion (or even yoga).\\nNaturally, had just three guys , let alone 30 or 300, made their intention to protest-cycle their way through Jennie Price’s neighborhood in Britain, the police would have been called. The same can be said of any of the countless female journalists and female “fashion experts” who have opined on what men should or should not wear. And let’s not forget women telling each other what to wear. A number of females make their careers out of critiquing what other women wear, especially on the celebrity red carpet. I wonder how many times, for example, then zombie and now dead zombie Joan Rivers found her home marched on by offended feminists after she berated either a piece of female fashion attire or the women wearing it.\\nSending a tweet is “violence” but 300 people marching on someone’s house is not–what world do we live in? The national debt? Nah. Terrorism? Nah. Urban crime? Nah. These folks are protesting fashion comments.\\nAt the start of this year, I brought you the story of Holly Michelle Wood , a putrid Harvard PhD candidate and feminist, who went around calling white people “awful.” After the now banned Milo Yiannopoulos simply retweeted Wood’s criticisms of him, fellow feminist Catrin Cooper used the “cyber violence” argument and tried to get a Twitter stooge, Michael Margolis, to alert its founder, Jack Dorsey. We would not have the time to go through even a relatively small fraction of the other instances in which women who cannot argue their position online reframe criticism as “misogyny” or even outright “violence.”\\nAs Alan Sorrentino clearly feared for his safety during the march, potentially hundreds or thousands of women gave themselves excuses for calling some man disagreeing with them online or in person “violent.” A climate now exists where whatever words certain women finds offensive becomes the basis for stopping whatever they’re doing (presumably not much) and going after the person saying them in the most organized and appalling fashion.\\nAt a minimum, the target of their fury must lose his job, reputation, and sense of personal safety to satiate their desire for revenge. In the meantime, the very act of their protest and abuse, which is not interfered with, validates the idea that women are not the targets of systematic hate or oppression in society.\\nAs a gender, women, particularly the middle and upper middle-class women who seem to dominate these kinds of pointless, abusive protests, have nothing to complain about. Except maybe having too much time on their hands.\\nRead More: Yoga Pants CEO Is Attacked For Speaking The Truth About Fat Women \\n'"}, "time": 1742563371.074985}