{"duration": 0.11127734184265137, "input_args": {"text": "'Headlines from Siberia reveal an incident of uniformly spherical \"ice boulders\" suddenly washing up on the shores of Nyda, Russia. Are we to believe this is only an \"act of nature\" as \"official sources\" have told us? Photo credit: Ekaterina Chernykh \\nWhy would the \"ice boulders\" occur with Arctic sea ice at record low levels? Why would perfectly spherical \"ice balls\" occur at all? 2012 was the previous record Arctic ice low for this time of year, 2016 has shattered that former record. \\nWhy would such formations occur from the record warm Arctic Ocean? Sea temperatures in some zones of the Arctic Ocean are as much as 25 degrees above the 30 year average. This average was taken from 1981-2011, when the ocean temperatures were already warmer than the pre-industrial era. \\nWhy are governments and media doing all they can to hide the reality of the record warm Arctic from the public? There are many reasons, none of them are benevolent. Temperatures in the polar regions are going completely off the charts as the \"departure from normal temperature\" map below makes clear. \\nSiberia is undergoing massive engineered cooling assaults , but the extremely rapid warming of the planet is undeniable and climate engineering is helping to fuel the overall fire . Are the climate engineers trying desperately to reduce the methane \"blowouts\" that are occurring in Siberia due to rapidly thawing methane permafrost deposits? Whatever the case, the short term engineered (and highly toxic) cool-downs come at the cost of a worsened overall warming . Photo credit: Andrey Naumenko \\nAgain, the \"experts\" tell us that the \"ice boulder\" phenomenon is a \"natural\" occurrence. But if this is so, why is there no long term historical record (or photographs) of this phenomenon occurring? There is no such record because the ridiculously uniform \"ice boulders\" are absolutely not natural . The \"experts\" are simply lying, as they are paid to do. We are all swimming in a sea of lies and deception that is propagated by countless individuals in academia, media, and \"official sources\", who have completely betrayed humanity in exchange for a paycheck and a pension . When will the population reactivate their sense of sanity and reason? When will the population recognize that our geoengineered skies should not look like they do? When will the population face the fact that steel structure high-rise buildings (building 7 on 911) don\\'t just fall down because of an office furniture fire on the lower floors? And why can\\'t the masses discern that miles of shorelines covered with almost perfectly uniform and symmetrical \"ice boulders\" is completely unnatural? \\nBelow is an article on chemical ice nucleation that I first posted in November of 2015. The information it contains is every bit as relevant now as it was almost exactly one year ago. The Engineered Winter Deception, Chemical Ice Nucleation \\nAll around the globe, extreme, destructive, and unprecedented \"frozen precipitation\" events are occurring . A great many of these events begin at temperature ranges far above the freezing point (though temperatures on the ground can drop precipitously as the nucleation process unfolds). Why? Most have never heard of \"chemical ice nucleation for weather modification\", but patents exist for this process and the Chinese government has long since admitted to engineering frozen precipitation events . The 90 second video below is astounding, a 200 foot wide river of ice flowing through the Saudi desert on November 2nd, 2015. \\nExtreme hail events are happening with alarming frequency , often in the most unlikely locations where such storms have not historically occurred. \"Ice storm\" hits Saudi Arabia in Early November, 2015 \\nWhen moisture laden storms are saturated with artificial/chemical ice nucleating elements (due to the destructive attempt by the climate engineers to temporarily cool-down ground temperatures on the ground), storms that would have been a deluge of rain become unprecedented onslaughts of frozen precipitation. Record hail storm in Quito, Ecuador, February 14, 2015 \\nThe damage being inflicted by the rapidly increasing hail storms is massive and growing. Record hail event, Bogata Columbia, February 22, 2015 \\nAfrica is also being subjected to unprecedented hail events. A record shattering 3 feet of hail is dumped on the East African nation of Eritrea, March 14, 2014 \\nBelow is a shocking photo of \"ice balls\" piled up on the shores of Lake Michigan. Why is there no long term historical record of such a profound phenomenon? Chemical ice nucleating materials form a central core of ice that builds up around itself. The motion of the waves then contribute to the spherical shape. \"Ice balls\" have formed and accumulated on Lake Michigan in the last few years, why? Such \"ice balls\" have even formed on lake water that was 40 degrees , how is this possible at temperatures far above the normal freezing point? Without chemical ice nucleation, it isn\\'t possible. \\nWhat is occurring on the shores of distant seas? Yet more \"ice balls\" have appeared in recent years. \"Ice balls\" on the Baltic Coast in Northern Poland. \"Official\" sources say this recent unprecedented phenomenon is just \"natural\", are we to believe them? \\nOther European countries are noting the same phenomenon. Ice balls on the coast of Finland. The \"official\" explanation for this recent mysterious anomaly? Again, we are told it is a \"natural\" occurrence. \\nHow natural do these \"ice pancakes\" look in the photo below? CNN news called these \"ice pancakes\" \"mysterious\". This phenomenon has also been observed on various lakes and rivers in recent years. It is the extreme uniformity of these formations that separates them from any natural phenomenon. Chemical nucleation materials are the core causal factor that produce the recent rash of profound ice formations . \\n\"Freezing rain\" has now become commonplace. Extreme \"ice storms\" are wreaking havoc all over the globe . Depending on atmospheric conditions and temperatures, precipitation from storms that have been sprayed with chemical ice nucleating materials can reach the ground before actually freezing. This vehicle photo was taken in Versoix, Switzerland. Formerly unprecedented ice storms have now become the norm as the geoengineers do their best to create temporary chemical cool-downs in a rapidly warming world . \\nWhere can the most profound chemical ice nucleation examples be seen? The satellite photos below show completely unnatural ice formation structures on the Arctic ocean, September 15th, 2015. Arctic ocean temperatures have persisted at record high levels and the warming continues to worsen . Why would ice form in open water under such conditions, and in a manner that is completely different than the normal ice pack winter expansion? And all this during a year that has had record warmth and record ice melt in the Arctic ? Surface ice formation on record warm seas worsens the overall warming by trapping the heat below . Another satellite photo taken over the Arctic Ocean, September 15, 2015. Extremely anomalous sea surface ice formation is clearly evident. \\nEven into November, 2015, astoundingly high ocean temperatures have persisted and continue to shatter records . The map below clearly shows that sea surface temperatures were as much as 24.7 degrees ABOVE NORMAL in the Arctic ocean on November 7, 2015. Global ocean temperatures are skyrocketing so rapidly that scientists must keep updating charts to keep up . \\nThe excerpt below was taken from a recently posted Article from \"Arctic News\", it should be read carefully. Arctic news describes the effects of atmospheric particulates (primarily from geoengineering which Arctic news refuses to admit to). They then state clearly the negative overall effects of these particulates (again, a result of geoengineering). And at the end of the article from which this excerpt was taken, Arctic News and the Arctic Methane Emergency Group calls for global geoengineering to be deployed immediately, as if it has not already been going on for over 6 decades in clear view and causing catastrophic effects. We must all diligently \"sift the baby from the bathwater\" so to speak. Though the front line data from Arctic news is accurate and verifiable from other sources, their constant call for geoegineering to commence is extremely alarming. \\nAerosols Particulates , in particular sulfate, can provide short-term cooling of the sea surface . Large amounts of sulfate are emitted from industrial areas in the east of North America and in East Asia. On the Northern Hemisphere, the Coriolis effect makes that such emissions will typically reach areas over the nearby ocean to the east of such industrial areas, resulting in the sea surface there being cooled substantially, until the particulates have fallen out of the sky. Since the sulfate is emitted on an ongoing basis, the cooling effect continues without much interruption . \\nThis sulfate has a cooling effect on areas of the sea surface where ocean currents are moving warm water toward the Arctic Ocean. Because the sea surface gets colder, there is less evaporation, and thus less heat transfer from the ocean to the atmosphere during the time it takes for the water to reach the Arctic Ocean. As a result, water below the sea surface remains warmer as it moves toward the Arctic Ocean . \\nSimilarly, as illustrated by above image, sulfur dioxide emitted in industrial areas in North America and East Asia can extend over the oceans, cooling the surface water of currents that are moving water toward the Arctic Ocean. \\nSo the overall conclusion from Arctic News is that the atmospheric particulates are making a bad situation worse, not better. Yet, they continue to call for geoengineering deployment as if that is not the source of \"atmospheric pollution\" they have just condemned. \\nBelow is a recent satellite photo of the sea surface off the coast of Greenland. Again we see an extremely anomalous and unprecedented pattern of ice formations like those shown earlier in this article. The massive chemical ice nucleation efforts in the Arctic , by the geoengineers, is undeniable. \\nThe AccuWeather \"forecast\" (scheduled weather) for November 16-20, 2015, shows snow with a daytime high of 59 degrees and a night time low of 40 degrees. Why? \\nIn the next map, we see snow again called for on the 22nd with the same temperatures as the earlier forecast, yet, on the 25th only rain is called for with much colder low temperatures? Snow is now often reported at temperatures up to 50 degrees and even above, welcome to the world of chemical ice nucleation. As previously mentioned, there are patents for such processes , and again, the Chinese scientists have openly admitted their programs to create engineered snow storms . \\nWhat scenario are the geoengineers creating in the US with their chemical ice nucleated cool-downs? The exact antithesis of what has been the case in the US for the previous 3 winters . The extreme scenario shown in the most current NOAA map below is historically unprecedented, but in recent years has become the norm. The \"scheduled\" weather from the geoengineers is for temperatures to be up to 20 degrees below normal in the West, and 20 or more degrees above normal in the East. \\nChemical ice nucleation of storms and precipitation does create a cold dense layer of air on the ground level that can drastically lower temperatures temporarily. But what is the overall cost? A decimated climate system, a worsened overall warming of the planet, and total contamination of the atmosphere and surface of our planet (due to the highly toxic fallout from the climate engineering programs). If you think your winter weather is natural, think again. Exposing the ongoing climate engineering insanity is challenge we must all face head on, make your voice heard in this battle . Forward solid information to all those that need to know and don\\'t. Make every day count in this most critical fight.'"}, "time": 1742628559.4477587}