{"duration": 0.049977779388427734, "input_args": {"text": "'Attract beneficial types of birds to your garden and watch your plants flourish! \\nNuthatches Nuthatches search crevices for ants, scale, beetles, moth eggs, caterpillars, and cocoons. During the winter season, they feed on seeds and nuts, but during the summer season, they are 100% insectivorous. They also raise their young exclusively on insects. \\n\\nNuthatches are most likely to settle into nesting boxes that are located in clearings in or along the edges of wooded areas. \\n\\nChickadees During the winter, chickadees can be seen searching bark crevices for hibernating insects and the eggs of moths, plant lice, pear psylla, and katydids. \\n\\nChickadees are wonderful pest-control birds due to their diet consisting of 90% insects including moths, caterpillars, flies, beetles, scale, plant lice, leafhoppers, and tree hoppers. \\n\\nYou can provide some suet in a mesh bag or a feeder filled with sunflower seeds to keep chickadees around over the winter season. In the spring, provide a nest box packed with wood chips. It is best to place the nest box at the edge of a wooded area. \\n\\nBluebirds During the spring, western bluebirds eat insects such as grasshoppers, beetles, weevils, crickets, and caterpillars. Bluebirds prefer to nest in sunny, open areas. \\n\\nThe perfect nest box for these birds should be mounted on a post within 50 feet of a tree, fence, or other structure away from bushy hedgerows. \\n\\nAlthough sparrows mostly rely on seeds for their diet, they also enjoy eating insects, especially during nesting season. Sparrows often prefer weed seeds, such as crabgrass, ragweed, and pigweed, so their seed eating habit is even beneficial to crops. \\n\\nThe insects of choice for sparrows include grasshoppers, caterpillars, beetles, leafhoppers, and beetles. \\nWarning: In warmer areas, sparrows sometimes supplement their diet with winter garden crops by clipping off seedlings and sprouts. You can avoid this by using row covers to protect your crops. \\nProvide nesting material for sparrows to use. Good material to provide include straw, bark, and pieces of string. \\n\\nNighthawks These little birds enjoy eating flying ants, leaf chafers, flies, mosquitoes, moths, and grasshoppers. Nighthawks even eat Colorado potato beetles, squash bugs, and cucumber beetles. \\n\\nThere is not much that can be done to attract nighthawks but you can watch out for their eggs and be careful not to harm them. Nighthawks are known to lay 1 to 3 whitish olive eggs with dark blotches on stumps, sandy soils, old robin’s nests, and even gravel. \\n\\n\\nPhoebes Phoebes will feast on everything from flies, mosquitoes, small moths, flying ants, and small beetles to grasshoppers, crickets, and caterpillars. \\n\\nYou can use water to entice these stealthy hunters into your yard. Phoebes enjoy building their mud nests in, on, or around manmade structures. Attract them by providing them with a safe nesting area. \\n\\nAriana Marisol is a contributing staff writer for REALfarmacy.com. She is an avid nature enthusiast, gardener, photographer, writer, hiker, dreamer, and lover of all things sustainable, wild, and free. Ariana strives to bring people closer to their true source, Mother Nature. She is currently finishing her last year at The Evergreen State College getting her undergraduate degree in Sustainable Design and Environmental Science. Follow her adventures on Instagram. \\nPhoto Credits:'"}, "time": 1742562993.9177098}