{"duration": 0.04331040382385254, "input_args": {"text": "'  actress Zoe Saldana says Donald Trump won the election, thanks, in part, to “arrogant” celebrities whose personal insults created sympathy for the Republican candidate and galvanized his supporters. [“We got cocky and became arrogant and we also became bullies,” the   told AFP.  Saldana, the face of multiple blockbuster film franchises —  Star Trek, Avatar, and Guardians of the Galazy —  says celebrities demonizing Trump only emboldened the voters who believed in him. “We were trying to single out a man for all these things he was doing wrong   …     and that created empathy in a big group of people in America that felt bad for him and that are believing in his promises,” she said. While she did not support Trump’s candidacy, Saldana says, “I’m learning from (Trump’s victory) with a lot of humility. ” She said she is hopeful that America under Trump will not become the racially segregated society that it once was. “If we have people continue to be strong and educate ourselves and stand by equal rights and treat everyone with respect, we won’t go back to those times,” Saldana said. The    actress is but one of a growing number of stars who have condemned the cockiness of celebrities during the campaign and now insists that Americans rally around Trump. “A lot of celebrities did, do, and shouldn’t [talk about politics] Patriots Day star Mark Wahlberg told Task  Purpose about a month after the election. “A lot of Hollywood is living in a bubble. ” “You know, it just goes to show you that people aren’t listening to that anyway. They might buy your CD or watch your movie, but you don’t put food on their table. You don’t pay their bills. ” Last week, actress Nicole Kidman said, “[Trump is] now elected and we, as a country, need to support whoever is the president. ” Follow Jerome Hudson on Twitter @jeromeehudson.'"}, "time": 1742561692.8765123}