{"duration": 0.1042180061340332, "input_args": {"text": "\"NRA Host: Ammosexuals Are Minorities Too! By Darrell Lucus on November 13, 2015 Subscribe Colion Noir ( image courtesy NRA News) \\nWhen the National Rifle Association says something, you can almost take it to the bank that it’s going to be outrageous. But even by those standards, a host on NRA News has really gone off the deep end. He’d like us to think that if you’re a gun owner, you have to endure the same hardships as racial minorities and LGBT people. \\nColion Noir is the host of “Noir,” a Webcast that has been on the air since 2014 on NRA News. It’s part of an NRA push to bring its message to minorities and millennials. To give you an idea of just how out of touch the NRA is on this, the NRA began this astroturfing campaign soon after Sandy Hook. \\nOn the November 10 edition of his show, Noir claimed that people of color, gays, lesbians, and transgenders aren’t the only ones who have the right to claim minority status. No, no–according to this host, gun owners are minorities as well. Watch here. \\nNoir claims that the Second Amendment is what protects minority rights in “the land of the minority.” As he sees it, if you support gun rights, “you’re fighting for the right of people who disagree with you” to own a gun. However, Noir shoots himself in the foot when he boils his argument down to one sentence: “Majorities by definition accept the status quo. Minorities change it.” \\nReally, Colion? Then why were efforts to reform our gun laws in this country derailed after Sandy Hook, even in the face of overwhelming majorities demanding that the status quo be changed? Oh, that’s right–because the NRA had the power to strike fear in the hearts of enough Senators that the measure couldn’t get 60 votes for cloture. \\nMedia Matters’ Timothy Johnson points out that Noir’s argument falls flat on several other counts. For one thing, gun ownership is not something you’re born with–it’s a choice. There is also no evidence that gun owners have ever faced the level of “systematic and institutional discrimination” that racial minorities and LGBT people have had to endure. \\nI did some digging on Noir, and found out he’s more or less made to order for the NRA. According to The Daily Beast, his real name is Collins Idehen. Most of his videos are standard agitprop typical of an NRA host. When his show premiered last year , it didn’t take long for it to turn into the usual NRA rants about how Hillary Clinton and Mike Bloomberg want to take our guns. \\nTo give you an idea about the kind of person Noir/Idehen is, he once claimed that Martin Luther King, Jr. was pro-gun because he tried to get a concealed-carry permit after someone firebombed his house in Montgomery. What Noir/Idehen doesn’t tell you is that soon afterward, King concluded that he could not serve as the leader of a movement based on nonviolence when he himself had a gun. He got rid of the gun that he owned, contenting himself with posting unarmed guards at his house around the clock and not traveling alone. He realized that “I was much more afraid” when he had a gun in his house than when he didn’t have one. \\nAs it turns out, this urban myth has been floating around the gun lobby for a long time. Just because a black host says it doesn’t make it any less unhinged and inaccurate than it would from the mouth of Wayne LaPierre. The fact that the NRA considers someone who spews such easily debunked claptrap to be its “Great Black Hope” and “Great Millennial Hope” tells you all you need to know about the NRA. About Darrell Lucus \\nDarrell is a 30-something graduate of the University of North Carolina who considers himself a journalist of the old school. An attempt to turn him into a member of the religious right in college only succeeded in turning him into the religious right's worst nightmare--a charismatic Christian who is an unapologetic liberal. His desire to stand up for those who have been scared into silence only increased when he survived an abusive three-year marriage. You may know him on Daily Kos as Christian Dem in NC . Follow him on Twitter @DarrellLucus or connect with him on Facebook . Click here to buy Darrell a Mello Yello. Connect\""}, "time": 1742561796.4268866}