{"duration": 0.016045570373535156, "input_args": {"text": "'Sunday on ABC’s “This Week,” former House Speaker Newt Gingrich said Donald Trump was “the most divisive president since Abraham Lincoln” and pointed to protest around the country, including riots in Berkeley, CA.  Partial transcript as follows: STEPHANOPOULOS: Yes, we’re going to talk about the Democrats. How about that last point, Mr. Speaker, from Matthew Dowd? That was one of the things that I had noticed as well. You start out high here. You don’t tend to find things that make you do higher. NEWT GINGRICH, FMR. SPEAKER OF THE HOUSE: You guys all collectively lived through Trump knocking off the Republicans, Trump knocking off Hillary, being wrong about all of it at every stage. And you turn around and play the same old conventional wisdom. Donald Trump is the most divisive president since Abraham Lincoln. He represents an alternative world so that’s why you have riots at places like Berkeley, he  —   you have two parallel universes here. There’s actually a very funny Megyn Kelly interview I did two weeks before the election, she’s giving me all this polling data. And I said, look, there are two universes. Now if your universe is right, Hillary Clinton’s president. If our universe is right, Donald Trump is president. STEPHANOPOULOS: I completely take that point. That’s how he’s being seen out in the country, in parts of the country right now. But how does it affect the governing? Can you govern effectively  —   with 40 percent? GINGRICH: Sure. Well, first of all, as you know, because you’ve done it, presidents are really powerful. Presidents who are willful and   and focused have enormous capability to move the system. But second, I have a very simple test. Reagan in his farewell address said I am so proud that together we created 19 million jobs. If Trump has the economy rolling in 2020, he’ll get  . I don’t care what the current numbers are. If Trump doesn’t have the economy rolling in 2020, he has a problem. (  RCP Video) Follow Pam Key on Twitter @pamkeyNEN'"}, "time": 1742628515.7857635}