{"duration": 0.05140185356140137, "input_args": {"text": "'Nov 4 Nov 4 Civil War In FBI As Patriot Agents Battle Corrupt Obama/Clinton Cabal Trying To Cover Up Regime Crimes, Obstruct Justice \\nThe Guardian \\nDeep antipathy to Hillary Clinton exists within the FBI, multiple bureau sources have told the Guardian, spurring a rapid series of leaks damaging to her campaign just days before the election. \\nCurrent and former FBI officials, none of whom were willing or cleared to speak on the record, have described a chaotic internal climate that resulted from outrage over director James Comey’s July decision not to recommend an indictment over Clinton’s maintenance of a private email server on which classified information transited. \\n“The FBI is Trumpland,” said one current agent. \\nThis atmosphere raises major questions about how Comey and the bureau he is slated to run for the next seven years can work with Clinton should she win the White House. \\nThe currently serving FBI agent said Clinton is “the antichrist personified to a large swath of FBI personnel,” and that “the reason why they’re leaking is they’re pro-Trump.” \\nThe agent called the bureau “Trumplandia”, with some colleagues openly discussing voting for a GOP nominee who has garnered unprecedented condemnation from the party’s national security wing and who has pledged to jail Clinton if elected. \\nAt the same time, other sources dispute the depth of support for Trump within the bureau, though they uniformly stated that Clinton is viewed highly unfavorably. \\n“There are lots of people who don’t think Trump is qualified, but also believe Clinton is corrupt. What you hear a lot is that it’s a bad choice, between an incompetent and a corrupt politician,” said a former FBI official. \\nSources who disputed the depth of Trump’s internal support agreed that the FBI is now in parlous political territory. Justice department officials – another current target of FBI dissatisfaction – have said the bureau disregarded longstanding rules against perceived or actual electoral interference when Comey wrote to Congress to say it was reviewing newly discovered emails relating to Clinton’s personal server. '"}, "time": 1742562044.4190872}