{"duration": 0.06383037567138672, "input_args": {"text": "'0 419 \\nSocial Security is the lifeline of many people who are either too elderly or disabled to support themselves or their loved ones financially. However, to Republicans and conservatives alike, it is an expenditure deemed too costly, even if it means certain death for those who depend on it. \\nForget for a moment that elderly people who worked their entire lives have paid into social security, and should therefore be completely off limits. How could anyone with a soul leave the elderly to die in poverty? And what about those people who are physically and/or mentally disabled? Should we, as a nation, not take care of those citizens? Should we leave them to survive on the streets? \\nDonald Trump is not known to do much critical thinking, especially before releasing a statement to the media, but his insane remarks on cutting Social Security have really got liberals fuming. Check out that time Trump told Paul Ryan that he would love to cut Social Security if he didn’t think it would be political suicide: \\n“From a moral standpoint, I believe in it. But you also have to get elected. And there’s no way a Republican is going to beat a Democrat when the Republican is saying, ‘We’re going to cut your Social Security’ and the Democrat is saying, ‘We’re going to keep it and give you more.’\\u2009” \\nTrump is really trying to say that the lazy people in this country will always vote Democrat because it is Democrats who ensure that the less fortunate are, at least, able to keep their heads above water. To politicians like Donald Trump, these “extras” are killing the country. \\nThat’s right folks, it’s Ma and Pa Kettle who are ruining the country with their $1200 monthly allotment from the Treasury Department. It certainly wouldn’t be wasteful, greedy real estate moguls who use other people’s money to pay for their extravagant business deals. \\nAlex Lawson is the Executive Director of Social Security Works, and he has a much different theory on Trump’s motives with Social Security. Lawson had this to say about it: \\n“It is really clear: Donald Trump would 100 percent go along with the Republican donor class position of cutting Social Security. He openly says he will lie to the people about it because he knows that the people are against it.” \\n“In his eyes the ‘moral’ thing to do is to steal people’s hard-earned benefits and not talk about it.” \\nAs we have learned throughout this election season, Donald Trump almost never tells the truth. Yet, he still convinces his mindless followers that he would somehow be good for America, regardless of the fact that there is nothing but evidence to prove the opposite. Trump won’t be happy until our grandparents are living in squalor and eating ramen for every meal. \\nWake me up when November ends.. Share this Article!'"}, "time": 1742563758.503414}