{"duration": 0.1417834758758545, "input_args": {"text": "'Michele Paccione / Shutterstock.com \\nUniversally, Trump was depicted as an anti-establishment candidate. Washington and Wall Street hated him, and the media were deployed to vilify him endlessly. If they could not discredit Trump enough, surely they would steal the election from him. Some even suggested Trump would be assassinated. \\nActing the part, Trump charged repeatedly that the election was rigged, and he was right, of course. During the primaries, Hillary Clinton received debate questions in advance from CNN. More seriously, 30 states used voting machines that could easily be hacked. \\nA leaked tape of Trump making obscene comments about groping women became further proof that the establishment was out to get him. In spite of all this, Trump managed to win by a landslide, so what happened? \\nTo steal an American election, one only needs to tamper with votes in two or three critical states, and since Hillary didn’t win, we must conclude that she was never the establishment’s chosen puppet. As Trump claimed, the fix was in, all right, except that it was rigged in his favor, as born out by the fact. \\nWhile everybody else yelped that Trump would never be allowed to win, I begged to differ. After the Orlando false flag shooting on June 12th, 2016, I wrote: \\nIn 2008, Obama was touted as a political outsider who will hose away all of the rot and bloody criminality of the Bush years. He turned out to be a deft move by our ruling class. Though fools still refuse to see it, Obama is a perfect servant of our military banking complex. Now, Trump is being trumpeted as another political outsider. \\nA Trump presidency will temporarily appease restless, lower class whites, while serving as a magnet for liberal anger. This will buy our ruling class time as they continue to wage war abroad while impoverishing Americans back home. Like Obama, Trump won’t fulfill any of his election promises, and this, too, will be blamed on bipartisan politics. \\nOn September 24th, I doubled down: \\nMind-fucked, most Americans can’t even see that an American president’s only task is to disguise the deep state’s intentions. Chosen by the deep state to explain away its crimes, our president’s pronouncements are nearly always contradicted by the deep state’s actions. While the president talks of peace, democracy, racial harmony, prosperity for Main Street and going after banksters, etc., the deep state wages endless war, stages meaningless elections, stokes racial hatred, bankrupts nearly all Americans and enables massive Wall Street crimes, etc. \\nOnly the infantile will imagine the president as any kind of savior or, even more hilariously, anti-establishment. Since the deep state won’t even tolerate a renegade reporter at, say, the San Jose Mercury News, how can you expect a deep state’s enemy to land in the White House?! It cannot happen. \\nA presidential candidate will promise to fix all that’s wrong with our government, and this stance, this appearance, is actually very useful for the deep state, for it gives Americans hope. Promising everything, Obama delivered nothing. So who do you think is being primed by the deep state to be our next false savior? \\nWho benefits from false flag terrorist attacks blamed on Muslims? Who gains when blacks riot? Why is the Democratic Party propping up a deeply-despised and terminally ill war criminal? More personable Bernie Sanders was nixed by the deep state since it had another jester in mind. \\nThe first presidential debate is Monday. Under stress, Hillary’s eyes will dart in separate directions. Coughing nonstop for 90 minutes, her highness will hack up a gazillion unsecured emails. Her head will jerk spasmodically, plop onto the floor and, though decapitated, continue to gush platitudes and lies. “A Very Impressive Performance,” CNBC and CNN will announce. Come November, though, Trump will be installed because his constituency needs to be temporarily pacified. The deep state knows that white people are pissed. \\nThe media were out to get Trump, pundits from across the political spectrum kept repeating, but the truth is that the media made Trump. Long before the election, Trump became a household name, thanks to the media. \\nYour average American can’t name any other real estate developer, casino owner or even his own senators, but he has known Trump since forever. For more than a decade, Trump was a reality TV star, with two of his children also featured regularly on The Apprentice. Trump’s “You’re fired” and his hair became iconic. Trump appeared on talk shows, had cameo roles in movies and owned the Miss Universe pageant. In 2011, Obama joked that Trump as president would deck out the White House in garish fashion, with his own name huge on the façade. The suave, slick prez roasted Trump again in 2016. Trump has constantly been in the limelight. \\nIt’s true that during the presidential campaign, Trump received mostly negative press, but this only ramped up support among his core constituency. Joe Sixpacks had long seen the media as not just against everything they cherished, but against them as people, so the more the media attacked Trump, the more popular he became among the white working class. \\nLike politicians, casinos specialize in empty promises. Trump, then, is a master hustler, just like Obama, and with help from the media, this New York billionaire became a darling of the flyover states. Before his sudden transformation, Trump was certainly an insider. He donated $100,000 to the Clinton Foundation, and Bill and Hillary attended his third wedding. Golf buddies, The Donald and Bill were also friends with one Jeffrey Epstein, owner of the infamous Lolita Express and a sex orgy, sex slave island in the Caribbean. \\nIn 2002, New York Magazine published “Jeffrey Epstein: International Money of Mystery.” This asskissing piece begins, “He comes with cash to burn, a fleet of airplanes, and a keen eye for the ladies—to say nothing of a relentless brain that challenges Nobel Prize-winning scientists across the country—and for financial markets around the world.” ORDER IT NOW \\nTrump is quoted, “I’ve known Jeff for fifteen years. Terrific guy. He’s a lot of fun to be with. It is even said that he likes beautiful women as much as I do, and many of them are on the younger side. No doubt about it—Jeffrey enjoys his social life.” \\nBill Clinton shouts out, “Jeffrey is both a highly successful financier and a committed philanthropist with a keen sense of global markets and an in-depth knowledge of twenty-first-century science. I especially appreciated his insights and generosity during the recent trip to Africa to work on democratization, empowering the poor, citizen service, and combating HIV/AIDS.” \\nEpstein gushes back, “If you were a boxer at the downtown gymnasium at 14th Street and Mike Tyson walked in, your face would have the same look as these foreign leaders had when Clinton entered the room. He is the world’s greatest politician.” \\nEven during a very nasty election campaign, Trump stayed clear of Clinton’s association with Epstein because he himself had been chummy with the convicted pervert. Trump also never brought up the Clintons’ drug running in Mena or the many mysterious deaths of those whose existence inconvenienced their hold on power. \\nWith eight years in the White House, plus stints as a senator then secretary of state, Clinton is considered the ultimate insider. Though a novice politician, Trump is also an insider, and it’s a grand joke of the establishment that they’ve managed to convince Joe Sixpacks everywhere that Trump will save them. \\nKnowing how angry the working class has become, the deep state could not install Hillary, for that would have been a tiresome rehash of another Clinton presidency. With NAFTA, Bill launched the job offshoring that has wrecked this country, and those most affected by it, working class whites, know damn well who’s responsible. The Clinton brand has become anathema to middle America. \\nWhile Clinton says America is already great, Trump promises to make America great again, but the decline of the US will only accelerate. Our manufacturing base is handicapped because American workers will not put up with Chinese wages, insanely long hours or living in cramped factory dormitories. In a global economy, those who can suck it up best get the jobs. \\nOn the foreign front, America’s belligerence will not ease up under a Trump presidency, for without a hyper kinetic military to browbeat and bomb, the world will stop lending us money. The US doesn’t just wage wars to fatten the military banking complex, but to prop up the US Dollar and prevent our economy from collapsing. The empire yields tangible benefits for even the lowliest Americans. \\nWith his livelihood vaporized, the poor man does not care for LGBT rights, the glass ceiling or climate change. Supplementing his wretched income with frequent treks to the church pantry, if not blood bank, he needs immediate relief. It’s a shame he’s staking his hopes on an imposter. \\nThe deep state ushered in Trump because he’s clearly their most useful decoy. As the country hopes in vain, the crooked men behind the curtain will go on with business as usual. Trump is simply an Obama for a different demographic. Nothing will change for the better. \\nLinh Dinh is the author of two books of stories, five of poems, and a novel, Love Like Hate . He’s tracking our deteriorating socialscape through his frequently updated photo blog, Postcards from the End of America .'"}, "time": 1742564518.1485183}