{"duration": 0.04564952850341797, "input_args": {"text": "'0 Add Comment \\nTHEY DID IT! They really did it! The government, against all odds, bravely negotiated until the 11th hour and saved us from total chaos as gardaí agreed to cancel strike action. \\nCrowds lined the streets late last night to cheer on the government as they made their way down O’Connell St in an open top bus, waving to the crowds invoking memories of the Italia 90 homecoming. \\nA dire situation that was totally not of the government’s own making, Enda Kenny and his cabinet rescued defeat from the jaws of victory and relabelled it, but how? What offer was placed on the table for the 10,000 plus guards who were ready to withdraw their labour? \\nWWN sources have furnished us with a complete copy of all that was offered to the guards to avert strike action, and we have the offer listed below: \\n1) 8 government piggy banks (the government promise the use of piggy banks was not meant to be derogatory) which can be smashed open by gardaí with a hammer. The exact contents of them are unknown, but after shaking them and holding them to their ears, GRA representatives were said to be ‘excited’. \\n2) A guard will be picked via lottery system and given the chance to use a taser on Leo Varadkar. The Taoiseach was adamant this was included in the deal despite it not being among the GRA’s demands. \\n3) One new uniform per station, to be worn by officers on a rotation basis. \\n4) A pat on the back from the government every month with a variation of the phrase ‘well done’ to accompany it. \\n5) Vague agreement to provide resources to upgrade the force from the 1870s to at least 1960s standards by 2050. \\n6) €15 premium payment on annual leave but all gardaí will be forced to holiday in a caravan park in Wicklow. \\n7) Free team bonding trip to Tayto Park, and tickets to the Late Late Toy Show for all 12,500 gardaí who were set to strike on the condition that the GRA tell the public that the government are ‘the best’. \\n8) 100% mortgages and free pints in exchange for arresting at least one opposition TD on drink driving charges. \\n9) An increase of 4 cents per year in the shoelace allowance if gardaí turn a blind eye to Simon Harris’s burgeoning Crystal Meth empire. \\n10) Gardaí will agree to unpaid overtime if the government admit NASA has conclusively proven Fiscal Space is a myth. \\n11) Gardaí will be given one extra day of annual leave if they agree not to spoil the most recent of season of Game of Thrones as Frances Fitzgerald is only on season 3. \\n12) Once Gardaí approve the deal, both sides have agreed to paper over the cracks and carry on as normal.'"}, "time": 1742563788.0386093}