{"duration": 0.09494400024414062, "input_args": {"text": "'Actor George Clooney unloaded on President Donald Trump and White House chief strategist Steve Bannon in an interview, calling the pair the real “Hollywood elitists. ”[In a conversation with French news outlet Canal Plus, the      lashed out at those who criticize Hollywood celebrities for speaking out about politics.  “When Meryl [Streep] spoke, everyone on that one side said, ‘Well, that’s elitist Hollywood speaking,” Clooney said, according to the Hill. ” Trump, he added, “collects $120, 000 a year from his Screen Actors Guild pension fund. He is a Hollywood elitist. ” The Money Monster star was referring to Streep’s   acceptance speech at the Golden Globes in January, in which the actress bashed the president for what she called his “disrespect” and his “violence. ” Clooney told Canal Plus that Streep had “every right to speak up. ” The actor also took aim at Bannon, whom he called a “failed film writer and director. ” The White House chief strategist has produced 16 films, including the documentaries The Undefeated and Torchbearer. “He wrote a Shakespearean rap musical about the L. A. riots that he couldn’t get made,” Clooney said. “He made a lot of money off of Seinfeld. He’s elitist Hollywood, I mean that’s the reality. ” Clooney was a heavy contributor to former Democratic presidential candidate Hillary Clinton’s campaign, and hosted a $33, 400   fundraiser for her last year at the Studio City home he shares with wife Amal Clooney. In a letter sent to donors on behalf of the candidate last year, Clooney called Trump a racist who “hates Muslims” and who “thinks that committing war crimes is the best way to make America great again. ” The actor also previously called Trump a “xenophobic fascist. ” While attending the Cannes Film Festival in May, Clooney confidently told reporters that Trump would not win the election. “There’s not going to be a President Donald Trump,” he said. “Fear is not going to be something that drives our country. We’re not going to be scared of Muslims or immigrants or women. We’re not actually afraid of anything. We’re not going to use fear. So that’s not going to be an issue. ” The actor appeared to soften his position on Trump in January, when he told the Associated Press at the premiere of his Syrian relief worker documentary The White Helmets that he hopes the president will “do a decent job. ” But in his interview with Canal Plus this week, Clooney said it was still “hard to imagine” that Trump is president. “We have a demagogue in the White House,” he said. “We need the fourth estate, which is journalists, to hold his feet to the fire. ”   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742562513.445889}