{"duration": 0.12254476547241211, "input_args": {"text": "'Blue lives matter. That is, in essence, what Attorney General Jeff Sessions has been saying since he took office, promising to protect the lives of police officers, stop undermining them as (he implied) the Obama administration had, and let them get back to enforcing law and order. For some in law enforcement, the message has done what it intended to do: mollify, soothe, inspire. With vilification on the street, who needed vilification from the top? But to others, it is as shrill and jarring as a traffic whistle, threatening to undo years of work toward dismantling policies that led to mass incarceration and the erosion of trust in the police. We asked two experts to weigh in. In the first camp is Sheriff Michael Bouchard of Oakland County, outside Detroit, who explains the perspective of   officers facing hostility and scrutiny by cellphone cameras as they perform a dangerous job. On the other side is Ronal W. Serpas, former chief in Nashville and New Orleans, who counters that not just civilians, but officers themselves, are safer when policing is done more fairly  —   sometimes at the insistence of the federal government. Sheriff Bouchard answered questions by phone, and Dr. Serpas by email. Their responses were edited for clarity and length. Michael Bouchard: I think that police agencies are expecting and capable of handling scrutiny. But I think that the tone and the rhetoric did in fact diminish it. It almost  —   in many situations  —   came from a “You’re broken,” adversarial position rather than “You’re a professional, occasionally you’re going to have situations that need rectifying and we want to work together to make sure that happens. ” It’s a very different kind of vantage. I think every police executive that’s worth their salt  —   and I believe that’s 99. 9 percent  —   believe that if police do something wrong they ought to be held accountable. Ronal Serpas: To the contrary, the Department of Justice must ensure that the federal Constitution is followed so that all citizens experience constitutional policing as a right. There are about 18, 000 police departments in America. Few police agencies have been part of a D. O. J. review since 1994, and even fewer have been party to a consent decree. In those departments, the data suggested it was indeed necessary. What really makes the job of American policing more difficult is when we fail to realize the police are just one part of an interconnected system of criminal justice (police, prosecution, judiciary, corrections, mental health, drug addiction, etc. Sheriff Bouchard: I think there’s a great deal of officers on the front line that are much more cautious about doing the job in a proactive way, for fear of negative exposure. I mean, what you want is proactive policing to question situations, to stop cars, to look for something that is on the precipice of being a crime and interrupt it before it happens. When you put a chilling effect on that kind of patrol, you basically become report takers. It’s the job of the chief to tell their folks, “Look, if you do your job as you’re trained and as I expect, I will stand behind you. ” And that’s a difficult thing for a lot of people to feel and understand in this environment  —   that they would be stood behind. Because use of force captured on a cellphone is not pretty. A street fight is not pretty. That does not make it inappropriate or illegal. Dr. Serpas: Yes and no. In the case of the Baltimore Police Department it’s been my personal experience, from interviewing nearly 100 officers, that the department has not “pulled back. ” In fact, to a person, every officer was clear  —   they see their job to save lives and make the community safe. “We did not take a knee” was a constant refrain. In Chicago, the data appears to be the opposite, in that officers have been far less proactive  —   and that has been a recent development. What the data in Chicago suggests is that there was a sudden and dramatic change in officer activity immediately following the public release of information regarding the tragic death of Laquan McDonald. We will likely need more time and information to understand the factors driving this  . Sheriff Bouchard: One of our concerns about the dialogue from the past administration about we need to be more involved with the community is the presumption that we weren’t already or didn’t care about it. I have a list of community engagement programs that are as long as my arm. But some of the engagement also goes back to funding. So for example, in one of the communities where we are policing, at one time they had 200   officers. Now we police that community with about 77. And so at the same time the past administration said, “You need to do more of that,” pointing their finger, they didn’t give me any grants when I applied for that community to do that. Dr. Serpas: There is no such thing as too much emphasis on community relations and partnerships. Crime reduction necessarily comes from the relationships the police have with the community. Despite the great advances in technology like DNA or ballistics evidence, our criminal justice system must have willing community members who will participate in criminal investigations and prosecutions. Every officer and prosecutor knows this. Sheriff Bouchard: Civil rights investigations are routinely undertaken by the Department of Justice, and we’re not suggesting that they stop, but the   approach that “virtually every department is broken” has been a frustrating dialogue. Clearly there’s some videos that we’ve all seen that are obviously out of bounds. But there are some videos that don’t lend themselves to context or totality of circumstance. So rushing to a decision based on that often incites problems, and not calms tensions. So the first thing ought to be a calming moment, saying: “Look, we don’t know all the facts and circumstances. We’re going to find out. And if there was wrongdoing, people will be held accountable. ” Dr. Serpas: Each of us demands that if a friend or family member encounters a police officer they will be treated fairly and with dignity. If not, then we expect the local police or political leaders to rectify the situation. But we all know this may not be the case in every local government. It is our federal Constitution that establishes what the requirements of policing are in this nation.'"}, "time": 1742564260.9132898}