{"duration": 0.29431867599487305, "input_args": {"text": "'Gloria Steinem started her career as a C. I. A. operative, got her break as a Playboy Bunny, married Christian Bale’s father and now produces a show for the cable television channel Viceland, the home of “Balls Deep” and “Action Bronson Watches Ancient Aliens. ” Beyond that, there are some gaps in her résumé. On a recent afternoon in her Upper East Side apartment, she addressed one of those gaps. She was wearing a Toledo Mud Hens   and moving gingerly because of back pain. The gap concerned Stephen Sondheim, and the time Ms. Steinem asked him to create crossword puzzles for New York magazine. “How do you know that?” she asked. “Nobody knows that. ” It was 1968, as the magazine was just starting. Ms. Steinem knew Mr. Sondheim was a fiend for   crossword puzzles. Mr. Sondheim, who is now 86, did end up writing puzzles for the magazine in its first year, until quitting to write the musical “Company. ” Ms. Steinem, now 82, went on to other pursuits as well. At an age when many are happy to slow down, Ms. Steinem still keeps a rock star’s schedule, promoting her most recent book, “My Life on the Road,” stumping for Hillary Clinton, and raising money for causes like Planned Parenthood and a proposed “Women’s Building” in New York City. Rolling into breakfast recently, after a weekend in North Carolina promoting her book and the candidacy of Deborah Ross, a Democrat, for the United States Senate, Ms. Steinem said she had been up until 5 a. m. revising a piece for The Boston Globe about her opposition to a proposed oil pipeline on tribal lands in North Dakota. Next up, she has “two or three” books she wants to write, and another season of “Woman,” the documentary series she produced for Viceland, which was nominated for an Emmy. “I can’t imagine not working,” she said. “It’s not even working well, it’s an addiction, really, but I can’t imagine not doing it. ” She added, “It’s possible that more people are requesting me to speak because they think I’m going to die, given that I’m 82. ” Ms. Steinem has a disarming laugh that seems to say, “Can you believe the silly thing Gloria Steinem just said?” After she has spent so much time in the public eye, I asked how she would write her job description. “I don’t know,” she said. “When I have to put down something on a form I say writer, because that came first. ” She hunted around for another word. “And organizer. I don’t know how else to say it. ” Ms. Steinem would also call herself a New Yorker, a fact that sometimes gets lost amid her   biography. She has lived in the same apartment for nearly 50 years, since she and a friend rented the parlor floor of what is now a duplex for $300 a month. In 1969, when she was writing for New York magazine, she considered running for city comptroller on a ticket with Norman Mailer and Jimmy Breslin, whose platform included building a monorail around Manhattan. It was, she said, a literary lark. “Nobody ever imagined being in office,” she said. “It was out of love of New York and imagining what it could be. I think somebody asked Jimmy what he would do if he won, and he said, ‘Demand a recount. ’” “I couldn’t live anywhere else,” she said. Like a true New Yorker, she has never learned to drive. In the living room where she held the first meetings for what would become Ms. magazine in 1971, she recalled the day she fell in love with the city, on a visit from Smith College in the  . “I was walking in the theater district, and I stopped by a delicatessen,” she said, “and there were three or four showgirls from some Broadway show, and they were in full regalia and headdresses and makeup, and they were standing there and ordering pastrami sandwiches, and nobody gave it a second thought. And I thought, Oh, I want to live here. ” Later, when she moved here, she made a list of things New Yorkers did that scared her. “One was that they said things three times that we in the Midwest wouldn’t say even once,” she said. “One was that they told you terrible things that were wrong with them, but then didn’t do anything about it. In the Midwest if you say it, you have to do something about it. One was they didn’t eat standing up out of the refrigerator. One was they ate red meat. I had seen pot roast, but not red meat. ” She has outlived or outlasted or   many of her critics, including the newscaster Harry Reasoner, who famously said of Ms. magazine, “I’ll give it six months before they run out of things to say,” or feminist contemporaries who accused her of hijacking the movement away from its more radical founders. “I don’t know how she does it,” said Susan Brownmiller, author of the landmark feminist work “Against Our Will,” who has traded barbs with Ms. Steinem for four decades. “And she is still so totally beautiful. When women went to see her, they were just relieved, because she was so calm, and she could be funny. She made a lot of women feel, ‘Oh, that’s what the women’s movement looks like. I can be part of that. ’” Still, Ms. Brownmiller said, there were matters of feminist history to set straight. “Guys in the media chose Gloria as our leader,” she said. “A lot of us, our hope is that eventually history will straighten this all out and say, no, Gloria came in a little later, and her very loyal supporters have backtracked that history. ” In “My Life on the Road,” newly out in paperback, Ms. Steinem describes a rootlessness at odds with her steadfast devotion to New York. In one   span, she never went a week without being on an airplane. In her childhood, her father used to shuttle the family around the country in a trailer, buying and selling antiques along the way to support them. The closest they had to a home base was Clarklake, Mich. where her father ran a summer dance pavilion, until the fall weather chased them south toward Florida or California. “Living in trailer parks is sobering, let’s put it that way,” Ms. Steinem said. She came to ground only after her parents split up when she was 10, and she became caretaker for her mentally ill mother in East Toledo, Ohio. She did not attend school regularly until about seventh grade. Her travels took her to Smith and then a   fellowship in India. When she arrived in New York for good in 1960, it was to be a journalist, as her mother once was. For women, New York in the early 1960s was “very much the way it’s depicted in ‘Mad Men,’” said Valerie Paley, director of the Center for Women’s History at the   Historical Society. “Even educated women were relegated to roles as wives and mothers. But there was also a groundswell for change, radical change. ” Ms. Steinem rode that groundswell, writing about the culture of the   birth control pill for Esquire, and going undercover as a Bunny at the   Playboy club for Show magazine. “To this day when people don’t like me they introduce me as a former Bunny, as a ” she said. “On the other hand, I did improve the working conditions for those women. ” She also became a notable   . Time magazine, in 1969, called her “one of the best dates to take to a New York party these days  —   or, failing such luck, one of the most arresting names to drop,” adding that she had “legs worthy of her miniskirts, and a brain that keeps conversation lively without getting tricky. ” Ms. Steinem recalled those years in a less glamorous light. “If we spent $10 on a night out, we’d say, ‘Where are we going to get $10? ’” she said. At parties, if things got too   she would say she was feeling the effects of her malaria and excuse herself. There were years of   plays, then staying up with the actors because they were all full of adrenaline, and having breakfast at the Automat. “I remember that we once stole groceries from a store in the Village, because we were all broke,” she said. “Later on I went back to pay the old guy who was running the grocery, and that was my mistake, because it meant that he was admitting that someone could steal from him. I didn’t understand that. Dignity is sometimes more important than money. ” As a young freelance writer, she said, “we didn’t even have a word then for sexual harassment. It was just called life. It was just your job to avoid attention without alienating the editor. So there was an editor who always gave me a choice as I was leaving. I could either do something like mail his letters or I could go to a hotel room with him in the afternoon. Needless to say I mailed his letters. ” Her introduction to the women’s liberation movement came secondhand, through a public television special and a 1969 speakout on abortion organized by Redstockings, a radical feminist group. The movement itself was split into factions like New York Radical Women, New York Radical Feminists and the Feminists, along with Betty Friedan’s more mainstream National Organization for Women. Ms. Steinem brought a journalist’s ability to navigate different worlds. “Steinem was brilliant and younger than Friedan, and used her charisma in a different approach, where she was able to work with men,” Ms. Paley said. When Ms. Steinem gathered some of the movement’s best writers for Ms. magazine, she was accused by Ms. Friedan of “ripping off the movement for private profit” and by radical feminists of creating a shadow movement to undermine their own. “I really feel that she’s not a lion of feminism, but a lamb of feminism,” said Kathie Sarachild, a member of Redstockings who is often associated with coining the phrase “Sisterhood is powerful. ” In the   as Ms. took off, Redstockings criticized Ms. Steinem for having once worked for a C. I. A.  organization that recruited Americans to attend   youth festivals in Vienna and Helsinki in 1959 and 1962. The group’s backing was first exposed in 1967 in Ramparts magazine, then in The Washington Post and The New York Times. Ms. Steinem paints the chapter as an innocent one, saying that no one in the C. I. A. ever asked her to do or say anything, and that she did not report back to the agency. “It’s so interesting now, because the initials C. I. A. will make people believe anything,” she said. “It just wasn’t like that. It just was so uncontrolled. As I remember saying at the time, if this was our grandmother’s money we’d be doing the same thing. ” The criticism by other feminists was especially wounding. “They never called to ask me what I did,” she said. “That hurt more than anything. ” She added, “If anybody still cares about what happened so long ago, I’m happy to answer any questions. ” These are lively times to be Gloria Steinem, with the possibility of the first woman elected president and the word “feminist”  —   seen in   letters on the Beyoncé concert stage  —   again finding currency among young women. Her recent friends include some, like Lena Dunham and the playwright and performer Sarah Jones, who were not yet born when she started Ms. In speeches, Ms. Steinem quotes the three women who started the Black Lives Matter movement. “They are so far ahead of where we were, it’s staggering,” she said of the younger women she meets. “The only way I’ve managed to express this is, I just had to wait for some of my friends to be born. ” Her age has made her more strategic and also freer, she said: “Fifty was hardest for me, because it’s the end of the center of life, especially a gendered center of life. But by the time I got to be 60, it was like a new world. Society has given up because it’s all about having or raising children, really, and by 60 society doesn’t care that much, so you’re free. Seventy was certainly about mortality. And 80 even more so. ” She cited a Native American observation that old age is like childhood, a time of wonder, because both are near to the unknown. She is especially excited about a plan to turn the former Bayview Correctional Facility in Chelsea into a hub for organizations serving women and girls, a dream since the 1970s of the Ms. Foundation and other groups. “There is nothing I’m prouder of in this city,” Ms. Steinem said. The building is being redesigned by female architects, for a female real estate developer, and is expected to open around 2020, said Pamela Shifman, executive director of the NoVo Foundation, a partner in the project. “Gloria has been an advocate and visionary of this for decades,” Ms. Shifman said. “One thing about Gloria, quintessential Gloria, is that she sees herself in community with diverse groups of women, including formerly incarcerated women. Her purpose is to ask questions and listen. ” On a beautiful fall morning, Ms. Steinem seemed to lose interest in sitting still and answering questions. “Want to see my bench?” she said. For her 80th birthday, friends had presented her with a log bench in Central Park, near the Metropolitan Museum of Art. On the short walk over, a young woman stopped Ms. Steinem to thank her for being an inspiration. A man in a taxi yelled, “Love you, Gloria,” and flashed a “V” sign. Ms. Steinem gave him a thumbs up and strode purposefully across Park Avenue. As Ms. Steinem climbed the hill toward her bench, the man sitting there appeared to know who she was. “Go away, crackers,” he said. Ms. Steinem continued to smile, assuring him she did not want him to move. He cursed at her and said, “That Steinem died a long time ago. ” Down the hill, she seemed visibly shaken, but unwilling to criticize the man, who was black. “When you’re treated as a group, you treat others as a group,” she said. “So I’m ‘cracker. ’” She had things to do. There was a Yazidi woman, Nadia Murad Basee Taha, who was trafficked by the Islamic State, to interview for Viceland, and a promo for a Ms. Foundation   to tape. She had to prepare for a talk at the United Jewish Appeal and a local news segment about the Women’s Media Center. She continued on her way. A few days later, she emailed to say that the encounter with the man on the bench was “part of the reason I’m not about to leave New York. At least we see each other and have a chance to talk and absorb what someone else is experiencing. We’re not isolated in a tin can of a car or behind highways and gates. ” There was also the novelty of being called a cracker a first, she wrote. In a lifetime of activism, that may be her signature. Any encounter, even hostile, could be an opportunity. It was a philosophy to live by, and perhaps, eventually, to die by. Why dwell on conflict or loss? “My funeral,” she said, “will be a  . ”'"}, "time": 1742562322.829969}