{"duration": 1.4801719188690186, "input_args": {"text": "'On Friday’s Breitbart News Daily, former U. N. ambassador John Bolton joined SiriusXM host Alex Marlow for a look at President Trump’s first hundred days from a foreign policy and national security perspective. [Bolton said Trump’s record has been “mixed, depending on what area of the world, what particular crisis you look at, and really what point during the hundred days that you take. ”  “I think in many respects the campaign rhetoric  —   which was very, very tough on things like the Iran nuclear deal and the North Korean nuclear threat, much of which continued into the first hundred days  —   is very much at risk of being subverted by the bureaucracy that the administration has not yet tamed,” he cautioned.  “There’s a significant risk that both because of some of the appointees that the president has named, and the appointees he hasn’t named  —   the people in the lower ranks who are the president’s eyes and ears and implementers out in the bureaucracy, particularly at the State Department, which is expert at capturing political appointees, especially from Republican administrations. If the president’s not careful, he will see his foreign policy  —   despite what I think his own views are  —   captured by the same bureaucracy that for eight years implemented the Obama foreign policy,” he elaborated.  “That’s the danger that I see. I don’t think the president has moved on some of these key national security issues as far as the press would like you to believe, or as far as the bureaucracy would like you to believe. It remains to be seen how many people in the administration can remember what they said during the campaign on some of these issues,  particularly terrorism and nuclear proliferation, as the bureaucracy nibbles away at them,” said Bolton. “I think the president needs to be more of a disciplinarian with his subordinates and their bureaucracy,” he advised.  “I think that may be contrary to his natural instincts. I think he is an open, optimistic kind of man, and I think in the Trump Organization it was small enough that that kind of approach worked. But in the sprawling federal government, where different departments and agencies have their own cultures and their own agendas, especially in national security where they’re not friendly to Republican administrations, he needs to be tougher out there. I’m worried about what we’re going to do on Iran. I’m worried about what we’re going to do on North Korea,” Bolton said. He warned there is “a whole range of issues where there is a real risk of creeping back to the Obama administration policy  —   as the poem goes, ‘not with a bang but with a whimper. ’” “Now, in other areas, I think he’s pretty much holding the line, which is why I say overall I think the performance in the first hundred days is mixed,” Bolton concluded. Focusing on the Iran nuclear deal, Bolton recalled the State Department’s letter to Congress last week which “certified that Iran was in compliance with the Iran nuclear deal. ” “That is simply not true, in terms of their refusal to let the International Atomic Energy Agency visit key military sites, their excessive production of heavy water, their excessive enrichment of uranium, their gross disregard of the Security Council resolution and the part of the agreement dealing with ballistic missiles,” he asserted. “And those are just some of the things we know publicly. These are plain violations of the agreement. And that doesn’t count the provisions of the agreement that are so ambiguous, so poorly drafted, so open to interpretations favorable to Iran that lawyers could end up debating them for decades into the future. ”  “What’s even worse is, if you read the congressional statute carefully, the reporting obligation does not require the president to make a binary decision  —   yes Iran is in compliance, or no Iran is not in compliance. By the statute’s own terms, it allows the president to say, ‘I am not able to certify that Iran is in compliance,’ which he would have been perfectly legitimate within his rights to do, especially given the newness of the administration,” he noted. “Now, where did that certification come from? It came from the State Department bureaucracy. It came from the same people who negotiated the deal that was finally agreed to in the summer of 2015, and who have been protecting it, nurturing it, sheltering it for a year and a half since then. This may sound like a small point, but I’ll tell you, the proponents of the deal have taken that certification in just one week and said, ‘See, even the Trump administration says that the good old ayatollahs in Iran are complying with the deal,’” Bolton said.  “The negative implication of that, as the Trump administration then goes on to say Iran’s behavior in most material respects, as the president himself said, violates the spirit of the deal. Well, it goes beyond that. It violates the letter of the deal as well,” he contended.  “I’ve heard different stories, frankly, about whether the White House cleared that document or not, or whether  —   as is often the case with the bureaucracy  —   they come running in and say, ‘This is due on Capitol Hill at 5 P. M.! We’ve got to send it! We’ve got to send it, or we’ll be in default, we’ll be delinquent, we’ll be subject to criticism!’ So people say well, all right, I guess we’ve got to send it, and they don’t have time to think through the implications,” he said. “This is to me a kind of textbook example, in the case of Iran, how a very strong and   foreign policy just gets whittled away. It may seem like water eroding rock. It doesn’t happen in dramatic moments. But I’m just telling you, this is the way bureaucracy works, and it works to undercut especially conservative and Republican presidents,” Bolton lamented. Breitbart News National Security Editor Frances Martel joined the conversation to ask Bolton about the deep relationship between the nuclear issues in Iran and North Korea, which are generally treated as entirely separate matters in media coverage. “The media don’t get the connection, and that in part is because the national security bureaucracy doesn’t get, or doesn’t want to talk about, the connection,” Bolton replied, portraying it as “a classic bureaucratic example of what they call silos. ” “You’ve got the people dealing with Iran there in one silo, you’ve got the people dealing with North Korea in another silo. They might as well be on different planets,” he explained.  “But the fact is, again, from publicly available information going back 30 years, we know that the North Koreans and the Iranians have been in close cooperation on the development of ballistic missiles for that entire period. North Korea sold Iran the first SCUD missiles that were the basis for the Iranian missile program. They’ve cooperated in multiple ways since then. It makes perfectly good sense for that to happen. They’re both using the same   SCUD missile technology for their missile programs, so they’ve got a common scientific and engineering base. Their objectives for the missile programs are exactly the same. It’s to deliver nuclear weapons, not launch communications or weather satellites. On that score, it’s just absolutely clear,” Bolton said.  “It is less clear in terms of publicly available evidence on the nuclear side, but I think there is substantial reason to believe there’s close cooperation there as well,” he continued. “The reactor that Israel destroyed in Syria in September of 2007 was being built by North Koreans. It was a clone of the North Korean Yongbyon reactor. Most people don’t think Syria had the financial wherewithal to pay for building that kind of reactor, and the North Koreans don’t do anything for free, so where did the money come from? I think it probably came from Iran. ”  “I think there are a lot of other connections that have been noted, the Iranian scientists in North Korea and vice versa. Forget the Iran nuclear deal for a minute  —   it’s entirely foreseeable that the day North Korea gets the capability to drop a nuclear warhead on the United States via ballistic missile, Iran could have that capability the next day by writing a check in the right amount of money, so this relationship is extremely important,” he warned.  “On North Korea itself, the administration started off again with a very tough line on this  —   and yet yesterday, in an interview with Fox News, Secretary Tillerson said he’d be willing to have bilateral discussions with North Korea. This is after saying that the Obama ‘strategic patience’ doctrine was being rejected, after saying correctly we’ve negotiated with North Korea for 25 years and it hasn’t produced anything. Now we’re back to negotiating with North Korea and pressuring China to pressure North Korea. This is like Year 26 of the same failed policy,” Bolton complained.  “Now, I don’t want to overstate that, the secretary might have misstated what he implied by that, and certainly China has done a few things in the past couple of weeks that look encouraging. But I’ve been around that track before. When the heat gets too great, the Chinese pat the North Koreans on the fanny and say, ‘bad boys!’ They take some steps that appear to put pressure on North Korea, and then they hope that Americans with our famously short attention spans turn away, and the heat goes off, and then they quietly go back to business as before the particular crisis,” he said. Bolton urged policymakers to remember that North Korea sees nuclear weapons as a tool for implementing a dangerous   policy agenda, which they would not abandon even if their nuclear aspirations were decisively thwarted. “I think the same is true for the ayatollahs in Iran,” he added. “So when you say to Kim   and his generals, ‘Give up your nuclear weapons,’ what they hear is ‘give up up your regime, and maybe give up your lives, while we’re on the subject.’ They’re not going to do it. ”  “We have tried diplomacy, persuasion. We have tried sanctions, coercion, in differing measures, different combinations, for 26 years. It just hasn’t worked,” he said.  “That’s why I think the only   solution is reunifying the two Koreas,” Bolton offered. “I think we could explain to China why that’s in their best interest. The Chinese say they don’t want North Korea to have a nuclear weapon because it would be destabilizing in East Asia. That’s code for saying they’re afraid Japan is going to get nuclear weapons. But they have not taken the steps necessary in the past to pressure North Korea to give up the weapons because they understand just how frail that regime really is, and they’re worried it will collapse in an uncontrolled fashion that will cause them all kinds of problems. ”  “I think there’s a deal here. I think it’s complicated and difficult to negotiate. I wish we had started 15 years ago. But we’re in a race now, because the factor that’s changed from the last 25 years to today is, North Korea this time is really very close to having the capability to miniaturize a nuclear weapon, put it under the nose cone of an ICBM, and launch the ICBM towards the United States. That’s what’s really driving people,” Bolton observed.  “Obama just watched it all happen for eight years. He’s dumped this problem on the Trump administration. But it’s also why we need a policy change. If you try in Year 26 to keep doing what you’ve done and failed to accomplish your objective, for the last 25 years  —   who has any reason to believe that in Year 26 you’re going to get a different result?” he asked. Marlow asked what South Koreans thought of his unification idea. “Many of them are not wild about it, because they look at the example of German reunification, they saw it was very costly to the West Germans,” Bolton conceded. “I think there are real differences between the two circumstances. I think in fact for South Korea this is a huge economic opportunity, to be perfectly crass about it. You’ve got a wage base in North Korea of roughly zero, so that by putting manufacturing and other facilities up there, eventually the wages in North Korea will be the same as the wages in South Korea, but not in the immediate future. ”  “It is something that’s going to come anyway,” he predicted. “The division of the Korean peninsula is unnatural, just as the division of Germany was. It was always intended to be temporary until the Cold War intervened. There will be reunification one day. The issue remains, will it be accomplished in a restrained and careful fashion that works out in our interests, and maybe in the interests of China as well, or will it occur catastrophically?”  “If the United States at some point has to strike preemptively against North Korea’s nuclear capabilities, there’s every prospect that that could ignite a broader conflict on the peninsula that would be devastating all around, and would almost certainly produce the collapse of the North Korean regime. I would say to China, ‘Look, we can do this the easy way, or we can do this the hard way. Which would you rather do? ’” he advised.  “That’s why I think the larger objective of reunification has to be really the policy objective because we tried to stop the nuclear program in North Korea for 25 years and we have failed. We have failed because persuasion has failed. We have failed because coercion has failed. We have failed because the combination of coercion and persuasion has failed. So now we’re going to try it again? I just hope that’s not where the State Department is going,” said Bolton. Marlow suggested it might be difficult to reconcile the intense amount of diplomacy and economic involvement required to achieve Korean unification with President Trump’s campaign promise of an “America First” foreign policy. “The detonation of a nuclear weapon on a major American city can really concentrate your attention,” Bolton replied. “This is putting America first. We are a global power. That’s a reality. Therefore, our interests are worldwide. South Korea and Japan are two of our biggest trading partners, and they are threatened by this erratic, irrational regime in North Korea. We are on the verge of being threatened in the United States ourselves. We’ve got inadequate defense capabilities. ”  “Barack Obama gutted the national missile defense program that George Bush had started. We’d be in much better shape if we could defend ourselves against North Korean or Iranian missile launches, but we have a wholly inadequate capability at the moment. So there are a lot of challenges that the president has to face, even though  —   like most presidents, I suppose  —   he’d rather focus on domestic issues,” Bolton observed. John Bolton is a senior fellow at the American Enterprise Institute and president of his own political action committee, BoltonPAC. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. '"}, "time": 1742562877.4865344}