{"duration": 0.14268112182617188, "input_args": {"text": "'By many measures, Chobani embodies the classic American immigrant success story. Its founder, Hamdi Ulukaya, is a Turkish immigrant of Kurdish descent. He bought a defunct yogurt factory in upstate New York, added a facility in Twin Falls, Idaho, and now employs about 2, 000 people making Greek yogurt. But in this contentious election season, the extreme right has a problem with Chobani: In its view, too many of those employees are refugees. As Mr. Ulukaya has stepped up his advocacy  —   employing more than 300 refugees in his factories, starting a foundation to help migrants, and traveling to the Greek island of Lesbos to witness the crisis firsthand  —   he and his company have been targeted with racist attacks on social media and conspiratorial articles on websites including Breitbart News. Now there are calls to boycott Chobani. Mr. Ulukaya and the company have been taunted with racist epithets on Twitter and Facebook. Fringe websites have published false stories claiming Mr. Ulukaya wants “to drown the United States in Muslims. ” And the mayor of Twin Falls has received death threats, partly as a result of his support for Chobani. Online hate speech is on the rise, reflecting the rising nationalism displayed by some supporters of Donald J. Trump, who has opposed resettling refugees in the United States. “What’s happening with Chobani is one more flash point in this battle between the voices of xenophobia and the voices advocating a rational immigration policy,” said Cecillia Wang, director of the Immigrants’ Rights Project at the American Civil Liberties Union. Chobani and Mr. Ulukaya declined to comment for this article. The Trump campaign did not reply to a request for comment. Mr. Ulukaya arrived in upstate New York in the 1990s to attend school. By 2002, he was making and selling feta cheese inspired by a family recipe. A few years later, he learned that a local yogurt and cheese factory that had closed was for sale. He received a loan of $800, 000 from the Small Business Administration to purchase the factory, and started selling Chobani yogurt in 2007. As the business grew, Mr. Ulukaya needed more help. When he learned there was a refugee resettlement center in a nearby town, he asked if any of the newcomers wanted jobs at Chobani. Mr. Ulukaya provided transportation for the new hires, and he brought in translators to assist them. He paid the refugee workers salaries above the minimum wage, as he did other workers at the factory. When Chobani opened its factory in Twin Falls, Mr. Ulukaya once again turned to a local resettlement center. The company now employs resettled refugees from Iraq, Afghanistan and Turkey, among other countries. “The minute a refugee has a job, that’s the minute they stop being a refugee,” Mr. Ulukaya said in a talk he gave this year. Today, Chobani has annual yogurt sales of around $1. 5 billion. Last year, Mr. Ulukaya signed the Giving Pledge, promising to give away a majority of his fortune to assist refugees. Chobani and the other companies working with refugees are not exploiting them, said Jennifer Patterson, project director for the Partnership for Refugees, a federal program. “It’s the exact opposite,” Ms. Patterson said. “These companies are looking to provide resettled refuges with the ability to live happy and productive lives. ” Chobani’s work with refugees went largely unnoticed until this January, when Mr. Ulukaya spoke at the World Economic Forum in Davos, Switzerland. His message  —   that corporations needed to do more to assist refugees  —   broke through the   rhetoric. “He was quite a sensation there,” said Kenneth Roth, executive director of Human Rights Watch, who attended the event. “Here was someone who went beyond the   chatter of Davos and was walking the walk. ” Cisco, IBM, Salesforce and more joined others in pledging assistance to refugees. Those companies and others began working with the Tent Foundation, which Mr. Ulukaya founded last year. Chobani has pledged to help other companies learn how to effectively integrate refugees into a work force. But while an alliance of   companies was now working together on the issue, the online critics zeroed in on Chobani. Shortly after Mr. Ulukaya spoke in Davos, the   website WND published a story originally titled “American Yogurt Tycoon Vows to Choke U. S. With Muslims. ” Then this summer, Breitbart, the conservative news website whose former executive chairman, Stephen K. Bannon, is now running the Trump campaign, began publishing a series of misleading articles about Chobani. One drew a connection between Chobani’s hiring of refugees and a spike in tuberculosis cases in Idaho. Another linked Chobani to a “Twin Falls Crisis Imposed by     Advocates. ” A third conflated Chobani’s hiring practices with a sexual assault case in Twin Falls involving minors. As Breitbart began publishing its articles, the online attacks grew more intense. On Twitter and Facebook, users called for a boycott of Chobani. An image was widely shared on social media that claimed Mr. Ulukaya was “going to drown the United States in Muslims and is importing them to Idaho 300 at a time to work in his factory. ” And bloggers fabricated stories claiming that Chobani was pressuring local officials “to facilitate their multitude of Muslim   requests. ” Soon the mayor of Twin Falls, Shawn Barigar, found himself at the center of a conspiracy theory. “It got woven into a narrative that it’s all a   that we’re all trying to keep the refugees safe so that Chobani has its work force, that I personally am getting money from the Obama administration to help Chobani hire whoever they want, that it’s part of this Islamification of the United States,” he said. “It’s crazy. ” As the online comments escalated this summer, Mr. Barigar and his wife received death threats. Breitbart said it was simply covering the news. “Breitbart has been a leader in delivering important and breaking news on refugee crises throughout the Western world, which pose both national security and financial risks,” Alex Marlow, editor in chief, said in a statement. “Mr. Ulukaya hasn’t merely involved himself in this issue, he’s been one of the leaders in expanding refugee resettlement in the United States. Breitbart’s explosive growth is due in large measure to the mainstream media’s refusal to cover vital topics like this one. ” But civil rights advocates said they believed it was no mystery why Mr. Ulukaya was targeted while other chief executives had been spared. “It’s because he’s an immigrant himself,” Ms. Wang of the A. C. L. U. said. Mr. Roth of Human Rights Watch attributed some of the xenophobia directed at Chobani to the election season. “Some people are feeling left behind, and some people are concerned about terrorists,” he said. “But Trump has given a voice to these sentiments. ” Mr. Barigar, a Democrat, concurred. “Donald Trump really fueled a sentiment about immigration that is shared by a very small part of our community,” he said. “We are an agricultural center. We’ve depended on immigrants for a   or more. ” Mr. Ulukaya appears undeterred. In September, he participated in a   discussion with President Obama and business leaders on how corporations could do more to help refugees. And his work with refugees is part of a broader suite of initiatives. He recently gave 10 percent of Chobani shares to his employees, and he is offering paid parental leave to all employees. “He’s the xenophobe’s nightmare,” Mr. Roth said. “Here’s an immigrant who isn’t competing for jobs, but is creating jobs big time. It runs completely counter to the   narrative. ”'"}, "time": 1742562099.0616086}