{"duration": 0.10137462615966797, "input_args": {"text": "'Washington usually cloaks its most critical defense programs in secrecy. But in the case of using cyberstrikes, electronic warfare and other exotic forms of sabotage to redefine antimissile defense for the United States, many   officials and officers have been talking openly, often to persuade Congress to fund the secretive efforts. The public conversation about the new antimissile approach, known as “left of launch,” has been careful. Typically, military leaders and contractors have spoken vaguely about technologies and targets. But at moments they have also declared that it is all about North Korea and Iran, at least for now. The idea is to strike an enemy missile before liftoff or during the first seconds of flight. The old approach waited until much later  —   after swarms of warheads had been released, had traveled thousands of miles and were racing toward targets at speeds in excess of four miles a second. Officials have praised    strikes as a novel way of knocking out enemy missiles at a tiny fraction of the usual cost. In presentations and congressional testimony, senior officials have described the method as a potentially revolutionary way to strengthen the defenses of the United States. The public unveiling began in late 2013 when Gen. Martin E. Dempsey, chairman of the Joint Chiefs of Staff, the nation’s   military officer, warned of falling budgets and rising missile threats. That dilemma, he wrote in a policy guidance document for American troops, called for the development of unconventional defenses that would be far cheaper than traditional rocket interceptors. In 2014, Adm. James A. Winnefeld Jr. vice chairman of the Joint Chiefs, told the Atlantic Council that    strikes would, by definition, remain a novel adjunct to wider antimissile efforts. “While we would still obviously prefer to take a threat missile out while it’s still on the ground,” he said, “we won’t always have the luxury of doing so. ” The result, he added, would be the continuing need for “solid    capability”  —   in other words, the traditional methods. In 2015, top antimissile experts gathered at the Center for Strategic and International Studies, a Washington think tank. Archer M. Macy Jr. a retired Navy rear admiral, said the Defense Department was developing ways not only of preventing successful missile launches but of interfering in their flights and navigation. Kenneth E. Todorov, a retired Air Force brigadier general, raised the question of how to authorize what would amount to   war  —   of attacking first to gain a strategic advantage. “Are we, as a military and a nation,” he asked, prepared to “go after potential targets in advance?” No consensus emerged. Raytheon, the nation’s top antimissile contractor, went wide rather than deep. In a conference presentation, it disclosed that the new developments included not just cyber and electronic strikes but the targeting of enemy factories, hinting at industrial sabotage. The glossy presentation included a lineup of “sophisticated adversaries,” including Kim   the North Korean leader. Last year, the Pentagon’s budget request for 2017 said an antimissile program known as Nimble Fire had advanced General Dempsey’s goals by exploring “electronic attack” and “offensive cyber operations. ” The details, it said, were classified secret. In April, a number of budget hearings in the House and Senate focused on    programs. Some of the most revealing testimony came before Senator Jeff Sessions, then chairman of the Strategic Forces subcommittee of the Senate Armed Services Committee and now attorney general. Vice Adm. James D. Syring of the Navy, director of the Pentagon’s Missile Defense Agency, described    strikes and other unorthodox approaches as “game changing” because they reduced the need to “rely exclusively on expensive interceptors. ” Brian P. McKeon, then the Pentagon’s under secretary of defense for policy, said the Defense Department sought new and old antimissile arms “to deal with the threat of missiles from either North Korea or Iran. ” Of all the nations that might threaten the United States, he noted in his testimony, those two countries “are driving our investments. ” At a House hearing, Adm. William E. Gortney, then head of the North American Aerospace Defense Command, which has the responsibility for firing the nation’s antimissile weapons in time of war, was asked what Congress should do “to ensure our military forces” can execute    strikes. Admiral Gortney said that in the committee’s secret session he could discuss the development of classified technologies where “investments are absolutely critical. ”'"}, "time": 1742561798.4381514}