{"duration": 0.03449416160583496, "input_args": {"text": "'The storm over bans on burkinis in more than 30 French beach towns has all but drowned out the voices of Muslim women, for whom the   swimsuits were designed. The New York Times solicited their perspective, and the responses  —   more than 1, 000 comments from France, Belgium and beyond  —   went much deeper than the question of swimwear. What emerged was a portrait of life as a Muslim woman, veiled or not, in parts of Europe where terrorism has put people on edge. One French term was used dozens of times: “un combat,” or “a struggle,” to live day to day. Many who were born and raised in France described confusion at being told to go home. Courts have struck down some of the bans on burkinis  —   the one in Nice, the site of a horrific terror attack on Bastille Day, was overturned on Thursday  —   but the debate is far from over. “For years, we have had to put up with dirty looks and threatening remarks,” wrote Taslima Amar, 30, a teacher in Pantin, a suburb of Paris. “I’ve been asked to go back home (even though I am home). ” Now, Ms. Amar said, she and her husband were looking to leave France. Laurie Abouzeir, 32, said she was considering starting a business caring for children in her home in Toulouse, southern France, because that would allow her to wear a head scarf, frowned upon and even banned in some workplaces. Many women wrote that   bias had intensified after the attacks on Charlie Hebdo in Paris in January 2015, and in Brussels, Paris and  Nice more recently. Halima Djalab Bouguerra, a    student in    France, dated the change further back, to the killings by Mohammed Merah in the southwest of the country in 2012. “The way people look at us has changed,” Ms. Bouguerra wrote. “Tongues have loosened. No one is afraid of telling a Muslim to ‘go back home’ anymore. ” Here are some excerpts from the comments we received. They have been condensed and edited for clarity, and translated for those who wrote in French. _____ _____ _____ _____ _____ _____ _____ _____ _____ _____ _____ _____ _____ _____ _____ _____'"}, "time": 1742562551.477294}