{"duration": 0.02878260612487793, "input_args": {"text": "'Words are battling in my head and I cannot truly form a sentence empty of frustration. \\nThe phone is barely ringing to Aleppo. And, when they finally pick up, no word is discernible. The internet connection is cut. There’s no actual way of reaching anyone, to make sure your loved ones are safe. \\nThis is West Aleppo. \\nA few days ago, a school was targeted, A SCHOOL Six children, six innocent lives, only there to getaway from the atrocity that is war, to learn, to reach a future, taken away, leaving torn families behind. \\nThis is West Aleppo. \\nYesterday, as the situation was getting worse and worse, my aunts and their families found themselves forced to seek what’s left of safety and refuge, at my grandmother’s house. \\nThis is West Aleppo. \\nMy friend wondering if he will survive one more month in this bloodshed because everyone around is dying. \\nThis is West Aleppo. \\nAleppo, where East and West have been battlefields for years now. Yet, as always we hardly hear of those paying the price. Forgotten, probably deliberately. After all, all that has mattered since day one was the « winner » of this horror story. \\nShame. Shame on this world. Shame on the mainstream media, playing a game with us, trying to convince us of the care they feel for the Syrian people dying but only talking about some parts of it. \\nWhere are the mediatized pictures of Aleppo these last few days… Where are those people always acting like Syria has become their number one worry while six years ago, they didn’t even know how to place it on a map of the Middle East…? Or is it just that some lives aren’t really worth remembering…? \\nYou don’t chose where you are born, where your house is. I have loved ones in both parts of Aleppo and I worry about them as much and I cannot bear the fact that a side is more worthy of empathy than the other just because there’s apparently a « good » and a « bad » while all I’m seeing is my people suffering wherever they are.'"}, "time": 1742564412.0846477}