{"duration": 0.12775635719299316, "input_args": {"text": "'Pinterest \\nThere have been plenty of stories of voter fraud across the country, but a photoshopped picture has taken the internet by storm. In it, Donald Trump’s name is left off of the ballot whil Hillary Clinton’s is listed twice. \\nThe doctored photo hit Twitter and has since been re-tweeted tens of thousands of times. Take a look at the picture for yourself: \\n— Hatrick Penry (@Hatrick__Penry) October 24, 2016 Hey guys, seriously? How is this not viral yet? Are we going to be taken as that stupid and let it go? This is an Oregon Ballot. pic.twitter.com/4eSSrK3aaB \\n— Curt Schilling (@gehrig38) October 27, 2016 \\nAbout an hour after John Laussier started the hoax, he took responsibility for it and admitted that it wasn’t real: “In case its not super obvious that last tweet from me is a hoax. Don’t believe everything you read on the internet folks.” Is Trump on the Oregon ballot? YES. But a hoax grabbed a lot of retweets today. Official sample ballot >>> https://t.co/LR1smKW2pO pic.twitter.com/WvMIhyzUHz \\n— KVAL News (@KVALnews) October 21, 2016 \\n“I’m hoping people figure out soon this was fake, and, in the future, look at what they’re passing on,” Laussier told KATU . “We’ve got to act responsibly. Get out your ballots, take a good hard look, and vote with some research!” \\nLaussier told KATU that it was “irresponsible of me to post the tweet,” and he apologized. LawNewz reported : \\nThe Oregon Secretary of State’s Office told KGQ that they are evaluating whether the hoax violated election law. Spokesperson Molly Woon emphasized to the television station that the Oregon Secretary of State is “confident” in the election process. \\nWhile Laussier makes a good point about people being discerning about what they share on the internet, there are a couple of important points here. \\nFirst, there is good reason for people to be vigilant about voter fraud . There are numerous reports of the problem across the country and it’s good that people are paying attention. \\nSecond, the mainstream media is largely in the tank for Clinton and operates as a propaganda machine. Most people don’t have the time — or if they do, don’t have the resources — to thoroughly vet something they come across. You know who has both? The media… but they refuse to do so because of their bias. \\nIf this ballot was real, people may have been able to force change by bringing light to what would have been a serious problem. \\nThat certainly doesn’t mean that people shouldn’t be discerning or that they should repost or re-tweet everything they come across. There’s something to be said for people being vigilant, paying attention, and forcing those in the media and those in positions to do something about it to take a look. \\nNow, that doesn’t mean that people should automatically believe that something’s true and adjust their beliefs/voting decision because of it; it just means that it’s good that people are paying attention and forcing those in a position to check it out to do so. \\nWhile Laussier’s tweet was an interesting experiment, the timing was poor given the rampant voter fraud going on throughout the country. This was a hoax, but there are plenty of instances where it isn’t, and people shouldn’t be discouraged from being vigilant about it.'"}, "time": 1742563519.8731813}