{"duration": 0.060996294021606445, "input_args": {"text": "'The international “March for Science” appears to have   Earth Day, casting “social justice” as “science. ”[The Earth Day Network that owns the international rights to the annual    —   and celebration of Vladimir Lenin’s birth  —   artfully sought to rebrand its messaging by having protestors in 610 locations around the planet swap their   shirts for the patina of scientific truth associated with white lab coats.  The festivities began in the wee hours of April 22 in New Zealand, then followed the sun to circumnavigate the globe. The event’s blog reported 50 celebrants showed up at Antarctic research stations, and 2 very intrepid souls showed up in   degree weather at the North Pole. Although it seemed that the media in many locations outnumbered the demonstrators, San Francisco and Washinton, D. C. both produced about 5, 000 marchers. The March for Science website in January trumpeted, under “Diversity and Inclusion Principles“: “Colonization, racism, native rights, sexism, ableism,        econ justice are scientific rights. ” But as the event neared, the scientific communism of Marx and Engle’s Das Capital morphed into Principals and Goals: “Our wealth of personal experiences and perspectives is our greatest strength. In putting the people who do science at the forefront of this discussion, we can show that scientists come from all cultural backgrounds, belief systems, orientations, genders, and abilities. ” Honorary   Bill Nye the Science Guy said, “We march forward to ensure a better world for people all over the world. ” But he and Senator Bernie Sanders ( ) made it clear in their February Facebook Live “Conversation on Climate Change” that they believe all skeptics of climate change are suffering from cognitive dissonance. The most interesting coverage of the event came from Science magazine, which   the events with about 60 posts over 24 hours. Demonstrating the tenuous connection between the “March for Science” and actual scientists, the first April 22 speaker at the New Zealand event was leftist Green Party   James Shaw, who is a former accountant with no science background. Shaw said, “When politicians use their belief systems to override the facts, the scientific facts, we are all in for a whole world of hurt. ” Shaw then droned on about his social justice belief system that New Zealanders needed to stand up against the U. S. political discourse questioning climate change.'"}, "time": 1742564495.3283806}