{"duration": 0.16442084312438965, "input_args": {"text": "'In blunt testimony revealed on Tuesday, former managers of Trump University, the   school started by Donald J. Trump, portray it as an unscrupulous business that relied on   sales tactics, employed unqualified instructors, made deceptive claims and exploited vulnerable students willing to pay tens of thousands for Mr. Trump’s insights. One sales manager for Trump University, Ronald Schnackenberg, recounted how he was reprimanded for not pushing a financially struggling couple hard enough to sign up for a $35, 000 real estate class, despite his conclusion that it would endanger their economic future. He watched with disgust, he said, as a fellow Trump University salesman persuaded the couple to purchase the class anyway. “I believe that Trump University was a fraudulent scheme,” Mr. Schnackenberg wrote in his testimony, “and that it preyed upon the elderly and uneducated to separate them from their money. ” For Mr. Trump, whose presidential campaign hinges on his reputation as a businessman, the newly unsealed documents offer an unflattering snapshot of his career since branching out, over the past decade, from building skyscrapers into endeavors that cashed in on his name to sell everything from water and steaks to ties and education. The release of the documents on Tuesday, under court order, was the latest turn in a federal lawsuit, filed in California by dissatisfied former Trump University students, that has bedeviled the businessman since 2010 and could trail him into the White House if he is elected president. Mr. Trump, who started the university in 2005, owned 93 percent of the   company. From the start, he acted as its chief promoter, rather than    manager, selling it as a tool of financial empowerment that would improve life for thousands of ordinary Americans. It would, he said, “teach you better than the best business school,” according to the transcript of a Web video. Within the documents made public Tuesday were internal employee guides encouraging customers with little money to pay for the tuition with their credit cards. “We teach the technique of using OPM . .. Other People’s Money,” explained the internal instructions for salespeople. The documents pushed employees to exploit the emotions of potential customers. “Let them know you’ve found an answer to their problems,” read confidential instructions to salespeople. The most striking documents were written testimony from former employees of Trump University who said they had become disenchanted with the university’s tactics and culture. Corrine Sommer, an event manager, recounted how colleagues encouraged students to open up as many credit cards as possible to pay for classes that many of them could not afford. “It’s O. K. just max out your credit card,” Ms. Sommer recalled their saying. Jason Nicholas, a sales executive at Trump University, recalled a deceptive pitch used to lure students  —   that Mr. Trump would be “actively involved” in their education. “This was not true,” Mr. Nicholas testified, saying Mr. Trump was hardly involved at all. Trump University, Mr. Nicholas concluded, was “a facade, a total lie. ” Lawyers for Mr. Trump on Tuesday challenged those characterizations, saying that the testimony of the former Trump University employees “was completely discredited” in depositions taken for the California lawsuit. Lawyers for Mr. Trump declined to release those depositions on Tuesday. As he has in the past, Mr. Trump argued through representatives that the complaints emanated from a small number of former students and that the vast majority had offered positive reviews of their experience. “Trump University looks forward to using this evidence, along with much more, to win when the case is brought before a jury,” said Hope Hicks, a spokeswoman for Mr. Trump. The court records show the role that Mr. Trump  —   and his outsize reputation  —   played in trying to sell the real estate classes to thousands of students. Marketing materials bearing his signature encouraged prospective students to take advantage of a downturn in the housing market to earn quick profits. He offered the kind of assurances that financial advisers have long cautioned consumers to be wary of. “How would you like to   your financial future,” Mr. Trump asked in one brochure. Mr. Trump started the   Trump University just as the overheated American housing market neared its peak, promising that its classes would impart his wisdom about real estate and moneymaking to the general public. But dozens of complaints about the school rolled into the offices of attorneys general in Florida, Texas, New York and Illinois, officials said, prompting multiple investigations and, eventually, the lawsuit from former students in California. Mr. Trump had fought Tuesday’s release of previously sealed documents in the case. In an apparent attempt to discredit the judge in the case, Gonzalo P. Curiel, Mr. Trump called him biased and a “hater of Donald Trump,” and he sought to draw attention to the judge’s ethnic background  —   “we believe Mexican,” Mr. Trump said. (Mr. Curiel was born in Indiana he is of Mexican descent.) On Friday, in response to a legal motion filed by The Washington Post, Judge Curiel ruled that the records be released. Some of the documents unsealed Tuesday were previously made public in connection with other lawsuits. The internal guidebooks for employees of Trump University provide a detailed set of instructions for how to sell the classes, even to skeptical and reluctant consumers, by tapping into their psychological needs. A chart outlines the stages of the “roller coaster of emotions” that a buyer will experience. (The “Blast” phase, it explains, is “giving your clients hope again. ” The “Probe” phase, it says, must “slowly bring the client back down to reality. ”) When it comes to selling the classes, the guidebooks leave little to chance. Inside the rooms where students are asked to enroll in classes, workers are asked to “confirm that room temperature is no more than 68 degrees. ” Of course, Mr. Trump and the promise of his engagement with the school was the biggest draw of all. In the documents released Tuesday, instructors described themselves as “ ” by Mr. Trump. But in a deposition related to the lawsuit, Mr. Trump acknowledged that he did not pick the instructors. Not all the documents made public on Tuesday were critical. Many former students said the classes delivered exactly what they had expected. “Trump University definitely made me more prepared to tackle the ‘real world’ of real estate investing,” wrote David Wright Jr. who signed up for a   program. “We really learned a lot of from Trump University and have found a modicum of success,” wrote another student, Kissy Gordon. Former employees like Ms. Sommer took a dimmer view of the school. In her testimony, she said she was startled by the qualifications of some Trump University instructors. Ms. Sommer recalled that a member of the Trump University sales team, who had previously sold jewelry, was promoted to become an instructor. He had “no real estate experience,” she said. She added that many of the instructors had the quality that the school seemed to value most: “They were skilled at   sales,” she said.'"}, "time": 1742564362.7157905}