{"duration": 0.06596708297729492, "input_args": {"text": "'Director de \\'Machete\\' y \\'El Mariachi\\' insta a los latinos a votar en EE.UU. Publicado: 27 oct 2016 04:05 GMT \\nRobert Rodríguez, creador de la primera película estadounidense estrenada en castellano, urgió a los votantes a decidir por un país \"con inclusión y diversidad\". Mario Anzuoni Reuters Síguenos en Facebook \\nEl director mexicanoestadounidense Robert Rodríguez decidió alzar la voz a través de un video publicado por el diario británico \\' The Guardian\\' sobre la contienda electoral del próximo 8 de noviembre en EE.UU. \\n\"Esta es una elección en la que nadie puede quedar al margen\", dijo el director, hijo de mexicanos radicados en Texas (EE.UU.). \\n\"Decidirás si este es un país con inclusión y diversidad; decidirás si es un país que valore su población inmigrante\". \\n\\'The Guardian\\' calificó a Rodríguez como \"el rey\" del cine rentable filmado con bajo presupuesto. El director, nacido en 1968, ha hecho películas junto a Quentin Tarantino; además, dio a conocer a la mexicana Salma Hayek y al español Antonio Banderas al público estadounidense. \\nEl diario británico ironizó con los personajes de las películas de Rodríguez, pues los tilda de \"bad hombres\" y \"nasty women\", términos peyorativos usados por el candidato republicano Donald Trump para referirse a los mexicanos inmigrantes y a la candidata demócrata Hillary Clinton. \\nEn \\'El Mariachi\\' (1992) aparecen bandidos, vigilantes y justicieros. Fue la primera película estadounidense estrenada en castellano, rodada por Rodríguez con tan solo 7.000 dólares. \\nEl cineasta afirma que nunca había visto \"cosas tan locas como las que he visto en esta elección\". Sin mencionar a Trump, insistió: \"Afortunadamente, esta es una historia en la que tienes el derecho de escribir el final\". \\nLa presente campaña por la Presidencia de los Estados Unidos se ha centrado en el tema de la inmigración. \\nEl candidato republicano ha insistido en que construirá un muro en la frontera con México para evitar el paso de inmigrantes, predominantemente mexicanos. \\nEn el mes de agosto, el presidente Enrique Peña Nieto invitó a Trump y a Clinton a México, aunque solo acudió el magnate. El galardonado director mexicano Alejandro González Iñárritu, calificó la invitación como \"una traición \". \\nEl diario \\' El País \\' reportó que Peña Nieto reconoció que la invitación a Trump fue un error, además de una decisión \"apresurada\". Todo sobre este tema '"}, "time": 1742561807.7818708}