{"duration": 0.07473254203796387, "input_args": {"text": "'By Hrafnkell Haraldsson   8:47 pm \"We\\'re not conceding we\\'re behind. In our enthusiasm, we have closed the gap...dramatically over the last week.\"   \\nDonald Trump’s deputy campaign manager, the Clinton-obsessed Republican operative, David Bossie, told ABC News’ George Stephanopoulos this morning that “there’s an enthusiasm gap” and that this bit of math Republicans do is Trump’s path to victory on November 8. \\nThis is how the conversation went, per CBS News’ Sopan Deb , as always highlighting the important bits: \\nStephanopoulos was not about to let Bossie get away with the claim about Trump’s tax returns, and hammered him on the issue: \"He\\'s going to release [his tax return] when he is not under audit.\"– David Bossie, Trump Deputy Campaign Manager https://t.co/Y9xVg0rJIX \\n— Good Morning America (@GMA) November 1, 2016 \\nBossie deflected like a pro. You can see why Trump hired him. \\nAs a corollary to Bossie’s claims, Trump suddenly found himself interested in polls again this morning, tweeting , Wow, now leading in @ABC / @washingtonpost Poll 46 to 45. Gone up 12 points in two weeks, mostly before the Crooked Hillary blow-up! \\n— Donald J. Trump (@realDonaldTrump) November 1, 2016 \\nThe Trump campaign has always been about making much out of nothing; elections are not rigged if Trump gets his way, and neither are polls if Trump is leading. Otherwise, it’s all left-wing shenanigans. \\nHowever, even Newt Gingrich isn’t buying the new poll: Washington Post-ABC poll is an absurdity. Trump has not moved up 13 points in the last 8 days.he was NEVER 12 points behind. Ignore polls \\n— Newt Gingrich (@newtgingrich) November 1, 2016 \\nAnd what Trump fails to mention is that his lead disappears if Johnson and Stein are taken out of the mix: then Clinton leads by +1 . \\nThese latest claims are an absolute sham as Clinton leads overwhelmingly in early voting and Comey’s email gambit seems to have failed to sway voters to Trump’s camp. \\nMeanwhile, Trump’s own legal problems are beginning to overwhelm the narrative , and if there is any evidence of a Clinton enthusiasm gap it exists only in Bossie’s own head. \\nDavid Bossie is living proof that Clinton’s “vast right-wing conspiracy is real,” and all the hating on Hillary isn’t going to change the fact that it is Trump who is the crooked candidate, not Hillary Clinton.'"}, "time": 1742564402.526037}