{"duration": 0.05122661590576172, "input_args": {"text": "'WASHINGTON  —   President Trump said he was considering “accelerating” the introduction of his $1 trillion infrastructure bill  —   but he pointedly refused to say whether he planned to include two major New York City transportation projects that his budget for next year would defund. Mr. Trump, speaking in a   interview in the Oval Office on Wednesday, described the infrastructure package as a   legislative sweetener that he could attach to a revived Affordable Care Act repeal bill or tax code overhaul to attract bipartisan support that thus far he had neither sought nor received. “Infrastructure is so popular that I might want to use it for another bill,” said Mr. Trump, who is in need of a legislative win after the humbling defeat of his health care bill last month. “Infrastructure is so popular with the Democrats and pretty popular with the Republicans. A lot of Republicans want infrastructure, too. ” The president, who inherited and expanded a family fortune built on   and   real estate development, has proposed eliminating an   infrastructure program that would have funded   proposals to build a new train tunnel under the Hudson River between New York and New Jersey, and extend the Second Avenue subway in Manhattan north to East Harlem. State and city leaders say both projects are essential: The subway line is needed to alleviate congestion on Manhattan’s East Side, and the tunnel is needed to improve deteriorating rail service in the heavily trafficked Eastern corridor and provide a new conduit for freight in the event of a natural disaster like Hurricane Sandy in 2012. As Mr. Trump discussed his plan, hundreds of thousands of commuters endured a third day of upheaval prompted by a minor derailment at Pennsylvania Station, another reminder of the decrepit, tenuous state of much of the region’s infrastructure and transit systems. Mr. Trump said he planned to examine both New York projects and submit them to an   unformed “commission” headed by Richard LeFrak, a fellow scion of a prominent Queens real estate family, and Steven Roth, the chairman of the New   Vornado Realty Trust. “Well, I may support them,” Mr. Trump said. “I’m going to look at them. ” “I did great in real estate in New York,” he added. “I know all the developers. I know all of the folks. I know the good ones and the bad ones. And I’m setting up a commission of very smart people that know how to spend money properly. That know how to build on time, on budget. And ideally, under time and under budget. ” New York leaders were not impressed. “Welcome to the party,” said Dani Lever, a spokeswoman for Gov. Andrew M. Cuomo. “The governor has been saying that we need to rebuild our airports for years, but unlike Washington, we aren’t just talking about needed improvements we are already in the process of rebuilding them. This is exactly why the federal government needs to follow through on its promise to fund infrastructure projects. ” Mitchell Moss, the director of New York University’s Rudin Center for Transportation Policy and Management, predicted that Mr. Trump, spurred on by his daughter Ivanka and    Jared Kushner, would eventually come through for the city. “   is a nice place to golf, but New York is where Donald Trump grew up, and it’s where he will return,” Mr. Moss said, referring to Mr. Trump’s Florida resort. “At the end of the day, Donald, Ivanka and Jared are going to come back here, and they know the city needs a   infrastructure. ” It is not that the president thinks the city is not in need. “I think it’s in poor shape,” he said of New York’s infrastructure. “The highways are in poor shape. ” “I think the airports are a horror show,” he added. “I’ve traveled the world, I know the world. ” Mr. Trump, whose knowledge of complex policy issues can sometimes be lacking, then offered a scathing critique of the bent and battered metal median guards on the Van Wyck Expressway not far from his childhood home in Queens. “Whoever the person is that owns that company is a genius salesman,” he said, as his aides  —   who wanted to talk about their bigger plans  —   grew restless in their carved armchairs. “That is the worst garbage. I think it bends by the heat, because not that many cars could possibly hit it. It’s the worst garbage. And I also think it’s dangerous because it’s a spear. And if you hit those things, they come flying apart. And if you’re driving, you’ve got yourself a problem. ” Mr. Trump confessed that he had not personally driven in a while, and that it had been years since he had ridden the subway. “It’s been a long time. It’s been a long time,” he said. “I know the subway system very well. I used to take it to   School, in Forest Hills, when I lived in Queens. And I’d take the subway to school. Seems a long time ago. I’d take it from Jamaica, 179th Street. Jamaica, right? To Forest Hills. I understand the subway very well. I used to ride between the cars. ” Referring to his parents, he added, “They weren’t thrilled when they heard that. ” Mr. Trump, at the advice of Speaker Paul D. Ryan and Vice President Mike Pence, had intended to tackle health care first  —   gaining hundreds of billions of dollars in cost savings  —   that would then be rolled into an ambitious tax cut package. Infrastructure, according to Transportation Secretary Elaine Chao and other top administration officials, was something the administration would handle when the other two bills were passed. But the health care debacle has scuttled the president’s plans, and he is considering merging one or all of the proposals in the hopes of cobbling together a coalition. The idea of merging a big infrastructure plan with a tax proposal is not new: Shortly after taking office in 2009, President Barack Obama proposed a similar idea  —   and his stimulus package included more than $300 billion in tax breaks intended to spur infrastructure and capital investments to stimulate growth. Mr. Trump is confident he will attract Democratic support  —   even though he has not spoken with the minority leader, Senator Chuck Schumer of New York, for weeks. He said Democrats were “desperate for infrastructure  —   that’s the thing that they want. ” Mr. Schumer said he was eager to start negotiations but not especially hopeful. “He hasn’t put out anything specific yet,” the senator said. The president, surrounded by staff members including Gary D. Cohn, the director of the National Economic Council, and Reed Cordish, an assistant to Mr. Trump  —   refused to say how much direct public funding would be included in his proposal. A senior administration official directly involved in drafting the plan said that number would be in the $200 billion to $300 billion range over the next decade, with the balance of the package paid for by tax credits. Mr. Schumer and many congressional Democrats say they will never agree to such large tax breaks for developers and builders, despite the president’s claim that they will fold. And even as Mr. Trump trumpeted the curative political tonic of the infrastructure bill, his aides were on hand to remind him that they had their own priorities, too. “He’s spending an enormous amount of time on trade and taxes,” Mr. Cohn said, interrupting the talk of trains, planes and automobiles. “Those are two big areas. ” A few minutes later, Mr. Cohn  —   who is ascendant in Mr. Trump’s circle  —   let out a colossal sneeze. Perhaps that is why the president paid such close attention to Mr. Cohn’s physical  . “God bless you. You O. K. Gary?” the president said. “That was a pretty tough one. I’ve got to make sure my man is all right. ”'"}, "time": 1742628601.0597034}