{"duration": 0.10044479370117188, "input_args": {"text": "'Home › POLITICS | US NEWS › TEXAS COUNTY SWITCHES TO PAPER BALLOTS AFTER ELECTRONIC VOTING GLITCHES TEXAS COUNTY SWITCHES TO PAPER BALLOTS AFTER ELECTRONIC VOTING GLITCHES 0 SHARES \\n[10/26/16] ADAN SALAZAR – A county in Texas has switched to “emergency paper ballots” after electronic voting machines in the region suffered technical glitches. \\nChambers County Clerk Heather Hawthorne issued a press release Tuesday night announcing electronic voting would be suspended until the glitches affecting voting machines could be corrected. \\n\\n“The Straight Party vote for both the Republicans and Democrats did not automatically select one race on each ballot,” states the press release. \\n“The error was caused in programming by ES&S (Election Systems and Software Inc.), the vendor who programs the election software used in Chambers County.” \\n“The Straight Party vote for both the Republicans and Democrats did not automatically select one race on each ballot,” states the press release. \\n“The error was caused in programming by ES&S (Election Systems and Software Inc.), the vendor who programs the election software used in Chambers County.” \\n“Immediately, Hawthorne contacted ES&S and advised them of the issue. Hawthorne then contacted the Secretary of State’s office, the office overseeing the elections in Texas, and was informed to create emergency paper ballots to be used until the problem could be fixed.” \\nHawthorne claims she discovered the problem Monday morning after she cast her own vote and reviewed the electronic ballot. \\n“Moving temporarily to paper ballots in such a situation is standard protocol,” Hawthorne reportedly told 12NewsNow . \\nOn Wednesday, Hawthorne issued another press release claiming the machines had been fixed. \\n“Using paper ballots in the interim, as prescribed by the Texas Election Code, allowed our vendor to resolve the issue quickly,” she wrote. \\nElsewhere in Texas , in towns such as Arlington and Amarillo, other voters have reported witnessing their votes flipped from Donald Trump to Hillary Clinton. \\nElection officials in those places, however, blamed users for the errors. \\nEarlier in the week, Infowars attempted to speak with the Texas Director of Elections Keith Ingram about public concerns over possible voter fraud, but he didn’t want to talk to us. Post navigation'"}, "time": 1742562003.9452684}