{"duration": 0.13628625869750977, "input_args": {"text": "'Print \\nThere is a sizeable faction in this country that is disgusted with the choices we have going into the 2016 General Election. While the choices are far from the quality a great nation like the United States deserves, they are what they are. No amount of complaining, abdication of responsibility, or indignation will change this reality. \\nBut, like it or not, the outcome of this election will affect each and every one of us, and in ways that can never be rectified in our lifetimes, if at all. It is for that reason that this election is a referendum on the issues, not on the candidates. It is also for this reason that it needs to be reiterated – in no uncertain terms – that General Elections are not for electing your favorite candidate. They are for protecting the country from the worst candidate. \\nRight now, we have two candidates – arguably not the best the country can offer, who possess two extremely different visions for the country. It is about these differences – exclusively – that we must base our choices come Election Day. Put bluntly, this election isn’t about personalities, capabilities, soundbites or even criminality; it is about issues, and on these issues, we do have choices to make. \\nYes, the names on the ballot give us pause. I will cede that point but offer this rebuttal for your consideration. \\nOn the one hand, we have a politically untested, braggadocios businessman in Donald Trump who routinely makes statements before he thinks about the consequences of his words. But while many may have their principles insulted by the prospect of casting a vote for such an overt braggart, there is no question that he loves and appreciates the country that has allowed him to be so successful. \\nOn the other hand, we have Hillary Clinton , a woman who has, but for a very short stint at a private law firm, always lived taking a taxpayer-funded government check. For getting on 30 years this woman has fed off the taxpayer feed trough, advancing her ideological agenda – one tilted to the whims of the Fabian Progressive that she is, admittedly, and establishing and engaging in bureaucratic corruption so extensive that she has been able to parlay her “public service” into an amassed wealth of hundreds of millions of dollars. \\nSo, in personality and professionally, we have a stark and glaring choice in the people that are on the ballot. One, Trump, has a love of country but no political prowess, the other, Clinton, has decades of inside-the-beltway experience but a deeply seeded desire to “fundamentally transform” the nation from a Constitutional Republic to a Socialist Democracy administered by a Progressive oligarchy. \\nLarger than the personalities in this election, however, are two very important and critical issues; issues that these two candidates – as flawed as they are – have decidedly different ideas about. \\nWe are standing at a moment where we control whether or not the Affordable Care Act (Obamacare) remains a binding law or whether it gets repealed. Make no mistake, Hillary Clinton, if elected, will cement this incredibly unconstitutional law into the very fabric of our country for all-time. The only way Obamacare will be abandoned under a Clinton Administration is in deference to the establishment of a full-blown single-payer health insurance system administered by the Federal Government, i.e. nationalized healthcare. \\nDonald Trump, on the other hand, has made a cornerstone of his campaign the repeal of Obamacare. He has pledged to destroy the artificial barriers in the marketplace – barriers erected by insurance company-friendly politicians – that keep the free market from allowing competition that would dramatically lower premium costs for everyone. This, as a result – through competition in the free market – would make health insurance affordable for all. \\nSo, the choice is abundantly clear – unless you are a Socialist or a Marxist – on who has already earned your vote on the issue of Obamacare. Unless you want your health insurance premiums to rise to unaffordability and the quality of your healthcare to take a downturn to that of a Third World country, you need to cast a vote for Donald Trump so that Hillary Clinton doesn’t make Obamacare permanent. \\nThen there is the matter of the United States Supreme Court. The direction of the nation, with regard to constitutionalism, hangs in the balance this election. With the next President of the United States most likely getting to nominate three, and possibly four, United States Supreme Court justices, we are at a crossroads as to whether we jettison the Constitution completely or return to being a “nation of laws and not of men,” of which John Adams spoke. \\nThe US Supreme Court is seated to protect and defend the US Constitution and the Bill of Rights, exclusively. The justices are tasked with ruling on the constitutionality of law, not on the people effected by that law. As   Bill of Rights were crafted to serve all of the people – regardless of race, creed, gender or economic class – serving the Constitution is, by that very act, serving the people. \\nHillary Clinton, in the last debate, spoke of appointing Supreme Court justices who would be empathetic to the people and their causes. She talked of her selections being mindful of the people in the decisions they would be faced with making. She said she envisions a Supreme Court that “stands up on behalf of women’s rights, on behalf of the rights of the LGBT community, that will stand up and say no to Citizen’s United, a decision that has undermined the election system in our country” and that her nominees would be “in the great tradition of standing up to the powerful, standing up on behalf of our rights as Americans.” \\nBut none of that – none of it – is what the US Supreme Court is supposed to engage in, as duly noted above. Women, the LGBT community, and even the political process are best served when the Constitution is best served and adequately protected. What Hillary Clinton proposed, in her answer, was to establish an activist special-interest Supreme Court bench that serves entities rather than the Constitution, a document that serves everyone equitably and equally when administered as the Framers intended. \\nIn incredible and stark contrast, Donald Trump has pledged to nominate justices to the Supreme Court who would interpret the Constitution “the way the Founders wanted it interpreted.” In that short, simple response Trump said what each and every American should want to hear in an answer to that query. He will appoint justices that will serve and protect the Constitution, returning the Supreme Court to the rule of law. \\nSo, again, unless you are a “social justice” activist with a Fabian Progressive bent, the choice is clear on who should get your vote regarding the issue of the US Supreme Court. Trump wants justices who rule on constitutionality, while Clinton wants justices who rule on a special-interest, social justice agenda. \\nIn the worst case scenario; should Hillary Clinton win on November 8th, we can be guaranteed of two things. First, Obamacare and its never-ending rate hikes – not to mention the Progressive march to a single-payer health insurance system run exclusively by the Federal Government – will be here forever. Second, the US Supreme Court – and the whole of the federal courts beneath it – will be lost to at least one generation (maybe two) of Progressive-Liberalism; codifying countless new “social justice” laws and mandates onto the American people. \\nThese are the issues that consume this election. To wit, this election is an ipso facto referendum on Obamacare and the direction of the US Supreme Court, nothing else; no personalities, no crimes, no sex scandals, nothing else. \\nThis is why there can be no abdication by the American people of their responsibilities to vote. Yes, the candidates may not be the best our nation has to offer, but the issues are more serious than the personality, ethics and knowledge deficits possessed by either. Just because you may hate the choices doesn’t mean the issues become benign. \\nWhile Trump, if he should win, may end up having to surround himself with people more knowledgeable than he on most every matter, that is infinitely better than giving the Oval Office to Hillary Clinton, who has been slated as the “clean-up hitter” in the Progressive fundamental transformation of America. \\nIt is for that reason that sitting this election out – refusing to vote because of the quality, demeanor, ethics or perceived personality deficits of the candidates – is an exercise of abdication of responsibility; to the country, future generations and the US Constitution. In the end, it is the most selfish thing an American can do at this point in American history. shares'"}, "time": 1742561802.346663}