{"duration": 0.19528698921203613, "input_args": {"text": "'3709 Views November 15, 2016 25 Comments SITREPs Scott \\nFirst, I wish to congratulate the president elect of the United States of America, Donald J. Trump. I can only imagine what this gentleman has gone through in this election cycle and this does not address the vitriol poured on his wife and children during the media attack, and that is exactly what it was and is, a concerted and ongoing news media and blog attack on Mr. Trump and his entire family. \\nWith Mr. Trump’s stunning, in view of The Media and the current power structure in USA, victory in the election the taps were opened to maximum output and the vitriol and attacks intensified dramatically. In the words of one commenter I know, with Mr. Trump’s election ‘the light was suddenly turned on in a dirty kitchen and the cockroaches scattered in all directions’. In my opinion that is a pretty good analogy for the cockroaches infesting the government in USA and EU et al are screaming bloody murder and calling Mr. Trump every name in the book and whining about the end of the world as they knew it. That, my friends, is an even better analogy, ‘the end of the world as they knew it’. \\nI’ve been on this rock for a long time. I grew up and was educated in a different time that seems eons from today. I left home the moment I turned eighteen, after all I knew far more about the world and life than that foolish old man who raised me, who kept me fed well and warm in winter and who had no qualms about knocking the puppy snot out of my when I deserved it which was not infrequent. We did not lock our doors when we left home for Church, for shopping and other errands and in fact we did not have a key for the back door. No one in the eighteen years I lived in that farmhouse ever bothered anything. We left the tractors in the fields at day’s end, all of us riding back to the barn on one tractor. No one bothered the machines, no one stole diesel or gas from any of them. Life in USA was different then and that life is well remembered by many Americans. \\nIn the ensuing time since those, in retrospect, peaceful and bucolic years things in US have changed a bit. I was gone for most of those years, returning off and on as was possible. Through the late sixties and through the seventies I was gone enough to see some slight changes whenever I returned but nothing to worry about. The turmoil in DC and the presidency seemed to have no great affect on the lives of most of the populace and the economy was humming along nicely. \\nThe era of the 80’s ushered in the twelve years of Republican dominance in the White House. I was in the same situation, gone most of the time but back just enough to not be worried about the culture and economy of my country, USA. This changed in the nineties and as I began to spend more time ‘home’ I began to see worrying changes in the general populace along the east and west coasts. \\nThe defining occurrence of that era was the (not so) sudden collapse of the Soviet Union, this same Soviet Union that had instituted the Pax Rossiya in all of eastern Europe after the second war which was in essence simply a continuance of the first war, The War to End All Wars. This Pax Rossiya was in many instances brutal especially in the beginning, as the populaces were cleansed of their propensity of joining every foray in to Russia since Napoleon’s time, in the second war sending tens of thousands of willing volunteers to fight The Godless Russians. However, the Soviet Union did give Europe the longest stretch of unbroken peace in European history, from 1945 (technically) through 1990. Yes yes, there were troubles in eastern Germany in the early ’50’s, Hungary in the mid ’50’s and Poland was from time to time a concern but in essence peace reigned regardless of the two armed forces facing each other at the borders, both armed to the teeth with the western forces strongly backed by the US Army and the eastern forces heavily backed and reinforced by the Soviet Army. \\nThrough all those years I believed, I believed in the truth and righteousness of what I was taught at home and school and Church, that America was the shining light, the end all and be all of peace, prosperity and democracy, that the Soviet Union and her people were a massive and deadly threat to everything we believed in and would attack us and conquer us if given half a chance. \\nBut a crack had appeared in that belief in the late 80’s. I began to understand through interaction with these supposedly Godless Communists that some of these people were exactly like me, patriotic and believing in their cause and their country and not a one of them that I met, in peaceful actions or sometimes not so peaceful actions, ever mentioned conquering Europe or destroying America. In actual fact I found them to be as religious as I was and am, they had no ingrained hatred of USA and many of them admired America and Americans as opposed to everything I was taught about these strange people who spoke an incomprehensible language and many of whom took the trouble to learn what was to them an equally incomprehensible language, English. \\nThe crack widened as the wars started again in Europe after the Soviet Union ceased to exist. The breakup of Yugoslavia was the beginning of these wars and they are ongoing. When Hillary Diane Rodham assumed the de facto presidency in 1993 a new agenda was evident both in USA and American interaction with The World. \\nAt the same time American culture and economy, which had slowly begun to decline in the late eighties and early nineties, accelerated that decline and a new phrase, Politically Correct, began to be heard more and more often. I noticed in my increasing returns to US that the things I and my friends used to laugh and joke about were suddenly not allowed. I found that I was supposed to watch what I say and how I spoke, in essence I was supposed to be ‘Politically Correct’ in my speech and actions, that square was round and nothing was black and white, everything was gray. People that I had known for years, the tradesmen and skilled workers who did so well before, were now worried and watching their small businesses and trades decline at ever increasing speed. Ever increasing Government oversight and regulations began to strangle their businesses and trades, backed up with the constant threat of Government action against them if they did not do as told. Do as told? Since when is Washington my/our nanny? \\nDuring her term as president Hillary Diane Rodham put her stamp on Department of State, that entity that to a great extent promulgated US foreign policy. She packed that bureaucracy with her minions and laid the base for power for when she was no longer president. She was appointed Secretary of State in 2009, having spent the previous eight or so years as a senator from New York and working mightily to further infest DoS with her minions. And the wars started. All along the south coast of the Mediterranean Sea starting with the deposing and murder of Qaddafi she worked her magic, attacking Libya, attempting to destroy Egypt, destroying Syria and instrumenting the ongoing mess in Ukraine. \\nUkraine. Herein is the problem concerning me and mine. The coup d’etat in Kiev in February of 2014 was planned and executed by Hillary Diane Rodham. The actual prosecution of that coup d’etat was by the sitting US ambassador to Ukraine, Geoffrey Pyatt, with a great deal of the groundwork performed by the previous ambassador, John Teft (who then was appointed ambassador to Russia where he attempted, and failed, in a plan for ‘regime change’ in Russia). \\nUkraine in and of itself meant and means nothing to Hillary Diane Rodham although I have no doubts she is quite happy to have taken a shot at Russia as a consequence of the coup. The prize for all the turmoil and blood in Kiev was Krimean Peninsula and the crown jewel, Sevastopol. When the citizens of The Autonomous Republic of Krimea and the Federal City of Sevastopol said ‘oh hell no’ to the coup installed Kiev government after some pretty serious threats from same, armed up and closed both the peninsula and City, Clinton’s screams could be heard on Mars. When dual referendums were held in Krimea and Sevastopol as to the future of both entities and the vote was a unanimous decision to ‘leave’ Ukraine her screams were heard light years from our little galaxy. It is my understanding that she was apoplectic when both The Autonomous Republic of Krimea and the Federal City of Sevastopol asked to be and were accepted back in to Russia after the referendums, thereby negating Krushchov’s illegal ‘gift’ of Krimea and Sevastopol to administration of the Ukraine SSR. \\nHer dreams of taking Krimea and Sevastopol, if successful, would have put a massive US Navy base in Sevastopol and turned all of Krimea in to an armed camp with enough missiles to negate a significant portion of Russia’s nuclear deterrent and to put a fair sized portion of Russia in point blank range of US armed forces. All of the sanctions piled on Russia since late March of 2014 are because President V V Putin of Russia, and Krimea and Sevastopol, did not do as she expected and demanded and refused to listen to her. As an aside it’s not too many decades in the past when such an open attack via ‘sanctions’ on a country would have brought a note delivered by the Ambassador of same with a declaration of war. \\nNow we are two years and nine months after the coup in Kiev. The ongoing war, read attempted regime change, in Syria is coming to a head and with Russia invited in to help the legally elected head of Syria the tide is turning to Dr. Assad’s and the Syrian populace’s favor. Any and all actions by the US Military and soldiers therein are illegal and constitute numerous felonies for each and every one of them, private to general, and every politician who has or had anything to do with that effort. I won’t even mention Libya, Tunisia, Egypt, Ukraine, Kosovo and Bosnia and the hundreds of thousands of deaths involved. \\nMr. Trump with his election victory has inherited a seething cauldron of a mess that will make the labors of Hercules seem but a flower pot weeding task in comparison. I have no doubts that he is well aware of the mess he is stepping in to as I have no doubts he will clean at least some of this mess, hence the cockroaches running for cover. Four years will surely not be enough and possibly eight years will not suffice either, but I sincerely wish him the best in his efforts. As for EU, I used to think that Merkel, Golland, Blair et al were in total subservience to US due to secrets Langley knows of them. I no longer think that, I think that all of them were and are more than willing accomplices in the continuous efforts to undermine and destroy Russia, in essence ‘once and for all’. They have failed and their careers are now over as is Hillary Diane Rodham’s career. She will be relegated to the trash heap of history along with the rest of them. \\nAs for me, the facade collapsed long ago. I am well aware of what did happen and what is happening now. I am American and loyal to my America, the America of the times I grew up in, the time when I was proud of America. I have no doubts that with time America will return to what she was and should be and I will be proud of America again. However, I am happy where I live now. We don’t lock our doors when we leave for Church or errands and such. I can and have left our car outside the walls unlocked and no one touched it. This is a Navy town and we are proud of our sailors, and the soldiers and Marines based here. They are in uniform in public always and everywhere. Do you see that in US or Europe today? And the silence here at night and dawn is deafening. That is what is known as ‘peace and calm’. \\nI think the defining moment of my life here, in Russia, was two years ago. I had been to US, not because I wanted to go but because I had to go to take care of some loose ends and it was during that trip that I met Saker face to face. On my return the young Starshi Lutanant in Border Control looked at my US passport and then at my brand new blue Russian Residency passport. He went through every page of the Russian passport and examined my propeeska stamp with a looking glass to make sure it was real and wet stamped. He then smiled, handed both documents back to me and said “Welcome home, (my rank). Enjoy your flight to Sevastopol.” Would that I was welcomed that same way in America when I arrived. I wasn’t. \\nThank you for your time, \\nAuslander \\nAuthor Never The Last One https://www.amazon.com/dp/B00ZGCY8KK \\nAn Incident On Simonka https://www.amazon.com/dp/B01ERKH3IU'"}, "time": 1742562256.243971}