{"duration": 0.1699228286743164, "input_args": {"text": "'SOMERS, Wis.  —   It is the stunning paradox of American politics. In a bitterly divided nation, where Tuesday’s vote once again showed a country almost evenly split between Democrats and Republicans, one party now dominates almost everything in American governance. With Donald J. Trump’s win, Republicans will soon control the White House, both chambers of Congress, the tilt of the Supreme Court, more state legislative chambers than any time in history, and more governor’s offices than they have held in nearly a century. Republican leaders say that shift  —   to a level of   control that some historians said the Republicans have not seen since the 1920s  —   will finally end gridlock in   Washington. They say it will allow the party to charge forward on pledges to change policies on health care, immigration and taxes, and expedite changes that have long been sought in the states. Democrats say the change has the potential to undo years of legislation meant to ensure a more equitable America, upend progress fighting climate change, leave millions stranded without health insurance and usher in harsh laws against immigrants. Experts said that no one thing handed the Republicans so much power, even in places like this that were once reliably blue. The current power balance reflects, among other things, the extraordinary dynamics of a race featuring a   outsider against the first female major party nominee, the vagaries of turnout in a nation where roughly half of registered voters cast ballots, the systematic redrawing of political maps in ways that favored Republicans, and frustration among voters over lost jobs, low wages and the nation’s changing racial and ethnic mix. “That’s just the way it broke,” said Tim Storey, an elections expert at the National Conference of State Legislatures. “Republicans thought they were playing defense, and Democrats thought that it was going to be a good year for them, but Republicans outpaced them and came out as strong as they went in, all across the board. ” At the state level, the outcome means 24 states will be under full Republican control in legislatures and governor’s offices, clearing the way for new policy. Only six states will now have legislatures and governor’s offices exclusively dominated by Democrats, Mr. Storey said. Matt Walter, the president of the Republican State Leadership Committee, said the Republican sweep has been mounting for years, particularly in state legislatures, where Republicans have grown increasingly dominant since 2010. During President Obama’s time in office, Democratic state lawmakers lost more than 800 legislative seats. “The personalities this time were so big and the drama was so big and so rapidly changing and consumed so many people’s attention that it in some respects blinded them to this trend line that this has been bubbling up for many years,” Mr. Walter said. “It really is the manifestation of this change that we’ve been seeing bubbling up from the bottom for many cycles now. ” In theory,   control in a divided nation might spur lawmakers to find bipartisan answers to bipartisan problems. But few people expect that. In Wisconsin, where Republicans took hold of state government years ago though the populace remained somewhat split politically, the political leaders have done the opposite  —   pressing forward with a conservative agenda that has included   measures to reduce labor power, limit abortions and add restrictions on voting that disproportionately affect Democratic constituencies. On Tuesday, Wisconsinites chose a Republican for president, something they had not done since 1984, propelled by worries over the economy and a desire to shake up Washington. Mr. Trump beat Hillary Clinton by about 1 percentage point, or about 27, 000 votes. Some voters here said that they were encouraged by a flip to Republican control of Wisconsin’s Legislature and governor’s office six years ago, and favored Mr. Trump in the hopes that he would deliver more of the same to the nation. “Since 2011, we have made decisions one after another  —   some controversial, many, many bipartisan  —   to move Wisconsin forward,” Robin Vos, the speaker of the State Assembly, said on Wednesday. “And I think that’s the model that we want to use as we go to look at what Washington, D. C. should do. Stick to your principles. Remember the people who actually sent you to get things done. ” Wisconsin’s   switch to Republican control was not without a battle. In 2011, thousands of demonstrators furiously protested efforts to limit labor union power, including sharply cutting collective bargaining rights for most   workers. Gov. Scott Walker soon faced a recall election, which he won. Labor unions shrank significantly in the state, and the Republicans pressed on with other parts of their agenda, including voter ID requirements and redrawing political maps. On Tuesday night, the Wisconsin Legislature remained firmly in the hands of Republicans, including what leaders described as their largest majority in the Assembly since 1956. “The Republicans didn’t work with the Democrats at all,” said Chris Larson, a state senator, who was among a group of Democratic lawmakers who fled to Illinois for weeks in 2011 in an unsuccessful attempt to block passage of the   cuts. “They came in and just did everything as fast as they could. They jammed through everything. And pretty quickly, they had everything they wanted. ” In more than a dozen interviews in Somers, a bedroom community on Lake Michigan dominated by farms, small businesses and a public university, many residents said they were pleasantly surprised to wake up to the news Wednesday morning that their state had flipped from blue to red. They said the deepening conservatism had been years in the making. They had grown discontented with Mr. Obama’s policies, particularly the Affordable Care Act, and were turned off by Mrs. Clinton, whom they saw as untrustworthy. At Tina’s Somers Inn on the village’s main commercial strip, one group of retirees sat at a table playing their regular game of euchre while Fox News was on a nearby television. “We’re still a mix of Democrats and Republicans here  —   I don’t think you could call us a red state,” said Dianne Hegewald, 71. “I have very close friends who are Democrats. But the Republican regime is just doing a better job right now. ” Karen Ashton, the owner of a gift shop in Somers, said she was a registered independent but was eager for Republicans to have full control of all branches of government. “Now they’ll really be able to get things done,” she said. Some of her friends and neighbors in town are farmers who have been hurt by Environmental Protection Agency regulations and high taxes, she said, sipping a kombucha tea. “They’re sick of the government,” she said. “They think that with Trump in there, he can fix all of that. ”   rule can produce results, experts say, and it can also produce changes that will benefit the party in power. Control tends to breed more: Legislators have the ability to redraw political maps in the coming years and establish voting rules that benefit their party. Cooperation between state and federal leaders of a single party can speed along results, from infrastructure projects to federal grants. But there are risks, too. Charging too far too fast can cause blowback as quickly as in elections just two years from now. “There’s always a danger of overreach,” said KC Johnson, a professor of history at Brooklyn College. He noted the Republican dominance in the 1920s, when, he said, a debate over cultural issues tended to overshadow mounting economic questions that eventually culminated in the Great Depression. “The contrast between attention paid to issues that ultimately proved unimportant and attention not paid to issues that became important later on is interesting. We know how the 1920s end,” he said. It is hard to measure control of so many offices with numeric precision, but he said that Democrats had probably last held a level of power similar to what the Republicans have now between 1937 and 1945. “The evidence is mixed on unified government,” said William Howell, a political scientist at the University of Chicago. “There is a fair bit of historical evidence that Congress enacts more laws during periods of unified government. But in this period of slim majorities and rampant obstructionism, past trends may not hold. ” Fred Risser, a Democratic Wisconsin state senator who is the   state lawmaker in the nation, said the stakes of the Republicans’ dominance for the nation’s policy  —   for taxes, education policy, environmental regulation  —   were enormous. Yet Mr. Risser, 89, who first held political office in 1956, said the risks for the Republicans were also large. “They’ve got everything now, and so everything that happens they are responsible for and no one can blame the Democrats anymore. It’s always difficult to control everything. They have a lot to lose. ” Linda Truesdell, whose family has lived in the Somers area since the 1820s, said on Wednesday that she was disheartened by the Republican takeover. She had twice voted for Mr. Obama, who in 2012 beat Mitt Romney by 12 points in this county on Tuesday, Mr. Trump beat Mrs. Clinton here by less than one percentage point  —   225 votes. “Trump was a television personality and that had a big influence on people,” she said, as she left the town post office and walked toward her pickup truck. “People here are thinking that he’s going to solve their problems. ”'"}, "time": 1742562138.4088552}