{"duration": 0.14647650718688965, "input_args": {"text": "'\"A man must keep a little back shop where he can be himself without reserve. In solitude alone can he know true freedom.\" — Michel de Montaigne \\nIf Montaigne is correct, then there are millions of Americans who do not know true freedom. \\nAs reported by The Atlantic on October 19: \"If you’re reading this in the United States, there’s a 50 percent chance that a photo of your face is in at least one database used in police facial-recognition systems.\" \\nDo the math: the collusion of local police and the federal surveillance state has placed greater than 117 million Americans under the never-blinking eye of the government. From the Atlantic article: Police departments in nearly half of U.S. states can use facial-recognition software to compare surveillance images with databases of ID photos or mugshots. Some departments only use facial-recognition to confirm the identity of a suspect who’s been detained; others continuously analyze footage from surveillance cameras to determine exactly who is walking by at any particular moment. \\nOf course, the federal Department of Homeland Security offers billions in taxpayer dollars to local and state law enforcement in the form of grants awarded for the purchase of sophisticated surveillance equipment, including perhaps the most pernicious and potentially threatening to liberty: facial recognition software. \\nFrom license plate readers to facial-recognition software, from surveillance cameras to cellphone signal trackers, the Department of Homeland Security is providing police with all the gadgets, hardware, and software necessary to keep everybody under surveillance, without the targeted public ever realizing that it’s the Capital, not the cops, that are behind the monitoring. \\nThe technology employed in these devices is astonishingly advanced. For example, a facial recognition product in use by social-media giant Facebook — as well as by dozens of law-enforcement agencies nationwide — is so advanced it sounds almost like science fiction: Using a “nine-layer deep neural network,” the software known as DeepFace uses “more than 120 million parameters” to recreate the user’s face and then scans millions of photos to match the face to the person. \\nThe ability of cash-strapped local law-enforcement agencies to deploy such sophisticated software depends on the largesse of the federal DHS. \\nAccording to a report issued by the DHS to Congress, between the fiscal years 2008 and 2014, the DHS doled out more than $9.4 billion in assistance for the fighting of \"terrorism\" at home. How much of this was spent specifically on facial recognition software is not revealed, although as most such purchases are made through grants under the DHS\\'s Law Enforcement Terrorism Prevention Program (LETPP), the report reveals that nearly $3.4 billion was sent from the feds to local law enforcement from 2008-2014. \\nIn the section of the report highlighting the \"successes\" of the LETPP, a state-by-state analysis of how the money is being spent is provided, with nearly every state synopsis containing a mention of the facial recognition \"advancements\" made possible by the DHS. \\nHere\\'s a sample from the digest for how Illinois is spending its federal funds: Operation Virtual Shield (OVS) is a program implemented in the City of Chicago, Illinois, that created the most extensive video surveillance network in the United States by linking more than 3,000 surveillance cameras to a centralized monitoring system that captures and processes camera feeds in real time. It is able to detect suspicious or dangerous activity and identify its location, and now incorporates facial recognition. \\nDid you catch that? Surveillance cameras feed images to an \"extensive video surveillance network\" linking more than \"3,000 surveillance cameras to a centralized monitoring system\" in real time. \\nThanks to Homeland Security and the willingness of state legislators in the Land of Lincoln to surrender their sovereignty (and violate their Article VI oath) in exchange for membership in the massive surveillance system, a network administered by the federal government, citizens of Illinois are now under constant, real-time surveillance by watchers in Washington, D.C. \\nIn a study conducted by Georgetown University and released to the public earlier in October, it was discovered that Of the 52 agencies that acknowledged using face recognition in response to 106 records requests, the authors found that only one had obtained legislative approval before doing so. Government reports have long confirmed that millions of images of citizens are collected and stored in federal face recognition databases. Since at least 2002, civil liberties advocates have raised concerns that millions of drivers license photos of Americans who have never been arrested are being subject to facial searches — a practice that amounts to a perpetual digital lineup. This report augments such fears, demonstrating that at least one in four state or local law enforcement agencies have access to face recognition systems. \\nThe short version of that is that when any American goes in to get a driver\\'s license, the picture taken by the DMV is instantly uploaded to a server owned and operated by the federal government. This creates, as the report describes it, a \"perpetual digital lineup\" of millions of Americans who have never been accused or even suspected of committing a crime, steps essential to the administration of due process, a protection of personal liberty that has been a key part of Anglo-American liberty since the Magna Carta was signed in 1215! \\nNotice, too, that local law enforcement is conducting all this vicarious federal surveillance without any oversight or permission from the elected representatives of the people. In other words, the people have no say in this practice of involuntarily submitting their photos to surveillance databases, thus the practice is not a valid exercise of legislative power, as the only legitimate basis for law is the consent of the governed. \\nIn 1815, Benjamin Constant made a timely and timeless observation about the necessity of due process and its relation to the perpetuation of liberty: However imperfect due process, it has a protective faculty which cannot be removed without destroying it. It is the natural enemy and the unyielding foe of tyranny, whether popular or otherwise. As long as due process subsists, courts will put in despotism\\'s path a resistance, more or less generous, but which always serves to contain it....There is in due process something lofty and unambiguous which forces judges to act respectably and follow a just and orderly course. \\nSadly, this joint venture between the federal government and local law enforcement to deprive all Americans of their precious due process protections is not limited to those two powerful partners. As reported in Time magazine, shopping centers are getting into the unwarranted surveillance game as well, collecting images of shoppers\\' faces and license plates while they visit the mall: \"Homeland Security is working with a number of retailers to test facial recognition software that would flag people with criminal records, ABC News reports. Shopping malls are also testing out software that will scan license plates in the parking lot and notify security if they are registered to anyone on the terrorist watch list.\" \\nWhat is the answer to the rapid expansion of the federal surveillance dragnet and to the disturbing trend among local government and retailers to help pull it into new corners of coverage? \\nAmericans must exercise their natural sovereignty and demand that local law enforcement seek legislative permission before participating in any surveillance program, and the people must hold lawmakers accountable for their adherence to their oaths of office, particularly the part relating to upholding the Constitution.  '"}, "time": 1742561874.6227171}