{"duration": 0.09982609748840332, "input_args": {"text": "'November 14, 2016 - Fort Russ News - \\n\\nFabrizio Poggi, in  Contropiano , translated from Italian by Tom Winter \\n\\nIgor Dodon, President-elect of Moldova \\nMoldova and Bulgaria: Something new in the East \\nRumen Radev, President-elect of Bulgaria \\nIn the east - not everywhere, sadly - there is a turn towards Moscow. The newly elected presidents of Moldavia and Bulgaria seem to want to go in that direction. \\n\\nIn Kishinev, where two weeks ago, no candidate had a majority in round one, the Socialist Party leader, Igor Dodon, has 52.6% of the votes (not including expatriate votes from US and Canada, but these can not overturn the result) against the pro-EU Maia Sandu, leader of the Action and Solidarity Party, with 47.3% and who, in Yankee fashion, is now threatening \"mass demonstrations,\" not recognizing the result. \\nMaia Sandu  Dodon congratulated Sandu for the \"honorable result\" and invited her to discussions, without destabilizing the country. It seems (though not official at this time of writing) that the turnout was respectable; this was the first direct election of the president of the republic since 1996; since 2000 in fact, the President was elected by Parliament. There was even shortage of ballots, in particular in various stations abroad: Bologna, Parma, Paris, Moscow, Bucharest; Portugal appears to have lost the entire st of ballots. \\n\\nOn the eve of the vote Dodon, an experienced office-holder, (Deputy Prime Minister in 2008-2009 and Minister of Economy in 2006-2009) said that if he won, his first visit abroad would would be to Moscow, \"to start working out a strategic partnership agreement\" and to renew exports to Russia, which were limited after the signing of the association and free trade agreement with the EU.  \\n\\nDodon has always said he was \"confident of victory. People are tired of the seven years of EU coalition, poverty, corruption, lawlessness, and want to live in a state of their own and not in some province of another country.\"  \\n\\nThe socialist leader has also called for the Russian peacekeepers to remain in Transnistria, until the complete solution of the political events through the federalization of Moldova, which Sandu opposes. According to Tass, all candidates had based their election campaign primarily on foreign issues: pointing on one side to the \"hand of the Kremlin,\" and, on the other to \"Washington\\'s Regional Committee,\"  a side which was still floating a union with Romania. The Socialists pointed to Maia Sandu as \"a puppet of the US\" - where she studied and worked at the World Bank, and tied her to Angela Merkel, Donald Tusk, and Jean-Claude Juncker, apparently even to former Romanian President, Traian Băsescu, who got himself awarded Moldovan citizenship [! -tr] in order to vote for Maia Sandu.  \\n\\nOn the other side Sandu was proposing, along with strategic partnership with Washington, close contacts with Kiev, even a future union with Romania. \\n\\nAs expected, there are the threats of yet another \"Orange Revolution,\" like the one in 2009 after the Communist Party won the election in Moldova, under the flags of EU and Romania, with rioting which brought broken windows and arson to the Parliament and the presidential residence.  \\n\\nObviously, Brussels was on the \"orange\" side: the results of seven years of EU-line coalition are also seen in the demonstrations a year ago against the oligarchy in power, in the rejection of government policy on the part of 80% of the population, and in those favoring integration with Brussels falling from 70% to 37%.  \\n\\nIn addition, the Donald Trump victory seems to have played a role also in Kishinev: \"The geopolitical color of the Moldovan leadership will become less important for the United States,\" Andrei Popov said in a NewsMaker interview. Popov, former Deputy Foreign Minister of Moldova, added that Washington will renounce a whole series of Moldovan projects that were initiated by the Clinton circle. \\n\\nAlso, in Bulgaria, the coalition headed by the Socialist Party prevailed in the second presidential round of the general election: Air Force General Rumen Radev topped his opponent Tsetska Tsačeva by 4-5% (the result is not final). Tsačeva was the candidate of the pro-government coalition GERB (\"Citizens for European development of Bulgaria).\"  \\n\\nIn the first round, Sunday, Nov. 6, no candidate reached the 30% necessary for the election: Radev was at 25.4% and Tsačeva at 21.9%.  \\n\\nThe now president-elect said he was opposed to Bulgaria\\'s permanence in NATO (of which the country has been a member since 2004) and in the EU, and has spoken out for closer relations with Russia.  \\n\\nThe Prime Minister, the hawk Boyko Borissov had promised to resign if Radev won, while he was still hoping for a Tsačeva victory, seems to have kept his word, opening a crisis that does not seem easy to solve. \\n\\nIn opposition to the overtly anti-Russian, phil-atlantic policies of former President Rosen Plevneliev and Boyko Borissov, Radev said that \"deepening the dialogue with Russia will reduce confrontation and tension, and hopefully lead to the normalization of the situation in Syria and Ukraine.\"  \\n\\nWith regard to the anti-Russian sanctions, he stressed that this \"is a matter of the government\\'s responsibility. But, as President, I am committed to dialogue, to seek a solution with EU colleagues.\" As for internal affairs, he said \"despite threats of the apocalypse,\" the voters \"voted for change and democracy, overcoming apathy and fear.\" \\n\\nAn entity that in contrast does not change policy towards Russia is the European Union.  Federica Mogherini,  EU High Representative for Foreign Affairs, said that Brussels does not intend to change its own position on Russia, even if the White House, after the arrival of Donald Trump, pursues a rapprochement with the Kremlin.  \\n\\nThe EU, as Mogherini spelled it out, \"has a principled stand on the issue of the annexation of the Crimea and on the situation in Ukraine, and will not change it, regardless of any changes of position by other countries, including the United States.  \\n\\n\"Ipse dixit et salvavit eos**; of course, the \"Russian aggression! \\n\\n\\n* A view from the Italian Communist Party on-line journal; for the take of Eduard Popov on these two election victories, click. \\n\\n** \"She herself has said it, and saved them\" [Correcting to \"ipsa\"] -- an apparent reference to the Catholic confessional \"dixi et salvavi animam\" -- I have spoken and saved my soul.\"\\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742564368.5155795}