{"duration": 0.015804767608642578, "input_args": {"text": "'Clemson University Student\\'s Welcome: \\'Ben Shapiro Is A Pig\\' By: Hank Berrien November 1, 2016 \\nApparently word has been passed to leftists that Daily Wire Editor-In Chief Ben Shapiro will be speaking at Clemson University tonight. \"Ben Shapiro Is A Pig\" was chalked in a Clemson classroom this morning. Looks like the SJWs are very excited to hear @benshapiro tonight! pic.twitter.com/hkd3YgIwMn — Caleb Ecarma (@calebecarma) November 1, 2016 \\nThere has been no explanation as to who decorated the chalkboard, nor whether the culprit wanted to issue a more eloquent denunciation of Shapiro but was hindered by the limits of his/her vocabulary, thus being restricted to words of three letters or less. \\nShapiro’s usual denunciation of political correctness is likely the reason for the gratuitous insult; in October 2015, Clemson was plagued by PC when a few students protested Clemson Dining’s \"Maximum Mexican\" night, tweeting their displeasure with such a \"#CUlturallyInsensitive\" event. Clemson senior Austin Pendergist told Campus Reform the post-event uproar was “ridiculous … This is something that Clemson Dining has done for years without any sort of backlash. People love the cultural nights in the dining halls. What\\'s next? Are they going to take away all potato based food as to not offend students from Irish decent? Remove the stir fry station so Asian-American students don\\'t feel as if they are being misrepresented? When does it end?” \\nBut the administration wound up apologizing for the event; Dr. Doug Hallenbeck, Clemson University’s Senior Associate Vice President of Student Affairs, said the event displayed a “flattened cultural view of Mexican culture … It is the mission of University Housing & Dining to create supportive and challenging environments that enrich and nourish lives. We failed to live out our mission yesterday, and we sincerely apologize,” adding that the university “will continue to work closely with [its] food service provider to create dining programs that align with Clemson University’s core values.” \\nThe administration also apologized on the Clemson Dining Services Facebook and Twitter pages. \\nPendergist said the event had only featured “a couple balloons, sombreros, and some tacos,” adding, “For as long as I\\'ve been here, and probably for much longer, Clemson dining has put on certain culinary theme nights, where they decorate the dining halls and serve whatever kind of food. They have Italian night, Mexican night, seafood night, midnight breakfast, all kinds of events.” \\n'"}, "time": 1742628496.9672236}