{"duration": 0.03343915939331055, "input_args": {"text": "'Online voting to choose San Diego’s Major League Soccer (MLS) team currently shows “Footy McFooty Face” leading other possible names by a wide margin. [By Saturday morning, “Footy McFooty Face” had 5, 229 votes, well over four times as many as of the other possible names.  According to 10 News, the other names include “San Diego Bad Hombres,” “San Diego Surf,” “Mission San Diego FC,” “San Diego Football Club (SDFC),” and “San Diego Armada. ” Votes can be cast on SoccerCity SD’s Facebook page. There is precedent for Internet voting to go awry in these kinds of situations. For example, in March 2016 the British government decided to let people vote online to name a $287 million “polar research ship. ” The New York Times reports that people “quickly disregarded the more dignified names suggested by the Natural Environment Research Council,” opting instead for “R. R. S. Boaty McBoatface. ” The Huffington Post reports that Mountain Dew asked internet voters to “Dub the Dew” by choosing a name for a new flavor in 2014. The voting was “hijacked” by 4Chan, and the names with the most votes were “‘Hitler Did Nothing Wrong,’ ‘Diabeetus’ [and] ‘Moist Nugget. ’” The voting to name San Diego’s MLS team ends March 31. SoccerCity SD has not said whether it will use “Footy McFooty Face,” if in fact that name wins the internet poll. Ultimately, the British government decided to name the research vessel the RRS Sir David Attenborough, after a popular host of nature programs. It named a submersible research vehicle Boaty McBoatface instead, in a mild tribute to the results of the original popular vote. AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742563105.0184915}