{"duration": 0.1483912467956543, "input_args": {"text": "'How Russia could revive its ties with Moldova Following the victory of Igor Dodon in Moldovan elections, Moscow has a real chance to boost its relations with the former Soviet republic. However this task is not so easy Following the victory of Igor Dodon in Moldovan elections, Moscow has a real chance to boost its relations with the former Soviet republic. However this task is not so easy. \\n\\nWith 99.9 percent of the votes counted, Igor Dodon, a pro-Russian politician, won 52.3 percent of the vote and secured a clear win in a presidential race in Moldova. ;Photo: AP \\nThe presidential campaign in the Republic of Moldova is now officially over with the second round of elections concluded on Nov. 13. The first round that took place two weeks earlier did not determine a winner but made two political trends evident: The percentage of voters who supported closer ties with Russia and those who supported the EU was more or less equal, and there is demand for a change in Moldova regardless of any foreign policy aspirations.\\nThe main competition took place between  ;pro-Russian candidate Igor Dodon, the leader of the socialist party, and the pro-EU candidate, former Minister of Education (2012-2015) Maia Sandu. As a result of the run-off vote on Nov. 13, Dodon won the presidential seat.\\nThe dominance of the pro-European political groups is now being challenged, as over the course of his campaign Dodon repeatedly called for strengthening ties with Russia, promoting Moldova’s integration with Eurasian projects. He also actively criticized his counterparts for the absence of any visible results of Moldova’s cooperation with the West. He also made promises to visit Moscow first if he gets elected.\\nDoes this mean that Moldova will change or at least make significant corrections to its foreign policy priorities and stop playing the role of a strategic European partner? Can one expect significant developments in resolving the Transnistria conflict?\\nAlso read: \" Revealing the post-Soviet identity complex in Transnistria \" Just a week before the run-off vote, the head of Moldova’s military, Anatol Salaru, stated : “We will request international organizations to pressure Russia to withdraw its forces. We provide all opportunities for that – by sea, land or air.” Will the new president of the Republic follow these plans or dismiss them given the incompatibility of such plans with improving ties with Russia? To what extent is Dodon ready to make concessions to reach a compromise?\\nAgainst the backdrop of Donald Trump’s triumph in the U.S. and the victory of the left forces in Bulgaria, one might consider the victory of Moldovan socialists as another positive external development for Russia. At the same time, it would be too early make any enthusiastic conclusions, first and foremost, because Moldova is a not a republic that has established a strong role for the president.\\nIndeed, Dodon was elected through direct voting – for the first time since 1996 – and the elections themselves took place during a crisis of trust between the public and the government. However, it is not the figure of a specific politician that is significant for the public, but the institution of the presidency itself. The power of the head of state is quite limited by the parliament and the government apparatus. So, he will have to take into account of the views of his opponents unless he establishes a dictatorship, which is quite unlikely.\\nThe electoral divide is also quite important in this situation and Dodon as a pragmatic politician understands this quite well. It is not a coincidence that after the election he spoke about the necessity to work with all politicians given that he is the president of all citizens of Moldova.\\nThose who voted for Sandu criticize the idea of Moldova’s Eurasian integration and argue for the continuation of cooperation with the West. The new head of state will inevitably have to take these views into account while working on specific decisions. He can counter or criticize the Eurocentric position, but he cannot ignore it. Otherwise, he will face mass protests similar to neighboring Ukraine , the experience of which is too recent to forget.\\nSpeaking about Dodon’s foreign policy transformation, one should remember what Moldova went through since the collapse of the Soviet Union. In the post-Soviet period it made steps to balance between Russia and Europe. In 2001 following the wave of disappointment in cooperation with the West, communists led by Vladimir Voronin won power in the country and received a public mandate to establish closer relations with Russia. However, no breakthrough followed.\\nFurthermore, the “Kozak Memorandum” for Transnistrian conflict resolution brought no results and this made Voronin one of the most problematic partners for Russia. [This 2003 memorandum outlined Russia’s proposal for a final settlement of relations between Moldova and Transnistria – Editor’s note] The steps to “reset” relations on the background of pro-European parties’ revival in popularity in 2008-2009 were also unsuccessful. As a result, the coalition of liberals, liberal-democrats and democrats replaced the communists.\\nThis did not bring any significant change to the state of Russia-Moldova relations, which were already at their lowest point. What’s worth noting is that the current winner of the elections - Dodon - worked together with Voronin in the 2000s and even contributed to the introduction of stricter tax rules for Transnistria.\\nIn this regard, it is necessary to understand that opposition rhetoric and policies in practice are not the same. Moscow experienced this difference repeatedly in relations with former Soviet republic . This was the case not only with Voronin, but also with Ukrainian leaders Leonid Kuchma and Viktor Yanukovych as well: Their “pro-Russian rhetoric” during the elections was later replaced by totally different foreign policy decisions. Even Mikheil Saakashvili was seen in 2004 as a politician who could potentially reverse the negative trend emerged during the time of Eduard Shevardnadze. But the reality was totally different.\\nBut does this mean that, based on these lessons, Moscow should play it safe and abstain from believing in the sincerity of Dodon’s proposals? Such stance would be representing another extreme. The fact that the new leader is ready to improve bilateral ties with Russia is very important. These are not just words – the public voted to support this course. It is the citizens of Moldova, not the voters from some unrecognized breakaway republic.\\nYet, it is necessary to avoid inflated expectations in dealing with the new president. One should not believe in miracles and demand him to turn his country into “Belarus-2.” It is important to establish a pragmatic relationship allowing for a gradual strengthening of Russia’s role in Moldova.\\nSpecific projects and deals should be prioritized over diplomatic words and general rhetoric. ;Through these concrete steps the citizens of Moldova, even those who voted for cooperation with Europe, will acknowledge the role of Russia in the development of their country and see cooperation with Russia not only as a Soviet memory but a platform for new opportunities.\\nIn this case, the number of Dodon’s supporters will grow and the demonstration of Russian effectiveness will become a positive factor in Moscow’s relations with other neighboring countries and post-Soviet republics.\\nIn order for this to happen, Russia should avoid the two extremes: inflated expectations from the socialist victory and Moldova’s break-up with the EU, on the one hand, and excessive concerns over the insincerity of the new leader, on the other.\\nThe opinion of the author may not necessarily reflect the position of Russia Direct or its staff. '"}, "time": 1742562331.011169}