{"duration": 0.06337904930114746, "input_args": {"text": "'Posted on April 26, 2016 by Dr. Eowyn | 21 Comments \\nObama recently was in London, lecturing the Brits against Brexit, their upcoming referendum on leaving the European Union, which deservedly got him a stinging rebuke from London mayor Boris Johnson. \\nIn an op/ed for The Sun , Johnson recalls that in 2009 when Obama took over the White House, he removed a bust of Winston Churchill that had been in the Oval Office. Johnson writes: \\n“Some said it was a snub to Britain. Some said it was a symbol of the part-Kenyan President’s ancestral dislike of the British empire – of which Churchill had been such a fervent defender.” \\nBy the way, in 2012 the Obama Administration first denied removing the bust, calling the story “100 per cent false” — that the bust is still in the White House, but simply moved to Obama’s private residence. Later, however, the Obama White House admitted that the Churchill bust in the President’s residence is a different bust, and that the original one had indeed been removed. (Source: Independent ) \\nWhile in London, in a townhall meeting on April 23, the POS also badmouthed North Carolina on barring so-called “transgenders” from using the restroom of their fancy instead of in accordance with their biology. That means, if NC’s lunatic critics have their way, the state will be forced to let fully biological males with a penis to use a girl’s restroom. \\nIn the course of his hectoring on transgenders’ right to use the bathroom of their choice, Obama also extolled same-sex marriage and attributed his change of stance to his daughters, Malia and Sasha. Then he said something very curious. \\nAs reported and transcribed verbatim by The Huffington Post : \\nThe president said that he initially didn’t think the labels for same-sex couples really mattered as long as they had the same rights as heterosexuals. Sasha and Malia helped him see why that wasn’t the case. \\n“I have to confess my children generally had an impact on me ,” he said during a town hall in London. “ People I loved who were in monogamous same-sex relationships explained to me what I should have understood earlier, which is it was not simply about legal rights but about a sense of stigma, that if you’re calling it something different it means that somehow it means less in the eyes of society.” \\nI found the full video of the townhall meeting of hundreds of young “useful idiots” drinking in the POS’s words. This is what Obama said on same-sex marriage, beginning at the 40:13 mark: \\n“On marriage equality, I was in favor of so-called civil unions. My notion was initially that labeling those partnerships as marriage wasn’t necessary as long as people were getting the same rights, and it would disentangle them from some of the religious connotations that marriage had for lots of Americans. And that’s where I think … now, I have to confess, my children generally had an impact on me, people I loved who were in monogamous same-sex relationships explained to me what I should have understood earlier , which is it was not simply about legal rights but about a sense of stigma, that if you’re calling it something different it means that somehow it means less in the eyes of society.” \\nBrian Anderson of DownTrend.com writes: \\nMaybe that’s just the worst segue ever, but right after he says his children helped him on the issue he says these people that he loves were in gay sexual relationships. He doesn’t say his daughters and other people that he loves convinced him to support gay marriage, just that his daughters did. The entire point that he’s trying to make is that Sasha and Malia were the ones that help him arrive at his opinion on the matter. \\nI’ve read that thing a dozen times and I can’t come up with any other interpretation. Obama is saying that his daughters, who are in “monogamous same-sex relationships,” are the ones that convinced him to support same sex marriage. If he was talking about anyone else, he would have put that in, but he didn’t. \\nWhat makes this really disturbing is that Obama changed his position on gay marriage in 2012. Malia would have 14 years old and Sasha only 11 . What we are left with is that Obama is claiming his young daughters, one who was pre-pubescent, were in committed gay sexual relationships. \\nI found photos of Sasha Obama, 14, with a boy , allegedly her date to her high school’s homecoming last October. I could find no reports of Malia, now 17, going on a date or having a boyfriend. \\nH/t FOTM ‘s Glenn47'"}, "time": 1742562677.2818427}