{"duration": 0.11185359954833984, "input_args": {"text": "'Over the last eight years, as cameras have become smaller and smaller  —   tiny enough to fit on a pair of glasses or inside a swallowable pill  —   John Reuter has been working to stave off extinction of one of the largest cameras ever made, so big and irredeemably analog that it feels, he says, “as if we’re pulling oil paintings out of the back of it. ” The camera, the      Polaroid, was born as a kind of industrial stunt. Five of the wooden behemoths, weighing more than 200 pounds each and sitting atop a quartet of gurney wheels, were made in the late 1970s at the request of Edwin H. Land, the company’s founder, to demonstrate the quality of his   film. But the cameras found their true home in the art world, taken up by painters like Chuck Close and Robert Rauschenberg and photographers like William Wegman, David Levinthal and Mary Ellen Mark to make instant images that had the size and presence of sculpture. In 2008, Polaroid, in bankruptcy, stopped producing instant film. Mr. Reuter, who had worked at the company for decades, swooped in with the help of an investor, buying one of the original cameras and hundreds of cases of the remaining film. The dream was to make enough money to be able to recreate the manufacturing process for the film and its unwieldy chemicals and to make more of the big cameras. But in an interview last week, Mr. Reuter said he had finally decided to bow to the inevitable: There will never be a large enough demand for the cameras and he can no longer maintain his quixotic effort to keep them alive. The company he runs, the 20x24 Studio, based in central Massachusetts, plans to close by the end of next year, by which time he hopes that much of the remaining film stock will be used up. “I’ve been doing this for 40 years now, and I understand the importance of the history maybe better than anyone else,” said Mr. Reuter, who is also a photographer and filmmaker. “But there is a time when things have to come to an end. These are not materials that were designed to last indefinitely, and the investment to keep making them would be huge, multimillions. ” News of the wind down has been spreading for several months through the art world, where it has been met more often with disbelief than disappointment. “I haven’t given up,” said Mr. Close, one of the first artists to begin using the camera in the late 1970s to make photographs as both the basis for painted portraits and as works themselves. “Here’s yet another medium that will be lost to history, and it just shouldn’t be allowed to happen. If it does, I don’t know what I’m going to do, to tell you the truth. It’s so integrated into everything I do. I can always imagine what making a painting from one of those pictures will look like. ” Like other artists he knows who have used the camera, he said, its attraction is not just in its size and endearingly oddball personality, like a creature from an obsessive hobbyist’s garage. The immediacy of making the picture, Mr. Close said, changes the relationship between the subject and the artist, who together witness the image come into being after the photograph is pulled from the camera and the chemicals perform their function. “You both work together to get something that you want out of it. Your subject knows what you’re trying to do. ” (He described a 2012 session with President Obama in a hotel room so tiny that the camera and Mr. Close’s wheelchair  —   a   collapse more than two decades ago left him partially paralyzed  —   crowded out the Secret Service.) The filmmaker Errol Morris, who is making a documentary about the photographer Elsa Dorfman  —   besides Mr. Reuter, perhaps the camera’s most devoted partisan  —   said that the camera had become a character in its own right in his film. “It’s an objet d’art, with these wheels like bicycle wheels, this huge box,” he said. “When Elsa pulls the film down from the camera and cuts across it and then the photo is brought over to a table and the cover is peeled back and this image slowly appears, there’s something quite magical about it. ” Mr. Reuter said maintaining that magic has exhausted him and the two people who work with him, Nafis Azad and Ted McLelland. Together, they help operate the cameras, store the photographic paper and assemble the chemical pods, a highly complicated process accomplished with a    machine. With no real publicity operation, the initial financial challenges of the Great Recession and prices he probably set too high, Mr. Reuter said, “the demand for the cameras really just never materialized at the levels that it did during the Polaroid years I think a lot of people had no idea the process was still in existence. ” (The camera costs $1, 750 a day to rent and each exposure costs $125, down from $200 at the company’s beginning.) Though Mr. Close and a handful of other artists, like Peter Tunney and Joyce Tenneson, still use the camera, the death of Ms. Mark last year meant that a consistent financial mainstay  —   and a widely respected ambassador for the camera  —   was gone. “My goal is for people to use the rest of the material we have before all of it is really past its prime,” Mr. Reuter said. “It would be a shame to end that way. ” As for the cameras themselves, he said with resignation, “I hope that they go to some place like the Smithsonian or the George Eastman collection in Rochester. ” Mr. Morris, known for his own love of rapidly rarefying film stocks like 35 millimeter and Super 8, said he continued to believe that the cameras would not end up as museum pieces. “Maybe there won’t be many  —   and maybe there will be a time when the process goes out of existence for a while  —   but I think there will be people who won’t let it go away forever. ”'"}, "time": 1742563240.7478118}