{"duration": 0.07890772819519043, "input_args": {"text": "'  Donald J. Trump has vowed to dismantle many of the signature policies put in place by the Obama administration to fight the effects of climate change. During the campaign, he threatened, among other things, to kill the Clean Power Plan, a set of rules to reduce emissions from power plants. He has also taken aim at new regulations to limit methane leaks from wells and pipelines. And members of his transition team have suggested that he may reduce or eliminate basic climate research at NASA or other agencies. If he follows through, most of these moves will be opposed by environmental groups, by Democrats in Congress and perhaps even by some Republicans. But Mr. Trump will have several tools to begin nullifying the Obama climate agenda. One of them is the   Office of Information and Regulatory Affairs, a small outpost within the executive branch that has, since the Clinton administration, been the last stop for many regulations before they go into effect. Lawyers in the office pore over thousands of pages of federal regulations daily and pride themselves on meticulously reviewing the fine print, even if that takes months or years. Under the control of the new administration, the office could slow President Obama’s latest regulatory initiatives by repeatedly sending them back for additional work. “It has been a brake on agency regulation throughout its lifetime,” said Jody Freeman, a professor at Harvard Law School and an expert on environmental regulation. “Some presidents have used it as more of a brake than others. ” Much remains to be learned about the  ’s environmental policy goals, and some of his views appear to have shifted. Mr. Trump, who has claimed that global warming is a hoax, said this week in an interview with The New York Times that he now saw “some connectivity” between humans and climate change, and that he would “keep an open mind” about whether to pull out of the Paris climate accord, as he threatened to do during the campaign. Yet at the same time, some key positions on his transition team are occupied by people with a long history of rejecting the overwhelming scientific consensus on climate change. Other than climate change, there are numerous environmental issues that he has never talked about and that he might be content to leave untouched. And once agency heads are in place, they may choose very different tactics from those discussed during Mr. Trump’s campaign or by his advisers. Two people considered to be in the running to head the Environmental Protection Agency  —   Jeffrey R. Holmstead, an energy lobbyist, and Robert E. Grady, a venture capitalist  —   also have experience in the complex machinations of the federal government. “Every new administration comes in with an overestimation of what it can accomplish and how quickly it can accomplish it,” said Kevin Ewing, a partner at Bracewell, a Washington law firm. If Mr. Trump does decide to withdraw from the Paris agreement, he will find it difficult: The accord went into force this month. He would also encounter tremendous obstacles were he to try to dismantle the E. P. A. another campaign threat. But he may have an easier time abandoning other climate initiatives, including a United   program to reduce the environmental impact of international air travel beginning in 2020. The United States has only informally committed to participate in the program, and the new administration could refuse to make that commitment legally binding. One of the most powerful methods to hobble Mr. Obama’s domestic environmental initiatives would be to block financing for the E. P. A. and other agencies. “Congress can always pass an appropriations rider that for one year prevents any funding for the implementation or enforcement of a particular regulation,” said Scott H. Segal, a partner and director of the policy resolution group at Bracewell. Riders can be passed year after year, effectively neutering a specific regulation, Mr. Segal said. Such an approach can be “stealthier” than trying to undo the regulation itself, Professor Freeman said. “You don’t have to repeal these statutes,” she said. “You just have to make it impossible to implement them. ” Another opening for Mr. Trump lies in regulations that were proposed by the Obama administration but are still technically “in motion. ” In theory, he could pull back or block these rules. But a departing administration can also use a regulation’s “in motion” status to its own advantage. Last week, the Obama administration banned drilling in the Alaskan Arctic under the Interior Department’s proposed   plan regulating oil and gas leases. Republicans could kill the plan. But to do so would mean crafting a replacement, a process that could take two years or more. Last week, the White House unveiled a sweeping plan to try to stiffen environmental regulations before Mr. Obama leaves office. Environmental groups can be expected to fight any efforts to undo them. “Donald Trump can’t just snap his fingers and change climate policy,” said David Goldston, director of government affairs at the Natural Resources Defense Council. “We have ways to thwart him in Congress and the courts that we could employ. ” The approach the Trump administration takes will depend in part on the status of specific rules and regulations. Some environmental policies  —   like “guidance” issued by the White House earlier this year, instructing agencies to consider the effects of climate change when conducting environmental reviews  —   do not have the force of law that agency regulations do, and can be abolished with a pen stroke. Undoing a regulation is more complicated. Some of the E. P. A. ’s new methane rules are completed, for example, but other rules, both at the E. P. A. and at the Interior Department, are not and can simply be abandoned. If a rule is final, the options are different. The new administration cannot just rescind these regulations, but it can order agencies to revisit them. That reopens the   process, however, including the opportunity for public comment. Any revisions or replacement regulations must have a basis in facts and a   analysis, not politics or ideology. There are other potential options for specific regulations. The Clean Power Plan, for instance, is completed but not yet in effect because of a judicial stay imposed while legal action against it plays out in a federal appeals court in Washington. If there is no ruling by Inauguration Day, Jan. 20, Mr. Trump’s Justice Department can ask the court to put the case in abeyance, effectively extending the stay indefinitely. “In some respects, this is in the Department of Justice’s hands,” said Tom Lorenzen, a lawyer at Crowell  Moring who argued against the plan before the appeals court. “They will make a determination of how they want to proceed. ” Mr. Segal said the Republican Congress might also be able to overturn some recently completed regulations under a law that gives both houses up to 60 legislative days to reject them. That law, the Congressional Review Act, usually comes into play only when the party of the incoming president is different from the departing one’s and the same party controls both houses, as is the case now. William K. Reilly, a Republican who was E. P. A. administrator under President George Bush, said Mr. Trump needed to be careful about whom he picked for the top jobs in each department. He cited the Reagan administration’s experience with Anne Gorsuch, who incurred the wrath of politicians of both parties when, as administrator of the E. P. A. she cut the agency’s budget by more than 20 percent, gutting research and regulatory enforcement. She resigned under fire in 1983 in the midst of accusations that she had mismanaged a hazardous waste cleanup program. “The administration got badly burned by discounting the sensitivities and public support for what the E. P. A. protects us from,” Mr. Reilly said. “It’s a public health agency above all. ”'"}, "time": 1742628573.2997622}