{"duration": 0.11318516731262207, "input_args": {"text": "'( D. Ross Cameron / AP ) \\nLet’s all give thanks to Truthdig for enlightening us about the political views of Josh Fox, environmental activist and filmmaker. When Fox was asked in a filmed interview with Truthdig to give his view of presidential nominee Jill Stein and the Green Party, he said: \\nI’m sorry. It’s immoral what she’s doing. And I don’t care if I say this on air for the very first time—I spent eight years building the environmental movement, I spent eight years coast-to-coast building the [anti-]fracking movement, I went to 250 cities. I did not see the Green Party having a significant hand in the building of that movement. \\nFox is still blaming activist Ralph Nader for Democratic presidential nominee Al Gore’s loss to Republican George W. Bush in 2000. No matter how often people like Fox get the math and history wrong, they continue to take the easy exit from reality. They always seem to forget that Gore was a lousy candidate who did not even win his own home state, despite all the deep funds of his chosen corporate party. If they really cared about a strong foundation for democracy, the partisan Democrats would campaign in earnest for public financing of elections and ranked choice voting . The latter reform alone would take away the argument that opposition parties and candidates are simply “spoilers” of elections. \\nAdvertisement Square, Site wide \\nFox claims to make a realistic case for “strategy,” but he is only repeating the talking points of the career politicians and hired apparatchiks of the Democratic Party—including the “news” from sites such as The Daily Beast claiming that Stein’s portfolio is tainted by the circulation of capital in oil and other capitalist industries. \\nIn arguing against the purity of the Greens—which is, after all, very easily proved—Fox ends up arguing for an absurd standard of political morality. By such a standard, all of us must first become saints or professional revolutionaries before opposing the anti-democratic corporate parties. Stein, like many people, is looking for ethical ways to save and invest money. She is certainly upper-middle class, and in global terms decidedly among the rich. But by ruling-class ranking she does not rank at all. Money remains money and does not circulate simply by the dictates of our wills. \\nBy the very standard of choosing “the lesser of two evils,” which Fox otherwise insists is the decisive choice between presidential nominees Donald Trump and Hillary Clinton, we might also choose to compare the wealth and portfolio of Stein with the Clintons’—including the “philanthropic” Clinton Foundation. Or is this comparison ruled out of order if we refuse to vote for the candidate (and party) of Fox’s choice? \\nFox also claims the Green Party only “shows up every four years” to run a presidential campaign, without building the base and winning local offices in the meantime. False, as the public record shows. But it is surely true that the Greens can’t compete fairly in big elections without a fair share of federal funds, so gaining the threshold 5 percent of votes in the general election would be a net gain for liberty and democracy. Fox sees that percentage result only as a gift to Trump in this election, and thus argues in effect that democracy is too dangerous if we must count votes against both Republicans and Democrats. He takes no responsibility for the downward spiral of retrograde bipartisan candidates in every presidential election, though the party of his choice is one of the big reasons for the erosion of voter turnout. [Editor’s note: Jill Stein writes: “Just 5 percent of the national vote for the Green Party Stein/Baraka ticket can be a true game-changer for American politics. It will qualify the Green Party for recognition as an official national party, and for federal funding in the 2020 presidential race proportional to the amount of votes received—at least $8 million to $10 million. It would also secure ballot access in a number of states that automatically grant ballot status if the presidential candidate receives anywhere from 1 percent to 5 percent of the vote (varying by state).”] \\nActivists in the Green Party have been in the trenches of environmental struggles far longer than the “eight years” Fox spent in the anti-fracking movement. So if Fox is not aware of Green organizers and activists, either he is genuinely ignorant or he is a partisan propagandist. \\nFox’s alliance with Our Revolution, Bernie Sanders’ new movement, means he followed Sanders right back into the Democratic Party. Despite all of the friendly attempts by Stein to communicate directly with the Sanders camp, he chose not to cross a public and open bridge of communication. And indeed, though Stein and Sanders agree on many issues, an abiding contradiction separates the Green Party from the Democratic Party. As Stein has noted, you can’t advance a political revolution within a counterrevolutionary party . \\nFox says he’d be glad to support various local Green candidates, but he calls Stein “immoral” for daring to run as a Green presidential candidate. In fact, a presidential campaign is one way to raise funds and awareness of the state and local Green candidates Fox claims he would like to support. Fox is in no position to be giving “strategic” advice to the Green Party, since he is not yet ready to make both a moral and strategic break from the Democratic Party. \\nThe Green New Deal is a practical program for peace, economic democracy and ecological sanity. A political revolution begins, morally and strategically, with the power of we, the people. Every day of our lives. Including election days. TAGS:'"}, "time": 1742563409.5048866}