{"duration": 0.11204051971435547, "input_args": {"text": "\"The colonialism of the United States rears its ugly head as Dakota Access pushes forward with its construction of an oil pipeline on indigenous land, forcing Native Americans to setup camps and engage in resistance to protect their very way of life from pollution. In defense of Dakota Access’s land grab, the police deploy militarized equipment, including tank vehicles, to brutally disperse and round up water protectors. The people taking a stand are shipped to facilities throughout the North Dakota, and some even report numbers were written on their arm before they were put in dog kennels.\\nThis is the backdrop for which Americans can appreciate Inuit throat singer Tanya Tagaq, who was born in Iqaluktuutiaq in Nunavut, Canada. She is a strong indigenous voice, who stands with the indigenous people of Canada in their struggles, including against extraction companies. And her new album, “Retribution,” confronts the pillaging and plundering of the Earth quite boldly.\\nAs Tagaq told the Canadian magazine, “Exclaim!”, “There’s a general feeling of hurting the Earth and destroying the landscape and destroying ourselves, and that evil, non-consensual land grab, the take, the take. The rape of the land. The rape of residential schools, the non-consensual taking and where that originates from. It’s all united.”\\nThe 7-minute track, “Retribution,” is a warning to humanity that there are consequences for our non-consensual relationship with the Earth. She says in the intro, “Our mother grows angry. Retribution will be swift.” \\n“We squander her soil and suck out her sweet black blood to burn it,” Tagaq adds. “We turn money into God and salivate over opportunities to crumple and crinkle our souls for that paper, that gold.” \\nShe surmises. Humanity invests its time into “hollowing philosophies” in order to “placate the fear of our bodies returning back into our mother.” We collectively fear our own mortality. \\n“The path we have taken has rotted,” Tagaq further warns. “Ignite, stand upright, conduct yourself like lightning because the retribution will be swift.” \\nTagaq’s introduction gives way to a cacophonous symphony paired with the wordless exhortations that define her music. Her screams for Mother Earth carry a foreboding element, like there is nothing humans can do if we refuse to address our rotten relationship with the planet. What goes around comes around, and we should prepare for the natural disasters, for the drought, for the famine, and for whatever other hardships may lie ahead as Mother Earth responds to our abusive treatment of her.\\nThrough “Retribution,” Tagaq expands the concept of rape culture to include the exploitation of the environment along with the rape and abuse of women. It is all connected because it implicates a patriarchal society incapable of respecting life. \\n“For many years, my whole shtick was trying to spread awareness for indigenous rights and human rights, but when I was younger, people would just roll their eyes,” Tagaq told “Exclaim!”. “So I [started] doing this wordless performance, to have people understand what it felt like to be an indigenous woman. And it worked! People were leaving thinking, ‘Why am I feeling this? What’s resonating within me?'”\\nIndeed, the essence of her throat singing is a swirl of torment and desire to keep one’s soul clean in the face of a world that renders so much that is pure and good dirty. It represents the imbalance in our give and take. We cannot continue to take without giving because at a certain point, Mother Earth will have nothing left to give. \\nIn an article from CBC, she is quoted, “Enough of hurting the planet. Enough of the judicial system that has allowed this and enough of the government taking, taking, taking and not giving out the education it owes to Canadian citizens. Canadian citizens deserve to be taught our history and why things are the way they are.”\\nOne one hand, Tagaq’s powerful music is brilliant because it pushes the boundaries of artistic expression. On the other hand, integral to its power is ugly truths that are not only relevant to Canada or the United States but to much of the world that is not far removed from perpetual climate calamity. \\nListen to “Retribution”: \\n\\nThe post Protest Song Of The Week: ‘Retribution’ by Tanya Tagaq appeared first on Shadowproof .\\n\""}, "time": 1742561850.4944806}