{"duration": 0.07038307189941406, "input_args": {"text": "'As Black History Month commemorations start to wind down, one festival is just gearing up. Afropunk the Takeover  —   Harlem, running from Tuesday through Feb. 25, will celebrate black culture with music, art, film screenings, discussions and comedy.   by Harlem Stage and the Apollo Theater, this series is the latest offering from Afropunk, which hosts a music festival in Brooklyn. While music is an integral part of this Harlem festival, a couple of its more   events focus on activism  —   from art in response to current events to the expression of black joy  —   which is especially resonant in this moment of racial division and continued protests against the Trump administration. “Bearing Witness as Protest,” at the Studio Museum in Harlem on Thursday, will examine political dissent in art. The evening begins with a guided tour of two exhibitions: “The Window and the Breaking of the Window,” with art from the Black Lives Matter era, and “Circa 1970,” whose focus is on the sociopolitical and cultural issues of the ’70s. The shows further affirm that, in the age of the   news cycle and endless social media feeds, there’s no escape from news of horrific acts of hate, social injustices and inequalities. Works by Rudy Shepherd depict the nine parishioners killed in a Charleston, S. C. church in 2015, and others evoke the “hands up, don’t shoot” rallying cry for protesters in the aftermath of a fatal police shooting in Ferguson, Mo. “It’s a difficult show, and I think some people might be moved by some of the images,” Amanda Hunt, associate curator at the museum, said last week. “They might be saddened and I wanted to give space for all of that. ” Deborah Grant’s “56 Blows,” from her “Blackboard” series, initially looks simplistic  —   the outline of a camcorder drawn in white chalk on a black background underneath is the title rendered in block letters. The title is a haunting nod to the 56 blows inflicted on Rodney King by the Los Angeles police in 1991 the camcorder a reminder of the documentation of the violence. In “A Beautiful Ghetto,” Devin Allen’s    photographs chronicle the response of black residents in Baltimore to such violence  —   like Freddie Gray’s death in police custody. Tying it all together are Kerry James Marshall’s prints echoing slogans that blacks have used to organize, resist and uplift (“by any means necessary,” “black is beautiful”)  —   reminders that the black experience is as much about having pride as exposing social inequities. The tour, starting at 6 p. m. will be followed by a discussion focusing on what it means to bear witness  —   to share traumatic experiences  —   and how the act itself might be a form of protest. The artist Oasa DuVerney and Jess Krug of Harlem CopWatch, a coalition documenting the police’s interactions with the public, will participate. While the Studio Museum will tackle activism through a creative lens, a discussion on Tuesday at the National Black Theater will ask panelists to look inward to ponder the emotional expressions of resistance. The aim of “Black Joy as an Expression of Resistance and Liberation” is to shine a light on the importance of cultivating and seeking out diverse narratives of black lives and opposing stereotypical depictions that pop up across the media. The panelists  —   including the actress Zoë Kravitz, Larry   of ARTNOIR and the Afropunk founder, Matthew Morgan  —   will also discuss the importance of caring for oneself as well as those in your circle of friends and family. “Black joy is really that pursuit of healing all of those wounds,” Sade Lythcott, chief executive of the National Black Theater and a panelist, said in a telephone interview. “When the pendulum swings so far to one side where there is this epidemic of trauma being displayed as entertainment,” she said of videos depicting interactions between the police and black people, “artists are always going to rise up” as a means of both documentation and catharsis. André D. Singleton, a   of the Very Black Project, which celebrates black culture through apparel among other things, and moderator of the “Black Joy” event, said in a phone interview that delving into “the places we don’t want to go, the stewing, actually allowing ourselves to feel,” is imperative to moving forward. “I grew up in the church, and I was taught that happiness is fleeting and joy is something the world can’t take away,” he said, reflecting on the Maze and Frankie Beverly song “Joy and Pain,” which perhaps describes the balance between the two. Here are a few events to check out:  FEB. 24 AT 6:30 P. M. A screening of “The Talk  —   Race in America” at the Cinema at the Maysles Documentary Center. FEB. 24 AT 7:30 P. M. “The Hair Tales,” a discussion about black hair culture, at Harlem Stage. FEB. 25 AT 7:30 P. M. Afropunk: “Unapologetically Black,” a homage to black protest music featuring Robert Glasper and others, at the Apollo Theater.'"}, "time": 1742562052.338763}