{"duration": 0.05953407287597656, "input_args": {"text": "'October 28, 2016 \\nA row has broken out over a review of Ken Loach’s new film, “I, Daniel Blake” with several benefit claimants refusing to believe that its author, Toby Young, could possibly have happened. Young’s review in The Mail, in which he described Loach’s representation of common DWP practices such as delaying appeals and giving out benefit sanctions for minor errors as “far fetched”, was met with anger and incredulity in online forums. However, many of the claimants who were involved in researching the film have simply denied that Young was even real. \\nSaid Sarah, 41, who claims ESA for chronic Parkinson’s and has been forced to make several appeals, “Toby Young simply doesn’t ring true. We’re meant to believe that he’s a journalist, but he’s more of a lefty’s version of what a Daily Mail reviewer ought to be like. Where is the research, the information? I can’t really believe that journalism’s that bad, it just isn’t credible.” Jack, 47, who has been sanctioned twice on JSA, was more forthright: “This is a fraud. Everyone knows that it’s easy to impersonate a journalist and the idea that this so-called “Toby Young”, if that is what he’s really called, bears any resemblance to how things are on the ground is simply ludicrous”. \\nThe Daily Mail have hit back, saying Toby Young was “the genuine article” and that “if we didn’t give an outlet to marginalised Oxbridge graduates with appalling senses of entitlement, then there was a real danger that their voices might be drowned out by the cries of the needy and the vulnerable”. Mental health campaigners have also responded angrily, saying that Young was “clearly delusional”, needing “help rather than disbelief”. The DWP have refused to get involved in the row and, when asked to comment, a spokesman merely spat on the ground and gave me a piecing stare. andyiong'"}, "time": 1742563267.625394}