{"duration": 0.2685732841491699, "input_args": {"text": "'  How Population Growth, Industrial Agriculture And Environmental Pollution May Have Weakened Society How Population Growth, Industrial Agriculture And Environmental Pollution May Have Weakened Society \\nA determined young man with a strong sense of his destiny - to save his country from postmodern collapse. October 30, 2016 Culture \\nThe global population in 1800 was about one billion people. Today it stands at over seven times that amount, with the rapidly growing populations of India and Africa expected to increase that to at least nine billion over the coming years. Readers today are well used to the idea that the “global south” is densely populated relative to its economic size and area, but this was not always the case. Prior to the collapse of Empire, Europe, having undergone thorough industrialization, was the most densely populated continent in the world. Source: “The World at Six Billion”, United Nations, 1999.1950-2100 – UN, Dept. of Economic and Social Affairs, Population Division (2011) \\nEurope was also where the world’s social justice movements—liberalism, communism and feminism—began, overthrowing the old order of kings, castes and courtship with the vulgar and degenerate world we suffer today. But why did this happen? Why did the immense increase of wealth and prosperity not correspond to an increase of human happiness, but instead lead to the emasculation of men, the breakdown of the family, and the disappearance of religion and morality? \\nIn these series of articles, I examine the root causes of this paradox, what one can do about it on an individual dietary level, and what one can do about it on an individual environmental level. I am a strong believer in social change through individual growth, and, having experienced a dramatic turnaround in the quality of my own personality and success of my outcomes as a result of following these strategies, I hope that others can benefit from my knowledge, and similarly make themselves into solid Men. Popular mainstream theories for social degeneration \\nMany authors have postulated economic reasons for this degeneration—industrialization, having deprived men of their primary roles as the masters of nature, reduced their worth and attractiveness—or utility—in the eyes of women. Relatedly, others argue that technological progress, which increased independence and ability for all, allowed women to go their own way. \\nAnother popular argument is that increased prosperity leads to reduced incentive for discipline—r-selection versus K-selection—and so prosperous, disciplined societies create a generation of lazy youngsters, fat off the success of their parents, who cause so much havoc with their short sighted policies that their civilization collapses, leading to a new generation of disciplined youngsters who again create greatness. One example of a short-sighted policy would be the feminist political movement, which artificially separated woman from man by giving her, through affirmative action, socially harmful economic independence. \\nWhile all these explanations bear some truth, none of them delve into the deeply emotional, spiritual, human and thus fundamentally biological causes of social degeneration. Why the mainstream theories are flawed \\nTo begin with, a healthy Man and a healthy woman, even with modern technology at their disposal, should not so substantially less love and cherish each other, as seems to be the case today. The proof of this can be seen by examining what it is women do with that technology: a modern loose woman uses technology to go to places where men can ravish her. Even if it gives woman the ability to go it alone, Technology does not diminish her emotional and biological need for man. \\nFurther, the availability of technology does not always translate into its adoption—the failure of Google Glass is the emblematic example. It does not have to be the case that smartphones are automatically adopted for Slut Culture—they do not have to automatically lead to female promiscuity. Anyone familiar with Russian or Japanese women, who have the same technology at hand, but a vastly greater sense of restraint and self-worth, can attest to this fact. Therefore, the technological argument is not sufficient to explain modern degeneracy, although it is certainly a necessary condition. credit: Ninaras credit: moguphotos \\nTo briefly examine the argument that Men no longer have (non-financial) utility in the eyes of women: a man is not necessarily attractive to a woman if he actually breaks rocks, or actually kills other people—instead, being able to is sufficient. \\nTherefore, the emotional and spiritual inseparability of a healthy woman from her evolved master, man, remains and will remain eternally true. The change in technology and the nature of men’s work is not the causal factor—instead, the change in preferences of both men and women explains modern degeneracy. Men hardly today want to lead and possess their woman; and women do not respond to weakling men. \\nLet us examine the r/K selection argument: if it were the case that wealth and ease begat indiscipline automatically, it would be true that the rich produce weak and undisciplined progeny. This may seem like a truism today, viewed through the lens of the post-industrial, overpopulated Paris Hilton West, but in societies of the past, it was certainly not the case—rather, historically, the opposite has been true: the weak were poor because they were undisciplined, and the strong were rich because they were disciplined. The poor raised weak and hence undisciplined children, while the rich raised strong and disciplined ones, so the cycle continued and over time aristocracies formed. \\nAn extreme version of this disciplined-rich mentality can be seen in modern British farmers, many of whom, financially wealthy and prosperous, drive old, beaten SUVs, reuse clothes and generally minimize expenditures. While it cannot be denied that even the modern rich have in general become mostly degenerate, this is, in my opinion, a (disproportionately visible) symptom of a deeper malaise that affects society across the board. \\nTherefore, I do not rely on the technological or economic explanations for societal degeneration-I view these theories as descriptive of passing symptoms or trends, and not timelessly causal truths.int The population growth, nutritional depletion and environmental pollution theory of societal degeneration \\nHaving outlined and accounted for the above theories, I argue instead that the degeneration of society is caused mostly by the biological degeneration of the human being that makes up the society. This degeneration is caused by factors that affect the human organism on the basest level, and the two primary factors are: Nutritional depletion of food, caused by the growth of industrial agriculture, which itself is made necessary by unprecedented population growth. The pollution of the environment caused by industry and the introduction of unsafe technology. \\nAccording to this view, it was not the Boomers’ access to ease that made them such degenerate and irresponsible scum, but rather the fact that the rapid population increase during their key developmental years meant that the growth of industrial agriculture that somewhat necessarily accompanied it—the Green revolution—created such nutritionally sparse food that there was insufficient development of Boomers’ brains, leading to a generation of overgrown children. \\nFurther, according to this theory, the increased dependence on technology is not viewed as the cause of millennial autism, but rather a symptom of millennial autism. Recent historical examples \\nConsider the historical path of Communism, which did not generally spring up in the villages. This was not because the landlords were better able to control the peasants, but instead because poor city dwellers, even if earning a higher income than poor peasants, had access to much worse food and lived in a far dirtier environment, making them both mentally and physically ill. The unfortunate result of insufficient mental development in a crisis situation – our aim should be to save as many leftists as possible, and almost all can be. \\nThe poor in the countryside today continue to vote conservative or liberal, while the urban poor vote socialist, for this same reason: the rural poor, despite usually being less wealthy than the urban poor, are intellectually mature enough to see how harmful a controlling government can be. The urban poor mostly achieve the intellectual maturity of children or adolescents, and mostly feel rather than think, so they support an emotion-based class war or gender war ideology. \\nThis theory explains the early rise of social justice in Europe, where industrial agriculture was first adopted on a wide scale, and also explains why such movements did not organically grow anywhere else until much later, owing to the much later adoption of industrial agriculture. It should be noted that in the countries where communist revolutions were actually successful, they enjoyed no broad support, but instead were able to defeat the mostly pre-industrial historical governments because of these governments’ economic weakness, and also because of extensive support by globalist or communist interests (this was true in Russia, China and Cambodia). Ancient historical examples \\nThis theory also explains the path of historical civilizations—Rome’s case is highly instructive. At its birth Rome was a small collection of largely self-sufficient, highly disciplined towns, where the diet, like in many towns of that era, was a mixture of grains, vegetables, small farmed meats (like chickens), and hunted meats—what we would call a balanced diet. In this society, men were the masters of their households, with power of life and death over their family members, while facing total responsibility for their family members’ behaviour. Only a group of strong, capable and self-disciplined individuals could sustain such a social order. Population of the City of Rome; 1.0E6 = 1 Million Inhabitants – Source: www.davidgalbraith.org \\nRome’s extreme martial and social discipline led to expansion. As it expanded and the city’s population grew, the diet for most people changed over time to mostly grains farmed highly intensively, shipped in from all over the Empire, losing a lot of its nutrition on the way. Simultaneously, and partly as a result of rising grain production, meat consumption fell, reducing the population’s testosterone levels, leading to falling strength and willingness or ability to compete, as well as rising mental illness because of copper overload. \\nThe weakened population’s increasing demands for emotion based socialism led to the growth of a massive welfare state, and eventual bankruptcy, hyperinflation and collapse of the central government. \\nIndia is another equally tragic example. The population growth that resulted from highly prosperous Nanda rule led to the growth of Buddhism and the adoption of degenerate attitudes, moral collapse and eventually weakness to invasion. After the institutionalization of Buddhism by power-hungry and utterly Machiavellian psychopath Ashoka—who looked to weaken the Brahmins, Hinduism’s traditional moral guides—Buddhism’s degenerate vegetarian curse spread like a virus, and created, over several generations, a population of weaklings, who weren’t again able to assert their independence for over a thousand years. The Song dynasty followed a similar path as these two empires, being eventually overrun by the Mongols (the Yuan dynasty). Population of China – Source: Vaclab Smil, China’s Environmental Crisis (1993) \\nThis degradation of the diet, caused by population growth, has been, at least, a significant causal element behind the degeneracy and collapse of most prosperous sedentary civilizations. The modern context \\nThe dramatic increase of the population since ancient times should help you understand why humans today are such fools and weaklings compared to our ancestors. There is only so much nutrition in the world’s topsoil to go around, and a population seven times greater than 200 years ago, eating a diet uncorrected (through nutritional supplementation) for dietary sparsity, will be living individually, in effect, 1/7 th the life that its ancestor population did. Is it any wonder that people today feel so weak and helpless that they want mommy government and daddy police state to give them the illusion of comfort and security? \\nThis theory is also borne out in the data: in general, food today contains ½ to 1/10 th the nutrients it did in the 1930s, which was already about 50 years after the adoption of modern style industrial agriculture in the West. This dramatic fall in nutrition has accompanied the tripling of the global population, and close-to doubling of the European population, since that time. While some population control seems necessary, I believe that sustainable organic agriculture, combined with nutritional supplementation, should obviate a large amount of needed population reduction. \\nI hope that the reader is, after consideration of these facts, sufficiently convinced of the true causes behind the modern world’s degeneracy. People have, fairly universally, across the political spectrum, become weak and insane from malnutrition. Artificial protein may have allowed some men to grow muscles, and calcium from an (over-)reliance on milk may have allowed them to grow tall, but perhaps the lack of most necessary nutrients has meant that they are generally still retarded, emotionally, spiritually, and intellectually. The effects on modern society \\nThis weakness amongst men—and dietary sparsity has disproportionately affected men, due to our much greater nutritional requirements—has not just resulted in an inability to control the destructive forces that lie latent in every society. Worse, the fundamental outlook of men, who viewed themselves as the creators of civilization, the slayers of enemies and the protectors of women, all under God, has changed. The modern millennial man is a childlike hedonist who cares little for his civilization, culture or People. An aspiring patriarch. An example of testicular failure. Image credit: Giorgiomtb/Shutterstock Environmental toxins \\nEnvironmental toxins are also a problem. Electrical, oestrogen and toxic metal pollution are under-researched but may have devastating effects on human health. Radio waves, plastics, unfiltered medication and purposely added toxins in the water supply, like fluoride and chlorine, have deleterious effects too. What can we do? \\nConsidering these realities, it serves little purpose to blame women for their self-destructive behavior. While in the past, like men, women used to have enough emotional maturity to try to live a life of self-respect (for example by remaining virgins and not drinking alcohol), they have never had much agency, charisma or true self will, even before the diet was empty, and before they were being stuffed full of drugs and chemicals by the unscrupulous pharmaceutical industry and its proxies. \\nThese poisons may cause serious and dangerous, (although slowly fixable) hormonal and behavioral changes, but the real effects are felt by their offspring. Unfortunately, once a woman is hooked on these drugs (for example, the birth control pill or antidepressants), she is unlikely to come off them, and if she does, she is unlikely to do anything to fix the damage to herself or her future children. This is especially the case as the medical industry, which has brainwashed her to see doctors and the state as her loving protectors, is unlikely to recommend it. \\nEven so, these drugs don’t permanently alter the fact that women, as mostly emotion driven actors, are biologically and intrinsically people pleasers, and respond automatically to the most powerful person (or group of people) that can give them a raison d’être. Even if we can’t ensure that women in general improve their diet and avoid pollutants, we can certainly make changes on an individual level, convincing or browbeating our girlfriends, sisters and mothers. \\nThe healthier a woman gets, the greater her affinity with nature becomes and the more maternal she feels, so you can be fairly certain that she’ll try and pass on the knowledge to her children and friends, like our grandmothers and great-grandmothers did. Furthermore, there are a large minority of health conscious women, who it should be our duty to marry and impregnate as many times as possible. Considering the rapid population declines that will occur in the atheist and leftist segments of our countries’ native populations, these women are our best hope for creating a viable future. You will have to teach her a few things. Credit: csp_Subbotina The situation is not hopeless—but we have a fight on our hands \\nIn the past, well-informed people couldn’t expect, due to the limited, and elite-controlled, nature of communication technology and the educational system, to make any impact on the vast majority of the population. The political fight against Big Agra and Big Pharma seemed hopeless. Today is different: the growth of the Internet and the increasing spread of awareness has meant that more people are aware about the importance of eating well, avoiding environmental dangers and supplementing wisely. \\nThis is partly evidenced by the steadily rising percentage of people who eat organic diets, and the booming supplement industry. I hope that, in the future, at least a significant portion of us can survive in a sane enough state to politically fight back against moves by globalists, Islamists, communists and ruthless financiers who are circling, like vultures, over our degenerating civilizations. \\nOn the other side of this political battle, the globalist controlled medical industry has been the biggest proponent of unhealthy diets and dangerous and addictive drugs. Special interests have also been the biggest corrupters of regulators and the institutions created to defend the population against industrial and chemical pollution. \\nA system of global monopoly wealth extraction is not possible with active, capable and self-confident masculinities from proud nation-states to resist it; those who seek to benefit from such a monopoly system have tried their absolute hardest to suppress natural health information. But so far they have failed, and the situation is only improving, so there is considerable reason for hope. Conclusion \\nOur forefathers demanded to fulfill their destiny, ordained by the Gods, to defend our civilizations against the forces of rapacious greed and murderous atheistic villainy—to be the protectors and kings of our people. Today, most men are mentally ill and have become childish hedonistic narcissists. As expected, the ruthless and soulless have exploited this weakness for their own benefit. Now that you have, I hope, understood the principles behind why most of us have lost the urge to fight to protect our cultures, the cause and fix to the industrial malaise should no longer seem out of reach or impossible to grasp. \\nThis area of the human condition is just one another where we stand at the crossroads of history. But in my opinion it is the most important: if the dietary trend of the last two centuries is not reversed, and the nutritional quality of at least a significant minority of men is not substantially improved, then each generation of people will become more communist, more feminist and more weak than the last, and the globalist special interests that seek to create a totalitarian world-monopoly police state will win, regardless of temporary political victories. \\nEach of us has chosen a path to follow in our quest for spiritual, intellectual and national salvation. This is mine. In my future articles I will detail the best dietary approach for strong men (and beautiful women) to follow, and overview the most important environmental precautions we must take, in our quest to fix the root causes of modern degeneracy. \\nI hope that, ultimately, you are convinced to help me, and others like me, prevent our world from collapsing entirely into a miserable cyberpunk dystopia. Oct 30, 2016 Kshatriya Indransha'"}, "time": 1742628433.0597806}