{"duration": 0.11026167869567871, "input_args": {"text": "'Deputy Assistant to the president Dr. Sebastian Gorka, formerly national security editor for Breitbart News, reviewed the Trump administration’s first 100 days on Friday’s Breitbart News Daily. [Gorka said one of the greatest accomplishments of the first 100 days was President Trump’s address to a joint session of Congress, which he described as a moment when the mainstream media’s “reportage, the politically spun reportage, was just blown out of the water”:  I don’t know if you recall  —   on that day and the day before, for 24 hours  —   there was this, “he’s going to go soft on this, they’re not going to keep their promises, they’re not going to talk about the threat as it really is. ” It’s very, very interesting to go back and not just read the transcript, but watch the video, and that moment when the    pauses, looks straight at the camera, and says, “the enemy is radical Islamic terrorism. ” “We’ve set the marker down that we’re going to take politics out of the threat assessment. We’re no longer going to allow political correctness to distort who the enemy is, and how we report about them,” he declared. “I’m biased because I worked on that for years at Breitbart and elsewhere,” he admitted cheerfully. “Number Two is a broader issue that spans everything, whether it’s North Korea, whether it’s Moscow, whether it’s ISIS, or anybody else, and it’s the different way of going around and doing national business that the president has brought to the table,” Gorka continued. He promised: Here I mean the complete rejection of leading from behind, of “strategic patience. ” When the vice president last week gave that address on the deck of the USS Ronald Reagan and said “the era of strategic patience is gone. The world is a dangerous place, and it is a safer place when we are helping guide and lead reactions to those threats”  —   not, and this is really important for your listeners, not as neoconservatives. This is not a third Bush term. But we will lead, and when people do things such as use chemical weapons against women and children, the president will take action. Dr. Gorka’s protégé and successor as Breitbart News, national security editor Frances Martel, noted that President Trump has been criticized for insisting on using the language of “radical Islamic terrorism,” but is given little credit for his outreach to Middle Eastern allies like Egypt. She asked if Gorka was satisfied with the level of engagement between the Trump administration and America’s allies. Gorka responded by inviting listeners to Google the meeting between President Trump and President Abdel Fattah   of Egypt and “just look at the expression” on the latter’s face. “He’s sitting down with the leader of the free world. The smile, the body language, the positivity,” Gorka said. “We did our Muslim partners in the region a great, great disservice in the last eight years. We did not assist them in fighting the jihadis in their backyards. Think about what’s going on in the Sinai right now, with Beit   an ISIS affiliate in Egypt. ” “We did some very bad things,” he recalled. “If you look at the JCPOA, the Iran deal, if you look at the unleashing of billions of dollars to Tehran, the people who are most on the frontline of the war with groups like ISIS and    —   our Sunni friends  —   felt like they had simply been left by the wayside. They felt that the last administration had chosen a side in this war, and it was the Shia extremists in Tehran. ” “We’ve changed all that. The president is clear: we are not going to fight anybody’s wars for them. We will help our friends and allies fight their own wars for themselves  —   with trainers, with advice, with intelligence as required. We are there for our Sunni allies: Egypt, Jordan, the Emiratis, even the Kurds of the region,” he declared. “I think what we have achieved in just the last 14 weeks, as compared to the last 8 years, sends a very clear message. We’re not about invading other people’s countries. We’re not about occupying them, but we will help our friends. There’s a certain Marine division that interestingly has supplied two of our cabinet members, and that Marine division has a very interesting motto: ‘No better friend, no worse enemy.’ I think people understand that we have started a new era in relations around the world,” said Gorka. Turning to the other major foreign policy crisis of the moment, Gorka said the Trump administration would follow “classic strategic behavior” in dealing with North Korea. “You send messages overtly, you send them implicitly,” he elaborated. “I think everybody by now understands the MOAB attack in Afghanistan, the cruise missile attack in Syria  —   neither of those uses of force by the president are just about the countries in which they occurred. ” “So we send implicit messages, explicit messages, but we don’t give the playbook away,” he continued. “People constantly ask me, ‘So what’s next in North Korea? What’s next with regard to relations with Russia?’ and so forth. We’re not going to give that away because that’s astrategic. When you play poker, you don’t show your hand to the people sitting around the table. ” Breitbart News Daily host Alexander Marlow joked that his propensity for showing his cards to everyone else at the table might explain his long losing streak at poker. “President Clinton did that in the Balkans in  . He told the Milosevich regime what he was going to do and what he wasn’t going to do,” Gorka recalled. “And the last administration did it with Mosul, telegraphing when we’re coming and when we’re not coming, and what we’re going to do. That is a way to lose, not a way to win, and this president is all about winning. We know that. ” “The general principles will stand: American leadership is back. We have certain red lines we will act upon them should they be breached. We understand that we have inherited a world on fire,” he said. “There’s one metric I love to use: when we took office  —   this is according to the United Nations, hardly a hotbed of   analysis  —   the United Nations has stated there are 65 million refugees in the world today. That is a world historic record. We had less refugees in 1945 at the cessation of hostilities that was World War II,” he pointed out. “So we know the world is a dangerous place, but we’re going to make it less dangerous by exercising strategic leadership  —   not in a   sense, but in a patriotic sense that supports our friends and allies,” Gorka averred. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. '"}, "time": 1742562667.277299}