{"duration": 0.031696319580078125, "input_args": {"text": "'The 53 rd anniversary of the assassination of President John Fitzgerald Kennedy is remembered and his life is celebrated.\\nOn Nov. 22, 1963, the 35 th President of the United States was shot by Lee Harvey Oswald, at 12:30 p.m., in Dallas, Texas. He was in a motorcade with his wife Jacqueline, the Governor of Texas John Connally and his wife. They were traveling through Dealey Plaza when he was shot.\\nHe won the 1960 election by a narrow margin, although, in 1961, more than 60 percent of the population claimed they voted for Kennedy. He brought a special new aspect to the White House; a young family, culture, laughter, and class. Most importantly, Americans felt he brought the people hope.\\nKennedy was the only Catholic President of the United States. He once stated:\\nThere are three things in life; God, human folly, and laughter. The first two are beyond our comprehension, we must make the best of the third.\\nThe Life of Kennedy: His great-grandparents were immigrants from County Wexford, Ireland. He was fortunate to have not suffered poverty or discrimination, except for the Boston Brahmins, who believed he was “Shanty Irish.” He knew he was a Fenian.\\nDuring World War II, his father’s influence helped him enlist in the United States Navy. Kennedy was a skipper of PT-109, in the Salmon Islands. A Japanese destroyer cut his boat in two, in a night action. He was thrown back into the bridge, causing a lifetime back injury. Despite his pain, the skipper collected his crew and saved a burned crewmate by placing a belt under the man’s arms and towing him to shore, holding the belt in his teeth. This act of valor earned him the Navy and Marine Corps. Medal and a Purple Heart.\\nThe Kennedy Presidency: October 1962, the president had to face Russia, concerning the missiles in Cuba. Generals wanted to go to war. However, Kennedy had experienced war, thus, he negotiated a settlement. The world viewed this as a victory for Kennedy.\\nOn June 11, 1963, his Civil Rights speech was televised across the nation. He asked Americans to allow equal rights for their fellow African-American citizens. In his speech, Kennedy stated that the nation was facing a moral issue that was “as old as the Scriptures and as clear as the American Constitution.”\\nPresident Kennedy’s Civil Rights Bill was passed by Lyndon Johnson, in 1964.\\nAlso in June 1963, Kennedy delivered a speech in Berlin. This famous speech is known as “Ich bin EIN Berliner.” He offered the citizens of the country hope and warned Russia that their time was coming.\\nHe left Berlin and flew to Ireland to address the Irish Parliament. Kennedy made a point to visit Arbour Hill, the mass grave of 14 of the martyrs in the Easter Rebellion. He is the only United States leader to honor this memorial. He read the names of those buried there, while the Irish Prime Minister Sean Lemass walked by his side. Lemass knew many of the leaders in that grave.\\nOn Aug. 5, 1963, Kennedy signed the Nuclear Test Ban Treaty. This was supposed to make the world a safer place. Nonetheless, four days later, Patrick Bouvier Kennedy, the infant son of the president, died. He was two days old.\\nMonday, November 18, President Kennedy made a stopover in Tampa, Florida. He was the first president to be a guest of this city. Among the multitude of conspiracy theories surrounding the assassination of the former president are a few that involve his visit to Tampa.\\nTampa Conspiracy Theory: One of the many conspiracy theories claims there was a gunman at the Floridian Hotel. This gunman was prepared to assassinate President Kennedy. This theory is supported by the reports of organized crime in Tampa Bay. Per the story, the Floridian Hotel would be a good place for a sniper to set-up, in preparation to take a shot.\\nOswald Acted Alone Despite Disbelief: However, Warren Commission investigated the assassination of President Kennedy and determined, in September 1964, that there was no evidence of a conspiracy. It was concluded that Oswald acted on his own.\\nThe Associated Press conducted a poll in April 2013, and 50 percent of the American population believed more than one person was involved in the assassination of President Kennedy. They also believe it was a conspiracy. However, 24 percent of the people think Oswald acted on his own and 16 percent were undecided. A Gallup poll, in 2003, revealed 75 percent of Americans thought there was a conspiracy involved in the death of the president.\\nIn Remembrance: Springfield, Massachusetts, held a ceremony, to honor former President Kennedy, at 1 p.m., on Nov. 22, 2016, at the Eternal Flame in Forest Park. U.S. Rep. Richard Neal and Mayor Domenic Sarno were in attendance.\\nA memorial wreath and three red roses were left at the Eternal Flame. The ceremony included a moment of silence in honor of Betty Sullivan, the wife of former Springfield Mayor William Sullivan. She recently passed away.\\nBy Jeanette Smith\\nSources:\\nChannel 8 News: Tuesday marks 53rd anniversary of JFK’s assassination\\nIrish Central: Remembering JFK – the assassination took place 53 years ago today\\nMass Live: Springfield to remember JFK on 53rd anniversary of assassination\\nImage Courtesy of JFK Library/Courtesy of Smithsonian Channel – Used With Permission 53rd Anniversary , assassination , Conspiracy , kennedy , spot'"}, "time": 1742628588.5337286}