{"duration": 0.02405524253845215, "input_args": {"text": "'Thu, 27 Oct 2016 17:19 UTC © Abdalrhman Ismail / Reuters Terrorists in eastern Aleppo opened sniper fire on around 40 civilians who were trying to escape the rebel-controlled area of the city , the Russian Ministry of Defense announced, confirming that no airstrikes have been conducted in the area for nine days. \"Because of the sniper fire from the militants, another attempt of the Syrian authorities and the Russian reconciliation center to evacuate around 40 people from eastern districts of Aleppo to safe regions of the city was derailed,\" Russian Defense Ministry spokesman Maj. Gen. Igor Konashenkov said on Thursday, adding that the incident happened overnight . The general also said that Russian and Syrian planes have stayed at least 10 kilometers (6.2 miles) away from Aleppo for nine days, after the sorties were halted on October 18. Two days after the strikes ceased, Damascus and Moscow organized safe passage corridors for those wishing to leave the besieged neighborhoods. Six safe routes are now being offered to civilians, while two have been designated for armed rebels. The jihadists, however, refuse to surrender and constantly shell escape routes and government-controlled parts of the city. \"The terrorists continue indiscriminately shelling residential districts of the city with makeshift rocket launchers, blocking the civilians from leaving using the humanitarian corridors,\" the general said. While air raids are suspended, Russia continues to facilitate aid deliveries to Syria\\'s second largest city. On Wednesday, some 15 tons of aid was delivered to residents of Aleppo\\'s Kurdish-run Sheikh Maqsood neighborhood, located close to the demarcation line, the Russian reconciliation center announced. The nine kilogram (19.8 pound) packages included rice, macaroni, and cooking oil. The humanitarian rescue mission was discussed at the UN Security Council meeting earlier on Thursday, where the Russian envoy accused UN teams on the ground of failing to negotiate safe passage for civilians aiming to escape eastern Aleppo. In response, the UN\\'s under secretary-general for humanitarian affairs and emergency relief coordinator, Stephen O\\'Brien, blamed the parties involved in the conflict for their failure to provide adequate security guarantees. Comment: Jan Egeland, special adviser to UN special envoy de Mistura, was more honest, simply stating : \"It was very clear today that the Russians want to help us,\" Jan Egeland said after a meeting in Geneva on the relief effort in Syria. \"They would like to help us get access to east Aleppo.\" O\\'Brien on the other hand, was moved to American-like heights of pseudo-indignation. Egeland added: \"The United States and the like-minded pledged to help us in our humanitarian diplomacy with the armed opposition side, which is difficult and which in the case of medical evacuation was not satisfactory . We lost a lot of time because of all of the conditions that were raised also on that side,\" he said. Egeland added that \"there simply was too little trust, there simply was too much fear, there were too many misunderstandings, there were too many confusing messages for this very complex and very dangerous operation... to take place.\" The ICRC also welcomed Russia\\'s humanitarian efforts, guaranteeing to do everything possible to protect civilians and evacuate Aleppo. Comment: Murad Gazdiev continues his on-the-ground reporting from Aleppo. In his latest, he speaks to Emenour, Aleppo\\'s only female taxi driver, about life before the war.'"}, "time": 1742628602.692929}