{"duration": 0.1339566707611084, "input_args": {"text": "'The judge was intrigued. Before her in a hearing room on Staten Island sat Cristy Matteo, the owner of a pet pig named Wilbur. She was accused of illegally harboring a wild animal. The judge said that she knew of only one other pig that had been through the system, Ms. Matteo recalled. The judge named the pig. Ms. Matteo immediately named the pig’s owner. “The judge was smiling at me,” Ms. Matteo said. The judge asked if there was an underground pig network in New York. “I said, ‘More than you can imagine. ’” An untold number of pet pigs are scattered throughout the city, despite a ban. They can be found in all five boroughs, the veterinarians who treat them say. “There are so, so many of us,” said a neighbor of Ms. Matteo’s who has two pigs and gave her name only as Leslie W. Ms. Matteo said she knew of dozens. Wilbur, however, a placid   with a fondness for orange peppers and daylong naps, is about to leave their ranks. Though the judge dismissed the violation last May, accepting Ms. Matteo’s explanation that Wilbur was an emotional support animal for her and her father, the city’s health department got the dismissal overturned. Ms. Matteo, 46,  must get rid of Wilbur by the end of the month. She has lined up a sanctuary in North Carolina for him, but she is not ready to give him up. “I’m just praying that something gives between now and Jan. 31,” she said on Monday as Wilbur grunted quietly beside her in her living room on Staten Island’s South Shore. The city’s porcine ranks include a store’s wandering mascot and a spotted pig who frequents Tompkins Square Park in the East Village. Some pigs live as discreetly as it is possible to do in a dense city. Others lead lives like Queelin, a Manhattan resident who is walked in a park near her apartment each day. She has a Facebook account, was the model for a children’s book called “The New Yorker Porker” and draws attention wherever she goes. “You basically cannot walk her if you’re in a bad mood or if you’re in a hurry,” said her owner, who gave her name only as Ann, citing the hostile legal climate. Ms. Matteo, who works for a tugboat company, got a piglet on a whim. “I just woke up one morning and said, ‘I’m buying one,’” she said. That was five years  —   and 165 pounds  —   ago. Wilbur became close friends with Ms. Matteo’s exuberant golden retriever mix, Milo. Wilbur was soon using a doggy door to go out into the yard to relieve himself, root around for leaves and occasionally roll in the mud. The neighbors’ grandchildren fed him carrots, Ms. Matteo said. Then last winter, someone complained to 311. (Ms. Matteo thinks she knows who but declined to offer details.) On March 1  —   National Pig Day  —   a health inspector knocked on the door, and Ms. Matteo’s ailing father, a cancer patient, let him in. A summons followed. The inspector had observed “one large   pig lying on its bed in the living room area of the property. ” Ms. Matteo was charged with violating a provision of the city health code prohibiting “all   ungulates,” including but not limited to “deer, antelope, sheep, pigs, including pot bellied pigs, goats, cattle, giraffe and hippopotamus. ” In New York’s founding days, pigs roamed the streets, devouring trash and functioning as a   municipal sanitation force. During the early 19th century, the city began passing laws against harboring pigs. Although they eventually disappeared from the streets, they still made cameos. When the Hotel Thorndyke in Midtown caught fire in 1920, The New York Times reported, “Miss Helen Lee Worthing, who is in the Greenwich Village Follies, returned to her room to rescue a pet baby pig used in that production and which she had left sleeping in its basket. ” Pigs made a comeback with the potbellied pig craze in the 1980s and ’90s and have maintained a steady presence ever since. In 2013, as a woman in Queens fought  to keep her pig, Petey, State Senator Tony Avella introduced a bill in the Legislature to legalize pet pigs under 200 pounds statewide. “Over the years, pygmy pigs have gained popularity and recognition as great pets due to the combination of their unique traits such as cleanliness, diminutive size, friendly disposition and intelligence,” the   bill says. It has yet to pass. The health department opposes it, for several reasons. “Pigs raised as house pets can become aggressive to humans,” the agency said in a recent statement. Also, it noted, there is no federally approved rabies vaccine for pigs. In 2014, the most recent year for which federal statistics are available, there were no cases of rabies in pigs reported in the United States, according to the federal Centers for Disease Control and Prevention. There were, however, 272 rabid cats, 59 rabid dogs and one rabid llama. Pig owners scoff at the notion that their pets pose a threat. “It’s ridiculous how many people are abusing their animals, how many dogs are mauling people, and they’re worrying about a pig that’s not even bothering anybody,” said Nadine Darsanlal, a disabled veteran who lives in Queens and owns a working therapy pig, also named Wilbur. (The classic children’s book “Charlotte’s Web” ensures that many pet pigs continue to be named Wilbur.) She keeps him at a friend’s house outside the city, where pigs are legal. At Queelin’s apartment in Manhattan on Tuesday morning, the lawbreaker snoozed on her bed in the corner. Her owner’s older daughter, a college student who asked to be identified only as Margret, eventually persuaded Queelin to get up. In return for treats, Queelin (an Anglicization of her real name, Caoilfhionn, which means “fair and slender” in Irish) sat like a dog and kissed Margret on the lips. Margret lay down on the couch, and Queelin climbed up and plopped on top of her. “She knows how to trap you because she puts her big head on you,” Margret said as she stroked Queelin’s    bristles. “Then she’s so happy. ” Queelin gave a soft snort of agreement.'"}, "time": 1742563363.858273}