{"duration": 0.09511613845825195, "input_args": {"text": "'BRUSSELS (AFP)  —   The EU has clearly pinned its hopes on   presidential candidate Emmanuel Macron in Sunday’s French   vote, wary of the threat posed by the fiercely eurosceptic Marine Le Pen. [A host of top Brussels figures led by European Commission President   Juncker have broken with their usual protocol of not interfering in national elections and have openly backed the centrist former banker to beat   leader Le Pen.  In the European Union’s corridors of power, Macron is seen as more than just a frontline defence against populism as seen with Brexit and the rise of Donald Trump in the US. To many, the    represents a breath of fresh air that could offer the embattled bloc a sorely needed chance to push ahead with unifying new projects after years of crisis. “We are crossing our fingers,” one senior EU official told AFP on condition of anonymity. Macron’s gruelling televised debate with Le Pen on Wednesday was “watched widely” at the highest levels of the European institutions, “including by   colleagues” the EU official said. “Of course we see Macron in a positive way. We have the feeling that we can work with Macron because his project isn’t to destroy the EU as with Le Pen,” the official added. This week EU Brexit negotiator and former French minister Michel Barnier said he would vote for Macron, saying that France would “stay European” under him.  —   ‘Huge sigh of relief’  —   Le Pen’s disdain for Europe runs deep. She has long wanted France to drop the euro single currency and return to the franc, and also leave Europe’s Schengen   travel zone. She has predicted the EU “will die” and has vowed to hold a “Frexit” referendum on France’s membership of the European Union. Macron, also a former economy minister, wants to bolster the EU and the eurozone. He wants to set up a separate budget for the 19 countries that use the common currency. He also proposes giving the eurozone its own parliament and finance minister. “Macron’s victory would bring a huge sigh of relief because of all the candidates, he is the one who backed further EU integration: no ifs or buts,” said Vincenzo Scarpetta, senior policy analyst at Open Europe. In one of his last interviews before Sunday’s   Macron stressed that in case of victory, “I cannot keep Europe as it is”. “We need a Europe that is more efficient, that protects, and that is less boring to people in their everyday lives,” he told French daily Le Parisien. It was this   enthusiasm that led the EU’s most senior figures to openly show their excitement when Macron narrowly beat the second place Le Pen in the first round of the French vote on April 23. “Good luck,” tweeted European Commission chief Juncker only a few hours after the result, in a rare break with Brussels protocol. Juncker’s spokesman said France was choosing between European values and “the destruction of Europe. ” A spokesman for Chancellor Angela Merkel, Europe’s most powerful leader, took a similar approach, wishing Macron the best for the next two weeks of campaigning. EU diplomatic chief Federica Mogherini even praised Macron for speaking against a backdrop of the European Union’s    starred flag on the night of the first round.  —   ‘Good on paper’  —   But analysts warned against such unmitigated enthusiasm. “Reforming the EU may sound good on paper but Macron’s ideas are bold,” said Open Europe’s Scarpetta. “But how much of this is realistic in practice as any of these would require changing the EU treaties,” he said, adding that powerful Germany would also have to be on board. Analyst Henrik Enderlein of the Hertie school of governance in Berlin said that Macron left his mark in Germany as French minister, including with Wolfgang Schaeuble, the EU’s most influential economic official. “It’s totally against the grain to get elected in 2017 saying I want more Europe and that is what has made an impression in Germany,” Enderlein told AFP. Still, turning this into deliverable policies remained a major challenge given the divisions on major issues with Berlin, including security and the economy, he added.'"}, "time": 1742563107.9135222}