{"duration": 0.03818392753601074, "input_args": {"text": "'Disney is reportedly looking to strike a deal with the estate of the late actress Carrie Fisher for the rights to use the Star Wars star’s likeness in the franchise’s future films. [“With what might be regarded as unseemly haste, Disney is negotiating with the actor’s estate over her continued appearance in the franchise,” Scottish journalist Kirsty Wark said in a recent appearance on the BBC show Newsnight.  “If Disney gets the   Carrie Fisher will join Peter Cushing, who, last month, 15 years after his death, played a key role in Rogue One as Grand Moff Tarkin,” Wark said. Fisher passed away on December 27, four days after suffering a heart attack while onboard a flight from London to Los Angeles. The latest Star Wars film, Rogue One, featured a digitally enhanced Princess Leia  —   a   Carrie Fisher meant to mirror her character in the original Star Wars. Rogue One filmmakers also used digital scans to reprise Peter Cushing’s character, the villainous Grand Moff Tarkin. Cushing died in 1994.   imagery (CGI) has been used to bring back deceased characters  —   for better or for worse  —   for decades, though the practice has caused controversy. In 2013,   martial artist and film legend Bruce Lee was digitally reincarnated and placed in a   television commercial for Johnnie Walker Blue Label. And while Lee’s daughter Shannon was consulted on the project, the ad left some fans furious, because Bruce Lee famously did not consume alcohol: “They’re bad for my body” he was once quoted as saying. Lee’s   likeness was also used to sell Mars bars. After the untimely death of Fast and Furious franchise star Paul Walker in 2013, CGI and the late actor’s brothers were used to shoot the final scenes of Furious 7. Oddly enough, Fisher once joked during a roast of George Lucas at the AFI Life Achievement Awards that she doesn’t even own the rights to her own image. “And though amongst your many possessions, you have owned my likeness all these years so that every time I looked in the mirror I have to send you a check for a couple of bucks. ” Nevertheless, Fisher reportedly completed all of her scenes for the upcoming Star Wars: Episode VIII before her death. Lucasfilm President Kathleen Kennedy recently said it is hard to imagine a world without Fisher. Indeed, the beloved actress is gone, but perhaps Princess Leia will yet live on.   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742562007.702048}