{"duration": 0.05781865119934082, "input_args": {"text": "'0 comments \\nWait! Using the death of Eric Garner to push “Gun Control”? \\nHillary….THERE WERE NO GUNS INVOLVED! For some reason, the Hillary Camp does not know the difference. They just know Police are involved, and BlackLivesMatter hate police so they want to use it to push…. their agenda against gun. \\nEven though…it makes ZERO sense. \\nWikiLeaks has just released a batch of evidence that Eric Garner’s daughter has read through…and good thing she did. Her own NAME is in it! Which got her furious… \\nSo she’s speaking out… \\nErica Garner has become one of the more vocal #BlackLivesMatter activists after her father died while resisting arrest. Yes, we all have opinions about BLM, but that’s not this post. Okay? Okay. \\nThis post is about how shameless leftists like the Clinton Campaign used a man’s death for their own means, to push their own agenda. No, of course you’re not surprised an entity like the Clinton campaign would use anyone for any reason whatsoever. Par for the course. What’s different is how Erica has responded. Let’s just say she’s none too pleased. \\nSide note reminder: Eric Garner, her father, wasn’t even shot. No guns. \\nSo what got Erica justifiably peeved are some recent Wikileaks, which revealed the backdoor dealings of how the Clinton Campaign discussed Garner’s case. Like how it could be used to further the anti-cop and anti-gun agendas. \\nGarner first tweeted a link to leaked emails that appear to show internal discussions from the Clinton campaign about whether to mention her father’s name in op-ed piece that Clinton was writing for the New York Daily News. \\n“Finally, I know we have Erica Garner issues but we don’t want to mention Eric at all? I can see her coming after us for leaving him out of the piece,” Clinton campaign aide Nick Merrill wrote. \\nErica Garner was not, shall we say, amused. These people will co opt anything to push their agenda. Police violence is not the same as gun violence. \\n— officialERICA GARNER (@es_snipes) October 27, 2016 I\\'m vey interested to know exactly what @CoreyCiorciari meant when he said \" I know we have an Erica Garner problem\" in the #PodestaEmails19 \\n— officialERICA GARNER (@es_snipes) October 27, 2016 https://t.co/jzfUl0FbXF In this #PodestaEmails leak @CoreyCiorciari n @NickMerrill plot to use police violence victims to push gun control \\nKeep reading… \\nJust like the scandalous bunch of crooks in the Clinton camp to abuse their power and twist the truth to get what they want… more power! Greed is never satisfied, and that’s going to be a HUGE problem if Hillary gets into the White House. \\nShe’ll sell us for a dime. Related Items'"}, "time": 1742562055.5251932}