{"duration": 0.03541374206542969, "input_args": {"text": "'Anorexia sexual, la plaga del siglo XXI: ¿por qué no quieres tener sexo? Publicado: 26 oct 2016 14:25 GMT \\nEn nuestro siglo la inapetencia sexual puede tener causas serias que la convierten en una grave enfermedad. Imagen Ilustrativa Pixabay / Takmeomeo Síguenos en Facebook \\nLa llamada \\'anorexia sexual\\' es un trastorno todavía poco conocido que puede convertirse en la \\' plaga del siglo XXI \\'. Según la definición que el doctor Patrick Carnes propuso en su libro \\'Anorexia sexual\\', publicado en 1997, es \"un estado obsesivo en el cual la tarea física, emocional y mental de evitar el sexo domina la vida de alguien\". \\n\"Los anoréxicos sexuales son aquellas personas que para evitar la intimidad rehúyen cualquier tipo de vínculo más profundo; de la misma manera que un anoréxico evita comer porque cree que está más gordo de lo que es en realidad, un anoréxico sexual es alguien que evita el contacto sexual porque tiene aprensiones de carácter psicológico\", explica la psicoterapeuta sexual Natalia Guerrero. El origen del trastorno \\nEl extraño trastorno afecta tanto a hombres como a mujeres. Son personas que, a pesar de sentir deseo, se prohíben disfrutar de cualquier placer sexual porque lo perciben como una amenaza. Los psicólogos apuntan que las causas del fenómeno tienen un origen muy profundo que podría encontrarse en la sociedad contemporánea. Las personas simplemente no saben construir relaciones y recurren a la producción erótica en forma de revistas, películas e Internet, de manera que proyectan sus deseos sexuales hacia imágenes y videos y no hacia personas. \\nEn algunas ocasiones, la anorexia sexual tiene su origen en la niñez, ya que las personas que durante la infancia fueron víctimas de acosos sexuales en el futuro pueden sufrir el trastorno. Las mujeres violadas también evitan las relaciones íntimas durante mucho tiempo, mientras que algunas personas renuncian al sexo tras haber sido rechazadas por los objetos de sus deseos sexuales. ¿Hay solución? \\nEl problema es cada vez más frecuente, pero tiene solución. \"Los problemas que tienen que ver con esta esfera se pueden trabajar con una terapia sexológica , pero cuando los casos son muy graves, se requiere de trabajar en una interconsulta con un psiquiatra, porque a veces el problema forma parte de un cuadro de fobias más generales\", afirma Guerrero. '"}, "time": 1742561801.3681676}