{"duration": 0.05684685707092285, "input_args": {"text": "'U. S service members participating in the ongoing offensive to recapture the Iraqi city of Mosul from the Islamic State “have come under fire,” Col. John Dorrian, a spokesman for the U. S.  coalition, told Pentagon reporters. [“They have come under fire at different times, our forces that have been in Mosul and other places around Iraq,” revealed Col. Dorrian.  “What I would tell you, though, is that they are directed to try and be positioned where that is a rarity and unlikely to occur,” he added. Without providing a specific figure, an unnamed U. S. defense official told some news outlets that American forces taking part in the Mosul operation had suffered injuries. U. S. troops have been providing advice and assistance to an alliance of tens of thousands of Iraqi security forces, Kurdish Peshmerga troops, and   Shiite militiamen fighting to push the Islamic State, also known as ISIS and ISIL, out of Mosul. The day after the Mosul offensive began in   Peter Cook,   secretary for the Pentagon, conceded that U. S. troops participating in the operation would be in “harm’s way. ” “Some [U. S. troops] will be closer to the front than others  …     but it’s Iraqis in the lead  …     Americans are in harm’s way as part of this fight  …     They’re playing a support role  …     but they are behind the forward line of troops,” Cook told reporters. “U. S. forces remain in a position to be able to provide advice to them,” he added. “A small number will be in a position to provide that advice on the ground. ” The U. S.  Iraqi forces and their allies have liberated eastern Mosul. On Sunday, the Iraqi alliance began its mission to retake the western side of the city, considered one of ISIS’s last major strongholds in the country. Since 2014, ISIS has held Mosul, Iraq’s   city. An estimated 2, 000 jihadists are believed to be still fighting to keep Mosul under ISIS’s control. The U. S.  Iraqi forces and their allies have recently recaptured Mosul’s airport.'"}, "time": 1742561642.809266}