{"duration": 0.04731154441833496, "input_args": {"text": "'An Italian TV reporter and her cameraman were assaulted during a live broadcast whilst covering the living conditions of African migrants hoping to break into northern Europe in search of higher welfare payments. [Matrix Channel 5 journalist Francesca Parisella was showing viewers scenes at Rome’s central train terminal, where dozens of migrants were sleeping outside the station. The reporter told viewers the migrants, who have been arriving in boats to Italy this year in record numbers, had gathered cardboard and other items “to protect them from the cold of the street”.  Noting that Italian volunteers had recently visited the site to bring the migrants hot food, Parisella said the men disperse during daylight hours then return to the station to sleep, “because their hope especially is to reach Milan and other cities in the north [of Italy] and then move to northern Europe”.  Just after the reporter told viewers that she and her team “don’t want to disturb [the migrants] further” the camera was visibly shaken and appeared to have been turned on its side, causing Parisella to alert the Matrix host Nicola Porro that her party was under attack. Following Porro’s warning to the TV journalist to “get out of there” Parisella could be heard running from the station before the assailants caught up with her. “What do you want? You’re crazy!” she said, and emitted screams of terror. “Oh God, Francesca, get out of there,” said Porro, before instructing the Matrix producer to alert police to the attack. From the Matrix studio a few minutes later, the presenter explained that “Francesca is upset but well. [Assailants] destroyed the camera and beat up the cameraman. A situation like our show this evening should resemble reports from a war zone. Thanks to a taxi driver, a much worse outcome was avoided. ” Shortly after, Parisella confirmed this version of events on the programme by telephone. “We were stood at a distance to report on the type of welcome [Italy] can give [migrants] but they were disturbed and then assaulted us. They chased me and grabbed me by the jacket,” said the journalist. Police, who are investigating the incident, said: “This type of aggression is unacceptable and casts a haunting shadow on press freedom in our country, on security conditions in Italy’s largest station, and also on the possibility of violence towards a young woman working in the centre of our capital. ” Porro said he felt “guilty” for having sent a woman out to report from the station late at night, but said the case “raises serious questions” about how somewhere in the centre of Rome was able to become a “no man’s land” where attacks are commonplace, with no fanfare nor acknowledgement from the media. According to local media, a    man hailing from the Ivory Coast has been detained in connection with the attack. The alleged aggressor was known to police for a list of crimes including domestic violence and was ordered by the prefect of Rome last September to be deported.'"}, "time": 1742561790.011134}