{"duration": 0.015736818313598633, "input_args": {"text": "'Israeli minister urges greater West Bank land theft By Stephen Lendman Posted on November 2, 2016 by Stephen Lendman \\nIsrael is run by a lunatic fringe combination of fascist hardliners, Zionist zealots and religious extremists. \\nEducation Minister Naftali Bennett is an over-the-top ultra-right-wing ideologue, urging unlimited settlement expansions on stolen Palestinian land, an ethnic cleansing policy for exclusive Jewish development. \\nHe believes Jews have exclusive sovereignty over all parts of Judea and Samaria. He supports racist hatred, state terror, ethnic cleansing and slow-motion genocide. \\nOn Sunday, he threatened Security Council members, saying that “[t]here is a discussion that in the coming months the UN Security Council will force a resolution on Israel.” \\n“If that happens, we need to have an appropriate Zionist response, immediate sovereignty over Judea and Samaria, including Maaleh Adumim, Gush Etzion, Ariel, Ofra and Beit El.” \\n“It is time to extend out sovereignty in the land of Israel . . . the entire story of settling and Zionism is a story of a great vision and the determination to see that vision through.” \\nIn September, Israeli-installed Palestinian president Mahmoud Abbas said he intends urging SC members to declare Israeli settlements illegal—knowing Washington will veto any resolution proposed. \\nIn 2011, it vetoed a Palestinian backed draft memo, denouncing Israel’s settlement policy as an illegal obstacle to peace. \\nLast month, 88 US senators urged Obama to veto any similar Security Council resolution proposed. Extremist settlers and Knesset hardliners demand legislation authorizing annexation of Ma’aleh Adumim, Israel’s third largest settlement, home to over 37,000 residents. \\nIsrael’s settlement project flagrantly violates international law. Over 600,000 settlers occupy stolen Palestinian land. \\nFourth Geneva prohibits an occupying power from transferring its citizens to the territory it occupies, as well as displacing people from their land to permit it. \\nIsrael wants historic Palestine exclusively for Jews, Palestinians denied their fundamental rights—terrorized for decades with no international support. \\nStephen Lendman lives in Chicago. He can be reached at lendmanstephen@sbcglobal.net. His new book as editor and contributor is “ Flashpoint in Ukraine: US Drive for Hegemony Risks WW III .” Visit his blog at sjlendman.blogspot.com . Listen to cutting-edge discussions with distinguished guests on the Progressive Radio News Hour on the Progressive Radio Network. It airs three times weekly: live on Sundays at 1PM Central time plus two prerecorded archived programs. This entry was posted in Commentary . Bookmark the permalink .'"}, "time": 1742628507.5419374}