{"duration": 0.060628414154052734, "input_args": {"text": "'Humans Are Free The Pacific Ocean — in fact almost one-third of the Globe — is thought to have been contaminated from the leak out from the Fukushima Nuclear Disaster.\\nThe International Atomic Energy Agency (IAEA), seeking to promote the peaceful use of Nuclear Power , in 2011 established with the Regional Cooperative Agreement (RCA) Member States, a joint IAEA Technical Cooperation (TC) project in the region of the Pacific Ocean. \\nIt was established after the Fukushima disaster when a tsunami caused by a major earthquake on 11 March 2011, disabled the power supply and cooling of three Fukushima Daiichi reactors, causing a nuclear accident. \\nAs a result, a large quantity of radioactive material was admitted into the Pacific Ocean. A field study found that two filter cartridges were coated, which showed elements of cesium, a radioactive substance. \\nOf no surprise, this caused great concern to countries based around the Pacific Ocean due to the potential economic and environmental implications. The TC project’s aim was therefore, to monitor the presence of radioactive substances in the marine environment. \\nThe first annual review meeting held in August 2012 demonstrated predictive hydrodynamic models and they predicted that the strong current, known as the Kuroshio Current and its extension, had the ability to transport the radioactive substances across the Pacific Ocean in an easterly direction. \\nHowever, the concentration of radioactivity was not as high as originally thought. \\nThe massive expansion of ocean had diluted it substantially so radioactivity remained at low levels but there was still concern over contamination of seafood even at these low levels. \\nThe marine monitoring project was therefore, established to ensure that the seafood of the region was safe for consumption and to maintain a comprehensive overview and full facts of the situation, considering its grave implications. Documents Say Navy Knew #Fukushima Dangerously Contaminated the USS Reagan: http://t.co/hUomqT92e2 \\n— trutherbotred (@trutherbotred) July 9, 2015 \\nThe TC is due to conclude this year. A few results have caused concern. \\nA field study they conducted on 2 July 2014, revealed from two sets of seawater samples, found that two filter cartridges were coated, which showed elements of cesium, a radioactive substance. \\nThen recently, trace amounts of cesium-134 and cesium-137 turned up in samples collected near Vancouver Island in British Columbia . \\nThe samples collected were separate from the monitoring project set up by IAEA but it is thought the only possible source of these radioactive elements is Fukushima, according to the Integrated Fukushima Ocean Radionuclide Monitoring (InFORM) Network. \\nThis is the first time that traces of cesium-134 had been detected near North America. \\nWhile these are trace amounts, the danger of radioactive material in any amount cannot be underestimated. However, the experts say that these levels detected cannot really harm us, they are still lower than those we could be exposed to from a dental x-ray for instance. \\nHaving said that, every possible exposure, in any small amount, adds up. The problem with nuclear energy and fallout, the radiation and radioactive materials can travel far and wide with the wind and with the sea. \\nTherefore, we should aim on a global level to keep these levels at zero. In any event the continuous monitoring of oceans will need to be conducted, according to Ken Buesseler, a marine chemist at Woods Hole Oceanographic Institute . \\nWhat Buesseler says should be taken on board beyond 2015, particularly since the advice from the IAEA is to dump even more contaminated water into the sea. This is apparently more desirable than holding it in tanks. \\nAny discharge will have to be controlled and continuous monitoring would be needed, in particular near the plant to improve data reliability. \\nThis is causing concern and not just to state authorities. Consider the fishermen. Every time they catch fish in the ocean, the fish need to be tested for radioactivity. \\nBefore any further dumping is done, the IAEA and Tokyo Electric Power Co., who control the plant, need to consider not only the environmental impact but socio-economic impact as well. \\nLivelihoods could be affected as well as long-term health of the region and global community eventually.'"}, "time": 1742563050.5450423}