{"duration": 0.15363812446594238, "input_args": {"text": "'MOSCOW  —   After the outpouring of euphoria among Russia’s political elite over the victory of Donald J. Trump, President Vladimir V. Putin on Thursday gave a more measured response in his annual address to the nation, calling for cooperation but expressing misgivings over some of Mr. Trump’s statements about nuclear weapons. The Russian leader appeared remarkably subdued at what was widely seen as a moment of triumph for him, with his popularity rising on a cresting wave of   and often   populism in Europe and America. Speaking to an audience of political and economic barons in the ornate St. George’s Hall of the Great Kremlin Palace, Mr. Putin praised his compatriots for rallying around “patriotic values” and, counterintuitively, for eschewing the lure of populism. He lamented that around the world, “even in the most seemingly affluent countries and stable regions, more and more fractures and conflicts on political, ethnic, religious and social grounds are rising. ” Those remarks had to surprise Western officials who have frequently accused the Kremlin of stirring up and supporting precisely those   forces so as to sow disorder and weaken liberal democracies. Germany’s foreign intelligence chief, Bruno Kahl, warned in an interview published on Tuesday that Russia, seeking to create “political uncertainty,” was bombarding his country with disinformation before elections next year. Mr. Putin did not mention Mr. Trump by name, saying only that Russia wanted to work with the incoming administration “to normalize and begin to develop bilateral relations on an equal and mutually beneficial basis. ” His comments largely reprised the message he gave Mr. Trump in a telephone call soon after the Nov. 8 election, when both men agreed that something needed to be done to improve “the absolutely unsatisfactory state of bilateral relations. ” In a departure from his speeches in recent years, Mr. Putin avoided sarcastic or downright angry comments about the United States. But he also made clear that Russia demanded to be treated as a global power, not the “regional power” that Mr. Obama described it as in 2014, infuriating Moscow. “We have a joint responsibility for the provision of international security and stability, for the strengthening of   regimes,” Mr. Putin said, referring to efforts to prevent the spread of nuclear weapons. During the presidential campaign, Mr. Trump suggested that more countries should acquire nuclear weapons so that they can defend themselves without Washington’s help. He also threatened to dismantle the international agreement that limits Iran’s nuclear program. In another apparent reference to Mr. Trump’s campaign statements on nuclear weapons policy, which included assertions that the American arsenal had “fallen way behind” Russia’s and needed to catch up, Mr. Putin warned against any attempt by Washington to disrupt what he called the balance of nuclear firepower between the two countries. “I would like to emphasize that attempts to break strategic parity are extremely dangerous and can lead to a global catastrophe,” Mr. Putin said. “This must not be forgotten for a single second. ” Mr. Putin’s mixing of pointed reminders of Russia’s status as a nuclear power with a measured expression of hope for an end to the current deep chill in relations with Washington contrasted sharply with the unalloyed glee expressed by many Russian politicians and commentators after Mr. Trump’s election victory. In the   to the election,   news outlets cast Hillary Clinton as a Russophobic hawk and warmonger while Mr. Trump was presented as the candidate who would bring a new and sunny dawn to relations between Washington and Moscow. Syria and the importance of fighting Islamic extremism are areas in which Mr. Putin’s interests and Mr. Trump’s statements seem to coincide. Mr. Putin, who has repeatedly accused the Obama administration of mollycoddling extremists, said the United States needed to focus on “a real rather than   threat” and join Russia in fighting international terrorism. The “ ” threat seemed to refer to fear in Washington and many European capitals that Russia has become a menace to security since it seized Crimea from Ukraine in 2014 and supported   separatists in eastern Ukraine. Ignoring American efforts to destroy the Islamic State, Mr. Putin said the problem of international terrorism “is being solved by our servicemen in Syria,” where Russian warplanes have helped President Bashar   regain control of large sections of Aleppo, once Syria’s biggest city, from rebels, some of whom are supported by the United States. A new foreign policy doctrine signed by Mr. Putin on Thursday underscored the problems with Russia’s relations with the West and set a high bar for any swift easing of tensions. The doctrine, a summary of how Moscow sees the world and what it wants, stressed the gravity of “the serious crisis between Russia and the West” and blamed this on “geopolitical expansion” by NATO and the European Union. It said Russia and the United States could work together only on the basis of “equality, mutual respect for interests and noninterference in the internal affairs of each other. ” Insisting that Russia does “not accept any attempts to organize pressure, either military, political, economic or of any other kind,” the policy doctrine said Moscow “reserves the right to react hard to unfriendly actions, including through the strengthening of national defense and the taking of reciprocal or asymmetrical measures. ” Most of Mr. Putin’s hourlong speech, however, was devoted to domestic issues, not foreign relations. He acknowledged that two years of economic decline had brought great hardship but insisted this had only made the country stronger, and he focused on sectors of the economy that he said have done well, like agriculture and  . While proposing no significant reforms to revive Russia’s sluggish economy  —   which shrank by 3. 7 percent last year and has contracted further this year, though at a much slower pace  —   Mr. Putin said he had ordered the government to work out a “substantive action plan” to ensure that Russia achieves higher growth rates than elsewhere by 2020 and elevates its position in the global economy. Russia’s economy ranks around 13th in the world, on the basis of its gross domestic product, behind countries like Australia, Canada and South Korea What shape such an economic development plan might take has been the object of bitter feuding between more liberal members of the government, who favor privatization, and those who want the state to keep control of crucial industries. The liberal camp suffered a major setback earlier this month with the   arrest on murky corruption charges of one of the country’s main economic policy makers, Aleksei Ulyukaev, a liberal stalwart who had served until his arrest as minister of economic development. Mr. Putin said parliamentary elections in Russia in September, which delivered a resounding victory to his United Russia party, had “proven that we live in a healthy society that is confident in its fair demands, in which immunity to populism and demagoguery is growing stronger and the importance of mutual support, solidarity and unity are highly valued. ”'"}, "time": 1742562535.1267827}