{"duration": 0.11611318588256836, "input_args": {"text": "'It’s three months until Election Day. To guide you through this final, delirious phase of the presidential campaign, The New York Times is drawing on our   team of reporters, columnists, magazine writers and analysts to create a new podcast. It’s called The  . I will be your host. I’ve covered every twist and turn of the last two presidential campaigns for The Times  —   from Mitt Romney’s infamous “47 percent” remark to Barack Obama’s sudden shift on gay marriage, Marco Rubio’s debate night meltdown to Hillary Clinton’s inability to build trust. (Before that, I covered Mayor Michael R. Bloomberg’s City Hall, and that other cutthroat business: the American retailing industry.) Twice a week on The   my colleagues and I will make sense of a campaign that has baffled, shocked and reordered the political world. We’ll also bring you interviews with some of the election’s most influential figures. You’ll be able to listen to a new episode of The   each Tuesday and Friday on the digital platforms of The New York Times, as well as on iTunes, Google Play Music, Stitcher or the podcast app of your choice. If you have never listened to a podcast before, scroll down for some assistance. For our first episode, we explore whether Hillary Clinton, the most distrusted Democratic presidential nominee in a generation, is heading for an   legitimate landslide  —   and if she is, or if she comes close, what that would mean for the future of both parties. Our guests: Newt Gingrich, the former speaker of the House Amy Chozick, who covers Mrs. Clinton for The Times and Nate Cohn, a data whiz from The Upshot. A teaser from the Gingrich conversation about Trump: Take a listen, and let us know what you think. You can reach us at therunup@nytimes. com, or find me on Twitter. From a desktop or laptop  you can listen by pressing play on the button above. Or if you’re on a mobile device, the instructions below will help you find and subscribe to the series. 1. Open your podcast app. It’s a   app called “Podcasts” with a purple icon. 2. Search for the series. Tap on the “search” magnifying glass icon at the bottom of the screen, type in “The  ” and select it from the list of results. 3. Subscribe. Once on the series page, tap on the “subscribe” button to have new episodes sent to your phone free. You may want to adjust your notifications to be alerted when a new episode arrives. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, just tap on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode. On your Android phone or tablet: 1. Open your podcast app. It’s a   app called “Play Music” with an    icon. 2. Search for the series. Click on the magnifying glass icon at the top of the screen, search for the name of the series, and select it from the list of results. You mightmay have to scroll down to find the “Podcasts” search results. 3. Subscribe. Once on the series page, click on the word “subscribe” to have new episodes sent to your phone for free. 4. Or just sample. If you ’would rather listen to an episode or two before deciding to subscribe, just click on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode.'"}, "time": 1742564463.313994}