{"duration": 0.0883035659790039, "input_args": {"text": "'WASHINGTON  —   If they squint hard enough, they can see hope in the form of an ambitious piece of legislation like a big tax cut. Then there is the fact that Hillary Clinton will not be president. And Mike Pence, the faithfully conservative vice   is there to keep watch. Those conservatives who insisted that electing Donald J. Trump president would be a grievous mistake  —   a group that included governors, senators, radio hosts, prominent columnists and some of the most savvy political operators in the country  —   are now saying they see an upside to four years of a Trump White House. But even as they find small reassurances, those who counted themselves part of the Trump opposition are wondering what their place will be for the next four years in a Republican Party they can hardly recognize. And they have begun to ponder what it all means for a conservative movement they thought they understood better. “Oh God,” said Charlie Sykes, the Wisconsin radio host who became a vocal opponent of Mr. Trump’s during the Republican primaries. He was describing how he had arrived at peace with the election results then, he said, he realized that he had not done so at all. “You kind of have to   a lot of what you thought about the shape of reality,” he said. “It’s not just that you’re wrong it’s that you fundamentally misread what happened. ” What is so disorienting for many conservatives is that the Trump victory was the culmination of the unruly populist upwelling in American politics, first manifested in the Tea Party movement, that traditional Republicans thought they could eventually absorb. Instead, those forces have overtaken them one by one  —   first claiming their House majority leader, Eric Cantor then their speaker, John A. Boehner and then an entire field of presidential candidates. Now it may claim their party. Some on Mr. Trump’s team are already boasting how they plan to break with decades of conservative orthodoxy on government spending and pursue a huge infrastructure spending package that sounds more Roosevelt than Reagan. “The conservatives are going to go crazy,” Stephen K. Bannon, Mr. Trump’s senior counselor and chief strategist, gleefully told The Hollywood Reporter in an interview published Friday. “With negative interest rates throughout the world, it’s the greatest opportunity to rebuild everything  —   shipyards, ironworks, get them all jacked up,” said Mr. Bannon, who has aimed almost as much fire at what he regards as establishment Republicans as he has at Democrats. “It will be as exciting as the 1930s, greater than the Reagan revolution. ” Some conservatives say they could surely live with a few of the proposals of Mr. Trump’s they find worrisome, like a big spending bill, especially if they come with sweeteners like tax breaks or spending cuts in other areas. The easiest way to forge ahead, many are finding, is to disassociate the man from the policy. “I will do everything I can to help him,” said Senator Lindsey Graham, Republican of South Carolina, who has refused on numerous other occasions to help Mr. Trump, including voting for him or attending the Republican National Convention. Mr. Graham told reporters on Capitol Hill this week that he believed he could work with Mr. Trump on issues like the military budget, which both men support expanding. Americans for Prosperity, the political advocacy group supported by David and Charles Koch that decided not to spend any money on the presidential race this year despite spending tens of millions to help Mitt Romney in 2012, is also cracking the door to Mr. Trump. The group, however, declined to say whether it had met or spoken to anyone inside Mr. Trump’s transition team. “We’re encouraged on several fronts by the possibility of the Republican Congress working with the new president,” said Tim Phillips, Americans for Prosperity’s president, citing the prospect of repealing some of President Obama’s energy policies along with the Affordable Care Act. But as with any period of grief, acceptance comes in different ways. Some find catharsis in writing. Others console themselves in data that show they really were not all that wrong. Then there are those who still talk as if they are in mourning: They have good days and bad days. “Life goes on,” said Bill Kristol, the Weekly Standard editor and leading “Never Trump” stalwart, who has written columns about his coming to terms with   Trump. Any given day, Mr. Kristol said in an interview, he feels a range of competing sentiments. “I’m sort of somewhere between ‘trust but verify’ and ‘distrust but verify,’ ” he said, using modified versions of Reagan’s famous quote about how he approached negotiating with the Soviets. On the subject of Reagan  —   it is hard not to talk to conservatives today about Mr. Trump and not have them wistfully invoke their    —   Mr. Kristol said he feared people were drawing parallels to Mr. Trump that risk setting the wrong standards for success. “The Reagan revolution wasn’t that he beat Jimmy Carter in 1980,” he said. “Not that I didn’t love that. The Reagan Revolution was that he governed successfully for eight years and won the Cold War. ” Others are concerned that the conservative movement missed an opportunity to appeal to a younger and more diverse group of voters. And they wonder how it will do so with someone as divisive as Mr. Trump atop the Republican Party. Steve Deace, a conservative radio host in Iowa and prominent “Never Trump” figure, pointed to the tens of thousands of voters in Wisconsin and Michigan  —   states Mr. Trump barely won  —   who voted in other races but did not cast a vote for president, evidently because they could not bring themselves to vote for him. “That’s not lightning in a bottle,” he said, making the point that Mr. Trump repelled so many voters that he almost lost. “That’s like you showed up for work and they said this is your last paycheck and you and your wife go to Las Vegas, put it all on black and it pays off. ” Mr. Sykes, the radio personality in Wisconsin, said he at least felt liberated. By not supporting Trump he does not feel compelled to defend him like so many of his conservative friends do. Mr. Sykes has been writing a new book, which he tentatively titled “How the Right Lost Its Mind. ” But he is struggling to finish it. “Obviously I thought it was going to have a different ending,” he said, asking aloud what he still struggles with. “How did this happen? Who are your friends? What do they actually believe?”'"}, "time": 1742563296.248929}