{"duration": 0.030843734741210938, "input_args": {"text": "'Comments \\nStruggling Senator Mark Kirk (R-IL) stunned his opponent and his constituents during last night’s debate when he mocked the generations of military service that his Democratic rival’s family have given to this country because they are immigrants. \\nDemocratic candidate Tammy Duckworth lost both her legs during the Iraq War when a rocket struck the helicopter she was piloting. She knows what it means to fight and suffer serving America, but that wasn’t enough for Republican Senator from Illinois, who is down over 10 points in the polls . Lacking any reason for voters to choose him, the Republican insulted Congresswoman Duckworth to her face about, her ancestry, her military service and the service of generations of her family, which Politico reports happened like this: \\n“My family has served this nation in uniform going back to the revolution. I am a daughter of the American Revolution. I’ve bled for this nation,” Duckworth said during the debate. “But I still want to be there in the Senate when the drums of war sound because people are quick to sound the drums of war and I want to be there to say this is what it costs and this is what you’re asking us to do.” \\nDuckworth was born in Bangkok to a Thai mother, Lamai, and an American father, Frank, a U.S. Marine who traced his family’s military roots to the Revolutionary War. Frank Duckworth died in 2005. \\n“I forgot your parents came all the way from Thailand to serve George Washington,” replied Republican Illinois Senator Mark Kirk. \\nCongresswoman Duckworth was left completely speechless on stage after the Republican Senator’s incendiary personal attack. \\nHowever, the Republican’s horrifying attack on the disabled veteran Congresswoman represents everything that he and his party of Trump’s GOP collaborators has become; a group of angry white men, lashing out in a bitterly cruel manner at women, and lashing out at veterans and lashing out at immigrants. \\nUntil this debate, Senator Kirk had been the most outspoken opponent in his own party of Republican nominee Donald Trump, but his vile moment of truth reveals that he has had one position in public this whole time, and quite another in private which his outburst exposed. Racism is part of the Republican Party’s genetic code and always has been. \\nSEN. KIRK: I unendorse Trump \\nGOP: See? Not all Republicans are like Trump. We have- \\nSEN. KIRK: Mixed-race people aren’t real Americans \\n— Daniel Lin (@DLin71) October 28, 2016'"}, "time": 1742564451.758467}