{"duration": 0.051935434341430664, "input_args": {"text": "'BY ROBERT SPENCER \\n“Whoever, owing allegiance to the United States, levies war against them or adheres to their enemies, giving them aid and comfort within the United States or elsewhere, is guilty of treason and shall suffer death, or shall be imprisoned not less than five years and fined under this title but not less than $10,000; and shall be incapable of holding any office under the United States.” \\nHow is this not treason? \\n“Iran to Add U.S.-Made Aircraft to Its War Fleet: Obama admin paves way for Tehran to rebuild its air force,” by Adam Kredo, Washington Free Beacon , October 24, 2016: \\nThe Obama administration is forging a pathway for Iran to purchase American-made airliners that are likely to be converted for use in the Islamic Republic’s military, drawing concerns on Capitol Hill amid a flurry of recent attacks by Iranian-backed forces on U.S. military assets in the Middle East, according to conversations with lawmakers and fleet information obtained by the Washington Free Beacon . \\nIran recently announced that it had struck deals with the U.S. Boeing airline manufacturer and France’s AirBus that would permit the companies to transfer technology and provide training to help the Islamic Republic produce equipment that would strengthen its aging fleet of American-made planes. \\nIran currently uses at least six Boeing aircraft as part of its air force fleet. These planes were put on display last week when Iran launched a series of war drills aimed at deterring Western attacks. \\nAs Iran angles to purchase 80 new jets from Boeing, which has lobbied heavily in favor of these sales, the Obama administration is being accused of helping to pave the way for Iran to transfer these commercial liners for use in its war fleet, according to lawmakers and sources familiar with Iran’s military buildup. \\nIran has a history of transferring commercial jets purchased from America to its air force for use in military operations and the transfer of weapons and other illicit material abroad. \\nLawmakers worry that the White House’s efforts to facilitate new airliner sales to Iran Air, the country’s national airline, will help Tehran bolster its war fleet at a time when it is threatening military action \\nFOR ENTIRE ARTICLE CLICK LINK'"}, "time": 1742563104.6224616}