{"duration": 0.10592794418334961, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. The presidential race grew more tumultuous the day after a debate our TV critic described as beyond rock bottom. The top elected Republican leader, House Speaker Paul Ryan, said he would no longer defend the party’s candidate, Donald Trump. Mr. Ryan’s effective concession of the race to Hillary Clinton set off a furious backlash among the party’s Trump supporters, and Mr. Trump tweeted, “Paul Ryan should spend more time on balancing the budget, jobs and illegal immigration and not waste his time on fighting Republican nominee. ” And a new set of leaked emails from Mrs. Clinton’s campaign chairman reveals bitter disputes within her team over Bernie Sanders and other points. ____ 2. Hurricane Matthew’s death toll in the U. S. climbed to at least 21. In South Carolina, above, Gov. Nikki Haley lifted the last evacuation orders, allowing some residents to begin returning to their homes. The death toll has been difficult to track in Haiti, the poorest country in the Western Hemisphere. In Jérémie, a small coastal city that had finally begun to prosper in recent years, the grim work of counting the bodies and assessing the damage is just beginning. ____ 3. In Yemen, airstrikes on a funeral killed more than 100 people in Sana, the capital, on Saturday. Officials and witnesses blamed the military coalition led by Saudi Arabia for the attacks. The U. S. said it would conduct “an immediate review” of its support for the   coalition fighting against Houthi rebels. ____ 4.   and PepsiCo have given millions of dollars to health groups in recent years. They have also spent millions trying to stop laws aimed at reducing how much soda people drink. A new study in the American Journal of Preventive Medicine documents the beverage industry’s strategy to silence health critics and win over unlikely allies against soda regulations. ____ 5. Samsung halted production and sales of its Galaxy Note 7 amid reports that the smartphones sometimes catch fire. It said consumers who own them “should power down and stop using the device. ” The company is the world’s largest smartphone manufacturer and had been counting on the Galaxy to help it close the gap with Apple, its biggest rival, which has a strong hold on the more expensive end of the market. 6. The Nobel Prize in economics went to two professors for their insights into how best to write contracts Oliver Hart and Bengt Holmstrom, above, professors at Harvard and the Massachusetts Institute of Technology, have sought to show how contracts can ensure that the parties are bound by mutual interest. The Nobel Prize in Literature will be awarded Thursday. ____ 7. With Colombia’s peace deal in doubt, a small town that lost dozens of residents in the war fears a return to violence. Fourteen years ago, a mortar fired by FARC rebels landed on a church in Bojayá, above, killing 79, more than half of them children. But 96 percent of the town voted in favor of the peace deal in a referendum this month, showing the deep desire  —   almost desperation  —   for an end to the war. “In order to live in peace, you have to disassemble your heart,” one resident said. ____ 8. “Go back to China!” That was the ugly phrase yelled at a Times editor and his family on the New York City street above after church on Sunday morning. Michael Luo was born in the U. S. the child of Chinese immigrants. His open letter to the woman who screamed the phrase has gone viral. After the incident, his    daughter asked why the woman said that when they’re not from China. “No, we’re not, my wife said,” he wrote. “We’re from America, she told my daughter. But sometimes people don’t understand that. ” ____ 9. Don’t worry about the   rule at home  —   but do wash your hands often. That’s according to a pediatrician who was a   of a book on medical myths, and who flouts the rule himself. “Things get dirty when lots of hands touch them and when we don’t think about it,” Aaron Carroll writes. ____ 10. Say you’re a star soccer player and you want the latest cellphone, or someone to do your Christmas shopping, or to propose to your girlfriend. There’s a guy for that: Charles Porter. To hundreds of players in English soccer over the last 20 years, Mr. Porter is the ultimate purveyor of the Premier League lifestyle. And while he could easily write a salacious memoir, breaking the omertà of his trade would be anathema to him. “We live and die by our discretion,” he said in his   newspaper interview. Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s the Weekend Briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742563924.4841874}