{"duration": 0.10005950927734375, "input_args": {"text": "'Dispatches from STEPHEN LENDMAN H aving closed his earlier investigation into Hillary’s use of her private email server for classified State Department documents without bringing charges, dismissing indictable evidence, it’s hard imagining a shift of agency policy now. So what’s going on? Is FBI Director Comey trying to save face, even at this late stage, having tarnished the reputation of the agency and himself. The fullness of time will show what he has in mind. He faces intense political pressure from key Democrat senators, demanding immediate answers about why he’s reopening his investigation days before November’s election, an unprecedented act. .. Senators Patrick Leahy, Dianne Feinstein, Thomas Carper and Ben Cardin wrote Comey , saying: .. “(N)o later than Monday, 31 October 2016, we request you provide us with more detailed information about the investigative steps being taken, the number of emails involved, and what is being done to determine how many of the emails are duplicative of those already reviewed by the FBI.” They want Attorney General Loretta Lynch explaining her involvement in Comey’s action, if any. The Hillary campaign called for “public answers” to clarify what new information the FBI discovered. .. After saying that revisiting his decision last July would be unlikely, Comey opted for an October surprise – the likes of which Washington hasn’t seen since the tumultuous end of Nixon’s tenure. Paul Craig Roberts said he’s gotten word “ that the FBI has reopened the Hillary case of her violation of US National Security protocols, not because of the content of the new email releases, but because voter support for Trump seems to be overwhelming, while Hillary has cancelled appearances due to inability to muster a crowd. The popular vote leaves the FBI far out on the limb for its corrupt clearance of Hillary. The agency now has to redeem itself.” .. How remains to be seen. Like Roberts, I’m puzzled. Washington power brokers chose Hillary to succeed Obama. Enormous resources, energy, corporate pollsters consistently showing her ahead, and one-sided scoundrel media support have gone into assuring it. .. Have things changed days before November 8? Are power brokers abandoning Hillary this late in the game? The last 48 hours have been breathtaking – the stuff Hollywood thrillers are made of. Will Hillary supporters blame Russia for Comey’s action? One Democrat congressman suggested it. Will Comey be accused of being a Kremlin agent? .. However things unfold in the campaign’s final days, Trump got a significant boost – whether enough for a “master of suspense” Alfred Hitchcock ending remains to be seen. My view, right or wrong, remains the same. After going all-out for Hillary throughout months of campaigning, it’s hard believing power brokers decided otherwise this late in the game – unheard of in US electoral politics. .. At the same time, this political season has been unlike any I remember since the 1940s. Nothing ahead will surprise me. NOTE: ALL IMAGE CAPTIONS, PULL QUOTES AND COMMENTARY BY THE EDITORS, NOT THE AUTHORS ABOUT THE AUTHOR STEPHEN LENDMAN lives in Chicago. He can be reached at lendmanstephen@sbcglobal.net . His new book as editor and contributor is titled “Flashpoint in Ukraine: US Drive for Hegemony Risks WW III.” ( http://www.claritypress.com/LendmanIII.html ) Visit his blog site at sjlendman.blogspot.com . =SUBSCRIBE TODAY! NOTHING TO LOSE, EVERYTHING TO GAIN.= free • safe • invaluable If you appreciate our articles, do the right thing and let us know by subscribing. It’s free and it implies no obligation to you— ever. We just want to have a way to reach our most loyal readers on important occasions when their input is necessary. In return you get our email newsletter compiling the best of The Greanville Post several times a week. [email-subscribers namefield=”YES” desc=”” group=”Public”]'"}, "time": 1742562548.5073593}