{"duration": 0.11084342002868652, "input_args": {"text": "'Among the senseless beatings inflicted on reality during the presidential debate on Monday night was the discussion of New York City’s    tactics. Donald J. Trump attributed a nonexistent increase in murder to actions that never happened, namely, the ending of the    practice by, variously, “a judge, who was a very   judge,” and the “current mayor. ” This was multilayered fiction. Murder declined. A judge did not end   . Neither did the current mayor. In fact, the Police Department began to drastically curtail its use in 2012, under the administration of Mayor Michael R. Bloomberg, an independent. This is well documented but only lightly noticed. On July 9, 2012, an editorial in The New York Post warned that the reduction in its use would lead to “more blood in the street. ” By the way, did more blood run in the street? No, less blood did. Murder is down 32 percent since 2011, the last year of the old    era, having dropped to 352 homicides in 2015 from 515 in 2011. In the same period, stops were down by about 97 percent, said J. Peter Donald, a spokesman for the department. During the debate, Hillary Clinton, the Democratic nominee, alluded to a few of these numbers. Mr. Trump, her Republican opponent, started shouting. “Under the current mayor, crime has continued to drop, including murders,” she said. “So there is  —   —  ” “No, you’re wrong,” Mr. Trump interjected. “You’re wrong. ” “No, I’m not,” Mrs. Clinton said. “Murders are up, all right,” Mr. Trump said. “You check it. ” All right, as Mr. Trump said, let’s check it. A Google search for “Historical New York City Crime Data” will bring you to a site with charts of serious felonies. Frisks went down. So has murder, a steady decline that has continued, with slight annual variations, through this year. In the     used by Mr. Trump, those details land upside down. Also, he repeated a more common mistake about the decline of the    tactics, attributing it to a federal judge hearing a   lawsuit against the city, and to Mayor Bill de Blasio, a Democrat, who succeeded Mr. Bloomberg in 2014. “It was terminated by the current mayor,” Mr. Trump said. Actually, no. Last year, the city police conducted 22, 939 stops, or about 63 a day. So    was not terminated by Mr. de Blasio, or by anyone else for that matter. It’s true that the use of the tactic has declined. During the mayoralty of Mr. Bloomberg, the number of reported stops skyrocketed, but then was scaled back as the city faced pressure from the   litigation, brought by the New York Civil Liberties Union and the Center for Constitutional Rights. By the end of 2013, the year Shira A. Scheindlin, the federal judge hearing the case, ruled that the city’s wholesale search practices violated the Constitution, the number of stops had declined by 72 percent from its peak in 2011. “But    had a tremendous impact on the safety of New York City,” Mr. Trump said during the debate. “Tremendous beyond belief. So when you say it has no impact, it really did. It had a very, very big impact. ” During the era praised by Mr. Trump, about 90 percent of the people who were stopped were young black or Latino men who had committed no crime whatsoever, according to police data. Of those few who were arrested, the vast majority were charged with nothing more serious than possession of marijuana, not having guns. Hundreds of thousands of innocent people were being stopped every year so that the city could arrest tens of thousands for having weed. Applied almost exclusively to minorities, the    tactics in New York became an elephantine government project that wasted time and money, degrading both to the personhood of the men and women who were stopped and to the professionalism of the people doing the stopping. It was poor social hygiene, not defensible as a matter of law or as effective law and order. As Mr. Trump said, it was “tremendous beyond belief. ” Just so.'"}, "time": 1742564074.9403868}