{"duration": 0.12203168869018555, "input_args": {"text": "'By Dean Baker, the co-founder of CEPR. Originally published at the Institute for New Economic Thinking website \\nGlobalization and technology are routinely cited as drivers of inequality over the last four decades. While the relative importance of these causes is disputed, both are often viewed as natural and inevitable products of the working of the economy, rather than as the outcomes of deliberate policy. In fact, both the course of globalization and the distribution of rewards from technological innovation are very much the result of policy. Insofar as they have led to greater inequality, this has been the result of conscious policy choices. \\nStarting with globalization, there was nothing pre-determined about a pattern of trade liberalization that put U.S. manufacturing workers in direct competition with their much lower paid counterparts in the developing world. Instead, that competition was the result of trade pacts written to make it as easy as possible for U.S. corporations to invest in the developing world to take advantage of lower labor costs, and then ship their products back to the United States. The predicted and actual result of this pattern of trade has been to lower wages for manufacturing workers and non-college educated workers more generally, as displaced manufacturing workers crowd into other sectors of the economy. \\nInstead of only putting manufacturing workers into competition with lower-paid workers in other countries, our trade deals could have been crafted to subject doctors, dentists, lawyers and other highly-paid professionals to international competition. As it stands, almost nothing has been done to remove the protectionist barriers that allow highly-educated professionals in the United States to earn far more than their counterparts in other wealthy countries. \\nThis is clearest in the case of doctors. For the most part, it is impossible for foreign-trained physicians to practice in the United States unless they have completed a residency program in the United States. The number of residency slots, in turn, is strictly limited, as is the number of slots open for foreign medical students. While this is a quite blatantly protectionist restriction, it has persisted largely unquestioned through a long process of trade liberalization that has radically reduced or eliminated most of the barriers on trade in goods. The result is that doctors in the United States earn an average of more than $250,000 a year, more than twice as much as their counterparts in other wealthy countries. This costs the country roughly $100 billion a year in higher medical bills compared to a situation in which U.S. doctors received the same pay as doctors elsewhere. Economists, including trade economists, have largely chosen to ignore the barriers that sustain high professional pay at enormous economic cost. \\nIn addition to the items subject to trade, the overall trade balance is also very much the result of policy choices. The textbook theory has capital flowing from rich countries to poor countries, which means that rich countries run trade surpluses with poor countries. While this accurately described the pattern of trade in the 1990s up until the East Asian financial crisis (a period in which the countries of the region enjoyed very rapid growth), in the last two decades developing countries taken as a whole have been running large trade surpluses with wealthy countries. \\nThis implies large trade deficits in rich countries, especially the United States, which in turn has meant a further loss of manufacturing jobs with the resulting negative impact on wage inequality. However, there was nothing inevitable about the policy shifts associated with the bailout from the East Asian financial crisis that led the developing world to become a net exporter of capital. \\nThe pattern of gains from technology has been even more directly determined by policy than is the case with gains from trade. There has been a considerable strengthening and lengthening of patent and copyright and related protections over the last four decades. The laws have been changed to extend patents to new areas such as life forms, business methods, and software. Copyright duration has been extended from 55 years to 95 years. Perhaps even more important, the laws have become much more friendly to holders of these property claims to tilt legal proceedings in their favor, with courts becoming more patent-friendly and penalties for violations becoming harsher. And, the United States has placed stronger intellectual property (IP) rules at center of every trade agreement negotiated in the last quarter century. \\nIn this context, it would hardly be surprising if the development of “technology” was causing an upward redistribution of income. The people in a position to profit from stronger IP rules are almost exclusively the highly educated and those at the top end of the income distribution. It is almost definitional that stronger IP rules will result in an upward redistribution of income. \\nThis upward redistribution could be justified if stronger IP rules led to more rapid productivity growth, thereby benefitting the economy as a whole. However, there is very little evidence to support that claim. Michele Boldrin and David Levine have done considerable research on this topic and generally found the opposite. My own work, using cross-country regressions with standard measures of patent strength, generally found a negative and often significant relationship between patent strength and productivity growth. \\nThere is also a substantial amount of money at stake. In the case of prescription drugs alone, the United States is on path to spend more than $430 billion in 2016 for drugs that would likely cost one-tenth of this amount in the absence of patent and related protections. While we do need mechanisms for financing innovation and creative work, it is almost certainly the case that patent and copyright monopolies as currently structured are not the most efficient route, even if their negative consequences for distribution are quite evident. \\nThe structuring of trade and rules on IP are two important ways in which policy has been designed to redistribute income upward over the last four decades. There are many other ways in which the market has been structured to disadvantage those at the middle and bottom of the income distribution, perhaps most notably macroeconomic policies that result in high unemployment. While tax and transfer policies that reduce poverty and inequality may be desirable, we should also be aware of the ways in which policy has been designed to increase inequality. It is much easier to have an economic system that produces more equality rather than one that needlessly generates inequality, which we then try to address with redistributive policies. 0 2 0 0 0 0'"}, "time": 1742563543.133018}