{"duration": 0.08720016479492188, "input_args": {"text": "'WILMINGTON, N. C.  —   Donald J. Trump on Tuesday appeared to raise the possibility that gun rights supporters could take matters into their own hands if Hillary Clinton is elected president and appoints judges who favor stricter gun control measures. Repeating his contention that Mrs. Clinton wanted to abolish the right to bear arms, Mr. Trump warned at a rally here that it would be “a horrible day” if Mrs. Clinton were elected and got to appoint a tiebreaking Supreme Court justice. “If she gets to pick her judges, nothing you can do, folks,” Mr. Trump said, as the crowd began to boo. He quickly added: “Although the Second Amendment people  —   maybe there is, I don’t know. ” Oblique as it was, Mr. Trump’s remark quickly elicited a wave of condemnation from Democrats, gun control advocates and others, who accused him of suggesting violence against Mrs. Clinton or liberal jurists. Bernice A. King, daughter of the Rev. Dr. Martin Luther King Jr. called Mr. Trump’s words “distasteful, disturbing, dangerous. ” Mrs. Clinton’s running mate, Senator Tim Kaine of Virginia, expressed disbelief. “Nobody who is seeking a leadership position, especially the presidency, the leadership of the country, should do anything to countenance violence, and that’s what he was saying,” Mr. Kaine said in Austin, Tex. He called Mr. Trump’s remark “a window into the soul of a person who is just temperamentally not suited to the task. ” And Dan Gross, the president of the Brady Campaign and Center to Prevent Gun Violence, which has endorsed Mrs. Clinton, said Mr. Trump’s statement was “repulsive  —   literally using the Second Amendment as cover to encourage people to kill someone with whom they disagree. ” “For Trump, violence has become a standard talking point, a common punch line, and even a campaign strategy,” Mr. Gross said. Paul D. Ryan, the Republican House speaker who has had a tense relationship with Mr. Trump, told reporters on Tuesday night that the remarks sounded “like a joke gone bad. ” He added: “You should never joke about that. I hope he clears it up quickly. ” Mr. Trump and his campaign did not treat his remark as a joke instead, they insisted he was merely urging gun rights supporters to vote as a bloc against Mrs. Clinton. “The Second Amendment people have tremendous power because they are so united,” he told a CBS affiliate in North Carolina late Tuesday. In an interview with Fox News, Mr. Trump grew adamant. “There can be no other interpretation,” he said, adding, “I mean, give me a break. ” But at his rally earlier in the day, Mr. Trump had actually been discussing what could happen once Mrs. Clinton was president, not before the election. And even many in the audience seemed caught by surprise. Video showed a man just over Mr. Trump’s shoulder go   and turn to his companion, apparently in disbelief, when Mr. Trump made the remark. The uproar over Mr. Trump’s    remark came as his campaign has been faced with a series of public opinion surveys showing him quickly losing ground to Mrs. Clinton, and just a day after his campaign called his delivery of a prepared economic speech in Detroit, evidence of a newfound political discipline. Mr. Trump’s fellow opponents of gun control stood by him, focusing on his depiction of Mrs. Clinton as a threat to the Second Amendment. “Donald Trump is absolutely correct,” said Jennifer Baker, a strategist for the National Rifle Association. “If Hillary Clinton is elected, there is nothing we can do to stop her from nominating an   Supreme Court justice who will vote to overturn the individual right of   citizens to own a gun in their home for protection. ” The association also began running a new commercial characterizing Mrs. Clinton as “one of the wealthiest women in politics” and calling her a hypocrite for favoring gun restrictions while having been “protected by armed guards for 30 years. ” Her gun policies, the ad says, would leave ordinary people “defenseless. ” Veiled references to gun violence have tripped up candidates before. In 2010, Sharron Angle, a Nevada Republican challenging the Senate majority leader at the time, Harry Reid, severely damaged her unsuccessful candidacy while discussing the importance of the Second Amendment. “When you read that Constitution and the founding fathers, they intended this to stop tyranny,” she said, adding: “It’s to defend ourselves. And you know, I’m hoping that we’re not getting to Second Amendment remedies. I hope the vote will be the cure for the Harry Reid problems. ” Mrs. Clinton herself learned the hard way: In June 2008, shortly before she conceded defeat in her Democratic primary contest with Barack Obama, she defended her perseverance in a way that critics said alluded to the possibility that Mr. Obama could be gunned down. “We all remember Bobby Kennedy was assassinated in June in California,” Mrs. Clinton said. She apologized hours later. Mr. Trump did not repeat his violent insinuation at a later event in Fayetteville, N. C. But Senator Chris Murphy, Democrat of Connecticut, who has championed gun control since the Sandy Hook mass shooting in his state, called Mr. Trump’s remarks “disgusting and embarrassing and sad. ” “This isn’t play,” Mr. Murphy wrote. “Unstable people with powerful guns and an unhinged hatred for Hillary are listening to you, @realDonaldTrump. ” The condemnation from Mr. Trump’s critics across the political spectrum was deep. On Twitter, the conservative writer John Podhoretz, in a series of posts, wrote that Mr. Trump had implied that all Second Amendment supporters were “potential assassins. ” He added that a president’s words “CANNOT MEAN NOTHING. They are the most important words spoken in the world. ” And Representative Eric Swalwell, Democrat of California, wrote on Twitter that the Secret Service should investigate Mr. Trump for making a death threat against Mrs. Clinton: “Donald Trump suggested someone kill Sec. Clinton. We must take people at their word. ” A Secret Service spokesman, who refused to identify himself, said that the agency was “aware of the comments” but did not elaborate. Others seized on Mr. Trump’s remark as an occasion for mockery. Senator Elizabeth Warren, Democrat of Massachusetts, wrote on Twitter that Mr. Trump “makes death threats because he’s a pathetic coward who can’t handle the fact that he’s losing to a girl. ” Mr. Trump’s campaign events have grown increasingly vitriolic, with angry chants and jeers directed at Mrs. Clinton. People at his rallies have, with greater frequency, loudly called for violence against Mrs. Clinton  —   catcalls that Mr. Trump has generally let pass. And on Saturday, Mr. Trump praised his New Hampshire state   State Representative Al Baldasaro, who said recently that Mrs. Clinton deserved to face a firing squad over the F. B. I. ’s investigation of her use of a private email server while she was secretary of state. In Wilmington on Tuesday, chants of “lock her up,” which first gained traction during the Republican National Convention, were loud and frequent before Mr. Trump took the stage. But one speaker, former Mayor Rudolph W. Giuliani of New York, tried to tamp those down. “No, no, we’re here to beat her, and keep her out of Washington,” Mr. Giuliani said. He was interrupted by the same chant minutes later.'"}, "time": 1742562117.0700202}