{"duration": 1.3219482898712158, "input_args": {"text": "'Hillary Clinton is responsible for the death of Vince Foster – at least according to an astonishing WikiLeaks email. \\nVia Yournewswire \\n\\nThe email chain is part of the WikiLeaks’ Global Intelligence Files, over five millions emails from Stratfor, the Texas headquartered “global intelligence” company. In the email Matthew Powers tells Sean Noonan, “I thought Vince Foster was the only person the Clinton’s killed. How naive I was .”\\n\\nThe full email can be viewed here. \\nWikiLeaks.org was targeted by a massive DDoS attack late Sunday night. The website was taken offline minutes after the massive DNCLeak2 dump and WikiLeaks topics including Vince Foster began trending on Twitter.\\nTwitter was also taken offline in DDoS attack.\\nTwitter & #wikileaks both went down right when #VinceFoster and #DNCLeak2 started trending.\\nBecause of this email- https://t.co/TkvUxPtAHQ pic.twitter.com/BbqdmSzwU4 \\n— Deplorable Manon (@aristocratssoul) November 7, 2016 \\n\\nWas the DDoS attack an attempt at suppressing new information?\\nIn 1993, during the Clinton administration, Vince Foster, a personal friend of Hillary Clinton and Deputy White House Council, was found dead in his car. Though two investigators – Robert Fiske and Kenneth Starr – separately concluded that Foster shot himself and died, his suicide has long been considered suspicious.\\nNew evidence \\nRecently discovered evidence suggests Vince Foster did not commit suicide, but died of two gunshot wounds to the neck – not the one wound initially reported.\\nDiscovered in the files of the National Archives and Records Administration, Starr’s lead prosecutor Miguel Rodriguez submitted a 2-page resignation letter and a 31 page memo about the injuries Foster sustained. Rodriguez notes in the letter details about injuries around Foster’s neck which were not reported in official government documents.\\nAt the time, the FBI claimed that Foster’s neck injury photos were underexposed, and therefore useless to them. Rodriguez claims that after he produced additinal damning evidence of a possible Foster murder cover-up, he became a target and was investigated internally!\\nIn the letter, he explained twelve ways in which the case has mishandled and compromised. Then, he noted: “I steadfastly maintained, and continue to maintain, that I, at all times, conducted myself as an experienced and trained prosecutor, with years of federal prosecutorial experience and federal grand jury experience.”\\nThese records indicate Foster didn’t really die from one .38 caliber gunshot… but two gunshots! The other shot was on the right side of his neck, made by a “small caliber” bullet hole. This raises serious questions about Foster’s motives for suicide. He was tied to Hillary Clinton’s roles in White House scandals at Whitewater and the White House Travel Office.\\nHere is the new evidence in the Vince Foster case:\\n\\nThe Political Insider reports :\\nThe theory is, as Vince Foster was one of Hillary’s closest friends, he knew too much about these scandals. In fact, he may have had a romantic relationship with the then first-Lady.\\nFoster had been a long-time friend and companion to Hillary. The two shared a brokerage account called Midlife Partners. When Barbara Walters asked Hillary if she had been having an affair with Vince Foster, Hillary lowered her eyes and told the 20/20 cameras, “He was a very special man.” When he died, Hillary said publicly that Vince Foster was the last person who would have committed suicide. Friends reported she was genuinely shocked and aggrieved.\\nWhy, then, did Hillary lie under oath about the last time she saw Vince Foster?\\nTestifying before the Office of the Independent Counsel (OIC) in 1994, she claimed that the last time she had spoken to Vince Foster was on the phone “the Friday or Saturday before Father’s Day.” Yet documents from the National Archives, acquired by the New York Megaphone, show that Foster’s assistant, Tom Castleton, reported he “saw Hillary Clinton in Foster’s office approximately four times during the five weeks he was employed.” Castleton didn’t start working for Foster until after Father’s Day, 1993.\\nAccording to Ambrose Evans-Pritchard in a 1996 Telegraph (UK) article, Hillary Clinton asked Vince Foster to help her spy on her libertine husband in 1990. Foster hired Jerry Parks, an Arkansas investigator who later worked as the head of security for the Clinton/Gore campaign. According to Parks’s widow, “Jerry asked Vince why he needed this stuff on Clinton. He said he needed it for Hillary.” When Vince Foster showed up dead in a Washington-area public park in the summer of 1993, Parks was terrified. Two months later Parks was shot nine times at close range, at a stoplight, in his SUV, in Little Rock. Parks’s home was then raided by eight Federal agents, including officers from the FBI, IRS, Secret Service, and (unusual for a domestic case) the CIA.\\nIf true, this means Vince Foster was murdered to make sure he didn’t tell the world what he knew about President Bill Clinton and his wife Hillary. He was too honest, and therefore couldn’t be trusted anymore.\\nThis is actually worse than transmitting classified documents on a home email server… This is murder!\\n'"}, "time": 1742563752.75963}