{"duration": 0.18616914749145508, "input_args": {"text": "'ENTER HELENThe Invention of Helen Gurley Brown and the Rise of the Modern Single WomanBy Brooke HauserIllustrated. 462 pp.   Publishers. $28. 99. NOT PRETTY ENOUGHThe Unlikely Triumph of Helen Gurley BrownBy Gerri HirsheyIllustrated. 500 pp. Sarah Crichton   Straus  Giroux. $27. Provocation does not age well. Those who succeed make it difficult to appreciate how radical they were. When Helen Gurley Brown published “Sex and the Single Girl” in 1962, her frankness about the fact that unmarried women had sex  —   and liked it  —   shocked reviewers and sold millions of copies. When she took over Cosmopolitan in 1965, staff members grumbled. But over the 32 years she served as editor in chief, her message  became mainstream. “There is a catch to achieving single bliss,” Brown told her “Single Girl” readers. “You have to work like a son of a bitch. ” Cosmo reiterated that any girl could diet, exercise, groom, shop, flirt and sleep her way into having it all  —   another phrase that Brown helped make ubiquitous. The trick was indefatigability. Today, when career advisers exhort us to “do what you love, and love what you do” and pop songs tell us to “work it,” to be sexy at work and to work at being sexy not only isn’t shocking it’s expected. This may be why, four years after her death at the age of 90, Helen Gurley Brown is experiencing something of a revival. Matthew Weiner, the creator of “Mad Men,” frequently cited “Sex and the Single Girl” as a source of inspiration and urged writers for the show to read it. In the introduction to her 2014 memoir “Not That Kind of Girl,” Lena Dunham identified Brown as a key influence. The   pilot that Dunham is currently developing for HBO revolves around a writer for women’s magazines during the early years of   feminism. A play based on Brown’s life is also in the works. Now, two new biographies of Helen Gurley Brown have arrived within months of each other: “Enter Helen,” by Brooke Hauser, a contributing writer at Allure and “Not Pretty Enough,” by the longtime culture journalist Gerri Hirshey. (The feature film rights for “Enter Helen” were  optioned before the book was even finished.) Both books draw heavily on the personal papers that Brown bequeathed to Smith College, as well as published works by Brown and her husband, the film producer David Brown. Both authors interviewed colleagues, friends and the few relatives who survived Helen. And both highlight the exhausting feedback loop between her anxieties and her ambition. Hauser and Hirshey are not the first. In her 2009 biography “Bad Girls Go Everywhere,” the gender and women’s studies professor Jennifer Scanlon presented a rigorous assessment of the relationship between   “Gurley girl feminism” and the more privileged precincts of the women’s movement. “Enter Helen” and “Not Pretty Enough” offer engaging takes on Brown’s life for a popular audience. “Enter Helen” focuses on the 1960s and 1970s, the decades when Hauser’s heroine took off. Hauser lifted the title from a repeated stage direction in a musical that Brown tried to write about her own life, and the book has the   footed and slightly manic quality of a revue. Most chapters run only a few pages. All are signposted with dates and epigraphs. We enter in medias res, shortly before Helen married David, and follow her rise for 165 pages before flashing back to her childhood in Arkansas. “Genteel poor” was a phrase Helen used to describe it. She felt a keen need to compensate for her “mouseburger” origins for the rest of her life. “Her insecurity was cellular,” Hauser writes. It was also her great selling point. The improbability of her success proved that her   methods worked. Throughout, Hauser weaves in  passages connecting Brown to her contemporaries and the cultural landscape of the 1960s. These side glances not only help situate her life in the context of its times. They remind us of how many of her stances were truly progressive  —   her vocal support of access to contraception and legal abortion, for instance. They also offer amusing glimpses into friendships and catty contretemps. We learn that Hugh Hefner was an early ally and that Gloria Steinem was often dismissive. Joan Didion was agnostic. A 1965 profile by Didion, published in The Saturday Evening Post, observed that Brown seemed mostly “very tired. ” Gerri Hirshey’s “Not Pretty Enough” presents a narrower, but deeper, perspective. As Hirshey states in her introduction, her book is concerned more with the character and psychology of its protagonist than with her cultural surroundings. Where Hauser’s method is montage, Hirshey suggests her own approach is  “pointillist. ” “Not Pretty Enough” begins with contemporary reminiscences before it dissolves, like a classic Hollywood flashback, to 1893, when Brown’s mother, Cleo Sisco, was born in the Ozarks. Brown’s father died in a freak elevator accident in June 1932, when Helen was only 10 and her sister, Mary, was 14. Their childhood was impoverished and itinerant. Cleo moved her daughters across state lines several times before settling in Los Angeles and remarrying. Mary was afflicted by polio, while Helen suffered from disfiguring acne. Hirshey makes a strong case that the “intimate rituals of utter frustration and despair” that Brown shared with her hapless mother, along with her idealization of her dead father, shaped her forever. Indeed, they may have shaped the entire Cosmopolitan empire: “Cleo’s basic   message was a dour version of the one Helen would banner with   cheer in her own best sellers and in her magazine: Honey, do the best with what you have. ” Hirshey’s psychological insights into Brown’s childhood, as well as the book’s treatment of Brown’s long partnership with her husband, deepen and complicate the plucky image that Brown projected in public. Given how fixated she was on the connections between sex appeal and success, it’s unsurprising she struggled as she got older. After her death, Brown was treated with the special cruelty that our culture reserves for women who do not know when to desist from trying to be desirable. Even her obituary in The Times included a snide remark: “She was 90, though parts of her were considerably younger. ” Hauser speeds over Brown’s twilight, when she turned into a grim caricature of herself, the emaciated octogenarian in fishnets doling out oral sex tips and saying reprehensibly ignorant things about H. I. V. and sexual harassment. “For all her confessions,” Hauser concludes, “Helen remained unknowable, even to those who knew her best. ” Hirshey lingers over the denouement, taking several chapters to chronicle Helen’s later years as the editor of Cosmopolitan’s international editions, her declining health, her    weight gain and her stunned grief after the death of David. When people asked how she was dealing with it, she offered a pantomime of nonchalance that sounds like a kind of despair: “Well, I come to work every day. ” “Write the way you speak,” Brown admonished, and for better or worse, both Hauser and Hirshey use prose strongly inflected  —   you might even say infected  —   with Brown’s own idioms and idiosyncrasies. “Was he riding on his wife’s coattails?” Hauser writes of David Brown. “Absolutely! And why not? She had ridden on his. ” The new Cosmo that he and Helen cooked up would consist of “frank discussions about sex, money, careers, apartments, fashion and beauty  —   oh, and men, men, men. ” The prose of “Not Pretty Enough” is less cartoonish, but Hirshey’s attempts to ventriloquize sometimes verge on pastiche. She describes one early lover as “a Wow” and a title Brown wrote as “a   grabber. ” From time to time, Hirshey adopts the kind of   innuendo Cosmo favored. Helen’s speaking voice was “well suited to the dark, whispery in tone, pleasant and   with a musky minor note of boudoir. ” These biographies convey the sense of desperation that attended someone whose success depended so fundamentally on  . “Enter Helen” shows Brown trying to become everything anyone else wanted. She insisted that she loved sex even when she did not orgasm: “It was the most marvelous feeling because, my goodness, he was looking at me, at me. ” “Relax chin, stay at 105 pounds . ’u2008. ’u2008. torture!” was her New Year’s resolution for years. “Not Pretty Enough” announces this central problem in the title. Yet neither book quite answers the deepest questions it poses. Why does Helen Gurley Brown matter now? Why does her story feel so timely? Hauser, despite her vivid treatment of Steinem and Betty Friedan, simply neglects to discuss contemporary feminism. Hirshey, from the outset, dismisses questions about Brown’s legacy the way she imagines Brown herself would: “Aw, pippy poo. ” “I do find much of the revisionist analysis and H. G. B.   to be tedious, solipsistic and drearily beside the point,” Hirshey sighs. It’s a standard kind of complaint for popular writers to lob at academics. But refusing to situate Brown in the current context seems like a missed opportunity. The past few years have seen a powerful revival of feminism in the United States, along with its commercial acceptance  —   or, depending on your perspective, its appropriation. In “Bad Girls Go Everywhere,” Scanlon presented Brown as a complicated feminist figure: Cosmopolitan may have been crass, but it also disseminated feminist messages to a   audience whom the canonical front of the women’s movement didn’t reach. These two biographies matter precisely because Brown’s life and career anticipated the tensions that countless women are talking about now. She offered a blueprint for success in a sexist world, telling readers how to game a system that was set up to exploit them. Was this the right approach? Whatever your answer, this is the same debate we are still having about the most powerful women in America, from Hillary Clinton to Beyoncé. Paradoxically, the most prominent heir to Brown’s     feminism may be Sheryl Sandberg. In a 1982 interview with Gloria Steinem, Brown conceded that women faced obstacles specific to their gender, but, she insisted: “You can do pretty well anyway. You can rise above it. ” Sandberg hardly shares Brown’s mouseburger origins, but in “Lean In” she delivers a message Brown would have recognized. “We can reignite the revolution by internalizing the revolution,” Sandberg promises. A girl can hope, and as Brown knew, hope sells eternal.'"}, "time": 1742562983.3231936}