{"duration": 0.1841425895690918, "input_args": {"text": "\"Waking Up in Hillary Clinton’s America Wall Street in the Saddle Email This Page to Someone Your Name Here's something interesting from The Unz Review... Recipient Name Recipient Email => \\nAs this endless election limps toward its last days, while spiraling into a bizarre duel over vote-rigging accusations, a deep sigh is undoubtedly in order. The entire process has been an emotionally draining, frustration-inducing, rage-inflaming spectacle of repellent form over shallow substance. For many, the third debate evoked fatigue. More worrying, there was again no discussion of how to prevent another financial crisis, an ominous possibility in the next presidency, whether Donald Trump or Hillary Clinton enters the Oval Office — given that nothing fundamental has been altered when it comes to Wall Street’s practices and predation. \\nAt the heart of American political consciousness right now lies a soul-crushing reality for millions of distraught Americans: the choices for president couldn’t be feebler or more disappointing. On the one hand, we have a petulant, vocabulary-challenged man-boar of a billionaire, who hasn’t paid his taxes, has regularly left those supporting him holding the bag , and seems like a ludicrous composite of every bad trait in every bad date any woman has ever had. On the other hand, we’re offered a walking photo-op for and well-paid speechmaker to Wall-Street CEOs, a one-woman money-raising machine from the 1% of the 1%, who, despite a folksiness that couldn’t look more rehearsed, has methodically outplayed her opponent. \\nWith less than two weeks to go before E-day — despite the Trumptilian upheaval of the last year — the high probability of a Clinton win means the establishment remains intact. When we awaken on November 9th, it will undoubtedly be dawn in Hillary Clinton’s America and that potentially means four years of an economic dystopia that will (as would Donald Trump’s version of the same) leave many Americans rightfully anxious about their economic futures. \\nNone of the three presidential debates suggested that either candidate would have the ability (or desire) to confront Wall Street from the Oval Office. In the second and third debates, in case you missed them, Hillary didn’t even mention the Glass-Steagall Act, too big to fail, or Wall Street. While in the first debate, the subject of Wall Street only came up after she disparaged the tax policies of “ Trumped-up, trickle down economics ” (or, as I like to call it, the Trumpledown economics of giving tax and financial benefits to the rich and to corporations). \\nIn this election, Hillary has crafted her talking points regarding the causes of the last financial crisis as weapons against Trump, but they hardly begin to tell the real story of what happened to the American economy. The meltdown of 2007-2008 was not mainly due to “tax policies that slashed taxes on the wealthy” or a “failure to invest in the middle class,” two subjects she has repeatedly highlighted to slam the Republicans and their candidate. It was a byproduct of the destruction of the regulations that opened the way for a too-big-to-fail framework to thrive. Under the presidency of Bill Clinton, Glass-Steagall, the Depression-era act that once separated people’s bank deposits and loans from any kind of risky bets or other similar actions in which banks might engage, was repealed under the Financial Modernization Act of 1999. In addition, the Commodity Futures Modernization Act was passed, which allowed Wall Street to concoct devastating unregulated side bets on what became the subprime crisis. \\nGiven that the people involved with those choices are still around and some are still advising (or in the case of one former president living with) Hillary Clinton, it’s reasonable to imagine that, in January 2017, she’ll launch the third term of Bill Clinton when it comes to financial policy, banks, and the economy. Only now, the stakes are even higher, the banks larger, and their impunity still remarkably unchallenged. \\nConsider President Obama’s current treasury secretary, Jack Lew. It was Hillary who hit the Clinton Rolodex to bring him back to Washington. Lew first entered Bill Clinton’s White House in 1993 as special assistant to the president. Between his stints working for Clinton and Obama, he made his way into the private sector and eventually to Wall Street — as so many of his predecessors had done and successors would do. He scored a leadership role with Citigroup during the time that Bill Clinton’s former Treasury Secretary (and former Goldman Sachs co-Chairman ) Robert Rubin was on its board of directors. In 2009 , Hillary selected him to be her deputy secretary of state. \\nLew is hardly the only example of the busy revolving door to power that led from the Clinton administration to the Obama administration via Wall Street (or activities connected to it). Bill Clinton’s Treasury Under Secretary for International Affairs , Timothy Geithner worked with Robert Rubin, later championed Wall Street as president and CEO of the New York Federal Reserve while Hillary was senator from New York (representing Wall Street), and then became Obama’s first treasury secretary while Hillary was secretary of state . \\nOne possible contender for treasury secretary in a new Clinton administration would be Bill Clinton’s Under Secretary of Domestic Finance and Obama’s Commodity Futures Trading Commission chairman, Gary Gensler (who was — I’m sure you won’t be shocked — a Goldman Sachs partner before entering public service). These, then, are typical inhabitants of the Clinton inner circle and of the political-financial corridors of power. Their thinking, like Hillary’s, meshes well with support for the status quo in the banking system, even if, like her, they are willing on occasion to admonish it for its “mistakes.” \\nThis thru-line of personnel in and out of Clinton World is dangerous for most of the rest of us, because behind all the “talking heads” and genuinely amusing Saturday Night Live skits about this bizarre election lie certain crucial issues that will have to be dealt with: decisions about climate change, foreign wars, student-loan unaffordability, rising income inequality , declining social mobility , and, yes, the threat of another financial crisis. And keep in mind that such a future economic meltdown isn’t an absurdly long-shot possibility. Earlier this year, the Federal Reserve, the nation’s main bank regulator, and the Federal Deposit Insurance Corporation , the government entity that insures our bank deposits, collectively noted that seven of our biggest eight banks — Citigroup was the exception — still have inadequate emergency plans in the event of another financial crisis. \\nExploring a Two-Faced World \\nPoliticians regularly act one way publicly and another privately, as Hillary was “outed” for doing by WikiLeaks via its document dump from Clinton campaign manager John Podesta’s hacked email account. Such realities should be treated as neither shockers nor smoking guns. Everybody postures. Everybody lies. Everybody’s two-faced in certain aspects of their lives. Politicians just make a career out of it. \\nWhat’s problematic about Hillary’s public and private positions in the economic sphere, at least, isn’t their two-facedness but how of a piece they are. Yes, she warned the bankers to “ cut it out ! Quit foreclosing on homes! Quit engaging in these kinds of speculative behaviors!” — but that was no demonstration of strength in relation to the big banks. Her comments revealed no real understanding of their precise role in exacerbating a fixable subprime loan calamity and global financial crisis, nor did her finger-wagging mean anything to Wall Street. \\nKeep in mind that, during the build-up to that crisis, as banks took advantage of looser regulations, she collected more than $7 million from the securities and investment industry for her New York Senate runs ( $18 million during her career). In her first Senate campaign, Citigroup was her top contributor. The four Wall-Street-based banks (JPMorgan Chase, Citigroup, Goldman Sachs, and Morgan Stanley) all feature among her top 10 career contributors. As a senator, she didn’t introduce any bills aimed at reforming or regulating Wall Street. During the lead-up to the financial crisis of 2007-2008, she did introduce five (out of 140) bills relating to the housing crisis, but they all died before making it through a Senate committee. So did a bill she sponsored to curtail corporate executive compensation. Though she has publicly called for a reduction in hedge-fund tax breaks (known as “closing the carried interest loophole”), including at the second debate , she never signed on to the bill that would have done so (one that Obama co-sponsored in 2007). Perhaps her most important gesture of support for Wall Street was her vote in favor of the $700 billion 2008 bank bailout bill. (Bernie Sanders opposed it.) \\nAfter her secretary of state stint, she returned to the scene of banking crimes. Many times. As we know, she was also paid exceedingly well for it. Friendship with the Clintons doesn’t come cheap . As she said in October 2013, while speaking at a Goldman Sachs AIMS Alternative Investments’ Symposium, “running for office in our country takes a lot of money, and candidates have to go out and raise it. New York is probably the leading site for contributions for fundraising for candidates on both sides of the aisle.” \\nBetween 2013 and 2015, she gave 12 speeches to Wall Street banks, private equity firms, and other financial corporations, reaping a whopping $2,935,000 for them. In her 2016 presidential run, the securities and investment sector (aka Wall Street) has contributed the most of any industry to PACs supporting Hillary: $56.4 million . \\nYes, everybody needs to make a buck or a few million of them. This is America after all, but Hillary was a political figure paid by the same banks routinely getting slapped with criminal settlements by the Department of Justice. In addition, the Clinton Foundation counted as generous donors all four of the major Wall Street-based mega-banks. She was voracious when it came to such money and tone-deaf when it came to the irony of it all. \\nGlass-Steagall and Bernie Sanders \\nOne of the more illuminating aspects of the Podesta emails was a series of communications that took place in the fall of 2015. That’s when Bernie Sanders was gaining traction for, among other things, his calls to break up the big banks and resurrect the Glass-Steagall Act of 1933. The Clinton administration’s dismantling of that act in 1999 had freed the big banks to use their depositors’ money as collateral for risky bets in the real estate market and elsewhere, and so allowed them to become ever more engorged with questionable securities. \\nOn December 7, 2015, with her campaign well underway and worried about the Sanders challenge, the Clinton camp debuted a key Hillary op-ed , “How I’d Rein in Wall Street,” in the New York Times . This followed two months of emails and internal debate within her campaign over whether supporting the return of Glass-Steagall was politically palatable for her and whether not supporting it would antagonize Senator Elizabeth Warren. In the end, though Glass-Steagall was mentioned in passing in her op-ed, she chose not to endorse its return. \\nShe explained her decision not to do so this way (and her advisers and media apostles have stuck with this explanation ever since): \\n“Some have urged the return of a Depression-era rule called Glass-Steagall , which separated traditional banking from investment banking. But many of the firms that contributed to the crash in 2008, like A.I.G. and Lehman Brothers, weren’t traditional banks, so Glass-Steagall wouldn’t have limited their reckless behavior. Nor would restoring Glass-Steagall help contain other parts of the ‘shadow banking’ sector, including certain activities of hedge funds, investment banks, and other non-bank institutions.” \\nHer entire characterization of how the 2007-2008 banking crisis unfolded was — well — wrong. Here’s how traditional banks (like JPMorgan Chase) operated: they lent money to investment banks like Lehman Brothers so that they could buy more financial waste products stuffed with subprime mortgages that these traditional banks were, in turn, trying to sell. They then backed up those toxic financial products through insurance companies like AIG, which came close to collapse when what it was insuring became too toxically overwhelming to afford. AIG then got a $182 billion government bailout that also had the effect of bailing out those traditional banks (including Goldman Sachs and Morgan Stanley, which became “traditional” during the crisis). In this way, the whole vicious cycle started with the traditional banks that hold your deposits and at the same time could produce and sell those waste products thanks to the repeal of Glass-Steagall. So yes, the loss of that act caused the crisis and, in its wake, every big traditional bank was fined for crisis-related crimes. \\nHillary won’t push to bring back Glass-Steagall. Doing so would dismantle her husband’s legacy and that of the men he and she appointed to public office. Whatever cosmetic alterations may be in store, count on that act remaining an artifact of the past, since its resurrection would dismay the bankers who, over the past three decades, made the Clintons what they are. \\nNo wonder many diehard Sanders supporters remain disillusioned and skeptical — not to speak of the fact that their candidate featured dead last ( 39th ) on a list of recommended vice presidential candidates in the Podesta emails. That’s unfortunately how much his agenda is likely to matter to her in the Oval Office. \\nGo Regulate Yourselves! \\nBefore he resigned with his nine-figure golden parachute, Wells Fargo CEO and Chairman John Stumpf addressed Congress over disclosures that 5,300 of his employees had created two million fake accounts, scamming $2.4 million from existing customers. The bank was fined $ 185 million for that (out of a total $10 billion in fines for a range of other crimes committed before and during the financial crisis). \\nIn response, Hillary wrote a letter to Wells Fargo’s customers. In it, she didn’t actually mention Stumpf by name, as she has not mentioned any Wall Street CEO by name in the context of criminal activity. Instead, she simply spoke of “he.” As she put it, “He owes all of you a clear explanation as to how this happened under his watch.” She added, “Executives should be held individually accountable when rampant illegal activity happens on their watch.” \\nShe does have a plan to fine banks for being too big, but they’ve already been fined repeatedly for being crooked and it hasn’t made them any smaller or less threatening. As their top officials evidently view the matter, paying up for breaking the law is just another cost of doing business. \\nHillary also wrote, “If any bank can’t be managed effectively, it should be broken up.” But the question is: Why doesn’t ongoing criminal activity that threatens the rest of us correlate with ineffective management — or put another way, when was the last time you saw a major bank broken up? And don’t hold your breath for that to happen in a new Clinton administration either. \\nIn her public letter, she added , “I’ll appoint regulators who will stand with taxpayers and consumers, not with big banks and their friends in Congress.” On the other hand, at that same Goldman Sachs symposium , while in fundraising mode, she gave bankers a pass relative to regulators and commented: “Well, I represented all of you for eight years. I had great relations and worked so close together after 9/11 to rebuild downtown, and [I have] a lot of respect for the work you do and the people who do it.” \\nShe has steadfastly worked to craft explanations for the financial crisis and the Great Recession that don’t endanger the banks as we presently know them. In addition, she has supported the idea of appointing insider regulators, insisting that “the people that know the industry better than anybody are the people who work in the industry.” (Let’s not forget that former Goldman Sachs CEO and Chairman Hank Paulson ran the Treasury Department while the crisis brewed.) \\nAmong the emails sent to John Podesta that were posted by WikiLeaks is an article I wrote for TomDispatch on the Clintons’ relationships with bankers. “She will not point fingers at her friends,” I said in that piece in May 2015. She will not chastise the people who pay her hundreds of thousands of dollars a pop to speak or the ones who have long shared the social circles in which she and her husband move.” I also suggested that she wouldn’t call out any CEO by name. To this day she hasn’t. I said that she would never be an advocate for Glass-Steagall. And she hasn’t been. What was true then will be no less true once she’s in the White House and no longer has to make gestures toward the platform on which Bernie ran and so can once again more openly embrace the bankers’ way of conducting business. \\nThere’s a reason Wall Street has a crush on her and its monarchs like Goldman Sachs CEO and Chairman Lloyd Blankfein pay her such stunning sums to offer anodyne remarks to their employees and others. Blankfein has been coy about an official Clinton endorsement simply because he doesn’t want to rock her campaign boat, but make no mistake, this Wall Street kingpin’s silence is tantamount to an endorsement. \\nTo date, $10 trillion worth of assets sits on the books of the Big Six banks. Since 2008, these same banks have copped to more than $ 150 billion in fines for pre-crisis behavior that ranged on the spectrum of criminality from manipulating multiple public markets to outright fraud. Hillary Clinton has arguably taken money that would not have been so available if it weren’t for the ill-gotten gains those banks secured. In her usual measured way, albeit with some light admonishments, she has told them what they want to hear: that if they behave — something that in her dictionary of definitions involves little in the way of personalized pain or punishment — so will she. \\nSo let’s recap Hillary’s America, past, present, and future. It’s a land lacking in meaningful structural reform of the financial system, a place where the big banks have been, and will continue to be, coddled by the government. No CEO will be jailed, no matter how large the fines his bank is saddled with or how widespread the crimes it committed. Instead, he’s likely to be invited to the inaugural ball in January. Because its practices have not been adequately controlled or curtailed, the inherent risk that Wall Street poses for Main Street will only grow as bankers continue to use our money to make their bets. (The 2010 Dodd-Frank Act was supposed to help on this score, but has yet to make the big banks any smaller.) \\nAnd here’s an obvious corollary to all this: the next bank-instigated economic catastrophe will not be dealt with until it has once again crushed the financial stability of millions of Americans. \\nThe banks have voted with their dollars on all of this in multiple ways. Hillary won’t do anything to upset that applecart. We should have no illusions about what her presidency would mean from a Wall Street vs. Main Street perspective. Certainly, JPMorgan Chase CEO Jamie Dimon doesn’t. He effectively endorsed Hillary before a crowd of financial industry players, saying , “I hope the next president, she reaches across the aisle.” \\nFor Wall Street, of course, that aisle is essentially illusory, since its players operate so easily and effectively on both sides of it. In Hillary’s America, Wall Street will still own Main Street. \\nNomi Prins, a TomDispatch regular , is the author of six books. Her most recent is All the Presidents’ Bankers: The Hidden Alliances That Drive American Power (Nation Books). She is a former Wall Street executive. Special thanks go to researcher Craig Wilson for his superb work on this piece. (Reprinted from TomDispatch by permission of author or representative)\""}, "time": 1742628490.7329493}