{"duration": 0.04987478256225586, "input_args": {"text": "'Billy Bush, a host on the “Today” show who has received stinging criticism for his role in a video with Donald J. Trump, has been suspended by NBC. The NBC executive in charge of “Today,” Noah Oppenheim, wrote in a memo to his staff members on Sunday that “we’ve all been deeply troubled by the revelations of the past 48 hours. ” “Let me be clear  —   there is simply no excuse for Billy’s language and behavior on that tape,” he said. “NBC has decided to suspend Billy, pending further review of this matter. ” It is unclear how long the suspension will last. Mr. Bush was at the center of an explosive 2005 video that was released on Friday, in which he is heard laughing and goading Mr. Trump as they engaged in a vulgar and misogynistic conversation about women. The news of the suspension is a reversal for NBC News, whose executives maintained throughout the weekend that it had no plans to discipline Mr. Bush and that he was expected to address the controversy on Monday’s program. But in the two days since the video’s release, there has been a strong social media backlash, including hundreds of angry comments on his Facebook page, many of them from women. Mr. Bush released a statement on Friday saying that he was “embarrassed and ashamed” of his role in the recording. But he added, “This happened 11 years ago  —   I was younger, less mature and acted foolishly in playing along. ” “Today” is gripped in a ratings battle with ABC’s “Good Morning America,” and both shows rely on women as a significant part of their viewership. At the time the video was shot, Mr. Bush was a host of NBC’s “Access Hollywood” and talking with Mr. Trump, then the star of “The Apprentice,” as he was about to leave a bus to visit a soap opera set. In the video, Mr. Bush laughs at Mr. Trump’s most outrageous comments, and the two vividly discuss the physique of a “Days of Our Lives” actress, Arianne Zucker, who arrived to accompany Mr. Trump on set (“Oh, that’s good legs,” Mr. Bush said at one point). In a statement on Sunday, Ms. Zucker said: “How we treat one another, whether behind closed doors, locker rooms or face to face, should be done with kindness, dignity and respect. Unfortunately, there are too many people in power who abuse their position and disregard these simple principles and are rewarded for it. ”'"}, "time": 1742563201.9919562}