{"duration": 0.6505930423736572, "input_args": {"text": "'During the   Leadership Forum, speakers ranging from President Donald Trump to Sheriff David Clarke and NRA senior VP Wayne LaPierre put smackdown after smackdown on gun controllers and their surrogates in the media. [LaPierre made clear there would be no apologies for the smackdowns. Rather, he pointed out that one of the things the American people love about the NRA is the fact that the group speaks truth.  LaPierre said: For the last quarter of a century, in poll after poll, whether it’s Gallup or NBC or The Wall Street Journal, Americans have said they view the NRA more favorably than both chambers of congress or either national political party  …    . The majority of Americans admire and trust the NRA because we always say out loud what we believe. We speak the truth, even when it may be hard, and we fight like hell to defend it. In light of the NRA’s voice for truth, Breitbart News pulled together eight   Amendment smackdowns, along with a bonus smackdown at the end. Most of the smackdowns require no commentary. Colonel Allen West  —   West said, “Here I stand as a son of Atlanta, a native Georgian, and a board member of the oldest civil rights organization that this country has ever known: the National Rifle Association. ”  Sheriff David Clarke —  Clarke said: “We won a huge battle last November but we did not win the war. You see, our fight for freedom continues in earnest. You see, these rat bastards on the left never give up  …    for them defeat is never final, election defeats don’t matter. It’s simply a time to regroup and continue their assault on our constitution, the rule of law, liberty, and American exceptionalism. ” Chris Cox  —   Cox recounted a conversation he had with President Trump after the inauguration, saying, “[It got so] ridiculous that the media, they were even lying about the number of people who watched [[President Trump’s] inauguration. I told him that the only number that mattered was the number of people that watched Hillary Clinton’s inauguration —  ZERO!” Senator Ted Cruz  —   Cruz said, “When the election results came in we heard a piercing wail of agony, as mainstream media reporters shrieked in horror because the American people had risen up and defied Washington, defied the mainstream media, defied pundits, and said, ‘We will defend our constitution and we will defend our freedom. ’” Wayne LaPierre  —   After listing the mainstream media’s failure to report the truth regarding the devious goals of Democrats and gun control groups around the country, LaPierre asked, “When did the media stop being journalists and start becoming PR flacks for the destruction our country?” President Donald Trump  —   After recounting the way he ran and won on the Second Amendment with the NRA’s endorsement, President Trump laughingly told the thousands of attendees at the Leadership Forum to be ready to be wooed by Democrats, “I have a feeling that in the next election you’ll be swamped with candidates, but you’re not going to be wasting your time. You’ll have plenty of those Democrats coming over and you’ll say, ‘No Thanks’ or ‘No Sir’ —  ‘No Ma’am’ perhaps ‘Ma’am’ —  it may be Pocahontas, remember that. ” Amid applause Trump said, “You came through for me and I am going to come through for you. ” Chris Cox —  Cox stressed that while Trump’s election changed everything for   gun owners, it changed nothing for the media and Hollywood, And he made clear it didn’t change gun controllers’ determination either, saying, “Michael Bloomberg, he’s still short, rich, and angry. ” Colonel Allen West  —   “The oldest civil right, the oldest individual right, the thing that enables us to be this great independent country, is that we will not become subjects, we will not let anyone take away our guns we will not allow anyone to subjugate us under a tyrannical rule. ” BONUS SMACKDOWN  —   LaPierre said, “Bernie Sanders was not ‘a movement,’ as fawning media called his campaign. Bernie is a political predator of young voters who were lied to by school teachers and college professors” —  LaPierre said young voters were told “free, free, free, for me,” but “no one told the truth about how all that stuff was going to be paid for. ” Nevertheless, LaPierre made clear that the media was in on the play because socialism would have aided in the goal of disarming and enslaving the American people. AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742562804.9642622}