{"duration": 0.02169656753540039, "input_args": {"text": "'The CDC has warned swimmers about pool water contaminated by people pooping in them following an increase in cases of a parasitic infection. [CNN reports that cases of a parasitic   infection linked to pools in the United States have doubled between 2014 and 2016 according to the Morbidity and Mortality Weekly Report issued by the CDC. Michele Hlavsa, chief of the CDC’s Healthy Swimming Program, stated in an email, “Cryptosporidium is a germ that can make people sick with diarrhea for up to three weeks. ” The parasite can be spread by the feces of an infected person.  The CDC received reports of as many as 32 outbreaks linked to swimming pools and water playgrounds in 2016. In comparison, there were only 16 reports in 2014. In Ohio, nearly 2000 people became sick due to being infected by cryptosporidium or “crypto. ” Symptoms of the infection include watery diarrhea, stomach cramps, nausea, and vomiting. “Parents can encourage their children not to swallow the water when swimming,” Hlavsa said, warning that swallowing a single mouthful of contaminated water can lead to illness. “Also, take kids on bathroom breaks every hour, and check diapers in a   area and not right next to the pool,” Hlavsa explained. “We all share the water we swim in, but we don’t want to share germs, pee or poop. ” The crypto infection is a major contributor to diarrheal illnesses in toddlers and infants in countries across Africa and Asia. It can also lead to poor nutrition which can be dangerous for young children. “Crypto is extremely hard to kill with normal levels of chlorine, which is why it’s important to keep Crypto out of pools in the first place,” Hlavsa wrote. “We can all help do this by not swimming or letting our kids swim if sick with diarrhea. ” “Most people who have healthy immune systems will recover from Crypto without treatment,” Hlavsa stated, but she noted that individuals afflicted with diarrhea for more than three days should contact their doctor. Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan_ or email him at lnolan@breitbart. com'"}, "time": 1742628573.8948333}