{"duration": 0.07307791709899902, "input_args": {"text": "'Canadian actor and filmmaker Seth Rogen believes it is important that resistance to Donald Trump’s presidency and his policy agenda be “normalized. ”[“I don’t want to look back in ten years and think, ‘I just didn’t say anything during that time,’ because it seems like a time where it’s very important to normalize dissent,” Rogen told the Daily Beast in an interview at the SXSW festival, where his latest film, The Disaster Artist, premiered this week.  The Sausage Party star says he’s “been very conscious not to insult people who voted for Donald Trump,” but believes it also important for him to normalize “the idea that a lot of people do not think that he is a good president, and do not think that he is bringing the country in a good direction, and not making it seem like some fringe,   thing that only really aggressive people who have whipped themselves into some sort of frenzy are expressing. ” Rogen added that “as a white dude,” he realizes that he’s “not the one who’s in real trouble right now. ” “I find myself not even aligned with the left wing of American politics often, because in Canada, even that is pretty far right in many lines of thinking,” he said. “I’m not used to being thrilled with American politics in general. But I do think it’s a lot better than most places better than a lot of other places I’ve been. I’m allowed to say and do things here that I couldn’t in other places. ” Rogen has stepped up his criticism of the president in recent months. In February, he tweeted a message to Donald Trump Jr. asking his dad to resign from office before he “destroys the planet. ” Let’s see if this works! pic. twitter.   —   Seth Rogen (@Sethrogen) February 16, 2017,  On Twitter, the actor has also taken aim at the GOP effort to repeal and replace Obamacare, and has criticized Trump’s recent executive order on immigration. But Rogen says as someone who “mostly just tries to observe a little bit,” he can empathize with people who are both for and against Trump. “I agree with the people who are very angry,” Rogen said, “and I also agree with the people who are like, ‘We have to look for ways to not create more division, and to come together,’ and I sympathize with the people who are like, ‘F*ck that! This is ridiculous,’ and I sympathize with the people who are like, ‘F*ck that! That’s never going to solve anything. ’” However, the    says he won’t be surprised “if one day we’re sitting at home watching a tape of Donald Trump jerking off while women piss on each other, if that’s where all this ends, then that’s just fantastic. ”   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742563319.4439251}