{"duration": 0.12045049667358398, "input_args": {"text": "'( henrymakow.com ) “Salman Hossein (left) was forced to flee Canada in 2010 with police on his tail for antisemitic activities. From his exile in Dhaka, Bangladesh, he says Hillary will win and lead the US to world war. Masonic Jewish central bankers can’t allow Trump to win because he will turn on them. They are already losing world control and Trump would be the final nail in their coffin.” — Henry Makow \\nLD: Salman was a prolific commenter on this site whose posts had to be carefully monitored because of their constant obscenities and bloodcurdling threats of mass extermination. A Muslim radical, to put it mildly. \\nSalman’s prediction that Hillary will win is not, in my opinion, a far-fetched one. I think it is a distinct possibility if all this, as I suspect, is pure theater. A huge surprise could be in store for us in the next few days. \\nA sudden announcement by FBI Director James Comey, two days before the election, giving Hillary a clean bill of health over her problematic emails, could result in a last-minute surge in support of Hillary that could sweep her into the White House. According to one report, the FBI “may be able to sift through them [the emails under investigation] before election day .” Additional information harmful to Trump, involving “ his close links to the Kremlin “, could also be manufactured in a bid to help Hillary. \\nAll this, however, is pure speculation. [LD] \\nSALMAN HOSSEIN : After 9-11, there were eight regimes that had not submitted to the authority of the Jewish bankers. Four of them either got taken out or bullied/bribed/coerced into bowing down – Afghanistan, Iraq, Libya, and Sudan. The only problem is that recently China, Iran, North Korea, Russia, and Turkey have broken out of the sphere of control. Syria is still independent and fighting to maintain its sovereignty against Israeli expansionism and Banker domination. \\nPutin recently put out an arrest warrant for George Soros for currency manipulation and has issued a decree banning the Rothschild clan from Russia. Russia is also causing problems for the Israelis and the West by defending the regime of Bashar Al Assad from Nusra and Da’esh/ISIS. Israeli expansionism has been kept in check by Russia. China has also more or less wrested free of control from the International Jewish oligarchy. As a pro-Israeli asset , Trump is not a threat to Israeli expansionism in Gaza and the West Bank. He has even opened up a campaign office in Israel. He is essentially aligning white gentile power with the Israeli-Jewish supremacist camp. He only cares about Israel and will facilitate even worse oppression of Arabs and Muslims not only in Palestine and the rest of the Greater Middle East but in the Western world as well. He consistently repeats the false “ Muslim terrorist “ narrative. He is even worse than George W. Bush Junior . As the alternative to the US Dollar, the new BRICS monetary system is also challenging Jewish control of international finance. The heavyweights in the BRICS alliance are Russia and China. There are those who claim that BRICS is also covertly run by the Jewish bankers. I don’t buy this. The Chinese are fully aware of the Jewish question . The Russians kicked out Jewish criminals . They won’t be able to penetrate the economy as well as they have done in the Western world. THE DILEMMA OF JEWISH SUPREMACISM Jewish supremacists view European gentiles as either pawns for their game of global conquest and perpetual warfare or if that is not feasible – their targets of destruction and hatred. Historically speaking, Jews have been expelled over 109 times in history. 105 of these times have been in Europe. That is why left-wing Jewish groups are so vehemently pushing for the replacement and liquidation of indigenous Europeans by either making them a minority or making those countries uninhabitable via the anticipated thermonuclear warfare which they are instigating . Most White Americans, Australians, Canadians, and New Zealanders are also of European ancestry – and are also targets for destruction/revenge by these Jewish extremists/supremacists for many decades now. The influx of refugees by Jewish groups with the assistance of organized crime gangs is Talmudic vengeance par excellence. For the Diaspora Jews, its an all-or-nothing zero sum game. They either take their chances with NATO and go all in against China, Iran, Russia, and eventually Turkey or eventually risk losing more countries from their grip and/or control. However, going head on against them will lead to World War Three. Their hatred for white gentiles is so great (due to past perceived historical injustices) that they are willing to risk death themselves in the process of getting others killed. There is no where the so-called (Jewish dominated) elite can really hide or travel to. All their contingency plans are being exposed . TRUMP IS LESSER OF TWO EVILS Trump is the lesser of the two evils because he does not appear insane enough to go after China and Russia at the same time. However, I personally prefer NATO going up against China and Russia. The West has been killing defenseless people as target practice alone for the last few centuries alone – they need a challenge this time. Russia along with assistance from China will put them in their place. The great news is that the Jewish war-mongers have already won! Hillary has already been declared the war president of the United States. I support Hillary Clinton in her desire to go to war against Russia. I have been praying for the day this would happen. In fact, thermonuclear warfare is just right around the corner. Nobody should be complaining about this. Without thermonuclear warfare, there is no way International Jewry’s grip on temporal power can be crushed. That is the other reason I left Canada! I’d like to end this piece by sending out the following Halloween message to everyone: Enjoy the party while it lasts! Make sure you have a blast! Hasta La Vista Baby!!! Like this? Share it now. 8 thoughts on “ Muslim Radical Salman Hossein says Hillary will win ” LD says:'"}, "time": 1742564465.0533266}