{"duration": 0.08146882057189941, "input_args": {"text": "'For weeks, Mayor Bill de Blasio has barely disguised his disgust for the coverage of his administration in The New York Post. He has referred to the newspaper as “propaganda” and suggested recently during his weekly radio   show that   New Yorkers would do well to ignore what he called The Post’s “fabricated”   stories. The mayor took his disdain to a new level on Thursday, blatantly and pointedly ignoring the paper’s City Hall bureau chief, Yoav Gonen, during a news conference, and belittling The Post while doing so. The conflict erupted in a petulant exchange, with Mr. Gonen furiously, and futilely, trying to attract the mayor’s attention. Mr. de Blasio, a Democrat, refused to call on him, explaining that he had “no use for a   rag” while excoriating Mr. Gonen for a recent story he did not write. “Mr. Mayor? Mr. Mayor? Mr. Mayor? Over here,” Mr. Gonen said, speaking up in frustration. “You can keep calling all you want,” Mr. de Blasio said. “Are you going to call on me today?” Mr. Gonen asked. “I’m calling on real media outlets, go ahead,” the mayor said, signaling a reporter from The New York Observer. It is nothing new for a mayor of New York to view the city’s press corps with contempt. And some powerful public figures, including Donald J. Trump and Raymond W. Kelly, a former New York police commissioner, have gone further, barring reporters from events altogether. But Mr. de Blasio’s very public and dismissive display was extraordinary in the history of antagonism between City Hall and the press. It reflected an escalation of Mr. de Blasio’s longstanding war with the tabloids, which he and some of his closest aides deemed irrelevant early in his tenure. But political operatives said they saw no purpose in the mayor’s lashing out. “I understand his frustration, but unfortunately losing your temper with the news media gets you nothing but stories about losing your temper,” Karen Hinton, Mr. de Blasio’s former press secretary, said. Her advice: Call on the reporter, answer the question, then move on. George Arzt, a political consultant and former press secretary for Mayor Edward I. Koch who was a reporter and City Hall bureau chief for The Post from 1968 to 1986, noted that Mr. Koch’s chief antagonists were investigative reporters from The Village Voice, namely Wayne Barrett and Jack Newfield. The two would never get interviews, Mr. Arzt said, “but they were allowed to ask questions” during news conferences. “No one that I’ve seen before this has gone after a paper as an institution,” he said. “You can’t say everyone on the paper is against me without making them against you. He’s creating his own problem. ” Last month, Mr. de Blasio characterized as “fabricated stuff” a   Post article suggesting he had made a   appointment at the behest of a donor who has since pleaded guilty to bribery charges. This month, he refused to answer a question from Mr. Gonen about the background of a contractor hired by the city to train correction officers, adding sarcastically that he did not “appreciate your propagandistic newspaper. ” In a telephone interview late Thursday, Mr. de Blasio said it was time to “have this conversation” about The Post, which he described as “a very negative presence in our city” and an “ideological apparatus” with little resemblance to a   news operation. “I think it’s important, as the leader of this city, to say out loud what so many people already know,” he said. “The Post’s approach has gotten worse and worse. ” He said he had not planned the comments he made at the news conference, adding that he would answer questions from Post reporters in the future, provided they were not “in the middle of playing out one of their propaganda strategies. ” The news conference on Thursday included several exchanges in which the mayor appeared exasperated with questions from various reporters about transparency and overlapping investigations into his administration. All the while, he ignored the raised hand of Mr. Gonen. “You can keep trying, man,” Mr. de Blasio said. “In the back for the last one. ” Mr. Gonen then began to ask his question anyway  —   a request for comment on a report by the Citizens Budget Commission, a fiscal watchdog, about a costly aspect of teachers’ pensions. “You can talk all you want,” the mayor said. “I’m credentialed just like the other media,” Mr. Gonen said. “That’s nice, I appreciate solidarity,” Mr. de Blasio said before explaining that his anger stemmed from a Post story on Monday that used the word “crony” to describe Victor Calise, the commissioner of the Mayor’s Office for People with Disabilities. “I’ve got no use for a   rag that attacks people who are good public servants and tries to undermine their reputation,” he said, pointing to Mr. Calise who was seated nearby. “I’m not playing that game. ” The   of Friday’s Post, published online Thursday night, embraced the clash with glee. “De Waaasio,” read the headline above a   of the mayor’s head on a baby’s body in a highchair. “Aww, did we hurt your feelings?”'"}, "time": 1742561792.718116}