{"duration": 1.290353536605835, "input_args": {"text": "'At least two police officers turned in their badges today after acknowledging that attacking peaceful protesters is not what they signed up for. \\nVia TrueActivist \\n\\nIt should be evident if you’re following news concerning the Standing Rock protests in North Dakota that tension continues to escalate between protesters supporting the Standing Rock Sioux Tribe and riot police. The big deal? A four-state Dakota Access Pipeline which threatens to uproot sacred burial ground, poison the Missouri river, and make null an 1881 treaty ensuring the property belongs to the Standing Rock Sioux tribe.\\nIn addition to being maced and beaten with batons, activists have been tased and even shot with rubber bullets. Despite the violence taking place, tribal leaders continue to ask all “water protectors” to maintain peaceful relations and rely on prayer as the only weapon used to halt construction of the DAPL.\\nAfter watching videos of the mass arrests and beating that have taken place, many have asked how those employed by the State can continue to terrorize weaponless protesters. Surely, some form of cognitive dissonance must be taking place? For some, most likely, and that’s undoubtedly what inspired at least two officers to turn in their badges today. According to an activist named Redhawk, there have been reports of at least two officers turning in their badges after acknowledging that the battle against the American people is not what they signed up for.\\nOn Facebook, the activist wrote:\\n“You can see it in some of them, that they do not support the police actions. We must keep reminding them they are welcome to put down their weapons and badge and take a stand against this pipeline as well. \\nSome are waking up.” \\nThe comments on the ordeal have been quite positive. Charlotte Holywater Vincent wrote,\\n“Brave to stand up for what is right ! To hand over years of training and service in a little metal badge and then stand on the side of humanity.” \\nRon Hemming, who reportedly is a retired deputy in Washington, shared his thoughts:\\n“As a retired deputy in Washington state, I would have refused to go on a detail such as this. As I am also part native blood, I stand with my relatives on the front line protecting the water from the black snake. Be safe, stay strong.” \\n'"}, "time": 1742564025.167266}