{"duration": 0.04476666450500488, "input_args": {"text": "'Voting Machine Problems Are Being Reported All Over America By Michael Snyder, on November 8th, 2016 \\nAfter what happened in the last election , people seem to be more alert to signs of potential election fraud this time around. And right now the Internet is buzzing with reports of voting machine problems in some of the most important swing states. In some areas officials were forced to make emergency switches to paper ballots due to voting machine issues, and in other cases voters that intended to vote for Donald Trump were having their votes registered for Hillary Clinton instead. The mainstream media is insisting that these are “isolated instances”, and hopefully that turns out to be true because the integrity of our elections is of the utmost importance. \\nVoting machines are supposed to make voting easier and more efficient, but instead they are once again causing major headaches all over the country. The following summary of technical issues that we have seen so far comes from the New York Daily News … \\nIn Utah, voting machine problems in the southern part of the state forced poll workers to use paper ballots, with some residents sent to alternate voting locations. \\nVoters in Colorado received provisional ballots after officials reported computer problems state-wide, though at least one county said that the state electoral system was back up Tuesday afternoon. \\nMachine issues were reported in Wilson County, Tenn. — and at one point all of the county’s machines went down, according to local reports . Voting later resumed manually. \\nIn Texas, a computer used by election clerks malfunctioned at a polling place, so officials briefly diverted voters to another polling place more than two miles away. \\nIn Louisiana, some early voters were forced to wait as correct machines were installed. \\nIn Durham County, N.C., paper poll books were being used Tuesday due to “tech problems at a few sites.” \\nBut much more troubling is what has been happening in Pennsylvania. Numerous voters have been reporting that their votes were switched by the voting machines from Donald Trump to Hillary Clinton. The following is an excerpt from one local news report … \\n“Every time I would push a candidate for the Republican party, it would come up for the Democratic candidate,” said voter David Drane. \\nElection judges in Clinton Township, Butler County confirmed there were issues with two of their eight automated voting machines. Most of the issues came when people tried to vote straight party ticket. \\nHowever, others said they specifically wanted to vote for Republican Donald Trump only to see their vote switched before their eyes to Democrat Hillary Clinton. \\n“I went back, pressed Trump again. Three times I did this, so then I called one of the women that were working the polls over. And she said you must be doing it wrong. She did it three times and it defaulted to Hillary every time,” Bobbie Lee Hawranko said. \\nAnd USA Today is reporting that vote switching is also being reported in Lebanon County, Pennsylvania… \\nAnd in one of the few glitches with political overtones, a problem with the calibration of electronic voting machines in Lebanon County, Pa., caused about a half dozen machines to display what voters thought were straight Republican tickets as straight Democratic tickets. Poll workers alerted the county elections bureau, and voters were able to change their ballots, said Michael Anderson, director of the Lebanon County Bureau of Elections. \\nIf you recall, this exact same kind of thing happened in the all-important swing state of Ohio in 2012 . \\nSo if Pennsylvania ends up being the difference in a Hillary Clinton victory, this will need to be looked at very, very closely. \\nReports of vote switching in Pennsylvania are already getting so much attention that they are even making television news … \\nIn other parts of the state, a different type of problem has emerged. One African-American voter that tried to vote for Trump was extremely frustrated when the voting machine that he was using remained completely stuck on a selection for Hillary Clinton. This particular voter captured this on video and uploaded the video footage to Twitter … this is what I was talking about, they fixed it but it was on some nut shit at first. pic.twitter.com/GO5Y9FCnYN \\n— ædonis | hotep (@lordaedonis) November 8, 2016 \\nVoter turnout is very heavy all over the nation, and it looks like we may shatter voter participation records all over the nation. \\nSo that is a good thing. \\nAnd we can get an idea of what voters are thinking by what they are searching for on the Internet … \\nWhen looking at searches of “Who is ____ voting for,” these names are the most popular: \\nTaylor Swift'"}, "time": 1742628580.9153311}