{"duration": 1.4588263034820557, "input_args": {"text": "\"by Bryan William Myers | Oct 29, 2016 \\nBack on Sept. 3, 2016, Labor Day weekend in America, protesters in North Dakota representing the Standing Rock Sioux were attacked with dogs and pepper spray while attempting to halt construction on an approximately $4 billion crude oil pipeline that would extend nearly 1,200 miles from the northern interior of the U.S. to south-central Illinois. One of the oil companies “responsible” for the pipeline is Dakota Access, LLC — a subsidiary of Energy Transfer Crude Oil Company, LLC . \\nSome quick facts about the pipeline, from an Energy Transfer Partners website: \\nThe pipeline will “…transport crude oil from the Bakken/Three Forks play in North Dakota to a terminus in Illinois with additional potential points of destination along the pipeline route.” \\n“The pipeline will translate into millions in state and local revenues during the construction phase and an estimated $156 million in sales and income taxes.” \\n“The Dakota Access Pipeline Project is a $3.7 billion investment into the United States directly impacting the local and national labor force by creating 8,000–12,000 construction jobs and up to 40 permanent operating jobs.” \\n“The pipeline is anticipated to be fully functional by 2016.” \\nUltimately, this is conjecture. \\nWHO ARE THE SIOUX? \\nAbout the Sioux: \\n“The Standing Rock Sioux Reservation is situated in North and South Dakota. The people of Standing Rock, often called Sioux, are members of the Dakota and Lakota nations. ‘Dakota’ and ‘Lakota’ mean ‘friends’ or ‘allies’. The people of both these nations are often called ‘Sioux’, a term that dates back to the seventeenth century when the people were living in the Great Lakes area. The Ojibwa called the Lakota and Dakota ‘Nadouwesou’ meaning ‘adders’. This term, shortened and corrupted by French traders, resulted in retention of the last syllable as ‘Sioux.’ There are various Sioux divisions and each has important cultural, linguistic, territorial, and political distinctions.” \\nWhere do they live? \\n“The Great Sioux Reservation comprised all of present-day South Dakota west of the Missouri River, including the sacred Black Hills and the life-giving Missouri River. Under article 11 of the 1868 Fort Laramie Treaty, the Great Sioux Nation retained off-reservation hunting rights to a much larger area, south to the Republican and Platte Rivers, and east to the Big Horn Mountains. Under article 12, no cession of land would be valid unless approved by three-fourths of the adult males. Nevertheless, the Congress unilaterally passed the Act of February 28, 1877, removing the Sacred Black Hills from the Great Sioux Reservation. The United States never obtained the consent of three-fourths of the Sioux, as required in article 12 of the 1868 Treaty. The U.S. Supreme Court concluded that ‘A more ripe and rank case of dishonorable dealings will never, in all probability, be found in our history.'” \\nAs the years wore on, and more of their land was claimed by the invader — the U.S. government — the Standing Rock Sioux Tribe eventually formed their own constitution in 1959 to be overseen by a Tribal Council. \\n“The Tribal Council consists of a Chairman, Vice-Chairman, a Secretary, and fourteen additional Councilmen which are elected by the tribal members.” \\nAnd now, once again, they are up against the sprawling U.S. empire, which will stop at nothing when natural resources are coveted for the invader’s profit machine. This time, it’s the unelected bureaucracy of oil companies and monopolistic energy partnerships in America paired with the funding from nearly 20 U.S., U.K., and other international banking institutions who are all involved in this endless destruction of Native lands. \\nCombined with a militarized police state — hundreds of arrests, assaults with batons and rubber bullets, armored vehicles with sound cannons, Humvees, helicopters flying overhead, and troops from the National Guard — the recent events in North Dakota resemble that of a war zone, more than a peaceful protest. \\nTRANSPORTING OIL OUT OF NORTH DAKOTA \\nCrude oil transported out of North Dakota has traditionally been shipped on rail cars to get to the east coast. Over the years, the competitive push to match domestic demand with imported crude oil pressurized the internal transport system, increasing rail-car shipping incidents. \\nFrom Pennsylvania StateImpact , “a reporting project of NPR member stations”: \\n“Refineries on the East Coast used to rely on crude oil from Nigeria and the Gulf of Mexico shipped on large tankers. Today, trains carrying crude oil from North Dakota’s Bakken Shale travel on rail lines through Pennsylvania. The rail shipments are part of a larger nationwide boom in rail traffic resulting from the oil and gas boom and have helped keep refineries in the Philadelphia region stay in business . \\nHowever, increased traffic on the rails has resulted in a surge in accidents, including an explosive derailment in Lac-Megantic, Quebec that left 47 people dead in July 2013. The crude-by-rail phenomenon has come under intense scrutiny from federal agencies, as well as state and local governments across the country who worry that a derailment in more populous cities like Pittsburgh and Philadelphia could result in catastrophe.” \\nThis, in tandem with crashing oil prices . \\nPaired with a previous announcement in May 2015 from the U.S. Department of Transportation (DOT), for new rules to “strengthen the safe transportation of flammable liquids by rail”. \\nAnd you’ve got a perfect environment for vulture capitalist intervention. \\nTHE BANKS SWOOP IN \\nBack in September, Democracy Now! did an exclusive report entitled “Who’s Investing in the Dakota Access Pipeline? Meet the Banks Financing Attacks on Protesters”. \\n“We continue our conversation with Hugh MacMillan (senior researcher at Food & Water Watch) on his new investigation revealing the financial institutions backing the $3.8 billion Dakota Access pipeline project. \\nThe investigation, published by research outlet LittleSis, names more than two dozen major banks and financial institutions helping to finance the Dakota Access pipeline. It details how Bank of America, HSBC , UBS , Goldman Sachs, Wells Fargo, JPMorgan Chase, and other financial institutions have, combined, extended a $3.75 billion credit line to Energy Transfer Partners, the parent company of Dakota Access.” \\nIn the interview, MacMillan begins: \\n“Dakota Access, LLC is a joint venture of Phillips 66, and a joint venture of two members of the Energy Transfer family, Energy Transfer Partners and Sunoco Logistics. Enbridge (Energy Partners) and Marathon (Petroleum Corporation) oil have bought into this joint venture. Together, they now have about a 37% stake in the pipeline, the Dakota Access pipeline.” \\nWhen Amy Goodman asked how the banks were involved, MacMillan responded: \\n“They’re banking on this company, and banking on being able to drill and frack for the oil to [be sent] through the pipeline over the coming decades. So they’re providing the capital for the construction of this pipeline.” \\nMacMillan then asserts that the 17 banks in their funding of the Dakota Access pipeline through Energy Transfer Partners are also coupled together with an existing pipeline that will be converted to extend from the southern end of the Dakota Access pipeline all the way down to the Gulf Coast. \\n“Where there are refineries and also export infrastructure.” \\nHere is a picture of that proposal from the Sunoco Logistics website: \\nMacMillan stated the ultimate goal of the pipeline projects will be to have one pipeline that would run from “near the Canadian border on down to the Gulf Coast of Texas, over 1,800 miles.” \\nAs to which banks, specifically, are directly involved in the Dakota Access pipeline: \\n“Citibank is the bank that’s been running the books on the project. And that’s the bank that ‘beat the bushes’ and got other banks to join in. So we have Wells Fargo, BNP Paribas, SunTrust, the Royal Bank of Scotland, the Bank of Tokyo-Mitsubishi, Mizuho Bank, TD Securities, ABN AMRO, DNB First bank (based in Philadelphia), ICBC London, SMBC Nikko Securities, and Societe Generale.” \\nGoodman then asked MacMillan about the drop in demand for oil, in the past year, with regard to a personal conversation she had with an oil trucker. \\n“If you ask Morgan Stanley, they said a year ago that the oil producers are getting into ‘prison shape’— without irony. So these are long term investments from the banks. They fully expect the United States to maximize its production of oil and gas through widespread fracking.” \\nMacMillan summarized what he believed was most crucial for people to understand about the Dakota Access Pipeline: \\n“Well, I think it’s important to see the forces behind this particular pipeline as the same forces behind numerous other pipelines across the country, both to support fracking for tight oil as well as fracking for shale gas, all toward maximizing production of oil and gas. When the science is clear that we need to maximize what we keep in the ground. Our current policy has not made that switch. And if you look at the Department of Energy’s Quadrennial Technology Review, published a year ago, you’ll see under clean energy technologies, permeability manipulation is included along with improved understanding of well integrity and improved understanding of injections and how they’re causing earthquakes, such as [what] occurred over the weekend in Oklahoma. The Quadrennial Technology Review speaks of a future mastery of the subsurface towards maximizing production.” \\nOTHER HANDS IN THE POT \\nMost recently, it has come out that Republican presidential candidate Donald Trump has anywhere from $500,000 to $1 million invested in Energy Transfer Partners , the parent company of the Dakota Access pipeline, in addition to having $500,000 – $1 million invested in Phillips 66 — a company which will also hold a 25% stake in the pipeline. Kelcy Warren, co-founder and chief executive of Energy Transfer Partners, donated more than $100,000 to Trump’s campaign, and he gave nearly $67,000 to the Republican National Committee since Trump became the party’s controversial candidate for president in the 2016 election. \\nAccording to the Guardian, Warren gave a $3,000 personal donation to Trump’s election campaign back in June. That amount exceeded $2,700 — the legal limit for individual contributions. Previously, Warren donated $550,000 to current Texas governor Greg Abbott’s 2014 campaign. After Abbott won the election, he then appointed Warren and his wife to state boards, the Guardian reported. \\n“Warren has worked in the energy industry for the past 25 years and has a net worth of $3.8bn, according to Forbes . The Texas-based businessman has said concerns over the Dakota Access pipeline are ‘unfounded’ and insisted there are no Native American artifacts at risk from its construction. He vowed that Energy Transfer Partners will press ahead with the project .” \\nRECENT RESPONSES FROM POLITICIANS ON DAKOTA ACCESS PIPELINE \\nOn Thursday, Oct. 27, Hillary Clinton’s campaign released a statement with regard to the Dakota Access pipeline project and the ongoing protests where hundreds have been arrested in recent weeks. \\n“It’s important that on the ground in North Dakota, everyone respects demonstrators’ rights to protest peacefully, and workers’ rights to do their jobs safely…” \\nBernie Sanders made a much less benign statement on the issue: \\n“The major global crisis facing our planet today is climate change. The vast majority of scientists tell us that climate change is real, it is caused by humans and it is already causing devastating problems. They say that if we do not aggressively transition our energy system away from fossil fuels toward energy efficiency and sustainable energy, the planet we leave our children will be a much less habitable place. \\nLike the Keystone XL pipeline, which I opposed since day one, the Dakota Access fracked oil pipeline, will transport some of the dirtiest fuel on the planet. Regardless of the court’s decision, the Dakota Access pipeline must be stopped. As a nation, our job is to break our addiction to fossil fuels, not increase our dependence on oil. I join with the Standing Rock Sioux Tribe and the many tribal nations fighting this dangerous pipeline.” \\nHere is Sanders’ letter to U.S. President Barack Obama on this issue, from Oct. 28. \\nA previous letter, dated Oct. 13, was also sent to the president, regarding the halting of construction on the Dakota Access pipeline. That letter was also signed by Sanders, in addition to four other U.S. Senators. \\nCollectively, banks from nearly a dozen countries are involved in the funding of the Dakota Access pipeline. \\nAnd, last weekend, on Friday, Oct. 21, an oil pipeline was breached , spilling gasoline in close proximity to the Susquehanna River, in an area of Lycoming County, Pennsylvania — about 100 miles north of the state capital, Harrisburg. The spill was estimated at 1,300 barrels, or 55,000 gallons of gasoline. \\nThe owner of that pipeline is Sunoco Logistics, which has had over 200 leaks of crude since 2010, much more than any of its competitors. \\nIt’s the same oil company that will be operating the Dakota Access pipeline. Bryan William Myers Bryan is a freelance writer/copy editor/copywriter. He reads, researches and drinks beer. He also writes poetry, short stories, essays, and is working on various novels, some of which include private documentation of traveling and living in Philadelphia, Colorado, and New Jersey. Currently, he lives in South Philadelphia. He also paints and records his own music. Join We Are Change!\""}, "time": 1742563444.1090703}