{"duration": 0.02181696891784668, "input_args": {"text": "'Share on Twitter Print This Post \\nIn a conference call with reporters, Hillary Clinton’s campaign manager said that FBI Director Comey’s letter is backfiring and energizing Clinton’s volunteers to work harder and her supporters are voting in even bigger numbers. \\nClinton campaign chair John Podesta called Comey’s letter long on innuendo, short on facts. Podesta said the more information that comes out, the more this seems overblown. Podesta went off on Rep. Jason Chaffetz for distorting the facts and undermining his own legitimacy by claiming that the investigation was reopened. Podesta said that Comey had provided selective information that allowed partisans to distort the facts. \\nPodesta said there’s no evidence of wrongdoing, no charge of wrongdoing. He said if all the media reports are true, about the investigation having nothing to do with Hillary Clinton, it’s hard to see how this amounts to anything. \\nHillary Clinton’s campaign chair called on Comey to provide answers to be public. \\nClinton campaign manager Robbie Mook said that the Comey letter is motivating Clinton volunteers and supporters: \\nBased on the anecdotes I am hearing from out team on the ground, this situation has created an urgency and intensity among our volunteers and activists that was already high because we are so close to the election. Our volunteers are rallying around Hillary They know what a fighter she is. \\n…. \\nThey are turning out, not only to have her back but to rally our supporters to turn out and vote, as early voting goes into full swing. We’re not just seeing this in our offices, on the ground, but also in our online, in the online space as well. I think this is; we already had momentum and wind behind our back going into yesterday. I think that this has only increased the momentum that we’re feeling among our activists on the ground. \\nLater Mook suggested that the Comey letter is helping the Clinton campaign by adding fuel to their early voting fire. It is likely that the Comey letter will backfire on Republicans and motivate Democrats to get out and support their nominee. \\nAn early report from a pollster in two swing states saw no impact from the letter on voters. Hillary Clinton may end up benefiting from Comey’s actions because the FBI Director might have gotten rid of the one thing that could have beaten her. \\nWith one written paragraph, James Comey may have destroyed Democratic complacency.'"}, "time": 1742628518.1025822}