{"duration": 0.1047677993774414, "input_args": {"text": "'One day after Muhammad Ali Jr. spoke with members of Congress about being detained at a Florida airport last month, he was briefly stopped again before boarding a flight on Friday afternoon, his lawyer said. When Mr. Ali, whose father died last year, arrived at Reagan National Airport in Washington on Friday for a flight to Fort Lauderdale, Fla. he gave his Illinois identification card to a JetBlue agent to get his boarding pass, said his lawyer, Chris Mancini, who was traveling with him and witnessed the episode. Almost immediately, Mr. Ali was told that there was a problem and that the agent needed to call the Department of Homeland Security, Mr. Mancini said. Mr. Ali, 44, was asked his date of birth, where he was born and his Social Security number, Mr. Mancini said. After answering the questions, he was told that his   identification card, which expires in 2019 but is not a driver’s license, was invalid for flying. “The same state ID from Illinois that he traveled to Washington on was rejected,” Mr. Mancini said in an interview on Friday night. Mr. Ali then produced his United States passport, which was accepted, and went through security and boarded the flight with his mother, Khalilah   the second wife of Muhammad Ali, and Mr. Mancini. Mr. Mancini said that the episode lasted between 20 and 25 minutes. “This whole thing smacks of some sort of retaliation for his testimony,” he said. Representative Debbie Wasserman Schultz, Democrat of Florida, was on the same flight, and posted about the episode on Twitter, saying that Mr. Ali had been “detained again. ” In a statement, the Transportation Security Administration disputed that the holdup at the ticket counter lasted long and said that Mr. Ali’s jewelry caused a   delay at the security checkpoint. The agency said that it did not have the authority to detain passengers. “Upon arriving at the airline   counter, a call was made to confirm Mr. Ali’s identity with T. S. A. officials,” the agency said. “When Mr. Ali arrived at the checkpoint, his large jewelry alarmed the checkpoint scanner. He received a targeted   in the area of his jewelry to clear the alarm and was cleared to catch his flight. ” An agency spokesman did not immediately respond to a question about what prompted the additional scrutiny of Mr. Ali’s identification. Mr. Mancini said he was baffled by the agency’s statement because Mr. Ali did not complain about his treatment at security, only at  . Mr. Mancini said he was helping Ms.   through the checkpoint and did not notice that Mr. Ali had been stopped for additional scrutiny. “They are making up stories,” he said. “We have never said anything about anything happening after he left the ticket counter. ” He said he planned to file a complaint with the Department of Homeland Security and was “working toward a lawsuit. ” “People need to start paying attention to what’s happening in our country,” he said. “Our rights are being eroded. ” The dispute between Mr. Ali and the Homeland Security Department, which oversees the T. S. A. follows an episode on Feb. 7 in which he and his mother were stopped for about an hour and a half at Fort   International Airport after returning from Jamaica. Mr. Mancini said then that Customs and Border Protection officials had asked Mr. Ali, “Where did you get your name from?” and, “Are you Muslim?” Mr. Ali and his mother recounted their ordeal at a forum with House Democrats on Thursday and both spoke out against President Trump’s new travel restrictions. “I believe they were religiously and racially profiling me,” Mr. Ali said of the officials, according to reports. When they arrived at the airport on Friday, Mr. Mancini said, he and Mr. Ali joked about whether they would face additional scrutiny because of his comments.'"}, "time": 1742562440.2532246}