{"duration": 0.023984909057617188, "input_args": {"text": "'It’s becoming more and more clear that not only do we have to contend with electoral interference from foreign government, but from within as well. FBI Director James Comey’s decision to reignite the controversy witch-hunt directed at Hillary Clinton and her private email server was an appalling show of partisan scheming by the FBI, and it’s becoming clear that the entire agency is working to undermine the Democratic nominee in clear violation of the Hatch Act. \\nThe New York Times has revealed that the FBI’s investigation of the Clinton Foundation was based on the rantings of a wingnut conspiracy theorist who wrote the an anti-Clinton propaganda tract. \\n“…had not developed much evidence and was based mostly on information that had surfaced in news stories and the book ‘Clinton Cash,’ according to several law enforcement officials briefed on the case.” \\nClinton Cash, written by Peter Schweizer, has been best described as : \\n“a trainwreck of sloppy research and shoddy reporting that contains over twenty errors, fabrications, and distortions. Schweizer pushes conspiracies “based on little evidence” that are “inconsistent with the facts” and “false”; takes quotes “badly out of context”; excludes exculpatory information that undermines his claims; and falls for a fake press release.” \\nSchweizer rubs shoulders with other prominent wingnuts like Sarah Palin and Glenn Beck, another cog in the conservative agitation-propaganda machine. \\nHe is also the president of the Government Accountability Institute, an agitprop think tank run by – wait for it – ex-Breitbart CEO and current Trump campaign chair Steve Bannon. \\nThis morning, it was revealed that Donald Trump donated $1 million dollars to a Marine Corps veterans association run by the ex-assistant FBI director James Kallstrom. \\nThis afternoon, an FBI official spoke to the Guardian and said Clinton is “the antichrist personified to a large swath of FBI personnel,” and that “the reason why they’re leaking is they’re pro-Trump.” It is clear that there are a great many forces at work behind the scenes trying to destroy the United States as we know it – and Trump is the one with the nerve to claim “rigged election!” Related Items:'"}, "time": 1742628494.6591337}