{"duration": 0.09523391723632812, "input_args": {"text": "'CLEVELAND  —   The Republican Party woke up to a cascade of   and confusion on Tuesday as the Trump campaign was rocked by accusations that parts of Melania Trump’s convention speech had been cribbed from the one that Michelle Obama delivered to Democrats in 2008. The possibility that Ms. Trump’s remarks had been plagiarized cast a cloud over the second day of the Republican National Convention and laid bare lingering tensions within the party surrounding the nomination of Donald J. Trump, whose campaign continues to be plagued by stumbles and infighting despite several reboots. The disarray was evident as Mr. Trump’s campaign and senior Republicans offered conflicting explanations for the similarities in the speeches, with some officials conceding that the passages were lifted and demanding accountability, and others arguing that nothing untoward had occurred. Among Mr. Trump’s aides, there was a palpable sense of frustration that Ms. Trump’s speech, which they considered a highlight of the evening, had become a cause for embarrassment. Paul Manafort, Mr. Trump’s campaign chairman, pushed back aggressively against accusations of plagiarism and even tried to go on the offensive. Describing it as “a great speech,” Mr. Manafort said at a morning convention briefing that “obviously Michelle Obama feels very similar sentiments toward her family. ” Deflecting questions about the passages themselves, Mr. Manafort instead attacked Hillary Clinton, the presumptive Democratic nominee, for what he said was an effort to draw attention to the matter. “This is once again an example of when a woman threatens Hillary Clinton, she seeks out to demean her and take her down,” Mr. Manafort said on CNN. “It’s not going to work against Melania Trump. ” Surrogates for Mr. Trump mused aloud on Tuesday about what might have happened, raising questions about fissures within his team and allowing the controversy to drag on. One adviser to Mr. Trump, who has assisted in the drafting of some of his speeches, acknowledged that Ms. Trump used words that were not her own. “I’m sure what happened is the person who was helping write this plucked something in there and probably an unfortunate oversight  —   and certainly Melania didn’t have anything to do with it,” the adviser, Sam Clovis, a Trump campaign   said in an interview on MSNBC. Katrina Pierson, another spokeswoman for the Trump campaign, acknowledged that Ms. Trump used phrases similar to those used by Mrs. Obama but insisted that the language was not copied verbatim. She said in an interview with Sky News that Ms. Trump was trying to echo themes expressed publicly by prominent women including Laura Bush and Elizabeth Dole. “She really wanted to communicate to Americans in phrases they’ve heard before,” Ms. Pierson said. Talk of who was to blame for the speech also buzzed among former advisers to Mr. Trump. Corey Lewandowski, the campaign manager who was ousted in favor of Mr. Manafort, said that Mr. Manafort should take responsibility. “Whoever signed off, the final signoff that allowed this to go forward, should be held accountable,” Mr. Lewandowski said on CNN. “I think if it was Paul Manafort, he would do the right thing and resign. ” Two people briefed on the process, who insisted on anonymity to discuss such a sensitive issue, said that Jared Kushner, Mr. Trump’s    had commissioned a draft of Ms. Trump’s speech from two former speechwriters for George W. Bush. Matthew Scully and John McConnell, who had worked together as speechwriters during Mr. Bush’s first term, wrote a draft of Ms. Trump’s speech in June, sending it to the campaign for review about a month ago. The pair did not hear back from the campaign until about 10 days ago, according to one person familiar with the conversation, when they were told that the lineup of speeches and the timing of Ms. Trump’s speech had been changed, leading to the speech having to be shortened. Ms. Trump then worked with a person from within the Trump organization to make substantial revisions. The   duo was not aware that the speech had been significantly changed until Ms. Trump delivered it on Monday night. According to one source, the only parts that remained from the original draft were the introduction and a passage that included the phrase “a national campaign like no other. ” Mr. Scully is a veteran Republican speechwriter who wrote an early draft of a speech for Senator John McCain’s   nominee in 2008. Mr. Scully had prepared a generic version of the speech and then rewrote it during an extended session with Sarah Palin, after he learned she was Mr. McCain’s choice. Mr. Scully also helped write the acceptance speech given by Paul Ryan when he was chosen as Mitt Romney’s running mate in the 2012 presidential campaign. Ms. Trump initially earned praise for her speech on the opening night of the convention, but her remarks almost immediately came under scrutiny when striking similarities were discovered between her speech and one delivered by Mrs. Obama The phrases in question came when Ms. Trump  —   who told NBC News earlier on Monday that she had written her speech herself  —   was discussing her upbringing in Slovenia and her parents. Here are the relevant passages: Ms. Trump, Monday night: Mrs. Obama, in her 2008 speech:  Ms. Trump:  Mrs. Obama, in 2008:  Mr. Trump’s aides have thus far declined to identify who, if anyone, on the campaign helped in writing the speech In a statement released hours after the speech, a spokesman for Mr. Trump, Jason Miller, was vague about how it was crafted. “In writing her beautiful speech, Melania’s team of writers took notes on her life’s inspirations, and in some instances included fragments that reflected her own thinking,” Mr. Miller said. “Melania’s immigrant experience and love for America shone through in her speech, which made it a success. ” Sarah Hurwitz, a White House speechwriter who composed Mrs. Obama’s 2008 address, did not immediately respond to an email seeking comment, but Democrats were watching the fallout carefully. Advisers to Hillary Clinton said they decided to take a restrained approach to the controversy. The Clinton campaign often challenges the integrity of the Trump campaign, but doing so over the speech could create an opening for Trump advisers to suggest that Mrs. Clinton was to blame for the furor. After Mr. Manafort tried to do so anyway on Tuesday, Mrs. Clinton’s communications director, Jennifer Palmieri, replied “nice try, not true” on Twitter and added, “blaming Hillary Clinton isn’t the answer” for every Trump campaign problem. Stephanie Cutter, a Democratic strategist who has also been an Obama adviser, argued that the controversy revealed an inability among people closest to Mr. Trump to talk about his character. “The person who is supposed to know the candidate best and can speak to his values and what drives him couldn’t write her own speech on it,” Ms. Cutter wrote in an email. “Instead, she lifted from a first lady who spoke from the heart about her husband. ” At the White House, Josh Earnest, the press secretary, said he would leave the analysis of Ms. Trump’s speech to reporters. But several times, he emphasized the positive reviews that Mrs. Obama received when she delivered her remarks in 2008. “She received an enthusiastic reception and strong reviews because of her words and her life story and the values that she and her husband deeply believe in and try to instill in her kids,” Mr. Earnest said. A few minutes later, he emphasized that when it comes to Mrs. Obama, “her words and her values and her life story are quite powerful. ” Accusations of plagiarism are not unknown in political speeches, although the consequences have varied. In 2008, Mrs. Clinton criticized Mr. Obama for appearing to lift a passage from Deval Patrick, then the governor of Massachusetts, in a speech about how words matter. Mr. Obama, then a senator, said that he should have credited Mr. Patrick but that he did not consider it a case of plagiarism. When Mr. Biden was running for president in the 1980s, he faced questions about plagiarizing speeches from Robert F. Kennedy, Hubert H. Humphrey and Neil Kinnock, a British Labour Party leader. Mr. Biden said at the time that it was “ludicrous” to expect a politician to attribute everything he said. Jarrett Hill, a Twitter user whose biography describes him as an interior designer and journalist, apparently first noticed the resemblance between Ms. Trump’s speech and Mrs. Obama’s in 2008. Mr. Hill, a television journalist who was recently laid off, said that one of Ms. Trump’s lines  —   the words “strength of your dreams”  —   caught his attention as he was watching on his computer from a Starbucks in Los Angeles, juggling Facebook chats and browsing Twitter. He tracked down the clip of Mrs. Obama’s speech online and noticed that parts of the two speeches were nearly the same. “I thought, ‘That’s legit plagiarism,’” said Mr. Hill, who described himself as a supporter of President Obama. “‘Someone took this piece and plugged in their own information. ’”'"}, "time": 1742628450.7922606}