{"duration": 0.04960489273071289, "input_args": {"text": "'The boom has fallen on another 216 employees of cereal giant Kellogg Company with workers in Minnesota being handed pink slips at a snack food manufacturing facility. [Up to 216 workers at the Kellogg plant in Vadnais Heights, Minnesota, were notified last week that their jobs were on the chopping block as part of the company’s plan to reverse its financial freefall, according to CBS news.  Jeremy Hanson Willis, deputy commissioner of Minnesota’s Department of Employment and Economic Development, told the media that he received the company’s notification satisfying a federal mandate to alert state authorities when a mass layoff is occurring. Willis tried to put a brave face on it insisting the laid off workers will be fine. “There are a lot of businesses around the state looking for workers and having a hard time to employ them because we have so few unemployed folks in our state,” Willis told the media. A Kellogg’s spokesman admitted that the layoffs were part of the company’s effort to retool. Joe Lierz, Kellogg’s director of labor relations, told the StarTribune that the layoffs were “directly related” to the company’s   plan. He added that the Minnesota job loss “is one in a series” of layoff announcements coming across the country. The layoffs in Minnesota came on the heels of layoffs at Kellogg’s plants and distribution centers in New York, Michigan, and other states. The   plan was a result of the $53 million   loss reported by the cereal maker and is expected to include the closure of 39 distribution centers affecting roughly 1, 100 workers across the country. The cereal giant’s financial troubles coincided with its decision to cut its advertising with Breitbart News at the end of 2016, thereby snubbing Breitbart’s 45, 000, 000 readers. In November, Kellogg’s announced that Breitbart News’s conservative readers are not “aligned with our values as a company. ” While the decision by Kellogg’s to cease advertising made virtually no revenue impact on Breitbart. com, it did represent an escalation in the war by companies like Target and Allstate against conservative customers whose values propelled Donald Trump into the White House. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742562245.4684355}