{"duration": 0.036767005920410156, "input_args": {"text": "'Claire McCaskill ( ) sent out a misleading Tweet on Thursday claiming that she had never, “ever” met or spoken with Russian Ambassador Sergey Kislyak, while previous Tweets showed she met and spoke to the Russian official in 2013 and again in 2015. [“I’ve been on the Armed Services Committee for 10 years. No call or meeting with Russian ambassador. Ever. Ambassadors call members of the Foreign Res Com,” McCaskill tweeted on Thursday.  Almost immediately following her Tweet, McCaskill’s past Tweets contradicted her claim, including two retweeted by National Review Online Editor Charles C. W. Cooke showing a Tweet in 2013 and another in 2015 that said the senator spoke and met with Kislyak. Claire McCaskill says she’s had “no call or meeting   ambassador. Ever. ” But she tweeted about two. It’s easy to forget. pic. twitter.   —   Charles C. W. Cooke (@charlescwcooke) March 2, 2017,  Following Cooke’s Tweet and others picking up the story, McCaskill admitted on Twitter that she and “many senators” had met with the ambassador four years ago to discuss the U. S. halt to adopting Russian children, but then falsely reiterated her original claim: “Again, as a senior member of the Armed See, never received call or request from Russian Ambassador for meeting. Never met    ” McCaskill tweeted. When asked by Breitbart News why she claimed she had never met or spoken with the Russian ambassador when her Tweets showed otherwise, McCaskill’s communication director defended her by saying she had not met “  ” with him. “Attorney General Sessions met    with the Russian ambassador in the midst of a Russian cyber campaign against the U. S. and then misled the Judiciary Committee under oath about that meeting,” John LaBombard told Breitbart News via email. “He then tried to excuse it by saying it was part of the normal course of his Armed Services Committee work. “Claire has never met    with the ambassador, and never received a call from him,” LaBombard said. “She did attend a group meeting about adoptions with other senators, and had a brief proactive call with the ambassador amid calls to several other parties to the Iran nuclear deal. “Attorney General Sessions, on the other hand, misled the Senate under oath,” LaBombard said.'"}, "time": 1742564013.8363388}