{"duration": 0.2405567169189453, "input_args": {"text": "'In the latest installment of “Islam In America,” Roqayah Chamseddine is joined by Sarah Anastasia, a 27-year-old Muslim makeup artist and skin care consultant based in Massachusetts. Sarah discusses her service work and the exploitation and abuse that workers often face.\\nShe also talks about her sexual assault, how sexual assault survivors, specifically women, are often castigated for being assaulted, and what the reaction has been from her friends and family, including other Muslims.\\nPlus, in light of the release of Donald Trump’s “Access Hollywood” conversation with Billy Bush, which was recorded in 2007, Roqayah and Sarah examine the implications of this rhetoric about using his status as a celebrity to assault women and how it impacts survivors of sexual assault.\\nThis interview is part of Roqayah’s Islam In America series, which amplifies the stories of Muslim-Americans and what they struggle with in their day-to-day lives beyond just Islamophobia.\\nListen to the interview by clicking on the below player:\\n\\nSUPPORT THIS PROJECT If you enjoyed this video, please consider making a donation of $20 or more toward our $4,000 goal to fund the Islam In America project. Your contribution will help us publish more profiles of American Muslims like this one. * \\nBelow is a partial transcript of the interview: \\nROQAYAH: Before we get into the second half of the interview, I want to warn those listening that the subject matter may be difficult because we’re going to be talking about sexual assault. It’s a confronting and inarguably painful issue for all people, especially those who have been victims or those who know someone who’s been sexually assaulted.\\nAccording to the Rape, Abuse, and Incest National Network or RAIN, one of out of every six American women have been the victim of an attempted or completed rape in her lifetime. About 3% of American men or one in thirty-three have experienced an attempted or completed rape in their lifetime. And from 2009-2015, Child Protective Services substantiated or found strong evidence to indicate that 63,000 children a year were victims of sexual abuse.\\nAccording to the National Crime Victims Survey, since 1998, there have been 17.7 million American women who have been raped and 2.78 million American Men, and that’s according to the survey. There may be more because as we all know a lot of people do not come forward because of the stigmatization and other issues they may face from both the police or family.\\nSo, before we delve into anything, I wanted to say thank you for letting me talk to you about your story because I know it’s a really painful issue to talk about, especially since you’re a survivor yourself. Feel free to divulge as much or as little as you’re comfortable with.\\nThe reaction to you talking about your sexual assault, because you have talked in brevity on Twitter and I believe on Facebook to some extent—What was it like? What was the reaction like to you talking about it?\\nSARAH: Part of the reason why I posted it on social media was because I don’t—and I still really don’t. I felt like I didn’t really have anyone to talk to. What kind of, in as vague terms as possible, there was someone I was seeing out-of-state, and I went to go see him. His best friend ended up assaulting me. On top of this, my boyfriend, whatever you want to call him, obviously, ex-boyfriend now, blamed me for the entire thing and said it never happened when he was there. And called me all these disgusting names and said I deserved it. Plus, I was just thinking about it the other day because I hate to call it an anniversary but it’s been a year and like a week basically.\\nI was just thinking about it and how weird it was that it never happened, but then it was my fault for it happening. I was just thinking about that and how ridiculous it was. But anyways, I didn’t have anyone that I felt really comfortable talking to and also when it first happened, I was out-of-state so I had absolutely nobody. So it was very scary to me and I felt like Twitter—I don’t want to call Twitter a safe space—but I feel like it’s a place that I can express myself. Obviously, I get trolled like almost everybody does. But I was able to say what was happening almost like an open journal in some kind of play-by-play of what was happening.\\nThankfully, a lot of my friends that follow me were very receptive obviously and asked me if I was okay, this and that. I just felt like it was kind of important to talk about, but at the same time, I didn’t want to tell any of my family members. I had like one friend I told. I just felt very scared, and I felt like I was going to be judged or nobody was going to believe me. So, it’s like what is the point of even telling a family member if they’re just going to blame me or say it didn’t happen or say I’m making it up or being dramatic. I project a lot in my head, and so I feel like I was like I don’t even want to go there because I’m going to be more stressed out. More anxiety. Everything so Twitter was just kind of the place I went to.\\nROQAYAH: On that note, what have you gone through mentally, emotionally, and maybe even physically in light of the Trump tapes, where he gleefully talks about freely assaulting women? Because I know that many women have had stay away from social media because of this issue. They go through reliving their experiences. So what have you gone through?\\nSARAH: I actually went on a mini-vacation that weekend when everything happened with the tapes with my family and none of them know. So it was kind of this really bizarre kind of like me listening to all their opinions about it, and thankfully, for the most part, my family members were just like this guy is trash. He assaults women. He’s disgusting. He’s a piece of shit. Blah blah blah. But you had the few comments of, well, why are they coming out now? And that obviously hurts even more knowing that I never reported my assault. If I had said to them, oh by the way, I was raped too. It would be, well, why did it take you so long to come out type of thing?\\nSo that weekend was not really the best weekend.\\nJust a lot of the same things that his defenders or his supporters or fans kind of say that are enabling him are the same exact reasons why I didn’t report my assault and why I didn’t tell so many people because of that same reaction. So it just brought back a lot of really bad memories and feelings.\\nROQAYAH: People don’t understand what it takes to actually report sexual abuse. It’s more than going to the police and saying, hey, this happened to me and then it’s over with. It’s extremely intense. You have to not only tell a complete stranger what happened to you. You have to undergo oftentimes medical services that require you to undress yourself, do different kind of examinations, and then at the end of the day, your rape kit may not even be tested for years on end. There’s a lot more to it.\\nAnd then, finding out recently I believe based on reports in the Washington Post and elsewhere, cops will routinely laugh and mock sexual assault victims and try to manipulate them into recanting or telling them things like the kid is really young. Why you gonna ruin his life? So this isn’t just something, oh, you didn’t tell? Why didn’t you tell? It’s a lot more than filing a report and then going home and you’re fine. But I think a lot of people assume it’s that easy.\\nDo you think the language that Trump uses in those tapes, and uses otherwise to describe women, do you think that’s pervasive amongst men in the U.S?\\nSARAH: Oh, totally. Even before these tapes happened, like if you go back, I posted about this on Facebook. What he did to Miss Universe, even back to Rosie O’Donnell. He has always been so just disgusting. You can just tell he’s somebody who thinks they’re more powerful and so much more above women and just thinks they’re there to serve him and he can do whatever he wants to them and he’s rich and this and that. Like the same thing from the tapes.\\nIt was more the reaction to the tapes that was surprising. Clearly, this is a huge issue in the U.S. You have not just with Donald Trump but you see this a lot of time on the news anyways. I remember with Steubenville and a lot of other cases, like that swimmer, Brock Turner. Like oh you’re ruining his wife and this and that and no one ever once thinks, oh, this poor woman’s life is completely ruined. I remember in Steubenville the women had to move out of the town because she was getting harassed.\\nIt’s just so ridiculous to me and so hurtful that this is continuously happening, and obviously, with Trump too. And I think it’s beyond people who support him. I think there are people too who were like, oh, it’s just words. My mom and I saw some type of report where they went to some random town in Pennsylvania and a lot of them were saying oh that’s Trump’s personal life. I’m still going to vote for him. And it’s like, how is that personal life? He’s assaulting women. That shows how disgusting he is and just his character is so rotten.\\nROQAYAH: A lot of these people defending him either know someone who talks like that or talk like that. I was not as angry about it and thankfully I began to say this is really bad. You need to stop talking about women like animals basically. Whenever I hear any guy defending what he is saying—I mean, it’s very simple. All you got to do is say I don’t support what he says. It’s really bad. There’s really not more to it, but men specifically are going out of their way to say, eh, this is normal. And I don’t talk like that but it happens and get over it and you’re being politically correct. It’s a bunch of bullshit they use to defend in reality what they are in real life.\\nSo being a sexual assault survivor, have you had trouble talking about this to other Muslims? Because I know that sex and the subject of sexual assault is still unfortunately really taboo in our community.\\nSARAH: Thankfully for most Muslim women, my friends, they’ve either — well, I shouldn’t say thankfully because unfortunately some of them are like this happened to me too. I’ve had several people, friends either from real life or social media, contact me and be like this happened to me too, which is a whole other issue. But I haven’t really—Even when I was posting about it on Twitter, not that many men really replied. I did have a friend that was not that judgmental but he did ask me was I drinking, what was I wearing, and stuff like that. It’s like that’s not really relevant to the story because you’re not asking if he was drinking or what he was wearing. Why is that even a question? So that really bothered me.\\nROQAYAH: I don’t know why. I don’t know why this is still an issue with men. There’s no reason why that will matter in the story. No one has a right to put their hands on another person without consent. So if you are butt naked and you are out of your mind drunk, it shouldn’t matter. You don’t have the right to touch anyone, especially in a situation where they might not be there mentally. That kind of thing really makes me sick.\\nSARAH: It just makes me very angry. In my head, it’s almost like are you doubting my story or—The only answer is, what if I was wearing a revealing outfit and I was doing shots at the bar or something (which I wasn’t)? Does that mean that I deserved it? I don’t get why you’re asking the question.\\nROQAYAH: It serves no purpose whatsoever, and it works as a way for them to manipulate you and sort of doubt your story without coming out and having a spine to say I don’t believe you.\\nSARAH: Right, and especially I feel like from Muslims it’s like that whole extra, well, were you drinking because you’re not supposed to be? Well, were you wearing a revealing outfit? You shouldn’t have been.\\nROQAYAH: That’s another issue with Muslims. It’s a bit off-topic, but since we brought up the subject, a lot of Muslims look down on other Muslims who drink or who don’t wear the hijab or don’t follow the religion as they think they should. And so we see when a lot of Muslims are in the news, and they do something terrible, they go, oh, well, he wasn’t really a Muslim. He was drinking. Or he wasn’t really a Muslim. He was having premarital sex. They don’t understand that sin doesn’t remove you from the fold of your religion in the way that they think. So people will make mistakes or do whatever, and it doesn’t make them any less of a Muslim than you because you’re so uber pious.\\nThe post Interview: Sarah Anastasia, Muslim Makeup Artist And Skin Care Consultant appeared first on Shadowproof .'"}, "time": 1742563282.2955909}