{"duration": 0.058077096939086914, "input_args": {"text": "'The system that prevents the employees of the Sam Ash Music store in Midtown from buying stolen guitars begins before the case is even opened. “First thing I say is, ‘What do you got there? ’” said Ian Goldrich, a store manager. If the seller’s answer is something like, “It’s a 1953 Fender Telecaster with an Esquire neck,” then it is probably legitimate. But if the answer is “a guitar,” that’s something altogether different. A new seller who entered Sam Ash on Sept. 28 had a plausible explanation for not knowing much about the contents of the guitar case he carried that day and, later, other cases. “His father moved to North Carolina and left him the guitars,” said Jeremy Kolmin, another manager. The store bought his Gibson that day, and $4, 300 worth of other instruments, mostly guitars, in the weeks that followed. “He’s a nice guy,” Mr. Kolmin recalled. The staff at Sam Ash knows a lot about guitars. So when that same seller entered in late November with an electric guitar, Mr. Kolmin did a double take. He was sure he had seen it before. Like many guitar enthusiasts, Mr. Kolmin visits the “gear pages” of musicians  —   links that display an artist’s favorite guitars. The seller was carrying a Heritage guitar  —   specifically, a Heritage Signature Skolnick, part of a limited series designed by a specific artist, Alex Skolnick. It was a unique instrument, and it made Mr. Kolmin suspicious because he followed Mr. Skolnick and recognized it from his gear page. Then he flipped it over and saw the serial number, Z20001, and his suspicions were all but confirmed. He asked something like, “Where did you get this again?” and the seller gave the same answer about his father, he recalled. The end digits, 001, indicated the guitar was a series prototype, not one sold by the company. It would have belonged to the artist, Mr. Skolnick. Mr. Skolnick, 48, leads a jazz outfit, the Alex Skolnick Trio and, at this time of year, has played holiday shows with the   Orchestra. But to a large and loud segment of his audience, Mr. Skolnick, with his long black hair and its telltale streak of white, is best known as lead guitarist of the thrash metal band Testament. The band gained fame in the late 1980s and was known in part for the melodic style Mr. Skolnick brought to his solos within a genre that favored raw intensity. He left in the 1990s, but the band has reunited over the years and continues to perform, as they will, with more than 60 other bands on a heavy metal cruise from Florida to Haiti in February, “70, 000 Tons of Metal. ” The store emailed Mr. Skolnick about the Heritage guitar. He lived in Brooklyn, but was in Berlin, wrapping up a tour with Testament. Months earlier, in May, he had placed a lot of equipment that was piling up at home  —   he estimates he owns 40 guitars, along with amplifiers and other gear  —   in a new CubeSmart storage facility near his apartment in Park Slope. The Heritage was among the stored guitars, and he had no idea it was not in the locker. “Indeed,” he wrote to Sam Ash in an email, “I might not have noticed for another year or so, as I’m on tour often and there are long gaps between my going through all the instruments I’m not using. ” He promised to visit his locker upon his return that week. Before that happened, on Dec. 1, the seller returned to Sam Ash with another Skolnick   guitar, this one from the ESP Guitar Company. “We called the cops and said, ‘What are we supposed to do? ’” said another manager, Bobby Colonna. Officers arrived and questioned the man briefly, but without a complaint from a victim, they could not arrest him, and he left. Still, Mr. Colonna urged the man to come back in a day, pretending he needed the time to research the guitar’s worth. At the same time, Mr. Skolnick visited his locker. It did not appear to have been tampered with, and the contents of the unit looked untouched, but some guitars were indeed absent. He swore out a complaint. The managers at Sam Ash were sure that after the previous day’s police scrutiny, the man would not return. But return he did. Officers returned, too, and in front of the store staff, they were able to handcuff the seller, John Olds, 51, of Harlem. “My father passed away two years ago and left me the guitars,” he told officers, according to court documents. He added, “I can’t incriminate myself. ” He is in jail awaiting trial on several counts of possession of stolen property. Mr. Skolnick got his guitars back, including the Heritage No. 1, which is again being kept where it was before the move in May: in his crowded living room, in plain sight.'"}, "time": 1742563308.5805428}