{"duration": 0.05330777168273926, "input_args": {"text": "'License DMCA Today, no one is discussing our worst problem, growing poverty. Trump proposes Law and Order and more police in poor neighborhoods. Will more police end poverty or make it worse? How can we understand crime and its solutions without understanding its origins both historically and in terms of system? This is my attempt to come to terms with the joined evils of poverty and crime and thus form an understanding that leads to real solutions, a topic made off limits in this election. Like an infection, poverty and crime will only get worse if ignored.\\nGerman philosopher Hegel (whom Marx turned upside down) noted the \"paradox\" of poverty amidst great wealth: \\n\"[D]espite an excess of wealth, civil society is not wealthy enough -- i.e., its own distinct resources are not sufficient -- to prevent an excess of poverty and the formation of a rabble.\" Ah, the rabble democracy: mob rule. \\nLike Aristotle 2000 years earlier, he sees that \"poverty is the parent of crime.\" \\nLack of wealth, in a society where people are equal, does not create crime (for it creates no motive for crime). If you look out and all live in humble shacks, that\\'s life. Enjoy! Skyscrapers - shanghai17s jimdo page! License DMCA - Advertisement - \\nBut if you look up from the slums to the mansions of the rich, if you see Trump Tower looming in the distance, this produces a sense of moral outrage, anger, resentment, a desire to correct things or to do revenge. This hostility to one\\'s circumstances in life usually leads to crimes against fellow victims of inequality. The reaction to gross inequality is rooted in a moral sense of injustice: this can be misguided into crime against fellow victims....or harnassed for revolutionary change in which the poor stop killing each other and unite to crush their oppressors, the very people arming them to kill each other. This is the awakening that Marx tried to explain. \\nAnd it is not just a \"natural\" result of inequality; it is deliberate, as Jay Gould said, when asked what to do about the poor rising up, that we can hire half the poor to kill the other half. Divide and Conquer: A strategy to managing your finances ... License DMCA \\nThe imperialist logic of divide, conquer (and loot) applies not only to foreign conquests but internally, for society is itself a set of populations based on class, from the Gates and Trumps of the world, to the malnourished children of the poor, not only in Bangladesh (where Trump\\'s clothing is made by slave labor) but in New York City. - Advertisement - \\nHegel formed the justification for the totalitarian state: \"The Nation State is spirit in its ... actuality ... it is therefore the absolute power on earth. ... The State is the Spirit of the People itself.\\n\"All the worth which the human being possesses - all spiritual reality, he possesses only through the State . ... For Truth is the Unity of the universal and subjective Will; and The Universal is to be found in the State, in its laws, its universal and rational arrangements. The State is the Divine Idea as it exists on earth.\" \\n\"In direct contrast to German philosophy, which descends from heaven to earth, here we ascend from earth to heaven.\"(860) Communism Never Looked So Cute - ThingLink License DMCA Marx: \\nMarx\\'s Dialectical Materialism asserts that history is a process of development through conflict; not a conflict of ideas, but real conflict between economic classes.\" \\nAnd there is the revolutionary answer to poverty: Workers of the world, unite.'"}, "time": 1742562247.428207}