{"duration": 0.15866851806640625, "input_args": {"text": "'DENVER  —   As Americans poured into airport terminals, public squares and congressional town   meetings over the past month to vent their anger over President Trump’s policies, Debbie Dooley started hearing from fellow conservatives. “Phone call after phone call from people: ‘Why aren’t we out supporting President Trump? ’” said Ms. Dooley, a Tea Party activist in Georgia. So on Monday, conservatives around the country got out the Make America Great Again hats, unfurled American flags and held rallies at state capitols and on courthouse steps, seeking to rekindle the populist fervor that helped vault Mr. Trump to the White House and stick up for a president whose approval ratings have taken a beating during five   weeks in office. But the modest crowds that showed up for the noontime rallies from New Jersey to Georgia to Colorado offered a reminder of what liberal groups learned eight years ago in the face of Tea Party anger at President Barack Obama: Stoking   energy is often easier for the outraged resistance than for the party pulling the levers in Washington. “I’m getting a lot of comments from the leftists about, ‘Your crowd’s not going to be as big as our crowd,’” said Betty Blanco, a retired teacher from La Junta, Colo. on the state’s conservative eastern plains, who organized a rally on the steps of the   State Capitol. “I didn’t know it was a contest. ” About 150 Trump supporters turned out for Monday’s rally in Denver, held just across the street from a park that had swelled with tens of thousands of protesters as part of the Women’s March on Jan. 21. Organizers said Monday’s rallies, held a day before the president addresses a joint session of Congress, bubbled up organically from Trump supporters who felt he was being treated unfairly by Democrats and the news media. Some people said the ferocity of that criticism had actually nudged them closer to Mr. Trump. “I was mad at Trump for a while, absolutely,” said Steve Foose, a bus driver in Middletown, N. J. and   former Democrat who joined about 200 people waving signs and flags along the curb of a   crossroads. “I just grew to like him, and I would lay down my life for him. ” Monday’s rallies were filled with prayer, choruses of “God Bless America” and speeches about cutting taxes and regulations. People applauded the president and veterans, and urged one another to stay positive. But there were also chants of “Lock her up!” every so often, and a few shouting matches when Trump critics wandered by and yelled at the crowds. People praised Mr. Trump for actions that have provoked protests and lawsuits from the left. In interviews at five rallies on Monday, his supporters said that he was breaking the china in Washington, cracking down on immigration and supporting American businesses, and that they were getting frustrated that more people did not seem to see it that way. In Atlanta, Jermane Enoch, 57, a project manager from Powder Springs, Ga. was among the few   in a largely white crowd of 200 who rallied on the president’s behalf at Liberty Plaza, in the shadow of the State Capitol. Wearing a red Trump hat, a patriotic bow tie and a Trump   Mr. Enoch said that good businesspeople would understand why Monday’s rallies across the country were needed, given what he said was the “negative messaging” from   protesters and the news media. “It’s necessary to have a show of continuous support, just like it’s necessary for businesses to show continuous improvement,” he said. Mr. Enoch argued that the president had been mischaracterized and misunderstood. The idea that Mr. Trump is a racist, as some critics contend, struck him as balderdash. In a   turn at the microphone, Mr. Enoch said his support for Mr. Trump superseded race, and he urged a return to conservative values. Mr. Enoch brandished a pocket Constitution, to much applause. And he took a cue from Isaiah as he said Mr. Trump’s supporters should not be cowed by counterprotest: “I am not afraid!” he said. “No weapon that is formed against us shall prosper!” RICHARD FAUSSET In Mandeville, a city in one of Louisiana’s most conservative parishes, there was some question as to how many Trump supporters would materialize, this being the usually quiet eve of Mardi Gras. But there was little doubt that those who showed up  —   150 or so bikers, retirees,   police officers and others  —   would be   in their support for a president who won the parish by roughly three to one. A home remodeler and disc jockey who uses the name Bobby Blaze made the most   entrance, wearing a suit over his leather “Brotherhood of Bikers” vest, a bright red tie with a gold clip and, to top it all off, a   Trump wig. He said that his father, a World War II veteran who died two years ago, would have loved Mr. Trump: “‘The country needs John Wayne,’ that’s what he used to say. ” And after aiding its allies around the globe for decades, Mr. Blaze suggested, the United States had finally gotten such a   leader at a time when it needed him most. “We can’t help the world,” he said, “till we can help ourselves first. ” CAMPBELL ROBERTSON In Cabarrus County, N. C. which Mr. Trump easily carried, more than 150 of his supporters met up outside the courthouse in Concord, many of them unfurling last year’s Trump campaign flags, lawn signs and red caps  —   though a surprising number said they had never attended a Trump rally during the presidential race. Bill Cagle, a retiree, decided to attend on Monday after seeing a deluge of news coverage of   demonstrations in the streets and at congressional town halls. “I said, ‘Well, we’ve been silent long enough, and we’ve really got to say what’s in the heart,’ when I saw all of this vitriol the last six weeks,” Mr. Cagle said. An operations manager for a company that builds towers for   lines, Mr. Cagle said he was a registered Democrat but had not voted for the party’s presidential ticket in decades. He said he maintained his registration only to vote against what he considered the worst option in a primary race. “What he’s done in a little bit of time, I think is great,” he said of Mr. Trump, noting in particular his efforts to roll back regulations. “I’ve been in business, and by golly, if they can get rid of some of that, it’s great. ” TRIP GABRIEL On the edges of the Denver crowd, two men exemplified the devotion and the dread that the president inspires. Ron Kamstra, a retired civil engineer and   Christian who said he deeply supported Mr. Trump’s stances on terrorism and immigration, handed out photocopied passages of the Quran that he said encouraged violence. Mohamed Mashkooke, an accountant born in Somalia, wandered up to Mr. Kamstra and said he was growing increasingly worried about becoming the target of racist attacks  —   like the shooting last week of two Indian men in Kansas. Cordially at first, but then increasingly tensely, the men argued about religion, immigration, faith and the validity of Mr. Obama’s birth certificate. (Despite all of the facts, Mr. Kamstra is still dubious.) “I don’t hate Trump,” Mr. Mashkooke said finally, walking away, “but I think he’s crazy. ” “O. K. good,” Mr. Kamstra replied, and turned back to the speeches. JACK HEALY'"}, "time": 1742561632.4505787}