{"duration": 0.06755280494689941, "input_args": {"text": "'We Are Change \\nA GoFundMe campaign to crowd-source a modest $5,000 to cover the cost of basic needs of those camping out in protest of the Dakota Access Pipeline has raised over $1.3 million since it launched in April.\\nDakota Access Pipeline Protest\\n“It still feels unreal sometimes because it is such an astronomical figure to me,” said Ho Waste Wakiya Wicasa, the protester who set up the GoFundMe account, told CBS .\\nOver 28,000 people have contributed to the GoFundMe over the last six months, with $200,000 being donated last Thursday and Friday alone. The surge in donations came after militarized police arrived to clear out the camp, making mass arrests in the process.\\n“The money goes as quickly as it comes, but without it having been as much as it is, we certainly wouldn’t have been able to be as productive as we have been in the fight,” Wicasa continued.\\nAs of Sunday, 412 people have been arrested on various protest related charges, ranging from engaging in a riot, criminal trespassing, and conspiracy to endanger by fire.\\nThe campaign is one of several, which have collectively raised over $3 million in total to help with food, supplies, and legal expenses.\\n“Militarized law enforcement agencies moved in on water protectors with tanks and riot gear today,” Dave Archambault II, the chairman of the Standing Rock Sioux, said in a statement. “We have repeatedly seen a disproportionate response from law enforcement to water protectors’ nonviolent exercise of their constitutional rights.”\\nIn another effort this week, over 1.3 million people checked in to the Standing Rock Indian Reservation on Facebook. The goal was reported to have been throwing off law enforcement officials who were tracking protesters on social media, though the effectiveness of that is questionable. What the effort did do however, was spark many conversations and spread awareness of a very large and effective scale.\\nThe costs for preparing for winter are not cheap however — and the account setup for donations to Wicasa’s GoFundMe had just $100,000 left as of Friday.\\n“The money has been used for grocery store trips every two days that cost about $2,000 each, 20 yurts purchased for $160,000, and around $7,000 for bail money. It has also paid for a storage area, composting toilets, tiny houses, tepees, a medical area and generators powered by solar panels and wind,” CBS reported.\\nThe Standing Rock Sioux Tribe is suing the US federal government to stop construction of the 1,160-mile pipeline. They claim that tribal administration was not consulted, even though the pipeline runs through tribal lands, and that it endangers the water of millions of people.\\nThe pipeline will transport some 450,000 barrels of oil per day across the Missouri River — which provides the water for eighteen million people — meaning a leak would be absolutely catastrophic.\\nThe post Dakota Access Protesters Try to Raise $5K, Bring in Over $1.3 Million appeared first on We Are Change .\\n'"}, "time": 1742562995.0446174}