{"duration": 0.14582157135009766, "input_args": {"text": "'An experimental Alzheimer’s drug that had previously appeared to show promise in slowing the deterioration of thinking and memory has failed in a large Eli Lilly clinical trial, dealing a significant disappointment to patients hoping for a treatment that would alleviate their symptoms. The failure of the drug, solanezumab, underscores the difficulty of treating people who show even mild dementia, and supports the idea that by that time, the damage in their brains may already be too extensive. And because the drug attacked the amyloid plaques that are the hallmark of Alzheimer’s, the trial results renew questions about a leading theory of the disease, which contends that it is largely caused by amyloid buildup. No drug so far has been able to demonstrate that removing or preventing the accumulation of amyloid translates into a result that matters for patients: stalling or blocking some of the symptoms of dementia. “It’s not going to be   therapy for mild patients, so that’s heartbreaking,” said Dave Ricks, the incoming president and chief executive of Eli Lilly. There are clinical trials underway with several similar drugs made by other companies, and two large trials with solanezumab are in the works. Experts said on Wednesday that they still held out hope for those studies, noting that many involve people who are at high risk for Alzheimer’s but do not display symptoms. Some Alzheimer’s experts not involved in trials testing   drugs said they were not surprised by Lilly’s results, saying they reflect an emerging scientific understanding of Alzheimer’s as a disease with a multipronged cascade of causes, including amyloid buildup. “We’re much more really appreciative of how complex this disease is,” said Dr. Lon Schneider, director of the California Alzheimer’s Disease Center at the University of Southern California. “There’s so much going on, and as the brain is failing or dying, it is dying on all levels. ” It has also become clear that Alzheimer’s pathology begins damaging the brain years before symptoms emerge, leading many experts to think a drug given to people with even mild dementia may have little chance of success. “Once you see amyloid on a scan, it’s probably been there for decades,” said Dr. Samuel Gandy, an Alzheimer’s researcher at Mount Sinai Hospital. “I’m worried and have been worried that that’s just too late,” he said. “I think it has a better chance of working much earlier. ” But, he said, testing a drug before people have begun showing symptoms is challenging and costly. Such trials need to involve even larger numbers of patients to produce a useful result, and because the patients are healthy, without symptoms, the drugs cannot have side effects that might make them feel sick. Solanezumab had previously failed in two large clinical trials involving patients with mild or moderate Alzheimer’s disease. But when Lilly reported the results of those trials in 2012, the company said the drug did have an effect in a subset of patients with mild symptoms. So it started another trial with 2, 100 patients with mild dementia caused by Alzheimer’s. In  a news release on Wednesday, the company said that although some of the effects looked promising, “patients treated with solanezumab did not experience a statistically significant slowing in cognitive decline compared to patients treated with placebo. ” The company said it would evaluate future plans for solanezumab, but no longer planned to seek regulatory approval for use of the drug in treating symptomatic patients. Eli Lilly stock initially dropped after the news. “This is very disappointing,” said Dr. Reisa Sperling, a neurologist who is recruiting patients for a trial testing whether solanezumab can help people with amyloid buildup who are about 10 years away from having symptoms. “But I have to be honest that I’ve always thought we needed to treat much earlier, because by the time people have mild dementia, they already have a lot of irreversible damage,” she said. The trial she is leading, called   Treatment in Asymptomatic Alzheimer’s (A4) which has funding from Lilly and the federal government, had hoped to reach its goal of about 1, 150 patients by the middle of next year, said Dr. Sperling, who directs the Center for Alzheimer Research and Treatment at Brigham and Women’s Hospital and Massachusetts General Hospital. “I have several patients within my practice who were hoping to take this drug,” she said. But she said it was at least encouraging that patients taking solanezumab in Lilly’s trial did show improvement, just not enough to be statistically significant, and she plans to evaluate the data to see if changes should be made to the design of the A4 trial. “What does that mean for an earlier population?” Dr. Sperling said. “Do we need more people? Do we need a longer time? I just want to get a clear result. ” The other major solanezumab trial, the Dominantly Inherited Alzheimer Network Trials Unit, is also testing a Roche drug, gantenerumab, and is funded by industry, the federal government and the Alzheimer’s Association. It involves people who have not yet shown symptoms, but have a very high risk of an   version of the disease because they have a genetic mutation that causes a small subset of cases. Other trials are using   drugs that work in different ways, experts said. Solanezumab is a monoclonal antibody that removes amyloid by attaching itself to   amyloid protein before the protein forms into plaques, while several other antibody drugs also attack amyloid fibrils that are part of the plaques. Another class of   drugs are called BACE inhibitors, which block an enzyme that makes a protein needed for amyloid production. “You can’t really say that the solanezumab results predict that a drug with a different mechanism will fail,” Dr. Schneider said. Dr. Eric Reiman, executive director of the Banner Alzheimer’s Institute, is leading a prevention trial involving members of a large extended family in Colombia who do not have symptoms but have a genetic mutation that causes early Alzheimer’s. They are taking Genentech’s crenezumab. Dr. Reiman said Wednesday’s results raised questions about whether Lilly’s dose was high enough, whether the researchers were “attacking the right form of amyloid,” and whether they were they treating patients too late in the disease process. The results may also support theories that the ultimate answer will be combinations of drugs addressing different aspects of Alzheimer’s. He and other experts continue to believe that “the accumulation of amyloid serves as the kindling for other events” that ignite the fire of Alzheimer’s disease, he said, and “it would be a grave mistake to throw out the baby with the bathwater and not give the amyloid hypothesis its best real test. ” Still, “a win for Lilly would have been a win for the entire field,” Dr. Reiman said, and “would have opened up new opportunities for patients. ”'"}, "time": 1742561958.5626838}