{"duration": 0.033158302307128906, "input_args": {"text": "'Newshour panelist cries in joy after being able to hear own voice and complete sentence fully Posted on \\nFrequent panelist on Times Then Now’s prime-time debate program, The Newshour, AAP spokesperson, The Ashutosh burst into tears on camera yet again, thanks to the sheer joy of being able to hear his own voice and the overwhelming feeling of being able to complete his sentence fully without being interrupted. (Image via intoday.in) \\nThe former IBN7 editor described his emotional experience to The UnReal Times , but not before asking “The Modi” to answer for his own emotional outburst. “There is the Youtube video of the deff babie who is able to hear the human voices, including his own, for the first time, after being fitted with the hereing aide. The babie’s joy is just prizeless !!! That is exactly how I felt when I was able to hear my own voice on the Newshour for the first time !!! Not only that, I was also able to fully complite my sentence without any interruptions !!! It’s an unbelivable feeling !!! My wife told me that the Mogu and the Chhotu also started crying on seeing me crying on the TV !!!” The Ashutosh exclaimed. \\nRecounting his earlier experiences on the Arnab era Newshour, the AAP spokesperson said, “With the Arnab, I could not hear my own voice and I still used to talk. Once in a while, the audiance wud laugh after I said something and I used to realize that way that I had said something stupid, like filibusting or simply ‘the’ing random people or things. Also, I figured out that I would never really be able to complete any sentence, so I started shortening my sentences to 2-3 words, like in the bank-e-scam episoade. Of course, soon later, AAP boycoatted the Arnab. Now, thank the God, there is no need for all these struggles !!! The journalism is back in the Times Now !!!” \\nWhile being strong opponents in every other topic under the sun, in this regard, however, The Ashutosh found strong consonance from rival spokesperson, the BJP’s Sambit Patra. “I can fully understand what The Ashu went through and how he must’ve also finally felt yesterday. I too, could often never hear what I myself used to squeal but soon enough, even though the topic would be in our favor, the hot seat would somehow shift to mine and I would often be blasted for something the Congress or the AAP did. Even though I haven’t gone to the post-Arnab Newshour, I can fully feel what The Ashu feels,” Patra added. \\nAccording to sources, the Congress party too, is mulling a return to The Newshour. “Boy, I can’t wait to return to the Newshour and finally be able to talk about 2002 at length,” a thrilled Congress spokesperson Sanjay Jha exclaimed. Tweet About Ashwin Kumar \\n1 of the proud columnists of URT, former co-editor of URT Tamil, amateur musician, Real Harris Jayaraj devotee, UnReal T. Rajendar fanatic, passionate about stopping female foeticide.'"}, "time": 1742628317.691762}