{"duration": 0.09991168975830078, "input_args": {"text": "'The lawyer representing the State of Hawaii in the U. S. Court of Appeals for the Ninth Circuit today has stated the collection of data with regards honor killings should be removed from President Trump’s Executive Order in order to “pass constitutional muster”. [In his arguments, Neal Katyal stated today that the collection of such data as outlined by the Executive Order 13780 contravenes the Establishment Clause, in the First Amendment of the Constitution of the United States: “Congress shall make no law respecting an establishment of religion  …    ”.  In doing so, Katyal appears to be making the case that honor killings  —   murder committed in the name of restoring a family’s dignity following discouraged behaviour within fundamentalist homes  —   is in itself Islamic. It is an argument often made by   campaigners, but to hear such arguments made by the political left might surprise some, especially when honor killings are also found  —   though to a lesser extent  —   in other religious groups like the Sikh community. “What does [the President] have to do to issue an executive order that, in your view, might pass constitutional muster?” asked Judge Paez of the United States Court of Appeals for the Ninth Circuit, this afternoon. Katyal responded at length, stating: “I think there’s two paths that the President could take in order to pass constitutional muster. “One is the way that our founders thought, Article 1 Section 8 which, as Congress in the driver’s seat with respect to immigration, passes a statute. as Justice Alito said, when Congress passes a statute it’s much less likely to discriminate. It is 535 people versus one, which is why his Mandel point is so problematic. That’s number one.  “Second thing the president could do, or the kinds of things or some of the kinds, removing some of things that the district court found led an objective observer to say that this this discriminates.  “One example would be, what Judge Hawkins said, disavowing formally all the stuff said before. But that’s not it. He could do a lot of things. For example, I’m going to throw out some examples. I‘m not trying to micro manage the President. He could say, like President Bush did, right after September 11th, the face of terror is not the true faith of Islam. that’s not what Islam is about. Islam is peace. Instead, we get, quote, Islam hates us. I think Islam hates us.  “I think he could point to changed circumstances from December 2015, when Congress debated the exact same evidence that the President relies on in his executive order and say, you know, we actually need more than just denying people entry without a visa, which is what Congress required. You need to do more than that.  “It could eliminate the text, which refers to honor killings. There’s a bunch of different things that could be done. And our fundamental point to you is that presidents don’t run into Establishment Clause problems and the reason for that is this is a very limited, you know, in a really unusual case in which you have these public statements by the President. if you affirm the district court there’s not a thing that any president has done in our lifetime that would be unconstitutional”. For Katyal to advance such an argument may also be detrimental to the public understanding of honor killings in the United States. Executive Order 13780 mentions honor killings only once, in the section (11) entitled “Transparency and Data Collection” where it states: To be more transparent with the American people and to implement more effectively policies and practices that serve the national interest, the Secretary of Homeland Security, in consultation with the Attorney General, shall, consistent with applicable law and national security, collect and make publicly available the following information  …       …    (iii) information regarding the number and types of acts of   violence against women, including   ‘‘honor killings,’’ in the United States by foreign nationals  …     Katyal’s other argument  —   that President Trump should go to great lengths to fawn over Islam as one of his predecessors, President George W. Bush did  —   could even be said, under Hawaii’s apparent broad interpretation of the Establishment Clause, to be a violation in and of itself. Raheem Kassam is the Editor in Chief of Breitbart London and tweets at @RaheemKassam'"}, "time": 1742561977.7112396}