{"duration": 0.07090377807617188, "input_args": {"text": "'  Donald Trump told a critical biographer and guest of billionaire David Koch to leave his West Palm Beach golf course on New Year’s Eve, forcing Koch to leave with him. [Trump’s gesture was another slight against the    “free trade” billionaire brothers Charles and David Koch, who opposed Trump during the Republican primary season and refused to help him during the general election. It also signals Trump will not necessarily play nice with the GOP political establishment and Beltway right.  The Kochs swooped in during the Tea Party revolt in 2010, training amateur political activists and trying to channel populist energy against the Obama administration into supporting the   alliance that wanted more cheap labor and lesser sentences for drug traffickers, under the umbrella term of “smaller government. ” But the “grassroots army  …     was not controllable,” as one former Koch staffer lamented, and the Kochs appeared curiously unwilling to make any concessions to Americans who wanted populist, nationalist policies, and relief from the relentlessly eroding forces of mass immigration and globalization. A majority of voters —   some of whom saw more demographic change take place in their communities than many countries saw in a millennia —  want immigration slashed in half or reduced to zero. Trump captured that energy and it propelled him to the White House, much to the Kochs’ and their network’s chagrin. The Kochs wanted candidates amenable to their will, and Trump didn’t fit the bill. They considered him a distraction before he rocketed to first in the polls, and even toyed with the idea of spending tens of millions of dollars to attack him. Trump mocked the Kochs while on the campaign trail, calling their preferred candidates “puppets” enacting their donors’ agenda: I really like the Koch Brothers (members of my P. B. Club) but I don’t want their money or anything else from them. Cannot influence Trump!  —   Donald J. Trump (@realDonaldTrump) July 30, 2015,  I wish good luck to all of the Republican candidates that traveled to California to beg for money etc. from the Koch Brothers. Puppets?  —   Donald J. Trump (@realDonaldTrump) August 2, 2015,  While I hear the Koch brothers are in big financial trouble (oil) word is they have chosen little Marco Rubio, the lightweight from Florida,  —   Donald J. Trump (@realDonaldTrump) February 28, 2016,  Little Marco Rubio, the lightweight no show Senator from Florida, is set to be the ”puppet” of the special interest Koch brothers. WATCH!  —   Donald J. Trump (@realDonaldTrump) February 28, 2016,  I turned down a meeting with Charles and David Koch. Much better for them to meet with the puppets of politics, they will do much better!  —   Donald J. Trump (@realDonaldTrump) July 30, 2016,  Koch’s guest: Harry Hurt III, who authored the 1993 book, Lost Tycoon: The Many Lives of Donald J. Trump, which stated Ivana Trump accused her   of “raping” her in a sworn deposition during their divorce. In a Facebook post published on the same day, Hurt recounted the incident in third person: Donald Trump personally booted the author of an unflattering biography off Trump International Golf Club in West Palm Beach on Friday. Harry Hurt III, who penned the 1993 biography, Lost Tycoon: The Many Lives of Donald J. Trump, had come to play with billionaire industrialist David. H. Koch, a Trump club member, and two other golfers. Hurt, who has a scratch handicap and plays in colorful knickers, walked over to Trump on the practice range prior to his group’s assigned tee time, only to suffer a tongue lashing from the  . “I said, ‘Congratulations, sir,’ and shook his hand,” Hurt recalls. “Trump said, ‘You were rough on me, Harry. Really rough. That shit you wrote. ’” Hurt says he looked Trump in the eye, and said, “It’s all true,” to which Trump rejoined, “Not in the way you wrote it. ” Among the juicy tidbits in Hurt’s tome was Ivana Trump’s allegation in a sworn deposition that Trump had “raped” her during their divorce battle. Trump told Hurt it was “inappropriate” for him to play at the club, and had his security detail escort Hurt, Koch, and their playing partners to the parking lot. “David [Koch] was appalled,” says Hurt. “He branded Trump ‘petty’ and vulgar.’ We played Emerald Dunes instead, which is a much, much better golf course than Trump International. ” Accusing Trump of “raping” his ex wife, Ivana Trump, was a false media accusation arising early in the Republican primaries —  and a weapon the Democratic Party planned to use in the general election after Fox News’ Megyn Kelly and the Daily Beast “rushed it on air” and into print, using Hurt’s book, before bothering to check with Ivana about its truth. It backfired spectacularly when Ivana slammed the allegations and endorsed her   for president. ““I have recently read some comments attributed to me from nearly 30 years ago at a time of very high tension during my divorce from Donald. The story is totally without merit,” she said in a July 2015 statement. “Donald and I are the best of friends and together have raised three children that we love and are very proud of. I have nothing but fondness for Donald and wish him the best of luck on his campaign. Incidentally, I think he would make an incredible president. ” Breathless media coverage of the New Years’ Eve encounter between Trump, Koch, and his guest framed it as Trump having little tolerance for criticism: Nearly every headline focused on the biographer and his critical book, not Koch. Read Politico’s report, including more from Hurt and a transition official’s account, here.'"}, "time": 1742562634.398266}