{"duration": 0.20200538635253906, "input_args": {"text": "'MONTICELLO, Iowa  —   The Table of Knowledge was delving into   Donald J. Trump’s plans to upend government, and marveling at how he had forced his fellow Republicans in the House to reverse themselves on gutting the Office of Congressional Ethics. “He’s getting responses things are happening,” Jerry Retzlaff, a retiree, said. “He got Congress to turn themselves around with one tweet. ” “There’s no secret the press doesn’t like him, and neither does a lot of the leadership,” he added. “And that’s because he’s planning on making a lot of changes. ” The eight men around a rectangular table, sipping coffee from a hodgepodge of mugs donated by customers, meet daily for breakfasts of French toast, eggs and bacon at Darrell’s diner, all while solving the world’s problems, hence their gathering’s nickname. Washington may be veering from one Trump   controversy to another: unproved reports of Russia’s holding embarrassing information against him, possible ethical conflicts, the donors and billionaires of his cabinet, his pushback against intelligence findings on Russian hacking in the election. But there does not seem to be much angst in Iowa among those who voted for Mr. Trump, including some Democrats and independents. Monticello, in rural eastern Iowa, is as close as any place to the epicenter of the political quake that made Mr. Trump president. The state’s longstanding reputation as a political bellwether had led The New York Times to move me to Iowa for a full year ahead of its presidential caucuses in early 2016. I had not returned since. In the intervening year, Iowa gave  Mr. Trump his largest triumph of any battleground state: a    reversal over President Obama’s easy victory here in 2012. Al Ameling, 58, a technical analyst who lives in Marble Rock, near the Minnesota border, is representative of the profound demographic shift among white rural voters in the northern Midwest that helped produce Mr. Trump’s stunning upset. Mr. Ameling voted for Mr. Obama in 2008, sat out in 2012 and enthusiastically backed Mr. Trump. Nothing he has heard since Election Day has shaken his support, including reports this week that American intelligence agencies are investigating unverified accounts of meetings between Trump aides and Russian officials, as well as sex tapes purportedly made of Mr. Trump in Moscow. On Wednesday, Mr. Trump called the allegations completely false. “The way it is nowadays, unless I see positive proof, it’s all a lie,” Mr. Ameling said in a telephone interview on Wednesday. He added he was more concerned that government officials might have leaked the material to the news media. “I don’t know if it was classified, but if it was, whoever leaked it needs to go to jail,” he said. “We need law and order back in this country. ” I headed to Monticello because it was the site of Hillary Clinton’s first campaign stop after declaring her candidacy for the Democratic nomination in 2015. When she rolled up in her black van, a pack of journalists took off at a run, myself included, an enduringly silly image. Mrs. Clinton rarely returned to the state in the general election campaign, giving it up as all but lost. Jones County, which includes Monticello, is the birthplace of the painter Grant Wood, and where older men still wear the style of pinstriped overalls in his “American Gothic. ” It is a beautiful place, with bald eagles soaring over wintry farm fields. Mr. Trump carried the county by 20 percentage points Mr. Obama easily won there four years earlier. At Darrell’s, there are actually two Tables of Knowledge, one favored by Democrats and the other by Republicans. Among them are an optometrist, farmers and former employees of a utility company. I asked if there was anyone who had voted for Mr. Trump after having previously supported Mr. Obama. “Yeah, there is, but they won’t tell you,” said Mr. Retzlaff, an outspoken conservative who usually chooses to sit with the liberals. Mel Manternach, a retired farmer, said many farmers who had once voted for Mr. Obama switched to Mr. Trump, which he found perplexing. “Trump was against T. P. P. which would help exports of ag commodities,” he said, referring to the   Partnership, a   deal. “They voted against their own  . ” The Iowans I interviewed largely went about their lives outside the political hothouse of social media. They did not follow    developments of the presidential transition. Indeed, on Wednesday, several were unfamiliar with the reports that Russia was holding compromising information on the   which Mr. Trump addressed in a news conference. Many were hazy on specific policy details about how, say, House Republicans were seeking to replace Medicare with a voucher system. These voters feared an outbreak of   terrorist attacks by Muslims in the United States, maybe in their own communities. And overwhelmingly, Trump supporters did not want their   money redistributed to people they regarded as undeserving. A year ago, I shadowed a Clinton   in Newton, a small city in central Iowa that has struggled since Maytag closed a washing machine plant. Jeff McKibben, one of the   workers, traded down for work at a prison. Once a “straight Democrat,” as he called himself, he refused to commit at the time to support Mrs. Clinton. Contacted recently, he did not want to say how he voted, although Jasper County, which includes Newton, was one of the more than 30 Iowa counties that swung to Mr. Trump from Mr. Obama. “Maybe it’s time to have some change,” Mr. McKibben allowed. “I saw neighbors I knew were strong union people with Trump signs in their yards. ” The story was the same in Des Moines County, in southeastern Iowa. The local Democratic Party chairwoman, Sandy Dockendorff, knew there was trouble when she saw a Trump sign in the yard of an electrician who had always supported Democrats. “When I called him,” Ms. Dockendorff explained last month to a group of demoralized activists at a United Steelworkers union hall, “he said, ‘You stopped talking my language you don’t care about jobs.’ ” In an interview, Ms. Dockendorff, who is running for chairwoman of the state Democratic Party, said rural Iowans were critical of Democrats for opposing   projects like oil pipelines while running a presidential campaign focused narrowly on Mr. Trump’s shortcomings. “It was all about making fun of Donald Trump  —   he would never be president and how horrible it would be,” she said. But “the only one talking about jobs was Trump,” Ms. Dockendorff added. At a Des Moines County diner in Burlington, a small city on the Mississippi River, Melissa Ell, a waitress, said she had voted for Mr. Obama in 2012. But this Election Day, she stayed home. “I didn’t want to vote for either one of them, to be honest,” she said. Ms. Ell, 46, earns a base wage of $6. 50 an hour at Jerry’s Main Lunch, a   restaurant across from the Burlington Northern Railroad tracks. As she bused a table, Ms. Ell commiserated with Jackie Furman about those who take advantage of government aid. “I think they should be   if they’re on welfare,” Ms. Ell said. “The welfare system needs to be reorganized,” agreed Ms. Furman, a retired commercial bakery manager, complaining that “Chicago people” were moving to Burlington to receive higher benefits and bringing crime. Ms. Furman, 70, said, “I’m ashamed to say we caucused for Obama” in 2008. “My view is he purposely got into the presidency so he could ruin America. ” There are contrary views. On Washington Street in Burlington, I expected Post 10102 of the Veterans of Foreign Wars to be a bastion of support for the   who had promised repeatedly to “take care of the vets. ” But there was deep skepticism. “Forget about me,” Dan Meade, a Navy veteran, said. “What’s going to happen to our kids, our grandkids? I think the guy’s nuts. ” He and three others sipped $1. 50 draft beers from plastic cups. They sarcastically echoed notable Trump lines from the campaign trail. “He knows more than the generals he doesn’t like prisoners of war,” Dan Warren, an Army veteran, said. “When Trump was running for office he said he’d run the country like he runs his companies,” Fran Boyle, who served in the Navy, chimed in. “Which one of his bankrupt companies is he going to run it like?” Still, Trump voters in the state say they are hoping for the best. Mike Staudt, a retired farmer from Marble Rock, voted for Mr. Obama in 2012, but called the Affordable Care Act a form of socialism. He said he had no problem with a candidate who had run as the voice of the working people but was stocking his cabinet with the ultrawealthy. “I know these guys are really rich,” he said. “They may have pulled off a few plays that weren’t exactly on the    but they all had to be pretty smart to be billionaires. If they replace their own concerns with the concerns of the country, they can make things really move forward. That’s what I’m excited about. ”'"}, "time": 1742561687.820447}