{"duration": 0.1429908275604248, "input_args": {"text": "'In May 2015, Norm Macdonald appeared on the    episode of “Late Show With David Letterman. ” He did about six minutes of   comedy, and then choked up when recalling the first time he saw Mr. Letterman perform. Finally, unsuccessfully fighting back tears, he turned toward the host’s desk and told him, “I love you. ” It was a jarring moment from the   Mr. Macdonald, and it represented a few more seconds of sincerity than you get in the 240 pages of “Based on a True Story,” his often very funny but always very fabulist “memoir. ” The book is most direct, and most convincingly   about the job of comedy. “  comedy is a shabby business, made up of shabby fellows like me who cross the country, stay at shabby hotels, and tell jokes they no longer find funny,” he writes in the introduction. Later he describes the dependable range of reaction from audiences: “They either hate you or they don’t completely hate you. ” Mr. Macdonald has always been a comic’s comic, best loved for his     which has shades of Steven Wright’s concise wordplay and Andy Kaufman’s   extended pranks. Those who aren’t comedy nerds know him best from his stint as the host of “Weekend Update” on “Saturday Night Live,” from 1994 to 1997. In “Based on a True Story,” Mr. Macdonald lists the “Top 25 Weekend Update Jokes of All Time (in no particular order),” starting with one from Chevy Chase’s tenure as host and then 24 from his own. There’s only one joke included about the O. J. Simpson trial. Mr. Macdonald feasted on the Simpson case during his time as anchor. (A compilation of the brief setups and punch lines on YouTube runs to more than 26 minutes.) When Mr. Macdonald was dismissed from that segment, the move was widely thought to have been orchestrated by the NBC executive Don Ohlmeyer, a friend of Mr. Simpson’s. (Mr. Ohlmeyer denied that his friendship with Mr. Simpson was behind the decision.) So it’s belated inside baseball for Mr. Macdonald to take on Mr. Ohlmeyer in this memoir. But it’s scathing and funny, too. In the comedian’s wicked reimagining, Mr. Ohlmeyer was upset when the O. J. jokes stopped, leaving him without material for teasing his buddy. “I’d give him the business about this whole   thing,” Mr. Macdonald has his fictional version of Mr. Ohlmeyer say. “Lay a couple of zingers on him from your Update segment. Boy, old O. J. would see red, I’m here to tell you. And the more steamed he got, the funnier it struck me. ” A memoir in the sense that it’s roughly organized by the timeline of Mr. Macdonald’s life and career, this book is absurd fiction in many of its details, even the most basic ones. “I was a hick, born to the barren, rocky soil of the Ottawa Valley, where the richest man in town was the barber,” Mr. Macdonald writes. He actually was born and raised in Quebec City. Likewise, he may have had an intense crush on Sarah Silverman during their time on “Saturday Night Live” together, but he most probably didn’t have Colin Quinn help him arrange a hit on the life of Dave Attell, a fellow comedian and rival suitor. The book is also structured around a fictional (or partly real, who’s to say) road trip to Las Vegas undertaken by Mr. Macdonald and a friend. Mr. Macdonald has spoken about his   gambling problems, though the book mostly presents them as just more outlandish material. (His best bit on the subject: “I remember a psychiatrist once telling me that I gamble in order to escape the reality of life, and I told him that’s why everyone does everything. ”) Mr. Macdonald’s   work has a philosophy behind it, which is expressed in the book this way: “A joke should catch people by surprise it should never pander. Applause is voluntary, but laughter is involuntary. ” Some of what’s here won’t be a surprise to fans. The book recycles pieces of Mr. Macdonald’s   like his claim that he was in “great shape” as an infant. At 1 year old, he writes: “I even looked good for my age. Strangers would always approach me, smiling, and they’d say, ‘Look at you, little boy, what are you, zero? ’” We’re also treated to the “moth joke,” a   Dostoyevskian setup for a   gag. (It reads more smoothly than the version once shakily delivered on air to Conan O’Brien.) The book doesn’t stray far from   and “Saturday Night Live,” and why would it? Mr. Macdonald’s one big starring film vehicle, “Dirty Work” (1998) was called “leaden,   attempted comedy” in The New York Times. Other roles have included an uncredited bartender in “Deuce Bigalow: Male Gigolo. ” Fans will know going in but others should be forewarned that Mr. Macdonald’s punch lines, cartoonish as they are, are often built on grim foundations: prison rape drug deals gone very bad a young boy whose dying wish is to kill a baby seal. It’s easy to believe that Mr. Macdonald is unusually funny while also understanding the limits of his career outside of clubs. He’s an oddball by nature who also seems to have genuinely cultivated a disregard for conventional success. This memoir’s evasive clowning is in keeping with all that. Some might hate it, but most won’t completely hate it.'"}, "time": 1742561759.4773283}