{"duration": 0.10396385192871094, "input_args": {"text": "'The government of China is ringing in the Muslim holy month of Ramadan with a report praising itself for its commitment to human rights in Xinjiang, the westernmost   province in which communist officials have taken large strides to strip public life of Islamic customs. [Xinjiang is home to most of the nation’s Muslim Uighur minority and borders both Pakistan and Afghanistan. Authorities in Beijing have expressed concern that Muslim separatist groups in the region are feeding the population of Islamic State jihadists in the group’s Middle Eastern strongholds in Syria and Iraq. The Islamic State recently released a video featuring Uighur terrorists who vowed to return home to conduct terrorist attacks there.  China’s     media ran the full report from the State Council Information Office on Thursday, which applauds the Chinese government for taking “effective measures to develop the economy, improve people’s living standards, enhance the   of the public, promote ethnic unity and progress, and safeguard the basic rights of all ethnic groups in Xinjiang. ” “Normal religious needs of local people have been satisfied,” China’s Global Times asserts, citing the report. The text of the report asserts that “the people of all Xinjiang’s ethnic groups enjoy the same status and the same rights, and must fulfill the same obligations in accordance with the law. Their political rights as citizens are fully protected. ” The   report spends much of its energy on “environmental” rights, health care, and economic equality. On health care, for example, the report condemns the free government preceding the communist People’s Republic of China, claiming Xinjiang’s population suffered “a shortage of doctors and medicines, and epidemics of diseases, such as the plague, smallpox, and cholera. ” It then goes on to claim that the Chinese government has successfully curbed radical Islamic terror in Xinjiang: Since the 1990s, violent terrorists, nationalist separatists, and religious extremists have plotted and committed a series of violent terrorist crimes, causing loss of life to and damaging the property of people of all ethnic groups  …     The Xinjiang Uygur Autonomous Region has taken a series of measures designed to strike against violent terrorist crimes, strengthen social protection and control, modernize the governance system and capacity, and safeguard the lives and property of all the people of Xinjiang, whatever their ethnic group. These measures include the promulgation and implementation of the Measures of the Xinjiang Uygur Autonomous Region on Enforcement of the   Law of the People’s Republic of China. The report then asserts that China has protected freedom of religion in Xinjiang by expanding the government’s power to control religious practices by implementing “Regulations on   of the Xinjiang Uygur Autonomous Region” and working to “strengthen management of religious affairs in accordance with the law. ” The claims in the report echo those of a similar publication released almost exactly one year ago, titled “Freedom of Religious Belief in Xinjiang,” which asserted that “Normal religious activities in Xinjiang are protected by law, and religious organizations are responsible for coordinating internal religious affairs and the government should not interfere. ” This year, the Chinese government white paper did not claim that the government had minimized its interference in religion, instead claiming its interference aided the “normal” practice of religion. The new report also emphasizes the government’s push to replace the Uighur language with “Putonghua,” or “common tongue” (Mandarin). “The Constitution stipulates that the state promotes the nationwide use of Putonghua in accordance with the law,” the report notes but asserts that the common use of Uighur in public is a sign the government protects the Uighur language. In reality, the Chinese government announced a nationwide campaign to eradicate   languages in January, which corresponded with the development of a plan to promote intermarriage between Uighurs and the Han minority and the imposition of a variety of ordinances that prohibit overly Islamic activity in public. Among the activities prohibited in public in Xinjiang is the wearing of burqas in the capital city of Urumqi, the use of public transportation while wearing any Islamic garb, and the observance of the Ramadan fast by Communist Party officials. “If we think that someone may be fasting, we will invite them to the village office to ‘drink tea’ with us to see if they are fasting or not,” Alim Abdurahman, a Xinjiang official, told Radio Free Asia last year. The Chinese government also forces Muslim shops to carry a variety of alcohol and cigarette brands to encourage the violation of Quranic laws against the consumption of these products. Beijing has also banned Muslim parents in Xinjiang from giving their children overly religious names like “Islam,” “Jihad,” or “Muhammad. ”'"}, "time": 1742562028.3212082}