{"duration": 0.0823831558227539, "input_args": {"text": "'WILLIAMSTOWN, Ky.  —   In the beginning, Ken Ham made the Creation Museum in northern Kentucky. And he saw that it was good at spreading his belief that the Bible is a book of history, the universe is only 6, 000 years old, and evolution is wrong and is leading to our moral downfall. And Mr. Ham said, let us build a gargantuan Noah’s ark only 45 minutes away to draw millions more visitors. And let it be constructed by Amish woodworkers, and financed with donations, junk bonds and tax rebates from the state of Kentucky. And let it hold an animatronic Noah and lifelike models of some of the creatures that came on board    such as bears,   giraffes  —   and juvenile Tyrannosaurus rexes. And it was so. Mr. Ham’s “Ark Encounter,” built at a cost of more than $102 million, is scheduled to open on July 7 in Williamstown, Ky. Mr. Ham and his crew have succeeded in erecting a colossal landmark and an ambitious promotional vehicle for their particular brand of Christian fundamentalism, known as “young earth” or “young universe” creationism. But it was hardly smooth sailing. The state tried to revoke the tax rebates after learning that Mr. Ham would require employees to sign a “statement of faith” that would exclude people who were gay or did not accept his particular Christian creed. Mr. Ham went to court and in January, he won. On a recent afternoon, the   Mr. Ham looked out on the workers in hard hats affixing pine planking to cover the Tyvek plastic wrap still visible on the stern. The ark stretches     football fields long, rises as high as a   building and is said to be the largest   building in the world. Mr. Ham is betting it will become an international pilgrimage site, as well as a draw for the curious, the seculars and even the skeptics. “The reason we are building the ark is not as an entertainment center,” Mr. Ham said in an interview in a cabin overlooking the construction site. “I mean it’s not like a Disney or Universal, just for anyone to go and have fun. It’s a religious purpose. It’s because we’re Christians and we want to get the Christian message out. ” The ark is also intended to serve as a vivid warning that, according to the Bible, God sent a flood in Noah’s time to wipe out a depraved people, and God will deliver a fiery end to those who reject the Bible and accept   evils like abortion, atheism and   marriage. “We’re becoming more like the days of Noah in that we see increasing secularization in the culture,” Mr. Ham said. Yet his interpretation of what he calls “the Christian message” is derided by most scientists and educators, and resented even by some Christians who consider it indefensible and even embarrassing. Young earthers believe that God created the universe in six   days, and since all of history is only 6, 000 years, humans coexisted with dinosaurs. An exhibit at the Creation Museum shows two smiling children playing in a lush garden next to two petite Tyrannosaurus rexes. Bill Nye, best known as “the science guy” on television and in books, said in a telephone interview, “Humans and ancient dinosaurs did not live at the same time. It’s completely unreasonable. ” Science has established that the earth is billions of years old, and no worldwide flood occurred in the last 6, 000 years. “We’re going to raise a generation of kids who are scientifically illiterate,” said Mr. Nye, who debated Mr. Ham at the Creation Museum in 2014, a matchup watched online by millions. A group of local atheist activists, the   Freethinkers, recently tried to put up billboards on the highway approaching the ark, calling it the “Genocide and Incest Park,” but no billboard company would agree, said the Freethinker’s founder and president, Jim G. Helton, so they plan to protest at the ark’s grand opening. “The moral of the flood story is horrible,” Mr. Helton said. “We’re not saying he can’t build his park. But we don’t think it’s appropriate for a family fun day. ” Young earth creationism gained currency only about 60 years ago, and has remained a marginal creed within Christianity. Even many   and evangelicals accept the science showing that the universe is billions of years old  —   some reasoning that each of the six “days” of creation in the Book of Genesis may have lasted millions of years, not 24 hours. And of course, many Christians accept evolution. But now the young earthers are having a heyday, thanks largely to Mr. Ham and his supporters. Their ministry, Answers in Genesis, produces books, magazines, videos and curriculums used by thousands of churches and home schoolers. The Creation Museum  —   which sells these materials in its gift shops  —   claims 2. 7 million visitors have come in the nine years since it opened. But about half of those visitors came to the Creation Museum in the first three years, suggesting that interest may have dropped off. The ark could change that. Mr. Ham projects that the ark will attract 1. 4 to 2. 2 million visitors in the first year, and will double the attendance at the Creation Museum. Inside a cavernous warehouse in an office park in Hebron, a few miles from the museum, about 50 artists, designers, carpenters, sculptors and volunteers have been working   weeks to prepare the exhibits for the ark. A sculptor inserted stiff   hairs one at a time into the chin of what looked like a wild boar. Another wiped off the black dye on a bear’s chest to make it look less like a contemporary black bear. A giraffe with a short neck was being baked in a large oven to set the dye on its fur. Tim Chaffey, a content manager and writer for the Answers in Genesis ministry, explained that most of the models do not resemble animals the way they look today, but extinct species. According to young earth creationists, the ark carried up to 1, 400 kinds of creatures that gradually evolved into the animals we know today. Young earthers accept the notion that nature makes small adaptations over time  —   but do not accept that humans and chimpanzees descended from a common ancestor. The ark designers had to scale back their initial ambition to have live animals living on board to demonstrate the truth of the Noah story, said Mr. Chaffey, a graduate of Liberty University, a Christian college in Virginia founded by the Rev. Jerry Falwell. And there will be only about 30 pairs of stuffed animals on the Ark Encounter because there just isn’t enough space. “We have to have dozens and dozens of bathrooms for visitors. Noah didn’t have to have that,” Mr. Chaffey said. Drawings of Noah and his seven family members hung on a wall. Their skin is “middle brown” and their faces are a blend of racial features because, as the only survivors of the biblical flood, all the races and ethnicities on earth would have descended from these eight people, Mr. Chaffey said. But in some of the displays in the warehouse, there were indications of the ministry’s dark vision of humanity. An artist, Stephanie Fazekas, stood at a computer drawing figurines of women in togas. They were prostitutes for a diorama portraying the morally decadent society that the Bible says was wiped out in a flood. William Trollinger, a professor of history at the University of Dayton, has been studying Mr. Ham’s museum, website and blogs for a new book “Righting America at the Creation Museum,” written with his wife, Susan L. Trollinger, a professor of English also at University of Dayton. “He calls on Christians to participate in a culture war,” Mr. Trollinger said, of Mr. Ham. “He says, if you’re really going to be a Christian, you’re in this war against the atheistic, humanistic enemy. ” In an interview, Mr. Ham railed against atheist groups for trying to prevent his project from receiving tax incentives from the state of Kentucky. Answers in Genesis claimed that the state’s denial of those tax credits violated the group’s First Amendment rights. Judge Greg Van Tatenhove of the United States District Court for the Eastern District of Kentucky agreed, writing in his January decision that tourist attractions  —   even those that advance religion  —   meet the neutral criteria for the tax incentives. The ark is now in calmer waters. The workers, standing on hydraulic lifts, have covered over the Tyvek, and just in time. The Tyvek was printed all over with the slogan of its maker, Dupont: “The Miracles of Science. ”'"}, "time": 1742628440.8271108}