{"duration": 0.29047489166259766, "input_args": {"text": "'Financial Markets , Gold , Market Manipulation , Precious Metals , U.S. Economy Deep State , new world order , stock market bubble , war on cash admin The Oligarchs’ Plan to Monetize Humanity \\nThe greed-diseased and power-obsessed Deep State oligarchs hate you for your freedom and love you for your money, and they are accelerating their plans to strip you of both. There are two things standing in their way: cash, and precious metals. The oligarchs are doing everything in their power to falsely discredit both of them in the eyes of the people. Cash and precious metals are physical manifestations of financial and human liberty. Liberty, which is indivisible, is the absolute last thing the oligarchs have in mind for us, as there is no profit in it for them. The oligarchs realize that the people are fast waking up to what is being done to them. While the Oligarchy remains an unimaginably dangerous enemy, it was wounded in the United States presidential election, is acting more erratically and illogically, and is starting to make serious mistakes. How we, the people, push forward from here will determine whether we remain free, or become slaves to the greatest Force of Evil ever known to mankind, the Deep State oligarchs. \\nWhile the above themes are not new to Inferential Analytics, the accurate and reliable forecasting method we have developed and use, the intensity with which the Deep State is pursuing its “dual mandate” of expropriating private wealth and enslaving the people by deliberately impoverishing them is absolutely unprecedented. If the people lose the war that the Deep State has declared against them, their futures and those of their descendants will be destroyed. The people must not and need not lose this war. In fact, the people can defeat the Deep State by using simple tools and common sense. The problem is that the people do not realize they have the power to take down the Oligarchy, so we all must work to open their eyes and show them the force of nature they truly are. That is our mission in this article, and the ones to follow. \\nThe post-election orgy of precious metals price destruction is an open letter from the Deep State oligarchs that they couldn’t care less about the people’s desire for fundamental change, something the people shouted from the rooftops with their votes. The oligarchs have announced that there will be no change in policy or operating procedures; it is full steam ahead for them, because they know they can loot society of trillions more dollars if they can successfully implement their plans, which are well underway and inimical to the people in the extreme. \\nMoney that flows into physical precious metals means less money in banks for the Deep State oligarchs to loot. In 2011, as gold surged to $1900 and silver to $50 per ounce, the oligarchs saw the real potential of a buying stampede breaking out among the people, which would have resulted in even greater bank withdrawals. They were simply not going to allow that to happen. Plans to gain control of the people’s money were in the formative stages, and could not be activated at that time. Not having the means to restrict the flow of money into precious metals, they decided instead to crush prices by market manipulation, both to financially punish those who had bought into the gathering stampede, and to scare away prospective buyers. The Deep State is now on the threshold of being able to implement its asset control agenda, and is certainly not going to lose bank deposits to precious metals when they are so close to their objective. Therefore, they have ratcheted up their illegal price manipulation activities to record intensity. \\nPost-election, the Deep State oligarchs have made it clear that they are going to continue to ram down the throats of the people the self-serving crony communist agenda they have been pursuing for the past twenty years, and particularly during the past eight, when they have had an energized communist organizer in place. If this means that they must hire phony activists on Craig’s List for $12.00 per hour and bus them around the country from one pre-arranged “demonstration” site to another, this is what they will do, as we can see. This is a small price to pay for the power and money prizes they have plotted to win. \\nThe most profitable financial instruments ever created by the oligarchy are derivatives. These synthetic devices, designed for hedging, risk management and speculation by market players, and structured to generate guaranteed profits for the oligarchs who invent, issue and control them, include futures, options, forwards and swaps, and are a Deep State money machine. \\nDerivatives are layered on top of what are known as “underlying” assets, such as stocks, bonds, commodities, currencies, government debt, and securitized debt and mortgages. \\nWe believe that the oligarchs are creating a new class of financial derivatives that could produce the largest transfer of wealth in history, from the people to them. \\nWe call them “Human Derivatives,” or “HDs.” The “underlying” asset in HDs is humanity itself; specifically, the personal wealth and future wealth-creation potential of human beings, in addition to rich, deeply personal, tradeable and exploitable information about them. With HDs, the Oligarchy intends to monetize humanity. By positioning themselves as the “House,” and giving themselves proprietary fee-setting, settlement, arbitrage and inside trading powers over HDs and bank deposits, the oligarchs intend to create a monopolized toll booth through which most monetary assets must pass. This will enable them to siphon off trillions of dollars of existing and future financial wealth from “underlying” human beings. The oligarchs plan to turn humanity into a financial asset over which they have control. \\nHuman Derivatives will not just leverage people’s underlying financial assets, but much more important, deep personal insight into who they are, what they buy, how they behave, their medical well-being, their relationships and social networks, their susceptibility to messaging and advertising, and their overall economic “value.” This information will be codified, scored and quantified, and then converted into indexes made tradeable by HDs. The tradeable financial digitalization of the people will be worth a fortune to the Deep State “House.” \\nThe oligarchs face a critical prerequisite to the optimization of Human Derivatives: the elimination of cash. By removing cash from the system, the oligarchs will obtain full visibility into and control over the people’s monetary transactions, which is required to maximize HD profits. \\nWhile numerous “motherhood” justifications for the elimination of cash are enunciated by the Deep State shills who are promoting it, such as fighting terrorism, crime and drug trafficking, these are misdirections and lies. The real purpose for the elimination of cash is simple: to give the Oligarchy full-spectrum control over monetary assets. The fact that Larry Summers is one of the main proselytizers for cash elimination is all that you need to know; he is a longstanding Establishment spokesperson and enabler. \\nInfluential, non-banker elitists are now joining the battle. For example, on October 27, 2016, while speaking to reporters, Apple Computer CEO Tim Cook triumphantly stated, “We are going to kill cash.” By “we,” he does not mean Apple, which has no means by which solely to murder cash, but the Deep State elite, of which he is a peripheral member. The elimination of cash will be a boon to Apple Pay, which collects a 0.15% commission on all transactions, an amount that is guaranteed to increase by multiples and passed on to consumers in the form of price inflation once digital payments are non-optional and monopolized. \\nOn November 8, 2016, the Indian government announced the most brazen cash reset and windfall tax generation scheme ever hatched. At 8 PM, after the banks had closed, Prime Minister Narendra Modi made a surprise proclamation that as of 11:59 PM that same evening, all 500 and 1,000 rupees currency notes would be demonetized, stripped of “Legal Tender” status, and “extinguished.” In his words, “currency notes of rupees 500 and rupees 1,000 will be just paper with no value.” Rupees 500 and 1,000 notes are worth roughly $7.50 and $15.00, respectively, and they constitute 85% of India’s total currency supply. With no advance warning, Indian citizens were given 4 hours to spend 85% of India’s total money supply, or endure a massively time-consuming currency conversion ordeal. \\nIn the few hours remaining that night, the stores were flooded with citizens trying to dump their 500 and 1,000 rupees notes. Gold spiked to the equivalent of $2,300 per ounce, before completely selling out at dealer locations, as people were willing to spend pretty much anything to get a real asset like gold in exchange for “just paper with no value.” \\nThe government gave those unable to offload their 500 and 1,000 rupees notes during the four hour window the option of depositing them into their bank accounts (assuming they have them) until December 30, 2016. But to do that, the depositor must fill out an affidavit, explaining where the money came from. If the authorities determine that the depositor has not satisfactorily accounted for the funds, then an income tax and fines will be imposed on the depositor, or the currency will simply be seized. \\nThe government also gave the people the ability to physically exchange at banks their rupees 500 and 1,000 notes for new currency, but only until November 24, 2016 (a period of 14 days), and only at a rate of 4,000 rupees (roughly $60.00) per day. If a person is willing to stand in a bank line for hours a day, for 14 days straight, they will be able to exchange a grand total of 56,000 rupees, or roughly $840.00. \\nModi stated that the extraordinary action was taken to curb “counterfeiting,” “corruption,” “terrorism,” “black money,” and the “black economy,” the usual excuses for tyranny, but never explained how, which is typical of these Deep State gambits. While making his announcement, Modi stated: “Experience tells us that ordinary citizens are always ready to make sacrifices and face difficulties for the benefit of the nation.” As we can see, the citizens’ willing acceptance of surprise currency resets is being positioned by the Deep State as a matter of patriotism and duty. \\nIndia’s gun control laws are among the strictest in the world, and have been tightened even further by Modi since he came into office in 2014. The people are also trained from a young age to be compliant and polite. It is no wonder why India was chosen as the test site for Deep State’s first surprise, national currency reset. \\nAlmost exactly one year ago, it was the same Modi who announced an Indian “paper gold” scheme. The Indian people were asked to turn in to their bank their physical gold, in exchange for a paper “note” that would provide 2.25 – 2.75% interest per annum on the gold’s value at the time of submission. The “investor” would not be able to get their gold back for at least 5 years. By then, of course, it would be long gone. Indian inflation is consistently above the offered interest rate. The Deep State’s scheme, promoted by their puppet Modi, flopped because the people, who are never nearly as stupid as the elitists think, saw right through it. \\nThere are an estimated 20,000 tonnes of gold in the private hands of the Indian people, and the bullion banks wanted it for their own profit-making purposes, not the least of which was to cover their enormous naked short positions. \\nWe believe the Indian currency reset is a test, foisted upon a compliant, disarmed people to gauge their reaction. The real drama is yet to come, and will occur throughout the West. If the oligarchs cannot trick the people into accepting the elimination of cash, then they will do the next best thing: a for-profit currency reset that nets a windfall. Most likely, they will do both, in succession: a currency reset, netting a windfall, followed by the elimination of cash, netting a second, much larger windfall. \\nSeveral prominent commentators have recommended holding cash as a financial defense mechanism. But none of them has warned of the possibility of a currency cancellation, such as the one that just occurred in India. This demonstrates how entropic, unpredictable and dangerous the current financial environment has become. We urge readers to stay highly informed via the Alternative Media, the only place where you can find the truth. Developments are happening fast, and you could get blindsided if you are inattentive and drop your guard. \\nAll of the above begs the question: how can we financially defend ourselves from the Establishment controllers who are coming for our money and our freedom? \\nEven though precious metals prices are being deliberately crushed at this time, for the reasons outlined above, we view them as the best, and in certain cases, only defense against Deep State exploitation and expropriation. Gold and silver are financial Freedom Fighters, uniquely capable of protecting people from oppression. Throughout history, as people have fled persecution and sought liberty, gold has been their salvation. For millions over millennia, freedom has only been payable in gold. Precious metals provide the best escape from the Deep State’s coming financial command and control matrix, and are the only assets that cannot be canceled, demonetized or extinguished by government decree and whim. Even assets traditionally viewed as being safe, such as productive farm land, can be taxed into oblivion by a government gone rogue. It has happened in the past, and will certainly happen in the future. One cannot hide farm land, or stitch it into one’s coat. \\nSome people express the concern that governments will prohibit the ownership of precious metals, particularly gold, when things unhinge. We would respond by saying that if it ever comes to that, you will know, for a fact, it is game over. By issuing such an order, the Deep State would make it absolutely categorical that they intend to impoverish and enslave you. While many people might surrender to that kind of totalitarianism, hundreds of millions to billions of people worldwide will not. \\nGovernments can create currency, but only God can create gold, and He is not in the Deep State’s back pocket. No government has the moral authority or practical ability to extinguish the value of the gold made by God. The gold and silver markets have been healthy, consensual and vibrant for more than 5,000 years, and that will never change as long as human beings still walk this earth and breathe the air. Government made currencies have catastrophically failed every single time they have been created. That, too, will never change. Soon, the exchange value of metals will be determined by people, trading one to one, and not by Deep State manipulators and criminals who now set phony prices in rigged markets that they control. You will only be able to enjoy gold and silver’s many virtues if you own them. As millions upon millions of people wake up, see monetary truth and buy, it will become harder to acquire metals at anywhere near current prices, in our view. This is not investment advice (we are not investment advisors and urge you to do your own research and make your own decisions), this is common sense. We believe your opportunities for action are diminishing, because you are battling deteriorating fiscal, economic and monetary circumstances, not to mention time. \\nStewart Dougherty November 13, 2016 \\nStewart Dougherty is the developer of a privately-held, principles-based forecasting methodology named Inferential Analytics. The unique IA model assesses monetary, fiscal, financial, market, social, political, empirical and anecdotal factors to get a glimpse of tomorrow, today. He has 35 years of management, corporate strategy and business development experience. He is a graduate of Tufts University (MA) and Harvard Business School (MBA). Share this:'"}, "time": 1742563168.0139651}