{"duration": 0.10439109802246094, "input_args": {"text": "'It’s a year of anniversaries for Lizzie Grubman, the archetypal celebrity publicist known equally for making friends, enemies and headlines. Ten years of marriage. Twenty years since the founding of her namesake firm, Lizzie Grubman Public Relations  Management. And 15 since the Hamptons auto accident that dominated the tabloid news cycle for a summer, turning her into one of the most notorious women in New York. Shortly after midnight on a July morning in 2001, Ms. Grubman ignited a tabloid firestorm when she backed her father’s   S. U. V. into a crowd outside the Conscience Point Inn, a Hamptons nightclub, injuring 16 people. “P. R. Gal’s Nightmare  —   Her SUV Plows Into Hamptons Club Crowd” and “Hard Fall for Rising P. R. Star Crash Shatters Grubman’s World” blared two typical New York Post headlines. It may be hard to believe now, but before Sept. 11, 2001, Ms. Grubman was one of the biggest news stories in the region. George Rush, a former gossip columnist who covered the accident and its aftermath for The Daily News, said the story played out as “a larger parable about class conflict. ” “For many readers, Lizzie was a vicious princess who was overdue for her comeuppance,” he said. Now 45, Ms. Grubman has stayed out of the spotlight for a decade. Mellowed by marriage and two children, and energized by her firm’s expansion into talent management and television development, she feels ready to talk about the remarkable roller coaster of her life, and lay to rest the ghosts of that infamous summer. “I do a lot of damage control, that’s what I love in P. R.,” Ms. Grubman said on a recent Sunday, sitting in her large corner office in the Flatiron district, which showcases “Rear Window” style views over a uniquely Manhattan hodgepodge of apartments, construction sites and artists’ studios. “Just think of Olivia Pope in ‘Scandal,’ but for Hollywood. ” Her full client list is confidential (“I do divorces, I do arrests and cop situations, when someone is resigning or getting fired,” she said) but her current   roster includes the TV personalities Maksim Chmerkovskiy and Carole Radziwill, the rising   producer C4 and the pop singer Inas X. “I think I’ve matured, I think I’ve grown up,” said Ms. Grubman, dressed in a   Prada sundress and chunky platform heels, accessorized by a Givenchy Antigona black leather tote, whose oversize zipper teeth made it look like a document shredder for money. “Living a private, nonpublic life is a much happier life. ” Ms. Grubman was flanked by her sons, Harry, 9, and Jack, 7, and her husband, Chris Stern, executive creative director for the talent and management agency WME IMG. Mr. Stern is a chatty, gentle man with a fondness for Loro Piana cashmere sweaters. When together, the couple bring to mind a really expensive pair of new stiletto heels and the protective velvet bag that comes with them in the box. “Chris is my rock,” said Ms. Grubman, pulling him close. “He’s made me into a different person, and my children have, too. There’s been some rough times. ” The family divides its time between their East 61st Street apartment (a triple combine duplex) and a   weekend home in Sag Harbor, N. Y. both designed by Mr. Stern. It’s a life filled with children, grandparents and all the trappings of professional success. Yet even now, with a happy home life and thriving business, Ms. Grubman has difficulty discussing the events of summer 2001, when everything changed. Elizabeth Stacey Grubman was born in 1971 to Yvette and Allen Grubman, a man whom Newsweek once described as “perhaps the music industry’s wealthiest and most powerful attorney with superstar clients like Madonna, Bruce Springsteen, Elton John, U2 and Sean (Puffy) Combs. ” “The trials and tribulations that she went through, just like everybody else has gone through, she came out in a way that I’m very, very proud of,” Mr. Grubman said. “Every so often, I’ll bump into someone and they’ll say, ‘Oh, you’re Lizzie’s father.’ I get a kick out of that. ” Mr. Grubman was a famously bad student, a trait he passed on to his daughter. She had brief tours at four New York City private schools, including Horace Mann, Lenox and Dwight (“my social life became a little bit more important than studies,” she said) followed by a single semester at Northeastern University. It was in Boston that Ms. Grubman started promoting nightclubs and the public relations career that she pursued upon returning to New York. In 1995, she went to work for Nadine Johnson, an established P. R. agent known for her fashionable roster of art world and luxury clients. But the relationship quickly soured, and she left after a year to start her own firm, amid rumors that she had taken with her Ms. Johnson’s “list,” industry jargon for proprietary business contacts, which are jealously guarded. “Nadine’s list is not valuable, it’s only valuable to Nadine,” Ms. Grubman said. “I respect Nadine, I have nothing bad to say about her. She clearly does not like me. ” (Ms. Johnson did not respond to a request for comment.) In 1998, Ms. Grubman was one of three influential young female publicists featured on the cover of New York magazine with the headline “Power Girls. ” The article announced Ms. Grubman’s arrival as a personality in her own right. It inaugurated a golden age for her business, but her    persona and moneyed background alienated some observers even as it attracted huge names to her client list, including entertainers like Jay Z, Gloria Estefan and Mr. Combs, and modish restaurants and nightclubs of fin de siècle New York, like Moomba, Spy Bar and Asia de Cuba. “She was there by my side and protected me when I was young and just getting into the spotlight,” Britney Spears, a former client for whom Ms. Grubman still occasionally consults, wrote in a text message from Los Angeles. “I was so grateful to know that Lizzie always looked out for me. ” But the article also ruffled feathers, with its depiction of the subjects as privileged party girls, an early backlash to the “princess” image that would attend Ms. Grubman for years to come. “I get it,” she said of the resentment at the time. “It would irritate me, too. ” But worse was on the way. On July 6, 2001, Ms. Grubman received the devastating news that her mother had   ovarian cancer. (She died three weeks later, at age 58.) In an emotional state, Ms. Grubman nevertheless went out that Friday evening to attend July 4 weekend festivities in the Hamptons. After a party at the home of Alex and Alexandra von Furstenberg, she drove the black Mercedes S. U. V. to the Conscience Point Inn, then a fashionable Southampton nightclub. Sometime after midnight, she got into an argument with a doorman who insisted she move her car. Instead, the vehicle lurched backward into a line of waiting patrons, injuring 16 people. Months of   denouncements and $100 million worth of lawsuits (which were quietly settled) followed, culminating with a   stay in the Suffolk County jail. Ms. Grubman publicly apologized to the victims outside the courtroom in which she pleaded guilty to felony and misdemeanor charges, but she has otherwise declined to discuss the incident. But her days of being tabloid fodder were not over. In 2005, she starred in an MTV reality show about her professional life, called “PoweR Girls,” which flopped with critics and viewers, lasting six episodes. (Ms. Grubman has mixed feelings about it: “I think I gave away a lot of trade secrets, and I glamorized P. R. in a way that people didn’t understand. ”) That same year, Page Six announced her relationship with Mr. Stern, who was married at the time to Joyce Sevilla, who happened to work for Lizzie Grubman P. R. The ensuing divorce was acrimonious (as were the   issues) but it freed the new couple to marry in March 2006. The gossip columns continued to needle, and it was an encounter with aggressive paparazzi that convinced Ms. Grubman that she needed to remove herself and her family from the spotlight. “One day, we’re out walking, and these photographers are out for my son, and he was so scared,” she said. “It hurt him so badly. We had problems in preschool with him taking class pictures. ” “Now, he’s O. K.,” she said, watching Harry gambol over her office furniture. “Now he has his own Instagram. ” If Ms. Grubman’s critics were hoping she would collapse under the sheer weight of the schadenfreude directed at her, they will be disappointed. In her stylishly decorated office, surrounded by family, she seems closer to the “having it all”   balance promoted by tech industry   like the Facebook executive Sheryl Sandberg and the Yahoo chief executive Marissa Mayer. Ms. Grubman rises at 5 a. m. wakes her children at 6:30 and works from her office between 9:30 a. m. and 4 p. m. Back home, she balances work calls and family time (Mr. Stern is the cook) until a 9 p. m. bedtime. Jack, the younger son, who seemed completely at ease in her office, was asked to describe his mother. “She buys us stuff,” he said. “And she talks on the phone a lot. ” (Ms. Grubman laughed it off, but it seemed clear there would be some media training when he got home that night.) Amid the happy family din, however, there remains just a trace of sadness around the intertwined tragedies of her mother’s death and the car accident that changed her life. When asked to reflect on that fateful night, her normally polite smile sets into a thin, flat line. “That unfortunate night happened, which I prefer not to talk about, in respect to my children and family, and the people who were involved,” she said. “I never properly mourned my mother. We’ll leave it at that, you know why. ” In 2007, her husband decided to do something about it. “Understanding that Lizzie had a really tough time with Mother’s Day,” Mr. Stern said, “I decided, right after we had Harry, that I go to Barneys and walk around with a personal shopper and pick out the best shoes and the best handbags in the place, bring them to the apartment, and I proceeded to fill Harry’s entire crib with all of these pretty special boxes of treats. ” “It was piled high,” he said. “I just wanted to make it seem like Harry was giving her the gift. ” Ms. Grubman said, “He’s changed Mother’s Day for me, and he’s helped me through it. ” The anecdote captures Ms. Grubman’s uniquely contentious place in New York’s pantheon of characters. It’s a cherished and heartwarming memory for the family, but viewed from the outside, it will be perceived as overprivileged and materialistic enough to inspire a thousand mean tweets. Was Ms. Grubman prepared for such a social media response? “I’ve been there,” she said, sounding momentarily battle weary. “I’ve been beaten, I’ve been killed in the media. But at this point in my life, my family, my kids and my clients are the most important people to me. ”'"}, "time": 1742628467.1291707}