{"duration": 0.13888287544250488, "input_args": {"text": "'Ralph Branca, the pitcher who had three consecutive   seasons for the Brooklyn Dodgers but who was never allowed to forget one pitch that crushed them, died early Wednesday in Rye Brook, N. Y. He was 90. Branca’s unforgivable offense (at least to Dodger fans) came on the afternoon of Oct. 3, 1951, when, in a final game with the New York Giants to determine the National League championship, he served up Bobby Thomson’s electrifying (at least to Giants fans)   home run  —   the “Shot Heard Round the World”  —   probably the most memorable in baseball history. The Dodgers had been in first place by 13½ games in   but the Giants had come back to tie for first on the season’s final weekend. “A guy commits murder and he gets pardoned after 20 years,” Branca once said at an  ’ game. “I didn’t get pardoned. ” His daughter Patti Barnes said he was pronounced dead shortly after midnight at a rehabilitation center near his home. In baseball lore the Thomson homer has been preserved in amber. It sits alongside Lou Gehrig’s farewell at Yankee Stadium, Don Larsen’s perfect game in a World Series and “the Catch,” Willie Mays’s spectacular      snare of a Series blast at the same Polo Grounds, three years after Thomson’s “shot. ” It was also immortalized in American literature by Don DeLillo, who opened his 1997 novel, “Underworld,” with an extended, lyrical   of that Wednesday at Coogan’s Bluff, complete with echoes of the radio announcer Russ Hodges’s disbelieving call as the ball headed for the fence and sailed over the Dodgers’ left fielder, Andy Pafko, culminating, as pandemonium erupted, with the joyous, repeated declaration, “The Giants win the pennant!” “Pafko at the wall,” DeLillo wrote. “Then he’s looking up. People thinking where’s the ball. The scant delay, the stay in time that lasts a hairsbreadth. And Cotter standing in section 35 watching the ball come in his direction. He feels his body turn to smoke. He loses sight of the ball when it climbs above the overhang and he thinks it will land in the upper deck. But before he can smile or shout or bash his neighbor on the arm. Before the moment can overwhelm him, the ball appears again, stitches visibly spinning, that’s how near it hits, banging at an angle off a   flashing everywhere. “Russ feels the crowd around him, a shudder passing through the stands, and then he is shouting into the mike and there is a surge of color and motion, a crash that occurs upward,   hands and faces and shirts, bands of rippling men, and he is outright shouting, his voice has a power he’d thought long gone  —   it may lift the top of his head like a cartoon rocket. “He says, ‘The Giants win the pennant.’ ” As for the unlucky pitcher, DeLillo wrote: “Branca turns and picks up the rosin bag and throws it down, heading toward the clubhouse now, his shoulders aligned at a slant  —   he begins the long dead trudge. Paper falling everywhere. ” Branca, a strapping   who had won 13 games in the regular season, had started and lost the opener of a     playoff series, yielding home runs by Thomson and Monte Irvin in the Giants’   victory at Ebbets Field. But the Dodgers won the next day at the Giants’ home turf, the Polo Grounds in Upper Manhattan, setting the scene for the climactic game. The Dodgers took a   lead into the bottom of the ninth inning behind the starting pitcher, Don Newcombe, who was still on the mound. Then the Giants struck, scoring a run and putting men on second and third with only one out. Thomson, who had hit 31 home runs that season, was coming to bat. Dodgers Manager Charlie Dressen phoned his bullpen, where a coach, Clyde Sukeforth, was watching Branca and another of the team’s leading pitchers, Carl Erskine, warm up. Dressen asked who was ready. Erskine had just bounced a curveball, Sukeforth told the manager. Dressen summoned Branca. Branca threw a fastball, and Thomson took a strike. Branca then delivered a second fastball, this one high and perhaps a bit inside. The ball flew off Thomson’s bat on a line toward the    green wall in left field. “Sink, sink, sink,” Branca told himself. Hodges, the Giants’ announcer, made the call: “There’s a long drive   …     it’s gonna be   …     I believe  —   the Giants win the pennant! The Giants win the pennant! The Giants win the pennant! The Giants win the pennant!” Thomson had delivered a   homer to give the Giants a   victory, capping a pennant drive known as “the Miracle of Coogan’s Bluff” and sending them into the World Series against the Yankees. (In that Series, the Yankees doused the Giants’ hopes for a title in six games.) After the loss, Branca sat on the wooden stairs of the clubhouse, a   affair, his head bowed, his shoulders hunched. In the Polo Grounds parking lot, his fiancée, Ann Mulvey, the daughter of James and Dearie Mulvey, part owners of the Dodgers, had been waiting for him. She was accompanied by her cousin, the Rev. Pat Rowley, a Jesuit priest. When Branca emerged, he asked Father Rowley, “Why me?” The priest told him, “Ralph, God chose you because he knew you’d be strong enough to bear this cross. ” Branca bore that burden without complaint even after learning a few years later that Giants players had been tipped to forthcoming pitches for much of the 1951 season through a scheme in which the Giants used a telescope in the Polo Grounds’   clubhouse to pick up opposing catchers’ signals. Details of the   were publicly revealed by Joshua Prager in The Wall Street Journal in 2001 and in his book “The Echoing Green” in 2006. Thomson, who died at age 86 in August 2010, always maintained he was not tipped that Branca would be throwing a fastball on what became that fateful home run pitch. But Branca was convinced otherwise. “When you took signs all year, and when you had a chance to hit a bloop or hit a home run, would you ignore that sign?” Branca said in an interview weeks before Thomson’s death. “He knew it was coming. Absolutely. ” Ralph Theodore Joseph Branca was born on Jan. 6, 1926, in Mount Vernon, N. Y. the 15th of 17 children of John Branca, a   conductor, and his wife, Katherine. After pitching for New York University as a freshman in spring 1944, he made his debut for the Dodgers in June. At 6 feet 3 inches and 220 pounds, with an outstanding fastball, Branca flourished in 1947 when he went  . He was   and   the following seasons, making the National League   team all three years. After a losing season in 1950, he rebounded to go    —   until that playoff series with the Giants. Branca encountered more misfortune at the Dodgers’ spring training camp in 1952. A chair he was sitting on tipped over on a newly waxed floor and he fell backward onto a   bottle. His back was thrown out of alignment, tilting his pelvis and affecting his leg motion. He never regained his form, winning only 12 more games with the Dodgers, the Detroit Tigers, the Yankees and the Dodgers again, finishing his career in 1956 with an   record. Branca rejected speculation that the Thomson homer had affected his psyche. “They were saying that Bobby’s home run was such a trauma that I couldn’t go on,” he told Sports Illustrated 40 years later. “That’s ridiculous. If you play sports, you expect to lose some. If I hadn’t been hurt, that home run wouldn’t have affected me at all. ” After retiring from baseball, Branca became an insurance salesman and served as president of the Baseball Assistance Team, which provides financial aid to needy baseball figures. Branca and his 16 brothers and sisters were raised Roman Catholic. But in 2011, Prager, the author of the book on Thomson’s home run, told Branca that genealogical research had determined that his mother, who arrived in America from Hungary at age 16, was born Jewish, that her birth name was Kati Berger, and that two of her siblings had died in concentration camps. According to traditional Jewish law, Branca and his siblings were Jewish. “Maybe that’s why God’s mad at me  —   that I didn’t practice my mother’s religion,” Prager quoted Branca as saying with a smile that perhaps betrayed newfound reflection on his baseball fate. “He made me throw that home run pitch. He made me get injured the next year. ” Before entering the nursing home, Branca lived at the Westchester Country Club in Rye, N. Y. Besides his daughter Patti, he is survived by his wife, Ann another daughter, Mary Ellen Valentine and three grandsons. Ms. Valentine is married to Bobby Valentine, the former major league player and manager who became a broadcaster and is now the athletic director at Sacred Heart University in Fairfield, Conn. Of his 16 siblings, Branca was the last surviving one. Through the years, Branca appeared with Thomson at  ’ games, baseball dinners and cruises. They turned over a portion of their earnings from joint appearances to charity and became friends. And Branca grew resigned to being known solely as a classic goat of baseball history. “Nobody remembers that at 21, I won 21 games,” he once said. “Nobody remembers that at 25, I had 75 wins. All they remember is the homer. ”'"}, "time": 1742561820.497636}