{"duration": 0.06547880172729492, "input_args": {"text": "'As dawn broke over the Caribbean on Thursday, Chris Bertish, bearded and shirtless, paddled toward Antigua’s English Harbour more than three months after leaving Africa, successfully finishing the first crossing of the Atlantic Ocean in a   paddleboard. Bertish, a South African sailor and   surfer, had paddled through the night and was now approaching the island under stormy skies, listening to “Impi” by Johnny Clegg and Juluka. “The sky was really fierce and ominous,” Bertish, 42, said in his first interview after arriving. “But then the sun peeked its way through with this incredible gold and black beaming through the clouds. It was just beautiful, and it was just me in the middle of it. ” He pushed hard over the last three days, covering 125 nautical miles. “The last few days were super intense,” he said, his voice weak and croaky. “It’s just so nice to be on dry land and not to have to worry about all the billions of things that could wrong. ” Bertish left the Agadir Marina in Morocco on  Dec. 6. and planned to make the     passage unsupported and unassisted on a     paddleboard to Florida in four months. He changed course south to Antigua because of low pressure systems and volatile weather, completing the   crossing in 93 days, arriving at 8:32 a. m. local time. Bertish averaged 44 miles a day  —   mostly at night to avoid exposure to the sun  —   and alternated between resting and paddling every two or three hours. He made an estimated two million paddle strokes during the journey. “You can feel very inconsequential at sea,” said Bertish, who won the renowned Mavericks surf contest in Northern California in 2010. “When that happens, you have to tune in and get in sync with what’s around you and go with the flow. “It’s the only thing that’s going to help you survive out there for that amount of time. That said, there were definitely times when I was hanging on by a thread, just trying to keep it together. ” One of those times involved being caught in a storm for days near rocks off the Canary Islands. “The hatch was leaking, and I was running out of water, Bertish said. “I thought I was going to sink. ” During the first five days of the journey, he fought to avoid being blown back to land. And over the final 72 hours, the weather and the difficult angles for the final approach were scary, he said. Then there were the sharks. One charged at his craft, another bumped him in the middle of the night. Neither bit his vessel. Bertish used a $120, 000   watertight craft, which was designed for the crossing by the naval architect Phil Morrison. Bertish could seek shelter from rough weather, sleep and have access to navigational and communications instruments. He could stabilize the vessel when necessary, using anchors and drogues. The craft was also capable of righting itself after capsizing and submerging. In a telephone interview in February from the middle of the Atlantic, he said there had been a string of failures with the craft. “Everything that could possibly have gone wrong, went wrong,” he said last month. “It’s been constant stress. ” But the craft did not sink. He had   12 items that had broken on the craft, and tended to leaks constantly. When he ran out of lubricant for the craft’s moving parts, he improvised with sunscreen. Bertish also endured some medical problems, including a torn rotator cuff. Now back on land, he plans to have surgery. Last year, Nicolas Jarossay of France attempted an Atlantic crossing by paddleboard. He was rescued one night into the journey by a crew that pulled him from the water after his craft capsized.'"}, "time": 1742562986.764928}