{"duration": 0.11342239379882812, "input_args": {"text": "'When Ginella Massa, a   TV reporter, recently accepted a request to host an evening newscast, she was not planning or expecting to make history for wearing a hijab. She was just covering for a colleague who wanted to go to a hockey game. And that’s how Ms. Massa, who works at CityNews in Toronto, became the first Canadian woman to host a newscast from a large media company while wearing the head scarf. Her newscast, broadcast on Nov. 17, became the subject of social media celebration, and news sites around the world heralded her. “It’s been a little insane the last two weeks,” Ms. Massa, 29, said in an interview. “My phone hasn’t stopped ringing. I’m still working, so I’m trying to field calls and messages and everything in between. ” Ms. Massa’s newscast was one of a string of recent stories about young   women, or hijabis, who have pushed boundaries by strolling into spaces where the standards of appearance tend to be restrictive. Nura Afia, a    from Colorado, was hired as a CoverGirl makeup ambassador. And Halima Aden, a    from Minnesota, was a contestant in a beauty pageant. Ms. Aden sported a hijab and, during the swimwear portion of the competition, a burkini. “All my relatives in Somalia are like, ‘We don’t know what pageants are,’ ” Ms. Aden told NPR, “ ‘but congratulations.’ ” This new trend of inclusion occurs amid a more sinister one, as reported hate crimes against Muslims are on the rise in the United States and Canada. The F. B. I. says that a surge in hate crimes against Muslims has led to an overall increase in hate crimes in the United States Muslims have borne the brunt of the increase with 257 recorded attacks. A spike in bias attacks has been reported since the election of Donald J. Trump, with episodes ranging from an attack against a Muslim police officer in New York City to vandalism of a mosque in Massachusetts. (The crimes, which include   and racist attacks, are so frequent The Times is tracking them weekly.) In Canada, where Ms. Massa has lived since she was a year old, the number of reported hate crimes has dropped slightly overall, but the number of recorded attacks against Muslims has grown: 99 attacks were reported in 2014, according to an analysis by the news site Global News of data from Statistics Canada, a government agency. That number doubled from the 45 reported in 2012. On Twitter, Ms. Massa has been flooded with compliments for her work on CityNews, but with the good comes an influx of hateful messaging. “The more exposure I get,” Ms. Massa said, “the more hate I get. Which I guess comes with the territory. ” She added: “You take the good with the bad. ” Her colleagues, who have also received hate mail, have spoken out publicly in Ms. Massa’s defense. When it comes to her detractors, Ms. Massa has adopted the following credo: “That negative reaction comes from reading a headline and seeing a photo and deciding they don’t like the way I look. That’s not my problem. That’s theirs. ” In that vein,   instances of inclusion will continue. Companies are responding to a demand that is clear in commerce and expansive on social media: The Muslim cosmetics and care market is projected to reach $80 billion by 2020. Last year, HM hired a hijabi model who was discovered on Instagram. Elsewhere on the platform, an account featuring a   Barbie, Hijarbie, has more than 76, 000 followers. A Muslim teenager has created a plan to bring hijabi emojis to phone keyboards everywhere. And Ms. Afia was discovered after amassing a following on YouTube. Not everyone wants to see a woman in a head scarf represented in popular culture, and that even includes some Muslim women, who believe that a hijab represents only one side of a large and diverse religion. Even the word “hijab” belies how complex the uses of the scarf can be: It’s a catchall term for scarves that differ by type and trend. Not all Muslim women wear head coverings. Some believe the hijab is not a religious requirement, while others view it as a symbol of oppression. The reasons a woman chooses to wear a hijab can be highly personal, with some seeing modesty as its own form of empowerment. “We live in a strange society where walking around half naked is acceptable but being modest and covering up is frowned upon,” a   reader named Safiya told The Times in 2015. Celene Ibrahim, a Muslim chaplain at Tufts University, said that these examples of Muslim women wearing the hijab were encouraging but that they also highlighted obstacles to come. In particular, the visible symbol suggests a uniformity in the Muslim community that is not accurate. The community looks very different “depending on who you ask,” Ms. Ibrahim said in an interview. “And I think that diversity is something that people are really struggling to get their minds around. ” She added: “There’s also the sense that Muslims would just like to be able to participate in American culture without necessarily feeling the stigma of always having to represent Muslims. ”'"}, "time": 1742564275.957035}