{"duration": 0.05257749557495117, "input_args": {"text": "'President-elect Donald Trump ran a thoroughly anti-establishment campaign. Some of those in the establishment who felt his wrath were the neoconservatives and liberal interventionists, as Trump thoroughly tore apart the Iraq War and the belligerent rhetoric of both Jeb Bush and Hillary Clinton.\\nFor the average voter, the message was clear: a vote for Trump was a vote against trying to remake the world in America’s image through force. \\nOr was it? Because the nominees being floated so far for key positions in the incoming Trump Administration are completely at odds with a more realist and humble foreign policy.\\nOne of the names being floated for secretary of state is former UN Ambassador John Bolton, a man so hawkish that even a Republican Senate would not confirm him for the post after his recess appointment by President George W. Bush. Part of the reason was Bolton was on record claiming, “ There is no such thing as the United Nations,” and fully endorsing unilateralism.\\nBolton is a neocon through and through. If he runs the State Department, expect an aggressive US posture in the world.\\nAnother one of Trump’s foreign policy advisors is former CIA Director James Woolsey. Woolsey is an arch-neocon who pushed some of the most weakly-sourced talking points in the run up to the Iraq War, including that Iraq was connected to the 9/11 attack. Unlike Trump, Woolsey does not believe the war was a mistake and defended the decisions as recently as 2015.\\nBolton? Woolsey? Why does Trump want to bring in the architects of the Iraq War into his administration? \\nWhile it is true no official nominations or appointments have been made, that these people are even being considered is arguably a betrayal of Trump’s campaign promise to change course on foreign policy. It also completely contradicts Trump’s famous line that the problem with US foreign policy is that it’s run by “stupid people.” \\nGuess what Trump? John Bolton and James Woolsey are exactly the stupid people you were talking about.\\nThe post Foreign Policy Names Floated By Trump Transition Undermine Campaign Promises appeared first on Shadowproof .'"}, "time": 1742564616.360985}