{"duration": 0.11340618133544922, "input_args": {"text": "\"Here's something interesting from The Unz Review... Recipient Name => Pat Buchanan not only read these books, he wrote them. Credit: VDare.com. \\nIf only Donald Trump hadn’t been such a crazy, thin-skinned, moral lout who holds the Constitution in contempt, THEN we could have supported him! Maybe. \\nMushy moderates think alike: Rod Dreher is out with The Tragedy of Trump [ The American Conservative , October 24, 2016] praising New York Time s token conservative Ross Douthat for saying \\nThe dangers of a Hillary Clinton presidency are more familiar than Trump’s authoritarian unknowns, because we live with them in our politics already. They’re the dangers of elite groupthink, of Beltway power worship, of a cult of presidential action in the service of dubious ideals. They’re the dangers of a recklessness and radicalism that doesn’t recognize itself as either, because it’s convinced that if an idea is mainstream and commonplace among the great and good then it cannot possibly be folly. \\n[ The Dangers of Hillary Clinton , October 22, 2016, Dreher’s emphasis] \\nDreher comments: \\nBoy, is that ever true. Read the whole thing. Along these lines, there was a quite good Peggy Noonan column in the WSJ last week [ Imagine a Sane Donald Trump , October 20, 2016](now, alas, behind the paywall, but I found the whole thing here ), saying that if Trump were not a “nut” — which he clearly is — he would be winning this thing by a landslide, because a lot of folks are sick and tired of the status quo that Hillary represents. \\nBut wait a minute. I find my mind circling back to Patrick J. Buchanan, a devout Christian, a long-time conservative, and a loyal Republican who endorsed Bob Dole in 1996 and George W. Bush in 2004. Buchanan was a truly creative political thinker who wrote the Donald Trump playbook on immigration, free-trade , and foreign policy —and he was excommunicated from the cult of #TrueConservatism for opposing the disastrous Iraq War. \\nThen, after Pat Buchanan, there was Ron Paul in 2008 and 2012, who was a very different messenger, but one who carried Buchanan’s torch on foreign policy. Ron Paul wasn’t as strong as Buchanan on immigration or free-trade, but he was the Mr. Constitution of 2008 and 2012. Like Pat Buchanan, Ron Paul carried none of Trump’s character baggage on women, morality or religion, but he was STRONG on the Constitution. \\nHow did all of these born-again constitutional conservatives respond to Ron Paul’s candidacy at the 2012 Republican Convention? They crushed him. [ Chaos on the Convention Floor as RNC Blocks Ron Paul Delegates, Alters Seating Rules , DemocracyNow, August 29, 2012] \\nMike Huckabee , too, was a very different messenger than Pat Buchanan or Ron Paul. Huckabee’s campaigns anticipated Trump’s campaign on entitlements. He wanted a more blue-collar, populist, working class Republican Party that tilted more toward Main Street than to K Street and the Chamber of Commerce. Also like Pat Buchanan and Ron Paul, Mike Huckabee shared none of Trump’s character baggage on women, morality or religion. Mike Huckabee was the Mr. Evangelical of the 2008, 2012 and 2016 campaigns. Huckabee styled himself as the “God, Guns, Grits, and Gravy” conservative. \\nAnd yet, Pat Buchanan was caricatured as a Neo-Nazi anti-Semite, Ron Paul as a crazy wild eyed kook, and Mike Huckabee as an unacceptable cornpone welfare-stater. \\nUnlike John McCain, Mitt Romney and ¡Jeb!, non e of these “Sane Donald Trumps” were acceptable to the classical-liberal, self-anointed “governing wing” of the Republican Party. \\nTAC ’s Dreher wimps on: \\nTrumpers, likewise, will be strongly tempted to indulge in bitter “You stabbed him in the back!” polemics. All of this will work to the advantage of President H. Clinton, of course. What is needed is for the GOP establishment to humble itself enough to admit those who, like Noonan, accept the critique of the party and the system that Trump’s candidacy embodies, however, well, nuttily. And the Trump insurgents — including their leader — need to have the sense to realize that it advantages them not at all to drag this fight with Republicans out past the election . Their candidate will have received a thorough, resounding rejection by voters in an election he likely would have won had he not consistently spoken and acted like a nut. \\nDo I think this (humility on both sides, uniting in the face of Hillaryism) is likely to happen? No, I do not. But I hope I’m wrong. The Trump people, like their candidate, are not known for their ability to think strategically and to restrain themselves for their own good. And the bitterness and spite among Republican regulars is going to blind them to their own role in creating this mess. (My emphasis) \\nBut this isn’t “polemics”—it is a historical fact: no major party candidate in American history, including William Howard Taft in 1912 and Barry Goldwater in 1964 , has been stabbed in the back by more members of his own party. No major party candidate in history has ever taken more fire from the “leading intellectuals” of his own party. Trump has been fighting a two-front war since May—the war against Hillary Clinton and the Left, and the war against #NeverTrumper conservative intellectuals and hacks in his own party. \\nTrump’s struggles from the convention through the general election have been due to a single demographic: college educated, suburban White Republicans, especially women. These people voted for Mitt Romney in 2012. They voted for ¡Jeb!, Rubio and Kasich in the Republican primaries. This is the 25% of the Republican Party who have refused to back Trump or have panicked time and time again whenever some new story roils the news cycle. \\n#NeverTrump still has a lot of influence over these Establishment-oriented voters. Their strategy has been to throw gasoline on every small fire in the news cycle in order to panic these voters into fleeing from Trump. That’s what happened with the Judge Curiel incident, the Khizr Khan fiasco and most recently with the Access Hollywood tape. Trump’s “fellow Republicans” come out and slam him and make these stories a far bigger deal. \\nBecause of these dynamics, it’s true to say that what happened on October 8, 2016 was The Day The Republican Party Died . That was the day of the #NeverTrump coup in which1/3 of the Republican Senate and 1/4 of all elected Republicans publicly abandoned him. It was a historically unprecedented betrayal – never before in American history, not even during TR’s short-lived Bull Moose Party in 1912, had more elected members of one party deserted their own nominee. \\nThe utterly predictable result of the #NeverTrump coup was the party split that showed up in the polls. That event altered the whole trajectory and tone of the race. \\nWhat would have happened if Pat Buchanan, Ron Paul or Mike Huckabee had beaten Dole in 1996 or Romney in 2012? I believe the result would have been the same . I think the Republican Establishment would have joined forces with the Democratic Establishment in order to preserve the neo-liberal globalist status quo. \\nThere would have been some kind of #NeverBuchanan, #NeverPaul, or #NeverHuckabee campaign. If any of these forerunners of Trumpism had won the Republican nomination, there would have a similar fight to “save the soul” of “conservatism.” \\nIf the Establishment candidate loses the primary, the “soul” of the Republican Party will always be at risk. \\nIf Trump loses in a landslide, the response of the GOP Establishment to any future insurgent candidate will be the precedent set in 2016: They will sabotage their own nominee in order to elect the Democrat and hang on to power. \\nBecause of this, it will be impossible to reform the GOP through the primary system. \\nSo yes, we must face facts and “drag this fight out” beyond November. \\nConservatism, Inc. has thrown down the gauntlet: either support ¡Jeb! 2020 or Rubio 2020, the candidate of the minority neo-liberal globalist “governing wing” of the GOP—or else. \\nBrad Griffin is the Editor of Occidental Dissent , where he writes under pen name Hunter Wallace . (Reprinted from VDare.com by permission of author or representative)\""}, "time": 1742563377.1062794}