{"duration": 0.045517921447753906, "input_args": {"text": "'Páginas Libres\\n¡Conducta ilegal y producto ilegítimo en BCRP! Socios | 1ro de noviembre de 2016 por Guillermo Olivera Díaz*\\n1-11-2016\\nLa conducta es la pluralidad de actos realizados que exteriorizan una voluntad; y el producto es el resultado conseguido con esa conducta.\\n¡Los congresistas, mayormente fujimoristas, que designaron a José Chlimper, Rafael Rey y Elmer Cuba, para integrar el directorio del Banco Central de Reserva del Perú (BCRP), violaron la Constitución Política y la Ley Orgánica de dicho Banco!\\nCuando tales parlamentarios producen actos administrativos, como es designar miembros del directorio del BCRP, o integrantes de otros organismos, están obligados a respetar las normas constitucionales y las legales de todo tipo y no zurrarse en ellas sin incurrir en responsabilidad. Su designio es respetar las normas preexistentes.\\nLa Ley Orgánica del Banco Central de Reserva del Perú, en su artículo 11°, obliga que se designe como miembros del directorio del Banco a quienes tienen \"reconocida solvencia moral\" y además \"amplia competencia y experiencia en economía y finanzas\", requisitos que son hechos macizos, que deben ser reales y acreditados con los documentos respectivos. El congresista que vota por alguien propuesto no puede crear estos hechos en su cabeza, deducirlos de meros dichos o inferirlos por consigna partidaria. Viola la ley si desoye este mandato legal; comete, pues, una ilegalidad, una arbitrariedad.\\nDel mismo modo, todo parlamentario debe \"velar por el respeto de la Constitución y de las leyes\", porque así lo establece el Artículo 102°, inciso 2, de la Constitución Política. Hasta podríamos aseverar que deben dar el ejemplo en acatar la Constitución y lo que dispone toda norma legal. Este precepto constitucional fue desacatado por todos aquellos congresistas que designaron con su voto a Chlimper, Rey y Cuba, como miembros del BCRP, sin que estén acreditadas las situaciones de hecho que la citada Ley Orgánica ha previsto. Violaron, por ende, esa norma constitucional que les obliga a respetar las leyes en general y la del BCRP en particular. ¡Produjeron una infracción constitucional!\\nUna acción judicial (proceso de amparo) debería anular el ilegal acto administrativo que surgió sobre la base de dicha ilegalidad e inconstitucionalidad y hacer efectiva la responsabilidad de los infractores si no está cubierta por la inviolabilidad de votos y opiniones.\\nTomado de http://senaldealerta.pe/opini%C3%B3...\\n[email protected]'"}, "time": 1742564015.6621928}