{"duration": 0.12737607955932617, "input_args": {"text": "'Bias bashers Russia Has a Dead Nuclear Submarine (Armed With Nuclear Weapons) Sitting at the Bottom of the Ocean \\nA fascinating vessel and a heroic captain both met tragic ends Originally appeared at The National Interest \\nIn the mid-1980s, the Soviet Union constructed a super submarine unlike any other. Fast and capable of astounding depths for a combat submersible, the submarine Komsomolets was introduced in 1984, heralded as a new direction for the Soviet Navy. \\nFive years later, Komsomolets and its nuclear weapons were on the bottom of the ocean, two-thirds of its crew killed by what was considered yet another example of Soviet incompetence. \\nThe history of the Komsomolets goes as far back as 1966. A team at the Rubin Design Bureau under N. A. Klimov and head designer Y. N. Kormilitsin was instructed to begin research into a Project 685, a deep-diving submarine. The research effort dragged on for eight years, likely due to a lack of a suitable metal that could withstand the immense pressures of the deep. In 1974, however, the double-hulled design was completed, with a titanium alloy chosen for the inner hull. \\nProject 685, also known as K-278, was to be a prototype boat to test future deep-diving Soviet submarines. The Sevmash shipyard began construction on April 22, 1978 and the ship was officially completed on May 30, 1983. The difficulty in machining titanium contributed to the unusually long construction period. \\nK-278 was 360 feet long and forty feet wide, with the inner hull approximately twenty-four feet wide. It had a submerged displacement of 6,500 tons, and the use of titanium instead of steel made it notably lighter. It had a unique double hull, with the inner hull made of titanium, that gave it its deep-diving capability. The inner hull was further divided into seven compartments, two of which were reinforced to create a safe zone for the crew, and an escape capsule was built into the sail to allow the crew to abandon ship while submerged at depths of up to 1,500 meters. \\nThe submarine was powered by one 190-megawatt OK-650B-3 nuclear pressurized water reactor, driving two forty-five-thousand-shipboard-horsepower steam-turbine engines. This propelled it to a submerged speed of thirty knots, and a surface speed of fourteen knots. \\nThe sub had the MGK-500 “Skat” (NATO code name: Shark Gill) low-frequency passive/active search and attack spherical bow array sonar system, the same sonar used in today’s Yasen-class attack submarines, which fed into the Omnibus-685 Combat Information Control System. Armament consisted of six 533-millimeter standard diameter torpedo tubes, including twenty-two Type 53 torpedoes and Shkval supercavitating antisubmarine torpedoes. \\nThe submarine joined the Red Banner Northern Fleet in January 1984 and began a series of deep diving experiments. Under Captain First Rank Yuri Zelensky the submarine set a record depth of 3,346 feet—an astounding accomplishment considering its American equivalent, the USS Los Angeles class, had an absolute maximum depth of 1,475 feet. Crush depth was estimated at approximately 4,500 feet. The submarine had a special surfacing system, “Iridium,” which used gas generators to blow the ballast tanks. \\nThe Soviet Navy considered K-278 invulnerable at depths greater than one thousand meters; at such depths it was difficult to detect and enemy torpedoes, particularly the American Mark 48, which had a maximum depth of eight hundred meters. Although the submarine was originally to be a test ship, it was eventually made into a fully operational combat-ready ship in 1988. It was given the name Komsomolets, meaning “member of the Young Communist League.” \\nOn April 7, 1989, while operating a depth of 1266 feet, Komsomolets ran into trouble in the middle of the Norwegian Sea. According to Norman Polmar and Kenneth Moore , it was the submarine’s second crew , newly trained in operating the ship. Furthermore, its origins as a test ship meant it lacked a damage-control party. \\nA fire broke out in the seventh aft chamber, and the flames burned out an air supply valve, which fed pressurized air into the fire. Fire suppression measures failed. The reactor was scrammed and the ballast tanks were blown to surface the submarine. The fire continued to spread, and the crew fought the fire for six hours before the order to abandon ship was given. According to Polmar and Moore, the fire was so intense that crewmen on deck watched as the rubber anechoic coating tiles coating the outer hull slid off due to the extreme heat. \\nThe ship’s commanding officer, Captain First Rank Evgeny Vanin, along with four others, went back into the ship to find crewmembers who had not heard the abandon ship order. Vanin and his rescue party were unable to venture farther—the submarine was tilting eighty degrees headfirst—and entered the rescue chamber. The chamber failed to dislodge at first, but eventually broke free of the mortally wounded sub. Once on the surface, the abrupt pressure change caused the top hatch to blow off, throwing two crewmembers out of the chamber. The chamber, as well as the captain and the rest of the rescue party, sank under the waves. \\nOnly four men had been killed in the incident so far, but after the submarine sank many men succumbed to the thirty-six-degree (Fahrenheit) water temperatures. After an hour the fishing boats Alexi Khlobystov and Oma arrived and rescued thirty men, some of whom later succumbed to their injuries. Of the original sixty-nine men on board the submarine when disaster struck, forty-two died, including Captain First Rank Vanin. \\nKomsomolets sank in 5,250 feet of water, complete with its nuclear reactor and two nuclear-armed Shkval torpedoes. Between 1989 and 1998 seven expeditions were carried out to secure the reactor against radioactive release and seal the torpedo tubes. Russian sources allege that during these visits, evidence of “unauthorized visits to the sunken submarine by foreign agents” were discovered.'"}, "time": 1742562098.912563}