{"duration": 0.06645321846008301, "input_args": {"text": "'Gaming publisher Ubisoft revealed that sales were down 6% for the 3rd fiscal quarter compared to the previous year while Watch Dogs 2‘s launch wasn’t what they had hoped for. [Ubisoft’s 3rd quarter was as much a mixed bag of victory and defeat. While winter sports sim Steep outperformed its relatively muted expectations,   simulator Watch Dogs 2 wasn’t quite as “dynamic” as the company expected with a “soft” launch. Still, it reportedly managed to outperform last year’s shaky Assassin’s Creed: Syndicate launch.  While interest in MMO shooter The Division has dwindled since its blockbuster release, Ubisoft CEO Yves Guillemot did report a 152% jump in active players since the game’s big October update. Meanwhile, tactical multiplayer shooter Rainbow Six: Siege is healthier than ever, with over 15 million registered players and the highest daily activity yet in a community that continues to expand. Moreover, back catalog games like the aforementioned The Division and Rainbow Six: Siege are driving profits further than usual. Ubisoft’s continued support of their older titles is paying off, and the lack of a 2016 entry in the Assassin’s Creed franchise seems to have boosted the sales of previous games in the series. Guillemot said that Ubisoft is “successfully pursuing our transformation into a more recurring and more profitable profile” and that “the positive effects of this transformation are remarkable. ” Finally, Ubisoft reported about $213 million for the Assassin’s Creed movie, a “solid first step. ” While it didn’t exactly wow the critics, gamers around the world seem to have enjoyed seeing the titular Assassins struggle against the machinations of Abstergo’s Templars on the big screen. Ubisoft will be releasing the next major entry this year in the Assassin’s Creed franchise and has delayed South Park: The Fractured But Hole into fiscal year 2017, which could help improve their fortunes over last year. Follow Nate Church @Get2Church on Twitter for the latest news in gaming and technology, and snarky opinions on both.'"}, "time": 1742628334.6196716}