{"duration": 0.0728452205657959, "input_args": {"text": "'The confidential informant had an explosive tip for the University of Kentucky’s campus newspaper: An associate professor of entomology had been accused of groping students, and the college, after an investigation, had permitted him to leave quietly. On the trail of a hot story, the paper, The Kentucky Kernel, requested files from the university. Officials turned over some documents, but they contained few details. Months later, though, in August, a   dossier about the accusations was leaked to the newspaper, which reported the specifics, including one woman’s claim that the professor had grabbed her buttocks, crotch and breast during an   conference in 2013. Now The Kernel is being sued by the university in a continuing battle over whether records in the case should be disclosed. And it is just one of several disputes between universities and student newspapers, which are pushing administrations to become more transparent about sexual assault, a defining issue on campuses around the country. With cuts at traditional news organizations, student journalists see their role as increasingly important in shedding light on the subject and are becoming more dogged in ferreting out information about sexual assault cases, particularly when faculty or student perpetrators could simply find other jobs or transfer to another university. Some are demanding that the student body be given details when a college confirms wrongdoing, particularly of a violent nature, by students, faculty or staff members. Universities, though, often invoke privacy concerns in refusing to make details of inquiries public. “The critical question is whether we are able to continue protecting the confidentiality and privacy of   who courageously come forward to report details of their victimization,” wrote the University of Kentucky’s president, Eli Capilouto, in a universitywide email. “The protection of   privacy,” the email continued, “requires more than the redaction of names. It requires the redaction of any information that might reasonably lead to the identification of   as well as the intimate details of the sexual assault. ” Frank LoMonte, executive director of the Student Press Law Center, a nonprofit organization, sees it another way. With state funding reductions and increasing competition for top students, colleges are more motivated than ever, he suggested, to maintain their reputations. “The stakes have increased for colleges to keep secrets,” Mr. LoMonte said. “They’re getting more aggressive. ” His group has helped student journalists fight to get documents and other information, and has worked to fend off funding cuts that students believe were in retaliation for controversial articles. At Brandeis University, in Waltham, Mass. three staff members on The Justice, the student newspaper, were notified in February that they would be called to a university meeting  —   the first step in a disciplinary process  —   because the newspaper had audiotaped a public rally in 2015 at which students criticized the university’s handling of sexual assault cases. Someone had complained that the rally was recorded without permission, which the complainant viewed as possibly violating state law and college rules. The Justice had used the recordings for an article about the rally. No formal charges were filed, the university said, because it concluded that student journalists covering public events were within their rights to use recording devices. “We were very concerned that the student press at Brandeis was being targeted unfairly,” said Ari Cohn, a lawyer with the nonprofit Foundation for Individual Rights in Education, which aided the students. “The public relations issues around sexual assault on campus are massive right now. There’s definitely a desire by universities to be out in front of those issues and to show they’re taking this seriously. In some cases, like this one, that causes an overreaction. ” The Daily Tar Heel, an independent publication at the University of North   Hill, sued the university on Nov. 21 after officials refused to release details about sexual assault cases there. In a statement, the vice chancellor for communications, Joel Curran, said the university had a “profound responsibility to protect and vigorously defend the privacy of sexual assault victims and all students, including witnesses, who may be involved. ” But Jane Wester, The Daily Tar Heel’s editor, said, “Once someone has been found responsible for a violent offense, the university is under no obligation to keep that information private. ” At Indiana University, the independent Indiana Daily Student has been battling since September to obtain a   report on the school’s inquiry into sexual assault accusations against a former ballet instructor, Guoping Wang, who was arrested in July and charged with sexual battery of a student. The criminal case is pending. Hannah Alani, the investigations editor for The Indiana Daily Student, said the university’s refusal to release its report  —   partly on grounds that it is part of Mr. Wang’s personnel file  —   fits a pattern in which the university has repeatedly declined requests related to sexual assault, prompting it to seek legal advice. “Indiana University insists it takes sexual assault seriously,” said Ms. Alani, whose newspaper has been aggressively covering campus sexual assault. “But when pressed for transparency on student and faculty cases, the university tells the public very little. ” An Indiana spokeswoman, Margie   said the documents requested by the paper were not “public records,” and therefore could not be released. The Kernel, which is partly financed by the University of Kentucky, has won numerous journalism awards. The university itself is home to a First Amendment Center endowed by the venerable Scripps Howard broadcasting and newspaper chain. The paper’s legal troubles began when it sought the records about the accusations against the professor. After the university refused to release the documents, the newspaper appealed to the state attorney general  —   the procedure under Kentucky law. The attorney general first ruled that the university should submit the documents to him for review in private. When it refused, he ruled that the university should release the documents to the newspaper with the names redacted. As the dispute continued, the records in the case were leaked to the newspaper, which published an article based on them. Even though the records have already been disclosed, the university sued the paper to prevent the attorney general’s order from establishing what it called a dangerous legal precedent, arguing that such a ruling would open the floodgates for the release of additional documents protected by student privacy provisions. Jay Blanton, a university spokesman, defended the college’s record on sexual assault cases over all, as well as its handling of the case involving the entomology professor, James Harwood. The professor, who did not respond to requests for comment, has denied the accusations. “The agreement with Dr. Harwood removed him from campus and prevented him from interacting with students immediately,” Mr. Blanton said. The case has pitted the college’s journalism faculty against its president, Mr. Capilouto, who criticized the newspaper’s coverage. “The president said that I published salacious details to gain readership,” said Marjorie Kirk, the newspaper’s editor. “I am incredibly insulted. ” Supporters of The Kernel say the university’s position may pose a public threat by permitting sexual predators to remain anonymous. At a meeting of university trustees, David Hawpe, a trustee and former editor of The   of Louisville, questioned whether the university was in danger of making the same kind of mistakes as the Catholic Church, which covered up sexual abuse by priests and permitted them to move from one parish to another. Internal emails released by the university reveal that Dr. Harwood, who has an impressive record of teaching and published research, was interviewing for other jobs at the time of his resignation. The university argues that releasing information makes victims afraid to come forward, fearful that their cases will become public. The university has suggested a connection between The Kernel’s reporting and a decline in reported campus sexual misconduct cases. Mr. Capilouto said the decline  —   to 38 reports this year compared with 59 in the same period last year  —   “underscores the chilling impact that news reports are having on the willingness of   to come forward. ” And the professor’s accusers, whose representative initially encouraged the newspaper to report on the case, are now supporting the university’s position after a meeting with Mr. Capilouto. Under its agreement with Dr. Harwood, who resigned in February, the university promised not to disparage the professor or disclose the agreement’s existence unless someone filed an open records request or obtained a court order. In an email to a university dean, Dr. Harwood said he had been assured that the accusations would “remain confidential, not on the public record, and not listed against my name. ” As part of its agreement, the university continued his $109, 000 annual pay through August.'"}, "time": 1742628436.361405}