{"duration": 0.23627138137817383, "input_args": {"text": "'Hungary negotiates its migration problem with the EU, not with Russia Nations such as Hungary are using the migration issue to challenge the power and competences of the EU in the name of national sovereignty. At the same time, the refugee wave has become a geopolitical dilemma between Russia and the EU Nations such as Hungary are using the migration issue to challenge the power and competences of the EU in the name of national sovereignty. At the same time, the refugee wave has become a geopolitical dilemma between Russia and the EU. \\n\\nA Syrian refugee looks at Hungarian riot police from the Serbian side of the fence built by Hungarian authorities at the border between Serbia and Hungary, in Horgos, Serbia. Photo: AP \\nThe referendum in Hungary on the migration issue in early October, combined with the death of a policeman at the door of a Russia-friendly far right anti-migration activist at the end of the same month, have once again highlighted the importance of the migration issue for Hungary. There are two distinct aspects of this issue – Hungary’s relationship with Brussels and with Russia – and it is clear that there is quite a disconnect between the two.\\nHungarians went to the polls on Oct. 2 to give their opinion on a referendum question that each political side interpreted in its own way. The turnout remained well below the necessary 50 percent of all valid votes, although 98 percent of voters – more than three million people – said they wanted the Hungarian parliament to have a decisive say about any future quota-based redistribution of asylum-seekers inside the EU.\\nThe referendum and its campaign had two separate goals. First, the ruling Fidesz party had to test the loyalty of their political camp, thus they tried to redefine classical political fault lines and checked on the unity of the opposition. Secondly, Prime Minister Viktor Orban used this occasion to bring forward his arguments about reshaping the competences of the European Union, especially the European Commission itself.\\nThe referendum question has been thoroughly debated ever since it was published, as it reflects both of the above goals. The question asks: \"Do you want the European Union to be able to order the mandatory settlement of non-Hungarian citizens in Hungary without parliament’s consent?\"\\nOf course, political and civil groups were enabled by the ambiguous wording of the question to focus on significantly different interpretations. Neither the Constitutional Court nor the National Election Committee declared the question invalid, despite the fact that it raised concerns among experts. The constitutional rules within most member states declare that no national referendum should be held on issues already regulated by international treaties.\\nAs a way of getting around this fact, the government later claimed that the referendum did not concern the decisions of mandatory quotas already decided at the level of the European Council - it would only concern future possible decisions.\\nDebating the competency of the EU Clearly, the European Council is required to give the final word in any such case of quota-based distribution of resettlement or relocation among EU member states, in any case where Hungary has a way to raise its own voice or to build a blocking coalition. The Hungarian government decided to go against the quota system after the Council’s decisions of last autumn. Slovakia and Hungary went to the European Court in Luxembourg to dispute the legality of the measure.  ;\\nThis was the final point where the Hungarian government turned the migration crisis into a sovereignty question. It had started in the official government rhetoric already after the attacks on Charlie Hebdo , but the referendum question undoubtedly raised the stakes of the debate. It is not anymore about whether migrants or refugees should be welcomed or not, the opinion of the government focuses on the competence of the European institutions  ;- whether they can, in theory, enforce population-related decisions on member states.\\nThe Hungarian position is openly on the side that the quota system violates the sovereignty of member states and unnecessarily forces a non-solution instead of paying attention to securing the external borders of the Schengen area. This has been the argument already since last summer, when hundreds of thousands of refugees crossed the country and the Balkan route towards Germany.\\nFirst, the borders must be secured, because if member states start the redistribution mechanism, the political pressure for a sustainable solution at the border protection level would dissipate and Hungary would be left with an ever-growing influx of uncontrolled immigration.\\nThe EU-Turkey deal seriously decreased the number of asylum-seekers arriving in the Balkans, though the Mediterranean route remains open and Italy is under growing pressure again. Hungarians have not seen masses of migrants since last September when the government sealed the southern Hungarian borders with a razor-wire fence. Despite this measure, the government continued to communicate a permanent threat of uncontrolled migrants throughout the campaign.\\nRecommended: \" Why migration represents a new existential threat for Europe \" The momentum of vox populi in the EU member states While Pew Research and other polls do not put the Hungarian electorate among the friendliest towards foreigners from other cultures, it is still a member of the community of European values. Hungarians came up with a very positive response through civil society last summer during the crisis at the Eastern Train Station in Budapest, where medical and social services as well as food was provided by NGOs, volunteers and churches to the tens of thousands stranded asylum-seekers. Not one single organized attack was carried out against the people on the road, while in Germany, safe homes and groups have been attacked in the hundreds.\\nHungarians are, of course, not resistant to strong government messages that resonate, but the invalid referendum gave proof that the will of the government is not enough in itself to completely reshape the perception of the electorate. While xenophobia has risen to a new high in the population, it is still not the general attitude of the average voter. Hungarians live in their own reality, facing economic hurdles and challenges, caring about how to make a living in a country where the average salary is about half of the minimum wage in France.\\nThe government campaign focused largely on classic media platforms: billboards, public and pro-government television and radio channels, leaflets in the mailbox. It was significantly weaker on social media, where youngsters remain a relatively disaffected group.\\nThe number of invalid votes – those who put their paper in the ballot box but did not pick any of the choices – together with the more than 50,000 voters who actually decided to take home the ballot instead of casting it at all, hit a record. Altogether, well over 250,000 voters sent the message that they did not want to reply to such a question.\\nThe referendum must be dealt with at the European level The Hungarian referendum enters into the long-running history of the Budapest-Brussel battle that the second Orbán-government (2010-2014) started right around the country’s European Council presidency in 2011. The referendum’s signature motto was “Let’s Tell Brussels” what Hungarians want, implying that EU bureaucrats (technocrats) are not representing the interests of nation states.\\nThis argumentation to adopt Brussels as a scapegoat is not unknown in other capitals of Europe either. Actually, the truly diverse community of the 27 member states have their national sensitivities elsewhere. For Central Europeans, demography and population policy (i.e. migration) is a pivotal question, especially for their nation-state minded governments.\\nFor Ireland, their sovereignty over Irish tax policy is a cornerstone issue, in which they do not wish to have the support of the EU institutions against Apple. The German constitutional court in Karlsruhe has declared itself against EU legislation in some instances over the last few decades.\\nSo the legal battleground among member states and EU institutions is an old one, which is an organic part of the history of European integration. Popular referenda are another thing entirely. Greece tried to acquire some weight by its last vote on credit conditions, with only limited results. Referenda on the European Constitution in France and the Netherlands were also serious failures.\\nAlso read: \" Is Europe coming apart at the seams? \" Quickly shifting geopolitical background This migration topic has been turned into the most successful glue among the Visegrad states. Anti-migrant messages have been strong in Slovakia, bringing a sharp election victory and a colorful coalition for Robert Fico and in the Czech Republic, especially by the pro-Russian president, Milos Zeman. Finally, the new right-wing government of Poland also claimed sovereignty over migration, though often in a less harsh voice, as a rule of law procedure has been opened in Brussels investigating the situation in post-election Warsaw.\\nThis coalition seems to be broken up by the Slovakian presidency of the Council, where Bratislava had to take the position of honest broker. Prague also approached Berlin on several questions and the government took a step back on this question.\\nAfter the EU summit in Bratislava in September, the European context for quota-based solutions shifted anyway. Powerful member states also put the accent on the protection of external borders and the cooperation on the front against terrorism. Besides Jean-Claude Juncker, president of the European Commission, it seems that others have taken the redistribution issue off the political agenda, or at least it is not the cornerstone of current council sessions.\\nRussian factor The shift in the European political discourse about migration is an important one: It is less and less framed as a social issue and has been turned into a security question. As soon as it is considered to touch upon the national security of EU member states, the Russian involvement in Syria and other active measures influencing the movement of asylum-seekers might become more critical for European military and other law enforcement actors. This could drive to new tensions if the sides are not taking into account the new context of communication.\\nIn late October, a Hungarian special law enforcement agency knocked on the door of a well-known far-right figure, István Győrkös. In the ensuing exchange of gunfire, he killed a policeman. This brought forth his organization, the Hungarian National Front (MNA), which set up the Hidfő webpage, which eventually turned into a notorious pro-Russian news portal. Investigative reports in the Hungarian media started to describe the MNA as a rather old platform for Russian influence over the Hungarian far-right and neo-Nazi scene.\\nEver since the migration crisis hit Europe, a network of relatively new, otherwise often pro-Russian news pages started to exploit the anti-migrant or xenophobic feelings of Hungarians and other populations of EU member states. The migration crisis turned into one of the most visible gap between new and old member states: certainly, it is not a fruitful debate but a bitter division.\\nMany European observers consider the destabilization of the European alliance and the Euro-Atlantic alliance to be a strategic Russian interest. Migration and the amplification of this issue within society by the media, together with the presence of Russian support for several European far-right movements, create a dangerous mix for the EU. In this game, Hungary must play along with its EU and NATO partners, rather than with Russia. It has much more to lose outside of the Western frameworks.\\nIn the long term, the Kremlin will also face the dilemmas of migration policy. The Russian government adopted a comprehensive new policy on migration in 2012, though the country is a target destination overwhelmingly among the citizens of the former Soviet states. An ageing population, a growing work force gap and extremely long land borders suggest that difficult years could be ahead for the Kremlin as well.\\nHence in the long term, the EU and Russia will not necessarily be conflicting on migration regulation. Nevertheless, currently the attempt to win the support of Turkey is apparent. Both the EU and Russia want Turkish President Recep Tayyip Erdogan to support their own respective interests in handling the crisis in Syria and in the Middle East.\\nAs long as the Syrian conundrum is not resolved together with Washington and other regional actors, conflicting interests are encoded in the EU-Russia relationship regarding migration.  ;The German secret service BND also reported about alleged active measures of Russia around the Greek-Macedonian border to further escalate the situation. [The BND is Germany’s Federal Intelligence Service, the Bundesnachrichtendienst – Editor’s note]\\nThis shows that Moscow is not truly seeking cooperation with Europe on the migration crisis, but so far tries to exploit it for its other strategic interests and to create another bargaining chip for future negotiations.\\nThe opinion of the author may not necessarily reflect the position of Russia Direct or its staff. '"}, "time": 1742562252.1697552}