{"duration": 0.047953128814697266, "input_args": {"text": "'The Starbucks Coffee brand has taken a major hit since the company’s announcement that it would hire 10, 000 Muslim “refugees” in response to President Donald Trump’s temporary travel moratorium in January. [Starbucks was one of those early to criticize President Trump for putting a temporary hold on immigration from a list of seven   countries flagged by the Obama administration. In response, the coffee house giant pledged to hire 10, 000 Muslim refugees over five years in protest against Trump’s order.  But since the company issued its   statement its brand name has lost its luster with customers. Perception levels of the Starbucks brand name fell by an incredible   since its January announcement, according to a YouGov survey, as reported by Yahoo Finance. The survey measures how potential customers feel about a company’s brand and asks if they have “heard anything about the brand in the last two weeks, through advertising, news or word of mouth, was it positive or negative. ” In the week before the company’s January refugees announcement, 30% of respondents said they would consider spending money at Starbucks. But after the statement that number fell to 24 percent, the survey discovered. The company’s announcement immediately sparked a #BoycottStarbucks movement on Twitter and brought condemnation from coast to coast. Not long after Starbucks issued its   refugee statement, many Americans began to wonder why Starbucks is slighting the hiring of Americans  —   especially U. S. military veterans  —   in favor of refugees. Ultimately, on the heels of its refugees announcement, the company felt enough pressure to issue a second statement to explain to America’s military veterans that the company doesn’t actually hate them. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742561759.3182812}