{"duration": 0.09185075759887695, "input_args": {"text": "'WASHINGTON  —   His unrelenting stream of incendiary remarks have left horrified congressional Republicans divided into five loose categories about the problem that is Donald J. Trump. There are the fast walkers  —   like Senator Patrick J. Toomey, the endangered Republican from Pennsylvania  —   who try to run briskly away from questions about the party’s presumed nominee for president. Mr. Toomey  —   never the most loquacious lawmaker  —   has mastered the art of twisting his face into a grimace and racing away from reporters before they can ask him about Mr. Trump’s latest statements about instituting a ban on Muslim immigration. Another senator in a tight   bid, Kelly Ayotte of New Hampshire, also tries to avoid talking about Mr. Trump, whom she supports, as she makes her way through the halls of Congress. (To be in this category, it is very useful to have Ms. Ayotte’s long legs.) Then there are lawmakers best described as grumps, like Senator John McCain of Arizona, who appears decidedly downbeat about his party, and Senator Bob Corker of Tennessee, who offered early support to Mr. Trump’s campaign but said this week, “I don’t know that I really have a lot to say,” adding that he had tried to advise Mr. Trump and was “discouraged by the results. ” Add to that list Senator Dan Coats, Republican of Indiana, who has struggled to find a single policy position he shares with Mr. Trump. Another group are doing “the McConnell,” taking a cue from their majority leader, Senator Mitch McConnell of Kentucky. Senators Marco Rubio and Ted Cruz  —   as well a number of House members  —   rotely repeat that they are supporting Mr. Trump, and refuse to engage on his specific statements most days. Mr. McConnell preemptively cuts off discussion by saying things like, “I’m not going to be commenting on the presidential candidates today. ” A smaller group are the free speakers, including Senators Lindsey Graham of South Carolina and Jeff Flake of Arizona, who openly heap scorn on Mr. Trump. Mr. Flake called Mr. Trump’s remarks suggesting that President Obama somehow had inside information about the Orlando massacre “particularly disgusting,” and, like Mr. Graham, said he would not be voting for him. The final category is the       . “Am I offended sometimes at the comments? Yes I am,” said Representative Mark Walker of North Carolina. “However, what offends me more are Hillary Clinton’s actions. ” Then there is Speaker Paul D. Ryan. He is perhaps the most prominent critic of Mr. Trump on his proposed Muslim ban, but has nonetheless fully endorsed him. That is a category of one. Mr. Trump has created a feedback loop in which he says increasingly outrageous and at times incoherent things about national security, immigration and other issues and Republicans are forced to answer for it. On Wednesday during a rally in Atlanta, Mr. Trump addressed Republican criticism by basically telling lawmakers to shut up. “Don’t talk. Please, be quiet,” he said. “Just be quiet, to the leaders, because they have to get tougher, they have to get sharper, they have to get smarter, and we have to have our Republicans either stick together or let me just do it by myself. ” While it is not clear how much support Mr. Trump is actually losing  —   House Republicans continue to hide behind Mr. Ryan’s embrace of the live wire as proof of their party unity  —   it is clear that he is not gaining support either. His top surrogates remain Senator Jeff Sessions of Alabama and Representative Lee Zeldin of New York, with no sign of newcomers to the list. The toxic combination of Mr. Trump’s statements and his falling poll numbers has given signs of life to the Never Trump movement, whose members cling to the hope that they can prevent Mr. Trump from becoming the nominee next month. “If Donald Trump continues to conduct himself in a way that’s unbecoming of a nominee, let alone a president,” said Rory Cooper, a senior adviser to the #NeverTrump PAC, “then delegates and party leaders in Cleveland should be empowered to open the convention, just as Democrats are able to do. If there is no such mechanism, then you are essentially saying there is no unacceptable line Trump can cross. ” However, there is a big division among   Republicans over whether a change in convention rules, which would essentially unbind delegates from the candidate, or a   option is the best way to go. Many Republicans, even those who appear in need of a box of chocolates or a bourbon to get through each day of Mr. Trump’s remarks, oppose a rules changes. “That’s like saying in baseball that you’re a run behind and now you want to add three innings,” said Mr. Coats, after conceding that the process has been a slog. Representative Robert Dold, an Illinois Republican who has long been outspoken against Mr. Trump, said the will of the voters ought to be respected, even as he openly derides Mr. Trump. “We’ve been explicit,” he said. “We are not supporting Donald Trump. ” Mr. Dold, like some other Republicans, said he would likely write in a candidate’s name. Representative Don Young, Republican of Alaska, who straddles the line of the free speaker and    camps, has a more novel strategy. “I don’t listen to him and never have,” Mr. Young said. “I may vote for myself. ”'"}, "time": 1742561778.8242173}