{"duration": 0.06088972091674805, "input_args": {"text": "'Irish rock band U2 has delayed the release of its next studio album after the surprise election of Donald Trump. [Songs of Experience, the band’s   to its   2014 album Songs of Innocence, was “pretty much complete,” U2 founding guitarist The Edge told Rolling Stone. Then Trump won the election and “suddenly the world changed. ”  “We just went, ‘Hold on a second  —   we’ve got to give ourselves a moment to think about this record and about how it relates to what’s going on in the world,’” the guitarist said about the upcoming project. Trump’s election, he noted, was “like a pendulum has suddenly just taken a huge swing in the other direction. ” He noted that most of the album’s lyrics were “written in the early part of 2016,” and now need to be revised because “the world is a different place. ” U2, seeing its next record as an opportunity to make a political statement, knew it needed to put the album “on ice for a minute, just to really think about it one more time before putting it out, just to make sure that it really was what we wanted to say. ” “We may even write a couple of new songs because that’s the very position we’re in,” the guitarist said. “We’ve given ourselves a little bit of breathing space for creativity. ” “So we said look, ‘Look, let’s do both. We can really celebrate this album, which is really born again in this context, and we can also really get a chance to think about these songs and make sure they’re really what we want to put out,’” he added. U2 has remained relatively quiet during the presidential election, though the band’s frontman Bono called Trump “dangerous,” and said he’s “potentially the worst idea that ever happened to America. ” “Look, America is like the best idea the world ever came up with, but Donald Trump is potentially the worst idea that ever happened to America,” Bono said in September on CBS This Morning. “Potentially,” he added, Trump “could destroy” America. A month later, Bono bashed Trump’s proposal to build a wall on the U. S.  border during a concert in San Francisco. Bono could be seen screaming “You’re fired!” at an onstage projection of   Trump. “Good people are not going to stay silent while you run off with the American dream!” Bono shouted during the elaborate, virtual   .  On Monday, U2 announced a tour of North America and Europe to celebrate the 30th anniversary of its first album, The Joshua Tree.   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742562112.5227373}