{"duration": 0.045569419860839844, "input_args": {"text": "'It\\'s outrageous that AT&T and Time Warner may be permitted to merge. Of course, there are antitrust issues. If it\\'s approved, some competitors will go out of business, others won\\'t get started, and consumers will pay more and get less. Antitrust law is not designed to regulate anticompetitive behavior; it is designed to prevent anticompetitive behavior. Permitting AT&T to acquire Time Warner would be like giving a small boy a ball and then saying, \"Now don\\'t bounce it\" -- or hiring someone to watch him. Regulation doesn\\'t work. What\\'s called \"agency capture\" is widespread and well documented. In the BP oil-spill case, it involved the regulators literally sleeping with the regulated. Even if an agency isn\\'t captured it probably doesn\\'t have enough personnel to do meaningful regulation. The FCC of my day had three employees to respond to 85,000 complaints, and they travelled in pairs. - Advertisement - The only way to prevent anticompetitive corporate behavior is to forbid the mergers that make it possible. But antitrust law and lawyers often have ways of finding adequate competition when no one else can see it. Moreover, the serious antitrust issues and economic impact of this proposed merger are the least of our concerns. Mergers of media firms, unlike those in other industries, raise issues involving our democracy, analogous to those associated with the First Amendment. Some involve politics and governing. Major media owners are more politically powerful than major donors. When a single owner has dominant control of newspapers, radio, television and cable systems within a state or region it can affect elections. When a weapons manufacturer also owns a network, it creates an appearance of possible conflict in its war coverage. Other issues involve the creative community. Suppose a single corporation owns movie studios, theaters, a TV network, book publishers, newspapers, and other forms of media. It can favor its movies in its theaters, make its authors guests on its TV shows, and advertise all its products in its newspapers. - Advertisement - Both AT&T and Time Warner are among the world\\'s largest corporations. Time Warner\\'s HBO and Cinemax programming is sold in 150 countries, its Turner programs in 200. AT&T is the largest telecommunications company in the world, also in 200 countries. Both are holding companies, conglomerates, that together own dozens of corporations. Many are known to you, like CNN, HBO, or DirectTV. Check their corporate Web pages for more. Worst of all, and what ought to absolutely preclude this merger, they will represent a gigantic combination of programming and delivery (\"content and conduit\") -- the ultimate chokehold on the distribution of a diversity of content. The AT&T of old only provided distribution, the conduit. Everyone was entitled to a phone. And once you got one, you could send any ideas you wanted into that phone and through AT&T\\'s lines. Other institutions might come after you for disclosing national-security secrets, fraudulent marketing, or defamation, but not AT&T. There was a legal \"right of entry\" into the old AT&T network. No longer. There will be no legal rights for America\\'s creators of content. Nor will there be a financial incentive for AT&T to carry their content.'"}, "time": 1742562308.5139148}