{"duration": 0.03905773162841797, "input_args": {"text": "'Go to Article \\nThey had to know they had it coming… \\nDonald Trump scolded media big shots during an off-the-record Trump Tower sitdown on Monday, sources told The Post. \\n“It was like a f–ing firing squad,” one source said of the encounter. \\n“Trump started with [CNN chief] Jeff Zucker and said ‘I hate your network, everyone at CNN is a liar and you should be ashamed,’ ” the source said. \\n“The meeting was a total disaster. The TV execs and anchors went in there thinking they would be discussing the access they would get to the Trump administration, but instead they got a Trump-style dressing down,” the source added. \\nA second source confirmed the fireworks. \\n“The meeting took place in a big board room and there were about 30 or 40 people, including the big news anchors from all the networks,” the other source said. \\n“Trump kept saying, ‘We’re in a room of liars, the deceitful dishonest media who got it all wrong.’ He addressed everyone in the room calling the media dishonest, deceitful liars. He called out Jeff Zucker by name and said everyone at CNN was a liar, and CNN was [a] network of liars,” the source said. \\n“Trump didn’t say [NBC reporter] Katy Tur by name, but talked about an NBC female correspondent who got it wrong, then he referred to a horrible network correspondent who cried when Hillary lost who hosted a debate – which was Martha Raddatz who was also in the room.” \\nThe stunned reporters tried to get a word in edgewise to discuss access to a Trump Administration. \\n“[CBS Good Morning co-host Gayle] King did not stand up, but asked some question, ‘How do you propose we the media work with you?’ Chuck Todd asked some pretty pointed questions. David Muir asked ‘How are you going to cope living in DC while your family is in NYC? It was a horrible meeting.” \\nHere’s a sampling of Trump hitting back at the dishonest media while he was on the campaign trail. Trump did something no other presidential candidate has ever done before, he won the election in a landslide, in spite of the entire fake news empire working together to take him down: \\nTrump spokeswoman Kellyanne Conway told reporters the gathering went well. \\n“Excellent meetings with the top executives of the major networks,” she said during a gaggle in the lobby of Trump Tower. “Pretty unprecedented meeting we put together in two days.” \\nThe meeting was off the record, meaning the participants agreed not to talk about the substance of the conversations. \\nThe hour-long session included top execs from network and cable news channels. Among the attendees were NBC’s Deborah Turness, Lester Holt and Chuck Todd, ABC’s James Goldston, George Stephanopoulos, David Muir and Martha Raddatz, \\nAlso, CBS’ Norah O’Donnell John Dickerson, Charlie Rose, Christopher Isham and King, Fox News’ Bill Shine, Jack Abernethy, Jay Wallace, Suzanne Scott, MSNBC’s Phil Griffin and CNN’s Jeff Zucker and Erin Burnett. -Via : NYP  '"}, "time": 1742561873.2135053}