{"duration": 0.028204679489135742, "input_args": {"text": "'President Donald Trump detailed his America First agenda to Republican congressional leaders attending the annual Republican congressional retreat in Philadelphia. He promised to create millions of jobs for the American worker and reasserted his commitment to build a wall and crack down on immigration and sanctuary cities. [“It’s time to restore the civil rights of Americans to protect their jobs, their hopes, and their dreams for a much better future,” he said, vowing to enforce existing laws on immigration. “The hour of justice for the American worker has arrived. ”  Trump specifically referred to Mexican President Enrique Peña Nieto’s decision to cancel a meeting with him, and vowed that if they failed to respect the United States, he would “have to go another way” in their relationship. He also vowed to renegotiate multilateral trade deals, such as NAFTA and other deals that would favor American workers. “We’re going to pursue new trade deals that create higher wages and more opportunities for American workers, bringing back those magnificent words ‘Made in the USA. ’” President Trump repeatedly returned to the idea of free and fair trade and restoring America’s economic prowess. “Republicans have always been the party of American industry and the American worker,” Trump said. “We must embrace that heritage, rebuilding this country with American goods and American labor. ” Trump also reasserted his promise to repeal and replace Obamacare, implement tax reform, cut regulations, rebuild the military, and take care of America’s veterans. Republicans cheered and applauded throughout his speech as he detailed his agenda. “I am privileged to stand with you, shoulder to shoulder, as we work every single day to make America great again,” he said. “Thank you. God bless you, and God bless America. ”'"}, "time": 1742561804.8086772}