{"duration": 0.15488362312316895, "input_args": {"text": "'By Cameron Day\\nHave you ever felt like you ended up in the wrong family? Did you grow up feeling that you were so incredibly different from your parents and siblings, that there must have been some sort of mistake for you to end up with those people? I’m not talking about feeling out of place in the insanity of the current era of human society, I’m talking about something much deeper — a sense that your very parents are not who you were meant to be born to.\\nIf you have felt this way, please keep reading, as this may be very important information for you. \\nI have written at length about the ongoing battle to free humanity from the enslavement of the forces of darkness in articles like “ Never Call Them Archons ”, “ First Contact Is Not Happening Soon ”, “ Shifting into 2013 ” and many others. The central theme of these articles is to illustrate that humanity is mired in multiple layers of illusion, deception, energy-draining/harvesting, trauma, manipulation, subjugation and much more. While this is an incredibly beautiful planet, the true beauty of humanity is being actively suppressed by forces that want to keep humans enslaved. At the same time, positively oriented guardians of free will have been working to free humanity from its energetic bonds of slavery, while being careful to avoid creating further trauma within the enslaved populace.\\nHow Do You Free Slaves Who Believe They Are Already Free? One of the many challenges to this undertaking is that people are repeatedly told that they are free, that their government cares for them, and that those ugly things like pollution and war are inevitable aspects of “the human condition.” More accurate would be to say that the conditioning and programming imposed on humans produces the horrors of abuse, environmental destruction and war. In order to show people how they have been enslaved, and present them with alternative ways of living, positively oriented beings from higher densities of creation chose to incarnate into human form.\\nIn doing so, the free will of humanity is not subjected to a new outside authority arriving and dispensing belief-shattering truth upon the fragile minds of enslaved and abused humans. Instead, positive social change begins to happen from within the race as awakening individuals point out the insanity of the “human condition” and show others how to live in alignment with Earth and natural laws. This is an effective tactic, although it is slow to produce change, and is filled with risks.\\nDue to the overpowered “veil of forgetfulness” that is in operation on the planet, the incarnating helper-soul completely forgets their true identity, takes on a human ego identity, and risks the possibility that they may not awaken to the truth of their mission. Another risk is that the incarnating helper-soul will experience severe traumas that prevent their awakening, or worse, that these traumas will orient their ego towards serving the darkness that they are fighting against. Despite all the risks, many millions of brave souls have incarnated on this planet because we are soldiers who fight for the Infinite Source of all creation, and because humanity is worth fighting for.\\nParachuting Into a War Zone Many people don’t fully realize it, but this planet is a war zone, and the battle is being fought mostly in the more subtle densities of the planet instead of in 3d with guns and bombs. That’s a good thing for the most part. However, for a helper-soul from a higher density to “parachute” into this war zone, there is a major risk of “landing” in the wrong incarnational vehicle (body) due to dark-side interference.\\nWhen a being chooses the family they want to incarnate into, they attach a filament of energy into the developing fetus. This attachment allows them to stake their claim on the fetus so that they can enter the body more fully once it is close to being born, or shortly after birth. In a perfect world, this process would proceed smoothly without interference. On a war-zone like Earth, this process can be disrupted.\\nThe forces of darkness, which I call ankle-biters, would prefer to never allow a helper-soul to incarnate on their heavily controlled planet. However, they cannot stop us from entering, so they use different tactics to attack the incoming helper-soul. One of their favorite methods is what I call the “Birth Bump.”\\nThe birth bump is usually done on the day the baby is being delivered, because this is normally when the incarnating being comes much more strongly into the infant body. During this time, there is a window of opportunity for the dark forces to rip the original filament attachment from the intended body and attach it to a baby being born elsewhere on the same day. The incarnating being’s incoming energy follows their filament, and ends up settling into a body and a birth family that they did not choose.\\nBecause this is a dark-side attack, the family that the incoming helper-soul gets bumped into is selected based on their propensity for abuse, neglect, mistreatment, lack of empathy, and so on. This allows the dark forces to effectively neutralize an incoming soldier for the true light, without having to expend nearly as much time and energy on attacking that person as would be necessary if the helper-soul had been born into a loving, supportive home. Sometimes the gender of the body the being ends up in is different from what they had chosen, creating even more confusion and difficulty for the incarnating being.\\nThe bad parenting of the “pseudo-parents” serves as a source of constant torment for the infant helper-soul, and they grow up taking on the negative programming of their dysfunctional pseudo-parents. Physical, emotional, mental and even sexual abuse all take their toll on the helper-soul, making their job of waking up, getting clear and fighting against the forces of darkness vastly more difficult.\\nSometimes the pseudo-parents aren’t overtly abusive, but are still a complete energetic mismatch to the helper-soul. As the child displays budding psychic abilities, the parents will ridicule their perceptions. Or if the child is repelled by certain actions of the family, they will be forced to conform to the family’s normalcy biases. Essentially, the pseudo-parents continually attempt to coerce conformity from the helper-soul child, who they don’t understand at all.\\nWhen the bumped helper-soul grows up and begins the process of self-clearing, releasing their past, gaining clarity and balance, all it takes is a visit or phone call from their manipulative, aggressive, judgmental, blaming pseudo-parents to put them into a downward spiral of negativity.\\nFrom the dark forces perspective, this is their most efficient strategy to combat the influx of helper-souls onto planet earth. It requires almost no energy output to impulse a darkness-riddled pseudo-parent to call their grown offspring and project a load of judgmental, guilt-ridden energy upon them. Conversely, for the dark forces to psychically attack an individual requires much more time, planning, energy and resources.\\nEject! Eject! The newly bumped helper-soul, upon realizing what has happened, has a choice to make: Either “eject” from this body and try to find a new one, or stick it out with the hopes of overcoming the traumatizing childhood later on. The ones who choose to “eject” simply evacuate the body and it dies, manifesting as “crib death” or “Sudden Infant Death Syndrome” where the otherwise healthy baby suddenly dies. Not all cases of crib death are from this unusual scenario, but some of them are.\\nFor the helper-souls who are brave (or over-confident) enough that they choose to stay, life becomes a daily grind of feeling unloved, alone, unsupported, abused, and alienated. Their earthly home feels like a war-zone where they can be attacked at any time for no reason, where every action can be criticized and result in being berated or spanked (which is just a nice word for hitting a defenseless child).\\nBoys in this type of situation usually leave home as early as possible, often before 18 years of age. Depending on the culture, girls often try to get out by marrying as soon as possible, or by going to study at a school far from home. Regardless of the gender or culture, the drive to get away from the family is usually extremely strong. This is often fodder for more guilt-projection from the pseudo-parents lamenting that their offspring “doesn’t love them” when in reality, they are just trying to protect themselves from the toxic projections of their pseudo-parents.\\nFinding a Safe Distance Along with healing and clearing the stored emotional pains of the past, bumped helper-souls need to energetically disconnect from their parents. The more abusive and painful the childhood, the more distance that is necessary. This starts with living in a different town, not calling too often, and not allowing the parents to project their stuff onto you. If you find yourself in a phone call where a wave of negativity is being projected onto you, just say “I’m not going to listen to this” and hang up!\\nEnergetically disconnecting from one’s “bumped family” can be tricky, as they will often call after a major energetic disconnection event. On some level they feel the disconnection, and will attempt to pull you back into their dramas and energetic baggage. This is where standing strong and refusing to engage their particular brand of craziness is essential.\\nPlease understand that I am only advocating that bumped helper-souls create this distance from their dysfunctional and abusive families. I do not advocate this for anyone who had normal, non-abusive families, even if they don’t really understand what you do as a helper-soul. What it actually means to establish a safe distance for those who were bumped into abusive families will differ from person to person.\\nCreating Your Comfort Zone For bumped helper-souls, how much distance from your pseudo-parents you create is up to you and your Higher Self. I would recommend a few things in this regard. First, don’t waste too much of your time and energy trying to get your pseudo-parents to admit what a bad job they did in raising you. Even if they do admit to some of their mistakes and apologize, it won’t alter their fundamental behavior, and they will still push your same buttons when you talk to them.\\nSecond, stop arguing with them about your own life choices on the phone or in person. You have probably already tried that for years, and gotten nowhere. It is impossible to have real communication with a human being in a state of denial and guilt-projection. If a conversation starts to turn into an argument, just end it and hang up, or leave.\\nThird, do not let them come to your home. Make your home a sanctuary from the ills of the world, especially your pseudo-parents. Do or say whatever you need to keep them out of your home, so that you can end any downward-spiraling conversations by leaving the situation. It is much easier for you to leave a place than to make someone leave your home.\\nFourth, consider writing them a letter detailing their mistreatment of you and explaining why you are disconnecting from them. A person can’t interrupt a letter, they just have to read it and attempt to deny things after the fact. Writing a letter like this can be a difficult experience that brings up old, painful memories, so make sure that you have done a lot of self-clearing and healing before you go this route. I usually only recommend this if you are going to also consider the next step as well.\\nFifth, end all contact. This is an extreme measure for extreme circumstances. If the abuse you experienced as a child is still being perpetuated in various, more subtle ways by the pseudo-parents, your best option to maintain your equilibrium is to end all contact with them. This works best if you are living in a different town, and have already begun creating distance.\\nBe prepared for an onslaught of projected guilt and other forms of drama as they try to hang on, and be firm in your convictions that you are not going to be dragged back into their dysfunctional world. Writing the letter to detail their past and present dysfunctional behavior will make it clear to them exactly why they are being cut off, which will preempt any attempt for them to act like victims or project guilt and blame onto you. They will be unable to utter anything like “After all we’ve done for you” if your letter is thorough and detailed. The letter will make clear to them that “After all you’ve done to me, this is the end.”\\nThe Art of Forgiveness Once you have established your safe boundaries and worked diligently on healing yourself, there will come a point in your process where forgiveness is needed. This forgiveness is for you and your own peace of mind. It does not require that you call the pseudo-parents and tell them that you are forgiving them, or to reestablish contact with them if you have broken it off. Forgiveness occurs within your heart and mind, and does not need to be spoken about in order to be effective for your own inner peace.\\nWhile your outward actions towards your pseudo-parents will not change, your inner perception will gradually shift as you incorporate forgiveness into your self-clearing and healing efforts. When you reach a “sticking point” in your clearing process, visualize them and say to them through your Higher Self, “I forgive you for (that particular dysfunctional behavior).” Repeat it as many times as needed, and allow your Higher Self to multiply the energy of your forgiveness so that it can clear out the frozen emotions and traumas within your subconscious mind more and more deeply.\\nThe deeper purpose of this forgiveness is so that you can think about the pseudo-parents, or the events of your childhood, without dropping into a low-frequency state of depression, despair, victimization or hatred. Over time, your inner perspective on the pseudo-parents will shift, and you will be able to understand how they came to be so dysfunctional, which is usually from their own parents being abusive or neglectful. When you can think of them simply as damaged human beings who deserve pity more than hate, you will know that you are well on your way.\\nDropping the False Ego-Identity It is vitally important that bumped helper-souls release every aspect of the false sense of self that they were imprinted with during their traumatic childhood. This is true for all light-workers as well, even those who had good parents. A central part of the 3d incarnation mission is to transcend the ego identity formed in this lifetime and remember our real reason for being here, then take action on that mission. We didn’t come here to support the matrix of illusions and lies, to accrue fame or wealth of fiat currency.\\nWe came here to render that entire paradigm obsolete by revealing the truth of the human being, that humanity is a divine species that has been corrupted by darkness and evil, and this must be acknowledged in order to heal our species-wide trauma. We came here to transform and rebuild the fragmented DNA of our bodies, to help others to do the same, so that we can live in 3D vessels that reflect the Divine Inner Self that is our true identity. We came here to help the entire human race heal, which means healing ourselves.\\nThis is a monumental task to be sure, and those of you who were bumped have even more work to do, but you can do it. You were strong enough to choose to ride out the roller coaster of a “bumped life” and still fulfill your mission, and you maintained that strength throughout the trials and tribulations of your childhood. Tap into that strength of will, heal yourself, clear the baggage out of your subconscious mind, and begin working on your mission.\\nIf you haven’t already done so, I urge you to work with the Self-Clearing System Level 1 and Level 2 and make those clearing techniques part of your tool box. The Energy Refund and Reclaiming Energy processes should be done daily to ensure that you are not energetically wrestling with your pseudo-parents. For childhood traumas, use the “backpack of pain” process in Level 2 on a daily basis until you feel a significant, lasting shift in your consciousness. Also, use the “three galaxies” process at the end of Level 2 daily (with or without the recording) to keep your personal energy flowing smoothly.\\nYou can transcend the traumas of your past if you are determined, persistent, patient and gentle with yourself. Always remember that who you really are is far more than this one single lifetime, and that you can access the vast consciousness that is your True / Higher / Divine Inner Self to help you heal from the past. Most of all, focus on loving yourself exactly as you are right now, traumas and baggage included. Cultivate that love with your focus on the goal of being fully healed, clear and filled with the light of your true, Divine Inner Self.\\nMuch Love,\\nCameron Day\\nSource: Wake Up World \\n'"}, "time": 1742628601.3495982}