{"duration": 0.1121368408203125, "input_args": {"text": "'In Sunday’s season premiere of HBO’s “Veep,” Selina Meyer (Julia  ) is locked in a cliffhanger   tie, girding for a recount in Nevada and facing the possibility that Congress may give the presidency to her running mate and frenemy, Tom James (Hugh Laurie). But her more immediate problem is appearing in public with an enormous “stress pimple” on her face. Richard Nixon had a cancer on the presidency. “Veep” has a zit on the president. Over four seasons, “Veep,” created by Armando Iannucci (the BBC’s “The Thick of It”) has been American politics’ most obscenely funny satire, developing a feel for the war of appearances and the exquisite humiliations of Washington. By focusing on the vice presidency, the spare tire of democracy, it rendered the government small enough to drown in an acid bathtub. Its fifth season is in fine, familiar form. But something funny has happened to its context. Amid the threats, apocalypticism and ugly passions of the 2016 election, its bloodless cynicism and petty stakes are almost reassuring, like President Bartlet’s idealism was after the Clinton impeachment. This is what we’ve come to, America. “Veep” is now our “West Wing. ” As expressed through Ms.  ’s electric hunger, “Veep” is about the Sisyphean tease of being this close to power and never quite grasping it. Even when Selina became president last season, after a surprise resignation, she was already   empowered but not elected, sworn in but not ratified. In the premiere, Selina addresses the public    —   “It falls to the people to choose their president, and that is what you attempted to do last night”  —   and assembles a team to litigate the recount. (  she snaps, “I forgot to thank the voters for making our country look like a high school Spanish club. ”) The tie puts the new season in the zone of uncertainty where “Veep” thrives, a Schrödinger’s Oval Office in which Selina is simultaneously president and not president. Her toadies and allies of convenience are unsure where the power lies now, who best to suck up to. Mr. Iannucci left the show after Season 4, but while his caustic language is indispensable, it is fortunately not inimitable. The new episodes are just as amorally hilarious. When Selina needs to keep a conversation from going public, she tells her aide Amy (Anna Chlumsky) “This meeting cannot make it past the schoolbook depository. ” Amy answers, “I’m loading my gun, I’m going to the sixth floor. ” Right, Amy’s back. You remember her quitting in exasperation last year? On “Veep,” fits of principle are seasonal, like allergies. If a character wants something  —   a job, a bill, a policy  —   you can bet that thing will soon become undesirable and the character will switch positions on a dime. At the Nevada recount, Meyer staffers organize a protest when they realize that the decision they’re arguing for would go against them, they change the chant midrally. That’s democracy, but “Veep” is only nominally about politics. It’s about careerists, workaholics who marry their jobs and sleep with their phones. The closest thing to love here is the creepy filial devotion of Selina’s body man, Gary (Tony Hale). The more likely a character is to have actual feeling  —   say, Selina’s daughter, Catherine (Sarah Sutherland)  —   the more ridiculous she is. Everyone else is just a résumé with a pulse. We’ve seen joyless ambition on another show about a    “House of Cards. ” (“Veep” even has a similar story line about using a family medical crisis for a political bump.) But “Veep” makes the point more universal by making it less histrionic. Few of us can be monsters like the Underwoods, but we all have it in us to be as pathetic as the Meyer staff. It’s tempting to say that life has caught up to “Veep. ” It’s true this election shares the series’s    linguistic fixation, though “Veep” doesn’t bother with “small hands” euphemisms. A subplot in which Selina hires a grizzled recount expert (Martin Mull) echoes today’s candidates enlisting   who remember the arcane game of contested conventions. But there’s a piece missing: the fury, resentment and zealotry driving the real election. They may exist in “Veep,” but they’re somewhere offscreen, out in   . That none of the Beltway lifers in “Veep” believe in anything is not exactly unrealistic, but it’s also oddly comforting. They may be the worst, but at least they lack all conviction. For the dangers of passionate intensity, watch “Game of Thrones,” which returns for its sixth season an hour and a half earlier on Sunday. Beyond its derrières and dragons, “Thrones” has been an astute study of power politics and flexible alliances. (Give Littlefinger 30 minutes on the convention floor in Cleveland and he’d be picking out the White House drapes.) A story line from last season feels especially prescient today. (HBO has kept the new episodes locked in its own Iron Bank.) After years of war, a   religious movement has emerged in Westeros, led by the High Sparrow (Jonathan Pryce). The Queen Mother Cersei Lannister (Lena Headey) in need of allies, raises him to High Septon of the Faith of the Seven, restoring the church’s private military in hope that he will use it against her enemies. He does  —   but then his puritans turn on the corrupt ruling class, including Cersei. Not unlike certain party establishments, Cersei believed the High Sparrow’s   base could be useful as long as she harnessed its rage for her purposes. She ended the season its prisoner, paraded nude before a jeering, misogynist crowd by a holy woman chanting “Shame!” Her final hope for vengeance lies in the brawny form of a mysterious, unspeaking knight whose face is hidden by armor. (Paul Ryan? Is that you?) All analogies break down, of course. Donald J. Trump may be a populist insurgent, yet he shares the establishment Lannisters’ taste for gold. But between these two series, you can assemble something like a full sense of our political moment. Come to “Game of Thrones” for the shame. Stay through “Veep” for the shamelessness.'"}, "time": 1742564181.5926645}