{"duration": 0.05454754829406738, "input_args": {"text": "'PETA (People for the Ethical Treatment of Animals) has reportedly produced a fake animal abuse video to “raise awareness” of the issue online. [“The animal rights group has produced a disturbing new video that depicts a cat suffering at the hands of its owner. It’s difficult to watch. It’s also completely fake,” reports Mashable. “But it looks real it is a skilled CGI work clearly meant to deceive viewers. Now, PETA is trying to enlist complicit media organizations to knowingly publish the fake video in an effort to make the lie go viral. ”  “Through this marketing effort, PETA is trying to convince the media to report and share a fake video as if it’s real, in hopes of deceiving the public to create manufactured outrage,” Mashable continued. “As animal lovers, this is offensive. As a media outlet with a responsibility to truthfulness, this is unethical. As people with basic moral values, WTF?” Mashable claims PETA’s involvement in the fake video is shown in a    clip that was also emailed to them by a public relations firm allegedly working with the animal activists: What we’d like to do is have Mashable debut this video of a cat, created with   imagery (CGI) being abused, which will have been planted on YouTube anonymously by the ad agency who created it for PETA. Your posting of the provocative piece would simply be to acknowledge that it’s in circulation  —   not to make any claims about its authenticity.   …     When the video has drawn the critical response and the number of views we’re anticipating (ideally, into the millions) we would then have you reveal to the world that the cat was NOT harmed, but was actually created with CGI by posting this    video. It reveals the reasons for the creation of the first video and asks people to avoid circuses that use lions, tigers, or any other live animals. Mashable called the plan to create a viral video “wrong and irresponsible,” while one Twitter user called them “unethical” for the trick. “Anyone surprised?” asked Daily Mail U. S. political editor David Martosko on Twitter. Anyone surprised? https:  .   —   David Martosko (@dmartosko) June 7, 2017,  “PETA is pitching literal fake news because PETA is terrible,” added BuzzFeed reporter Tyler Kingkade. PETA is pitching literal fake news because PETA is terrible https:  .   —   Tyler Kingkade (@tylerkingkade) June 7, 2017,  PETA has previously faced criticism for deceptive tricks, including the time they hired musician Jona Weinhofen to hold a fake plastic sheep covered in blood in a deceptive attempt to turn people against sheep shearing. The image was refuted by sheep farmers, with one claiming, “In two decades of living on a sheep farm, I have seen nothing resembling the images put forward by Peta in its campaign against the wool industry. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742562094.745555}