{"duration": 0.04456591606140137, "input_args": {"text": "'Pussy Riot Released The Perfect Nasty Woman’s Answer To Trump (VIDEO) ‹ › RWNJ Says Trump Didn’t Grope Women Because ‘He’s One Of The Handsomest Billionaires That’s Ever Lived’ By Andrew Bradford on October 27, 2016 Subscribe \\nIt’s so much fun to watch as various right-wing morons and evangelical Christians attempt rationalize and even excuse the words and behavior of Donald Trump, who freely admitted that he enjoys sexually assaulting women by kissing them and grabbing their crotches against their will. Had a Democratic candidate done the same, they would be standing atop every high hill they could find and shouting that it was the end of the world and human morality. \\nNow we have wackobird conspiracy theorist Wayne Allyn Root weighing in on the matter, and the reason he gives Trump a pass on the sexual assault is because he says there’s just no way it could have happened because Trump is too handsome to have committed such an act. \\nAppearing on the “The Real Side” radio show, Root laid out this line of bullcrap : “If you’re a Christian, you just can’t spend your life worrying about the words of Donald Trump from 11 years ago or what women he groped 30 years ago. I don’t believe any of it anyway. I believe Donald Trump is one of the handsomest billionaires that’s ever lived; I don’t think he ever had to grope a single woman ever. I think they threw themselves at him, so it’s all a lie.” \\nYeah, because a handsome man would never ever force himself on a woman. Are you kidding me?! Root then went on to add : “The man isn’t a perfect Christian, but he’s the perfect guy sent from God and from central casting to be the vicious guy we needed to save America, save capitalism, fight the Clinton crime cartel and save Christianity from these vicious, vicious people. They’re terrible, dirty people and a nice guy could have never won this war. Only a dirty player could win the war, so I think Donald’s the perfect guy, sent by God to fill the perfect role and save us all.” \\nThere actually are no perfect Christians; that’s kinda the point of that whole Jesus died for your sins thing, Wayne. And if you think a person as vile and perverted as Donald Trump was sent by God, then clearly you don’t know this line from the Bible: “And again I say unto you, It is easier for a camel to go through the eye of a needle, than for a rich man to enter into the kingdom of God.” ( Matthew 19:24 ) \\nHere’s Root proving his own ignorance: \\nFeatured Image Via OSGA About Andrew Bradford \\nAndrew Bradford is a single father who lives in Atlanta. A member of the Christian Left, he has worked in the fields of academia, journalism, and political consulting. His passions are art, music, food, and literature. He believes in equal rights and justice for all. To see what else he likes to write about, check out his blog at Deepleftfield.info. Connect'"}, "time": 1742628408.2093558}