{"duration": 0.026608943939208984, "input_args": {"text": "'Jerusalem (AFP)  —   Israeli ministers have approved measures aimed at improving the Palestinian economy and facilitating crossings, rare moves said to be at Donald Trump’s request hours ahead of the US president’s arrival.  An Israeli official told AFP on condition of anonymity that ministers were responding to a Trump request to present him with “  measures” ahead of his talks with Palestinian president Mahmud Abbas on Tuesday. In a statement, Trump’s administration welcomed the moves, saying he “has been encouraging both sides to take steps that improve the environment for peace making. ” “He has expressed particular interest in taking steps to improve the Palestinian economy in the West Bank and Gaza Strip. ” In what the Israeli official described as a “gesture for Trump’s visit, which does not harm Israel’s interests” Prime Minister Benjamin Netanyahu’s security cabinet on Sunday approved the enlargement of a Palestinian industrial zone on the edge of the southern West Bank. He said that the possibility of extending Israel Railways services to the northern West Bank city of Jenin would also be examined. They also gave the nod to streamlining transit procedures at Shaar Ephraim, a busy crossing point in the northern part of the occupied West Bank for Palestinian labourers with permits to work in Israel. The official said that opening hours for passage across the main Jordan River bridge linking the Palestinian territory and the neighbouring kingdom were to be extended to  . There would also be reforms to Palestinian land use in urban areas in the 60 percent of the West Bank under full Israeli control. He did not elaborate but Israel’s Haaretz daily said the intention was to allow construction of “thousands of Palestinian homes” in the area where for years it has been almost impossible for Palestinians to get Israeli permits to build on their own land. Haaretz said that at Sunday night’s meeting Education Minister Naftali Bennett and justice minister Ayelet Shaked, of the   Jewish Home party, “objected vehemently” to the building plans. In an apparent attempt to calm opposition from within Netanyahu’s coalition government, seen as the most   in the country’s history, the security cabinet also approved setting up a committee to work for retroactive legalisation of wildcat Israeli construction in the West Bank, the official said.'"}, "time": 1742561813.4120576}