{"duration": 0.2489941120147705, "input_args": {"text": "'Email \\n+ Hillary Clinton is in no danger of losing the election and never has been. She could speak freely about the injustices being done to native people and native land in North Dakota. But she has remained “comfortably dumb” about the Dakota Access Pipeline. Her silence indicates her true position, which we already know from the Wikileaks documents. Anyone who believes otherwise is, to use the Clinton team’s own word, a “loser.” \\n+ HRC has already been endorsed as an eco heroine by every major green group in the country, which, naturally, means after taking office she can frack away with impunity. \\n+ Yesterday, police culled from across North Dakota encircled the encampment of tribal people protesting the Dakota pipeline. Outfitted in military gear, armed with assault weapons and backed by armored personal carriers, drones and helicopters, the police raided the camp, firing concussion grenades into the crowds, dousing people with pepper spray, shooting them with rubber bullets, savagely beating people with police clubs (baton is too dainty of a word.) In all, more than 140 protesters were arrested on fallacious charges of criminal trespassing and rioting. The riot was all the doing of the cops and the pipeline company. Dozens of protesters were injured, some seriously. The raid continues this morning, as does Hillary’s silence. \\nMeanwhile, in a federal court-room in Portland, Oregon, the armed militants who seized the headquarters of the Malheur National Wildlife Refuge last year, held it for 48 days, threatened federal officials and local residents and did more than $6 million worth of damage to the site walked free, acquitted of all charges. \\nRarely have the hypocrisies of the American justice system been revealed more vividly. White privilege in action. \\n+ The bosses of organized labor continue to disgrace themselves and their unions by their support of the pipeline company and its brutal tactics. This week Terry O’Sullivan, head of the Laborers’ International Union of North America, lashed out at unions that opposed the pipeline, calling them “bottom-feeders.” O’Sullivan also smeared tribal protesters as “THUGS.” \\n“The facts are on our side, yet in the past month, we have witnessed vocal opposition from groups, including some self-righteous unions, who know little about the project and have no job equity in it,” O’Sullivan wrote to his members. “These unions have sided with THUGS against trade unionists. They are a group of bottom-feeding organizations that are once again trying to destroy our members’ jobs.” \\nIs it any wonder big labor is in decline? \\n+ Do black lives matter to Black Lives Matter, Inc? \\nThe answer to that question probably depends on how you view DeRay Mckesson. Is the high profile activist the real power behind BLM or a self-anointed figurehead, angling for the spotlight? \\nRegardless, Mckesson has now endorsed Hillary Clinton for president, a move which is as predictable as it is crippling for the movement with which he is aligned. “Her platform signals both deep understanding of the challenges and a plan to move us forward,” McKesson wrote. “When I met with her last week, it was clear that she now understands these issues well at a policy level and that she has researched the implications of the positions that she has proposed.” \\nIn exchange for a little face time with Hillary, Mckesson is willing to overlook or dismiss Clinton’s description of black youths as “super-predators,” her fanatical support for the racist Clinton Crime bill, her unapologetic backing of the awful welfare reform law pushed through Congress by her husband, her mercenary actions in Haiti, her bombings of brown and black people around the globe, her continued support for the death penalty as the rest of the nation finally turns against this vile form of punishment, her stubborn opposition to drug decriminalization and her constant hectoring about family values and personal responsibility, coded language for deprecations about the black family. \\nThe Clintons have long mastered the technique of capturing the support of those battered precincts of American society on which they have inflicted the most damage. They expect that black support is in the bag, that blacks, like environmentalists and Hispanics, have no where else to turn, that their leaders will intoxicated by the merest nod of recognition in the waiting line. They are assured that the displaced and oppressed will vote for Clinton regardless of her record Like so many other social justice groups before them, Black Lives Matter is treated by the Clinton machine as just another prop which they can manipulate almost at will for their political advantage. \\nA Wikileaks document shows how this kind of stagecraft works in practice. On January 16 of this year, Jake Sullivan, one of Hillary’s top advisors, emailed Hillary and John Podesta draft language for Hillary to apologize for her rancid description of young black men as “super-predators.” This racist statement, which had never been retracted over the last 20 years, would have been fatal for nearly any other candidate. \\nHere are the tepid words Sullivan proposed putting in Hillary’s mouth: \\nLooking back, I shouldn’t have used those words. \\nIt’s unfortunate because my life’s work has been about lifting up children and young people who have been let down by the system or society. Kids who never got the chance they deserved, especially in African-American communities. We haven’t done right by them. We need to. We need to replace the school to prison pipeline and replacing [sic] it with a school-to-college pipeline. \\nAs an advocate, as First Lady, as Senator, I was a champion for children. And my campaign for president is about breaking down the barriers that stand in the way of these kids, so that every one of them can live up to their God-given potential. \\nNow that’s pretty dull pablum and doesn’t even approach being a real apology. But what’s really interesting here is the timing. The non-apology apology was crafted on the 21st with the advance notice of a planned Black Lives Matter protest at Hillary’s fundraiser on January 24th. The “apology” is publicly released the next day, on the 25th, as if it were an organic response to the Black Lives Matter protest. All theater. \\nAs with climate change and economic inequality, the subject of racial justice in America has largely vanished from the scripts of Hillary’s stump speeches, the platform, venerated by Mckesson, is already moldering away in some vault at the National Archives. Do black lives matter to Black Lives Matter, Inc.? Of course, they do. But they don’t matter to Hillary Clinton and no one should believe for a moment that they do. \\n+ Jake Sullivan, by the way, is married to Beltway insider Maggie Goodlander, who sharpened her knives as a speechwriter for Joe Lieberman and now toils as a “senior advisor” to John McCain. Do you really think either Sullivan or Goodlander believe anything they write? \\n+ HRC backs the coup in Honduras. The new junta begins jailing and killing workers, trade unionists, human rights activists and native people. State Department funds the slaughter. The Nation magazine and Michael Moore avert their eyes. \\n+ If you ever feel the need to purge your lunch, no need to thrust your finger down your throat, just watch Michael Moore’s latest film, Trumpland, where he slobbers all over photos of the young Hillary Clinton. \\nMoore has been love with Hillary since the 1990s, but his once secret passion has suddenly erupted orgasmically on the screen. Trump’s perv-talk with Billy Bush is less nauseating than Moore’s vapid mewling about Hillary. \\nHere are a few gems from Moore’s embarrassing recent performance on MS-DNC’s “Hardball with Chris Matthews”: \\n“I’d rather Hillary be the nominee than Bernie.” \\n“Hillary may not be [a socialist], but she’s a Christian and that’s the same thing.” \\n“Hillary won’t harm the children, she won’t harm the planet.” \\nWhere’s Charlton Heston when you need him? \\n+ As far as he knows, Bill is still “dicking bimbos” in Chappaqua and Hillary continues to blame him for advising her on how to shield her e-mails from the prying eyes of the press. But none of that matters. They are members of the same cult, baptized in the blood of Iraq. Thus Colin Powell endorsed Hillary for president this week, one lying war criminal saluting another. \\n+ Tom Hayden, former SDS hotshot turned Clinton supporter, died this week. In Hayden’s FBI file, J. Edgar Hoover instructed his agents: “One of your prime objectives should be to neutralize him in the New Left movement.” In the end, Hayden neutralized himself. \\nI was never a huge Tom Hayden fan. My allegiance was to the Panthers and the Yippies: Stew Albert, Judy Gumbo, Abbie and Anita Hoffman, Nancy Kershaw, all of whom became friends over the years. In fact, in our last conversation Hayden asked me “why do you hate me so much?” This was just after his slavish endorsement of Hillary. That said, Jim Kavanagh , a former SDS organizer, recalls that Hayden did publicly confess his regrets about one of his most ignoble retreats, the one that led him into the arms of the Israel lobby–a mea culpa we ran on CounterPunch. \\n+ Alexander Cockburn on Hayden, from the Village Voice in 1982: “In the halls of the national gallery in Washington there are 46 portraits of Benedict Arnold. None look alike, yet they all resemble Tom Hayden.” \\n+ The New York Times doesn’t have a comics page. For laughs we have to turn to its editorials. This week we were treated to a real howler, Jonathan Rauch’s essay on “ Why Hillary Needs to be Two-Faced ,” in which Rauch argues, laboriously, that Hillary needs to deceive the electorate in order to enact policies for the “good” of the nation. But doesn’t the moral measure for “getting things done” depend entirely on who they’re done to (the poor) and who they are done for (Wall Street)? \\n+ Perhaps the decline in humaneness in politics is driven in part by a decline in the humanities in academia… \\n+ Oregon’s self-styled “progressive bisexual” governor, Kate Brown, has now endorsed the TPP. I think Congress pushes it through in the lame duck session after the election, though if the GOP had any brains, and it doesn’t, they’d wait until after HRC takes office and force her to publicly lobby for its passage. \\n+ Speaking of the Nanny State, 35% of the tax revenues from Oregon retail marijuana sales go toward funding……. the police . \\n+ California seems poised to legalize the sale and possession of marijuana. This move can’t come soon enough. Even though the Golden State began decriminalizing the use of pot in 1998, there have been more than 500,000 marijuana-related arrests in California the last 10 years alone. \\n+ Jeff Gerth is a former investigative journalist with the New York Times, who now writes for Pro Publica. Gerth has broken a lot of big stories in his career, including the Whitewater scandal, but his prose is so opaque and his narrative gifts so limited that few people have ever understood the import of his pieces, not even his editors. If a politician wanted to bury a scandal, all they really had to do was it leak it to Gerth, who would write it up in his muddled way and it would all be forgotten by the next morning. \\nThe Wikileaks emails have a fascinating back-and-forth between Gerth and Podesta about the Clinton Foundation. If the Clintons had any sense, they would have dumped the whole matter into Gerth’s lap. Instead, Gerth writes Podesta to alert him to the fact that another reporter is onto the story: \\nAre you aware of a forthcoming–in a few days–massive examination of the Clinton Foundation by a conservative financial analyst? My understanding is that it raises questions about the foundation’s financial reports and its shift into areas–AIDS, for example–that exceeded its original authorization from the IRS. I’m not writing anything about it but curious if you have heard anything? \\nHow Podesta’s hopes must have wilted at that last sentence. \\n+ Watching MSDNC talking heads, like Chris Hayes and Rachel Maddow, dismiss the latest Clinton Foundation scandals reminds me of the BP press team spinning Deepwater Horizon. \\n+ Joe Biden was on MSDNC this week quoting the racist sociologist Charles “Bell Curve” Murray favorably. Biden told Chris Matthews that he made “my boys” take the quiz on white alienation in the back of Murray’s rotten book, Coming Apart: the State of White America. Should we be surprised? As chief author of the Clinton crime bill, Biden transformed Murray’s theories into vicious policies. \\n+ Lyin’ Hillary gets refreshingly honest for a moment: “I’m proud to have the support of real billionaires.” \\n+ Utah Rep. Chris Stewart compared Trump to Mussolini, and even though Trump falls a little short of the gold standard (i.e., Hitler), Stewart now says he’s going to vote for the authoritarian mogul any way. \\n+ Bernie Sanders says that he’s prepared to be a liberal thorn in Hillary’s side after she’s election. Being a socialist thorn in her side, alas, would prove a little too prickly, I suppose. \\n+ The Clinton campaign have shown Sanders no such consideration. Apparently, Clinton operatives have been stalking Sanders for much of the last two years. They even snapped a photo of Sanders sunbathing at an elite club in Martha’s Vineyard. The photo was sent to John Podesta by former Bill Clinton aid Tina Flournoy. A few days later the campaign leaked the photo to gossip blogger Perez Hilton, who posted the photo on his site, quipping that Sanders was lounging after having raised Wall Street money for the Democratic Senate Campaign Committee. \\nThe Clintons wanted to embarrass Sanders, but it just proved that he has a pretty good body for his age. \\nThis is the same creepy tactic the Clinton campaign used against Obama in 2008, when they leaked a photo of Obama in traditional Somali garb. \\n\\n+ One state, under surveillance, divided by wealth, with liberty and justice for those who pay… \\n+ What’s really driving the national debt? America’s imperial boot print: $6 trillion and counting for the wars in Iraq and Afghanistan. With more than 800 military bases around the world, nearly half of the federal tax goes for military spending. Running out of enemies to fight? Wait a few minutes, we’ll create some new ones. \\n+ Clinton condemned Trump’s critique of the US military strategy in Mosul as “wrong” and “dangerous.” For HRC, any criticism of US foreign policy is “dangerous,” but not nearly as dangerous as the policy itself. \\n+ Israel’s politicians make Trump and Clinton seem almost sane by comparison. Check out the latest depraved boast from Israeli Defense Minister Avigidor Lieberman who announced, apropos of nothing, that Israel’s next war on Gaza will be its last “ because we will completely destroy them .” \\n+ NFL viewership is down, way down . Good. I’ve long thought that the sadistic joy NFL fans take from watching talented young black men inflicting brain damage on each other is an appalling metaphor for the dumbing down of American society. \\n+ Fragment from a dream last night: HRC moves into White House, notices an empty space on the wall of the Oval Office. Turns to Huma. Points. “Let’s put Qaddafi’s head there, shall we?” \\nSound Grammar'"}, "time": 1742563408.1837487}