{"duration": 0.22479724884033203, "input_args": {"text": "'The 59th annual Grammy Awards kick off Sunday night at 8 p. m. Eastern live from the Staples Center in Los Angeles, California. [Beyoncé leads all artists with nine nominations, including for Album of the Year for her Black Lives   album Lemonade, though she will face stiff competition from British superstar Adele in several of the night’s top categories.  Singer Rihanna and rappers Drake and Kanye West are up for eight nominations apiece. Late Late Show host James Corden is set to MC the proceedings. Meanwhile, producer Ken Ehrlich has indicated that artists could get more political with their acceptance speeches than usual. Follow along with the Breitbart News livewire as the Grammys get underway in Los Angeles. All times Pacific. Latest updates at the top.   8:45 P. M.  —   Well, that’s a wrap on the  . Stay tuned to Breitbart’s Big Hollywood for   coverage and more from music’s biggest night. Good night.     8:40 P. M.  —   Well, she’s done it. Adele picked up Album of the Year for 25. In the “Adele vs. Beyoncé battle” that the music press spent the last couple months pushing, that’s a decisive win for Adele. In her acceptance speech, a tearful Adele called Beyoncé’s album “monumental” and appeared to drop another   leading to another dead air pause from CBS. Adele wins Album of the Year, dedicates it to Beyonce: ”I can’t possibly accept this award.” #GRAMMYs pic. twitter.   —   Hollywood Reporter (@THR) February 13, 2017,  8:35 P. M.  —   Adele wins again, this time for Record of the Year for “Hello. ” That’s two big wins over Beyoncé so far. A win in Album of the Year would complete the British singer’s sweep. Stay tuned  …    . 8:28 P. M.  —   The Grammys pay tribute to the musicians lost over the past year with an “In Memoriam” segment hosted by John Legend and Cynthia Erivo. Legend and Erivo perform a poignant rendition of the Beach Boys’ “God Only Knows. ” We honor those we have lost in the music community this year: https:  .  #GRAMMYs pic. twitter.   —   Recording Academy (@RecordingAcad) February 13, 2017,  8:24 P. M.  —   Recording Academy President Neil Portnow calls on President Trump and Congress to uphold the country’s commitments to the arts. The industry may be afraid that Trump will get rid of the National Endowment for the Arts, as it was reported he might do last month. 8:20 P. M.  —   James Corden teases that Kanye West will present at the show and for a second, it seems like the broadcast could take a turn for the more entertaining  …     Alas, Corden introduces Recording Academy President Neil Portnow. 8:12 P. M.  —     winner tonight Chance the Rapper performs with the backing of a full orchesta. 8:08 P. M.  —   Pentatonix* just wrapped an impressive a capella version of the Jackson 5’s “ABC. ” Three hours in and the show feels very long. Could have done with fewer performances three hours would be a good length for the show. As it is, probably around 40 minutes left to go tonight. *Pentatonix, not Little Big Town. Like I said, the show’s length is taking its toll. 7:50 P. M.  —   A reunited The Time and Bruno Mars take the stage to perform a   tribute to Prince. Full video when the performance is wrapped. This is a fitting tribute to Prince, especially with Mars in full purple getup. Immeasurably better than Madonna’s horrific attempt at the same tribute at last year’s Billboard Music Awards.  7:39 P. M.  —   Busta Rhymes joins the surviving members of A Tribe Called Quest for a tribute to Phife Dawg, who died last year. Busta goes off on Trump, calling him “President Agent Orange” and accusing him of “spreading hate” throughout the world. More on this here. 7:36 P. M.  —   Adele wins Song of the Year for “Hello,” beating out fellow frontrunner Beyoncé’s “Formation. ” “First of all, I really do apologize for swearing,” the singer says, explaining that she wanted to get the performance just right to honor the memory George Michael. 7:25 P. M.  —   Tori Kelly, Little Big Town, Andra Day and Demi Lovato perform a tribute to the  .  7:15 P. M.  —   Album of the Year nominee Sturgill Simpson performs a collaboration with the   the backing band for the late soul singer Sharon Jones, who died last year after a battle with cancer. 7:09 P. M.  —   Fresh off of her Super Bowl halftime show, Lady Gaga teams with Metallica for a performance of, well, not really sure yet. But James Hetfield seemed to be having trouble with his mic. Video shortly. A pissed off James Hetfield tosses his guitar 😡😡😡😡😡 #Metallica #GRAMMYs pic. twitter.   —   Troy Hughes (@TommySledge) February 13, 2017,  7:04 P. M.  —   Chance the Rapper wins Best Rap Album for Coloring Book. As he did with his first win of the night, he thanks God. 6:50 P. M.  —   As Roger Friedman reported this afternoon, Adele is back to perform George Michael’s “Fastlove. ” Wow. CBS bleeps out Adele during the performance as the singer swears and is forced to restart the song after a rocky start. Full video coming shortly. Other than the initial flub, Adele sounded much better on this one than in her   “Hello. ” Full video: Watch Adele’s tribute to George Michael in full here: pic. twitter.   —   Adele Daily (@AdeleDailyInfo) February 13, 2017,  “I’m sorry, I can’t mess this up for him. ” 6:45 P. M.  —       Maren Morris performs “Once” alongside Alicia Keys. 6:36 P. M.  —   Beyoncé wins Best Urban Contemporary Album for “Lemonade. ” 6:33 P. M.  —   Gary Clark, Jr. and William Bell perform a bluesy “Born Under A Bad Sign” in one of the night’s better performances.  6:33 P. M.  —   James Corden gets in another quick jab at Trump with a bit about   during the show. #GRAMMYS @JKCorden jokes: ”Any fake tweets you see are not real tweets. The negative tweets are fake.” https:  .  pic. twitter.   —   Hollywood Reporter (@THR) February 13, 2017,  “Any fake tweets you see [on the bottom of the screen] are fake news!” he says, as apparently   negative tweets float by on the screen, including a fake one from Trump himself. 6:30 P. M.  —   Katy Perry delivers the first real onstage political statement by wearing a sparkly armband reading “Persist”* on her right arm during the performance of her new song, “Chained to the Rhythm. ” *From where I was sitting, it looked like the armband had said “Resist. ” Chained to The Rhythm  —   Katy Perry Feat. Skip Marley (At the #GRAMMYs) pic. twitter.   —   Katy Perry Activity (@KatyActivities) February 13, 2017,  6:28 P. M.  —   Little Big Town introduces Katy Perry by singing a few bars of “Teenage Dream. ” 6:16 P. M.  —   After an   performance of “Sweet Caroline” featuring Corden, Keith Urban, Neil Diamond, Blue Ivy Carter and a bunch of others from a cardboard cutout car, Bruno Mars performs “That’s What I Like” backed by a band and a chorus of backup singers. #GRAMMYs: @JKCorden brings Neil Diamond, @JLo, @JohnLegend and Blue Ivy together for ’Sweet Caroline’ Carpool Karaoke. pic. twitter.   —   Hollywood Reporter (@THR) February 13, 2017,  6:10 P. M.  —   Maren Morris wins Best Country Solo Performance for “My Church. ” “Thank you to the Recording Academy  …    ” 6:04 P. M.  —   One hour into the    broadcast and there’s been very little in the way of overt partisan political commentary so far, apart from Corden’s   jab at Trump in his opening routine. Then again, there’s still two hours to go  …     5:54 P. M.  —   A very pregnant Beyoncé takes the stage for a trippy performance of “Love Drought” and “Sand Castles. ” The performance apparently incorporates   footage along with some impressive live choreography. Beyoncé herself is taking it easy with the dance moves. Full video: 5:51 P. M.  —   Lukas Graham performs his massive hit “Seven Years. ” 5:44 P. M.  —   David Bowie wins Best Rock Song for “Blackstar. ” “Like all musical heroes, his music is forever,” the presenters say in accepting the award on his behalf. That’s now 5 posthumous Grammys that Bowie has won tonight. 5:38 P. M.  —   James Corden copies Twenty One Pilots and introduces Ed Sheeran without his pants on. Sheeran performs his new song “The Shape of You” by himself, using an   looping rig to provide his own backbeat. The    could become the first artist in Grammy history to win Song of the Year two years in a row if he wins for “Love Yourself. ” 5:31 P. M.  —   Twenty One Pilots wins the Grammy for Best Pop   Performance for “Stressed Out. ” Before accepting the award, the duo take their pants off before they take make their way onto the stage. Guys you really don’t have to do this #GRAMMYs pic. twitter.   —   Mashable (@mashable) February 13, 2017,  5:25 P. M.  —   Keith Urban and Carrie Underwood take the stage to perform “The Fighter,” which is most definitely not a country song. John Travolta introduces them as the most dynamic duo since “Danny and Sandy. ” So glad they kept Daft Punk on stage to play   Keith Urban and Carrie Underwood. #GRAMMYs,  —   New Slang (@_NewSlang) February 13, 2017,  5:17 P. M.  —   The Weeknd performs “  Feel It Coming” with Daft Punk, in all their   glory. We don’t remember this part in #StarWars. #GRAMMYs pic. twitter.   —   Entertainment Weekly (@EW) February 13, 2017,  5:14 P. M.  —   Chance the Rapper wins Best New Artist in a crowded field for the night’s first award. “Glory be to God. I claim this victory in the name of the Lord,” the rapper says in his acceptance speech. “I wanna thank God for my mother and my father who supported me when I was young. ” 5:10 P. M.  —   Host James Corden takes the stage and it’s ten minutes into the show before we get our first jab at Donald Trump. During a rapping bit, Corden mentions, “With President Trump, we don’t know what happens next. ” . @JKCorden: ”Live it all up because this is the best and with President Trump we don’t know what comes next” #GRAMMYs pic. twitter.   —   Hollywood Reporter (@THR) February 13, 2017,  5:00 P. M.  —   Adele kicks off the show with her massive hit song “Hello. ” . @Adele opens up the show with a performance of ”Hello.” #GRAMMYs pic. twitter.   —   The FADER (@thefader) February 13, 2017,  4: 50 P. M.  —   Johnny Stevens from the rock band High Suspect (nominees for Best Rock Song) makes a   statement by wearing a jacket with the word “Impeach” stenciled on the back: 4: 40 P. M.  —     Green has arrived at the ceremony: that exploding phone was apparently  ’s supervillain origin storypic. twitter.   —   Al Shipley (@alshipley) February 13, 2017,  4:30 P. M.  —   Showbiz 411’s Roger Friedman reports that Adele will open the show and will perform the tribute to late British pop star George Michael, with the song “Fastlove. ” The evening is also expected to include a tribute to Prince featuring a reunited The Time and Bruno Mars. 4:25 P. M.  —   Early winners on the night include Adele (Best Pop Vocal Album for 25 and Best Pop Solo Performance for “Hello”) Beyoncé (Best Music Video for “Formation,”) Sturgill Simpson (Best Country Album for A Sailor’s Guide to Earth) and Drake (Best Rap Song and Best   Performance for “Hotline Bling. ”) The late pop icon David Bowie also won four Grammys Sunday (Best Alternative Album, Best Rock Performance, Best Recording Package and Best Engineered Album,  ) for his final studio album, Blackstar. Other early winners include Patton Oswalt (Best Comedy Album) The Beatles: Eight Days A Week, The Touring Years (Best Music Film) and Star Wars: The Force Awakens (Best Score Soundtrack). 4:15 P. M.  —   Singer Joy Villa made an early splash on the red carpet Sunday evening by donning a   “Make America Great Again” dress, in an apparent show of support for President Donald Trump.   Follow Daniel Nussbaum on Twitter: @dznussbaum, Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742564337.0953498}