{"duration": 0.05119442939758301, "input_args": {"text": "'People in cities other than Delhi spray Fog deo all over to get media attention Posted on Tweet (Image via hindustantimes.com) \\nDesperate to get media attention over the rising pollution levels in their areas, citizens in cities like Patna, Gwalior Allahabad and Raipur are spraying Fog deo all over in hope that someone will pay close attention to their woes as well. \\n“We have been watching non-stop coverage of the unprecedented pollution levels in the national capital for a few weeks now. But what people don’t realize is that our cities are polluted too. Nobody talks about this because we don’t live in Delhi,” said a Patna citizen coughing but not giving up before completing the sentence. \\nA person who regularly travels to Gwalior was not optimistic that spraying deodorant all over the city will get the media attention. But he saw a silver lining in the artificial cloud. “I hate visiting Gwalior because my in-laws stay there. But the Fog deo now sprayed all over gives the city a new odour and I like it. There you go, finally, a good reason for me to visit my wife’s city.” \\nPeople of Allahabad too have been shocked as the ‘city of prime ministers’ has been neglected by the media when it comes to air pollution. “The only time our city and the state gets eyeballs is when there is infighting in the family of the party that rules us. When will the media realize that the pollution in UP too is going UP?” \\nA dejected Raipur citizen said that one day he hopes his city too is placed on the pollution map of the country. “One day, I wish to see a special broadcast on prime-time news shows on the pollution levels in my city.” \\nWhen asked what else was happening in the city apart from air contamination, the person replied, “Bas, Fog hi chal raha hai. (Duh! Fog is in the air.)” Tweet About Amrut Thobbi \\nAmrut Thobbi is an editor by profession, satirist by heart and useless as a person. You can follow him at @amrutti on Twitter or Amrut Thobbi on Facebook. He blogs here'"}, "time": 1742562330.3394146}