{"duration": 0.2097334861755371, "input_args": {"text": "'Waking Times \\nBrowsing through history, it’s very clear that the world has undergone many monumental shifts in society that have uprooted it’s very foundation in place of new seed. \\nA paradigm shift is a fundamental change in approach or underlining assumptions. For example, when Pythagoras proposed that the Earth was round instead of flat, the foundation of science and people’s understanding of the world was completely changed. Similarly, when the Industrial Revolution took place there was a complete shift in manufacturing, lifestyle, and economics. \\nA paradigm shift can literally shake a society to its core, taking it off its current path and putting it on a brand new one. Though it might appear the opposite in the corporate controlled mainstream news, it appears that the entire world is in the very early stages of a paradigm shift. These shifts take place in many of the worlds most basic elements and redefine how life functions. \\nHere are 8 signs the world is undergoing a paradigm shift: 1. The Power of the Internet and the Age of Information \\nThe Internet is arguably the greatest invention in the history of man. Never in our known history has man had access to such a broad range of diverse information from all over the world at the tips of his fingers. Many forget that the Internet has only really been commercialized in the west since the early 1990’s and its spread across the world hasn’t even come close to peaking yet. The Internet is undoubtedly giving rise to the Age of Information as people become more awake to what’s really going on in the world. \\nA multitude of information is now accessible if one knows where to look. People can now learn new skills or hear different versions of the truth in mere minutes. The Internet is not only giving rise to an open access of information, but communication is almost instantaneous all over the world. It is paramount that the Internet remain an open decentralized system in which everyone can freely add and operate if this paradigm shift is to continue. It feeds almost all other shifts. 2. The Ascent Of the Independent Non-Corporate Online Media \\nThanks solely to the Internet, the rise in independent journalism has taken off. Alternative media has become an increasingly popular choice for those wishing to stay truly informed, especially younger generations. People are continually switching off cable news ( cable TV all together ), and instead resorting to online sources. While mainstream news is still the number one source of current world events for the masses, the tide is slowly changing as people are awakening to the fact that corporate sponsored media is mostly propaganda and half-truths. \\nWar is becoming much harder to justify as independent journalists have shined the light on what the powers that be never wanted anyone to see. A prime example is the conflict in Syria in which the establishment, despite the lack of popular support, so desperately wanted to start a war that when the rebels they were funding used chemical weapons, it was then blamed on the Assad government to protect their investment and design. Thanks to independent journalists, a war has so far been averted since it was revealed that the U.S. was in bed with the rebel groups and it was the rebels who used the chemical weapons . This new faction of journalism will give peace a legitimate chance as all dirty laundry is now being aired and corrupt alliances exposed. This in turn has allowed many people to deprogram from the countless media they have taken in over the years and see the world through a clearer lens in which the truth is more evident. 3. A Global Monetary Reshuffling \\nThough it will never be broadcast on mainstream news, the real threat of a U.S. dollar collapse as the world reserve currency is very real. The paradigm of central bank controlled economies that can issue credit and zero percent interest rates through nearly unlimited printing of money backed by nothing is an illusion that is beginning to break down. It’s not just the U.S. dollar that’s under threat, but many other central currencies such as the Euro and Yen. Massive equity bubbles are being blown up by this cheap credit along with massive debt that will be nearly impossible to pay back with the current economies in which only the very elite benefit. \\nMany countries are waking up to the fact that, like all other bubbles, these bubbles will burst and they are beginning to break away from the dollar. Examples include the buildup of a new central bank in the emerging economy of the BRICS group, the countless countries passing trade agreements in which bypassing the U.S. dollar (including agreements in oil), and the persistent selling of treasury stocks by the Chinese government who quite often are the last resort buyer of U.S. debt. Not only has there been a shift in the pecking order of fiat paper currencies, but decentralized crypto-currencies like Bitcoin are threatening the very system of fiat money and the centralized control a select few elite have on that system through central banks. This would shift power worldwide. 4. The Rise of the Peer-to-Peer Economy \\nA Peer-to-Peer (P20) Economy is a de-centralized model whereby two individuals interact to buy or sell goods and services directly with each other, without intermediation by a third-party, or without the use of a company or business. We see this being used by companies like Air BnB, Uber, Craigslist, Sidecar, and Dogvacay among others. Often referred to as a sharing economy, there is no centralized control of power, allowing people to more directly profit from their goods/services rather than pay unnecessary middlemen along the way. \\nThis is a trend that is sure to grow as technology makes it easier for people to make it on their own and allows for people to own their means of production and finished goods, instead of just being paid in the production process. The peer-to-peer economy is also possible through the abundance of goods already out there, allowing for goods to be shared and recycled rather than thrown away and reproduced. Not only is the peer-to-peer economy growing, but many young people are ditching the career 9-5 jobs and branching off into independent careers or job hopping . The top down business model in economics has now found a legitimate system in which a decentralized bottom up approach gives the power back to the people. 5. The Shift Towards Renewable Energy \\nThe shift towards renewable energy is a forgone conclusion as renewable energy is the way of the future. In fact, the shift looks to be happening faster than people realize. According to the Global Energy Initiative , “Numerous scenarios projected levels of renewable energy for 2020 that already were surpassed by 2010.” The IEA states that, “In 2012, the world relied on renewable sources for around 13.2% of its total primary energy supply, and in 2013 renewables accounted for almost 22% of global electricity generation.” \\nWith increased technological capabilities along with ever-growing concern over the state of the environment, the world is beginning to not only shift towards renewables, but the power over energy supplies and grids is decentralizing. For example, home solar panels or the new Tesla Powerwall , would enable people to access their own energy directly from the sun without going through middlemen. Another example is a local city like Burlington, VT being the first city in the U.S. to use 100% renewable energy; even whole countries like Paraguay, Iceland and Norway being 100% renewable . Cheap localized energy is on the horizon along with the very real possibility Nikola Tesla once envisioned, which is a world of free energy . 6. A Return to Organic Food \\nThe reemergence of organic food is not only on the rise, but the use of farmers markets and locally grown food is on the rise as well. According to the Non GMO project , “In more than 60 countries around the world, including Australia, Japan, and all of the countries in the European Union, there are significant restrictions or outright bans on the production and sale of GMOs .” The rise is so strong that according to the Organic Trade Association, “Supply shortages [of organics] are one of the greatest challenges facing the industry today. Despite continued growth in production, handlers are not able to keep up with demand.” \\nThanks in large part to the Internet and non-corporate sponsored research, people are beginning to understand the importance behind knowing exactly what’s in the food one consumes and how it directly correlates to health. This has put mounting pressure on food businesses to adapt. The signs are already evident as Chipotle sees their profits increase while operating completely Non-GMO , while sales giants such as McDonalds see profits continue to decrease amidst health concerns over their food. Many are beginning to truly care what goes into their body and the rise of localized non-organic food in this country is a direct result of this health-conscious shift. 7. The Understanding Of a World of Abundance \\nAs Gandhi famously said, “The world has enough for every man’s needs, but not for every man’s greed.” People are finally awaking to the fact that there is enough to go around, just not with the current systems in place. No one is saying there is enough for everyone to live at current western consumption rates, however with adoption of renewable energy, new forms of decentralized government and economics, and the increase in the usage of technological capabilities, there is more than enough for everyone in the world to live happily. For example, the world produces enough food for 10 billion people, yet many go starving as a result of faulty systems of distribution. Another example is water; there is more than enough water on the planet, but it’s the economic systems that get in the way of technology. \\nThe notion of scarcity has long haunted the systems of government and economics, but now a new paradigm of abundance is beginning to take root in the minds of people. The Venus project is a prime example of an alternative resource based economy in which sustainability and resource supply are taken into account. A world of abundance with zero emission is no longer just a pipe dream, but could very well become a reality as people think in terms of abundance. 8. The Global Consciousness Shift \\nFinally a consciousness shift is underway in which people are starting to see themselves as more than just individual people operating in an isolated bubble, but instead as a connected piece in the collective consciousness of planet Earth. The Internet, along with the increased capacity for travel, has allowed people from all over the world to connect. So many parts of the global society have become interconnected and people are beginning to take notice of not only their own country, but countries abroad. \\nMany are beginning to realize that one group of people suffering means everyone is suffering. This interconnection to everything has given rise to practices such as meditation, yoga, and travel, as well as the continued global acceptance towards mind altering organic substances like marijuana and mushrooms . People are beginning to emotionally connect to life all over the world and not just their immediate home and surroundings. This new reality is showing people that there is more to life than money, as connection to all living things is equally, if not more, valuable. \\nAs one can see, the world is very much in the early stages of a shift in consciousness and design. These shifts are leading to a growing decentralization movement in which the power controls of society are taken from the few and given to the many. Obviously, there is a very strong force at play that is fighting against this paradigm shift. This force is fighting for centralization of power in almost all facets of life. There can be no doubt of the presence of this resistance when one examines the ever-increasing wealth and power gap that is out of control in this country. \\nThe actions taken by these elite organizations are getting more radical and desperate by the day. With all that being said, the global paradigm shift has one advantage that I believe will be the game changer, and that’s the will of the people. This is not just the people of a a single country, but internationally, as united global movements such as Occupy Wall street , the Arab Spring, and March Against Monsanto are happening simultaneously all over the world around central causes. So wake-up and participate, for we are in the early stages of a revolutionary paradigm shift in the consciousness of the masses that can truly change society for the better. About the Author \\nAn avid free-thinker, Tim has set out on a mission in search of the truth in whatever form it may come. Ever since his awakening several years ago, his passion for knowledge and justice has led him on a journey into deep research, cultural travel, and complete expansion of the mind. Tim feels as if the information freely flowing into the hands of the public, due to the dawn of the Internet, cannot be stopped at this point, so he has made it his goal to help facilitate and breakdown this complex stream of information, so that others can accelerate their own awakening and be part of the inevitable change happening in society. \\nYou can connect with Tim at:'"}, "time": 1742563829.0264237}