{"duration": 0.03160381317138672, "input_args": {"text": "\"Here's something interesting from The Unz Review... Recipient Name Recipient Email => \\nDonald Trump’s startling and explosive victory has not only shaken America’s oligarchy to its core, it’s also sending shock waves across Europe and scaring the top hats off plutocrats and their tame politicians. \\nThe great Mark Twain wrote early in the 20th century: ‘if you don’t read newspapers you are uninformed. But if you do read them, you are misinformed.’ Amen. \\nAs with the 2003 war against Iraq, the US media totally dropped its mask of phony impartiality and became a cheerleader for the Clintons and their financial backers. Media was clearly revealed as a propaganda organ for the ruling elite. No wonder its disgusted clients are decamping to online sources or just ignoring the biased media. \\nAmazingly, working class men and women rose up and overthrew the oligarchy, led by the corporate media and the self-enriching, war-promoting Clinton dynasty and its Davos friends. There was plenty of anguish among leftist groups and weepy young women, but America breathed a gigantic sigh of relief. \\nSo did the stock market. So did ordinary white Americans royally fed up with the elite’s promotion of ‘diversity,’ which they believe is a euphemism for mixing races, pushing junk popular culture, and advocating homosexuality, lesbianism, and bisexuality. \\nAcross the Atlantic, political nerves were just as tense. Three major votes will be held in the coming 10 months in France, Germany and Italy, Europe’s economic, political and cultural core. The old order is scared to death by Trump’s crashing victory. \\nFrance holds a presidential primary in a month in which sitting president, François Hollande, is expected to be thrashed. Hollande’s public support now is struggling to reach 4%. \\nFormer prime minister Nicholas Sarkozy has risen from the political dead and is preaching a farrago of populism, nationalism and Islamophobia. Many French don’t trust or like Sarko. He may shortly face charges for accepting illegal campaign money from Libya’s late Mummar Khadffi, in whose murder Sarko may be deeply implicated. Dead Libyans tell no tales. \\nSarko’s rivals are former foreign minister Alain Juppé, a moderate conservative and ally of the ailing former president Jacques Chirac, who remains France’s most liked politician. Juppé, dignified, sensible, and moderate, is just what France needs after the disastrous socialist president François Hollande. \\nBut adding a wild card to the primary is the youthful ex-banker and rightwing socialist Emmanuel Macron, a former economy minister under Hollande. He used to work for the French Rothschilds, arousing suspicions on the left and far right. Macron is expected to shortly announce his candidacy for president. \\nAdd in former prime minister François Fillon, a solid moderate with a reputation for strong ethics who may be able to stand up to France’s thuggish unions. Fillon, Juppé and Macron are all considered leftwing conservatives who can restore France’s staggering economy and fight the bureaucracy, teachers and, of course, the unions who can quickly shut down all key sectors of France’s economy. \\nLurking in the background is the nemesis of France’s current political system, Madame Marine LePen, leader of the hard right National Front. Anti-EU, anti-globalization, and anti-Muslim, she is a modern day version of France’s WWII Vichy Catholic far right. Le Pen, like her aged father Jean-Marie, is very popular and can articulate, like Trump, the anger and dismay of working whites. \\nShe may knock the hapless Hollande out in the first round of voting in 2017. But Le Pen would then have to go on to defeat the moderate candidate – Sarkozy, Fillon, Macron or Juppé. This will be very tough because, as in previous elections, leftist and centrist voters will gang up to defeat her. \\nSuch is conventional logic. But after Trump nothing is certain. Good! Our stagnant western economies and corrupt political systems badly need shaking up and refreshing. I say, ‘vive Monsieur Trump.’ \\nOn Dec 4, Italy holds a very important referendum to modernize its rickety political structure. If voters reject it, Italy’s young, reformist prime minister, Matteo Renzi, has vowed to resign. This would likely plunge Italy into political confusion and encourage a looming banking crisis. \\nFinally, in Germany, Angela Merkel’s coalition government looks increasingly fragile. Many Germans are tired of the ultra-moderate Merkel and her cautious government which is often accused of being an American vassal. If Germany ever wakens from its post-1945 stupor, all Europe will shake. \\nSo enter Donald Trump just at a time when Europe may be coming to a boil. (Reprinted from EricMargolis.com  \""}, "time": 1742628573.331366}