{"duration": 0.04982447624206543, "input_args": {"text": "'This post was originally published on this site – Advertisement – \\nFrom Nation of Change \\nTrump’s unexpected election has created political space for a new agenda . \\nThere is a critical lesson to learn from this election: People will only take so much before they rise up and fight back. This voter revolt has been brewing for a while. If the Democrats had possessed the capacity to be self-critical, they would have seen it coming, but I suspect that despite the growing unrest they thought they had everything under control. The party has been getting away with manipulation of the debates and primaries, control of the commercial media, empty promises of a better future and blaming everyone but themselves for decades. That era of hubris is over. The election of Trump was not because people like him; it was a revolt against the Democratic Party, represented this year by Clinton. It had little to do with her being a woman and everything to do with her representing the political elites who serve Wall Street interests instead of the people. – Advertisement – The Trans-Pacific Partnership (TPP) played a major role. Workers in states where manufacturing jobs were moved out of the country felt betrayed by President Obama and didn’t trust Clinton’s new, weak opposition to the TPP, especially after the Democratic National Committee defeated Sanders’ anti-TPP amendment and his campaign. Sanders and WikiLeaks further exposed the Democrat’s fake populism and corruption. \\nUnfortunately, the election of Trump, who was perceived as “the outsider,” will unleash even worse policies than Clinton would have enacted, with the exception perhaps of foreign policy. Clinton’s support for a no-fly zone over Syria would have heightened tension with Russia and increased the risk of a major war. Trump says he’ll work things out with Russia. Members of the international peace community are relieved. \\nEarly indications of the Trump agenda, however, signal lower taxes for the wealthy and corporations and greater military spending, which will likely trigger greater austerity measures for the rest of us. He intends to weaken the less-than-adequate current measures in place to mitigate the climate crisis. Trump’s plans for health care are disastrous. Opening the sale of health insurance across state lines may lower prices but at the expense of coverage. Block grants for Medicaid mean states will sacrifice coverage in times of economic stress. \\nTrump’s unexpected election has created political space for a new agenda. This is a critical moment when the people must continue their revolt by defining the agenda to create an economy that works for everyone, achieve universal health care, end systemic racism, protect the planet, stop wars and more. Now more than ever, we must be clear about the solutions we want such as taxing wealth, improved Medicare for all, jobs with living wages, and a clean energy economy by 2030. \\nThe largest movement of movements against rigged corporate trade deals just stopped the TPP. This is a victory of the people over transnational corporations. Let’s build on that victory by continuing to rise up and put an end to plutocracy. \\nIn the words of the recently deceased Leonard Cohen, “Democracy is coming to the USA.” \\n[embedded content] '"}, "time": 1742563612.607442}