{"duration": 0.07385754585266113, "input_args": {"text": "'NTEB Ads Privacy Policy NY Daily News And Nearly All Liberal News Media Outlets Experiencing Stunning Decline In Readership While the entire newspaper industry has been hammered by print circulation declines in recent years, the drop-off by Mort Zuckerman’s Daily News in September was much steeper than the declines at The Post and the New York Times. by Geoffrey Grider November 17, 2016 Daily News or other liberal news outlets report steep decline in circulation \\nThe infamous main stream media are no where near the “main stream” when it comes to understanding what the vast majority of America wants and needs. Donald Trump’s landslide election night win was a referendum on the corrupt, liberal-biased opinion creators posing as journalists. Donald Trump Calls Out The Corrupt Bias Media – Mainstream Media Attacks: \\n2016 will go down as the year that the American people woke from their slumber and began to throw off the shackles of globalism, elitism and the faux journalism of the Chicago Way . News organizations like the ultra-liberal NY Daily News are being driven into bankruptcy, brought down by the sheer weight of their own careless regard for the truth. \\nTo which we happily say, “adios!”. The Daily News is a four-time lose r, recently released circulation stats show. The embattled newspaper reported sharply lower sales on weekdays and Sundays and on newsstand sales and home deliveries, according to the Alliance for Audited Media. While the entire newspaper industry has been hammered by print circulation declines in recent years, the drop-off by Mort Zuckerman’s Daily News in September was much steeper than the declines at The Post and the New York Times. source AOL will announce layoffs of 5 percent of its staff today , with 500 employees expected to lose their jobs. In an interview yesterday, AOL CEO Tim Armstrong said that most of the cuts will come in its corporate units, while resources will be shifted more at mobile, video and data offerings going forward. “The layoffs are related to a 2017 strategy where we will add to our business,” he said. “These are super-targeted by area, and we will be re-growing, especially in video and mobile.” Armstrong reiterated that plan in a memo sent to employees. “Based on our strategy and the changes we see in the industry, we are reshaping parts of the company today,” he wrote. “The company … will be aligned to drive a talent and operations plan in line with profitability.” The cuts come after AOL added about 1,500 workers this year from an advertising deal with Microsoft and its purchase of Millennial Media, which prompted the consolidation to improve financial performance. source The Spanish-language media giant Univision Communications will lay off almost 6 percent of its workforce — between 200 and 250 people — after it slipped into the red last quarter, the company announced Wednesday. The layoffs, along with a planned restructuring, “are in response to difficult times, challenging times,” Isaac Lee, Univision’s digital, entertainment and news chief, told The Washington Post in his first public comments on the moves. “We need to position ourselves for the future.” Univision had a third-quarter net loss of $30.5 million on total revenue of $735 million, down 8 percent. source The New York Times Company reported a $14 million net loss for the first quarter of 2016 as it continued to grapple with how to offset falling revenue in print advertising. Digital subscriptions remained a bright spot for the company, showing robust growth. source \\nGeoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING'"}, "time": 1742564598.8981829}