{"duration": 0.08220505714416504, "input_args": {"text": "'Editor’s Note : Not only is this the case, but she totally knows it… and she can’t wait.\\n\\nBy Prof Michel Chossudovsky\\nThe media has failed to address the confrontation between the U.S. State Department and the Joint Chiefs of Staff. \\nThe Chairman of the Joint Chiefs of Staff General Joseph Francis Dunford (image right) has warned both the US Senate as well Secretary of State John Kerry in no uncertain terms that a “No Fly Zone” over Syria would lead to war with both Syria and Russia, intimating a dangerous process of military escalation. \\nIn a Senate Arms Services Committee hearing, Dunford said, responding to questions from Republican Senator Roger Whicker (Mississippi)\\n“Right now, Senator, for us to control all of the airspace in Syria it would require us to go to war, against Syria and Russia,… That’s a pretty fundamental decision that certainly I’m not going to make.” ( Senate Armed Services Committee, September 22, 2016, emphasis added)\\nAt the third presidential debate, Hillary Clinton reasserted her commitment that if elected president, she would implement a no-fly-zone, intimating that the objective was to “save lives”:\\n“I think a no-fly zone could save lives and could hasten the end of the conflict. I am well aware of the really legitimate concerns you have expressed from both the president and the general,” Clinton said in response to a question from Fox News debate moderator Chris Wallace.\\n“This would not be done just on the first day. This would take a lot of negotiation and would also take making it clear to the Russians and Syrians that our purpose here was to provide safe zones on the ground … I think we could strike a deal and make it clear to the Russians and the Syrians that this was something that we believe was in the best interest of the people on the ground in Syria.” (Fox News, emphasis added)\\nAt present, under the Obama administration, the joint chiefs of staff are opposed to the “No Fly zone”.\\nThe Joint Chiefs of Staff are appointed by the Secretary of Defense.\\nUnder a Clinton presidency, a new Secretary of Defense as well as a new Chairman of the joint chiefs of staff, firmly committed to “A No fly Zone” over Syria would be appointed.\\nMichèle Angelique Flournoy, a former Under Secretary of Defense for Policy is Hillary’s choice for the position of Secretary of Defense, who favors the “No Fly Zone” option. \\nAccording to Defense One: ”The woman expected to run the Pentagon under Hillary Clinton said she would direct U.S. troops to push President Bashar al-Assad’s forces out of southern Syria and would send more American boots to fight the Islamic State in the region.”\\n\\n\\nConfirmed by the Leaked Emails Michele Flournoy is a crony of the Clintons. She has “called for “limited military coercion” to help remove Assad from power in Syria, including a “no bombing” zone over parts of Syria held by U.S.-backed rebels.” This is tantamount to a no fly zone to protect the terrorists including ISIS Daesh from actions by Syrian and Russian forces.\\nAccording to Defense One: \\nFlournoy, and several of her colleagues at the Center for New American Security, or CNAS, have been making the case for sending more American troops into combat against ISIS and the Assad regime than the Obama administration has been willing to commit.\\nSince Russia’s increased involvement, the facts on the ground in Syria, she said, “Do not support the kind of negotiated conditions we would like to get to.” U.S. policy should be the removal of Assad even if that meant “using limited military coercion,” Flournoy said, at Monday’s annual CNAS conference in Washington.\\nFlournoy did not deny the entire report that she favors increased U.S. intervention; for instance, she acknowledged her support for U.S. “strikes using standoff weapons — to retaliate against Syrian military targets” to enforce the no-bomb zone.\\nThe press reports, however, did not quote the details of the discussion and testimony of General Dunford and Secretary of Defense Carter at the Arms Services Committee Hearing:\\nLet me see if the Chairman wants to add anything.\\nSenator Wicker: Well, let me just ask this, if you don’t mind, Secretary Carter. It would help if the barrel bombing ended. And I spoke to a Democratic colleague of mine today. I’ve been calling for a no-fly zone to stop the barrel bombing, and I asked this colleague of mine on the other side of the aisle if he would support that. And he said, “Yes.” He said, “I want to call it something else, rather than a no-fly zone,” but that this particular Senator it is a fact that this particular Senator has now changed his position and would like us to take action to present — to prevent the barrel bombing.\\nWhat is your position about that? And wouldn’t it help if we took decisive action and ended this carnage? Secretary Carter: I don’t know the specific proposal which you’re discussing with your colleague. I’ll make one comment and see if the Chairman wants to add anything. Senator Wicker: I think he was talking about a no-fly zone –\\nSecretary Carter: Well, okay.\\nSenator Wicker: — but described in more palatable terms.\\nSecretary Carter: There are — a number of different proposals have been made, but I — the one that I think it the focus on right now is the one Secretary Kerry’s trying to promote, namely a no-fly zone for the Russians and the Syrians who are attacking the Syrian people . If they’re talking about a no-fly zone for American aircraft fighting ISIL, needless to say, that — that’s not going to get any enthusiasm, get strong opposition from me.\\nSenator Wicker: I’m speaking about a –\\nSecretary Carter: But, I think that’s what a — but — it’s not called that, but Secretary Kerry is trying to get a standdown of the Syrian and Russian air force. And if he’s successful, that would be a good thing.\\nLet me ask the Chairman if he has anything to add.\\nGeneral Dunford: Senator, the only thing I’d say is, you know, as the situation on the ground changes, I think I have a responsibility — we, the joint force, has a responsibility — to make sure the President has a full range of options. We have discussed that issue in the past under certain conditions. The conditions on the ground will change, and we’ll continue to look at those options and make sure they’re available to the President.\\nSenator Wicker: What about the option of controlling the airspace so that barrel bombs cannot be dropped?\\nGeneral Dunford: All options –\\nSenator Wicker: What do you think of that option, sir?\\nGeneral Dunford: Right now, Senator, for all of the airspace in Syria, it would require war against Syria and Russia. That’s a pretty fundamental decision that certainly I’m not going to make. \\n\\nConcluding Remarks \\nFrom the above testimonies and statements, one thing is clear. Decision-makers at highest levels of the US government and the military believe in their own propaganda. They are not able to reflect on their actions outside the realm of propaganda. And this also applies to nuclear warfare which is presented as a “peace-making operation”.\\nIt is unlikely that any drastic action regarding a “no fly zone” will be taken under the Obama administration prior to the November elections and the instatement of a new president of the US in January 2017.\\nConsequently, the next three months will be absolutely crucial for Syria. –i.e. During this period, the counterterrorism campaign waged by Syria with the support of Russia and Iran will seek to eliminate remaining terrorist pockets and pacify the entire country.\\nThe foot-soldiers of the Western military alliance will be defeated on the ground. If this objective is achieved, it will inevitably have an impact on “US options” regarding the proposed deployment of ground-forces and the No Fly Zone. What prevails, however, is an attempt on the part of Washington to redeploy its ISIS terrorist foot-soldiers in Mosul by transferring them from Iraq to Syria.\\nDelivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by Global Research of Centre for Research on Globalization . \\nThe Global Research website was established on the 9th of September 2001, two days before the tragic events of September 11. Barely a few days later, Global Research had become a major news source on the New World Order and Washington’s “war on terrorism”. The site publishes news articles, commentary, background research and analysis on a broad range of issues, focusing on social, economic, strategic and environmental issues. '"}, "time": 1742628504.5308828}