{"duration": 0.10022449493408203, "input_args": {"text": "'ISIS Takes Out M1A Abrams Tank with American TOW Missile (video) ‹ › Dr. Kevin Barrett, a Ph.D. Arabist-Islamologist, is one of America’s best-known critics of the War on Terror. He is Host of TRUTH JIHAD RADIO ; a hard driving weekly LIVE call in radio show. He also has appeared many times on Fox, CNN, PBS and other broadcast outlets, and has inspired feature stories and op-eds in the New York Times, the Christian Science Monitor, the Chicago Tribune, and other leading publications. Dr. Barrett has taught at colleges and universities in San Francisco, Paris, and Wisconsin, where he ran for Congress in 2008. He currently works as a nonprofit organizer, author, and talk radio host. Top 10 reasons to be a holocaust denier By Kevin Barrett on October 29, 2016 It is possible not only to survive, but to actually thrive as a “holocaust denier.” Here are the top ten benefits of being so labeled. \\nBy Kevin Barrett , Veterans Today Editor \\nIt is very, very easy to become a “holocaust denier.” \\nI have never denied any holocausts. All I did was say that it looked like Bush and Cheney and Rumsfeld and their friends did 9/11. Out of nowhere, the ADL and B’nai Brith and their ilk all started screaming at me: “Why are you saying THAT, you anti-Semitic holocaust denier?!” \\nI was labeled a “supporter of holocaust deniers” on my Wikipedia page, even though I knew nothing about the “holocaust deniers” that some blogger claimed I supported. \\nThat was roughly from 2006 to 2013. For all those years I couldn’t get my Wikipedia entry changed, even though it was absurdly false and referenced an unknown blogger as the source. Remove the lie, and it would be back up in hours, if not minutes. \\nThen I was officially labeled a “holocaust denier” myself – for the first time as far as I know – by Jonathan Kay in his book Among the Truthers . Kay cites no evidence whatsoever that I have ever denied any holocausts. \\nLike Professor Anthony Hall—who was suspended from his tenured Full Professorship at the University of Lethbridge because someone planted a “genocidal holocaust denying” image on his Facebook page —I support open debate on all holocausts , and all other issues as well. \\nLet me repeat: I don’t deny anything. I just support open debate. \\nSo, using ADL/B’nai Brith nomenclature, I guess that makes me (in their eyes) a “holocaust denier.” \\nSince I had better make the best of it, here is a list of the most wonderful things about being a “holocaust denier.” Top 10 Reasons to Be a Holocaust Denier \\n10) Incessantly bombarded with holocaust memorials, holocaust museums, and holocaust references in popular culture, you won’t have to get angry and gloomy and depressed and feel guilty (if you are not a Jew) or paranoid (if you are a Jew) but instead can shrug your shoulders and say, “It probably wasn’t quite THAT bad” and go about your business in a normal frame of mind. The cumulative effect of missing out on all that depression, anger, and guilt will add at least ten years to your life expectancy. \\n9) You can retire early and enjoy hobbies and gardening, since YOU WILL NEVER WORK IN THIS TOWN AGAIN. With all that extra life expectancy, you will have a very long and productive retirement. \\n8) The good news is that when holocaust denial finally becomes “cool” you will have gotten there first. The bad news is that your retirement may have to continue for many decades for you to live so long. \\n7) Holocaust denial is rapidly growing industry with openings for authors, documentary filmmakers, persecution victims, and false flag provocateurs for the ADL (the latter being by far the best-paying category). \\n6) You will lose all your “friends” who were neither terribly smart nor your friends. Good riddance! \\n5) You may get a chance to rub shoulders with famous people whose lives have recently been glamorized by Hollywood, such as David Irving. \\n4) When you become an erudite and prolific holocaust denying scholar, you can get a job in the field of Holocaust Studies. Since it is in Iran, you will need to be fluent in Farsi. \\n3) You can visit David Cole and partake of some of the stash he saved from his Republican Party Animal days . But be careful, since it seems to cause 9/11 truth denial and other symptoms of possible brain damage . \\n2) Your intrepid holocaust denying utterances will thrill your friends and mortify your enemies. \\n1] European governments will love you so much that next time you take a vacation there, they will insist that your vacation continue indefinitely, and they will even provide you with free food and housing. Related Posts:'"}, "time": 1742561843.7600212}