{"duration": 0.05572390556335449, "input_args": {"text": "'As Hillary Stumbles Up Plane Steps, Cameras Catch What She Tried To Hide   Robert Rich   \\nHillary Clinton has been a busy woman, trying to keep up her appearances and make Americans believe she is in prime condition and fit for the presidency. However, she recently stumbled as she going up some steps. Too bad for her, cameras were there to catch what she tried to hide the entire way up. \\nHillary was set to fly to a rally in Winston-Salem, North Carolina on her private jet, but not before making a fool of herself on the steps. Those on the right have been saying for months now that there’s something not right regarding Hillary’s health – and a recent video may just prove that. \\nAlthough the clip starts out simple enough, Hillary only makes it about halfway up the stairs before she stumbles a bit. From there on out, the female presidential hopeful tried to hide her seemingly unsteady trek up the rest of the stairs. \\nViewers watch as Hillary slows her pace and grips even tighter on that railing on her way up. She can also be seen looking down to ensure that every step lands with a firm foot as she makes her climb – something that people without a fear of frequent falls wouldn’t do. \\nPerhaps what’s even stranger is the fact that just after she started stumbling, it appears as though Hillary is muttering something to herself for much of the short journey to the plane. Although it’s just speculation, it looks as though Hillary was flustered by the trip. However, people seem most concerned with her labored ascent up those steps. \\nIn fact, The Daily Mirror adds: \\nFrom the time she departed her motorcade van, which was positioned right at the bottom of the stairs, all the way to the top of the steps, she appeared to be wobbly and unsteady, and laboring during the trek. \\nMaybe it was because she had the extra — arduous — task of carrying an umbrella? \\nIt doesn’t take much to see just how weak and frail Hillary Clinton is, and videos like this only make it that much clearer. This woman doesn’t so much resemble a presidential candidate as she does someone’s ailing grandma. It’s time for Hillary to face the music and throw in the towel. If she can’t physically handle a one-year campaign, she’s certainly not suited for what a 4-year presidential term is going to throw at her.'"}, "time": 1742563211.816848}