{"duration": 1.4089741706848145, "input_args": {"text": "'There are two types of show business star: matte and gloss. Matte stars deaden the light, their recesses best revealed in shadow. Creatures of chiaroscuro, they conquer and retreat, like Garbo, turn chameleonic in company, like Brando, alternating sullen disgruntlement with outright  . Beards may be involved. Gloss stars, by contrast, eat up the light like a cat sunbathing on a windowsill. They strut with the   ease of toddlers showing off to their parents. Think of the peacock thrill of being looked at that John Travolta evinces in “Grease” or Tom Hanks in “Big” or Jennifer Lawrence in anything besides “The Hunger Games. ” Theirs is an egoless egotism that, by dint of the generosity with which it is offered up, yields audiences the promise of transcended, liberated self. Here, have me. Alan Cumming is the latter. His new book, YOU GOTTA GET BIGGER DREAMS: My Life in Stories and Pictures (Rizzoli, $29. 95) is a scrapbook of photographs taken by the actor over the years, accompanied by biographical sketches of what he was up to at the time  —   prose selfies for a kind of   memoir. Here is a shot of Glenn Close’s “totally smoking ripped back” on the red carpet at the Tonys. Here is Eva Mendes’s cleavage at the Roosevelt Hotel in Los Angeles. Here is a blurry shot of Oprah snapped in the star’s tail winds at an Elie Wiesel Foundation dinner in her honor. “Very famous people create whirlwinds,” he notes, and kicks his book off with a Force 7 gale: Hurricane Liz, whom he runs into at Carrie Fisher’s birthday party and soon has cackling “like a trucker who’d just heard a good fart joke. ” The book ends, some 250 pages later, with the actor’s being barged out of the way by Diana Ross making a beeline for the dance floor at an Oscar party. “The song she was so desperate to dance to was one of her own!” he notes. “Talk about being in the middle of a chain reaction. ” There is a tradition of stars turning paparazzi  —   Jeff Bridges has taken beautiful photographs on and off the movie set. There’s a tradition, too, of British performers going to Hollywood and returning with their wits intact to write up the experience in   memoirs: David Niven set the bar with “The Moon’s a Balloon. ” Quentin Crisp turned his   humor into a cottage industry. Cumming has already proved himself a gifted writer with “Not My Father’s Son,” wringing humor from the hard facts of his upbringing in Scotland, not least his brute of a father, who used to shear him with clippers, like a sheep. Cumming Sr. makes a brief appearance at the start of this book, too, sneering at the little plastic Kodak camera that his son wins in a church raffle: “Get on with that grass”  —   an instruction to which the rest of the book might be said to raise a puckish middle finger. “I am a sensualist,” he writes. “I understand the need to let go. ” There is a curious innocence to his pictures of drag queens and   boys snapped on trawls through the dive bars and strip joints of Lower Manhattan, which he eats up “like a deprived child. ” What makes Cumming unusual is that the powers of observation that make him a good writer haven’t canceled out the instincts for pleasure that propel him out into the world. He has advanced and found a retreat within himself, as all artists must, throwing his own   to which we are all luckily invited. Think of this book as the goody bag you get to take home afterward. “I had never seen my name engraved on a dildo before,” Cumming writes of his haul from the Fleshbot Awards. “And I had never received an award that I could potentially penetrate myself with, safely at least. ” It’s that “safely” that sets you thinking. He never does get around to finishing his father’s lawn. If celebrity is the biggest party the ego can throw, then the example set by Bill Murray takes the principle a step further, asking: Can the ego crash its own party? In THE TAO OF BILL MURRAY:   Stories of Joy, Enlightenment, and Party Crashing (Random House, $26) the Rolling Stone contributing editor Gavin Edwards tracks the mysterious   sightings of the comedian made by the public for years. The Scandinavian exchange students’ party he crashed near St. Andrews Links in 2006, where he ended up washing the dishes. The   international conference on biodiversity and conservation Murray dropped in on to talk about sturgeon. The music festival in Austin where he popped up behind the bar in 2010, pouring people tequila regardless of their order. The list goes on: a game of kickball on Roosevelt Island, a snowball fight in upstate New York. Typically, festivities end when Murray slips away with the words “No one will ever believe you. ” Edwards has saved some of us a lot of work. Murray watchers have been keeping unofficial scrapbooks of this activity for years, and like many of us, the author suspects there is more going on here than the   irrepressibility that has long lightened his forays to the golf course  —   using spectators’ sweaters to polish his balls, for instance  —   although Edwards includes these, for good measure. “Our   trickster god,” he writes, “Bill isn’t just being a clown. He has a tao, a way of being, a philosophy of life. ” Murray’s deus ex machina   are an attempt, in Edwards’s formulation, “to make real life more like the movies. ” He takes careful note of the courses in French and philosophy Murray took at the Sorbonne in the years following his “Ghostbusters” success, where he was exposed to the teachings of the   thinker George Gurdjieff, who argued that most of us sleepwalk through our waking lives it is the task of the freethinker to wake us up. There’s no record of these   calls ever being unwelcome, although one Williamsburg hipster, disgruntled to find Murray at a Halloween party with the band MGMT, does accuse him of making “poor life choices. ” The bulk of the activity postdates the end of Murray’s second marriage in 2008, but as with his screen performances, the dusting of midlife melancholy adds rather than subtracts from the stories. My favorite has Murray driving a golf cart around the streets of Stockholm with two drunken Swedes singing Cat Stevens’s “Father and Son” until they are stopped by the police. “Bill’s explanation that he was a golfer proved insufficient,” Edwards writes, which may be one of my favorite sentences in any film book this year. There have been greater, weightier testaments to the art of cinema published in 2016  —   Edwards’s book is no more than a magazine article, really, padded out with a bio of the comedian and a slightly redundant filmography  —   but for sheer dopamine release, it’s hard to beat. Tippi Hedren puts gossips out of their misery early on in her memoir, TIPPI (  $28. 99): Barely 37 pages in and here is Alfred Hitchcock, “shorter and even rounder than I was expecting,” casting the    model in “The Birds” after seeing her in a Sego commercial. What follows has long been the subject of Hollywood rumor and inspired a 2012 TV film, “The Girl,” so Hedren’s decision to break her silence on her director’s “obsessive, often embarrassingly ardent, often cruel behavior” is a significant addition to our current   conversation on sexual assault. Fixing Hedren with an “unwavering stare” wherever she went on set, Hitchcock instructed her   “Do not touch The Girl,” had her followed and  —   creepiest of all  —   had a “life mask” of her face made for his own personal use. “I’m so sorry you have to go through this,” Hitchcock’s wife, Alma, confides in her at one point. Jay Presson Allen, the writer of her subsequent film with the director, “Marnie,” pleads, “Can’t you love him just a little?” Finally, after a series of “excruciating” encounters in her dressing room and a fumble in the back of his limo, he summons her to his office and assaults her. “It was sexual, it was perverse, and it was ugly,” she writes. “I’ll ruin your career,” Hitchcock threatens upon being rebuffed, and then proceeds to do just that, denying her opportunities to appear opposite David Niven and Marlon Brando in “Bedtime Story” and in François Truffaut’s “Fahrenheit 451. ” But the rest of the book (written with Lindsay Harrison) is not without incident. Hedren marries her manager the pair grow obsessed with lions, start a small animal sanctuary in their backyard and plow every penny into a film epic starring the beasts. A decade in the making, “Roar” has the scent of genuine insanity, involving multiple trips to the E. R. after the cats attack Hedren’s daughter, Melanie Griffith the cinematographer Jan de Bont (later to direct “Speed”) and Hedren herself, who is mauled by a leopard named Pepper. “I sat on the floor with my eyes tightly closed and held perfectly still while I felt his claws on my right thigh, followed by his sandpaper tongue licking honey off my cheek,” she recalls, in slightly more detail than her mauling by Hitchcock. At least Pepper didn’t block her from working with Truffaut. Bryan Cranston’s memoir, A LIFE IN PARTS (Scribner, $27) suffers from the lopsidedness that afflicts any account of   fame  —   Cranston was 51 when he took the role of Walter White in AMC’s “Breaking Bad,” which made him a global star. But Cranston is a   storyteller, practiced enough in his skills of   to make those five decades pull their weight. Determined not to repeat the path of his father, an actor who appeared on TV shows and in a movie about killer grasshoppers before succumbing to terminal resentment, young Cranston works as a farmhand, learning the correct way to kill a chicken he sees a cadaver split open while a trainee for the Los Angeles Police Department learns how to spot shoppers from thieves while working as a security guard (“Shoppers move quickly. Thieves have a slower pace”) and is motorcycling down the Eastern Seaboard when, seeking refuge from a storm, he reads “Hedda Gabler” in one sitting. As he drifts off to sleep that night, he knows what he wants to do with his life. “I knew how he carried himself. Burdened,” he writes of Walter White, upon being sent the script for “Breaking Bad” by the showrunner Vince Gilligan, who remembered Cranston from a small role he’d given him on “The  . ” He’d also, by that point, appeared in six episodes of “Seinfeld” and seven seasons of “Malcolm in the Middle,” and was up against Steve Zahn for the role. As intriguing as the Zahn idea is, it was Cranston’s less glitzy résumé  —   the years spent doing commercials for Excedrin and Preparation H  —   that was required for the    chemistry teacher turned drug kingpin Walter White: a pinpoint study in frustrated ambition and simmering megalomania, in White’s demented liberation a lusty Gloria in Excelsis Deo for jobbing actors everywhere. Jason Diamond’s SEARCHING FOR JOHN HUGHES: Or Everything I Thought I Needed To Know About Life I Learned From Watching ’80s Movies (  paper, $15. 99) is one of those pop culture bildungsromans in the vein of Nick Hornby’s “Fever Pitch,” wherein a writer enacts an obsessive battle with a pop culture phenomenon that fills his or her sky, before finally realizing the fixation is perilous and parachuting to safety. Growing up Jewish in the Chicago suburbs, beaten by his father, abandoned by his mother, Diamond is by 15 a   punk with a   carving a Dead Kennedys logo into his desk, seeking plaintive escape in films like “Pretty in Pink,” “Home Alone” and “The Breakfast Club. ” “I wanted to live in a John Hughes film. I wanted everything to turn out just right,” he says, but wonders, “How many more times could I tell myself there’d be a happy ending?” The reader suffers from a similar curiosity. Diamond, now the sports editor at Rollingstone. com, never gets far enough into his John Hughes obsession to explain it, or why his alienation doesn’t express itself in angrier   form  —   the music of Nine Inch Nails, say, rather than the quirky but   world of Hughes. But the sweetness is telling, a sign of the strain to his nature that will eventually win out. He moves to New York, takes a job as a barista, starts an unauthorized biography of Hughes, stalls on Chapter 1 (“He’s an artist just screaming to break out,” his notes read) before finally returning to old haunts in Chicago, where he succeeds in laying some of his ghosts to rest and opening a crack of daylight between himself and his idol. I’m not sure Diamond gets enough about Hughes into the book  —   for long swaths, the title rings literally true  —   but he has successfully negotiated the writer’s most important rite of passage: He makes himself matter, first to himself and then to us. A sequel to his previous book, “How to Read Literature Like a Professor,” Thomas C. Foster’s READING THE SILVER SCREEN: A Film Lover’s Guide to Decoding the Art Form That Moves (Harper Perennial, paper, $15. 99) aims to make you “a better reader of movies. More informed. More aware. More analytical. ” Despite this lofty aim, the book is written in the   style of someone anxious to reassure his readers that they will not be left behind at any point: “Films not only have to have chemistry they’re like chemistry. Now, relax, there won’t be any lab reports. ” Foster goes in for so many of these icebreakers, each an implicit expression of the author’s confident air of superiority, that you grow a little impatient for the fruits of the wisdom whose brilliance he is so thoughtfully shielding from us. What you get is this: “Movies are motion” “If you put enough” shots “together in the right order you get a movie” “Every character has a story” and “A filmmaker can jump from place to place,” but “jumping from time to time is problematic. ” This last observation is so off the mark you wonder if the author has ever seen a movie: “Citizen Kane”? Flashbacks?  ? Elliptical editing? Every now and again, one stumbles through the fog of generalities across a piece of analysis born of simple observation: the way John Ford uses Monument Valley to frame the landscape of the West, for example, or the   cocoon of alcoves, rooms, elevators and stairwells in Wes Anderson’s “The Grand Budapest Hotel. ” “This is a world very much like the actual world between the wars,” Foster writes, citing Ionesco. “Personal freedom is a scarce and fragile commodity. ” It is telling that Foster is at his best when he forgets his readers entirely. Brian Jay Jones’s biography GEORGE LUCAS: A Life (Little, Brown, $32) tells an   tale: how a scrawny, easily bored nerd from Modesto, Calif. resisted the lure of his cooler, more flamboyant filmmaking contemporaries to stun the world with   cinema aimed at his inner    that reshaped Hollywood overnight. The collective double take over “Star Wars” never gets old, although if it’s a definitive reconstruction of the creative spaghetti that fed into the saga you want, then Chris Taylor’s masterly “How Star Wars Conquered the Universe” is your book. Jones, who comes to Lucas from a celebrated life of Jim Henson, tells a more straightforward story in definitive detail, although you have to wonder whether Lucas is a good fit for the biographical format: a cautious, withdrawn man, bland in his tastes, his resentment toward his father driving his   fight for autonomy from the studios. So much in Lucasland seems born of peeve and pedantry, it’s a miracle the films are as ebullient as they are, but then that is the Faustian sacrifice behind “Star Wars”: All the fun, humor and adventure in its maker’s life are instead up there on the screen. Crisper pleasures await in BRESSON ON BRESSON: Interviews   (New York Review Books, $24. 95) edited by Robert Bresson’s widow, Mylène, and translated by Anna Moschovakis. This collection of interviews reveals the great French filmmaker’s own interview technique to bear more than a passing resemblance to Roger Federer’s drop shot. In shuffles a nervous interviewer to take his or her seat, stealing the odd personal observation: The auteur’s eyes are   and he speaks softly. “What was it that drew you to this subject?” he is often asked. It seems innocent enough, but this is Bresson. He thinks, then gently deconstructs the implicit assumptions about cinema contained therein, and rolls the ball back to the interviewer’s feet with a smile. “I don’t choose my subjects. They choose me,” he says. “Films should not have subjects at all. . ’u2008. ’u2008. What I’m trying to do is to come up to the edge of saying too little, in order to try to express with silence what other films express with words  —   the almost imperceptible things that happen on a face, or in a look in someone’s eyes. ” He interviewed much as he made films: by saying very little, with great eloquence.'"}, "time": 1742564264.0459864}