{"duration": 0.05802011489868164, "input_args": {"text": "'Email Print Donald Trump is reportedly firing around 500 of Barack Obama’s staffers, as he plans to completely fill the White House with his own team. The Federalist Papers reported that though it’s likely that Hillary Clinton would have let most of Obama’s people go so that she could hire her own staff, Trump’s win closed the door on the possibility of any of Obama’s staffer sticking around. The fired staffers have gotten so desperate about their employment situation that Obama has brought in representatives from Facebook, Instagram and other companies to offer insights into the job market. According to CBS News , Linkedin officials are helping Obama’s staff find ways to market their skills. Georgetown University, which is located close to the White House, has designed a custom professional development program they call “Future44,” Obama is the 44th president, to teach Obama’s political appointees how to build their lives after the White House. The program is free of charge thanks to an anonymous donor, and participants register for either four 2-hour evening sessions or one 8-hour “boot camp.” “We designed this unique curriculum to help these staffers think through how to market themselves or market their competencies,” said Kelly Otter, dean of Georgetown’s School of Continuing Studies. Many of Obama’s staffers will likely end up in liberal cities like New York or San Francisco working for companies that cater to millennials such as Amazon, Snapchat, Google, Vice, etc. “The transition out of government is a reality for most appointees, which brings both excitement about prospects for the next chapter or a long-awaited chance to recharge batteries, and a keen awareness about a big, impending change,” said White House spokeswoman Jennifer Friedman. Ivan Adler, a headhunter at McCormick Group, explained that Obama’s staffers are about to face a major change in life that may be hard to get through. “I tell everybody: You have to understand there’s likely nothing you will do professionally that will have the same amount of excitement you’ve just gone through in the White House, unless you become a racecar driver or an astronaut,” he said. Too bad, so sad…Don’t let the door hit you on the way out, Obama staffers! \\nIf you haven’t checked out and liked our Facebook page, please go here and do so. Leave a comment... '"}, "time": 1742562019.926819}