{"duration": 0.0694422721862793, "input_args": {"text": "'  Recipient Email => \\nIt is not hard to think of reasons why Hillary Clinton should not be President. Yesterday Wikileaks founder Julian Assange cited one of the best: Libya. \\nIn an interview with John Pilger, a noted Australian-born documentary maker and veteran critic of American military adventurism, he commented: “Libya more that anyone else’s war was Hillary Clinton’s war. Barack Obama initially opposed it. Who was the person who was championing it? Hillary Clinton. That’s documented throughout her emails. There’s more than 1,700 emails out of the 33,000 of Hillary Clinton’s emails we published just about Libya. \\n“She perceived the removal of Gaddafi and the overthrow of the Libyan state as something that she would use to run in the general election for president. So late 2011, there’s an internal document called the ‘Libya Tick Tock’ that is produced for Hillary Clinton, and… it’s a chronological description of how Hillary Clinton was the central figure in the destruction of the Libyan state.” \\nThings did not quite follow the script, however. For a start, U.S. ambassador Christopher Stevens and several other U.S. citizens were massacred when U.S. facilities in Benghazi were ransacked. The attacks were facilitated by security lapses for which Clinton was forced to take responsibility. \\nObserving that Libya remains to this day ravaged by civil war, Assange added: “As a result, there [have been] around 40,000 deaths within Libya. Jihadists moved in, ISIS moved in. That led to the European refugee and migrant crisis, because not only did you have people fleeing Libya, people then fleeing Syria, destabilization of other African countries as a result of arms flows.” \\nThe interview, which was made in association with London-based Dartmouth Films and broadcast by RT, ranged widely over Clinton’s vulnerabilities. It can be viewed here .'"}, "time": 1742563888.4435937}