{"duration": 0.06956863403320312, "input_args": {"text": "'Thursday, 10 November 2016 Trump\\'s only worry is, \"Who to fire first?\" \\nTrump Tower, NY Trump gave his 18th press conference in 4 days to announce more of his selections for his Cabinet. \\n\"Many people have remarked that many of my selections came from my old TV show, Celebrity Apprentice. Well, I was secretly trying all those people out for my Cabinet. So I will be deducting the cost of this from my taxes. Among other things. If I ever get around to filing them. Anyways, here is the list of my appointees. Also, I\\'ll admit I\\'m reemploying many of these people because I know how much fun it will be to fire them all again\" said Trump. Trump\\'s comment on each appointee is in parentheses. \\nDept. of State-Dennis Rodman-(\"And he\\'s going straight to North Korea!\") \\nDept. of the Treasury-Donald Trump, Jr. (\"Just to make it stays in the family\") \\nDept. of Commerce-Howard Stern (\"Because he promised to destroy all the tapes of when I was on his show\") \\nDept. of Agriculture-Clint Black (\"I was torn between him and that other hayseed, Trace Adkins\") \\nDept. of Defense-Jesse James (\"I think he\\'ll be good because he\\'s scary looking and that\\'s good when you\\'re going up against somebody\") \\nDept. of Homeland Security-Andrew \"Dice\" Clay (\"Another position where you just want a tough-looking dude.\") \\nDept. of Energy-Gary Busey (\"Gary might have his faults, such as being severely crazy, but he did do a great job in that Buddy Holly thing and he is the most energetic person I know!\") \\nDept. of Interior-Sharon Osborne (\"I gotta stick a dame in here somewhere or I\\'ll get in trouble and she\\'s a pretty tough broad.\") \\nDept. of Housing and Urban Development-Sinbad (\"I\\'m not sure what this department does, but I\\'m told it would be a good place to put my African-American.\") \\nDept. of Health and Human Services-Cheryl Tiegs (\"Because anybody feels better after looking at her!\") \\nDept. of Labor-Carnie Wilson (\"Because she looks like she might go into labor at any time\") \\nDept. of Veteran Affairs-Jose Canseco (\"I think maybe on a good day Jose could handle SOME kind of job if we keep an eye on him!) \\nDept. of Education-Geraldo Riveras (\"If this joker doens\\'t give away any secrets, I don\\'t know what his problem is \\nMy daughter Ivanka asked me to give her a Cabinet position and so she\\'s Secretary of Fashion now\" Make Al N.\\'s day - give this story five thumbs-up (there\\'s no need to register , the thumbs are just down there!)'"}, "time": 1742564040.725815}