{"duration": 0.0668947696685791, "input_args": {"text": "'SEOUL, South Korea  —   President Trump assured South Korea’s acting president on Monday of the United States’ “ironclad” commitment to defend the country, agreeing with Seoul to strengthen joint defense capabilities against North Korea. Mr. Trump’s assurances came amid anxiety in South Korea over the future of the alliance with the United States. During his campaign, Mr. Trump cast some doubt on the United States’ defense and trade commitments, saying that South Korea was not paying enough to help keep 28, 500 American troops in the country. But speaking by phone to Hwang   the acting president of South Korea, Mr. Trump said that the coming visit to South Korea by Defense Secretary Jim Mattis reflected the close friendship of the two countries and the importance of their alliance. Mr. Mattis is scheduled to visit South Korea on Thursday on his first official trip abroad, which also includes a stop in Japan. “President Trump reiterated our ironclad commitment to defend the R. O. K. including through the provision of extended deterrence, using the full range of military capabilities,” the White House said in a statement after Mr. Trump’s phone conversation with Mr. Hwang, using the initials for South Korea’s official name, the Republic of Korea. “The two leaders agreed to take steps to strengthen joint defense capabilities to defend against the North Korean threat. ” Mr. Hwang’s office quoted Mr. Trump as saying that the United States would cooperate with South Korea “100 percent” and that bilateral relations would be “better than ever before. ” The two leaders shared the need for firm action to persuade North Korea to rethink its nuclear weapons development program and vowed to respond strongly if the North attempted military provocations, it said. Mr. Trump’s call with Mr. Hwang followed North Korea’s recent warnings that it could conduct its first test of an intercontinental ballistic missile “anytime and anywhere,” in a rebuke to Mr. Trump. Although North Korea has vowed to develop the ability to attack the United States with nuclear warheads and has tested missiles that can cover the Korean Peninsula and its vicinity, it has never tested a   missile that could fly over the Pacific. In a New Year’s Day speech, Kim   North Korea’s leader, said his country had reached a “final stage” in preparing to test an intercontinental ballistic missile. The next day Mr. Trump said in a Twitter post, “It won’t happen!” It remains unclear how close North Korea is to building a reliable intercontinental ballistic missile, although North Korea has boasted of successfully testing crucial technology in the past year, such as   engines and heat shields for such a missile. Mr. Hwang, the prime minister of South Korea, is serving as acting president because President Park  ’s powers were suspended after the country’s Parliament voted to impeach her in December on charges of corruption and abuse of power. The Constitutional Court of South Korea is expected to decide in the coming weeks whether to formally end her presidency or reinstate her.'"}, "time": 1742564127.3215954}