{"duration": 0.04404759407043457, "input_args": {"text": "'New York Times Reporter Karen Crouse queried 56 PGA players at the Genesis Open last week in Los Angeles, finding a whopping 50 of those players (89. 3%) would play golf with President Trump if invited. [Despite the fact that South African legendary golfer Ernie Els and #3 golfer in the World Rory McIlroy were both trashed on social media for playing with the president, Crouse doesn’t find it surprising that Trump should have such a pull on tour professionals. She writes, “The results were hardly surprising. The clubhouses at PGA Tour stops have long trended Republican, and the sport’s target demographic  —   rich, mostly white men  —   is far different from the women, minorities, immigrants and Muslims who have at times been the most offended by the president’s statements and positions. ”  Yet, despite Crouse’s above conclusion, Els didn’t say he wanted to play with Trump because he agreed with all his policies but that he did so out of respect for the office.  “I’m not silly to what’s going on,” said Els, who owns 47 combined PGA and European Tour victories including four major championships. “I know this is probably the most polarizing president of my time. ” Els added, “Whether you agree or not, I felt it was a duty to play with the president when you get the call. ”   golfer Pat Perez isn’t the least bit shy of acknowledging his support for the 45th president, saying that he would play with Trump “in a heartbeat. ” So, now he can expect his Twitter and Facebook feeds to be trashed by Trump haters. To his credit, he obviously doesn’t care too much about that. Moreover, Perez commented that he would have turned down an invitation from Hillary Clinton if she had won the election in November. Golf icon Tiger Woods and L. P. G. A. player Lexi Thompson, both have teed it up with The Donald, subjecting themselves to social media scorn as well. Thompson claims Trump hit his driver 250 yards. Trump becomes the fourth president with whom Tiger has played, having joined George H. W. Bush, Bill Clinton, and Obama on the golf course during their reign as leader of the free world. Tiger quipped after playing with Trump that he was impressed with how the president took quite a “lash” at the golf ball. He added that his round was “fun,” and “Our discussion topics were  . ” One particular PGA player, Jim Herman has a strong affinity toward the President. Trump took Herman under his wing as an assistant pro at his course in Bedminster, N. J. Eventually, Trump sponsored Herman early in his career in 2006. Last Year Herman won his first PGA tour event and has captured some $6 million on the tour. The    Herman, who has played with Trump hundreds of times, was invited by then   Trump to attend his inauguration in January.  “It’s still very hard for me to separate ‘President Donald Trump’ from the guy I’ve played with for the last 10 years,” Herman admitted. “I think of how generous Mr. Trump and all of those people were in helping me make it to the PGA Tour. So on that day in Washington, the inauguration was almost surreal in seeing him and his children and some members of his clubs I hadn’t seen in many years, all of us back together to share in that unique moment in American history. ”'"}, "time": 1742562037.2772374}