{"duration": 0.06245923042297363, "input_args": {"text": "'According to Sitchin’s interpretation of Mesopotamian iconography and symbolism, outlined in his 1976 book The 12th Planet and its sequels, there is an undiscovered planet beyond Neptune that follows a long, elliptical orbit, reaching the inner solar system roughly every 3,600 years. This planet is called Nibiru (although Jupiter was the planet associated with the god Marduk in Babylonian cosmology).According to Sitchin, Nibiru (whose name was replaced with MARDUK in original legends by the Babylonian ruler of the same name in an attempt to co-opt the creation for himself, leading to some confusion among readers) collided catastrophically with Tiamat (a goddess in the Babylonian creation myth the Enûma Eliš), which he considers to be another planet once located between Mars and Jupiter. This collision supposedly formed the planet Earth, the asteroid belt, and the comets. Sitchin states that when struck by one of planet Nibiru’s moons, Tiamat split in two, and then on a second pass Nibiru itself struck the broken fragments and one half of Tiamat became the asteroid belt. The second half, struck again by one of Nibiru’s moons, was pushed into a new orbit and became today’s planet Earth.\\n\\n\\nAccording to Sitchin, Nibiru (called “the twelfth planet” because, Sitchin claimed, the Sumerians’ gods-given conception of the Solar System counted all eight planets, plus Pluto, the Sun and the Moon) was the home of a technologically advanced human-like extraterrestrial race called the Anunnaki in Sumerian myth, who Sitchin states are called the Nephilim in Genesis. He wrote that they evolved after Nibiru entered the solar system and first arrived on Earth probably 450,000 years ago, looking for minerals, especially gold, which they found and mined in Africa. Sitchin states that these “gods” were the rank-and-file workers of the colonial expedition to Earth from planet Nibiru.\\n\\nThere is a lot of confusion about the origin of the word Nephilim and what it means. In Hebrew it literally means to fall. As in fallen angel. The Bible, the Talmud and the Koran (where they are referred to as Djinn) all speak of fallen angels. \\n\\nIn the Book of Genesis in the Bible it relates how the Nephilim produced children with humans. One was even depicted as killing Japheth, Noah’s son, and taking his place whereupon he fathered many children with Japheth’s unsuspecting wife which eventually populated much of Northern Europe.\\n\\nIn the following video, journey into the world of Fallen Angels, Satan, Shadow People, Aliens, Demons, Anunnaki, Archons, Ancient Giants, “Ancient Aliens” & Genetic Hybrids. Almost all of what we know about the Nephilim comes from the Holy Bible in Genesis Chapter 6. If you’ve studies or looked into the Nephilim at all, or even if you haven’t, I’m sure you’ll find the video below refreshingly different than many other videos on the topic. I certainly did, and I’ve seen a ton. \\n\\nWATCH THE VIDEO: \\n\\nLocklip \\nSOURCE '"}, "time": 1742561903.704308}