{"duration": 0.09064030647277832, "input_args": {"text": "'russia-uk relations , uk , patriarch kirill , london Drawing by Alexei Iorsh Source: Iorsh \\nAfter the Brexit referendum and the subsequent change of government in the UK, a number of experts and observers expected an improvement in Russo-British relations. Perhaps unwittingly, former British Prime Minister David Cameron inspired these unfounded expectations. Cameron’s constantly repeated allegations that Russian President Vladimir Putin supported a vote for Brexit made people expect a somewhat softer line on Russia from the new governing team in London who were, after all, supporters of Brexit and opponents of Cameron. \\nWhen Boris Johnson became the new foreign secretary, several MPs were even concerned about him not being “tough enough” with Russia and making “conciliatory” calls to his Russian counterpart, foreign minister Sergei Lavrov. \\nJohnson quickly proved these concerns wrong, issuing a call for protests near the Russian Embassy in London as a way to punish Moscow for its actions in Syria. “This is something unprecedented in the world of diplomacy,” Alexey Pushkov, former head of the Duma’s committee on international affairs, said in an interview to Vesti FM radio station. “A diplomat calling for non-diplomatic solutions, with popular anger mobilized – this is something new.” Pushkov also noted Johnson’s tough statement accusing Russia of deliberately killing Syrian civilians with “repeated bombings.”“They drop one bomb and then they wait for the aid workers to come out pulling the injured from the rubble, and then five minutes later they drop another bomb,” Boris Johnson said in an interview with the tabloid The Sun. \\n“Boris Johnson is showing a flamboyant attitude where it is needed least of all,” Pushkov replied. \\nFor their part, the Russian authorities, disappointed by Johnson, are also changing their tone, trying to drive home to both foreign and domestic audiences the message that they are angry. \\n“Decent people first provide the evidence, and only later they come out with accusations,” said Maria Zakharova, spokesperson for the Russian Ministry of Foreign Affairs, in response to Johnson’s interview with The Sun. Seeing the bigger picture \\nBoth Johnson and Zakharova have provided plenty of fodder for the media, but all commentary and posturing aside, the decline in Russo-British relations is detrimental not just for the two countries at hand, but also for global security at large. \\n“We should not forget that the world was once brought to the brink of a nuclear disaster not because of European problems, but because of a conflict over a distant land – Cuba. When I hear British voices suggesting that NATO forces should impose a no-fly zone over northern Syria by striking at the airfields of the Syrian or Russian air forces in Syria – I get really worried,” Alexei Pushkov said. “In this situation, tough statements with a strong populist message – such as the talk about “warning strikes” in Syria – such statements are not just tasteless, they are plain dangerous.” Patriarch’s visit to London hailed as step toward reconciliation with West Media tensions were somewhat eased by the visit to the UK by Russian Orthodox Patriarch Kirill. During his visit, which took place on Oct. 15-18, the Patriarch deliberately avoided controversial issues, playing down the conflict between the Russian and British governments. “Political differences won’t be able to disrupt the relations between Russia and Britain on the basic level, on the level of people-to-people ties,” Patriarch Kirill said, speaking to journalists before his flight back to Moscow. “I am often asked about our church’s position on Ukraine. My answer is that there can be only one position: to reconcile the people, to lessen the tension, to end the bloody clashes.”\\nTrying to minimize the damage from the conflict between Russia and Ukraine, the Russian Orthodox Church still recognizes Crimea as a canonical territory of its Ukrainian “Orthodox sister church.” For two years, Patriarch Kirill avoided any political comments on the recent “regime change” in Ukraine. When the Ukrainian government barred him from visiting Kiev, the cradle of Orthodox Christianity in ancient Rus, Kirill did not protest. In this way, the Russian Orthodox Church is offering a good example of forgiveness and compromise. Several British MPs protested against what they called a “red carpet reception” for Patriarch Kirill in London because of Kirill’s loyalty to Putin, but the Patriarch did not pronounce a single word of anger or even sadness, meeting instead with Queen Elizabeth, the titular head of the Church of England, and blessing by his presence the opening of a renovated Orthodox cathedral in London. \\n“Since the early stages of deterioration of relations between Russia and the West, the church leaders have often been doing the diplomats’ jobs in Russia’s relations with the West,” wrote Moscow-based Nezavisimaya Gazeta, deviating from its usual line, which is very critical of Kirill. \\nThis is perhaps not the worst of developments: at a time when diplomats are often sacrificing security and professionalism in order to boost their standing in the mass media, the church is trying to remember and celebrate the positive legacy of Russo-British relations. This is done not so much for the sake of history, as for the sake of a secure future. Sooner or later, this cursory attitude towards diplomacy will have to give way to wisdom and responsibility. \\nDmitry Babich is a political analyst at Sputnik International. \\nThe opinion of the writer may not necessarily reflect the position of RBTH or its staff. Subscribe to get the hand picked best stories every week Subscribe to our mailing list'"}, "time": 1742562861.0543184}