{"duration": 0.03539752960205078, "input_args": {"text": "'RT October 27, 2016 \\nBritain is deploying troops, aircraft and armor in the biggest military buildup in Eastern Europe since the Cold War. \\nThe deployment, which was first floated in the press by UK defense chiefs on Wednesday, appears to have been prepared well in advance. \\nIt will see up to 800 armored infantry troops deployed to Estonia and Royal Air Force (RAF) fighter jets deployed to Romania in what appears to be a reiteration of the strategy of containment employed against the Soviet Union during the Cold War. \\nFrance and Denmark will also commit more troops. \\nOn Wednesday, UK Defence Secretary Michael Fallon struck a belligerent tone in the Wall Street Journal when he warned that Europe “ is our continent ” and, as such, would be defended. \\nWhile he claimed the force would be “ defensive in nature ” he pledged it would be “ fully combat-capable. ” A d v e r t i s e m e n t \\nHe denied the placement of small formations around the Baltic area are merely a “ trip-wire ” in case of the much-heralded, but hypothetical, clash with Russia. \\n“ This is a serious military presence, ” he said. \\nTensions have only just begun to subside after a fleet of Russian naval vessels bound for the Mediterranean Sea passed through the North Sea and English Channel. \\nThe passage caused a press frenzy in the UK, framed as though Russia was launching an invasion of the British Isles. The Royal Navy deployed destroyers to, in Fallon’s words, “ man-mark ” the vessels while the RAF overflew the ships with fighter jets. \\nAccording to the Russian military, the naval group’s task was to “ ensure a naval presence in operationally significant areas of the world’s oceans, ” as well as “ the safety of maritime navigation and other maritime economic activities ” of Russia. \\nBritain’s deployment of troops, drones and aircraft is expected to begin in May 2018. This article was posted: Thursday, October 27, 2016 at 6:45 am Share this article'"}, "time": 1742562281.7373521}