{"duration": 2.616469144821167, "input_args": {"text": "'The Hard Working American vs. The Government Parasite By Michael Snyder, on April 10th, 2012 \\nWhich lifestyle choice produces better results – being a hard working American or being a government parasite? Actually, when you look at the cold, hard numbers they may just surprise you. In America today, we deeply penalize hard work and we greatly reward government dependence. If you live in a very liberal area of the country and you know how to game the system, it is entirely possible to live a comfortable existence without ever working too much at all. In fact, there are some Americans that have been living off of “government benefits” for decades. Many of these people actually plan their lives around doing exactly what they need to do to qualify for as many benefits as possible. America is rapidly turning into a European-style socialist welfare state and it is destroying our nation socially and financially. Ever since the “war on poverty” began our debt has absolutely exploded and yet now there are more poor people in this country than ever before. Obviously something is not working. \\nNow don’t get me wrong. I deeply believe in having compassion for those that are going through tough times and having a safety net for those that cannot take care of themselves. We should not have a single person in this nation going without food or sleeping in the streets. \\nBut in America today it is absolutely ridiculous how many people are climbing aboard the “safety net”. At this point, an astounding 49 percent of all Americans live in a home that receives some form of government benefits. \\nSo who pays for all of this? \\nThe people that drag themselves out of bed and go to work each day pay for it all. \\nFor a few moments, let’s examine how the lifestyle of a typical hard working American compares to the lifestyle of a government parasite. \\nIn America today, the median yearly household income is somewhere around $50,000. About half of all American households make more than that and about half of all American households make less than that. When you break it down, it comes to about $4000 a month. \\nSo how far does $4000 go in America today? \\nUnfortunately, it doesn’t go very far at all. \\nFirst of all, a hard working American family will need some place to live. Unfortunately, the vast majority of the decent jobs are near the big cities, and it is more expensive to live near the big cities. Let’s assume that an average family of four will spend about $1000 a month on rent or on a mortgage payment. \\nThe government parasite, on the other hand, has a whole host of federal, state and local housing programs to take advantage of. During the recent economic downturn, more Americans than ever have been turning to the government for help with housing costs. For example, federal housing assistance outlays increased by a whopping 42 percent between 2006 and 2010. \\nOnce you have a place to live, you have to provide power and heat for it. For the average hard working American, this is going to probably average about $300 a month, although this can vary greatly depending on where you live. \\nFor the government parasite, there are once again a whole host of government programs to help with this. For example, LIHEAP (Low Income Home Energy Assistance Program) assists low income households in paying their home heating bills. \\nMost average hard working Americans are also going to need phone and Internet service. Let’s assume that the hard working family of four in our example is extremely thrifty and only spends $100 a month for these services. \\nFor the government parasite, cell phone service is not a problem. As I have written about previously , those that “qualify” can receive a free cell phone and free cell phone minutes every single month from the federal government. In addition, in some areas of the nation low income families can qualify for deeply subsidized home Internet service . \\nIn order to earn money, our hard working family is going to need to get to work. In most households, both parents have decided to work these days so both of them will need cars. Let’s assume that the family is very thrifty and that both cars were purchased used and that the car payments only total about $400 a month. \\nThe hard working family will also need auto insurance for the two vehicles. Let’s assume that both parents have a great driving record and that they only pay a total of about $100 a month for car insurance. \\nThe cars will also need to be filled up with gasoline. The average U. S. household spent $4155 on gasoline during 2011, but let’s assume that our family is very, very careful and that they only spend about $300 on gas each month. \\nSo what about the government parasite? Well, the government parasite does not need to go to work, so this expense can potentially be eliminated entirely. But since most other things are paid for by the government or are deeply subsidized, in many instances government parasites are actually able to afford very nice vehicles. \\nIn addition, a new bill (The Low-Income Gasoline Assistance Program Act) has been introduced in Congress that would give “qualifying” households money to help pay for gasoline…. \\nLow-Income Gasoline Assistance Program Act – Directs the Secretary of Health and Human Services to make grants to states to establish emergency assistance programs to pay eligible households for the purchase of gasoline. \\nA hard working American family is also going to need health insurance. Well, we all know how expensive health insurance has become. In fact, health insurance costs have risen by 23 percent since Barack Obama became president. But let’s assume that our hard working family has somehow been able to find an amazing deal where they only pay $500 a month for health insurance for a family of four. \\nFor the government parasite, health insurance is not needed. If there is an emergency, the government parasite can just go get free medical care at any emergency room. \\nAnd of course there is always Medicaid. Back in 1965, only one out of every 50 Americans was on Medicaid. Today, one out of every 6 Americans is on Medicaid, and things are about to get a whole lot worse. It is being projected that Obamacare will add 16 million more Americans to the Medicaid rolls. \\nSo what about food? \\nEveryone has to eat, right? \\nWell, the hard working family in our example is faced with an environment where food prices are constantly rising but paychecks are not keeping up. Let’s assume that the hard working family in our example clips coupons and cuts corners any way that it can and only spends about $50 for each member of the family on food and supplies each week. That comes to a total of $800 a month for the entire family. \\nSo what about the government parasite? \\nGovernment parasites need to eat too. \\nWell, that is where food stamps come in. Right now, there are more than 46 million Americans on food stamps. Since Barack Obama became president, the number of Americans on food stamps has increased by 14 million. Food stamps have become so popular that rappers are even making rap videos about using food stamp cards. \\nOkay, so after all of this where do we stand? \\nWell, the average hard working family so far has spent $3500 out of the $4000 that they have to spend for the month. \\nWe still need to find money for clothing, for paying off credit card debt, for paying off student loan debt, for dining out, for entertainment, for medications, for pets, for hobbies, for life insurance, for vacations, for car repairs and maintenance, for child care, for gifts and for retirement savings. \\nBut wait. \\nThere is actually no money left at all because we have forgotten one of the biggest expenses of all. \\nTaxes. \\nWhen you total up all federal, state and property taxes, our average hard working family is going to pay at least $1000 a month in taxes. \\nSo that puts our average hard working family in the hole every single month. \\nMeanwhile, the government parasite does not pay any taxes because he or she does not earn enough money to be taxed. \\nAre you starting to get the picture? \\nIn many ways, life can be so much easier when you are constantly taking from the government instead of constantly giving to the government. \\nNew Jersey Governor Chris Christie recently put it this way …. \\n“We’ll have a bunch of people sitting on a couch waiting for their next government check” \\nOnce again, I am not dumping on those that have been through all kinds of nightmares because of this economy. As I have written about so frequently, the U.S. economy is simply not producing enough jobs for everyone anymore, and this is creating major problems. \\nJust about everyone needs a helping hand at some point, and we should always be compassionate to those that are in need. \\nHowever, there is also a growing number of Americans that are content to simply give up and live off of the government, and that is fundamentally wrong. \\nIt is not the job of the U.S. government to take care of you from the cradle to the grave. What the U.S. government is supposed to do is to make sure that we have a well functioning economy that operates in an environment where hard working individuals and small businesses can thrive, and sadly the U.S. government has failed miserably in that regard. \\nWe desperately need the U.S. economy to be fixed, but I wouldn’t hold my breath waiting for that to happen. \\nAs economic conditions get even worse in this country, millions more Americans are going to turn to the government for assistance and at some point the safety net is going to break. \\nWhat is our country going to look like when that happens? The Shocking Truth About Unemployment In America In One Chart » David H \\nPreach it Michael! I work in the finance industry and can’t tell you how many applications I see where the single mother of 1-4 kids, in some cases, from different fathers is getting child support, afdc, wic, housing assistance and has a boyfriend or ex- husband living with them and making 2-5k a month. These people live better than most others because they are working the system with no one to tell them anything different! In addition to this issue we have another large issue of people bartering or being paid in cash avoiding taxation completely. We are all going to pay dearly for our arrogance, indifference, and ignorance! Rancher \\nYou know what… there are and more often times I would rather burn my cash than send it into the govt to pay these bums sitting at home. We do every darn thing we can to keep it out of those leaches grasp…. Prepared Pastor \\nI briefly dated a woman with three children who I saw really gaming the system. Her subsidized townhouse apartment was nicer than my own home. Her utilities were based on her income and she made great dinners using food stamps. \\nShe was in her last semester of college to earn a bachelor degree when I asked her what her plans were for after college. When she told me she was going for another degree so she could stay on the dole I broke up with her. \\nI imagine she has a free cell phone now. Michael \\nI would say that you sure dodged a bullet there Pastor. \\nMichael Joel \\nIf you want to have an idea of the sress it can create for workers just look toward Belgium (Europe). It’s the country with the “best” welfare system. From your birth to your death you are under government umbrella. Of course this come at a price : the active workforce pay for it. \\nFor instance, did you know, an immigrant can receive money from the government (as a right to live decently) even without working. Then he can bring in his family if he was alone when he arrived (under the family reunion excuses), which in turn have some right also… The amount of money they can receive is between 900 – 1200euros per month… all of that at the expense of the workforce. \\nBy the way, the demographic pyramid his completely reversed. At first the Belgian welfare system was build around an era of full employment (50’s and 60’s), when the workforce was made up of young generations (babyboomers) and when everything has to be rebuild after the war. \\nNow, the babyboomers at become the papyboomers and have a right for their retirment, etc, etc. Yet this system being based on the active workforce (made up of less young people and underqualified), it is meant to crash one day or another. \\nTo see the USA going toward a European version of welfare system is a huge mistake destroying the foundation of your country. \\nJoël MisterD \\nUnfortunately, I believe this has passed the point beyond return. The best anyone can hope for now is a miracle or get ready for the inevitable crash. I pray that nobody nor I will be forced in the middle of the mess such as having to literally protect oneself from crazy people, etc. Ashley B. \\nFinally someone that is not afraid to say something about this! It sickens me to see people leeching off the system because it’s easy money and food and of course free. \\nI know of LOTS of people where I live that get food stamps, SSI, welfare etc. because it’s free and they don’t want to work (many of them are too lazy to take the trash out, seriously) \\nYet me and the rest of my family earn a living, work hard and have to look at these bums drive nice cars, sit home all day and pump out paychecks, I mean kids. \\nDon’t get me wrong, some people honestly need help and I often donate to the needy, but these are different from the pure lazy bums that just TAKE benefits because they’re too lazy to work. Jodi \\nI have to say I love the “pump out paychecks, I mean kids”. So true! I have a friend who is a retired nurse and she has seen a lot of young people in the hospital with child who had good intensions on going to college and getting a degree. Most of them go to school, get married and get pregnant before they even graduate. Without even thinking about starting a good life and financially being prepared, they get on medicaid & welfare because they don’t have the money or a job to take care of their child. Sheepdog 1 \\nI guarantee that the “Government Parasites” will pay… \\n…come Judgement Day. \\nMeaning of course, they will never pay. Recoveryless Recovery \\nGreat article, as usual! \\nOne of the MAIN reasons why the American sheeple haven’t REVOLTED yet is precisely thanks to all the government hand-out programs that currently exist. Indeed as you well said; many, many Americans actually plan their entire lifestyles around doing whatever it takes to continuously qualify for them. Unfortunately for the rest of us, as long as there’s a dumpster behind a McDonald’s that these SLOBS can dive into for free food, they will NEVER go hungry. And revolutions rewquire HUNGRY people. \\nCheckmate. \\nToday’s America offers only TWO viable expectations for achieving actual “hope & change you can believe in®”: one requires you to wield a passport & one-way ticket overseas, the other requires wielding an AK-47. \\nI myself will go with Option A. Paul \\nThe fostering of dependency on illegitimate governments installed through media fraud or outright election fraud (like you have in the US) is what it is really about. DAS \\nI will give you an example of the the system is flawed. My father worked full time all his life. Paid all his taxes, S.S. and so forth. When the doctors found his canser, it was to late, he had only a short time to live. He worked intill the day he fell and could not walk. We (his family) supported him with his finaces as best we could. Going to the goverment only for help with food stamps. They gave him 14 dollars a month! W.T.F. can you buy with that. We shopped at discount stores, were many people used food stamps. I watched as these people got in to nice cars, with nice clothes with BAGS full of food. Mean while I hurried back to my 12 year old truck (so i wouldent be late for work) with a small bag a crap food. I guess I need to lean how to milk the system too. R.I.P. dad mondobeyondo \\n$14.00 a month? GASP! The explanation that comes to mind is, the government must have been using employment and income data from 1912, not 2012. \\nThe reality is, Uncle Sam is flat broke. He has too much pride to tell you he’s broke. Bernadette \\nThat is just sick, I’m so sorry to hear that. That is so ridiculous I don’t even know what to say. GOD bless your poor dad, and you for having to go through that. I’m so sorry:( Jodi \\nIt’s true, I’ve known some people in my life that do as little at possible to get government assistance. Most of them seem very proud of it and believe they deserve it. My question is, what happens when government runs out of money and can’t pay all these people who have been dependent for so long? That doesn’t sound good! Nothing to see here, go back to sleep. Ron \\nThink Greece WM \\nJodi, Don’t go back to sleep when the money runs out. It is inevitable that the borrowed money will stop coming and all therse free loaders who have no clue of what it’s like to actually do something, will riot, protest, and burn the cities of America down. Consider this future event as a time of national cleansing, because the millions and millions of law abiding citizens who enjoy the 2nd Ammendment,and have worked for what they have, will surely bear arms to protect themselves from the entitlement zombies coming to take what they have… \\nThere will be a population decrease and a cleansing of the entitlement crowd. \\nBut, please do not sleep. This is a time to prepare and keep watch, things are going to get very interesting in this nation in the very near future. Jodi \\nI will never go to sleep. It seems like the media ignores this stuff and treats people like it’s time to go back to sleep. That is what I meant! 007 \\nHave you ever watched a zombie movie. It will be a lot like that when the government checks stop. James \\nThe poor and unemployed in the U.S. will never be able to get off of the government roles. We are experiencing what I like to call, “Reverse Industrial Revolution”. The Industrial Revolution was a time when farmers were attracted to the big cities for jobs that paid high wages, when compared to their farm incomes. Now, we are experiencing high unemployment from jobs that will never come back unless the energy situation is somehow reversed. These unemployed people will soon realize that they have to have someway to get food to feed themselves. Especially if food stamps and government assistance starts to disappear, and it will. These unemployed people should begin to relocate out into rural areas to find homes where they can grow and produce their food, and sell the rest for income. There is a situation starting to appear in this country where going to college is not a good investment anymore. The only real need for college nowadays is for medicine, engineering, and law. You would be better off taking out a loan for a farm. or opening a small business rather than going to college. Farm and agrarian related jobs can make good money, especially if you own your business. If this reversal comes to fruition, the small rural towns will come back to life and support families and provide a reasonably good life. Tom \\nThe only real need for college nowadays is for medicine, engineering, and law. \\nMedicine and engineering- yes, but law? The LAST thing this country needs is another lawyer (sorry Michael)! MANY of the problems facing this country were caused but lawyers and the fear of law suits! Tom \\nsorry again- by lawyers nowwthen \\nGood points. If you can’t find work with a useless bachelor’s degree you will still be accountable for paying back your student loans even after going through bankruptcy. If, like you advise, you instead borrow money to buy a farm or start a business your hard work would benefit you and your family and not a corporation that views you as an expendable business expense. And if your business failed those loans could be reduced or eliminated through bankruptcy. Too many kids are brought up being told to study hard so they can grow up and find a good job. Parents should be telling them to study hard and learn how to run a business that involves doing what you’re good at. S. Wiseman \\n“You would be better off taking out a loan for a farm. or opening a small business rather than going to college. Farm and agrarian related jobs can make good money” James, you are right on the money. I know many people who are doing just that – buying or leasing small acreage to grow crops (1 to 5 acres) and build cottage industries. They are sick and tired of being milk cows for the government leeches and are doing the right thing by starving the beast of what it needs. The major news networks will never report this trend but it is happening. The peaceful revolution has begun. Of course, the government may react with forced labor. Bernadette \\nWow, those are really good ideas, and I agree with you on so many levels:) Why are you not running for President? We need someone at the Helm with a sharp mind, with creative ideas. Not the ideas of destruction coming from Washington. Everything you said made so much sence. Now I know what to pray about:) Cinderella Man \\nAgreed going back to the basics of rural living will become a means to an end in the future. There is no hope in living in the superslum cities of tommorrow! ky survivor \\nOne step closer to total control. That is what a welfare state is about. God help us. Josh \\nI highly doubt that Jesus would use the term parasite to describe a fellow human being. DAS \\nYour right. He would call them leaches Another Richard \\nHow about “vipers” in Mathew 3:7? Jesus was not at all “politically correct” as we sweet Christians are Laodocian America are. Colin \\n…you have a better term? David H \\nTrue….but he would say get off your rear end and work for your living if you are able. At least volunteer your time to some worthy cause to help justify the free lunch your on. I have a relative that draws SSDI (Social Security Disability) and volunteers he says he does it to help justify his disability payments he recieves. We need more people in the world like that. 007 \\nHow about sluggardly leaches. If a man will not work let him not eat. Proverbs. Steve \\nYour blog refers to those who feeding off of the nanny state. What about the millions of government(valueless)workers making 75 – 150 K/year with all the perks and a rosy pension they can start to draw before they turn 60 (unless they double or triple dip). They’re just as parasitic as the the free loader on the dole. Altogether, these parasites make up more than half of America’s population. At this stage of the empires existence, I’m saying to myself, let it all collapse. It’s going to be hellish but the longer the government props up the dog poop with fiat money, the more chaotic it will be. Michael \\nSteve: \\nYes, you are right. I have written about the inflated compensation that government workers get in the past. \\nMichael Klean \\nAll systems are broken. There is no right anymore. Stop thinking there is a right way to do something. Going back to sleep is more interesting than earning a living. SpunkyBunks \\nMy lazy obese sister is one of these parasites. We are all ashamed of her and she knows it. Her worthless husband doesn’t even bother showing up around us anymore because he knows we think less of him as well. And they have five children, 3 of them are high school dropouts so far. Great welfare system we have in Amrica. It rewards these losers to sit around and breed more idiots too! Paul \\nNice family. \\nWhere have family values gone these days? \\nWhy should the tax payer pay for YOUR family, if you do nothing but complain about them? \\nWhat have YOU done to prevent your nieces and nephews dropping out of high school? Bernadette \\nYour sister is so lucky to have such a supportive family to help her through her hard times. I’ll just bet you all were that supportive of her during her whole life that’s why she’s been such a success. \\nGood job mom and dad:D Mattyboy \\nStart to hide your income. Make extra cash doing things (legal) that can be hidden. This has gone on for a long time in the EU. Taxes are close to 90% over there. I do not want to pay the Fed for a number of reasons. I wish we had a revolt of about 200 million that decided to not pay taxes. I guess we would only need 58 million. I like making cash that I do not have to claim. I would also support a flat tax and the abolition of the IRS. But, you can’t trust the Gov. they always “need” more money. Kathy Smith \\nI totally agree MATTY I wish there was a way to get everyone to not pay taxes for 1 pay check & not buy gasoline for 1 day.That would get some attention. Paul M \\nhttp://www.thoughtsfromaconservativemom.com/2012/02/number-of-americans-dependent-on-government-jumps-23-welfare-state-now-consumes-70-of-federal-budget/ mark \\nI have been a landlord since 1981. I no longer manage the apartment complexes, but I have seen all that Michael writes about in the past. It make me sad to see where this country has gone. We used to be a proud nation that could do anything, but no longer is our population strong in heart. We have become a weak useless country of people that think everyone else owes them a living. tappedops \\nFor the umpteenth time… dont get mad–get even,… and if you cant get mad, its because youve been labotomized by the air food and the water… your programmed…your under mind control— yea- laugh while you can. And you say how can i get even… well you cant figure that one out as well because the chemical weapons have totally removed your ability to criticly think… game over —your done—toast— go back to dancing with the stars… Rodster \\nGary2 is that you in the picture? DAS \\nI would gladly be in the picture! sistrunkqueen \\nI don’t agree with this article. I think any American who has paid their taxes should be able to get any type of government assistance. I am a tax payer. I also an unemployed, but if I need some assistance you betcha I will apply. My dad, who is a Vietnam Vet, can qualify for food stamps but he say “We aren’t that po’!” My mom wants him to get the aid. Anyway to help make ends meet should be explored. My sister has WIC. I need some government assistance. Where do I sign up? Oh by the way I got the free phone. It is great for local calling. McKinley Morganfield \\n” I am a tax payer. I also an unemployed…” \\nError! Does not compute. Error! Review data and resubmit. Cinderella Man \\nDude they take taxes out of unemployment checks… McKinley Morganfield \\nYes, they take FICA out. But in the end isn’t it really government playing a charade by simply giving them less? BTW, SS & medicare, which are supposed to be funded by FICA receipts, are both in the red. For every $1.00 DC spends, $0.40+ is borrowed money. Annual interest payments on the federal debt will soon be $500,000,000,000. Do you think this can continue another 5 years? 10 years? 20 years? Rancher \\nExcuse while I barf…. Rodster \\nThere’s a big difference. If someone is really down on their luck and needs help after doing all they could to get a job then I have no problem with what you just said. \\nIf OTOH, someone wants to live of the Gubmint so they can stay home and play Call of Duty MW3 and watch TV then you sir might just be Gary2’s brother. 😛 \\nI was down on my luck several times. At one point all I had to my name was a months worth of rent. You know what I did? I took “3” minimum wahe jobs just to pay the bills. And I refused to ask the Gubmint for assistance. I figured once I did that it would be a point of no return. Mal R. \\nshouldn’t your name be WelfareQueen? Tatiana Covington \\nVery well, let them starve to death and be done with it. \\nThat will get rid of the unfit weaklings. Klean \\nYeah more food for the powerful and parasitic. 007 \\nThey won’t go quietly into the night. They will turn violent and be hunting you they will not have the skills to do do anything else. \\nCan´t believe your comment got through the moderator, tells me a certain thing about the moderator himself. Tatiana Covington \\nPerhaps the world should be made free of Reds. Ryan \\nIt appears that the author and the writers of the two comments have been seriously sniffing……. something. This article was a waste of time to read as it is merely the standard diatribe of “hard working family” against the “filthy masses”. You guys have been drinking the Wall Street/GOP/DLC Kool Aide. Tom Lowe \\nBaloney! There is a vast sea of professional freeloaders dragging this world down! Tatiana Covington \\nhttp://www.youtube.com/watch?v=NzspsovNvII&feature=related Hognutz \\nYes I am one who drags himself out of bed everymorning to go to work so the parasites can feed a little longer. But I have a feeling it will end very very soon… \\n“Keep working there are millions on welfare depending on you!” Already Gone \\nThe economy is simply not producing enough jobs for everyone anymore and this is creating major problems. the problem with companies leaving this country started when obama took office and implemented his harsh environmental rules if the environment is such an issue then way did they not start implementing solar power,wind power,etc 20 or thirty yrs ago? the technology has always been there during WW2 germany was already making bio-fuel from potatoes and other vegtables,methanol gas from cow-shit my uncle told me back in the depression days they would create battery banks and hook up a generator to the windmill and charge the batteries to power the lites in the house at nite.As i had wrote before during Jesse Ventura’s days as Gov of Mn they had what was called the greyhound-chicago pipeline where people from chicago would come up and use family/ relatives adresses/claim they were residents of Mn get there welfare check and go back to chicago one individual said at the time that he was going to retire in Mn becasuse it was so easy to get welfare-26 yrs old! At This Time the Democrat party is pounding the welfare drum again, they want to add more people to the welfare rolls in this state, who in the hell is going to pay for this? This state is already having money problems we do not need anymore.Since i have been told that i am confused let me relate a fact to you sharonj one reason george bush would not sign the kyoto treaty back when he was president was because of the irreversable damage it would do to the u.s economy now obama has done this in his own way and look at what has happened and mix that together with the ptb’s desire to create a global economy somebody has to pay the price and it is obvious who it is. I Am Neither Democrat nor Republican as i do not care for either, old phart why don’t you tell them to point the gun the other way? Some people in this country are stupid and lazy and need to get off there fat asses and quit stuffing there faces full of potato chips and get a education and a job, the truth hurts doesn’t it. I Am tired of seeing more and more of my hard earned money going to deadbeats so they can live a nice easy life and not have one ounce of respect for the people that are making it happen for them. Gay Veteran \\n“…the problem with companies leaving this country started when obama took office….” \\nThat is pure BS and you know it. I’m no Obama fan but outsourcing did not start with him. McKinley Morganfield \\nTo protect fools for the folly of their actions fills the world with fools. If you want more of something subsidize it. If you want less of something punish it. We, in the name of compassion, reward fools who have made bad choices. We subsidize those bad choices generation after generation. We punish frugality and hard work via regulations, taxes, and low interest rates. \\nDemocracy is dangerous when it creates a class of citizens who benefit from the frugality and hard work of others. Robbing Peter to pay Paul only works until you run out of Peters to rob. I have compassion for those who are truly needy through no fault of their own, but leeches must be starved. Blood sucking ain’t the way. mondobeyondo \\nThe system seems to be geared toward rewarding the parasites. There are those out there who truly, honestly are in a hard-luck situation, and need a helping hand, so to speak. \\nAnd then you have the parasites and leeches. Those who decide to make government dependence their career choice. The ladies (ahem – I use that term loosely) who are accustomed to pumping out a baby every couple of years so they can get better benefits. Food stamps, Aid to Dependent Children, WIC, child support (hope you had a “sugar daddy” knock you up!) All coming their way in 9 months! And they didn’t even have to move their bloated gluteus maximus (okay, obese donkey) off of the couch. Life is grand! \\nGovernment assistance programs were not created so that these leeches can suck the lifeblood out of the hard working people. Another Richard \\nGovernment assistance programs were created to make the Masses dependent upon the Gubmit. Roosevelt once said that “nothing happens in Gubmit by accident”. Gubmit undrestands human nature very well and how dependent humanity becomes on freebies and will cooperate with the gubmit to attack the honest hard working people who produce things and are the Real tax payers. When the producers of goods and services want the Freebies stopped by the gubmit, the leaches and parasite Masses will defend the Gubmit giveaways to the Death. Gubmit knows that. whens dinner? \\nIt’s a simple as this: “everybody wants to eat the corn, but nobody wants to plow the fields”. Tom Lowe \\nA lot of us don’t mind plowing the fields! In fact we actually enjoy doing so. mondobeyondo \\nI hope my federal income tax money (yes, I have to pay this year) doesn’t go to helping those lazy pathetic sloths. But you know and I know that’s exactly where it’s going. \\nNow I’m starting to get angry. You won’t like me when I’m angry. (Thanks, Incredible Hulk!) \\nTo those intentionally taking advantage of the system: Someone is going to play Johnny Cash’s “Ring of Fire” at your funeral. Just sayin’…. 007 \\nThe most infuriating aspect of this welfare system is that it is unrealistic and unsustainable. The welfare state slowly but surely strangles the economy. The higher taxes and regulations and overbearing laws destroy the ability of businesses to survive. Inevitably, the unsustainable benefits will end just like they are ending in Greece. What will the parasites do when the freebies stop. They will starve like domesticated pets do or they will turn violent. Either way it will be a night mare similar to post apocalyptic zombie movie. It will be a pitiful life trying to avoid being eaten alive by these same parasites that are currently living off of the government tit. Tom Lowe \\nI believe that is one reason why they have built ‘Camp FEMA’. 007 \\nGreat article Michael. You certainly articulated the crisis which is slowly strangling the life out of the country. I read your article and feel I am able to look into the future and see how this nightmare ends. At least we can see it and prepare ourselves. I will share this article with everyone I can because it so clearly frames the fight for our countries ultimate survival. Michael \\n007: \\nThank you for sharing this article. The article may seem a little harsh, but the truth is that our society could use some “tough love” about now. \\nMichael \\nyou need to give the tough love to the real parasites–corporate welfare Michael \\nI think that you will find that I did that in the article I just posted. \\nMichael 007 \\nWhat a tremendous slap in the face to everyone who works and struggles every day to make a living and provide for their famalies. Pat \\nLet me also add that: \\n1. in Europe a garbage man makes as much income as a physician. Neither can be fired for incompetence. \\n2.Income taxes in some places can be as high as 70%. And they have no deductions. \\n3. The government is in direct competition with business. \\n4. There is very little fishing or hunting. Pollution is rife. \\n5. Few if any go to university. \\n6. You must register where you live. \\n7. Even your name change has to be approved by the courts if you want to use a name that is not on an approved list. \\n8. And most of the people live in small flats often without bath tubs. \\n9. In Spain we have no kitchen. In Denmark we had no shower or tub. \\n10. All protests must be approved by the government. \\nWelcome to your future. \\n…as it is so in many sectors of the U.S. education system. \\nHow many schoolteachers are fired for incompetence? Not many, I suspect. \\nTeachers teach the leaders of tomorrow. Our future teachers, teach future biologists, musicians, artists, plumbers, scientists, Web page designers, doctors, veterinarians, you name it. \\nFor the job they do, most teachers are highly underpaid. The athletic coaches and deans are well compensated, of course. \\nMaybe it is not so important to most of you. But try having garbage workers go on strike for a month. You will soon realize how essential they are. View from Abroad \\n@1) How did you like your stay in Albania? \\n@2) You seem to speak of some of the Scandinavian Countries (Sweden, Finland, Denmark, Norway)…but there the vast majority, even of those who are in the top-income-tax bracket, approve of it, because they see that they have a superior education system and an overall very efficient government and even welfare system. \\n@3) Yes, right – government chooses to do e.g. waste management themselves, ecologically and recyclable to the max…instead leaving it to the likes of “Barone Sanitation” (remember your “Sopranos”, do you?). And you really think, YOU are better off in this matter???? \\n@4) In most of rural Europe there is as much fishing and hunting as in rural US. Of course maybe not so much fishing e.g. in the Thames or the Rhine – so what? Go fishing in downstream Hudson River, and see what you catch. \\n@5) Surprise: quite a LOT go to university – and WITHOUT burdening themselves with student loans for the rest of their lives, because it’s mostly FREE (except for some “Elite” institutions, where the only meaning of “Elite” is “Rich”). \\n@6) Yes. So what??? \\n@7) Yes…there was a couple of immigrants in Cologne (Germany) a few years ago, who wanted to name their newborn son “Osama bin Laden” ( http://www.spiegel.de/panorama/0,1518,212569,00.html ) – sorry, you are right, they were wrongfully turned down by our brutal, fascist, jackbooted Civil Servants. Horrible. \\n@8+9) Well, YOU get what YOU can afford, even in Europe. But I have heard rumors that somewhere in Germany and even in France there are flats with a water closet(!!!)…never seen one myself, poor me old European… \\n@10) Oh, yes…horrible. Luckily in the US you can rally any amount of people at any time you like – to let them get tasered down by the thugs you call “Police” Gary2 \\nStop speaking the truth you are ruining a lot of low information foolish republican conservatives world view. \\nYou are 100% correct. \\nLike I said before reality has a well known liberal bias. Marcus \\nThat was eastern Europe 30 years ago… In Scandinavia we’re doing quite well atm. I would say there’s less welfare here than in the USA by now. And I pay 30% tax. For these 30% I get healthcare as well. I live in a nice house, I have a new car, I eat good and healthy food. Almost all services are private, even the ones financed by taxes. And I’n not considered rich here. I’m middle class. \\nIn my opinion the middle class is actually growing here. And, by the way, my country does not have any oil. \\nHave you ever been to Europe? Maybe Romania then… Idiot… Gwyn \\nI am so sick of hearing how wonderful is to be living on Government hand-out. One I start working at 16. At the age of 50 my health and back went. I have done manual work all my life and now I can not stand for 5 min. before I need to sit. And for all that I live on $718. a month and get $50. on food stamps. And in the winter I may get 500. for winter heat. My house is $300 a month in cold of winter. They used to give $150. for cooling in summer but that end so they could help more people with winter needs. I do not own a car, could not afford repair it if broke down. So that mean friend who I pay gas money to or a cab if shopping or bus to go doctors. Also medicaid is no wonderfulness either I am grateful for it, but I have go to a clinic and wait for a month or six weeks for appointment or go emergency ward. Also my pills can be change any time state decide that they get better deal from another company. Not if it good for me or not. I am not living in one of those towers and paying 1/3 of income. I am lucky my family left part ownership of house to me. But I have property Tax to pay and house insurence and repairs and I do not get free phone or internet,I pay for it and the taxes that go with it. I do have to pay some money to doctor and pills but not lot I agree. But living like this means you are my entertainment. I bake my own bread and clean my house from chair. Also my clothes are second hand. Goodwill have lots of visit from people now days. I get sick of this idea that poor pay no taxes. What bill do get that does not some kind of tax on it. Anyone useing those same service have to pay them as well. Are they has much as yours? no. but they all so have less. Less to have fun on less to go out on and less to buy lots food with. Live on $50 see how far that take you. The rest comes for that monthly check I so lovely dream about every month sitting on my sofa. Till you be there you have no idea what like to live it. Not the pain I live with or problem that come with living. I look forward with fear as I watch the state and Federal government talks about things they need to cut so they can give people who live fancy house more money and want to vote for man for President who has bank account in places,like that Island and country with special banking laws. Make no mistake I know that cuts are coming but I am not going easy into that goodnight, so our million dollar congress men and women can keep there golden rewards. I know neither of the parties are our friends but I also know games have been play and working people money got rip off instead of yell for their heads so offend you worry about those who have less then you do. denny \\nThe article itself betrays its own horse . If families had that many liabilities every month, they wouldn’t be paying very much in taxes. The 1% have that part down though as most of them don’t pay near as much relative to what a $50,000 wage earner pays. It’s also suspicious that this article doesn’t mention corporate welfare which usually receives twice as much as the social welfare recipients do and let’s not forget what all those lobbyists are for. What’s a Lockeed/Martin contract except glorified corporate welfare or the blackmailing which corporations pull on municipalities when they promise to build a factory in the environs ONLY if they are exempted from paying local taxes. Nah, this article is just more of the Republican AND Democrat crap of blaming those of us who have been hit the hardest for the consequences of the war which the wealthy have laid our lives, infrastructure and jobs to waste. Surprised to find it on this site. Tom Lowe \\nThe article is quite clearly directed at professional freeloaders, and not at unemployed people. Jeremy \\nWhile I disagree with much of Michael’s predictions and assertions in his articles (because our nation has come from the brink many times before), he writes on elite welfare and wealth hoarding all the time. \\nHe is fair. Leonard \\nDear Michael \\nIf you take away every single benefit of all these people, you will end up creating plenty of criminals on the streets who will end up in jail getting free food, free air conditioning, libraries, internet, and free health care for many many years to come. You mentioned an article some time ago how somebody checked himself into jail with some kind of a fake holdup in order to get health care in prison. Who do you think will end up paying for this? The banksters? The fat cats? The corporations? Good luck. Remember this: EVERYTHING HAS A PRICE! \\nA job is a social program! Somebody has to give it to you when they hire you. When jobs are shipped overseas, then millions are out of work. If people are so happy with lay-offs, they end up paying for it one way or another! How many people are going to become successful like Bill Gates or Steve Jobs? Almost everybody? Good luck. Remember to play the lottery next time, anybody can win $200,000,000,! \\nLet me give you a solution, Michael. Let’s bring ALL the jobs back that have been outsourced over the last two decades. Is this going to happen? Of course not! Michael \\nLeonard: \\nYes, that is why I write about “free trade” and our trade deficit over and over so that people can understand what is happening. \\nMichael VyseLegendaire \\n“As economic conditions get even worse in this country, millions more Americans are going to turn to the government for assistance and at some point the safety net is going to break. \\nWhat is our country going to look like when that happens?” \\nEgypt. We will have chaos in major metropolitan areas around the nation. Or maybe we are so drug and entertainment-infused that we will simply throw up our hands and pull down our pants for big daddy government. \\nOh, and did you forget to mention the amount of people taking subsidized anti-psyochotic medication? When people suddenly come off of their expensive drugs, let us hope their violent outbursts do not reach the level of other well known mass murders associated with coming off of these SSRIs, like Sgt. Bales in Afghanistan. curt \\nYes insurance costs have gone up. Why? People are unemployed. Why? Why not, their example has been an industry whose greed is boundless. Lets not forget that if only the top couple of percent of income makers paid their share it could mean clean water, education and health for everyone on this planet. Certain parties have been trying to sink this system without coming up with an alternative and why in the world would anyone not greedy want privatization of natural resourses. Its industry that’s ruining this country and the greed that is their legacy. stan \\nAnd on top of that, race wars and riots are coming to a city near you. This from the Black Panther: \\n“If you are having any doubts about getting suited, booted, and armed up for this race war that has never ended, let me tell you something… The thing that’s about to happen to these honkies, these crackers, these pigs, these pink people, these mother ’ turtle people – it has been long overdue.” \\nIf you happen to be one of them honkies, or crackers, or pig, or pink people, or mother turtle people, you might just end up dead, for no reason other than your whiteness. Nexus789 \\nAmazing number of self righteous pompous individuals. The US has never had welfare state. It is more like a dependency system that has evolved to placate the masses as the US economy has declined and people have adapted to ‘game’ the system. \\nWhat do you expect will happen if millions of jobs and tens of thousands of factories have been closed down and off shored to China, India, etc. What are the millions of unemployed going to do. The payments, food stamps, etc, are ways of keeping the idle masses passive. \\nAt some point this will end as the US is bankrupt and austerity measures will be introduced and many of these payments will be withdrawn..no food stamps, no unemployment benefits, no medical support, etc. Then you will all get you wish and reap the consequences. Paul \\ndoes a common shareholder contribute to the success of a company? \\nIsn’t the shareholder the true parasite? \\nHe draws money out of the company and does nothing in return? Paul \\nDo you have any dependents? \\nYes, shareholders, managers, chairmen, bureaucrats and politicians. Paul \\nIn Hong Kong, \\nevery citizen has the right to medical treatment in public hospitals (only entrance fee of USD10 to be paid). \\nThere is no VAT in Hong Kong. 66% of Hong Kong people do not pay any income tax. Max. income tax is 15% of gross salary. Minimum is 2% \\nThe Hong Kong government does not have debts. Last year they had so much money left over, they paid every Hong Kong citizen over 18 about USD600. In addition they gave every tax payer a tax rebate of USD600. \\nWhat are they doing wrong? de Malfosse \\nre: “Ever since the “War on Poverty” began our debt has exploded”… certain amount of accuracy in writing this BUT the “War on Poverty” ran alongside that other horse in the Imperial race: the Viet Nam War, and the Viet Nam War is the direct source for Americans monetary difficulties today. \\nI argue the debt explosion has much, much more to do with the maintenance of Uncle Sam’s Empire, an Imperium where tremendous amounts of American taxes continue to flow outward, then it does with the neighbor on welfare. \\nI suggest the “welfare bum” is an easy & obvious target deliberately promoted by Uncle Sam so as to divert attention from the Empire and it’s 70+ year history of perpetual conflict, war, and interfernece in the affairs of other nations. \\nExample: Country XXX (so as not to offend anyone) has itself received an average of 5 millions a day for more than 60 years off the American taxpayers back. Now if that doesn’t qualify as a “gov’t parasite”, what or who does? \\nIs your neighbor on welfare more damaging then an entire company, say Lockheed-Martin, which hasn’t been off the gov’t teat since Truman was president? Tom Lowe \\nExcellent points although they are clearly not directly related to the topic. \\nWhat I actually see on the ground here is me working night and day for $800/month after 6 years of college long ago while the completely able bodied guy over there who never bothered to go to school does nothing all month but smoke dope and gets $900. NeoIsolationist \\nI work. My wife worked for a long time and is now on unemployment. She would be one of that 49 percent collecting government benefits. She doesn’t want to be on unemployment, and intends to vote against the current administration come November. While lots of that 49 percent wants to continue scamming the system, I’d say there’s some in that group like my wife who don’t. I don’t think 49 percent in and of itself will be enough of a percentage. I could be wrong of course, but I recall hearing that Obama wanted to get about 75 percent of the population getting some kind of government assistance. I think he would agree that 49 percent, while alot, is not enough. Michael \\n“””””In America today, we deeply penalize hard work and we greatly reward government dependence. “”””” \\nsame Thing in france, for a longtime As a disabled, i could have until $1000 from government as benefits …. but, no support to get a job, and once i get my own business, many taxes and no more benefits because of my disability \\nstupid world chris \\nGreat article Michael as usual. But imo it’s overlooking a critical component to this problem: the breakdown of the family structure. I know your fully aware of this but I just thought it could use some mention. It will be a cold day in hell before I or anyone in my family accept any sort of assistance from .gov. jazzage \\nYou are missing three important areas of government dependance in this article. One, the liberal blue states pay more in federal taxes than they get back. That excess goes to the conservative red states that whine about the government but could not exist without their excess of government contracts, military bases, etc. The states of the old Confederacy get almost $2 back for every dollar they pay in. Two, the greatest amount of welfare in this country is money taken by taxing the middle class to subsidize the rich and big business. An example is the private prison industry. We privatize the prisons, the private companies that run these prisons then become lobbyists to bribe the “lawmakers” to make more laws making more things illegal so they have more prisoners and more revenue. Three, people with kids have more deductions and pay less taxes to the point where they have essentially zero taxes. Who has the most kids? Mothers on welfare, yes, but also Republicans who get away with paying little or no taxes. Guess who makes up the difference? Those of us with fewer or no kids, generally more liberal people. We also pay full freight on property taxes that fund the public schools. \\nThe hypocrisy of conservative morons is astounding. I say let’s get rid of public funding of schools, end all corporate welfare in all its guises, and set the losers in the Southern states out on their own and watch the size of the federal budget plummet. Gary2 \\nyou are 100% correct. Michael will never acknowledge that you speak the truth as he does not let facts get in his conservative leanings. \\nHow about the welfare of churches and pastors houses, err mansions being tax free. I do not want to subsidize some rich paster of a megachurch. \\nPOOR Michael–what ever are you goiong to do when the real facts about welfare are pointed out?? The church is the biggest welfare scam of all. jazzage \\nYou are right, I forgot about the Churches that pay no taxes but yet butt their way onto every political conversation and use the power of the Church to promote their idiotic ideas. \\nWelfare for those on the bottom exists to prevent rioting in the streets, and welfare for those on the top is the reason the government exists. Gary2 \\nits not just churches but pastors homes. Tax payers subsidize these mega church mansions as they are also tax free. Barn Cat \\nThe new gold rush is trying to qualify for SSI by being considered legally disabled. Tom Lowe \\nI sprained my ankle walking to a job interview. Can I qualify for SSI?!! Dave \\nHello All. \\nI have been reading this blog for some time, it is good to read some non-mass media propaganda. I however do not subscribe to the notion that USA or the rest of the world will descend into anarchy overnight. It will continue to be a gradual decline over the next 3-5 years, as it has been so far. \\nIt is not merely policymakers to blame, but a system that only operates on perpetal growth fuelled by cheap energy. As this energy rises in not only monetary cost,but also energy input costs, economic contraction is inevitable. \\nPeak oil is definitely here. Shale and tar sands proves they’re getting desperate. \\nOver time, perhaps people may need to return to the rural agrarian lifestyle they had pre-indutrial age,in order to survive. But the sun will stil rise and set. \\nI don’t think that anarchy will come either, at least not where I live. Just a slow decay of order. Whatever happens, I would rather die helping my fellow man, content with this life I’ve been lucky to have, than to go down defending my “stash”. \\nAs for all this Dec 2012 rubbish, FYI our calendar (gregorian) ends every 400 years. Funnily enough we’re still around. Another Richard \\nThe Powerz that be, hold the rip cord on this Gargantuan Unpayable Debt of the USA and Europe. When they are satisfied with the ever growing level of this Debt – They will pull the rip cord on the Trillions of $ of Derivatives By The End Of 2012. That is their timeline to commence the New World Oder, I mean Order. I believe we will All be startled and frightened by the Suddeness and the Severity of the Collapse. Jack the Leper \\nThe United States Government is the parasite on the hard working people. Gary2 \\nJournalist Chris Mooney discusses his new book, “The Republican Brain: The Science of Why They Reject Science — and Reality.” \\nIn his new book, The Republican Brain: The Science of Why They Reject Science — And Reality, science journalist Chris Mooney surveys this growing body of data and explains its significance. \\nI think the authors mistake is assuming republicans have a brain to begin with. chuck \\nIsn’t the government our biggest parasite? Michael \\nThe government feeds off of hard working Americans. It’s their lifeblood. Chris \\nHmm… although this won’t be a popular thought, I really feel that the government should not hand out a dime to anyone for any reason. This was what the church was suppose to do. It was suppose to help those, widows, disabled, poor, etc. But, in our “anti-Christian” society now, we’ve given, or better stated, expect the government to take care of these and pushed the church out. The church still should be taking care of it’s own though. No matter what kinds of rules the gov’t tries to push. \\nAs a side note, what really burns me is that all the so-called atheists, anti-Christians, etc would try to justify that Jesus would have wanted socialism and that the government should take care or it’s people via handouts. That is a completely different Bible from what I read however as the Jesus I knew was very clear about people taking care of themselves and their family. If hardship hit, then the church – more specifically, other church members (others in your congregation) were suppose to then help you out. But, sadly, most “church” goers are now so self-absorbed and Bible deficent that they aren’t willing to help other church members because they think the government should. \\nUgh – catch 22. \\nSorry – my ramble on to a great article that hit a nerve! Eric Ferguson \\nThis article is an example of why America is going into massive debt. We have gone from a nation of makers to a nation of takers. People are content to sit on their but and receive enough money from the govt to live on. Yet it is people like me who go to work to support these lazy a$$ people. nowwthen \\nThis is not the country I grew up in. As I’ve said before I remember the days in the 60s and 70s when anyone with a high school diploma (and many without one) could find a job with a living wage. There were smokestacks and office buildings all over the country that needed workers. Most from my generation hate that things have devolved into the semi-socialist society Michael has painted here. The corporate lobbyists have convinced our country’s leaders to buy into the belief that tossing U.S. workers into a world labor pool is somehow good for us. Tens of millions of jobs have been lost as a result. Add to that the technological unemployment caused by all of the robotic and computerized replacements for human labor and it’s no wonder that unemployment and underemployment remain at record levels. A person who’s exhausted his or her 99 weeks of unemployment after losing a job they held for 20 years is likely to reason that “the government caused my job to go away so the government must pay me for what they took from me.” I guess it’s what they refer to as a “moral hazard”. I’d like to think that most Americans would still prefer to work at a job that paid a decent wage rather than stay on the dole. But sadly that will not happen as long as good American jobs are being eliminated by lopsided “free trade” policies and productivity gains resulting from more automation with less human labor. Jeremy \\nYou think clearly and make good points. Winston Smith \\nthough I can agree with your assesment of lack of jobs and good paying ones at that, the problem in part is the result of your statements-we have encouraged and trained people in this nation not to be their own bosses, but employees (wage slaves) dependant on others. Guilds- destroyed largely during the “reformation”, which then ushered in a dog-eat-dog, selfish economy, highly individualistic. Said guilds then and could now, provide training, placement, apprenticeships and benefits (health, insurance,etc). During the 20’s and 30’s, the RCC laity had land associations in the USA and Britain-due to lackluster support of clergy, none from Protestants and a depression/WW II, those died on the vine. Their purpose? to train men how to famr and then, to buy/rent a farm to provide for themselves and others. Ditchling survived, in sorts, until 1989. The men might have gotten training, but nowhere to go and nothing to buy/use/rent afterwards. They then were continually unemployed and stuck in filthy cities. \\nOr many has to rely on a lot of ready cash, equity and suck to buy a franchise. A lot more to get a loan from them or a whole lot more to buy their own buisness, plus where then is training? Open a bar/grill? great, would love to do that-do not know the first thing about payroll, taxes, with holding, how and where to order products,etc…. pete \\nYes. This is all true and accurate information. \\nHere’s some more: \\nAfter 27 months of being unemployed, the jobs I am being offered are for about 1/4th of my former salary, while the costs for about everything are about twice as much. \\nSo, my choices are get back to work and suck it up like a good sheople…..or do my best to drive a spear into the beast’s heart and try to kill it. More of a mercy killing actually. \\nIt boils down to this. Do you buckle down, stiff upper lip, shoulder to the wheel and nose to the grindstone…..or give up? \\nI’m going with the idea that supporting the crooked, decietful and errant policies is a loosing game and I am going to be merciful by helping put the ailing beast (US ECONOMY)to death. Right now it’s a wounded and dangerous animal. \\nDon’t get me wrong….if it was possible to nurse it back to health…I’d be on board. However, Bernanke and the politicoes have decided that injecting growth hormones and a diet of five hour energy drinks is practicing good medicine….so am I evil by wanting to see a suffering animal put to sleep? Tom Lowe \\nThis happened to me 25 years ago and I swore then to kill the Beast and I know I am going to win. Tom Lowe \\nBTW I got zip in unemployment from the Corporate Pigs. \\nZIP \\nyou got that right–the jobs are low pay walmart crap. Jeremy \\nYour anger is about where I was last July. But, you are still accountable to God for your actions, and He requires that you work and do your best (Apostle Paul: if you don’t work, you don’t eat). \\nThe misery on this website will not help you either. I used to visit this site daily, but I realized that, while providing some key facts, it is no more knowledgable of the future than you or I. \\nDon’t give up. Many days are difficult, but trust me, you WILL find peace in the valley, on the other side. Now I am encouraging people who actually have good jobs. THAT is service, and is a blessing. \\nI take the bar exam in July, and look at it more as an adventure to where God will take me. Gemtap \\nTrack what they use….make them pay it back whent they get a real job…if not debtors prison! Cinderella Man \\nGood topic, Michael. Now I know why my Dad gets so infuriated around tax time. When I was out of work and unemployment expired, I worked in the “underground economy” paid under the table because that was the only work there was. I breifly had to get SNAP assistance cause I had no other way to feed myself. Now that Im working again reading articles like this I often have to ask myself Why do I work? Tax time pisses me off too… I already told you about the welfare mama that got back $8,000 on EIC. She also gets section 8 housing assistance, and food stamps. So basically all you have to do is produce illegetimate children, apply for aid and presto! Set for life!! Keep working fools, millions on welfare depend on you! Michael \\nAlmost everyone needs help at some point, but the key is to pick yourself back up and get off of the help and that is exactly what you did. \\nI don’t blame those that are going through temporary troubles. But those that have gotten comfortable living off of the system year after year and they never try to get off of it trouble me. \\nMichael davidmpark \\nNot exactly. \\nI’ve been on both sides of this lately, so here’s how things really work. \\nI worked as a government contractor until my wife became severely disabled about 5 years ago. So, I left to get a part-time merchandising job with a big box to be closer to her and our young kids. \\nThat “safety net” where I live is not very big. \\nLIHEAP’s funding, at most, is about 2 months worth of utilities per year. The paperwork cost us about $30 to process and mail, after 4 hours of filling in and photocopying. \\nMedicaid is very limited to kids and the disabled – I’m not covered at all. Every 3 months I have to fill out a 15 page review and send in all related documents to prove everything that I claim. Most of the time, I’m either missing a document or not enough info, so it lapses for about 10 – 15 days. \\nSocial Security – Disability has been a trial and half! We finally got full disability after 4 years, more than 1000 documents, and a law firm. For this, it’s not much; about $1100 per month. And since there really isn’t housing assistance from everyone else already on that program (been on the waiting list for 4 years), almost all goes to rent. \\nOur kids do an online charter school (and doing well, they can actually read and do the math! The school district is an abysmal failure), but we can’t qualify for discounted (not free) internet because we have to cut service for 3 months before we can apply. We can’t do that unless we let the kids fall way behind. \\nWe don’t qualify for the cell phone discount (again, not free) cause I’m still working part-time. I need to quit to get that one; but if I do, the wife looses medical coverage and a few others. \\nIt’s not a fun system: and I don’t spend time waiting for a check – I spend a lot of time trying to build what we can afford to create our own utilities and grow food, looking for a better job to work-from-home because, as I said before, she is severely disabled and needs me here! I get up at 5 AM, got work ’till 11 (if I’m lucky and she doesn’t have a seizure or something – then I have to stay home all day), then clean house, help the kids with school, fill out paperwork, cook what I can, and then, if I’m blessed, do some stuff in the workshop and then go to bed at 12 AM. \\nThis is not a paradise; it’s near to hell! I don’t know who is profiting so much from being on these programs, but I know it ain’t us! And from the experiences while working for the federal government, I’m sure it’s the bureaucrats running the programs that are living the sweet life! Some of those guys make over $100,000 per year salary alone and spend most of their time in meetings. Tom Lowe \\nYour case just illustrates how those who really do need help have such difficulty getting it in a system clogged with rank freeloaders. \\nI know numerous fully able bodied mentally competent people who get SSI of $900 +/- or large Veteran mental disability payments up to $2500 and more who do NOTHING. Most of them are actually alcoholics or pill people. \\nI knew a guy who gets $2500–plus SS–for some concocted mental disability (PTSD from a military helicopter accident? Come on, liar-actor! This was not even in combat). He came to me on the 11th of the month whining that he was already broke. Well he has lived in a van for the past 43 years while he freeloaded off of the phony PTSD disability. So he spent $2500 in 11 days living it up to the tune of $225+ per day and shows up broke and whining on the 11th here where we self sufficient people have had way more than our share of dumpster meals just to keep this roof over our head. \\nI sent him to Camp FEMA, so to speak. \\nI often have to work for myself for as little as $1-$2 per hour, and have for many years now. All you out there who think there is some sort of automatic minimum wage had better realize there is no such thing if you intend to survive. davidmpark \\nThanks Tom mondobeyondo \\nAll one needs to do to see government efficiency at its best, is to go to the local Department of Motor Vehicles office to get your vehicle registered. There are 30 counters available. Two employees, at two counters, are assisting customers. Some 600 or so people sitting, staring at screens, or chasing their kids. Already a bad sign. \\nPress the little green button on the machine near the entrance. Your ticket reads “number 863″. \\nThe loudspeakers announce, “Now serving number 108″. \\nCome on – even the Post Office is better than this! Gary2 \\nthere are only 2 employees at the DMV because right wing gov like the soon to be replaced walker cut cut cut. \\nStop voting repube. Diane C \\nIt is really people like you who do need the help, and are not able to get enough. The problem is the entire system (government) is broke. There are those who really take advantage, and there are those who really need it. You would think because the government is so big and bloated, they would have enough people to check on these things. However you would have to be efficient in order to do that. Our government certainly is not. \\nI wish you and your family the best. davidmpark davidmpark \\nOkay, I need to clarify some things. \\nMy wife has an actual disability: severe traumatic brain injury, that caused epilepsy and a few other things. She was in a coma for almost a year and had to relearn most everything. It will cost her her life. It’s real – not easy to fake those CT scans and the other numerous tests. \\nSecond, I don’t know how to game this system: I give ’em all the requested info, they tell me what we can get. Honesty doesn’t pay off with these guys: and that’s the point! \\nWe HATE being on these programs! Using that EBT card in public is the most embarrassing thing; and the stares the cashier gives me is just damning. I hide the card best I can when swiping it and then quickly stash the eyesore away. When the receptionist at the doc’s office asks about insurance, I always whisper the answer. \\nIf these gov people want to do something right and good (for once); then pass a law that voids zoning laws for families that have a legitimately disabled member. I am capable of rearing animals and producing things here, but am limited because these guys want us on castrating programs that serve themselves! \\nWe have food storage, but it’s pretty basic now. And as someone here mentioned: if we don’t have these programs, they’ll take the kids and force my wife into assisted living – a kind of partial divorce. \\nThis isn’t the society I wanted; this is where I’m stuck! Phillip Sherwood \\nThe people I personally know who “work the system” aren’t getting rich but just treading water since they double up with family members and work low wage jobs. If they didn’t “work the system” they wouldn’t have enough to eat or their children wouldn’t be able to access health care. Many are caught up in drug abuse or alcoholism and are hardly able to maintain themselves. Some work very hard at low wage jobs and some don’t work at all. I agree at one level that throwing money at these people is worthless but cutting them off is just as bad since the children are the ones who suffer. I remember at the church I grew up in that what worked wasn’t monetary policy but individual assistance and genuine caring. Our pastor went to great lengths to assist a member who had a mentally ill mother and neither the pastor nor the church got a thing out of it except the right thing was done and people knew that this man and this congregation cared. My youth pastor said “am I my brothers keeper?” I thought he was referring to the specific scripture and I fumbled the answer but the Bible is clear from cover to cover what the answer is. Tom Lowe \\nYou missed the whole point of the article. It states that there are too many freeloaders burdening a well-intentioned system designed for the truly needy. It never says or even implies that needy people should not get help. What it says is that people who AREN’T needy are robbing the system. Stan522 \\nI agree with you. Government sustenance programs are over burdened. However, over burdening is inevitable. Since government defines “success” only when they can increase their budget, and/or getting as many people reliant on it, you will always grow a program of free-loaders. By definition, this will always happen. \\nNow, we have politicians openly feeding people with guilt for not putting up with supporting these ridiculous programs. They equate charitable “giving” of your money to private support programs to you supporting government taking your money and creating a program. They are not the same thing. Government will ALWAYS be more inefficient. Gary2 \\nam I my brothers keeper \\nThat passage is not in Michaels and the other “Christians” on this site. Stan522 \\nGubamint programs are not supposed to make you rich. They are intended to keep you captive into a low level of sustenance where politicians can get you to keep voting for them as they play the system and put you into a voting block that will ensure their continued candidacy. That goes for ANY program: \\nHome Mortgage Interest Deduction Hope or Lifetime Learning Tax Credit Student Loans Child and Dependent Care Tax Credit Earned Income Tax Credit Food Stamps (did I miss any–?) \\nNone of these will provide people with what they need. All they will do is get you hooked just like a crack addict. Tell you friend to break away from government handouts and find their own way to success. It’s inside of every single one of us. It’s God given and we just need to unleash it. Stan522 \\nI believe we are at that point where there may be more takers than givers in our society. The politician’s are now so open about how if you vote for them, they will give “you” free stuff. This “safety net” and how politicians have leveraged it into voting blocks has destroyed our country. Their political greed (power and money) has enticed the weak to become weaker by accepting these bribes. It’s immoral and should be illegal to destroy the drive for success, self-reliance, and determination out of American’s. Michelle \\nYou have no idea just how much that hit home. God bless you jox \\nVery unfair and disappointing article! You talk about a pitiful state of things in America, and suddenly, without justification, you equates it with a “European-style socialist welfare” that destroys your nation “socially and financially”. Even worse, you end with that picture, which has NOTHING to do with the content of the article. \\nIf you don’t like socialism, OK, let’s discuss it with arguments. But this method of picking something that you don’t like and associate it somehow with the socialism is very unfair and not appropriate for your otherwise brilliant articles. It is exactly the same as when the far left blames any problem in the world on America and capitalism. \\nAnd, by the way, let me inform you that some of the more “socially and economically” advanced and prosperous countries in the world are European and socialists (or social-democrats, if this word exists in English). You are going to have a hard time finding arguments against the ethics and politics of those countries, which are a model for everybody. Tom Lowe \\nEveryone but Europe knows that Europe are the biggest freeloaders in the entire world. \\nThe biggest. Tom Lowe \\nIn fact, Europe is nothing but a whole subcontinent wholly dedicated to freeloading off of the rest of the world, and has been for centuries now. Gary2 \\nMichael is becoming an idological right wing warrior where facts are whatever he hears on fox. He can no longer think for him self. This crap was probably transcribed from rush pill head bimbo show. DownWithLibs \\nI see you have even more screws loose than you did before. So sad…we pity you!!!! knightowl77 \\nWell they are not a model that I would like to emulate. We’ll see where they are in 3 to 5 years, but I do not ever think I will support Gov’ts taking from one group to provide to another…. \\nThat is not the role of any gov’t that I would care to be subject to….you can keep it… Barn Cat \\nA lot of government jobs are necessary jobs. A lot of those people are incredibly arrogant. They think they’re God because they work for the government. I saw that when I worked for the Census and my superiors had to deal with people who worked for the Department of Commerce. But those people are nothing compared to God. Bobby \\nthe line at 2:14 applies here… Bernadette \\nEvery time I read something like this it makes my blood boil. It’s this mindset which is making me fight tooth and nail to get my SSI which I worked most of my life paying into. I’m dissabled now. I have a list of illnesses longer than my left arm, and SSI has denied me and now I have to try to find a way to drive 200 miles away to go to some court hearing. You people seem to think it’s so easy to get gov help when you need it. It’s NOT! I’ve been trying to get my SSI benefits since 2009 when I finally became too sick to work. I worked for years with my illnesses, but they got too bad for me to manage in 2009 and I just couldn’t do it any more. Bernadette \\nBTW I would much rather be able to get up and go to work everyday like I used to. I miss working, it’s ridiculous to think that people who were created to create and work would rather sit and be sick, just so that they could get a few hundred dollars every month for free. Talk about socialism, that was Hitler’s mind set “Let the strong survive and the weak go to the wall” That’s why I can’t believe there are so many Believers who are against public assistance. The Church is supposed to take care of sick people like me, not the gov. The Church isn’t supposed to be robbing old ladies of their SS, there supposed to be caring for them. And Christians certainly shouldn’t be complaining about services to assist sick and old people. Oh well it will all come out of the wash when JESUS gets back. Even so Please come quickly Lord JESUS. Cinderella Man \\nBernadette, I woundnt be mad at you for getting SSI its perfectly healthy young teenagers and 20 somethings that say they have “depression” or “bi-polar” and get to sit around and goof off all day while the rest of us foot the bill. BTW the reason that most people are depressed is because your govt. is tyrranical and you are materialistic!! Tom Lowe \\nEXACTLY!! \\nAnd then there are all the phony 420 patients, PTSD phantoms, pain pill puppies, and more! Gary2 \\nmost 90% Christians are hypoctrites to the max. All one need do is read this site for proof of that. Stan522 \\nThey will be left behind…….. Another Richard \\nNo, you are wrong. All 90% Christians are hypocrites. Only 100% Christians are Truely Christian. Another news flash for you buster – Only God can see the heart of any person and He alone Knows the True from the Hypocrite. So, quit wasting your energy trying to pick who is and who isn’t a True Christian,because it is useless. Examine your own life and relationship to God is the best thing you could do for yourself and others. Ozmo \\nThank you so much for that post. It would do well for everyone to live by this. Just my 2 cents Stan522 \\nIsn’t that just like government…. create programs with big promises, make it near impossible to attain, move the goal posts mid game (extending the qualifying years out farther and farther), then steal from it, bankrupt it and then pander to the voting block of retirees and near retirees to garner more votes for the ones who bastardized it in the first place. \\nOur problem is “we” keep believing these SOB’s every time they speak. Be wary of ANY politician coming up with a gubamint program that takes care of “us”. Besides, there isn’t enough to live on once you get it. I would have rather kept my own money for the 40+ years (and still going) instead of giving it to the ripoff artists. \\nMy beef is not with you who worked their whole life and believed the promises of politicians. My issue is with bastard (redundant) politicians that make false promises and then leverage votes promising more free “stuff”. They all can go straight to hell…… mondobeyondo \\nRemember that scene in the movie “Titanic”, where Jack asks Rose to hold onto her hand as the ship sinks? \\n“You jump, I jump!” No, wrong scene! It’s the scene where the ship is taking the final plunge to the bottom. The undertow would have sucked anyone near the ship under water. \\nThe USA is the Titanic. The people abusing the system, depend on the U.S. government for their survival. They will be dragged underwater. (Some of them already are. “Underwater mortgages”.. wink, wink!) And they will suck everyone else under along with them. Chris \\nIn the pyramid of wealth that could describe the population you would have parasites at the very top and at the bottom. At the very top the 1% also live a parasitic existence. I mean people like bankers/ CEOs and others who produce nothing and get rich by scamming those below and basically living a parasitic existence on those that actually do work, the middle of the pyramid. Under the middle there is a large population of an underclass some of whom are genuine hardworking people and some who game the system. The middle supports the lower and the upper parts of the pyramid. A host can only support a certain amount of its energy going to a parasite living on it. Too much energy lost and too many parasites and the host will be killed. This stage must be getting close. Those at the top with their corruption and fraud and greed set the example for those below to follow. When faced with corruption at the top and indolence below the middle will lose heart, see it’s supporting a unjust system and may give up. CitizenS \\nBeen a Paramedic for 21 years now and I have continually see things worsening. People used to call for EMS when they or a loved one was sick, now it seems we’re just a ‘free’ taxi service. Sadly they don’t realize or care that while they are being hauled around someone may actually need our service. And even though they aren’t paying foir it…….. I AM!!! I’m all about giving a people a hand up, but I’m getting tired of a third of my pay going to buy them cell phone minutes and the like. I built my own house payday to payday and I own the land. My family and I are putting up feeder pigs and a calf and just broke the sod on 2 acres of ground for a garden. We have wind power when there’s a breeze and 3 underground springs on site. By all means let it collapse. Then these parasites will be forced to work!! Again Michael, good article. Michael \\nThey use you for a free taxi service? \\nThat is just sad. \\nMichael CitizenS \\nIn this state (WV) an individual can activate EMS, not give a reason, and state which hospital they want to go to and we have to take them. They do not even have to give us there name if they so choose. We call it a ‘you call we haul’. And on top of that many use the non emergency ambulances because they don’t want to spend the money on gas or the bus to go to Dr. Visits and other non urgent medicals. I love my state and only wish that we and other states would reform our system. That by itself could save countless money and lives….. the optimist \\nOh Yay for you. Don’t you get it — you built your house paycheck to paycheck — there are millions of us out here who don’t have the paycheck! And we don’t because of the CEO parasites and 1% parasites who are all about churning and grabbing money over jobs. Outsourcing, golden parachutes, whatever, the jobs are gone and they aren’t coming back. \\nDon’t be so grossly smug and superior. I just lost my house, which was my prepping homestead. I did all those homesteading things for years too, but without a good source of income, when my business failed 2 years ago, I lost it. DON’T think for a SINGLE SECOND that you are invulnerable and incapable of losing YOUR paycheck — YOU CAN LOSE IT ALL. \\nThen maybe you’ll have a deeper understanding of reality. \\n“Then these parasites will be forced to work!!” \\nHateful. Don’t you think “we” WANT to have jobs?? FOOL, hateful fool. Please read Karol’s comment below. The real parasites are at the top, in DC and in corporate boardrooms. CitizenS \\nIf smug and being a fool means harsh austerity @ home (eating ramen, bologna sandwiches, working by myself til 3 in the morning on my house then getting up to be @ work @ 0800 (in which I couldn’t even claim the $8000 tax credit because I didn’t borrow from the banksters), and scratching odd jobs on days off) is smug then I guess that shoe fits. Did I work the system? No. Do I live in the lap of luxury? No. Have I gone without to provide a roof and food for my family? Yes. Am I prepared for what is coming? I hope so. I feel for anyone that looses their job, I really do, I’ve been there before. My comment was not meant to be condescending towards anyone. But I will say this and its as timeless today as it ever has been……. Judge only a man after you have traveled in his footsteps. libertyin413 \\nIn the interest of not repeating what others have said, I would just like to add that I don’t believe that we should have any of these government “benefits” or “safety nets” at all. The only thing the government can to is tax (read:steal) from producers and assist (read:redistribute) others. And it’s not just the “poor” receiving benefits/entitlement [sic], the connected elite get their welfare too. Government setting up these safety nets only exacerbates any problem that may have existed because now prices skyrocket as providers know any increase will be backed by the full faith and credit of the US Tax Payer; this hurts the very people the program was intended to help in the first place. All assistance should be done by private local charity as it was before. This way it is truly just a temporary helping hand when someone hits hard times and the organization/church can monitor for fraud. For the Progressives who claim this doesn’t work, we never read about having to step over alternating piles of child prostitutes and dying old people in the street as you tried to make your way to your sweatshop job. The standard of living was increasing like history has never seen before when people were allowed to keep the fruits of their own labor (a one income household could support 5-6 people, children were being better educated, new cars & appliances, etc…). Now under the Progressive model the standard of living is decreasing drastically as once again everyone has to contribute to the household income and the need to hop on the safety net has reached unprecedented levels. Lastly, even if the producers are lucky enough to retain some of their earnings and try to defer some of it for later consumption, they are hit again with the hidden tax of inflation that destroys their wealth and actually decreases their purchasing power. All of this made possible through the criminal and malevolent actions of the Federal Reserve. Karol \\nHi Michael, Thank you for writing such honest and informative articles. I no longer watch the news or read the local papers because it is mostly all rubbish. Your website is fascinating and I have recommended your site to all my friends and family. No body likes a lazy cheat who games the system for a living, but I am fed up with the parasitical Wall Street Fat Cats, the Politicians, the criminals in D.C. And the 1%, who having been gaming the system for decades at our expense. These rich crooks have stolen billions from the American people, far more than the food stamp family ever will in a life time. BofA paid no federal tax in 2010 and got a billion dollar rebate as well, and I read that they paid no federal tax in 2011 either. When companies that make billions of dollars and give out millions of dollars in bonuses every year don’t pay federal or state tax then the tax payer is robbed. On a local level police and fire stations are affected, schools too. Bridges and roads aren’t being repaired. These parasites send their children to the best schools, they vacation all over the world, own multiple homes with tennis courts and pools, multiple cars and jets, they get to eat the best food, probably cooked by the in-house chef, they have housekeepers and nannies, they have the best health care money can buy, I could go on and on. Disney, a multi-billionaire company, got welfare for a fireworks display and multi-millionaire Sam Donaldson got welfare for mohair. Really! Our schools suck, minimum wage adjusted to inflation should be $22.50 an hour, people are getting screwed out of time-and-a-half, over-time, vacation time, their pensions, health care, etc. And if you work you are lucky if you can get 20 hours a week! Wage theft is the best way for the 1% to steal from the 99%. Most people are so Ignorant they don’t even realize they are being robbed. I worked for the 1% in a private club in Boston, they docked my paycheck for 3 weeks of work. I am a poor single mother, and the richest people felt the need to steal 3 weeks of my wages. Wow! I couldn’t afford to work for free so I had to quit. Do I begrudge the obese, lazy, and unmotivated for scamming the system? Not really. Especially since there ain’t a Benz or a Jag in their driveway, no lawn service for their patch of grass, or a maid to clean up after their sub-par, high-fructose, hydrogenated, sodium laced, junk food dinners, and if they get fuel assistance to keep warm while eating their food-stamp dinner and watching Judge Judy, then good for them. Michael \\nKarol: \\nYes, I have written many articles about the corruption of the banksters and the elite as well. \\nI am definitely not on their side. \\nMichael Mr. G \\nYou are largely right, Karol. Many people who are not doing well would do far better if they were dishonest. \\nThat’s what bothers me about the US today – no real earned privilege, just lots and lots of unearned, unfair big cash going to some fat-cats who are RUINING THE COUNTRY at the same time they are getting all that money! I mean, they could at least do a good job for all that cash. I don’t think they even try, really. \\nGood luck! Jimmy \\nOnce citizens find out that they can vote themselves MONEY (i.e. the democratic party and has already occured) the system is heading straight to hell and is destined for failure. kHRIStu4 \\nTo honestly fix problems like this we need free energy. It is possible, just held up by corporations(owned by bankers) who own the government. Its all about control. This is one more thing added to the list to divide people and keep them docile. \\nIts a long movie (about 2hr). Some stuff may be way out there but have an opened mind. It describes the “food chain” of banks, corporations, governments and people as well. http://www.youtube.com/watch?v=lEV5AFFcZ-s grandpa \\nThese parasites you speak of live from the miniscule turds dispersed by the leeches that thrive on 95% of the oxygen you burn… so now we have rich vs poor. black vs white,, and gov vs god… someday people may get the balls to reverse the genocide being played upon us all.. Corey Lewis \\nWOW! What a great article! Loved it! My ex-wife has been one of these friggin parasites for 15 years and doing her best to raise my kids in that lifestyle…over my dead and rotting body I say. People who have never worked hard or refuse to work hard do not deserve to have residency in this country. Put them all on a boat and ship them off. I’ll even pilot the boat. Rick \\nI know of at least one parasite in particular that lived off my older sister for many years. After she finally divorced the leach, he’s now on government subsistence. These type of people all have one thing in common; they just are not employable. Stan522 \\n…..and the rest of them have government jobs…. have you ever been to the DMV–? Nobody Special \\nThe Low-Income Gasoline Assistance Program Act was introduced in 2005. Fortunately, it hasn’t gone anywhere since then. \\nDon’t mention it – let’s not give them the idea to revive it. Mike S. \\nWhen a person loses their job the first thing you do is apply for unemployment. After that runs out and your savings run out and your food runs out and you have kids. Do you honestly think the government will let you live off dehydrated food that is on the shelf in the basement? You will be on foodstamps and medicaid or they WILL take your kids! If you can’t show proof of income, regardless of my house paid for and enough money(at the time)to pay my bills for another year. The first time you take you kids to E.R. for something it opens up a whole crap of worms if you don’t have insurence. Just for stitches from a bike accident I now have my kids on Medicaid and foodstamps. I try to be positive about the government waste and use all they give on foodstamps to restock my shelves for the next go around. I will be pleased to answer any questions about my situation, even negative ones. I get on this site daily and this is my first comment. Michael \\nYou make some very good points there. \\nMichael Tom Lowe \\nYou are not the person we are talking about. We are talking about lots of fully able bodied people who not only scam for all the gummint benefits but who also work in the underground economy year in and year out. tex \\nYeah you hypocrites are always talking about some other person- not the person in front of you who has real need. \\nYes there are abusers- but in my experience most people would rather work for their money walking to work over broken glass than jump through all of the hoops the bureaucracy demands for their meager pittance. \\nThe fact is that the US economy is in the toilet and the sheeple are going to let Romney flush it. There are not enough jobs, not even in the cash economy. $6 to $10 an hour jobs won’t pay the rent and feed a man’s kids. \\nWhen there is no alternative, people will work the government system to eat or they will turn to crime or justice in the streets- and there are not enough guns in this country to turn that tide once it starts. \\nI think it is time quit with the rhetoric and get real- or it is all going to end very badly for us all. mondobeyondo \\nI forgot about the kids aspect of the situation (I do not have children). \\nWhoa… talk about growing up fast! Children in these dire situations don’t need to ask what a “budget” is. erheault \\nAs we wander down the road to total automation in our industrys the need for middle and lower semi skilled labor will dwindle and the unemployed and the unable to work will multiply we will face a revolt as all other nation in the past and present have or now undergoing, How this will work out is unknown but it will happen to us, it dont matter who is president or in congress. no nation or country in history has survived by devaluing their monies or massive unemployment which is where we are heading, Enjot the ride as it will be historic to say the least. Bryan \\nit’s simple people our nation has gotten so far from God that we are reaping what we are sowing it’s only a matter of time before the Lord Jesus Christ returns the mark of the beast is coming! don’t be here for it after seeing how the U.S.A has mare debt than most of the european countries alone and look what is happening to them only a matter of time…how much only The Lord knows wheter you believe or not it is amazing to see prophecy being fullfilled right in front of our eyes who will fix this huge world financial mess!!! read revelations chapter 13 turn your hearts to God while will still live in this age of grace! monk \\nCut down on spending. Donald Wilson \\nThe bums who live like vultures living off the system will crash and burn one day. Later.We Tom Lowe \\nI’m a landlord in a lower middle class neighborhood, and down to 105 lb from 135 lb in 2007 for lack of food and time to cook it. There is almost nothing but professional freeloaders for as far as the eye can see from here. I could tell all of you stories about freeloaders that would make your blood boil right off. My only hope is that the gummint finally stops issuing the by-now absurd freeloader checks and benefits and sends all of the professional freeloaders to Camp FEMA, right next to the bankster criminals and right where they all belong until they get off their dead butts and start doing something for themselves. And I don’t mean maybe! Cinderella Man \\nMy goodness man!! You need to bulk up on protien powders and high fructose corn syrup immedietly!! 105?? Thats skinny!! no offense. Tom Lowe \\nIt’s scary. I’m surrounded by a sea of human sinkers. That means I have to do everything for myself and half of what they need done for themselves. There’s just not enough time or money to eat well enough–especially after all the coffee, cigs, feeding several spoilt cats, and whatever else I might decide to indulge in, like several hours of reading blog comments. \\nOK–so ya caught me! !!!! Eva \\nYup, it’s not a good time for jobs or growth or prosperity and it won’t be until we get rid of the man in the Oval Office and replace him with someone who takes creating a business-friendly environment seriously. And returning Congress to baseline budgeting. They haven’t been since the 1974 Budget Reform Act, which adds 10% annually to each federal budget regardless of necessity and I hardly need add regardless of federal revenue. sharonsj \\nArticles like this piss me off. Right-wingers like to blame anybody who is struggling to survive–but they never attack corporate welfare. \\nExxonMobil earned $5 billion a year for the past four years and not only paid no tax but got a tax refund! Corporations get away with murder and rob us blind, but their execs are not in prison, are they? But let some guy steal food from a grocer cause he can’t afford to buy meat and he lands in jail. \\nI don’t know why I remain amazed at the stupidity of the American public to swallow Republican talking points, but I am. If you folks don’t learn how to look up facts on your computers, instead of being yes men, you’ll help the Repubs steal what’s left of the country. Michael \\nI have written quite a bit about the corporations that pay no taxes and about all of the corporate welfare that takes place. \\nMichael Gary2 \\n100 articles on the poor to 1 on the corporate welfare. Come on Michael–I see through your bs. Michael \\nGary you know that I hit Goldman Sachs far harder than I hit the poor. \\nMichael Gary2 \\nI said corporate welfare not just goldman sucks. and no you bash the poor way more than the corporate welfare which is a FAR bigger cost. sharonsj \\nEconomist Richard Wolff pointed out that over the last 30 years, corporations (along with government) have rigged the system so that they now pay only 25 cents in taxes for each $1 of tax paid by the average citizen. He also said that if people understood how they were being screwed we’d have a second American revolution. Michael \\nYes, I discussed corporate taxation quite a bit in the article I just posted. \\nMichael Winston Smith \\nTrue, but that never seems to upset “conservatives”, who benefit a lot from Big Govt/Big Biz.Their answer? Just lower taxes (but not spending) and “get the Govt out of the way”. El Pollo de Oro \\n“I call them GC’s three Gs: guns, gold and a getaway plan.”—Gerald Celente \\nMichael T. Snyder write: “As economic conditions get even worse in this country, millions more Americans are going to turn to the government for assistance, and at some point, the safety net is going to break.” Yes, and when it does break, God help The Banana Republic of America (formerly the USA). That’s when things are going to get really nasty in this Third World nightmare. I’ve often said that when the going gets tough, the desperate do desperate things. They rob, they steal, they sell drugs, they mug, they carjack, they kidnap. They do all the things that make it so dangerous to live in Caracas, Ciudad Juarez, Port Moresby, Guatemala City, Kingston and a long list of other Third World cities with high rates of violent crime. They collect the dreaded Desperate People Doing Desperate Things Tax (DPDDTT), which is what the wealthy minority end up paying when they’re surrounded by a dirt-poor majority. \\n“I don’t think people realize just how evil and what an abomination our country has become.”—Alex Jones \\n“America’s not the same place it used to be. And when you look at the decline going on in this country, how anybody can believe that the dollar is going to be a reserve currency is beyond me.”—Gerald Celente \\nNot all Third World countries are ultra-dangerous. I’ve visited Morocco, which has a lot of poverty but doesn’t have a lot of violent crime (only a lot of touts trying to sell you a carpet that you don’t need). But I definitely see the BRA moving in the direction of the really violent and dangerous Third World countries, where kidnappings are a way of life and the cops are often in cahoots with the thugs. So if you think Baltimore, Detroit, Philadelphia and St. Louis are bad now, just wait—the worst is yet to come. And rural places aren’t necessarily going to be all that safe either when the you-know-what hits the fan (some small towns in Mexico are extremely dangerous). \\nOf course, smart preppers understand all these things. They’re the ones who’ve been listening to Alex Jones, Gerald Celente, Paul Craig Roberts, Gary Johnson and Ron Paul and realize that those guys aren’t alarmists—they’re telling it like it is, and the truth ain’t pretty. \\nIf you have a gun, I recommend keeping it in a safe, secure place and knowing how to use it. That gun will come in handy when the DPDDTT collectors come a knockin’ here in The Banana Republic of America. William \\nThe real government “parasites” are actually 90% of all federal workers (GS & WG). These federal employees are grossly OVERPAID, and do little work. It is almost IMPOSSIBLE to fire one of these slackers once they get tenure. My brother-in-law retired as a GS-14. In his last job in Wash DC, he TOOK NEWSPAPERS and MAGAZINES to work to read BECAUSE HE DID NOT HAVE ANYTHING TO DO Most civil service and wage grade federal workers sit around doing very little except for reading their benefits manual. That is a HARD FACT! TX4Life \\nMost have tv’s in their offices, paid for by the taxpayer, that they watch several hours a day. No one wants confrontation so they ignore it. Or they let it go because they also watch tv a good portion of the day. Some work other jobs during their required GS/WG hours even though it is prohibited. Again, no one wants confrontation so they look the other way. Some come and go as they please, never listing time off on their weekly time cards as required. At the end of the year, they take most of December off to “use or lose” their accumulated “time off”. It will continue and grow worse because no one is willing to do anything about it. Me \\n$50,000 * 0.3 = $15,000 where 0.3 = 30% tax rate. \\n$50,000 – $15,000 = $35,000 /12 = $2916 a month. \\n$2916. \\nNot $4000. $2916. It’s even crazier than you think. By quite a wide margin. \\nAdd to that I’d love to see you find a rent of $1000 in Los Angeles. Anywhere. \\nTry it. \\nMinimum is $1400 and that’s if you’re living in hell with a bed that folds up into the wall. \\nI’m seriously considering building a cabin on some nice land in the middle of nowhere and buying a 20 year supply of Ramen noodles. I hear you can…“feed” (if it can be called such a thing) yourself on them for $142 a YEAR. Mr. G \\nI have known plenty who are parasites. They really do work the system amazingly well. I once worked a charity-related job in a city where I found that people coming from Latin-American countries had welfare forms filled out before they even got on the plane to come here. That’s rotten. \\nBut it is also rotten that those who really try often can’t get any help at all! That is why I know much welfare is a scam. We should be willing to help those who need it and deserve it. But, we tend to help those who don’t deserve it. \\nFor example, many poor American kids who can’t read get no special help, while foreign nationals who are going here while their parents get educated or work fancy professional jobs get special English tutors on the tax-payers’ dime. When are we going to wake up and help those we should? \\nBut never, never turn against helping those who have it coming. This is one reason I cannot even support Republicans anymore. (I never did support Democrats) Too mean-spirited, too many people who have never been down and out! DaytoDay \\nGood Article Michael, \\nI had to take some time away from the doom and gloom for a while, although, it is impossible to escape it entirely. \\nI agree with this article, I know people 1st hand who are on welfare, some in my own family who have been on welfare/govt assistance most of their adult lives. \\nI worked at Walmart at one time, and one of the guys I worked with used to be a construction worker and was on welfare for 2yrs before they cut him off, he was receiving $1,000/month while on welfare compared to the $800/month working at Walmart. \\nSo, I can understand why some people choose to leach off the system “forever”, because it literally pays more to be dependent than independent… \\nStay Strong and Keep Up the Good Work! David Gurney \\nNew GOP slogan:If you believe in hope,you must be a dope. Mad Max \\nThe truth is, none of us really have to work hard anymore. Why get mad at the people who discovered that first. Only a sucker wants to work hard. Work is just a modern extension of slavery from ancient times. That’s why people want to become rich. Because they want to be free. Free to do what they want when they please. Only a jaded fool wants to work hard, and only a jaded fool would criticize others that don’t want to kill themselves making someone else’s dream come true. I’d rather spend more time with my family and doing the things I really love to do. Do you think the 1% care about working their butts off, NO! They care about working your butts off. It is the stupid 99% that persist in this nonsense and guess what? You’ve gotten your wish. We behave like slaves then we complain about how we are treated. \\nWake up! \\nRead “Common Sense 3.1” at ( http://www.revolution2.osixs.org ) FIGHT THE CAUSE – NOT THE SYMPTOM \\nHow else can I say this? “We Are Free!” http://WeAreFree.osixs.org John Rambo \\nNevermind that most welfare people are WOMEN. Women bankrupted America. They sucked the system dry with all of their special women’s rights and privledges, and also they drove away all of the big corporations who are afraid of frivilous lawsuits from women. \\nAmerican women are sue-happy. They will sue a company or their employer for the stupidest of reasons. So can you really blame the corporations for outsourcing to countries that are not so radical feminist-like? \\nAmerican women are the main ones that destroyed America. Feminism destroyed America. \\nWhen are you going to start blaming the real culprits, Michael? When are you going to grow some balls and start speaking the TRUTH, instead of watering it down like a ? Michael \\nMichael John Rambo \\nYes but you RARELY call out WOMEN and FEMINISTS as being the main cause behind the economic collapse of America. \\nAlso, American women destroyed TENS OF MILLIONS of men’s lives FINANCIALLY through the divorce courts. \\nSo financially destroying TENS OF MILLIONS of men’s lives didn’t help the economy either. \\nWhen are you going to directly expose the WOMEN as the primary culprits behind this collapse? tex \\nJoh Rambo? Sure you’re not Rick Santorum out slumming? Gary2 \\nive paid into this system that people are using.i personally know of 10 people using the system to get ssi only one is disabled the rest lied to get ssi. you lie and keep saying your depressed my back hurts etc. etc. etc. i read these coments and funny how all these people diserve ssi and none of these people are lieing to get it. give me back my money and i shouldnt have to help strangers with my money i paid into it with,hell i could retire,ive paid into this since i was 15 im 48. if your a man get a dam job and quit faking if you can work period,i know about it taking four to five yr. it didnt stop those bums i know that are on it,dont forget to tell the people here they back pay you all that money did you. sorry what it comes down to is i shouldnt have to support any stranger,i will help me and my family and no one else and that includes food stamps. i get one third of my money taken in taxs and etc. then i spend it and get taxed again,i dont care who you are,i shouldnt have to raise you as if your a child,get a job even if its flippin handburgers-enough is enough \\nsorry they taken the comas out and ran the sentences together but youll get the point Gay Veteran \\n“…Ever since the “war on poverty” began our debt has absolutely exploded and yet now there are more poor people in this country than ever before….” \\nFACTS please? The Federal debt started exploding under Reagan. Michael \\nIt has been exploding for a long time. Both parties are to blame. \\nMichael tom singa \\nyes they are all to blame, and until obama debt was increasing slightly which needed to be put under control, , but Obama ,he has doubled the debt himself, period there is no way to argue otherwise Evie \\nAmerica is rapidly turning into a European-style socialist welfare state \\nThe evidence says not! \\nI wish we were a european socialist state tex \\nor even a Canadian style Conservative one…. tom singa \\nwell then leave go there and live Gary2 \\nMichael-ALL estimates are that between 3-5% of the welfare recepients are getting benefits fraudently and gaming the system. While I know focusing on the 3-5% who abuse the system makes for a better headline you are ignoring the 95-97% who get benefits that if they did not get they would die. for the most part literally. \\nI know in your ayn rand wet dream that is how you may want the world to be–social darwin like that fool paul ryan but what what a horrible world that would be. \\nFor the record I do believe that those 3-5% who are abusing the system need to be kicked off and dealt with. Gary2 \\nHow about all the corporate welfare and welfare for the rich? That is WAY more than ANY welfare for the poor. \\nMichael–turn off fox, you can do better. Gary2 \\n49 percent of all Americans live in a home that receives some form of government benefits. \\nBecause the wall street corporate bailouts put the economy into a recession. You need to finish the tape to the end. \\nMichael–stop being sop disingenuinous. you know better. Gary2 \\nmichael–too one sided–what about the corporate parasites??and the rich parasites who own congress? How much extra does the average family pay for those parasites?? \\nyou have sunk to a new low with this article. \\nYou are so one sided and incomplete facts I can hardly read this crap. MisterC \\nThen haunt some other blog TROLL! Gary2 \\nnice hypocritical Christian referring to Gods children as parasites. \\nI knew all the was nothing but to make people think you are christian. When push comes to shove you are right up there with the libertarian selfish crowd. \\nYou probably really worship Magog Rhynn \\nThe only way anybody is going to spend $400 a month on gasoline is if they are riding a motorcycle or simply have no job and nowhere to go and thus couldn’t even afford that $400 a month. \\nEven econo-boxes cost close to $60-$70 per full tank on 87 gas where I live. Nobody is going to fill up a car 6 times a month here if they are employed. Try double that. \\nSame goes for a $1000 a month rent or mortgage. That will barely get you a single in the worst area of the city. \\nOne person could not make it under those circumstances. A family of four can completely forget about it, unless they all live in the car and eat out of the 7-11 they park behind. Once you add in insurances, health coverage, car maintenance, etc. you’d have to quadruple that $4000 figure for that size family to even pretend it was comfortable. And that’s only if the $16K figure I mention is net. \\nAmerica is a bad punchline now – nothing more. Newton \\nIt’s not even so much the actual people that really costs us all, but the incredibly innefective and almost inexhaustive amount of bureaucratic “support” personnel for all these“programs”. \\nI mean; if you; Michael want to “find a money trail”– follow a single minority mother with 3 kids to 2 different “guys” living in a burb with mom and dad next door – I mean; it’s amazing ! \\nThese people have individual “caseworkers”– you can’t make this up ! Now; how does the caseworker keep his/her job? get a raise? What a vicious cycle ! \\nI’ve been saying for 30 years –” when the percentage rowing the boat equals the percentage riding —- in the boat; the boat; she stops. \\nThe rowers; they grow weary; but cannot rest as more and more become dependant on them – it is like running a marathon; if you stop at mile 21 for a breather; I GUARANTEE you; you’ll NEVER pick up the pace again. \\nIt’s just law # 113 of my 200; right behind if you eat more calories than you burn; you’ll gain weight. \\nTheir days are numbered however; as the rowers; they know how to do things; make things; repair things; the parasites – not so much \\nOne of these days ( I give it 3-5 years ) we’re gonna find out just who is worth what in this country. Currently we have farmers making 60K and Senators making 160K \\nI’m betting – these roles are gonna change! joe \\nAnd what about the government employment sector that overpays millions of lazy so-called workers to either do nothing all day or push meaningless government dripple. This article is a shill for the fat cat rich who are so greedy that they would take social security from people who earned it and benefits from people who truly need it. \\nWe never hear about the lazy government union parasites in these type of articles because thats what the real parasites who run america want to keep going. \\nEven when these government employees were “layed off” they got full pay and benefits and did not have to apply for unemployment like private sector. Always getting some special privilege including the right to a paycheck without working. This amounts to alot of money payed for nothing and far exceeds the amount anyone receiving government benefits gets. \\nAre they to work or just fill space and stand around and look stupid. Most of these “jobs” are not necessary but work to keep the corrupt political machine going. \\nGovernment employees are a lazy pack of overpayed,overprivileged spoiled brats who think everything in life should be handed to them on a silver platter. Yet not one word will be uttered against them by their elite masters while these same masters seek to make the lives of those forced onto government benefits more miserable. Another attempt at class warfare. tom singa \\nthat can’t get fired! James \\nThe Hard Working American vs. The Government Parasite – that’s a good one. Did it occur to you “hard working” types that what you call “work” is actually as chattel on a slave farm? The Indians would never have understood that a person must continually pay to live on the piece of ground they were born on. So to those of you who think you are more noble for working and the poor are despicable – i say its because of you that the system keeps functioning and so its on your head. If people all thought like me then the system would end tomorrow. But they don’t – so those of you who support it – its your mess so you deal with it and i will take what I can, because no man has the right to demand payment of me to live on the land so I have to take steps to circumvent the crime of what most of the rest of you created and continue to support. And by the way – this disdain for the poor “parasites” is one more psyop your rich masters are running on you to divide the lower and middle classes. nowwthen \\nI guess if you try hard enough you can justify your disdain for taking care of yourself. Just throw in some nonsense about “The Indians” and paid work as slavery and all of a sudden you’re smarter than any self-sufficient man or woman and entitled to what you take from them. Timothy Leary’s dead genius now get off your fat and go to work. james \\nLook up the term Sheeple on Wikipedia and learn about yourself. James \\nSo, put otherwise – not only are those of you who have jobs fools – your also morally liable for keeping this mess going. Your not better than, but less than. I am all for taking care of my own needs – but they stole the land and put us in cages and its now illegal to do so. A person has to have satanic blood tickets to do any trade. I curse it and refuse to be a good little obedient slave. so yeah, i will take what they give until the rest of you come to your senses. And remember that disdain for those on the government “dole” will not serve you as your turn is coming. Pray your envious demographic has not demonized the poor by that point so that you are just put in a work camp. Mr. G \\nYou are so right, James! WE really don’t need so much labor to make the world run – and much of our labor goes to supporting people above us, who want want want. I live happily in a lifestyle from the 1930’s. It is a very full life and I have a great many hobbies and interests which do not require constant outlays of money, though oddly others who do the same things spend constantly and don’t actually DO the things too much anymore. \\nI can live like this, why can’t they? And if they want more, fine by me – but they ought to work like dogs to produce their plastic crap, not enslave the little people! Mr. G Jeremy \\nLots of anger in these comments. My suggestion: just log off (I come about once per week), and your blood pressure will drop. starr \\nIt just makes me sick knowing the economic disaster America is in. I’m 53 years old have worked since i was 14. Unfortunately, the company i worked for 7 years went out of business, which put me on unemployment. Been on it for 8 months, and it’s making me crazy not working. I have alot of skills, put in several applications but no job. The jobs are not there, our government is lying to us. They want to keep us under there control. Wake up America, we need to get rid of the socialism/communism that’s destroying our country!!! mondobeyondo \\nEven a maggot has to work its way up the system, to become a worm. \\n(Yes, I know. Not funny. Sorry!) Jimbo \\nUntil our VIP’s start appearing in roadside ditches with bailing wire around their wrists and bullet holes behind their ears every morning, things will continue to get worse bill \\nif im not mistaken the system you curse is givin you free food and shelter that you call a cage,at myself and other workers expense,i curse the system also. i have a firm belief that if you can work but refuse to do so for whatever reason like not enough money,dont like that kind of work or whatever,,STARVE and live on the street or woods where ever,why should working men and women support people who are to lazy to work..i believe that part of being a man anyway is supporting you and your family NOT ME SUPPORTING YOUR FAMILY BECAUSE YOU FEEL YOU SHOULDNT HAVE TO WORK your not one of my kids why should i support someone that THINKS hes a man when he wont work Rowell \\nMichael, I have to call you out on this statement: “If you live in a very liberal area of the country and you know how to game the system, it is entirely possible to live a comfortable existence without ever working too much at all.” \\nWhy are you saying that it’s the liberal areas of the country that people take advantage of the system? Aren’t several southern conservative states among the top recipients of government aid for its citizens? Such states as Alabama and Mississippi have extremely high numbers of people on welfare. So, saying that this is a “liberal” problem is just being divisive. Please, keep objective in your reporting; it would lend more credibility to your articles, especially to those of us who are in the middle (like myself) or liberal (like Gary2), and not hard-core conservatives. Michael \\nYes, it is true. There are people gaming the system all over the country. It just happens to be a little easier to do in very liberal areas such as Chicago. \\nMichael \\nEXCELLENT article. I was waiting for this one! Great job! Nex \\nThis has been the case for years, just for the longest time no one wanted to notice it. We got hicks in Alabama who live off subsidies from cradle to grave and we got blacks in NY doing the same, just now when economy turned to (thank you mortgages for everyone), it all of the sudden became an issue. \\nStop policing the world or conquer whoever we own money to. Or just default already and lets watch fly. Phoenix \\nGreat, we’ve seen the problem loud and clear. The solution however is here. This is for open minded free thinkers, those who can envision a different, better world. \\nI like how you’re talking solution-oriented instead of problem-oriented. It’s the best way to promote change. \\nhttp://rondetafelbeleid.nl/meritocracy ivan \\nAs a foreigner living and working in this country, it is sort of strange to watch Americans yell about “socialism” \\n“socialist” Norway debt 48% of GDP“socialist” Denmark 49%“socialist” Sweden 37% \\nsocialist East Germany at unification, some 25% \\nUnited States 69% (not including intra-government debt like medicare and social security) and debt owed by individual states. \\nJapan. A cool 208% \\nTell me again how “socialism” is killing america? Gary2 \\nits because all the low information right wing voters who are easily manilupated by fox. \\nScandavian countries are beating the USA in pretty much every catagory and they are socialist. We need to be much more socialist and drop the self made man crap as its simply a myth. Pauly \\nSo who is manipulating the left wing voters? Sagacious \\nYou’re a sad little child thinking he is a man Gary. I agree with Benjik…is this article about you? Are you a government parasite?? I’m thinking yes, yes you are! Brunot \\nLet me tell that to my high school educated wife who was a nanny till 23 y/o and now makes $300K a year. She’ll be quite surprised. \\nI’m self employed and semi-retired at 48 from a business mowing lawns where I broke a sweat every day. But what do we know, eh? It’s impossible to achieve anything without a govn’t check. What an ignorant statement. tom singa \\noh there you have it a cash based business running under the table not paying his fair share, can you please tell me the name of your lawn care, Id like to report it to the IRS Tim \\nYes I hear that all of the time. But look at the populations of those countries, take Norway for example. Population ~5 million. the US ~311 million. And did you know that Norway is an oil country? Without their oil their economy would probably stagnate. You are comparing apples to oranges my friend and your argument about those countries being better is not looking at all of the factors. Oil country= $$$ Marcus \\nWe spend less than we earn. Simple as that. Sweden is not an oil country! And we are not socialist, study our economy before ranting please! We are market driven economies with a strong governmental influence. Which is not a problem for most of us, since we consider the government to be our servants, while americans consider the government their enemy. \\nSometimes it feels like America aimed for freedom and ended up with anarchy. And I don´t hate the USA, but I expected more from you. 20 years ago people in Europe dreamed of California, now they dream of The Emirates, Malaysia, Singapore, Hong Kong and Canada. Benjik Cherenkov \\nThis is retarded. Americans should only be so lucky as to have a higher standard of living, better health care for less, better education, more cultural events, more vacations days by at least double, and governments who weren’t in the pockets of the corporations. Gosh what a terrible thing. All this and you get to vote in a parliamentary system where your views might actually be represented instead of co-opted by politicians owned lock, stock, and barrel by the corporate elites. \\nAnyone who believes this stupid story deserves the crappy American life they get. Gary2 \\nMichael–are you listening..your libertarian is just that a dream. tom singa \\nspoken like a true piss antt mooch Bob Marshall \\nEuropean-style socialism “is exactly what we need now. I am against market fundamentalism. I think this propaganda that government involvement is always bad has been very successful-but also very harmful to our society.” George Soros. \\nIf you are trying to defend this it is because you are in the 49 % without a doubt!!! tom singa \\na true mooch! Mia \\nTypical liberal!! Fox news is the the only channel that make sense and I`m glad I do not believe the fairytale of change the liberal leaders want us to believe. The American Dream is dying because of Marxism. Go ahead, nobody can change you anyway… go sit in your couch get all the free money you want from the govt. You don`t care if the hardworking taxpayers suffer because all you libs care is yourself. Lee \\nDo you even know the ideology behind Marxism or the ‘American Dream’? When you find out, come back and explain how it has killed the American Dream. In fact, as a loyal follower of Fox, in your own words, explain the difference between a liberalism and conservitism. \\nAs shown by your lack of knowledge, I will assume you did not attend college, but if you did how did you pay for it? Use Pell Grants? Student loans? \\nSometimes think before you speak…. TheFulishBastid \\nSo let me get the logic straight. Most everyone on welfare, snap, medicaid are “gaming” the system. I can quit my job tomorrow, or better yet, be willfully fired. Apply for my “socialist” benefits, and voila, I’m living the high life? Rollin’ in my caddy, wakin’ up at noon, heading down to the store and buying steaks for me and my girl, drinking and smoking to the wee hours of the morn, wake up at 1 in the afternoon and do it all over again, ad infinitum? WHERE DO I SIGN UP?!?! \\nOr the other option, we get rid of the “benefits” that these people are living off of and demand that these folks go get jobs that don’t exist? \\nI think you shouldn’t quit your day job, though maybe you should go work in a soup kitchen one day and see how well these folks you are blaming for your woes are truly living. tom singa \\nSong as your willing to live in a dump, or share a nice home wiht a few others doing he same thing. better yet you can even own that home and charge the “roomies” rent in cash! JF \\nI work in Los Angeles (I live 1 hour away-thank God) as a Parole Agent. Many parolees are claiming a mental health ailment (Depression, hearing voices) and then sign up and receive SSI. Usually just below $900.00 dollars per month (many receive “back pay” which can be several thousand $). They also receive housing rental assistance, and EBT food cards. They lounge around all day and then buy alcohol and drugs with the money. This does not include all of the other freeloaders (Hoodrats-girls, having multiple children, illegals etc) who receive the same freebies. Los Angeles is a total mess and California itself is the same. The collapse is gonna be hard, and I see many cities erupting in violence and bloody riots when this occurs. hora \\nSSI 900$ you said? well I am 65 retired and disable and get 350$. Now for sure a systems will collapse and very soon. 750$ SS and SSI what I collect I was working and paid taxes. Now when collapse sure a lot will stop get any check free, only real disable and older will keep a own money for was paid for long time, and riot? well that will a end of DEM KKK Party. InYoFace \\nGo back to Mexico you are part of the problem Anonymous \\nI will say say this… $4000 per month is MORE than enough to support a family of 5 people. \\nThe problem with most Americans is they are not savvy or frugal. They are poor at micro managing and quite honestly, many suffer from narcissism and addiction. \\nMany Americans live their lives ignorant of how their tools work, such as; automobiles, home appliances, computers, clothing, their own bodies. \\nIf a family of 5 cannot live off of $4000 per month, they might be terrible at management, likely spending heavily on things they do NOT need to survive. Buying in excess of expensive food, luxury items, luxury clothing and accessories, cigarettes, drugs, bars, new automobiles, automobiles with poor gas mileage. \\nOf course many Americans are bred in the system to believe that they were not be socially accepted if they do not own new cars, new houses, new clothes, new appliances, worship sports teams… \\nThe future of many Americans will likely end up as a giant temper tantrum, with riots… followed by scores of military hosing them down and telling them to “shut the fuck up and deal with it.” \\nI’m not going to judge people, but it’s the truth, people need to micro manage their lives better, not be lazy and learn how to care for their bodies and their tools. tom singa \\njust had a conversation about this, how to cut back, but they cant live without a $120+ cable bill a mo, their landline with internet access, two smart phones at almost 200 a mo, I explain to them even turning up the AC o 81 or 82 during the day and no lower than 78 at night will cut that bill some 40 or more a mo, (they cant sleep if its not set at 70 degrees, My gosh, and these people thing tthey are entitled tto get GOC help! and they do! Jan Honeycutt \\nThe National Guard requires my husband to have internet access and we have to pay it out of pocket. I coupon constantly, my kids get clearance clothes that are cheaper than Walmart its worth the hunt. We have about 950 a month come in after taxes every other week before taxes 1400, we have honestly needed help before and deserved it, and couldn’t get it. My husband had to have surgery to remove a tumor luckily it wasn’t cancerous, but he was still out of work and our insurance left us with a 1,000 dollar copay. I was in the ICU at the time of his surgery complications from a heart condition, a UTI, and extreme IBS. He ended up going back to work early, we have medical bills coming in everyday despite paying for 2 insurances. Both of our children have asthma, I have several bad health problems, and our daughter has extreme IBS and GERD on top of her asthma. I worked everyday I would now it just isn’t possible and I can’t get a penny of the disability I paid in despite having a non working bladder, heart condition, and epilepsy, while I watch healthy people walk around on it for Fibromyalgia and I even know of one government moocher getting 800 a month because her daughter has dyslexia! On top of that most of these people have never worked or paid a penny into disability! Our daughter has dyslexia and I would rather not manipulate the system to use my daughter as a pay check, these people have no integrity. I will admit we do have to keep our air on 71 at night due to my heart condition if I get too hot my heart rate goes up but blood pressure plummets, I seriously doubt most of the people getting their bills paid have a real need to keep their air low though, they just know they can. My husband works at a factory but he has an education and he is a staff sergeant in the Guard but still we only gross a round 42,000 a yr and one time while he was on orders he didn’t get paid until a week later because of the system being down, we had to use credit cards and ask family for money. My husband only gets 2 sick days a yr I was in the hospital over 10 days last yr. We desperately needed help and because my husband is home now his 3 tours of duty count for nothing and we could not get military aid. We sunk to the ultimate low of applying for food stamps just to get a through a few months and were denied. We get cut out the wazoo to support people who refuse to help themselves, and when we needed help the door was slammed in our face. Now we’re drowning in more debt due to 401k loans and credit cards we had to use during the hard times we were also forced to refinance to an armed interest rate to get by, I really hope it is easy to refinance out of it as we were told, but I doubt it, and we had no choice. Our government is horribly flawed. What this article is saying is that 4,000 a month is before taxes not after if we got half of the taxes we pay monthly we would be fine. Ken Sack \\nThe problem wouldn’t exist if people lived by the letter and spirit (no freeies from the government)of the law: Thou shalt not steal. Max Power \\nUnfortunately, most Americans would rather commit mass suicide than see a single high paid multi-generational government neopot lose their job or pension. \\nIn the US, there are literally hundreds of thousands of people who have US citizenship — but who are banned from the workforce by law, statute and regulation. Each person in this situation costs the government at multiple levels millions of dollars. \\nPossibly up to 5% of the US debt burden at all levels is exacerbated by this problem — and nepotism, favoritism and cronyism do the rest… \\nAnyway, here is an example of a Canadian with US Citizenship but banned from any kind of employment due to their nationality. Max Power \\nhttp://groups.yahoo.com/group/Australian-marry-preg/ Brunot \\nScandinavian countries can do ok with socialism because of their high functioning populace. They’re smarter and have a better culture in terms of work ethic, norms about work, etc, on average. They also live in tiny homes and drive tiny cars to achieve some of this “prosperity”. They also don’t have much military spending, which is why they were conquered in a few weeks the last time anyone tried. A uniform ethnic makeup has helped with cultural issues of socialism as well, though this is changing. \\nThere is also something to be said for the way socialist programs are administered. It wouldn’t be difficult to beat us at that. \\nThe fact is, before the 60’s welfare state we had virtually no debt problem. That is a FACT. \\nWe are not Trillions in debt because of free markets and lack of government programs. That is a ridiculous leap of logic. Buckaroo Banzai \\nUm, also don’t forget the fact that the Scandinavian countries have been pumping oil (and wealth) out of the North Sea for 30 years now. Norway, especially, is just unbelievably rich from North Sea oil. \\nSocialism is real easy to manage when you are pumping stuff out of the ground for $10 and selling it for $100. The monumental bureaucratic waste kind of gets lost in the shuffle of endless free money. John \\nSome good comments that ring true, Brunot. NO NATION is greater than the productivity of its citizens. No nation is more moral that the morality of its people. Any nation that believes (and thinks) otherwise is doomed to eventually fail. tom singa \\nmy reply to them, for them to move to any socialist country they like, ge out go live off some other country and see how that works out for you TheFulishBastid \\nlols, what? \\nDidn’t appreciate my logic, or just my comment on working a soup kitchen for a day? \\nMaybe I should just take Gary2’s approach and call you a ****'"}, "time": 1742563414.5544143}