{"duration": 0.08569455146789551, "input_args": {"text": "'The Secret Cost of Chinese Buffets: Part 1 Posted on Nov 2, 2016 \\nBy Amelia Pang Workers prepare for business at a restaurant in the Chinatown section of Los Angeles on Jan. 19, 2012. ( Jae C. Hong / AP Photo ) \\nWang’s Employment Agency is nestled on the third floor of a barbershop in Flushing, N.Y. No sign outside suggests its existence. Inside, there is an undecorated, white-walled office where a dozen middle-aged Chinese immigrants sit and wait in nervous silence. Wang, the owner of the agency, is a heavyset woman in her early 50s. She snacks on walnuts from a Styrofoam cup as she considers people’s job requests. \\n“I have a job as a cook at a Vietnamese restaurant,” she tells a man in his 50s. \\n“A Vietnamese restaurant?” he asks. “But I’ve never had Vietnamese food.” \\nAdvertisement Square, Site wide \\n“It’s just noodles,” Wang says. “They use a different sauce than we do. That’s all. Give them a call and try it out for a day.” \\nHe pays Wang $60 for the job offer. I catch the tail end of this conversation. It is not clear where the restaurant is located. \\n“Were you smuggled in?” Wang asks me. \\n“No,” I say. \\nI was born and raised in Maryland. My Mandarin has a noticeable American accent. I later realize it was a mistake to admit my legal status. Wang asks me a few questions about what type of restaurant jobs I want. She says she’ll call me if anything comes up. \\nShe doesn’t call. Wang isn’t alone. Other employment agencies in Flushing I contact also do not return my calls after hearing my Mandarin. \\nChinese restaurants hire undocumented Chinese and Latino workers, pay them well below minimum wage, make them work 12-hour shifts six days a week but offer free housing and food. These workers are packed at night into roach-infested apartments and houses. Sometimes they are forced to sleep on cardboard in the basements of restaurants. They make $800 to $2,000 a month—regardless of how many hours they work. \\nMuch of their pay goes to fees charged by traffickers and smugglers—known in Chinese as “snakeheads”—and to private employment agencies such as the one run by Wang that charges clients for finding them a job. The smugglers, like the agencies, do not advertise. Snakeheads charge $60,000 to $80,000 to smuggle someone into the United States. They have networks of enforcers, which means that, if you do not pay, you or your family members in China will be subject, until the money is paid, to beatings or even death. \\nRestaurant jobs in big cities fill up fast. There are more immigrants looking for work in cities, where wealthier customers tip generously. Most employment agencies in Flushing specialize in sending immigrants to jobs in remote towns where Chinese restaurants are often short of staff. Once offered a job, an immigrant often has to be on a bus within hours and can find him- or herself halfway across the country. \\nMy legal status and my American-accented Mandarin are impediments. Labor trafficking, which can take place before the immigrant is smuggled into the country, is dependent on the powerlessness of the worker. Snakeheads routinely lie about jobs, wages and employment conditions, knowing that once workers are in the United States they are unable to appeal to law enforcement. It is also common for snakeheads and employers to confiscate passports and identity documents in order to hold workers hostage. \\nThese snakeheads do not only traffic in Chinese workers. They routinely “buy” undocumented Latino workers who have crossed into the United States from Mexico and drive them to Chinese restaurants around the country where they, too, are held in bondage. Those who traffic human beings also often traffic drugs, carrying narcotics along with their human cargo across state lines. \\n“Employment agencies buy Mexicans at the border from smugglers and sell them to Chinese employers,” said a former snakehead I’ll call Edward, whom I interviewed in Atlanta. For one year, the First Street Employment Agency paid Edward $2 per mile to pick up undocumented Latino immigrants from Fort Myers, Fla., and drive them to the agency in Chamblee, Ga. The employment agency owner would pack the Latino migrants into crowded rooms in a nearby apartment complex called the Don Juan Duplexes while he waited for Chinese restaurant owners to purchase the immigrants like indentured servants. \\n“Chinese restaurant owners don’t pay Mexicans for the first two months of work. They pay the smugglers instead,” Edward told me. “They pay $1,000 per person, maybe $1,200 per person, to the smuggler.” \\nAfter two months, restaurant owners typically begin to pay new Latino workers $800 a month. They tend to work in the kitchen, so they don’t receive tips. In busy restaurants, experienced kitchen workers might eventually make up to $2,000 a month. \\nThe employment agencies, Chinese restaurants and human smugglers have informal ties to one another, which makes it efficient to supply cheap labor but difficult to prosecute. Most of these labor agencies are never charged with trafficking. \\nI change my tactics when I enter Min Du Employment Agency on Eldridge Street in Manhattan’s Chinatown. The agency’s office is not much larger than a walk-in closet. A poster plastered on the wall advertises a $30 bus ride to Indiana. \\n“Hello, little sister,” an elderly woman greets me in Mandarin from behind the counter. The small space behind her counter is stuffed with notebooks, instant-noodle packs and an electric kettle. \\nI speak haltingly. I give vague answers about my ability to speak English. She doesn’t ask about my immigration status. \\nI tell her I’m looking for a busgirl job. I decide on busgirl because I have limited Chinese writing skills and would struggle to write orders down in Chinese. \\n“The closest job is four hours away,” she says. \\n“That’s fine,” I say. \\nShe begins calling restaurant employers across North America and mumbles a few words to them before handing me the receiver. I get on the phone with a Chinese restaurant owner in Indiana.'"}, "time": 1742628432.3374047}