{"duration": 0.03361225128173828, "input_args": {"text": "'Walling them out, or walling us in? Shall we wall off Canada, too? By Jim Hightower Posted on November 3, 2016 by Jim Hightower \\nEvading security cameras in the remote expanse along the U.S. border, three Guatemalans waited till dusk to slip illicitly into our country. \\nThis is the stuff of Donald Trump nightmares—and if he were to witness such a scene, we can only imagine the furious rants that would follow. \\nBut Trump will never see this scene or even know about it, because he’s facing south, fulminating against Mexicans and assuring his faithful followers that he’ll stop illegal entry into the U.S. by building a “ beautiful, impenetrable wall ” across our 2,000-mile border with Mexico. \\nMeanwhile, the scene described took place way up north, where rural Vermont connects to Canada. As the New York Times recently reported , “This area is a haven for smugglers and cross-border criminal organizations.” \\nWith so many of our nation’s political and security officials obsessed with the southern border, more and more criminal action—including the smuggling of people, drugs, and weapons—has plagued our 5,500-mile Canadian border, the longest in the world between two countries. \\nRunning from the Atlantic to the Pacific through sparsely populated and heavily wooded terrain, there’s often no clear demarcation of where Canada ends and the U.S. begins. Some farms, homes, and businesses actually sprawl across the border. \\nOnly about 2,000 agents patrol this vast stretch, and officials concede they don’t even have a good guess of how many people and how much contraband is coming across, or where. \\nSo, the question for Mr. Trump is: Shall we wall off Canada, too? And how much of our public treasury, democratic idealism, and international goodwill shall we dump into the folly of militarizing both borders? \\nBy simply thinking we can wall the world out, we’ll be walling ourselves in—and that’s suicidal. \\nOtherWords columnist Jim Hightower is a radio commentator, writer, and public speaker. He’s the editor of the populist newsletter, The Hightower Lowdown . Distributed by OtherWords.or g . Commentary . Bookmark the permalink .'"}, "time": 1742562211.7323287}