{"duration": 0.1330270767211914, "input_args": {"text": "'By Hrafnkell Haraldsson   9:04 am The KKK newspaper features the front page full page story \"Make America Great Again\" with a big featured center photo of Donald Trump   \\nRachel Maddow traces the history of the post-Civil War “Enforcement Acts” signed by President Ulysses S. Grant, including the Ku Klux Klan Act , or The Enforcement Act of 1871 (17 Stat. 13), which still makes it illegal to conspire to intimidate voters. \\nTo show that the Klan Act is not “vestigial” but very much relevant in this election, Maddow points to the citation of this law by the Democrat Party in a “whole raft of lawsuits” in Nevada, Arizona, Pennsylvania and Ohio alleging voter intimidation. \\nMaddow points out that though voter intimidation is illegal anyway, the significance of the Klan Act is that it prohibits “conspiracy” to “prevent by force, intimidation, or threat, any citizen who is lawfully entitled to vote, from giving his support or advocacy in a legal manner, toward or in favor of the election of any lawfully qualified person as an elector for President or Vice President, or as a member of Congress of the United States.” \\nAs an example of the role the KKK plays in Trump’s campaign, Maddow produced the KKK’s newspaper of today, which bills itself as “The Political Voice of White Christian America,” which, you might note, is identical with Fox News demographic. This paper, she says, “has been turning up on front lawns in the great state of Georgia.” \\nWatch courtesy of MSNBC (discussion begins at 9:15 mark): \\nTonight we just got a hold of this disgusting development. This is the newspaper of the Ku Klux Klan today. It’s The Crusader, the political voice of white Christian America. The premier voice of white resistance. They’ve got — you see the white power symbol there in the upper right-hand corner? They’ve got a whole media operation going on apparently. Watch white pride TV, listen to KKK radio 24 hours a day. This newsletter is about 12 pages long, features articles on “the threat of nonwhite immigration,” a very subtle feature on black people committing terrible crimes against white people. There’s an article by the founder of the America First Party which is all about the terrorist Jews. He brags in his byline that he’s the man who David Duke credits for awakening him to the threat of Jewish supremacism. It’s exactly what you would think from the Ku Klux Klan newspaper. If you knew there was a Ku Klux Klan newspaper these days. But the front page full page story is “Make America Great Again” with a big featured center photo of Donald Trump. It’s one of several articles in the paper about Trump, including this in-set article about how Trump’s candidacy is “moving the dialogue forward.” […] Those are a couple of the many, many robocalls that were made during the Republican primary campaign on behalf of Donald Trump’s candidacy, calls made by a white nationalist group that calls itself the American National Super PAC. The Trump campaign doesn’t appear to have anything to do with these calls. They reportedly returned a donation from the white nationalist guy who you hear on the call when it was first reported that he was making these calls and that he was a Trump donor. It was further embarrassing to the Trump campaign when this guy, this farmer and white nationalist who does these robocalls, he was initially picked to be a Trump delegate to the Republican Convention this year before his delegate status once got yanked once it was widely reported. \\nDonald Trump’s white supremacist followers have made no secret of the fact that they want a “White homeland” and that, of necessity, the United States must be this White homeland. As Maddow has pointed out in the past, and by their own admission, their “eugenics insanity” is now out in the open because of Donald Trump. \\nDon’t believe Maddow? Demographics Pro looked at “10,000 Donald Trump Twitter supporters [and] found that more than one third follow white nationalist Twitter accounts.” \\nThe fact is, Trump has mainstreamed white supremacy and by not strongly denouncing it, brought it into his own “movement,” which seems to be a meeting place for much more than disaffected white working-class Americans, whatever the mainstream media tells you. \\nThe Trump campaign is a maelstrom of hate, and the KKK is right at the heart of it.'"}, "time": 1742563129.5634508}