{"duration": 0.04633903503417969, "input_args": {"text": "'0 comments Video after video does not lie. This footage, along with leaked emails, explains so much. SHE EVEN DRINKS TWO-FISTED! Stories of Hillary Clinton’s affinity for alcohol have been around for years, and some of them, even in her own words, are legendary. Consider her vodka drinking contest with Senator John McCain. Here it is, told by none other than Democrat Presidential Nominee Hillary Clinton, in her own words and posted on her Facebook page: \\nThen of course, there is the “trip” Yemen. Watch her walk, her mannerisms, and her fall. Pay close attention: \\nOur video study is just getting started, though now is a good time to mention the latest from WikiLeaks on the topic of Hillary’s “sobriety.” \\nOn August 8, 2015, Hillary’s Campaign Chairman John Podesta wrote to Communications Director Jennifer Palmieri, “Should I call her and talk this through or better to leave with you? I’m worried she’ll get on with Cheryl and we’ll end up in a bad place. I’m in a session that lasts till 3:30 your time. Is that timely or should I walk out?” \\nTwo hours later, Palmieria responded, “I think you should call her and sober her up some.” \\nIt was 4:30pm, in the afternoon, and her staff is interested in sobering her up. \\nHillary’s campaign staff are not the only one’s to have noticed her drinking. \\nAmy Chozick, a reporter for the New York Times, explained, “She likes to drink. We were on the campaign trail in 2008 and the press thought she was just taking shots to pander to voters in Pennsylvania. Um, no.” \\nIn October of 2016, Chozick sent the following tweet: \\nMakes sense, especially in light of campaign videos like this one: \\n— Elizabeth Harrington (@LizWFB) October 10, 2016 \\nEvidently, drinking is one of Hillary’s political strategies. \\nIn a July 3 article, the New York Times reported that Hillary plans to “seek common ground with the G.O.P. over drinks” in her first 100 days. \\nIt continued, “Mrs. Clinton’s ability to use alcohol as a political lubricant came up repeatedly when allies and advisers were asked how she might work with Republicans. Her tale about a drinking contest with Senator John McCain of Arizona is now a Washington legend. (She said they called it quits before things got out of hand.) She believes that a relaxed, frank discussion is more authentic than trying to bond awkwardly with adversaries over sports — and more productive than keeping them at arm’s length, as Mr. Obama has often done. \\n“‘She likes to cajole, she likes to make deals, and she likes to make friends,’ said Richard Socarides, a former policy adviser to Bill Clinton and a longtime supporter of Mrs. Clinton. ‘And she knows it’s much harder to go after someone who you basically like, who you’ve had a drink with.’” \\nOne of Hillary’s confidantes, Patti Solis Doyle, once remarked, “She likes to hang out and drink and gossip.” Her drink of choice? Wine and vodka. \\nOn that note, have a look at this these gems: \\nAnd another, this time, TWO-FISTED! \\n\\nPeople have asked: Did Hillary Clinton’s alcohol usage lead to her current neurological condition? \\nYet another video look:'"}, "time": 1742561919.0556357}