{"duration": 0.03293108940124512, "input_args": {"text": "'Samstag, 29. Oktober 2016 Autofahrer entlarvt geheimen Zahlentrick, mit dem sich jeder Blitzer überlisten lässt Berlin (Archiv) - Ein Berliner Autofahrer hat einen geheimen Trick entdeckt, mit dem sich Radarfallen und Blitzer auf Autobahnen zu 100 Prozent überlisten lassen. Erste Praxistests scheinen die Theorie des Hobbyphysikers zu bestätigen. Seine zahlenbasierte Methode soll für jeden Autofahrer innerhalb von Minuten erlernbar sein. Seit 1990 ist Jörg Haffke jeden Tag auf deutschen Autobahnen unterwegs, was den Berufspendler oft teuer zu stehen kommt: \"Früher verging kaum eine Woche, ohne dass ich ein Knöllchen im Briefkasten hatte, nur weil ich mal wieder in eine Radarfalle geraten war\", klagt der 43-Jährige. Die verschiedensten Gegenmittel habe er schon ausprobiert: \"Reflektierende CDs am Innenspiegel, abgedecktes Kennzeichen oder Blitzwarner-Apps – nichts hatte auf Dauer wirklich Erfolg\", berichtet der Familienvater. Er hat den Code geknackt: Jörg Haffke Haffke ist jedoch nicht nur ein cleverer Bastler, sondern auch ein guter Beobachter: \"Irgendwann fiel mir auf, dass neben den Autobahnen immer wieder so merkwürdige Schilder mit Zahlen drauf versteckt sind.\" Zwei Jahre und 122 Excel-Tabellen später ist sich Haffke nun sicher, den geheimen Algorithmus hinter den kryptischen Blechtafeln endlich entlarvt zu haben: \"Wenn man ein Tempo mit einem Tachowert fährt, der in etwa der Zahl auf dem letzten gesichteten Schild entspricht oder darunter liegt, verhindert man ein Auslösen des nächsten Blitzers! Man ist praktisch unsichtbar.\" Welche physikalische Kraft diese offensichtliche Fernwirkung herbeiführt, sei ihm zwar nicht ganz klar: \"Vielleicht gibt es ja doch etwas, das größer ist als wir!\" Das Ergebnis gebe ihm aber recht: \"Keine Knöllchen in den letzten sechs Monaten\", erklärt er stolz. Nun will Haffke seine Erfahrungen an andere Autofahrer weitergeben – und hat dazu die Standorte der knapp fünf Millionen bisher identifizierten \"Zahlenschilder\" in einem einzigartigen Nachschlagewerk verzeichnet. Jörg Haffke: \"Zahlenschilder in Deutschland: Die geheimen Zeichen, mit denen sich Radarfallen überlisten lassen\", 3480 S., Selbst-Verlag, Eigenheim 2015. bep ( Kojote ); Fotos: Shutterstock; Hinweis: Erstmals erschienen am 27.10.15 Artikel teilen:'"}, "time": 1742628305.1178722}