{"duration": 0.0634760856628418, "input_args": {"text": "'none today c) REPORT ON CHINA \\ni)Last week’s TIC report showed a huge 346 billion dollars worth of treasuries sold. What was more disturbing was China sold 34 billion of USA treasuries. The big question is China offloading all of its foreign treasuries proportionally or just the USA. It seems the latter as Japan reports that China is gobbling up Japanese government bonds by the bucketful despite its negative yield. Last yr they bought $87 billion worth of Japanese bonds. China made its move because of the threat of higher interest rates. The chance that Japanese rates go higher is nil. \\n( zero hedge) \\nii)Chinese bank assets total 32 trillion equiv usa, with bank liabilities at just about 30 trillion equiv USA. To give you a comparison to the uSA: the total USA banking liabilities are around 15 trillion. The problem in China is bad debts which are in the area of 15 to 20%. \\nThus 5 to 6 trillion equiv dollars must be written off…where are they going to get the money for this? \\n(courtesy zero hedge) 4 EUROPEAN AFFAIRS \\ni)Deutsche bank \\nInvestors scared as to what they are witnessing, have pulled another 8 billion dollars worth of funds from the ETF unit, causing more liquidity problems for the bank \\n( zerohedge) \\nii)ECB \\nA trial balloon has been floated by the ECB that they are almost certain to continue buying bonds beyond the March 2017 deadline \\n( zero hedge) \\niii)SPAIN \\nWhat a mess: King Felipe asks Spain to form a minority government and it will be done with abstentions. The problem here is that Rajoy promised to cut taxes and increase expenditures. The ECB wants the opposite \\n( Mish Shedlock/Mishtalk) iv)DEUTSCHE BANK Deutsche bank is probing its own derivatives to see if they have been misstated. They are also sharing their information with USA authorities ( zerohedge) \\nv)ITALY \\n\\nThis is all Italy needs; Central Italy (around the Perugia area) is hit with a strong 5.4 magnitude earthquake \\n( zero hedge) \\nvi) BANK OF ENGLAND/ITALIAN BANKS/DEUTSCHE BANK \\n\\nGreat reason for gold and silver to be whacked today: The Bank of England is asking its UK Banks to detail their exposure to both Deutsche bank and the Italian banks \\n( zero hedge) vii)CALAIS FRANCE (THE “JUNGLE”) We brought you the story where the authorities rounded up 8,000 refugees harbouring on the outskirts of Calais in what is referred to as the “Jungle”. They burned the refugee centers there and tried to move the migrants throughout France. This is not working as they breaking the police lines trying to get into the jungle. Generally they try and hitch a ride across the channel into England. (courtesy zero hedge) 5. RUSSIAN AND MIDDLE EASTERN AFFAIRS \\ni)Trump correctly states that Hillary’s plan for Syria would eventually lead to World War iii as the Russians would be totally against her formula. The Russians know full well that the issue is to remove Russia from providing natural gas to all of Europe \\n( zero hedge) \\nii)Russia flexes its muscle by revealing a nuclear missile capable of reaching USA soil. ( Alexander Mercouris/The Duran.com) \\niii)World tensions just got hotter as Russia is forced to cancel refueling of its warships at Spain’s eastern Mediterranean port of Cueta. The warships are heading to Syria( zero hedge) \\niv)what on earth is going on here? Cyberwarfare? no comment from me is necessary: ( zero hedge) \\nv)The warmongers are at again, as NATO is pushing for the biggest build up on Russia’s borders since the cold war; good reason to whack gold today(courtesy zero hedge) 6.GLOBAL ISSUES \\nMonths ago, many foreign investors were flocking into Mozambique bonds due to its higher yield. This morning, they woke up to the fact that these bonds are crashing with a yield of over 20%. The government admits that it’s nation is in debt distress and they also reported on undisclosed bond issuance. The country’s Debt to GDP ratio is 86 / with total country debt/GDP at 112. \\n( zerohedge) 7.OIL ISSUES \\nAfter a huge gain in API inventory, the DOE reports a draw down and this causes crude to climb back above 50 dollars \\n(courtesy zero hedge) \\nConditions inside Venezuela going from bad to worse \\n(courtesy zero hedge) \\ni)Rory Hall/Dave Kranzler interview Bill Murphy of GATA \\n( GATA/IRD) \\nii)Chinese mining companies Zijin andShandong are in talks for stakes in Barricks Veladero mine in Argentina. This mine is a good producer for Barrick at 500,00 plus oz per year. \\n(courtesy GATA/R euters) 10.USA STORIES WHICH MAY INFLUENCE THE PRICE OF GOLD/SILVER \\ni)The following is very important: the Richmond fed finally confirms that business conditions in its area has not deteriorated this fast since Q2 of 2008. \\n( zero hedge) \\nii)The Fed is broadcasting that it is going to let inflation run wild in the USA \\n( Graham Summers/Phoenix Capital Research) \\niii)Apple slides after disappointing numbers: \\n( zero hedge) \\niv)Trump unexpectedly regains the lead in Florida with the latest polls \\n( zero hedge) \\nv)Wholesale inventories fail to grow and are basically unchanged even though auto inventories are up 9%. Inventory to sales ratio improves to 1.33 but still deep in recession. \\n( zero hedge) \\nvi)Today, we see the service sector PMI surge to 54.8 and it is at its highest level in 11 months .Together with the mfg PMI it looks like the USA is growing at 2% \\n( zero hedge) \\nvii) New home sales rose only after a major revision from August: \\nnew home sales: 593,000 but expectations were 600,000. August levels; 609,000 \\n( zero hedge) \\nviii)Project Veritas 4 just released and more trouble for the DNC \\n( zero hedge) Let us head over to the comex: \\nThe total gold comex open interest ROSE BY 849 CONTRACTS to an OI level of 507,617 as the price of gold ROSE $9.90 with YESTERDAY’S trading. \\nWe are in the delivery month is October and here the OI LOST 217 contracts DOWN to 104. We had 250 notices filed YESTERDAY so we GAINED 33 contracts or 3,300 additional oz will stand for delivery. \\nThe next delivery month is November and here the OI FELL by 176 contract(s) DOWN to 2260 contracts. This level is extremely elevated as generally November is a very poor delivery month.To give you an idea of size, on Oct 26 2015, we had an OI of only 253 contracts standing. Eventually by the end of Nov 2015, 214 notices stood for delivery for 21,400 oz (.6656 tonnes).The next contract month and the biggest of the year is December and here this month showed an decrease of 871 contracts down to 372,221. Today we had 1 notice filed for 100 oz of gold.'"}, "time": 1742628462.635028}