{"duration": 0.22585797309875488, "input_args": {"text": "'Our top story tonight: Lord Commander Jon Snow is still dead. Has it really been nine months since we saw him last, taking the final, cruelest blow from young Olly and collapsing onto the ground, blood pooling behind him? It seems like he never left, what with the various rumors and sightings, reports about haircuts and breathless dispatches about Kit Harington’s romance with the equally dead, in “Thrones” terms, Rose Leslie. But there he was on Sunday, stone dead and stiffening as Ghost howled in despair. And he only got stiffer as the hour progressed, while Davos pondered his next moves with a few loyalists and the mutineers went public with their treachery. Even the Red Woman, everyone’s favorite candidate for resurrecting Snow, could only stand there dumbfounded by the turn of events. “I saw him in the flames fighting at Winterfell,” she said. “I can’t speak for the flames,” Davos said. “But he’s gone. ” Now, will he stay that way for long? Probably not. As I noted in a season preview, the show will have to resolve this thing one way or the other pretty soon or it will risk overshadowing the rest of the story  —   ask the “Walking Dead” folks about viewers’ general patience with narrative shenanigans these days. But for one week, at least, the dude was dead, just like everyone said. [ Subscribe to our Watching newsletter for expert movie and TV recommendations. ] The Snow thing was one of about 13, 000 subplots (a rough estimate) that got serviced in the season premiere, a terrifically busy episode that at times, with its quick glimpses of exposition and rapid cutting from scene to scene to scene, reminded me a bit of the old “Batman” show. Here’s two minutes in Meereen  —   CUT  —   here’s Cersei and Jaime  —   CUT  —   poor Blind Arya  —   CUT  —   Sansa in the snow  —   CUT  —   Sand Snakes!  —   et cetera. Story density is a key component of “Game of Thrones,” of course, the breadth and depth of its world is part of what makes the show so transportive. But it can make for frenetic viewing in these early   episodes. That said, the scenes at Castle Black had plenty of room to breathe and others, like Sansa’s rescue and Ellaria Sand’s power grab in Dorne, packed plenty of thrills into tight spaces. Also, you go into “Thrones” premieres knowing they’re about picking up the pieces from the previous season, and this year the shards are especially jagged. Cersei, former   has had everything ripped away, to the point that she can’t even get mad at Jaime about the hash he made of the Myrcella rescue effort. The witch told me I’d have three children and they’d all die, she said. “Everything she said came true, you couldn’t have stopped it. ” (What’s that, Tommen? Oh nothing. Never you mind   …    ) Cersei’s old nemesis Margaery, meanwhile, is still in the hoosegow, taking her own turn with the Nurse Ratched of TV nuns. “Septa Unella can be overzealous at times,” the High   said. Gee, ya think? Over in Essos, Daenerys Targaryen has to be wondering if you can really call yourself the Mother of Dragons if your dragons like to abandon you in random fields. She’s now a prisoner of her new Dothraki friends, and they are classy. Khaleesi spent the early moments enduring two charming lads who made all sorts of offensive remarks and speculations. The confab with the Khal continued along the same trajectory until Khaleesi had finally had enough. I’m the former wife of Khal Drogo, she said. I burned his body and everything. Oh, well that changes things, Khal Moro said, to Khaleesi’s satisfaction, but then he threw her a curveball. The best place for you is the widow temple, she was told, which I’m guessing is just as delightful as it sounds. I still think we should cut off her head, Moro’s wife muttered, probably. Even Ramsay, the sociopathic monster we’ve come to know and loathe, showed a bit of what almost seemed like actual human emotion and heartbreak. He mourned Myranda, tossed to her death by Theon last season, recalling how only she wasn’t afraid of him back when he was a young bastard and she a simple kennel master’s daughter. “She smelled of dog,” he reminisced fondly. (Awww. Also, Ramsay’s apparently been terrible forever.) He composed himself in time to make plans for the funeral. Coffin or pyre? someone asked. Try the dog dish. Finally, there was the aforementioned alluring Red Woman of the episode title, who in the startling concluding moments was revealed to actually be an Old Gray Mare. “You haven’t seen her do what I’ve seen her do,” Davos had told his compatriots earlier. My friend, you haven’t seen the half of it. At first I thought perhaps it was the omnipresent intricate choker that conferred her lustrous youth and beauty, but photographic evidence suggests she’s removed it before without such dramatic consequences. There was a   on the vial on her dressing table so perhaps her beauty secret is contained therein. Whatever it is, the transformation made for a graphic illustration of the fall she, too, has taken. We saw last year what her ghastly strategic advice brought Stannis (R. I. P. Shireen) and now all of her plans for Jon Snow, glimpsed in the flames, have apparently gone up in smoke. There’s nothing left for this once vivacious, insidiously confident force but to crawl miserably into bed like the feeble old woman she really is. Indeed, it’s perhaps wishful thinking but there were signs that the arc of “Thrones” history, mostly distinguished thus far by cruelty, might be starting to bend toward decency, or at least tipping away from the sinister interests that have dominated things lately. In addition to Melisandre’s crisis of faith, there is the terrible Ramsay’s inheritance crisis, after his reprehensible “games” drove away the one thing that could have solidified his place in his family and his family’s place in the North. I’m talking about Sansa Stark, of course, whose escape and rescue by Brienne infused the narrative with more hope than has any other single scene I can recall. [ Interview: Maisie Williams on the Season 6 premiere ] Theon led Sansa away from Winterfell with great drive and courage, and continued to suggest Reek may be receding. (Some aspects of the old Theon are never coming back, of course, but maybe he can fill the void with volunteering or something.) He went on to sacrifice himself before Ramsay’s hounds and men. “I can’t wait to see what part Ramsay cuts off you this time,” a henchman muttered with glee. Well, I can’t wait to see warrior maiden slice you up like a ham,  . And so it went, when Brienne arrived with a notably   Podrick to save the day, for once. I’ve bagged on Brienne for awhile now over her general failure to fulfill her oath to protect the Stark girls. So credit where it’s due: Nice job, Brienne! Score one for dogged persistence. The lesson is that Brienne gets it done, it just takes longer than most of us would like. After all, she killed Stannis in last year’s finale and she’d only been after him since his smokebaby killed Renly in Season 2. So I should probably stop projecting my   impatience onto her. Finally, there was the emergence of Sansa, who you’ll recall seemed ready to take charge of her destiny around this time last year before the whole Ramsay nightmare intervened. Whatever your thoughts about the brutalities she endured and how they were presented, they no doubt hardened her. And when she accepted Brienne’s vow of loyalty and affirmed hers as well, it felt like a symbolic assumption of command of her shattered family. Starting with the death of Ned Stark and certainly since the Red Wedding, this story has been   with villainy. Sansa’s union with Brienne felt like it could be a first step toward restoring some balance between wicked strivers and nobler interests. Of course, we’ve seen something like this before: One of the most triumphant moments in the show was when Dany took off on Drogon, and look what that got her. There are still zombies out there somewhere, too. But just give me this for one week, O. K.? When it comes to “Game of Thrones,” I’ll take whatever hope I can get. • Someone’s burning boats in Meereen. Maybe one day Tyrion and Varys can make me care about Meereen. There is apparently a mysterious figure orchestrating the Harpy insurrection, though, which could get interesting. The   joke was pretty broad but still enjoyable. (Name me another show about which you can read a phrase like “the   joke” and not bat an eye.) • On the other hand, get a load of the action in Dorne! There was more excitement there in three minutes than there was in all of Season 5. An underrated aspect of this show is the way seemingly minor characters evolve into major players. Ellaria Sand seemed like little more than a lascivious sidekick when she arrived with Oberyn in Season 4, but there she was on Sunday staging a coup, inaugurating a new   men era of Dornish leadership. • Poor Trystane. He and Myrcella always seemed too delicate for this savage world, but that thing went bad in a hurry, and more graphically than I would have guessed. Obara the Sand Snake dispatched him with the sort of protruding Pinocchio skewer that’s become a signature finishing move on “Game of Thrones. ” (See also, the rotten Karl Tanner in Season 4.) • Blind in Braavos seems like no kind of fun, and that’s before a girl starts beating you with a stick. “See you tomorrow,” the Waif told Arya, in what might have been the most chilling line of the night. • Forget everyone who isn’t us, Jaime told Cersei (more or less). Is it wrong that I found their reunion sort of touching? Also, should we be preparing for a more sympathetic Cersei this season? “From her first breath she was so sweet. I don’t know where she came from,” she said about Myrcella. “I thought if I could make something so good, so pure, maybe I’m not a monster. ” • The weight of betraying Jon Snow really aged young Olly, huh? • Over all pretty good, right? I’m intrigued by how Cersei and Melisandre are going to put themselves back together, and by Sansa’s continuing emergence. Clearly Davos isn’t going to   it south, as Ser Alliser advised, but how do you think that whole thing’s going to shake out? Are you still invested in it either way? Please fire away in the comments.'"}, "time": 1742563673.0937896}