{"duration": 0.08248043060302734, "input_args": {"text": "'in: Natural Medicine , Toxins A remarkable study published in the journal of Basic & Clinical Pharmacology & Toxicology revealed something very special about garlic: it is a natural detoxifier of lead and is not only as effective as a common chelation drug known as d-penicillamine at pulling this metal out of the body but is also much safer. The study was titled, “ Comparison of therapeutic effects of garlic and d-penicillamine in patients with chronic occupational lead poisoning,” and sought to confirm previous research in animals that showed garlic (Allium sativum) is effective in reducing blood and tissue lead concentrations. [1] The study took the measurements of the blood lead concentrations of 117 workers at a car battery plant who were randomly assigned to two groups of garlic (1.2 milligrams of allicin from approximately 1,000 mg of garlic extract, three times daily) and d-penicillamine (250 mg, three times daily) and treated for 4 weeks. Clinical signs and symptoms of lead poisoning were also investigated and compared with the initial findings. The study found: Clinical improvement was significant in a number of clinical manifestations including irritability (p = 0.031), headache (p = 0.028), decreased deep tendon reflex (p=0.019) and mean systolic blood pressure (0.021) after treatment with garlic, but not d-penicillamine. BLCs [blood lead concentrations] were reduced significantly (p=0.002 and p=0.025) from 426.32±185.128 to 347.34±121.056μg/L and from 417.47±192.54 to 315.76±140.00μg/L in the garlic and d-penicillamine groups, respectively, with no significant difference (p=0.892) between the two groups . The frequency of side effects was significantly (p=0.023) higher in d-penicillamine than in the garlic group . Thus, garlic seems safer clinically and as effective as d-penicillamine. Therefore, garlic can be recommended for the treatment of mild-to-moderate lead poisoning. Clearly, despite the near equal reduction in measurable blood lead concentrations in both groups, improvements in various measured clinical manifestations were only found in the garlic group . Also, side effects were higher in the d-penicillamine group. These results clearly indicate the superiority of garlic over the drug and underscore how drug-based interventions often end up ‘normalizing’ target values, e.g. blood lead concentrations, without resulting in improvement in the quality of life or even the objective clinical signs and subjective symptoms of the treated patient; to the contrary, often the patient feels and is much worse off following drug treatment. Last year, a remarkable study published in the journal Basic & Clinical Pharmacology & Toxicology revealed something very special about garlic: it is a natural detoxifier of lead and is not only as effective as a common chelation drug known as d-penicillamine at pulling this metal out of the body but is also much safer. The study was titled, “ Comparison of therapeutic effects of garlic and d-penicillamine in patients with chronic occupational lead poisoning,” and sought to confirm previous research in animals that showed garlic (Allium sativum) is effective in reducing blood and tissue lead concentrations. [1] The study took the measurements of the blood lead concentrations of 117 workers at a car battery plant who were randomly assigned to two groups of garlic (1.2 milligrams of allicin from approximately 1,000 mg of garlic extract, three times daily) and d-penicillamine (250 mg, three times daily) and treated for 4 weeks. Clinical signs and symptoms of lead poisoning were also investigated and compared with the initial findings. The study found: Clinical improvement was significant in a number of clinical manifestations including irritability (p = 0.031), headache (p = 0.028), decreased deep tendon reflex (p=0.019) and mean systolic blood pressure (0.021) after treatment with garlic, but not d-penicillamine. BLCs [blood lead concentrations] were reduced significantly (p=0.002 and p=0.025) from 426.32±185.128 to 347.34±121.056μg/L and from 417.47±192.54 to 315.76±140.00μg/L in the garlic and d-penicillamine groups, respectively, with no significant difference (p=0.892) between the two groups . The frequency of side effects was significantly (p=0.023) higher in d-penicillamine than in the garlic group . Thus, garlic seems safer clinically and as effective as d-penicillamine. Therefore, garlic can be recommended for the treatment of mild-to-moderate lead poisoning. Clearly, despite the near equal reduction in measurable blood lead concentrations in both groups, improvements in various measured clinical manifestations were only found in the garlic group . Also, side effects were higher in the d-penicillamine group. These results clearly indicate the superiority of garlic over the drug and underscore how drug-based interventions often end up ‘normalizing’ target values, e.g. blood lead concentrations, without resulting in improvement in the quality of life or even the objective clinical signs and subjective symptoms of the treated patient; to the contrary, often the patient feels and is much worse off following drug treatment. Lead exposure is ubiquitous in our modern age, and has been estimated to account for approximately 0.2% of all deaths and 0.6% of disability adjusted life years globally. [2] Exposure to this heavy metal results in harm to the cardiovascular, skeletal, gastrointestinal, kidney, reproductive and nervous systems of the human body. It has been identified to be particularly harmful to infants and children, whose developing nervous systems are far more susceptible to lead toxicity than those of adults. In fact, a 2008 PLoS study found decreased brain volume in adults who had been exposed to lead as children. [3] The standard of care involving drugs such as d-penicillamine is dismal, considering that the chemical has been linked to the following side effects: Anemia, Aplastic'"}, "time": 1742562863.066745}