{"duration": 0.1157536506652832, "input_args": {"text": "'Email Print It would appear as though conservatives have had enough of the liberals dumping on our HQ’s around the country, so they decided to dump a little something on one of theirs! USA Today reports that in the early morning hours of Saturday, the Warren County, Ohio, Democrat Headquarters received a “gift” from an anonymous donor. Of course, the idea of a “gift” is always in the eyes of the receiver. Where a farmer would have been grateful for the donation, Democrat leadership was less than thrilled with it. The gift in question: a truckload of manure. Some would view this delivery as a “redistribution of wealth” – a truckload of manure isn’t necessarily cheap. Others may see it as the public giving back what Democrats have been shoveling out for the last eight years. While this “donation” is being categorized as an act of vandalism, you can’t help but believe that the police officers who took the call on this “contribution” had a stifled chuckle about it. There is a humorous aspect to this social commentary. “What reasonable person thinks this is OK?” Democrat Party Chair Bethe Goldenfield said in a post on social media. “I won’t be responding to anyone who thinks this is acceptable behavior. It is illegal !” The same thing happened in 2012, Goldenfield noted. Evidently, Ms. Goldenfield doesn’t appreciate the subtlety of the humor and/or the karma involved. One could argue that “what goes around comes around.” Warren County is a suburban Cincinnati county that overwhelmingly votes Republican. Mitt Romney garnered 69 percent of the vote in 2012. In fact, it’s been close to 40 years since a Democrat was elected to even a countywide office. In response to the news, the chairman of the Warren County Republican Party said the GOP had nothing to do with the manure. In an act of good faith, he extended access to organization volunteers “to help clean things up.” That is a far cry from anything Democrats have offered in the aftermath of much more serious incidents at Republican headquarters in North Carolina and Indiana. In North Carolina, someone firebombed the Orange County GOP headquarters. In that incident, graffiti was scrawled on the side of the building warning the Republican “Nazis” to leave the county or else. In Indiana, someone tossed a brick through the window of one local Republican headquarters. Both of these incidents – presumably executed by pro-Clinton operatives – caused extensive monetary damage. The “donation in Warren County, Ohio, caused no damage and, if Ms. Goldenfield was resourceful, she could have made a profit for the organization in selling the manure to a farmer or a garden center. These examples illustrate the fundamental differences between the Left and Right side of the aisle. Where the Right makes symbolic gestures that literally hurt no one and harm nothing, the Left firebombs and destroys property. Please tell me which party is the more civilized and intellectual party? All that Progressive enlightenment hasn’t amounted to much. What do you think about campaign “contribution” that was made to the Democrat Party in Ohio? Please share the story on Facebook and tell us because we want to hear YOUR voice! Join us on Facebook to Stop The Takeover. Click on the button to subscribe. '"}, "time": 1742562189.7636862}