{"duration": 0.058730125427246094, "input_args": {"text": "'by ARIANA MARISOL \\nIf you have ever been to a grocery store, you have probably mistaken sweet potatoes for yams. Surprisingly, many people have actually never had a real yam before. You can blame incorrect labeling for this mix-up. \\nThe confusion stems from the names of yams and potatoes being used interchangeably in the U.S. market and in recipes even though sweet potatoes and yams are two distinctly different vegetables. \\n\\nThe Yam that is Not a Yam It is important to recognize that sweet potatoes are not yams and yams are not sweet potatoes. Although the two are tuberous root vegetables that come from a flowering plant, they are not related and do not have a lot in common. \\n\\nA Sweet Potato Sweet potatoes comes from the morning glory family and have many varieties. They are normally elongated with tapered ends and their skin ranges from white and yellow, to purple and brown. The flesh of sweet potatoes ranges from white, yellow, orange, and even orange-red. \\nOne (200 grams) baked sweet potato is 180 calories and contains 214% vitamin A, 52% vitamin C, 50% manganese, 36% copper, 34% vitamin B6, 29% biotin, 27% potassium, and 26% fiber. \\nThe two major types of sweet potatoes grown in the U.S. are: \\nSoft sweet potatoes: copper skin and orange flesh \\nFirm sweet potatoes: golden skin and pale flesh \\nThese two types of sweet potatoes are cooked differently. Firm sweet potatoes remain hard and slightly waxy after being cooked, while its softer variety becomes creamy and soft when cooked. \\n\\nA Real Yam Native to Africa and Asia, yams are related to lilies, and range in size from as small as potatoes to as big as 5 feet long. Yams are cylindrical shaped with blackish or brown, bark-like skin and white, purple, or reddish flesh. \\nYams have a dry, starchy consistency and are hard to find in the United States because they are mostly imported from Africa. Many local grocery stores do not carry true yams and your best chance of finding them would be at specialty markets. \\nA 1-cup serving of yam provides 20% of your daily needs of potassium and copper. Potassium helps produce healthy muscles and energy. Copper helps with the synthesis of collagen, hemoglobin, and melanin. \\n\\nWhat is Labeled as a Yam in Grocery Stores? If real yams are hard to find, why do many grocery stores say that they sell “yams”? Normally, these “yams” are actually sweet potatoes. By knowing this, you will be able to shop smarter and actually find what you are looking for. \\nAs mentioned above, there are two different types of sweet potatoes found in normal U.S. grocery stores — “soft” sweet potatoes, and “firm” sweet potatoes. The firm variety of the two was introduced to the United States first. When the softer version began to show itself in markets, there was a need to differentiate the two. These softer sweet potatoes slightly resemble yams so they were labeled as such. \\n\\nYam — Soft sweet potato with copper skin and orange flesh. \\nSweet potato — Firm sweet potato with golden skin and light flesh. \\nIf you want to cook a classic baked sweet potato with crispy skin and fluffy orange flesh, what you should buy will most likely be labeled as a yam. Remember what kind of sweet potato you want when going to the store and be aware of the yam/sweet potato labeling concept. Remember to keep an eye out for different coloration to better identify what you want. \\n\\nAriana Marisol is a contributing staff writer for REALfarmacy.com. She is an avid nature enthusiast, gardener, photographer, writer, hiker, dreamer, and lover of all things sustainable, wild, and free. Ariana strives to bring people closer to their true source, Mother Nature. She is currently finishing her last year at The Evergreen State College getting her undergraduate degree in Sustainable Design and Environmental Science. Follow her adventures on Instagram. \\nPhoto Credits:'"}, "time": 1742561791.6633112}