{"duration": 0.060279130935668945, "input_args": {"text": "'Battles of Kunduz: US/Afghan ‘friendly fire’ By Eric Walberg Posted on November 4, 2016 by Eric Walberg \\nThe first “Battle of Kunduz” took place from April to October 2015 for control of the city, where Taliban forces were playing cat and mouse for months and finally overran the city, forcing government forces to flee. The capture marked the first time since 2001 that the Taliban had taken control of a major city in Afghanistan. The Afghan government claimed to have largely recaptured Kunduz by October 1 in a counterattack. But by 6 October, the Taliban had recaptured substantial portions of Kunduz. \\nIn the confusion, on October 3, long after the government had supposedly recaptured the city, still looking for the Taliban command centre, US fighter pilots ominously circled the Kunduz emergency care trauma hospital. It had been installed and administered by Doctors without Borders (MSF), the only state-of-the-art facility in the war-torn province. \\nFor 45 minutes, like ominous clouds, the planes fired pot shots, as if warming up, taunting or warning the doctors and patients, who started to flee and were mowed down. Finally, the pilots of the gunships launched full scale fire at 2 a.m., on both the hospital and civilians fleeing what was clearly the target of US wrath. \\nA year later, the Canadian MSF head, Stephen Cornish, described the assault at a memorial gathering at Toronto General Hospital honouring the 42 victims, both the MSF doctors and their patients, killed by US forces. In keeping with NGO tradition, Cornish wouldn’t lay the blame on specific individuals, though there were dozens of eye witnesses. He just kept insisting that there be an independent inquiry. \\nThe US military refused, quickly deciding it was multiple errors of command and execution. The US forces were changing their shift and got confused. A sleep-deprived Green Beret major in charge of the US force believed that the Afghan commandos were under fire from the Taliban control centre. The local headquarters of Afghanistan’s spy agency, the National Directorate of Security, was 500 m from the hospital. \\nThe hospitals was clearly marked to avoid precisely such error. MSF had warned US and Afghan authorities of the hospital’s location ahead of time, but bombing continued for more than 30 minutes after it notified military officials it was under attack. ‘Sorry, human error.’ No one, sleep-deprived or otherwise, was held responsible. Not a peep from the official Afghan authorities in Kunduz. \\nThis case is frightening, “a turning point” according to MSF Canada President Heather Culbert. “That the US would violate one of the fundamental tenets of international humanitarian law by attacking civilians in a medical facility was appalling.” Even worse, there have been an increasing number of violations of international humanitarian law that have taken place in the 12 months that followed. \\nEven worse, no one was charged, despite the sleepy ‘smoking gun’. The US military has ‘status of forces’ agreements with all countries precisely for that reason, allowing it to spirit out its guilty soldiers before they can be brought to account, whether it be for murder, rape or worse. \\nThe ‘fall’ of Kunduz to the Taliban prompted a number of Afghan parliamentarians to call for the resignation of President Ashraf Ghani and Chief Executive of the Islamic Republic Abdullah Abdullah. In response Ghani’s office replied that he had ordered an investigation into how Kunduz City fell so quickly. \\nInstead of putting things ‘in order’, the Afghan government continues to watch Kunduz go back and forth between the Taliban and the Afghan National Army. As MSF honoured their fallen last month, the Taliban forces once again took the center of the city, forcing the only remaining hospital to evacuate staff and patients. \\nSyria is the most dangerous spot for MSF. In February 2016, two MSF-supported hospitals in Idlib District and Aleppo were bombed, killing at least 20 and injuring dozens of patients and medical personnel, it is not clear by whom. In April 2016, an MSF hospital in Aleppo was bombed, killing 50, including six staff and patients. Again, it is unclear who did the bombing. \\nThey get flack from both sides wherever they operate. A few weeks after the Kunduz tragedy, an MSF hospital in Sa’dah, Yemen, was bombed by the Saudi Arabia-led military coalition, and then again in January 2016, killing 6. In November 2015, an MSF hospital was bombed by a Syrian Air Force helicopter, killing seven and wounding 47 people near Homs. \\nIn Kunduz, the hostility is greatest from government officials, who distrust them, humiliated by their inability to maintain order. I suggested to Cornish: Is it revenge? A warning that you shouldn’t even be here? No comment. Cornish just insisted that hospitals should be out of bounds in conflict situations. But ‘sleep deprivation’ hardly accounts for the Kunduz tragedy. \\nThe account of the battle for Kunduz reads like a video game. The ‘good guys’ in bullet-proof armour on adrenaline and/or drug-induced highs, using night vision goggles and infrared cameras, guns and grenades, like toys in a dazzling arcade. The ‘bad guys’—poorly armed guerrillas who perversely refuse to submit to the ‘good guys’. The thrill of a brush with death for US soldiers, before returning to the US with a few ‘scalps,’ wild tales of adventure, and some war booty. US pilots in Iraq even produced a video of how they mowed down helpless civilians for fun. In Oliver Stone’s Snowden this is graphically depicted, happening from the NSA base in Hawaii. \\nThe alarming degeneration of the security situation which Kunduz demonstrated prompted UN Security Council Resolution 2286 in May 2016, which calls for greater protection of civilians, medical facilities and personnel in war zones. Instead of seeing a decrease in atrocities since the resolution, however, attacks and deaths increased by 50%. \\nThe reckless attack on the hospital in Kunduz made me think of the inviolability of churches and mosques in feudal times, how this honorable tradition was lost in the secular 20th century, where Nazis burned the churches full of civilians. In an age without belief, hospitals become the substitute inviolable, sacred spot. But nothing is sacred anymore. The ‘good guys’ have lost their aura of fighters for a sacred cause. \\nKunduz also recalls fire bombing of Dresden by the Allies in WWII, the symbol of the mass bombing of civilians that killed tens of thousands of civilians, in an attempt to destroy the morale of the enemy, setting a precedent for US bombing in Vietnam, Afghanistan and Iraq. \\nThe Red Cross reports that its work has actually become more dangerous since the end of the Cold War and the ascendancy of the US as world policeman. So we should not be surprised by Kunduz. It is merely another example of the US doing what it knows best: using military might to terrorize, in hopes that its victims will submit to its will. To brazenly target hospitals indeed is a turning point, a turning backwards to past crimes, crimes we once piously attributed only to the enemy. But where there is no enemy left, everyone becomes a target. We are the enemy. \\nOur only hope is to ‘turn back’ the system of imperialism and its ideology of materialism, and to restore the sense of spirituality which has been eroded by it. \\nCanadian Eric Walberg is known worldwide as a journalist specializing in the Middle East, Central Asia and Russia. A graduate of University of Toronto and Cambridge in economics, he has been writing on East-West relations since the 1980s. He is author of “ Postmodern Imperialism: Geopolitics and the Great Games ” and “ From Postmodernism to Postsecularism: Re-emerging Islamic Civilization .” You can reach him at ericwalberg.com . This entry was posted in Commentary . Bookmark the permalink .'"}, "time": 1742628495.577476}