{"duration": 0.07427549362182617, "input_args": {"text": "'I will be offline a few minutes, I have to take a Terry. lloyd Lisco \\nOf course Electronic voting is corrupt, Why else would the crooked politicians want it? lloyd Lisco \\nWhen Exit poles are opposite machine totals, Does this raise a red flag? Voting machines and Idiot’s keep corrupt politicians in office. Corrine brown’s trial has been delayed to April 2017, She should be in jail before May 2017. ron_baker \\nI am not doubting these examples of vote changing, but I am at a loss on how one ‘knows’ their vote was changed. Is there a tally on the machine? My township’s machines have a paper ballot that feeds into a machine that reads the marked boxes. Not sure how I can tell if the machine is operating as it should or not. lloyd Lisco \\nTouch screen voting. Terry \\nTouch screen voting is heavily protected against these voter cause errors. When you get to the final page you may review your entire ballot, when you see the error it clearly tells you what to do to correct it. \\nGenerally these issues happen because the voter isn’t focused on what they’re touching on the screen and it’s most often with first time voters or those who have difficulty using an electronic tablet. misterdawg \\nThis isn’t BS, It happen to me when John McCain was running against Obuma. I voted a straight GOP ticket and when it came up to vote, It was changed to all Democrats, I had it changed and when we got home, I told my wife that I guess I had made a mistake and she told me that our son’s vote had been changed also and he had caught it to, before he had push the vote button. They have stole the last two elections I believe and are trying to steal this one too. The corrupt News Media, is in the tank for the crooked Democrats. Terry \\nHow could they steal that which by your own admission you corrected? Where is the proof to your conviction of stolen elections or are you just ranting because the internet is free! \\nWhat in the world ever happened to common sense? Did some people stick their tongue into a light socket or something? lloyd Lisco \\nWhen you have 130% voters to number registered, Does that raise any questions in your small mind? Terry \\nIf they’re not on the registered voter list, depending on the state they are generally given a provisional ballot that only gets counted IF it is found their voter registration was being processed or delayed because of a correctable error or need for verification. It often happens in areas where there is a surge of new voters. \\nYou can untie the knots in your underwear now. You’ll be more comfortable. \\nSee, you just learned something! Aren’t you proud? lloyd Lisco'"}, "time": 1742561810.61859}