{"duration": 0.05770444869995117, "input_args": {"text": "'Print Email http://humansarefree.com/2016/11/almost-no-children-in-france-are.html The French do not recognize ADHD (Attention Deficit Hyperactive Disorder) rejecting the idea that medicines that are usually prescribed for the condition are at all helpful. Another difference is that the French tend not to raise their children on the additive-laced food that parents in the U.S so, coincidence?These two very different cultures have different ADHD levels in children, in America the rate is 19 percent, and in France, it’s .5% – a half of a percent. For that half percent, the treatment includes no chemical or medicine whatsoever, opting for older fashioned methods.French children are subjected to much less sugar and additive-laden foods. Sugary cereals, fast food and fizzy drinks are consumed in much less volume than in the U.S, they are not shown the same advert driven television programs and lead an altogether more simple life.In 1998, Dr. Edward C. Hamlyn of the Royal College of General Practitioners said: “ADHD is fraud intended to justify starting children on a life of drug addiction\". One of the founding fathers of ADHD as a medical psychiatric disorder, Leon Eisenberg, confessed on his deathbed in 2009 at the age of 87: “ADHD is a prime example of a fictitious disease.” The evidence is overwhelming that the \\'treatment\\' for this \\'condition\\' is a fraud. Drugging America: 19 Statistics - Almost - Too Crazy to Believe Cognitive therapy was traded in for drugs a long time ago. Doctors are urged to write prescriptions as the government and Big Pharma are in it together.Psychiatrists were known to give all of 15 minutes time to a patient and be writing out a prescription for pharmaceuticals. Only drastic circumstances would allow for a review of the prescription, as patients\\' complaints fell on the deaf ears.This culture of giving pills away like candy resulted in children as young as three be prescribed drungs such as Ritalin (methylphenidate) and Adderall (amphetamine, dextroamphetamine mixed salts), without any other methods being tried first. There are now 5 million children in the U.S. on Ritalin or Adderall who have been resigned to either a life sentence of these drugs, or the awful process of weening themselves off them if they decide to do so. Reference: http://organicandhealthy.org Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related'"}, "time": 1742562548.567071}