{"duration": 0.06500053405761719, "input_args": {"text": "'Freitag, 25. November 2016 Immer mehr Menschen geben als Informationsquelle Nummer 1 \"Mario Barth\" an München (dpo) - Immer mehr Menschen stillen ihren Informationshunger nicht mehr bei klassischen Medien wie Zeitung, Radio, TV oder Online-Nachrichtenseiten, sondern auf der Facebook-Seite von Comedian Mario Barth. Das ergab eine aktuelle Erhebung des Meinungsforschungsinstituts Opinion Control. Insgesamt 47,4 Prozent der 1439 repräsentativ ausgewählten Bundesbürger gaben an, ihren täglichen Informationsbedarf \"größtenteils oder vollständig\" im Facebook-Auftritt des Humoristen zu stillen. Erst dann folgen TV-Nachrichten (26,2%), Nachrichtenportale wie Spiegel Online (17,2%), Radio (9,1%) und gedruckte Zeitungen (0,1%). Kein Wunder, dass Mario Barth mit über 2 Millionen Fans über mehr Reichweite verfügt als die Online-Auftritte von Spiegel, Süddeutsche Zeitung und FAZ zusammen.\"Offenbar gelingt es Mario Barth besser als den klassischen Medien, weltpolitische Zusammenhänge glaubwürdig und in ansprechender Weise darzustellen\", erklärt Umfrageleiter Heinz Geiwasser. \"Er wirkt auf viele Nutzer glaubwürdiger, frischer, unabhängiger und kompetenter als die Konkurrenz. Und ganz nebenbei erfährt der Nachrichtenkonsument auch noch Fundamentales über die Unterschiede zwischen Mann und Frau.\" Sonja Rode bringt sich auf den neusten Stand, was nationale und internationale Politik angeht. Sonja Rode (41) aus Templin ist eine der vielen, die inzwischen abends statt der Tagesschau lieber die Facebook-Seite Barths anschauen. \"Da bekommt man Dinge mit, die man in den Mainstream-Medien nicht lesen kann. Mario ist mein absoluter Lieblingspublizist.\" Wichtig findet sie, dass Mario Barth immer alles hinterfragt: \"Kennste? Kennste?\" Für Sonja Rode ein untrügliches Zeichen für aufrichtigen Journalismus. Die meisten Information zogen Besucher der Facebookseite aus den vom Entertainer regelmäßig geposteten Video-Häppchen. In den durchschnittlich zehnminütigen Beiträgen äußert sich Mario Barth mit gewohnter Berliner Schnauze zu privaten, aber auch weltpolitischen Dingen und enthüllt internationale Verschwörungen wie etwa den Umstand, dass frühmorgens an einem der wichtigsten Feiertage der USA keine Demonstrationen vor dem Trump-Tower stattfanden :Doch auch der Kommentarbereich, wo sich Barth-Fans untereinander kontrovers austauschen und mit ihrem Idol direkt in Kontakt treten können, gehört für immer mehr Menschen zum Nachrichtenmix. \"Barth bietet seinen Nutzern einen Vollservice\", erklärt Geiwasser. \"Besucht man seine Seite, braucht man keine weiteren Nachrichtenseiten mehr ansurfen.\" Selbst ein Wetterbericht fehle nicht:Auf seine neue Medienmacht angesprochen, erklärte Mario Barth: \"Dit wunnert mich jetz wenich. Wat ham\\'se immer alle auf mich einjeprügelt? Wat ham\\'se alle…? Denen hab ick\\'s jezeicht und dit hab ick nur meinen Fans zu... Det is wie ick neulich mit mener Freundin, geh ick so mit der, einkoofen geh ick, und da dreht die sich plötzlich zu mir und hat, dreht die sich, und hat die Arme so inne Hüften. Schauen\\'se mal so. Kennste? Kennste? Worauf wollte ick hinaus? Na egal, dit kann man ooch komplett in meinem neuen Programm, wo jetz grad die Zedeh ...\" ssi, dan'"}, "time": 1742563977.9256825}