{"duration": 0.0985558032989502, "input_args": {"text": "'Thu, 27 Oct 2016 17:37 UTC © Omar haj kadour / AFP A Syrian man checks the damage at a school after it was hit in an alleged air strike in the village of Hass, in the south of Syria\\'s rebel-held Idlib province on October 26, 2016. Almost two dozen children have reportedly been killed in an airstrike on a school complex in Syria\\'s Idlib province, according to opposition activists . The reports emerged as the UN Security Council debated the dire humanitarian situation in the country. At least 28 civilians, mostly children, were killed when the strikes hit a school complex in the village of Hass, the activists said, pinning the blame on either Russian or Syrian warplanes . The Wednesday tragedy was first reported by the controversial two-man, London-based Syrian Observatory for Human Rights and the Western-funded Civil Defense Network, also known as the White Helmets . The opposition Idlib Media Center also confirmed a strike on a school, claiming a \"rocket\" struck the premises. Comment: Red flag number one. Abdulrahman (aka SOHR) is a fraud and a terrorist sympathizer (see: Propaganda spin cycle: \\'Syrian Observatory for Human Rights\\' is funded by US and UK governments ). The White Helmets have the distinction of being actual terrorists (see: White Helmets Fraud: Terrorist Support Group, Not Humanitarians - But West Loves Them! ). They are liars, cheats, frauds, and killers. \"One rocket hit the entrance of the school as students were leaving to go home after the school administration decided to end classes for the day because of the raids,\" an activist said, speaking on condition of anonymity . The UN Children\\'s Rights & Emergency Relief Organization has condemned the tragedy as a potential \"war crime,\" saying it is likely the \"deadliest attack on a school\" since the beginning of the Syrian war. \"Twenty-two children and six teachers were reportedly murdered today when their school compound was repeatedly attacked in Idlib, Syria,\" UNICEF Executive Director Anthony Lake said in a statement. He did not specify the circumstances of the attack or the sources of the reports. \"This is a tragedy. It is an outrage. And if deliberate, it is a war crime ,\" Lake added. \"When will the world\\'s revulsion at such barbarity be matched by insistence that this must stop?\" Comment: UNSG Ban Ki-moon released an identical statement today, saying : \"The Secretary-General is appalled by reports of attacks that killed students and teachers in a school complex in Haas village, Idlib governorate, Syria on 26 October. If deliberate, this attack may amount to a war crime.\" Earlier in the day, Russian Foreign Ministry spokeswoman Maria Zakharova condemned the attack on a school in Syria\\'s Idlib and called for an investigation into the bombing . She also said that international media \"launched an attack\" on Russia by claiming that Moscow and Damascus are behind the bombing without presenting evidence . Russia\\'s ambassador to the United Nations, Vitaly Churkin, said that Moscow will look into the facts to determine whether a possible airstrike destroyed the school, as reports of the deadly assault have so far only been confirmed by groups with tainted reputations and questionable sources. © Omar haj kadour / AFP A general view shows a damaged classroom at a school after it was hit in an alleged air strike in the village of Hass, in the south of Syria\\'s rebel-held Idlib province on October 26, 2016. Commenting on allegations that Russian jets could be responsible, Churkin said that Moscow will wait for the military to assess the situation. \"It\\'s horrible, I hope we were not involved. It\\'s the easiest thing for me to say no, but I\\'m a responsible person, so I need to see what my Ministry of Defense is going to say ,\" he said. In it latest daily bulletin , the Russian center for the reconciliation of the opposing sides did not mention striking any targets in Idlib province . Citing a military source, Syrian state TV did report that strikes had taken place on terrorist positions in the region, but the targeting of a school complex was not confirmed. Idlib province is controlled by the Army of Conquest, a conglomerate of rebel groups being run by Fateh al-Sham Front (formerly Jabhat al-Nusra). Under the truce agreed between Russia and the US earlier this year, Islamic State and Al-Nusra fighters will continue to be targeted in airstrikes until terrorists lay down their weapons. Comment: The Russian Foreign Ministry explicitly denied carrying out an airstrike on the school. Maria Zakharova: \"This is a lie. Russia has nothing to do with this dreadful attack.\" The Defense Ministry followed up with their own statement, which unlike the paranoid ravings of SOHR and the White Helmets, actually included some evidence: \"On Thursday, a Russian UAV was directed to the area, to conduct detailed digital photography,\" said a statement from Defense Ministry spokesman Major General Igor Konashenkov. \"As can be seen from the photos taken by the drone, there are no signs of damage to the roof of the school, or craters from airstrikes around it .\" \"We have analyzed the photo and video \\'evidence\\' of the supposed attack. The video published in a range of Western media outlets appears to consist of more than 10 different shots, filmed at different times of the day, and in different resolutions that were edited into a single clip,\" stated Konashenkov. \"The photograph published by AFP shows that only one wall of the school is damaged, and all the desks inside the classroom are in place . The outer fence seen through the hole has no traces of damage from bomb fragments. In a genuine airstrike this is physically impossible - the furniture would have been swept away by the blast wave, and there would have been damage marks on the classroom wall and the outer fence .\" © Russian Defense Ministry \" Our evidence points to UNICEF falling victim to another scam from the White Helmet fraudsters . Before making resonant statements, UNICEF should check its sources more carefully, to protect the reputation of the respected organization,\" continued Konashenkov. In addition, just as with the humanitarian aid convoy attack, Russian recon detected a U.S. drone in the area at the time of the attack: No Russian aircraft entered the area over the Syrian Idlib, where the alleged strike took place, [Konashenkov said]. \"According to a photo made by a Russian UAV, the school\\'s roof is not damaged and there are no bomb craters in the area near the school. Similar information may be requested from our American colleagues. Russian reconnaissance means registered a US\\' MQ-1B Predator surveillance-and-attack drone .\"'"}, "time": 1742562186.3063347}