{"duration": 0.031525611877441406, "input_args": {"text": "'Carleton University faces severe criticism for its latest politically correct decision to remove weight scales from its gym and workout areas to prevent the “triggering” of overweight students. [The Ottawa, Ontario, university calls the decision “in keeping with current fitness and social trends,” Fox News reported.  The school’s manager of health and wellness, Bruce Marshall, claims that the move helps improve the mental   and health of the school’s students. Indeed, Marshall went on to insist that scales only remind people they are fat and can have a “negative impact” on health. “We don’t believe being fixated on weight has any positive effect on your health and ” Marshall said to Canada’s The Charlatan newspaper. “The body is an amazing machine and even when we are dieting and training it will often find a homeostasis at a certain weight. ” Marshall excused his position saying that body changes can take months, so “why obsess” about weight indicators? Some students agreed with the move. One even labeled scales as “triggering. ” “Scales are very triggering,” student Samar El Faki said. “I think people are being insensitive because they simply don’t understand. They think eating disorders are a choice when they are actually a serious illness. ” Not every student agrees with the school’s move. Marko Miljusevic, a   computer science student, said people should take responsibility for themselves. “We shouldn’t remove something because some people abuse it,” he said in a post on the school’s Facebook page. “If they can’t handle the number that shows up on the scale then don’t step on it. ” Doctors say that a person’s true weight is best measured in the morning after waking up and before eating breakfast. But, they also warn that fluctuations of several pounds from day to day is nothing to be concerned over. Many doctors also suggest that people trying to improve their health with diet and exercise should weigh themselves only a few times a week. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742628521.4589005}