{"duration": 0.04660964012145996, "input_args": {"text": "'The U. S. Navy will deploy a new laser weapon system on its ships within the next two years, according to a naval official. [“We’re doing a lot more with lasers,” Rear Adm. Ronald Boxall, director of the Surface Warfare Division, said earlier this month at the annual Surface Naval Association national symposium, according to Scout Warrior.  Boxall said the Navy plans to test a   weapon from a ship within a year, and to deploy that weapon on a carrier or destroyer a year later. The weapon will destroy incoming missiles, drones, aircraft, and other threats from the enemy. The Navy unveiled a   laser weapon on the U. S. S. Ponce during patrols of the Persian Gulf in 2014, the Daily Mail reported. The    ( ) Laser Weapons System (LaWS) aboard the USS Ponce was available to the ship’s commander as a defensive weapon to shoot down incoming missiles, drones, boats and other potential threats. The laser weapons are very precise, designed to destroy threats at a cost of 59 cents per shot, and do not require   expensive ammunition. The new laser weapons system will require a massive amount of power to operate. “The Navy will be looking at ships’ servers to provide three times that much power,” Donald Klick, director of business development for DRS Power and Control Technologies, told Scout Warrior. “To be putting out 150 kws, they [the weapons] will be consuming 450 kws. ” The power requirement for the new weapons system is more than most ships are able to accommodate. That means most ships require an “energy magazine” that would store energy for the laser to use as needed, according to a Naval Postgraduate School paper titled “Power Systems and Energy Storage Modeling for Directed Energy Weapons” by Jeremy Sylvester. Klick says the laser weapons system has to go through rigorous Navy certification testing before it deploys on Navy ships, but he eventually sees the system being deployed on military aircraft in the future.    '"}, "time": 1742563014.0617085}