{"duration": 0.16936659812927246, "input_args": {"text": "'Members of Venezuela’s   opposition took the streets of the nation this weekend to protest a move by the Supreme Court to usurp federal legislative power, nullifying the   National Assembly. [While the court ultimately backtracked on Wednesday’s ruling calling for legislators to be stripped of immunity and fully granting itself lawmaking authority, the judiciary has not restored the National Assembly’s powers, nor has it rescinded its demand that three opposition legislators be stripped of their powers due to socialist accusations of “fraud. ”  Venezuelans protested Wednesday’s ruling every day for the past week, with the most violent protests occurring in Caracas, many before the judiciary themselves.   reports that, on Friday, the Bolivarian National Guard (GNB) “fired buckshot and swung batons” at unarmed protesters in front of the Supreme Court. The GNB fighters remained in riot gear during the protests and shoved protesters. Tensión violenta en las calles de #Venezuela pic. twitter.   —   Yusnaby Pérez (@Yusnaby) April 2, 2017,  La lucha es todos los días y en todos los espacios, nuestros jóvenes diputados recorren centros comerciales activando a venezolanos #2Abril pic. twitter.   —   VenezuelaSomosTodos (@ComandoSB) April 2, 2017,  Nuestros dip @JuanRequesens, @joseolivaresm, @Miguel_Pizarro y @MarialbertBs, junto a @jovenespj protestan en Centros Comerciales de Caracas pic. twitter.   —   Juan Miguel Matheus (@JuanMMatheus) April 2, 2017,  In one incident, they attacked a credentialed journalist. GNB officers corralled Elyangelica González, a reporter for Univisión and Caracol News, dragging her by the feet and hair away from the Supreme Court. Video circulated on social media of the attack, and González shared it on her own Instagram account.  Hoy quiero darle gracias infinitas a ese angel que capturó el momento preciso en que ésto estaba pasando. Tuviste la valentía de grabar después de ver cómo me dieron patadas y me tumbaron, por eso tu video comienza conmigo en el piso, ya golpeada y sin teléfonos. Gracias en nombre de todos los periodistas, a ti y a todos quienes me han escrito, me han llamado, y me dan su solidaridad.  Sí, ésta soy yo. Confieso que al ver ese video lloré mucho, aún me siento triste después de varias horas. Me duele todo el cuerpo y más el alma, jamás pensé que esto me podría pasar.  Ésta soy yo, pero eso no es mi país, eso no somos nosotros, ese odio, esa violencia, esa saña no dice quienes somos.  Ésta soy yo, pero soy también todos los periodistas de mi país que salimos a diario a buscar las historias impostergables, las urgentes, las que todos deben conocer.  Ésta soy yo, una mujer, madre, esposa, hija, hermana y afortunadamente periodista enamorada de lo que hace porque creo firmemente en nuestro poder de construir y ayudar.  Ésta soy yo, luchando por mi derecho a informar, con las únicas armas que tengo, mi teléfono, mi micrófono, mi libreta, mi grabador y mi voz.  La única manera de que evitar que hable es que me arranquen las cuerdas vocales. #SOYPERIODISTANODELINCUENTE, A post shared by Elyangelica Gonzalez (@elyangelicanews) on Apr 1, 2017 at 2:32pm PDT,  González wrote to the unidentified person who recorded the incident: “thank you to the angel who captured this moment  …     on behalf of all journalists. ” She later accused the GNB before reporters of attacking her for being present as they used rubber bullets to shoot at unarmed protesters and keep them away from the building.   members of the opposition also accused the socialist government of dictator Nicolás Maduro of intimidating them into silence. Henry Ramos Allup, the former head of the opposition in the National Assembly, accused unidentified Secret Police (Sebin) officers of following him on a highway on Saturday, apparently waiting to arrest him. Ramos Allup wrote on Twitter, “[The officers] attempted to apprehend me in an abusive manner and told me I did not have parliamentary immunity. ” As in González’s case, Ramos Allup thanked citizens who recorded the incident on their phones, using the publicity to prevent his arrest. @verdadesofenden @hramosallup Venezuela’s President of Congress @hramosallup followed by a Police Car without a registration plate. Intimidation? pic. twitter.   —   Sir Arnold Robinson (@uk_expat) April 2, 2017,  Ya estamos circulando. Cobardes GNB y SEBIN no pudieron consumar atropello. Gracias a ciudadanos que con su actitud lo evitaron. pic. twitter.   —   Henry Ramos Allup (@hramosallup) April 1, 2017,  AHORA:Así transcurre la movilización a la Defensoría del Pueblo, exigiendo respeto a la Constitución #1abril pic. twitter.   —   VenezuelaSomosTodos (@ComandoSB) April 1, 2017,  Contrary to what officials reportedly told Ramos Allup, the Supreme Court has not stripped the nation’s legislators of immunity. On Saturday, the Supreme Court clarified this in a statement that some are reporting as the undoing of the usurpation of legislative power. The court, the statement read, “has not stripped the Parliament of its functions, just as it has not dissolved or annulled it, and recognizes legislative immunity as a guarantee of the legislative functions with the limits prescribed by the Constitution. ” This statement differed from its original ruling: “While the contempt scenario persists and the National Assembly remains invalid, this institution will guarantee that the parliamentary duties be executed directly by this institution or whatever institution it wishes. ” It, nonetheless, insisted that these guarantees would not be in place until the National Assembly “reassumed the legal, valid, and legitimate exercise of its constitutional powers by abiding by the judiciary’s decisions. ” The Supreme Court had already rendered the National Assembly void in January 2016, following the opposition’s electoral victory a month earlier, claiming that three opposition legislators had acquired their positions through fraud, according to Maduro. Until those three legislators were removed, the National Assembly’s laws would all die at the feet of the Supreme Court. The National Assembly, which argues there is no evidence for the claims of fraud, has considered the reworked Supreme Court ruling an insufficient correction of its original claims, noting that their refusal to accept the fraud claims still denies them their authority. On Sunday, the legislature’s Vice President Freddy Guevara issued a statement calling for more protests against the socialist government. “The destruction of separation of powers concluded when the Supreme Court attempted to strip the Assembly of its powers,” he said. “The government’s intention now is to demobilize the people in their just demands and stop the pressure from the international community. ” “This is just beginning,” he promised. “The struggle for freedom will not cease until the constitutional order is restored. ” Julio Borges, the president of the National Assembly, gave a statement Sunday insisting that the modified ruling changed little. “Nothing has changed, the coup continues,” he said. “In Venezuela, there is no separation of powers, no democracy, no justice. ” On the Thursday following the passage of the ruling, Borges stood on the steps of the Supreme Court and tore up a copy of the ruling. “This is garbage,” he told reporters. Another opposition legislator, Richard Blanco, demanded on Monday the arrest of the Supreme Court’s justices. “These gentlemen should be behind bars to fulfill their duty to the people, who are currently wounded by this constitutional violation. ” The official position of the legislative opposition is that the justices should step down, not be arrested. On Monday, 51 Venezuelan NGOs issued a joint letter supporting that demand and calling for the “immediate resignation” of the justices.  '"}, "time": 1742561831.1932094}