{"duration": 0.2161707878112793, "input_args": {"text": "'When a politician says something stupid, reporters are traditionally expected to mask their glee with a veneer of shock and disappointment. It was in this mode, more or less, that the NBC News political director, Chuck Todd, and his colleague Carrie Dann began the Aug. 3 edition of First Read, the network’s daily political tip sheet, warning that Donald Trump’s campaign had gone “from ‘unraveling’ to ‘break glass’ mode. ” They began with a heroic attempt to catalog all the previously      things Trump said and did in the preceding 24 hours, a long list that included the candidate’s displaying to a rally audience the Purple Heart medal he had been given by a retired U. S. Army lieutenant colonel who was wounded in Iraq. “I always wanted to get the Purple Heart,” said Trump, who received draft deferments during the Vietnam War for, among other things, bone spurs that had miraculously little impact on his youthful athletic career. “This was much easier. ” “Put those words into the mouth of any past presidential candidate, Republican or Democrat, and that comment almost certainly would have been labeled a near   gaffe,” Todd and Dann wrote. In 2016, however, “it wasn’t even the most blockbuster Trump news of the afternoon. ” This prompted them to consider something that, coming from a pair of political journalists, bordered on heresy: Maybe, they mused, we were looking at “the end of the gaffe. ” The “gaffe,” in its old, prepolitical usage, was essentially a faux pas: a breach of etiquette or  —   in the diplomatic context, where it often appeared  —   local custom. In 1922, an anonymous British military officer’s wife recounted in Blackwood’s Magazine how, at a party, she had breezily remarked to a Belgian government minister how happy she had been living in Bonn, Germany, during the postwar occupation. The minister recoiled and informed her that he had spent 10 months in solitary confinement there. “I had obviously said the wrong thing,” she wrote, “committed a gaffe. ” “Saying the wrong thing” is the most straightforward definition of a political gaffe, too. The question, of course, is what precisely we mean by “wrong. ” Reporters typically mean it in the strategic sense  —   something a politician seeking office, or occupying one, should know better than to say. And because strategy is amoral, the media’s preoccupation with gaffes has always been an easy target for critics. It’s emblematic, they argue, of campaign reporting at its hollow,   worst  —   representing little more than, as Jason Linkins of The Huffington Post wrote earlier this year, “the inability of politicians to be perfect at all times, and the media’s ability to monetize these momentary lapses. ” But there is another way of thinking about the gaffe: as an inevitable expression of the paradoxes of scrupulously objective political reporting, pressures that have held reporters hostage for decades. Until Trump, of all people, set us free. The journalistic ritual of   dates approximately to the Vietnam era, but it blossomed into a   obsession during the 1980 candidacy of Ronald Reagan, whose malapropisms were well noted even before he won the Republican nomination. Before the summer was out, reporters were fulminating over his description of the Vietnam War as a “noble cause” and his suggestion that the United States should pursue official relations with Taiwan  —   a move that contradicted the terms of normalization previously negotiated between the United States and China. Both statements were within the spectrum of conservative opinion, but reporters took them as blunders. By early September, press reports routinely described Reagan’s campaign, in The Times’s words, as on “the political defensive after a string of admittedly costly verbal gaffes. ” Two months later, Reagan trounced Carter, winning 44 states. During his administration, verbal pratfalls became enough of a running joke that David Gergen, then his director of communications, commissioned a large plaster foot with a bullet hole in it to be passed around. The Washington Post’s Lou Cannon diligently cataloged the “Reaganism of the Week” Dinesh D’Souza, who worked in the White House during Reagan’s second term, wrote later that “Reagan had no objection and frequently turned to the column to discover his own gaffes. Reagan’s advisers soon discovered what the boss already knew: that Americans didn’t mind his gaffes and were even entertained by them. ” What Reagan understood, in D’Souza’s telling, was that a gaffe revealed at least as much about the journalists who called attention to it as it did about the politician who uttered it. It reflected their own preoccupations and biases, which voters did not necessarily share. Ever since the late 1960s, when reporters began to take a more active role in scrutinizing presidential candidates, they had operated on the assumption that the way a candidate managed the challenges and humiliations of the campaign trail was in some way reflective of how they would perform in the White House itself  —   that a candidacy was a meaningful simulation of a presidency. By the 1980s, this vision of campaign reporting was toppling into solipsism. Journalists were, effectively, grading politicians on their ability to perform what everyone understood to be a largely artificial version of themselves  —   practicing a kind of theater criticism as much as political reporting. This reached its magnificent zenith in 2012, when a Washington Post reporter shouted at Mitt Romney during a photo op in Warsaw, “What about your gaffes?” What about his gaffes? The George Washington University political scientist John Sides reviewed   data from the 2012 race and found that none of the   slips of the campaign  —   not even the surreptitiously filmed video of Romney’s “47 percent” comments  —   had any appreciable effect on either candidate’s support. In imagined service of the interests of voters, reporters had lost track of what actually mattered to them. Still, criticism of the media’s gaffe fixation  —   like Michael Kinsley’s famous observation that “a ‘gaffe’ is the opposite of a ‘lie’: it’s when a politician inadvertently tells the truth”  —   has often been a bit too clever, reflecting the same blend of cynicism and forced naïveté as the trail reporters it maligns. The critics tend to miss something important: the way in which   is, ultimately, a logical and sometimes deliberate way of tackling the impossible task the press has assigned itself. For avowedly nonpartisan and nonideological reporters, examining the substance of a politician’s beliefs and policy views is a professional minefield: The more deeply they venture into it, the more open they are to accusations of bias. The benefits of this dilemma mostly accrue to politicians. If reporters spent too much time on the comfortably nonpartisan foibles of Reagan’s “Reaganisms,” they spent too little looking closely at his advisers’ devotion to   economics. The gaffe, then, is a safety mechanism. It moves a statement from the realm of substance to the realm of performance and strategy  —   allowing the reporters to critique it without incriminating themselves professionally. To say that Trump’s views on immigration are inhumane, or   from the standpoint of the economy or national security, might hint at a subjective opinion on the part of the reporter. An easier problem to identify is that, spoken aloud, those views may hurt him with electorally important constituencies, or reflect poorly on his ability to stay “on message” in the manner expected of politicians. A rational candidate would not deliberately do something that unnecessarily jeopardizes his chances of victory, so it follows that the outburst must have been a mistake  —   a gaffe. This of course bears little resemblance to how actual voters,   or   assess his words. In that sense, Trump really does have more in common with voters than he does with political elites. His inability to apologize or back down has opened the door to a   politics, stripping away the convenient fiction of missteps and errors that journalists turn to when they are uncomfortable confronting a statement on its merits. “This isn’t a situation where you have an episodic gaffe,” Obama said on Aug. 2, needling the many Republicans who had recently denounced Trump’s words without rescinding their endorsements. “This is daily, and weekly, where they are distancing themselves from statements he’s making. ” He’s right at this point, to treat Trump’s statements as anything other than intentional is to uphold   convention at the expense of common sense. Trump has laid bare journalism’s contradictions  —   reporters’ desire to be critical of politicians without criticizing anything they stand for  —   to the point where we have no choice but to examine them. This may be the least expected outcome of 2016: The most flagrantly dishonest candidate in recent memory is forcing us to have the most honest political discussion we’ve had in years.'"}, "time": 1742562264.733713}