{"duration": 0.1048288345336914, "input_args": {"text": "'“If a man’s friends do not take enough interest in him to play a few April Fool jokes on him   he might as well go to a monastery and stay there. ” Or so said The Times on April 1, 1892. So be on guard for pranks on Saturday. But in between, you could do some poses from our new guide to yoga for strength, or try these 10 ways to sharpen your kitchen senses (here’s why you should). And remember that thinking positively may improve your health and extend your life. No pressure. (Maybe you, too, have $763, 000 in unclaimed cash somewhere?) Have a great weekend! What do you want to see in these weekend roundups? Email us to let us know! • Looking for something to read this weekend? A good place to start is our weekly editors’ and critics’ picks. • And check out these great books new in paperback. • Of course, April Fools’ Day calls for comedy. Here are seven titles we recommend by leading voices in American humor, from Nora Ephron to Mindy Kaling to David Sedaris. • Ever had a book question but didn’t know who to ask? The Times is here with the answers: The Book Review is introducing Match Book, a new literary advice column. • For breakfast, get out that waffle maker collecting dust in the back of your cabinet and follow this    waffle recipe. Top it with   compote or (and? !) ice cream and blow the kids’ minds. • Had your mind set on something savory and eggy? No problem. Migas are here! • For dinner, try Amanda Hesser’s rigatoni with white Bolognese sauce. Not for nothing, it’s got 928   ratings. Also, it’s even better the second day. • Mark Bittman’s super easy   scallops are a lighter alternative. • If you’re in the mood for a project or feeding a   crowd, try out Sam Sifton’s adaptation of the late Jim Harrison’s Caribbean stew. Pork ribs, Italian sausage and chicken thighs, oh my. You might want a nice arugula salad on the side. • We’re beginning to see asparagus at the market. Here’s a helpful guide on how to buy it, store it and cook it • These chocolate peanut butter balls (known as buckeyes to the Midwesterners among us) are super easy to make and delightful to eat • Passover and Easter are approaching quickly. If you’re planning on serving lamb or ham this Easter, order yours this weekend. And after Easter, don’t forget to freeze the hock. You can make these awesome Cuban black beans. • And in preparation for Monday: What to cook when you’d rather be doing anything else • All that and more in Sam Sifton’s weekly guide to weekend cooking • Listen to the songs that caught our pop music critics’ attention this week. • Catch up with our latest Popcast podcast, hosted by Jon Caramanica, pop music critic for The Times. • Read our review of Aimee Mann’s first solo album in five years, then listen to it right on that page through Spotify. • If you liked “Serial,” try the new “This American Life” podcast “ . ” • Here are the best TV shows and movies new to Netflix, Amazon and more streaming services in April. • The team at Watching, our film and TV recommendation website, has rounded up picks for what to stream this weekend. (The Watching newsletter just turned one now is an excellent time to sign up for it if you haven’t already.) • Watching the “Walking Dead” season finale on Sunday? Here are the questions our TV team is considering leading up to it. • Catch a show without breaking the bank with our guide to cheap Broadway tickets. (Now, what to see? Find all of our theater reviews here.) • Check out these 10 cultural highlights, including Prospect Park’s   opening weekend and soul and RB singer Madison McFerrin at Joe’s Pub. • If you find yourself at Mimi’s at midnight (unless it’s Saturday or Monday) see one of New York’s most eccentric and unsung acts  —   he’s known as “Chicken Delicious. ”'"}, "time": 1742562328.1508892}