{"duration": 0.12630820274353027, "input_args": {"text": "\"By Omar Kamel / medium.com It’s not that we see Trump any differently. Trump is an egotistical racist misogynist who, in a rational world, shouldn’t be in any position of power. Then again, neither should Hillary Clinton. We watched from afar (as ‘afar’ as the internet allows anyhow) as the 2016 presidential campaign rolled on, and, at first, we wanted Bernie Sanders to win, and were very glad to see just how much support he managed to get, but then, Bernie did two Very Bad Things; he said he was okay with Obama’s Blacklist and his usage of drone strikes, and he said that he’d support Clinton if he didn’t get the nomination. Some people held on to Bernie, but for many of us, for me, that was it. Bernie might still have claimed to be ‘better’, but he certainly couldn’t claim to be ‘good’. We also watched the political establishment ignore Bernie and shove Clinton ahead of the self described ‘socialist’. We watched as even people like John Oliver and the entire cast of Saturday Night Live attacked Trump viciously and tried to pave the way to a Clinton victory. Oliver even took it upon himself to attack and ridicule minor candidates like Stein & Johnson, but not Clinton. We watched as so-called liberals and so-called democrats made Clinton out to be a hero. We watched as all those people bent over backwards and pretended that Clinton was one of the good guys because they felt compelled to pick between the ‘lesser of two evils’. It was pathetic. There’s a bit of fatality involved here, to be sure, and a deep level of cynicism. Many of us feel that if America could not choose the best option, then it deserved the worst. Also, there’s a harsh desire for rough truth, rather than hypocritical garnish. In a sense, many Americans are Trump, but most of them like to think of themselves as closer in character to who Clinton (falsely) claims to be; liberal, democratic, leftist, humane, charitable, kind. There are some who faced the facts honestly, and admitted that, for all intents and purposes, Clinton was a criminal and a manipulator who plays ball with the worst human rights offenders on the planet (Saudi Arabia and Israel, for example) and relies on their financial and political support. They understood that when promising to continue Obama’s legacy, Clinton is in fact promising to kill another 4,000 innocent Pakistanis by drone strikes in an illegal attempt to murder untried ‘terrorists’. They understand that this is a woman for whom Madeline Albright is a role model, and Kissinger is an icon, a woman who started out Republican before swapping sides and acting as though she were a Democrat, most likely because she realized that, as a woman, she could go farther as a Democrat. This is a liar who claims to have been dodging sniper fire in a foreign land when she was being greeted with flowers . Throughout the campaign, Clinton supporters have turned a blind eye to her failings. Somehow they were more horrified by what Trump may do than what Clinton already has done. So yeah, we weren’t very excited about a Clinton victory. Nothing would change. America would continue to think itself a progressive democracy that voted in first a black man, and then a woman. The demon would continue to wear a passable face, remain…presentable. We do not think Trump is any better, but we think a Trump victory would force the USA to admit to what it has become, and would allow other countries around the world to react appropriately now that the cover has been blown. JFK put on a good mask but behind the mask he was a lying adulterer who lifted the weapons embargo on Israel, allowing the US to supply it with the weapons used against Palestinians. The so-called ‘Special Relationship’ between the USA and Israel began with JFK. His smile and charm, however, make people, even in the Arab world, look back on him with fondness. Bill Clinton was the same, all charm and smiles while he signed off on the use of military force against Americans on American soil (in Waco), and pushed the Palestinians through Oslo, and then later, in his impeachment hearings, pretended the word ‘is’ was ambiguous. The Bill Clinton I remember was an arrogant liar and a murderer, not a charming man at all. The latest in this series of supposed good guys is Obama, proudly black, but closer to what Malcolm X referred to as a ‘house nigger’. Obama did not stop the war machine, and did not close down Guantanamo. Drone usage during Obama’s time has gone up exponentially, but…he performs beautifully; he cries when school shootings take place, he laughs at himself with an anger translating sketch, he dances and raps to your pleasure, he seems cool and laid back, a great dad, a fun guy . To tens of thousands of Pakistanis though, Obama is nothing but a cold blooded murderer. To Egyptians he is just another in a long line of US presidents who support a military dictatorship, supplying it with money and weapons. To people in Yemen (the poorest Arab country), he is the man who has helped supply Saudi Arabia (ostensibly the most fascist country on Earth) with more than $100 billion in weapons with which they have destroyed Yemen. To millions of people around the world he is a bomb that happens to have a smile painted on it. And now, finally, rather than suffer the pretense of progress under a female president, America has voted for Trump. Good. Lay bare the racism, lay bare the arrogance, lay bare the lies and the brutalities. Face yourselves, see yourselves, and then maybe, maybe, things will change… \\nOmar Kamel - I'm not a total bastard. Under my exterior there's a nice guy, but yes - under him there's another bastard. Let's just say I'm two thirds bastard. 0.0 ·\""}, "time": 1742561865.6808083}