{"duration": 0.03188061714172363, "input_args": {"text": "'Get short URL 0 108 0 0 In a further sign of growing tensions between the United States and Turkey, Pentagon officials revealed on Wednesday that the Kurdish YPG militia will play a major role in the upcoming attack on the Daesh-held city of Raqqa, and it’s not good news for Ankara. \\nAs coalition forces continue retaking the Iraqi city of Mosul from Daesh, US officials are looking ahead to Raqqa, the terrorist group’s Syrian stronghold. © REUTERS/ Zohra Bensemra US Detects No Actions by Turkish Troops Interfering With Mosul Operation - White House \\nAmerican forces are currently on the ground in Syria to train opposition fighters, including Kurdish YPG militia fighters operating within the Syrian Democratic Forces (SDF), according to Army Lieutenant General Stephen Townsend. However, a key US ally isn’t happy about it. \\n\"Turkey doesn’t want to see us operating with the SDF anywhere, particularly in Raqqa. We’re having talks with Turkey and we’re going to take this in steps,\" Townsend told reporters . \"The only force that is capable on any near-term timeline are the Syrian Democratic Forces, of which the YPG are a significant portion. We’re going to take the force that we have and we will go to Raqqa soon with that force.\" \\nTownsend underlined the importance of liberating Raqqa, saying US officials believe the city is where the terrorist group plans most of its international attacks. \\n\"We think it’s very important to get isolation in place around Raqqa to start controlling that environment on a pretty short timeline.\" © REUTERS/ Nour Fourat US-Led Coalition to \\'Move Soon to Isolate Raqqa\\' \\nAs the eastern flank of the NATO alliance, Turkey is a vital ally to the United States and its Western partners. Tensions have been high through the administration of Turkish President Recep Tayyip Erdogan. Under Erdogan, Ankara has launched a crackdown on Kurdish communities in the country’s southeast. \\nIn what may have been an effort to appease Turkish leadership, US officials stressed that, while the YPG will play a role in the offensive, it will not be directly involved in taking Raqqa. Townsend added that the US will also play a smaller role in the Raqqa operation than it has in Mosul. \"We’ll have fewer coalition troops there, less combat capability there, we’ll have to apply coalition combat support in a different way than we are doing here in Iraq,\" he said. \\nExpected to coincide with the Mosul operation, the Raqqa offensive is expected to begin soon. \\n\"I think it will be within weeks, that’s what I want to say, and not many weeks,\" US Defense Secretary Ashton Carter told reporters on Tuesday. ...'"}, "time": 1742628542.308726}