{"duration": 0.04432106018066406, "input_args": {"text": "'Store US Government Acknowledges That al-Qaeda Is Not A Priority In Syria One might ask, then: if al-Qaeda in Syria is not a priority for the war on terror, what is? Darius Shahtahmasebi | Anti Media - October 26, 2016 Comments \\nLast week, the U.S. State Department acknowledged that al-Qaeda-linked terror group Jabhat al-Nusra is not a “priority” for the United States’ efforts in Syria. \\nOne might ask, then: if al-Qaeda in Syria is not a priority for the war on terror, what is? \\nState Department spokesman John Kirby provided some useful insight into this dilemma, stating: \\n“The only thing that stands between where we are now and a permanent and enduring ceasefire in Syria is Bashar al-Assad and his supporters . We recognize Al-Nusra as a spoiler, we have concerns about co-mingling, I’ve talked about this ad nauseam.” \\nLargely missing from the American narrative of the Syrian conflict is that al-Nusra is shelling residential areas in Aleppo, where the government holds control of the majority of Aleppo’s citizens. In other parts of the world, these al-Qaeda-linked extremists are seen as the enemy, whereas in Syria, Western media will often refer to them as mere “rebel” groups. \\nThe United States first officially used the term “war on terror” on September 20, 2011, to refer to the military campaigns that followed the attacks of September 11. The stated aim at the time was to defeat Islamic-linked terrorist organizations and dismantle regimes the U.S. government accused of supporting terrorism. \\nIn 2013, Obama stated : \\n“ We must define our effort not as a boundless ‘Global War on Terror,’ but rather as a series of persistent, targeted efforts to dismantle specific networks of violent extremists that threaten America.” \\nThe fact that a terror group — one linked to the organization that allegedly launched an act of war against the United States on American soil — is not a priority of the United States State Department should tell you something about how farcical and ineffective the war on terror actually is. \\nThis change in rhetoric, which is ultimately designed to push ulterior economic agendas in the Middle East, is an insult to the thousands of soldiers who sacrificed their lives under the false pretense that they were going to protect their families from al-Qaeda-linked terrorists. NEWSLETTER SIGN UP Get the latest breaking news & specials from Alex Jones and the Infowars Crew. Related Articles'"}, "time": 1742562922.5648844}