{"duration": 0.14988303184509277, "input_args": {"text": "'China Machado, one of the first   to appear in the pages of an American glossy fashion magazine and a model who helped break not only the race barrier but also the age barrier, died on Sunday in Brookhaven, N. Y. on Long Island. She was 86. Her family said the cause was cardiac arrest. Ms. Machado (whose first name was pronounced  ) lived a colorful life: She was born Noelie de Souza Machado on Christmas Day 1929, in Shanghai fled the country with her parents in 1946, after the Japanese occupation had an affair with Luis Dominguín, the Spanish bullfighter, who left her for Ava Gardner and socialized with François Truffaut. But at a time when the fashion industry is still struggling with diversity, it is worth pausing to consider what “colorful” really meant when it came to Ms. Machado, what her career represented and how far we still have to go, nearly six decades later. Her legacy extends far beyond the pictures she created, and the poses she struck, to make us rethink our assumptions about what is considered beautiful, and why. And it is as relevant today as when she first stepped on a runway, in the 1950s. “China Machado was one of the first great pioneers in the firmament of haute couture,” André Leon Talley, the former Vogue editor at large and the fashion and style director of i. am+ the tech firm founded by Will. i. am, wrote in an email. He added that she “made of her ethnicity something powerful. Internationally, she paved the way for diversity and other races, as well as paving the way for the rise of the black model in print and on the runway. ” Stefano Tonchi, the editor of W, said: “She was the first to put in front of the audience the idea of the otherness, bringing out memories of different cultures and fragments of other imagery. She always did it with irony, without posing, modeling or vogueing. Somehow she showed it all while dancing. ” And though she did not do it consciously in the beginning, by the time she was aware of her historic place in the fashion world, her daughter Emmanuelle   said, she “was proud to wear that mantle. She thought so much of fashion looked the same, and she wanted to celebrate the idea that everyone could be who they were. ” Ms. Machado certainly was. It began in 1959, when Ms. Machado became the first nonwhite model featured in the pages of Harper’s Bazaar. She had started modeling in Paris, most notably for Hubert de Givenchy and Balenciaga (so successfully that she was the   runway model in Europe) and Oleg Cassini brought her to New York for his runway show in 1958. She caught the eye of Diana Vreeland, who sent her to Richard Avedon, then Harper’s Bazaar’s star photographer and a crucial player in forming the magazine’s identity. He christened her his “muse” and began photographing her in looks that, Mr. Talley pointed out, had previously been worn only “by white models. ” Avedon wanted his photos of Ms. Machado in Bazaar’s February issue. But according to an interview Ms. Machado did with CNN in 2011, Robert F. MacLeod, the magazine’s publisher at the time, said: “Listen, we can’t publish these pictures. The girl is not white. ” “I knew I was considered kind of ‘exotic,’ if you want to use that word, in Europe, but it wasn’t any kind of a slur,” Ms. Machado told New York magazine this year. Avedon’s contract with Bazaar was up for renewal at the time, however, and, according to Ms. Machado, he threatened not to   unless his photos of Ms. Machado appeared in the magazine, and such was his power that the editors finally agreed. He “sort of blackmailed them into putting these pictures into the magazine,” she said. (Some published reports have stated that Ms. Machado appeared on the cover of Bazaar in 1959, but her daughter disputes that date, saying the model was not her mother, and that her first cover was in 1971. A spokeswoman for the Richard Avedon Foundation said it could not confirm the identity of the 1959 cover model but that she “didn’t think” it was Ms. Machado.) It wasn’t the only boundary she and Avedon pushed for the magazine. She was also its first nude, in 1961. And it wasn’t the only racism she encountered. After she appeared on Cassini’s runway in 1958, she said in New York magazine, he spoke to a group of “Southern buyers” because they were ignoring all the dresses Ms. Machado had worn in the show. He asked why, and they said, Ms. Machado reported, “Oh, she’s black. ” (Actually, she was mixed race, with Portuguese, Chinese and Indian roots.) And even later, when she was at the height of her fame, she told CNN: ”Every advert that came out, it would say stupidly, ‘The Great China’ on it. I felt like   …     a circus!” Things have clearly gotten better since then: A recent    report on diversity from TheFashionSpot said that in 2016, 29 percent of magazine covers featured nonwhite models, a 6. 2 percent increase from last year. But runways were only 25. 4 percent nonwhite, a paltry 0. 7 percent increase, which underscores the tendency of fashion to look at diversity as a trend rather than as an issue that needs to be addressed on a deep, systemic level. Indeed, broadly defined, the industry is not doing very well at all when it comes to diversity, with only 0. 9 percent of covers featuring women over size 12 (that translates as six, two of which belonged to Adele) and only 5 percent belonging to women 50 and above (including Michelle Obama, who is arguably beyond age). Which brings us back to Ms. Machado. Because by 2011, more than 50 years after her first, pioneering appearance, she was once again going where very few women in fashion had gone before. With a few notable exceptions, such as the Bazaar cover in 1971 and the Battle of Versailles fashion show in 1973, when she walked in the American contingent, Ms. Machado had, by 1962, segued from her role in front of the camera to one behind it. She became fashion director of Harper’s Bazaar, thus clearing yet another professional pathway (one later followed by such models turned editors as Grace Coddington and Tonne Goodman) and helped introduce Lear’s magazine, aimed at the   set. Then, at age 81, she signed with IMG Models, becoming an effective octogenarian supermodel. She starred in ad campaigns for Barneys and Cole Haan, and was once again in the pages of Harper’s Bazaar. (Though the Cole Haan campaign was nominally celebrating individuals born in 1928, like the brand, it was the one time Ms. Machado “lied about her age to be older than she was,” Ms.   said. “She thought it was close enough. ”) Only last month, she was modeling for a new   shoot by the photographer Steven Klein. All without ever having plastic surgery. “You can’t worry about aging because that’s the worst thing,” she once said. “If you start, then you just keep finding more things you don’t like, and then you’re finished. There are a lot of things I could have done to my face, but it would never stop. ” Ms. Machado is survived by her husband, Ricardo Rosa two daughters, Emanuelle   and Blanche Lasalle and two grandsons. According to Ivan Bart, the president of IMG Models, “China was instrumental in teaching younger models, ‘Own yourself, own your beauty. ’” Her life showed them how. Ms. Machado was always an exception. But if fashion learns anything from her example, someday, perhaps, she will be the rule.'"}, "time": 1742562175.4768753}