{"duration": 0.08426284790039062, "input_args": {"text": "'WASHINGTON  —   A bill that would let the families of those killed in the Sept. 11 attacks sue Saudi Arabia for any role in the terrorist plot passed the Senate unanimously on Tuesday, bringing Congress closer to a showdown with the White House, which has threatened to veto the legislation. The Senate’s passage of the bill, which will now be taken up in the House, is another sign of escalating tensions in a relationship between the United States and Saudi Arabia that once received little scrutiny from lawmakers. Administration officials have lobbied against the bill, a view that the White House spokesman Josh Earnest reiterated after the vote. And the Saudi government has warned that if the legislation passes, it might begin selling off up to $750 billion in Treasury securities and other assets in the United States before they face a danger of being frozen by American courts. Adel   the Saudi foreign minister, delivered the warning to lawmakers and the administration while in Washington in March. Many economists are skeptical that the Saudis would deliver on such a warning, saying that a   would be hard to execute and would do more harm to the kingdom’s economy than to America’s. Questions about the role Saudi officials might have played in the Sept. 11 plot have lingered for more than a decade, and families of the victims have used various lawsuits to try to hold members of the Saudi royal family and charities liable for what they allege is financial support of terrorism. But these moves have been mostly blocked, in part because of a 1976 law that gives foreign nations some immunity from lawsuits in American courts. The Senate bill carves out an exception to the law if foreign countries are found culpable for terrorist attacks that kill American citizens within the United States. If the bill were to pass both houses and be signed by the president, it could clear a path for the role of the Saudi government to be examined in the Sept. 11 suits. Senator Chuck Schumer of New York, a Democrat and a sponsor of the bill, said the legislation would help the families of the victims seek justice. “For the sake of the families, I want to make clear beyond the shadow of a doubt that every entity, including foreign states, will be held accountable if they are found to be sponsors of the heinous act of ” he said shortly before the bill’s passage. “If the Saudis did not participate in this terrorism, they have nothing to fear about going to court,” he said. “If they did, they should be held accountable. ” Mr. Schumer said he believed that Democrats would override a veto from Mr. Obama. He also said he believed that Saudi Arabia’s threat to pull its assets, a concern of the administration, was “hollow,” adding, “It will hurt them a lot more than it hurts us. ” Senator John Cornyn, Republican of Texas, said the legislation was written in such a way that Americans would not be subject to legal action taken by other nations. “I do believe that there’s going to be some saber rattling, some threats, but I think that they are hollow,” Mr. Cornyn said. In a move intended to address some White House concerns, the bill’s sponsors included a new provision that would allow the attorney general to put a hold on individual court cases if the administration can show that it is negotiating with the defendant government to resolve the claims. But a release on Tuesday from Mr. Schumer’s office said the administration would need to provide details about the talks and a timetable for their resolution. Mr. Earnest said on Tuesday that White House officials would seek to negotiate with Republicans and Democrats on alternatives to the legislation that might be acceptable to the president, but he added, “I don’t know if that’s possible at this point. ” Earlier this month, Mr. Jubeir said during a news conference that the proposed legislation was “stripping the principle of sovereign immunities” and turning international law “into the law of the jungle. ” The legislation is moving through Congress as the Obama administration considers whether to declassify a portion of a 2002 congressional investigation of the Sept. 11 attacks that cited some evidence that Saudi government officials and other Saudi citizens living in the United States had a hand in the terrorist plot. Those conclusions have yet to be released publicly, but recently the National Archives posted a separate document on its website that appears to offer a glimpse at what the   28 pages contain. The document, dated June 6, 2003, is a series of memos written by Sept. 11 commission staff members compiling numerous possible connections between the hijackers and Saudis in the United States. The document was first disclosed publicly by 28pages. org, an advocacy website devoted to pushing for the declassification of the redacted section of the congressional inquiry. The Sept. 11 commission, which began its work after the congressional inquiry, found “no evidence that the Saudi government as an institution or senior Saudi officials individually funded” Al Qaeda or the   plotters. Last month, the commission’s   Thomas Kean and Lee Hamilton, issued a statement saying that the 28 pages “were based almost entirely on raw, unvetted material that came to the F. B. I. ”  —   much of it ultimately deemed inconclusive by the Sept. 11 panel. “Accusations of complicity in that mass murder from responsible authorities are a grave matter,” they wrote. “Such charges should be levied with care. ”'"}, "time": 1742628291.0675383}