{"duration": 0.2524123191833496, "input_args": {"text": "'The World Health Organization declared an end to its global health emergency over the spread of the Zika virus on Friday, prompting dismay from some public health experts confronting the epidemic. An agency advisory committee said it ended the emergency  —   formally known as a Public Health Emergency of International Concern  —   because Zika is now shown to be a dangerous   disease, like malaria or yellow fever, and should be viewed as an ongoing threat met as other diseases are, sometimes with W. H. O. help. Committee members repeatedly emphasized that they did not consider the Zika crisis over. “We are not downgrading the importance of Zika,” said Dr. Peter Salama, executive director of the W. H. O. ’s health emergencies program. “We are sending the message that Zika is here to stay and the W. H. O. response is here to stay. ” Like all   diseases, Zika is seasonal and may repeatedly return to countries with the Aedes aegypti mosquitoes that carry it, Dr. Salama added. Individual countries facing serious new Zika outbreaks could still declare local emergencies, said Dr. David L. Heymann, chair of the advisory committee. But other experts worried that the W. H. O. ’s declaration might slow the international response to an epidemic that is still spreading, and lull people at risk into thinking they were safe. Dr. Anthony S. Fauci, director of the National Institute for Allergy and Infectious Diseases, which is funding efforts to find a Zika vaccine, suggested that it was premature to lift the state of emergency since summer is just beginning in the Southern hemisphere. “Are we going to see a resurgence in Brazil, Colombia and elsewhere?” he asked. “If they pull back on the emergency, they’d better be able to reinstate it. Why not wait a couple of months to see what happens?” His agency would not slow down its vaccine efforts, he said. Since the W. H. O. first declared a state of emergency on Feb. 1, the Zika virus has spread to almost every country in the Western Hemisphere except Canada. Thousands of babies suffer deformities caused by the infection, and more are expected. Recent outbreaks and related birth defects have also been detected in Southeast Asia, although scientists believe the Zika virus has circulated there for decades. The most severe deformity is microcephaly, a tiny head with a severely underdeveloped brain but fetuses have also been killed by the virus, and infected infants have been born blind, deaf, with clubbed feet and permanent limb rigidity. Scientists also fear that many infected babies who appear normal now may suffer from intellectual deficits or mental illnesses later in their lives. The Centers for Disease Control and Prevention expressed no opinion about the W. H. O. ’s decision, but noted that it “did not change the urgent need to continue our work. ” The agency also reiterated the warning it issued in January that pregnant women should avoid traveling to areas where the virus was being transmitted. Other experts, like Dr. Fauci, were more critical. The W. H. O. decision is “unwise,” said Dr. Lawrence O. Gostin, director of Georgetown University’s O’Neill Institute for National and Global Health Law. Although the virus is not killing or deforming as many babies as originally expected, “the international response has been lethargic,” Dr. Gostin said. “W. H. O. ’s action to call off the global emergency has provided reason for governments and donors to pull back even more,” he said. Even if the outbreak no longer meets the technical definition of an emergency under 2005 international health regulations, there is an important psychological component to declaring an emergency. Headlines suggesting the crisis is over may lead people to take fewer precautions against sexual and   transmission, experts said. “We are still not out of the woods,” said Scott C. Weaver, a virologist at the University of Texas Medical Branch in Galveston who was among the first to warn that the virus threatened the Americas. The disaster in northeast Brazil, where more than 2, 000 babies have been born with microcephaly, will probably not be repeated, Mr. Weaver said. And he “would not be surprised if the disease had run its course in Central America and the Caribbean. ” But, he added, “I think the worst is yet to come in southern Brazil  —   places like São Paulo. And some places in the Amazon haven’t seen the virus at all yet. ” When a large portion of a population has been infected with a virus and has recovered, rising “herd immunity” usually ends the transmission of a virus for several years, until enough susceptible victims are born. Dr. Albert I. Ko, a Yale epidemiologist who has worked in northeast Brazil for years, said he understood the W. H. O. ’s rationale but felt the agency had acted too soon. The full extent of the damage in Latin America is unknown, he said, because many infected babies are yet to be born. Also, Asian governments are just beginning to realize that they face a crisis, he added, and may now take fewer countermeasures. When the W. H. O. declared an emergency in February, it was intended in part to get scientists to explore the   connection and to make countries cooperate in fighting the epidemic. At the time, it was unknown whether Brazil’s surge in microcephalic babies was caused by the Zika virus, which had been discovered in 1947 and was considered a mild disease. Later, W. H. O. officials declared themselves satisfied that Zika was the main cause of the microcephaly outbreak. In a later meeting, officials decided that the risk was not sufficient to justify canceling the Olympic Games in Rio de Janeiro, but was high enough that pregnant women should avoid traveling to the area.'"}, "time": 1742563220.0466173}