{"duration": 0.027725934982299805, "input_args": {"text": "'Facebook has reportedly stated that employees that leave work on May 1st to protest Donald Trump’s immigration policies will not be punished by the company. [Bloomberg reports that Facebook staff have been given the green light by their employer to participate in protests on May 1st. The company also stated in their internal announcement that they will investigate any contractors on Facebook grounds, such as security workers or shuttle bus drivers, that illegally crack down on their employees’ right to protest.  “At Facebook, we’re committed to fostering an inclusive workplace where employees feel comfortable expressing their opinions and speaking up,” a spokesman wrote in a statement. “We support our people in recognizing International Workers’ Day and other efforts to raise awareness for safe and equitable employment conditions. ” Derecka Mehrens, the   of Silicon Valley Rising, a union initiative for tech workers, stated, “It’s important not just to the engineers and   holders that are traditionally thought of as the immigrants in tech but also to folks who are subcontracted but work    on those campuses. Immigrants play a critical role in the tech sector  —   both as engineers and coders but also in keeping tech campuses running smoothly. ” Many tech companies in Silicon Valley have been vocal opponents of President Trump since his election. Companies such as Google held protests across their campuses where they attacked President Trump’s temporary immigration halt. CEO Sunar Pichai spoke to the crowd about the difficulties that the company faces attempting to deal with the visa complications many of their foreign employees encountered, thanking all those who appeared at the march. “Every step, I felt the support of 65, 000 people behind me,” he said. “There are some values that you should never be compromising on, we need to stand together. The fight will continue. ” Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan_ or email him at lnolan@breitbart. com'"}, "time": 1742563040.0879867}