{"duration": 0.06189107894897461, "input_args": {"text": "'On social media, our political battles are increasingly automated. People who head to Twitter to discuss their ideals are, often unwittingly, conversing with legions of bots: accounts preprogrammed to spew the same campaign slogans, insults or conspiracy theories hundreds or thousands of times a day. And one of their most competitive battlegrounds is the prime digital real estate that opens up every time   Donald J. Trump tweets. Any supporters or critics who reply quickly enough to Mr. Trump can see their own tweets showcased right beneath the biggest spectacle on Twitter. But in this   contest, propaganda bots always best human beings. Recently, I noticed a different kind of bot clawing to the top of Mr. Trump’s Twitter replies. It’s called @EveryTrumpDonor, and every couple of hours it tweets about the Americans who donated to Mr. Trump’s campaign  —   who they are, where they’re from, what they do, all from public Federal Election Commission data. People sucked into its timeline aren’t always sure if it’s a tool for shaming Mr. Trump’s supporters or a celebration of the folks who contributed to his victory. Either way, the bot reminds us of the real people behind the Twitter brigades. Unlike the typical Twitter bot, it fights disinformation with actual facts. @EveryTrumpDonor represents an emerging class of politicized bots. You could think of them as “protest bots” or, as the   theorist Mark Sample calls them, “bots of conviction. ” Many bots set up to spread campaign propaganda or disinformation masquerade as humans, but protest bots typically own their cyborg natures. Some are designed to jockey for social media position with the propaganda bots, while others set out to unmask nefarious actors, distract enemies, redirect public attention to the messages they value or even build morale among human activists. They’re not always deployed for universal good sometimes, their aims and means are unsettling. But in every case, propaganda bots and protests bots are fighting over a limited resource: our attention. Propaganda bots made a powerful showing during Election 2016. Oxford University’s Project on Computational Propaganda found that at times during the campaign, more than a quarter of the tweets colonizing politicized hashtags like #MAGA and #CrookedHillary came from “heavily automated accounts. ” In the days leading up to the election, Trump propaganda bots outnumbered Clinton propaganda bots five to one. Since then, bot armies have been programmed to spread conspiracy theories about a   Democratic pedophile ring known as Pizzagate. The bots help the topic trend, lend an air of   momentum and create enough of a mirage of a movement that real people then join in. Bots of conviction can’t compete with those numbers  —   spamming is not their style  —   but they can work as effective tools of provocation, as this taxonomy shows. HUNTER BOTS One of Twitter’s vilest subcultures is its collection of minstrel accounts, which impersonate Jews and people of color in order to mock and discredit them. These accounts steal avatars from real people, give themselves fake ethnic names and spew racism that’s then boosted by a network of tittering racist tweeters. @ImposterBuster, a bot unleashed on Twitter last month by the Tablet writer Yair Rosenberg and the developer Neal Chandra, is designed to hunt them down. Mr. Rosenberg and Mr. Chandra have compiled a database of known minstrel accounts and haveput @ImposterBuster on their trail. The bot tracks their every move on Twitter and replies automatically to their tweets, exposing racists and alerting other users to their subterfuge. Another bot with a predatory instinct, @EveryTrumpette, is a visual variation on the @EveryTrumpDonor theme. Every few hours, it pulls up a photo from a Trump rally, then uses a   algorithm to scan the crowd and zoom in on one person’s face. The resulting videos are scored with quotations from Mr. Trump himself. The bot’s creator has contended that its purpose is empathic connection, the bot designed to examine Trump supporters, “one by one, to try and see the humanity. ” But its effect is combative, even unnerving. It implies that whether online or at a rally, supporters will not be shielded by the anonymizing cloak of the crowd. At some point, this bot’s unfeeling gaze will systematically hunt them down and call them out for judgment. HONEYPOT BOTS  These bots are meant to distract trolls by goading them into fighting with unthinking machines. Accounts like @arguetron and @good_opinions tweet out automated progressive lines, then lure in the folks who scan Twitter, looking for a fight. All it takes is tweeting out flash point terms like “affirmative action,” “feminist” or “Drudge Report. ” Whenever anyone responds to a provocation from @arguetron  —   which presents as a woman named Liz  —   the bot is programmed to volley back a dismissive tweet. @arguetron is not very smart  —   it can’t recognize anything you say to it, much less respond  —   but the people who debate it always lose. Some have angrily tweeted for hours before logging off. That’s time that could have been spent arguing with real progressive women, but is instead directed at a virtual brick wall. One of the most delicious honeypot bots of this campaign was targeted at one Twitter user in particular. @ilduce2016 is a Twitter bot created by Gawker journalists that exclusively tweets out Benito Mussolini quotations but attributes them to Mr. Trump. Gawker guessed that Mr. Trump’s obsession with boosting his own image  —   he’s known to retweet fans who tweet his quotations back at him  —   could be exploited to trick him into owning and promoting the words of a Fascist dictator. He took the bait one February morning, retweeting the Mussolini line “It is better to live one day as a lion than 100 years as a sheep. ” COMFORT BOTS For a break from political struggle, turn to @tinycarebot, a robot that reminds people that they are only human. It popped up last month, in the middle of   Twitter angst, and began tweeting out calming nature emoji with simple relaxation tasks like “please remember to drink some water” and “take time to look up from twitter please. ” If you tweet at @tinycarebot, it tweets back a “personal reminder for you” mine included the emoji of a cityscape at night with the message “please take time to look outside! be kind to urself!” There’s something soothing about the idea that one of the most draining forms of modern political engagement, fighting with strangers on Twitter, could be outsourced to forces of automation. Let the bots hunt down   divert antifeminist trolls and crowd out the propaganda bots. I think I’ll take a nap. After all, bots don’t have feelings to hurt, professional reputations to uphold or conflicts of interest to manage. They can respond instantly and tweet tirelessly, but waste no time reading anybody else’s timeline. As inhuman as the bots are, their greatest promise may lie in their ability to cut through the artifice of political Twitter to reveal something real. Propaganda bots spew lines and lies that coat social media with impersonal rhetoric and   images. Bots of conviction produce interactions that feel grounded in revealing truths of human behavior. And that’s the case whether the bot is offering up the name of a retired Trump donor from Oklahoma City or showing how fruitless Twitter political arguments really are.'"}, "time": 1742628555.4745686}