{"duration": 0.04725313186645508, "input_args": {"text": "'You’ve heard it many times: You should get a flu shot. The Centers for Disease Control and Prevention recommend that anyone older than six months get one by the end of October, though late is better than never. Yet, an online survey by CityMD, a network of urgent care centers, found that 52 percent of millennials don’t plan on getting the vaccine. Turns out we have one such skeptic on staff. Jonah Engel Bromwich, my Times colleague, is a    who says he never gets a flu shot, making him exactly the kind of person who experts wish they could reach. But he has agreed to offer up his excuses so we can quash them one by one, and we thank him for that. To help, we asked Dr. Joseph Bresee, chief of the epidemiology branch in the influenza division of the C. D. C. to take us through the rebuttals to the most common excuses he hears. DANIEL: So, tell us, Jonah  —   what’s going on here? Why are you ignoring the doctors? JONAH: I’m very tough. I’ve never gotten the flu. Why should I get a flu shot? My immune system is   …     good. I just don’t see the need for it. DANIEL: I have no doubt that you are tough, and I bet your immune system is something to be very proud of. But the fact is, an estimated 5 percent to 20 percent of the United States population gets the flu each year, Dr. Bresee said. The fact that you’ve never gotten the flu is no indication that you won’t get it in the future. You’re essentially rolling the dice anew each year, and there’s a decent chance you’re eventually gonna get a bad roll. JONAH: I’m a gambler. DANIEL: I wish you luck in Atlantic City. But a flu shot isn’t just about you. As a healthy   you might not have underlying medical issues that would make the flu extra dangerous. For you, it might just mean a lousy week in bed. But sadly, others don’t have that luxury. To people around you, especially pregnant women, young children and older family members, the flu could be a much bigger problem, even deadly. Once it’s your turn to get the flu  —   and surely you know it’ll happen eventually  —   you’d be needlessly exposing other people to harm. “If the message to protect yourself is not effective, maybe do it to be a good community member,” Dr. Bresee said. JONAH: O. K. ugh, I don’t want to make people sick. But don’t flu shots give you a mini version of the flu? Aren’t they just transmitting flu germs into you? DANIEL: Nope. You’re far from alone in thinking so, but it’s just not true. Dr. Bresee said flu shots back in the 1960s and ’70s were associated with some mild reactions, including fevers. But modern vaccines have greatly reduced the negative side effects, most likely leaving you with no more than a mild bit of soreness in your arm. The C. D. C. states it plainly: “No, a flu shot cannot cause flu illness. ” JONAH: But everyone always says that it was getting the shot that made them sick in the first place! Are they lying? DANIEL: I don’t doubt some people got sick soon after getting a shot, but they’re probably misunderstanding what actually caused their sicknesses. People get sick all the time, so it makes a lot of sense that people would come down with a cold or “flulike symptoms” in a time frame that just so happens to be a few days after getting a shot. That in no way suggests that the shot caused it. Though it might be tempting to make the connection to the flu shot when you’re in bed sneezing, correlation is not causation. It’s also possible to be exposed to the flu shortly before the shot or in the   period in which the vaccine takes effect. That’s not the vaccine’s fault. JONAH: Hmm. Fine. But how do I know it’s going to work? DANIEL: Well, you don’t  —   but it definitely increases your odds of staying healthy. The performance of the vaccine changes year to year, but Dr. Bresee said you’re about 50 percent to 60 percent less likely to get the flu by getting the shot. JONAH: All right, Daniel. You got me. These are good arguments. DANIEL: So, you’re convinced? JONAH: No. I just don’t want to get a shot. I don’t want green goo going into my arm. It’s weird! I’m not into it. DANIEL: I confess I did not ask Dr. Bresee about the color of what’s going into your arm, so I can’t help you there. JONAH:   …     DANIEL:   …     JONAH: O. K. I’ll say it: It hurts! I’m scared of needles. DANIEL: I get it. But I promise you: It doesn’t hurt that much, and as a giant wuss who recently got my flu shot, I can say that with authority. It’s really not that bad. If you’re especially concerned about it, you can get an intradermal shot that uses a smaller needle that you won’t even see and goes into your skin instead of your muscle. It’s barely a pinch. Get a shot, Jonah. JONAH: Fine. I will.'"}, "time": 1742628480.5198712}