{"duration": 0.12818455696105957, "input_args": {"text": "'MANDEVILLE, La.  —   It has so far been a mostly humdrum race for Louisiana’s open United States Senate seat, likely to end in a victory for some veteran officeholder: the Republican state treasurer, one of the congressmen, maybe even, in a surprise, a Democratic public service commissioner. But there have been gritted teeth across the state that the one candidate who has drawn by far the most attention, nationally and even internationally, is the one whom pollsters give virtually no chance, whose own party has publicly dismissed  as a “  fraud” and whose unfavorability ratings approach those of North Korea’s. That candidate is a previous   political contender, and     David Duke. Mr. Duke, the former Ku Klux Klan grand wizard and open Nazi sympathizer, relishes his fame and the conundrum facing his critics, who insist on ignoring him but have been forced not to. At a time when the openly white nationalist “ ” has rallied to the candidacy of Donald J. Trump, Mr. Duke’s reappearance on the scene seems practically inevitable. “After four decades, the issues that I’ve spearheaded and fought for are now mainstream,” Mr. Duke said at a seafood restaurant here, sitting across from a large, taciturn diesel mechanic turned bodyguard. Talking of what he called the egregiousness of   immigration, the war on Christmas, the nefarious plotting of the “Jewish elite” and the “cultural destruction” of white America, Mr. Duke was already declaring a sort of victory on the issues: “I’ve won, in the sense that these are now mainstream. ” On the one hand, Mr. Duke is widely seen here as a uniquely poisonous figure who must be publicly opposed, hence the recent reformation of a      group, The Louisiana Coalition Against Racism and Nazism. The group includes former governors and United States senators, as well as Representative Steve Scalise, the   House Republican, who faced a national firestorm two years ago when it was revealed that he had spoken to a   group in 2002. On the other hand, many of those who watched over the years as Mr. Duke attracted worldwide media attention and hauled in donations from his fans  —   a good deal of which he later pleaded guilty to spending on gambling and other personal pursuits  —   say the Duke campaign is just a tired publicity stunt. “The less you talk about him, the worse off he gets,” said Roy Fletcher, a Republican political consultant. Clancy DuBos, a political commentator who has covered Mr. Duke for decades, dismissed the media attention as “cheap headlines and click bait. ” “He’s not in this to win the Senate, he’s in this to make money,” he said. The state Republican Party, having condemned Mr. Duke, recently considered, but did not adopt, rules barring him and any other convicted felons from running as Republicans in the future. It is not as if there were few options for voters on the right: John Neely Kennedy, the state treasurer and presumed Republican   in the Senate race, has said he would “rather drink weed killer than support Obamacare,” and he is considered to be among the moderates. Along with Mr. Kennedy, there are also two sitting congressmen, a retired Air Force colonel and five other Republican candidates vying for the seat being left by David Vitter. Under Louisiana’s system, the two top   out of the two dozen candidates running in November’s nonpartisan    primary will head to a December runoff. Pollsters of both parties say they have trouble seeing Mr. Duke making the cut. Still, many nervously recall the shock of his one successful campaign, for a legislative seat in 1989, and how he won strong majorities of the white vote statewide in his subsequent unsuccessful bids for United States Senate and for governor. And for all the talk about not giving Mr. Duke attention, Democrats from the state party all the way up to Hillary Clinton have jumped at every opportunity to talk about him, and draw connections between Mr. Duke’s candidacy and the Trump campaign. “It’s not overstating things to say that Duke has a shot in this climate,” said Caroline Fayard, a Democratic Senate candidate, who has made opposition to Mr. Duke a central part of her campaign. Plenty of Trump supporters, including other Republican Senate candidates, have come out unequivocally against Mr. Duke. Mr. Trump himself, after some pressure, disavowed him after having first claimed not to know anything about him, though in 2000, Mr. Trump called him a bigot and a Klansman. Still, this is one area where the Democrats and the Duke campaign see eye to eye. “The views that Donald Trump is talking about now were David’s platform decades ago,” said Mike Lawrence, Mr. Duke’s campaign manager, a former state auditor who was kicked out of a recent state Republican Party meeting. And like Mr. Trump, Mr. Lawrence said, “Duke has become a narcotic to the media no Duke coverage in the short term and withdrawal sets in. ” At the restaurant, after a discourse on the evils of   fish, Mr. Duke denied being a racist (though he wrote in his 1998 autobiography that blacks were inherently less intelligent, more violent and more prone to “exaggerated sexual aggression” than whites) or an   (though he accused Jews of “brainwashing” whites in order to push policies “that will destroy us”). But he has embraced the current political moment. Brushing aside Mr. Trump’s disavowals, he described the Trump campaign as something of a scene setter for his own return to politics, after spending years lecturing in Russia and other European countries, though he was expelled from some and arrested in others. The police shootings in Dallas and Baton Rouge clinched his decision to run, because, Mr. Duke said, they clarified the existential threat faced by whites. “There’s a revolution going on in the Republican Party right now,” he said, describing the opposition movements within the party to Mr. Trump’s candidacy and to his own as “synonymous, absolutely synonymous. ” A server came to the table. Mr. Duke, apparently a regular, introduced him as Craig Williams, whose father, Louis Calvin Williams, was in New York on business on Sept. 11, 2001, and was one of five Louisianans to die in that day’s attacks. Mr. Duke asked Mr. Williams to explain to a reporter why his campaign should succeed. “I think they just need to stop letting all these people in,” Mr. Williams said. “You say the slightest thing and everything is race now,” he continued. “It didn’t used to be that way. ” After the interview, the bodyguard having left, Mr. Duke walked out to his white Mercedes and rummaged through the trunk for copies of books he had written to back up claims about Jewish global domination. A couple of days later, as Senate candidates shook hands with voters at the annual Shrimp and Petroleum Festival, Mr. Duke was giving an interview to a television station from Denmark.'"}, "time": 1742562307.590555}