{"duration": 0.09692192077636719, "input_args": {"text": "'Advocates say prison officials at the Kilby Correctional Facility in Alabama turned off the water to Kinetik Justice Amun’s solitary cell after he initiated a hunger strike. Officials then transferred him to the Limestone Correctional Facility, which has a “behavioral modification program” known among prisoners as a “hot bay” dorm in which prisoners are forced to live in pairs in hot and squalid solitary confinement cells.\\nKinetik, also known as Robert Earl Counsil, is the second leader of the Free Alabama Movement (FAM) to be transferred to Limestone. FAM is a group of incarcerated people and their families struggling to end prison slavery and shed light on inhumane conditions in Alabama’s prison system.\\nJames Plesant, also known as Dhati Khalid, was the first leader to be transferred. Melvin Ray, also known as Bennu Hannibal Ra-Sun, is the last remaining leader of FAM not to be transferred to Limestone.\\nAccording to a statement released by the Ordinary People Society, an Alabama-based human rights group for the incarcerated, Kinetik refused meals upon arrival at the Kilby Correctional Facility on October 21. Before the transfer, Kinetik spent three years housed in solitary confinement at the Holman Correctional Facility.\\nAs previously reported by Shadowproof, Kilby is said to be a “ bully camp .” When one Alabama prisoner learned of Kinetik’s transfer to Kilby, he explained the prison is where they send those that “they have to iron out with brutality.” He added, “When they send you to Kilby, that’s where they break your arms and break your legs.”\\nPrison officials turned off the water to Kinetik’s cell in response to his hunger strike, advocates say. “They are trying to kill him,” argued Pastor Kenneth Glasgow, founder of the Ordinary People Society and an “outside” spokesperson for FAM. The Alabama Department of Corrections did not respond to multiple requests for comment.\\nThe Alabama Department of Corrections is currently facing a federal investigation into the rampant violence, overcrowding, and structural decay in its prison system. Kinetik believes his transfer was an act of retaliation by prison officials for his political activity, and that they timed the transfer to prevent him from meeting with this lawyer.\\nKinetik is an outspoken advocate for the human rights of the incarcerated. Along with Dhati Khalid and Bennu Hannibal Ra-Sun, Kinetik and the Free Alabama Movement were some of the people behind the call-to-action for the national prison strike against prison slave labor, which began on September 9.\\nProminent human rights lawyer and executive director of the Equal Justice Initiative, Bryan Stevenson, announced he will work with Pastor Glasgow and look into Kinetik’s case.\\nBennu Hannibal Ra-Sun told Shadowproof the “behavioral modification” dorm or Hot Bay like the one at Limestone is “supposed to be a volunteer program where you volunteer to go into it, but there’s no volunteer aspect. They’re just putting people in it.”\\n“You don’t have to have anything specific that you’ve done. They’re not serving you any paperwork, there’s not any kind of due process, and they’re getting funding from it,” he said. “So to justify funding, they have to have bodies.”\\n“Really what they’re doing is they’re targeting individuals,” Bennu said. He noted there is a Hot Bay program at Donaldson, where he is incarcerated. “That’s where James Plesant was originally. T hey framed him. They’re constantly framing and jumping on people in that Hot Bay.”\\nIn the Hot Bay, prisoners are denied visitation, religious services, recreation, and social services, according to the Free Alabama Movement.\\n“[The Hot Bay] is worse than solitary confinement because they take all of your property and you have a cell mate,” Bennu said. “So the one here at Donaldson is two men to a cell. You’re in the cell with another person for 24 hours a day, 7 days a week. Y’all defecating with each other. Y’all urinating with each other, passing gas, burping, sleeping, waking up. Constantly, you’re in the cell with the door locked 24/7 with someone else.”\\n“They’re sending you up there, they’re torturing people up there. People first got exposed to the Hot Bay program from Bibb County,” Bennu recalled.\\n“There was a bunch of young guys in there. They tore the Hot Bay up,” he said, referring to a July 2015 riot. “They made it where you couldn’t stay in it. They had to get everyone out of there. That’s how bad they are. That’s how bad it was.”\\n“A lot of people think that when they say they put us in solitary confinement that it’s solitary confinement. In and of itself, that constitutes the torture. It’s not just putting me in the cell. It’s the conditions that they put me in inside of these cells,” Bennu argued.\\nHe continued, “They put us in contaminated cells. What they do is, they have people in solitary and they be complaining about the plumbing or complaining about the lights or the ventilation or something. And they will put us in those cells.”\\n“They already know there are issues—there’s plumbing issues, there’s maintenance issues, and they’ll put us in these, what they call ‘black out cells’ or contaminated cells. The lights won’t work, we’ll be in the cells in the dark trying to read, ruining our eyesight. The mattress will be torn up, sleeping on top of these concrete slabs. The water will be leaking, running all over the cell. The vents and stuff are filthy. “\\n“It’s all of these elements that are added on, but that doesn’t show up in the paperwork, and that’s what they’ve done to people like myself. They put me in an isolated cell. I’m on what they call, ‘Walk Along Status.’ That means I cannot interact with anyone. I can’t be around another person. Same thing with Kinetik and James Plesant,” Bennu concluded.\\nA prisoner previously explained to Shadowproof that Limestone is “where they send everybody and you have to spend one year in isolation.” That prisoner hoped Kilby was not a “layover” on Kinetik’s way to Limestone.\\n“If he doesn’t reach Limestone, he’ll be okay,” the prisoner said at the time. According to the website for the Alabama Department of Corrections, Kinetik is now incarcerated at Limestone.\\nThe post Alabama Prison Officials Retaliate Against Prison Strike Leader By Cutting Water To Cell appeared first on Shadowproof .\\n'"}, "time": 1742561775.3165064}