{"duration": 0.05967998504638672, "input_args": {"text": "'Carter Reveals Upgrades To US Long Range Rocket 11/02/2016 \\nSPUTNIK NEWS \\nOn Tuesday US Defense Secretary Ashton Carter announced that the Army’s tactical missile system (ATACMS) will be upgraded to strike both land and sea targets. Such technology will go a long way to defending allies against the Chinese menace and battling Moscow’s “aggression” in the Baltics. \\nThe missile system is sponsored by an office created by Carter in 2012, the Strategic Capabilities Office, which is currently being lead by Will Roper, a protege’ of the Secretary’s. During a panel at the Center for Strategic and International Studies (CSIS) on Friday Roper told an audience, “How you offset the adversaries trying to offset your offset? It’s very simple to do that, you just don’t talk about your best capabilities…We are keeping our best ideas behind the door and probably always will,” according to Breaking Defense. \\nAfter the panel, he continued, “We thought it was important to come out (in public) with ATACMS for the Army because there’s been a lot of writing, a lot of speeches, on the need for the Army to go cross-domain.” High ranking officials in the US military have been calling for the ATACMS to extend its capabilities seaward for some time, and Roper responded to these concerns saying, “it’s time for us to show it isn’t just a theoretical idea, it’s something we can potentially get to quickly with something that we already have.” \\nDuring a morning session at CSIS Carter spoke of the new innovative features of the ATACMS, and how the SCO tries to maximize the potential of existing systems. \\n“A prominent theme of SCO’s work is spearheading creative and unexpected new ways to use our existing missiles and advanced munitions, and across varied domains”, he said, adding, “… By integrating an existing seeker onto the front of the missile, they’re enabling it to hit moving targets, both at sea as well as on land. With this capability, what was previously an Army surface-to-surface missile system can project power from coastal locations up to 300 kilometers into the maritime domain.” \\nCarter detailed the SCO’s plans to utilize seeker technology that the Defense Department has already developed so the missile system can hit targets both on sea and land. \\nLockheed Martin was awarded the $174 million contract for the long range artillery rocket system in May 2015. Ken Musculus, vice president of tactical missiles at the defense contractor said at the time that ATACMS is “reliable and proven in combat, which is why it continues to be our customers’ choice for long-range strike requirements.”'"}, "time": 1742564525.5710902}