{"duration": 0.08977079391479492, "input_args": {"text": "'Go ahead. Count the survivors. \\nThe US Presidential election ended yesterday. \\nLittle information has come out since I reported on the situation 20 or so hours ago. \\nBoth sides have demanded James Comey release more information, and he hasn’t even made a public statement. \\nBut the situation is clear. \\nHillary Clinton is now facing certain indictment. There is simply no way this investigation would have been reopened 11 days before the election if that were not the case. We must not let #CrookedHillary take her CRIMINAL SCHEME into the Oval Office. #DrainTheSwamp pic.twitter.com/GtPkj4xIz6 \\n— Donald J. Trump (@realDonaldTrump) October 28, 2016 \\nNo one is going to vote for a Presidential candidate who may well be in prison a few weeks after she takes office. If they’re continuing the investigation through November, she could well be locked-up before she has a chance to be sworn in. \\nShe is now nonviable. I half expect that they will pull her before Monday. Well, maybe not half-expect. Quarter-expect, perhaps. I don’t even know if they’re allowed to pull her at this point. I think they would have to put in Kaine. \\nSo far she’s made only a three sentence comment on it, and her staff has said nothing but that the FBI needs to explain more. Basically, they appear to believe they still own the FBI. But if they did own the FBI right now, this wouldn’t have happened. There’s no way. \\nThe most logical analysis I have seen is that the agents of the FBI were revolting because of Comey’s criminal collusion, and they exerted some form of pressure on him. I’m not sure what form of pressure they would have that would carry more weight than the pressure Hillary has. \\nBasically, we’ve witnessed Kek intervention. \\nA lot of people were saying Trump was going to win no matter what, and I kept that face up on the site. But tbh fam, I was a bit worried. They are going to have all these illegals voting, which will make a difference. They’re going to do bussing. etc. \\nTrump could contest it, but his only real leverage would be to threaten a putsch. And though I love this idea, I’m not 100% sure it would have actually happened. \\nBut now, none of that matters. \\nBecause not even the kike media can continue portraying Hillary as a viable candidate. \\nWe’ve won, brothers. \\nAll of our hard work this year has paid off. \\nAnd make no mistake – every meme you posted, every comments section you trolled – all of that is what made this happen. \\nKek sent us Trump. Sent the crazy old bastard right down an elevator into our laps. \\nAnd then he said “DO IT FAGGOTS.” \\nAnd we did it. \\nWe memed Jeb into a character of an obsessive cuckold weirdo. \\nWe memed Ted Cruz into Lyin Ted Cruzman Sachs. \\nWe memed Hillary into a freefall collapse of Hillary on 9/11. \\nAnd now we’ve pulled-off the greatest meme of all time: \\nThey’re going to lock her up. \\nTake a bow, brothers. \\nThis is a small step for memes. But it is a giant leap for our agenda to secure a homeland for our people and a future for White children. \\nI’m still a little bit in shock. \\nThis joy that I feel – I cannot describe it. \\nThere is actually a very decent chance that by November 9th, I will actually be tired of winning. \\nIn Conclusion \\nDear kikes: remember when I told you “now is not the time for fear, that comes later?” \\nWell. \\nThe night has never been darker and our enemies have never been closer. \\nBut lo, the people rejoice, and they sing songs of gladness. \\nFor The Don is rising. \\nAnd soon, the swamp will be drained, and our enemies shall know justice. \\nHail Victory.'"}, "time": 1742563467.5150487}