{"duration": 0.058837175369262695, "input_args": {"text": "'LONDON  —   During the last months of her life, a terminally ill    British girl made a final wish. Instead of being buried, she asked to be frozen so that she could be “woken up” in the future when a cure was found  —   even if that was hundreds of years later. “I want to have this chance,” the teenager wrote in a letter to a judge asking that she be cryogenically preserved. She died on Oct. 17 from a rare form of cancer. “I don’t want to be buried underground,” she wrote. The girl’s parents, who are divorced, disagreed about the procedure. The teenager had asked the court to designate that her mother, who supported her daughter’s wishes, should decide how to handle her remains. The judge, Peter Jackson, ruled in her favor. Local news reports said he was impressed by the “valiant way in which she was facing her predicament. ” He said she had chosen the most basic preservation option, which costs about £37, 000, or nearly $46, 000, an amount reportedly raised by her grandparents. “I want to live and live longer and I think that in the future they might find a cure for my cancer and wake me up,” the teenager wrote in her letter to the judge. Local reports said she had told a relative: “I’m dying, but I’m going to come back again in 200 years. ” For legal reasons, the teenager cannot be identified. The case was revealed for the first time on Friday. Cryogenic preservation involves storing people’s bodies, or sometimes just their heads, at very low temperatures in the hope that scientists will one day be able to resuscitate them. According to Cryonics UK, a nonprofit organization that embalmed and transferred the girl’s body to a storage facility in Michigan, once a patient is declared dead, a response team swiftly injects a cocktail of chemicals to try to reduce blood clotting and brain damage. The body is then cooled to around 50 degrees Fahrenheit (10 Celsius) and the blood is removed and replaced with a kind of antifreeze to prevent ice crystals from forming inside the body during the freezing process. The body is then placed in a waterproof bag and gradually cooled to minus 94 degrees using dry ice. Once packed in ice, the body is flown to a storage facility where it is cooled further, to minus 321, and stored in a container filled with liquid nitrogen. The    London girl is one of 11 Britons to have been frozen under this procedure, Cryonics UK said. Judge Jackson acknowledged ethical issues surrounding the procedure and called the case “an example of the new questions that science poses to the law. ” “The scientific theory underlying cryonics is speculative and controversial, and there is considerable debate about its ethical implications,” the judge said in a statement. “On the other hand, cryopreservation, the preservation of cells and tissues by freezing, is now a   process in certain branches of medicine, for example the preservation of sperm and embryos as part of fertility treatment,” the statement said. “Cryonics is cryopreservation taken to its extreme. ” Zoe Fleetwood, the girl’s lawyer, said her client had called Judge Jackson a “hero” after being told of the court’s decision shortly before her death. “By Oct. 6, the girl knew that her wishes were going to be followed,” Ms. Fleetwood told BBC Radio 4. “That gave her great comfort. ” There are only three cryonics storage facilities in the world: two in the United States and one in Russia. Since the procedure was invented in the 1960s, more than 300 people have reportedly been frozen, many of them at the Alcor Life Extension Foundation in Scottsdale, Ariz. So far, no one has been revived. Asked about the chances that the British girl would ever be resuscitated, Tim Gibson, a committee member of Cryonics UK, said they were “somewhere between zero to 100. ” “Cryonics is just a big experiment,” he said. “You can be part of the experiment or part of the control group. ” On its website, Cryonics UK addresses the  question of whether customers could know for sure that the procedure works. “You can’t,” the company says. “You have a choice, though: You can try it, and maybe live and maybe die. Or you cannot try it, and definitely die. ”'"}, "time": 1742564296.4385746}