{"duration": 0.02456951141357422, "input_args": {"text": "'\\nOne argument Trump supporters and conservatives are making is that there has been a lefward shift at Fox News. 3. TrumpTV @ShaneKPolitics Breitbart & alt-right is laying the groundwork for TrumpTV so naturally they\\'re throwing FoxNews under the bus. — ErciTall Vote4HRC (@ercitall) October 28, 2016 \\nAs mentioned in a recent story about Megyn Kelly on The Wildfire, if TrumpTV becomes a reality, a media war will loom over who is the real “conservative” leader in cable news. Prepping the terrain would mean starting to carve out a hard right audience and yank it away from Fox News. 4. Ailes Departure Fox News \\'Imploding\\' probably has more to do with Roger Ailes leaving than Trump. It was founded as the news arm of the GOP. (Not kidding.) — Dave Wollyung (@daveisnotfunny) October 28, 2016 \\nSince Ailes has stepped down, there are two interim co-presidents at Fox News: Bill Shine and Jack Aberneth. As reported by The Hollywood Reporter, it is believed by some that CNN\\'s Jeff Zucker could be in line to fill Ailes\\' shoes, due to a merger between AT&T and Time Warner. 5. Murdoch Sons Total agree Fox News Imploding. The network has taken a left turn since the Murdoch sons took the reins. — DJ Ellis (@Djell4jc) October 28, 2016 “I think it is fair to say the Fox News Channel is imploding,” Levin said. “I think it is fair to say the Murdoch... https://t.co/QSrxbRrrpf — Jim Brown (@Menorahblog) October 28, 2016 \\nThe would-be successors to the Murdoch empire are believed to be much less conservative than their father Rupert Murdoch. 6. More Like Mainstream Media I\\'m glad to see Fox News imploding. It\\'s almost as bad as the rest of the mainstream media. Especially Megyn Kelly. Good riddance. — Deplorable Carl (@CarlKenner) October 28, 2016 \\nThe news channel\\'s mantra to be “fair and balanced” is not sitting well with all viewers. 7. Megyn Kelly, Megyn Kelly, Megyn Kelly . @FoxNews , What r the odds. #Outnumbered / #TheFive / #KellyFile , will cover \"Fox News \\'Imploding\\'\" story? After all . @megynkelly , IT\\'S NEWS. pic.twitter.com/YQTnaTaLaj — Deplorable osPatriot (@osPatriot) October 28, 2016 TOTALLY AGREE! FOX IS LIKE THE REST OF MSM! Levin: Fox News \\'Imploding\\' https://t.co/1YH4RXGZay MEGYN KELLY IS NOT A JOURNALIST! Remove kelly from fox news coverage election night #Trumptrain Levin: Fox News \\'Imploding\\' https://t.co/o67t8ssK72 via @BreitbartNews '"}, "time": 1742628453.1469178}