{"duration": 0.14078354835510254, "input_args": {"text": "'UNITED NATIONS  —   Vitaly I. Churkin, the Russian ambassador to the United Nations, who represented his country through times of domestic tumult and rising tensions with the West, died on Monday morning while at work in Manhattan. He would have turned 65 on Tuesday. The Russian government said he died suddenly but did not specify a cause. The New York City police said there were no indications of foul play. “The outstanding Russian diplomat died in harness,” the Foreign Ministry said in a statement posted on Twitter. The United Nations observed a moment of silence on Monday. His death comes at a critical juncture in   relations, amid allegations of Russian interference in the United States presidential election and President Trump’s praise for his Russian counterpart, Vladimir V. Putin. Relations between the two countries have deteriorated in recent years, and diplomats have been watching whether the dynamics will change under the Trump administration with the appointment of Nikki R. Haley to be the American United Nations envoy. This month, she condemned what she called Russia’s “aggressive” actions in Ukraine. Mr. Churkin, on the same day, lauded her track record in politics. She was governor of South Carolina when Mr. Trump appointed her. “I never underestimate my colleagues,” Mr. Churkin told reporters before posting on Twitter a picture of their first private meeting. Mr. Churkin had been unusually absent during several Security Council meetings recently, but this month he brushed off reporters’ questions about his health. The deputy Russian ambassador, Petr Iliichev, said in brief remarks at a United Nations meeting on Monday that Mr. Churkin had been in the office “until the final moments. ” A Fire Department official said a 911 call had reported a cardiac arrest at the Russian mission on East 67th Street in Manhattan. Police officers from the 19th Precinct station house, across the street, performed cardiopulmonary resuscitation. The medical examiner’s office said an autopsy would be conducted on Tuesday. A police official said Mr. Churkin had a history of medical problems, including leukemia and heart ailments. He had kept them private among his diplomatic colleagues. Mr. Churkin, a former child actor who had starred in three films, two of them biopics about Lenin, was widely considered a masterly diplomat. He could be caustic and wry in equal measure, especially in exchanges with his American counterparts. Once, after Samantha Power, a United Nations ambassador in the Obama administration, scolded him for Russia’s actions in Aleppo, Syria  —   “Are you truly incapable of shame?” she said  —   he accused her of acting like Mother Teresa. Mr. Churkin had been trained as a translator, and as an ambassador, he sometimes became visibly annoyed with United Nations interpreters who could not keep up with his    speaking style. Vitaly Ivanovich Churkin was born in Moscow on Feb. 21, 1952. He held a Ph. D. in history and was a graduate of the Moscow State Institute of International Relations. He began his career in the Soviet era and quickly rose through his country’s diplomatic corps as the Soviet Union was opening up under Mikhail S. Gorbachev. He was a spokesman for the Foreign Ministry from 1990 to 1992, represented his country in peace talks in the former Yugoslavia, and became ambassador to Belgium and Canada before taking on the United Nations post in 2006. He was a forceful defender of the Kremlin under the leadership of Mr. Putin, who issued a statement of condolence on Monday. But Mr. Churkin was not always comfortable with Mr. Putin’s actions, some diplomats said privately. Tom Brokaw of NBC News, who had known Mr. Churkin for many years, recalled that at a lunch at his home in 2015, the ambassador described Mr. Putin’s administration as “a kleptocracy. ” “He was privately very critical of Putin and how he was running the country,” Mr. Brokaw said on Monday. “He was equally critical of the Obama administration. He said: ‘They just don’t get us. They’re not dealing with us the right way. ’” Russia’s relations with the United States soured during Mr. Churkin’s tenure at the United Nations, first over Libya and then over crises in Syria and Ukraine. In an interview in October, he said that   relations had not been so strained since the   conflict nearly brought the two Cold War powers to a military confrontation four decades ago. He was a staunch defender of the Syrian government of Bashar  . He used Russia’s veto at the Security Council to block six resolutions that would have punished the Assad government, including one aimed at referring its actions to the International Criminal Court. He repeatedly questioned all evidence that appeared to point to Syrian or Russian government crimes in Syria and met every Western criticism of Russia’s conduct there with retorts about the West’s role in Yemen and elsewhere. He picked apart every word of every draft resolution to ensure that it satisfied Russian interests. But he could also surprise his fellow diplomats. Last December, he negotiated with his French and American colleagues for three hours in a closed room on the wording of a draft resolution to send United Nations monitors to oversee evacuations from Aleppo. It was the first time in months that the Security Council had reached a consensus on Syria. Mr. Churkin is survived by his wife, Irina Churkina a son, Maksim and a daughter, Anastasia. News of Mr. Churkin’s sudden death sent a shock through the diplomatic community, where he was widely seen as a deft diplomat, skilled at using the rules and protocols of the United Nations to his country’s advantage, including Russia’s veto in the Security Council. Ms. Power, who sparred with him regularly in the Council chambers, said on Twitter that she was “devastated” by the news of Mr. Churkin’s death. “Diplomatic maestro  deeply caring man who did all he cld to bridge   differences,” she wrote. The two were friendly enough that she once took him to see the musical “Hamilton. ” Mr. Churkin recalled that her husband, the legal scholar Cass Sunstein, had sat next to him in the theater and schooled him on the United States Constitution. A previous American ambassador to the United Nations, Susan E. Rice, called Mr. Churkin “highly effective and very funny. ” Mr. Churkin had been the   ambassador on the United Nations Security Council, and he sometimes jokingly referred to himself as the “permanent representative,” the formal title for each member nation’s top envoy to the United Nations.'"}, "time": 1742564338.8101542}