{"duration": 0.08011102676391602, "input_args": {"text": "'You are here: Home / *Articles of the Bound* / The Liberal Media Hacks Will Never Change The Liberal Media Hacks Will Never Change November 22, 2016, 8:34 am by Cliff Kincaid Leave a Comment 0 \\nAccuracy in Media \\nIn announcing his challenge to Rep. Nancy Pelosi (D-CA) for leadership of the House Democrats, Rep. Tim Ryan (D-OH) used an old quotation, saying that the definition of insanity is to do the “same thing over and over again and keep getting the same results.” He meant that the Democrats keep losing seats with the same leaders and the same message. But the famous quote also applies to the liberal media, who use the same talking heads to make the same points over and over again, even after they were humiliated by Donald J. Trump on Election Day. \\nInterviewing former Utah Governor Mike Leavitt (R) on Monday on MSNBC, Kristen Welker of NBC News demonstrated how the bias works on a day-to-day basis. She contrasted the “impassioned” partisan plea from the cast of the Broadway show “ Hamilton ” to Vice President-elect Mike Pence with the president-elect’s “Twitter storm” in response. She wondered if Trump’s tweets were presidential, but did not question if it was appropriate for the “Hamilton” cast to use their production for political purposes. Leavitt gave a diplomatic answer, saying Twitter was a new way for a president to communicate. \\nIt is also a very effective way. The media know it and don’t like it. In just a few words, Trump can effectively expose liberal bias. He called the show “overrated” and said the crew had harassed Pence, adding, “The cast of Hamilton was very rude last night to a very good man, Mike Pence. Apologize!” \\nOn CNN, anchor Chris Cuomo was troubled by Trump’s use of Twitter in response to the “Hamilton” controversy. His former campaign manager Kellyanne Conway replied , “Why do you care?” \\nIt’s a good question, and she knows the answer. She noted that Trump is “just trying to cut through the nonsense” of what the media and other opponents of Trump want people to believe. \\nTrump beat the media, as well as the Democrats, on Election Day. Of course, the emails from WikiLeaks demonstrated that they are one and the same. \\nIn this context, Politico is emerging as one of the most dishonest publications in the Trump era. A Politico story by Kelsey Hutton about media collusion with the Clinton campaign said , “most of the correspondences revealed by WikiLeaks consisted of reporters asking for comment, setting up in-person meetings and trying to get information from sources, which is a reporter’s job.” \\nAIM’s Spencer Irvine noted that the WikiLeaks e-mails exposed how the liberal media establishment “has worked almost hand-in-hand with the Hillary Clinton campaign.” He cited ten examples, including: Politico reporter Glenn Thrush admitted to being a “hack,” writing to her campaign chairman John Podesta, “Because I have become a hack I will send u the whole section” of a story he was writing. \\nA “hack” is usually defined as a person who is supposed to be a professional but does mediocre work. \\nAnother Thrush email to Podesta about an Obama White House story said, “you are in the thing…in a good way…but could really use your insights…sorry to be a pain in the ass.” This is not asking for comment. It constitutes flattery, in the context of assuring him that he’s already covered “in a good way” and begging for more quotes. \\nThe Clinton campaign got an article from Politico in advance of publication that contained some mild criticism of Hillary. The article was provided in advance so the Clinton campaign could formulate a response. \\nPolitico has a media reporter, Jack Shafer, who tried to rationalize much of the collusion in a story that carried the headlines, “WikiLeaks and the Oily Washington Press. A bunch of reporters got caught up in the Podesta flypaper. How bad is it, really?” The final headline suggested it was much ado about nothing. \\nHe admitted that Politico reporter Glenn Thrush sent Podesta “a chunk of his story-in-progress,” but that he was among many reporters who “appear to have conned their way into the inner sanctums to produce creditable work that is accurate and useful to readers.” He added, “What appear to be compromises ultimately redound to their favor.” \\nIn other words, Thrush was acting like a sycophant just to get information. Is this what modern journalism has become? What happened to speaking truth to power? \\nShafer said, “In my own journalism, this isn’t how I work: I don’t give my sources a sneak preview of what I’m writing—unless the topic is technical and complicated (law, medicine, science, tech, et al.) and demands an expert’s checkmark.” \\nNevertheless, there has been no apology from Politico senior management over Thrush’s pathetically subservient coverage of the Democrats. They will just move on, doing the same thing over and over again, hoping that we will all forget what they have done. \\nWe won’t. Cliff Kincaid \\nCliff Kincaid is the Director of the AIM Center for Investigative Journalism and can be contacted at cliff.kincaid@aim.org. View the complete archives from Cliff Kincaid . 0'"}, "time": 1742561949.8269746}