{"duration": 0.041336774826049805, "input_args": {"text": "'On Friday, mainstream media reporters from the New York Times and CNN whined after President Donald Trump’s White House relegated them to the rear of the Rose Garden during Trump’s press conference with Romanian President Klaus Iohannis.  “We were in the equivalent of Siberia, no pun intended, when it comes to where we were seated,” CNN’s Jim Acosta reportedly said on Friday evening. “That could be seen as an oversight on the part of the White House staff but it could also be seen as retaliation over the reporting we’re doing over here at CNN. ” CNN’s Wolf Blitzer said it was “outrageous. ” And Acosta, mustering up the courage mainstream media reporters never found while Barack Obama was president, said the poor seating assignments are “not going to deter us from what we’re doing over here. ” Breitbart’s Matt Boyle has described Acosta as “a vehemently   media figure in the heart of the opposition party’s mothership CNN. ” CNN was placed away from the other TV networks in the equivalent of Siberia (no pun intended) at today’s news conference.  —   Jim Acosta (@Acosta) June 9, 2017,  Of course, this may just be an oversight by WH staff. But it could also be seen as retaliation for our coverage. I have emailed @PressSec https:  .   —   Jim Acosta (@Acosta) June 9, 2017,  Trump has referred to outlets like CNN and the Times as part of the “opposition party” and slammed them for publishing “fake news” based on anonymous sources. The New York Times was sent to the very last row a day after former FBI director James Comey revealed on Thursday while testifying before the Senate Intelligence Committee that the Times published a fake news story in February suggesting that Trump’s campaign had colluded with Russians a year before the 2016 election. The White House has put the New York Times in the last row at today’s joint press conference with Trump and Romania’s president pic. twitter.   —   Gabby Morrongiello (@gabriellahope_) June 9, 2017,  “In the main, it was not true,” Comey said of the story, which was based on four anonymous sources. “And again, all of you know this. Maybe the American people don’t. The challenge, and I’m not picking on reporters about writing stories about classified information, is the people talking about it often don’t really know what’s going on, and going on are not talking about it. We don’t call the press to say, hey, you don’t that thing wrong about the sensitive topic. We have to leave it there. ” In addition to the Times’ “fake news” story, Comey also revealed that have been “many, many” stories in the mainstream press about the Trump campaign and Russia that have been “dead wrong. ”'"}, "time": 1742562654.6183243}