{"duration": 0.17706894874572754, "input_args": {"text": "'CHARLOTTE, N. C.  —   A cellphone video made by the wife of Keith Lamont Scott as he was fatally shot by the police here shows the moments before and after the episode, including the wife’s pleas to her husband to get out of his truck, and her pleas to the officers not to shoot him. But the video, which was given to The New York Times on Friday by lawyers for the family, does not include a view of the shooting itself. Nor does it answer the crucial question of whether Mr. Scott had a gun, as the police have maintained. This question and others surrounding the case have transformed Charlotte into the latest crisis in the divisive debate over police treatment of minorities. In the last several nights here, hundreds of protesters have taken to the streets demanding justice. Many have done so peacefully. Others have vandalized property and clashed with the police. One of the lawyers, Justin Bamberg, who is representing the family along with Eduardo Curry, said in an interview on Friday that the video did not prove whether the shooting was justified. Rather, he said, it offered “another vantage point” of the episode. He said he hoped the Police Department would release its own videos of the shooting, as protesters have demanded since Mr. Scott was killed on Tuesday. The video provided a vivid glimpse of the drama that played out as Mr. Scott’s wife of 20 years, Rakeyia, first pleaded for a safe outcome to her husband’s encounter with the police, and then was heard reacting in uncomprehending horror as he was shot to death. Mr. Scott, a father of seven, had parked his white Ford Explorer in a visitor’s space at the apartment complex where he lived, about a   south of the University of North Carolina at Charlotte. He often waited there, on a   stretch of Lexington Circle, for one of his children to return home from school. Officers of the   Police Department arrived in unmarked vehicles shortly before 4 p. m. to serve a warrant on another person. Ms. Scott left their apartment to bring Mr. Scott a cellphone charger, the lawyers said, when she saw the officers around him and began recording the scene on her phone. The Police Department has said that officers saw Mr. Scott, who was black, standing beside his S. U. V. holding a handgun, then saw him get into the vehicle. The video, which lasts 2 minutes 12 seconds, begins with shaking images of grass and the voice, apparently that of an officer, shouting, “Hands up!” Immediately, Ms. Scott said, “Don’t shoot him,” and began walking closer to the officers and Mr. Scott’s vehicle. “Don’t shoot him. He has no weapon. He has no weapon. Don’t shoot him. ” An officer can then be heard yelling: “Gun. Gun. Drop the gun. ” A police S. U. V. with lights flashing arrived, partly obscuring Ms. Scott’s view, and a uniformed officer got out. From that point, there are five officers, most of whom appeared to be wearing body armor over plain clothes, around Mr. Scott. “Don’t shoot him, don’t shoot him,” Ms. Scott pleaded, her voice becoming louder and more anxious. “He didn’t do anything. ” Officers continued to yell “drop the gun” or some variation of it  —   at least 12 times in 38 seconds. “He doesn’t have a gun,” Ms. Scott said. “He has a T. B. I. ”  —   an abbreviation for a traumatic brain injury the lawyers said Mr. Scott sustained in a motorcycle accident in November. “He’s not going to do anything to you guys. He just took his medicine. ” “Drop the gun,” an officer screamed again as Ms. Scott tried to explain her husband’s condition. The officer then said he needed to get a baton. “Keith don’t let them break the windows. Come on out the car,” Ms. Scott said, as the video showed an officer approaching Mr. Scott’s vehicle. “Drop the gun,” an officer shouted again. Ms. Scott yelled several times for her husband to “get out the car,” but on the video, he cannot be seen through the window of the S. U. V. “Keith, don’t do it,” Ms. Scott shouted, as the video showed her backing away and panning to the ground. Mr. Bamberg said that Ms. Scott was trying, in those statements, to “get him to stand still” after he got out of the car. It was only in the final moments before the shots  —   less than two seconds on the video  —   that the camera panned back and Mr. Scott could be seen, still unhurt. He was standing between the vehicles and officers, wearing bright aqua pants, a dark   and a white ball cap, his head turning from side to side. Neither of his hands  —   and what, if anything, he was holding  —   could be seen clearly. Friends and neighbors have raised the possibility that he was holding a book. The police claimed that he was holding a gun, and that a gun was recovered from the scene. But the police chief, Kerr Putney, has acknowledged that in police videos of the shootings, he could not see Mr. Scott’s hands. “The video does not give me absolute, definitive visual evidence that would confirm that a person is pointing a gun,” he said on Thursday. Fifty seconds into Ms. Scott’s video, four shots rang out. The Police Department has identified the officer who fired as Brentley Vinson, 26, who is black, and has been with the force since 2014. Ms. Scott seemed to flinch at the first gunshot, and the picture immediately left her husband. “Did you shoot him? Did you shoot him?” Ms. Scott shouted, her voice becoming louder each second. “Did you shoot him? He better not be [expletive] dead. ” She moved closer, and the video showed Mr. Scott lying face down on the pavement, his white sneakers pointed to the camera, with officers standing and kneeling around him. “I’m not going to come near you. I’m going to record, though,” Ms. Scott said. “I’m not coming near you. I’m going to record, though. He better be alive. ” Mr. Bamberg said of the video: “Right now, we don’t have enough facts to say whether this shooting was justified or unjustified. That’s what we’re trying to find out. ” The lawyers also brought attention to an object that they said could be seen on the ground near Mr. Scott after he was shot. They said the object seemed to appear in the video after the camera panned away briefly, in a place where no object was previously visible. The video had been widely viewed both online and on television by Friday afternoon. City and police officials did not respond to Ms. Scott’s video. But in a statement on Friday, Jennifer Roberts, the mayor of Charlotte, pressed the state’s Bureau of Investigation to speed up its efforts to release the police recordings. “I urge it to use every resource at its disposal to get this done, and release the information to the public as quickly as possible,” she said. Chief Putney arranged for Mr. Scott’s family members and their lawyers to privately view two police videos on Thursday. Beforehand, they had been uncertain whether the videos should be released to the public, Mr. Bamberg said, but after seeing them, they called for release of the recordings. While the family members differed with the police on some major points about the videos, they seemed to be in agreement with the police chief on one aspect. “It is impossible to discern from the videos what, if anything, Mr. Scott is holding in his hands,” they said in a statement. Mr. Bamberg and Mr. Curry also described the two police videos  —   one from a dashboard camera and the other from a body camera  —   that the police allowed the lawyers and family members to view. The   video, Mr. Bamberg said, provided few significant details of the shooting. But he said the dashboard video showed two officers taking up positions behind a pickup truck and yelling commands at Mr. Scott, who was inside his vehicle. The dashboard video, the lawyers said, appeared to show that the front window on the driver’s side was rolled up. The video, Mr. Bamberg said, then showed Mr. Scott stepping out of the vehicle, his hands down, with his right hand empty and “some type of object” in his left hand. “It’s impossible to make out what it is,” the lawyer said, noting that Mr. Scott was  . “He doesn’t make any dramatic movements,” Mr. Bamberg said. He also said Mr. Scott seemed “confused. ” In the video, Mr. Scott took a couple of steps forward “in a nonaggressive manner,” the lawyer said, and then a step back. Then shots were fired. According to court records, Mr. Scott, who was born in South Carolina, was charged in that state with a number of offenses including check fraud, aggravated assault and carrying a concealed weapon. Later, he moved to Texas, where he shot and wounded a man in San Antonio in 2002. He was convicted and sentenced, in 2005, to seven years in prison, and was released in 2011. His lawyer in the Texas shooting case, Gloria Yates Early, said Mr. Scott had claimed his family was being “stalked. ” “Allegedly, people were following them around with weapons, pointing them at their bodies,” Ms. Early said. “He carried a gun around and he admitted to shooting a guy. He alleged   of himself and his family. ” When asked on Friday if Ms. Scott knew whether her husband owned a gun at the time he was shot by the police, Mr. Curry replied, “Not that she knew of. ”'"}, "time": 1742563140.4529526}