{"duration": 0.07162094116210938, "input_args": {"text": "'Rejoice, gentlemen! The tears of liberals are flowing freely, as Donald Trump has recently been announced president. All of the hard work that we’ve committed ourselves to over the past year has finally come to a close. It’s truly an event of the ages: a hard working, American businessman beat out the globalist titans and Satanic elite.\\nIn the spirit of this great victory, I believe that we’re all entitled to some enjoyment. This article will be solely dedicated to bathing in liberal tears; and, mark my words, it will be glorious. This is the beginning of the end of SJWism, and I think it’s high time we soak in the fruits of our labor.\\nHillary HQ: Morale Obliterated Sorry guys, there’s no brakes on the #TrumpTrain\\nAs poll results came in, moving Trump from a measly 2% chance to a whopping 95% chance of seizing the presidency, libtards began crying all across the nation. Turns out that America does not, in fact, want their Lord and Savior Hillary Rodham Christ, to be president of the free world.\\nNote the sour expression of the woman on the far right.\\nUnfortunately for you guys, Trump has won the presidency. Sorry illegals—you’re out. SJWism is coming to an end, the mainstream media is dying off, and we’re going to make America great again.\\n“You mean we won’t be letting in 60,000 violent refugees? Oh no!”\\nHere’s a video compilation:\\n\\n#TheShakening \\n\\nToo late. He won.\\n\\n\\n\\n\\n#LiterallyShaking\\n\\nLiterally Can’t Even Literally (Literally) Hitler \\n\\n\\n\\nAs am I, Frosty. As am I.\\n\\nThe Regressive Left Can’t Cope with Reality \\nIf you’re having this much trouble dealing with Trump’s presidency, you shouldn’t even be allowed to vote.\\n\\n\\n\\nShe doesn’t realize that Democrats keep the black population down by giving them free handouts and encouraging squalor.\\n\\n\\n\\n\\nOh, the feels! How can these people lead our country when they can’t even contain their emotions?\\nProfessional Victim And Concern Trolling Olympics \\n\\n\\nMeanwhile At Trump HQ \\nNotice the general lack of high-estrogen men. Most of these guys don’t seem to be lacking in testosterone.\\n\\nThis man is giving a toast to Donald Trump. “To making America great again!”\\n\\n\\n\\nThank You Mr. President! Let’s #MAGA Read More: Wall Street, Hollywood, The Media And SJWs Fail To Stop Donald Trump From Becoming America’s Next President \\n'"}, "time": 1742561931.1676795}