{"duration": 0.04612445831298828, "input_args": {"text": "'Although the Democrats have lost so badly in recent elections that Republicans control both Congress and the White House and the majority of governorships across the country, the Democrats aren’t plotting ways to attract voters with ideas and principles. [Instead, the Democratic National Committee (DNC) is announcing it will hold summer camps for community organizers, dubbed the Summer Resistance program.  “There has been an explosion of activism and energy after the election of Donald Trump, and we need to turn this moment into a movement, DNC chairman Tom Perez is quoted in the press release announcing the plan. “As the Democratic Party, it is our role to support this activism and energy, and convert it into electoral wins    the ballot by making sure state parties have the tools and resources they need to succeed. ” To that end, the DNC will pump money in the form of grants into state party programs. “The program is a competitive matching grant program, where the DNC will approve and fund programs that will be executed by state parties,” the press release states. “Recognizing that a     approach is ineffective, each grant proposal will be unique to the state’s strategic priorities and organizational capacity. “Part of these plans must incorporate, where legally possible, partners and allies,” the press release states. DNC Deputy Chairman Keith Ellison, who lost the chairmanship to Perez but still got a leadership position on the committee nonetheless, used #Resistance in his remarks about the summer camps. “The best way for Democrats to turn the #Resistance into electoral wins is by doing one thing: organizing,” Ellison said. “Resistance Summer is the starting point and will take the Democratic Party’s message of fairness and equality to activists on the front lines and all Americans looking to get engaged. ” Then Ellison, ironically, names some of the reasons President Donald Trump was elected: “The American people want affordable health care for all, good jobs that pay well, and a tax code that rewards hard work,” Ellison said, adding that Democrats “have never had a better opportunity to win    the ballot. ”'"}, "time": 1742561831.0195668}