{"duration": 0.09502243995666504, "input_args": {"text": "'Jerry Heller, a veteran music manager who helped introduce N. W. A to the masses and promoted gangsta rap to a mainstream audience, died on Friday in Thousand Oaks, Calif. He was 75. The Associated Press reported that Mr. Heller’s cousin, Gary Ballen, said he died in a hospital after he had a heart attack while driving. Mr. Heller and Eric Wright, the rapper known as   founded Ruthless Records in 1987. A year later, the label released “Straight Outta Compton,” the debut album by the rap group N. W. A, whose members, in addition to   were Dr. Dre and Ice Cube, soon to become major figures in   as well as DJ Yella and MC Ren. The album was a hit and helped propel West Coast gangsta rap into the national spotlight  —   and into the center of controversy. Some people said the lyrics of N. W. A and other gangsta rappers glorified violence, while others said they simply reflected the reality of black urban life. N. W. A’s success was  . Ice Cube left in 1989, and the group, which Mr. Heller managed, broke up in 1991 amid accusations of mismanagement. Mr. Heller remained close to   but Dr. Dre and Ice Cube criticized Mr. Heller publicly. The acrimony did not go away. Speaking to The New York Times in April, Ice Cube accused Mr. Heller of “participating in the destruction” of N. W. A and claimed that he had “little or nothing to do with” the group’s music, adding, “We would never listen to his ideas. ” “Straight Outta Compton,” F. Gary Gray’s   2015 film about N. W. A, also presented Mr. Heller, who was played by Paul Giamatti, in a harshly negative light. Mr. Heller complained that he was depicted as “the ‘bad guy’ in the movie who is solely responsible for the demise of N. W. A” and who withheld money from the group. He sued NBC Universal, which released the movie, and more than a dozen others associated with it for defamation, seeking $35 million in actual damages and $75 million in punitive damages. A judge dismissed most of the lawsuit in June. Mr. Ballen told The Associated Press that the litigation had caused Mr. Heller significant stress. Mr. Heller started his music career in the 1960s as an agent and promoter, working with Pink Floyd, Marvin Gaye, Creedence Clearwater Revival and other major rock and RB acts. He set up Elton John’s first performance in the United States, Mr. Ballen told The Associated Press. He was living with his parents after a period of financial trouble when he began working with  . Recalling Mr. Heller’s excitement when he heard a cassette recording of N. W. A’s early work, Mr. Ballen said: “As far as I’m concerned, there would never be a Dr. Dre or an Ice Cube if it wasn’t for Jerry getting their first deal, which was really difficult. Nobody wanted to sign them. ” In 2001, Mr. Heller told The Los Angeles Times that he considered gangsta rap “the most important movement since the beginning of rock ’n’ roll. ” Mr. Heller’s later   ventures included a label specializing in Latino   performers, but he never again achieved the level of success he had with Ruthless Records. In an interview with the website Grantland in 2015, he said that “of all the things that I’ve done, certainly the most important period of my life” was the years he worked with   adding, “That was the period I’m most proud of. ”   died from complications of AIDS in 1995. This year N. W. A was inducted into the Rock and Roll Hall of Fame, which called the group “the most controversial and complicated voices of their generation. ” Gerald Heller was born on Oct. 6, 1940, and raised in Cleveland. He said he faced strong   growing up and that his father, the owner of a scrap metal business, spent time with the Jewish mob, Billboard magazine reported. He served in the Army and earned a business degree from the University of Southern California after he was discharged. Mr. Heller’s autobiography, “Ruthless,” written with Gil Reavill, was published in 2006. In addition to Mr. Ballen, Mr. Heller’s survivors include a brother, Ken.'"}, "time": 1742562703.70456}