{"duration": 0.11109590530395508, "input_args": {"text": "'-Onions -Red peppers \\nNotice they are all healthy foods we often don’t get enough of? This is another big issue with our diets. We consume a lot of junk, meat, dairy and processed foods, items that clinically have been proven to be the number one causes of heart disease and illness yet we consume them in huge quantities. The key is to limit these and eat a lot of fresh, lively foods that provide nutrients and don’t ask the body to perform a mega job to digest. \\n\\nYou can also increase your exercise as glutathione production increases when you exercise. Breathing and sweating are also great ways to get rid of toxins in the body. \\nGlutathione Protects Against Chronic Illness \\nWhat makes glutathione so important and powerful is that it recycles antioxidants. When your body is dealing with free radicals, it is essentially passing them from one molecule to another. They might go from vitamin C to vitamin E to lipoic acid and then to glutathione where they are cooled off. Antioxidants are recycled at this point and the body can now regenerate another glutathione molecule to go back at it again. \\n\\nGlutathione is crucial for helping your immune system fight chronic illness as it acts as the carrier of toxins out of your body. Like a fly trap, toxins stick to glutathione and they are carried to the bile into the stools and out of the body. Glutathione is also powerful enough that it has been shown to help in the treatment of AIDS greatly. The body is going to get in touch with oxidants and toxins, the more we can deal with those the better our body will be at staying strong, this is why glutathione is so important. \\n\\nDr. Mark Hyman has given 9 tips to increase your Glutathione levels. Check them out! \\n\\n1. Consume sulfur-rich foods. The main ones in the diet are garlic, onions and the cruciferous vegetables (broccoli, kale, collards, cabbage, cauliflower, watercress, etc.). \\n\\n2. Try bioactive whey protein. This is great source of cysteine and the amino acid building blocks for glutathione synthesis. As you know, I am not a big fan of dairy , but this is an exception — with a few warnings. The whey protein MUST be bioactive and made from non-denatured proteins (“denaturing” refers to the breakdown of the normal protein structure). Choose non-pasteurized and non-industrially produced milk that contains no pesticides, hormones, or antibiotics. Immunocal is a prescription bioactive non-denatured whey protein that is even listed in the Physician’s Desk Reference. \\n\\n3. Exercise boosts your glutathione levels and thereby helps boost your immune system, improve detoxification and enhance your body’s own antioxidant defenses. Start slow and build up to 30 minutes a day of vigorous aerobic exercise like walking or jogging, or play various sports. Strength training for 20 minutes 3 times a week is also helpful. \\n\\nOne would think it would be easy just to take glutathione as a pill, but the body digests protein — so you wouldn’t get the benefits if you did it this way. However, the production and recycling of glutathione in the body requires many different nutrients and you CAN take these. Here are the main supplements that need to be taken consistently to boost glutathione. Besides taking a multivitamin and fish oil, supporting my glutathione levels with these supplements is the most important thing I do every day for my personal health. \\n\\n4. N-acetyl-cysteine. This has been used for years to help treat asthma and lung disease and to treat people with life-threatening liver failure from Tylenol overdose. In fact, I first learned about it in medical school while working in the emergency room. It is even given to prevent kidney damage from dyes used during x-ray studies. \\n\\n5. Alpha lipoic acid. This is a close second to glutathione in importance in our cells and is involved in energy production, blood sugar control, brain health and detoxification. The body usually makes it, but given all the stresses we are under, we often become depleted. \\n\\n6. Methylation nutrients (folate and vitamins B6 and B12). These are perhaps the most critical to keep the body producing glutathione. Methylation and the production and recycling of glutathione are the two most important biochemical functions in your body. Take folate (especially in the active form of 5 methyltetrahydrofolate), B6 (in active form of P5P) and B12 (in the active form of methylcobalamin). \\n\\n7. Selenium. This important mineral helps the body recycle and produce more glutathione. \\n\\n8. A family of antioxidants including vitamins C and E (in the form of mixed tocopherols), work together to recycle glutathione. \\n\\n9. Milk thistle (silymarin) has long been used in liver disease and helps boost glutathione levels.'"}, "time": 1742564537.5923676}