{"duration": 0.06146502494812012, "input_args": {"text": "'A federal judge sentenced the first American ever to be convicted of attempting to engage in jihad on behalf of the Islamic State ( ) to 35 years in prison. [“Today, Tairod Nathan Webster Pugh, a U. S. citizen and former member of the U. S. Air Force, was sentenced to 35 years in prison for attempting to provide material support to the Islamic State of Iraq and Syria (ISIS) a designated foreign terrorist organization, and obstruction of justice,” announced the Department of Justice (DOJ) noting that News Jersey resident was convicted in March 2016.  U. S. District Judge Nicholas Garaufis sentenced the wannabe jihadist on Wednesday. “I am a black man, I am a military man, I am a Muslim man,” Pugh told the judge on the day of his sentencing before dissolving into tears, reports the New York Post. “I protected this country and the Constitution,” added the military veteran. “And my service was repaid by stripping me of my career, shaming my wife, shaming my parents, shaming my children. ” Judge Garaufis did not express any sympathy towards Pugh. “This isn’t about whether you’re Muslim or Christian or Jewish,” the judge told the defendant before handing down his decision. “This is about whether you’re going to stand up for your country, which has done so much for you, or betray your country. ” “You made your choice,” proclaimed the judge. “I have no sympathy. ” In January 2015, Pugh traveled to Turkey from Egypt to cross the border into Syria and engage in jihad on behalf of ISIS. Turkish authorities denied the American Air Force veteran entry and returned him to Egypt. Pugh attempted to destroy evidence in Istanbul. “Foreign government officials quickly deported the defendant to the U. S. where the FBI closely monitored him, relying in part on a covert undercover employee who encountered the defendant at John F. Kennedy International Airport in New York City,” notes the DOJ. Authorities arrested Pugh on January 16, 2015, in New Jersey. In a letter drafted before he left Egypt for Turkey, the defendant proclaimed: I am a Mujahid. I am a sword against the oppressor and a shield for the oppressed. I will use the talents and skills given to me by Allah to establish and defend the Islamic State. There is only 2 possible outcomes for me. Victory or Martyr. “Defense attorney Susan Kellman likened her client’s interest in the Islamic State to a kind of ‘voyeurism’ but noted that there had been no evidence of any form of communication between Pugh and the group,” points out the New York Post.'"}, "time": 1742563119.7175117}