{"duration": 0.0452427864074707, "input_args": {"text": "'WASHINGTON, D. C.  —   President Donald Trump, in an exclusive interview with Breitbart News in the Oval Office, said that the Academy Awards failure on Sunday evening was due in large part to Hollywood’s obsessive focus on politics —  attacking him, generally speaking. [Trump told Breitbart News in the exclusive interview that the Oscar fail may have been avoided had Hollywood’s finest focused less on attacking him and more on getting the event’s details right.  “I think they were focused so hard on politics that they didn’t get the act together at the end,” President Trump said. “It was a little sad. It took away from the glamour of the Oscars. It didn’t feel like a very glamorous evening. I’ve been to the Oscars. There was something very special missing, and then to end that way was sad. ” The Oscars comprised just one part of a lengthy interview, which ranged in topics from healthcare to tax cuts to immigration to trade and more. The rest of the interview is forthcoming here on Breitbart News. At the Oscars on Sunday evening, the Academy Award for Best Picture was read out by presenters Warren Beatty and Faye Dunaway as being for La La Land —  not the actual winner, Moonlight. The flub —  already being dubbed the worst in the Academy Awards’ history —  has forced accounting firm PricewaterhouseCoopers to apologize after overseeing the   process for 83 years. “We sincerely apologize to Moonlight, La La Land, Warren Beatty, Faye Dunaway, and Oscar viewers for the error that was made during the award announcement for best picture,” the firm said in a release, according to The Hollywood Reporter. “The presenters had mistakenly been given the wrong category envelope and when discovered, was immediately corrected. We are currently investigating how this could have happened, and deeply regret that this occurred. We appreciate the grace with which the nominees, the Academy, ABC, and Jimmy Kimmel handled the situation. ” The Hollywood Reporter’s Erik Hayden explained the  : In years past, the firm has provided two sets of winners’ envelopes in briefcases that are sent to the Dolby Theatre, one briefcase for either side of the stage. In what was was supposed to just be a memorable movie reunion, Warren Beatty and Faye Dunaway ended up fumbling the presentation of best picture, as they were apparently holding the best actress envelope instead. Not only did Dunaway read off La La Land as the best picture winner, the confusion wasn’t fixed until after several members of the Lionsgate movie’s team had already spoken. “I opened the envelope and it said ‘Emma Stone, La La Land.’ That’s why I looked at Faye, and at you. I wasn’t trying to be funny,” Beatty clarified, laughing nervously. The awful mistake came after hours of   by the Hollywood elites, who hammered the president in joke after joke. Now, the president has got the last laugh as he hammers Hollywood for its epic fail. More from President Trump’s exclusive interview with Breitbart News is forthcoming.'"}, "time": 1742563160.661499}