{"duration": 0.08213663101196289, "input_args": {"text": "'Sonntag, 20. November 2016 Stiftung Warentest benotet Planeten Erde mit \"Mangelhaft\" Berlin (Archiv) - Großer Schock für Erdnutzer: Wie die Stiftung Warentest am Mittwoch mitteilte, hat der Planet Erde in einem ausführlichen Test auf Bewohnbarkeit, Sauberkeit und allgemeinen Nutzen lediglich die Note \"Mangelhaft\" erreicht. Demnach sei der Planet für eine Besiedelung durch den Menschen kaum bis gar nicht zu empfehlen. \"Bereits seit Jahren erreichen uns Berichte empörter Nutzer, die mit ihrem Gesamterlebnis auf dem Planeten Erde in höchstem Maße unzufrieden sind\", erklärte eine Sprecherin der Stiftung auf einer Pressekonferenz. Besonders erschreckend sei dabei die Vielzahl unterschiedlichster Defizite und teils hochgefährlicher Fehlfunktionen, die auf ein bereits ab Werk mangelhaftes Produkt hinweisen. Vernichtend: Urteil der Stiftung Warentest \"Im Test haben sich vor allem der hohe Salzwassergehalt, das nahezu ständige Auftreten von Naturkatastrophen und die Anwesenheit ziemlich nervender Wespen als größte Schwächen der Erde erwiesen\", so die Sprecherin. \"Zudem sterben ständig Menschen, weil die Erde gegen elementarste Sicherheitsbestimmungen verstößt.\" So seien 97 Prozent aller Canyons, Klippen und Schluchten nicht ordnungsgemäß abgesichert. In den meisten Gewässern fehlen Tiefenangaben sowie ausgewiesene Nichtschwimmerbereiche. In die Gesamtnote von 5,1 (\"Mangelhaft\") seien jedoch noch deutlich mehr Mängel eingeflossen. So enthalte die Erde zahlreiche, nicht deklarierte Inhaltsstoffe, die teilweise Allergien hervorrufen, sowie alle erdenklichen gefährlichen Chemikalien, die oftmals krebserregend oder gar radioaktiv seien. Nicht zuletzt könne die planeteneigene Gravitation Gelenkbeschwerden und Verschleißerscheinungen hervorrufen. Harte Kritik übte die Stiftung Warentest auch am Hersteller der Erde, der sich derzeit an einem unbekannten Ort aufhält und jegliche Beschwerden enttäuschter Kunden über sein Produkt unbeantwortet lässt. Angebracht sei mindestens eine Stellungnahme und gegebenenfalls eine koordinierte Rückrufaktion, so die Forderung der Warentester. Bis dahin rate man vorsorglich jedem davon ab, die Erde privat zu nutzen. ssi, dan; Hinweis: Erstmals erschienen am 15.8.14 Artikel teilen:'"}, "time": 1742561986.5731812}