{"duration": 0.11900925636291504, "input_args": {"text": "'SYDNEY, Australia  —   Scientists surveying the Great Barrier Reef said Tuesday that it had suffered the worst coral   ever recorded after being bathed this year in warm waters that bleached and then weakened the coral. About   of the   coral on the reef’s previously pristine,   northern stretch is dead, the scientists said. Only a cyclone that reduced water temperatures by up to three degrees Celsius in the south saved the lower reaches of the   reef from damage, they added. On some atolls in the north, all the coral has died, said Prof. Terry Hughes, the director of the ARC Center of Excellence for Coral Reef Studies at James Cook University in Townsville, in the eastern state of Queensland. Professor Hughes and a team of scientists drew their findings from about 900 dive surveys along the length of the reef in October and November. “The good news is that in the south, only about 1 percent of the reef’s coral has died, and the mortality rate in the middle is about 6 percent,” Professor Hughes said. Vibrant color has returned to that coral, and the reef there is in good condition, he added. “But in the north, mortality rates are very high, and in some places where coral has survived but it has weakened, the per capita predation rate has gone through the roof,” he said. Masses of Drupella snails could be seen swarming around and eating the remaining healthy coral, he said. The bleaching was the third such event known to strike the reef, which extends along almost the entire eastern coast of Queensland and is listed as a natural World Heritage Site by the United Nations. Steven Miles, Queensland’s environment minister, called the bleaching a tragedy. “In the north we have a very high coral death rate,” Mr. Miles said at a news conference in Brisbane, the state capital. “The tragedy of this is that the northern sections were the sections least impacted by human impacts, and to see those sections,   of the northern section, dead is catastrophic. ” However, he said, the reef “is a very big system, and the mortality rate varies substantially. ” Mr. Miles and the federal environment minister, Josh Frydenberg, who also oversees energy policy in Australia, said Friday that 45 million Australian dollars, about $33. 6 million, would be provided to improve water quality and reduce sediment runoff. That announcement precedes a government report, due to be submitted to the United Nations by Thursday, on the health of the reef and the government’s management of threats to it. In May 2015 the United Nations stopped short of putting the reef on an “in danger” list, but it warned that climate change, water pollution and the effects of coastal development were all detrimental. “The government has a staunch commitment to conserving this amazing natural asset,” Mr. Frydenberg said in a written statement on Friday. Some scientists and environmental advocates have criticized the government’s efforts to protect the reef, saying they have fallen far short. They have also pointed to a seeming contradiction in the wishes of the Queensland government to protect the reef even as it pushes ahead with plans to develop the Carmichael coal mine, the country’s biggest, which lies less than 200 miles inland in the Galilee Basin. “Spending $45 million to improve water quality on the reef is like putting a   on a person who has cancer,” said William Steffen, a climate scientist at the Australian National University College of Medicine, Biology and Environment. As custodian of the reef, the government has an obligation to manage one of the world’s greatest natural wonders, Dr. Steffen said. “It is nonsense to think we can open up a new coal mine and think we are going to save coral reefs. ” This month, Australia ratified the Paris climate agreement to limit pollution to stop the Earth’s warming by more than 1. 5 to 2 degrees Celsius above preindustrial levels, or 2. 7 to 3. 6 degrees Fahrenheit. Environmentalists have unsuccessfully tried to block the development of the enormous mine. Other countries have pledged to reduce the use of fossil fuels, which contribute to global warming. Burning coal is a major cause of greenhouse gas emissions. Coral in the north was “cooked” as water temperatures rose about two degrees, Professor Hughes of James Cook University said. “That coral did not bleach and die slowly. ” Coral in slightly cooler waters bleached more slowly, expelling the tiny algae that give it its color. If the water then cooled quickly enough, the algae returned to recolonize the coral, which recovered. Cyclone Winston, which passed over Fiji in late February before dissipating as it hit the coast of Queensland, brought a change in water temperatures that helped preserve the coral at the south end of the reef. Mr. Frydenberg said Friday that about 22 percent of the entire reef’s coral had died after the bleaching event. But he added that coral cover had increased around 19 percent in the years leading up to it, a figure that Professor Hughes disputes. “The Great Barrier Reef is very resilient and quite strong,” Mr. Frydenberg said in an email on Tuesday. “The Australian and Queensland governments have a Reef 2050 plan, which will see $2 billion invested over the next decade in order to improve the health of the reef. ” Greg Torda, a coral researcher at James Cook University, said the biodiversity of the reef had been severely compromised in some regions because flat, or tabletop, and branching corals had died. These corals provide structure for small fish to hide from predators. “Bigger boulder corals, some hundreds of years old, provide light and shade for fish in reef habitats,” Dr. Torda said. “Reefs are structurally very complex, and all shapes on the reef provide important diversity. ” Reefs that are damaged tend to flatten out, losing habitat and then species diversity over decades. “We will have a reef in 30 years’ time, but the species along the reef are already shifting,” Professor Hughes said. “And we are already seeing less diversity. ”'"}, "time": 1742561960.9631703}