{"duration": 0.08931684494018555, "input_args": {"text": "'Leaked Audio Of Hillary Clinton Proposing ‘Rigging Election’ Ξ [October 29, 2016] BLOG New Study Claims Life DOES Exist On Mars And It Was Found By The Viking Lander in 1976 posted by Eddie A new study published in the Journal Astrobiology suggests that the 1976 Viking (LR) experiment found evidence to support microbial life on the surface of Mars. Forty years ago, before we had any idea there was liquid water on Mars, and that the red planet was the closest thing to Earth within our solar system, the 1976 Viking (KR) experiment found conclusive evidence to support the existence of life on Mars, a new study claims. Strangely, forty years ago ‘traces of life’ on Mars were dismissed as an error, but scientists today beg to differ. The question whether or not Mars is inhabited has captured the interest and imagination of millions around the globe. In 1976, an experiment known as the Viking Labeled Released returned POSITIVE results for traces of LIFE on Mars. Both Viking Landers, which touched down over 6,000 kilometers apart returned ver similar results which led many researchers to conclude Martian life had been detected. However, as skeptics, as we are in our nature, the discovery was dismissed and labeled as non-biological. Soil material that supports this explanation remained a mystery. Now forty years after the Viking Labeled Released experiment, and with a new database of fresh knowledge; water on the surface in liquid form, complex organic molecules and METHANE on Mars, experts around the globe indicate we cannot RULE OUT the possibility there is life on the surface of Mars. Astrobiologists argue that there is enough evidence to support the theory Mars is inhabited. A recently published article in the Journal Astrobiology has researchers from Arizona State University, Tempe, and the National Institutes of Health, Bethesda discussing the idea there is life on Mars. Experts argue that evidence is ‘consistent with a biological explanation,’ which means that it is very probable that some sort of microorganisms on Mars managed to adapt and evolve enough to become resistant to the harsh and dangerous environmental conditions that rule on the surface of the red planet. What experts did was dig into the LR experiments from the 1976 Viking Labeled Release and evaluate the ‘non-biological hypothesis. In the LR tests, researchers subjected samples from Martian soil from both lenders to nutrient injection, pre-heating and were left to ‘lay it off’ in a dark room for nearly two months. Researchers found that there were similarities to responses seen in terrestrial soil, including data from samples collected in California, Alaska, and Antarctica. The authors of the study wrote: “Each of these characteristics is reminiscent of responses by a compendium of terrestrial microorganism species, including the initial positive responses, the 160C and 50C heat controls, the reabsorption of evolved gas upon second injection of nutrient, and death from isolated long-term storage.” Since Mars has been the subject of debate for over half a century, numerous explanations and theories have been proposed to address certain discoveries. Researchers had to consider all possibilities, including those which suggested that the results obtained from the LR experiments were ‘most likely caused by a non-biological soil oxidant.’ However, no such oxidation, that can satisfy all of the discoveries has ever been found, and experts didn’t perform any further metabolic experiments on the surface of Mars. All of this could change in the near future as experts warn we must adequately prepare for a manned mission to the surface of the red planet. Since such missions are obviously inevitable, it is imperative for health, safety, and biology to explain the results the Viking landers came across in 1976. The authors write in the study: “Plans for any Mars sample return mission should also take into account that such a sample may contain viable, even if dormant, alien life.” “We cannot rule out the biological explanation. This has implications for plans for sample return from Mars and future human missions.” Source:'"}, "time": 1742562081.8481388}