{"duration": 0.24066948890686035, "input_args": {"text": "'BATON ROUGE, La.  —   He joined the Marines, served in Iraq and earned a Good Conduct Medal. He was an entrepreneur, a   author, a nutrition and fitness counselor, a proponent of the American gospel of  . He considered himself a lifestyle coach, even though he had failed in marriage, neglected to pay his taxes and was, at one point, living on $500 per month. He had also embarked on a spiritual quest to find his roots as a black man, traveling around Africa for two years. But Gavin Long’s life also became a web of paranoid ideas, a professed allegiance to an antigovernment “sovereign citizen” group and a belief that bloodshed was a better tool than peaceful protest in the fight against oppression. On Sunday, Mr. Long died in a parking lot just off a commercial street here in a shootout with the police. It was his 29th birthday. He killed three law enforcement officers and wounded three others. On Monday, law enforcement officials said Mr. Long had targeted officers, though his motives otherwise remained murky. Mr. Long had been a resident of Kansas City, Mo. and it is unclear what he was doing in Baton Rouge, though a video that appears to have been posted by him shows him in the Louisiana capital discussing the July 5 fatal police shooting of a fellow   man, Alton B. Sterling, here. Though the police here have released little information about Mr. Long, a deeper portrait is beginning to emerge, based on a large trail left online. Many of these digital bread crumbs  —   web posts, YouTube videos and podcasts  —   are tied to Mr. Long’s given name, or some version of a new name, Cosmo Ausar Setepenra, which he filed court documents in Missouri to adopt in May 2015. (He never petitioned the court, so the name change was not legally binding, officials said.) Some of these posts and videos included biographical and personal information that aligned with the information released by the authorities. In an interview with a podcast host in March, Mr. Long identified himself as a member of the online community of   targeted individuals, people who believe they are being harassed with   weapons and by armies of stalkers. And in one YouTube video, he discusses the killings of   men at the hands of police officers, including the death of Mr. Sterling, and advocates a bloody response instead of the protests that followed the deaths. “One hundred percent of revolutions, of victims fighting their oppressors,” Mr. Long said, “have been successful through fighting back, through bloodshed. Zero have been successful just over simply protesting. ” “You’ve got to stand on your rights, just like George Washington did, just like the other white rebels they celebrate and salute did,” he added. “That’s what Nat Turner did. That’s what Malcolm did. ” In Baton Rouge on Monday, the crime scene along Airline Highway was returning to normal. Bullet holes could be seen in a wall of the Hair Crown Beauty Supply store, where the shooting took place. The city had begun the process of mourning the police officers Mr. Long gunned down  —   including Montrell Jackson, 32, an   and   veteran of the Baton Rouge Police Department, who left behind a wife and son. On a podcast posted on iTunes and dated April, the speaker, who gives his name as Cosmo, gives a sketch of his life story. He says he grew up in Kansas City, and was a   student until about middle school, when he became fat and started getting C’s. As a child, he was something of a hustler who made extra money by making loans and charging interest. “Say if I loaned out money to my family, even to my mother, I would make her pay me back, with interest,” he says. “If I loaned $20, I would make you pay me back $5 on Friday. ” He says he lost significant weight in high school, bought his first car at age 16 and joined the Marines. Mr. Long’s military records show he served from 2005 to 2010, including a   deployment in Iraq. He was a sergeant and a data network specialist who earned several awards, including one for good conduct. He was also assigned to Okinawa, Japan, and several locations in Southern California. He attended Central Texas College at its Marine Corps Air Station Miramar site in San Diego and via distance education, earning an associate of arts degree. In 2011, court records show, he had an uncontested divorce from a woman named Aireyona Osha Hill. They listed that they had no children or assets and that Mr. Long earned $500 a month. Around this time, Mr. Long befriended a Kansas City schoolteacher who wished to remain anonymous because of the heinous nature of the shootings. The teacher said Mr. Long had taken interest in the Occupy Wall Street movement and   culture, and sympathized with the views of the villain Bane, from the 2012 Batman film “The Dark Knight Rises”  —   particularly Bane’s vigilantism against corruption. But the man the teacher knew never spoke about violent solutions to the real world’s problems. “I’m surprised he took it as far as he did,” the teacher said Monday. “It doesn’t surprise me so much as he had an agenda against the government. He’d always talk about how the government was corrupt. ” By 2012, Mr. Long had moved  —   briefly, apparently  —   to Tuscaloosa, Ala. where he spent one semester at the University of Alabama. He majored in business. He made the dean’s list. The University of Alabama police had no interactions with him during his time there. Mike Mansur, a spokesman for the Jackson County prosecutor’s office, which covers most of Kansas City, said his office also had no record of contact with Mr. Long. He also attended Clark Atlanta University during the   school year, and was in good academic standing, a university spokeswoman said. Although he claimed to be on the dean’s list there, he said he had dropped out, sold his two cars, gave away his possessions and traveled to Africa. Mr. Long appeared to be obsessed with the idea of   for himself and for others, and he embraced more esoteric means of achieving those goals. While traveling to Burkina Faso, Egypt, Ethiopia, Ghana, Kenya, Rwanda, Tanzania and Uganda, he said, he wrote three books, covering topics like “holistic detoxification for health,   and success” the “ancient esoteric secrets of the Pineal Gland” and the “124 Universal Laws and their use in the Laws of the Cosmos. ” In 2015, Mr. Long filed the petition to change his name. In his statement of intent, he said he was a member of an “indigenous society” called the United Washitaw De Dugdahmoundyah Mu’ur nation. It was apparently a reference to the Empire Washitaw De Dugdahmoundyah. On its website, the group says it is “a multicultural, highly spiritual nation of aboriginal, indigenous Americans. ” The group is largely   and subscribes to a “sovereign citizen” ideology holding that members are “no longer beholden to any form of government,” said Ryan Lenz, a senior writer for the Southern Poverty Law Center, which tracks extremist groups. On Monday morning, a man who answered a phone number on the website and said he was a leader of the group, Fredrix Joe Washington, said he had never heard of Mr. Long. “We are about peace  —   and especially not about going out and killing some police officers,” said Mr. Washington, 71. This year, court records show, a case was filed against Mr. Long for not paying his local earnings tax. Papers in that case were served on his address last month, and his mother accepted them, according to court records. Six days later, the tax case was dismissed. In many of his podcasts, Mr. Long expounds at length on dating and   tips for men, arguing that they must display the characteristics of an “alpha” male. But a number of his other online offerings discuss the historical oppression of minorities, and America’s current racial problems. In a recent email he sent out to those interested in his ideas, he listed numerous instances of massacres of   people. On July 8, Lance Scurvin, a podcast host in Orlando, Fla. posted a note from Mr. Long on his Facebook page that seemed to suggest that Mr. Long was feeling paranoid about his safety. Mr. Scurvin, who is known for lending a sympathetic ear to   guests, had interviewed Mr. Long in the past. “I just want everyone to know that if anything may happen to me or with me, I am NOT affiliated with anybody, any group, nationality, association, religion, corporation, business, etc. ” the note said. Mr. Long traveled to Dallas after the killing of five police officers at a demonstration there on July 7. Chanattra Long, who is not related to Mr. Long, said he had come into her shop, the His and Hers Barber Shop, two days after that shooting and passed out copies of his book. “He pulled out a wad of money and said: ‘You think this is something? This is nothing,’” she recalled. She said he had spoken of being in Africa and of being able to speak five languages. She was startled at his boldness and assertiveness. She had never seen him before and had no idea why he entered her shop that day. “I could tell he wasn’t right, his demeanor, his aggressiveness,” she said. Still, Mr. Long made no mention of attacking police, she said. One of Mr. Long’s last videos, posted to YouTube but taken down as of Monday, shows him driving around Baton Rouge. He approaches a number of   strangers apparently, and doles out stray nuggets of advice and wisdom, deploying the salty language of the street. He refers to himself as a life coach, a freedom strategist, a real estate entrepreneur, an author, a teacher and a motivational speaker. And he tells them about his book. “I want my people to succeed,” he says at one point. Later, he refers to “Arabs” and “Indians” who do not care about people, ostensibly   except when the latter give them their money. At one point he uses the word “cracker,” apparently in reference to whites. He also makes a passing reference to the shooting of Mr. Sterling. “It’s two parts to freedom, bruh,” he says. “Knowing your rights and standing on your rights. They know we know our rights. ” But how many black people, he asked, stand on their rights? “And if you not standing on your rights then you have no rights. ”'"}, "time": 1742564411.0816453}