{"duration": 0.0889124870300293, "input_args": {"text": "'Drivers in New Jersey will be able to request vanity license plates that reference their belief in atheism after the state’s Motor Vehicle Commission settled a lawsuit this month filed by a woman whose request for a license plate that said “8THEIST” was rejected almost three years ago. Shannon Morgan, a resident of Leesburg, N. J. applied for the license plate in November 2013 but was told her application had been denied because the plate “may carry connotations offensive to good taste and decency,” according to court papers posted online last week. After she received that rejection, Ms. Morgan used the state’s online application form to apply for a plate that said “BAPTIST” and was quickly approved, said Richard B. Katskee, the legal director for Americans United for Separation of Church and State, an advocacy group in Washington that acted as her legal counsel. It sued the commission in April 2014. “She rightly realized that it was a   case of religious discrimination against atheists and nonbelievers,” Mr. Katskee said. The Motor Vehicle Commission rejects that characterization. Mairin Bellack, a spokeswoman for the commission, said the rejection of Ms. Morgan’s initial application was an “oversight. ” “Yes, there was an initial denial, but as soon as it was brought to our attention it was rectified immediately,” Ms. Bellack said. “She has the right to apply for the plate, and the plate is available to anyone, including this individual. ” Under the terms of the settlement agreement, which was dated Aug. 4 but not announced until last Friday, Ms. Morgan will receive the license plate she requested in 2013 once she reapplies and sends in the usual application fee of $50. The commission will also pay $75, 000 for her legal fees. In a statement, Barry W. Lynn, the executive director for Americans United for Separation of Church and State, said Ms. Morgan wanted the state “to stop disparaging her nonbelief and cease treating her like a   citizen. ” “The lesson of this case is simple: The government should treat believers and nonbelievers equally,” Mr. Lynn said. Ms. Morgan said she was pleased with the settlement but also alarmed by online critics who threatened to vandalize her car if they happened to see her now   license plate. “I am almost hesitant to display my tag,” she said. “I cannot wrap my brain around the thought that anyone would vandalize a vehicle simply because they do not share the driver’s belief system. ” Atheist drivers will not be the only ones to benefit from the settlement. The Motor Vehicle Commission also agreed to honor license plate applications that contained language related to atheism, feminism or L. G. B. T. people, including phrases like “EQUALITY,” “LGBTQ,” “4WOMEN” and “SECULAR. ” Mr. Katskee said Ms. Morgan and her legal team “made up the list with an eye toward things she might want in the future and that were otherwise at risk of having the same sort of discrimination. ” Ms. Bellack, the spokeswoman for the commission, said it had issued   license plates in the past. That offered little relief to Ms. Morgan’s lawyer, however, who said her legal team pursued a lawsuit because it was concerned the commission might reject future license plate applications its employees found distasteful. Ms. Morgan’s application was the second instance in less than two years that the commission had rejected an atheist license plate, Mr. Katskee said. The first was when David Silverman, the president of an organization called American Atheists, applied for a license plate that said “ATHE1ST” in 2013. The commission rejected his application because it was deemed “offensive,” Mr. Silverman said, but he appealed the decision in writing and the commission reversed course two days later. “The issue is not that I was able to get my plate, the problem was that the system discriminated against me and made me appeal,” Mr. Silverman said. He added: “Atheism is not a dirty word. It’s a great word, in fact. ”'"}, "time": 1742561817.0789328}