{"duration": 0.11044025421142578, "input_args": {"text": "'JERUSALEM  —   Israel’s   debate over Jewish settlement in the West Bank reignited on Sunday with a fierce exchange between the government and a human rights organization that touched on broader arguments over definitions of patriotism and the very character of the country. The latest   of accusations began after Prime Minister Benjamin Netanyahu announced late Saturday that he would push for legislation to bar Israelis from volunteering for national service with B’Tselem, an organization that focuses on allegations of human rights violations against Palestinians in   territories. On Friday, Hagai   the executive director of B’Tselem, addressed a special meeting of the United Nations Security Council devoted to a discussion titled “The Settlements as the Obstacle to Peace and the   Solution,” referring to the internationally endorsed goal of establishing a Palestinian state alongside Israel. The session was initiated by the Palestinians and requested by five countries, including Egypt, a regional ally with which Israel signed a peace treaty in the late 1970s. Most of the world considers Israeli settlement construction in the West Bank and East Jerusalem, territories that were conquered from Jordan in the 1967 war, to be a violation of international law. The Palestinians demand those areas as the heart of a future independent state, and continued Israeli building there has been a constant source of tension between Israel and the United States. Mr. Netanyahu’s pronouncement was largely symbolic: Only three volunteers from a program for    exempted from compulsory military service on ideological, religious, health or other grounds have applied to perform national service at B’Tselem in the last seven years. Amit Gilutz, a spokesman for B’Tselem, said no other volunteers were in the pipeline. He described Mr. Netanyahu’s ban as “spin” and “a distraction from the actual issues. ” Yet it underscores the rawness of the political divide in Israel over the fate of the territories it seized nearly 50 years ago, the work of nongovernmental organizations that oppose the occupation, and the wedge that Jewish settlement there drives between Israel and the rest of the world. “Anything short of decisive international action will achieve nothing but ushering in the second half of the first century of the occupation,” Mr.   told the Security Council. Living under Israeli military rule in the West Bank, he said, “mostly means invisible, bureaucratic, daily violence. ” Israel officially considers the West Bank disputed, not occupied, and it annexed East Jerusalem in a move that was never internationally recognized. Mr. Netanyahu denounced B’Tselem and Americans for Peace Now, a sister organization of the leftist Israeli Peace Now group, on Facebook. He said they had “joined the chorus of besmirching Israel” and had repeated “the mendacious claim that ‘the occupation and settlements’ are the cause” of the   conflict. He added, “The truth is that the Palestinians have been attacking Israel for 50 years, since before a single settlement existed. ” He described B’Tselem and similar organizations as “ephemeral and delusional. ”   Jerbi, the director of Israel’s National Civilian Service authority, told Israel Radio that B’Tselem had “crossed a red line” by addressing the Security Council meeting and had carried out “an act of betrayal. ” Zehava Galon, a former executive director of B’Tselem who now leads the   Meretz party, which sits in opposition to Israel’s   government, wrote on Twitter on Sunday that Israel “has needed to have the discussion about the settlements and the occupation for a very long time, because of the price the Palestinians pay but also because of the price paid by Israelis. ” Responding to what it called Mr. Netanyahu’s “slander,” B’Tselem said in a statement, “We insist on saying loud and clear: The occupation is not Israel, and resisting it is not  . ” Mr. Gilutz, B’Tselem’s spokesman, said that just as his organization did not take a position on the nature of the solution of the conflict, it was also not specifying what kind of international action should be taken. Saeb Erekat, the secretary general of the Palestine Liberation Organization, said in a recent statement that “the international community, including the United States, must completely and unequivocally boycott Israeli settlements. ” The Israeli government has long questioned the patriotism of   groups that oppose its policies in the West Bank, and in July, the Knesset approved legislation requiring nongovernmental organizations that receive more than half of their financing from foreign governments to disclose that information in their publications, advertising and meetings with public officials. The   NGO law, which supporters said was intended to increase transparency, applies mainly to leftist groups critical of Israel’s policy toward the Palestinians, since rightist groups mostly receive private funding from abroad. The latest quarrel over B’Tselem arose after the Obama administration condemned the Israeli government in uncommonly harsh terms for approving plans to create a new Jewish settlement, three weeks after Israel signed a lucrative military aid package with the United States. The new housing was meant to accommodate settlers who are supposed to be evacuated against their will from the illegal settlement outpost of Amona by Dec. 25, by an order of Israel’s Supreme Court. After years of delays and legal wrangling, the pending struggle over Amona has put Mr. Netanyahu’s government in a bind, and it has decided to petition the Supreme Court to put off the evacuation for an additional six months.'"}, "time": 1742562377.451662}