{"duration": 0.05700063705444336, "input_args": {"text": "'The Pioneer Cabin, a famous giant sequoia tree that visitors could once drive through, toppled on Sunday after succumbing to the winter storms that hit Northern California this past weekend. [The tree, located in the Calaveras Big Trees State Park, was once celebrated by “Weird Al” Yankovic in his song, “The Biggest Ball Of Twine In Minnesota. ” The song lyric referring to Pioneer Cabin goes: “And a place where you can drive through the middle of a tree. ”  The tunnel had been carved into the tree’s base 137 years ago. To residents and people who also had the chance to visit the California landmark, the loss was heartily felt. “We lost an old friend today,” Calaveras County resident Jim Allday wrote on his Facebook page.  According to the San Francisco Chronicle, Allday is volunteer at the park and was working there Sunday when the tree fell. He reportedly said it went down about 2 p. m. and “shattered” on impact. The Calaveras Big Trees Association posted about the loss on its Facebook page. “The Pioneer Cabin tree has fallen! This iconic and still living tree  —   the tunnel tree  —   enchanted many visitors. The storm was just too much for it,” they wrote.  Many reactions could be found on social media. Some expressed sadness that they will never be able to check that visit off their bucket list: So sad. The storm destroyed this landmark tree that I had planned to see this year. #PioneerCabinTree #calaveras pic. twitter.   —   Kelley Scarsbrook (@empoweringmoms) January 9, 2017,  Others shared memories of the time they were able to be part of natural history: RIP #PioneerCabinTree, nonetheless families are forever. pic. twitter.   —   Heather J Patchell (@hjpatchell) January 9, 2017,  Wow! This is us on   . Guess we shouldn’t be cutting holes in trees @CAStateParks #PioneerCabin #CalaverasBigTrees @BradFriederichs pic. twitter.   —   Ian J Horwood (@ianjhorwood) January 9, 2017,  Sad to hear this awesome tree was taken out by the west coast storm. #PioneerCabinTree #calaverascounty pic. twitter.   —   they call me enrique (@ERock757) January 9, 2017,  The Pioneer Cabin’s demise garnered international attention: The Los Angeles Times added that “John Muir, the famous naturalist, once described the forest that is protected by Calaveras Big Trees State Park: ‘A flowering glade in the very heart of the woods, forming a fine center for the student, and a delicious resting place for the weary. ’” Follow Adelle Nazarian on Twitter and Periscope @AdelleNaz'"}, "time": 1742562762.9690728}