{"duration": 0.12987303733825684, "input_args": {"text": "'  “People Power” Versus Manipulation of the Masses “People Power” Versus Manipulation of the Masses November 7, 2016, 9:37 am by Cliff Kincaid Leave a Comment 0 \\nBy: Cliff Kincaid | Accuracy in Media \\nOn November 8, the election will come down to Donald J. Trump’s “people power,” a largely spontaneous uprising of the “silent majority,” against Hillary Clinton’s scientific manipulation of the electorate, using personal data to identify and provoke people to go to the polls. In this effort, Mrs. Clinton has the support of the giant company Google and the president of its parent company, Eric Schmidt. Experts say the effort resembles how the Communist Chinese dictatorship monitors people and modifies their behavior through media manipulation and censorship of the Web. \\nAs Trump suggests, the election process seems “rigged,” and the evidence has come in the form of another John Podesta email. \\nOne of the internal Clinton campaign emails disclosed by WikiLeaks shows that Schmidt, chairman of the Google parent company, offered a detailed campaign plan for the Clinton campaign. The April 15, 2014, message, addressed to Clinton aide Cheryl Mills, said, “I have put together my thoughts on the campaign ideas and I have scheduled some meetings in the next few weeks for veterans of the campaign to tell me how to make these ideas better.” The details included “Size, Structure and Timing” and a campaign budget of $1.5 billion, with more than “5000 paid employees and million(s) of volunteers.” The Schmidt email was sent along to several key Clinton people, including campaign chairman John Podesta. \\nThe plan examines how information is received and reviewed by voters, and what provokes them. Indeed, in a section titled “The Voter,” Schmidt says, “Key is the development of a single record for a voter that aggregates all that is known about them. In 2016 smart phones will be used to identify, meet, and update profiles on the voter.” Schmidt goes on to say, “For each voter, a score is computed ranking probability of the right vote. Analytics can model demographics, social factors and many other attributes of the needed voters.” \\nPatrick Wood, editor of Technocracy News, comments that Schmidt’s scoring idea “is just like China’s social scoring of citizens to see who is for them and who is against them.” \\nOn one level, this means that search engine results are manipulated. In his evaluation of the Schmidt email, Michael Cantrell comments , “For some time now, people have wondered if Google, the world’s largest search engine, might be a tad bit slanted when it comes to politics, favoring left-wing candidates over conservatives in how search results are displayed. Well, it seems those suspicions may not be so far-fetched after all.” \\nEarlier this year, in a column carried by Accuracy in Media, Seton Motley documented how Google was designing its search engine to maneuver people away from the issue of Hillary Clinton’s health problems. \\nIt’s a fact of life that in this era of access to many different sources of information, some people go to the Google search engine and rely on the first item that pops up. That’s how I got banned (temporarily) from the campus of the State University of New York at New Paltz. A feminist professor used Google to search my name and passed around derogatory information from the first source on the search engine page—the Southern Poverty Law Center. She then passed around the information, creating a stink that caused the campus administration to cancel the debate I was scheduled to participate in. \\nA new book, Islamic Jihad, Cultural Marxism and the Transformation of the West , examines the role of Google as a new media “gatekeeper” that determines how people see the reality of the world. The author, William Mayer of PipeLineNews.org , examines how Google produces search engine results on the subject of Islamic terrorism that play down criminal activities of leading Jihadists. Mayer says the results can be confusing unless the search terms are assembled with scrupulous precision, “a difficult task when one isn’t exactly sure in advance the extent of the associations being pursued.” \\nIn his excellent book, Mayer documents in detail the “leftist/Obama/Media merger” that played a significant role in Obama’s 2012 victory and figures prominently in Hillary Clinton’s plan for victory on Tuesday. \\nMayer comments, “…if we think of the Internet as the largest depository of information ever to be created, it assumes in many sense the role of the book of common wisdom. When the universal storehouse of information obfuscates and hides knowledge it becomes censorious, preventing or at least stifling access to non-ideologically approved ideas and information.” \\nWhen Barack Obama campaigns against Trump by citing the KKK, you can rest assured this has been determined by analysts in the Hillary campaign to be at least somewhat effective in scaring blacks. Getting blacks to vote against Trump is a part of what they hope will be their winning strategy. Similarly, when Hillary Clinton campaigns with a profane rapper named Jay Z, the calculation has been made by some brain in the campaign structure that using such a spectacle will inspire other blacks to turn out for the former secretary of state on Election Day. Hillary hopes that the rapper’s popularity will somehow rub off on her. \\nThese two campaign events are more evidence of how truly “scientific” the progressive movement has become. People are perceived by the Clinton campaign as subjects to be manipulated. \\nEven with the use of these scientific techniques, victory is not assured for the “progressive” forces. That is why reports of vote fraud are mounting as Obama sounds the alarm about the KKK. For Trump to win, the “silent majority” will have to be a real majority with millions of votes to spare, surpassing the artificially created “progressive” bloc bolstered by fraudulent votes and created by an emerging technocratic dictatorship of access to information. \\nThe “media monopoly” that the left used to rail against is now controlled by them. Cliff Kincaid \\nCliff Kincaid is the Director of the AIM Center for Investigative Journalism and can be contacted at cliff.kincaid@aim.org. View   Cliff Kincaid . 0'"}, "time": 1742562102.3352845}