{"duration": 0.0835111141204834, "input_args": {"text": "'WASHINGTON  —   President Trump is a man seriously susceptible to snagging himself in the nettles of obsession. In the last three weeks, no compulsion has so consumed his psyche, and his Twitter account, as the deeply held and shallowly sourced belief that President Barack Obama tapped his phones. So why can’t he just let go? First, aides say that Mr. Trump, who often says, “I’m, like, a really smart person” in public, is driven by a need to prove his legitimacy as president to the many critics who deem him an unworthy victor forever undercut by Hillary Clinton’s    win in the popular vote. “The Russia investigation is being used by his political opponents to delegitimize his entire presidency and to delegitimize his agenda,” said Sam Nunberg, a longtime Trump political adviser who remains close with West Wing aides. “He will fight back, and he does it better than anybody in this White House. And that includes all those Republican National Committee guys he hired to defend him. ” Second, fighting back  —   in this case, against Mr. Obama, the F. B. I. director and members of his own party who say his claim about phone taps is false  —   is an important part of the president’s  . The two most influential role models in Mr. Trump’s youth were men who preached the twin philosophies of relentless   and the waging of total war against anyone perceived as a threat. Mr. Trump, according to one longtime adviser, is perpetually playing a soundtrack in his head consisting of advice from his father, Fred, a   real estate developer who laid the weight of the family’s success on his son’s shoulders. Mr. Trump’s other mentor was the caustic and conniving   lawyer Roy Cohn, who counseled Mr. Trump never to give in or concede error. Mr. Trump’s fixation on Mr. Obama and an F. B. I. investigation into Russian influence in the 2016 election echoes his actions in New York decades ago, when he engaged in bitter personal battles with the mayor, Edward I. Koch, and the city fathers of Atlantic City. The battles were often to the detriment of Mr. Trump’s real estate and gambling businesses, according to Tim O’Brien, author of “TrumpNation,” a 2005 biography that documented his early years.’ ”“I don’t think there’s anything new here in his behavior,’’ said Mr. O’Brien, now the executive editor of Bloomberg View. “He’s been doing this kind of thing for the last 45 years. ’’” ’“He’s deeply, deeply insecure about how he’s perceived in the world, about whether or not he’s competent and deserves what he’s gotten,” he added. “There’s an unquenchable thirst for validation and love. That’s why he can never stay quiet, even when it would be wise strategically or emotionally to hold back. ” During the 2016 campaign, Mr. Trump fixated on almost every slight, especially in the news media, and singled out reporters for criticism at his rallies. A day after he was sworn in as the 45th president, he woke up furious that websites were running    pictures showing that his inaugural crowd was demonstrably smaller than Mr. Obama’s 2009 throng. He instructed his press secretary, Sean Spicer, to convene the press in the White House for a   over “biased” reporting on crowd size, which delighted the new president but struck nearly everyone else as a bizarre overreaction. Mr. Trump’s   Twitter message on March 4 amounted to a   declaration that he would be no one’s victim. “How low has President Obama gone to tapp my phones during the very sacred election process,” the president wrote in an unspellchecked outburst, one of several that morning. “This is  . Bad (or sick) guy!” Toughness, more than any other attribute, is what Mr. Trump has sought to project during his short and successful political career  —   and he believes his behavior makes him look tougher, no matter what the press thinks. As a presidential candidate, he wanted to look dour, and vetoed any campaign imagery that so much as hinted at weakness, aides said. Which is why every   snapshot  —   down to the   scowl attached to his Twitter account  —   features a   sourpuss. “Like Churchill,” is what Mr. Trump would tell staffers when asked what look he was going for. Third, diversion is an important motive. Mr. Trump was able to change the subject by attacking Mr. Obama and floating unsubstantiated theories. At the time of his   tweetstorm, he was trying to divert attention from a fresh embarrassment: Attorney General Jeff Sessions had failed to disclose, during confirmation hearings, that he had had contacts with Russia’s ambassador to the United States. “With almost every barbed, unscripted tweet, he deletes some story his administration wants to tell,” said David Axelrod, one of Mr. Obama’s top advisers. “He reacts to every affront, real or imagined, in Pavlovian fashion. He beats every perceived slight to death and, even when he’s won the point, continues beating. ” Finally, Mr. Trump hasn’t let up because no one can stop him. Within the White House, aides describe a nearly paralytic inability to tell Mr. Trump that he has erred or gone too far on Twitter. On the day Mr. Trump fired off his message about Mr. Obama “tapping” his phones, his chief of staff, Reince Priebus  —   initially seen by some establishment Republicans as the best bulwark against Mr. Trump’s   behavior  —   told people the White House was convinced that there was something there. The problem is that the two advisers who aren’t related to him but are powerful enough to try to change Mr. Trump’s behavior are mostly disinclined to do so. His chief strategist, Stephen K. Bannon, a rhetorical bomb thrower himself, counseled Mr. Trump to moderate his behavior at the end of the campaign  —   but he remains the West Wing adviser who most closely shares the president’s views on surveillance. One of the only other people whom Mr. Trump views as a peer is his top economic adviser, Gary Cohn, but he prefers to spend his capital on economic issues and climate change. In a recent meeting in the Oval Office, Mr. Cohn was speaking when Mr. Trump interrupted him. “Let me finish,’’ Mr. Cohn interjected, according to a person with knowledge of the interaction. Mr. Trump, unaccustomed to ceding the floor, let him make his point.'"}, "time": 1742628407.3283036}