{"duration": 0.27529168128967285, "input_args": {"text": "'By Gordon Duff, Senior Editor on October 30, 2016 Constitutional Crisis: FBI used prohibited FISA domestic terror warrant in Clinton-Weiner email search …by Gordon Duff, with Ian Greenhalgh , Editors – Veterans Today \\nIn a surprise announcement, the Department of Justice just admitted that there was no legal authorization in place to access email accounts of Hillary Clinton aide, Huma Abedin, estranged wife of accused sex offender former Congressman Anthony Weiner. \\nThe government admitted that no warrant had been requested and that discussions to seek a warrant had not yet begun, making the letter FBI Director James Comey wrote to Congress on Friday a potentially criminal act, if it can be proven that Comey was aware of this fact and of the actions of his subordinates in “planting” Clinton emails on Weiner’s laptop.[14] \\n(CNN)Justice Department and FBI officials are working to secure approval that would allow the FBI to conduct a full search of top Hillary Clinton aide Huma Abedin’s newly discovered emails, sources familiar with the discussions told CNN. \\nGovernment lawyers haven’t yet approached Abedin’s lawyers to seek an agreement to conduct the search. Sources earlier told CNN that those discussions had begun, but the law enforcement officials now say they have not.[14] \\nFBI Director James Comey is under assault for what is being perceived as more than simply partisan behavior. Former presidential advisor, Lanny Davis writes for The Hill: \\n“Comey as FBI director — an investigative agency, not a prosecution agency — (does not) have any authority to send a report to Congress in the middle of an investigation about the past or present subject of an investigation. He appears to be in violation of the limits on his authority as FBI director by disclosing investigation information — or possible investigation information — directly to Congress with obtaining permission from the attorney general or someone else delegated authority by her. His decision to reveal the results of an ongoing investigation, before a published criminal indictment, violates due process principles and pre-indictment secrecy rules and guidelines of the Justice Department.”[16] \\nThrough court challenges to FBI search tactics under FISA and other counter-terror legislation, accessing “cloud” based emails and either representing them as “found” in a warranted search of a hard drive or in “syncing” a computer to place emails on a drive under a warranted search, clear prohibitions have been established.[Addendum I] \\nIn this case, with no warrant in place at all, there are no possible interpretations of FBI actions that could be consistent with admissibility. \\nIn what has been seen by most a the long expected “October Surprise,” the highly controversial letter written by FBI Director James Comer, something more far reaching has developed, a constitutional crisis that may well exceed that of Watergate or even Iran/Contra. Like the Federal Reserve, the FBI itself lacks a clear constitutional authority. There is no mention of nor authorization given, in the constitution, for a national police force. In fact, the Constitution, in the 10th Amendment ratified in 1791 states: \\n“The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people.”[12] More often than not, this has been ignored, a “stepchild” of the Bill of Rights. Here, however, the FBI, created initially as the “sex police”[11], created to enforce the Mann Act[13], has assumed not only “powers not granted” under the constitution, but has exponentially expanded its reach, well beyond constitutional limitations on rights of privacy and against unreasonable search and seizure, assailed by laws like the Patriot Acts.” \\nBehind the current controversy, that of an FBI director being accused of interfering in an election and acting against policy, procedure and advice of the Attorney General, is something more. The FBI has crossed into the area of possible criminality, violating clear cut Federal Court restrictions, not only through an illegal search but by actually planting evidence and then channeling misleading information into the press with a clear intent to subvert constitutional authority. \\nAnother issue is the kind of language Comey has been using to mollify critics who have kept a flurry of investigations going and who have subjected him to hostile interrogation for endless hours in front of highly partisan committees. Colonel Jim Hanke (ret), former US attache to Israel and ranking NATO military intelligence planner commented on the nature of Comey’s assertions of Hillary’s classified emails: \\n“Take the text of any of the emails we have seen. Anything here could have been said in a press conference or on a television interview and, in those formats, would not have been considered classified. There would have been fallout, for sure, not from disclosing policy or in endangering operations, real issues that get high level classification. Hillary’s emails, were they made public, and there was reason to expect this might well happen, are revealing and reflect on her personal judgement and, at times, demonstrate a lack of grasp, particularly when it comes to Russia or Syria. These are issues of public confidence, not criminality nor are they areas of real security classification. \\nConversely, what we have seen Comey do may well rise to the level of something serious, certainly he undermines the FBI and attacks the American system of government. As to what his intent was or to what laws apply, this is not my area of expertise but I would like to think that criminal code could deal with this kind of threat.” \\nOne additional consideration to put into the mix is Wikileaks. During recent weeks while Wikileaks has released two dozen batches of emails, the Clinton campaign has mirrored earlier charges made against Wikileaks by former National Security Advisor Zbigniew Brzezinsky, that Wikileaks “sexes up” and even fabricates documents that are, according to Brzezinsky, when speaking to Judy Woodruff of National Public Radio, “seeded” into a virtual deluge of material. \\nThe FBI used FISA (Foreign Intelligence Surveillance Act) powers when it downloaded and “synced” Clinton emails into former Congressman Anthony Weiner’s computers, according to legal experts.[1,4,6,7] The FBI knowingly violated the law in applying terror statutes when they illegally expanded their search into Weiner’s computers and downloaded emails from a 3rd party account. With only days before an election, the term “October Surprise” has never been more applicable. \\nThe question people are asking is; “Why did Director Comey choose to ignore legal advice and, more importantly, was he aware that he was upsetting an American presidential election based on a pattern of criminal-level misconduct by his own agency?” \\nThe FBI lied when it claimed the it found Clinton emails when it searched Anthony Weiner’s computer. Sources now tell VT that the FBI in fact “synced” the email account of Weiner’s estranged wife, Huma, downloading the emails “from the cloud” and falsely claiming they were discovered as part of a legal search warrant. However, there is no case law supporting the expansion of such warrants to spouses or others whose email accounts may be accessible through devices but were not stored on hard drives and not by any stretch of the imagination, legally accessed under any possible search warrant tied to Weiner’s sexual indiscretions. \\nWhat did in fact happen here was planting of evidence, by the FBI, illegally accessing a “cloud based” email account not included in a search warrant and downloading to a hard drive that was included in a warrant. This is a common FBI/DHS practice used in terror investigations, making use of a single warrant to follow cloud accounts for multiple users. \\nIn an article in today’s Washington Post, the issue of how the FBI found emails that should not been on Weiner’s computer were brought to light. \\n“Top Hillary Clinton aide Huma Abedin has told people she is unsure how her emails could have ended up on a device she viewed as her husband’s computer, the seizure of which has reignited the Clinton email investigation, according to a person familiar with the investigation and civil litigation over the matter. \\nThe person, who would not discuss the case unless granted anonymity, said Abedin was not a regular user of the computer, and even when she agreed to turn over emails to the State Department for federal records purposes, her lawyers did not search it for materials, not believing any of her messages to be there. \\nThat could be a significant oversight if Abedin’s work messages were indeed on the computer of her estranged husband, former congressman Anthony Weiner, who is under investigation for allegedly exchanging lewd messages with a 15-year-old girl. So far, it is unclear what — if any — new, work-related messages were found by authorities. The person said the FBI had not contacted Abedin about its latest discovery, and she was unsure what the bureau had discovered.”[8] \\nThere is no evidence, of yet, that Director Comey was aware the “evidence” he took to congress was illegally planted on Weiner’s computer but Comey was aware of the practice. Typically, the FBI search warrants used can give access to cloud based emails as outlined below by FBI Special Agent James M. Cauthen: \\n“An alternative is for the investigator to search in the same manner as the user would—with the computer turned on and connected to the data. In this example, the investigator needs access to the subject’s computer with the relational database software and connection to the cloud. The investigator could consider combining two search warrants—one on the computer owner for the location being searched under Rule 41 and one on the cloud provider under §2703 for the content to which the computer is connected. \\nWith this approach, the investigator will need to understand how to operate database software and make queries. These queries must comply with the search warrant. The investigator must conduct the search carefully as actions taken on a live system will change the data on the computer. Using this method, it may be possible to obtain a single search warrant combining the provisions of Rule 41 and §2703; however, it should be noted that there is no case law yet on implementing this strategy.” [7] \\nIn light of the controversy over the handling of this issue by FBI Director Comey, an article in The New Yorker, dated October 28, 2016 cuts to the director’s state of mind. From that article: WASHINGTON ( The Borowitz Report )—James Comey, the embattled director of the Federal Bureau of Investigation, presided over a special ceremony on Friday evening to commend the brave F.B.I. agents who had to touch Anthony Weiner’s computer. In awarding the commendations to the agents, whom Comey called “the bravest men and women this country has to offer,” the F.B.I. director criticized the political uproar that he said had overshadowed “their selfless acts of heroism.” “These agents have performed far and beyond the call of duty,” a visibly angry Comey said. “I know we’re eleven days away from an election and tensions are running high, but we shouldn’t let that subtract in any way from what these brave agents did with their own hands.” “Who among us could look at ourselves in the mirror and say, ‘I have what it takes to touch Anthony Weiner’s computer ’?” Comey asked. “I know I sure as hell couldn’t.”[15] A common way to hide ones train in Washington is to wrap whatever the smell is “in a bloody flag” or to hand out medals for heroism. This is “deception 101” and Comey wasn’t in the least bit coy about using his agents, who may be steeped in ethical or even criminal complicity, in that same “bloody flag” theatrics. \\nThe Clinton/Weiner connection may well be an abuse of expanded counter-terrorism powers the FBI assumed during the Bush era. However, in 2008, these powers were curtailed by a Federal court decision. [Addendum I] From the New York Times, April 19, 2016: \\n“WASHINGTON — A federal judge has rejected a legal challenge to rules permitting F.B.I. agents, when working on domestic criminal cases, to search emails written by Americans that the government has intercepted without a warrant in the name of gathering foreign intelligence. \\nIn an 80-page opinion that was issued in November and remained classified until being made public on Tuesday, Judge Thomas F. Hogan, the chief judge of the Foreign Intelligence Surveillance Court, ruled that what critics call “backdoor searches” of messages by the F.B.I. comply with both the Constitution and the FISA Amendments Act. That 2008 statute legalized a form of the government’s once-secret warrantless surveillance program.”[9] \\nThere has been considerable controversy involving the FBI’s illegal expansion of search warrants in criminal cases. With the expanded powers under the Bush administration’s Foreign Intelligence Surveillance Act, covering the use of broad “single warrant” powers in domestic terrorism cases, the FBI has on numerous occasions misused FISA powers in criminal investigations. \\nThis has been brought before the Federal Courts in 2008 [Addendum I] and the FBI should well consider itself forewarned not to attempt to apply questionable expanded powers under FISA legislation intended to apply to terror threats. That FISA was applied here, knowing a court challenge would take far too long to correct the damage, in this case a “rigged” presidential election, as claimed by Clinton campaign advisor, John Podesta. References: \\n[1] Elena Kagan: Supreme Court Hasn’t “Gotten to” Email , CBS News, August 21, 2013. \\n[2] Josiah Dykstra, “Seizing Electronic Evidence from Cloud Computing Environments,” in Cybercrime and Cloud Forensics: Applications for Investigation Processes , ed. K. Ruan (Hershey, PA: IGI Global, 2013). \\n[3] Tony Sammes and Brian Jenkinson, Forensic Computing: A Practitioner’s Guide , (London, UK: Springer-Verlag, 2000). Forensics was developed on the idea of copying data from a hard disk drive that was turned off or dead. Live recovery involves changes to the contents of a computer’s storage space, 18 U.S.C. §2510(15). Therefore, it is essential that someone competent to give testimony performs it, showing that the continuity and integrity of the evidence has been preserved. \\n[4] U.S. Department of Justice, Computer Crime and Intellectual Property Section, Criminal Division, Searching and Seizing Computers and Obtaining Electronic Evidence in Criminal Investigations 3d ed., (Washington, D.C.: Office of Legal Education, Executive Office for United States Attorneys, 2009), 84. Although the courts have not directly addressed the matter, the language of Rule 41 combined with the Supreme Court’s interpretation of “property” may limit computer searches to data that physically resides in the district in which the warrant was issued. \\n[5] For legal purposes, there are two classes of cloud providers: those who provide “electronic communication services,” and those who provide “remote computing service.” See 18 U.S.C. §2510(15) and 18 U.S.C. §2711(2) respectively. \\n[6] United States v. Gorshkov , 2001 WL 1024026 (May 23, 2001). In this case, the defendants moved to suppress the evidence, but the motion was denied. Nonetheless, the investigator was charged with hacking by foreign authorities who requested that the investigator be extradited for trial. U.S. authorities have not complied.'"}, "time": 1742561999.3271155}