{"duration": 0.04977750778198242, "input_args": {"text": "'Senior figures across the Democratic Party would like Media Matters for America founder David Brock to step back from politics as he hurts the party’s cause, according to a report from The Daily Beast. [Brock, who founded the   watchdog Media Matters for America as well as Super PACs such as Correct the Record and American Bridge sees himself as a key figure in rebuilding the Democratic Party following Donald Trump’s ascent to the presidency.  Recently, Brock has pleaded for funding to help him build an   war room, which seeks to hold the the current administration accountable on a daily basis and, in his own words, “kick Trump’s ass. ” He aspires to make his Shareblue website “the Breitbart of the Left. ” However, according to multiple sources at The Daily Beast, many Democrats believe he damages the party and just wish he would go away. Talking to The Daily Beast, Bernie Sanders’s 2016 presidential campaign manager, Jeff Weaver, described Brock’s ability to improve the party’s electability as “nonexistent,” adding that “he does not have the kind of understanding of what kind of coalition you have to bring together to win national races. ” “I don’t think David Brock has been helpful to the party to date, and I don’t think he will be a big part of its future,”a former Clinton campaign official also told the news site, while another said that they “did not want to deal with Brock’s bullshit,” describing his   campaign efforts as “useless,” adding that “you might as well have thrown those [tens of] millions of dollars down a well, and then set the well on fire. ” A source close to The Daily Beast also said that while Brock had reached out to various Clinton campaign staff to join his “war room” effort, they all declined because “no one wants anything to do with him. ” Other former employees of Brock also said that he tends to “overstate his level of impact and importance,” adding that “that he cares less about progressive policies and moving the ball forward, and is actually more focused on stroking his ego. ” Brock’s main project, the   watchdog Media Matters for America group, was in 2012 exposed as attempting the wholesale destruction of conservative media. A leaked internal document showed that Brock’s organization hoped to “bring litigation against Fox News and its feeders. ” However, the organization now reportedly pivots its focus towards Breitbart, instead of FOX News. Another one of Brock’s organizations, Correct the Record, spent $1 million to hire online trolls to “correct” supporters of Sen. Bernie Sanders ( ) across social media. Defending his record, Brock told The Daily Beast that “people are free to question my motives, but it should be pretty clear by now that the groups that I’ve created are committed to a more progressive America.“ “I’m interested in building   organizational capacity to resist and oppose Donald Trump,” he continued. “I think that should be everybody’s goal on the left, to destroy Donald Trump, not to destroy each other. ” You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742563148.8531444}