{"duration": 0.04033517837524414, "input_args": {"text": "'On a chilly and rainy night, American living rooms became filled with a presidential debate that would go down in history as one of the most anticipated in modern times. and for all the wrong reasons. Every televised debate seemed to be more about optics than substance, more about this guy than that guy.\\nPresidential Debates: \\nSome may remember the Kennedy-Nixon debate and the aftermath over Nixon’s sweating on screen. There was the Bush-Dukakis optic of a towering George H.W. Bush over the diminutive Michael Dukakis. And few can forget the Benson-Quayle vice presidential debate and the, “You’re no John Kennedy” line.\\nFor some reason, the build-up to the Donald Trump, Hillary Clinton debate was different. Would Trump go off the rails and say some absolutely ridiculous claim that would doom his chances? Would Clinton’s health be an issue under the strain of the moment? And what of the moderator? Would Lester Holt come off a Clinton shill, as many had accused the mainstream media of being? Yes, this was a weird countdown to the Hustle at Hofstra.\\nDebate Results: In the end, this was more of a journeyman heavyweight than Ali-Frazier. Trump was the interrupting, aggrandizing, self-congratulatory man Americans have come to know – all style and no substance. Like Trump, Clinton did not break any new ground. She was still looking to win this election on the votes of women and minorities. Trump, still hoping to gather enough people, angry with the status quo, to sneak into the White House. Many saw nothing in the debate to swing them one way or the other.\\nThe debate showed people more than what candidate they should choose to elect, but it showed citizens a reflection of themselves, the American people. It showed citizens that they have collectively failed as a nation. Failed to preserve the republic, and failed to demand a system that would encourage the best administrators to run this country. Instead, Americans were saddled with two combatants that will result in a divisive president, no matter who wins. As the debate progressed, both participants hit on many good points that were missed due to their personalities.\\nThere were two points brought up, one by each. Clinton questioned why Trump would not release his tax returns. That is a problem. What is he hiding? The second point was made when Trump asked why her IT people would not testify before Congress about the email and servers. A legitimate question, considering her ties to the Clinton Foundation, as secretary of state.\\nSo in the end, the debate was not a dud but a lesson; a lesson to all Americans that the people have failed. Failed to control the corporations who poison the republic with wads of cash; failed to demand changes to the nominating process, so that citizens can choose among the best-of-the-best to run this country; and failed to pay attention, as the nation was co-opted from the people by crony capitalism.\\nYes, Americans have failed; they have failed the men and women in the mirror. It is time to remember John F. Kennedy’s words, “Ask not what your country can do for you, ask what you can do for your country.” For God sake, pay attention to the country.\\nOpinion by John Carmody\\n \\nPresidential Debate: commission telecast 9/26/16\\nImage Courtesy of ABC – Used With Permission    Hillary Clinton , Hustle at Hofstra , presidential debates , Trump'"}, "time": 1742561860.5086968}