{"duration": 0.02315545082092285, "input_args": {"text": "'Cancela un atentado en un avión porque le pasan a primera clase por error y cambia de idea sobre Occidente \"ESTO ES OTRA COSA\", HA DICHO AL VER SU ASIENTO Yihad \\nTras cambiar radicalmente de opinión sobre los “cerdos occidentales”, un terrorista islámico ha decidido cancelar el atentado en un avión que tenía planeado para esta misma mañana después de que un error en la asignación de asientos le haya permitido viajar en clase “Business” y disfrutar de un asiento de lujo y aperitivos gratuitos, según han informado fuentes de la aerolínea. “Era una pena desperdiciar todas esas cosas gratis por la yihad”, ha explicado el terrorista suicida. \\n“Han venido esas mujeres inmorales y me han dicho que pasara a primera clase y he pensado ‘bueno, ahí también puedo explotar en pleno vuelo’”, explica. Tras su experiencia en “Business”, ha decidido dejar que el avión aterrice plácidamente en su destino. “Hay cosas buenas en Occidente y algunos infieles son muy serviciales cuando vas en primera”. \\nEl terrorista se habría levantado en dirección a la cabina del avión con la idea de hacerse con el control del aparato cuando las azafatas han animado al pasaje de primera clase a sentarse para recibir la cena. “Pensé en dejar la yihad para después de la cena, ya que era gratis, pero luego sirvieron bebidas y más tarde una perra infiel me arropó para echar la siesta”, explica. \\n“Luego me puse a ver ‘Señor y señora Smith’ y pensé que Occidente no está tan mal”, admite. \\nEl terrorista llevaba más de siete años planeando un atentado suicida que hubiera acabado con la vida de más de 300 personas y era una pieza clave para la propaganda de su causa. “He pedido cacahuetes hasta diez veces y me los han traído sin preguntar”, se defiende. \\nSegún dice, la amabilidad de las “mujeres perras infieles” que hacían de auxiliares de vuelo le ha animado incluso a probar el alcohol. “Era gratis, está bueno”, dice. \\nEl de esta mañana es el segundo atentado que el terrorista cancela en el último momento. Según explica, hace tres años llegó a la cola de embarque de un vuelo y se dio cuenta de que todos y cada uno de los pasajeros restantes eran árabes, aunque no dijo nada “para no parecer racista”. “Todos habíamos tenido la misma idea y estábamos callados haciendo cola hasta que uno se empezó a reír”, explica con nostalgia. \\nSegún ha sabido la prensa, el terrorista debe regresar ahora a su aeropuerto de origen y la compañía que ha elegido es Ryanair.'"}, "time": 1742628586.1840234}