{"duration": 0.03827714920043945, "input_args": {"text": "'We Are Change \\n\\nThe White House website features a petition to remove thousands of voting machines supposedly tied to billionaire Democrat George Soros from 16 states. The petition reached well over 100,000 signatures as of Friday night.\\nThe petition’s supporters want to make sure Congress convenes to ban those machines by November. Lifezette first reported that the machines could be linked to Soros, by asserting the man that owns that sold the machines serves the board of the Open Societies Foundation, a board led by Soros.\\n“This man has been linked to a person’s campaign who is running in the election and has a clear bias to one candidate. His ownership of voting machines in 16 states is a clear breach of integrity of our electoral system,” the petition states. The machines were tied to Soros by The Epoch Times, which reported the company that sold the machines is owned by a Soros ally.\\nBusiness Insider reported Tuesday, that notions of Soros controlling the machines is false, because Soros doesn’t have a controlling interest in the company that sold the machines, claiming that the 16 states to purchase the machines don’t plan to use them in the 2016 general election.\\nThis amount of signatures make it clear that a large amount of people have a lot distrust in the current election system.\\nRELATED BREAKING: The NEW Election FEC Violation That Should End Clinton’s Campaign . Russia Trolls The U.S., Offers A “Helping Hand” In Overseeing Elections WE THE PEOPLE ASK THE FEDERAL GOVERNMENT TO CALL ON CONGRESS TO ACT ON AN ISSUE: We the people ask congress to meet in emergency session about removing George Soros owned voting machines from 16 states Created by J.W. on October 21, 2016 Follow WE ARE CHANGE on SOCIAL MEDIA SnapChat: LukeWeAreChange \\nfbook: https://facebook.com/LukeWeAreChange \\nTwitter: https://twitter.com/Lukewearechange I nstagram: http://instagram.com/lukewearechange Sign up become a patron and Show your support for alternative news for Just 1$ a month you can help Grow We are change We use Bitcoin Too ! 12HdLgeeuA87t2JU8m4tbRo247Yj5u2TVP Join and Up Vote Our STEEMIT The post White House Petition To Remove ‘Soros-Owned Voting Machines’ Hits 100,000+ Signatures appeared first on We Are Change .\\n'"}, "time": 1742564504.220846}