{"duration": 0.178663969039917, "input_args": {"text": "'Pentagon Lied To Re-Enlist Soldiers, Thousands To Repay Bonuses by IWB · October 26, 2016 \\nby Edmondo Burr The US Military enticed many soldiers to re-enlist in the Iraq and Afghanistan wars by offering them cash bonuses of over $15,000. \\nNow many years later, the Pentagon is asking thousands of veterans to pay back the “improper” bonuses that they accepted in good faith, because of mismanagement and corruption in the California National Guard. \\nAntiMedia reports: \\nShortly after the U.S. invasion of Iraq, the Pentagon hired Bell Pottinger, a London-based PR agency. The PR firm was tasked with promoting what the Pentagon called “democratic elections” in Iraq, ultimately earning over a hundred million dollars yearly. Part of the firm’s job included producing “ fake al Qaeda propaganda films, ” the Bureau of Investigative Journalism recently reported . \\nDespite the PR operation’s hefty price tag, the Pentagon seemed to have no issue allocating taxpayer resources to have these videos produced. But over ten years after the Iraq invasion, the Pentagon is now concerned about its past appropriations — at least part of them, anyway. \\nTen years after promising $15,000 bonuses to soldiers willing to re-enlist in 2006 and 2007, the Pentagon is now forcing California veterans to pay the bonuses back. \\n\\nIn California, the Los Angeles Times reports , “ officials signed up soldiers in assembly-line fashion ” in 2006 and 2007, outlining the “ generous terms available for six-year reenlistments ” to those willing to sacrifice their safety, leaving their homes, once again, to fight abroad in exchange for a large bonus. Now, the Pentagon wants their money back. \\nTo Get Soldiers to Re-enlist, the National Guard Lied \\nIn 2008, the movie “ Stop-Loss ” highlighted a reality few members of the public were informed about. \\nWith the growing involvement of U.S. military forces in Iraq and Afghanistan, soldiers who had already served in Iraq and Afghanistan for several tours were being asked to reenlist. Sometimes, these soldiers’ term duties were extended forcefully via the government’s controversial stop-loss policy , which allows the government to extend the period a soldier must spend on active duty involuntarily. \\nIn California, the state’s National Guard began promising thousands of soldiers that they would receive $15,000 bonuses for going back to war. \\nNow, nearly 10,000 soldiers who took the National Guard’s promise at face value are being ordered to pay the bonuses back plus interest charges. In some cases, their wages are being garnished to fund the payments. \\nThis issue was first brought up when veterans “ whose only mistake was to accept bonuses offered when the Pentagon needed to fill the ranks ” were the target of an investigation launched in 2010. \\nAfter receiving reports of improper payments, a federal probe found “ thousands of bonuses and student loan payments were given to California Guard soldiers who did not qualify for them, or were approved despite paperwork errors. ” \\nAs a result of the investigation, Army Master Sgt. Toni Jaffe, who also served as the California Guard’s incentive manager, pleaded guilty to filing false claims totaling $15.2 million in 2011. He was sentenced to spend 30 months in federal prison, and three other officers who also pleaded guilty to fraud were put on probation. \\nBreaking the National Guard’s promise to soldiers whose reenlistment depended on the bonus distribution, the California Guard “ assigned 42 auditors to comb through paperwork for bonuses and other incentive payments given to 14,000 soldiers. ” \\nIn September 2016, these auditors finalized the investigation, finding roughly 9,700 current and retired soldiers who had been given “ improper ” bonuses. These soldiers have been told “to repay some or all of their bonuses” since the probe was launched and the first cases were discovered. \\nAccording to the California National Guard, these repayments have recovered more than $22 million so far, compromising veterans like Robert Richmond, who now works for a construction company in Texas. He was an Army Sergeant First Class living in Huntington Beach when in 2006, he was asked to reenlist. \\n“ I signed a contract that I literally risked my life to fulfill, ” Richmond explained, adding that he only agreed to go back to war because he was told he qualified for a $15,000 bonus as a special forces soldier. \\nThe veteran had gone through a divorce after being deployed to Afghanistan in 2002 and 2003. Asked to consider the bonus to reenlist, Richmond thought the money was going to give him “ breathing room, ” so he agreed. In 2007, he was sent to Iraq’s “ Triangle of Death, ” an area a few miles south of Baghdad known for intense fighting. \\nIn one of the hundreds of missions against insurgents he was a part of, Richmond sustained permanent back and brain injuries after his vehicle triggered a roadside bomb. \\nIn 2014, the California Guard headquarters contacted him, letting the former special forces soldier know he was being urged to repay the $15,000 bonus he received in 2006. If he failed to make the payment, the letter said, he would face “ debt collection action. ” \\nRichmond refused to give the government any money back, filing appeal after appeal. “ [Impacted soldiers] want somebody in the government, anybody, to say this is wrong and we’ll stop going after this money, ” he said. \\n‘Support the Troops!’: Code for ‘Don’t Question War?’ \\nIn Washington, D.C., lawmakers have condemned the Pentagon, saying the soldiers were not at fault for accepting a bonus they were promised. \\nPromising to open an investigation into the enlistment bonus problem, House Majority Leader Kevin McCarthy (R-CA) called the Pentagon’s demands “ disgraceful. ” \\n“ The Department of Defense should waive these repayments, ” McCarthy said in a statement . “ The House will investigate these reports to ensure our soldiers are fully honored for their service, ” he added. \\nRep. McCarthy says the government should not be demanding any money back from veterans in his statement. The California Republican and also argued that “ we are the ones who owe a debt for the great sacrifices our heroes have made — some of whom unfortunately paid the ultimate sacrifice. ?” \\nInstead of using this opportunity to highlight the importance of safeguarding our soldiers and keeping them from engaging in unconstitutional wars that are only successfully sold to the American public because administrations lie , McCarthy celebrates these very soldiers’ sacrifices. \\nUsing this discussion to repeat the traditional “support the troops” line, lawmakers like McCarthy steer the debate away from what’s causing these soldiers so much pain and distress, acting as if relentless war hasn’t been the reason they were lied to. Instead, McCarthy and others are pushing the government to keep its promise without reevaluating how the U.S. government goes about irresponsibly sending these men and women abroad to fight insurgents who didn’t pose a threat to Americans at the time . \\nIn the 1964 film, “ The Americanization of Emily, ” which was based on a novel written by a veteran who had been a SeaBee officer on D-Day, character Lt. Comdr. Charles E. Madison gives a short speech explaining that “ [those] who make heroes of our dead and shrines of our battlefields … perpetuate war by exalting its sacrifices. ” \\nFailing to discuss the real costs of war with the American electorate while exalting the sacrifices made by those who serve in the military is part of an ongoing campaign — deliberate or otherwise — to keep America involved in perpetual war. \\nDon’t believe me? Don’t take my word for it. Instead, read what journalist Randolph Bourne had to say about the country’s thirst for war in 1918: \\n“ In times of peace, we usually ignore the State in favour of partisan political controversies, or personal struggles for office, or the pursuit of party policies. It is the Government rather than the State with which the politically minded are concerned. The State is reduced to a shadowy emblem which comes to consciousness only on occasions of patriotic holiday. … \\n“With the shock of war, however, the State comes into its own again. The Government, with no mandate from the people, without consultation of the people, conducts all the negotiations, the backing and filling, the menaces and explanations, which slowly bring it into collision with some other Government, and gently and irresistibly slides the country into war. ” \\nWar, Bourne concluded , “ is the health of the state. ” This is not because all individuals involved with governing enjoy death and destruction per se, but because “ it is … in war that the urgency for union seems greatest, and the necessity for universality seems most unquestioned, ” which forces the public to unite behind the state no matter what — especially if the occasion leading to war is “ terrifying ” the public. \\nWhile veterans whose bonuses are being questioned ten years later should be heard and protected from government abuse, we must not forget it was government’s own thirst for war that initiated this cycle of deception. Let us not ignore the reasons why we should support our troops — and how we should go about it; simply claiming to be interested in celebrating U.S. soldiers for their sacrifice does nothing for them. \\nBy Allice Salles / theAntiMedia.org The US Military Lied to Thousands of Soldiers — and Now Veterans Are Paying for It'"}, "time": 1742564617.8178546}