{"duration": 0.03931546211242676, "input_args": {"text": "'Pinterest \\nRegan Pifer reports apparently the White House can only distribute criticism and cannot receive it. Must be a problem with their shipping department… \\nIn a move that Putin or Kim Jong-un would admire, the White House issued a warning to Republican presidential candidate Donald Trump this week and told him First lady Michelle Obama is off limits. \\nWhere oh where did the First Amendment go? Oh where, oh where can it be? \\nAs reported by Newsmax.com : \\nThe White House sent a warning to Donald Trump Thursday: Attacking Michelle Obama is off limits. \\nThe first lady blasted Trump without actually naming him during a campaign speech for Democrat Hillary Clinton on Thursday. The White House followed up with its own message for the Republican presidential candidate. \\n“I can’t think of a bolder way for Donald Trump to lose even more standing than he already has than by engaging the first lady of the United States,” principal deputy White House press secretary Eric Schultz said on Air Force One… \\n…Mrs. Obama’s comments are some of the most forceful of a week in which scores of Republican leaders abandoned Trump… \\nSo, while First lady Michelle Obama condemns Trump’s remarks, in an attempt to catapult Hillary Clinton to the White House, Trump is left with little alternative than to simply let her speak without defending himself. \\nAhhh, the freedom of censorship… \\nAs Michelle Obama told a packed audience of Trump’s remarks, “I can’t stop thinking about this. It has shaken me to my core in a way I could not have predicted. I know this is a campaign, but this isn’t about politics. It’s about basic human decency.” \\nAgreed. Basic human decency is letting someone respond to the comments you have made against them. \\nBut let’s campaign for the Hillz–a compulsive, ill liar. \\nMake egregious attacks against her opponent, then hide behind the First lady shield. \\nThat lacks human decency. That is politics.'"}, "time": 1742561709.7792768}