{"duration": 0.07624650001525879, "input_args": {"text": "\"Banana Republics: The Baltics' #1 export, Russophobia, is running out of demand... November 22, 2016 - Fort Russ - Ruslan Ostashko, PolitRussia - translated by J. Arnoldski - Dear friends, have you noticed that our opposition which has gone to the Baltic states really loves to to talk about how nice it is for the people there to live in the European Union? Some even periodically praise the local economy which, in contrast to the “torn to shreds gas station,” has long since rushed into the post-industrial era and doesn’t need oil, gas, industry, or even developed agriculture to be prosperous. The inquisitive reader may ask: on what is the foundation of Baltic economic pleasantry based? Indeed, this pleasantry is doubtful, seeing as how the citizens of these countries are fleeing and the economy has yet to recover since the financial crisis. And this is not to mention that numerous officials from the Baltic countries are experiencing a certain pessimism as to the economic future of these countries. Well, okay, let’s assume that there was once such a success story and try to explain on what it was based. If you think about it, something rather interesting is explained here. There is one overriding article in Baltic exports which was not taken into account in any economic checkbook or the reports of the IMF or European Commission. This, of course, is Russophobia. Who needs manufacturing if every day you can just talk about a Russian invasion? Who needs developed agriculture if officials from the Baltics can tell stories about Putin’s plans to seize Riga? Who needs an economy at all if it is more profitable to sell votes at the meetings of European organs of power? In exchange for Russophobia, they can receive diplomatic support, structural funds from the European Union, and the deployment of additional NATO troops. They can even get real money for anti-Russian propaganda, some of which, by the way, makes its way into the hands of the Russian opposition journalists and activists who are so fond of the weather in the Baltic states. Russophobia is an all-around perfect export product. To be produced, it needs only two things: Russia, which will never disappear, and a Baltic official or journalist who complains about Russia, is afraid of Russia, and urgently needs protection from Russia. This is the perpetual motion machine. No wonder many Latvian and Estonian Russophobes thought that they had found a gold mine that never runs out. But now a surprise has come. The demand for Russophobia has fallen with the ascent of Trump. Even the Western champions of Russophobic discourse are preparing to tighten their belts and switch to eating only buckwheat, not to mention their Baltic colleagues. This situation could run the economy of the former “Baltic tigers” and especially the personal futures of many Russophobic politicians into problems more serious than the global financial crisis. The Latin American banana republics had this kind of bad luck when prices fell for bananas, and then political chaos began since they didn’t produce anything other than bananas. Something similar is happening in this case, only it is not the price for bananas that is falling, but the price for Russophobia. Soros and his friends where generous when they had access to the purse of the State Department or US Congress, but they are much less gracious with their own money, so some will have to chew on their tie instead of eating red caviar sandwiches. And some kind of Maidan is not far off, or suddenly some Baltic version of Dodon could win elections. The authorities of our northwestern neighbors have something to be sad about. But what can they do? Those few politicians that kept some common sense are somehow trying to restore economic relations with Russia and are even flying to Moscow, but this looks pathetic. What kind of salvation by Russian transit can there be if Russia has already, for a long time and consciously, been contributing to the creation of port facilities on the Baltic Sea in order to stop paying these Russophobic border states? The squeezing of their products out of the Russian market is only a matter of time, and this is an inevitable process, just as inevitable as the death of Baltic transit. And what will happen then? Then they will beg us to take the Baltic states. They will beg for a pro-Russian Maidan to be organized, and local officials will even want to lead it. But this won’t happen. Everyone will understand that being with Russia in a single economic space is something that has to be earned. Thus, the Baltic Russophobes have little hope. Follow us on Facebook!\""}, "time": 1742563827.4418626}