{"duration": 0.10399413108825684, "input_args": {"text": "'Waking Times \\nBlack Friday is here, November 25th, 2016, the day after Thanksgiving. People are literally killing each other and fights are breaking out in many places, while people shop for consumer goods that can be purchased on any other day, or even online. Billions of dollars will be spent on non-edible goods today in a telling display of cultural insanity. \\nThis is the sort of thing happening right now: Welcome to the Modesto mall… pic.twitter.com/IWWfMJh5lj \\n— Frankryan (@FrankryanM) November 25, 2016 \\nBlack Friday has been pushed onto the public by retail associations with the help of corporate media, and the cultural phenomenon is spreading to many countries around the world. People go for it, they love it. They are part of something. There will be publicity and drama and intrigue. It will be on TV. The world will be watching, so get out there and be insane. \\nBut why? Why do people behave this way? \\nIs it really to save money? No. Better deals can be found before and after Black Friday , this is no secret, and if money were really the issue, people would shop online to find better deals while also saving their time and gas. \\nAre the available goods hard to get? No. The same crap is always for sale everywhere, and we’re not talking about food here. There is no food shortage right now. None of this necessary. \\nIs it about enjoying a day out shopping with family? No, because after all, who likes navigating crowded parking lots, or standing in lines for hours in cold weather? Who enjoys risking exposure to mob violence, since we all know this is what happens? \\nIt is really about getting ready for Christmas or the spirit of giving? No. \\nIt has more to do with participation in a ritual that has been thrust upon our society as a way of advertising and normalizing the insanity of the consumer culture, and of getting us more spiritually hooked on the matrix. Of activating the mass reptilian brain. Of weaponizing the public . \\nHere, people fight like maniacs over toilet paper. Toilet paper. Seriously. Ritual Insanity, Herd Mentality and The Purge \\nThis phenomenon has become a ‘thing’ in recent years and it’s now pushed on the public as a tradition, albeit a tradition with no roots and no meaning. \\nIt seems more like a test or some kind of emergency broadcast system, but instead of warning us to danger, it is calling us to go berserk in an orgy of chaos. A call to purge our common senses, to lose ourselves in the herd, to indulge in a ritual for the sake of being part of something. \\nParticipation in the Black Friday ritual is a pledge of allegiance to the Matrix , the global scheme that enslaves us with debt , misleads us with false idols, tricks us with shiny trinkets and mass-produced baubles, all in ploy to steal our energy, time and our lives. \\nWhen we opt-in and play this game we miss out on the connection to life and relationship, to spirituality and compassion, to the natural world. But most importantly we turn a blind eye to the corruption, evil and authoritarianism in our world today. We ignore the connection between these goods and the slave labor and environmental destruction required to bring them to mass market. READ: The Holidays Are Coming… Time to Stock Up On Slave Made Goods From China? \\nBlack Friday is an attempt to cast some a spell on the public, like the cremation of care ceremonies conducted by the world’s overlords, it’s a ritual of dark power. It is black magic, and the resulting violence and madness are proof of this. It’s a ceremony that invites us to forget our humanity. An invitation to shamelessly activate and engage in all the elements mind control and group think and conformity. To dive blindly into a moral vacuum. To worship the culture of death. \\nAre you participating in this? \\nEnjoy this presentation from Russell Brand about the ‘tradition’ of Black Friday. He appropriately calls it, ‘Christmas for Satan.” Read more articles by Dylan Charles . About the Author \\nDylan Charles is a student and teacher of Shaolin Kung Fu, Tai Chi and Qi Gong, a practitioner of Yoga and Taoist arts, and an activist and idealist passionately engaged in the struggle for a more sustainable and just world for future generations. He is the editor of WakingTimes.com , the proprietor of OffgridOutpost.com , a grateful father and a man who seeks to enlighten others with the power of inspiring information and action. He may be contacted at . Like Waking Times on Facebook . Follow Waking Times on Twitter . This article ( Black Friday – The Pledge of Allegiance to the Matrix ) was originally created and published by Waking Times and is published here under a Creative Commons license with attribution to Dylan Charles and WakingTimes.com . It may be re-posted freely with proper attribution, author bio, and this copyright statement. ~~ Help Waking Times to raise the vibration by sharing this article with friends and family…'"}, "time": 1742562620.6195188}