{"duration": 0.07963752746582031, "input_args": {"text": "'0 Add Comment \\nIRELAND was said to be unsure how to act after learning the man most unfit for public office, snagged a 10-minute conversation with Donald Trump late last night. \\nHowever, a leaked transcript of the conversation believed to have lasted 10 minutes has been made available to the public, reassuring many. WWN has reproduced it in full below: \\nEnda: “Hello, Donald, bog fan, sorry, I mean big fan, bit nervous chatting to you obviously” \\nTrump: (speaking to someone in the room with him) “It’s definitely ‘Edna’? That’s a chick’s name right? Invite her for Patty’s Day. On a scale of 1-to-10, what are we talking? How grabbable is her pussy?” \\nEnda: “Hi, huh-hello? Mr, eh, President Elect Trump sir..” \\nTrump: (speaking to someone in the room with him) “Yeah, they say that now, but once I’m in office, that gold statue of me is going on the White House lawn, believe me. We’ll need to enhance the crotch area first, bigly.” \\nEnda: “Hello, we’re very happy for you here in Ireland, absolutely everyone loves you and your hair and I never called you a racist, they were Clinton lies. She’s a big liar that Clinton one.” \\nLong pause of over 1 minute when nothing is said. \\nTrump: (chewing loudly) Who is this again?” \\nEnda: “It’s Enda Kenny, I’m the Taoise… I’m the Mr. Ireland boss man” \\nTrump: (chewing loudly) “We’re winning big here, you understand, so big, we won so big, it’s unbelievable and yet my assistant tells me you’re not even following me on Twitter. Wrong. Big mistake, believe me” \\nEnda: “Yes, yes, I’ll change that immediately, sir. Now myself and Barack, we talked a lot of the Undocumented Irish and their plight, as it were, and we were making great progress, they’re not an awful shower like the Muslims, you were dead right about them… we’ve only about 4 of them here” \\nTrump: “I have no idea what a Demented Iris is. And I’m bored.” \\nSilence for a number of seconds. \\nEnda: “Our two countries enjoy a great trade relationship, we hope that continues” \\nTrump: “I’m a business guy, the best business guy. You a business guy?” \\nEnda: “I gave primary school teaching a go about 40 years ago” \\nTrump: “This steak is great. Have you tried Trump steak? I’ll send you some, you’ll pay for it, but I’ll send it. If there’s maggots festering in it, that’s nothing to do with us. It’s the best steak.” \\nEnda: “Okay, now I’ll have to put my foot down on corporation tax and other practices, Mr President, sir…” \\nTrump: “Boring. I’m making America great again, and you’re taking up too much of my time. Anyway, if you’re in Clare, you should check my course and hotel, it’s beautiful, the most beautiful in the world. When I got there, this guy greeted me, and it was very Irish, probably the most Irish thing they’ve ever done for anyone”. \\nEnda: “That was Michael Noonan, he’s my best friend…” \\nTrump: “They had a red carpet out, beautiful women, the silliest music you could imagine, they let me do anything down there, they really did. All because of a few jobs. Except that damn wall…” \\nEnda: (shouting) “You can have the wall!” \\nTrump: “Who is this again?”'"}, "time": 1742562097.7830987}