{"duration": 0.07709622383117676, "input_args": {"text": "'This post was originally published on this site \\nAbout a hundred activists from the Ukrainian nationalist “Svoboda” party and several public organizations, on 17.11.16 in Kiev picketed the building of the constitutional court of Ukraine, which hosted a hearing on the fate of the “language law of Kivalov-Kolesnichenko” . \\nProtesters held posters saying: \\n“We will speak in Ukrainian so that Russia does not ‘defend’ Russian-speakers” \\n“Don’t arrange yourself for someone else’s language in your own country” \\n“Russian language is the weapon of Moscow, don’t speak in Imperial!” \\n“The law on language Putin-Kivalov – in the trash!” \\n“One language, One nation! One Ukraine!” \\n“A United Ukraine, where there is only one national language” \\n“Oust russifiers from state posts” \\n“Let’s put an end to Russification!” \\n“Down with Moscow’s written law of Kivalov-Kolesnichenko” \\n“Only the evil enemies of Ukraine support Moscow language, Russian world, war!” \\n“Let’s defend the Ukrainian language, it’ll be a native state” \\nDeputies and public figures addressed those who gathered. \\n“There, where there is the Russian language, there are occupiers,” said the Deputy of the Kiev City Council from “Svoboda” Igor Miroshnichenko” in his speech. “There, where there is Russian language, there are separatists and the ‘Russian world’, which the enemy with weapons comes to defend. There are no allusions that Moskals can trample our land. That’s why it is necessary to do everything to make on our land Russian-speakers to disappear, like ‘dew in the sun’. \\nRussian language in Ukraine can only be in one status, it should be superfluous. It clings to our children like garbage – in schools, on the street, on television, in the media. That’s why it is necessary to do everything to throw this garbage out of our house. \\nRussian language is needed in order to interrogate the occupiers. Russian language is needed in order to understand the intentions of the enemy. It is those who work in the security services who must possess it. Unfortunately, in our special services the Russian language is used.” \\nT he Deputy compared the condition of the Ukrainian language in Ukraine and, in particular, the quota for Ukrainian content on radio and television, with a ghetto. “While it’s Russian language that we must drive into the ghetto, Russian songs. I want for them such ghettos in Ukraine that they were creating centuries back for us in their land. We don’t want to create ghettos in their house. You want to sing in Russian – go to Moscow”, he said. \\nAnother Kiev Deputy from “Svoboda” Yury Sirotyuk demand the President not to be busy with his chocolate factory in Lipetsk, but with national security – a key issue of which is language. Writer Larisa Nitsoy described her fight against the Russian language in the school where her child in studying. Copyright © 2016. All Rights Reserved. Related '"}, "time": 1742561909.760963}