{"duration": 0.046312570571899414, "input_args": {"text": "'As the New England Patriots took yet another Super Bowl win, liberals from coast to coast exploded with vitriol on social media, furious that a team with tangential links to President Donald Trump came out on top Sunday. Since that final touchdown the hash tag #NotMySuperBowlChamps and other similar tags have been trending. [The   sports media has been out for blood for the better part of a year because Patriots quarterback Tom Brady, coach Bill Belichick, and team owner Robert Kraft all came out as unapologetic fans of President Trump. And, now that they’ve won the Super Bowl the left has turned apoplectic.  Since last night’s big game, liberals have flooded Twitter, Facebook, and other social media services with several versions of the hash tag after Trump pal Tom Brady led his team to yet another Super Bowl title. Along with #NotMySuperBowlChamps, users also employed #NotMySuperBowlChampions and #NotMySuperBowlTeam to attack the Patriots. The winner should be determined by who has more fans, not more points. Winning is racist and Tom Brady is a fascist. #NotMySuperBowlChamps pic. twitter.   —   Elizabeth® (@MissLizzyNJ) February 6, 2017,  *weeps* I can’t believe this can happen in our country ya’ll *snot bubble* @MileyCyrus #NotMySuperBowlChamps pic. twitter.   —   Jendetta© reeeeee! ❄️ (@PolitiKellyRite) February 6, 2017,  I’m protesting #notmysuperbowlchampion,  —   Chance Bishop (@THEchancebishop) February 6, 2017,  The Patriots didn’t win today. Hate won. Fear won. Racism won. Sexsim won. Homphobia won. Literally shaking. #NotMySuperBowlChamps,  —   Luis Antonio Miguel (@lamknight7) February 6, 2017,  A hashtag that I will use both before and after #SuperBowl51  —   #NotMySuperBowlChampion,  —   Douglas Young (@douglasyoung67) February 5, 2017,  Tom Brady is a Trump supporter AND a cheater #notmysuperbowlchampion,  —   tom battles (@tomf0olery) February 6, 2017,  Oh hell nah #notmysuperbowlchampion https:  .   —   Tay 😇 (@They_LoveTaylor) February 6, 2017,  #NotMySuperBowlChamps, Me: ”I hate the Patriots, Tom Brady, Bill Belichick, and nothing can change my mind.” Woke Twitter: ”Hold my beer.” pic. twitter.   —   ScottInSC (@ScottInSC) February 6, 2017,  @CNN @MartysaurusRex the whole team should skip it. On 2nd thought, they should go. Cheaters reunion  …     #notmySuperBowlteam #notmypresident,  —   Joel Franklin (@average_joester) February 6, 2017,  Demand a recount! Call for the NFL to not recognize the Patriots as champs! Then protest the parade! #RESISTANCE #NotMySuperBowlChamps pic. twitter.   —   Chow (@Dodge5Adam) February 6, 2017,  Meet BET’s new NFL analyst. #NotMySuperBowlChamps pic. twitter.   —   Pontiac Danger 🐸 (@pontiacaholic) February 6, 2017,  This is what bullshit happens in Donald trumps America! #NotMySuperbowlChamps,  —   Mikey Doherty (@cheeks_jr) February 6, 2017,  How am I supposed to take this HRM test while I’m still recovering from last night’s game? 😫😫😫 #RiseUp #NotMySuperBowlChampions,  —   Sky Stricklin (@Skyryder96) February 6, 2017,  It’s Monday and Tom Brady is really happy  …    . .life sucks  #notmysuperbowlchampions,  —   A. B. (@twistedpod2) February 6, 2017,  Of course, even as the liberals were losing their minds, again, many others took time out to slam liberals by sticking their finger in their eyes and joking about how the Falcons “won the popular vote” or how the Russians “hacked the Super Bowl. ” @MarkLazerus But, didn’t the Falcons win the popular vote? #notmysuperbowlchampions,  —   Lets Go Blues (@Ibleedblue8403) February 6, 2017,  The Russians hacked the Super Bowl! Demand a recount of the score!! PAAAAHHHH #NotMySuperBowlChampions 😂😂❄️❄️ @JessicaTarlov @julieroginsky pic. twitter.   —   Jimmy🇺🇸⛪️🙏🏻 (@JimmyK_23) February 6, 2017,  Hey @ShaunKing, why’d you delete this tweet? Don’t worry, I saved it for you. You’re welcome. .#SB51 #NotMySuperBowlChamps #boycottbudwiser pic. twitter.   —   Tennessee (@TEN_GOP) February 6, 2017,  John Lewis holding a   to protest #superbowl. Said he feels best when he’s sitting around  doing nothing anyway. #notmysuperbowlchamps pic. twitter.   —   Wake Up Nation (@John_Adams_2016) February 6, 2017,  Maybe a men’s march will change the results? #NotMySuperBowlChamps,  —   Matt (@StartedTweeting) February 6, 2017,  Leftists have managed to spin a white racism narrative in a sport that is 70%  . #NotMySuperBowlChamps,  —   Red Pill Philosophy (@RedPillTweets) February 6, 2017,  Then there was this laugher  …     #Monday #NotMySuperBowlChamps #MAGA #LiberalLogic #StupidLiberals, I rest my case! pic. twitter.   —   Zarko️ 💯Trump 🇺🇸 (@ZarkoElDiablo) February 6, 2017,  Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742628435.4622226}