{"duration": 0.05274558067321777, "input_args": {"text": "'President Donald Trump’s tougher border security and immigration enforcement plans have driven up human smuggling fees being charged by   coyotes. [“We are seeing an increase in the fees charged by human smugglers along the U. S. southwest border,” Department of Homeland Security (DHS) Secretary John F. Kelly said in a written statement obtained by Breitbart Texas. “Since Nov. 2016, ‘coyotes’ have hiked their fees in some areas by roughly 130 percent —  from $3, 500 to $8, 000 in certain mountainous regions. ”  Kelly attributed the increased fees charged to newly implemented changes in DHS policy regarding the detention of apprehended aliens. “As directed in my memoranda implementing the President’s executive orders, we remain committed to carrying out fair, impartial and humane enforcement of the nation’s immigration laws,” Kelly wrote. Coyotes have become dependent on human smuggling fees, often earning as much from smuggling people as drug runs. Breitbart Texas reported in the days before the November 2016 Election,   smugglers were using the contest as a “marketing tool” to get people to travel in advance. “The cartel uses what happens in the U. S. as a marketing tool in Central America,” McAllen Mayor Jim Darling said during an exclusive interview with Breitbart Texas. “The need is there (in Central America) but what happens in Washington and the way the news media presents it, they (cartels) say you better get up here. So that causes the surges. We”ll see what happens after the election to see if it slows down. ” After the election, it did not slow down. The months of November, December, and January, all saw increases in apprehensions compared to the same months in the prior year. Following the release of December’s numbers showing a large increase in apprehensions, particularly in the Rio Grande Valley Sector, Supervisory Border Patrol Agent Marlene Castro said, “We’re not a deterrent because they’re looking for us, so we can be standing there and [the smuggler will] still send them across,” during an interview with Fox News Channel’s William La Jeunesse. “It’s been a group, and then maybe five minutes later another group, and then half an hour later you’ll see another one. ” With the swearing in of President Trump in January, the numbers finally began to subside. While still higher than January 2016, the numbers were down from December. The first full month of the Trump Administration brought a dramatic drop in migrant apprehensions between ports of entry along the southwest border. Apprehensions not only dropped from January to February they dropped to the lowest level of any month in the past five years. “The drop in apprehensions shows a marked change in trends,” Secretary Kelly said. “Since the Administration’s implementation of Executive Orders to enforce immigration laws, apprehensions and inadmissible activity is trending toward the lowest monthly total in at least the last five years. ” “Since President Trump took office on January 20, we have seen a dramatic drop in numbers,” Kelly stated. “We will remain vigilant to respond to any changes in these trends, as numbers of illegal crossings typically increase between March and May. However, the early results show that enforcement matters, deterrence matters, and that comprehensive immigration enforcement can make an impact. ” “The decrease is also encouraging news because it means many fewer people are putting themselves and their families at risk of exploitation, assault, and injury by human traffickers and the physical dangers of the treacherous journey north,” the DHS secretary concluded. Bob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX.'"}, "time": 1742563285.419415}