{"duration": 1.2275137901306152, "input_args": {"text": "'Waking Times \\nWe are fast approaching an era when humanity will be subjugated by a technological tyranny managed by an untouchable organization of elites, bureaucrats and paid public minders hired to monitor our behaviors, emotions and thoughts. In an environment like this, law and justice will be meaningless, as the tools of a technocracy can used to enforce the policies and whims of whoever monitors us, whether it be corporate employees, criminals, or abusive state actors. \\nRecent developments and roll-outs of advanced facial recognition technology are a hint of the coming ubiquitousness in using biometric, face-scanning, emotion-reading, all-seeing technology to govern every detail of daily life. Consider the following developments: It was recently reported that around half of Americans are already in police facial recognition databases, the vast majority having never been even accused of committing a crime or consenting to being included in the database. [ Source ] Increasingly, facial recognition is being used to scan concert and festival goers creating permanent databases of partiers. [ Source ] An experimental town in China is now using facial recognition to grant citizens entry. [ Source ] Facial recognition is now capable of reading human emotions, opening the door to a new world of possibility in pre-crime detection. [ Source ] The TSA is using emotion reading facial recognition technology to determine if a traveler is to be treated as a threat. [ Source ] Police nationwide are using the controversial Stingray system which allows them to listen to anyone’s cell phone conversations. [ Source ] California police are already using a computer system called ‘Beware’ to predict crime and preemptively stop it. [ Source] Microsoft recently conducted a major test during the 2016 Republican and Democratic conventions, using emotion reading facial recognition technology to survey the crowd for threats. [ Source ] A Russian software developer has released an App that allows you to turn your smart phone into a facial recognition device. [ Source ] Some U.S. churches are using a consumer version of facial recognition to keep tabs on who is in attendance for Sunday service. [ Source ] Facial recognition, finger-print reading, and iris scanning is now being included in consumer technologies. [ Source ] \\nThe justification for using this technology against a public who is never given the opportunity to consent or to op-out is, as always, public safety, as police and government agencies claim the technology is needed to spot criminal elements, gang members and other threats to the public. Here, a quote from George Orwell offers a glimpse of what the inevitable outcome of this is: \\n“It was terribly dangerous to let your thoughts wander when you were in any public place or within range of a telescreen. The smallest thing could give you away. A nervous tic, an unconscious look of anxiety, a habit of muttering to yourself—anything that carried with it the suggestion of abnormality, of having something to hide. In any case, to wear an improper expression on your face (to look incredulous when a victory was announced, for example) was itself a punishable offence. There was even a word for it in Newspeak: FACECRIME, it was called.”– 1984 , George Orwell \\nHere, RT discusses how Microsoft used emotion reading facial recognition technology at political conventions and how some are resisting the way this technology is being introduced into our society. Final Thoughts \\nPrivacy and anonymity are the enemies of the state, and it is being destroyed without our consent by both government and corporations who are deploying technology with no consideration of the human consequences. The possibilities for a techno-totalitarian future are grim, but without awareness and without motivation to resist, it is all but a forgone conclusion. \\nOrwell himself warned us of how this dark vision would force itself into fruition unless we stood against it. At the end of his life he even gave us this final warning. Are you listening?   Isaac Davis . About the Author \\nIsaac Davis is a   OffgridOutpost.com Survival Tips blog. He is an outspoken advocate of liberty and of a voluntary society. He is an avid reader of history and passionate about becoming self-sufficient to break free of the control matrix. Follow him on Facebook, here . Like Waking Times on Facebook . Follow Waking Times on Twitter . This article ( 1984 Unfolding as Public Surveillance Technologies Deployed Without Consent   Isaac Davis    '"}, "time": 1742562853.055023}