{"duration": 0.11021542549133301, "input_args": {"text": "\"Jay-Z and Beyonce are Members of Aleister Crowley’s Satanic Cult OTO Celebrities linked to OTO include the rapper Jay-Z, who has repeatedly purloined imagery and quotati... Print Email http://humansarefree.com/2016/11/jay-z-and-beyonce-are-members-of.html Celebrities linked to OTO include the rapper Jay-Z, who has repeatedly purloined imagery and quotations from Crowley’s work. Whether wearing a T-shirt emblazoned with ‘Do what thou wilt’ or hiring Rihanna to hold aloft a flaming torch in his music videos (a reference to the Illuminati , an outlawed secret society whose name supposedly derives from Lucifer , or ‘light bringer’), he has given the sect priceless publicity. Aleister Crowley , who was born into an upper-class British family in 1875, styled himself as ‘the Great Beast 666’. He was an unabashed occultist who, prior to his death in 1947, reveled in his infamy as ‘the wickedest man in the world’.“ And he was withdrawn from them about a stone’s cast, and kneeled down, and prayed, Saying, Father, if thou be willing, remove this cup from me: nevertheless not my will, but thine, be done. ” Luke 22:41,42 (KJV)His form of worship involved sadomasochistic sex rituals with men and women, spells which he claimed could raise malevolent gods and the use of hard drugs, including opium, cocaine, heroin and mescaline. Crowley’s motto — perpetuated by OTO (i.e. Ordo Templi Orientis ), — was ‘ do what thou wilt ’ (i.e. Do whatever you want). And it is this individualistic approach that has led to a lasting fascination among artists and celebrities. Led Zeppelin’s Jimmy Page, for example, routinely took part in occult magical rituals and was so intrigued by Crowley he bought his former home, Boleskine House, on the shores of Loch Ness in Scotland. And there are now OTO lodges scattered around the country, practising the same ceremonial rituals and spreading the word of Crowley. Sinister: Peaches Geldof has an 'OTO' tattoo (left) which is an acronym for the creepy Ordo Templi Orientis ( DailyMail ) Jay-Z and Beyonce are leading the way Other celebrities linked to OTO include the rapper Jay-Z, who has repeatedly purloined imagery and quotations from Crowley’s work. Whether wearing a T-shirt emblazoned with ‘Do what thou wilt’ or hiring Rihanna to hold aloft a flaming torch in his music videos (a reference to the Illuminati , an outlawed secret society whose name supposedly derives from Lucifer, or ‘light bringer’), he has given the sect priceless publicity. Bombshell: Obama, Clinton, Podesta, Soros, Epstein, Alefantis — All Connected to Pedophilia Claims by 'Podesta Emails' His clothing line, Rocawear , is shot through with OTO imagery such as the ‘all seeing eye’ in a triangle, the ‘eye of Horus’ (an ancient Egyptian symbol frequently referenced in occult texts) and the head of Baphomet (the horned, androgynous idol ofWestern occultism). Beyoncé Knowles admits demon possession by Sasha Fierce: Some conspiracy theorists have seized on this as evidence that he is a member of a secret Masonic movement which they believe permeates the highest levels of business and government. Others take a more pragmatic view: that it is commercial opportunism, cashing in on impressionable teens’ attraction to the ‘edginess’ of occult symbolism. Yet OTO is much more than a marketing opportunity for attention-seeking celebs. It is a living religion, with adherents still practicing occult rituals set out by Crowley in his books. This week I tracked down John Bonner, 62, the head of OTO in the UK, to his home in East Sussex. He told me: ‘We are not a mass-appeal sort of organization — in the UK we number in our hundreds. Worldwide it’s thousands. Hillary Clinton gets in formation with Jay Z and Beyonce: Celebrities are not always a boon or a benefit. ‘We are used to being misunderstood. Many stories about Crowley, like people saying he filed his teeth down into fangs, are nonsense. ‘YOU COULD CALL US A SEX CULT IN A WAY, BECAUSE WE RECOGNISE, ACCEPT AND ADORE THE WHOLE PROCESS WHICH GOES TOWARDS MAKING TANGIBLE THE PREVIOUSLY INTANGIBLE.’ According to adherents of OTO it takes years of study before you can begin to understand what the religion is about — much like the equally controversial Church of Scientology. The former FBI head, Ted Gunderson, who investigated Satanic circles in LA, found that Crowley’s teachings about ‘raising demons to do one’s bidding’ suggested human sacrifice, preferably of ‘an intelligent young boy’. You can read more about Ted Gunderson's investigations into Satanic cults HERE . References: Nowtheendbegins.com ; Dailymail.co.uk Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related\""}, "time": 1742563480.8776278}