{"duration": 0.030251741409301758, "input_args": {"text": "'Los   street artist provocateur Sabo is back again, this time to skewer North Korean leader Kim   with a series of mock posters promoting a fictional line of “Trump’s North Korean BBQ. ”[The mock posters  —   which have popped up around the Koreatown neighborhood of Los Angeles  —   feature the North Korean dictator’s head superimposed onto a roasted pig’s body, and with an apple placed in his mouth. Alongside the image is an insert of a smiling Trump.  The taglines for the mock  include “The finest in ” “The world’s greatest really,” and “Cooked up by five star chef James Mattis. ”  A telephone number displayed on one of the billboards apparently connects to an art gallery in Beverly Hills. The posters’ appearance in Los Angeles comes as hostilities between the United States and North Korea have hit renewed heights in recent weeks. NBC News reported that the National Security Council presented military options to President Trump  —   including the possible assassination  of the North Korean dictator  —   to deal with the country’s increasingly defiant nuclear program ahead of Trump’s meeting with Chinese President Xi Jinping last week.  Sabo has previously featured images of Trump in his street art. In November, just after Trump’s victory in the presidential election, the street artist peppered Los   bus benches with fake  for Sotheby’s real estate sales, in a campaign lampooning numerous celebrities’ pledges to move out of the country if Trump were elected. Most recently, the artist trolled the Academy Awards by erecting posters outside the Dolby Theater in Hollywood that blasted the film industry’s “unwatchable movies. ” Sabo has also skewered Hillary Clinton, at one time placing an image of the former Democratic presidential candidate inside a washing machine as part of a “money laundering” series, alongside an image of actor Leonardo DiCaprio.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742561999.3607423}