{"duration": 0.0611724853515625, "input_args": {"text": "'link The oligarchy runs our society with Problem – Reaction – Solution. If anything, these leaks have proven beyond a shadow of a doubt that the two-party system is an illusion and the whole construct is one huge pay-for-play corporate sham. Obamacare was always meant to destroy the private health care system and usher in single-payer, government run socialist medicine. It was designed that way… and it’s “working”. Related: Link In this particular e-mail, we get to see just how fake and fraudulent our government is. Your health determines how valuable of an asset you are and it’s the main reason why we see “health tracking apparel” and “health scores,” designed by and for prominent health insurance companies in order to track your health data in-between doctor visits. Remember this quote by demon spawn Nancy Pelosi? “We have to pass the bill so that you can find out what’s in it.” If that wasn’t telling you something at the time, maybe this will… Picture: Link In an email thread dated September 26, 2015 between Hillary and her senior policy adviser, Ann O’Leary, titled “Memo on Cadillac Tax for HRC,” Hillary wrote, “Given the politics now w bipartisan support including Schumer, I’ll support repeal w ‘sense of the Senate’ that revenues would have to be found. I’d be open to a range of options to do that. But we have to be careful that the R version passes which begins the unraveling of the ACA.” Do you still have any doubts? Sadly, there are those who have benefited from the ACA, but to a greater extent, many have seen the exact opposite of what was promised. Higher rates, less coverage, new doctors, etc… A Democrat supporting Republican legislation to destroy Obamacare on purpose. How many millions have they raked in on this deal and bilked the American people for in Obamacare penalties because they can’t afford the “affordable” health care? And the American people will look at this like a “victory” when it does unravel, even though it has been the plan all along. Which reminds me, when was the last time that the people had a victory? This just goes to show you that what is good for the goose isn’t always good for the gander. They knew that going in and only after the fact, can we realize this. They wanted the ganders’ money while the goose that benefits (through subsidiaries), cries to defend the ACA, making the rest of us look insensitive and unfair. Good plan… They’re all working together, folks. Obamacare was always meant to fail — on purpose — to bring in a single-payer, government-controlled socialist medicine system. Don’t believe me yet? Back in 2013, Senator Harry Reid had this to say about the ACA… Sen. Harry Reid: Obamacare \\'Absolutely\\' A Step Toward A Single-Payer System When I speak to conservatives about health care policy, I’m often asked the question: “Do you think that Obamacare is secretly a step toward single-payer health care?” I always explain that, while progressives may want single-payer, I don’t think that Obamacare is deliberately designed to bring about that outcome. Well, yesterday on PBS’ Nevada Week In Review , Senate Majority Leader Harry Reid (D., Nev.) was asked whether his goal was to move Obamacare to a single-payer system. His answer? “Yes, yes. Absolutely, yes.” The plan to undermine your health and sufficiency is so diabolical and disgusting, that many would simply refuse to believe such a thing. Well, there it is folks. They don’t give a damn about you or your well-being and will do anything in their power to see that decisions about your health are made by them in the future. For me personally, the ACA has increased my premium by 300%, causing me to drop what was offered by my employer and settle with less coverage for more money using the \"marketplace.\" Is this where I get to say... Thanks Obama?'"}, "time": 1742563418.8344567}