{"duration": 0.24657249450683594, "input_args": {"text": "'  protesters ran wild across Washington, D. C. on the eve of President Donald Trump’s inauguration, obliging the police to douse them in pepper spray. I dubbed the event “Loserpalooza” on Twitter:[Looks like Loserpalooza was a smash. Nothing says “love wins” like forcing the police to   you. https:  .   —   John Hayward (@Doc_0) January 20, 2017, Pepper seasoning was added to this assortment of mixed nuts outside the “DeploraBall” inaugural event. Politico quoted NBC News reports about the demonstrators burning a Trump hat and lugging around an inflatable elephant festooned with a “RACISM” banner  —   because Republicans are racists, get it? See? SEE?  —   and then added their own impressions of the madness:  Protesters outside the building chanted “Nazi scum” at DeploraBall attendees as they entered the building and a DeploraBall Twitter account posted videos of the group outside chanting “F —   Trump. ” Along with the video, the DeploraBall account’s post read, “SHOUTING WONT CHANGE TOMORROWS OUTCOME  …     CANT WAIT TO SAY PRESIDENT @realDonaldTrump. ” The demonstrators also brought with them a projector, used to project two messages onto nearby buildings: “Impeach the predatory president” and “bragging about grabbing a woman’s genitals. ” Here’s some video of the tear gas flowing: BREAKING: DC police mace, teargas   protests outside National Press club. Video: #disruptj20 pic. twitter.   —   DCMediaGroup (@DCMediaGroup) January 20, 2017,  Here are some more postcards from the edge, as lefty mobs do their best to convince Trump voters they made the right choice in November: Tiny activist boasts of setting fires:  No   protest is complete without some child abuse, so there was a little boy telling Fox News reporter Griff Jenkins that he started a fire outside the National Press Club “because I felt like it, and because I’m just saying, ‘Screw our president!” Technically, he was saying “Screw Barack Obama,” who remains the current president until Trump takes the oath of office, but whoever taught him to start fires to express his unthinking rage apparently didn’t bother to teach him much in the way of civics.  “We have to really be concerned about this dangerous direction our country is going in. When you come for our communities, when you come for us, and when you try to violate our rights, we will resist,” a Loserpalooza spokeswoman told Jenkins. The rest of us are really concerned about   thugs blocking streets and setting things on fire. Michael Moore melts down: Were are the clowns? Quick, send in the clowns! Don’t bother  …     they’re here. Helplessly blubbering in uncontrollable hysteria, lefty propagandist Michael Moore rolled through D. C. like a lump of cholesterol slowly passing through the veins of the city, filling his Twitter stream with bad photographs and worse poetry: Passing the White House on the Obamas last night, sound asleep inside. The country wide awake, afraid 2 close its eyes pic. twitter.   —   Michael Moore (@MMFlint) January 20, 2017,  Just arrived in DC. Police lights flashing everywhere in the middle of the night. Reichstag tonite still a democracy. pic. twitter.   —   Michael Moore (@MMFlint) January 20, 2017,  Actually, the country is wide awake because your protester buddies are making a lot of noise, Mike, and frankly we’re worried about the vandalsim and violence you’re likely to commit when you gather in large numbers. Moore also attended a protest rally in New York City on Thursday night, along with such Hollywood intellectual giants as Alec Baldwin and Mark Ruffalo, where he declared President Trump would “not last four years” and called for “a hundred days of protest. ” His actor buddies should clue him in to the actual attention span of his followers. Also, he should remember that George Soros lost a ton of money betting against America after the election, and might not be able to afford 100 days of   . “We oppose totalitarianism!” scream totalitarians: Enjoy the spectacle of people who fantasize about being brave resistance fighters against Trumpian tyranny blocking off checkpoints, denying others their rights to speech and assembly without a second thought: #Trump supporters trying to attend #Inauguration told “this checkpoint is closed” by #DisruptJ20 protesters at #BlackLivesMatter blockade pic. twitter.   —   Alexander Rubinstein (@AlexR_DC) January 20, 2017, They were still blockading intersections and getting into tussles with riot cops on Friday morning: HAPPENING NOW blockade at D and 1st! Labor and Palestine. Riot cops pushing protestors #DisruptJ20 @DisruptJ20 pic. twitter.   —   Martha Neuman (@MWNeuman) January 20, 2017,  As former White House Press Secretary Ari Fleischer succinctly observed: If they’re blocking attendees from entering, they’re not protestors. They’re interfering with the rights of others and should be arrested. https:  .   —   Ari Fleischer (@AriFleischer) January 20, 2017, “Rights” are only for people with the correct politics, Mr. Fleischer! The whole “occupy” strategy of the Left, from Occupy Wall Street through Black Lives Matter, is about forcing people to listen by illegally seizing property and blocking off roads. And then they wonder why so many people voted for Donald Trump when he said he’d get America moving again. Peaceful, tolerant protesters throw eggs, assault Trump supporters: Gateway Pundit reported on Trump supporters getting pelted with eggs, with one woman talking about how she was struck in the head several times: James Allsup reported he was ambushed by thugs in ski masks and beaten bloody. “I was wearing my ‘Make America Great Again’ hat, and a white male came up behind me and swung at me with a flagpole  —   I kind of blacked out for a minute. Before I knew it, my head was gushing blood  —   there’s blood on my Trump hat,” he told Fox News. “I’m all for disagreeing, I debate people all the time and I want to engage in these discussions, but they’re throwing bottles. I would be livid if people who supported Trump were doing this to Hillary supporters,” Allsup added. He posted photos of the aftermath on Twitter: Here are the graphic images of the assault aftermath before being treated by EMS and taken to the hospital. #Deploraballpic. twitter.   —   James Allsup (@realJamesAllsup) January 20, 2017, His Twitter feed quickly filled with caring, compassionate liberals who accused him of faking the blood, and even of faking his hospital report, but there is video of the entire assault, and you can see the thug waving his flagpole around:  That’s what you get for thinking you can walk around wearing whatever you want and expressing your opinions in a city under occupation by the Army of Tolerance, buddy. Anarchists unite! Sky News caught a menacing   crew marching around with anarchist flags and threatening slogans. Nothing brings people together like a little ISIS cosplay! The funny thing is, the same people are also given to protesting globalist trade meetings that very much believe in their “no borders, no nations” ideology.   Trump protests are taking place in Washington https:  .   —   Sky News (@SkyNews) January 20, 2017, The police have started arresting some of the   brigades, and they’re not taking it well: Police clash with protesters ahead of Donald Trump’s #Inauguration https:  .  pic. twitter.   —   Reuters Top News (@Reuters) January 20, 2017,  Socialist mayor shuts down his own city: Not all of the fun and frolic was taking place in D. C. New York City Mayor Bill de Blasio “caused traffic mayhem for his own political gains,” as the New York Post put it, by heading up a “massive   protest in Columbus Circle. ” The streets were lined with obstacles such as sand trucks and, eventually, Michael Moore. “It’s terrible, I just want to go home,” and “It’s irresponsible of the mayor,” and “I’m appalled at what’s happening here and I am angry at de Blasio” were among the comments from   New Yorkers collected by the Post. The rally ended up looking like this: It looks like the Left is dissolving into one big Godwin’s Law violation. They’re just so   that they get to pretend they’re brave heroes battling an evil dictator! These are the same people that tried, with considerable success, to shut down bakeries and pizzerias over ideological disagreements when they were in power. At this very moment, as seen above, they’re using violence to shut down the free speech of others. They’re displacing a huge amount of guilt for their own sins against democracy onto Trump’s shoulders. He should send them a bill for therapeutic services rendered. Vandalism and for peace and justice: Are the lefty mobs breaking windows and stealing stuff to express their commitment to “justice?” You bet they are! #BREAKING   protesters are now smashing windows on the streets of Washington. pic. twitter.   —   Doc Thompson (@DocThompsonShow) January 20, 2017,  #BREAKING: [VIDEO] More footage of   protestors destroying a @Starbucks #InaugurationDay #TrumpProtest pic. twitter.   —   Kris Cruz (@rc_kris) January 20, 2017, Damage to businesses up  down I st. pic. twitter.   —   Alex Emmons (@AlexanderEmmons) January 20, 2017,  Why do they always take out a Starbucks when they go nuts? The UK Independent says protesters also trashed a Bank of America branch, and there were “unconfirmed reports of looting. ” “Observers said the disorder appeared to be organised, with the   group splitting from a larger protest before launching the wave of vandalism,” the Independent adds. They even trashed a bus stop. Aren’t liberals supposed to love mass transportation? Bus bay smashed at   #wmata pic. twitter.   —   Faiz Siddiqui (@faizsays) January 20, 2017,  Lefty brigades show typical respect for American troops: Here’s a gang of protesters trying to prevent Air Force men from entering an inauguration checkpoint:   protesters block men in Air Force uniforms from entering the #Inauguration checkpoint. pic. twitter.   —   Breaking911 (@Breaking911) January 20, 2017,  What a great way to win hearts and minds! '"}, "time": 1742561669.152616}