{"duration": 0.14641284942626953, "input_args": {"text": "'Los emails de Hillary Clinton y la Hermandad Musulmana por Thierry Meyssan La investigación del FBI sobre los emails privados de Hillary Clinton ya no está relacionada con una negligencia en materia de normas de seguridad sino con un complot tendiente a sustraer a los servidores del gobierno federal todo rastro de su correspondencia. Esto parece incluir intercambios de mensajes sobre financiamiento ilegal o la corrupción de terceros vinculados a las relaciones del matrimonio Clinton con la Hermandad Musulmana y los yihadistas.\\nRed Voltaire | Damasco (Siria) | 1ro de noviembre de 2016 ελληνικά English français Türkçe русский Deutsch Hillary Clinton y la jefa de su equipo, Huma Abedin. La reactivación de la investigación del FBI sobre los mensajes privados de Hillary Clinton ya no tiene que ver con un problema de seguridad sino con una serie de manejos que pudieran llegar incluso a caracterizarse como crímenes de alta traición.\\nTécnicamente, en vez de utilizar los servidores de seguridad del Estado federal, la secretaria de Estado usó un servidor privado que había instalado en su domicilio para poder utilizar internet sin dejar rastros en una máquina del gobierno federal. El técnico privado de la señora Clinton había limpiado ese servidor antes de la llegada del FBI, de manera que ya no era posible saber el por qué de la instalación de ese dispositivo.\\nEl FBI observó inicialmente que el servidor privado no garantizaba el mismo nivel de seguridad que el servidor del Departamento de Estado. Por tanto, la señora Clinton había cometido una falta en materia de seguridad. Pero el FBI confiscó posteriormente el ordenador del ex miembro del Congreso estadounidense Anthony Weiner, el ex esposo de Huma Abedin, la jefa del equipo de trabajo de Hillary Clinton. Y en ese ordenador aparecieron una serie de correos electrónicos de la ex secretaria de Estado.\\nAnthony Weiner es un político judío, muy vinculado a los Clinton, que ambicionaba ser alcalde de Nueva York. Pero tuvo que dimitir como consecuencia de un escándalo esencialmente puritano: Weiner había enviado SMS eróticos a varias mujeres. Huma Abedin se separó de él oficialmente, pero en realidad no lo dejó.\\nHuma Abedin es estadounidense y se educó en Arabia Saudita. Su padre dirige una revista académica –en la que la propia Huma fue durante años secretaria de redacción–, publicación que recoge regularmente las opiniones de la Hermandad Musulmana. Su madre preside la asociación saudita de mujeres miembros de la Hermandad Musulmana y trabajaba con la esposa del presidente egipcio Mohamed Morsi, otro representante de la Hermandad Musulmana. Su hermano Hassan trabaja para el jeque Yusuf al-Qaradawi, el predicador y consejero espiritual de Al-Jazeera.\\nDurante un viaje oficial a Arabia Saudita, la secretaria de Estado visita el colegio Dar al-Hekma con Saleha Abedin –la madre de Huma– quien preside la asociación de Hermanas miembros de la Hermandad Musulmana. Huma Abedin es actualmente un personaje central de la campaña electoral de Hillary Clinton, junto a su director de campaña, John Podesta, quien fue jefe de personal de la Casa Blanca bajo la presidencia de Bill Clinton. Podesta es además el agente de influencia encargado de promover los intereses de Arabia Saudita en el Congreso de Estados Unidos, tarea por la cual percibe mensualmente la módica suma de 200 000 dólares. El 12 de junio de 2016, la agencia de prensa oficial de Jordania publicó una entrevista del príncipe heredero de Arabia Saudita, Mohamed Ben Salman, quien defendía la modernidad de su familia argumentando que la familia real saudita financió –ilegalmente– en un 20% la campaña electoral de Hillary Clinton… a pesar de tratarse de una mujer. Al día siguiente, la agencia anulaba el despacho que contenía esa información y afirmaba que su sitio web había sido pirateado.\\nSegún un despacho de Petra, la agencia oficial de Jordania, fechado el 12 de junio de 2016, la familia real de Arabia Saudita ha financiado ilegalmente un 20% de la campaña electoral de Hillary Clinton. Huma Abedin no es la única persona de la administración Obama vinculada a la Hermandad Musulmana:\\n El medio hermano del presidente, Abon’go Malik Obama, presidente de la Fundación Barack H. Obama, es también tesorero de la Obra Misionaria de la Hermandad Musulmana en Sudán. Abon’go Malik Obama se halla directamente a las órdenes del presidente sudanés Omar el-Bechir.\\n Un miembro de la Hermandad Musulmana es miembro del Consejo de Seguridad Nacional estadounidense. Desde 2009 hasta 2012, fue Mehdi K. Alhassani. No se sabe quién lo sustituyó, pero la Casa Blanca negaba que hubiera un miembro de la Hermandad Musulmana en el Consejo de Seguridad Nacional, hasta que se supo que Alhassani era efectivamente miembro de la cofradía.\\n Rashad Hussain, embajador de Estados Unidos ante la Conferencia Islámica, también pertenece a la Hermandad Musulmana.\\n Otros miembros de la cofradía debidamente identificados ocupan cargos menos importantes en la administración Obama. Pero vale la pena mencionar en particular a Louay M. Safi, actualmente miembro de la Coalición Nacional Siria y ex consejero del Pentágono.\\nEl presidente Barack Obama recibe a su medio hermano Abon’go Malik Obama en la Oficina Oval de la Casa Blanca. Abon’go Malik Obama es el tesorero de la Obra Misionera de la Hermandad Musulmana en Sudán. En abril de 2009, dos meses antes de pronunciar su famoso discurso en El Cairo, el presidente Obama recibió secretamente una delegación de la Hermandad Musulmana en la Oficina Oval. Anteriormente, había invitado a su investidura a Ingrid Mattson, la presidenta de la Asociación de Hermanos y Hermanas Musulmanes en Estados Unidos.\\nPor su parte, la Fundación Clinton empleó como responsable de su proyecto «Clima» a Gehad el-Haddad, uno de los dirigentes mundiales de la Hermandad Musulmana, quien había sido hasta entonces responsable de un programa de televisión coránica. Su padre fue uno de los cofundadores de la Hermandad Musulmana en 1951, cuando la CIA y el MI6 decidieron reactivarla. Gehad dejó la Fundación Clinton en 2012 para convertirse, en El Cairo, en vocero del entonces candidato a la presidencia de Egipto Mohammed Morsi, y posteriormente pasó a ser vocero oficial de la Hermandad Musulmana a escala mundial.\\nSabiendo que todos los líderes yihadistas del mundo provienen de la Hermandad Musulmana o de la orden sufí de los Naqchbandis –los dos componentes de la Liga Islámica Mundial– sería interesante tener un poco más de información sobre las relaciones de la señora Clinton con Arabia Saudita y la cofradía.\\nResulta, por otro lado, que en el equipo del adversario de Hillary Clinton, Donald Trump, está el general Michael T. Flynn, quien trató de oponerse a que la Casa Blanca creara el Emirato Islámico (Daesh) y dimitió de su cargo de director de la Defense Intelligence Agency (DIA, la Agencia de Inteligencia del Departamento de Defensa) en señal de protesta. Y junto a él, también como miembro del equipo de Trump, figura Frank Gaffney, un « cold warrior » histórico, actualmente catalogado como « complotista » por haber denunciado… la presencia de miembros de la Hermandad Musulmana en el gobierno federal.\\nPor supuesto, desde el punto de vista del FBI, todo respaldo a las organizaciones yihadistas constituye un crimen, sin importar la línea política de la CIA. En 1991, el FBI –y el senador John Kerry– provocaron la quiebra del BCCI –banco pakistaní registrado en las Islas Caimán y ampliamente utilizado por la CIA en todo tipo de operaciones secretas con la Hermandad Musulmana, el mismo esquema que esa agencia estadounidense de inteligencia suele emplear con los cárteles latinoamericanos de la droga.\\nThierry Meyssan'"}, "time": 1742564158.9880567}