{"duration": 0.10372328758239746, "input_args": {"text": "'Trump and all the other far right leaders are Zionist stooges ‹ › GPD is our General Posting Department whereby we share posts from other sources along with general information with our readers. It is managed by our Editorial Board General Soleimani in Mosul Operations Room, Cutting off ISIS Retreat to Syria By GPD on October 28, 2016 TEHRAN (FNA)- Commander of the Quds Force of the Islamic Revolution Guards Corps (IRGC) Major General Qassem Soleimani has arrived in Hashd al-Sha’abi (popular forces) operations room in Mosul to play his advisory role in anti-ISIL campaign in Iraq, Arab media reported on Wednesday. “Hashd al-Sha’abi will soon start its operations in Western Mosul to cut the ISIL’s supply routes to Syria and defuse the US plots to postpone the popular forces’ participation in the Mosul operations, and General Soleimani has also joined them as a military advisor,” the Arabic-language al-Akhbar said quoting renowned Iraqi figures. No other source has yet confirmed the report. Washington is pressuring Iraqi Prime Minister Haider al-Abadi not to allow Hashd al-Sha’abi forces to participate in the Mosul liberation operations. Spokesman of the Iraqi popular forces Ahmad al-Assadi had confirmed in August that General Soleimani would play a major role in operations to liberate Mosul, stressing that his country is in dire need of Iranian military advisors. “The presence of Brigadier-General Soleimani in the operations to free Mosul and Nineveh province is necessary and General Soleiman is the greatest advisor that has helped the Iraqi government in the war against the ISIL,” al-Assadi told FNA. “Hajj Qassem Soleimani is one of the most important military advisors of the Islamic Republic of Iran who is in Iraq at the invitation, demand and agreement of the Iraqi government,” he added. Stressing that the Iranian advisors are in Iraq at the demand of the Iraqi government and have played a big role in most operations conducted by the popular forces, al-Assadi said, “They provided the Iraqis with strong views and important consultations with respect to their experience and capabilities.” In relevant remarks in June, Iraqi Foreign Minister Ebrahim al-Jafari underlined that General Soleimani is in Iraq to help the country in campaign against terrorism after receiving Baghdad’s rigid request. “General Soleimani is in Iraq at the invitation of the Iraqi government to provide military counseling to the Iraqi forces,” the Arabic-language Sumeria news channel quoted al-Jafari as saying. Also in June, Hashd al-Sha’abi Commander Abu Mehdi al-Mohandes underlined that General Soleimani is helping the Iraqi forces in their campaign against terrorism upon a request by the Iraqi government. “The Iranian advisors, headed by dear brother Qassem Soleimani, have been beside us since the start of war and his presence has happened upon the demand of the Iraqi government and agreement of the Armed Forces’ top commander,” Mohandes said in an interview with Sumeria news channel. He, meantime, said that the Iraqi nation is able to kick the terrorists out of Iraq with the possibilities in their hands now, adding that Hashd al-Sha’abi doesn’t have any political plan and merely supports the political process. Related Posts:'"}, "time": 1742562313.1589434}