{"duration": 0.04590415954589844, "input_args": {"text": "'Pinterest \\nThe leaders of the militia who temporarily occupied a national wildlife refuge in Oregon have been acquitted on charges related to the standoff. \\nThe 41-day “occupation” brought heightened attention to a decades-long dispute over control of federal lands in the U.S. West. \\nA jury in Portland found brothers Ammon and Ryan Bundy not guilty of possession of a firearm in a federal facility and conspiring to impede federal workers from their jobs at the Malheur National Wildlife Refuge, some 300 miles southeast of Portland, The New York Post is reporting . \\n\\nDespite this acquittal, the brothers are still expected to stand trial in Nevada early in 2017, on charges stemming from another controversial standoff with federal authorities. The feds rounded up cattle at their father Cliven’s ranch in 2014, alleging unpaid grazing fees, but they faced armed protesters. \\nThe brothers are part of a Nevada ranching family embroiled in a lengthy fight over the use of public range, and their occupation drew an international spotlight to a uniquely American West dispute: federal restrictions on ranching, mining and logging to protect the environment. The U.S. government, which controls much of the land in the West, says it tries to balance industry, recreation and wildlife concerns to benefit all. \\n“We are just so excited,” Angie Bundy, Ryan’s wife, told the Guardian after the verdict was announced. “We’ve been praying hard, and we knew they hadn’t done anything wrong.” \\nThe Post is reporting that the trial seemed like an open-and-shut case. There was no dispute that the group actually seized the refuge, established armed patrols, and vetted visitors. \\n\\n“Ladies and gentlemen, this case is not a whodunit,” Assistant U.S. Attorney Ethan Knight said in his closing argument, arguing that the group decided to take over a federal workplace that didn’t belong to them. \\nBut federal prosecutors took two weeks to present their case, finishing with a display of more than 30 guns seized at the standoff, testifying to 16,636 live rounds and 1,700 spent casings were found. \\nDespite the evidence, the brothers were found not guilty, suggesting that the jury – along with the American people – are growing weary of continued government interference in local land use issues.'"}, "time": 1742562958.9990463}