{"duration": 0.0939626693725586, "input_args": {"text": "\"Bill Clinton: When Trump Says ‘Make America Great Again,’ He’s Blowing A Dog Whistle (TWEET) By Darrell Lucus   \\nDonald Trump has spent most of the campaign blowing dog whistles to his supporters. For instance, he’s gone as far as to claim that Hillary Clinton is in cahoots with “international banks” –a “polite” term for “Jews.” Well, Bill Clinton told a crowd in North Carolina that Trump’s campaign slogan may be the biggest dog whistle of all. \\nThe Big Dog was on the stump with state attorney general and Democratic gubernatorial candidate Roy Cooper in Cooper’s hometown of Rocky Mount. While pushing his wife’s economic and education plans, Clinton said that when Trump says he wants to “make America great again,” he’s all but announcing that he wants to stick it to the poor and minorities. “I’m a white southerner – I know what ‘Make America Great Again’ means, and all of you of a certain age know exactly what it means. I didn’t fall off this truck yesterday, I’ve heard this song a long time. It means first, I’ll give you the economy you had 50 years ago, and second, I’ll give you the society you had 50 years ago: I’ll move you up and move somebody else down.” \\nBill actually used the slogan himself during his 1992 campaign. However, he’s not at all fond of Trump’s idea of greatness. \\nThis largely continues a theme Hillary has kept up for the entire campaign–trolling Trump’s faux-populist slogans. If you’ll remember, when Trump tried to counter the popular Hillary hashtag “#ImWithHer” with one of his own, “#ImWithYou,” Hillary’s campaign team called it out for the dog whistle that it was. You* \\n— Hillary Clinton (@HillaryClinton) June 22, 2016 \\nAt least one Trump supporter has already admitted that “Make America Great Again” is a dog whistle. Earlier, when one of Trump’s delegates from California, William Johnson, was outed as a white supremacist, he said that Trump wants to roll things back to the days when women were expected to stay in the kitchen. \\nDespite the retrograde vision Trump has for the country, Clinton urged the crowd in Rocky Mount not to return the hate Trump and his supporters have displayed with hate of their own. “Do not treat them with the anger they often display toward us – love them to death. Look at them and say, ‘we need you.'” \\nThat, ladies and gentlemen, is why America is already great. Perhaps someone needs to remind Trump of that. After all, he’s going to get a very sobering reminder of this on Election Day. \\n( featured image courtesy Gage Skidmore, available under a Creative Commons BY-SA license) About Darrell Lucus \\nDarrell is a 30-something graduate of the University of North Carolina who considers himself a journalist of the old school. An attempt to turn him into a member of the religious right in college only succeeded in turning him into the religious right's worst nightmare--a charismatic Christian who is an unapologetic liberal. His desire to stand up for those who have been scared into silence only increased when he survived an abusive three-year marriage. You may know him on Daily Kos as Christian Dem in NC . Follow him on Twitter @DarrellLucus or connect with him on Facebook . Click here to buy Darrell a Mello Yello. Connect\""}, "time": 1742562004.0441089}