{"duration": 0.0594172477722168, "input_args": {"text": "'Black   conservative author and activist Mason Weaver says after taking a beating for civil rights, Rep. John Lewis ( .) joined his “oppressors” in the Democratic Party and has since assisted in the “destruction of black America. ”[“He was fighting Democrats. And after they beat his behind on the [Edmund Pettus Bridge in 1965] and ran over him and stumped him in the ground, he got up and turned and joined,” Weaver said Monday on Tucker Carlson Tonight.   “He joined the oppressors and became a stooge for them,” Weaver said of Lewis, who is “now sitting and presiding over the destruction of the black community the destruction of black men the destruction of black women, with drugs and gangs. ” “He more concerned about Trump being the illegitimate President,” Weaver said, “but John Lewis is the illegitimate Congressman. ” Weaver was responding to the war of words between   Donald Trump and Rep. Lewis. On Friday, Lewis described Trump’s election as “illegitimate” because of a Russian “conspiracy. ” “I don’t see the   as a legitimate president. I think there was a conspiracy on the part of the Russians, and others, that helped him get elected,” Lewis told NBC’s Chuck Todd. Trump fired back, urging the Georgia Democrat to “spend more time on fixing and helping his district, which is in horrible shape and falling apart (not to mention crime infested) rather than falsely complaining about the election results. ” However, Weaver believes the spotlight should be turned on the longtime Democratic lawmaker and his record. “He has presided over the worst school system in the world, where black people are learning to only be gang prep,” Weaver said of Lewis. “I’m outraged that the demonstration that he had early in his life has turned into a subjugation of his right and authority as a black leader. ” Weaver says not only has Lewis failed his constituents  —   which consist of most of Atlanta, Georgia  —   but the “Congressional Communist Black Caucus that has every district they own and control is a ghetto hellhole. ” Weaver challenged Rep. Lewis to “apologize” to the American people for joining the Democratic “party of abuse,” which has “always been the party of the Klan the party that went to war to keep slaves the party that’s always been the destruction of black people. ” Rep. Lewis “has gotten rich and his people have gotten poorer,” Weaver said. “The black caucus has gotten more power and influence, and the black people they preside over have gotten poorer  —   more drugs, more gangs, less businesses, less home ownership, less education, more jails. ” Follow Jerome Hudson on Twitter: @jeromeehudson'"}, "time": 1742563072.2686021}