{"duration": 0.053223371505737305, "input_args": {"text": "'Biological dentistry - Solving disease symptoms holistically \\nThursday, October 27, 2016 by: Jonathan Landsman Tags: biological dentistry , mercury amalgam , Griffin Cole (NaturalNews) When it comes to repairing cavities, amalgam - or \"silver\" - fillings have been the method of choice for most conventionally-trained dentists, accounting for 75 to 80 percent of all fillings. The problem is: amalgam fillings contain mercury - one of the most toxic substances on the planet. Of course, the American Dental Association (ADA) continues to insist mercury fillings are \"safe,\" – even as biological dentistry warns the public about its link to neurological problems, cardiovascular disease and birth defects.Fortunately, non-toxic alternatives - such as those utilized by Dr. Griffin Cole, a leading expert in biological dentistry - do exist. Discover the healing benefits of biological dentistry and how to REVERSE disease symptoms naturally . On the next NaturalNews Talk Hour, Jonathan and Griffin Cole, DDS, NMD will explore the link between poor oral health and chronic disease. Find out how mercury-based fillings, root canal treated teeth, cavitations - plus much more - can threaten your health! To hear this FREE show – visit http://www.naturalhealth365.com/free-shows and enter your email address for show details plus some great gifts! Biological dentistry offers a solution to outdated and dangerous dental procedures Dr. Cole points out that the dangers are mercury are so acute that certain products - such as thermometers and mercurochrome – have been completely redesigned to rid them of the heavy metal. Yet dentists across the nation continue to use mercury fillings for their patients - on a daily basis. Although the ADA insists combining mercury with other metals in the fillings renders it \\'harmless,\\' Dr. Cole maintains that this is not true - mercury heats up on contact with warm foods and beverages in the mouth, releasing vapors which are then inhaled by the lungs.An increasing number of dentists bill themselves as \"mercury-free\" and \"mercury-safe.\" Although both oppose the use of mercury, they are not interchangeable. While mercury-free dentists choose not to use mercury-containing amalgams under any circumstances, mercury-safe dentists go a step farther - they are trained to remove existing mercury amalgams by using a specialized protocol advised by the International Academy of Oral Medicine and Toxicology.This mercury removal protocol is designed to protect patients, staff and the environment; involves the use of specialized tools, as well as precautions to ensure that mercury doesn\\'t end up in wastewater.Join us for the next NaturalNews Talk Hour and discover what you need to know BEFORE your next visit to the dentist. To hear this FREE show – visit http://www.naturalhealth365.com/free-shows and enter your email address for show details plus some great gifts! Safe, chemical-free ozone destroys disease-producing bacteria and inflammation Non-toxic composites aren\\'t the only advancement in biological and holistic dentistry . Ozone therapy is gaining ground as a natural, chemical-free way of attacking infections, gum disease and other health-threatening dental problems.Gum disease, also called periodontal disease, affects a shocking 50 percent of all Americans. (many experts say that number is much higher) It not only affects the stability of teeth, but can lead to a chronic inflammatory state that depletes the body\\'s store of antioxidants and increases the risk of diabetes and heart problems. In fact, scientists have found that the bacteria responsible for gum disease , Streptococcus sanguis, can move through the bloodstream to the heart, causing inflammation and setting the stage for heart disease and stroke.By the way, antibiotics have little effect, Cole reports, as bacteria have shown they are able to mutate and quickly become resistant.In addition, traditionally-performed root canals create their share of infections, as well. According to Dr. Cole, conventional root canals fail because the dentinal tubules can\\'t be effectively cleaned, causing ongoing infection beneath the surface - even after tooth has been restored and looks intact.Join us for a great show about how Dr. Cole uses ozone therapy to kill infections plus many other ways to properly take care of your oral health to avoid disease. This week\\'s guest : Griffin Cole, DDS, NMD – a leading expert in biological dentistry and natural medicine Find out how biological dentistry can help YOU eliminate disease symptoms naturally - Sun. Oct. 30Griffin Cole, DDS, NMD earned his dental degree from the University of Texas Health Science Center, San Antonio Dental School and has been practicing dentistry for over 20 years. Dr. Cole is a member of the American Dental Association, the Academy of General Dentistry, the Texas Academy of Cosmetic Dentistry, the Integrative Biologic Dental Medicine Specialty (IBDM), and the International Academy of Oral Medicine and Toxicology – where Dr. Cole earned his fellowship and has served as President of this esteemed organization.In addition, Dr. Cole has Naturopathic Medical Doctor Board Certification, along with a degree in Integrative Biologic Dental Medicine. As the leader in mercury-safe dentistry, Dr. Cole participates in continuing education on a regular basis, and is well aware of new and improved technology and dental advancements which help him to provide his patients with the best, up-to-date techniques available. To hear this FREE show – visit http://www.naturalhealth365.com/free-shows and enter your email address for show details plus some great gifts!'"}, "time": 1742628561.5340483}