{"duration": 0.025701284408569336, "input_args": {"text": "'0 comments \\nMan, you’ve got to hand it to WikiLeaks, for being such a hero in these last seconds of the race when the truth is needed the most. A new batch of damning evidence has just dropped and this time…what was found in them has to do with Bill Clinton…AND Bill Cosby. \\nPop some popcorn, you’re in for a treat… \\nFurther proof Democrats are my favorite definition of ‘stupid’ \\nThey see the truth, they know the truth, still decided to push the lie…. \\nThis latest little revolution comes from an email in which Ron Klain, Chief of Staff to Joe Biden, posited a rather obvious series of questions to Camp Cankles: \\na. Is [Bill’s] conduct relevant to your campaign? b. You said every woman should be believed. Why not the women who accused [your husband]? c. Will you apologize to the women who were wrongly smeared by your husband and his allies? d. How is what Bill Clinton did different from what Bill Cosby did? \\nWell hey, and this whole time we thought the Democrats were trying to ignore Cosby! He’s getting some attention after all. \\nInterestingly, Jake Sullivan of Camp Cankles couldn’t come up with an answer to Klain’s question. So he punted to John Podesta. \\nOkay, so while the campaign is doing everything they can to target Donald Trump for his alleged nastiness, a the way back in January of this year, Clinton’s campaign was wondering how they were going to handle Hillary’s rapey chain and balls. \\nNot only that, at least Ron Klain noticed that Hillary was being a dastardly hypocrite on the rape issue. “b. You said every woman should be believed. Why not the women who accused [your husband]? c. Will you apologize to the women who were wrongly smeared by your husband and his allies?” \\nHillary’s camp knew the issue would come up, sure. They were prepping their candidate for all the cannon balls lobbed her way. Because even the campaign knew Hillary couldn’t hide behind a tampon-shield for everything. Especially a “woman’s” issue. Like her husband raping the ladies. \\nJust goes to show even the Democrats knew Billy’s rapescapades were a problem. \\nYIKES! This right here is what might be going into the White House. People that don’t seek the truth, but scramble to hide it with further lies and scheming ideas. \\nIt’s sickening…but mostly, terrifying. To have this kind of crap in the White House…spells doom. Related Items'"}, "time": 1742628576.1449816}