{"duration": 0.04523658752441406, "input_args": {"text": "'ESPNW, the site which focuses on women’s sports, has apparently also decided to start focusing on women’s political activism. [ESPNW chose Donald Trump’s Inauguration Day to tweet out a call for people participating in Saturday’s Women’s March to share their stories with the “sports” network:   The organizers of the Women’s March are radical leftists who have billed the march as an effort to support every leftist initiative under the sun. Here’s how Women’s March   Carmen Perez describes the purpose of the march, “We are coming here so that we could show this new administration that we’re not going anywhere, right? So, we are marching to continue to allow women to make decisions about their bodies and ensure we have reproductive justice rights, immigration reform, criminal justice reform, as well as indigenous rights. “So, there are so many things. We have been extremely intentional about allowing organizations to get involved, Planned Parenthood, as well as Define American. ” Clearly this march is no benign event. On the contrary, it’s a highly politicized march organized by committed leftists who oppose Donald Trump. Which begs the question, why would a sports network would allow their social media platforms to become a multiplier for activists demonstrating against President Trump? Unless, ESPN’s commitment to covering women’s sports is no honest effort to give special attention to female athletes, and instead represents another venue in which the leftist sports network can further indoctrinate and radicalize under the guise of diversity and inclusivity. A truth reinforced by the fact that ESPN didn’t make any of their social media platforms available to Trump supporters, so they could share their videos and memories of Inauguration Day. Just in case anyone needed reminding of why ESPN has lost over 9 million subscribers over the least three years  …    this is why. Follow Dylan Gwinn on Twitter: @themightygwinn'"}, "time": 1742563394.4002328}