{"duration": 0.14708352088928223, "input_args": {"text": "'WASHINGTON  —   President Trump, seeming to relish a fight with Democrats over his nominee to the Supreme Court, encouraged the Senate majority leader, Mitch McConnell, on Wednesday to invoke the   nuclear option and abandon the   threshold for confirmation. “If we end up with that gridlock, I would say, ‘If you can, Mitch, go nuclear,’” the president said. Democrats are weighing strategies for opposing the nomination of Judge Neil M. Gorsuch and debating how aggressively to pursue a battle over a seat that many of them believe was stolen from their party. In selecting a respected, deeply conservative jurist, Mr. Trump has dared Democrats to pursue the kind of blanket obstructionism that they long accused Republicans of embracing during the Obama administration. “That would be an absolute shame if a man of this quality was put up to that neglect,” he said from the Roosevelt Room of the White House. For the Democrats, who have struggled to match the fury and zeal of the party’s base during the wave of   activism since the election, a   showdown may prove unavoidable, doubling as a referendum on resistance tactics to a White House that liberals fear. Democrats intend to repeatedly remind the public about the Republicans’ treatment of Merrick B. Garland, President Barack Obama’s nominee to fill the vacant seat last year, who was blocked from even receiving a hearing. Mr. McConnell had said a justice should not be seated during an election year, even though there is no prohibition on such action. Now, their gambit successful, Republicans will seek to capitalize on the groundwork laid since Mr. Trump’s election. Leading conservative groups have united for a   campaign to help Judge Gorsuch, producing television commercials, planning gatherings at megachurches and contacting supporters to encourage them to demand a vote from their senators. For Republicans who were leery of Mr. Trump’s campaign last year, the prospect of adding a conservative to the court was often a powerful motivator to stay in line. He has rewarded their faith. On Wednesday, as Judge Gorsuch made his initial courtesy visits to senators on Capitol Hill, Republican lawmakers assumed the tone of a party in power, appealing for unity and adherence to Senate custom. Judge Gorsuch’s first call after the announcement of his nomination was to Mr. Garland, as a gesture of respect, according to Ron Bonjean, a spokesman for the nomination effort. The nominee was also joined on Wednesday by Kelly Ayotte, a   former Republican senator from New Hampshire, who is helping to shepherd him through the nominating process months after losing her   bid. After greeting Judge Gorsuch during his visit, Mr. McConnell asked Democrats to heed their own calls to restore the court to its rightful size. “I would invite Democrats who spent many months insisting we need nine to join us in following through on that advice,” he said from the Senate floor. So far, Democrats have appeared unmoved, and occasionally seething. Senator Chuck Schumer of New York, the minority leader, said Judge Gorsuch  —   who sits on the United States Court of Appeals for the 10th Circuit  —   must meet the   threshold required to overcome a filibuster in the Senate. History  —   and especially recent history  —   demand it, he suggested. “This is nothing new. It was a bar met by each of President Obama’s nominations,” Mr. Schumer said. He argued that if Judge Gorsuch could not attract enough support, “the answer will not be to change the rules of the Senate, but to change the nominee to someone who can earn 60 votes. ” He added that Mr. Trump’s White House had demonstrated “less respect for the rule of law than any in recent memory,” placing a “special burden on this nominee to be an independent jurist. ” Breaking a filibuster would require eight members of the Democratic caucus to join the 52 members of the Republican majority to advance the nomination, or force Republicans to change longstanding rules and push through the nomination on a simple majority vote. Transfers of power from one party to the other often compel lawmakers to shift their perspectives, leaning on arguments they once rejected. But the bipartisan whiplash in the Senate has been especially striking. Since Mr. Trump’s announcement, the two parties have rushed headlong into an embrace of the other’s former talking points. Republicans have cast Judge Gorsuch as an unassailable choice, as Democrats did with Judge Garland, trumpeting his appeals court record and his impressive credentials. They reminded some Senate Democrats that they had voted to confirm Judge Gorsuch to a lower court once upon a time, as some Republicans had for Judge Garland. Senators like Ted Cruz, Republican of Texas  —   who, before the election, raised the possibility of blocking a nomination indefinitely if Hillary Clinton won the presidency  —   have insisted on swift action. And some Democrats have argued, after nearly a year spent lamenting the vacancy on the court since Justice Antonin Scalia’s death, that Judge Gorsuch must not be allowed to assume the seat. “The Democrats should treat Trump’s SCOTUS pick with the exact same courtesy the GOP showed Merrick Garland,” Dan Pfeiffer, a former senior adviser to Mr. Obama, wrote on Twitter. “Don’t flinch, don’t back down. ” Reactions to Judge Gorsuch’s nomination among Democrats seemed to sort themselves into three camps: There were some cautious statements, often from moderate Democrats in states that Mr. Trump won, urging careful consideration of the pick. There were   concerns raised about Judge Gorsuch’s trail of conservative opinions and leanings. And there were arguments that did not focus much on Judge Gorsuch at all, instead framing the choice of any judge not named Merrick Garland as illegitimate. “This Supreme Court seat was stolen from the Obama administration,” Senator Jeff Merkley, Democrat of Oregon, said on Wednesday. “It casts a big shadow over it. If this seat is filled in this manner, it’s going to undermine the integrity of the court, the legitimacy of the court, for decades to come. ” Senator Richard Blumenthal, Democrat of Connecticut and a member of the Judiciary Committee, struck a more conciliatory note, to a point. “Republicans were outrageously wrong in denying Merrick Garland a hearing and a vote. But two wrongs don’t make a right,” he said in an interview. “We should support a hearing and a vote for Neil Gorsuch. It’s part of the Senate’s job. ” He added, though, that Judge Gorsuch should be required to clear 60 votes. In the interim, Democrats and progressive activists have begun zeroing in on elements of Judge Gorsuch’s record. Among their concerns is the fact that he has voted in favor of employers, including Hobby Lobby, who cited religious objections in refusing to provide some forms of contraception coverage to female workers. Mr. Schumer said Judge Gorsuch had “repeatedly sided with corporations over working people” and demonstrated “a hostility toward women’s rights. ” Even before many Democrats weighed in, Republicans dismissed any complaints about Judge Gorsuch as empty posturing. Some senators were more creative than others. “Senator Schumer is about to tell Americans that Judge Gorsuch kicks puppies and heckles piano recitals,” Senator Ben Sasse, Republican of Nebraska, said. That, he hastened to add, was untrue.'"}, "time": 1742562185.242864}