{"duration": 0.04422116279602051, "input_args": {"text": "'0 comments It is meant to be fun, but this video actually reveals quite a bit about 50 BMG ballistics. Surprisingly, the Internet is blowing up about our hero’s political hat, as well. Happy Halloween! The .50 Browning Machine Gun, or 50 BMG, is simply terrifying. The 12/7 X 99 MM NATO cartridge was developed in the late 1910’s, and has been manufactured in a number of variants: regular ball, armor piercing, tracer, incendiary, or even saboted sub-caliber rounds. Some rifles, like the one in this video, use magazines, while machine guns often use metallic links. The round is based on a scaled-up .30-06 cartridge and the ballistics are completely insane! Snipers can fire at long ranges, more than a mile away, and avoid contact with the enemy by changing positions on retreating before they are discovered. Modern 50 BMG rounds can produce between 10,000 and 15,000 foot pounds of energy while suffering from less drift from cross-winds than smaller, lighter projectiles. Originally, John Browning intended for this round to be used in World War I anti-aircraft weapons. Armor-piercing incendiary variants were proven to be effective not only against aircraft, but also structures, concrete bunkers, and some armored vehicles. There are a number of military and law enforcement applications for the 50 BMG round. The US Coast Guard uses it to disable boat engines, often firing from a helicopter. Similarly, police departments use the round to disable vehicles by firing it into the engine block. As mentioned earlier, military snipers have used the round for some time, with Marine Carlos Hathcock recording a successful shot at 2,286 yards! The longest confirmed kill with a 50 BMG has been credited to Canadian Army Corporal Rob Furlong, who shot a combatant in Afghanistan at 2,657 yards in 2002. So, the 50 BMG is effective in a number of ways. Many consider it to be effective at creating massive amounts of fun. No doubt, firing this awesome round through a big pile of pumpkins qualifies. Enjoy, and Happy Halloween!'"}, "time": 1742564411.645123}