{"duration": 0.07244706153869629, "input_args": {"text": "'Donald J. Trump on Tuesday refused to endorse two leading Republicans  —   the House speaker, Paul D. Ryan of Wisconsin, and Senator John McCain of Arizona  —   in their primary election campaigns. Mr. Ryan and Mr. McCain have both endorsed Mr. Trump for president, but they have criticized his denouncement of Khizr and Ghazala Khan, the parents of Capt. Humayun Khan, who was killed in Iraq in 2004. “I like Paul, but these are horrible times for our country,” Mr. Trump told The Washington Post. “We need very strong leadership. We need very, very strong leadership. And I’m just not quite there yet. I’m not quite there yet. ” Mr. Trump had signaled support for Mr. Ryan’s   primary opponent, Paul Nehlen,  in a Twitter message on Monday night, thanking him for his “kind words. ” The nominee’s “not quite there yet” wording echoed language that Mr. Ryan used in May when he was still wavering on whether to get behind Mr. Trump. Mr. Trump also singled out Mr. McCain, telling The Post: “I’ve never been there with John McCain because I’ve always felt that he should have done a much better job for the vets. ” The comments are a significant break in the steps toward party unity that Republican officials have been stressing since their convention last month. The remarks are also an indication that the party is still struggling to heal some of the wounds from Mr. Trump’s primary campaign. After Khizr Khan rebuked Mr. Trump at the Democratic National Convention, Mr. Trump traded in religious stereotypes by suggesting that Mr. Khan might have prevented his wife from speaking at the event. Mr. Ryan said in a statement on Sunday that he rejected Mr. Trump’s proposed Muslim immigration ban as “not reflective of America’s fundamental values. ” He added: “Many Muslim Americans have served valiantly in our military and made the ultimate sacrifice. Captain Khan was one such brave example. His sacrifice  —   and that of Khizr and Ghazala Khan  —   should always be honored. Period. ” Mr. McCain followed with a lengthy statement on Monday, saying: “I cannot emphasize enough how deeply I disagree with Mr. Trump’s statement. I hope Americans understand that the remarks do not represent the views of our Republican Party, its officers or candidates. ”'"}, "time": 1742562147.8292298}