{"duration": 0.04457855224609375, "input_args": {"text": "'During Kathy Griffin’s press conference to discuss the firestorm surrounding her Donald Trump “beheading” photo Friday morning, the comedian was asked about an interview she gave to Vulture in December in which she said was happy to “deliver a beat down” to Trump’s youngest son,    Barron Trump. [“It’s not about trying to be an   offender anymore because Hillary got such a beat down. It’s his turn. So I’m happy to deliver beat down to Donald Trump  —   and also to Barron,” Griffin told Vulture at the Equality Now Gala on December 9.  “You know a lot of comics are going to go hard for Donald, my edge is that I’ll go direct for Barron. I’m going to get in ahead of the game,” she added. . @kathygriffin admitted in December that she was going after Barron Trump. Now she’s crying misogyny at the direction of @LisaBloom. Moron. pic. twitter.   —   John Cardillo (@johncardillo) June 2, 2017,  When asked about the quote Friday morning, Griffin’s attorney, Lisa Bloom, said it had been given “years ago,” while Griffin said it had been a part of her act, when in fact, she said it in an interview with Vulture less than one year ago. “You’re talking about something from a comedy act years ago, I think,” Bloom said. “We can have edgy comics in America. Comics can say things that are not appropriate for children. Comics can create images that are not appropriate for children  …     it is not the job of a comic to filter everything down to the level of an   . ” Griffin later said during the press conference that she “would never want to hurt anyone, especially a child. ” TMZ reported this week that Barron Trump panicked after he saw the image on television, because he did not know who Griffin was or the context in which the photograph was taken. For more on Friday’s press conference, read Breitbart’s coverage here.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742561996.5224059}