{"duration": 0.09256720542907715, "input_args": {"text": "'He has been the host of the Emmy Awards, the ESPY Awards, the American Music Awards, the “Comedy Central Roast of Pamela Anderson” and, for 14 years, his ABC   show “Jimmy Kimmel Live! ,” so it’s only fair that Jimmy Kimmel should at last be allowed to host the Academy Awards. He’ll finally get his chance this Sunday, the first time in nearly a decade that a working   star will be M. C. of the Oscars. Mr. Kimmel, 49, is taking on this award show in a year when there doesn’t seem to be much mystery about which major nominees will win. And he’ll have to find a way to connect with a nationwide audience at a fractious time, when political tempers are running high. So, no pressure there. As Mr. Kimmel said in a recent telephone interview, speaking from the El Capitan Theater in Los Angeles where “Jimmy Kimmel Live!” is produced: “I’ve come to terms with the fact that someone is going to be disappointed in me at the end. I just don’t know who it will be yet. ” Days before he steps onto the Dolby Theater stage, in front of tens of millions of people, Mr. Kimmel spoke about the challenges of making this show while still working his day job and trying to find a sweet spot between a program with too much political content and one with not enough. These are edited excerpts from that conversation. How are the preparations going? Where do you even find the time? What, am I supposed to be planning something? I was thinking I would wing it. No one’s ever done that before. We’ll do some crowd work and see how it goes. [Laughs] We do it in whatever spare time we have. After the show, I usually spend an hour or two on the Oscars, and dedicate Fridays to   and planning and interviews and meetings, promo shoots. Eventually it adds up. Does hosting a nightly talk show better prepare you for a challenge like this? When you do a show every night, hosting an awards show doesn’t seem as monumental a task as it might. Really, when you break it down, it’s like a   monologue and a couple of taped pieces, then some intros and jokes along the way. You have to give out awards for all the categories, and you want to keep the show under nine hours long. You don’t have a ton of room to play with. Are you approaching this as a potential audition to host again in future years?  That’s definitely not something I have in mind. [Laughs] You never know how these things have gone until you step offstage and read what a bunch of strangers thought. All your friends tell you it was great, no matter what you did, and your mother thinks it’s wonderful. Obviously it’s an honor, but the workload cannot be ignored. How do you make peace with this? It’s not even really about the work  —   it’s the anxiety leading up to the event itself, and the general malaise that I put my family through. I said to my wife this morning, “What if, to save time, instead of using the word ‘categories,’ we just called them ‘cats’?” And she pointed out that I would waste more time just explaining that. Given recent award shows and the general tenor of the moment, are you expecting a lot of political speeches? Is there a point where that becomes too much? There definitely is a point at which that becomes too much. There’s also a point at which it becomes too little. And finding that balance is, for me, the most difficult hurdle, when it comes to this broadcast. We don’t know what our mood in this country is going to be on Sunday. We seem to be in a very temperamental period. We’re having wild mood swings as a nation right now. Hopefully everyone will be in a good mood that night. Given that Donald J. Trump won the presidency and the Patriots won the Super Bowl, does that ensure that “La La Land” will win best picture? I don’t know if they go   . But my plan is, I’m going to tank the first half of the Oscars. And then lead a furious comeback in the second four hours. Do you also see this as an opportunity to promote your ABC show? Well, let’s be honest: There’s a good chunk of America that doesn’t know that Jimmy Fallon and I are different people. So I’m not going to go into this presuming that they know me and all my bits. You need to approach this without any ego. If there’s too much inside stuff, it won’t work. So we shouldn’t expect to see Guillermo in any Oscars bits? I think that would be confusing to a lot of people. He’ll be working anyway  —   out on the red carpet, corralling people. People are shocked to hear that we have a show the next night and all week after that. It’s not like we can relax after it  —   we’ve got to get right back on the pony. There’s no point, really, to doing this if you don’t carry that momentum into your nightly show. In recent weeks, Stephen Colbert’s “Late Show” has been drawing more viewers than Jimmy Fallon’s “Tonight Show. ” Do you think it’s a sign that audiences want more pointed topical comedy? This is all fake news. [Laughs] I mean, that’s a very simple way of looking at the ratings. People seem to forget how important your   is, too. When “The Voice” comes back, so will the ratings of “The Tonight Show. ” We’re all pretty lucky right now  —   all the   shows  —   that more people are watching and reacting. I think everyone loves to have a story line, and people get excited if the tide is turning. But any mathematician would bang you over the head with his calculator. There’s a category of   hosts  —   Mr. Colbert, Seth Meyers, Samantha Bee, John Oliver, Trevor Noah  —   who seem to own the   beat. Do you worry about being left out of this group? It doesn’t worry me. I think it’s wrong. If anything, my concern is, do we do too much Trump stuff on the show? My monologue is at least 50 percent Donald Trump, and it’s not all light commentary. My focus is to comment on what people are talking about. It just so happens that this is what people are talking about. Right now, you go to dinner, and everyone wants to talk about Donald Trump the whole time. Love ’em or hate ’em, he is Topic No. 1, 2 and 4. Would you want to host this year’s White House Correspondents’ Association dinner? If it seemed like it was going to be very uncomfortable, I would consider it. I’m attracted to that kind of situation. But I don’t know that it would be worth all the blowback. I did it once  —   it went well. Why put myself through that nightmare again? My dream is to be only saddled with doing [the talk show]. That would be just fine with me.'"}, "time": 1742563829.7404745}