{"duration": 0.03345775604248047, "input_args": {"text": "'Donnerstag, 10. November 2016 Offizieller Friseur des Weißen Hauses erlitt am Wahlabend Nervenzusammenbruch Washington, D.C. (dpo) - Zu einem tragischen Zwischenfall ist es während der US-Präsidentschaftswahl am Dienstagabend in Washington gekommen. Wie erst heute bekannt wurde, musste der Friseur des US-Präsidenten kurz nach Bekanntgabe der ersten Wahlergebnisse ins Krankenhaus eingeliefert. Die Pressestelle des Weißen Hauses bestätigte den Vorfall. Demnach ging Arthur McMellow, der seit 31 Jahren im Amtssitz des Staatsoberhauptes für den perfekten Look der präsidialen Haarpracht zuständig ist, voller Euphorie zu einer Wahlparty in den Keller des Weißen Hauses, wo auch andere Mitarbeiter den Verlauf der Wahl verfolgten. \"Anfangs war er wie wir alle sehr zuversichtlich und freute sich auf die Nacht\", erinnert sich der Chefkoch des Weißen Hauses, der ebenfalls anwesend war. \"Arthur hatte sich vorsorglich schon mit Material für blonde Strähnchen eingedeckt und war guter Dinge.\" Sind es politische Differenzen mit seinem künftigen Chef, die McMellow zu schaffen machten? Als gegen Mitternacht immer klarer wurde, dass Trump auf Obama folgen würde, sei die Stimmung zwar etwas gekippt, \"aber alle Beschäftigten des Weißen Hauses blieben ruhig und professionell\", wie einer der Gärtner berichtet. \"Nur Arthur wurde immer fahriger und lauter, das ist sonst gar nicht seine Art.\" Normalerweise gilt McMellow in seinem Umfeld als sehr ausgeglichener Mensch, der seinen Job liebt und ihn mit Leidenschaft ausfüllt. Doch der 56-Jährige ließ sich nicht mehr beruhigen: Gegen ein Uhr morgens alarmierte der Leibarzt von Präsident Obama den Notruf. Zu diesem Zeitpunkt lag McMellow in Fötusstellung wimmernd am Boden. Inzwischen liegt er in einem Washingtoner Krankenhaus und befindet sich auf dem Weg der Besserung. Bekannte erklärten, McMellow plane, schnellstmöglich seine Stelle kündigen und in einen nervlich weniger fordernden Job wie etwa Löwendompteur zu wechseln. pfg; Foto oben: Shutterstock [M]; Foto unten: Michael Vadon , CC BY-SA 4.0 Artikel teilen:'"}, "time": 1742628368.9746745}