{"duration": 0.07099604606628418, "input_args": {"text": "'HONG KONG  —   Blindfolded and handcuffed, the bookseller was abducted from Hong Kong’s border with mainland China and taken to a cell, where he would spend five months in solitary confinement, watched 24 hours a day by a battery of Chinese guards. Even the simple act of brushing his teeth was monitored by minders, who tied a string to his toothbrush for fear he might try to use it to harm himself. They wanted him to identify anonymous authors and turn over data on customers. “I couldn’t call my family,” the man, Lam   said on Thursday. “I could only look up to the sky, all alone. ” Months after he and four other booksellers disappeared from Hong Kong and Thailand, prompting international concern over what critics called a brazen act of extralegal abduction, Mr. Lam stood before a bank of television cameras in Hong Kong and revealed the harrowing details of his time in detention. “It can happen to you, too,” said Mr. Lam, 61, who was the manager of Causeway Bay Books, a store that sold juicy potboilers about the mainland’s Communist Party leadership. “I want to tell the whole world: Hong Kongers will not bow down to brute force. ” Although Mr. Lam’s assertions could not be immediately confirmed, his revelations contradicted Beijing’s claims that the booksellers had voluntarily entered the mainland to cooperate with an investigation by the Chinese authorities. One of the men, Gui Minhai, vanished from his seaside apartment in Pattaya, Thailand, in October. Another, Lee Bo, a British citizen, disappeared from the streets of Hong Kong in December. Mr. Lam’s account highlights the lengths to which the government of President Xi Jinping is willing to go to silence critics outside mainland China  —   at the risk of damaging its standing on the international stage. To back up the government’s claims that the booksellers had voluntarily entered China,   television broadcast confessions by the five men Mr. Gui, for example, tearfully said he had returned to China to face justice for his role in a fatal 2003    car accident in the Chinese coastal city of Ningbo. Mr. Lam said his own words  —   that he had broken mainland law by publishing salacious books about Chinese leaders  —   had been crafted by the authorities but that he had no choice but to cooperate. “It was a show, and I accepted it,” he said of his confession. “I had to follow the script. If I did not follow it strictly, they would ask for a retake. ” His revelations open a rare window into the workings of China’s security apparatus, which frequently uses forced confessions by lawyers, rights advocates and even celebrities to sway public opinion and justify the detentions of those who have dared to defy the party. Mr. Lam’s claims are also likely to confirm the worst fears of Hong Kong residents, who say that Beijing has been intensifying efforts to erode the prodigious liberties enjoyed by the former British colony since it was returned to China in 1997. “Lam   has blown apart the Chinese authorities’ story,” Mabel Au, Amnesty International’s director in Hong Kong, said in a statement. “He has exposed what many have suspected all along: that this was a concerted operation by the Chinese authorities to go after the booksellers. ” The booksellers were key players in an industry that produces racy,   books focused on the sex lives and power games of China’s top leaders. Although such books are banned on the mainland, where the message about politics and politicians is controlled, they are eagerly sought by visitors to Hong Kong, who return home to China with the books stowed in their luggage. In the months since Mr. Lam and his colleagues disappeared, the industry has fallen on hard times. Causeway Bay Books has closed, and many Hong Kong bookstores have pulled titles about Chinese politics from their shelves. The disappearances shocked people in Hong Kong and reverberated internationally. Many saw the episode as an expansion of China’s authoritarian legal system beyond its borders, in clear violation of the “one country, two systems” framework that allows Hong Kong to maintain a high degree of autonomy from Beijing. Thousands of people took to the streets of Hong Kong to demand the booksellers’ release. Diplomats from Britain, the European Union and the United States also registered concern. Three of the men, including Mr. Lee, have since been allowed to visit Hong Kong but later returned to the mainland. During their visits, they refused to publicly discuss the details of their disappearances. Mr. Gui, who holds a Swedish passport, is the only one still in custody. Mr. Lam’s ordeal began on Oct. 24, during what he said was a routine trip to see his girlfriend on the mainland. As he crossed the border at the Chinese city of Shenzhen, he said he was seized by security personnel. Blindfolded and with his hands bound, he was put on a train that traveled hundreds of miles north to Ningbo. The next few months, he said, were spent in a dingy cell, where he signed away his right to a lawyer and the right to contact his family. He said he was questioned 20 to 30 times about his role in Hong Kong’s publishing industry. At one point, he said he was forced to sign a confession that incriminated Mr. Gui, saying his colleague had orchestrated the unlawful sale of books that harmed Chinese society. He said the cell’s furniture was covered in padded fabric, an apparent attempt to prevent him from committing suicide. After about five months, he was moved to an apartment. “They wanted to lock you up until you go mad,” he said. On Thursday, Mr. Lam told reporters that Mr. Lee had told him privately that he, too, was taken to China against his will. Mr. Lam said Mr. Lee was able to get him the equivalent of about $15, 000, for living expenses and as compensation for the loss of his job after the bookstore closed. Mr. Lee did not respond to a request for comment. The authorities apparently thought that Mr. Lam would continue to cooperate. He said they let him travel to Hong Kong on Tuesday after he promised to return to the mainland with a   full of information on customers. Instead, Mr. Lam decided to meet with the news media. “I dare not go back,” he said. “I don’t plan on setting foot in mainland China ever again. ”'"}, "time": 1742628527.3052235}