{"duration": 0.06246638298034668, "input_args": {"text": "'WASHINGTON, D. C.  —   Two leftist females with the CODEPINK activist organization disrupted the launch of the Middle East Forum’s Israel Victory Project in Congress on Thursday before security removed them from the historic meeting in the Rayburn House Office Building. [The Project on Thursday helped to launch the Congressional Israel Victory Caucus, which seeks to generate new policy ideas for the   peace process.  The Caucus is being led by U. S. Reps. Ron DeSantis ( ) and Bill Johnson ( ).  “Palestinians deserve equal rights,” CODEPINK’s campaign director Ariel Gold said as she removed a sign which had “Free Palestine” written on it from her pink Kipling backpack. “Israel is an apartheid state. It was founded on racism and ethnic cleansing,” Gold said as an officer approached and removed her from the room.  Someone in the crowd shouted “terrorist supporters out! You have no place here. This is a place for freedom and democracy!” This past March, Israeli Envoy to the UN Danny Danon pushed back against false allegations that Israel is an apartheid state. “The attempt to smear and falsely label the only true democracy in the Middle East by creating a false analogy is despicable and constitutes a blatant lie. ” That falsehood is often perpetuated by the left. Gold, who has been arrested in the past for disrupting the peace, donned the same banner to protest Israeli musician and producer Idan Raichel. Hey @idanraichel’s: music us for liberation, not for Israeli occupation pic. twitter.   —   Ariel Gold (@ArielElyseGold) April 26, 2017,  CODEPINK bills itself as supporting “peace and human rights initiatives” and says it’s “against racism, sexism, homophobia, transphobia, classism, ageism, and other forms of oppression and prejudice. ” Ironically, the group is vehemently opposed to the only true democracy in the Middle East: Israel. Israel is the only nation in the region where there is religious freedom for all, women have equal rights, members of the LGBTQ community can live in peace and free from fear of persecution and death, and Arabs, Africans and minority groups who hold citizenship enjoy full rights. This past January, Gold told Breitbart Jerusalem that the organization was planning “audacious and creative, colorful protests” targeting the inauguration of   Donald Trump. ” At the time, Gold said: We always create beautiful disruptions of hatred and violence. And that is what we are committed to as an organization and that is something that we have done from the start. And it is something that we will continue to do. And that is because we support life and health and health care and safety for all human beings. CODEPINK actively promotes the boycott, divestment, and sanctions (BDS) movement which seeks to undermine the State of Israel. Follow Adelle Nazarian on Facebook and Twitter.'"}, "time": 1742561802.204149}