{"duration": 0.11816668510437012, "input_args": {"text": "'DUNDALK, Md.  —   Ra’ad and Hutham Lalqaraghuli are no longer sure which America they’re a part of. Is it the hateful country they confronted a few weeks before the presidential election, when someone left a note at their door that said, “Terrorist Leave no one wants you here”? Or is it the generous country of welcoming strangers who heard about their ordeal and showered them with gifts and cards with positive messages? The victory of   Donald J. Trump has intensified their whiplash. After a year in the Maryland suburbs, having arrived with their four children as refugees from Iraq, they find themselves comparing the threats they fled with those that might still emerge. They did not sleep on election night after watching television coverage of the results. They are “very afraid and worried,” Mr. Lalqaraghuli said on Wednesday. “We don’t know what this will mean. ” Their confusion, and the divided response to the family’s presence here, mirrors the experience of many other refugee families and Muslim Americans. In the past week, even as advocates report a steep rise in attacks and acts of intimidation against blacks, Muslims and immigrants  —   and on women wearing hijabs  —   many of those episodes have been followed by public acts of support and solidarity. At Baylor University in Waco, Tex. hundreds of students and faculty members walked to class with Natasha Nkhama, a black student, after a friend posted a video of her describing an episode in which she was called a racial slur and forced off a sidewalk by someone who said, “I’m just trying to make America great again. ” In Georgia, Mairah Teli, a Muslim teacher at Dacula High School, posted a photograph of an anonymous note she received on Friday that said she should “tie” her head scarf around her neck and “hang yourself with it. ” A day later, she wrote in another Facebook post: “I am overwhelmed and deeply touched by all of the outcry and support that I have received in the past 24 hours. I can’t even begin to articulate how touched I am to be receiving messages from all over the country with your support. ” Acts of hate and intimidation, according to the Southern Poverty Law Center, occurred across the country during the campaign, and have increased significantly since Mr. Trump was declared the  . But the back and forth between acceptance and rejection can be particularly confusing for new arrivals like the Lalqaraghulis. Their new home of Dundalk is an   suburb of Baltimore, one of the many   communities where the nation’s battles over identity have become most intense. It was once a lively hub of workers filing into plants for Bethlehem Steel, General Motors and other manufacturing giants. Now it is dominated by strip malls. Ra’ad Lalqaraghuli said he was initially eager to call it home. “When I arrived in America, I was so happy,” Mr. Lalqaraghuli, 43, said. “It’s my dream country for my children. ” He’d had experiences with Americans before. A graduate of Mosul University, in 2004 he began working as a group engineer for American contractors and the United States Army Corps of Engineers to help rebuild his country after the American invasion. A promotion to project manager in 2009 led to his overseeing the construction of water treatment plants and several schools in Baghdad and two cities south of the capital, Nasiriya and Basra. But his work for the Americans also brought him unwanted attention from terrorist groups. He spent one winter sleeping outside in the forest, to keep himself hidden, while his wife and children stayed with her family. Militants from the Islamic State abducted two of his younger brothers and one older brother instead. “They said, ‘In exchange for you, we’ll give them back. ’” He and his father didn’t believe them, and the three brothers were killed. His work on behalf of the United States government made him and his family eligible for humanitarian protection under special immigrant visas. Lawyers in New York supported his application, and he received approval quickly. Then, last year, a militia bombed the family home. “I lost everything,” Mr. Lalqaraghuli said. At the Baghdad airport, heading to the United States, he still worried that he was being followed. All he had was his plane ticket, his passport, $100, and his wife and four children. Betsy Fisher, the deputy policy director of the New   International Refugee Assistance Project, which resettled the family, said she was dismayed to learn of its newfound anxiety, especially after the many attempts on Mr. Lalqaraghuli’s life for several years by different groups in Iraq. “The people who enter this country as refugees are fleeing from terrorism,” she said. “They cannot live in a place with violence. ” She added of the message posted on the family’s door, “Not only is a note like this horrifying, it should be deeply embarrassing for every American that this family was threatened, because the reason they are in this country is because he was of service to our country. ” Advocates  —   like the Council on   Relations, which is helping the family  —   say that many refugee families are reluctant to come forward when they become victims of hate crimes because they fear a greater backlash. But after the note appeared  —   with a crude drawing of a woman in a hijab  —   Mr. Lalqaraghuli notified the police, telling an officer in the neighborhood who happened to be on a foot patrol near his apartment. The police said that the note had been written by a    neighbor, and that officers had talked to her and her parents but determined that no crime had been committed. The neighbor’s family did not respond to a message requesting comment. Criminal or not, the episode was enough to stir up a response  —   an effort to counter intolerance. Alta Haywood, a retired teacher who lives in Perry Hall, Md. sent the family a towering fruit basket and included a note that read in part, “I sincerely hope that other people in the area show you that they can be kind and accepting. ” Another   Dr. Lindsay Fitch, said the news of what had happened to the family “just grabbed me more personally. ” While talking to her two children about it, she said, she decided to send the family the most American of welcomes: a   apple pie and a pumpkin pie. Included in her card were a photograph of her family and an invitation to have their families get together. “I wanted to welcome you to the Baltimore area,” she wrote. “There are a lot of people here who want to welcome you with open arms. Hopefully, you’ll find that welcome. Remember us when you encounter ugliness. ” Mr. Lalqaraghuli, who works as a driver, said he greatly appreciated the outpouring of support. But after Mr. Trump’s victory, he said, it is hard to trust that acceptance will emerge as the country’s dominant force. He missed two weeks of work after the note was left, because, he said, his children felt safer when he was around. His youngest, Abdullah, 5, no longer sleeps in his own room. He joins his parents instead. “Because he sees when militias come to my home, they come with the weapons,” Mr. Lalqaraghuli said. He was referring to their life in Baghdad. But as soon as possible, he said, his family will be looking to move out of Dundalk and start fresh in another town or state.'"}, "time": 1742628304.1089296}