{"duration": 0.037810325622558594, "input_args": {"text": "'Sam Wenkert November 16, 2016 In a stunning change of pace, each lobbyist that was previously invited to the transition team were buffed out Tuesday evening. \\nThe Wall Street Journal reports that : \\nVice President-elect Mike Pence formally signed documents that put him in charge of the transition team, and officials insisted the 10-week effort to build an administration is on schedule. In one of his first moves, Mr. Pence ordered the removal of all lobbyists from the transition team, said one transition team member with knowledge of the decisions. \\nWhy isn’t this bigger news? Donald Trump and Mike Pence are absolutely practicing what they preach. It is a long-standing tradition on the Hill that for better or worse, lobbyists deserve to run your platform. However, the Trump team are following through with their promise to ‘Drain The Swamp’ by cutting these men out. \\nMike Rogers, the former National Security Senior Advisor to the Trump transition team who was abruptly cut out last night, posted his resignation statement on his website: \\nIt was a privilege to prepare and advise the policy, personnel and agency action teams on all aspects of the national security portfolio during the initial pre-election planning phase. Our work will provide a strong foundation for the new transition team leadership as they move into the post-election phase, which naturally is incorporating the campaign team in New York who drove President-elect Trump to an incredible victory last Tuesday. \\nMike Rogers, among others, did not align with the mission statement of the Trump team to ‘Drain The Swamp.’ Sources report that every single person brought in by Chris Christie was being ousted, perhaps a strategy that was used to identify and rid the team of political insiders and lobbyists. Gone now are the members of his transition team with ties to Wall Street firms and other corporations. \\nIf the Trump team is truly to ‘Drain The Swamp’ on the Hill, this was clearly the first painful step that they must take to get there. The following two tabs change content below. Latest Posts Sam Wenkert Sam Wenkert is a multi-talented writer for REGATED. He began writing about politics during the 2008 election year, and has been interested in political science ever since. Sam also reports on developing world news. Latest posts by Sam Wenkert ( see all ) '"}, "time": 1742563588.5837774}