{"duration": 0.09814906120300293, "input_args": {"text": "'OpEdNews Op Eds 10/28/2016 at 12:50:20 Why Donald Trump is not as horrible as Hillary Clinton \" and why you should vote for Jill Stein. Permalink (Page 1 of 2 pages) License DMCA \\nI could have named this article \"Damage Control\" -- because it essentially is about that, related to the lobotomizing dilemma of \"lesser evil voting\". \\nBut let me be clear at the outset. I have already voted for Jill Stein . I had no other choice. I am firm in my conviction that to vote for sociopathic, narcissistic, self-serving, ruthless, guileful corporatists is an unconscionable act and a major crime against my country, irrespective of the convoluted rationalization which might attempt to justify it. \\nNow let me offer reasoning that goes beyond my \"morally pure\" posturing. \\nThe accepted wisdom is that a vote for Jill Stein is a vote for Donald Trump. This analysis purports that anyone voting for Stein would likely be a former Clinton supporter, and such a vote would subtract from Clinton\\'s total. \\nEven though Hillary\\'s elitist, warmongering, anti-democratic, demonstrably criminal world view is diametrically the opposite of Jill Stein\\'s, and I can\\'t imagine anyone who\\'s moved by the Green Party\\'s agenda for the briefest moment being fooled by Clinton\\'s phony populism, for argument\\'s sake I\\'ll accept this proposition. \\nWhile I consider both Trump and Clinton to be equally unfit for office, I do not for a moment believe they would be equally ineffective. - Advertisement - \\nHillary has for good reason become the choice of the oligarchs, the MIC, the bankers, the media, the people who actually run the country. She will serve them well. She knows her way around the system -- she\\'s been gaming it most of her adult life -- and has all the right connections. Which is why even many prominent Republicans have joined the feeding frenzy and flocked to her like vultures over fresh kill. \\nHillary will continue her faux-populist bloviating to keep the stinky masses in line, while her closest allies, the rich and powerful, continue to loot the Treasury, hollow out what\\'s left of the U.S. economy, and bankrupt the middle and lower classes. \\nMuch to the delight of the neocon-infested Department of State, Department of Defense, security agencies, MIC, and media, Hillary will \"get tough\" with Russia and China, press the war on Syria and the rest of the Middle East , promote and spread more chaos, death, and destruction across the globe in pursuit of military conquest, ultimately world empire. It\\'ll be good for business and pumping up the already inflated egos of the exceptionalists. \\nOn the other hand, Trump will fall flat on his face. His trademark bull-in-a-china-shop approach to making deals has no chance of success in Washington DC. He has no support -- his own party has all but disowned him -- no connections, at least not the political ones necessary for promoting his agenda. Yes, the politicos drank his champagne and ate the food at his extravagant bashes. Who wouldn\\'t? But they don\\'t owe him anything. Nada! Trump\\'s much heralded talents for making great deals will confront hostile Democrats, contemptuous Republicans -- a perhaps long-overdue bipartisanship -- closing ranks to isolate and defeat the outrageous and vulgar outsider who thought he could buy and muscle his way into political power. License DMCA - Advertisement - \\nHe\\'ll try to build his wall. When Congress gets done with it, it\\'ll be a 200-foot white picket fence in Calexico . He\\'ll attempt rapprochement with Russia. That will be sabotaged with a false flag attack, maybe dressing some disgruntled maquiladora workers as Russian infantry men and mounting an invasion on the U.S. -- probably in Calexico -- or by John McCain threatening to fall on a grenade or blow his brains out in the Senate chambers if America doesn\\'t immediately nuke Moscow . \\nDespite his self-proclaimed success in the business world, Trump simply does not know the rules of the game in Washington DC. Unless he \"fires\" everyone -- declaring martial law and sending all members of the legislature to a FEMA labor camp in Montana -- he will either be the most ineffective president in history or be impeached. Maybe both! \\nIn a phrase, Donald Trump as president will do \\'less damage\\'. \\nAnyone who has read my recent writings knows that my greatest concern about a Hillary Clinton presidency is her truculent foreign policy . A decade ago, I might have believed that she was misguided. Now I realize -- as quite a number of others do -- that she is completely insane. She\\'s become drunk on power, poisoned by surrounding herself with neocons and warmongering humanitarians , possessed by visions of herself as the Warrior Queen.'"}, "time": 1742561810.8512187}