{"duration": 0.06803202629089355, "input_args": {"text": "'Woman Claims Trauma From Sexual Assault… In a Video Game \\nEric Striker Daily Stormer October 25, 2016 \\nAny time a hobby or institution is taken over by women, it’s the final symptom of said entity’s terminal illness. The typical female dichotomy of a thick skull covered by a thin skin puts the balance of actions and consequences completely out of whack, thus ruining fun and slowing progress for the rest of us. While childish female nagging about a man’s world of freedom to think and act is laughed at and dismissed in a sane society, in our current one it is often the stated justification for crack downs on political dissent and the censorship of constructive discourse. \\nIf I were to seriously argue that playing a World War II shooting game gave me Post-Traumatic Stress, you would laugh at me. Yet a woman arguing the sexual assault equivalent in a news platform is given center stage, and you better take her seriously. \\nMic : \\nLast week I was groped in virtual reality. Did you know that could happen? I didn’t, but now I’m all the wiser. \\nA few minutes later I started a new QuiVr game, and hit multiplayer mode. In multiplayer mode, other real-time players appear beside you. Every player looks nearly identical with a floating helmet, a persistent bow in one hand, and another free-floating hand. Keep that free-floating hand in the back of your mind. \\nSo, there I was shooting down zombies alongside another real-time player named BigBro442. The other players could hear me when I spoke, my voice the only indication of my femaleness. Otherwise, my avatar looked identical to them. \\nIn between a wave of zombies and demons to shoot down, I was hanging out next to BigBro442, waiting for our next attack. Suddenly, BigBro442’s disembodied helmet faced me dead-on. His floating hand approached my body, and he started to virtually rub my chest. \\n“Stop!” I cried. I must have laughed from the embarrassment and the ridiculousness of the situation. Women, after all, are supposed to be cool, and take any form of sexual harassment with a laugh. But I still told him to stop. \\nThis goaded him on, and even when I turned away from him, he chased me around, making grabbing and pinching motions near my chest. Emboldened, he even shoved his hand toward my virtual crotch and began rubbing. \\nThere I was, being virtually groped in a snowy fortress with my brother-in-law and husband watching. \\nAs it progressed, my joking comments toward BigBro442 turned angrier, and were peppered with frustrated obscenities. At first, my brother-in-law and husband laughed along with me â\\x80\\x94 all they could see was the flat computer screen version of the groping. Outside the total immersion of the QuiVr world, this must have looked pretty funny, and definitely not real. \\nRemember that little digression I told you about how the hundred-foot drop looked so convincing? Yeah. Guess what. The virtual groping feels just as real. Of course, you’re not physically being touched, just like you’re not actually one hundred feet off the ground, but it’s still scary as hell. \\nMy high from earlier plummeted. I went from the god who couldn’t fall off a ledge to a powerless woman being chased by an avatar named BigBro442. \\nI wasn’t as experienced a player as BigBro442. Everywhere I ran, he appeared beside me, ready to grope as soon as the zombie wave was over. I’d had enough. With a final parting obscenity, I yanked the headset off my face and stood back in the sunny, familiar room of my brother-in-law’s home. \\nWhat had just happened? I hadn’t lasted 3 minutes in multiplayer without getting virtually groped. \\nWhat’s worse is that it felt real, violating. This sounds ludicrous to anyone who hasn’t stood on that virtual reality ledge and looked down, but if you have, you might start to understand. The public virtual chasing and groping happened a full week ago and I’m still thinking about it. \\nNow that the shock has mostly worn off, I’m faced instead with the residual questions about the unbridled misogyny that spawns from gaming anonymity. It’s easy to dismiss the most egregious offenses as the base actions of a few teenage boys, but I don’t think it’s as rare as a few bad apples. \\nHow could it be, when my brother-in-law has played multiplayer mode a hundred times without incident, but my female voice elicited lewd behavior within minutes? \\nAs VR becomes increasingly real, how do we decide what crosses the line from an annoyance to an actual assault? Eventually we’re going to need rules to tame the wild, wild west of VR multiplayer. Or is this going to be yet another space that women do not venture into? \\nWomen are allowed, sure, but the BigBro442s of the world will make sure you never want to come back. \\nSo this woman apparently doesn’t mind gratuitous interactive violence, but wants to make it a criminal act to give a power-glove smack to her imaginary character’s dragon-titties. I don’t have any experience with virtual reality and haven’t played any video games in many years, but I’m going to guess there’s plenty of games where you can pet ponies, try on lots of clothes and other entertainment that protects the fragile innocent eyes and ears of empowered 21st century womyn. \\nThe reason increasing numbers of men escape into their video games is because of the total lack of adventure and heroic opportunities offered in our real world. The film Fight Club deals with these issues, and women themselves are unhappy with the current state of men, even as they continue to vote for or spearhead Jewish causes that further legally and culturally emasculate men. \\nOne thing I’ve noticed in “progressive” women is that they are equally as appalled by men talking about pussy or spanking them on the ass in an imaginary video game as they are aroused by images and content featuring extreme masochistic sex. The more women pressure men into deferring to their baby shit, the more radical and vicious their rape fantasies become. \\nIf you don’t know much about women or have never been with them, I’ll tell you a secret: women sexually love to have their hair pulled, slapped around, roughed up – within reason. Women are naturally masochistic and are wired to submit to men, but this instinct is being taken to extreme levels via the pornography modern women are consuming. This kind of material is pretty inhumane and ventures into the territory of bizarre and disturbing (images of women being mutilated, fisting, pissed on, violent body destroying sodomy, vicious beatings). Men don’t watch this stuff at anywhere near the level women do. \\nMost of the people watching this stuff are female. But somehow, they feel they have the right to barge into male-oriented spaces and sanitize them, not because they’re genuinely offended, but rather because their increasingly grotesque and pozzed sexual fantasies make them feel ashamed, so anything that might remind them of their deranged thoughts, or even embarrassingly arouse them, like a 15-year-old boy groping them in a video game for laughs, needs to be treated like a real world crime.'"}, "time": 1742628441.7948787}