{"duration": 0.04755878448486328, "input_args": {"text": "'Be Sociable, Share! \\n\\nRoughly at the same time that the WSJ reported of what is now a clear “civil war” between (and within) the FBI and the DOJ, Fox News anchor Bret Baier reported that the FBI’s investigation into the Clinton Foundation that has been going on for more than a year has now taken a “very high priority.” He added that FBI agents have interviewed and re-interviewed multiple people on the foundation case, which is looking into possible pay for play interaction between then-Secretary of State Hillary Clinton and the Clinton Foundation. \\nThe FBI’s White Collar Crime Division is handling the investigation, which will continue, as “there is a lot of evidence. And barring some obstruction in some way, they believe they will continue to likely an indictment. ” \\nI said sources described an “avalanche of evidence” in case & barring obstruction they’d likely continue 2 push to try for an indictment” https://t.co/2TjzxdJod1 \\n— Bret Baier (@BretBaier) November 2, 2016 \\nThe news was cited by various traders as the catalyst that pressured the USD when it come out late on Wednesday. \\n“There is an avalanche of new information coming in every day,” one source told Fox News, who added some of the new information is coming from the WikiLeaks documents and new emails. He added that FBI agents are “actively and aggressively pursuing this case,” and will be going back and interviewing the same people again, some for the third time, sources said. Agents are also going through what Clinton and top aides have said in previous interviews and the FBI 302, documents agents use to report interviews they conduct, to make sure notes line up, according to sources. \\nHere are the key highlights from his report, as summarized by Real Clear Politics: The Clinton Foundation investigation is far more expansive than anybody has reported so far and has been going on for more than a year. The laptops of Clinton aides Cherryl Mills and Heather Samuelson have not been destroyed, and agents are currently combing through them. The investigation has interviewed several people twice, and plans to interview some for a third time. Agents have found emails believed to have originated on Hillary Clinton’s secret server on Anthony Weiner’s laptop. They say the emails are not duplicates and could potentially be classified in nature. Sources within the FBI have told him that an indictment is “likely” in the case of pay-for-play at the Clinton Foundation, “barring some obstruction in some way” from the Justice Department. FBI sources say with 99% accuracy that Hillary Clinton’s server has been hacked by at least five foreign intelligence agencies, and that information had been taken from it. A transcript of his statement: BRET BAIER: Breaking news tonight — two separate sources with intimate knowledge of the FBI investigations into the Clinton emails and the Clinton Foundation tell Fox the following: The investigation looking into possible pay-for-play interaction between Secretary of State Hillary Clinton and the Foundation has been going on for more than a year. Led by the white collar crime division, public corruption branch of the criminal investigative division of the FBI. The Clinton Foundation investigation is a, quote, “very high priority.” Agents have interviewed and reinterviewed multiple people about the Foundation case, and even before the WikiLeaks dumps, agents say they have collected a great deal of evidence. Pressed on that, one sources said, quote, “a lot of it,” and “there is an avalanche of new information coming every day.” Some of it from WikiLeaks, some of it from new emails. The agents are actively and aggressively pursuing this case. They will be going back to interview the same people again, some for the third time. As a result of the limited immunity deals to top aides, including Cheryl Mills and Heather Samuelson, the Justice Department had tentatively agreed that the FBI would destroy those laptops after a narrow review. We are told definitively that has not happened. Those devices are currently in the FBI field office here in Washington, D.C. and are being exploited. The source points out that any immunity deal is null and void if any subject lied at any point in the investigation. Meantime, the classified e-mail investigation is being run by the National Security division of the FBI. They are currently combing through former Democratic Congressman Anthony Wiener’s laptop and have found e-mails that they believe came from Hillary Clinton’s server that appear to be new, as in not duplicates. Whether they contain classified material or not is not yet known. It will likely be known soon. All of this just as we move inside one week until election day. \\nBaier gave more details to Fox News Channel’s Brit Hume: \\nBRET BAIER: Here’s the deal: We talked to two separate sources with intimate knowledge of the FBI investigations. One: The Clinton Foundation investigation is far more expansive than anybody has reported so far… Several offices separately have been doing their own investigations. \\nTwo: The immunity deal that Cheryl Mills and Heather Samuelson, two top aides to Hillary Clinton, got from the Justice Department in which it was beleived that the laptops they had, after a narrow review for classified materials, were going to be destroyed. We have been told that those have not been destroyed — they are at the FBI field office here on Washington and are being exploited. . \\nThree: The Clinton Foundation investigation is so expansive, they have interviewed and re-interviewed many people. They described the evidence they have as ‘a lot of it’ and said there is an ‘avalanche coming in every day.’ WikiLeaks and the new emails. \\nThey are “actively and aggressively pursuing this case.” Remember the Foundation case is about accusations of pay-for-play… They are taking the new information and some of them are going back to interview people for the third time. As opposed to what has been written about the Clinton Foundation investigation, it is expansive. \\nThe classified e-mail investigation is being run by the National Security division of the FBI. They are currently combing through Anthony Weiner’s laptop. They are having some success — finding what they believe to be new emaisls, not duplicates, that have been transported through Hillary Clinton’s server. \\nFinally, we learned there is a confidence from these sources that her server had been hacked. And that it was a 99% accuracy that it had been hacked by at least five foreign intelligence agencies, and that things had been taken from that… \\nThere has been some angst about Attorney General Loretta Lynch — what she has done or not done. She obviously did not impanel, or go to a grand jury at the beginning . They also have a problem, these sources do, with what President Obama said today and back in October of 2015… \\n\\nI pressed again and again on this very issue… The investigations will continue, there is a lot of evidence. And barring some obstruction in some way, they believe they will continue to likely an indictment. \\nWill the FBI stun the world and announce yet another probe is being opened into the Clinton foundation, or will the DOJ successfully stifle this and at least push it until after the elections? As we concluded last night, the last few days before the election are shaping up as very interesting. \\nThis article originally appeared on Zero Hedge. Be Sociable, Share!'"}, "time": 1742628494.8399723}