{"duration": 0.06574559211730957, "input_args": {"text": "'The Comedy Central series Broad City will bleep out President Donald Trump’s name in its upcoming fourth season, in what one actress describes as an attempt to rid the show of any mention of the president. [“There’s no airtime for this orange [person],” in season four of the show, actress Ilana Glazer told USA Today. “We bleep his name the whole season. ”  From actress and executive producer Amy Poehler, Broad City follows two       —   played by actresses Abbi Jacobson and Glazer  —   living in New York City. A trailer teasing season four sees the show’s stars wearing pussy hats at a protest. A moment later, Glazer yells “F*ck You, Trump. I’m going back in,” and proceeds to turn on what appears to be a vibrating sex toy.  Of the   scene, Glazer says Jacobson’s character struggles to stimulate herself sexually due to all the “danger” imposed by the Trump administration. “Ilana’s ‘powers’ are decreasing during the current administration because it’s just so hard to (orgasm) when you know so many people are in such danger,” the actress said. “So Ilana works through her   ( ) and it’s wild. ” The show, which began as a web series in 2009, has veered into politics in the past. A season three episode saw Glazer’s character volunteering for Hillary Clinton’s presidential campaign. Pandemonium erupts when Clinton makes a surprise visit to the campaign office. On the set of @broadcity season 3 with @abbijacobson, @ilazer and Amy! #yas pic. twitter.   —   Hillary Clinton (@HillaryClinton) December 11, 2015,  Jacobson defended Clinton’s appearance on the show, telling Entertainment Weekly that they “were not trying to make a statement” by having the former Sec. of State on. A year later, however, Glazer said season four was written with the expectation that Hillary Clinton would win the election. “We wrote (Season 4) being like, ‘Here we go! Hillary for president! ’” Glazer told USA Today. But after “this   host became president of our country, we rewrote a lot. ” The comedy series saw a considerable ratings dip in season three, falling from an average of 1. 2 million viewers in its season one debut in 2014 to about 600, 000 viewers in March 2016. The fourth season of Broad City premieres on Comedy Central August 23.   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742562185.4332054}