{"duration": 0.06690025329589844, "input_args": {"text": "'Posted on October 29, 2016 by WashingtonsBlog \\nWashington’s Blog asked the NSA executive who created the agency’s mass surveillance program for digital information, who served as the senior technical director within the agency, who managed six thousand NSA employees, the 36-year NSA veteran widely regarded as a “legend” within the agency and the NSA’s best-ever analyst and code-breaker, who mapped out the Soviet command-and-control structure before anyone else knew how, and so predicted Soviet invasions before they happened (“in the 1970s, he decrypted the Soviet Union’s command system, which provided the US and its allies with real-time surveillance of all Soviet troop movements and Russian atomic weapons”), Bill Binney – what he thought about the FBI’s announcement that it was re-opening the investigation into Hillary Clinton’s emails. \\nHe told us: \\nThey must have something significant for the FBI to reopen the investigation. Plus I think [FBI Director] Comey had to inform congress of his incomplete testimony to them or else he could be charged with perjury to congress and impeached. \\n*** \\nAny way you look at it, FBI has a black black eye over this. I have been saying for a long time that when you couple secret intelligence agencies with the police, you get a secret police. In German, that’s a GESTAPO (meaning “State Secret Police”). Plus, when you add to that what the DOJ has been doing relative to this, you have a Department of “Just Us.” Not good for the citizens of this or any other country. \\nSimilarly, one of the two reporters who broke the Watergate story – Carl Bernstein – said : \\nWe don’t know what this means yet except that it’s a real bombshell . And it is unthinkable that the Director of the FBI would take this action lightly , that he would put this letter forth to the Congress of the United States saying there is more information out there about classified e-mails and call it to the attention of congress unless it was something requiring serious investigation .'"}, "time": 1742562973.0526896}