{"duration": 0.04710578918457031, "input_args": {"text": "'November 23, 2016 Elijah Magnier On Fake News And Fake Analysts \\nWhile I am still knocked out somewhat by a nasty influenza let me recommend Elijah Magnier\\'s most recent piece on the \"fake news\" and \"fake analyst\" media: \\nSyria and Iraq caught between the “new analysts’ and the politicised media \\nSome excerpts: The wars in Syria and Iraq celebrated the unfortunate end of the “free and independent press” and the rise of the “neo-analysts”. They sit in far-off lands, with no ground knowledge of the war, collecting information and analysing the colourful bin of social networking sites. \\nThey have even the temerity to believe they can dictate to the US administration what measures should be taken, who to support and, as if they had mastered the “art of war”, they even push for a nuclear war with Russia. \\nOn Syria: According to the US State Department and to the western press, over 90 hospitals were totally destroyed in eastern Aleppo in the last months at the rate of almost one destroyed hospital per day. And every day we hear “the last hospital has been totally destroyed”. The only problem with this figure is the statistic released by the Syrian Ministry of Health stating that “on the entire Syrian territory, there are only 88 hospitals”. ... [W]hen jihadists and rebels start a large scale attack against Syrian Army forces and their allies, the media stand by, waiting for results. If the regime begins a military operation hospitals are destroyed and civilians are killed in the first hour of the battle. Rarely do militants die in mainstream media. \\nOn Iraq: “Neo-analysts” and journalists focus also on the role of the “Popular Mobilisation Units” (PMU) by giving them different titles, like the “Shiite crowd”, “sectarian crowd” and “Militia crowd” as if its members came from another world. There are more than 60% of Shiites in Iraq and the rest are Sunnis, secular Kurds, Assyrians, Shabak, Sabea and other minorities. From these same Iraqis are formed the Iraqi army units, counter-terrorism, intelligence, special forces, federal police forces, tribes, and Peshmergan as well as the PMU, which has become an integral part of the security apparatus under the leadership of the Commander in Chief of the Iraqi Armed Forces, the Prime Minister. \\nThose writing about Iraq disregard the fact that the US Army, before and during its invasion to Iraq, committed the most abominable atrocities in that country, starting with the embargo on Iraq to massacres, torture, rape and human rights abuses during the occupation of the country. \\nOn the media: The notion of a “free unbiased press” is finished and has been replaced by the will of politicians: investigate journalism was replaced by information or disinformation from social media. \\nIt was obvious during the US presidential campaign that the “free press” was sharing “statistics” confirming the absence of any prospect of success of Donald Trump with Hillary Clinton as a winner by 98 to 99%. This indicates that the press was following wishful thinking rather than confirming data and facts, just as they have been doing most of the time with the war in Syria and Iraq. \\nElijah has been working as a newspaper journalist for some 30 years. He was war correspondent in the Yugoslavia wars, in Lebanon, in Iraq during the U.S. invasion and in Syria. The above is based on factual knowledge and experience, not on political agendas or paid \"analyst\" propaganda. One hopes that younger journalists will learn from it.   23, 2016 at 01:47 PM | Permalink'"}, "time": 1742628493.0393448}