{"duration": 0.0693213939666748, "input_args": {"text": "' Julian Assange Says Trump \\'Won\\'t be Allowed to Win\\'\\nBy Darren Boyle\\n \" Daily Mail \" - WikiLeaks founder Julian Assange has claimed Donald Trump \\'won\\'t be allowed to win\\' next week\\'s election during an interview to be broadcast on a pro-Kremlin TV station.\\nThe Australian computer hacker was speaking from inside the Ecuadorian embassy in London where he also accused Hillary Clinton of receiving donations from the same people funding ISIS .\\nAssange said he was basing his claims on emails released last month by WikiLeaks.\\nSpeaking to Australian journalist John Pilger for Dartmouth Films, Assange claimed one of the leaked documents between showed a message sent by the then Secretary of State to John Podesta, who was an adviser to President Barack Obama.\\nAssange said the email urged Obama to \\'bring pressure\\' on the governments of Saudi Arabia and Qatar, \\'which are providing clandestine financial and logistic support to ISIL [ISIS] and other radical Sunni groups\\'.\\nHe described the email as the \\'most important\\' in the entire collection.\\nHe claimed: \\'All serious analysts know, and even the US government has agreed, that some Saudi figures have been supporting ISIS and funding ISIS, but the dodge has always been that it is some \\x93rogue\\x94 princes using their oil money to do whatever they like, but actually the government disapproves. But that email says that it is the government of Saudi Arabia, and the government of Qatar that have been funding ISIS.\\'\\nClinton has also been criticized over claims that the Clinton Foundation receives funding from Saudi and Qatari sources.\\nLater in the 25-minute interview, which will be broadcast on Russia Today, Assange claims next Tuesday\\'s presidential election has been fixed in favour of Hillary Clinton.\\nHe added: \\'My analysis is that Trump would not be permitted to win. Why do I say that? Because he has had every establishment off his side. Trump does not have one establishment, maybe with the exception of the Evangelicals, if you can call them an establishment. Banks, intelligence, arms companies, foreign money, etc. are all united behind Hillary Clinton. And the media as well. Media owners, and the journalists themselves.\\'\\nDonald Trump has repeatedly said Tuesday\\'s presidential election may be rigged, while providing scant evidence, and has urged supporters to keep an eye out for signs of voting fraud in Philadelphia and other heavily Democratic areas.\\nDemocrats worry that could encourage Trump supporters to harass minority voters in a state that could determine whether Trump or his Democratic opponent, Hillary Clinton, wins the presidency. Voting-rights advocates said they are already receiving reports of harassment.\\nDemocrats have launched a legal blitz of their own in an attempt to shut down Trump\\'s poll-watching efforts in Pennsylvania and three other battleground states, arguing in lawsuits that Republican monitoring efforts amount to \\'vigilante voter intimidation\\' that violates federal law.\\nAssange earlier denied he was a stooge for the Russian intelligence services, claiming they were not behind the damaging leaks to the Clinton campaign.\\nHe has been wanted by Swedish authorities since 2010 over rape allegations.\\nHe has been hiding the the Ecuadorian embassy in London over fears he will be extradited to the United States.\\nHe said: \\'The Clinton camp has been able to project a neo-McCarthyist hysteria that Russia is responsible for everything.\\n\\'Hillary Clinton has stated multiple times, falsely, that 17 US intelligence agencies had assessed that Russia was the source of our publications. That\\'s false \\x96 we can say that the Russian government is not the source.\\'\\nThe first tranche of emails published by WikiLeaks claimed the Democratic party leadership actively favored Clinton over her rival for the nomination Bernie Sanders.\\nThe Department of Homeland Security Department and the Office of the Director of National Intelligence said last month they were \\'confident\\' the Russian government was responsible for the leaks.\\nBut Russia has denied this and presidential press secretary Dmitry Peskov said it was \\'nonsense\\'.\\nIn an interview with veteran John Pilger on RT, Assange said: \\'We have independently authenticated the emails. WikiLeaks has a decade-long, perfect record in the accurate authentication of leaked documents.\\' Assange: Clinton & ISIS funded by same money, Trump won\\x92t be allowed to win (JOHN PILGER EXCLUSIVE) Read more: Assange: Clinton & ISIS funded by same money, Trump won\\x92t be allowed to win (JOHN PILGER EXCLUSIVE) \\x97 RT News'"}, "time": 1742628359.767679}