{"duration": 0.07127618789672852, "input_args": {"text": "'Backdoor Survival November 1, 2016 \\nBack in the early days, before writing about any one aspect of prepping, I had to do a lot of research. Online resources were meager so there was a lot of trial and error involved as I formulated my own preparedness strategy. Sadly, as I look back, there was considerable error. Who knew? The good news is that the school of hard prepping knocks has taught me a thing or two. This is especially true when it comes to last minute preps. \\nNow that I am lot smarter, I thought it might be fun to put on my thinking cap and come up with a list of ten last minute preps that could be put into place if I had a modicum of warning that a storm or other disruptive event was brewing. There are two parts to this list, things to do and things to buy. \\nThings To Do \\n1. Top Off Vehicles with Fuel \\nI never let our two cars go under half a tank but even so, 100% full is always a better option than 50%. Hopefully I will get wind of the pending event soon enough to beat the crowds. \\n2. Do the Laundry \\nIt is not that I hate doing laundry but rather I get lazy about it. It is not unusual to have to do six loads at a time, simply due to procrastination. Given a brewing storm, you can bet the laundry will get done and while I am at it, the bedding will also get changed. \\n3. Inventory Prescription Drugs \\nWith my Ammo Can First Aid Kit already stocked and set aside, I will want to do a quick check on prescription meds and if necessary, get them refilled. \\n4. Charge All Electronic Devices \\nCompared to six years ago, my home is overrun by electronic devices. Three Kindles, three iPads of varying ages, and four laptop computers, and two iPhones make up a motely crew of electronic devices that hold a wealth of both reference material and amusements. All can be charged using portable solar devices (which are pretty darn cheap these days), but if I am stuck indoors for any length of tine, solar is not going to help. \\n5. Set Out Spare Lanterns, Flashlights, and Batteries \\nWhy wait until the power is out before digging out your emergency light sources? As I say this, I am confident in the knowledge that I already have a flashlight in every room of the house as well as a portable lantern. Still, this would be a good time to check to ensure their batteries are fully charged. \\n6. Gather Fresh Biomass \\nRather than use up my back stock of charcoal and wood, I would prefer to burn the odd branches, twigs, leaves I find on the ground. They work perfectly in both my Solo Stove and EcoZoom rocket stoves . Plus, biomass is free for the taking.'"}, "time": 1742561811.6503623}