{"duration": 0.08316183090209961, "input_args": {"text": "'WASHINGTON  —   Nearly two centuries after Georgetown University profited from the sale of 272 slaves, it will embark on a series of steps to atone for the past, including awarding preferential status in the admissions process to descendants of the enslaved, university officials said Thursday. Georgetown’s president, John J. DeGioia, who announced the measures in a speech on Thursday afternoon, said he would offer a formal apology, create an institute for the study of slavery and erect a public memorial to the slaves whose labor benefited the institution, including those who were sold in 1838 to help keep the university afloat. In addition, two campus buildings will be renamed  —   one for an enslaved   man and the other for an   educator who belonged to a Catholic religious order. So far, Dr. DeGioia’s plan does not include a provision for offering scholarships to descendants, a possibility that was raised by a university committee whose recommendations were released on Thursday morning. The committee, however, stopped short of calling on the university to provide such financial assistance, as well as admissions preference. Dr. DeGioia’s decision to offer an advantage in admissions to descendants, similar to that offered to the children and grandchildren of alumni, is unprecedented, historians say. The preference will be offered to the descendants of all the slaves whose labor benefited Georgetown, not just the men, women and children sold in 1838. More than a dozen universities  —   including Brown, Harvard and the University of Virginia  —   have publicly recognized their ties to slavery and the slave trade. But Craig Steven Wilder and Alfred L. Brophy, two historians who have studied universities and slavery, said they knew of none that had offered preferential status in admissions to the descendants of slaves. Professor Wilder, of the Massachusetts Institute of Technology, said Dr. DeGioia’s plans to address Georgetown’s history go beyond any initiatives enacted by a university in the past 10 years. “It goes farther than just about any institution,” he said. “I think it’s to Georgetown’s credit. It’s taking steps that a lot of universities have been reluctant to take. ” But whether the initiatives result in meaningful change remains to be seen, he said. Professor Wilder cautioned that the significance of the preferential status in admissions would rest heavily on the degree to which Georgetown invested in outreach to descendants, including identifying them, making sure they are aware of the benefit’s existence and actively recruiting them to the university. “The question of how effective or meaningful this is going to be will only be answered over time,” Professor Wilder said. Dr. DeGioia’s plan, which builds on the recommendations of the committee that he convened last year, represents the university’s first systematic effort to address its roots in slavery. Georgetown, which was founded and run by Jesuit priests in 1789, relied on the Jesuit plantations in Maryland  —   and the sale of produce and slaves  —   to finance its operations. The 1838 sale, worth about $3. 3 million in today’s dollars, was organized by two of Georgetown’s early presidents, both Jesuits. A portion of the profit, about $500, 000, was used to help pay off Georgetown’s debts at a time when the college was struggling financially. The slaves were uprooted from the Maryland plantations and shipped to estates in Louisiana. Dr. DeGioia said he planned to apologize for the wrongs of the past “within the framework of the Catholic tradition,” by offering what he described as a Mass of reconciliation in partnership with the Jesuit leadership in the United States and the Archdiocese of Washington. “This community participated in the institution of slavery,’’ Dr. DeGioia said, addressing a crowd of hundreds of students, faculty members and descendants at Georgetown’s Gaston Hall. “This original evil that shaped the early years of the Republic was present here. We have been able to hide from this truth, bury this truth, ignore and deny this truth. ” “As a community and as individuals, we cannot do our best work if we refuse to take ownership of such a critical part of our history,’’ he said. “We must acknowledge it. ” When Dr. DeGioia invited questions from the audience, a man in a gray suit took the microphone. “My name is Joe Stewart,’’ he said, “and I am a descendant of the 272. ” Mr. Stewart, a retired corporate executive and an organizer of a group of more than 300 descendants, expressed gratitude to the university’s working group on slavery and to Dr. DeGioia for their efforts. But he said that descendants, who had not been included as members of the committee, must be involved in decision making on these initiatives moving forward. “Our attitude is nothing about us, without us,’’ said Mr. Stewart, who was flanked by five other descendants. The two buildings being renamed by university officials originally paid tribute to the Rev. Thomas F. Mulledy and the Rev. William McSherry, the college presidents involved in the 1838 sale. Now one will be called Isaac Hall to commemorate the life of Isaac Hawkins, one of the slaves shipped to Louisiana in 1838, and the other Anne Marie Becraft Hall, in honor of a   educator who founded a school for black girls in Washington. Dr. DeGioia assembled his working group of scholars, administrators, students and alumni last September, asking them to consider how the university should address its history. Their work took on greater urgency in November in the wake of student demonstrations. In April, The New York Times published an article tracing the life of one of the slaves, Cornelius Hawkins, and his   descendants. Cornelius was the grandson of Isaac Hawkins. In its   report, the committee said that the university’s dependence on slavery was deeper and broader than originally believed. Slave labor and slave sales were envisioned as part of the financing model of the college even before the doors opened in 1789. And slaves were not only forced to work on the Jesuit plantations. Some also toiled on campus, hired from students and other wealthy people. The committee said that it was likely that all of the earliest buildings on campus  —   including the ones named for the university leaders who orchestrated the 1838 sale  —   were built with slave labor. More historical research needs to be done, the committee said, and that will be coordinated by the new research center, the Institute for the Study of Slavery and its Legacies. The university has already selected the program director for the institute, which will also support Dr. DeGioia’s plans to deepen engagement with descendants of the enslaved. Dr. DeGioia, who met with dozens of descendants this summer, plans to establish a new committee for the creation of the public memorial that will include descendants. He also plans, among other efforts, to provide descendants with access to genealogical information housed in the university’s archives. “All of these will have a substantial financial impact,” said Dr. DeGioia, who believes that Georgetown’s philanthropic community will support his initiatives. “I’m very confident that will not be a constraint. ” But some descendants on Thursday expressed disappointment, saying that the university’s measures were inadequate, given the suffering that their ancestors endured. Karran Harper Royal, a descendant of slaves sold in 1838, said that Georgetown, which has an endowment of $1. 45 billion, should have offered scholarships to descendants. And she said that she and others “felt the sting” of not being formally invited to Dr. DeGioia’s speech. “It has to go much farther,” said Ms. Harper Royal, who is also an organizer of the group of descendants. “They’re calling us family. Well, I’m from New Orleans and when we have a gathering, family’s invited. ”'"}, "time": 1742628417.0416636}