{"duration": 0.049887895584106445, "input_args": {"text": "'‘If you build walls, forget about Italian money,’ Rome warns EU over migrant policy  09 Get short URL Hungarian army soldiers erect a fence on the border with Croatia near Sarok, Hungary, September 20, 2015. © Bernadett Szabo / Reuters If certain members of the European Union introduce borders to prevent the movement of asylum seekers, Italy is within its rights to withhold its funding to the EU budget, Prime Minister Matteo Renzi has said. \\n\"We give €20 billion to Europe and the EU gives us back 12, but if Hungary or Slovakia preach to us about migrants and don\\'t give us a hand and then want our money,” then Italy can use its right of veto when discussing the budget in 2017, Renzi said , speaking to Italian RAI 1 TV on Tuesday. \\nHe criticized the plan of some EU countries to shut the borders to prevent the inflow of migrants who mostly arrive in Italy first via the Mediterranean. \\n“If you [EU countries] build a wall, forget about Italian money,” he said, adding that if asylum seekers “don\\'t go there [into other EU countries], the money won\\'t go there either.” Read more 98% of Hungarians reject EU refugee quotas, but low turnout rules referendum invalid \\nRenzi commented on the recent incident in the small commune of Gorino in northern Italy, where local residents barricaded entrances to the town in protest at the arrival of migrant women and children. \\n“The story of… Gorino is a difficult matter to judge. On the one hand, a part of the population is very tired and concerned by reports of new [asylum seeker] arrivals. On the other hand, we are talking about 11 women and eight children [later it was reported that there were 12 women],” he said. \\nThe incident in Gorino on Monday night saw protesters use planks of wood and iron bins to create road blocks at three entrances to the commune, while shouting anti-migrant slogans. The women were then relocated to neighboring towns and communes. \\nEarlier on Tuesday, the Italian Interior Ministry said that more than 153,000 asylum seekers had arrived in Italy since the start of 2016. \\nOver a million people, fleeing from wars in Syria, Iraq, Afghanistan, and elsewhere, flooded Europe in 2015, causing the largest migrant crisis faced by the continent in decades. \\nThousands of refugees arrive in Italy every month as they brave the dangerous boat trip across the Mediterranean from Libya, which has already led to hundreds drowning. \\nIn September, Hungary sealed off its southern border with a wire fence to stop the flow of refugees. The measures were taken after the authorities estimated that as many as 1,500 illegal migrants had passed the Hungarian border every day, with most of them having taken the so-called Balkan route and moving on to Germany.'"}, "time": 1742563313.1702132}