{"duration": 0.041762351989746094, "input_args": {"text": "'License DMCA In a recent advancement, 12 men are in the process of going legal against the state of Utah in the Federal court challenging a law which allows mothers to put their babies up for adoption without the biological father\\'s consent, or knowledge.\\nOur family court system must re-access this provision and make amendments in a way that establishes the fact that fathers are an integral part of a child\\'s life. Every other weekend and one night a week is not a parent child relationship for sure and hence, cannot be considered as equal parenting. Until the courts cease ordering visitation and start affiliating the fathers with the same rights as mothers, children of divorce will continue to suffer. \\nChildren\\'s best interest lies in equal parenting. Even after a couple goes through a divorce, equal parenting must be advocated for children\\'s best interest. Some reasons for this are listed below; Fatherless children are at a dramatically greater risk of drug and alcohol abuse, mental illness, suicide, poor educational performance, teen pregnancy, and criminality.\" Source: U.S. Department of Health and Human Services, National Center for Health Statistics, Survey on Child Health, Washington, DC, 1993. \"Teenagers living in single-parent households are more likely to abuse alcohol and at an earlier age compared to children reared in two-parent households.\" Source: Terry E. Duncan, Susan C. Duncan and Hyman Hops, \"The Effects of Family Cohesiveness and Peer Encouragement on the Development of Adolescent Alcohol Use: A Cohort-Sequential Approach to the Analysis of Longitudinal Data\", Journal of Studies on Alcohol 55 (1994). \"The absence of the father in the home affects significantly the behavior of adolescents and results in the greater use of alcohol and marijuana.\" Source: Deane Scott Berman \"Risk Factors Leading to Adolescent Substance Abuse\", Adolescence 30 (1995) Researchers in Michigan determined that \"49 percent of all child abuse cases are committed by single mothers.\" Source: Joan Dotson and Sharon Shay, \"A Study of Child Abuse in Lansing, Michigan\", Child Abuse and Neglect, 8 (1984). \\nSuch studies and reports as mentioned above are many and we will provide additional data in future articles. We started Fathers4Justice in an effort to garner Father\\'s rights against the corrupt courts and address the concerns regarding the family law, including child custody and child support that affect fathers and their children. There is a serious need for a change of the law since a decision about a child\\'s future, its well-being cannot and should not be taken by the mother alone. It\\'s high time that equal parenting rights must be brought into implementation. - Advertisement -'"}, "time": 1742562553.5530899}