{"duration": 0.14106965065002441, "input_args": {"text": "'Chris Christie’s job approval is at a career low. Nearly   of New Jersey voters, and half his fellow Republicans, said in a recent poll that he should have been a defendant in the trial over the George Washington Bridge lane closings, in which two of his former aides were convicted last month. And in a stinging turnabout, Bill Stepien, the campaign manager whom Mr. Christie dismissed in the   Bridgegate scandal, is expected to become Donald J. Trump’s White House political director, while Mr. Christie was fired as transition chief and shut out of jobs in Mr. Trump’s administration, despite having been one of his earliest   supporters. Welcome home, Governor. “Governor Christie has been abandoned by virtually everyone,” Krista Jenkins, director of the Fairleigh Dickinson University PublicMind Poll, said when the findings showing his approval rating at 18 percent were released this month. Once considered the Republican Party’s best hope to win the White House, Mr. Christie has endured months of humiliation after he dropped out of the presidential race and endorsed Mr. Trump  —   who mocked him as they campaigned together for eating too many Oreos, and passed him over as the   nominee. Now, Mr. Christie has returned to New Jersey a lame duck in his last year to discover voters angry over his absences and a Legislature suddenly unwilling to go along with his agenda. “If he was at one time a bipartisan figure who was able to unite both sides of the aisle and even draw union support, that’s completely evaporated,” Ms. Jenkins said in an interview. “It’s hard to find anyone in recent memory who is in such disfavor. ’’ Mr. Christie still believes he has a political future nationally. He wants to write a book and his friends have been telling people in New Jersey that the governor expects Mr. Trump to eventually come around to him. According to their scenario, the White House management team of Jared Kushner, Stephen K. Bannon and Reince Priebus will be a disaster and Mr. Christie will be tapped as the skilled manager, like David Gergen, the former aide to Richard Nixon and Ronald Reagan who swooped in to steady Bill Clinton’s administration after a raucous first year. Mr. Christie’s popularity in his home state, stratospheric after his handling of Hurricane Sandy, began to fall with Bridgegate, but sank even lower as he spent so much time out of the state, first leading the Republican Governors Association, then running for president. By the time he abandoned his own run and endorsed Mr. Trump, his constituents had come to believe he would do just about anything to escape New Jersey. He has left them with 10 credit downgrades, more than any other governor nationwide. And as if the state’s finances were not bad enough, Mr. Christie has spent at least $10 million of taxpayer money to defend himself in the bridge scandal, and most New Jersey voters say they do not believe he has told the truth about his involvement. His waning popularity now means waning power, as he discovered last week in a surprise legislative defeat. The governor and the Democratic leaders of the State Legislature were rushing through a hastily written bill that would have relaxed ethics laws to allow Mr. Christie to profit from sales of a book and given raises to hundreds of public officials. And, in what the governor’s critics called his “revenge bill,” the same package of legislation would have eliminated a requirement that local governments pay to publish legal notices in newspapers  —   punishing an industry that relentlessly chronicled the bridge scandal. It was the kind of deal that would have breezed through even a year ago, when Mr. Christie wielded so much control that Republicans reversed their own votes to block overrides of his vetoes. This time, his own lieutenant governor, Kim Guadagno, who, along with her husband, a judge, was in line for a raise, called the legislation “ridiculous. ” On Twitter, #ChristieBookTitles trended, with suggestions including “A Bridge to Nowhere,” “The Very Hungry Governor” and “Oh, the Places You Won’t Go!” With the public flooding their offices with angry phone calls, Republicans who have stood by Mr. Christie began running away from him. “That’s not my bill,” said Jon M. Bramnick, the Republican leader of the State Assembly and one of the governor’s most steadfast supporters. And Democratic leaders, who had helped Mr. Christie secure victories on public employee benefits that made him a national figure in his first term, reversed themselves and yanked the bills without putting them up for a vote. “He thought he could do what he’s done in the past  —   get Democratic leadership on his side and use that to push through whatever he wanted,” Jeff Tittel, the director of the New Jersey chapter of the Sierra Club and a frequent Christie critic, said, calling it “the biggest blunder since he’s been governor. ” “I haven’t seen as much public outrage since Florio wanted to tax toilet paper,” Mr. Tittel said, referring to former New Jersey Gov. Jim Florio’s imposition of a tax on paper products in 1990. (Mr. Florio, a Democrat, and Mr. Christie are now tied for the   job approval, at 18 percent Gov. Brendan Byrne, another Democrat, hit 17 percent, the record low for New Jersey governors, in 1977, but was  . Now, at 92, he is generally beloved.) State Senator Jennifer Beck, a Republican, said that after Mr. Christie’s absences there was “an expectation that now that he’s back, he’s going to grapple with the major issues in this state. ” Those would include high property taxes, the nation’s highest foreclosure rate and its most underfunded pension system. When he and the Democratic leaders rushed to pass measures for raises  —   estimated at $10 million a year  —   and to allow him to profit from writing a book, they showed they were out of touch with the public, she said, “kind of like having a tin ear. ” Ms. Beck said she expected that the governor’s unpopularity would mean more Republicans distancing themselves from him. “When the citizenry are behind you, it’s much harder to challenge,” Ms. Beck said. “When the people aren’t with you, it’s easier. ” Mr. Christie said in a speech last month that he intended to leave the same way he came in: “loudly. ” And on his monthly   radio show last week, he blamed “the haters,” who made it “personal, about me,” for the legislative defeat. “That’s O. K. that’s fine,” he said. “They get to do what they want to do. ” He insisted he would continue pushing the bill involving the newspapers, though his remarks suggested he was counting down his time. “I have 391 days,” he said, “and I’m not going to get off this issue. ” His office declined to comment on what else the governor might focus on during his last year in office, saying he would reveal his plans in his State of the State speech next month. In recent weeks, most of Mr. Christie’s public events have been around the issue of recovery from drug addiction, which he has long spoken about as a personal cause following the death of a close friend. He has also announced plans to renovate the State House, which again raised eyebrows, given that it is expected to cost $300 million at a time when the state has severe debt. Renovations would also force Mr. Christie’s successor, widely expected to be a Democrat, into rented office space rather than the official quarters for at least four years. Mr. Christie has not taken questions from reporters in more than 100 days. He has spent several mornings guest hosting a New York sports radio show, prompting speculation that he is auditioning for a more permanent role should the Trump administration not come knocking. And even his supporters said it would be hard for Mr. Christie to get much accomplished. “When you’re in the last year of a second term, it’s difficult,” Mr. Bramnick, the Republican Assembly leader, said. “Everyone’s looking to the future. ” Is the governor’s approval rating as low as it can go? Not quite, said Patrick Murray, the director of the Monmouth University Polling Institute, citing President François Hollande of France. “His approval rating is at 4 percent,’’ Mr. Murray said. “So that gives Christie something to shoot for. ”'"}, "time": 1742563112.6987257}