{"duration": 0.05965542793273926, "input_args": {"text": "'Comment \\nFloyd Mayweather Jr. insisted that the only reason he attended the Pacquiao vs Vargas fight was so that he could take his daughter to see the match. Boxing pundits think there’s more to the story than meets the eye. \\nMayweather retired from boxing after his 12-round domination of Andre Berto in September 2015. His record currently stands at 49-0. He shares that feat with boxing legend Rocky Marciano. \\nMany believe Mayweather is too ambitious to turn down a shot at 50-0. The five-division world champion even left the door open for a comeback fight, but only if the price is right. \\n“Right now, I’m happy on this side, but I’ve been talking and you just never know,” he told The Telegraph . “If I came back, of course, it would have to be a nine-figure payday and probably a championship fight and a nine-figure payday.” \\nAlso Read: Canelo Alvarez vs Gennady Golovkin Will Happen, Says Bernard Hopkins \\nThere are only two names in boxing today that could make Mayweather’s comeback fight a reality: Manny Pacquiao and Canelo Alvarez. Both have lost to Mayweather in the past and have been grumbling for a rematch ever since. \\nPacquiao is emerging as the clear-cut favorite. The Filipino icon is fresh off his unanimous decision victory against Jessie Vargas for the WBO welterweight title. \\nTop Rank CEO Bob Arum stated that negotiations for a Mayweather vs Pacquiao rematch would be easier this time around since most of the legal work have already been ironed out before the first fight, Boxing News Online reported. \\nAlso Read: Manny Pacquiao vs Gennady Golovkin Super Fight Planned For 2017? \\nPacquiao is also doing his part in building hype for the possible rematch. He hasn’t been a tad shy about wanting to fight Mayweather next. \\nJust recently, Pacquiao posted a strong hint on Instagram that he could be set for a second go around with Mayweather. The first-term senator showed of his new jacket, which featured a sewn image of him on the right inner pocket and an image of Mayweather on the left inner pocket. \\nPacquiao then asked his followers, “Like my jacket?” Only time will tell if his sleek coat is an accurate omen of things to come. \\nLiked this story? Subscribe to our newsletter or follow us on Twitter and Facebook for more boxing news. Continue Reading'"}, "time": 1742564109.344743}