{"duration": 0.06300544738769531, "input_args": {"text": "'LONDON  —   Prime Minister Theresa May of Britain refused to comment on Sunday about the reported failure of an unarmed British Trident missile that was   from a submarine off the coast of Florida in June. Mrs. May said in a television interview with the BBC that she had “absolute faith in our Trident missiles. ” But she would not say whether she had known about the failure or whether, as The Sunday Times of London reported, it had been covered up by Downing Street under her predecessor, David Cameron, shortly before the referendum on Britain’s exit from the European Union. Mrs. May did not mention any missile failure in her first major speech to Parliament on July 18, when she persuaded Parliament to spend up to 40 billion pounds, or about $53 billion then, on four new submarines to keep Britain’s nuclear deterrent up to date. “There are tests that take place all the time, regularly, for our nuclear deterrence,” she said on Sunday. “What we were talking about in that debate that took place was about the future. ” The Sunday Times reported that the Trident II D5 missile, which was designed to carry a nuclear warhead but was unarmed for the test, had veered off course after being fired from HMS Vengeance, one of Britain’s four aging   submarines. The British Navy had not performed such a test for four years because of the expense of the missile, but had carried out tests in 2000, 2005, 2009 and 2012, all of which had been successful and publicized by the Ministry of Defense. The current test took place after the submarine had been refitted with new missile launch equipment and upgraded computer systems. Replacing Trident has been controversial because of the cost and because the current leader of the Labour Party, Jeremy Corbyn, long an antinuclear campaigner, is opposed to retaining Britain’s nuclear deterrent, while his party’s official position has been to retain and renew it. “It’s a pretty catastrophic error when a missile goes in the wrong direction, and while it wasn’t armed, goodness knows what the consequences of that could have been,” Mr. Corbyn said on Sunday. Speaking to Sky News, he said, “We understand the prime minister chose not to inform Parliament, and instead it came out through the media. ” He repeated his belief that Britain should commit to nuclear disarmament. Kevan Jones, a Labour member of Parliament and a former defense minister, called for an inquiry into the failed missile test. “The U. K.’s independent nuclear deterrent is a vital cornerstone for the nation’s defense,” he said. Parliament is likely to ask Defense Secretary Michael Fallon to answer questions about the report. Separately, Mrs. May confirmed that she would meet with President Trump in Washington on Friday in the first visit of a foreign leader to the new president, a traditional prize that Britain has been seeking avidly. She said she would emphasize to Mr. Trump the importance of the NATO military alliance, calling it a “bulwark” of the West, and would say that Britain favors the progress and cohesion of the European Union, even though the country plans to leave the bloc. Trade will be an important topic, she said, with Britain wanting new   agreements with key countries, including the United States, after it leaves the European Union. Mr. Trump, a supporter of “Brexit,” as Britain’s departure from the bloc is known, has said that he is open to early talks on such a deal with Britain. Legally, no new deal can be made until Britain formally leaves the European Union, which is unlikely for at least two years. Mr. Trump’s slogan of “America First” and his protectionist comments may mean that a trade deal will be difficult to negotiate despite the good will expressed by both sides. Mrs. May was asked about Mr. Trump’s attitudes toward women. “I’ve already said that some of the comments that Donald Trump has made in relation to women are unacceptable, some of those he himself has apologized for,” she said. When she meets Mr. Trump, she said, “I think the biggest statement that will be made about the role of women is the fact that I will be there as a female prime minister. ”'"}, "time": 1742564270.349045}