{"duration": 0.06508827209472656, "input_args": {"text": "'By Lorraine Chow\\nYet another study has determined that hydraulic fracturing, or fracking , might be a major public health threat . In one of the most exhaustive reviews to date, researchers from the Yale School of Public Health have confirmed that many of the chemicals involved and released by the controversial drilling process can be linked to cancer .\\n“Previous studies have examined the carcinogenicity of more selective lists of chemicals,” lead author Nicole Deziel, Ph.D., assistant professor explained to the school . “To our knowledge, our analysis represents the most expansive review of carcinogenicity of hydraulic fracturing-related chemicals in the published literature.”\\nFor the study, published in Science of the Total Environment, the researchers assessed the carcinogenicity of 1,177 water pollutants and 143 air pollutants released by the fracking process and from fracking wastewater . They found that 55 unique chemicals could be classified as known, probable or possible human carcinogens. They also specifically identified 20 compounds that had evidence of leukemia/lymphoma risk.\\nOne of the scarier parts from this study is that the researchers could not completely unpack the health hazards of fracking’s entire chemical cocktail. More than 80 percent of the chemicals lacked sufficient data on cancer-causing potential, “highlighting an important knowledge gap,” the school noted.\\nThe unconventional drilling rush in the U.S. has expanded to as many as 30 states, spelling major consequences to the air we breathe and the water we drink. The Wall Street Journal reported in 2013 that more than 15 million Americans lived within a mile of a well.\\nThe biggest concern is for people and especially children with fracking operations right in their backyards. In fact, Environment America found that more than 650,000 kindergarten through 12th grade children in nine states attend school within one mile of a fracked oil or gas well.\\n650,000 Children in 9 States Attend School Within 1 Mile of a #Fracking Well https://t.co/wh8056P669 @MarkRuffalo @FrackAction @joshfoxfilm \\n— EcoWatch (@EcoWatch) October 13, 2016 \\n\\n“Because children are a particularly vulnerable population, research efforts should first be directed toward investigating whether exposure to hydraulic fracturing is associated with an increased risk,” Deziel said.\\nPer the study, “Childhood leukemia in particular is a public health concern related to [unconventional oil and gas] development, and it may be an early indicator of exposure to environmental carcinogens due to the relatively short disease latency and vulnerability of the exposed population.”\\nAccording to the school, the researchers are now taking air and water samples in a community living near a fracking operation. They are testing for the presence of known and suspected carcinogens and will determine whether these people have been exposed to these compounds, and if so, at what concentrations.\\nLorraine Chow is a reporter for EcoWatch. She tweets @lorrainelchow \\nSource: EcoWatch \\n'"}, "time": 1742563864.361959}