{"duration": 0.17074108123779297, "input_args": {"text": "'An inspirational poster hangs above the Trump Tower desk of Hope Hicks, the    press secretary for Donald J. Trump’s presidential campaign, squeezed in among the framed Time magazine covers of Mr. Trump and exuberant   notes written in his inimitable scrawl (“Hopie  —   You’re the greatest! ”). “Fate whispers to the warrior, ‘You cannot withstand the storm,’” it reads. “And the warrior whispers back, ‘I am the storm. ’” Ms. Hicks, a onetime champion lacrosse player who signed a Ford modeling contract as a teenager, had never worked in politics before last year, and her widest exposure had been as a   in a Nickelodeon children’s television special about golf. Now she plays confidante and sometime gatekeeper to the presumptive Republican nominee for president and, improbably, serves as Mr. Trump’s sole liaison to the teeming national press corps. Hillary Clinton employs a     media handlers who field hundreds of daily requests. Mr. Trump has Ms. Hicks, who was working for his daughter Ivanka’s luxury lines and for the Trump real estate brand when the candidate called her to his office in early 2015 and declared that she was joining his campaign. “Mr. Trump sat her down and said, ‘This is your new job,’” said her mother, Caye Cavender Hicks. “It was a shocker. ” Hope Hicks had trained at Hiltzik Strategies, the powerful public relations firm that represents Hollywood clients and corporate executives, before Ms. Trump brought her  . She was commuting from an apartment she shared with her sister in Greenwich, Conn. above the dive bar where her father had his first beer at 18. Suddenly, she found herself a   presence by Mr. Trump’s side, flying in his jet, living   in a   apartment and attending to his mercurial moods. She is arguably the least credentialed press secretary in the modern history of presidential politics. But for journalists who cover the campaign, she is sometimes the Jekyll to Mr. Trump’s Hyde, emailing angry complaints from her   boss (“dishonest”) and often concluding with her own polite  : “Best, Hope. ” Seemingly unfazed by her boss’s outbursts, she can detect the best moments for reporters to make requests  —   knowing, for instance, not to bother Mr. Trump while he is watching a major golf tournament. “Her most important role is her bond with the candidate,” said Paul Manafort, the veteran Republican adviser who, as of this past week, had been put in charge of the campaign. “She totally understands him. ” Or, as Ivanka Trump said in an interview: “My father makes people earn his trust. She’s earned his trust. ” And not without some steeliness. Ms. Hicks remained in her role even as Mr. Trump fired Corey Lewandowski, his campaign manager and another early member of his team. Mr. Lewandowski and Ms. Hicks are close friends: He has visited her family in Greenwich for    dinners and, days after Mr. Trump clinched the Republican nomination (and fired a key political aide) they took in a Hall  Oates concert with her parents in the V. I. P. tent at the Greenwich Town Party. But it was ultimately Ms. Hicks who announced Mr. Lewandowski’s departure, describing it as “a parting of ways. ” Friends of Ms. Hicks say they are thrilled by her sudden rise, dismissing concerns that her ties to Mr. Trump could damage her nascent career. “She believes in him, his leadership and abilities, and she’s thrown herself completely into this,” said Michael Feldman, a prominent Democratic strategist and family friend. “I don’t think that ties her personally to everything that’s been said. ” But some say they are alarmed that Ms. Hicks is promoting, and defending, a candidate who has been denounced as a demagogue, a racist, a misogynist and even a fascist. In Greenwich, where her family is part of the civic firmament, the topic of her association with Mr. Trump can get touchy. “Believe me, there are times when I would like to voice my opinion,” said Drew Marzullo, a Greenwich town selectman and Democrat who is close with Ms. Hicks’s sister, Mary Grace. He recalled doing a double take after spotting Mr. Lewandowski and other Trump aides with the family at the Hall  Oates concert. Still, he added, “It would be unfair for someone to judge Hope or the family based on her job. ” In fact, Ms. Hicks is the third generation of her family to represent a powerful but highly controversial client. Her grandfather led public relations for Texaco during the 1970s oil crisis. Her father, Paul B. Hicks III, represented a major tobacco company in Connecticut and later was the top communications executive for the National Football League, where he dealt with scandals over player safety and the Patriots’ deflated footballs. Her establishment pedigree aside, Ms. Hicks does not fit the part of the typical campaign press secretary, spinning reporters and gossiping over expensed drinks on the trail. Among journalists, Ms. Hicks is not known to wrangle, cajole or mingle, serving as more of a conduit for her intensely   boss, who likes to act as his own chief spokesman. Unlike her Clinton counterparts, who take pains to shape their candidate’s image, Ms. Hicks is not active on Twitter and does not show up on cable talk shows. Contacted for this article, she declined to be interviewed, insisting that she did not want to draw attention away from her candidate. Reporters praise Ms. Hicks for her poise amid a chaotic campaign. But some say that she can be unresponsive to questions, a habit so pervasive that it spawned a mocking, anonymous Twitter account, @HicksNoComment. On the trail, political reporters say Ms. Hicks rarely interacts with them at rallies, preferring to communicate by text or telephone. Ms. Hicks  —   perhaps the only campaign press secretary to have been photographed as a teenager by the fashion photographer Bruce Weber, in a campaign for Naturalizer shoes  —   favors Burberry trench coats and heels, a break from the scruffy ranks of harried campaign operatives. One reporter recalled staggering into a New Hampshire rally after a snowstorm, soaked in water and ice, only to find Ms. Hicks dressed impeccably, her makeup unmussed. Still, the stresses of the campaign have occasionally spilled into public view: Despite their friendship, Ms. Hicks and Mr. Lewandowski were spotted in a screaming match on a Manhattan sidewalk, which later turned up in The New York Post, fueling reports of internal tensions. Mostly, however, Ms. Hicks is a friendly, if disciplined, presence  —   Southern charm by way of Fairfield County. (Upon accompanying Mr. Trump to Scotland this past week, she told a reporter wryly, “I don’t do well in plaid. ”) And she is unfailingly deferential to her employer, whom she refers to only as “Mr. Trump” or “sir. ” He seems to appreciate it. “I’m lucky to have her,” Mr. Trump said in a telephone interview on Thursday. “She’s got very good judgment. She will often give advice, and she’ll do it in a very   manner, so it doesn’t necessarily come in the form of advice. But it’s delivered very nicely. ” Did he have qualms about hiring a campaign spokeswoman with no political background? “Well, I have a lot of political experience, so I wasn’t really concerned about it,” Mr. Trump said. “And if it didn’t work out, I would be able to make a fast change,” he said. “But it has worked out. ” Mr. Trump sent flowers to Ms. Hicks’s family when her grandmother died earlier this year. Her parents also visited    Mr. Trump’s Florida resort, where he greeted them and teased Mr. Hicks about the N. F. L. “He could not have been nicer,” Caye Hicks said. Ms. Hicks’s success has not surprised her family (“Hope’s a fighter,” as her father said) even as they harbor some concern about the intensity of her work. “She doesn’t really talk to anybody anymore, she has no life,” Caye Hicks said. Mr. Trump’s rallies, where violent protests sometimes break out, can also be disconcerting. “I have to hope the Secret Service is keeping them all safe,” Caye Hicks said. “It’s a crazy atmosphere. ” She added: “I can’t actually let her know how worried I am. ” On free nights, Ms. Hicks retreats to her parents’ home in Greenwich  —   her mother sometimes hears a creaking door at 2 a. m.  —   to unwind. Her sister, Mary Grace, is a paramedic there, and her father, a former town selectman, remains a prominent figure: This spring, Greenwich proclaimed April 23 as Paul B. Hicks III Day to recognize his philanthropy. Ms. Hicks grew up in Greenwich swimming and golfing. When she was in sixth grade, a neighbor invited Ms. Hicks and her sister to a Ralph Lauren tryout soon their photographs were in Bloomingdale’s. She made a cameo on “Guiding Light,” appeared on the covers of young adult paperbacks like “Gossip Girl” and once read lines for a film role with Alec Baldwin. At age 13, Ms. Hicks told Greenwich Magazine, for a cover story about the Hicks sisters’ modeling careers, that she was “not ready to decide if modeling is what I want to do with my life. ” “If the acting thing doesn’t work out,” she said, “I could really see myself in politics. Who knows?” The Hicks sisters earned enough from modeling to file tax returns. But Hope preferred lacrosse, leading Greenwich High School to a state championship and later playing at Southern Methodist University, where she majored in English. After graduation, she and her father bumped into Mr. Baldwin at the Super Bowl. The meeting led to an interview and job offer from Matthew Hiltzik, whose clients include Mr. Baldwin and, fatefully, Ivanka Trump, who was impressed by Ms. Hicks and eventually hired her away. Aside from Mr. Trump’s children, Ms. Hicks is now the   aide on his presidential bid. Mr. Feldman, the family friend, said he doubted that anyone anticipated it would last this long. “You do the best you can under very unusual circumstances,” he said. “In this case, circumstances that are more unusual than most. ” The campaign is looking to hire a communications director. But as the general election looms, Ms. Hicks, who has recently been featured in Marie Claire and GQ, remains loyal, apparently unperturbed by the controversies swirling around her candidate and prepared to stick it out. Mr. Trump, asked if Ms. Hicks would have a spot in his administration, replied, “She would definitely have a role. ” How about press secretary? “I don’t want to comment on that,” he said. “It’s too early. I don’t want to be making those prognostications yet. But she’ll certainly be involved with us. She’s terrific. ”'"}, "time": 1742561852.0921085}