{"duration": 0.09091734886169434, "input_args": {"text": "'  GPD is our General Posting Department whereby we share posts from other sources along with general information with our readers. It is managed by our Editorial Board He who has no name speaks: Italian earthquakes were retribution for anti-Jewish UNESCO vote By GPD on October 28, 2016 Likud deputy minister: Italy earthquakes retribution for UNESCO vote Deputy Minister Ayoob Kara attributes two earthquakes in Italy, during which he was on a state visit to the Vatican, to Italy\\'s decision to vote for a UNESCO resolution disregarding Jewish connection to Jerusalem Deputy Minister Ayoob Kara By Itamar Eichner for YNet News, Israel Deputy Minister Ayoob Kara (Likud) caused controversy when he blamed two massive earthquakes which hit Italy on Wednesday for the country’s vote in favor of a UNESCO resolution disregarding a Jewish connection to the Temple Mount. The deputy minister, who was in Italy when the earthquakes hit, ascribed the natural disasters to divine will.The resolution itself sparked an outcry in Israel and among the international Jewish community since it disregarded the Jewish connection to its holy sites in Jerusalem.\\nKara headed an Israeli delegation to the Vatican which was sent in an effort to shore up opposition for the resolution. Kara even managed to have a short conversation with the Pope during his visit. \\n“Going through the earthquake wasn’t the most comfortable of experiences, but we trusted that the Holy See would keep us safe,” Kara wrote in his memo. \\n“I’m sure that the earthquake happened because of the UNESCO decision, which the Pope strongly disagreed with. He even said publicly that the holy land is connected to the Nation of Israel.” \\nAfter recovering from the earthquake, Kara met with the Cardinal Secretary of State Pietro Parolin, and tried to convince the cardinal to change the Vatican’s position on the UNESCO decision. \\nTwo earthquakes, which struck Italy this week, were “retribution” for the country’s support of the UNESCO resolution disregarding the Jewish connection to Jerusalem, Israeli Deputy Minister for Regional Cooperation Ayoob Kara said. \\n“I’m sure that the earthquake happened because of the UNESCO decision,” Kara, a member of the ruling Likud Party, wrote in a memo, Ynetnews website reported. \\nIronically, the Israeli politician was on a state visit to the Vatican when the quakes hit central Italy on Wednesday, killing one and injuring 10 people. \\nEarlier the same day, UNESCO (United Nations Educational, Scientific and Cultural Organization), passed a resolution criticizing Israel for its handling of the holy site in Jerusalem – called Temple Mount by Jews, and Haram al-Sharif by Muslims. \\nThe document was adopted after heated debate over its wording, and particularly the Arabic names used in the document. Italy was among the nations voting in favor of the resolution. \\nIsrael blasted UNESCO and its Arab members for trying to undermine Jewish connections to the holy site. \\nKara arrived in the Vatican in a fruitless effort to avert the resolution, but still managed to have a small chat with the leader of the Catholic Church. \\nAccording to Kara, Pope Francis “strongly disagreed” with the resolution. \\n“He (the Pope) even said publicly that the holy land is connected to the Nation of Israel,” the deputy minister stressed. \\nAs for surviving the natural disaster, the Israeli politician said that “going through the earthquake was not the most comfortable of experiences, but we trusted that the Holy See would keep us safe.” Related Posts: No Related Posts The views expressed herein are the views of the author exclusively and not necessarily the views of VT, VT authors, affiliates, advertisers, sponsors, partners, technicians, or the Veterans Today Network and its assigns. LEGAL NOTICE - COMMENT POLICY Posted by GPD on October 28, 2016, With 289 Reads Filed under World . You can follow any responses to this entry through the RSS 2.0 . You can skip to the end and leave a response. Pinging is currently not allowed. FaceBook Comments 5 Responses to \" He who has no name speaks: Italian earthquakes were retribution for anti-Jewish UNESCO vote \" Trakkath October 28, 2016 at 11:12 pm \\nDUNE! Major Earth Quakes in Italy!'"}, "time": 1742564419.8671808}