{"duration": 0.3843090534210205, "input_args": {"text": "'On a hot night in July at Skylight Books in Los Angeles, Zackary Drucker and Rhys Ernst perched on stools to discuss their new book of photographs, “Relationship. ” It is by far the most personal of the many projects they have worked on together. The photographs chronicle their   romance, which ended soon after many of these images were shown at the Whitney Biennial in 2014. Drucker and Ernst, who are perhaps better known as producers of the   winning Amazon series “Transparent,” speak regularly about their work. But Drucker is plainly more at ease in the spotlight. She is tall and blond, with eyes as blue as swimming pools. That night she wore a white shift and   heeled   and she kept the microphone in its stand so she could gesture with her hands. The images, she told the audience, were meant as a private visual diary. “There was never an intent to show the photographs, even though we are both   makers. ” They are both 33 and around the same height, but Ernst appears slighter. Wearing light brown pants, bright white Reeboks and a diamond stud in his right ear, he explained that he and Drucker have backgrounds in “  ethnography,” which he defined as “the practice of creating   reflexive work, or work that reflected my community. ” This, he said, was a guiding impulse for the photographs in “Relationship. ” Anyone familiar with the rush of young love will recognize its hallmarks in these photos: all smoldering looks, parted lips and bare limbs on rumpled sheets. Drucker and Ernst have an easy sexual charisma, but that’s not what makes this series novel, even daring. During the years they were together, from 2008 to 2014, Drucker was in the process of transitioning from male to female, and Ernst from female to male. They met soon after they each began taking hormones, so the photographs also capture what Ernst has described as “the unflattering throes of yet another puberty. ” In calling this series “Relationship,” Drucker and Ernst are describing not only their partnership but also their relationship with themselves and their genders, their choices and their bodies. Though Drucker and Ernst are no longer a couple, they chose to publish these photographs anyway, because even as transgender stories are becoming more mainstream, there are few public examples of trans people leading ordinary lives, filled with love and lazy mornings. There are even fewer cases, as Drucker and Ernst emphasized that night in July, of trans people taking control over how they are represented. On “Transparent,” whose third season begins this month, their goal has been to ensure not just that trans people are depicted accurately on screen, but also that they are working behind the scenes  —   as writers, directors and personal assistants. Except for the character of Maura, a father who comes out to his family as trans, played by Jeffrey Tambor, every trans role on the show is filled by a trans person. The desire to see more transgender people in front of and behind the camera also informs much of Drucker’s and Ernst’s work as artists. Drucker is often the star of her own experimental videos and performances, which challenge conventional views of sex and gender. Her work has been shown at MoMA’s PS1, the Museum of Contemporary Art in Chicago and SFMoMA. Ernst’s narrative filmmaking tends to feature trans actors and documentary subjects and travel the   festival circuit. He is at work on his first   feature, which he describes as a “  aged     movie comedy. ” “I remember when we were installing the photographs at the Whitney, someone asked us: ‘Oh, this is great. Who was the photographer? ’’u2009” Ernst told the bookstore crowd. “They assumed we were just the subjects, which is of course the history of this kind of work. But this is what I hope changes going forward. It’s the work we’re doing in television. It’s the work we’re doing in filmmaking. It’s the work we’re doing in photography. It’s making trans people the author, rather than just the subject. That’s really the key. ”   cultural representations of trans people have historically reduced them to objects of pity or scorn. “Over and over again, somebody is crying in the mirror, taking off their wig,” Ernst said over dinner at a gastropub near the Silver Lake home he shares with his partner, Patrick Staff, an artist. “There are these fixations that   gender people get that are not the way our lives are being lived at all. ” (To be “  gender” is to identify as the gender you are assigned at birth i. e. not trans.) A prime example, he said, is “Dallas Buyers Club,” a critically acclaimed film that earned Jared Leto an Oscar in 2014 for his supporting role as Rayon, an H. I. V.  positive trans woman. “She was a throwaway character,” Ernst griped, “a drug addict who was there to make the protagonist learn about himself, and she was named after a synthetic fabric. That’s not a real person. ” In the two years since, there has been a marked political and cultural shift, and a growing public fascination with trans people. For Drucker and Ernst, whose work has always been about making the trans experience more visible, this has meant a much bigger audience. “There needs to be a little demystifying about trans existence,” Ernst said. “That’s why people have so many burning questions about it all. ” Soon after their photographs were installed at the Whitney, they began working on the first season of “Transparent” with Jill Soloway, the show’s creator. Soloway met Ernst when they each had a short film screening at the Sundance Film Festival in 2012. Soloway’s father had just come out as trans, and she found herself opening up to Ernst about what she was going through. They kept in touch. After Soloway finished writing the “Transparent” pilot, she reached out to Ernst and Drucker, knowing that she needed trans people involved from the start. “Everyone knows and loves them,” she told me in her office on the Paramount lot. “They’re the homecoming king and queen of the trans movement. ” Drucker and Ernst say the show has been able to “undo a lot of damage” when it comes to popular portrayals of trans people. Maura is not a sad loner whose every act and thought is about transitioning. Rather, she is the parent of a flawed but loving family in which everyone seems uncomfortable in their skin. Initially hired as consultants to prevent the show from trafficking in trans stereotypes, Drucker and Ernst were swiftly promoted to producers. They now offer notes on scripts, watch rough cuts of episodes and work closely with the writers and actors to make the trans performances as authentic as possible. Drucker helps Tambor understand how Maura feels about herself and her body, and she tweaks his mannerisms onscreen, regularly nudging him to close his legs, for example. Ernst directs the opening credits. Both also lead what they call “Trans 101” for everyone involved with the show, from Amazon executives to truck drivers, in which they explain the etiquette of working with trans colleagues. They stress that it is best to ask what pronoun people prefer. They advise against inquiring about the genitals or birth names of trans people, or referring to them as “trannies” or “ . ” “People are afraid of saying the wrong thing, so they don’t have the conversation,” Drucker says. “But I think there’s no undignified questions, only undignified answers. ” For many of the show’s trans performers and crew members, all of this has been   changing. “’u2009‘Transparent’ was my   out party,” Trace Lysette said at the show’s panel at Outfest, the L. G. B. T. film festival in Los Angeles, in July. Like many trans women, Lysette struggled for years to find employment, making money by stripping and sex work before she landed a recurring role as Shea, a friend of Maura’s. “It’s allowed me to get up off the pole and have a career that I never thought would really happen,” she said. Silas Howard, the show’s first trans director, says the call from Soloway was like getting “a golden ticket. ” Tambor has begun teaching acting classes for trans people in Los Angeles. Drian Juarez, the program manager of the Transgender Economic Empowerment Project, a Los Angeles nonprofit group, told me that the show’s success has inspired other companies, including NBC and Ryan Seacrest Productions, to ask her for leads on transgender talent for   related stories. Given that trans people are twice as likely to be unemployed as the general population (four times as likely if they are not white) these industry jobs are a big deal. Drucker and Ernst also persuaded Amazon to sponsor the Trans Pride festival in Los Angeles. “I’ve just never seen any production like the familial, politicized,   changing,   changing empathy machine that is ‘Transparent,’’u2009” Ernst told me. The show, he conceded, doesn’t exactly represent a new norm in the industry, but he and Drucker hope that the many trans people involved in its production are gaining the tools necessary to make their own shows. “It’s certainly the beginning of something new,” Drucker says. For the moment, working on “Transparent” has turned Drucker and Ernst into trans spokespeople in Hollywood. Drucker was among the trans women hired to help Caitlyn Jenner navigate her new trans life on the   season E! Network series “I Am Cait. ” Focus Features asked Ernst to be a consultant on “The Danish Girl,” a 2015 biopic about Lili Elbe, one of the first people to undergo   reassignment surgery. Ernst was wary, as the film was already underway with a   gender writer, director and star. Yet he found the studio receptive to his many recommendations, including his request that Focus “give back to the trans community in tangible ways. ” The studio created a $10, 000 scholarship for trans filmmakers and helped fund a web series of documentary shorts about trans pioneers called “We’ve Been Around,” directed by Ernst, which had its premiere online in March. “Being trans right now necessitates this multihyphenate way of being,” Drucker says. When Drucker and Ernst were growing up in the 1990s, mass media presented trans people mainly on talk shows like “Jerry Springer,” which tended to sensationalize with big reveals like “My Boyfriend Is a Girl!” and “Guess What . .. I’m a Man!” “You knew you didn’t want to be that, but at least there was something to point to,” Drucker said. We were eating homemade tabbouleh at her house in Cypress Park, which she shares with her boyfriend of nearly two years, Jerid Bartow, an urban designer. Finding models for how to live, or even a language to describe their feelings, was difficult for Drucker and Ernst. After Drucker discovered that she desired boys and Ernst that he liked girls (at least initially) they didn’t feel right calling themselves gay or lesbian because it didn’t feel as if they were attracted to the same sex. They were both relieved as teenagers to discover the term “queer,” which is elastic enough to elide standard definitions of sexual orientation and gender. Each was raised in a supportive home by compassionate parents  —   a rare privilege, they acknowledge. But public bathrooms were always sites of dread, and school was hard. Drucker’s taste for blue hair, dog collars and makeup made her a target in Syracuse, her hometown. “She hid a lot from us,” her mother, Penny Sori, told me. “It was only when I started working at the high school that I saw she took a lot of crap. ” When Drucker insisted on wearing a gown to the prom, her parents worried that she was putting herself at risk. But when Sori approached her, “Zackary looked at me in this funny way and said, ‘I need your support on this.’ So I said, ‘O. K. let me find my long black gloves and at least accessorize you effectively. ’’u2009” Ernst was similarly ostracized and bullied in Chapel Hill, where his father, Carl Ernst, is an   studies professor at the University of North Carolina. As the only queer kid at his public middle school and later at the local Quaker school, he says, he was treated poorly by both students and teachers. With his parents’ blessing, he dropped out in ninth grade. He studied art and music at home, set up a darkroom in his closet and took classes at local community colleges. Art allowed them to vent their anger and defy convention. At her home, Drucker showed me a box of old photographs. Amid the pictures of her bar mitzvah (“a rare moment of gender conformity”) punk adolescence and androgynous college years was a series of snapshots from when she was 3 or 4, dressed in her mother’s clothes and beaming. “Those photographs provided an opportunity for me to see myself outside of the constraints of my reality,” she said. “  making has always provided this place to invent and reinvent myself. ” Drucker went on to study photography at the School of Visual Arts in New York. Soon after arriving in the city in 2001, she met Flawless Sabrina, a revered drag performer otherwise known as Jack Doroshow, and the first of many “  feminine elders” Drucker collected in search of “proof that it’s possible to have a sustainable life and live outside the rules. ” At Hampshire College, Ernst fell in love with   media filmmaking, which allowed him to combine his many interests. For “The Drive North,” a   8 short that Ernst made and starred in as a    undergraduate, he used his own animation and original score and experimented with slide projections and energetic editing to tell a story about two teenagers driving to college. It earned him several prizes at festivals around the world. After graduation he moved to New York, where he began working as a personal assistant on film and television projects and eventually became a producer and editor on MTV. Transitioning is a complicated and often stressful process. It took a while before it felt like a necessary step for either of them. Drucker always knew she flouted traditional gender categories, but she was able to maintain a level of androgyny until her early 20s. It was only when her body started aging in a masculine way that she realized “that wasn’t the path I wanted to go down. ” After she moved to Los Angeles to attend the California Institute of the Arts in 2005, she began taking estrogen. Although Ernst knew he wasn’t female, transitioning made him nervous, particularly because he knew few people who had done it. “It was still this kind of distant, weird relative of ‘gay and lesbian,’ and people didn’t understand it,” he says. Without public examples of happy, successful, aging trans people, he remembered wondering: Do people grow old? Do the hormones kill you? As a feminist, he asked himself: Do I even want to be a man? He was also troubled by the fact that it is impossible to transition quietly. It feels extremely public, he explains, because essentially everyone else has to transition, too. “At what point would my mom change pronouns to her hairdresser when they chat about me? It really ripples. It feels like jumping off a cliff. ” Ernst began taking hormones six months before driving   country with a   friend to study filmmaking at CalArts. They were just starting to pass as men, which meant they were “dealing with the panopticon of   stop men’s rooms for the first time. ” The experience was   racking, but he learned that men don’t really look at one another in men’s rooms. He also found that people were much kinder to him than when he was a   nonconforming woman. “I got the, you know, ’Sup, chief? ’Sup, champ? It was really striking. ” Drucker met Ernst at a party soon after he arrived in Los Angeles. “It was such a revelation when we got together,” Drucker told me. Within a year they were subletting the rundown house of Ron Athey, a performance artist and mentor (they call him “Pops”). They collaborated on several projects, including “She Gone Rogue,” a dreamy experimental short featuring several “  feminine” legends from Drucker’s “chosen family” (Flawless Sabrina, Holly Woodlawn, Vaginal Davis) which debuted at the Hammer Museum in Los Angeles in 2012. They also took thousands of pictures of themselves and each other. The photographs that make up “Relationship” were never meant for a mass audience Drucker and Ernst didn’t even share them with friends. They feel like small, private gifts for each other. One shows them topless and tenderly touching each other in bed, their faces flushed with the thrill of discovery. Another finds them nuzzling in the dark corner of what looks like a party, their eyes closed. Often Drucker or Ernst seem to be posing for the other, preening before a mirror or gazing directly at the camera. These photos capture them as they figure out how to present their evolving selves. Ernst is often seen gazing in the distance, steely and remote, his face sprouting new facial hair. Drucker drapes herself across the bed, feline,   hither and increasingly curvy. Their disdain for the “prurience” of public curiosity about trans bodies mean there are no full nudes in the book. Both lament that trans people are regularly asked about their genitals. “Cis people are not asked about their genitals, so it’s a bit of a double standard,” Drucker says. But the photos include some comic nods. One shows Ernst with two brown eggs between his legs another has him eating a long link of sausage impaled on a fork. Drucker is seen holding a peeled grapefruit in her lap. As a series, these photos trace a period in Drucker’s and Ernst’s lives when they were both undergoing profound personal changes. Yet they found something still and stable in each other. “That body of work really speaks to how much love and support can still be at the core of something that might seem unstable or uncertain or unfamiliar,” says Stuart Comer, a   curator of the 2014 Whitney Biennial. Comer is largely responsible for making these images public. Impressed by their film “She Gone Rogue” and excited by the energy and identity politics of many trans artists, he visited Drucker and Ernst in their Los Angeles studio in 2013. Over margaritas, they shared some of their personal snapshots. Comer was so moved by them that he asked to include a selection in the Biennial. “The formula is so simple, but the cumulative effect of the series is extremely powerful,” says Comer, who is now the chief curator of media and performance art at the Museum of Modern Art in New York. Unlike Drucker and Ernst’s other collaborations, which tend to be more layered and complex, “Relationship” speaks to audiences because it is so direct. It is about love between two humans who happen to be trans. “It’s an   shattering book,” says Kate Bornstein, a trans activist and queer theorist. “You can’t read this book and not understand that trans is an identity that is desirable and filled with desire. There are going to be people writing to Zackary and Rhys saying, ‘Oh, my God, thank you!’ Because right now, being attracted to a trans person is seen as a perversion. ” Drucker and Ernst understand why people are curious about them. “Trans people are basically asking everyone to   evaluate their notions of gender,” Drucker says. This involves more than changing a few names and pronouns. It means upending our rules about who gets to be a man or a woman, and how we expect everyone to behave. The effects can be disorienting. As someone who has occasionally chafed against the ways women are expected to perform femininity, I found myself marveling at Drucker’s girlishness, including her perfectly painted fingernails (against my own   nailed nubs). What, I asked her, inspires these choices? Were they not burdensome? Drucker patiently explained that she does what makes her feel confident, and she likes the look of manicured nails. It was an answer that could have come from my mother. Recognizing the difference between how gender is felt and how it is enforced can also be liberating. “Modern masculinity is so confining,” Jerid Bartow, Drucker’s   boyfriend, told me one evening. “We’re trained to swallow our emotions, to not seem like a sissy. But those expectations don’t exist in our relationship, which is such a relief. ” Bartow recalled a night I was with him and Drucker while they were getting ready for a party, when he declared, “I’m having a clothing crisis!” next to a bed of discarded outfits. “That’s something men are trained not to say. ” Ernst points out that maleness does indeed come with privileges, like being able to ask for things unapologetically and say things authoritatively without being judged. But, he says, “effeminate men, gay men, smaller men, people who are perceived as younger men,” don’t enjoy quite the same benefits. As a    sparsely bearded trans man who now identifies as gay, he says he has found it harder to secure a strong place in this “incredible pecking order. ” He adds that men who believe they are in   only spaces will say “repulsive things about women. ” He suspects that this misogynistic posturing is largely about earning the respect of other men. “It’s this male obsession with each other that results in a kind of weird, sort of insecure   sniffing. ” Both Drucker and Ernst have made a commitment  —   separately and together  —   to live their lives as openly and proudly as possible. “As an artist, I’ve always believed in having a fully integrated self and not omitting parts of who you are or what your history is,” Drucker says. “And being a woman named Zackary makes me very visible. ” Being out is not always easy. Like most trans men, Ernst passes as a cis male, so telling people he’s trans means “rocking that boat every day. ” He recalls his discomfort during the Q. A. sessions after screenings of his CalArts thesis short, “The Thing,” at Sundance in 2012. The film is about a heterosexual couple on a fraught road trip. The man is trans. Audience members naturally asked him why he made that choice. “I realized I had to come out as trans every time on the stage,” Ernst remembers. “You have to muster all this bravery and courage to transition and tell the whole world, and then you think, ‘O. K. good, that’s over.’ But then you realize you have to continue that every day  —   forever. ”'"}, "time": 1742562126.35684}