{"duration": 0.3917520046234131, "input_args": {"text": "\"D 20 \\nLegend: Leader and polling margin from RealClearPolitics . SoS’s party from WikiPedia . A.G’s party from Ballotpedia . \\n* Previous week’s margin in parenthesis (thus). Flipped states ( thus ). \\nStill very much a horse-race; Clinton flipped Florida (though by a tiny amount); but Trump flipped Nevada and North Carolina. (All this data is averaged over the 10/26 – 11/6 time frame, and I can’t imagine they capture late shifts in any direction.) To the Times interactive once again : \\nRemember the interactive focuses on swing states, listed in the table above. We give Trump every state where he is ahead: Ohio, North Carolina, Nevada (!), Iowa. Trump has 44 paths to victory; Clinton, 19. We reserve Florida and New Hampshire, because Clinton’s margin in both states is razor thin, and give her Virgina, Pennsylvania, Wisconson, and Colorado: \\nSo even if Trump wins Florida, he has to win New Hampshire, too. Hoo boy. And to think all this campaign had to do was gag him and take away the Android phone he was tweeting from. The slightest bit of self-discipline on Trump’s part, and Clinton is suddenly in the race of her life. Shows her extreme weakness as a candidate, and the decadence of the Democrat nomenklatura that forced her nomination through, not to mention the decadence of the political class, which can’t seem to get approximately half the electorat to accept their view that Trump is history’s worst monster, despite extraordinary unity of purpose and a deluge of propaganda. Prediction: This election will resolve nothing, and volatility will increase. \\nNow let’s look at the House and Senate: \\nThis week, the House: \\nLooking good for our friend, gridlock. \\nThis week, the Senate: \\nLast week: \\nIt’s a tossup (though you’ve gotta note 7 of the 8 toss-ups are Republicans. I wonder if the coin will land on its edge? \\ngncenter size-full wp-image-96426″ /> \\nIt’s a coin toss (though you’ve gotta note 7 of the 8 toss-ups are Republicans). I wonder if the coin will land on its edge? \\nCorruption \\nPolicy \\n“Why the age for Social Security benefits doesn’t need to go up to 70” [ MarketWatch ]. Part of a symposium. Wall Street is already gearing up to have another go at a Grand Bargain, which (IMNSHO) Clinton supports (given that she supports the logic of Simpson-Bowles, as shown by Wikileaks). \\n“Marijuana News Roundup: 3 of 5 States on Track to Approve Recreational Use” [ 247 Wall Street ]. Arizona (Proposition 205): 48% in favor; 47% opposed; 4% undecided California (Proposition 64): 58% in favor; 37% opposed; 5% undecided Maine (Question 1): 50% in favor; 41% opposed; 9% undecided Massachusetts (Question 4): 62% in favor; 33% opposed; 4% undecided Nevada (Question 2): 47% in favor; 43% opposed; 11% undecided \\nA pure play in paraphernalia. \\nOur Famously Free Press \\nThe Voters \\n“The Verifier – Polling Place Equipment – 2016” [ Verified Voting ]. Handy tool that shows voting systems state-by-state. \\n“[E]lectronic voting machines aren’t as commonplace as one might assume. Three-quarters of the country will vote on a paper ballot this fall, says Pamela Smith, president of Verified Voting, a group that promotes best practices at the polls. Only five states—Delaware, Georgia, Louisiana, South Carolina, and New Jersey—use “direct recording electronic” (DRE) machines exclusively. But lots of other states use electronic machines in some capacity” [ Wired ]. \\n“Lack of poll workers and low numbers of voting machines are key contributors to long voting lines, and precincts with more minorities experienced longer waits” [ Brennan Center ]. No duh! \\n“MIAMI CUBANS 4 TRUMP AND THE BATTLE FOR THE NATION” [ Cuba Counterpoints (MsExPat)]. \\n“[Philadelphia’s] crippling weeklong transit strike ended early Monday, ensuring that all buses, trolleys and subways will be up and running by Election Day” [ AP ]. \\nDownballot \\n“As the final, frantic hours of the campaign for control of Congress come to a close, Democrats look like slightly-better-than-even favorites to reclaim the Senate, while Republicans appear certain to hold the House after a Donald Trump-induced October scare” [ Politico ]. “If Democrats manage to flip the Senate, senior party aides and strategists involved in battleground races said they’re looking at a majority of 52 seats, best case. That would be a letdown from their earlier hopes of a 54- or 55-seat advantage and put Republicans in the pole position to win back the chamber in 2018.” \\nThe Trail \\nBest pro-Trump piece I’ve seen: “The GOP’s ‘Ungrateful Bastard’ Caucus” [ American Greatness ]. \\nBest pro-Clinton piece remains: “Vote for the Lying Neoliberal Warmonger: It’s Important” [ Common Dreams ]. \\nThe best reasons I can think of to vote for each candidate (as opposed to against the other candidates). In no particular order: Trump: A realist foreign policy Clinton: More of the same Stein: Break the two-party duopoloy Johnson: Sanity on marijuna legalization \\nThese reasons are, of course, entirely incommensurate. \\n“The American Conservative Presidential Symposium” [ The American Conservative ]. Michael Tracey: “Trump might be better than Hillary on foreign policy (my top issue), but he’s far too volatile to conclude that with any certainty, and he may well end up being catastrophically worse. The Clintons’ outrageous stoking of a war fervor over Russia is quite simply depraved and should disqualify them from reentering the White House…. Democrats deserve punishment for nominating a candidate with such severe legal problems, stifling a genuine populist insurgent in the most craven possible fashion (I supported Bernie Sanders but find his recent hectoring pro-Clinton conduct highly off-putting). Their shambolic, ‘rigged’ primary process can’t be countenanced, nor can the 2016 electoral debacle as a whole, so I’ll do my small part in rejecting this horror show by declining to vote.” \\nRealignment \\n“America’s Ruling Elite Has Failed and Deserves to Be Fired” [ Of Two Minds ]. ” The last failed remnants of the state-cartel hierarchies left over from World War II must implode before we can move forward. Healthcare, defense, pharmaceuticals, higher education, the mainstream media and the systems of governance must all decay to the point that no one can be protected from the destructive consequences of their failure, and no paychecks can be issued by these failed systems.” Tellingly, the author omits the FIRE sector. So I would say their definition of elite is odd. \\n“[E]ducation levels are a more significant factor this year. Obama won a majority of those with a high school diploma (or less) in 2012, while Romney won college-educated voters. This year the numbers are reversed. Among white voters with only a high school education, Trump leads by over 25 points. Among whites with a college degree, Clinton leads by about 10 percent. This is the first time since serious polling began in 1952 that this has happened [ RealClearPoltiics ]. And when I ask myself who sent the United States heading toward Third World status, it’s not those without college degrees. In fact, it’s Clinton’s base. \\n“The Last Gasp of the American Dream” [ The Archdruid Report ]. \\n[M]illions of Americans trudge through a bleak round of layoffs, wage cuts, part-time jobs at minimal pay, and system-wide dysfunction. The crisis hasn’t hit yet, but those members of the political class who think that the people who used to be rock-solid American patriots will turn out en masse to keep today’s apparatchiks secure in their comfortable lifestyles have, as the saying goes, another think coming. Nor is it irrelevant that most of the enlisted personnel in the armed forces, who are the US government’s ultimate bulwark against popular unrest, come from the very classes that have lost faith most drastically in the American system. The one significant difference between the Soviet case and the American one at this stage of the game is that Soviet citizens had no choice but to accept the leaders the Communist Party of the USSR foisted off on them, from Brezhnev to Andropov to Chernenko to Gorbachev, until the system collapsed of its own weight… \\nIf George W. Bush was our Leonid Brezhnev, as I’d suggest, and Barack Obama is our Yuri Andropov, Hillary Clinton is running for the position of Konstantin Chernenko; her running mate Tim Kaine, in turn, is waiting in the wings as a suitably idealistic and clueless Mikhail Gorbachev, under whom the whole shebang can promptly go to bits. While I don’t seriously expect the trajectory of the United States to parallel that of the Soviet Union anything like as precisely as this satiric metaphor would suggest, the basic pattern of cascading dysfunction ending in political collapse is quite a common thing in history, and a galaxy of parallels suggests that the same thing could very easily happen here within the next decade or so. The serene conviction among the political class and their affluent hangers-on that nothing of the sort could possibly take place is just another factor making it more likely. \\n“Why Trump Is Different—and Must Be Repelled” [Adam Gopnik, The New Yorker ]. \\nFor the past months, and into this final week, as for much of the past year, many New Yorkers have been in a position that recalls parents with a colicky baby: you put the baby down at last, it seems safely asleep, grateful and unbelievably exhausted you return to bed—only to hear the small tell-tale cough or sob that guarantees another crying jag is on the way. The parents in this case, to fill in the metaphorical blanks, are liberal-minded folk; the baby’s cries are any indicators that Donald Trump may not be out of the race for President—as he seemed to be even as recently as last week—and may actually have a real chance at being elected. Disbelief crowds exhaustion: this can’t be happening. If the colicky baby is a metaphor too sweet for so infantile a figure as the orange menace, then let us think instead, perhaps, of the killer in a teen horror movie of the vintage kind: every time Freddy seemed dispatched and buried, there he was leaping up again, as the teens caught their breath and returned, too soon, to their teendom. \\nOf course, Gopnik — a bad-faith liberal who should really stick to writing gauzy atmospheric pieces about Paris — is both passive-aggressive and infuriatingly smug. To “fill in the metaphorical blanks,” both the “colicky baby” and the teen horror movie villain are infantilized and displaced versions of The Other: The Trump voter that Eurostar-rider Gopnik hates and fears, because he’s afraid their going to kill him and take his stuff. \\nDemocrat Email Hairball \\n“Dow surges 300 points as FBI clears Clinton on eve of election” [ USA Today ]. Hmm. Insider’s paradise.. . \\nStats Watch \\nGallup US Consumer Spending Measure, October 2016: ” In October, Americans’ daily self-reports of spending averaged $93, similar to September’s $91 average. However, it is among the highest for the month of October in the survey’s nine-year trend” [ Econoday ]. “The latest spending average is similar to the $91 recorded in October 2008, a measure taken at the beginning of a steep slide in Americans’ spending amid the financial crisis of 2008.” Eight years of crap and back to square one, except for the lost wealth, of course. Best economy ever! \\nLabor Market Conditions Index, October 2016: “Average hourly earnings are one of 19 indicators tracked in the labor market conditions index but the component no doubt made an outsized contribution to the October composite which rose” [ Econoday ]. (This is the Fed’s experimental index.) “Elements of last week’s employment report, especially wages, are consistent with a pivot higher for the labor market and today’s gain in this index could be offering its own signpost.” Dear Lord, a “pivot. I thought “pivot” was a Beltway word, but it seems to have migrated. Ugh. \\nEmployment Situation (11/4): “[T]he deceleration of employment growth continues in what’s now been a very steady decline going on 2 years. And with employment growth decelerating at this rate it’s likely the unemployment rate will remain elevated indefinitely” [ Mosler Economics ]. \\nReal Estate: “When it comes to the state of the industrial real estate market, landlords continue to have the upper hand over tenants, due to ongoing market factors, according to the Third Quarter Industrial Outlook report recently issued by commercial real estate firm JLL” [ Logistics Management ]. “Looking at total U.S. absorption, JLL observed that more than one-third is derived from four key markets that indicate a bulk of the activity still remains in primary industrial cities. These markets include: Chicago at 6.4 percent; Houston at 8.5 percent; Dallas/Fort Worth at 8.6 percent; and Philadelphia/Harrisburg at 10.5 percent…. When asked to rank the top three types of occupiers for industrial estate property at the moment, [Aaron Ahlburn, director of industrial research for JLL] cited e-commerce, traditional retail, and 3PL [third-party logistics] and logistics/parcel delivery players.” So, a bet on continued globalization? \\nShipping: “Truck, rail pricing power may shift in early 2017” [ Journal of Commerce ]. “Shippers moving freight throughout the US are enjoying the kind of pricing power they usually only hold during recessions, thanks to a thick layer of excess truck capacity and overstocked inventories, combined with lower fuel costs and fuel surcharges. The strong dollar and skittish consumer demand, at least for items bigger than packages, also play a role.” Weirdly, the happy talk headline isn’t supported by any data in the article. \\nShipping: “Calls grow for Pakistan to adopt shipbreaking code in wake of last week’s deadly inferno” [ Splash247 ]. “The speakers at the [National Trade Union Federation] protest called for a shipbreaking code to be instituted in Pakistan, noting how workplace accidents at Indian breaking yards had dropped since New Delhi put in its own ship recycling regulations.” \\nShipping: “The world’s seas were a safer place for those navigating them from June to September 2016, maritime security intelligence firm Dryad Maritime reported.Security incidents, including piracy, boardings and robberies, fell compared with the first half of 2016” [ Lloyd’s List ]. \\nShipping: “Cargo thieves have traditionally targeted compact high-value items such as cash and electronics, but lately, improved warehouse security has pushed the crooks to diversify their portfolios and start stealing a range of items, including food, alcohol, and clothing” [ DC Velocity ]. “Rather than lurking around DCs [distribution centers], cargo thieves are increasingly focused on mobile targets like trucks and trailers. Examples of recent thefts include hundreds of thousands of dollars worth of salmon in Norway, cases of whiskey in London, and truckloads of nuts around the globe…. In another escapade, thieves snatched six pallets of maple syrup destined for Japan from a Montreal company’s truck yard, making off with $150,000 in sweet merchandise…. In past years, these items might have been difficult to resell, but the Internet makes it easy to locate a buyer for almost anything.” \\nShipping: ” transportation hiring suggests companies increasingly are putting workers in place to meet another big seasonal push toward web-based sales. They’ll need sales demand to show up since hiring in the retail and manufacturing sectors both slipped back last month. Jobs at goods-producing companies overall were flat in October, a sign that any expansion in demand in the next couple of months will have to come from shipments heading to consumers” [ Wall Street Journal ]. \\nHoney for the Bears: “New registrations of commercial vehicles in gross vehicle weight (GVW) classes 4 to 8 are down 4.2 percent through August of this year, according to the Englewood, Colo., consulting firm IHS Markit” [ DC Velocity ]. “The statistics could foreshadow rough results for corporate earnings, since large trucks are almost exclusively used for business purposes… [Then again] part of the explanation for these statistics may be that owners are holding on to their vehicles longer.” \\nThe Bezzle: ” DOJ, SEC now investigating Wells Fargo sales practices” [ FCPA Blog ]. \\nThe Bezzle: “Airbnb tide appears to be on the ebb” [ Hotel News Notes ]. As regulators catch up, regulatory arbitrage decreases. “That is, if Airbnb does not change direction. It has the capability of doing that—its market capitalization is supposedly now some $30 billion, larger than the combined Marriott-Starwood empire.: \\nGentlemen Prefer Bonds: “Barack Obama will go down in history as having sold more Treasuries and at lower interest rates than any U.S. president” [ Bloomberg ]. “He’s also leaving a debt burden that threatens to hamstring his successor.” I know. Let’s cut “entitlement spending”! \\nThe Fed: “Overall, there is still a very strong probability that the Fed will move to tighten at the December FOMC meeting unless forthcoming data is extremely weak and there is an unexpected victory for Republican candidate Trump, which triggers a sharp deterioration in risk appetite” [ Economic Calendar ]. This is based on the Labor Market Conditions Index. \\nPolitical Risk: “This will be a light week for economic data” [ Calculated Risk ]. “The key event will be the US election on Tuesday.” That’s so understated you’d think McBride was a Brit! \\nPolitical Risk: “With the U.S. election just one day away, Bloomberg compiled a cross-asset guide to how Wall Street strategists predict the markets will react in the event that Donald Trump or Hillary Clinton wins the presidency. We’ve also included a separate scenario on how they might move if the Democrats recaptured the Senate and the House of Representatives along with the presidency; a Trump victory likely entails that Republicans would keep control of both houses of Congress” [ Bloomberg ]. \\nRapture Index: Closes down 1 on drug abuse [ Rapture Index ]. Current: 188. Record High: 189 (October 10, 2016). From the Drug Abuse section: “There has been greater restriction on opioid drugs.” \\nToday’s Fear & Greed Index: 20 Fear (previous close: 14, Extreme Fear) [ CNN ]. One week ago: 30 (Fear). (0 is Extreme Fear; 100 is Extreme Greed). Last updated Nov 7 at 10:42am. Never made it to single digits. I assume a rebound is coming, either way, after Tuesday. \\nPolice State \\n“Dozens, if not hundreds, of criminal convictions in Ohio could be in jeopardy because [G. Michele Yezzo] longtime forensic scientist at the state crime lab now stands accused of slanting evidence to help cops and prosecutors build their cases” [ Columbus Dispatch ]. “In the records, colleagues and supervisors described these concerns about Yezzo: She threatened to use a gun to shoot her co-workers and herself. She threw a 6-inch metal plate at one co-worker. She exposed her breasts to BCI agents at a bar, flipped off her boss and acted in a hostile manner to almost every lab employee, according to records. She was accused of calling an African-American scientist a racial slur, something Yezzo denies. She frequently broke into crying spells for no apparent reason Forensic scientists quit because of her erratic behavior. At one point her union, the Fraternal Order of Police, refused to back her.” Wowsers. The FOP. \\nOur Famously Free Press \\n“Vox Scams Readers Into Thinking Prescient World Series Tweet Was A Scam [Update]” [ DeadSpin ]. \\nGaia \\nGuillotine Watch \\n“Too Smug to Jail” [Matt Taibbi, Rolling Stone ]. “As we reach the close of an election season marked by anger toward the unaccountable rich, The Economist has chimed in with a defense of the beleaguered white-collar criminal.” \\n[T]his is the crucial passage: \\n“Most corporate crime is the result of collective action rather than individual wrongdoing—long chains of command that send (often half-understood) instructions, or corporate cultures that encourage individuals to take risky actions. The authorities have rightly adjusted to this reality by increasingly prosecuting companies rather than going after individual miscreants.” \\nYikes! This extraordinary argument is cousin to the Lieutenant Calley defense , i.e., that soldiers bear no responsibility for crimes they were ordered to execute. The Economist here would have you believe that there’s no such thing as an individual crime in a corporate context. \\nClass Warfare \\nOn neoliberalism [Matt Stoller, Facebook , via Atrios ]. \\nNeoliberalism is a kind of statecraft. It means organizing state policies by making them appear as if they are the consequences of depoliticized financial markets. It involves moving power from public institutions to private institutions, and allowing governance to happen through concentrated financial power. Actual open markets for goods and services tend to disappear in neoliberal societies. Financial markets flourish, real markets morph into mass distribution middlemen like Walmart or Amazon. \\nNeoliberalism is not faith in free markets. Neoliberalism is not free market capitalism. Neoliberalism is a specific form of statecraft that uses financial markets as a veil to disguise governing policies. \\nWhat oft was thought but ne’er so well expressed \\nStoller is paraphrasing his review of Greta Krippner’s Capitalizing on Crisis , which sounds well worth a read. \\n“Uncovering Credit Disparities among Low- and Moderate-Income Areas” [ Federal Reserve Bank of St Louis ]. “Eggleston found that LMI [lower abd middle-income] neighborhoods with relatively better credit tend to be in metros with a larger percentage of white residents, and they are typically found in the East, West and parts of the upper Midwest. They also tend to be in metros that have lower poverty rates.” \\nNews of the Wired \\n“Shyness: small acts of heroism” [ Times Literary Supplement ]. ” The most surprising chapter is the one that discusses shyness in animals, where a “shy–bold continuum has been found in over a hundred species”. Moran shares unlikely-sounding research about “friendlier lemon sharks”, “lizard cliques” and a line of nervous pointers bred by scientists at the University of Arkansas, who found that the dogs could never be socialized: shyness was in their genes…. [The author] suggests that ‘natural selection prefers a range of personalities in the same species.'” Hmm. \\n“In their study of more than 12 million Facebook users, the researchers found that a lower mortality risk was associated with the number of friend requests accepted — as in, those who accepted more friend requests tended to live longer than those who accepted fewer requests. Friend requests extended, on the other hand, had no particular relationship at all to mortality. As the news release so plainly phrased it, ‘This finding … suggests that public health interventions urging people to go out and try to make more friends may have no effect on health” [ New York Magazine ]. \\n“‘Time crystal’ created in lab” [ Science News ]. “Scientists have created the first time crystal, using a chain of ions. Just as a standard crystal repeats in a regular spatial pattern, a time crystal repeats in time, returning to a similar configuration at regular intervals.” \\n” In Accessorize to a Crime: Real and Stealthy Attacks on State-of-the-Art Face Recognition, researchers from Carnegie-Mellon and UNC showed how they could fool industrial-strength facial recognition systems (including Alibaba’s ‘smile to pay’ [!!!] transaction system) by printing wide, flat glasses frames with elements of other peoples’ faces with ‘up to 100% success.’ The glasses cost $0.22/pair” [ Boing Boing ] ( original ). \\n* * * \\nReaders, feel free to contact me with (a) links, and even better (b) sources I should curate regularly, and (c) to find out how to send me images of plants. Vegetables are fine! Fungi are deemed to be honorary plants! See the previous Water Cooler (with plant) here . And here’s today’s plant (Rainbow Girl): \\nRainbow Girl writes: “Lantern Hill Pond, autumn afternoon. What survived in spite of the (now decommissioned) silica mine that operated on its southern shore (to the right).” Still, there’s always something hopeful about seeing a sunny clearing ahead, from inside the shady woods. \\nReaders, Water Cooler is a standalone entity, not supported by the very successful Naked Capitalism fundraiser just past. Now, I understand you may feel tapped out, but when and if you are able, please use the dropdown to choose your contribution, and then click the hat! Your tip will be welcome today, and indeed any day. Water Cooler will not exist without your continued help. Donate\""}, "time": 1742562838.9451284}