{"duration": 0.04748272895812988, "input_args": {"text": "'Monday on Fox News Channel’s “Special Report,” Washington Post columnist Charles Krauthammer reacted to the latest controversy involving the Trump White House, which top Trump aide Jared Kushner is alleged to have had improper back channel communications with the Russian government.  Krauthammer dismissed the controversy and noted the timing of the allegations of the effort to open communications, which are said to have happened during the transition and not the campaign. “I don’t trust this story,” Krauthammer said. “The Russians are leaking it clearly on a channel they know we’re going to pick up. The Russians are masters of disinformation. They already have Washington with its knickers in a twist with a Russian conspiracy. This is an added twist. Somebody’s going to get a hernia here. I think I’ll stop the metaphor with that point. But we have no idea if it’s true. Let’s say it is true. Isn’t the problem here, the accusation here that there was some collusion during the campaign with the Russians? Well, everyone agrees if the story is true, it occurred after the campaign during the transition. So, unless there’s some sort of nefarious connection here, there’s no connection to what was alleged to have happened during the campaign. ” “And lastly, we’ve had backchannel connections with adversaries for generations,” he added. “Henry Kissinger had them with the Russians and the Chinese. Hillary had a backchannel to establish the opening with the Iranians in what ended up as the opening in what ended up as the Iranian nuclear deal   …     This happens all the time. I don’t quite understand where is the crime other than it is another piece that has Russia in the headline, Trump people in the headline and thus, it is supposed to be scandalous. Show me. ” Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742563695.891285}