{"duration": 0.10721921920776367, "input_args": {"text": "'According to researchers, most of the planets orbiting stars like Proxima Centauri are nearly the same size as planet Earth and have plenty of liquid water on their surface. In other words: life, as we know, may have developed there.\\nA series of computer simulations carried out by astrophysicists at the University of Bern demonstrate that planets orbiting the habitable zone of low-mass stars like Proxima Centauri, are likely to be more or less the size of Earth and contain large amounts of liquid water on their surface.\\nThis, of course, leads to the possibility that if these planets are in fact similar to Earth, then life analogous to that of Earth is a possibility we must consider.\\nIN August of 2016 history was made as astronomers announced the discovery of an exoplanet eerily similar to Earth, orbiting its star in the habitable zone. Located in the Proxima Centauri system, the development encouraged experts to think about the endless possibilities of the alien planet called Proxima B. Life, microbial, advanced life, water, liquid water, atmosphere, Earth 2.0, all of this crossed the mind of hundreds of researchers around the planet.\\nBut Proxima B wasn’t alone. In fact, just before experts announced the discovery of the alien world in the Proxima Centauri System, astronomers found three potentially habitable planets orbiting a star of an even lower mass: Trappist-1.\\nThis helped convince experts that red dwarfs and similar stars could host a large population of Earth-like planets.\\nAstronomers Yann Alibert and Willy Benz, from Bern University (Switzerland), based their calculations on hundreds of stars of lower or similar mass to Proxima Centauri and the formation of planets around them.\\nProxima Centauri is smaller and 1,000 times weaker than our sun, which means Proxima b is at exactly the right distance for conditions to be potentially habitable\\n“Our models succeed in reproducing planets that are similar in terms of mass and period to the ones observed recently,” says Yann Alibert explaining the result of the study that has been accepted for publication as a Letter in the journal Astronomy and Astrophysics . “Interestingly, we find that planets in close-in orbits around these type of stars are of small sizes. Typically, they range between 0.5 and 1.5 Earth radii with a peak at about 1.0 Earth radius. Future discoveries will tell if we are correct!” the researcher adds.\\nAccording to astronomy now , astrophysicists determined that around 90 percent of the planets are harboring more than 10 percent of water. For comparison: The Earth has a water fraction of only about 0.02 percent. So most of these alien planets are literally water worlds in comparison.\\n“While liquid water is generally thought to be an essential ingredient, too much of a good thing may be bad,” says Willy Benz. In previous studies the scientists in Bern showed that too much water may prevent the regulation of the surface temperature and destabilizes the climate. “But this is the case for the Earth, here we deal with considerably more exotic planets which might be subjected to a much harsher radiation environment, and/or be synchronous,” he adds.\\nJournal reference: Formation and composition of planets around very low-mass stars \\nSource: Ancient Code \\n'"}, "time": 1742563981.5477104}