{"duration": 0.027899742126464844, "input_args": {"text": "'Comments \\nThe Obama administration has ordered the Pentagon to immediately cease demanding the repayment of enlistment bonuse s from some 10,000 National Guardsmen who served in Iraq and Afghanistan. The Defense Finance and Accounting Service argued that the soldiers were not qualified to receive the money or that accounting errors had resulted in improper payments, despite many of them having served multiple tours. \\nSoldiers from California have been badgering their Congressional representatives about this issue for two years , but Congress has done nothing to alleviate the Pentagon’s demands that soldiers repay money they were given years ago and have certainly earned by putting their lives and limbs on the line serving American interests abroad. Some $70 million was spent by overzealous recruiters looking to fill their quotas that the Pentagon is now looking to get back. \\n“While some soldiers knew or should have known they were ineligible for benefits they were claiming, many others did not. About 2,000 have been asked, in keeping with the law, to repay erroneous payments. We’re not going to nickel-and-dime them when they get back, and we’re not going to hold service members responsible unfairly for unethical conduct or fraud perpetrated by someone else” said Secretary of Defense Ash Carter. The Obama Administration is now looking to “fast-track” the investigations, which have been dragging on for years. \\nHowever, the Obama administration is still not bowing to bipartisan pressure from Congress to fully forgive the money. \\nIn a statement, Paul Rieckhoff, founder and CEO of Iraq and Afghanistan Veterans of America, applauded the move but says more still needs to be done. \\n“This is a good step from the Pentagon. But it is long overdue and far from enough. Thousands of lives have been turned upside down and veterans who have served honorably are now in financial ruin through no fault of their own. While it’s good for them to know recouping has been halted, that does not make them financially whole or address their urgent needs. Many will be stuck waiting for clarity and the results of the investigation until next year. The Pentagon needs to do more than just halt the recouping, it needs to pay them back–with interest.” \\nThe war against Daesh (ISIS/ISIL) is costing the American taxpayer about $11 million a day . The United States military budget is around $600 billion a year , and the Pentagon has “lost track” of some $8 trillion over the past few decades . We can definitely afford to forgive a measly $70 million in order to ensure the financial security of the brave men and women defend our country and our national interests overseas. To hear the Pentagon cry poverty and try to squeeze money out of our National Guardsmen and women after wasting billions of dollars on projects like the defective F-35 joint-strike fighter jet is appalling.'"}, "time": 1742628465.766987}