{"duration": 0.04362154006958008, "input_args": {"text": "'Just before 9 a. m. on Tuesday, while the cafe at Zabar’s in Manhattan was still busy with the breakfast rush, an unmistakable sound interrupted the chatter: A gun was fired. The authorities said the shooting was an accident. A man who had just bought a bagel and a cup of coffee was adjusting his waistband, causing the gun he had tucked in his pants to fire, shooting himself in the leg. About 30 people were inside the cafe, which is part of the upscale market on the Upper West Side, when the gun went off, workers in the store said. The man, identified by the police as Louis Lester Anderson, 48, hurried away from the store, on the corner of Broadway and 80th Street, and took himself to Mount Sinai St. Luke’s, where he was treated and found by the police. He has been taken into police custody, officials said. The matter was being investigated. Officials said Mr. Anderson told the police that he had found the gun in Midtown and had dropped it in a grassy area near Riverside Drive, where the police found it. They said Mr. Anderson, who is homeless, had been arrested nine previous times, mostly on   charges. For about three hours after the shooting, the cafe was cordoned off by police tape, keeping out regulars. But before too long, they returned and were back shopping. “It’s business as usual,” the store’s general manager, Scott Goldshine, said. “It was very quick,” Mr. Goldshine added. “Nobody got hurt. Our staff is fine, and we’re back open for business. ” Jim Wintner was among the first customers to buy a sandwich after the cafe reopened. “People were flying in here before I could even get in the door,” he said. “We’re New Yorkers  —   we have to have our Zabar’s. ” But with the mass shooting in Orlando, Fla. fresh on the minds of many in the neighborhood, they said they could not help but fear at first blush that something worse was happening. “My mind is still on Orlando because my wife lives there,” Mr. Wintner said. Beryl Swados usually comes in for coffee every morning. “I’m literally there every day, and I would have been there had I not been with clients,” said Ms. Swados, who works at Canine Styles, the grooming service and pet product store. “But what’s horrifying is this isn’t just being in a bad neighborhood this is the Upper West Side, for God’s sake. ” Marlene Silva said she heard about the shooting while at physical therapy at a nearby gym, but still came by the store after it had reopened. “No one is safe anymore,” she said. “Nothing is sacred anymore. ” But she was sanguine in her approach to handling her fears. “What can you do?” Ms. Silva said. “Be a hermit in your own house?”'"}, "time": 1742562266.7401881}