{"duration": 0.03990340232849121, "input_args": {"text": "'It is DISTURBING to think that they have known about this FOR YEARS! Huma Abedin has worked as Hillary Clinton’s top assistant for years. You are likely familiar with Huma, as she is a regular on the campaign trail with Hillary, and has also been in the news for years as the wife of Anthony Weiner, the embattled former Congressman who is perpetually accused of sexting improprieties. Reportedly, the FBI is reopening its investigation of Hillary’s private email practices after finding evidence of Huma’s involvement on one of Anthony Weiner’s electronic devices. It is a small world, isn’t it? Another Clinton employee, a name that you may not be familiar with, is popping up in the news lately for reasons that are startling, to say the least. Justin Cooper is an Information Technology worker who is reported to have set up Hillary’s private email server. Recently, he even testified before a House Committee, saying that he extracted information from Clinton-related smart devices before “smashing them to bits.” It is said that Cooper’s testimony is the “most informative we have heard yet.” Judge Andrew Napolitano has expressed concern over Cooper’s access to this information, among other things, as Cooper did not hold a Security Clearance. “He was an employee of the Clinton family and of the Clinton Foundation, and he had complete and total access to the Clinton emails, and he had no security clearance,” Judge Napolitano explained on “Varney & Co.” today. Unfortunately, for Hillary and Huma, new, leaked information has come to light, and it has Justin Cooper’s name all over it: Justin Cooper was the Clinton aide who set up the email server.Huma: \"My clinton [black]berry not working\"Cooper: \"We were attacked again\" pic.twitter.com/KjQcbocQzz \\n— Lachlan Markay (@lachlan) October 28, 2016 \\nYou read that correctly – \\nHuma: “My clinton [black]berry not working” \\nCooper: “We were attacked again” \\nSo Huma and the Clinton Staff knew all along that they were being attacked, also known as “hacked!” \\nIt is shocking to think that high level State Department employees knew, for years, about such vulnerabilities. \\nIronically, if it were not for hacking organizations like WikiLeaks, American voters still would not have this troubling knowledge.'"}, "time": 1742561878.176716}