{"duration": 0.12442326545715332, "input_args": {"text": "'La estación de Calatayud del AVE será un colchón al que saltar desde el tren en marcha LA ESTACIÓN DISPONDRÁ TAMBIÉN DE UNA MÁQUINA DE VENDING QUE NO FUNCIONA tren \\nAsumiendo al fin que no es rentable que el AVE Madrid-Barcelona se detenga en Calatayud, Renfe ha informado esta semana que la estación de la localidad consistirá a partir de la semana que viene en un colchón situado en el suelo y junto a las vías para que los pasajeros que quieran apearse puedan tirarse desde el tren en marcha sin lastimarse. “Es una estación modelo Pikolín que sustituirá a la actual, que será derribada”, ha explicado un portavoz de la operadora ferroviaria esta mañana. \\nLa estación del tren de alta velocidad situada en Calatayud medirá 135×90 centímetros y dispondrá del primer andén viscoelástico de Europa, según defiende Renfe. El procedimiento para que los pasajeros del tren, que viaja a una media de 250 kilómetros por hora, puedan apearse en Calatayud consistirá en situarse en una de las puertas y recibir un pequeño empujón de un miembro de la tripulación. \\nLa asistencia de la tripulación será esencial para calcular la trayectoria correcta hacia el colchón, explica la compañía española. \\nRenfe no ha querido detallar qué procedimiento deberán seguir los viajeros que deseen subir al tren. La compañía está haciendo pruebas para ver si una persona puede correr en paralelo al convoy y saltar al interior mientras varios ejecutivos le gritan “vamos, vamos, corre” desde la ventanilla. \\n“En el caso de obligar a los ejecutivos a subir a los trenes en marcha, habilitaríamos un vagón de mercancías con un gran portón de madera y tres ejecutivos vagabundos en el interior que tocarían la armónica y explicarían leyendas del Ibex”, ha explicado el portavoz.'"}, "time": 1742628312.61721}