{"duration": 0.22154974937438965, "input_args": {"text": "'“My career was never based on pretty,” one of the world’s most beautiful women was saying recently, straining a listener’s credulity. The woman was Gisele Bündchen. And if what should have seemed disingenuous or else a bad case of false modesty somehow rang true, that is because the listener had already heard the tale of the nose. People in the business often repeat, as an example of the ways in which fashion is deeply disordered, the story of how two decades ago when Ms. Bündchen was starting out in a field she has dominated ever since  —   becoming not just the most highly paid model in the world but the richest, according to Forbes  —   some misguided types routinely advised her to correct what they saw as a glaring feature flaw. “It’s true,” Angela Missoni, creative director of her family company, said last week from Milan. “Gisele did our first campaign with Mario Testino and we used a beautiful shot, but with Gisele’s hair all across her face. ” For that 1998 Missoni campaign, the Brazilian with the   complexion, the wide toothy smile, the symmetrical although slightly   face appears almost entirely concealed behind a veil of hair. Imagine, if you can, Ms. Bündchen with a  . “Mario wasn’t 100 percent sure about her,” Ms. Missoni said. “He was worried about her nose. ” What can you do about moments like that, Ms. Bündchen asked. You keep the nose nature gave you and move on. “Even before I got into the business, I was used to being bullied because I was always tall and skinny and stuck out,” she said. “I got really red all the time from playing volleyball, red like a pepper. So I thought bullying was just the way life is. ” Shrugging, she scoops up Fluffy, a rescue mutt she found online, and snuggles her into the folds of a designer sweatshirt so deliberately tattered it looks as if the puppy had a role in its fabrication. Ms. Bündchen and I are seated on a deep white sofa in her $14 million,   Madison Square aerie. Beyond a window wall at her back lies a landscape that might have been drawn by Saul Steinberg, with views encompassing much of Manhattan and, across the Hudson, New Jersey and possibly the border between Missouri and Kansas. It says something about Ms. Bündchen’s command of any space she inhabits that after roughly two minutes in her company the panorama has all but disappeared. Along with her husband, Tom Brady, the New England Patriots quarterback, and their three children  —   a boy and a girl from their marriage and a son from Mr. Brady’s previous relationship  —   Ms. Bündchen divides her time among this place, a house in Boston and a vacation compound in coastal Costa Rica. Neither Mr. Brady nor the children are anywhere to be seen today and, thus, all is quiet in a room where a scented candle emits the fragrance of sandalwood. Ms. Bündchen, whose diet once skewed improbably toward Coke and hamburgers, now observes the more stringent dietary practices favored by her athlete husband. Roughly 80 percent of what she consumes is vegetable in origin her family’s meals are prepared by a private chef. She is a practiced yogini and, Ms. Bündchen said, a deeply spiritual person, so much so that after reading the legend printed on her chamomile tea bag, she urges a reporter to record what it says. Put that in the article, she said. And so let the record show that love, compassion and kindness are the anchors of life. Then the    woman who has appeared 11 times on the cover of American Vogue who has a personal net worth estimated in excess of $300 million who enjoys a daily income flow Forbes calculated at $128, 000 who, during a year she refers to as her sabbatical, maintains contracts with Pantene, Procter  Gamble, Under Armour, Chanel No. 5, Carolina Herrera, Emilio Pucci and Balenciaga and whose name appears on products from jelly sandals to underwear explained how it was for her when she first appeared on the scene as a gangly    tomboy from the south of Brazil. “In the beginning, you know, everyone told me, ‘Your eyes are too small, the nose is too big, you can never be on a magazine cover,’” Ms. Bündchen said. “But, you know what? The big nose is coming with a big personality. ” No one anymore would dispute that the enduring success Ms. Bündchen has had in a cruelly objectifying business (one in which the average shelf life of the talent is optimistically five years) owes much to her beauty. And yet there are “many, many beautiful girls,” in the world, whose names no one remembers, as Ms. Missoni rightly observed. “With Gisele, there is something different, her energy,” the designer added. “Of course, she is super beautiful, but she also has this charisma, this presence, this very sexy normality. ” Sexy normality is a curious way of describing someone whose Amazonian strut on a thousand runways, a walk she recently taught on television to Jimmy Fallon, had the effect of making other models look like automatons. And it seems a far cry from the images on display in “Gisele Bündchen” (Taschen, $69. 99) a new   monograph that assembles, in one   volume, images of the model from throughout her career. Here, for instance, is Ms. Bündchen as a bronzed and   sexpot in a shot by Mert Alas and Marcus Piggott, clad in vertiginous platform sandals and a studded Versace bustier as she descends a ladder into an empty swimming pool. Here she is a sexy goofball    photographed against cheap motel curtains by Terry Richardson, unaccountably lending innocence to the scene though clad in just underpants and bra. Here she is a tawny adventuress with a butterscotch mane leading a brace of donkeys along a Sicilian dirt path in Steven Meisel’s images for some long forgotten Dolce  Gabbana campaign. Here she is Kabuki princess hugging tight the Polish model Malgosia Bela in a Richard Avedon   studio portrait,   orphans dressed in Dior haute couture. Here she is again and again, captured by the lenses of Helmut Newton, Juergen Teller, Peter Lindbergh, Bruce Weber, David LaChapelle, Inez van Lamsweerde and Vinoodh Matadin, Michel Comte, Mario Sorrenti, Nino Muñoz and David Sims. And what is striking about these images created by a lustrous roster of prominent photographers and artists is that the most compelling element of any photograph she appears in is not the clothes, the setting or the backdrop but the preternatural vitality of Ms. Bündchen herself. “I always knew that, even if I was not the most beautiful girl, I’d be the most energetic and ” the model said. “If you want to know the truth, that’s the reason for my success. ” When industry insiders talk about Ms. Bündchen, the praise most commonly proffered has less to do with her beauty than with her indomitable good spirits, a canny though untutored intelligence and an almost animal energy. “Gisele always struck me as being   and likable, but with an understanding of her role that went beyond merely turning up and delivering the goods,” said Joe McKenna, a stylist behind some of the more influential fashion campaigns of recent decades. “She always understood that ‘Gisele Bündchen’ could be a business, too. And, though I loathe the word branding, that’s exactly what she’s always been aware of. ” When the woman Gisele Bündchen speaks of the global brand Gisele Bündchen, she tends to attribute its success to a kind of Horatio Alger ethos, a drive that has been with her since she was young. “I’m a twin, I’m a Cancer, I’m always taking care of other people,” she said, offering to pour bottled water or make tea or fetch anything else a guest might desire. “I’ve always been the fixer in the family, the responsible one,” she said. “I’ve always been a hard worker, never late for a job in my life. Really, ask anyone. ” And, while  —   unlike, say, the multimillionaire Russian model Natalia Vodianova, whose    story began with her peddling apples by the road in Nizhny Novgorod  —   Ms. Bündchen comes from a modest, though solidly   background, she is acutely conscious of the psychic and economic distance between the provincial world she was born to and the imposing one she inhabits today. Raised by a real estate agent and a bank cashier in a midsize municipality in Brazil’s southernmost state, Ms. Bündchen is a fraternal twin born to a family of six girls who grew up wearing their sisters’   . “When I was a kid, I never even thought about fashion,” Ms. Bündchen said. “I had one pair of jeans. ” The story of Ms. Bündchen, who was discovered in a mall food court, is one that hews to all the modeling industry clichés. It happened that she was there that day on an outing with classmates from a modeling school her mother had urged her to attend in the hope that her posture would improve. “This guy came up to me and said: ‘Do you want to be a model? Come with me to the agency right now,’” Ms. Bündchen said, adding that she resisted the idea for predictable teenage reasons. “We were supposed to go to Playcenter that day,” she said, referring to a popular Brazilian amusement park. “The guy said, ‘Oh, I promise you when you come to the agency in São Paulo, I’ll take you to the Playcenter there,’” Ms. Bündchen added. “And you know what? He never took me there!” With a $50 grubstake from her father, Ms. Bündchen set off alone on a   bus ride to São Paulo and an improbable lifelong journey. “Modeling was the farthest thing from what I ever thought I would do with my life,” she said. “From the beginning, looks did not define me in any way. I have a different idea of what I am. I wanted to be Jane Goodall. In my mind, I’m still Jane Goodall in bare feet. ” It should surprise no one to learn that a profession the writer Michael Gross once characterized as the “ugly business of beautiful women,” is often less glamorous than tedious and boring, that even the most successful model’s life is frequently grueling and lonely, and that among the job requirements are a high threshold for emotional abuse and an ability to cope with being shuttled about the planet like a parcel to settings where enforced passivity is the norm. “This opportunity was given to me when I left home at 14 and I was not going to come back ” Ms. Bündchen said. “What else can a    do to make money? I was determined to make it work. ” Thus, if she found herself modeling winter clothes on a shoot in Death Valley in   heat, she would remain, she said, “totally, 100 percent committed. ” And if stylists dressed her in “impossible clothes, things I can’t breathe in,” or photographers transported her to “extreme settings,” or if she found those around her “saying the most horrendous things right in front of your face,” she said she was determined to seek “what is positive here, how to make something good out of this. ” Ms. Bündchen is surely conscious that grit and inner beauty are far from the first qualities that come to mind when people see pictures of her parading down a catwalk wearing Victoria’s Secret angel wings, or doing a    in the arms of her husband at the annual spring Met Gala, or in the paparazzi photographs of her with celebrities she dated before marriage, like Leonardo DiCaprio. “To me, the idea of being famous is irritating,” Ms. Bündchen said. “The attention is strange. Everyone has an opinion. ” Those opinions can be noxious, as when the social media mob piled on after a video capturing her emotional reaction when the Patriots fell to the New York Giants in Super Bowl XLVI was posted to a gossipy website. “It can overwhelm you when people attack you or make comments,” she said. “But when people are saying those things, the haters, I try not to let it in. Given what is, I tell myself, what am I to do?” She jumps up from the sofa then and scoops up Fluffy, a dog she adopted as a reminder of Vida, the Yorkshire terrier she carried along on her ceaseless global travels early in her career. And when she rises from the sofa with an athlete’s easy grace, a reporter is reminded of a remark the designer Anna Sui once made about Ms. Bündchen: “Gisele has that effervescence only certain girls have, an energy you look for that is really rare. ” Two decades ago, when Ms. Bündchen was barely 16 and relatively unknown, she found herself cast for a Harper’s Bazaar editorial to be shot on the French island of St. Bart’s. The photographer was a man famous himself for having photographed the biggest celebrities and most compelling faces in the world  —   including Madonna and Diana, Princess of Wales. “Some people on the sitting were saying, ‘Oh, she’s not too pretty, she has a big nose,’” that photographer, Patrick Demarchelier, said last week, about the youthful Ms. Bündchen. “But I said, ‘No, no, I like her.’ She was smart and outgoing, always happy, and clearly already knew what she was doing. ” Throughout the shoot, the naysayers continued to disparage the young Brazilian. Then the contact sheets came in. “Immediately, right away, you could see that the girl was special,” Mr. Demarchelier said. “She got 20 pages right away. ”'"}, "time": 1742563767.980407}