{"duration": 0.052257537841796875, "input_args": {"text": "'Pinterest \\nThere isn’t a question that the Clintons are the most corrupt politicians in United States history. There also isn’t a question that Bill Clinton is a womanizing, philandering piece of filth. Apparently, one of the women Bill had an affair with while Governor of Arkansas, Gennifer Flowers, has released a series of taped conversations with Bubba from that time. \\nAccording to Breitbart : \\nOn October 1991, Clinton announced his bid for the Oval Office, with rumors of extramarital affairs threatening to derail his campaign. \\nFlowers recently provided this reporter with complete original cassette recordings of her taped conversations with Clinton, recordings that take on renewed significance as the issue of Clinton’s alleged treatment of women has reemerged during the 2016 presidential campaign. \\nThe sections of the audio recordings related to the state job are not exclusive to Breitbart News. Those excerpts were played for the news media in 1992, one day after Bill and Hillary Clinton appeared side by side on 60 Minutes , where Bill denied a relationship with Flowers. \\nClinton later admitted to one sexual encounter with Flowers in a 1998 deposition for the Paula Jones lawsuit. \\nYou can hear the recordings here: \\n[soundcloud url=”https://api.soundcloud.com/tracks/289947630″ params=”auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&visual=true” width=”100%” height=”450″ iframe=”true” /] \\nIt’s not just that Clinton had an affair, he was also trying to help his lover get a job with the state. Pay to play on her part or his? Maybe a little of both. Why not take advantage of screwing the married governor of a state and getting something other than an STD from it? Flowers just had to make sure she didn’t tell anyone the governor, her married lover, was helping her to get the job. \\nThis is just one other aspect of the corruption and despicableness that is the Clintons. They care little for actually governing, care absolutely nothing about the people they actually represent or govern, and care nothing about the consequences, because other than fines for their criminal activity or behavior, they have PAID NO consequences for their lifetime of corruption. \\nUnfortunately, it won’t matter what comes out about Bill and Hillary Clinton. The main stream media won’t report it and even if it’s a criminal act, Obama’s Department of Justice won’t prosecute them. \\nThat’s the reality of the Clintons. They aren’t representatives of the people, they are representatives for themselves and the moral bankruptcy that has invaded our country.'"}, "time": 1742562294.7063875}