{"duration": 0.20360183715820312, "input_args": {"text": "'WASHINGTON  —   The Democrats’ stunning defeat in the presidential race and continued struggles in   contests have jolted party leaders into concluding that their emphasis on cultural issues has all but crippled them by diverting voters’ attention from the core Democratic message of economic fairness. But even as Democrats agree about the need to promote their agenda more aggressively for the middle class and voters of modest means, especially in parts of the country where the party has suffered grievous losses, they are divided over how aggressively to position themselves on the economic left, with battle lines already forming over the   issue of foreign trade. While the country has moved steadily to the left on such social issues as   marriage and gender equity, it is increasingly apparent that Democrats cannot win in much of the country without a more coherent and overriding economic message. The debate over what that message should be comes not only against the backdrop of Hillary Clinton’s astonishing loss to Donald J. Trump  —   a race decided by a handful of Rust Belt states that for decades had favored Democratic nominees  —   but also after the third campaign in the past four election cycles in which the party was routed across vast sections of the nation, leaving Democrats out of power in both chambers of Congress and in most governors’ mansions. The direction the party chooses now could have ramifications for years to come: In 2018, Democrats face Senate races in 10 states that favored Mr. Trump. And there will be 38 elections for governor in the next two years that could decide whether Democrats are able to play a role in drawing more favorable congressional maps after the 2020 census. “If we don’t have Democratic governors there to veto these maps after the 2020 redistricting, the next 10 years for us in Congress and state legislatures are going to be brutal,” said Gov. Terry McAuliffe of Virginia, the only Southern state that Mrs. Clinton carried last week. Over President Obama’s two terms, Democrats have embraced a    cultural liberalism that energized his coalition of millennials, minorities and   whites. But the growing nationalization of politics and the Democrats’ drift to the left doomed a number of candidates running in more conservative states during the 2014 midterm elections, when turnout fell. Yet despite Democrats’ near extinction in much of the South and in parts of the Great Plains  —   two regions that had for decades elected Democrats to statewide office  —   the party had little in the way of a debate about Mr. Obama’s approach. Now, without rebuking the   president directly, many Democrats share a growing recognition that Mr. Obama’s way may not be the best course in a country where many voters have experienced little income growth and where   jobs can be scarce. Even Senator Chuck Schumer of New York, the presumptive incoming Democratic leader and someone who is eyed warily by the left, has taken steps to signal that he recognizes the need to embrace a more populist economic orientation. Mr. Schumer announced on Friday that he was supporting Representative Keith Ellison of Minnesota, a leading House progressive, to be the chairman of the Democratic National Committee. And earlier in the week, Mr. Schumer said in a private meeting at the A. F. L. . I. O. that while Democrats had been at the forefront of cultural change in the country on matters of race, gender and sexuality, they had not been talking in similarly transformational language on economics, according to a labor official in the room. “The party started looking at people through interest group coalitions, and we thought, ‘If we talk to them all in different ways, that will be enough to cobble together an election coalition,’” said Representative Ruben Gallego of Arizona. “But I think there is a common interest in our economic policies between the   white worker in Flint, the   and the Latino in Phoenix. ” Randi Weingarten, the president of the American Federation of Teachers, said the growing importance of social issues in the national debate and Democrats’ reliance on wealthy donors on the two coasts who are more focused on cultural liberalism than on economic solidarity had, together, left the party somewhat disconnected from the working class. “Social issues now have become central, rather than class issues,” said Ms. Weingarten, who recommended what she called a “ ” approach. Such talk bears a striking resemblance to the fierce debates Democrats engaged in 30 years ago when they suffered repeated White House losses and many party moderates concluded that they were too captive to   politics. Except now, it is not centrists calling for a greater focus on economic issues, but a broader constellation of Democrats. “The Democratic Party can no longer be led by the liberal elite,” said Senator Bernie Sanders of Vermont, calling for a party “prepared to stand up to Wall Street and the greed of corporate America. ” Senator Elizabeth Warren of Massachusetts, who may run in 2020, sounded a similar message in a speech last week to the A. F. L. . I. O. ignoring Mrs. Clinton entirely, praising Mr. Sanders and calling on her party to address the economic grievances that she conceded “  Trump spoke to” in the campaign. The Democratic shift toward a more unapologetic brand of populist economics gained steam when Mr. Sanders electrified many on the left, and even some more moderate party activists across the Midwest, in his primary race against Mrs. Clinton. Yet while Mr. Sanders’s brand of confrontational populism  —   characterized by his fierce attacks on international trade and Wall Street  —   may be favored by many liberal activists, it does not sit well with party leaders who fear that his call for an economic “revolution” may turn off moderate voters. “Americans want to hear a stronger economic message from the party,” said Gov. Dannel P. Malloy of Connecticut, “but this shouldn’t be about a revolution, but about fairness. ” Other Democrats are more explicit about their concerns with Mr. Sanders’s broadsides, especially on trade, which Mr. Sanders and Mr. Trump used to great effect in the campaign. It is an issue that highlights regional differences among Democrats from states that have been hit hard by manufacturing plants’ being shut down and replaced overseas, and those from states that depend on a robust export market. “I don’t think you can be ” said Gov. John Hickenlooper of Colorado, who is mentioned as a possible 2020 presidential candidate. “In the modern world, we need consumers overseas for our products as well. ” The     Partnership, noted Senator Heidi Heitkamp of North Dakota, was backed by every agricultural commodity group in her state. “We’ve got to have a market for our products,” said Ms. Heitkamp, who has implored her party to have a more robust rural agenda. What is striking, though, is that there is no larger appetite in the party to move fully toward the political centrism that marked Bill Clinton’s presidency. Jason Kander, a Missouri Democrat who lost to Senator Roy Blunt by just three percentage points while Mrs. Clinton lost the state by 19, dismissed what he called “the old construct about Blue Dogs,” referring to the    Democratic group that was once robust in the South and in border states. “I ran on a progressive message: economic fairness, college affordability and equality for the L. G. B. T. community,” Mr. Kander said. “We should not hide from our beliefs or apologize. We should lean in, full force. ” More worrisome to a range of Democrats is that they are struggling in states with significant rural populations, where some of the most competitive Senate races in two years will take place: North Dakota, Missouri, Montana and West Virginia. “We have to be bigger than a coastal party,” said Gov. Steve Bullock of Montana, who eked out   last week and went deer hunting with his son over the weekend. The good news for Democratic officeholders and candidates  —   and something many of them gingerly brought up  —   is that they may fare better the next two years thanks to Mr. Trump than they would have if Mrs. Clinton had been elected. The party of the sitting president often loses seats in the first midterm election, and many Democrats expect a backlash to Mr. Trump if he is unable to fulfill his grandiose promises. “Sometimes it’s easier, certainly, to be able to run against the White House and have that contrast,” Mr. Bullock said. Mr. McAuliffe said the Democratic governors had convened a conference call after the election to begin planning for governors’ races. He said he planned to push for a larger session with congressional Democratic leaders in the coming weeks to impress on them how important those contests would be to the party’s future. “It’s time for everybody to get in the game,” Mr. McAuliffe said. One Democrat who seems ready to do just that is Nina Turner, a former Ohio state senator and acolyte of Mr. Sanders’s who is eyeing a run for her state’s governorship in 2018. In an interview, Ms. Turner made clear that she had an unambiguous, and familiar, focus. “It’s the economy, stupid,” she said.'"}, "time": 1742563417.1929867}