{"duration": 0.04952716827392578, "input_args": {"text": "'A plane carrying Republican vice presidential candidate Mike Pence slid off the runway while landing at New York City’s Laguardia Airport Thursday evening. \\nThere was no immediate word of any injuries. \\nThe aircraft, a Boeing 737, tore up two tracks of concrete on the runway before coming to rest on a patch of grass. The Federal Aviation Administration said in a statement, “A crushable concrete runway safety technology called an Engineered Material Arresting System stopped the plane.” \\n“We seemed to be sliding for the distance of the landing and a burning smell became very obvious — like rubber,” Fox News producer Dan Gallo wrote in an email. Hard to see much from these plane windows. But emergency vehicles are here. pic.twitter.com/XAkNSgDuWD \\n— Dan Gallo (@dangallo) October 27, 2016 \\nAccording to Gallo, Pence said that he saw mud on windows at the front of the plane when he came to check on passengers in the rear of the aircraft. \\n“We can see mud on the front windows,” a calm Pence said in the press cabin about a minute after the plane came to rest. He said he felt fine. \\n“So thankful everyone on our plane is safe,” Pence said in a later tweet . “Grateful for our first responders & the concern & prayers of so many. Back on the trail tomorrow!” So thankful everyone on our plane is safe. Grateful for our first responders & the concern & prayers of so many. Back on the trail tomorrow! \\n— Mike Pence (@mike_pence) October 28, 2016 \\nThe roughly 40 passengers and crew on board, including Pence, were evacuated through the back of the aircraft as a large amount of emergency vehicles responded to the scene. \\nCampaign spokesman Marc Loetter later told reporters that Pence had missed his fundraiser in New York City and was headed to his hotel for the night. Pence later called into his fundraiser being held at Trump Tower from the car in the motorcade as he drove into Manhattan. \\nCampaign officials told Fox News another plane is on the way, and Pence looks forward to being on the campaign trail on Friday as planned. \\nA Trump campaign spokesperson told Fox News in a statement the Republican nominee reached out to his running mate after the incident. \\n“Mr. Trump did reach out to Gov Pence and is very glad everyone on board plane is safe,” Trump campaign spokesperson Stephanie Grisham said. \\nTrump later told a crowd a campaign rally in Geneva, Ohio that “everbody is fine.” \\n“I just spoke to our future Vice President and he’s okay,” Trump told supporters. “Do you know he was in a big accident wth the plane? The plane skidded off the runway and was pretty close to grave, grave danger, but I just spoke to Mike Pence and he’s fine, got out. Everybody’s fine.” \\nDemocratic presidential nominee Hillary Clinton said in a tweet she was “glad to hear” everyone on board was safe. Glad to hear @mike_pence , his staff, Secret Service, and the crew are all safe. -H \\n— Hillary Clinton (@HillaryClinton) October 28, 2016 \\nNew York City’s Office of Emergency Management said the airport was closed for roughly an hour a result of the incident. Due to a plane skidding off the runway, #LaGuardia is currently closed until further notice. Check with your airline for additional info. \\n— NYCEM – Notify NYC (@NotifyNYC) October 28, 2016 Following an earlier incident, #LaGuardia Airport has reopened to limited air traffic. Expect delays. Check with airline for additional info \\n— NYCEM – Notify NYC (@NotifyNYC) October 28, 2016 \\nNew York City was being affected by heavy rain Thursday evening. It was not immediately clear whether that played a role in the landing.'"}, "time": 1742628371.4402962}