{"duration": 0.0333704948425293, "input_args": {"text": "'Home / News / WATCH – Video Leaked From Obama’s 2008 Campaign Is Every Trump Hater’s Worst Nightmare WATCH – Video Leaked From Obama’s 2008 Campaign Is Every Trump Hater’s Worst Nightmare fisher 6 mins ago News , USA , World Comments Off on WATCH – Video Leaked From Obama’s 2008 Campaign Is Every Trump Hater’s Worst Nightmare WATCH – Video Leaked From Obama ’s 2008 Campaign Is Every Trump Hater’s Worst Nightmare \\nThese days it has most certainly become chic for the modern liberal to throw about accusations of racism. Although this type of race-baiting has been going on for a number of years now, it became more noticeable during the 2016 U.S. presidential election. When these liberals accuse Donald Trump of being racist, they had better be careful for one specific reason: \\nA leaked video from 2008 shows that during President Obama ’s first campaign, he was also concerned about border security, and he even suggested a wall! Now, there is just one dominant question anti- Trump individuals need to digest: \\nIs Obama a racist too? Because he was talking about some things you could easily accuse Trump of. Let’s play a quick game. If you didn’t know who said this, would you think it was Donald Trump in 2016 or Barack Obama in 2008? \\nThis man’s core goal was to “preserve the integrity of our borders to reduce illegal immigration.” Does this sound like Trump or Obama ? \\nHow about this one? This man said, “additional fencing could help get our border under control.” Definitely sounds more like a GOP candidate than a Democrat one, that’s for sure. \\nFinally, this man also supported “additional personnel, infrastructure, and technology on our border and at ports of entry.” Liberals would love to claim these quotes came from Donald J. Trump , especially considering he is the villain du jour in their lives at the moment. \\nI hate to steal their thunder, but these quotes did indeed come from a young Barack Obama in 2008. Even he understood the need for a controlled border before the special interests in this country got to him. \\nSo, it is one thing when leaked videos show Hillary Clinton believed border security was important. It was entirely another when they showed that her husband thought it was important, but when liberal idol Barack Obama says it? Say it isn’t so! Liberals just can’t handle that. \\nBut anyway, folks, it is all about platforms. I’m sure you have learned by now that Donald Trump doesn’t get the free pass other politicians in this country enjoy. First of all, he is a conservative, so he is already someone every liberal loves to hate. \\nRepublicans have been so badly demonized in this country simply for desiring to get it under control. Luckily, people saw through the propaganda and decided that Obama ’s brand was simply not working any longer. \\nPeople are fed up with politicians who say one thing and do another. If you are looking for a reason why Donald Trump is the new president and not Hillary Clinton, there you go. '"}, "time": 1742628355.8124983}