{"duration": 0.08879923820495605, "input_args": {"text": "'in: Government , Government Corruption , Sleuth Journal , Special Interests (image: REUTERS/Gary Cameron) Had Comey recommended Hillary be held criminally responsible for mishandling classified State Department documents last July, along with perjury for lying to the FBI and Congress, a firestorm of criticism wouldn’t have followed his Friday announcement. Senate Minority Leader Harry Reid (D. NV) accused him of “tarring Secretary Clinton with thin innuendo,” saying his action “appears to be a clear intent to aid one political party over another” – claiming he “may have broken the law,” citing the 1939 Hatch Act (An Act to Prevent Pernicious Political Activities). It prohibits federal executive branch employees from engaging in certain forms of political activity – exempting the president, vice president and designated high-level administration officials. Proof of intent is required to hold someone culpable under the law. According to the Wall Street Journal , within the FBI, there was “sharp internal disagreement over matters related to the Clintons, and how to handle those matters fairly and carefully in the middle of a national election campaign.” In a prominently featured NYT op-ed , Law Professor Richard Painter said “(w)e cannot allow FBI or Justice Department officials to unnecessarily publicize pending investigations concerning candidates of either party while an election is underway. That is an abuse of power.” Not according to former federal prosecutor Daniel Richman, saying “Comey’s critics cannot show his letter violated the Hatch Act unless they can prove that the FBI director was intending to influence the election rather than inform Congress, which was (his) stated aim.” A Sunday released ABC News/Washington Post poll indicated about a third of likely voters are less likely to support Hillary following Comey’s October surprise. The Washington Post said the Justice Department’s public integrity unit blocked the FBI from investigating the Clinton Foundation, claiming inadequate “evidence to move forward.” The department is run by longtime Bill and Hillary ally, Attorney General Loretta Lynch. Last June, she met privately with the former president at Phoenix’s Sky Harbor airport while Hillary was under FBI investigation – a clear conflict of interest despite her disingenuously claiming “no discussion of any matter pending for the department or any matter pending for any other body” took place. In a Washington Post op-ed , former attorney general Eric Holder expressed concern about Comey’s “vague letter to Congress about emails potentially connected to a matter of public, and political, interest” – claiming he “violated long-standing Justice Department policies and tradition.” Holder disgraced the office he held. Law Professor Francis Boyle called him “a total disaster for the United States Constitution, the Bill of Rights, Human Rights and the Rule of Law.” Speaking in Florida on Sunday, Hillary changed the subject, saying “there’s a lot of noise and distraction, but it really comes down to what kind of future we want, and what kind of president can help us get there. We won’t be distracted no matter what our opponents throw at us.” Clearly, Comey’s bombshell changed the dynamic of the race, whether enough to derail her White House bid we’ll know in days. Reports indicate the FBI will examine an astonishing 650,000 emails from former Congressman Anthony Weiner’s laptop – estranged husband of top Hillary aide Huma Abedin. It could take months to review volume this immense, likely extending well beyond November 8 and January’s inauguration, to determine if any evidence warrants prosecuting Hillary, Abedin, Weiner or anyone else for mishandling classified government documents, perhaps compromising national security. Having absolved Hillary in July, despite plenty of indictable evidence, it’s hard imagining a change of FBI policy now. Submit your review'"}, "time": 1742562058.5784845}