{"duration": 0.1409742832183838, "input_args": {"text": "'WASHINGTON  —   It seemed like a chummy reunion between friends. Chris Wallace, the Fox News anchor, was chatting amiably in his studio here on Sunday with Paul J. Manafort, Donald J. Trump’s new campaign chief, reminiscing about Ronald Reagan as the seconds ticked down to airtime. Then the cameras switched on. Mr. Wallace’s tone sharpened as he pressed Mr. Manafort about his lobbying work for a Filipino dictator and his description of Mr. Trump as playing a “part. ” One halting answer was dismissed with a sly Wallace riposte: “Forgive me, it does seem a little bit like spin. ” By the time Mr. Manafort removed his microphone, tweets were swirling about his uneven performance. Mr. Wallace, who compares interviews to   shot a glance at his producer: success. As Fox News grapples with how to cover Mr. Trump  —   who has tested the network’s influence and battled its anchors, even as he stokes its ratings  —   Mr. Wallace has stood out as Fox’s moderate, occasionally contrarian voice, irritating Mr. Trump with tough questions and, on occasion, tweaking his opinionated colleagues, too. When Mr. Trump pledged in an interview to act more presidential, Mr. Wallace parried: “When are you going to start?” Then there was the time he ticked off Roger Ailes, Fox’s powerful chairman, after chastising the hosts of the network’s morning show, “Fox and Friends,” for their carping coverage of Senator Barack Obama in 2008. “They were very unhappy,” Mr. Wallace recalled. “I had called them out on the air. ” He added: “There’s a phrase that we all talk about, which is, ‘You do not fire inside the tent.’ That’s the ultimate transgression in Roger Ailes’s mind. ” Over eggs and tea here on Sunday, Mr. Wallace, whose “Fox News Sunday” is experiencing its highest ratings since starting 20 years ago this week, did not hesitate to take his industry and even his network to task, saying that Mr. Trump has been granted too much exposure on cable news. “If we put Donald Trump on for a rally now, and it’s going to spike our audience, it’s pretty hard if you’re a news executive to say no,” he said. “Did everybody do it too much? Yes. ” Mr. Wallace singled out CNN as a notable offender. Would he include Fox in that group? “Absolutely,” he replied. And asked if Fox’s   commentators, who often support the Republican nominee in presidential years, would rally around a Trump candidacy, Mr. Wallace laughed. “That’ll test it, won’t it?” he said. “I don’t know. It’ll be interesting to see. ” Mr. Wallace, 68, is a registered Democrat  —   in order to vote in local Washington elections, he explains  —   and he spent decades as a correspondent on NBC and ABC before joining Fox in 2003. The move to Fox prompted him to review what he calls his “unexamined assumptions” about traditional network news. “If there’s a story on   marriage, it’s like this is a celebration of a new civil right,” Mr. Wallace said. “I’m not saying I disagree with that. What I’m saying is there are two sides to the story, and I don’t think, generally speaking, the broadcast networks will portray both sides evenly. ” Wry and punchy   Mr. Wallace has long had a rebellious streak. Bill Clinton accused him in an interview of having a “little smirk on your face” Newt Gingrich goaded a crowd into mocking him at a 2011 debate President Obama’s refusal to appear on his show prompted Mr. Wallace to describe his administration as “crybabies. ” (Mr. Obama ended his drought this month, in an interview that lured millions of viewers.) In the Fox studio in Washington on Sunday, Mr. Wallace could not resist making mischief. After grilling Debbie Wasserman Schultz, the Democratic National Committee chairwoman, Mr. Wallace reassured her during a commercial break that the segment had gone fine. “It was clear you think Donald Trump sucks,” Mr. Wallace said, earning a laugh from Ms. Schultz. Last summer, Mr. Trump lashed out at Mr. Wallace for asking about his bankruptcies during the first Republican debate. “The son is only a tiny fraction of Mike, believe me,” Mr. Trump said afterward. That would be Mr. Wallace’s father, Mike Wallace, the famous correspondent whose legacy has been a complicated backdrop to his son’s career. For years, the men were not close Chris Wallace still considers his stepfather, Bill Leonard, a former president of CBS News, as “more of a father than my father was. ” Mike Wallace once stole an interview, with the comedian Chris Rock, away from his son the two did not speak for several months. Chris Wallace said there was a time when Mr. Trump’s remark might have bothered him, adding: “It doesn’t anymore. ” “At some point, I realized, I was never going to be Mike Wallace, but neither was anybody else,” he said. He and his father, who died in 2012, bonded later in life Mr. Wallace has also borrowed bits of his father’s interviewing style, prefacing tough questions with a polite “Forgive me,” and occasionally placing a deferential arm across his chest. “He’s a dignified, smart, fairly quiet guy, who came up under a legend,” Mr. Ailes said in an interview. “He’s now pretty much achieved what his old man did. ” So what does Mr. Ailes make of Mr. Wallace’s contention that news networks, including Fox, have   Mr. Trump? “Did he get too much coverage? Yes,” Mr. Ailes said, after a pause. “On the other hand, it’s not just cable news, but all news. ” “The broadcast networks are just as guilty,” Mr. Ailes added, noting that Mr. Trump, in addition to being the Republican   has been more accessible to the news media than his opponents. “When you go try to drag another candidate to talk about another serious issue that day, he’s not available,” Mr. Ailes said. Andrew Heyward, a former president of CBS News, praised Mr. Wallace for his tough interviews and for refusing to allow Mr. Trump to phone in to his Sunday show, an accommodation made by some other networks. He noted that Mr. Wallace’s journalistic reputation provided another benefit to Fox. “Part of the brilliance of Ailes is he has a few people like that he can point to, and say, ‘What do you mean we are the official spokesman of the Republican Party? That’s ridiculous,’” Mr. Heyward said. “He’s his own man,” Mr. Heyward said of Mr. Wallace. “And that works for Roger, too. ” (Mr. Ailes said in response: “It’s amusing to me to hear that one person I picked has made this all work. ’’) Over lunch, Mr. Wallace said that some of Mr. Trump’s behavior had taken politics “to new depths, and I think it’s sad. ” “I understand the need to entertain, but I think it would suit him, and serve democracy, if it was conducted on a higher plane,” he said. That hasn’t stopped Mr. Wallace from displaying a “Make America Great Again” cap, signed by Mr. Trump, among the mementos in his office. (Also on display: his father’s old Rolodex.) “It’s a great hat,” he said, urging a reporter to try it on. His brow arched, he said he likes to wear it while visiting one of his daughters, “a raving liberal,” in New York. Why? “I knew it would really tick her off. ”'"}, "time": 1742562250.8184016}