{"duration": 0.07163643836975098, "input_args": {"text": "'VIDEOS Huma Abedin: “I have no idea how the emails got on Weiner’s computer” Long-time Hillary aide Huma Abedin has told the FBI she was not aware any of her emails were on the laptop investigators seized By Tyler Durden - October 31, 2016 \\nWith the FBI having obtained a warrant to begin poring over the 650,000 reported emails found on Anthony Weiner’s computer, attention shifts to just what the FBI may find, with Democrats alleging that much of the thousands of emails allegedly sent from Huma Abedin’s computer are duplicates or otherwise innocuous, while critics alleging more deleted and/or confidential emails may emerge. On her, behalf, however, long-time Hillary aide Huma Abedin has told the FBI she was not aware any of her emails were on the laptop investigators seized as part of its probe info Anthony Weiner’s investigation. \\nAccording to Politico , the FBI engaged in a back and forth over the weekend with Abedin or her attorney, when Abedin explained the situation. \\n“She says she didn’t know they were there,” a source familiar with the investigation said. This is a sensitive topic for Abedin and the Clinton campaign, because on previous occasions, Huma – under oath – disclosed that all the emails in her possession had been accounted for and handed over to the FBI. \\nAs CNBC adds ,”there are a number of scenarios that would explain how the emails got onto the laptop without Abedin’s knowledge, including that they were somehow automatically backed up from the cloud. But investigators will want to know how this happened and if there is any indication that Abedin misled them about the existence of emails. It is a large project. Agents determined there were as many as 650,000 emails on the laptop, dating back years. The number of emails related to the Clinton investigation is likely to be much smaller. On Saturday, Clinton campaign chairman John Podesta said Abedin had been fully cooperative with the FBI investigation. “I don’t think she knows anything more than what we’ve seen in the press to date,” Podesta said Sunday on CNN’s “State of the Union.” \\n“I’m sure…if people—proper authorities want to ask her questions, they’ll ask her questions, but she’s been fully cooperative in this investigation.” \\nThe FBI is now filtering the emails using a software program that will separate out any emails that investigators have not seen before. Those will be kept in a separate file and will be examined by FBI agents to see if they contain classified material or information relevant to the Clinton probe. It is not clear what FBI Director James Comey will do with the information once the FBI obtains it. Standard practice is for the FBI not to comment on investigations — but this is not a standard situation. “We’re in uncharted territory,” the source said. \\nIt is possible that Comey could indicate publicly what the FBI finds before Election Day next week, but that decision has not been made yet.'"}, "time": 1742561826.6413772}