{"duration": 0.07601618766784668, "input_args": {"text": "'PIGEON FORGE, Tenn.  —   Deadly wildfires ripped through the foothills of the Great Smoky Mountains in Tennessee on Monday night and Tuesday, forcing thousands to flee as emergency responders sought to contain a blaze that conjured biblical comparison. “Everywhere you looked, there were fires everywhere. It was like driving into hell,” said Rain Moore, 32, a lieutenant with the Sneedville Fire Department, about an hour and a half away. Mr. Moore said he arrived early Tuesday and, while fighting the fire in the darkness, saw orange flames burning from the center of trees, indicating a strong intensity. Fueled by high winds and a drought in Tennessee, the fires damaged about 150 buildings and forced thousands to evacuate. Three people died and 14 others were injured, officials said Tuesday afternoon. More than 14, 000 people left Gatlinburg, and others were evacuated from nearby Pigeon Forge as well as other parts of Sevier County, in the eastern part of the state, according to the Tennessee Emergency Management Agency. More than 10, 000 people had been left without power in Sevier County. “This is the largest fire in the last hundred years of the state of Tennessee,” Gov. Bill Haslam said on Tuesday afternoon. Dramatic videos shot by residents and shared online showed flames lining the edge of the highways used for evacuations. The fires, the result of human error, started in Great Smoky Mountains National Park and were spread by winds that reached 87 miles per hour on Monday night. Greg Miller, the chief of the Gatlinburg Fire Department, said the authorities expected winds of about 60 m. p. h. overnight Tuesday, but were hopeful that rain would come first. Officials did not say how the three who died were killed. Gatlinburg’s mayor, Mike Werner, was among those who lost his home, he said on Tuesday. He also lost his business of more than three decades. “It’s a devastating time for us and for Gatlinburg,” he said. “But, as I said earlier this morning, we’re strong, we’re resilient and we’re going to make it. ” By early Tuesday evening, a thick,   haze cut visibility in Gatlinburg to only a few city blocks. The fire had hopscotched around the resort town of 3, 900 people and 60, 000 hotel beds, flattening some buildings while leaving others next door or around the block untouched. Emergency vehicles, lights flashing, cruised past   cars and gutted businesses as a city spokeswoman took reporters on a tour of the destruction. The town, located at the base of Great Smoky Mountains National Park about 50 miles from Knoxville, relies heavily on tourism. Pigeon Forge, home to Dolly Parton’s Dollywood theme park, is among the premier tourist destinations in the region. On Twitter, the National Park Service announced that officials had “closed all facilities in the park due to the extensive fire activity, and downed trees. ” Pete Owens, a spokesman for Dollywood, said in a statement that the park had not been damaged but that more than a dozen cabins managed by the company had been damaged or destroyed. Ms. Parton said she was “heartbroken” by the destruction: “I am praying for all the families affected by the fire and the firefighters who are working so hard to keep everyone safe. ” The fires spread through Tennessee as much of the South has been enduring a crippling drought, even though rainfall this week offered some relief. The United States Drought Monitor reported last week that 60 percent of Tennessee was in “exceptional” or “extreme” drought, the two most severe ratings. Wildfires, once a seasonal phenomenon, have become a consistent threat, partly because climate change has resulted in drier winters and warmer springs, which combine to pull moisture off the ground and into the air. The authorities closed Route 321 at the Rocky Top Sports World, barring access into downtown Gatlinburg. About 700 people gathered on Tuesday morning inside the complex’s main building, a   center on the   campus: mountain men with gray beards and canes alongside several people in blue surgical masks. One man was too choked up to talk, his tiny   bull mix shaking inside his battered camouflage jacket. Dozens of Red Cross volunteers and firefighters tended to people who seemed shellshocked. “I got my family, man,” said Greg Lanham, 36, who fled the flames around 8 p. m. Monday with his wife, Kara, 32, and their three children. The family moved from Henderson, Tenn. three months ago. Mr. Lanham, a maintenance worker, and Ms. Lanham, a maid, both worked at Sidney James Mountain Lodge, which survived the fire but remains closed. “We didn’t know what to do,” Mr. Lanham said. “We took what little money we had in our pockets and found a place to stay. ” The family did manage to save their dogs, Gizmo, a Pekingese, and Scruffy, a   Russell mix, along with their kitten, Snowball. Standing at the sports complex’s food counter, where Red Cross volunteers served free coffee, hot dogs, burgers and fries, and boxes of fried chicken, Ms. Lanham joined her family and, crying, told her husband: “It’s gone. It’s all gone. ” “We did lose everything,” Mr. Lanham said. “We got the clothes on our back. ”'"}, "time": 1742562304.2101529}