{"duration": 0.147629976272583, "input_args": {"text": "'In the Roethle household in Leawood, Kan. the children woke up on Wednesday to a family celebration. Donald J. Trump was the new president. But the excitement came with an admonition “to be a good winner” and not to gloat about his win at school. “Kindness is the No. 1 thing in our house,” said Alana Roethle, 37, a mother of four children ranging in age from 4 to 9. “We were talking about this in the morning, that we love everybody, even if they don’t share our political views, even if they don’t love Jesus. ” The   morning was different for Amber Karamat, 47, of Anaheim, Calif. Her      son was devastated by the news. “Will Trump still let me be an American?” he asked his mom, who cried as she recounted the story. “I feel helpless. I said, ‘No one can take that away from you, sweetie. You were born an American. ’” Perhaps more than any other election in recent memory, the Trump versus Clinton campaign was a family affair. Girls donned “The Future is Female”   and canvassed neighborhoods with their mothers to support Hillary. Parents supporting Trump imagined a better economic future for their children, and talked to them about gun rights and safe borders. Often, the election news cycle forced parents to navigate tricky topics like bullying, profanity and sexual harassment. A   Clinton ad reminded us “Our children are watching. ” And now, in the days after the election, parents on both sides of the vote struggle to put the bitter election fight into perspective and find teachable moments in the sometimes unpleasant aftermath. Amber Deyle, 37, of Emmons, Minn. and her husband, Dan, watched the election results roll in with their two sons, ages 6 and 10. “We were really excited,” she said, noting gun rights as a critical issue. “Hunting is important to our family. Not only were we raised on it, but it helps us teach our children where food comes from. ” But she and her husband had some hard conversations with their boys about Mr. Trump, she added, “because of some of the things he had said about women and minorities and things like that. But at the same time, we also had to explain to our children what Benghazi was. ” Daniel Roberts, a    father of two daughters in Montclair, N. J. and a Clinton supporter, took his younger daughter, 10, to vote with him. Mr. Roberts, a high school football coach and a patient navigator at a hospital, is black and his wife is white, and their daughters are biracial. After the results came in, his younger daughter was upset that a woman didn’t win and worried about the racist sentiments she’d been hearing. “My wife and I talked about it a lot and told her to keep aiming high, and reach for the stars. ” His older daughter, 14, was not so easily comforted. “My daughter wants to be a doctor. She’s a smart girl, and she knows it’s a tough field. She understands that she’s already starting one step behind as a woman. ” Mr. Roberts said he’d never seen her so dejected. “Seeing her mood after the election, the dad in me came out and I felt for her. It almost made me cry. ” Parents on both sides of the election say the result has triggered conversations at home that are equally focused on civics and history as well as values and acceptance. Carrie Chavis, a    mother in Austin, Tex. voted for Mrs. Clinton, but most of her neighborhood voted for Mr. Trump. Her sons expressed disbelief when Ms. Chavis told them that Mr. Trump had won the election. Her oldest son was taunted at school when classmates learned he supported Mrs. Clinton. But even though Ms. Chavis is sad about the result, she used the moment to remind her sons about the value of democracy. “I told them that we are so lucky that we get to vote for who we want as president, and we should be so thankful,” she said. In Pelham, N. Y. Cherie Corso, a Trump supporter, had similar conversations with her    daughter, Julia, who helped her volunteer for the Trump campaign and cried with happiness when he won. But she also struggled at school, where most of the other students supported Mrs. Clinton. “She’s been getting backlash,” Ms. Corso said. “My advice to her is, ‘He’s the winner, O. K.? He won, the people have spoken, you don’t have to defend Donald Trump, you don’t have to say anything. ’” Julia said most Trump supporters at her school don’t admit it. “Everybody whispers,” she said. “If I say something about how he’s not that bad, people yell at me. I don’t blame them because it’s something they feel passionately about. ” Jason Benedict, 46, a registered Republican and the father of a boy in elementary school in Scotch Plains, N. J. voted for a   candidate. He reminded his son “to be kind to his friends who may be upset by this decision. ” “No matter who the president is, what’s really important is that he try his hardest every day to be nice to people, be helpful, and that everyone is entitled to their own life and opinions,” he said. Valerie Kummer, 32, a Republican from Watford City, N. D. watched her children leave for school on Tuesday morning chanting “Trump” because they were excited to cast their ballots in the school’s mock election. Ms. Kummer said she reminded them throughout the campaign “about loving other people and loving differences. ” For the first time in his life, Ben Goldstein, 39, a rabbi and father of three young children in Los Angeles, voted for a Democrat for president. The first thing his    daughter asked him when she woke up on Wednesday was, who won the election? “I told her that Donald Trump won and explained that we live in an amazing country where people disagree and get to decide who is president. I told her that I hope he does such a great job that I end up voting for him in four years,” he said. His daughter seemed to accept that explanation, but Rabbi Goldstein is concerned about the damage the divisive campaign has already done. “Instead of vilifying him and all his followers, we can take this opportunity to look in the mirror and see how we contributed to the rhetoric of the past few years. How do we treat those with whom we disagree? What do we do with their arguments?” he said. In some families, children disagreed with their parents’ choice for president. Elise Breth, a    mother of two in Orlando, Fla. is a Trump supporter, as is her    son. But her    daughter supported Mrs. Clinton. She “thought Hillary hung the moon because she’s female, and that’s who her friends at school were supporting,” Ms. Breth said. “Even though I support most of Trump’s policies, I am proud of my daughter for recognizing that a strong, independent woman can be anything she wants to be. ”'"}, "time": 1742562169.180594}