{"duration": 0.09769201278686523, "input_args": {"text": "'LONDON (AP)  —   Roger Moore, the suavely insouciant star of seven James Bond films, has died in Switzerland. He was 89. [The British actor died Tuesday after a short battle with cancer, according to a family statement posted on Moore’s official Twitter account.  “We know our own love and admiration will be magnified many times over, across the world, by people who knew him for his films, his television shows and his passionate work for UNICEF, which he considered to be his greatest achievement,” the statement said. Moore’s relaxed style and sense of whimsy, which relied heavily on the arched eyebrow, seemed a commentary on the essential ridiculousness of the Bond films, in which the handsome British secret agent was as adept at mixing martinis, bedding beautiful women and ordering gourmet meals as he was at disposing of   trying to take over the world. “To me, the Bond situations are so ridiculous, so outrageous,” he once said. “I mean, this man is supposed to be a spy and yet, everybody knows he’s a spy. Every bartender in the world offers him martinis that are shaken, not stirred. What kind of serious spy is recognized everywhere he goes? It’s outrageous. So you have to treat the humor outrageously as well. ” While he never eclipsed Sean Connery in the public’s eye as the definitive James Bond, Moore did play the role of secret agent 007 in just as many films as Connery did, and he managed to do so while “finding a joke in every situation,” according to film critic Rex Reed. The actor, who came to the role in 1973 after Connery tired of it, had already enjoyed a long career in films and television, albeit with mixed success. He was remembered warmly by fans of the popular U. S.   TV series “Maverick” as Beauregarde Maverick, the English cousin of the Wild West’s Maverick brothers, Bret and Bart. He also starred in the 1959 U. S. series “The Alaskans. ” In England, he had a   TV hit with “The Saint,” playing Simon Templar, the enigmatic action hero who helps put wealthy crooks in jail while absconding with their fortunes. By the time the series, which also aired in the United States, ended in 1969, his partnership with its producers had made him a wealthy man. Such success followed a Time magazine review of one of his earliest films, 1956′s “Diane,” in which his performance opposite Lana Turner was dismissed as that of “a lump of English roast beef. ” In the 1970s, film critic Vincent Canby would dismiss Moore’s acting abilities as having “reduced all human emotions to a series of variations on one gesture, the raising of the right eyebrow. ” Born in London, the only child of a policeman, Moore had studied painting before enrolling in the Royal Academy of Dramatic Art. He played a few small roles in theater and films before his mandatory army duty, then moved to Hollywood in the 1950s. He appeared opposite Elizabeth Taylor in 1954′s “The Last Time I Saw Paris” and with Eleanor Parker in “Interrupted Melody” the following year. In 1970, he became managing director for European production for Faberge’s Brut Productions. With the company, he   with Tony Curtis in “The Persuaders!” for British television and was involved in producing “A Touch of Class,” which won a   Oscar for Glenda Jackson. Three years later, he made his first Bond film, “Live and Let Die. ” He would make six more, “The Man With the Golden Gun,” ″The Spy Who Loved Me,” ″Octopussy,” ″Moonraker,” ″For Your Eyes Only and “A View to a Kill” over the next 12 years. And while the Bond of the Ian Fleming novels that the films were based on was generally described as being in his 30s, Moore would stay with the role until he was 57. He continued to work regularly in films after handing over Bond to Timothy Dalton, but never with the same success. His   films included such forgettable efforts as “The Quest” with   Van Damme and “Spice World” with the Spice Girls. In 1991, Moore became a goodwill ambassador for UNICEF, having been introduced to the role by the late actress Audrey Hepburn. As Hepburn had, he threw much of his energy into the task. “I felt small, insignificant and rather ashamed that I had traveled so much making films and ignored what was going on around me,” he said in describing how the work had affected him. In 1996, when his UNICEF job took him to the World Congress Against Commercial Sexual Exploitation of Children, he disclosed that he too had been a victim. “I was molested when I was a child  —   not seriously  —   but I didn’t tell my mother until I was 16, because I felt that it was something to be ashamed of,” he told The Associated Press. He gave no details, but said it was important to encourage young victims not to feel guilty. “They’re being exploited. We have to tell them that,” Moore said. Moore received the Dag Hammarskjold Inspiration Award for his work with UNICEF and was named a commander in France’s National Order of Arts and Letters in 2008, an award he said was worth “more than an Oscar. ” That same year he published an autobiography, “My Word Is My Bond,” which included details about his work on the Bond films, his friendship with Hepburn, his encounters with Cary Grant, Frank Sinatra, Elizabeth Taylor and other stars, and his health struggles  —   including a bout with prostate cancer, which he beat. Moore was divorced three times, from skater Doorn Van Steyn in 1953, English singer Dorothy Squires in 1969 and Italian actress Luisa Mattioli, the mother of his children Deborah, Geoffrey and Christian, in 2000. He married a fourth time, in 2002, to Swedish socialite Kristina Tholstrup.'"}, "time": 1742562864.6826234}