{"duration": 0.16955256462097168, "input_args": {"text": "'It’s hard to imagine a tax code more favorable to real estate developers than the one we already have. Donald Trump has come up with one. Thanks to some major loopholes in the existing tax code that treat real estate developers as a special privileged class, it’s entirely possible (even likely) that Mr. Trump pays little or no federal income tax. But Mr. Trump’s new tax proposal doesn’t just preserve those breaks, it piles on new ones for real estate developers like Mr. Trump himself  —   at an estimated cost of more than $1 trillion in tax revenue over a decade. Moreover, this doesn’t count Mr. Trump’s more general tax cuts, which deliver the biggest windfalls to the highest earners. Many real estate developers would reap further gains from those provisions if they became law. Even conservative Republican tax experts have denounced the specific real estate measures Mr. Trump has outlined. “If you want to create a recipe for an abusive tax shelter, take those elements and bake for 15 minutes,” said Douglas   an economist who served as director of the Congressional Budget Office and is now president of the American Action Forum, a conservative   advocacy group. He was also an economic policy adviser to former Republican presidential candidate John McCain. “It’s a phenomenal benefit for housing and commercial real estate interests. ” Let’s start with carried interest, a   tax loophole that allows private equity operators, hedge fund managers and real estate partners to convert ordinary income into capital gains, which are taxed at a lower rate. Wealthy hedge fund managers and private equity partners like the former Republican presidential candidate Mitt Romney have attracted much of the criticism for exploiting the loophole, but the concept originated with real estate developers long before hedge funds were commonplace. Instead of taking a fee for their management services (which would be taxed as ordinary income) people who earn carried interest take a percentage of assets under management and a percentage of the eventual profits, a formula often described as “two and twenty. ” The percentage of profits is taxed at the lower capital gains rate. In what at first might seem a laudable effort to put the public interest ahead of his own financial gain, Mr. Trump called for abolishing the loophole. “We will eliminate the carried interest deduction and other special interest loopholes that have been so good for Wall Street investors, and people like me, but unfair to American workers,” Mr. Trump said in Detroit on Aug. 7. But his fellow real estate investors and the Wall Street interests he lambastes needn’t worry. He’s offering them an even better tax break that renders carried interest irrelevant. Mr. Trump has proposed a new rate  —   15 percent on all corporate and business income  —   that is lower than the current capital gains rate of 20 percent on profits from the sale of assets, which is already well below the top tax rate on ordinary income of around 40 percent. The new lower rate would apply to “  entities,” according to Mr. Trump’s plan, “Tax Reform That Will Make America Great Again. ”   entities pay no tax at the business level as the name suggests, income is taxed at individual rates when it is distributed to the owners. Such entities include limited liability companies, or L. L. C. s, and sole proprietorships, S Corporations, and many partnerships. The   Tax Foundation estimates that they account for 60 percent of all business income in the United States. While they can be found in all sectors of the economy (including private equity and hedge funds) they are especially prevalent in real estate. Mr. Trump identified 564 separate business entities in his financial disclosure forms, most of them L. L. C.s and partnerships. That amounts to a huge tax cut even for people who had been paying taxes on carried interest at the preferential rate, “since most carried interest is generated by a business entity,” said Alan Cole, an economist at the Tax Foundation’s Center for Federal Tax Policy. The center warned last year, before Mr. Trump’s latest revisions, that his overall plan could cost over $10 trillion in reduced tax revenues over 10 years, depending on how it is calculated. “The rich who already benefit from carried interest will get a big tax cut,” Mr.   agreed. The   Tax Policy Center estimated that lowering the rate on business income from   entities to 15 percent would cost $1 trillion over 10 years. Mr. Trump already benefits from enormous depreciation benefits, which allow active real estate developers like him to use paper losses to offset other earned income. Mr. Trump’s proposals go even further, allowing for immediate   rather than spreading them over several years. “We will allow businesses to immediately expense new business investments,” he said in Detroit. The idea of immediately expensing capital investments rather than writing them off over time has many supporters among tax experts, including the Tax Foundation and Mr.  . Among other things, it simplifies the calculations and in theory would promote capital spending at a time it’s been lagging. But few, if any, support expensing capital investments while also allowing an interest expense deduction. That’s because the combined deductions provide a reason to borrow even when it doesn’t make economic sense. As a simple example, consider a landlord’s $1, 000 investment in a new garage door for a rental property. Someone who borrows $900 at 5 percent would spend just $100 out of pocket, but could deduct $900 plus interest, or $945, generating a large tax loss. Even assuming Mr. Trump’s favorable business tax rate of 15 percent goes into effect, the tax benefit ($142) is greater than the cash spent, creating a purely tax incentive. Here’s what the 2005 President’s Advisory Panel for Federal Tax Reform under President George W. Bush concluded: “Allowing both expensing of new investments and an interest deduction would result in a net tax subsidy to new investment,” the report found. “Projects that would not be economical in a   world might become viable just because of the tax subsidy. This would result in economic distortions and adversely impact economic activity. ” Steven M. Rosenthal, a veteran tax lawyer and senior fellow at the   Tax Policy Center, put it in   terms Mr. Trump might use: “Coupling an interest deduction with expensing is ridiculous. ” Every other proposal to expense business investments, including the House Republican plan, limits interest deductions. Eliminating the interest deduction “will generate an enormous amount of kvetching out of highly leveraged investors, real estate developers among them,” said Mr.  . “I have no sympathy for that. If your business model depends on interest deductibility, that’s not a business, it’s a tax shelter. ” Mr. Trump hasn’t explicitly addressed whether interest payments should remain deductible, as they are now, but various advisers have said he supports maintaining the deduction. (The Trump campaign didn’t respond to my requests for comment.) That shouldn’t be all that surprising, given how much debt Mr. Trump’s empire carries. The Times recently estimated his companies have at least $650 million in debt. “Trump is a debt king,” said Mr. Rosenthal. “He’s made a living from deducting interest. He’s never going to give that up. ” The changes and inconsistencies in Mr. Trump’s tax reform proposals have left many experts scratching their heads. “Trump has no overarching principle that I can identify,” said Mr.  . “I want a tax code to express values. It should be about something,” That leaves it open to speculation that Mr. Trump’s plan is mostly about himself and other wealthy real estate developers. It’s hard to tell for sure, since he hasn’t released his tax returns. If, as I’ve suggested, he pays little or no tax because he can use the existing tax code to reduce his taxable income to near zero, or even a loss, his proposals that extend even more breaks to developers might have relatively little impact on his own tax obligations. Still, to the degree they would reduce his tax rate to 15 percent and accelerate depreciation while maintaining the interest deduction, they would ensure that Mr. Trump  —   and most of his friends on Wall Street who would be well positioned to exploit his new loophole  —   would never pay anything close to the 33 percent top rate he’s now proposing for his fellow Americans.'"}, "time": 1742562843.7618065}