{"duration": 0.05459713935852051, "input_args": {"text": "'\\nThis article was written and originally published at The Daily Sheeple . \\nEditor’s Comment: There are powers bigger than just the president, and Trump is under a lot of pressure right now to take advice from people who represent the deepest and darkest interests at work in foreign policy. America will be undergo a tremendous test in the next term, as terrorism, war, a divided population and the global economy all threaten to explode on his watch, leaving the situation open to exploit by the advisors and appointees of the Deep State, and the secret societies that create and steer world affairs. \\nAfter decades as a billionaire businessman, Trump is finally playing ball in the big leagues, and that means some very serious characters at work in and around his office of power. \\nIf Trump thinks he’s now the big boss, he’d better be very careful and watch is back. History has a lot to say about JFK’s assassination – because it concerns his attempt to oust the shadow powers from his administration. \\nRon Paul on Trump’s Election: Beware of the Shadow Government \\nby The Daily Sheeple\\nFormer congressman and presidential candidate Ron Paul appeared on RT to talk about the election of Donald Trump as president, and he voiced major skepticism on whether Trump will actually follow through on many of his campaign promises.\\n\\nPaul referenced Trump’s independence as being a political outsider and that this possibly could have a more favorable outcome than we might have seen with Hillary Clinton in the Oval Office. However, he notes that we cannot determine what plans for Trump’s presidency the shadow government might have. Speaking of this secret power structure, he said:\\nYou know, we look at the president, we look at what he said, we look at what he might do, and we look at his advisors, but quite frankly, there is an outside source, which we refer to as a deep state or a shadow government. There is a lot of influence by people that are actually more powerful than our government itself, our president and on up. I mean, you take for instance how our government gets involved in elections around the world, whether it’s in the Middle East or Ukraine. \\nPaul is not particularly pleased with the war-driven neoconservatives who are beginning to surround Trump. “Unfortunately, there has been several neoconservatives that are getting closer to Trump. And if he gets his advice from them then I do not think that is a good sign,” he said. “During the campaign, he did talk a little bit about backing off and being less confrontational to Russia and I like that. He criticized some of the wars in the Middle East at the same time. He believes we should accelerate the war against ISIS and terrorism.”\\nPaul thinks that the Wikileaks release of the nearly 60,000 hacked Podesta emails is what ultimately secured Trump to the presidency, but he thinks that the hidden power structure is brewing something in the background to maintain their dominion over the US presidency. “Yes, Trump is his own guy, more so than most of those who have ever been in before. We hope he can maintain an independence and go in the right direction. But I fear the fact that there is so much that can be done secretly, out of control of our apparent government and out of the view of so many citizens,” he cautioned.\\nPaul does not have high hopes that Trump will follow through on his campaign promise to disengage from the NATO alliance. He expects that Trump’s intentions as president will become clear once we see who he appoints to his cabinet.\\nThis article was written and originally published at The Daily Sheeple . \\n'"}, "time": 1742563840.6274722}