{"duration": 0.06257820129394531, "input_args": {"text": "'Email \\nAs a parent, you always have to be aware of what lessons your child is learning from the world around him or her. I know that I won’t be able to protect my 9-year-old James from every bad thing out there, but on a recent trip to the grocery store, I was utterly appalled by a disturbing trend: Our country has become desensitized to violence in hot-sauce names, and it’s a big problem. \\nYou can’t walk down your grocer’s sauce isle without being bombarded by hot-sauce names that romanticize violence. Tears of Blood, Nuclear Bombardment Chile Extract, and Death on the Toilet have become standard fare in the hot-sauce industry. An innocent trip to purchase a simple bottle of ketchup now subliminally exposes shoppers, and our impressionable children, to dozens of gruesome descriptions of burning flesh, brutal deaths, and massive ass damage. \\nAs soon as the hot-sauce industry agreed it was okay to allow names like Cremation in a Bottle Pepper Sauce and Ass Grave Cajun Sauce to appear on store shelves, any shred of decency went out the window. An arms race began to see who could come up with the most violent and gory sauce name, society be damned. And it needs to stop before our children internalize these sorts of brutal names as the norm for hot-sauce labels. \\nHot sauce has always been hot, but the names used to imply the hotness without going into the graphic detail you see today. \\nI took my son James to my favorite Mexican restaurant this past weekend, and he didn’t even blink when he saw a bottle with “Volcanic Crucification” written out in flames. If he isn’t bothered by this, who’s to say if he would even think twice if he one day saw a hot sauce called Ghost Pepper Throat Thresher? \\nI pray that we correct course in this country before anyone decides to make that hot sauce. \\nIt wasn’t always like this. Hot sauce has always been hot, but the names used to imply the hotness without going into the graphic detail you see today. Names like Frank’s Red Hot let you know you were in for some serious heat, but left something to the imagination. But there is no longer a moral standard for hot-sauce names. Now, all it takes to begin leading a child down a bad path is for them to glance at a sauce bottle in a friend’s refrigerator door. \\nWhether it’s Screaming Suicide Moruga Scorpion Sauce or Habanero Holocaust Sauce, the lengths to which today’s sauces are going to outdo one another with disturbingly violent names has gotten out of control. And if you’re a parent, you know that we must do something to stop this, before it’s too late for our children.'"}, "time": 1742561912.2233744}