{"duration": 0.04773592948913574, "input_args": {"text": "'CliveMaund.com October 27, 2016 \\nSome of you may have noticed that I have “gone quiet” over the last few weeks regarding the Precious Metals sector, and I have actually been asked by one subscriber if I have given up on the sector. \\nMy response was: \\n“We have not lost sight of the thunderous bull market that is currently incubating in gold and silver, that will spin off huge opportunities in Precious Metals stocks, which is an inevitable outcome of the deepening financial crisis resulting from a snowballing of the debt and derivative problems that were not solved following the crisis of 2008, but were only papered over by means of financial engineering and printing money. The reasonable presumption is that, rather than let the system implode, those responsible for this mess will resort to the only option left open to them – so-called “helicopter money”, which is, needless to say, highly inflationary, and will be a principal driver for the expected huge ramp in gold and silver prices.“ \\nIn the interim, whilst bullish factors coalesce for the Precious Metals, we have been keeping an eye on other sectors, and in particular the marijuana sector, which is making great strides forward in both the recreational and medical spheres, having been held back for decades by Big Pharma with its enormous lobbying power, keen to suppress natural competition for its expensive potions. So what we have now is a situation where a sector that had been confined to the shadows for decades is suddenly bursting onto center stage, providing an enormous opportunity for savvy investors. The marijuana sector experienced a preliminary thinly traded bubble back in 2014, which we ignored for a number of reasons, however, many of those reasons ceased to have relevance, and the sector has been providing amazing returns over the last few weeks. \\nWhatever your opinion on the legalities of Cannabis, it is in a huge growth phase at the moment, and there is an upcoming vote in the US on the 8th of November that will be a major pivot point for the stocks we are looking at. \\nTo help people understand more about the sector, and how they can capitalize on it right now, we have prepared a Green Paper, which is available for download here. I suggest anyone who is interested in making large, short-term gains takes a look at it and considered following us over the next two weeks while we drain every potential drop of profit out of this one! \\nBack to the Precious Metals sector……… \\nWe have seen a quite severe correction in gold and silver since the early July peak, with a particularly sharp decline early this month coming as a shock to many, even including us – but it shouldn’t have been – COTs looked awful all through the Summer and predicated such a drop. However, Commercial short and Large Spec long positions are at last starting to ease significantly as we can see on the latest COTs charts shown lower down the page, although there is still plenty of room for improvement. \\n\\nGDX update \\nThe sector correction is believed to have largely run its course, with the earlier overbought condition having more than fully unwound and GDX having dropped back to the vicinity of the rising 200-day moving average. Few are bullish, as made plain by the Gold Miners Bullish Percent Index shown lower down the page, which reinforces the growing bullish case. Fortunately, because both the corrective downtrend channel and the nearby strong support level are clearly defined, we can delineate a choice of two unequivocal buy signals. One is the GDX dropping into the support level shown and the 2 nd is a clear breakout from the downtrend channel – so you don’t need to lose sleep over it, just do one or the other, whichever comes first, and we will aim to keep you updated as this situation develops. \\nThe current low sentiment readings for Precious Metal stocks are an indication that we are either at or close to an intermediate sector bottom here. The Gold Miners Bullish Percent Index chart shown below makes this clear. Putting this together with the COTs, it looks like we are early in a sector basing process here, which could continue for some weeks. Although we may see some further downside in gold and silver, the downside in PM stocks is regarded as limited, due to them having already corrected hard so that we only have a 21.4% bullish rating for stocks. This means that it makes sense to start moving in and buying the best stocks on down days, which is precisely what we have been doing during the past couple of weeks. \\nEnd of update.'"}, "time": 1742628545.262349}