{"duration": 0.09513592720031738, "input_args": {"text": "'DAPL Protesters Proven Right as Largest Gas Pipeline in U.S. Experiences Massive and Deadly Explosion Home / Badge Abuse / Dashcam: Chief Caught Doing Over 100 mph Only for Fellow Cops to Stop Him and Laugh About It Dashcam: Chief Caught Doing Over 100 mph Only for Fellow Cops to Stop Him and Laugh About It Claire Bernish November 1, 2016 Leave a comment \\nBrinkley, AR — Dashcam video showing preferential treatment of an Arkansas police chief has him scrambling to defend himself for being let off easy — without so much as a warning — after speeding to an off-duty job as a referee at a football game. \\nFootage obtained by THV11 from Arkansas State Police following a viewer tip, shows Brinkley Police Chief Edward Randle being pulled over in his personal vehicle, a red pickup truck, near Clarendon on Friday, October 21. \\nA state trooper assisted an officer from the Brinkley force upon request, and makes a U-turn after witnessing the speeding red pickup driving in the opposite direction, to make the stop. \\nAs the trooper approaches the driver’s side, dashcam video shows he immediately recognized the Brinkley chief of police, and laughingly asks, “Where are you going so fast?” \\nRandle — obviously familiar to the state trooper — isn’t asked to produce identification, and tells the officer he’s headed for the game, which he later clarified for THV11 was the Clarendon-Marvell football game. \\nAt that point, the Brinkley officer, who had summoned state police for assistance with the stop, also approaches Randle — as the trooper tells the chief the officer had been tailing him for miles when he finally called for assistance. \\n“I know you didn’t call the State Police!” Randle quips to the Brinkley officer. \\n“I didn’t have your plate,” the officer replies, “so it didn’t go over.” \\nAs THV11 posits, that statement “could indicate that, since the officer did not announce the truck’s license plate number into his radio, nobody else would know the chief had been pulled over.” \\nThe trio laughs about the chief’s excessive speed, and the officer tells him, “I had you locked in at 107.” \\n“It won’t do 107. It’ll only do 95,” Randle responds, referring to a governor capping his truck’s speed, as he later explained to THV11 in an unrecorded interview. \\nAfter a few more laughs, the officer tells Randle he measured the truck’s speed over 90 miles an hour — and the chief was still pulling away at the time. \\nDespite the obvious dangers of such high speeds on the narrow, curvy road, both the trooper and Brinkley officer simply walk away from the truck, as the officer says dismissively, “See you later, Chief.” \\nVideo captures the last exchange between the two cops as Randle pulls away — the state trooper notes he clocked the chief doing “71 at the curve.” \\nIn two phone interviews with THV11 — which were not recorded, by request — Randle disputes he ever came close to the truck’s alleged top possible speed of 95, as well as the trooper’s claim in dashcam footage he had been rounding the curve at 71 mph. \\nAdditionally, “Though the state trooper claimed that the officer had been pursuing Randle for miles, Randle told THV11 that the officer was on his way to Clarendon to get fingerprints from someone at the county jail.” \\nTHV11 spoke with local business owner, Benjamin Martin, who first noticed the stop by a Brinkley officer inside Clarendon city limits. \\n“I find it, you know, very disheartening, that anyone, public official or not, would show such blatant disregard for the speed limit, and put the lives of innocent others at risk,” Martin told the station in a video interview. \\n“I just feel that no one’s above the law, and you know, if it was me, I would’ve gotten a ticket.” \\nIndeed, the public might be lucky the off-duty Brinkley police chief didn’t lose control of his vehicle while traveling at such a high rate of speed — simply to make it to a football game. \\nNeither the Brinkley officer nor the state trooper are being investigated for wrongdoing — despite giving the chief a free pass. Arkansas State Police told THV11 the incident fell under control of the Brinkley Police Department as soon as the officer arrived on scene, even though the trooper affected the stop. \\n“As a chief of police, and as a law enforcement officer, you’re sworn to protect and serve,” Martin asserted, “which is the opposite of putting the lives of others at risk.” \\nAlthough nothing serious resulted from Randle’s excessive speeds, it was notorious blue privilege that allowed him to drive away without even a warning. \\nThese seemingly small favors afforded to police by police on a constant basis highlight the divide civilians feel in their encounters with law enforcement. Indeed, the idea police belong to an exclusive club of impunity — simply because of their chosen occupation — only increases tension and resentment in their communities. \\nIf police don’t uphold and enforce the laws they enforce against civilians, the law becomes an arbitrary, exploitive method for generating revenue — and nothing more. Share Social Trending'"}, "time": 1742563886.881884}