{"duration": 0.06312417984008789, "input_args": {"text": "'The leaders of the House intelligence committee are giving the NSA, FBI, and the CIA until Friday to reveal how many Americans’ private conversations were improperly ‘unmasked’ amid legal surveillance activities in the last six months, which they believe happened to President Donald Trump’s former National Security Adviser Michael Flynn. [The demand comes as the committee is trying to figure out who revealed Flynn’s identity during his phone calls with Russian Ambassador Sergey Kislyak in December and who illegally leaked the classified contents of those calls to the news media.  “Masking” refers to the protection of identities of Americans who are inadvertently caught up in surveillance  —   for example, of foreign individuals in the U. S.  —   and is referred to as a “minimization” procedure. Chairman Devin Nunes ( ) and Ranking Member Adam Schiff ( ) made the request in a letter dated Mar. 15 addressed to Director of the National Security Agency Adm. Michael Rogers, FBI Director James Comey, and CIA Director Mike Pompeo. “As you know, the Committee has been very concerned regarding the purported unauthorized disclosures of classified information, particularly when they pertain to intelligence collection on, or related to, U. S. persons (USP). To take a prominent example, a January 12, 2017 article in a major newspaper was the first to claim that ‘Retired Lt. Gen. Michael T. Flynn, [then  ] Trump’s choice for national security adviser   …    . phoned Russian Ambassador Sergey Kislyak several times on Dec. 29. ” “Such stories would appear to contain the unauthorized disclosure of USP identities. This potential misuse is a key reason why the Intelligence Community (IC) has developed robust ‘minimization procedures’ for the protection of USP information, including requiring the ‘masking’ of USP identities in most circumstances,” they wrote. “However, as recent news stories seem to illustrate, individuals talking to the media would appear to have wantonly disregarded these procedures,” they added. Thus, the leaders have requested all policies   procedures each agency uses to determine when to unmask and disseminate the identity of an American and the number of individuals who can approve an unmasking. They are also asking for the total number of times any unmasked American identity was disseminated between June 2016 and January 2017. They are also asking for the names of those unmasked Americans who had their identities disseminated in response to requests from intelligence community agencies, law enforcement, or any senior Executive Branch officials during that timeframe, in relation to either Trump or former Secretary of State Hillary Clinton. They also want to know who requested any unmasking and dissemination of individuals related to Trump or Clinton and why. If those answers are not produced by Friday, Nunes and Schiff will issue a subpoena for them, they said. The committee is scheduled to question Rogers and Comey at a public hearing on Monday.'"}, "time": 1742561916.6003294}