{"duration": 0.09112381935119629, "input_args": {"text": "'WASHINGTON  —   They are members of the Club Nobody Wants to Be a Part Of. And their numbers are growing. With every mass shooting in America, a somber scene replays itself here. Victims’ families and survivors of massacres  —   Columbine, Virginia Tech, Aurora, Tucson, Sandy Hook, Charleston, San Bernardino  —   traipse up to Capitol Hill. They knock on lawmakers’ doors, attend news conferences and bear witness to Senate votes on gun measures that almost never pass. So there was a sense of déjà vu here on Monday as the Senate rejected four gun safety measures, one week after the Pulse nightclub massacre, which killed 49 and injured 53, in Orlando, Fla. Erica Lafferty Smegielski, 30, whose mother was the principal killed in the 2012 Sandy Hook Elementary School shooting in Connecticut, spent the day wandering the corridors of Congress with Colin Goddard, also 30, whose body still holds three bullets fired by the gunman at Virginia Tech in 2007. They stopped for a quick bite in a cafeteria, and ran into Patricia Maisch, 67, who, in 2011, was waiting in Tucson to have a picture taken with her congresswoman, Gabrielle Giffords, and helped end the massacre by grabbing the gunman’s ammunition clip. They all hugged. “It’s like, every time we come together for something like this, there is someone new we are introduced to for the first time, and we know the road that’s ahead of them,” said Ms. Smegielski over a basket of chicken nuggets. A tattoo honoring her mother is on her right arm. She looked at Mr. Goddard, to her right both work for Everytown for Gun Safety, an advocacy organization backed by Michael R. Bloomberg, the former New York mayor. “Just like you were there for me three years ago,” she told him. “And now, I’m somebody’s Colin. ” Mrs. Maisch had cut short a family reunion in St. Louis to be here for the vote. In 2013, when the Senate voted against gun safety measures that President Obama pushed for after the Sandy Hook shooting, she stood up in the Senate gallery, looked down at the lawmakers and shouted, “Shame on you!” She was escorted out by the police and detained for two hours. On Monday, she wore an orange button that read “Survivor” and a collection of colored plastic wristbands, each one representing a shooting victim. One was for a congressional candidate from Wisconsin whose mother killed herself. One was for Jordan Davis, a    student shot in Florida, by someone who complained about his loud music. One was for Dawn Hochsprung, Ms. Smegielski’s mother. “These are all people I know,” she said. Gun safety advocates said they were not aware of any survivors or relatives from Orlando here it was simply too soon, they said. Lori Haas, whose daughter was badly injured at Virginia Tech, and who is now the Virginia state director of the Coalition to Stop Gun Violence, was in Orlando with family members on Monday. “This is like a very, very, very bad Groundhog Day movie,” she said in a telephone interview from the offices of Equality Florida, a gay rights advocacy group. Her presence there suggests a possible change after the rampage at Pulse, a gay nightclub. Leaders of the gay rights movement, which is   and   are now putting their muscle behind gun safety. Dan Gross, president of the Brady Campaign to Prevent Gun Violence, said gun safety advocates hope to pattern their efforts after the campaign to legalize   marriage. If they cannot win in Washington, they will try to win in the states. They cite some progress: Since the Sandy Hook shooting, 42 states have passed some sort of gun safety legislation, according to the Law Center to Prevent Gun Violence. Mr. Gross’ group helped run a social media campaign using the hashtag #DisarmHate he said it resulted in 150, 000 telephone calls to lawmakers last week  —   10 times the number of calls the movement generated after last year’s massacre in San Bernardino, Calif. “There’s a moment for every great issue and every great movement  —   usually in hindsight  —   that when you look back and say, ‘That’s when things started to change,’” he said. “And for the issue of gun violence, that moment is now. ” As senators voted on Monday, advocates with the Brady campaign sat in the gallery wearing orange   with the slogan #Enough Gun Violence. Afterward, Ms. Smegielski dabbed tears from her eyes. Mrs. Maisch said she was not surprised. Tina Meins, whose father was killed in San Bernardino, watched the vote from afar she had been here last week to attend a news conference with Senator Christopher S. Murphy, a Connecticut Democrat who held a   filibuster intended to force his colleagues to take up the issue of guns. She, like the others, expected the measures to fail. The life of a   advocate, she said, can be “extremely frustrating. ” And the club is growing. “In San Bernardino, we had 14 families,” Ms. Meins said. “Now we have 49. ”'"}, "time": 1742561671.2020915}