{"duration": 1.7169735431671143, "input_args": {"text": "'NAIROBI, Kenya  —   By 9 a. m. on Monday, clouds of black smoke blotted out the sky. A mountain of tires burned. Roads were blocked. Young men poured into the streets of a slum in Nairobi, gleefully carrying huge, jagged pieces of concrete. In Kisumu, a city on Lake Victoria, witnesses said police officers had fired on a crowd. A    boy was in critical condition after being shot in the back. A demonstrator was killed. For the past several weeks, Kenya’s opposition leaders have turned Mondays into protest days. Now they are threatening to hold demonstrations twice, and soon four times, a week. Many Kenyans are shaking their heads with a sense of fatigue and dread, saying, Here we go again. Kenya is a relatively prosperous, developed and politically tolerant African nation. But elections have not been its strong suit. In the past 25 years, almost every presidential race has been marred by violence the worst one was in   when ethnic rivalries cracked open and more than 1, 000 people were killed, many in deadly protests. Kenya spent years trying to heal its wounds and recover from the devastation, culminating in a tense but more peaceful election in 2013. Despite widespread distrust of the results, the country held together, helping it recapture its image as a bastion of stability in the region. Now, with another election scheduled for next year and the opposition already mobilizing thousands of people, many Kenyans are worried about recent economic gains’ being reduced to char blowing in the wind. “It’s getting very nervy,” said   Satchu, an investment adviser in Nairobi. “The economy crashes and burns when we fumble these elections. What’s worrying is that this is happening so early, that we already have this degree of contestation. ” Each Monday, now known as Tear Gas Monday, many businesses close. Parents do not send their children to school. Motorists stay off the streets, afraid of rocks being thrown through their windshields. The opposition leaders are aware of this part of their leverage is the ability to slow down the economy. A watchman in Nairobi spoke of his “inside fear” of even coming to town on Mondays. The opposition’s rallying point has become Kenya’s election commission. Raila Odinga, a former prime minister who has been angling for president for much of the past two decades, has demanded that the government disband the commission, which is widely viewed as biased and corrupt. A British court recently convicted two British businessmen of bribing Kenyan election commissioners to get contracts for printing ballots. But in Kenya, those same commissioners have not even been charged. This is another problem in Kenya. Almost all corruption cases against powerful people languish for months. Then they quietly disappear. “The government needs to throw out that commission,” said Paul Shida, a welder in the Kibera slums in Nairobi, where the protests began Monday. “Street protest is the only language the government understands. ” The election commission controversy has progressed from an annoyance to a major crisis for Kenya’s president, Uhuru Kenyatta. He is not believed to be especially close to any of the election commissioners, but they were the same ones who validated his victory in 2013 amid allegations of rigging. He has refused to disband the commission, and his security services have threatened to crack down on protesters. But as the protests grind on, a    game is being played between Mr. Kenyatta’s government and Kenya’s judiciary, which many Kenyans regard as independent. Last week, police officials banned an opposition rally in the city’s historic Uhuru Park a court promptly overturned that ban. This weekend, police officials declared again that it was illegal for the opposition to protest and warned that they were ready to use lethal force. They did so in Kisumu on Monday. Witnesses said the police fired indiscriminately at a crowd, hitting the    boy and leaving him in critical condition, and killing a   protester. Also on Monday, a court ruled that the opposition had a right to protest and that the police had a duty to protect demonstrators. Though the violence in the past few weeks has been nothing compared with the paroxysm of bloodshed that swept the country in 2007 and 2008, the dynamics are similar. The nation, and especially its economy, are being held hostage by the relationship between Mr. Kenyatta and Mr. Odinga, who will most likely face off in the election next year. Last week, tensions suddenly lifted after the two met and a picture of them walking together, smiling, appeared on the front pages of the leading newspapers. But the two were soon at loggerheads again, and the protests were back on. Mr. Satchu estimated that at least $5 million was lost every Monday because of interruptions, closed businesses, property destruction and petty crime. On Monday afternoon, Bharat Shah, who runs a Nairobi curio shop, held up a pad of paper with the number 360 scribbled on it, for 360 shillings, less than $4. “That’s what I’ve sold today,” he said with a wry laugh. “One packet of beads. ” Just as in   business leaders have been discreetly meeting with government and opposition leaders, urging them to compromise, for the sake of the economy. “Among international investors, there remains a strong commitment to Kenya as a gateway to this region, and that hasn’t been shaken yet,” Mr. Satchu said. “But surely it will be shaken if this malarkey continues. ”'"}, "time": 1742564547.3772714}