{"duration": 0.13172245025634766, "input_args": {"text": "'President Donald Trump is deciding between two rival ideas  —   one more “kinetic” and the other “less kinetic”  —   for U. S. strategy in Afghanistan, according to a senior White House official. [On one side are the military strategists, who favor a robust U. S. military approach to resolving the    Afghanistan war  —   hitting the Taliban harder and pressuring them back to the negotiating table. It would also include more spending on building the Afghan government’s capacity, and entail more overall funding, troops, and resources.  On the other side are those who want to maintain the current level of troops but limit U. S. involvement in the war. That option would leave it up to the Afghan government and the Taliban to resolve the conflict, but assist the Afghan government with a minimal    mission, also known as “foreign internal defense,” and assist local partners in fighting extremist ideology. It would also include a counterterrorism presence to target   targets. It would take notably longer than the kinetic plan but would be significantly cheaper. “We don’t fight other people’s wars,” the official said. “We help our friends fight their own wars for themselves. ” Earlier this week, details of the more kinetic option leaked to the Washington Post. It would consist of an addition of at least 3, 000 more U. S. troops, and be matched by an increase in NATO forces. It would also loosen military restrictions in fighting the Taliban, and allow the Pentagon, instead of the White House, to determine how many troops are needed and where. It would bring the current number of U. S. troops in Afghanistan to at least 11, 400. That plan has drawn support from defense hawks on Capitol Hill and the Republican foreign policy establishment in Washington. “We need to break what has been described by our commander there as a ‘stalemate’ which is, after 15 years or so, an unacceptable situation that requires a new strategy, one for victory,” said Senate Armed Services Committee Chairman John McCain ( ). But the plan has drawn skepticism from those inside the White House who favor winding down the U. S. presence and argue that more troops won’t resolve the war. The Obama administration’s 2009 “surge” sent 30, 000 troops to Afghanistan in order to pressure the Taliban to come to the negotiating table, but once the administration began to draw down the U. S. presence, the gains reversed. The Taliban now control areas with almost a third of the population. A poll last year showed a growing number of Americans who believed Afghanistan was a vital interest, but less than half surveyed supported staying another year. Three U. S. special operators were killed earlier this year in Afghanistan  —   already a fourth of all forces killed last year. Reducing the U. S. presence in Afghanistan could jeopardize gains made in building the Afghan military and air force crucial to giving them an edge over Taliban forces, and could lead to an increase in Afghan troop casualties, which are already steep. But proponents of the less kinetic plan argue that it’s not up to the U. S. to decide what Afghanistan looks like, and that the U. S.’s interests are fighting terrorists and to prevent another   something that can be achieved with fewer forces. “What Afghanistan looks like is not up to America,” the official said. The U. S. has spent a total of $783 billion on the Afghanistan war between fiscal years 2001 to 2016, and the Obama administration had requested $43. 7 billion for fiscal year 2017, according to a Brown University study published in September. There are currently 8, 400 U. S. troops deployed on a   basis to Afghanistan and 4, 600 NATO forces. Trump now must decide what to do, caught between his competing instincts to spend less on overseas wars and empower his top military advisers. His previous public remarks do not provide much insight into how he will decide. At a campaign rally in Cleveland, Ohio, on September 8, he criticized the amount of spending on wars in Iraq and Afghanistan. “So we’re on track now to spend  —   listen to this  —   $6 trillion  —   $6 trillion. Could have rebuilt our country twice,” he said. “Meanwhile, massive portions of our country are in a state of total disrepair. It’s time to rebuild America. ” He also told the London Times in a January 16 interview: “I just looked at Afghanistan and you look at the Taliban  —   and you take a look at every, every year it’s more, more, more  …    and you say, you know  —   what’s going on? Afghanistan is, is not going well. ” However, he then said, “Now in all fairness, we haven’t let our people do what they’re supposed to do  …    we haven’t let our military win. ” The White House is not offering any clues into how Trump will decide, although Press Secretary Sean Spicer on Tuesday said the U. S.’s “main objective” in Afghanistan is to prevent it from being used as a safe haven for terrorists who attack the homeland, and called it the mission “going forward. ” “That is the main objective. We remain very focused on the defeat of al Qaeda, its associates, as well as the defeat of [Islamic State in Iraq and  ] which is the ISIS affiliate there in Afghanistan. But that is, simply put, what the mission is going forward. ” Trump is expected to make a decision before the next NATO summit in Brussels on May 25. In anticipation of a U. S. troop increase, NATO members have already been considering increasing their troop numbers also. McMaster, who was one of the architects of the Iraq war troop surge and headed an   task force in Afghanistan, is described as the “driving force behind” the more kinetic strategy, according to the Washington Post. Defense Secretary Jim Mattis also backs the plan, according to the Post. McMaster is also connected to masterminds of the surge, former CIA Director and retired Army Gen. David Petraeus, and retired Army Lt. Gen. Jack Keane. Keane praised McMaster at a dinner Tuesday evening hosted by the Washington Institute. U. S. officials told the Post that increases in troop levels and support to the Afghan government would be “heavily conditioned” on the ability of the Afghan President Ashraf Ghani to get rid of ineffective military commanders and reduce corruption. In an ominous sign, an Integrity Watch Afghanistan survey published in December said 71 percent of those surveyed felt corruption had worsened in the past two years. Proponents of the more kinetic plan have modest expectations for the enhanced military effort, according to the Post. The expectations are that Afghan forces would at best be able to “hold the line” this year and begin to recapture some key terrain from the Taliban next year. Their goal is to make “incremental progress” in coming years in order to persuade the Taliban to make concessions that will lead to peace, according to the Post. Not all retired military brass are convinced of the more kinetic option. Retired Army Lt. Gen. Jerry Boykin took to Twitter on Wednesday to express doubt over the plan. “We have been in #Afghanistan for 16yrs and have never had clear objectives  exit strategy.   these, this could cost the #president,” he tweeted. “I do not want #America to spend any more good #soldiers or resources to #Afghanistan pursuing a losing strategy,” he added. “If sent   defined objectives + appropriate ROE, I could be persuaded that this is a viable plan,” he tweeted, referring to rules of engagement. “Right now, I am not convinced. ”'"}, "time": 1742563080.8017323}