{"duration": 0.10587739944458008, "input_args": {"text": "'Patrice Munsel, a coloratura soprano who as a teenager became one of the Metropolitan Opera’s youngest stars and later crossed over into television and musical theater, died on Aug. 4 at her home in Schroon Lake, N. Y. She was 91. Her death was confirmed on Wednesday by her daughter Heidi Schuler Bright. Ms. Munsel was 17 when, in March 1943, she won a Met contract and $1, 000 after tying for first place in the eighth annual Metropolitan Auditions of the Air, a precursor to the Met’s National Council Auditions, a program to discover promising young opera singers and nurture their careers. (The other   winner was Christine Johnson, who originated the role of Nettie Fowler in the Rodgers and Hammerstein musical “Carousel” when it opened on Broadway in 1945.) By November Ms. Munsel had signed a   contract with the impresario Sol Hurok for a guaranteed $120, 000. On Dec. 4, at 18, she made her Met debut as the temptress Philine in Ambroise Thomas’s “Mignon,” wearing a   ring and a crown lent to her by the soprano Lily Pons. The audience gave Ms. Munsel a standing ovation of several minutes. The critics were generally less kind. “For this part her voice is neither sufficiently big, or developed, or brilliant enough,” the critic Olin Downes wrote in The New York Times. “In plain words,” he said, “she was cruelly miscast, in this, one of the most exacting roles in the coloratura soprano’s repertory. ” More than 40 years later, in a Los Angeles Times interview, Ms. Munsel said simply, “I didn’t have a clue as to what the part was about. ” She performed a total of 225 times at the Met, excelling as the maid Adele in Strauss’s “Die Fledermaus” and earning praise from Downes for her “virtuoso singing” and “very amusing acting. ” He declared her born for the role “by personality, wit, temperament. ” Rudolf Bing, the company’s general manager during Ms. Munsel’s tenure, is said to have called her “a superb soubrette. ” But Ms. Munsel had given up touring the moment she became engaged to Robert C. Schuler, an adman turned television producer, whom she married in 1952. Not long after returning from their   European honeymoon, she did a star turn on movie screens as Dame Nellie Melba, the   Australian soprano, in the 1953 biopic “Melba,” produced by the Hollywood legend Sam Spiegel. From there, she strutted her way into the Las Vegas nightclub scene, peeling off a voluminous silk skirt   at the New Frontier in 1955 to reveal a halter and bejeweled pink capris. Two years later, Ms. Munsel embarked on a television career with “The Patrice Munsel Show,” a variety series on ABC, joining guests like Eddie Albert, Andy Williams, Tony Bennett and John Raitt in a mix of light opera and pop, though she admitted to hating “  lyrics. ” It was canceled after one season. Ms. Munsel last performed at the Met in 1958 as Mimi in “La Bohème,” a role she had long coveted. She then focused on motherhood, traveling and musical comedies, performing splits in the 1965 Lincoln Center Theater presentation of “The Merry Widow” and occasionally turning productions of “The Sound of Music” and “The King and I” into family affairs with her four children. Besides her daughter Heidi, two other children survive: another daughter, Nicole Schuler, and a son, Scott Schuler, as well as two grandsons and two  . Her husband, who in 2005 chronicled his   marriage to Ms. Munsel in the book “The Diva  I: My Life with Metropolitan Opera Star Patrice Munsel,” died in 2007. Their son Rhett Carroll Schuler died in 2005. Patrice Beverly Munsil was born on May 14, 1925, in Spokane, Wash. (She later changed the spelling of her surname to Munsel at the Metropolitan Opera’s request.) Her father, Dr. Audley J. Munsil, was a dental surgeon her mother, Eunice Munsil, was a homemaker and an accomplished piano player. Ms. Munsel had a lifelong comedic streak. “I’m sure when I emerged from my mother’s womb, the doctor slapped me, I hit a high C and slapped him back,” she wrote in a biographical sketch on her website. She began studying ballet and tap at 6 and soon, inspired by Walt Disney, decided that she wanted to be a professional whistler. “There were always birds whistling in the background” of films like “Cinderella” and “Snow White,” she explained, “so I decided to whistle my way to Hollywood. ” Her parents, eager to encourage any and all of her artistic aspirations, managed to find her a whistling teacher. But it wasn’t long before listening to Met radio broadcasts convinced her that her true destiny was to become an opera star. By 15 she had moved with her mother to New York, where   voice lessons were supplemented with piano, harmony, theory, French and Italian classes, as well as fencing lessons and gym workouts three times a week. Within two years Ms. Munsel’s vocal coach, Giacomo Spadoni, urged her to audition at the Met, where he was chorus master, and she agreed. “After all, at the age of 17, how long can one wait?” Ms. Munsel wrote. “I stepped on the stage and sang my first aria on the Metropolitan Auditions of the Air without a nerve in my body. I won, and I was on my way to fame and stardom. ”'"}, "time": 1742564402.3149173}