{"duration": 0.03874516487121582, "input_args": {"text": "'“What difference, at this point, does it make?” \\nRemember those infamous and wretched words? Of course you do. We all do. Those were the words uttered by Hillary Clinton when she was desperately trying to spin her way through a committee hearing on Benghazi.\\nAnd as anyone not named Hillary Clinton or anyone not on her corrupt payroll knows, it makes a lot of difference . This because Americans died. They died at the hands of terrorists on Hillary’s watch.\\nNew information is now out about some of the individuals who were paid to guard/protect state department employees at the special missions compound where the terrorist attack occurred and it’s not pretty. Turns out Hillary’s state department spent $9.2 million on a contract for guards, many of whom turned out to be the very terrorists who attacked the compound, killing our ambassador and other Americans in the process.\\nVia Fox News .\\n“Many of the local Libyans who attacked the consulate on the night of Sept. 11, 2012, were the actual guards that the State Department under Hillary Clinton hired to protect the Consulate in Benghazi,” Tiegen told Fox News. “The guards were unvetted and were locals with basically no background at all in providing security. Most of them never had held a job in security in the past.\\n“Blue Mountain Libya, at the time of being awarded the contract by our State Department, had no employees so they quickly had to find people to work, regardless of their backgrounds,” he said.\\nOne former guard who witnessed the attack, Weeam Mohamed, confirmed in an email sent to the Citizens Commission on Benghazi and obtained by Fox News, that at least four of the guards hired by Blue Mountain took part in the attack after opening doors to allow their confederates in.\\n“In the U.S. Mission, there were four people [who] belonged to the battalion February 17,” Mohamed wrote to the Commission, an independent body formed with Accuracy in Media to investigate the attack and the administration’s handling of it.\\nAgain, it makes a lot of difference.\\n'"}, "time": 1742562218.0586557}