{"duration": 0.06083250045776367, "input_args": {"text": "'. Illuminati Banker Unveiled Method of Control In a candid moment after WW1, Kuhn Loeb partner Otto Kahn explained that the Cabalist bankers \"... Print Email http://humansarefree.com/2016/11/illuminati-banker-unveiled-method-of.html In a candid moment after WW1, Kuhn Loeb partner Otto Kahn explained that the Cabalist bankers \"remake\" the world by creating artificial conflicts and determining the outcome. These include world wars, the Cold War , and the \"war on terror\" not to mention the phony \"Left-Right\" divide that holds America in gridlock. \"We shall purify the idea [of God] by identifying it with the nation of Israel, which has become its own Messiah. The advent of it will be facilitated by the final triumph of Israel... \" by Henry Makow Ph.D. Otto Kahn, (1869-1934) was a partner with Jacob Schiff and Paul Warburg in America\\'s most influential investment bank Kuhn Loeb . Thus, it is worth recalling what he said about the Illuminati Jewish strategy.In his book Geneva Versus Peace (1937) the Comte de St. Aulaire, who was the French ambassador to London from 1920-24, recalled a dinner conversation with Otto Kahn which took place shortly after WWI. This shocking expose is fast disappearing down the memory hole. Asked why bankers would back Bolshevism, a system supposedly inimical to private ownership, Kahn tugged on his enormous cigar and explained that the bankers create apparent opposites to \"remake the world\" according to their specifications:\"You say that Marxism is the very antithesis of capitalism, which is equally sacred to us. \"It is precisely for this reason that they are direct opposites to one another, that they put into our hands the two poles of this planet and allow us to be its axis. These two contraries, like Bolshevism and ourselves, find their identity in the International. [Presumably, he means the Comintern .]\"These opposites ... meet again in the identity of their purpose and end in the remaking of the world from above by the control of riches, and from below by revolution.\"Our mission consists in promulgating the new law and in creating a God, that is to say in purifying the idea of God and realizing it, when the time shall come. \"We shall purify the idea by identifying it with the nation of Israel, which has become its own Messiah. The advent of it will be facilitated by the final triumph of Israel... \"Our essential dynamism makes use of the forces of destruction and forces of creation, but uses the first to nourish the second... Our organization for revolution is evidenced by destructive Bolshevism and for construction by the League of Nations which is also our work.\"Bolshevism is the accelerator and the League is the brake on the mechanism of which we supply both the motive force and the guiding power. \"What is the end? It is already determined by our mission. It is formed of elements scattered throughout the whole world, but cast in the flame of our faith in ourselves. We are a League of Nations which contains the elements of all others... Israel is the microcosm and the germ of the city of the future.\" People who presume to take the place of God are Satanists. Satanists redefine reality and morality, turning them upside down. They seek a worldwide political, economic and cultural monopoly institutionalized in a world government.This is achieved by a Hegelian dialectical process of creating adversaries (thesis-antithesis) and achieving a synthesis which corresponds to their goals. In the process, potential opponents are eliminated. COMMUNISM-CAPITALISM In the Red Symphony revelation, insider Christian Rakovsky showed how Communism and Capitalism were part of this dialectical process... In each case, the Illuminati Jewish banking cartel controls all wealth and power.\"In Moscow there is Communism: in New York capitalism. It is all the same as thesis and antithesis. Analyze both. Moscow is subjective Communism but [objectively] State capitalism. \"New York: Capitalism subjective, but Communism objective. A personal synthesis, truth: the Financial International, the Capitalist Communist one. \\'They.\\' \"In the USSR, the State owned the corporations and the bankers owned the State, i.e. State Capitalism. The US also has Communism objectively because the same bankers control most of the corporations. Of course, this is consistent with the famous 1954 quote from Rowan Gaither , (left) President of the Ford Foundation: \"We operate here under directives which emanate from the White House... The substance of the directives under which we operate is that we shall use our grant making power to alter life in the United States such that we can comfortably be merged with the Soviet Union.\" CONCLUSION We are in the final stages of a long-term conspiracy by Cabalist Jewish bankers and their Masonic lackeys to erect a world police state, and to control us by fraud and force (their watchwords).This has been achieved by a contrived \"dialectical process\" best exemplified by World War Two and the Cold War where they fabricated and financed the adversaries. Domestically, the illuminati dialectic is mirrored by George Soros who funds the left , and the Koch Brothers who fund and control the right . Both are Illuminati Jews. The radical Left and Islam are also funded by corporations through the Tides foundation . You can bet that this funding extends to media control through ownership or advertising. It also extends to universities, foundations and think tanks. Mass protests like Occupy Wall Street are part of this false dialectic. This would be real if they demanded: Nationalizing the Fed, creation of debt-free currency and disowning that portion of the national debt created by book entry. Independent investigation of 9-11 and prosecution of those responsible for the attack and the cover-up. All national political campaigns be publicly funded. For the price of one battle cruiser, we could have real democracy. Media monopolies be broken up. NATO (Rothschild) Interventions be stopped. As is, popular resistance is a banker Punch and Judy Puppet Show. I hope I\\'m wrong but I believe Putin\\'s Russia is part of this strategy of control. So is Iran and even China. The Libertarian Movement and the anti-Communist movements of the 1950\\'s were similarly motivated. We have no real political freedom, just as we have no real culture. Everything is designed to advance the NWO agenda , a total economic, political and cultural monopoly by the Illuminati bankers  '"}, "time": 1742628572.2975342}