{"duration": 0.11139512062072754, "input_args": {"text": "'Shannon Sharpe,   of Fox Sports’ “Skip and Shannon: Undisputed,” advised members of the New England Patriots to boycott the visit to the White House they earned by winning Super Bowl LI. [During his Wednesday broadcast, Sharpe and   Skip Bayless discussed the dilemma some members of the Patriots have expressed over their visit to Donald Trump’s White House. During the discussion Sharpe said that the entire team should unite with a boycott and send a message by breaking the Super Bowl championship tradition.  The hosts revealed that two members of the Patriots have already said they won’t be going to Washington both Martellus Bennett and Devin McCourty have announced their intention to skip the team’s White House visit. Sharpe said that McCourtney in particular had given “very sound, resonating ” reasons for his decision.  Sharpe excused his thought to turn the Super Bowl into a platform for Black Lives   politics, insisting that athletes don’t want to “stick to sports” any more. “Athletes in today’s time, we’re starting to see athletes saying ‘I do not only want athletic greatness, I want moral greatness as well.’ See, he’s thinking with his conscience and his heart,” Sharpe said. “A lot of the things going on, a lot of the policies being implemented doesn’t necessarily affect him directly,” Sharpe continued. “He’s financially secure, the NFL pays for his insurance. So currently, he’s really not affected by this  —   but these athletes of today’s time say ‘there’s something greater,’ there’s no more ‘just stick to sports.’ You hear that a lot, Skip. ‘Just stick to sports. ’” Sharpe claimed that many athletes are simply acting like “prudent human beings” and have decided what is going on in American society today is “not acceptable. ” And I cannot in good conscience, although we won this as a team  —   and I would love to share in this moment as a team  —   I cannot in good conscience go. Because what I think this president is standing for, what he’s saying, the policies he’s implementing are harming the minority communities. I am a minority. Whether it be black, the Latino community, the immigration ban, LGBT  —   whatever it may be, you’re starting to see athletes take a much more of a stance. Because in the past, if you had a brand, you were making money, you do not do anything to upset the   or the people that’s buying that product. You keep your mouth shut. Ultimately, Sharpe decided that being on the “wrong side of history” needs to be avoided. Now, with this president, President Trump, in office, he’s going to ask you to ask an honest question of yourself. ‘What side of history do you want to be on?’ Are you going to be on the side of history that’s a bridge and that’s trying to bring people together, or are you a part of the wall, that’s trying to tear people apart? That’s the question that athletes are asking themselves, and you’re starting to see more and more saying ‘you know what? I want to be on the side of history that’s positive, that’s bringing people together. ” Sharpe said that the members of the Patriots refusing to go to the White House “are to be commended. ” Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742562407.3381405}