{"duration": 0.0259706974029541, "input_args": {"text": "'Two former staffers of Hillary Clinton’s unsuccessful presidential run have launched a campaign to try and decrease Donald Trump’s sizeable Twitter following and promote progressive organizations instead. [On Sunday evening, Signal Boost, run by former Hillary Clinton staffers Jess McIntosh and Zerlina Maxwel, unveiled a “call to action,” where they encouraged their readers to unfollow both Donald Trump’s Twitter accounts and to instead “follow someone working towards the progress we all still believe in. ”  The newsletter asked people to announce via Twitter who they have chosen to follow instead of Trump, using the hashtag #MuteMonday, and was consequently endorsed by other former Clinton staffers, former Department of Labor Secretary Tom Perez, as well as actress Jamie Lee Curtis. Día 3 de la Resistencia: Deja de seguir a @realDonaldTrump y @POTUS para #MuteMonday. Sigue a alguien que valga la pena.  —   Jorge_Silva (@Jorge_Silva) January 23, 2017,    And for the most important part of #MuteMonday, we’re going to honor   who are working their hearts out for progress.  —   Tom Perez (@TomPerez) January 23, 2017,  Trending now #MuteMonday unfollowing @realDonaldTrump @POTUS and listening to and following the lead of @CoryBooker! #wisdomfromthepain,  —   Jamie Lee Curtis (@jamieleecurtis) January 23, 2017,  Trump is known for his prolific use of Twitter, regularly using it to convey his opinions and share proposed policies, despite expressing reservations about the service. “Look, I don’t like tweeting, I have other things I could be doing,” Trump said in an interview with FOX News last week. “But I get very dishonest media, very dishonest press. And it’s my only way that I can counteract. ” He currently has 21. 6 million followers on his personal account, and has attained 14. 3 million followers on the official @POTUS account. At the inauguration ball on Friday, Trump asked the audience whether he “should keep the Twitter going or not. ” “I think so,” he said.  You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742561881.0357778}