{"duration": 0.05009889602661133, "input_args": {"text": "\"on November 14, 2016 11:36 pm · \\nIn reaction to Donald Trump’s victory, The Simpsons decided to update their 2000 prediction of a Trump presidency. \\nIn 2000, the show showed a glimpse into the future where President Lisa Simpson inherited an economic mess from “President Trump.” Well, now that fictional story line has become a horrifying reality. \\nHere is The Simpsons new opening with Bart Simpson writing on the chalkboard, “BEING RIGHT SUCKS”: The Simpsons updates its 2000 prediction of a Trump Presidency… #TheSimpsons pic.twitter.com/Myf5rYb9Dj \\n— The Simpsons (@TheSimpsons) November 14, 2016 \\nHopefully, the financial despair the fictional President Trump never becomes a reality, but seeing as he has no experience, is a businessman who’s not as good as he says he is, and The Simpsons have been right thus far, the future’s looking pretty bleak. \\nHere’s the original clip of President Lisa Simpson calling out a Donald Trump presidency for his fiscal fallout and bad economy: \\nEarly on into Trump’s campaign, The Simpsons satirized the reality TV host turned president-elect by having Homer Simpson somehow at the campaign rollout and falling into Trump’s hair. If we could only go back to that moment and enjoy the comedy over reality. \\nNow we have to reap what we’ve sown, or rather what the less than half of voting Americans have sown considering Trump only won with the Electoral College and lost the popular vote to Hillary Clinton in his own words, big league. \\nMost of us with The Simpsons were very wrong with the prediction as well. \\nFeatured image via video screen capture Share this Article! Author: Sarah Sarah is a liberal writer who's been writing and commenting on politics for over 5 years as the Opinionated Democrat on Facebook. She is also the founder and Editor-in-Chief of the online satirical publication Free Wood Post. Search\""}, "time": 1742564121.6498783}