{"duration": 0.0913543701171875, "input_args": {"text": "'Installing a Torture Fan at CIA November 19, 2016 \\nExclusive: The CIA’s torturers can breathe a sigh of relief after President-elect Trump tapped a defender of “enhanced interrogation techniques” to become CIA director, writes ex-CIA analyst Ray McGovern. \\nBy Ray McGovern \\n  Trump’s selection of Kansas Congressman Mike Pompeo, an open aficionado of torture practices used in the “war on terror,” to be CIA director shows that Trump was serious when he said he would support “waterboarding and much worse.” \\nEarlier, there had been a sliver of hope that that, while on the campaign trail, Trump was simply playing to the basest instincts of many Americans who have been brainwashed – by media, politicians, and the CIA itself – into believing that torture “works.” The hope was that the person whom Trump would appoint to head the agency would disabuse him regarding both the efficacy and the legality of torture. Rep. Mike Pompeo, R-Kansas. \\nBut such advice is not likely from Pompeo, who has spoken out against the closing of CIA’s “black sites” used for torture and has criticized the requirement that interrogators adhere to anti-torture laws. He has also opposed closing the prison at Guantanamo, which has become infamous for torture and even murder. \\nAfter visiting Guantanamo three years ago, where many prisoners were on a hunger strike, Pompeo commented, “It looked to me like a lot of them had put on weight.” \\nThere is little doubt that the champagne was flowing on Friday at CIA headquarters, from the seventh-floor executive offices down to the bowels of that building where torture practitioners have been shielded from accountability for 15 years in what amounts to the CIA’s internal “witness protection” program. \\nIndeed, relief over the Pompeo appointment came in the nick of time. For one fleeting moment earlier in the week, there was some panic at the hint that the International Criminal Court might show more courage than President Barack Obama in bringing torture perpetrators to justice. \\nThat suggestion caused a moment of angst up and down the CIA’s ladder of authority, from supervisory felons, such as Director John Brennan and agency lawyers, down to the thugs hired to implement the amateurish but gruesome regime of torture depicted in gory detail in the Senate Intelligence Committee investigative report , \\nPublished in December 2014 and based on original CIA documents, the report’s Executive Summary revealed a range of gruesome practices from the near-drowning sensation of water-boarding to the forcible rectal feeding of detainees. \\nPompeo’s Defense \\nPompeo responded to the findings by personally attacking Senate Intelligence Committee chair Dianne Feinstein. He claimed she had “put American lives at risk” and he called CIA participants in the torture program “heroes, not pawns in some liberal game being played by the ACLU and Senator Feinstein.” Former Rep. Pete Hoekstra (left) argues with ex-CIA analyst Ray McGovern about the Senate torture report on CCTV America’s “The Heat” on Dec. 11, 2014. (Screenshot from program) \\nPompeo seemed to be taking his cue from former chair of the House Intelligence Committee Pete Hoekstra, R-Michigan, who, right after the Senate report was released, boasted to me on live TV that he had been briefed on “90 to 95 percent” of the cruel practices laid bare in the Senate investigation. [See Consortiumnews.com’s “ Clashing Face to Face on Torture .” \\nTorture also has its supporters in the Senate, which will be called on to confirm Pompeo as CIA director. At a Senate hearing on May 13, 2009, Sen. Lindsey Graham, R-South Carolina, gave a tip of the cap to the Spanish Inquisition, which he cited as proof that torture could elicit some useful confessions (as it was used in the Fifteenth Century to detect “crypto Jews” and to burn several thousand heretics at the stake). \\nDuring a hearing on detainee interrogations, Sen. Graham said : “Let’s have both sides of the story here,” pointing out that there could be evidence that torture produced “good information.” Graham added, “I mean, one of the reasons these techniques have survived for about 500 years is apparently they work.” \\nOn Wednesday, I was given nine minutes on radio to comment on the ICC’s tentative move to seek accountability for American torture practices. But Pompeo’s nomination on Friday is sure to dispel the brief moment of anxiety among the CIA’s torturers. \\nCongressman Pompeo is living proof that you can get all A’s at West Point, graduate first in your class, and still flunk the Constitution with its quaint Eighth Amendment prohibition against “cruel and unusual punishment.” Not knowing the Constitution and the Bill of Rights apparently makes you a good pick to head the CIA. \\nAs member of the House Permanent Select Committee on Intelligence (HPSCI), Pompeo also was protective of the National Security Agency’s systematic abuse of the Fourth Amendment’s prohibition against illegal searches and seizures. \\nThe selection of Pompeo came a few days after Vice President-elect Mike Pence told ABC that he would model his handling of the job after former Vice President Dick Cheney under President George W. Bush. \\nThough Pence may have meant Cheney’s assertive role and interaction with Congress, there was also Cheney’s advocacy for “regime change” wars and what the Bush administration called “enhanced interrogation techniques,” which earned Cheney the label from The Washington Post, “Vice President for Torture.” \\nCheney has never been repentant about his aggressiveness in the “war on terror.” “I’d do it again in a minute,” he has declared . \\nReal Expert on Torture \\nYet, even as Bush-Cheney apologists found excuses and euphemisms for torture, Gen. John Kimmons, head of Army Intelligence, told a Pentagon press conference on Sept. 6, 2006 – the same day he knew that President Bush planned to advertise the efficacy of his “alternate set of procedures” – that torture did not result in sound information. President George W. Bush and Vice President Dick Cheney receive an Oval Office briefing from CIA Director George Tenet. Also present is Chief of Staff Andy Card (on right). (White House photo) \\nConceding past “transgressions and mistakes,” Kimmons insisted: “No good intelligence is going to come from abusive practices. I think history tells us that. I think the empirical evidence of the last five years, hard years, tells us that.” (Emphasis added) \\nThat’s also what I learned as a young Army Intelligence officer 50 years ago. Cheney, Hoekstra, Graham, Trump, Pence and Pompeo can keep whistling on the dark side, but there is zero evidence to challenge what Gen. Kimmons had to guts to point out on that important day. The Senate Intelligence Committee report of December 2014 should have long since laid to rest the canard that torture “works.” \\nOn a moral level, I also cannot quite fathom the attitude of Pence – who says, “I’m a Christian, a conservative, and a Republican, in that order” – tolerating torture and torture advocates. If memory serves, Jesus Christ was tortured to death. \\nLest I seem to be coming down too hard on how so many fundamentalist Christians wink at (or applaud) torture, I must concede that – after 9/11 – the growing acceptance of practices like torture, previously widely condemned as totally unacceptable behavior, gained willing acceptance among many non-fundamentalist Christians, as well. \\nMany years ago when I studied ethics at Fordham, New York City’s Jesuit university, I was taught that there was one immutable category called “intrinsic evil,” which included slavery, rape and torture. \\nSomehow, torture slid out of that category when Fordham’s president, Rev. Joseph M. McShane, SJ, succumbed to the “celebrity virus,” and decided to ask alumnus (then-White House aide on counterterrorism and now CIA Director) John Brennan to give the Commencement address in 2012. \\nBrennan had publicly defended the practice of extraordinary rendition (aka kidnaping, most often for torture). Brennan was also on the routing for emails regarding CIA torture procedures. (It is important to note that, without a demonstrated “need to know,” no one is included as an addressee on such delicate matters.) \\nAdding insult to the injury of giving Brennan such an important invitation, he was awarded an honorary doctorate in “Humane Letters” (what might seem like a sick joke), as fellow honoree, Timothy Cardinal Dolan, Archbishop of New York, applauded from the same platform. \\nWhen a number of graduating seniors objected to this profaning of their graduation, President McShane gave a glib gloss on torture and drone killings in these words: “We don’t live in a black and white world; we live in a gray world.” \\n(A group that I helped found, Veteran Intelligence Professionals for Sanity, has written a number of Memoranda on torture and most recently on the CIA’s cover-up of torture , an issue completely neglected in the corporate media.) \\nRay McGovern works for Tell the Word, a publishing arm of the ecumenical Church of the Saviour in inner-city Washington. He served as an Army Intelligence officer and then a CIA analyst for a total of 30 years, and is co-founder of Veteran Intelligence Professionals for Sanity (VIPS).'"}, "time": 1742628338.1019108}