{"duration": 0.09275126457214355, "input_args": {"text": "'CHARLESTON, S. C.  —   The defendant, one of the most vilified police officers in recent American history, stood alone before a judge on Tuesday and made a simple declaration: He would testify in his own defense against the accusation that he had murdered an unarmed black man. Minutes later, that defendant, Michael T. Slager, the North Charleston police officer who shot and killed Walter L. Scott during a traffic stop and foot pursuit, ended nearly 20 months of silence and told a jury that he had been consumed by “total fear” in the moments before he opened fire on April 4, 2015. “I see him with a Taser in his hand as I see him spinning around,” Mr. Slager, 35, said as he described the fatal encounter with Mr. Scott, 50. “That’s the only thing I see: that Taser in his hand. ” But Mr. Slager also conceded that given the benefit of hindsight, the encounter could have ended much differently, with an outcome that did not leave a man dead and a police officer on trial for murder. “Going back 18 months later and looking at everything,” he said, “things could have been different. ” Still, to a prosecutor who was skeptical and sneering during the   Mr. Slager was a lawman with questionable judgment, a selective memory and a finger quick to pull the triggers of his Taser and his handgun. “It seems like you’re not remembering things that are bad for you,” said D. Bruce DuRant, the chief deputy solicitor for Charleston County. Before the jury of 11 white people and one black man, Mr. DuRant accused Mr. Slager of exaggerating the confrontation with Mr. Scott. “You’re starting to make up things as we go along, aren’t you?” he asked. Mr. Slager, who was fired after the shooting, said his recollection of the day was hazy or nonexistent. “I don’t remember everything that happened,” he said. The defense rested its case, and closing arguments were expected Wednesday, after which jurors are to begin deliberations. They will have a trove of evidence to weigh, including a bystander’s recording that showed Mr. Slager firing eight times at Mr. Scott’s back. If found guilty, Mr. Slager could be sentenced to life in prison. The jurors again saw the video,    at some moments, on Tuesday, as the man who recorded it, Feidin Santana, sat in the front row. Mr. Slager insisted that specific facts confirmed by the recording, including that Mr. Scott did not have the officer’s Taser when he was shot, were not apparent amid the stress and commotion of an encounter that occurred after Mr. Scott fled from a traffic stop for a broken taillight. Instead, Mr. Slager said that he thought Mr. Scott was “running for some reason,” and that he felt he was outmatched and “going to lose” the struggle with Mr. Scott. Soon, according to Mr. Slager, Mr. Scott seized the Taser and appeared ready to fire it. “I pulled my firearm, and I pulled the trigger,” said Mr. Slager, who said he suffered from nightmares after the shooting. “I fired until the threat was stopped, like I’m trained to do. ” By the time Mr. Slager squeezed the trigger of his Glock, Mr. Scott was at least 17 feet away, a distance Mr. Slager suggested he did not recognize in the chaos. Mr. Scott, whose family believes he initially fled because of unpaid child support obligations, crumpled to the ground. Not long after the shooting, Mr. Slager dropped his Taser next to Mr. Scott’s body, a decision he could not easily explain on Tuesday, but one that prosecutors view as proof that he was trying to plant evidence to cover up a murder. The murder statute in this state is a decidedly unembellished one: It defines murder as “the killing of any person with malice aforethought, either express or implied. ” Although prosecutors have not brought conspicuous evidence of racial animus on Mr. Slager’s part, they have depicted him as an officer who broke the law and local policies, including one that stipulates that “the preservation of life must always take priority over apprehension of criminals. ” Until the Saturday morning when he killed Mr. Scott, Mr. Slager had not fired his handgun while on duty. But to prosecutors, and to a defense team plainly worried about Mr. Slager’s being seen as a rogue officer, his history of using other types of force could be crucial to the jury. Part of that history, first detailed by The New York Times in May 2015, shows that Mr. Slager often relied on his Taser to defuse a situation. In 2014, for instance, he alone accounted for about 4 percent of Taser use by the police force in North Charleston. Under questioning, Mr. Slager denied that his Taser use was a reflection of his temperament. But he did say that Mr. Scott had behaved in ways that heightened his suspicions and fears. Mr. Slager also said that had he known about Mr. Scott’s limited criminal record  —   he was apparently flagged in a law enforcement database as a wanted person with “violent tendencies”  —   he would not have pursued him alone. As Mr. Slager neared the end of his testimony, he became emotional about the aftermath of the shooting. “My family has been destroyed by this,” he said. “The Scott family has been destroyed by this. It’s horrible. ”'"}, "time": 1742561724.4973052}