{"duration": 0.041818857192993164, "input_args": {"text": "'Originally appeared at Chronicles Magazine \\nIn his latest Sputnik Radio International interview Srdja Trifkovic discusses the Czech Republic government’s establishment of an information unit to counter what it says is pro-Russian, anti-Western and anti-NATO propaganda. “We want to get into every smartphone,” said Milan Chovanec, the Czech interior minister. \\nAudio (unedited verbatim transcript) \\nST: It is strangely reminiscent of the old Soviet times, when any criticism of Soviet policies was termed “anti-Soviet propaganda,” and was ascribed to some mysterious imperialist forces in the West that were out to subvert the Soviet Union and its “Fraternal Community of Socialist Nations.” It is rather funny that—more than a quarter of a century after the end of the Cold War—we see the exact replica of the mindset, and a state-financed reaction, on the side of the so-called liberal-democratic, free-market-oriented, “Western” members of NATO. It is also significant that one of the foremost critics of the Western policies in general, and in Ukraine in particular, is Vaclav Klaus, one of the most respected Czech politicians. \\nMy immediate thought is whether they regard Mr. Klaus—the elder statesman of the Czech Republic—as one of the exponents of the Russian propaganda who needs to be monitored and countered. My second thought is that, ultimately, it comes to the quality of information and analysis. If the makers of this new unit, fighting what they regard as Russian disinformation, are up against certain perfectly justified, rational, and well-reasoned criticism of Western policies, and those of NATO in particular, then they have a big problem. In this time and age, of the mainstream media being confronted by the social media, the Internet, they will have a problem, because the unspoken assumption is that the quality of information and analysis they can offer is better than what they regard as the Russian propaganda. \\nAs it happens, we have this counter-propaganda all the time, in the pages of the New York Times and the Washington Post, on the BBC, the CNN, and every flickering screen and every printed page all over the Western world. And yet . . . they are not doing a very good job. Ultimately, if we are looking at an informed and rational consumer of information, he or she will be able to make an astute judgment of who is in the right and who is actually a propagandist. \\nQ: Srdja, if they consider this to be so important at this particular moment, why is this unit made up of only twenty people? \\nST: It could made up of only two people if they are well informed, capable of top-class analysis, and if they have strong arguments which can be used to counter what they regard as Russian disinformation. It boils down to what I mentioned earlier: the quality of information, and the quality of analysis. \\nQ: Is it going to have any influence on anything at all? \\nST: Ultimately not. Obviously, the same job is being done by much better paid columnists of theWashington Post, the Guardian, Le Monde, the Frankfurter Rundschau—they are all up to the same thing: to discredit arguments against the global empire of the United States and its fellow travelers in Western Europe. If that job is not done much better by people who are paid hundreds of thousands of dollars or euros every year to do it in a systematic and coherent way, I don’t see any way for a bunch of twenty Czech bureaucrats to do it. \\nQ: Let’s get back to the accusations that some Czech politicians have been throwing at Moscow, that they are forming the networks of pro-Russian groups that can be used to destabilize the country. How grounded are these accusations? \\nST: It reminds one of McCarthyism in the United States in the early 1950’s. If you are a “deviant” in your mindset, if you dare criticize the official line, if you say things that are outside the permitted parameters of rightspeak, then you must be an agent for a foreign power. It is a paranoid mindset, it is deeply antidemocratic, and it smacks of Stalinism. This is, of course, Stalinism in a postmodern-liberal guise, but it is not qualitatively different from the original model.'"}, "time": 1742628608.9465473}