{"duration": 0.08006572723388672, "input_args": {"text": "'The ‘victorious’ legacy of the Vietnam War By Emanuel E. Garcia, MD \\n“What’s he talking about?” you might be thinking, “didn’t America lose the war?” \\nI guess it all depends on how you look at it. \\nSure, over 58,000 American soldiers perished , with many more wounded, and over a million Vietnamese fighters and civilians , according to the best estimates, died. And although there is some uncertainty about the actual number of Vietnamese casualties, one thing is certain: their names are not engraved on the Vietnam War Memorial in Washington, DC—an omission which brings “irony” to unimaginable heights. Surely the Vietnamese, whose country committed no infringement against the United States, and whose people were slaughtered whether they took up arms to defend their territory or merely attempted to ply their rice paddies—deserved some acknowledgment. \\nNevertheless, narrative has it that the war—or, since there was never any formal declaration of war, I should more properly say ‘conflict’—was lost and that American pride and the American military and, according to some, the American psyche, suffered a terrible blow. \\nBut in one respect the Vietnamese entanglement proved to have an enduring and efficiently victorious legacy, a legacy moreover that informs the recent escapades in Iraq, Afghanistan, Libya, Syria and the so-called ‘war on terror’. \\nTo explain what I mean, I have to meander a bit into the terrain of human psychology and war, guided by a remarkable book: Lt. Col. Dave Grossman’s On Killing . Grossman makes two cogent observations: (1) there exists even on the fields of war a very powerful and innate human resistance against killing, which armies throughout the centuries have fought to diminish, and (2) it was in Vietnam that the American soldier was “psychologically enabled to kill to a far greater degree than any other soldier in history.” \\nPeople, generally speaking, do not kill easily. Soldiers throughout history have had a hard time killing face to face and very often turned their weapons away. Only an extremely and brutally efficient methodology of deconditioning, which made its appearance in Vietnam, could result in vastly higher ‘kill rates’. In other words, the more distant and dehumanised the enemy is made to seem, the less resistance there is to murder. \\nVietnam, therefore, heralded a great victory of mechanised death and destruction over the inner humanity of individuals; and those techniques, we can be sure, have only been fortified since then by the increasing reliance on long-range bombing, video-game-like machinations from far away, by the rendering of individual human beings who bleed and laugh and cry and suffer into anonymous digits or blips. \\nSo on the one hand, it is a wonderful thing to realise that even in the bloodiest times of war, humankind has struggled to kill at close quarters—that, in fact, no matter how much we are inundated by the press and by the purveyors of violent war games, killing is no easy thing. More often than not, even in the great battles between recalcitrant adversaries, compassion showed its presence. \\nBut compassion seems to have no place in, for example, drone-assassination campaigns that have been ‘legitimised’ by an onslaught of propaganda, with victims that are merely insignificant dots. Killing has been perfected, as it were. \\nIndeed, now that I think of it, the irony of the Vietnam War Memorial is no match for the irony inherent in the fact that the man who has won a Nobel Prize for Peace is the very same individual who has presided over an assassination programme whose distinction is as a kind of apex of dehumanised murder. \\nI hope for a greater victory, however: one that awaits those who fight not against other men and women, but against the organised forces and practices that seek to abolish our humanity by digitising, anonymizing and atomising us when our great and truer essences cry out for love, connection and community. \\nDr. Garcia is an American-born poet, novelist and physicians who resides in New Zealand. This entry was posted in Commentary . Bookmark the permalink .'"}, "time": 1742562281.4199986}