{"duration": 0.0968327522277832, "input_args": {"text": "'GREENVILLE, S. C.  —   Seton Hall guard Khadeen Carrington hit his first   when he was 11. It was in a gym on Paerdegat Avenue in the Canarsie section of Brooklyn. It was a midrange jump shot. His team was down by 1 and won by 1 and, he said, it turned basketball into his duty, not just a game. “It set me up,” he said. “It puts some fuel in it for you where I took basketball more serious, and that’s what I want to do, play basketball. I remember that day going to the park and working on my game, and I kept working and working. ” How long did that feeling from his first   last? “I still have it,” Carrington said. The   is the heart of the N. C. A. A. tournament. It’s a hallmark play, and everyone has a favorite. Lorenzo Charles. Tate George. Tyus Edney. Christian Laettner. If the   shot takes down a favorite (Bryce Drew of Valparaiso, 1998) or delivers a championship (Kris Jenkins of Villanova last year) the celebration is a little louder, the memory a little more enduring. For players, though, draining a   is a benchmark, no matter how young they are. And the setting does not have to be the grand stage of the N. C. A. A. tournament. Arkansas guard Daryl Macon was 14, a freshman at Parkview High School in Little Rock, when he hit a   to send a game into triple overtime. He was not a starter, and he did not even play in that third overtime. But he said he leaned on that moment throughout his high school career. “I was just    as a freshman,” Macon said. “I had my doubts whether I was going to be a player or not. I made that shot and I remember thinking: Maybe I have something. Maybe I have what it takes. “That shot kept me going. Anytime I felt like giving up in high school because I wasn’t getting recruited, I remembered that  . ” Macon went to Holmes Community College and grew into a standout    guard, then joined the Razorbacks’ program this season. On Jan. 24, he had his own   moment when he made three free throws with 1. 6 seconds left to deliver a   win at Vanderbilt. “The floor was shaking under my feet because we were on the road,” Macon said. “I said: ‘Look at the goal, look at the goal. Find tunnel vision. ’” Not all   are the same, of course. Players interviewed here all insisted that the spontaneous dribble and shoot was easier than play stopping and emotions getting a chance to build ahead of   free throws. “It gives you too much time to think,” Carrington said. But the dogma of the   is pretty simple: Do not think, because that is when pressure replaces instinct. Seton Hall junior Desi Rodriguez had his   moment at age 12, while he was in middle school in the Bronx. He made a layup to give his team a   victory. “I started taking basketball more serious from there,” Rodriguez said. “I felt I was good at it. I felt I was getting better. A moment like that wakes you up a little. That was my only one. ” But what of the player who misses the  ? Princeton’s Devin Cannady had an open   that would have lifted the Tigers over Notre Dame in the first round on Thursday. The shot was similar to one he had once made to win a high school game. But this one clanged off the rim and the Irish won,  . “I didn’t think about a March Madness moment,” Cannady told reporters. “It was a good look. It’s a shot I’ve taken before. But the ball didn’t fall like I wanted it to. ” Duke’s Jayson Tatum also remembers a   that didn’t fall, during a playoff game when he was a high school sophomore. His team’s season ended with the miss. “That was a tough one to miss because you have to wait until the next year,” Tatum said. “But it’s just one game. It doesn’t define your career. You keep shooting. I was just 15. I have a lot of basketball to go. ” Sometimes the vanquished have to live with a   for a lot longer than that. It is well known that North Carolina guard Nate Britt lives in the same house in Upper Marlboro, Md. with Villanova’s Jenkins. Britt’s parents are Jenkins’s legal guardians. And it was Jenkins who took down Britt and North Carolina at the buzzer in last year’s national championship game in Houston. When he came home from school last summer, Britt found that his parents had commemorated the moment by putting up pictures of the winning shot near where the family eat their meals. “There is a picture on the wall of the shot,” Britt said. “I don’t eat at my table anymore, partially because of that. ”'"}, "time": 1742562049.0947285}