{"duration": 0.056340694427490234, "input_args": {"text": "'Ikea crea un carril rápido para solteros LOS CLIENTES CON PAREJA PODRÁN USAR EL CARRIL A LA TERCERA DISCUSIÓN, CUANDO LA RUPTURA SEA IRREVERSIBLE solteros \\nCon el fin de que las parejas que discuten y bloquean los pasillos no ralenticen a los clientes solteros, el fabricante de muebles Ikea ha decidido habilitar un carril rápido para solteros en todos sus establecimientos. “Muchos se quedaron sin pareja tras una visita a Ikea, es lo mínimo que podemos hacer por ellos”, ha declarado esta mañana Tolga Öncü, director general de Ikea Ibérica y lámpara de techo. \\n“Las discusiones matrimoniales en los pasillos solían crear embudos y se formaban largas retenciones que en ocasiones colapsaban varias secciones”, constata Godmorron Martínez, de la sección de dormitorios. “Con tantas aglomeraciones se perdían muchos niños y luego había que reutilizarlos como muebles o cajeros”, asegura Isfjorden Rodríguez, de menaje. \\nAsimismo, la empresa ha construido una rotonda en la sección de plantas para facilitar la incorporación de los solteros a la línea de cajas y, con el objetivo de evitar que algún marido se aproveche de la iniciativa, los clientes que entren con pareja sólo podrán sumarse al carril de solteros tras la tercera discusión, cuando la ruptura de lazos afectivos sea irreversible. Un asesor matrimonial a sueldo de la empresa será el encargado de dictaminar si la pareja está completamente rota o si todavía está abierta a una segunda oportunidad. \\nA partir de ahora, los solteros que se conozcan en Ikea podrán intimar en las camas de la sección de dormitorios con la idea de que acaben formando una nueva pareja que vuelva a Ikea y acabe rompiendo en el establecimiento, perpetuando así el ciclo de enamoramiento y ruptura que ha convertido la empresa en líder de su sector.'"}, "time": 1742562182.95312}