{"duration": 0.16152501106262207, "input_args": {"text": "'Donald John Trump defied the skeptics who said he would never run, and the political veterans who scoffed at his slapdash campaign. He attacked the norms of American politics, singling out groups for derision on the basis of race and religion and attacking the legitimacy of the political process. He ignored conventions of common decency, employing casual vulgarity and raining personal humiliation on his political opponents and critics in the media. And in the ultimate act of defiance, Mr. Trump emerged victorious, summoning a tidal wave of support from less educated whites displaced by changes in the economy and deeply resistant to the country’s shifting cultural and racial tones. In his triumph, Mr. Trump has delivered perhaps the greatest shock to the American political system in modern times and opened the door to an era of extraordinary political uncertainty at home and around the globe. The slashing, freewheeling campaign that took him to the doorstep of the White House replicated a familiar pattern from Mr. Trump’s life, but on an Olympian scale. The son of a wealthy real estate developer in Queens, Mr. Trump, 70, spent decades pursuing social acceptance in upscale Manhattan and seeking, at times desperately, to persuade the wider world to see him as a great man of affairs. But Mr. Trump was often met with scoffing disdain by wealthy elites and mainstream civic leaders, culminating in a mortifying roast by President Obama at the White House Correspondents Dinner in 2011. So Mr. Trump fashioned himself instead as a proudly garish champion of the common man  —   a person of unsophisticated tastes but distinctive popular appeal  —   and acted the part in extravagant fashion, first in the New York tabloids and then on national television. He became a pundit of sorts, fulminating against crime in New York City and international trade and Mr. Obama’s legitimacy as president, often in racially incendiary terms. His candidacy unfolded in much the same way: as the rampage of an aggrieved outsider, aligned more with the cultural sensibilities of   whites than with his peers in society. On the first day of his run  —   June 16, 2015  —   Mr. Trump drew a direct parallel between his determined quest for success in New York and his entry into the political arena. Addressing a crowd made up largely of reporters in the atrium of Trump Tower, Mr. Trump noted that political seers had predicted, “He’ll never run. ” Seconds later, he mused that his father, Fred Trump, had urged him never to compete in “the big leagues” of Manhattan. “‘We don’t know anything about that. Don’t do it,’” Mr. Trump quoted his father as saying. “I said, ‘I’ve got to go into Manhattan. I’ve got to build those big buildings. I’ve got to do it, Dad. I’ve got to do it. ’” Powered by that same grasping ambition, Mr. Trump’s candidacy was marked by countless missteps and grievous errors, from the crude and meandering speeches he delivered daily, to the allegations of sexual assault that appeared to cripple him in the final weeks of the race. No other presidential candidate in memory has given offense so freely and been so battered by scandal, and lived to fight on and win. Amid all his innumerable blunders, however, Mr. Trump got one or two things right that mattered more than all the rest. On a visceral level, he grasped dynamics that the political leadership of both parties missed or ignored  —   most of all, the raw frustration of   and   white voters who rallied to his candidacy with decisive force. Mr. Trump rallied them less with policy promises than with   pronouncements  —   against foreign trade, foreign wars and foreign workers. He left his Republican primary opponents agog at his dismissals of mainstream policy, and exposed a yawning breach between the program of tax cuts and fiscal austerity favored by traditional conservatives, and the preoccupations of the party’s rank and file. Ridiculed by critics on the right and left, shunned by the most respected figures in American politics, including every living former president, Mr. Trump equated his own outcast status with the resentments of the white class. Even the invective and incivility that appalled the traditional guardians of political discourse seemed only to forge a tighter bond between Mr. Trump and his inflamed following. He dismissed American social norms as mere “political correctness,” mocking the physical appearance of an opponent’s wife, savaging Hillary Clinton’s marriage and wielding stereotypes of racial minorities  —   all to the applause of his base. In sum, Mr. Trump offered himself to the country as a tribune of white populist rage, and pledged at the Republican National Convention in Cleveland to defend “the   factory workers and the communities crushed by our horrible and unfair trade deals. ” “These are the forgotten men and women of our country,” Mr. Trump said. “People who work hard but no longer have a voice. ” He pledged: “I am your voice. ” The message resonated especially in the Midwest, where a stunning victory in Ohio helped give Mr. Trump the Electoral College votes he needed to win. But his ultimate triumph was driven less by region than by race and class. His winning coalition consisted of restive whites and scarcely anyone else. Mr. Trump’s winding path to the presidency began 10 miles east of the spot where he would build Trump Tower, in the wealthy Queens enclave of Jamaica Estates, where his father’s   real estate empire granted Mr. Trump an easy entry into the world of construction and development. He showed little interest in politics as a young man, obtaining deferments to avoid fighting in the Vietnam War but declining to participate in the protest movements of that era. He found his way into the political arena by way of his commercial interests and social aspirations: Under the tutelage of Roy Cohn, the legendary and infamous former adviser to Senator Joseph McCarthy of Wisconsin, Mr. Trump made himself a presence at   events and political conventions. As early as the 1980s, he insinuated himself into the company of leaders in both parties, giving money to Ronald Reagan as readily as to Mario M. Cuomo, the liberal governor of New York. But while Mr. Trump earned headlines at that stage mainly for his romantic escapades and business failures  —   a lurid divorce from his first wife, Ivana, and a series of corporate bankruptcies  —   even then he gave hints of loftier political goals. In the   to the 1988 presidential campaign, he traveled to New Hampshire to give a speech warning of foreign threats to American economic power. The next year, Mr. Trump stirred fierce controversy in New York by calling loudly for the institution of the death penalty, in the aftermath of a brutal assault and rape in Central Park, though the five young men charged with the crime were later exonerated. Still, even as he began to campaign in the early presidential primary states, blasting Mexican migrants in acid language and demanding a shutdown of Muslim immigration into the United States, Mr. Trump never entirely shed his image as a boastful but ultimately benign showman. Republicans of august political lineage, like Jeb Bush, derided him as “an entertainer,” and trusted, in the face of mounting evidence to the contrary, that voters would discard him as such in the end. Democrats, too, who viewed Mr. Trump as plainly unelectable from the start, acknowledged at times that they might have been wrong to sneer at him early on. Hillary Clinton, appearing on NBC’s “Late Night With Seth Meyers” last winter, noted that Mr. Trump had initially provoked “hysterical laughter,” before his call for a crackdown on Muslims. “I no longer think he’s funny,” Mrs. Clinton said.'"}, "time": 1742562187.5621536}