{"duration": 0.07897067070007324, "input_args": {"text": "'See Dems accept foreign cash to disrupt Trump rallies Undercover footage catches Hillary operative red-handed Published: 7 mins ago About | | Archive Bob Unruh joined WND in 2006 after nearly three decades with the Associated Press, as well as several Upper Midwest newspapers, where he covered everything from legislative battles and sports to tornadoes and homicidal survivalists. He is also a photographer whose scenic work has been used commercially. Print \\nA Hillary Clinton-supporting advocacy organization had no trouble accepting a $20,000 donation funneled through a Belize bank to use in this year’s presidential election campaign – until its decision was about to be made public in a series of undercover videos by James O’Keefe’s Project Veritas Action. \\nSuddenly, the head of the organization expressed suspicion about the donation’s overseas origin and decided to return it. \\nThat’s one of the significant revelations in the latest in a series of videos released by O’Keefe called “Rigging the Election.” \\nO’Keefe explained he had a fictitious donor meet with Bob Creamer, who was a staffer at Americans United for Change, a group supporting Clinton for president, until the videos started appearing last week. \\nHe said Creamer, who boasted of working directly for the Clinton campaign, directed that the $20,000 donation go to AUFC “to disrupt rallies and fund bracketing ops.” \\nO’Keefe said he and his colleagues were very careful not to violate the law themselves. \\nCreamer was clear about his ties to Clinton, stating, “Every morning I am on a call at 10:30 that goes over the message being driven by the campaign headquarters.” \\nSign the precedent-setting petition supporting Trump’s call for an independent prosecutor to investigate Hillary Clinton! \\nProject Veritas’ first video explained how the Clinton campaign uses “hidden connections” to incite violence at Donald Trump rallies. Its second video showed plans for step-by-step voter fraud and the third exposed “prohibited communications” between Hillary Clinton’s campaign, “the DNC and the nonprofit Americans United for Change.” \\nThe fourth video “breaks down the process of the long-term investigation.” It comes after Creamer’s announcement that he was stepping down from campaign responsibilities. \\nO’Keefe and Project Veritas Action have filed a complaint with the Federal Election Commission. \\nAmong the revelations in the latest video was Creamer was boasting of his close links to President Obama. \\n“Oh, Barack Obama’s was the best campaign in the history of American politics, I mean the second one, I mean the first was good, too. I was a consultant to both, the second one, was everything hit on every level and every aspect,” he said. “He’s a pro, I’ve known the president since he was a community organizer in Chicago.” \\nWhen asked whether a potential donor could meet Obama, Creamer said: “OK, you may have a lot more opportunity once he is done in 98 days, 97. I was just at an event with him in Chicago, Friday of last week, he is just as good as ever. I do a lot of work with the White House on their issues, helping to run issued campaigns that they have been involved in. I mean, for immigration reform for the … the health care bill, trying to make America more like Britain when it comes to gun violence issues.” \\nExplained Project Veritas: “The more that was promised to Creamer, the more access Project Veritas Action journalists seemed to get. Project Veritas Action’s $20,000 investment paid off. The story was solid. Robert Creamer, Scott Foval, Jenna Price from the DNC, Brad Woodhouse from AUFC, Cesar Vargas and others opened the door to their smoke filled rooms of illegal and dirty campaign dealings, as seen in the three previous PVA videos.” \\nIn the first video, Foval, a Democratic operative, boasted of what he called “conflict engagement,” or sending protesters to disrupt Trump events. \\n“We’re starting anarchy here,” he said. “And he needs to understand that we’re starting anarchy.” \\nIn the second video, Creamer explained Clinton’s direct control over those disruption operations. \\n“In the end it was the candidate, Hillary Clinton, the future President of the United States, who wanted ducks on the ground, so by god we would get ducks on the ground,” Creamer said. \\nCreamer, the husband of Democratic Rep. Jan Schakowsky of Illinois, has starred in several of the undercover videos. \\nHere’s the third: \\nThat video also revealed a direct conflict between what Creamer was confirming – Clinton’s active involvement in such decisions and campaigns – and the claim of her campaign manager, Robby Mook. \\nMook told CNN over the weekend that there was no pathway between the activists staging violence and Clinton. \\nSign the precedent-setting petition supporting Trump’s call for an independent prosecutor to investigate Hillary Clinton! \\n“These individuals no longer have a relationship with the DNC,” he said. “They’ve never had a relationship with the Clinton campaign and my understanding is that the events that are referenced happened I think in February of last year. \\n“They did not have a contract with the DNC until June. But putting all that aside, this was again a video that was leaked out with the purpose of damaging the campaign, it is edited so we don’t know what the full context is. And there’s no evidence whatsoever … that anyone ever did anything like this when they were working for the DNC.” \\nHis comments: \\nAfter confirming it was Clinton or “wanted ducks on the ground,” Creamer warned undercover Project Veritas journalists, “Don’t repeat that to anybody.” \\nCreamer ran Democracy Partners, a consulting company with ties to Clinton. \\nHe has been to the White House 342 times while Obama has been president, including 47 meetings directly with Obama. \\nO’Keefe’s organization reported that the coordination between the campaign, the DNC and the Americans United for Change “smacks of illegal coordinated campaign expenditures.” \\nLast week , Project Veritas filed a complaint with the Federal Election Commission asking for an investigation into the Clinton campaign’s “criminal conspiracy.” \\nThe filing of the complaint with the federal agency follows the release of two videos in which Democrats explain how they can attempt to change the outcome of the election through apparently fraudulent means, such as having people travel across state lines to vote illegally. \\nThe video have resulted already in two Democratic operatives losing their jobs. \\nEditor’s Note: Be aware of offensive language throughout videos and in quotes from videos. \\nOne is Scott Foval, who had worked for People for the American Way, a George Soros-funded group, and more recently with Americans United for Change. \\nIn the video, he said: “You know what? We’ve been busing people in to deal with you f—ing a—–es for 50 years, and we’re not going to stop now.” \\nAlso, he said he and his agents are “starting anarchy” by creating “conflict engagement … in the lines at Trump rallies.” \\nAlso out of work is Creamer. \\nSee the second video: \\nTalk-radio icon Rush Limbaugh said the evidence is worrisome. \\n“Every Trump rally would feature none of this [violence] unless the Democrats were paying for it. I think it’s a big deal, folks. The media is complicit. They know who these people are. … They’re in on it. They’re part of the game. … None of it’s organic. None of it’s natural. None of it’s real. Every bit of it is bought and paid for. \\n“[Democrats] can’t leave elections to chance because they know that, despite the way it may look, the majority of Americans would not support them if they knew who they are.” \\nThe first video:'"}, "time": 1742628464.557988}