{"duration": 0.0881352424621582, "input_args": {"text": "'Russia Today reports: \\nRT Arabic’s crew in Aleppo reports 36 cases of suffocation. \\n“A couple of hours ago we received some 35 patients, all mildly hurt. Their symptoms match those that appear when a person is poisoned by chlorine gas,” doctor Yazan Sarmani told Ruptly at Al Razi hospital in Aleppo. \\n“The victims are soldiers but there are also civilians among them. They all suffered from chlorine gas [poisoning], that is why they showed intensive lacrimation and breathing difficulties. We took care of them, administered oxygen and gave them medicine. Some of them had to be hospitalized,” he added. \\nAl-Mayadeen earlier reported that all the victims of the attack are civilians. \\n“The symptoms the victims showed were the same, but of different severity: watery eyes, frothing at the mouth, vomiting, nausea. All were either lightly or mildly hurt,” doctor Zahir Hamdi Hadzhu, a medical examiner from Aleppo, also told RT Arabic over the phone. “We asked some victims what they smelled… Their responses were the same: after the fall of the shell they [smelled] the odor which is often met at swimming pools.” \\n“The symptoms and the smell indicate that chlorine gas was used. The final confirmation will be available after lab tests,” he said, adding that there may be more than 40 victims of the gas attack, as patients keep coming in. \\nMilitants reportedly used the poisonous gas in an attack on the Assad Military Academy in the Assad Suburb in western Aleppo, as a part of a broader offensive against government positions in the city which was launched on Friday. \\nVictims at the hospital described the gas attack to Ruptly video agency. \\n“They fired at us from mortars and attacked our positions with armored vehicles. We were circled. Shells were falling like rain. They also fired some poisonous substance at us. Then we were brought here,” a man wearing army camouflage said. \\n“The whole world should now see what is going on in the south-western part of Aleppo where the terrorists are using the chemical weapons again,” says political analyst Bassam Abdullah. “We should know that we are in front of terrorist groups, not moderate opposition, which are not respecting international law. Every day and night they are attacking the western part of Aleppo, while at the same time, the Syrian Army with the Russians… opened aid exits for civilians from the eastern part to go outside. We know that terrorists are preventing anyone to leave the eastern part of Aleppo.” \\nIt is not yet confirmed what gas was used in the attack, but Al Mayadeen claims that fighting near the academy continues. \\nThe head of the political office of the Aleppo-based rebel group Fastaqim denied the report of gas being used in the attack, according to Reuters. \\nAccording to RT reporter Murad Gazdiev, who is in Aleppo, nine people were killed and 50 more injured in militant shelling on Sunday morning. \\n“As part of this rebel offensive in Aleppo we are also hearing that they are utilizing suicide bombers. Four apparent infiltrators blew themselves up inside Aleppo city,” Gazdiev said. \\nHe added that 10 other similar cases are said to have occurred at the frontline with “armored personnel carriers, trucks packed with explosives blowing their way through the Syrian defenses.” \\nRebels launched a major offensive against government forces in Aleppo this week, attempting to break the siege on the eastern part of the city which they now control. Rebels from various groups are taking part in the assault, including those fighting under the FSA (Free Syrian Army) banner and Islamist militants. \\nLast week, Russian and Syrian government forces halted strikes on the rebel-held positions in the city, hoping the initiative would lead to a long-awaited ceasefire. But according to military intelligence, militants used this period to transfer reinforcements to the area of Khan Tuman in the south and Kafr Hamra in the north of Aleppo, amounting to about 8 thousand fighters. \\nThe Syrian government has been recently accused of using chemical weapons, including chlorine gas, in its attacks on militants. Several reports by the Organization for the Prohibition of Chemical Weapons (OPCW) and the UN’s joint Investigative Mechanism (JIM) claimed that Syrian Arab Air Force helicopters used chemical weapons in a number of cases in 2014 and 2015. Moscow, however, dismissed these accusations, pointing to the lack solid proof and substantiated evidence that it was in fact the Syrian Army that conducted the attacks in question. The use of chlorine as a weapon is prohibited under the 1997 Chemical Weapons Convention, which Syria joined in 2013, after a Russian diplomatic effort. In January of that year, OPCW confirmed the destruction of all chemical weapons declared by the Syrian Arab Republic.'"}, "time": 1742561998.353149}