{"duration": 0.06703543663024902, "input_args": {"text": "'Posted on October 30, 2016 by Carol Adl in News , US // 0 Comments \\nBernie Sanders sent a letter to President Barack Obama on Friday requesting that he intervene to protect Native Americans who have been peacefully protesting the Dakota Access Pipeline. \\nIn a statement issued on his official U.S. Senate website, Sanders asked Obama to halt construction of the pipeline until federal officials properly conduct a cultural and environmental review. Recommended \\nPresident Barack Obama has sneakily approved the construction of two new Dakota pipelines just as the DoJ halted the construction on the existing one. (1 hour ago) \\nAt least 140 people were arrested at the construction site on Wednesday after hundreds of police in riot gear moved in with tanks, using sound cannons, pepper spray and rubber bullets. \\n\\nSanders.Senate.gov reports: \\nHundreds of Native American protectors have gathered at the site since April to protest the pipeline’s construction on land they claim is tribal under the 1851 Treaty of Fort Laramie. \\n“I urge you to take all appropriate measures to protect the safety of the Native Americans protesters and their supporters who have gathered peacefully to oppose the construction of the pipeline,” Sanders wrote in the letter. Recommended \\nBernie Sanders joined protests in support of Native American activists who are striving to stop construction of a North Dakota pipeline. (1 hour ago) \\nSanders asks that President Obama direct the Justice Department to send observers to the site to protect protestors’ safety and First Amendment rights; call North Dakota Governor Jack Dalrymple to remove the National Guard from the protest camp; and direct the Army Corps of Engineers to issue an order to stop work on construction of the pipeline near the protest site to reduce tensions while awaiting judicial action. \\nSanders again called on the president to suspend construction of the pipeline until the Army Corps of Engineers completes a full cultural and environmental review. \\n“It is deeply distressing to me that the federal government is putting the profits of the oil industry ahead of the treaty and sovereign rights of Native American communities,” Sanders wrote. “Mr. President, you took a bold and principled stand against the Keystone pipeline – I ask you to take a similar stand against the Dakota Access Pipeline.” \\nSanders previously called on the president to block construction of the pipeline during a rally outside the White House with leaders of the Standing Rock Sioux tribe and other tribal nations in September.'"}, "time": 1742561670.8183832}