{"duration": 0.03158831596374512, "input_args": {"text": "'Kathy Griffin held a press conference Friday morning to address her   shock photo of a “beheaded” President Donald Trump, telling reporters that the Trump family has tried to “ruin” her in the wake of the controversy and vowing to continue to make fun of the president. [Standing next to her attorney Lisa Bloom, the    My Life on the   star said the firestorm generated by the photograph  —   after which she was fired from CNN and had at least five scheduled performances cancelled  —   would have never occurred had the photograph been taken by a male artist.  “I don’t think I will have a career after this. I’m going to be honest, he broke me,” Griffin said as she began to choke up. “If you don’t stand up, you get run over,” she added. “What’s happening to me has never happened ever in the history of this great country. Which is that a sitting president of the United States and his grown children and the First Lady are personally, I feel, personally trying to ruin my life forever. ” “He picked me, I’m the easiest target,” she continued. (Watch: Press conference begins at the 40:22 mark) Griffin said the widespread backlash she has faced over the photo is part of a sexist campaign to destroy her career. “It’s a bunch of white guys trying to silence me,” she said. “This wouldn’t be happening to a guy. This is a woman thing. ” Griffin told reporters that the process of preparing for the photograph took just minutes, and was intended to be a parody of the president’s comments about former Fox News anchor Megan Kelly, when he said last year after a presidential debate that the anchor “had blood coming out of her eyes, blood coming out of her whatever. ” “I said let’s get in trouble, let’s give them something to talk about,” Griffin recalled, adding that she “never imagined it could be misinterpreted. ” During the press conference, Griffin was asked about a report that claimed Trump’s youngest son,    Barron Trump, was traumatized by the image after he saw it on television, because he did not know who Griffin was or the context in which the photograph was taken. “Allegedly” traumatized, Bloom replied. “You’re assuming everything the Trumps say is true. ” Griffin, for her part, said she “would never want to hurt anyone, especially a child. ” The comedian reiterated that she meant what she said in her apology video earlier this week, in which she said the image  —   taken by L. A.  photographer Tyler Shields, who has since defended the work  —   had gone “too far” and that she had “crossed a line. ” But Griffin added that she would continue to make fun of the president in the wake of the controversy. Another attorney for Griffin confirmed during the press conference that the Secret Service had opened an investigation into the circumstances surrounding the photo shoot. Reaction to the press conference came swiftly on Twitter, as “Lisa Bloom” began trending on the social media platform Friday morning. Some observers said the press conference was not effective from a crisis management perspective. Lisa Bloom just failed the first rule of being an attorney: never take a question you don’t already know the answer to.  —   Emily Zanotti (@emzanotti) June 2, 2017,  So Kathy Griffin was a victim of sexism! Of course! I just thought she posed with a disgusting beheaded image of the President. pic. twitter.   —   Piers Morgan (@piersmorgan) June 2, 2017,    Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742628474.6281905}