{"duration": 0.021507978439331055, "input_args": {"text": "\"\\nIt might seem strange for a parent to give thanks for a birth defect. \\nHowever, in the case of one baby girl, being born with an extra digit might have saved her life. Image Credit: Flickr CC/ Lars Plougmann \\nAccording to PopSugar , the newborn girl appeared perfectly healthy at birth— with one exception. Her tiny hand included an extra thumb. \\nLove What Matters posted a photo of the baby girl on its Facebook page: Loading Facebook Post... \\nAs the newborn's parents explain, that third thumb earned their daughter some extra medical tests. And those extra tests led to an important discovery. They write : \\n“Quincy has an extra thumb, which now we realize was a blessing in disguise. If she wouldn't have had this anomaly (along with her missing kidney), they never would have sent us to see a geneticist who referred us to a cardiologist. It was at her first cardiology appointment that we found out she has a congenital heart defect that will require surgery.” \\nAccording to the National Institutes of Health , congenital heart defects affect approximately one out of 8,000 newborns, but can have few symptoms. It is even possible for doctors to miss the signs of a heart defect during a physical exam. Left untreated, a severe heart defect can lead to heart failure. However, with proper medical care, children with heart defects can go on to live healthy and active lives. \\nIronically, from the moment her mother first saw the extra thumb, she called it her daughter's “heart thumb.” Though she didn't realize it at the time, that nickname would be a perfect way to describe her “lucky” extra digit: \\n“When Liv saw her thumb for the first time, she told us it was her heart thumb. If we would have only known how right she was! Quincy is our little heart warrior!” \\nAffectionately calling Quincy their “little heart warrior,” her parents say they are fortunate that this “strong, beautiful baby” belongs to them. \""}, "time": 1742564251.2571728}