{"duration": 0.04714536666870117, "input_args": {"text": "'Gov. Chris Christie of New Jersey lied to reporters when he said he did not believe any senior member of his staff knew about the plot to block traffic to the George Washington Bridge, one of his aides told a colleague in a text message included in a federal court filing on Wednesday. “Are you listening?” the aide, Christina Genovese Renna, texted a colleague while Mr. Christie spoke at a news conference. “He just flat out lied,” Ms. Renna wrote. Then she added that if certain emails were discovered, “it could be bad. ” Ms. Renna’s text exchange, submitted as part of a filing in United States District Court in Newark, is the first piece of evidence to surface that suggests that Mr. Christie may have known more about the scheme than he has admitted. A former ally of the governor, David Wildstein, who pleaded guilty to two counts of conspiracy in the case, has contended that evidence exists to show that Mr. Christie knew about the plot as it was being carried out. But Ms. Renna is the first former member of Mr. Christie’s staff to accuse him of lying about the matter. Ms. Renna sent the texts on Dec. 13, 2013, as Mr. Christie was fielding questions from reporters about his knowledge of the  scheme to tie up traffic three months earlier on the New Jersey side of the bridge. The filing was made by lawyers for Bill Baroni, who was Mr. Christie’s top executive appointee at the Port Authority of New York and New Jersey, which operates the bridge. Federal prosecutors contend that two lanes leading to the bridge were abruptly closed to punish the Democratic mayor of Fort Lee, N. J. for declining to endorse Mr. Christie’s bid for  . Mr. Baroni and Bridget Anne Kelly, a former deputy chief of staff to Mr. Christie, a Republican, are scheduled to stand trial in the case next month. Mr. Christie, speaking to reporters Wednesday morning after filling in as a host of a sports talk radio show in New York City, disputed Ms. Renna’s claim, according to The Associated Press. “I absolutely dispute it,” he said. “It’s ridiculous. It’s nothing new. There’s nothing new to talk about. ” But the text messages from Ms. Renna had not come to light before Wednesday, even when she testified before a legislative committee in Trenton that was investigating the scheme. During that testimony, in May 2014, Ms. Renna said she had deleted an email at the request of Ms. Kelly, who was her superior. But Ms. Renna made no mention of the text messages, nor did she turn them over to the committee. “All available information strongly indicates that Ms. Renna deleted those texts and never turned them over to the Legislature or the U. S. Attorney’s Office,” the court filing states. It is unclear when they were deleted and whether it was before or after federal prosecutors announced on Jan. 9, 2014, that they were investigating the matter, the filing states. That was weeks after the legislative committee issued subpoenas to seven people, including Mr. Baroni and Mr. Wildstein. The day after those subpoenas were issued, Mr. Christie held a news conference and said he had been assured by his senior staff members that they had been unaware of any plot to punish Mark Sokolich, the mayor of Fort Lee. Mr. Christie said his campaign chief, Bill Stepien, had also vowed that he had no knowledge of such a plot. “Oh, yeah, I’ve spoken to Mr. Stepien, who’s the person in charge of the campaign, and he has assured me the same thing,” Mr. Christie said during the news conference. That is when Ms. Renna texted Peter Sheridan, a member of Mr. Christie’s campaign staff, suggesting that the governor was not telling the truth. “He just flat out lied about senior staff and Stepien not being involved,” she texted. Mr. Sheridan responded that Mr. Christie was “doing fine” and “holding his own up there,” according to the filing, which says that Mr. Sheridan turned over the messages. Ms. Renna replied: “Yes. But he lied. ” Kevin Marino, a lawyer for Mr. Stepien, said in a statement that any suggestion that his client was “involved in a conspiracy to close access lanes to the George Washington Bridge based on a text message exchange that has been in the government’s possession for years is categorically false and irresponsible. ” The revelation of Ms. Renna’s text messages may pose a legal problem for her, said John S. Wisniewski, a Democratic assemblyman who was a leader of the committee that investigated the matter. Mr. Wisniewski, a lawyer, said the messages should have been provided to the committee, which asked for all relevant documents. “In my opinion, there’s an issue for her in having intentionally destroyed evidence,” Mr. Wisniewski said, citing a New Jersey statute that makes it a crime for a person to destroy a record to make it unavailable to an official investigation. At the time, the committee was more concerned with Ms. Renna’s deleted email. She had received an email from Ms. Kelly, who wrote a   response  —   “Good”  —   upon hearing that Mr. Sokolich was upset about the traffic jam in his town. Ms. Renna testified that Ms. Kelly called her one evening and asked her to delete that message. Ms. Renna testified that she did so  —   after she “protected” herself by saving a copy. Henry Klingeman, a lawyer for Ms. Renna, said she would “answer questions publicly when she testifies at the upcoming trial, not before. ”'"}, "time": 1742628518.275449}