{"duration": 0.2501504421234131, "input_args": {"text": "'Kate Shindle is compiling quite the résumé. Once she was Miss America. Now she’s a labor leader, the president of Actors’ Equity. And this week she began playing the nation’s most famous lesbian cartoonist, Alison Bechdel, in the touring production of the   “Fun Home. ” Over the next year, Ms. Shindle will be traveling from city to city, introducing the country to one of the more unlikely recent musical successes, while simultaneously leading her union as it works to improve pay and benefits for more than 50, 000 actors and stage managers across the United States. It’s a complicated juggling act, and one that Ms. Shindle has decided to turn into a yearlong adventure. A Queens resident accustomed to traveling by subway and bicycle, she bought a used green Nissan Rogue, loaded in some clothing and a computer, and hit the road, heading first to Cleveland, where the tour’s performances began on Sunday. She also cut off the long brown hair she has worn since adolescence, the hair that was once crowned by a tiara. After failing to persuade the show to let her wear a wig, she chopped most of it off the day before the first rehearsal, and has had multiple trims since, each one bringing her nearer to the   style favored by Ms. Bechdel. “Yeah, it’s pretty funny about Kate,” Ms. Bechdel said in a wry email about the casting. “She’s a former Miss America, I’m a former Miss America  —   what are the chances? !” (That’s a joke  —   Ms. Bechdel, for any of you who might be confused, was never Miss America.) “But seriously, being portrayed by her in the musical feels like a lovely, twisting kind of cultural progress, like a Möbius strip  —   suddenly there’s this inexplicable but undeniable continuity between the marginal lesbian and the beauty queen,” Ms. Bechdel added. “I find it delightful. ” Ms. Shindle, who is 39, straight and single, is delighted as well. She saw the show for the first time in January  —   six months after it won the Tony Award for best new musical  —   and said, “By the time I left the theater, I just thought: ‘Oh, that’s mine. I’m going to go get that. ’” “There was a lot that resonated with me, in terms of the family dynamics,” she added. “And I think it’s exciting to take this show, with the topics that it addresses, across the country right now, so the activist part of my brain flipped on, too. ” For Ms. Shindle, the journey is not as odd as it might seem. As Miss America, in 1998, her cause was AIDS activism, and she used the visibility that came with her stature to champion disease prevention through safe sex and needle exchange programs. Now, by leading the cast of “Fun Home,” she is helping to introduce a musical about the sexual awakening of a lesbian, and the simultaneous unraveling of her gay father, to the nation. The juggling is not without precedent  —   Actors’ Equity is administered, on a    basis, by a paid staff the elected officials, like Ms. Shindle, are not paid, so, as she said, “a girl’s got to make a living. ” Ms. Shindle, who was elected last year to a   term as president, and who this year led the union as it endorsed a presidential candidate (Hillary Clinton) for the first time, said she would participate in meetings by phone, fly back to New York as needed and continue to focus on priorities like gender parity and racial and ethnic diversity. Among the most pressing issues facing the union: Off Broadway actors are agitating for better pay, Broadway actors are looking to share in profits from shows they help develop, and Los Angeles actors are battling new union rules that affect the thriving   scene there. Ms. Shindle grew up in Moorestown, N. J. and found herself drawn to the stage in seventh grade, when she wrote a paper about theater. (“It was a terrible paper,” she said. “I got a bad grade on it. ”) Undaunted, at her tiny Roman Catholic high school she took on multiple roles  —   in one production of “Fiddler on the Roof,” she played the violin in the pit while also performing as  . She enrolled at Northwestern University to study theater, but was also competing in pageants, which were familiar to her because, when she was a child, her family had volunteered with the Miss America pageant. During her junior year, she was chosen as Miss Illinois and then as Miss America, and she took a year off for her reign, during which she traveled the country talking about AIDS, a subject that had piqued her interest after a family friend, and two theater professors at Northwestern, died of the disease. “I was really angry  —   it seemed to me that we knew how to stop transmission, and we weren’t doing it because of politics,” she said. “And because of what Miss America is, and was, to the country, people invited me places that no AIDS activist could get into. ” As for the gender politics of the Miss America pageant, Ms. Shindle said they didn’t bother her at the time. “Now I look at how the presence and existence of that organization makes other women feel like they have to participate in those kinds of judgments, but at the time I just thought, ‘You know, nobody’s forcing me to get up on stage in a swimsuit,’ and it actually felt pretty good to get to the point where I was O. K. doing that,” she said. “And, to me, the end justified the means, because I was a    college student who suddenly had a national forum to speak about an issue that I thought was really important. ” She returned to Northwestern to finish her degree, and then moved to New York, working at times as a waitress and selling real estate, but also as an actor, making her Broadway debut as an understudy in “Jekyll  Hyde,” and then landing the role of Sally Bowles in “Cabaret,” first in the touring production and then, briefly, on Broadway. Later, she was in the original Broadway cast of “Legally Blonde,” where she met the producers who now oversee “Fun Home. ” Her roles have been limited by her height  —   she is 5 feet 11 inches tall. As a result, she said, “I never had ingénue years  —   it’s just really hard to pair me with somebody who is going to aesthetically give the look that most directors want. ” “I’ve played my share of strippers and hookers and other tall people  —   women on their own negotiating the world  —   and I did a show where I played the personification of time, and I played a   hybrid,” she said. “Now I get to play this character for whom whether she can stand on a stage with a man and be more petite than he is is nowhere in the equation. ” The show’s director, Sam Gold, who has been restaging it for the road, said that Ms. Shindle’s history and her union activism help her with the role. “I’m not used to having someone in the room who has a whole life other than actor,” he said, “and it grounds Kate. ”'"}, "time": 1742562017.4209294}