{"duration": 0.11146092414855957, "input_args": {"text": "'MasterCard is currently testing a credit card with a fingerprint scanner embedded within it, creating an extra layer of biometric authentication to keep the accounts of their customers as safe as possible. [Convenience and security are the two key benefits of the new system that MasterCard have highlighted. While contactless payment technology offers speed, no authentication is usually needed. PIN numbers are more secure, but they take a greater amount of time, can be forgotten, and can easily be seen if the keypad is not obscured from prying eyes. The fingerprint system provides the best of both worlds at least in MasterCard’s opinion.  Previous iterations of biometric cards required a separate fingerprint scanner, limiting their usefulness, as the special equipment needed to be provided by the store, which only a small minority did. This new generation of cards only needs to be inserted into the standard terminal, with the fingerprint authentication bypassing the need to enter a PIN number. A MasterCard spokesperson did say that “If the finger is too greasy or sweaty and the biometric doesn’t go through, the cardholder would experience a small delay and then asked to put in their PIN to complete the transaction,” which is a small price to pay for the benefits. Contactless payment technology will be implemented in future versions “adding to the simplicity and convenience at the checkout. ” However, to enroll their fingerprint on the system, customers must visit their bank and register their prints there. Usually, bankcard users are mailed their card, not requiring the extra journey to visit their local branch. MasterCard is “exploring ways to make remote registration possible” at this moment in time, but remote registration may open vulnerabilities in the security system. Karsten Nohl, chief scientist at Berlin’s Security Research Labs, also raised concerns about how secure the system may be. “All I need is a glass or something you have touched in the past,” he told the BBC. If the information is stolen, “you only have nine fingerprint changes before you run out of options. ” Nohl was however cautiously optimistic despite this, saying that it is “better than what we have the moment”: With the combination of chip and PIN, the PIN is the weaker element. Using a fingerprint gets rid of that  …     Fingerprints have helped us avoid using terrible passwords, and even the most gullible person is not going to cut off their finger if [a criminal] asks nicely. This is not the first time MasterCard has experimented with biometrics to increase security and ease for their customers. Last year, they launched MasterCard Identity Check, colloquially known as “selfie pay,” where users would be able to authenticate online transactions by snapping a quick photo of themselves using the camera on their phone or tablet. Given that the fingerprint verification can only be used in store, customers could use the two systems in tandem for their different shopping needs. Full consumer rollout is expected at the end of this year, after two successful trials in South Africa further trials in Europe and East Asia are likely to occur as well, to fully check the functionality of the system. Jack Hadfield is a student at the University of Warwick and a regular contributor to Breitbart Tech. You can like his page on Facebook and follow him on Twitter @ToryBastard_ or on Gab @JH.'"}, "time": 1742562680.9783206}