{"duration": 0.0965726375579834, "input_args": {"text": "'This post was originally published on this site \\nA screenshot from “An Open Secret,” a 2015 documentary about pedophilia in the entertainment industry . \\nI’ve got some good news and some bad news. \\nLet’s start with the bad news: this is one of those unpleasant, disturbing articles that I sometimes write here at CDP. It deals with a topic that I wish didn’t exist to be reported. But reality is what it is, so we might as well face it head-on. \\nWhich brings me to the good news: “The truth shall set you free.” \\nThat teaching is, of course, from Jesus, found in the Gospel of Sty. John, and it is the torch that we will carry to brave the dark tunnels ahead. As bad as it is, the good news is that dragging perversion and corruption into the light is the only way to destroy them, and the only way to set others free from the corrupt. \\nIn any case, here is what we know so far about “Twittergate,” according to a recent post by NorthCrane.com : \\nSeveral Twitter users [earlier this week] were reporting child pornography accounts and sending them to 0hour, an active member of Anonymous. The Anonymous user, @0hour , was retweeting them and tagging Twitter, FBI and Disney. The YouTube user, notsafeforjerk, is providing up-to-date reports on #Twittergate . \\nJust some of the Twitter accounts exposed for posting child-sex content \\n[embedded content] \\nI can’t understand this man’s accent well at all, but your mileage may vary. \\nNot surprisingly, a few hours later, “0hour got his account suspended”–and it’s not the first time his account has been suspended–yet, very disturbingly, “many of the child pornography accounts remained active, despite the child pornography being publicly displayed on the Twitter accounts.” \\nNo comment. \\nI know of one Twitter user whose account has been banned 11 times (and counting) in the last few weeks, and once three times in the same day, because he consistently tweets about the Podesta pedo ring, #pizzagate , spirit cooking, the Clinton Foundation’s human trafficking baggage, and so on. (He is able to restore his account almost immediately, however, because he uses Keybase, which, provides proof of his identity so Twitter readmits him under a different handle/name.) \\nAt this point, the Twitter gods are either malicious for allowing such content to remain public, or too apathetic and incompetent to do anything about it, which, in terms of public harm, is just as bad. \\nThe North Crane article ends on this note: “As more people become involved in the manhunt, the scope of horror increases.” \\nSadly, this is truer than the author might have realized. \\nHold fast to those torches, dear readers; we’re going farther down the tunnel. \\n+ + + \\nThe reason Twitter may be “asleep at the wheel” during this #Twittergate storm is that Twitter’s CEO, Jack Dorsey, may very well be involved in the pedophilia underworld inhabited by the rich, the famous, and the powerful in Obama’s America. \\nThe “blueprint” for the esoteric “spirit cooking” rituals that were exposed in the weeks before election day is Marina Abramovic’s 1996 cookbook of the same name. **** \\nTen years later, Dorsey gave a nod to the ritual in this tweet : \\nMaking “pasta” and “Satanic” allusions are key elements/codes in Spirit Cooking. \\nAs the replies indicate, this tweet was unearthed within the last day, and has a disturbing significance in light of the larger Podesta ring. \\nAt this point, a natural objection is to shrug this off as a weird possible aspect of one CEO’s life. \\nUnfortunately, Dorsey’s strange affinity for the pedo world belongs of a larger context. The 2015 documentary An Open Secret was directed by Amy Berg, and “exposes how pedophiles operate in Hollywood and cover up their crimes.” In addition, Berg’s 2006 documentary on the Catholic Church’s cover-up of pedophilia/pederasty, Deliver Us from Evil , was nominated for an Oscar. \\nThe Hollywood Reporter has described the film as “A sober look at…the sexual exploitation of teenage boys in the entertainment industry by the older men who can make or break their careers…. [W]ith any luck it will encourage other victims to speak up, and enlighten the parents of showbiz aspirants about the industry’s dangers.” \\nSeveral journalists are included in the film. One journalist said his story documenting the sexual crimes committed by top Hollywood figures was censored. \\nBerg said she could not find any company willing to distribute her film until Rocky Mountain Pictures, the distributor behind such ground-breaking conservative-oriented documentaries as Obama 2016 , stepped up to release An Open Secret in various cities this summer. \\nThe film identifies a pedophile ring led by a convicted sex offender named Marc Collins-Rector, who had ties to the rich and famous in Hollywood. Collins-Rector established an Internet-based TV company called Digital Entertainment Network (DEN). \\nBad news: this is real. \\nGood news: they can’t hide anymore. \\nOne blogger hit the nail on the head when he says that for years conservatives, \\nhave tried to argue why their positions on a given issue were better than the liberal positions pushed by the entertainment industry. … But to be persuaded about the whole sweep of their criticisms, you’d have to evaluate every argument….. \\nA far more efficient use of time, money, and energy is not to attack all the myriad weirdnesses that Hollywood produces, but to attack the source from which they spring . If what produced them is rotten, polluted, and corrupted, the average person is willing to believe that the fruits themselves are rotten, polluted, and corrupted. \\nAs such, he argues, the DoJ under President Trump ought to attack the Hollywood perverts and “blow the lid off of a similar culture of pedophilia among the DC Establishment insiders.” Because even if our culture is growing more and more tolerant of degradation and immorality, “there’s still one taboo left that everyone recoils in disgust at, and it’s pedophilia.” \\nMore good news: The truth shall set you free–to fight the darkness. \\nShare this article to inform and encourage your friends and family! Related '"}, "time": 1742562634.6374733}