{"duration": 0.15340209007263184, "input_args": {"text": "'“To Counter Satellite Threats from China and Russia and Track Killer Asteroids” The most sophisticated space surveillance telescope ever developed is ready to begin tracking thousands of space objects as small as a softball. It’s a boon to space surveillance and science and a new military capability important to the nation and the globe. Air Force wants to track what objects are moving in the night sky, which objects are new, and what danger those objects might pose to satellites in orbit. According to DARPA, SST represents breakthroughs in telescope design, camera technology and image analysis software, and allows much faster discovery and tracking of previously unseen or hard-to-find small space objects.\\nThe telescope captures a vast image: 100 million pixels, according to deputy DARPA director Steven Walker. It takes just one person to operate, and that person can operate it remotely, or set the telescope to scan the sky autonomously. And it captures a lot of information, with the camera gathering and saving half a terabyte of data on a typical night scan (the amount of data collected varies depending on the mission and other variables). The whole apparatus is immense, weighing 225,000 pounds. SST has increased space situational awareness from a narrow view of a few large objects at a time to a widescreen view of 10,000 objects as small as softballs, DARPA says. The telescope also can search an area larger than the continental United States in seconds and survey the entire geosynchronous belt in its field of view — a quarter of the sky — multiple times in a night. Developed by the Defense Advanced Research Projects Agency, the Space Surveillance Telescope is the most sophisticated instrument of its kind ever developed. It was transferred to the Air Force on Oct. 18, 2016, which has plans to operate it jointly with the Royal Australian Air Force. “It’s not often we get an opportunity to witness the beginning of an entirely new military capability,” Air Force Maj. Gen. Nina Armagno, the director of strategic plans, programs, requirements and analysis for Air Force Space Command headquarters at Peterson Air Force Base in Colorado, said at the transfer event, “but that’s exactly what we’re doing here today.” The telescope, developed by the DARPA, the Defense Advanced Research Projects Agency, was turned over to the Air Force Oct. 18 at the Space Surveillance Telescope site atop North Oscura Peak on the northern part of the Army’s 3,200-square-mile White Sands Missile Range in New Mexico. The formal transition of the SST from a DARPA-led design and construction program to ownership by the Air Force begins the telescope’s operational phase. The Air Force will move the SST to Harold E. Holt Naval Communication Station in Western Australia, operating and maintaining the telescope jointly with the Royal Australian Air Force.\\nThe SST also will be a dedicated sensor in the U.S. Space Surveillance Network, operated by the Air Force Space Command.\\n“From a military perspective, any one of those objects could put satellites at risk,” Armagno said. “That’s why this capability is so important to us in Air Force Space Command.”\\nThe world and the threat have changed, she noted, adding, “We no longer have the luxury of assuming that we operate in a benign environment [or]that conflict will only be on land or at sea or in the air. Now we must concern ourselves with a conflict that may extend into space.”\\nThe space domain is filled with many actors, some with competing interests that may be at odds with those of the United States and its allies, the general said. “Others around the world have taken notice of the advantages that we and our allies gain through space technologies, and they have focused their military efforts on countering that capability,” Armagno told the audience.\\nSpecifically, she added, “Russia and China, by the year 2025, will be able to hold at risk every one of our satellites in any orbit. So if the United States and our allies are to deter adversaries from taking action against our interests, we must do it from a position of strength.”\\nThis image of objects and debris in geosynchronous orbit is generated from a distant oblique vantage point to provide a good view of the object population in the geosynchronous region, about 22,000 miles from Earth. The larger population of objects over the Northern Hemisphere is due mostly to Russian objects in high-inclination, high-eccentricity orbits.\\n\\nTo be prepared for war in the space domain — and so to lessen the possibility of war ever occurring there, the general said — “we must be able to see aggressive behavior when it unfolds [and]be prepared to act decisively to defend our own assets and to hold others accountable for their actions. We need to be able to attribute those actions and then react on tactically relevant timelines.”\\nThese requirements call for an in-depth understanding of what’s going on in space, she added — what objects are there, what they are doing, what their intentions are and what they will do next.\\nSST will provide such information to the United States and its allies, Armagno said, characterizing it as “the ability to better understand the space domain in order to identify and predict the actions of others. In turn this knowledge will help us deter others from reckless behavior, and [allow us]to posture ourselves to react if needed.”\\nNo one wants a war in space because it doesn’t impact a single region but the entire globe, she added, and it’s up to the United States and its allies to demonstrate leadership in the responsible use of space.\\nSST is a giant leap forward in space cooperation between the United States and Australia, Armagno noted.\\n\\nA view of the M20 Trifid Nebula, or NGC6514, taken by the Space Surveillance Telescope. Approximately 5,000 light years away from Earth, the nebula is near the outer limits of objects bright enough visible to the naked eye.\\n“It … benefits each of our respective nations [and]anyone who uses space across the globe. The United States simply can’t do anything that we do in space without our allies, and the value of these partnerships will only continue to grow in the future,” the general said.\\nDeveloped by DARPA, with optical expertise from the federally funded research and development center MIT Lincoln Lab, operated by Australian personnel and feeding information into the U.S. Space Surveillance Network — “SST … takes advantage of the unique capabilities of each partner. In fact,” she added, “the United States can’t maintain space superiority like we need to without our allies.”\\nU.S. allies bring to the table space capabilities that provide space situational awareness, bolster intelligence, surveillance and reconnaissance efforts, monitor the environmental [and]increase communication bandwidth and in times of crisis these capabilities need to come together to create a synergy across the entire space enterprise, the general said.\\n“SST is and will be part of our space situational awareness system,” she added. “It allows us to discern our adversaries’ intent early on, and we have the strategic warning necessary to support stringent timelines required for us to respond to any kind of attack in space with confidence.\\nAs a nation, she added, “we have the national will and determination to face our adversaries head on. When the United States and our allies have difficult problems to solve we find a way to prevail together. Capabilities such as the Space Surveillance Telescope are changing the very nature of how we operate in space and how we will operate in the future.”\\nSource: The Daily Galaxy \\n'"}, "time": 1742562246.2008348}