{"duration": 0.09447312355041504, "input_args": {"text": "'LOS ANGELES  —   Every day at South Park Studios is different, but Trey Parker said this particular afternoon, Monday, Sept. 12, was especially memorable. “There are times where we go, ‘How do we tell Comedy Central we don’t have a show? ’” he said with sardonic delight. “This is one of those. ” Mr. Parker and Matt Stone, the creators of “South Park,” exuded an appearance of calm as they brainstormed in their airy offices, in a gray building on a stretch of highway at the edge of this city. But they were under considerable pressure to finish the first episode for the 20th season of this satirical animated series, which was due in less than 48 hours and would air that Wednesday. At this stage  —   on the ninth draft of a script called “Member Berries”  —   they would like to have 16 minutes of a   episode Mr. Stone and Mr. Parker said they had 12 and a half. (“That doesn’t mean that’s what we have done,” Mr. Parker cautioned. “That means that’s all we have figured out. ”) A   board in the room showed a nearly nonexistent third act, all empty ovals stacked like pancakes, as the collaborators kicked around the episode’s story elements: a new American national anthem rebooted by J. J. Abrams a comically inept xenophobe running for president and an addictive talking fruit that induces nostalgia for the   of one’s youth. How these pieces fit together wasn’t clear yet. But after two decades of making their show in this stressful,       way, Mr. Stone and Mr. Parker were reasonably certain they would figure out something. “I can’t believe I’m surprised by it,” Mr. Stone said. “How do we get to this point and have no story? But we just go through it again. For the eight millionth time. ” Since its debut in 1997, “South Park” has spun more than 250 tales about   fourth graders in a Colorado town that invariably gets swept up in whatever social crisis the nation is facing that week. What began with a show about aliens installing a satellite in a child’s butt has evolved  —   sort of  —   into a series that, in its unapologetically crude way, can address debates over transgender bathrooms, racial discrimination or gratuitous sex and violence in “Game of Thrones. ” Even as animation technology has improved and the “South Park” staff has grown exponentially, the show is still fundamentally the work of Mr. Parker, 46, and Mr. Stone, 45, who agonize over every installment. (Mr. Parker has had sole writing and directing credit on all but a few episodes since 2001.) The mechanics of making the show haven’t changed much, but Mr. Stone and Mr. Parker have. The   punks who were on LSD at the 2000 Academy Awards have grown up: Mr. Stone telecommutes half the week to be with his wife and children in New York, while Mr. Parker’s office is strewn with the   toys of his    daughter. In its 20th year, “South Park” offers a pointed and, surprisingly,   platform for commentary on current events. New episodes typically draw around two million viewers, many of them the   to    that advertisers covet, a showing that Comedy Central decidedly needs while its   lineup is in flux and other signature franchises like “Inside Amy Schumer” are on hiatus. “For a network that no longer has Stephen Colbert and Jon Stewart, having ‘South Park’ is extremely important to us,” said Doug Herzog, the president of Viacom’s Music and Entertainment Group, which includes Comedy Central. “With all due respect to Jon and ‘The Daily Show,’ ‘South Park’ is the foundation on which Comedy Central is built. ” If the earliest “South Park” episodes reflected a juvenile desire to see what they could get away with on television, their later work suggests Mr. Parker and Mr. Stone have honed their ability to channel their growing exasperation with a polarized world into comedy. Vernon Chatman, a comedy writer who has worked on “South Park” for more than 15 years, said that Mr. Stone and Mr. Parker have thrived by embracing their roles in “their     relationship. ” “Matt has this sharp, analytical mind that’s focused and relentless,” he said. “Trey has the dreamy, emotional storyteller thing. ” Mr. Chatman added, “To be in such a heightened, intense relationship, with so much stakes and pressure on it  —   the fact that they haven’t killed each other is incredible. ” Already, Mr. Parker and Mr. Stone had spent this Monday in a multihour meeting with Mr. Chatman and Anne Garefino, an executive producer, talking through plot points for “Member Berries” and shooting them down. “If we only have three scenes left to write, that’s a win,” Ms. Garefino said. “It’s when you still have that whole last act  —   ” Her voice trailed off. In the afternoon, Mr. Stone and Mr. Parker caromed from office to office in a building decorated with their trophies  —   “South Park” toys and memorabilia framed posters from their Tony   Broadway musical, “The Book of Mormon”  —   while trying to bring “Member Berries” into focus. For a few minutes, Mr. Parker stepped into a recording booth to perform the voices of two football announcers introducing the new national anthem, while Mr. Stone directed him to be more excitable. Then it was off to an editing suite, where Mr. Parker reviewed a vividly vulgar montage featuring Mr. Garrison, the “South Park” character who has turned into a buffoonish populist demagogue, describing exactly how he’d bring death to America’s enemies. Mr. Parker writes in private, emerging occasionally to pull Mr. Stone from wherever he might be and ask his help. In the writers’ room, the two creators were trying to pin down the motivations of Randy Marsh, the show’s ambivalent adult moral compass, as he grapples with a presidential race between two candidates he dislikes and decides whether he should try the narcotic member berries. Where should Randy be introduced to the enticing fruit  —   at a bar or in a friend’s house? Do the berries come in boxes or grow in bunches? Mr. Parker was in constant motion as he considered each question, walking many agitated laps around a long conference table. Together, he and Mr. Stone improvised a scene in which the exhortations of the talking berries grow more sinister: Remember “Star Wars”? Remember being a kid? Remember feeling safe? Remember no immigrants? As Mr. Parker stepped away to resume his solitary work, Mr. Stone explained that his role in these moments was to be a sounding board for Mr. Parker but also to remind him that he’s just got to write something down. “There’s no other way to do it,” Mr. Stone said. “If you don’t have that one perfect line, you can fix that later. ” In a phone interview a few days earlier, Mr. Parker explained how he and Mr. Stone had abandoned their preseason ritual of holding a writers’ retreat to drink, carouse and think up ideas. “As soon as we’re like, ‘We could do this, this could be funny,’ we’re like, ‘Stop talking about it,’” Mr. Parker said. “Because in two months, when we’re doing the show, it won’t be funny to us anymore. ” Being more extemporaneous, he said, led to unexpected discoveries like their 19th season in 2015, presented as 10 interconnected episodes that told a broader story about gentrification, identity politics and a perceived resurgence of political correctness. The renewed debate about sensitivity in speech and the policing of language was one that “South Park” could not avoid, for its own sake. “This might finally be the year that we get run out of town,” Mr. Parker recalled thinking at the time. “If we’re going to, let’s make fun of the fact that we’re the old guys at the table. All those shows were an honest part of us going, ‘Should we go away? ’” Instead, the 19th season was a critical hit in a review for The New York Times, James Poniewozik wrote that “South Park” had “gone and revitalized itself,” in part “by asserting that it takes an outrageous comedy to capture an era of outrage. ” Mr. Herzog, who has worked with Mr. Parker and Mr. Stone since the debut of “South Park,” said they have Comedy Central’s “absolute, 1, 000 percent eternal trust. ” As long as the show satisfies the network’s Standards and Practices department, he said, “we’re cool with the show. ” Yet that success created more angst for Mr. Stone and Mr. Parker as they approached Season 20. Were they obligated to tell a serialized narrative again? Did they have to dwell on the 2016 campaign, when their indifference to presidential politics is a   subject? All they can do, the “South Park” creators said, is continue to apply a principle that has guided them from the beginning. No matter how serious an issue seems, Mr. Parker said, “Looking at it with a sense of humor is not only healthier for you, it actually makes you think more clearly about things  —   being able to make fun of either side of an issue, rather than just, ‘Trump is evil and Clinton is good. ’” “There’s always room to equally rip on both of them,” he said. Comedy Central has signed Mr. Parker and Mr. Stone to keep making “South Park” through 2019. Ms. Garefino, who has worked on the show for 19 of its 20 years, suggested they could stick around longer still. “They said they didn’t still want to be making ‘South Park’ when they were 40,” she said. “I think they’ll be doing it when they’re 50. ” She tried to make herself sound as confident that the current episode would be completed under deadline. “There’s always a moment where Trey will fall in love with the show, and the pages start flowing,” she said. “Something will happen. ” “Member Berries” was broadcast at 10 p. m. on Sept. 14, but hardly without   incident. That morning, South Park Studios suffered a system crash, and the episode’s audio went missing for an hour and a half. When the episode was transmitted to Comedy Central, it had a mystery   sync problem that was finally fixed and delivered one hour before airtime. The following day, Ms. Garefino said, “Trey’s like, ‘I think from now, we should think about getting the show in earlier. ’” Even “South Park” would have to bleep out Ms. Garefino’s response.'"}, "time": 1742628600.8874385}