{"duration": 0.11214470863342285, "input_args": {"text": "'3 Priceless Zen Teachings on Fear Nov 4, 2016 21 2 \\nIf the ego had an engine, its fuel would be fear. Trepidation isn’t all bad, but it certainly has its time and place. Fear can render us quivering and useless, or motivate us toward change. In the study of Zen, we learn how to not only overcome our fears, but to become fearless. This is called the Lion’s Roar of Zazen . \\nThe lion is the living embodiment of self-possessed power. This animal has dominion over all he sees as well as the courage, speed, and might to attain all he desires. His deportment is regal and calm, though, never bullying and neither shrinking. The metaphor of the lion is used to describe how one overcomes fear in the Majjhima Nikaya , a Collection of Middle Length Discourses on Buddha’s teachings, and they are immaculate at describing the fears most of us face. Many Zen teachers describe how to become regal and fearless in their discourses as well. Fear of the Loss of Life \\nZen master, D.T. Suzuki says that fear of the loss of body is usually what we must overcome first. Following this, an internal consciousness becomes aware that we are threatening the slated, well-accepted notion of being merely corporeal, and we ‘think’ we are frightened. Suzuki says we needn’t look any further than the bodily sensations that arise when we simply ponder fearfulness. An empty feeling in the lower abdomen ensues, there is an immobility at the base of the tongue, and our breathing becomes restricted. If we were to remove these sensations, though, fear becomes a meaningless thing. \\nSzkuki attests that according to Zazen, we aim to keep a lower abdomen full of power , the breathing always uniform, the heart beat tranquil, and the muscles of the whole body resilient so that if emotions like fear arise, they can easily be encountered and dismissed. Fear of the Loss of ‘Self’ \\nSome fear is understandable, even – such as when we realize we must face a spiritual death in order to progress on our path. Although we may long to richer higher levels of consciousness, we aren’t always so keen to let go of the habits and crutches that have propped up our current level of awareness. As the Sufi poet Rumi once said , “No one will find his way to the Court of Magnificence until he is annihilated.” \\nOther types of fear make us meek and fallible. Our consciousness easily wavers, and we cannot attain Mu , or a state of Zen , let alone get on with our daily activities. It is only by cultivating the 4 Zen States of Mind that we can ‘fill our abdomens’ with power and roar like a lion with fearlessness. 4 Zen States of Mind Shoshin or “Beginner’s Mind” ( 初心 ) is the first stage in cultivating fearlessness. Think of a time when you were excited, and eager to start a new endeavor. There might have been unknowns, but you were brimming with glee over trying something new. This is the type of mind we want to cultivate with all aspects of life. Instead of begin nervous or fearful, we can aim to be eager and open, accepting all that comes our way. In order to approach life from the beginner’s mind we need to let of preconceived notions, and be optimistic. If you’ve been able to have this feeling with one thing you’ve done in life, you can translate that feeling to other areas also. Fudoushin ( 不動心 ) means you have an “Immovable Mind .” It doesn’t mean you are stubborn, but fudoushin does translate to being determined in the face of obstacles. Does a lion run away from present danger? Hardly. The animal doesn’t get angry or judgmental about obstacles either. He is peaceful like the eye of the storm until he is upon his prey. If you can develop fudoushin when you are under stress, you will be unstoppable in life. Mushin (無心) or “Without Mind.” This is a similar philosophy to the Chinese Taoist idea of wei wuwei. When we are ‘in the zone’ working on a great masterpiece or doing something we love, we’ve likely already experienced the state of mushin. When we are empty of thoughts, yet moving and acting purely in the present moment, without fear, anger, ego, or other emotion, we are a force to be reckoned with. By developing equanimity and learning how to focus to the point of no-thought, we can cultivate mushin. The last of the four states of Zen Mind is called Zanshin ( 残心 ) which literally translates to “Remaining Mind.” This state of mind contains two precise elements. It means you are both relaxed and keenly aware of your surroundings. This is the state that marital artists aim to be in so that they can react at any moment to anything that comes their way. By maintaining relaxed alertness fear cannot sway you, even in the face of a frightening opponent. Fear of Suffering \\nThe Buddha taught that self-grasping and ignorance are the root of all remaining fears. Healthy fears aside , our tendency to try to avoid suffering – the fear of failure, heartbreak, being trapped, being lost, etc. are all caused by a single root – and arise from the mind. In Shantideva’s Guide to the Bodhisattva Way of Life , is is said that the Buddha articulated, “The source of all our fear comes from our own uncontrolled minds or “delusions.”” \\nIn order to overcome this root cause of fear, the Buddha, and Zen masters alike, teach to strive for no-self or emptiness. This doesn’t mean a nihilistic view for life is adopted. Friedrich Nietzsche accused Buddhism of being existentialist , but the Buddha taught us to seek the Middle Way between the mundane and the spiritual, seeing objects as real but dependently originated, not-self and unsatisfactory. Instead of seeing all things as pointless and empty, we see mundane life as meaningless but recognize spiritual goals as meaningful. \\nAs the Zen master, Sojo has said , “Heaven and earth and I are of the same root, the ten-thousand things and I are of one substance.” \\nAfter all, even once the Buddha gave up all his worldly possessions he realized he was no closer to achieving Nirvana. He discovered that exaggerated asceticism was not required to attain enlightenment. \\nBy learning how to work through these fears, we can achieve the ‘lion’s roar’ of full realization.'"}, "time": 1742563759.9694202}