{"duration": 0.1306600570678711, "input_args": {"text": "'The   rambling voice on the telephone was disguised and garbled, and warned of a slaughter of Jews. The voice spoke of a bomb loaded with shrapnel and of an imminent “blood bath. ” Moments later, the caller hung up. The   threat to a Jewish community center turned out to be a hoax. The warning was one of at least 100 that Jewish community centers and schools have reported since the beginning of the year, a menacing pattern that has upended daily life for people in 33 states and prompted a federal investigation that has come under increasing scrutiny from lawmakers, security specialists and Jewish leaders. Combined with the recent vandalism at Jewish cemeteries in Missouri and Pennsylvania, the calls have stoked fears that a virulent   has increasingly taken hold in the early days of the Trump administration. At the beginning of an address to Congress on Tuesday night, Mr. Trump said the episodes, along with last week’s attack on two Indian immigrants in Kansas, “remind us that while we may be a nation divided on policies, we are a country that stands united in condemning hate and evil in all of its very ugly forms. ” In a meeting with state attorneys general earlier Tuesday, Mr. Trump suggested that the threats and destruction might be a politically coordinated effort to “make people look bad,” according to the attorneys general of Pennsylvania and the District of Columbia. “First, he said the acts were reprehensible,” said Attorney General Josh Shapiro of Pennsylvania, a Democrat who asked Mr. Trump about the episodes during a session at the White House. “Second, he said: ‘And you’ve got to be careful it could be the reverse. This could be the reverse, trying to make people look bad. ’” Jewish leaders denounced Mr. Trump’s comments to the attorneys general, and some urged the federal government to accelerate its investigation of the threatening calls, the latest of which came on Monday. “The person or persons doing this have broken the law, and it’s the responsibility of our system to investigate it and apprehend the individual or individuals responsible,” said David Posner, the director of strategic performance for the JCC Association of North America. The Federal Bureau of Investigation has been leading an inquiry since January, and a federal law enforcement official, who was not authorized to discuss a continuing investigation, said that a single person may be making the threats using an internet calling service. Independent analysts, including extremism researchers and retired law enforcement officials, share that theory and said that, so far, they have seen no evidence of an organized effort. Though some people had suspected that the calls were recorded and automated, there was evidence to the contrary. In Milwaukee, for instance, a switchboard operator asked questions and received responses from the caller, said Mark Shapiro, the president of the Harry and Rose Samson Family Jewish Community Center. Mr. Posner said an F. B. I. official had emphasized that the investigation was a priority for the bureau, involving experts in behavioral analysis, civil rights and hate groups. “Agents and analysts across the country are working to identify and stop those responsible,” Stephen Richardson, the bureau’s assistant director for the criminal investigative division, said. “We will work to make sure that people of all races and religions feel safe in their communities and in their places of worship. ” According to Mr. Posner’s group, more than 80 community centers and day schools in the United States and Canada have been threatened, some repeatedly. The calls have come in five rounds, most recently on Monday, when there were 31 threats. Many of the calls have prompted evacuations and bomb sweeps, forcing schoolchildren from classrooms and employees to push cribs full of infants into parking lots. Retirees have been rushed from swimming pools, and offices and streets shut down. The threats are frequent and alarming, community center leaders said. “My initial reaction was, ‘This is our turn,’” said Karen Kolodny, the executive director of the JCC of   in Scarsdale, N. Y. where officials responded to a bomb threat on Monday. “My reaction was not complete shock. We thought it was going to happen at some point. ” F. B. I. data shows that most hate crimes are linked to race, ethnicity or ancestry. In 2015, the most recent year for which federal data has been released, the authorities recorded 664 episodes they classified as  . Analysts said they believed that   commentary online before last year’s presidential election had gradually escalated into more sinister behavior toward the Jewish institutions, which have long prepared for threats and often employ private security. “You started out with the hostile tweets,” said Mitchell D. Silber, who was director of intelligence analysis for the New York Police Department. “You moved to the bomb threats against JCCs and other institutions, and now you have a physical manifestation at the cemeteries with the gravestones knocked over. ” Although the F. B. I. is investigating damage to headstones at a Jewish cemetery in Philadelphia, the episode there, as well as a similar one near St. Louis, is not believed to have been the work of anyone behind the bomb threats. The bureau’s inquiry into the bomb threats is likely complicated by the reality that criminals have embraced new technology, said Ronald T. Hosko, one of Mr. Richardson’s predecessors as an assistant F. B. I. director. “This is unlikely to be little twisted Johnny calling from his parents’ house,” Mr. Hosko said. Instead, Mr. Hosko suggested, the caller could be relying on libraries, restaurants or other public places with internet access, sites that might be equipped with surveillance cameras that the F. B. I. could use to help identify someone who frequented those places at the dates and times of the calls. Each new threat, Mr. Hosko said, increased the odds of an arrest. “Every one of those contacts presents another opportunity,” he said. “It’s another dot in the pattern analysis. ” As the threats have poured in, from Albuquerque to Nashville to Providence, there have been rising worries over whether people might stay away from the centers, which also serve people of other religious backgrounds. Some have fretted that the intense public attention might be encouraging whoever is behind the calls. “Given that this is happening wave after wave, there are concerns for people’s families, and people are concerned about whether they should still send their kids to JCCs,” said Oren Segal, the director of the   League’s Center on Extremism. “When communities start   like this, it is incredibly alarming and disruptive and serves the purpose of whoever is carrying out these threats. ” But Jewish institution leaders, in interviews and in conversations with one another, have expressed more frustration than fear. “By attacking the JCC, they’re really attacking what is best about America: the diversity, the pluralism, the inclusion that one faith community can be as welcoming to other faith communities and demonstrate that through deeds on the ground,” Mr. Posner said. “That’s something we will never surrender. ”'"}, "time": 1742562170.1742916}