{"duration": 0.09972047805786133, "input_args": {"text": "'On Tuesday morning, Dana Schwartz, a culture reporter for The New York Observer, sent a pitch to the paper’s editor in chief. After posting a message on Twitter criticizing Donald J. Trump for using an image of Hillary Clinton with a shape resembling the Star of David and a pile of cash, Ms. Schwartz spent the Fourth of July weekend getting trolled by   Trump supporters. Now she wanted to write about the experience. “I feel an obligation to use whatever platform is available to me to bring that hatred out of the shadows, acknowledging it and discussing it,” Ms. Schwartz wrote to the editor, Ken Kurson. Mr. Kurson responded swiftly, she said, with a single word: “Go. ” He didn’t see the piece until it was published online. It may not have been what Mr. Kurson was expecting. It did not simply criticize Mr. Trump’s   supporters. It called out Mr. Trump’s Orthodox Jewish    and de facto campaign manager, Jared Kushner  —   the owner of The Observer. “I’m asking you, not as a ‘gotcha’ journalist or as a liberal but as a human being: how do you allow this?” Ms. Schwartz wrote in the piece, which was published as an open letter to the owner. “Because, Mr. Kushner, you are allowing this. ” Mr. Kushner is married to Mr. Trump’s eldest daughter, Ivanka. She converted to Judaism before their wedding, and they are raising their children Jewish. Though he has no political experience and no official role in the campaign, Mr. Kushner  has emerged in recent months as one of Mr. Trump’s most influential advisers, even as the Trump campaign has been embraced by   and other hate groups. Neither Mr. Trump nor Mr. Kushner have denounced the hate messages, many of which have been directed at Jewish journalists who have written about the campaign. “Mr. Kushner, I invite you to look through all of those images in the slide show above, the vast majority sent in your   ’s name,” Ms. Schwartz wrote, referring to some of the   Twitter posts she had received over the weekend. “Right now, this hate is directed to one of your employees, but the message applies equally to your wife and daughter. ” “And now, Mr. Kushner, I ask you,” she wrote. “What are you going to do about this?” In an interview Tuesday, Ms. Schwartz acknowledged that the piece  —   headlined: “An Open Letter to Jared Kushner, From One of Your Jewish Employees”  —   was not quite what she had pitched to Mr. Kurson, and that she did not know if he would have approved had he known. “It did evolve as I wrote it,” she said. “I didn’t do it for fear that Ken wouldn’t sign off, but I agree it definitely makes it a little more incendiary. I got angrier as I wrote it. ” It was not clear whether Mr. Kurson, an old friend of the Kushner family, felt misled. He didn’t reply to a phone call and email seeking comment Tuesday afternoon. Mr. Trump has denied that the image he posted  —   and quickly deleted  —   on Saturday was   saying that the   shape was not meant to be a Star of David, but could just as plausibly be a sheriff’s badge or a plain star. In a statement, Mr. Kushner did not directly address Ms. Schwartz’s criticism, but he defended his    as “an incredibly loving and tolerant person who has embraced my family and our Judaism since I began dating my wife. ” “I know that Donald does not subscribe at all to any racist or   thinking,” Mr. Kushner wrote. In an interview, Ms. Schwartz said she was not blaming Mr. Kushner for Mr. Trump’s Twitter post. “But I wanted him to see the consequences of these ‘mistakes’ the Trump campaign makes that white supremacists celebrate as confirmation of their positions,” she said. “The ‘Jewish   ’ is seen as a Get Out of Jail Free card for many people, and he’s tacitly permitting that. And I, as a fellow Jew and one of his employees, genuinely wondered how he could hide behind such willful ignorance. ” Asked if she was still employed by the paper, Ms. Schwartz replied, “I hope so. ”'"}, "time": 1742562160.5056784}