{"duration": 0.1066293716430664, "input_args": {"text": "'LOS ANGELES  —   In “Swiss Army Man,” Hank (Paul Dano) a castaway stranded on a deserted island, spies a body washed up on the beach. Driven   by hunger and despair, he rushes into the surf, only to discover that the body, played by Daniel Radcliffe, is lifeless. Or is it? To Hank’s surprise, the corpse breaks wind, loudly and lustily. Moments later, Hank whoops with glee as he pilots the   Mr. Radcliffe across a   ocean. When “Swiss Army Man” had its premiere at Sundance in January, it became one of the festival’s most   films, eventually winning a directing award. But despite positive reviews (Variety said it was “constantly inventive,” and The Hollywood Reporter called it “bizarrely poetic”) festivalgoers walked out in droves and Vanity Fair wondered if it wasn’t the strangest film in Sundance history. For online commentators who hadn’t seen the film, “Swiss Army Man,” a. k. a. “Daniel Radcliffe’s   movie,” became an easy target. “The premise kind of lends itself to that,” acknowledged Daniel Kwan, the film’s  . “A lot of the   reactions online have been about how stupid this movie sounds. ” Known professionally as Daniels, Mr. Kwan and Daniel Scheinert have created some of the most inventive and visceral shorts and music videos of the past decade. Other directors, like Spike Jonze and Antoine Fuqua, have graduated from music videos to feature films, but few have made music videos as unsettling as Daniels’ work. Which was why no one was pounding on their doors to make “Swiss Army Man. ” The film, which opens Friday, June 24, is the first feature from Mr. Kwan, 28, and Mr. Scheinert, 29. The two are here in the backyard studio of Mr. Kwan’s Highland Park neighborhood home, which he shares with his fiancée, Kirsten Lepore, an   animator. Mr. Kwan’s brother, James, lives here, too he’s an animator and children’s book writer and illustrator (“Dear Yeti”). Mr. Scheinert lives less than a   away. “When we were editing the film here, I would just walk over with my dog every day,” Mr. Scheinert said. The directors, who often finish each other’s sentences and stories or clarify each other’s points, met in a   animation class at Emerson College in Boston. “We didn’t like each other at first,” Mr. Scheinert said, adding that he overparticipated and that Mr. Kwan underparticipated, coming off “like a ‘wasting his parents’ money’ film kid. ” But they soon bonded after they discovered they shared similarly twisted artistic sensibilities. Mr. Kwan’s final school project was an animated short about an insomniac who undresses people while they sleep and does their laundry for them Mr. Scheinert’s starred a dead boy whose body is piloted by small tigers. They began directing music videos and short films together, fantastical pieces in which small dogs are ridden like skateboards (“Dogboarding”) a man kills a red ball after it makes love with his wife (“Interesting Ball”) and a drunk partyer vomits sparks (“Pigeons,” by the band the Hundred in the Hands). Several went viral many featured the directors in starring roles. “Swiss Army Man” began as little more than a joke. “It was Kwan’s idea, originally,” Mr. Scheinert said. “He pitched me this idea of a guy stranded on a desert island finding a corpse and feeding it beans through a funnel, then riding the farts off into the sunset as beautiful music plays. ” The idea was too expensive to film as a short, but the two kept it in their voluminous backlog of weird ideas. And then another idea hit them. Why not make the corpse an amnesiac who must be reminded of the life he left behind to coax him to find his way back to civilization? That could be a feature, they thought. They toyed with various scenarios, and in 2014 the pair entered the Sundance Institute’s Screenwriter Lab. On their off hours, looking for a mental respite from “talking to all those genius filmmakers about how to make your script better,” they pitched a music video for “Turn Down for What,” a dance track by Lil Jon and DJ Snake. “We were like, this is the stupidest song we’ve ever been sent,” Mr. Scheinert said. “Let’s pitch the stupidest video we’ve ever pitched. ” In the video’s opening moments, Mr. Kwan simulates sex with a neighbor’s TV set, melts a police officer’s face and smashes potted plants against his crotch. “In my head, I was like, this might be the last music video anyone asks us to do,” he said. Instead, “Turn Down for What” became one of the most popular and critically acclaimed music videos of 2014, landing multiple MTV Video Music Award nominations and receiving nearly half a billion YouTube views. After completing the script for “Swiss Army Man,” Daniels began searching for the two leads. “I was in from the second or third page, from the moment Hank rides the farting corpse across the ocean,” Mr. Dano said. “It was so funny and absurd and beautiful and glorious, I was like, why didn’t I think of that?” Mr. Radcliffe soon followed, and the two began working   days in Half Moon Bay, south of San Francisco, and in the redwood forests outside Eureka, Calif. “The atmosphere that the Daniels create on set is like no other I’ve ever worked on,” Mr. Radcliffe said. “They’re so collaborative. Everyone there had either worked together for years on their music videos, or they’d known since college. ” Working with actors of that caliber was a rare treat for the directors. “It spoiled us,” Mr. Kwan said. “We’re used to working with bands who’ve never acted before, or with us and our friends, who don’t really act but just happen to be around. ” The result is not your typical zombie flick or screwball comedy. If anything, it’s a bromance of the purest sort, even though one of the bros is dead, sort of. It’s also a love story, complete with an underwater kiss and the discovery that Mr. Radcliffe’s penis can be used as a field compass. As teenagers, the directors were subjected to “hazing in high school,” Mr. Kwan said. “We were both very expressive boys, neither of us were that good at sports, and that was just something we lived with and kind of accepted. So it’s funny that we tried to make a survival film, which is the most masculine story there is, but ended up making the least manly survival film ever. The two of them sit in the woods, and they talk about their feelings. ”'"}, "time": 1742564305.037882}