{"duration": 0.03180432319641113, "input_args": {"text": "'Radio Aryan October 26, 2016 \\nDr Matthew Raphael Johnson joins Matthew Heimbach for Wednsdayâ\\x80\\x99s edition of The Daily Traditionalist to comment on geopolitics and starts by lamenting Albania being a member of NATO, when the country has no military force or hardware. Matt then brings us the news that a huge NATO force is amassing in the Baltics and Eastern Europe in the largest build up on Russiaâ\\x80\\x99s border for 3 decades and they are specifically calling these forces â\\x80\\x98battle groupsâ\\x80\\x99. Dr Johnson thinks Russia had really better watch out now that Albania is on board. \\nAlbania is well integrated into the EU hydra, yet itâ\\x80\\x99s whole economy is based upon whores and heroin. They claim their biggest business is agriculture, yet they import everything they eat from outside, which seems to be a common problem among recent EU members. The process seems to be to bring countries that were self-sufficient into partnerships where they will then have to rely on others. This has happened with various former Soviet countries that were brought into the EU and Matt brings us another example in Venezuela. Norway has now broken itâ\\x80\\x99s previous declaration to not allow American troops on itâ\\x80\\x99s soil and Dr Johnson reminds us that Norway is a competitor with Russia for oil supplies. \\nMatt points out that Russia has new updated nuclear warfare technology that the western media is calling â\\x80\\x98satanâ\\x80\\x99 and Dr Johnson thinks this move forward in technology was a reaction to the sanctions in Russia. It forced them to nationalise industries and do things for themselves and they will now be food independent by 2020. This is exactly what the NWOÂ doesnâ\\x80\\x99t want, a self sufficient nation able to defend itself without having to go cap in hand to America. \\nThe conversation then moves to America and Dr Johnson explains what polls mean when they say they are â\\x80\\x98over-samplingâ\\x80\\x99. This means that it is not a random sample but has been picked to over represent certain groups. The polls are just there to try and make it look less suspicious should they try to steal the election, because every form of registration online such as Facebook and Twitter shows Trump trouncing Clinton in supporters. \\nThe Democrats were given Hillaryâ\\x80\\x99s questions from the media before being asked and the evidence is there that hired thugs have alsoÂ been used to intimidate Trump voters. If this was happening anywhere else in the world it would be universally condemned as an invalid election. It is also completely illegal to shut down a political rally, yet we have seen this happen more than once. \\nIf the election was cancelled however, it would just mean more of Obama in office, so there are not really any options of what else to do if these felonies were actually prosecuted. The level of corruption is so high that it is clear to everyone, in fact America could be in a pre-civil war state at the moment. When similar staged elections took place after the Jew instigated coup in Ukraine, Donesk and Luhansk rose up and separated themselves from the rest of the country. Could something like that ever happen in America? \\nPresented by Matthew Heimbach and Matt Johnson \\nThe Daily Traditionalist: Speaking of Independence â\\x80\\x93 DT 102616'"}, "time": 1742628511.2401583}