{"duration": 0.03220200538635254, "input_args": {"text": "'Seattle Mayor Ed Murray responded to President Donald Trump’s signing of immigration enforcement executive orders calling it the “worst days for immigrants in America since Japanese Internment. ”[His comments came during a press conference where the sanctuary city mayor and several of his city council members decried the actions of President Trump to enforce existing law and secure America’s borders.   “Today is one of the worst days for immigrants in America since Japanese internment,” Murray proclaimed in a statement obtained by Breitbart Texas. “Just days after hundreds of Seattleites volunteered to support more than 1, 000 members of our immigrant community, President Trump sent a message back. He doesn’t respect our values and will exercise his power to threaten immigrants and our federal funding. ” Murray joined mayors from other cities across the country shortly after Trump’s election in November, Breitbart Texas reported. The move by these mayors puts their cities at risk of losing federal law enforcement grants.   General Lynch stated the “DOJ can take action against jurisdictions receiving grants when they are not in compliance with federal law,” U. S. Representative John Culberson explained in a statement obtained at the time. “If jurisdictions choose to implement sanctuary policies that prevent them from cooperating with federal immigration authorities, they are putting their federal grant money at risk unless they change their policy to comply with federal law. ” Murray doubled down on the City’s sanctuary policies stating, “I want to assure Seattle residents that while they are right to be alarmed about President Trump’s divisive vision, they should not be concerned that this City will be bullied into stepping away from its commitments and values. The City of Seattle will continue to protect the rights guaranteed to the City and its people by the United States Constitution and will challenge any unconstitutional policies that threaten the security of our communities. ” Bob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX.'"}, "time": 1742628490.1584108}