{"duration": 0.5023326873779297, "input_args": {"text": "'USA CREATED ISIS ,ALL EUROPEAN KNOW ABOUT THAT ,NOW WE’RE ALL SCARED NDMA \\nLet’s just remember who enslaves USA : which entity forced them to do so 😉 People like me even understand how : fewer still like some of my family members even did something about some of it 😛 There’s a reason it will all end : for the pathetic & desperate slaver fiends pretending to be friends ……… nathan sandiego \\njust imagine, GABE NEWELL, OWNER AND FOUNDER OF VALVE CONTROLLING AN ENTIRE MILITARY FROM HIS ARM CHAIR. NDMA \\nWhy would I bother doing that? I have better things I can work on 😉 nathan sandiego \\nHerbanlegend is my steam name NDMA \\nLife is better if we imagine how to replace the corruption that infests our world 😉 WW3 : not about guns, just permanently destroying all that powers the entitled peasants harming our ecology 🙂 MBruceQuarles \\nThat is awesome technology. God bless Israel! nathan sandiego \\nFuck Israel, bunch of zionists destroying what it means to be a Jew, turning back on God… they will soon be punished. dufas_duck \\nAmerican police have several local forces talking about arming the small drones that they are now using for survalence. In Arizona, the police think nothing of using helicopters to fire on suspected vehicles. If they kill innocent people, it doesn’t seem to matter any more than it does now….. NDMA \\nhttps://uploads.disquscdn.com/images/37fa3c31ef798b8d7c32d573e0cb260937becd817b7153c813ab7c104b835b96.jpg \\nhttp://www.haaretz.com/opinion/.premium-1.659480 seriously, Israeli propaganda and the dreams of desperate pirates aren’t fooling anybody : WW3, we’re coming for the entitled chumps indeed 😉 \\nmmmm going to be fun hunting them like Nazis : but we know who the most entitled be … those we will proudly make our victims during WW3 https://www.youtube.com/watch?v=u0AbIEH4biA already happily started slaughtering them all around the world … Aidan Rodrigo Johansson \\nThe reason that American police love just shooting people instead of actually working and risking their safety for the safety of the people is because they are blood thirsty cowboy dirty Harry brain washed psychopaths that love killing. It is American culture at the root, deep in the psyche. \\nThe police have been militarized. They dont do the job like in the old days. No more negotiators, Drs or counselling at the scene of the crisis, its just shoot bang bang boom yourr dead if you had a gun, knife, glow stick, sandwich, whatever. Gary Honeycutt \\nHow old are you? The old days you mention with negotiators and counselors came into vogue nationally in the 60’s, after a period of democrat rule notable for their most outstanding “accomplishment”: a huge escalation of criminals rights over those of victims. Note the escalation of crime since then. It seems you are also on the anti-cop bandwagon. I support them being able to defend themselves. Mistakes can be made in a split second, the same amount of time it might take for a criminal to kill a cop. I’m sure you can name victims of cops, do you realize what a small percentage of interactions between cops and the public they constitute? Unfortunately, the justified shootings like the Ferguson case are unfairly included in many of our perceptions. First and foremost: don’t commit crime. That improves your odds drastically. Next, comply with orders given by the police. If you were raised to treat the police as hostile someone failed you. Guilty or innocent, comply! The police are just trying to do their job, don’t complicate it. I’ve seen many an arrest where a person taunts and struggles with the police even up to resisting being put in the car. Try walking a mile in their shoes. They are trying to keep the public safe and they have a right to be safe themselves. fluffnik \\n“Guilty or innocent, comply!” \\nLand of the free? \\nMost places are successfully policed by consent, and without shooting their citizens or suffering much crime. Gary Honeycutt \\nYes, if an officer wants to see identification he has a reason. If he wants you to keep your hands in plain sight he has a reason. He is possibly ruling you out as a person of interest that was seen in the area. Imagine how much more efficiently that would go if each person would refrain from shouting about their rights for 40 minutes before complying. If you are the person in question the transaction could be handled in a couple of minutes and you’ll be gone without any violence or hard feelings. If you pay taxes you will have helped us get our moneys worth. Of course, if you’ve seen the news and the reality shows You may have the impression that a lot of these guys that are giving a cop a load of crap probably live off of what you are paying to the government. Mike \\nWasn’t raised hostile to cops, family members are cops as a matter of fact. This is America. If I’m not committing a crime, or suspected of it, don’t ask me for papers. Don’t detain me. Don’t run DUI checkpoints. Those are infringements on all of our freedom, which I assume we love. Safety is what the left uses to excuse their behavior. Safety is a fallacy. dufas_duck \\nI have had 5 police officers in my extended family. It got to the point that none of them were welcome into the rest of the family’s homes. They were eventually never invited to family get to gathers. They were rude, overbearing, malicious individuals, constantly bragging how they screwed some person and taught them how the world really should be. Their treatment of family members were more along the line of petty dictators where no matter the subject, some familly member was wrong. Petty things like they didn’t like the car they bought, or their haircut, or the job they worked at…. They were not satisfied with anything or anybody… \\nThey brought their street attitude home with them. They couldn’t keep wives or husbands or significant others for very long. They were arrogant, mean, and only thaought of themselves..anybody else was in their way…. \\nI have seen gang members that have more ethics than these police and their freinds….. Gary Honeycutt \\nMy great-grandfather, his son-in-law (my grandfather)and his son, my uncle were all cops, the oldest and youngest for their whole careers. All deeply religious, highly moral men. dufas_duck \\nThat is great, if they were straight arrow, we need more like them. My cop relatives and their friends would fit right in in the Crips, the Bloods, or just about any outlaw motorcycle club. No one but other cops were ‘proud’ of them. My family sure wasn’t proud of them… Gary Honeycutt \\nMaybe they became hardened by what they faced daily? East side of Detroit? South side of Chicago? People are products of their environment. Maybe the cops in Branson, Mo. and such places are nice guys. What is the ratio of cops to citizens? Let’s say you’ve got a playground with 60 10 year olds. You get a dozen 10 year olds to keep order among them. If the 60 are from Sierra Leone and the dozen are American boy scouts there’d be 12 dead Americans in short order. Any dead among the 60 would’ve been killed by their own. So what do we expect of cops who grew up without a rap sheet, graduated from school and passed the academy. You think 10 years of patrolling the gnetto might change them? They surely know the realities of the job better than we do. How do the ones who aren’t in Mayberry do a 20 or 30 year career in an inner city where shooting a cop makes you a hero and not resisting arrest makes you a pussy? dufas_duck \\nI do know that where I grew up, the police at least tried to keep the officers from getting street hardened. They rotated officers to different districts every month. But then, they found thst the police were trading assignments. Some cops didn’t want to rotate out. They wanted to stay where they were… No explaination was given by any officer,[at least publically, no answer was given..] \\nMany thought the cops were up to no good and wanted to stay in their own area to protct their interst… dufas_duck \\nYou just gave the cops an excuse to act like gang members…. Gary Honeycutt \\nI don’t think so, but you don’t throw choirboys in blue to the wolves in the ghetto any more than you send a S.E.A.L. team to lifeguard the kiddie pool. dufas_duck \\n“……. send a S.E.A.L. team to lifeguard the kiddie pool.” \\nYou haven’t checked out what school cops have been doing as of late then…? A 5 year old in handcuffs or throwing an 8 year old to the ground doesn’t work out to be the way to increase trust among the populace…… Anthony Fredericks \\nI will end this stupidity of your right now GARY. I work with Police EVERY single day as a EMT. EVERY DAY! I am a qualified expert on how Police act on scene…Most of them are VERY arrogant, Rude and aggressive towards people. SHUT UP!! or BE QUIET!! is the first thing you normally hear from a cop, You ALWAYS see them put someone on the ground. Even if that person is the one who called them for help. If they don’t like you..BOOM! face down, knee on your neck, cuffs on. Approximately 25% are not like this. But the other 75% are. THIS IS REALITY GARY! And I have worked in SEVERAL cities in different areas…And it is all the same. Police are overbearing and have a chip on their shoulder against the general public…And a lot of them take it out physically on them. Gary Honeycutt \\nMy sympathies for the flaw in your family’s DNA. dufas_duck \\nLuckily, the flaw was only in the extended family tree…inlaws, marriages, etc…… ;-> Gary Honeycutt \\nMost people who oppose DUI checkpoints have a reason. I’ve always seen a problem with bars having parking lots when it is illegal for good reason to drink and drive. I don’t mind providing my ID when a cop asks for it. When it’s done without giving him any lip it is over quickly without incident. He’s just trying to do the job we are paying for. If you want to launch into a 40 minute tirade about your rights you’ll be there 40 minutes longer, make it a bad night at work for the cop and wind you all up, maybe you like that. Some people love drama. Mike \\nThe reason is, it’s an infringement on your rights, and unnecessarily exposes you AND the Officers to a potentially dangerous confrontation. There is no way you believe that *unwanted* contact that is forced upon Officers and the public increases their safety. I wouldn’t blame the Officers for the policies they have to enforce, however the higher ups never pay when things go wrong after the fact. The problem with being law abiding is that by doing nothing wrong, you don’t see the infringement of your rights, and tolerate them. Just because you aren’t guilty of anything, doesn’t mean your rights aren’t being taken from you. What if “for safety” we decided that all firearms need removed from private citizens? What if we decided that TSA should run mandatory random checkpoints all over the US, creating 2 hour delays? What if we decided that anyone that supports Trump may be a violent extremist and should be stopped for questioning? Do you see where this goes? \\nI don’t like the immigration ones inside the states of the Southwest, I don’t like the “agricultural” ones into California, and I don’t like the DUI checkpoints in the South. I’m a legal resident, don’t transport crops, and don’t drink, yet I oppose all of them. The idea behind them is well-meaning, the execution is unlawful IMO. Obviously the courts don’t think so, or they’d not exist. Gary Honeycutt \\nIt is the officers job to initiate that confrontation despite the risk to himself. He does it to lessen the chance that a drunk will run over you daughter at a crosswalk. He stops people who fit the description of a wanted person in hopes of catching a criminal before he claims another victim, perhaps raping your daughter. What would you do in his place? Mike \\nYou are confusing the issues here. Zero issue stopping and talking with someone who is suspected or witnessed committing a crime. \\nDUI checkpoints are 100% stop and question, with zero probable cause. Have you been in states where they run these? The road is barricaded, even turning around prior to the checkpoint leads to confrontation with the police as you are ASSUMED to be committing a crime for not wanting to be questioned. You are within your rights to be polite and refuse the checkpoint, but the fact that they exist trouble me. As do any checkpoints, as they are not based on probable cause. Gary Honeycutt \\nAnd you’ve seen these checkpoints at 1pm by a suburban Baptist church? No! The probable cause lies In them being near “the strip” at 1am where there is a history of alcohol-related incidents. Mike \\nI lived in the South, these things were not targeting a specific demographic as far as I could tell, and while not at 1PM that I can recall, they weren’t that late, and they sure could have been in front of a baptist church. I could have been naive about who was being targeted (I wasn’t just waived through once they saw my skin color), but my point is that the location doesn’t matter, nor does the target demographic, if there is one. They are unjust, and just like every other forced interaction with law enforcement, does not serve to increase the safety of LEO’s. \\nIf police pull me over because a car that looks like mine just robbed a quickie mart, or a guy like me was just reported for beating his wife or ran off with a kid, I do not have a problem with that. They have probable cause, and the risk to their safety and mine is worth it, because they may be stopping a criminal. Stop me, detain me for a reasonable time until they can prove I am or am not who they are looking for, then let me be on my way. \\nHowever, I’ve been stopped in a rural area for making a right turn on red (perfectly legal in my state) and the officer was a complete ass. Enough that had I a short fuse, it could have quickly escalated. After that encounter, and talking with the state about why the previously posted “no turn on red sign” had been removed from that intersection for a couple of months, the fact that this officers supervisor backed him up for an unlawful stop, and threatening that they could have written me up and I would have to prove in court I didn’t break the law, just proved to me that SOME police are uninterested in doing what is right depending on the circumstances. That officer had no reason to stop me (although I suspect since it was near his house, and he is a rural county officer, he couldn’t control his road rage) and by doing so, he put himself at risk, as well as me. There are a million “what ifs” in that situation, not the least of which was the fact that even though he pulled me over in the dark, along a fairly rural road, by himself, he didn’t call in the stop, which is procedure for that department. I could have ended up shot, or he could have, and dispatch would have never known. \\nIncreasing negative interaction with the public, is never in a LEO’s best interest for safety and reputation of the police as a whole. dufas_duck \\nI guess that’s why the police looking for a skinny Black man that is wearing a white sweatshirt and is 6 foot that just commited a robbery would shoot a short 5foot 5 kid wearing a dark gray sweat shirt in the back as he was walking down the sidewalk at a fast pace. Turned out that the man they shot was pizza delivery in a hurry to deliver the next order before it cooled off. \\nPolice shooting two small white females in a light blue pickup truck while the cops were looking a huge black man in a dark gray pickup truck is perfectly A-OK. \\nIn the town that I live in, police shot and killed a 15 year old kid while he slept… Maybe we should all congraduate the officer because he only used three bullets, he could have emptied his clip… \\nMaybe the cops that you love are making things more efficient by killing anyone and everyone to save the taxpayers that you are so worried about any money. A couple of bullets is cheaper than some cop’s time to find out what really is going on.. \\nOf course, some of those evil people’s relitives will probably sue, but so what, the tax payers will take care of that.. \\nHow do you feel about cops who demand sex from some random female and when she refuses, gets arrested for your ‘non-compliance’… \\nYou would love my uncle. He was a cop and really got off when he could beat or kill someone. After about fifteen years of bullying, beating, killing, and making false charges against people, the force finally fired him…meanwhile, he ruined hundreds of lives and they were not you welfare people that he abused, it was anybody he could screw with… \\nBut, in your mind, police can do no wrong..maybe you are right, police are always telling us that they never do anything wrong, especialy when they investigate themselves or have a friendly agency do the investigation….. Gary Honeycutt \\nI don’t deny that there are a small percentage of cops that shouldn’t be or wrong split-second decisions sometimes. Think about how many police officers there have been over the span of time you draw your examples from. Think about the number of times per day that an LEO comes in contact with a citizen. That taken into account, bad contacts are extremely rare. The sensationalism of all these female teachers having sex with students is stuck in everyones mind but they don’t consider the huge number of teachers and students and note how statistically rare these incidents are. The incidents don’t sour me on the entire education system. We need law enforcement. You are good at pointing out the flaws but do you have a solution? Will any form of policing be perfect? What is? dufas_duck \\nHow about having honest police and policing. While percentage wise, there is a small number of truley bad cops….. But, [there is always a but]… A large percentage of your ‘good’ cops will keep silent, lie, or even cover for the bad cops. That extends up through the ranks to the top of the police forces. Those honest cops that do come forward are setting themselves up to fail and eventually destroy their careers..cops don’t like whistleblowers. \\nThe example you used, teachers having sex with students is perfect. Once it is found that a teacher has crossed the line, even a suspicion that the teacher has done something will bring immeadiate consequenses. Not so within the police. A bad policeman can get away with things multiple times, sometimes going on for years. The upper eschalon figures out ways to cover for the errant cop at almost every turn. Even if convicted, the court system will come in later on appeal and remove parts or all of any punishment. \\nFor years, the public was kept in the dark about ‘the bad cop’. Very few were brought to justice. Only the very extreme cases of crooked cops were adjudicated. It is just lately, after public attention, that the police are starting to somewhat clean house. \\nThere are child molesting police officers that are still working as officers. Many are just put on probation, others are allowed to retun to police work after their incarceration. \\nIt would also be a boon to the public if we had a justice system instead of a legal system. A legal system can be whatever it’s practicinors want it to be. A justice system looks for truth no matter where it points to. Quilified and absolute immunity for police, DAs, judges does not lend itself to anything close to ‘justice’….. \\nPolice are a necessary evil…the are some evil people in the world, it is just too bad that many of them are police officers. Gary Honeycutt \\nKeep silent, lie, or even cover? Turn off the TV and go out i to the world. Some will agree with you but if you’d said the same thing about black people there’d be trouble. Don’t you think just about any group might share the same likelihood of bending the rules? They also don’t like criminals in uniform and are just as likely to line up against a bad apple. Do cops get away with small indiscretions and occassionally a major crime? Probably, but more so than the general population? Interesting take on the teacher thing. I remember a fellow who got a job as a girls basketball coach at a very small rural school. He was no prize in his youth and I guess when an equally awkward underage player on his team developped a crush on him he couldn’t resist. She got pregnant. And to add to a volatile situation, her uncle was the superintendent of schools! Flash ahead maybe 10 years give or take and I’m a teacher and football coach in that same system at a slightly larger rural school. I work with a married couple, both tenured teachers, probably on full retirement now after full careers without ever being fired, downsized, transferred, or any of the other things that may befall teachers during their careers. The hubby is the boys basketball coach and unofficially the assistant principle. Guess who? Yep! dufas_duck \\nI’ve been out in the world for over 75 years. Been beat by cops and then have them later discover I wasn’t the perp they were looking for. I was only lucky in that the cops didn’t make up charges to cover their tails., they just lied about what went down and covered for each other. In this instance, everything happened because I was driving the same make, model, color, and year of vehicle that was used in a felony crime. On the way to jail, a radio message came in telling the cops to stand down, the perp had been caught and identified. The cops just turned around and dumped me back at my vehicle…. \\nI think if you would re-read what I posted, It was the cops that I refered to as being giged for turning in another cop, not the teachers. In todays world, a teacher will be messed with just on a rumer. If you as a coach had rumers that you were messing with the kids, I don’t think you would have lasted in that position…unless you are stating you were messing with the kids and no on ratted on you??? Gary Honeycutt \\nNo, I wasn’t referring to myself. I was an outsider where the good ol’ boy superintendent had a slew of relatives and even more buddies on the payroll. I think the guy in my story should’ve done time and never been allowed to work with kids again. dufas_duck \\nAddendum: \\nI get the feelig[?] that you are the type that if a policeman makes a mistake, the officer should get a pass because everybody makes mistakes. Police are supposed to be trained on how to back off those split second decisions. Even in the military, soldier makes a mistake and if it is not covered up, the soldier faces the consequenses… But, there are many that think that the killing some kid by a policeman is A-OK. Like the two policemen that were canvassing a nieghborhood, knocking on doors and a 13 year old kid opens the door while holding a PS3 game controller. Cop shouts gun and 13 shots later…an innocent kid is dead and bleeding out in his own home while the Playstation is running in the background and the cops get another pass…. That’s the kind of policing that you want?? \\nYet, a mechanic makes a mistake while repairing or sevicing your vehicle and it leads to a death of an innocent person…the mechanic can be held liable… Both were mistakes…why should a mechanic be held responsible and the cop not be?? Anthony Fredericks \\nThere’s NO EXCUSE for killing a person Gary!!! We have laws against that! No “i’m Sorry” brings back people after being killed by over reacting cops. NO! GARY! accidents like that are NOT! EXCUSABLE!!! I don’t care what job you have. Soldiers in warzones who kill innocent people are brought up on charges of murder. Why would it be o.k. for a stupid beat cop to be able to do it??? Gary Honeycutt \\nSelf-defense is a valid reason, and the police have as much right to it as anyone and more likelihood to find themselves in that situation due to the nature of their jobs. People like to argue the case of an unarmed attacker. Should only MMA champions be allowed to be cops? An unarmed attacker can kill you. If someone breaks into my house at night I will do whatever it takes to keep him from doing harm to myself or family, I will not wait to see if he’s armed or ask his intentions. I won’t refrain from using a weapon because I don’t see him with one. It is not a high school wrestling match. We won’t get up and shake hands after it is decided by score. If this same criminal finds me awake and decides to leave at once I will call a cop. It is his job to confront this person and resistance by the suspect places him in the same situation I was in when someone invaded my home. fluffnik \\nI live in Scotland where the police do not routinely carry guns, mostly no-one dies. Anthony Fredericks \\nYou mean like the guy who got shot in his car for trying to give his I.D. to the cop? Or maybe you are talking about the social worker that was trying to bring back his Autistic patient and the com while he was on his back with his hands straight in the air? How about those huh GARY!?!?!? I could go on and on but a close minded sheep like you would never see the forest through the trees…. Anthony Fredericks \\nSO Gary if I seen you walking towards me on the street, Got scared because you LOOKED dangerous and I “accidentally” defended myself by blowing your head off, Then all I have to say is “oh, sorry my bad” and because accidents happen everything is o.k. right? Take your head out of the sand…Police kill people when they think their AUTHORITY is being challenged not their lives. They are protecting their ego’s. Mike \\nWhile I won’t disagree completely with your statement, blanket statements are never correct. SOME police may kill from challenges to authority. In most cases it is a kill or be killed split second decision that we, not being in the exact same position, should not second guess. What we SHOULD be second-guessing, are the supervisors, chiefs, and elected officials who hire bad cops, improperly train their officers, and put officers in harms way where they should not be. The higher-ups NEVER pay the price for those under them, whose actions they are responsible for. That is a very real problem. If we want change, we need to hold our elected officials responsible for the behavior of the officers that indirectly work for them. \\nPrograms such as stop and frisk, checkpoints, etc., all require a confrontation with individuals that do not need to occur. That puts officers and the public’s lives at risk, neither is acceptable. The easy solution is to stop making the confrontations occur. But you do something stupid (Michael Brown) you deserve what you get. \\nI wish organizations like black lives matter would pick individuals to use as martyrs who were actually victims. There are a lot of people who would agree with some of the basic ideas espoused. But when you choose the perpetrators of crime who just happened to get theirs as your martyrs, you expose your cause as being about something other than justice. Gary Honeycutt \\nYou can put that example back where you pulled it from…if your head isn’t in the way. BJ \\nThat’s actually standard in every part of the world except USA. It’s normal for police to protect and serve – it is not normal for police to shoot first, ask later… Jack McCauley \\nWill someone hurry and inform the USA… jeeeez, it’s embarassing.. TroothFairy'"}, "time": 1742561681.3230317}