{"duration": 0.047623395919799805, "input_args": {"text": "'Rwanda & The Philippines rate better than UK for gender equality, study... Rwanda & The Philippines rate better than UK for gender equality, study shows By 0 127 \\nBritain is lagging behind countries including Rwanda, the Philippines and Nicaragua in a global ranking of gender parity, slipping to 20th place on the World Economic Forum (WEF) index. \\nRead more \\nThe WEF, a not-for-profit based in Switzerland, analyzed data from 144 countries. It found the global gender gap has widened to its largest extent since 2008. It estimates economic gender parity won’t be achieved for at least another 170 years. \\nThe US and Australia are even further behind than Britain, however, at 45th and 46th place respectively. \\nThe UK’s 2016 rankings – which take into account key areas such as the economy, politics, education and health – mark a slide from ninth position in 2006. \\nBritain sits at number 53 for economic participation. This reflects a drop in the number of women in senior and technical positions, as well as a reduction in the estimated income women earn compared to men. \\nThe UK is ranked 24th for political empowerment, because of a fall in the number of women parliamentarians, the WEF said. The figures do not take into account Prime Minister Theresa May’s rise to Downing Street. \\nRead more \\nRwanda, by contrast, has the highest share of women in parliament globally at 64 percent. \\nJemima Olchawski, head of policy and insight at the Fawcett Society, told the Express: “It’s unacceptable that Britain is languishing at 53rd in the world for economic participation, is only 24th for political empowerment and performs below average compared to our region. \\n“The moral case for gender equality should be enough alone to motivate us to speed up the pace of change, but with evidence suggesting that improving gender equality could add £150 billion [US$183 billion] to our GDP it’s also clear that we simply can’t afford to wait.” \\nThe Philippines scored full marks on a measure of the birth ratio and life expectancy of women. \\nWEF says the top 10 countries for gender parity are: Iceland'"}, "time": 1742564222.3259153}