{"duration": 0.10004878044128418, "input_args": {"text": "'JERUSALEM  —   Speaking to Breitbart News during a trip to Israel, former Arkansas Governor Mike Huckabee hailed President Donald Trump’s historic trip to Israel and urged the president to fulfil his campaign promise to move the U. S. embassy from Tel Aviv to Jerusalem despite pressure against such a move. [“I think this is a historic trip,” said Huckabee. “He made the first ever flight from Riyadh to Tel Aviv. We had the first sitting U. S. president go to the Western Wall and offer a prayer. I think that is incredibly significant. ”  Huckabee said that Trump has been “very vocal in his support for Israel and I think that the people here sense it. ” Continued Huckabee: I also hope with all my heart that he will keep his campaign promise to move the U. S. embassy. I know there is enormous pressure for him not to do that. The rationale is that it will make certain people unhappy. Whoever those people are, they are unhappy already. They are not going to be made happy by the location of the U. S. embassy. Huckabee said Trump’s visits to Israel and Saudi Arabia have demonstrated that a “very strong America is much better than a weak America. This is so incredibly different from the eight years of Barack Obama’s administration. ” “The reception that Trump received in Saudi Arabia was a stunning contrast to the one received by Barack Obama,” he continued. “In Obama, they [the Saudis] saw a weak American leader, whereas with Trump they see someone who exhibits strength. Whose strength in leadership is out front. They might not have agreed with everything that Trump said [in his address in Saudi Arabia] but they have to respect that he spoke the truth. ” Huckabee, who ran against Trump in the 2016 presidential election before endorsing him, is in Israel on a brief tour with   American activist Dr. Joseph Frager. On Sunday night, Huckabee and Frager went for a nighttime visit to Joseph’s Tomb, Judaism’s third holiest site, located in a complex controlled by the Palestinian Authority. “It’s an amazing experience to have to come to this type of difficulty just to be able to come to a holy site for Jews and frankly even for Christians, who pay tribute to Joseph,” Huckabee said at the site, according to Ynetnews. “To have to do it in the dead of night, under armed guard, with the smell of tear gas in the air, burning tires along the route, it’s a stark reminder [of how different] it is in the heart of Israel, where the Israeli government protects every Muslim that accesses their holy site,” he added. “In Judea and Samaria [the West Bank] Jewish people do not have unhindered access to holy sites without having to go to extraordinary lengths in order to be able to access these places. ” Huckabee will also attend the annual Moskowitz Prize for Zionism reception. The prize was “established in recognition of the people who put Zionism into action in today’s Israeli society  —   at times risking their own personal security, placing the collective before personal needs and doing what it takes to ensure a strong, secure Jewish homeland. ” It was established by the late   Irving Moskowitz, whose wife Cherna continues the family’s philanthropy. U. S. law requires the relocation of the embassy to Jerusalem. However, President Obama signed successive waivers delaying the move. The current waiver expires on June 1. Numerous reports in recent days cited White House officials saying that Trump is not expected to use the visit to announce an embassy move. Still, that prediction is subject to change. Even if Trump does not announce an embassy move, there are   that could be put into place, including the possibility of David Friedman, the U. S. ambassador to Israel, setting up shop at the U. S. consulate in Jerusalem instead of the beachfront embassy building in Tel Aviv. Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio. ” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.'"}, "time": 1742563748.7433753}