{"duration": 0.03160262107849121, "input_args": {"text": "'MILO, who recently resigned as Breitbart senior editor, made a public statement at a press conference in New York City explaining his history with abuse and his reasons for leaving Breitbart.[  “I am a gay man, and a child abuse victim. ” wrote MILO in a Facebook post shortly after his press conference, “Between the ages of 13 and 16, two men touched me in ways they should not have. One of those men was a priest. My relationship with my abusers is complicated by the fact that, at the time, I did not perceive what was happening to me as abusive. I can look back now and see that it was. I still don’t view myself as a victim. But I am one. Looking back, I can see the effects it had on me. In the years after what happened, I fell into alcohol and nihilistic partying that lasted well into my late 20s. ” MILO continued, “I’ve reviewed the tapes that appeared last night in their proper full context and I don’t believe they say what is being reported. Nonetheless I do say some things on the tapes that I do not mean and which do not reflect my views. My experiences as a victim led me to believe I could say anything I wanted to on this subject, no matter how outrageous. But I understand that my usual blend of British sarcasm, provocation and gallows humor might have come across as flippancy, a lack of care for other victims or, worse, “advocacy. ” I am horrified by that impression. ” Apologising for his any hurt his words may have cause saying, “The remarks I made on podcasts and interviews more than a year ago were about my personal life experiences. I will not apologize for dealing with my life experiences in the best way that I can, which is humor. No one can tell me or anyone else who has lived through sexual abuse how to deal with those emotions. But I am sorry to other abuse victims if my own personal way of dealing with what happened to me has hurt you. ” And further explaining his reasoning for his resignation from Breitbart MILO said, “My employer Breitbart News has stood by me when others caved. They have allowed me to carry conservative and libertarian ideas to communities that would otherwise never have heard them. They have been a significant factor in my success. I’m grateful for that freedom and for the friendships I forged there. I would be wrong to allow my poor choice of words to detract from my colleagues’ important reporting, which is why today I am resigning from Breitbart, effective immediately. This decision is mine alone. ” “When your friends have done right by you, you do right by them. For me, now, that means stepping aside so my colleagues at Breitbart can get back to the great work they do. ” said MILO. “I regret the things I said. I don’t think I’ve been as sorry about anything in my whole life. This isn’t how I wanted my parents to find out about this. ” “Don’t think for a moment that this will stop me being as offensive, provocative and outrageously funny as I want on any subject I want. America has a colossal free speech problem. The land of the First Amendment has some of the most oppressive social restrictions on free expression anywhere in the western world. I’m proud to be a warrior for free speech and creative expression. I want everyone in America, the greatest country in the history of human civilisation, to be able to be, do, read and say anything. I will never stop fighting for your right to do that. ” Read MILO’s full statement on Facebook.'"}, "time": 1742628506.741561}