{"duration": 0.12780499458312988, "input_args": {"text": "'On Breitbart News Sunday, the Angel Moms who lost children or other loved ones to illegal alien crime said that the Trump administration plans to support a program aimed at helping American families devastated by illegal immigration put their lives back together. [Hundreds of   programs assist illegal aliens, but not a single program exists specifically to help American victims of illegal alien crime, they told SiriusXM host Matthew Boyle.  Organized by the Remembrance Project’s Maria Espinoza, the Angel Moms described the immense emotional and financial costs burdening their families —  and government’s complete indifference. “The national program we put forth —  Mr. Trump is the only candidate who met with us, of course, but also who agreed to support the Remembrance Project national program that would help with burial, medical, and counseling expenses,” said Espinoza. “Also, what’s very important that people don’t understand that in so many cases, our families are being   because they’re being misguided in the court system. Either activist judges, or activist prosecutors —  so we really need someone to help and guide our families. ” “Who can afford an attorney for themselves? And here illegal aliens get one. If they murder an American, they are given two attorneys to protect them, to defend them,” she added. Ruth Johnston Martin, whose husband was shot by an illegal alien, said there is not one government program out there to help those suffering a loss due to illegal alien crime.  “Well, first of all, everyone listening has a family. Just imagine waking up one day and having one of those family members ripped away from you in such a violent and horrifying way. You’re never the same. You need that counseling,” she said.  “You have to understand the depression that sets in —  these individuals need something, someone to reach out to. Someone that’s going to circle the wagons around them. That program will be that source. It’s a resource. And you know, it is true —  there’s over 300 programs for illegal aliens,” Martin continued.   “But there’s nothing to help the families of those who have lost loved ones at the hands of these individuals. So they don’t have to suffer in silence. They have someone they can reach out to. ”  “There’s many that just go into a state of depression. There are some that commit suicide. There are some that go to drinking. It doesn’t have to be that way,” she said. “They need the assistance, and it’s about time we had a president that says, ‘You know what, you’re an American. We’re here for you. We’re here to assist you.’ And that is exactly what he will do. ”  Laura Wilkerson, who summoned the strength to tell the story of her son Joshua’s violent death at the hands of an illegal alien classmate over and over again, said the trauma can leave one unable to live a normal life, or even do everyday tasks.  “When you lose a child, and the trauma that is involved with Josh’s case, you are just absolutely broken to the core. You don’t know if you can breathe. I mean really, it’s a start to learn to breathe all over again and learning to crawl, and then to walk,” she said. “You feel like an infant. Your mind knows that you’re not, but you can’t help but have the trauma with it. ”  “I sat in the trial and watched this kid who was just excited about what he did to Josh, and he got up off the stand and demonstrated to the district attorney about how he strangled Josh, and he never had an ounce of remorse. And, this was two years after Joshua died,” she said. “It was two years before it was brought to trial. And then you sit there and watch him just excited about what he did to Joshua. You’ve never been faced with the evil, and with the trauma. ” “My husband and I own a small business, and it’s very hard to —  you know, you’re scrapping and fighting every day to make it anyway, and you can’t do the things you used to do. And it takes you a long time to process that your child is not coming back, ever, and then on top of that to just do daily things. I couldn’t make a meal for my family for probably about a year and a half,” she said. “You know something’s messed up, and you just can’t do it. ” “Everything becomes like climbing a mountain, and you really need help,” she added.  Legal immigrant Agnes Gibboney, whose son Ronald da Silva was murdered in 2002 by an illegal alien, said families desperation need lawyers in their corner when fighting for justice.  “With this national program to allow families to have legal representation, so your rights won’t be violated in a court of law,” she said, adding she only had the prosecutor to look out for her. “Everything went wrong. I was not allowed to say my impact statement. I was not allowed to address the court. I was not allowed to get the probation hearing report. And when I called them to ask how come I didn’t get it, they said, ‘My boss told me not to talk to you,’ and hung up. ” Wilkerson said she paid out of her own pocket for an attorney just to sit through the trial of her son’s murderer. “They didn’t want me to sit in the trial, and I had to hire an attorney just to make that happen. ” She “couldn’t imagine” not being present in the courtroom while others heard about the death of her son. Breitbart News Sunday airs weekly from 7 PM to 10 PM EST on SiriusXM Patriot 125. LISTEN:  '"}, "time": 1742563566.8347743}