{"duration": 0.861616849899292, "input_args": {"text": "'Joachim Neander was a   Calvinist theologian who often hiked through a valley outside Düsseldorf, Germany, writing hymns. Neander understood everything around him as a manifestation of the Lord’s will and work. There was no room in his worldview for randomness, only purpose and praise. “See how God this rolling   with beauty as a robe,” one of his verses goes. “Forests, fields, and living   its Master’s glory sings. ” He wrote dozens of hymns like this  —     and  . Then he caught tuberculosis and died at 30. Almost two centuries later, in the summer of 1856, workers quarrying limestone in that valley dug up an unusual skull. It was elongated and almost chinless, and the fossilized bones found alongside it were extra thick and fit together oddly. This was three years before Darwin published “The Origin of Species. ” The science of human origins was not a science the assumption was that our ancestors had always looked like us, all the way back to Adam. (Even distinguishing fossils from ordinary rock was beyond the grasp of many scientists. One popular method involved licking them if the material had animal matter in it, it stuck to your tongue.) And so, as anomalous as these German bones seemed, most scholars had no trouble finding satisfying explanations. A leading theory held that this was the skeleton of a lost, bowlegged Cossack with rickets. The peculiar bony ridge over the man’s eyes was a result of the poor Cossack’s perpetually furrowing his brow in pain  —   because of the rickets. One British geologist, William King, suspected something more radical. Instead of being the remains of an atypical human, they might have belonged to a typical member of an alternate humanity. In 1864, he published a paper introducing it as such  —   an extinct human species, the first ever discovered. King named this species after the valley where it was found, which itself had been named for the ecstatic poet who once wandered it. He called it Homo neanderthalensis: Neanderthal Man. Who was Neanderthal Man? King felt obligated to describe him. But with no established techniques for interpreting archaeological material like the skull, he fell back on racism and phrenology. He focused on the peculiarities of the Neanderthal’s skull, including the “enormously projecting brow. ” No living humans had skeletal features remotely like these, but King was under the impression that the skulls of contemporary African and Australian aboriginals resembled the Neanderthals’ more than “ordinary”   skulls. So extrapolating from his low opinion of what he called these “savage” races, he explained that the Neanderthal’s skull alone was proof of its moral “darkness” and stupidity. “The thoughts and desires which once dwelt within it never soared beyond those of a brute,” he wrote. Other scientists piled on. So did the popular press. We knew almost nothing about Neanderthals, but already we assumed they were ogres and losers. The genesis of this idea, the historian Paige Madison notes, largely comes down to flukes of “timing and luck. ” While King was working, another British scientist, George Busk, had the same suspicions about the Neander skull. He had received a comparable one, too, from the tiny British territory of Gibraltar. The Gibraltar skull was dug up long before the Neander Valley specimen surfaced, but local hobbyists simply labeled it “human skull” and forgot about it for the next 16 years. Its brow ridge wasn’t as prominent as the Neander skull’s, and its features were less imposing it was a woman’s skull, it turns out. Busk dashed off a quick report but stopped short of naming the new creature. He hoped to study additional fossils and learn more. Privately, he considered calling it Homo calpicus, or Gibraltar Man. So, what if Busk  —   “a conscientious naturalist too cautious to make premature claims,” as Madison describes him  —   had beaten King to publication? Consider how different our first impressions of a Gibraltar Woman might have been from those of Neanderthal Man: what feelings of sympathy, or even kinship, this other skull might have stirred. There is a worldview, the opposite of Joachim Neander’s, that sees our planet as a product of only tumult and indifference. In such a world, it’s possible for an entire species to be ground into extinction by forces beyond its control and then, 40, 000 years later, be dug up and made to endure an additional century and a half of bad luck and abuse. That’s what happened to the Neanderthals. And it’s what we did to them. But recently, after we’d snickered over their skulls for so long, it stopped being clear who the boneheads were. I’ll start with a confession, an embarrassing but relevant one, because I would come to see our history with Neanderthals as continually distorted by an unfortunate human tendency to believe in ideas that are, in reality, incorrect  —   and then to leverage that conviction into a feeling of superiority over other people. And in retrospect, I realize I demonstrated that same tendency myself at the beginning of this project. Because I don’t want to come off as   or as pointing fingers, here goes: Before traveling to Gibraltar last summer, I had no idea what Gibraltar was. Or rather, I was sure I knew what Gibraltar was, but I was wrong. I thought it was just that famous Rock  —   an unpopulated hunk of   geology, which, if I’m being honest, I recognized mostly from the Prudential logo: that limestone protuberance at the mouth of the Mediterranean, that elephantine white molar jutting into the sky. True, I was traveling to Gibraltar on short notice when I   the director of the Gibraltar Museum, Clive Finlayson, he told me the museum happened to be starting its annual excavation of a Neanderthal cave there the following week and invited me to join. Still, even a couple of days before I left, when a friend told me she faintly remembered spending an afternoon in Gibraltar once as a teenager, I gently mansplained to her that I was pretty sure she was mistaken: Gibraltar, I told her, wasn’t somewhere you could just go. In my mind, I had privileged access. I pictured myself and Finlayson taking a special little boat. In fact, Gibraltar is a peninsula connected to Spain. It’s a lively British overseas territory, with 30, 000 citizens living in a city on its western side  —   a city with bakeries and clothing stores and tourists buying all the usual kitsch. Some unusual kitsch, too  —   like a laminated child’s place mat I spotted that, in a typical tourist destination, might say something unexceptional like SOMEONE WHO LOVES ME WENT TO GIBRALTAR, but here read WE SHALL NEVER SURRENDER! BRITISH FOREVER! The history of Gibraltar, given its strategic location, is a grinding saga of military sieges and ruthlessly contested changes in ownership. The residue of that strife, today, is a pronounced British patriotism and a   exchange of slights with Spain, which still disputes Britain’s claim to the territory. After Queen Elizabeth II’s Diamond Jubilee, in 2012, when Gibraltar projected towering images of Her Majesty on a   side of the Rock  —   “a clear act of provocation,” one reporter called it  —   Spain began inspecting vehicle after vehicle at the border, backing up the line for hours, stranding the bulk of Gibraltar’s work force, who commute in every day. The afternoon I showed up, activists from a   Spanish political party had crossed into Gibraltar and hung an enormous Spanish flag high up on the Rock. This wasn’t just mischief. It was regarded as an act of symbolic terrorism. When one of the men appeared in court two days later, I read, a woman screamed at him, “Gibraltar will never be Spanish!” She sounded like that defiant place mat come to life. I happened to arrive in Gibraltar the week of the Brexit vote. Up in England, people were thundering about the working class versus elites, sovereignty and immigration, warning that British identity was being fouled by the European project. But in Gibraltar  —   a   fully detached nib of Britain, flanked by water on two sides and Spain on the third  —   the question was less philosophical: If the United Kingdom left the European Union, Spain might seize the opportunity to isolate Gibraltar, leaving the territory to shrivel up, like a flap of dead skin. The Gibraltarian government had already called on the House of Commons for help. There was concern that Spain would jam up the border again and that it might happen right away. Around town, “Remain” signs hung everywhere. The atmosphere was edgy, as though everyone was holding hands, waiting to see whether a meteor would hit. It was like the hairline cracks between so many     and Thems seemed to be widening, and some corrosive, molten goop was seeping out: mutual dependence curdled with contempt. Clearly it was happening back home in America too. All in all, it was a good week to spend in a cave. Gorham’s Cave is on Gibraltar’s   eastern coast: a tremendous opening at the bottom of the sheer face of the Rock, shadowy and   like a cathedral. Its mouth is 200 feet across at the base and 120 feet tall. It tapers asymmetrically like a crumpled wizard’s hat. Neanderthals inhabited Gorham’s Cave on and off for 100, 000 years, as well as a second cave next to it, called Vanguard Cave. The artifacts they left behind were buried as wind pushed sand into the cave. This created a high sloping dune, composed of hundreds of distinct layers of sand, each of which was once the surface of the dune, the floor of the cave. The dune is enormous. It reaches about   of the way up Gorham’s walls, spilling out of the cave’s mouth and onto the rocky beach, like a colossal cat’s tongue lapping at the Mediterranean. Every summer, since 1989, a team of archaeologists has returned to meticulously clear that sand away and recover the material inside. “I realized a long time ago, I won’t live to see the end of this project,” Finlayson, who leads the excavation, told me. “But I think we’re in a great moment. We’re beginning to understand these people after a century of putting them down as apelike brutes. ” Neanderthals are people, too  —   a separate,   branch of our family tree. We last shared an ancestor at some point between 500, 000 and 750, 000 years ago. Then our evolutionary trajectory split. We evolved in Africa, while the Neanderthals would live in Europe and Asia for 300, 000 years. Or as little as 60, 000 years. It depends whom you ask. It always does: The study of human origins, I found, is riddled with vehement disagreements and scientists who readily dismantle the premises of even the most   questions. (In this case, the uncertainty rests, in part, on when, in this long evolutionary process, Neanderthals officially became “Neanderthals. ”) What is clearer is that roughly 40, 000 years ago, just as our own lineage expanded from Africa and took over Eurasia, the Neanderthals disappeared. Scientists have always assumed that the timing wasn’t coincidental. Maybe we used our superior intellects to outcompete the Neanderthals for resources maybe we clubbed them all to death. Whatever the mechanism of this   replacement, it seemed to imply that our kind was somehow better than their kind. We’re still here, after all, and their path ended as soon as we crossed paths. But Neanderthals weren’t the   louts we’ve imagined them to be  —   not just a bunch of Neanderthals. As a review of findings published last year put it, they were actually “very similar” to their contemporary Homo sapiens in Africa, in terms of “standard markers of modern cognitive and behavioral capacities. ” We’ve always classified Neanderthals, technically, as human  —   part of the genus Homo. But it turns out they also did the stuff that, you know, makes us human. Neanderthals buried their dead. They made jewelry and specialized tools. They made ocher and other pigments, perhaps to paint their faces or bodies  —   evidence of a “symbolically mediated worldview,” as archaeologists call it. Their tracheal anatomy suggests that they were capable of language and probably had   raspy voices, like Julia Child. They manufactured glue from birch bark, which required heating the bark to at least 644 degrees Fahrenheit  —   a feat scientists find difficult to duplicate without a ceramic container. In Gibraltar, there’s evidence that Neanderthals extracted the feathers of certain birds  —   only dark feathers  —   possibly for aesthetic or ceremonial purposes. And while Neanderthals were once presumed to be crude scavengers, we now know they exploited the different terrains on which they lived. They took down dangerous game, including an extinct species of rhinoceros. Some ate seals and other marine mammals. Some ate shellfish. Some ate chamomile. (They had regional cuisines.) They used toothpicks. Wearing feathers, eating seals  —   maybe none of this sounds particularly impressive. But it’s what our human ancestors were capable of back then too, and scientists have always considered such behavioral flexibility and complexity as signs of our specialness. When it came to Neanderthals, though, many researchers literally couldn’t see the evidence sitting in front of them. A lot of the new thinking about Neanderthals comes from revisiting material in museum collections, excavated decades ago, and   it with new technology or simply with open minds. The real surprise of these discoveries may not be the competence of Neanderthals but how obnoxiously low our expectations for them have been  —   the bias with which too many scientists approached that other Us. One archaeologist called these researchers “modern human supremacists. ” Inside Gorham’s Cave, archaeologists were excavating what they called a hearth  —   not a physical fireplace but a spot in the sand where, around 50, 000 years ago, Neanderthals lit a fire. Each summer, the Gibraltar Museum employs students from universities in England and Spain to work the dig, and now two young women  —   one from each country  —   sat   under work lights, clearing sand away with the edge of a trowel and a brush to leave a   cube. A black band of charcoal ran through it. The students worked scrupulously, watching for small animal bones or artifacts. They’d pulled out a butchered ibex mandible, a number of mollusk shells and   husks. They’d also found six chunks of fossilized hyena dung, as well as “débitage,” distinctive shards of flint left over when Neanderthals shattered larger pieces to make axes. The cube of sand would eventually be wrapped in plaster and sent for analysis. The sand the two women were sweeping into their dustpans was transferred into plastic bags and marched out of the cave, down to the beach, where other students sieved it. Smaller bones caught in the sieve were bagged and labeled. Even the sand that passed through the sieve was saved and driven back to a lab at the museum, where I would later find three other students picking through it with magnifying glasses and tweezers, searching for tinier stuff  —   rodent teeth,   spines  —   while listening to “Call Me Maybe. ” To an outsider, it looked preposterous. The archaeologists were cataloging and storing absolutely everything, treating this physical material as though it were digital information  —   JPEGs of itself. And yet they couldn’t afford not to: Everything a Neanderthal came into contact with was a valuable clue. (In 28 years of excavations here, archaeologists have yet to find a fossil of an actual Neanderthal.) “This is like putting together a   jigsaw puzzle where you only have five pieces,” Finlayson said. He somehow made this analogy sound exciting instead of hopeless. By that point, the enormousness of what they didn’t know  —   what they could never know  —   had become a distraction for me. One of the dig’s lead archaeologists, Richard Jennings of Liverpool John Moores University, listed the many items they had found around that hearth. “And this is literally just from two squares!” he said. (A “square,” in archaeology, is one meter by one meter sites are divided into grids of squares.) Then Jennings waved wordlessly at the rest of the   cave. Look at the big picture, he was saying imagine what else we’ll find! There was also Vanguard Cave next door, an even more promising site, because while Gorham’s had been partly excavated by less meticulous scientists in the 1940s and ’50s, Finlayson’s team was the first to touch Vanguard. Already they had uncovered a layer of perfectly preserved mud there. (“We suspect, if there’s a place where you’re going to find the first Neanderthal footprint, it will be here,” Finlayson said.) The “resolution” of the caves was incredible the wind blew sand in so fast that it preserved short periods, faithfully, like entries in a diary. Finlayson has described it as “the longest and most detailed record of [Neanderthals’] way of life that is currently available. ” This was the good news. And yet there were more than 20 other nearby caves that the Gibraltar Neanderthals might have used, and they were now underwater, behind us. When sea levels rose around 20, 000 years ago, the Mediterranean drowned them. It also drowned the wooded savanna between Gorham’s and the former coastline  —   where, presumably, the Neanderthals had spent an even larger share of their lives and left even more artifacts. So yes, Jennings was right: There was a lot of cave left to dig through. But it was like looking for needles in a haystack, and the entire haystack was merely the one needle they had managed to find in an astronomically larger haystack. And most of that haystack was now inaccessible forever. I could tell it wasn’t productive to dwell on the problem at this scale, while picking   husks from the hearth, but there it was. “Look, you can almost see what’s happening,” Finlayson eventually said. “The fire and the charcoal, the embers scattering. ” It was true. If you followed that stratum of sand away from the hearth, you could see, embedded in the wall behind us, black flecks where the smoke and cinders from this fire had blown. Suddenly, it struck me  —   though it should have earlier  —   that what we were looking at were the remnants of a single event: a specific fire, on a specific night, made by specific Neanderthals. Maybe this won’t sound that profound, but it snapped that prehistoric abstraction into focus. This wasn’t just a “hearth,” I realized it was a campfire. Finlayson began narrating the scene for me. A few Neanderthals cooked the ibex they had hunted and the mussels and nuts they had foraged and then, after dinner, made some tools around the fire. After they went to sleep and the fire died out, a hyena slinked in to scavenge scraps from the ashes and took a poop. Then  —   perhaps that same night  —   the wind picked up and covered everything with the fine layer of sand that these students were now brushing away. While we stood talking, one of the women uncovered a small flint ax, called a Levallois flake. After 50, 000 years, the edge was still sharp. They let me touch it. One of the earliest authorities on Neanderthals was a Frenchman named Marcellin Boule. A lot of what he said was wrong. In 1911, Boule began publishing his analysis of the first nearly complete Neanderthal skeleton ever discovered, which he named Old Man of La Chapelle, after the limestone cave where it was found. Laboring to reconstruct the Old Man’s anatomy, he deduced that its head must have been slouched forward, its spine hunched and its toes spread like an ape’s. Then, having reassembled the Neanderthal this way, Boule insulted it. This “brutish” and “clumsy” posture, he wrote, clearly indicated a lack of morals and a lifestyle dominated by “functions of a purely vegetative or bestial kind. ” A colleague of Boule’s went further, claiming that Neanderthals usually walked on all fours and never laughed: “  had no smile. ” Boule was part of a movement trying to reconcile natural selection with religion by portraying Neanderthals as closer to animals than to us, he could protect the ideal of a separate, immaculate human lineage. When he consulted with an artist to make a rendering of the Neanderthal, it came out looking like a furry, mean gorilla. Neanderthal fossils kept surfacing in Europe, and scholars like Boule were scrambling to make sense of them, improvising what would later grow into a new interdisciplinary field, now known as paleoanthropology. The evolution of that science was haphazard and often comically unscientific. An exhaustive history by Erik Trinkaus and Pat Shipman describes how Neanderthals became “mirrors that reflected, in all their awfulness and awesomeness, the nature and humanity of those who touched them. ” That included a lot of human blundering. It became clear only in 1957, for example  —   46 years after Boule, and after several   of the Old Man’s skeleton  —   that Boule’s particular Neanderthal, which led him to imagine all Neanderthals as   oafs, actually just had several deforming injuries and severe osteoarthritis. Still, Boule’s influence was  . Over the years, his ideologically tainted image of Neanderthals was often refracted through the lens of other ideologies, occasionally racist ones. In 1930, the prominent British anthropologist Sir Arthur Keith, writing in The New York Times, channeled Boule’s work to justify colonialism. For Keith, the replacement of an ancient, inferior species like Neanderthals by newer, heartier Homo sapiens proved that Britain’s actions in Australia  —   “The white man . .. replacing the most ancient type of brown man known to us”  —   was part of a natural order that had been operating for millenniums. It’s easy to get snooty about all this unenlightened paleoanthropology of the past. But all sciences operate by trying to fit new data into existing theories. And this particular science, for which the “data” has always consisted of scant and somewhat inscrutable bits of rock and fossil, often has to lean on those   even more heavily. “Assumptions, theories, expectations,” the University of Barcelona archaeologist João Zilhão says, “all must come into play a lot, because you are interpreting data that do not speak for themselves. ” Imagine, for example, working in a cave without any skulls or other easily distinguishable fossils and trying to figure out if you’re looking at a Neanderthal settlement or a more recent, modern human one. In the past, scientists might turn to the surrounding artifacts, interpreting more   tools as evidence of Neanderthals and more   tools as evidence of early modern humans. But working that way, it’s easy to miss evidence of Neanderthals’ resemblance to us, because, as soon as you see it, you assume they were us. So many techniques similarly hinge on interpretation and judgment, even perfectly   ones, like “morphometric analysis”  —   identifying fossils as belonging to one species rather than another by comparing particular parts of their anatomy  —   and radiocarbon dating. How the material to be dated is sampled and how results are calibrated are susceptible to drastic revision and bitter disagreement. (What’s more, because of an infuriating quirk of physics, the effectiveness of radiocarbon dating happens to break down around 40, 000 years ago  —   right around the time of the Neanderthal extinction. One of our best tools for looking into the past becomes unreliable at exactly the moment we’re most interested in examining.) Ultimately, a bottomless relativism can creep in: tenuous interpretations held up by webs of other interpretations, each strung from still more interpretations. Almost every archaeologist I interviewed complained that the field has become “overinterpreted”  —   that the ratio of physical evidence to speculation about that evidence is out of whack. Good stories can generate their own momentum. Starting in the 1920s, older and more exciting hominid fossils, like Homo erectus, began surfacing in Africa and Asia, and the field soon shifted its focus there. The Washington University anthropologist Erik Trinkaus, who began his career in the early ’70s, told me, “When I started working on Neanderthals, nobody really cared about them. ” The liveliest question about Neanderthals was still the first one: Were they our direct ancestors or the endpoint of a separate evolutionary track? Scientists called this question “the Neanderthal Problem. ” Some of the theories worked up to answer it encouraged different visions of Neanderthal intelligence and behavior. The “Multiregional Model,” for example, which had us descending from Neanderthals, was more inclined to see them as capable, sympathetic and fundamentally human the opposing “Out of Africa” hypothesis, which held that we moved in and replaced them, cast them as comparatively inferior. For decades, when evidence of a more advanced Neanderthal way of life turned up, it was often explained away, or mobbed by enough contrary or undermining interpretations that, over time, it never found real purchase. Some findings broke through more than others, however, like the discovery of what was essentially a small Neanderthal cemetery, in Shanidar Cave, in what is now Iraqi Kurdistan. There had been many compelling instances of Neanderthals’ burying their dead, but Shanidar was harder to ignore, especially after soil samples revealed the presence of huge amounts of pollen. This was interpreted as the remains of a funerary floral arrangement. An archaeologist at the center of this work, Ralph Solecki, published a book called “Shanidar: The First Flower People. ” It was 1971  —   the Age of Aquarius. Those flowers, he’d go on to write, proved that Neanderthals “had ‘soul. ’’u2009” Then again, Solecki’s idea was eventually discredited. In 1999, a more thorough analysis of the Shanidar grave site found that Neanderthals almost certainly did not leave flowers there. The pollen had been tracked in, thousands of years later, by burrowing,   rodents. (That said, even a   later, there are still paleoanthropologists at work on this question. It might not have been gerbils it may have been bees.) As more supposed anomalies surfaced, they became harder to brush off. In 1996, the paleoanthropologist   Hublin and others used CT scanning technology to   a bone fragment found in a French cave decades earlier, alongside a raft of advanced tools and artifacts, associated with the   Châtelperronian industry, which archaeologists always presumed was the work of early modern humans. Now Hublin’s analysis identified the bone as belonging to a Neanderthal. But rather than reascribe the Châtelperronian industry to Neanderthals, Hublin chalked up his findings to “acculturation”: Surely the Neanderthals must have learned how to make this stuff by watching us. “To me,” says Zilhão, the University of Barcelona archaeologist, “there was a logical shock: If the paradigm forces you to say something like this, there must be something wrong with the paradigm. ” Zilhão published a stinging critique challenging the field to shake off its “  prejudice. ” Papers were fired back and forth, igniting what Zilhão calls “a   war” and counting. Then, in the middle of that war, geneticists shook up the paradigm completely. A group at the Max Planck Institute for Evolutionary Anthropology in Leipzig, Germany, led by Svante Paabo, had been assembling a draft sequence of a Neanderthal genome, using DNA recovered from bones. Their findings were published in 2010. It had already become clear by then that Homo sapiens and Neanderthals appeared in Eurasia separately  —   “Out of Africa was essentially right”  —   but Paabo’s work revealed that before the Neanderthals disappeared, the two groups mated. Even today, 40, 000 years after our gene pools stopped mixing, most living humans still carry Neanderthal DNA, making up roughly 1 to 2 percent of our total genomes. The data shows that we also apparently bred with other hominids, like the Denisovans, about which very little is known. It was staggering even Paabo couldn’t bring himself to believe it at first. But the results were the results, and they carried a sort of empirical magnetism that archaeological evidence lacks. “Geneticists are much more powerful, numerous and incomparably better funded than anyone else dealing with this stuff,” Zilhão said. He joked: “Their aura is kind of miraculous. It’s a bit like receiving the Ten Commandments from God. ” Paabo’s work, and a continuing wave of genomic research, has provided clarity but also complexity, recasting our oppositional,   relationship into something more communal and collaborative  —   and perhaps not just on the genetic level. The extent of the interbreeding supported previous speculation, by a minority of paleoanthropologists, that there might have been cases of Neanderthals and modern humans living alongside each other, intermeshed, for centuries, and that generations of their offspring had found places in those communities, too. Then again, it’s also possible that some of the interbreeding was forced. Paabo now recommends against imagining separate species of human evolution altogether: not an Us and a Them, but one enormous “metapopulation” composed of shifting clusters of essentially   things that periodically coincided in time and space and, when they happened to bump into one another, occasionally had sex. Lunch happened at the mouth of Gorham’s Cave, out in the sun. I ate a sandwich on a log, facing the sea, alongside Jennings and a few of his Liverpool students, while the young men and women from Spain mingled behind us, laughing and stretching and helping one another crack their backs. The language barrier seemed to discourage the two cohorts from talking much. And yet the students lived together during the excavation and had somehow achieved a muffled camaraderie. Even Jennings and his counterpart, José María Gutiérrez López, a veteran archaeologist from a museum in Cádiz, had a somewhat similar dynamic, despite working closely together for many summers at Gorham’s. Neither was terribly fluent in the other’s language, but their silence, by this point, seemed warm and knowing. Waiting for our ride at the end of one workday, I noticed them staring at a plastic bag snagged in the concertina wire above an old military gate. The bag had been there for a long, long time, Jennings told me. Then he turned and uttered, “Cinco años?” Gutiérrez López smiled. “Sí,” he said, nodding. I, meanwhile, felt compelled to test out all of this as a model for   relations. That contact obsessed me: What would it have been like to look out over a grassy plain and watch parallel humanity pass by? Scientists often turn to historical first contacts as frames of reference, like the arrival of Europeans among Native Americans, or Captain Cook landing in Australia  —   largely histories of violence and subjugation. But as Zilhão points out, typically one of those two cultures set out to conquer the other. “Those people were conscious that they’d come from somewhere else,” he told me. “They were a product of a civilization that had books, that had studied their past. ” Homo sapiens encountering Neanderthals would have been different: They met uncoupled from politics and history neither identified as part of a network of millions of supposedly more advanced people. And so, as Finlayson put it to me: “Each valley could have told a different story. In one, they may have hit each other over the head. In another, they may have made love. In another, they ignored each other. ” It’s a kind of coexistence that our modern imaginations may no longer be sensitive enough to envision. So much of our identity as a species is tied up in our anomalousness, in our dominion over others. But that narcissistic   is an exceedingly recent privilege. (“Outside the world of Tolkienesque fantasy literature, we tend to think that it is normal for there to be just one human species on Earth at a time,” the writers Dimitra Papagianni and Michael A. Morse explain. “The past 20 or 30 millennia, however, have been the exception. ”) Now, eating lunch, I considered that the   of humans and Neanderthals hadn’t been so trippy or profound after all. Maybe it looked as mundane as this: two groups, lingering on a beach, only sort of acknowledging each other. Maybe the many millenniums during which we shared Eurasia was, much of the time, like a superlong elevator ride with strangers. Some paleoanthropologists are starting to reimagine the extinction of Neanderthals as equally prosaic: not the culmination of some epic clash of civilizations but an aggregate result of a long, ecological muddle. Strictly speaking, extinction is what happens after a species fails to maintain a higher proportion of births to deaths  —   it’s a numbers game. And so the real competition between Neanderthals and early modern humans wasn’t localized quarrels for food or territory but a quiet,   demographic marathon: each species repopulating itself, until one fell so far behind that it vanished. And we had a big head start. “When modern humans came,” notes Chris Stringer, a paleoanthropologist at Britain’s Natural History Museum, “there just weren’t that many Neanderthals around. ” For millenniums, some scientists believe, before modern humans poured in from Africa, the climate in Europe was exceptionally unstable. The landscape kept flipping between temperate forest and cold, treeless steppe. The fauna that Neanderthals subsisted on kept migrating away, faster than they could. Though Neanderthals survived this turbulence, they were never able to build up their numbers. (Across all of Eurasia, at any point in history, says John Hawks, an anthropologist at the University of   “there probably weren’t enough of them to fill an N. F. L. stadium. ”) With the demographics so skewed, Stringer went on, even the slightest modern human advantage would be amplified tremendously: a single innovation, something like sewing needles, might protect just enough babies from the elements to lower the infant mortality rate and allow modern humans to conclusively overtake the Neanderthals. And yet Stringer is careful not to conflate innovation with superior intelligence. Innovation, too, can be a function of population size. “We live in an age where information, where good ideas, spread like wildfire, and we build on them,” Stringer told me. “But it wasn’t like that 50, 000 years ago. ” The more members your species has, the more likely one member will stumble on a useful new technology  —   and that, once stumbled upon, the innovation will spread you need sufficient human tinder for those sparks of culture to catch. “There was nothing inevitable about modern human success,” Stringer says. “It was luck. ” We didn’t defeat the Neanderthals we just swamped them. Trinkaus compares it to how European wildcats are currently disappearing, absorbed into much larger populations of house cats gone feral. It wasn’t a flattering analogy  —   we are the house cats  —   but that was Trinkaus’s point: “I think a lot of this is basically banal,” he says. Showing me around the Gibraltar Museum one morning, Finlayson described the petering out of Neanderthals on the Rock with unnerving pathos. Gibraltar, with its comparatively stable climate, would have been one of their last refuges, he explained, and he likened the population there to critically endangered species today, like snow leopards or imperiled butterflies: living relics carrying on in small, fragmented populations long after they’ve passed a genetic point of no return. “They became a ghost species,” Finlayson said. We happened to be standing in front of two Neanderthals, exquisitely lifelike sculptures the museum unveiled last spring, on a sweep of sand in their own austere gallery. They were scientific reconstructions, extrapolated by artists from casts of actual fossils. (These two were based on the only Neanderthal skulls ever recovered in Gibraltar: that first woman’s skull, sent to George Busk in 1864, and another, of a child, unearthed in 1926.) They were called Nana and Flint. Finlayson’s wife, Geraldine, and son, Stewart  —   both scientists who work closely with him at the museum  —   had helped him come up with the names. The boy had his arms thrown around Nana’s waist, his cheek on her thigh. He was   himself behind her leg, as kids do, but also stared out, straight at us, slightly alarmed, or helpless. “I don’t get tired of looking at them,” Finlayson said. He had commissioned the Neanderthals from Dutch artists known as Kennis  Kennis, and he was initially taken aback by the woman’s posture in their sketches. She stood oddly, with her arms crossed in front of her chest, resting on opposite shoulders, as if she were  . But Kennis  Kennis barraged him with ethnographic photos: real   people standing just like this, or even more strangely, their hands behind their necks or slung over their heads. As it happens, the artists had an intense personal interest in where human beings leave their hands when they don’t have pockets. I’d never thought about this before  —   I’ve always had pockets  —   and I wondered if artists might expose these perceptual bubbles more pointedly than archaeologists. Kennis  Kennis appeared to be major players in the tiny field of Paleolithic reconstruction. Scientists who had worked with them encouraged me to seek them out. “They’re great people,” one archaeologist told me. “Hyperactive. Like rubber balls. ” The Kennis brothers, Adrie and Alfons, are each 50 years old: identical twins. They are sturdy, attractive men, with dark, wildly swirling hair, and live in the small Dutch city of Arnhem, southeast of Amsterdam. When I arrived at Adrie’s house last summer, I found Alfons at the end of the driveway, glasses sliding down his nose, carefully filling a crack in the robin’   butt cheek of a silicon Neanderthal mold. Kennis  Kennis had gradually   Adrie’s house as a second studio. Most of their work and materials were here:   headless bodies of various human species and a wall of shelves filled with skulls and heads. The heads were frighteningly realistic, with glass eyes and fleshy faces that begged to be touched. When the brothers fly around Europe to pitch to museums, they take these heads with them, like salesmen’s samples. “On the airplane! We have heads!” Adrie shouted. “They scan things!” Alfons shouted. And slowly I understood: The brothers thought it was hilarious that airport security never questioned them about their duffel bags full of heads. “I never have to open my bags!” Adrie said, then he scampered to the wall, where a particular head had caught his eye: very   with a rough, bushy beard and rawness in its upper lip  —   a reconstruction of a primitive Homo sapiens skull found in Morocco. Adrie held the head in his palm and hollered, “Bowling!” while pretending to bowl with it. Then he laughed and laughed and laughed. That was how it went for the rest of the day. They spoke in a bifurcated riot, seldom finishing sentences, just skipping ahead once they had spit out the key words. And if a thought escaped them or their English faltered, they didn’t go silent instead, they repeated the last word, or made a strange guttural drone, as if thrusting some heavy weight over their heads, to fill the space. Their first big commission came in 2006, for the Neanderthal Museum, on the site of Neander Valley. It emerged as a jovial,   old man, with woefulness, or maybe just exhaustion, behind his eyes. That jolt of Neanderthal individuality has been a trademark of their work ever since. It elevates Neanderthals out of a single homogeneous abstraction and endows them with personhood. (At one point, Adrie described watching a neighbor spend an entire day   each brick of his driveway. He had an epiphany: “All the types of people around us, there must have been Neanderthals just like them. ” Alfons added: “Neanderthal neat freaks! Neanderthal Bill Gates! ”) What the brothers want, they told me, is for the viewer to catch herself relating to the Neanderthal  —   to recognize, in a visceral way, that Neanderthals sit at the fragile edge of our own identities. To feel that, Adrie explained, “they need to look you in the eye. ” They were obsessed  —   the only word for it  —   and have been since age 7, when Alfons found a picture of a Neanderthal skeleton in a book, and it instantly possessed them both. They spent a lot of time at their parents’ restaurant, after school and on weekends: With nothing to do, they started drawing Neanderthals. They drew feverishly, combatively, each brother keenly aware of whose rib cage looked brawnier, who had rendered more beautiful shadows on his Neanderthal’s upper lip. “We were both the dumbest guys in the whole school!” Alfons said. “We couldn’t count!” Drawing was all they knew how to do. As young men, they tried to teach art but couldn’t find steady employment. Their family told them to give up their crazy preoccupation. They wouldn’t. They made art at night and took custodial jobs at a psychiatric hospital. They organized the Christmas talent show and played   with the residents. Initially they were painters, not sculptors. They made   reconstructions only to have lifelike models to paint: They were that meticulous, that fixated on knowing how the musculature of a Neanderthal hung off its skeleton. Because they had to produce a   individual, the brothers were forced to make decisions about what paleoanthropologists had the luxury of describing as spectra of variation. Geneticists can suggest a probable scope of skin and hair colors. But the brothers must imagine the wear on a particular Neanderthal’s skin after a hard life outside, or the abuse his toenails would take. And would Neanderthals wear ponytails? Would they shear their bangs away, to get their hair out of their faces? “Every culture does something with their hair!” Alfons insisted. “There’s no culture that does nothing with their hair. ” This uncorked a frantic seminar on known global hairstyles of the last several thousand years. They began pulling up photos on Adrie’s laptop, dozens of them, from anthropological archives or stills from old ethnographic films. These were some of the same photos they had shown Finlayson. The brothers had pored over them for years but still gasped or bellowed now as each new, improbable human form materialized. The pictures showed a panorama of divergent body types and grooming: spiky eyebrows astonishingly asymmetrical breasts a towering aboriginal man with the chiseled torso of an American underwear model, but two twigs for legs a Hottentot woman with an extraordinarily convex rear end. “People would never let us make buttocks like this!” Alfons said regretfully. “All this variation! It’s beautiful!” shouted Adrie, refusing to look away from the screen. He had to look: These were reaches of reality that our minds didn’t travel to on their own. “If you live in the West, you’d never imagine,” he went on. The brothers’ delight seemed to come from feeling all these superficial differences quiver against a profound,   sameness. Finally, Adrie turned to me and said very seriously, “These are all Homo sapiens. ” They showed me more photos. “It’s real, it’s real, it’s real!” Alfons kept shouting. Adrie said, “Unimaginable, unimaginable, unimaginable!” It only registered later: I had spent the day with identical twins who, since childhood, have been stupefied by how different human beings can be. At the rear of Gorham’s Cave, past the hearth the team was excavating, there was a tall metal staircase. It led up to a long catwalk, which led to a locked steel gate. I waited there one morning while Finlayson fumbled around in his pocket. Then he turned his key. The excavation had worked through this narrowed rear chamber of the cave years earlier and discovered, at the end of the 2012 season, an engraving on the floor: a crosshatched pattern of 13 grooves in the bedrock. A tide of specialists flowed into Gorham’s. They determined that the engraving was made at least 39, 000 years ago and ruled out its having been created inadvertently  —   left over after skinning an animal, say. In controlled experiments, it took between 188 and 317 strokes with a flint tool to create the entire figure. “What we’ve always said,” Finlayson explained, “is it’s intentional and it’s not functional. You can call that art, if you like. ” The finding was published in The Proceedings of the National Academy of Sciences in 2014. The news media called the engraving “the hashtag. ” One scientist described the elaborate crosshatch as watershed evidence of Neanderthals’ capacity for “complex symbolic thought” and “abstract expression. ” But several archaeologists told me they believe that there are many clearer signs of Neanderthals’ capacity for complex cognition and symbolism, including a discovery in Southern France last year that seemed to dwarf the hashtag’s significance. (More than 1, 000 feet into the Bruniquel Cave, Neanderthals assembled two rings of 400 deliberately broken stalagmites, with other material piled and propped around it  —   like a labyrinth, or a shrine.) But Finlayson was undaunted. He turned the hashtag into a logo for the   rebranding of his museum. There was a hashtag decal on the van he picked me up in every morning. We stood and talked for a while until, finally, with Richard   aplomb, Finlayson lifted a tarp and showed it to me. It did not make a tremendous impact at first  —   it was lines in rock. But Finlayson went on, pointing to a spot near the entrance to this isolated anteroom, a few feet across from the engraving, where the team had excavated another hearth. Neanderthals built fires in that exact spot, on and off, for 8, 000 years, he said  —   until their disappearance from Gibraltar. But few animal bones were recovered here it wasn’t a place they cooked. And the location of the fire was also puzzling: Neanderthals usually situated fires at the fronts of caves, to control smoke. And yet, Finlayson explained, “if you look up, this has a natural chimney. ” We flung our heads back: A chute coursed through the high, craggy ceiling above us. It seemed, Finlayson explained, that the Neanderthals did their butchering and cooking at the front of Gorham’s, then retired here at night. Lighting a fire at this hearth would block the narrowest point in the cave, sealing off this chamber from predators. You could hang out here, Finlayson said, “have a   snack or something,” then head to bed. “See there?” he said, motioning to a smaller opening to our right. It led to a second room, similar to this one. “This,” Finlayson said, “is the bedroom. ” I looked again at the hashtag. It wasn’t on the cave floor, exactly, as it was usually described, but on a broad ledge, a foot or two off the ground. It made for a perfect bench, and it was suddenly easy to imagine a Neanderthal sitting on it, in ideal proximity to the fire. For all I knew, the hashtag marked his or her favorite seat. But Finlayson wasn’t done. After the Neanderthal artifacts disappear from Gorham’s sediment layers, there’s a gap of many thousand years  —   a thick stack of empty sand. Then other artifacts appear: Modern humans occupied the cave and built a fire here, too, just a couple of feet from the Neanderthals’ hearth. They used the bedroom annex as well. They left a cave painting on the wall in there: a gorgeous red stag, indisputably recognizable to us  —   their descendants  —   as art. Another 18, 000 years passed, give or take. The Phoenicians came. And they left offerings back here there were shards of their ceramics under the catwalk we had just crossed. Then, 2, 000 years after that, in 1907, a certain Captain A. Gorham of Britain’s Second Battalion Royal Munster Fusiliers arrived. Gorham didn’t discover Gorham’s Cave, Finlayson told me it had always been impossible to miss. “That’s what he found,” Finlayson said. “That’s really Gorham’s Cave. ” He pointed to the bedroom, and we both turned, bathing it with our headlamps. Beside the entrance was written, in big block letters, GORHAM’S CAVE 1907, with a chunky black arrow pointing to the doorway. Gorham had written his name directly over the spot where, some 39, 000 years earlier, a Neanderthal had made his or her own mark. The full sweep and synchronicity of this history hadn’t seemed to occur to Finlayson before. Hesitantly, he said, “Maybe there are special places in the world that have universal human appeal. ” I felt a similar, uncanny rush when I noticed that, at some point while he talked, we had each instinctually taken a seat on the rock ledge, next to the hashtag, and were now sitting side by side, staring into space where the two ancient campfires once burned. It’s not an especially spiritual experience when one human being walks into another human being’s kitchen for the first time and simply knows where the silverware drawer is. At the back of Gorham’s, though, that intuition was spread across two distinct kinds of humans and tens of thousands of years. Ultimately, why we are here and the Neanderthals are not can no longer be explained in a way that implies that our existence is particularly meaningful or secure. But at least moments like this placed our existence inside some longer,    continuity. It was the day of the Brexit vote. After   from the cave with Finlayson, I would spend the rest of the afternoon rejiggering my travel plans in a mild panic, trying to catch a ride out of Gibraltar and into Spain that night, so that if the Spanish exacted a retaliatory   after the results were announced, I could still make my flight home from Malaga the next day. I won’t describe the scenes I saw that morning  —   the blankness on people’s faces at the airport, phone calls I overheard  —   except to say that when I woke up on Nov. 9, after our own election, I felt equipped with at least a faint frame of reference. Reality seemed heightened and a little dangerous, because for so many people, including me, it had broken away from our expectations. We had misunderstood the present in the same way archaeologists can misunderstand the past. What was possible was suddenly exposed as grossly insufficient, because, to borrow Finlayson’s metaphor, we never imagined that the few jigsaw puzzle pieces we based it on constituted such a tiny part of the whole. Even some on the winning sides seemed similarly stunned and adrift. Many, though, just felt vindicated. Later that summer, I came across an essay for a British weekly by the actress Elizabeth Hurley, a fervent Leave supporter, who was now doubling down. “Knock yourselves out calling us   Neanderthals,” she wrote, “and spit a bit more venom and vitriol our way. You are showing yourselves in all your meanspirited,   elitist glory. ” When I read that, I took genuine umbrage  —   but on the Neanderthals’ behalf. And while I hate to admit it, I also felt a cheap but delicious tingle of smugness, because I now knew that “Neanderthal” wasn’t the insult Hurley thought it was  —   though this, I simultaneously realized, also closed a certain   loop and promoted, in me, the very   elitist glory Hurley was incensed by, thus deepening the divide. It was dizzying and sad and maybe inevitably human, but still no help to us at all.'"}, "time": 1742561821.9404533}