{"duration": 0.04761219024658203, "input_args": {"text": "'( IMDb ) \\nThe first two movements of the movie “Moonlight,” Barry Jenkins’ lyrical account of one young man’s passage to adulthood, shatters the soul into sharp-edged shards. The third section of this unique triptych, Jenkins’ adaptation of Tarell Alvin McCraney’s play , “In Moonlight Black Boys Look Blue,” rearranges these fragments in a way that makes its characters—and viewers—whole. \\nThis coming-of-age story is all the more singular because it is a serious film by African-Americans, one that employs the familiar tropes of black poverty and underemployment, and yet defines its characters not by the struggle against the racism, drug addiction or incarceration that limit them, but by the humanity that elevates them. This distinguishes it from other compelling recent films such as “12 Years a Slave” and “The Birth of a Nation,” which contend with the hopelessness of slavery. \\nThe place: the northwest Miami enclave of Liberty City . The time: the 1980s, perhaps not so long after white police officers have been acquitted of beating to death a black youth. One afternoon, Juan ( Mahershala Ali ), a dealer during this period when crack is replacing pot and heroin as the drug of choice, sees a small schoolboy running from his pursuers, who taunt each other to “get his gay ass!” \\nThe undersize 9-year-old, Chiron (played by the watchful Alex Hibbert), takes cover in an abandoned building from which Juan extracts him. The older man takes Chiron to the modest home he shares with Teresa ( Janelle Monáe ). For those who know Hollywood movies, this is particularly fraught. Is Juan planning to recruit Chiron as a sex partner, a drug runner, or …? \\nJuan is a dealer, but that’s not all he is in this movie, which refuses to reduce characters to fit convenient pigeonholes. Juan is also a supremely empathic father figure who looks out for and protects this stripling. \\nStill, for Chiron, nicknamed “Little,” the world is a brutish place that diminishes people who are different. While at first Chiron is almost mute, after a meal he quietly asks Juan what the word “faggot” means. \\nWisely, Juan blames Chiron’s victimizers: “ ‘Faggot’ is a word used to make gay people feel bad,” he says. When Chiron asks, “Am I one?” Juan shrugs and replies, “You could be gay, but you don’t got to let people call you a faggot.” Despite Juan’s excellent advice, Chiron will let his mother ( Naomie Harris , in a devastating turn) and his baiting schoolmates call him just that. The only time Chiron is not on what appears to be emotional lockdown is with a schoolmate named Kevin, as outgoing as Chiron is introverted. \\nJuan does not teach Chiron to fight back. Nor, in the calm blue waters off of Miami Beach, does the older man send the boy the message that life is a matter of sink or swim: He teaches Chiron to float. The moment Chiron ceases to navigate the world burdened with fear and humiliation and experiences zero gravity, his weightlessness is transcendent. \\nOn a moonlit evening when Chiron is a teenager (now played by wiry, wary Ashton Sanders), he finds himself on that same beach, silent but for the plash of gentle waves. While in most encounters Chiron retreats from others, this night he approaches Kevin. They talk. Another moment of ecstatic weightlessness. Another glance at the fluidity of masculinity. \\nThough there are moments of violence and betrayal in “Moonlight,” Jenkins quietly achieves something that more didactic filmmakers cannot. In this film, with minimal plot and dialogue, he brings his camera up close to his characters. Without telling us how to feel, he gives us the space to feel Chiron’s inner thoughts. The result is a movie that, like the scene of Juan teaching Chiron how to float, is a baptism by hope.'"}, "time": 1742563715.0621855}