{"duration": 0.05934953689575195, "input_args": {"text": "'Share on Twitter \\nMichael Phelps left the Rio Olympics on a high note. He was retiring on his own terms at the pinnacle of a record-shattering career in the pool. He had his new son Boomer — born this past May — and his fiancee, Nicole Johnson , was busy planning their wedding. \\nShe told Cosmopolitan in late August that, because of the Olympics, she was taking on all of the wedding planning: \\n\"I took on everything, obviously, because he had to focus on going to the games. And now I\\'m like, \\'What do you think about this and what do you think about that?\\' I know Michael well enough to know he doesn\\'t need to partake in the tiny, minuscule decisions. \\nBut I also know him well enough to know that he does want to be involved in what flavor our cake is going to be and what flowers he thinks are ugly and what flowers he thinks are really pretty.\" \\nBut TMZ is now saying that it was all a ruse — that Johnson was talking a good game about plans for a wedding that had already happened in secret. \\nAccording to TMZ\\'s report, Phelps and Johnson actually tied the knot in Arizona on June 13th , after obtaining a marriage license just a few days prior. \\nJohnson posted a rather unassuming photo that day: A photo posted by Nicole Michele Johnson (@nicole.m.johnson) on Jun 13, 2016 at 10:43pm PDT \\nDespite that, as recently as four weeks ago, Phelps was still playing along: A photo posted by Michael Phelps (@m_phelps00) on Aug 28, 2016 at 11:28pm PDT \\nAnd two weeks ago, Johnson was posting about bridal gown choices: A photo posted by Nicole Michele Johnson (@nicole.m.johnson) on Oct 7, 2016 at 5:27pm PDT A photo posted by Nicole Michele Johnson (@nicole.m.johnson) on Oct 8, 2016 at 1:02pm PDT \\nAnd looking back, Johnson may have foreshadowed a little something in recent interviews. She told “ Access Hollywood ” that the wedding was “taken care of,” though it seems they may still be planning a post-wedding celebration for family and friends: \\n“It\\'ll be small and intimate for the wedding, and then we\\'re throwing a massive bash for everyone.” \\nAnd in her Cosmopolitan interview , when asked if she thought she\\'d ever collaborate with Phelps on a professional level, she responded: \\n“I would love to. Possibly hosting or reporting of some kind. But right now my main priority is being a wife to Michael and Boomer\\'s mom.” \\nThe assumption at the time was that she meant “being a wife” in the near future, but it could have just been a slip of the tongue. '"}, "time": 1742562689.6060007}