{"duration": 0.142256498336792, "input_args": {"text": "'Archives Michael’s Latest Video Now That The Election Is Over, Will Republicans And Democrats Learn How To Love One Another? By Michael Snyder, on November 16th, 2016 \\nThe 2016 election will be remembered as perhaps the most contentious election in modern American history, and things often got extremely angry and bitter on a personal level. If you spend much time on Facebook or Twitter you know exactly what I am talking about. The vitriol on social media has been off the charts, and there are some people that are actually unfriending anyone that supported the candidate that they were against. This election has also torn apart families, friends and even entire churches. Relationships that took decades to build in some cases are now permanently shattered because of fighting over Trump and Clinton. \\nPersonally, I couldn’t imagine choosing never to talk to a family member or a close friend ever again because of a political disagreement. Trump and Clinton are only temporary, but your family will always be your family. Sadly, we live in a nation where strife, discord, bitterness and resentment are all running rampant, and unforgiveness has become a national pastime. \\nAs a nation, we are extremely divided. In fact, at this moment we are more divided than we have ever been in my entire lifetime. A house divided against itself will surely fall, and if we don’t learn how to love one another I don’t see any reason to be optimistic about the future of this country. \\nIf you are a Republican, can you honestly say that you love Democrats? \\nIf you are a Democrat, can you honestly say that you love Trump supporters? \\nIf this nation is ever going to heal, we have got to learn how to forgive, and we have got to learn how to love others that see things differently than we do. \\nI know what many of you are thinking at this point. Many of you are wondering if I have gone soft, and many of you are wondering how we are supposed to forgive people that believe some of the most horrible things imaginable. \\nI didn’t say that it would be easy. \\nAnd it is certainly not necessary to agree with someone or even acknowledge that their viewpoints are legitimate in order to love, forgive and value that person. \\nLet’s take abortion as an example. Most Democrats and many Republicans believe that we should continue to murder babies on an industrial scale in our abortion mills all over the country. In fact, many of them want to make it even easier and want to shower organizations such as Planned Parenthood with even more government money. \\nThis is evil on a level that is difficult to put into words, and what we are doing to those precious little children is on par with what the Nazis did to Jewish people and other minorities in their concentration camps during World War II. And if we do not stop slaughtering babies, the judgment of God is going to absolutely devastate this nation. \\nAccording to Gallup, 79 percent of all Americans believe that abortion should be legal under at least some circumstances, and so unfortunately that is not likely to happen any time soon. \\nBut just because someone believes in killing babies does not mean that we should hate that person. \\nOn the contrary, every single individual is of immense value. Whenever you are tempted to hate someone, just remember that Jesus valued that person so much that He was willing to go to the cross to pay for that person’s sins. No matter what someone looks like, no matter where someone is from, and no matter how much money they have, each and every person is greatly loved in the Father’s eyes, and we are commanded to love them too. \\nWe are to love all people at all times and in all ways. Christian maturity is far more about how much you love than it is about how much you know. Unfortunately, most people don’t seem to understand this simple truth. \\nThese days a lot of people are running around touting how self-righteous they are, but most of those same people seem to be quite lacking in real love. \\nIf you really want to be someone that “keeps the commandments”, you should start by getting your heart right. In Matthew 22, Jesus told us which commandments are the most important of all. The following is what Matthew 22:36-40 says in the Modern English Version … \\n36 “Teacher, which is the greatest commandment in the law ?” \\n37 Jesus said to him, “ ‘ You shall love the Lord your God with all your heart, and with all your soul, and with all your mind .’ 38 This is the first and great commandment. 39 And the second is like it: ‘ You shall love your neighbor as yourself .’ 40 On these two commandments hang all the Law and the Prophets.” \\nWe should all constantly endeavor to become people of great love. \\nOnce again, that does not mean that you have to accept or approve of what others are saying or doing. In fact, often the loving thing is to point out that someone you love is being destructive to themselves or others. \\nAnd as a nation, we are being self-destructive on a scale that is almost unimaginable. We are literally committing national suicide, and until we start radically changing our behavior it isn’t going to matter much who is in the White House. \\nIf you want to get your heart right on a personal level, a good place to start is by forgiving those that have hurt you or offended you. And that would include our politicians. I am certainly not saying that you should vote for anyone that stands for positions that are extremely offensive, but we can definitely forgive them and pray for them. \\nIn addition, if you have had relationships that have been broken during this election season, perhaps now is a good time to reach out in a spirit of love and forgiveness. \\nLife is too short to go around holding grudges, and those that choose to forgive often find that they are the ones that are truly being set free.'"}, "time": 1742561955.144694}