{"duration": 0.08619880676269531, "input_args": {"text": "'LONDON  —   One of the most influential musicians and style icons of his generation, David Bowie, who died in January, was less well known as an art collector. But as he told Michael Kimmelman, The New York Times critic, in 1998, “Art was, seriously, the only thing I’d ever wanted to own. ” On Thursday evening, Sotheby’s launched its   “ ” sale, an auction of some 350 works, or about 65 percent of his total collection, on behalf of Mr. Bowie’s estate. Buoyed by the huge amounts of publicity and public interest, the   sale of 47 lots tripled its low estimates raising 24. 3 million pounds, or $30. 3 million. The collection of “The Man Who Fell to Earth” created a string of 12 auction highs for artists as the allure of the David Bowie provenance pushed the values of Modern British art to a new level. Among the works with wide international appeal, a   Basquiat painting, “Air Power,” from the collection of Mr. Bowie  —   who played Andy Warhol in Julian Schnabel’s 1996 movie “Basquiat”  —   sold for £7. 1 million with fees, or about $8. 8 million, against a low estimate of £2. 5 million, or $3. 3 million. It sold in the room to a European collector who declined to give her name. The 1984 acrylic and oil stick composition, painted in shades of brown and red and featuring one of the artist’s trademark   masks, had been bought by the British musician in 1995 at Christie’s in London for $120, 122. Though at times the    room was subdued, and at times there was more posting of pictures on Instagram than bidding, competition on the telephones ensured some exceptional prices. After an early phase of acquiring Memphis Group furniture and design objects (about 100 lots will be offered by Sotheby’s on Friday) Mr. Bowie began systematically buying art only in 1993, in his   after a chance encounter with his first adviser, Kate Chertavian. But from that point on he became passionately acquisitive. The core of his collection is 20th century British art  —   so called Mod Brit such as Peter Lanyon and David Bomberg and Ivon Hitchens  —   which at times made his taste look like that of a retired English businessman rather than an   pop star. Yet his multifaceted creative life also made him an admirer of German Expressionist prints, Outsider Art, Marcel Duchamp, Damien Hirst and African contemporary. “Bowie was a true collector,” said Christina Shearman, a   art adviser based in New York, where Mr. Bowie lived during his final years. “His acquisitions were not commercially motivated he cared about the art, not the market. His was a deeply personal, eclectic collection, reflecting his British roots and his real passion for art. ” The collection took up all eight rooms of Sotheby’s   exhibition space and attracted 37, 608 visitors during the   exhibition  —   a record for any auction at Sotheby’s in London, according to the company’s press office. The art trade predicted that Frank Auerbach’s expressive and thickly impasted 1965 “Head of Gerda Boehm,” estimated at £300, 000 to £500, 000, would fly. The hammer finally fell at £3. 8 million, or $4. 7 million, to a telephone bidder. The price was a new auction high for the artist. “I want to sound like that looks,” Mr. Bowie had said of the painting in the 1998 interview with The New York Times. He had bought the work, whose   paint layer was still not completely dry, according to conservators, in 1995 at Christie’s for $87, 102. Another work with international appeal was Damien Hirst’s psychedelic 1995 spin canvas, “Beautiful, hallo,   painting,” which the artist had made in collaboration with the musician (who wore a brand new, quickly ruined suit). Measuring seven feet in diameter, this sold for £785, 000, or roughly $975, 000, against an estimate of £250, 000 to £350, 000. Mod Brit has in the past been a niche national market, but Sotheby’s ramped up the cataloging of Mr. Lanyon’s imposing 1961 black and white abstract, “Witness,” by calling it a “great American painting. ” Mr. Lanyon was born, lived, and died in Cornwall, in the far west of England, but the painting’s resemblance to contemporary works by   greats such as Robert Motherwell and Franz Kline helped it achieve £797, 000, just under $1 million, to another telephone bidder against an estimate of £250, 000 to £350, 000. The price was also an auction high for the artist, whose 1960s abstracts were influenced by glider flights. All the lots sold but total success was ensured by lowering reserve prices on works that failed to attract much presale interest. That included Francis Picabia’s enigmatic   painting of a seated mythological figure, “Mendica,” one of Mr. Bowie’s earlier art purchases, bought at auction in 1988. Estimated at £ £800, 000, it was knocked down for £401, 000, or about $500, 000, with fees. “You get a sense of his character,” said Josh Andraos, an art student, 20, at the packed Wednesday preview, summing up why so many people wanted to see the art that had been owned by Mr. Bowie. “It’s very British, but it varies. It all depends on what he’s thinking and feeling. This is the head of Bowie himself. ”'"}, "time": 1742561744.5665634}