{"duration": 0.021480560302734375, "input_args": {"text": "'  Republican Representatives and one Democrat are pushing legislation that would make Pennsylvania gun owners a “protected class. ”[Gun owners would be protected from discrimination by having their right to keep and bear arms firmly ensconced in the Pennsylvania Human Rights Act (PHRA).  According to the Pennsylvania Record, the legislation —  House Bill 38 —  “is currently in committee,” but would protect   employees from employers who want to ban firearms on workplace property. For example, HB 38 would bar such employers from preventing gun owners from keeping firearms in their cars that could be retrieved for  . CeaseFirePA’s Shira Goodman opposes the proposed protections for Pennsylvania gun owners, saying, “The Second Amendment right is not overly burdened here, and so why (gun carriers) need to be in a protected class is just a little bit  . ” She added, “It’s very easy to get a gun here. We’re an   state, except for Philadelphia. It’s not very hard to get a concealed carry license. We don’t have waiting periods. We don’t have registration and license. ” Goodman made clear that employers ought to be able to ban   employees from keeping guns for   intimating that such bans can prevent “workplace violence” and “domestic instances spilling over into workplaces. ” She did not address the fact that businesses, elementary schools, and universities around the country have witnessed horrendous attacks wherein the   citizens were sitting ducks rendered defenseless by   employers   school administrators or boards of regents. AWR Hawkins is the Second Amendment columnist for Breitbart leNews and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.  '"}, "time": 1742563261.8830664}