{"duration": 0.04094886779785156, "input_args": {"text": "\"Taming the corporate media beast Biden Doesn't Stand a Chance. Clinton's Secretary of State Will Be Vicky Nuland Originally appeared at The American Conservative \\nJoe Biden is reportedly being considered for Secretary of State in a Clinton administration: \\nJoe Biden is at the top of the internal short list Hillary Clinton’s transition team is preparing for her pick to be secretary of state, a source familiar with the planning tells POLITICO. \\nIf Biden is on such a list, I doubt he is at the top of it, and my guess is that he wouldn’t be the nominee in any case. There are other likely choices, including Victoria Nuland, that would be a better fit with Clinton and would be even more likely to share her foreign policy priorities. Kelley Vlahos reported earlier this year on Nuland’s record: \\nWhere will Victoria Nuland be after January? Nuland is one of Hillary Clinton’s protégés at the State Department, and she is also greatly admired by hardline Republicans. This suggests she would be easily approved by Congress as secretary of state or maybe even national-security adviser—which in turn suggests that her foreign-policy views deserve a closer look. \\nIf Nuland can be considered a Clinton protege, Biden is more of a rival. During the first Obama term, Biden and Clinton were frequently on opposing sides of internal foreign policy debates, and in his 2015 announcement that he wouldn’t run for president Biden offered what I took to be a rebuke of Clinton’s more aggressive foreign policy positioning: \\nWe have to accept the fact that we can’t solve all of the world’s problems. We can’t solve many of them alone. \\nThe argument that we just have to do something when bad people do bad things isn’t good enough. It’s not a good enough reason for American intervention and to put our sons and daughters’ lives on the line, put them at risk. \\nProbably their most significant disagreement was over intervention in Libya: Clinton was a major supporter, and Biden saw no compelling reason for the U.S. to intervene. Biden has a fairly hawkish record over the last twenty years, but even he couldn’t see why the U.S. should get involved there. As recently as June, he was publicly claiming vindication for opposing an intervention that Clinton touts as “smart power at its best.” I don’t see why she would want Biden as her Secretary of State, and I definitely don’t see why he would want to serve in her administration.\""}, "time": 1742564119.190511}