{"duration": 0.07824826240539551, "input_args": {"text": "'Two hundred thousand Uber users deleted the app from their phones after the company supported its New York drivers’ making trips out of Kennedy Airport while taxi companies refused to drive in protest of the Trump administration’s travel ban. From some, it was a moment to switch to rival companies like Lyft, which recently pledged a million dollars to the American Civil Liberties Union. But what does switching from one Silicon Valley corporation to another really accomplish? Aren’t they all basically the same? “If you’re going to ban Uber, throw your iPhone in the trash, delete your Facebook account, stop using Twitter,” Jenna says on this week’s episode of Still Processing. “All of these companies are, in some way, supporting this administration. ” As Wesley puts it: “It’s a protest   . ” Also, with the final season of “Girls” beginning on Sunday night on HBO, we take a moment to talk about the show’s legacy. And after we talk about the show, we talk to it, with excerpts from Jenna’s recent conversation with the cast: Lena Dunham, Allison Williams, Zosia Mamet and Jemima Kirke. They discuss the show’s early lack of diversity, why “Silicon Valley” gets off easy and what it’s like to have the public completely conflate actors and the characters they play. We’ve got excerpts! Finally, we play a new   game that we hope to come back to. It requires zero expertise, just lots and lots of speculation. From a desktop or laptop, you can listen by pressing play on the button above. Or if you’re on a mobile device, the instructions below will help you find and subscribe to the series. On your iPhone or iPad: 1. Open your podcast app. It’s a   app called “Podcasts” with a purple icon. (This link may help.) 2. Search for the series. Tap on the “search” magnifying glass icon at the bottom of the screen, type in “Still Processing” and select it from the list of results. 3. Subscribe. Once on the series page, tap on the “subscribe” button to have new episodes sent to your phone free. You may want to adjust your notifications to be alerted when a new episode arrives. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, tap on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode. On your Android phone or tablet: 1. Open your podcast app. It’s a   app called “Play Music” with an    icon. (This link may help.) 2. Search for the series. Click on the magnifying glass icon at the top of the screen, search for “Still Processing” and select it from the list of results. You may have to scroll down to find the “Podcasts” search results. 3. Subscribe. Once on the series page, click on the word “subscribe” to have new episodes sent to your phone free. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, click on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode.'"}, "time": 1742562066.1797392}