{"duration": 0.03168988227844238, "input_args": {"text": "'0 comments \\nFamilies united in prayer on Thanksgiving Day. Prayer alone is not what comes to mind when you think of Obama’s America where we are told to leave God at home and out of our pledge. \\nThere has never been a more crucial time to look to God, as our nation is being divided and torn apart by the selfish greed of a corrupt society with leaders that lead from behind, and hide their dark secrets right in plain sight…because, they can. \\nNow Walmart has brought us a Thanksgiving commercial that is a huge reminder of what is good, and what is right. A reminder of what a good foundation is made up of. Being grateful, family, and prayer. \\nMost of all…coming together. \\nThe 30-second ad, which at World Series rates cost Walmart $500,000 â\\x80\\x94 features the diversity of Americas families and the camaraderie of its service members as they gather, pray and enjoy the bonds of family. A commercial showing everyone praying before eating??? đ\\x9f\\x91\\x8fđ\\x9f\\x8fťđ\\x9f\\x91\\x8fđ\\x9f\\x8fťđ\\x9f\\x91\\x8fđ\\x9f\\x8fťđ\\x9f\\x91\\x8fđ\\x9f\\x8fť great job Walmart!! #Walmart \\n— Deplorable Jack (@DeplorableJackL) November 3, 2016 \\nThen their final thoughts… \\nâ\\x80\\x9cAmerica, letâ\\x80\\x99s come together and take a moment to reflect on what weâ\\x80\\x99re truly thankful for this holiday season. Friends, family and the chance to spend time with the ones we love. Walmart would like to give thanks to all of our Veterans and Active Duty Service Members at home and oversees this holiday season.â\\x80\\x9d \\nWalmart has invited a spirit of thanksgiving with just a few seconds of video. Can you imagine if “everyday Americans” brought just a few seconds of thanksgiving into their lives daily? \\nWhat a difference it would make. It could change the very state we’re in right now. Where everything is about oneself and selfish desires. A generation of self-absorbed selfie taking kids who think they can’t do hard things. \\nFor them…it would make a HUGE difference. Related Items'"}, "time": 1742564412.4246511}