{"duration": 0.08420729637145996, "input_args": {"text": "'Students at the Claremont McKenna Colleges argued that objective truth is a social construct devised by “white supremacists” to “attempt to silence oppressed peoples” in a letter to the Pomona College president. [The letter came in response to Pomona College President David Oxtoby’s affirmation of commitment to free speech and intellectual diversity following the chaos that ensued during a lecture featuring Manhattan Institute scholar Heather MacDonald. Student protesters derailed her lecture on the rise of   attitudes by banging on windows and shouting, “F*ck the police,” and “Black Lives Matter. ” Campus security ultimately forced MacDonald to livestream her lecture from a   room across campus.  “Protest has a legitimate and celebrated place on college campuses,” Oxtoby wrote, offering a condemnation of the conduct of the students who disrupted the event. “What we cannot support is the act of preventing others from engaging with an invited speaker. Our mission is founded upon the discovery of truth, the collaborative development of knowledge and the betterment of society. ” Students at Pomona College, one of the schools in the consortium of Claremont McKenna Colleges, took issue with Oxtoby’s statement and drafted a letter in response that was signed by students at the other colleges as well. “Free speech, a right many freedom movements have fought for, has recently become a tool appropriated by hegemonic institutions. It has not just empowered students from marginalized backgrounds to voice their qualms and criticize aspects of the institution, but it has given those who seek to perpetuate systems of domination a platform to project their bigotry,” the students wrote. “Thus, if ‘our mission is founded upon the discovery of truth,’” the students continued, “how does free speech uphold that value?” Immediately dismissing the possibility that listening to MacDonald’s lecture could widen their perspective, the students went on to explain how objective truth is a concept devised by “white supremacists” in an “attempt to silence oppressed peoples. ” Historically, white supremacy has venerated the idea of objectivity, and wielded a dichotomy of ‘subjectivity vs. objectivity’ as a means of silencing oppressed peoples. The idea that there is a single truth —  ’the Truth’ —  is a construct of the   that is deeply rooted in the Enlightenment, which was a movement that also described Black and Brown people as both subhuman and impervious to pain. This construction is a myth and white supremacy, imperialism, colonization, capitalism, and the United States of America are all of its progeny. The idea that the truth is an entity for which we must search, in matters that endanger our abilities to exist in open spaces, is an attempt to silence oppressed peoples. The students go on to claim that Heather MacDonald is “ignorant of interlocking systems of domination that produce the lethal conditions under which oppressed peoples are forced to live,” which is an explicit reference to the concept of intersectionality, an increasingly popular theory of oppression which conservative columnist Andrew Sullivan recently called a “religion. ” Tom Ciccotta is a libertarian who writes about economics and higher education for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com'"}, "time": 1742561783.922737}