{"duration": 0.07238912582397461, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1.   Donald J. Trump continues his victory tour with a rally in Fayetteville, N. C. (7 p. m. Eastern). Earlier in the day, he fired the son of his designated national security adviser for sharing a fake news story about Hillary Clinton that led to an armed confrontation in a pizza restaurant. And Mr. Trump, who has for years flown in a jet bearing his name, proposed canceling a pending order for a new Air Force One, criticizing Boeing in a tweet that said “costs are out of control. ” _____ 2. President Obama took Air Force One to Tampa, Fla. where he delivered his final planned address on national security. The venue, MacDill Air Force Base, is home to units crucial to Mr. Obama’s fight against terrorism as well as efforts to wind down the wars in Iraq and Afghanistan. The diminishing United States presence in Afghanistan offers yet more room for Saudi Arabia, which has supported the American mission there while also turning a blind eye to wealthy residents privately funding the Taliban. _____ 3. Mr. Trump has stirred controversy with foreign governments. His unorthodox phone call with the leader of Taiwan appears to be the culmination of months of effort by Bob Dole, above, who acted as a foreign agent for the country’s government. His lobbying firm was paid $140, 000 for the work. In Iran, President Hassan Rouhani said that his country would not allow Mr. Trump to tear up last year’s nuclear agreement. “America is our enemy we have no doubt about this,” he said, taking a harsh tone that signaled the intense pressure he is under from  . _____ 4. The man who admitted to shooting the former N. F. L. player Joe McKnight last Thursday has been arrested and charged with manslaughter. The authorities had been deluged with criticism and insults for releasing Ronald Gasser, above, after what appeared to be an episode of road rage. In a news conference, Sheriff Newell Normand angrily rejected the idea his officers had been slow to act because the victim was black and the shooter white. _____ 5. The Supreme Court ruled unanimously in two cases. Justices handed Samsung a victory in a fight over smartphone patents that may mean the company won’t have to fork over $399 million to Apple. And the court upheld prosecutors’ right to pursue insider trading charges when executives pass along tips to relatives. _____ 6. Wells Fargo has been able to stop lawsuits from defrauded customers by moving the cases into private arbitration, a secretive legal process that often favors corporations. “It’s ridiculous,” said Jennifer Zeleny, above, who is suing the bank. “This is an issue of identity theft  —   my identity was used so employees could meet sales goals. This is something that needs to be litigated in a public forum. ” _____ 7. New York will investigate whether the state’s prison system is racially biased after an investigation by The Times found that black inmates were punished and denied parole at higher rates than white ones. The Times analyzed nearly 60, 000 disciplinary cases from 2015 and interviewed inmates at prisons around the state for the series. Here’s Part I and Part II. _____ 8. The United States fared poorly, as usual, in a worldwide ranking of students’ test scores. But the latest results did show significant gains among disadvantaged teenagers. Andreas Schleicher, who oversees the test, suggested the recently adopted learning goals known as the Common Core State Standards would further those gains in the long term. _____ 9. Beyoncé received more Grammy nominations than any other artist, getting nine nods for “Lemonade,” an album and film that explored issues of race and infidelity. She’ll compete against Adele  —   who received five nominations  —   in each of the top of three categories. Drake and Rihanna each received eight nominations, and Chance the Rapper had seven. _____ 10. The hot toy of the holiday season is an interactive, furry creature that hatches out of an egg and grows up before your eyes. They’re called Hatchimals, and they are in short supply. The Canadian company that introduced the toy in October, with a suggested retail price of $59. 99, said it “had no idea that it would be this big. ” Good luck, shoppers. Photographs may appear out of order for some readers. Viewing this version of the briefing should help. Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742564265.5786803}