{"duration": 0.03589320182800293, "input_args": {"text": "'The Daily Show‘s Trevor Noah and Michelle Wolf mercilessly mocked Megyn Kelly’s NBC debut this week, in which the former Fox News star landed a   interview with Russian president Vladimir Putin on her newsmagazine show Sunday Night with Megyn Kelly. [After playing clips of the interview, host Noah brought out Daily Show correspondent Wolf, who said that seeing someone “so conniving trying to manipulate the American public was disgusting. ”  When Noah said he agreed that watching Putin’s responses was indeed disgusting, Wolf said she was referring to Kelly. “Last night on her new show, she acted like she didn’t spend the last 12 years of her life as a soldier in Fox News’ culture war,” Wolf said. The Daily Show then played a clip from Kelly’s NBC show in which she chided the media for its “rude behavior” and asked “Can’t we all just get along?” “Oh, I’m sorry, now we’re all supposed to be friends?” Wolf continued. “Now that you’re NBC you’re acting all peaceful like some sort of Mahatma Blondie?” “Let’s not forget, before she was ‘NBC News’s Megyn Kelly,’ for over a decade she was ‘Fox News’s Megyn Kelly,’ basically a pretty,   puppet who Roger Ailes kept trying to put his hand up,” Wolf added, drawing a loud groan from the audience. “Oh, don’t worry, she’s on network now and he’s dead, they’re both in better places. ” Wolf didn’t let up for the whole segment, blasting Kelly for acting what she described as “high and mighty” when she told Axios in a recent interview that she only consumes news by print. “Sorry Megyn, you’re not the new Barbra Walters, you’re that   guy who just follows the money,” she concluded. Kelly’s contentious interview with Putin at an international economics forum in St. Petersburg  —   in which the pair discussed allegations of Russian interference in the 2016 U. S. presidential election  —   drew mixed reaction from fellow journalists and middling ratings for NBC.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742561667.6880565}