{"duration": 0.07933616638183594, "input_args": {"text": "' Memo to Comey: Keep Your Damn Hands Off Our Elections\\nBy Mike Whitney \" Counterpunch\" - Without a shred of evidence and against the expressed wishes of his superiors at the Department of Justice, the head of the nation\\x92s most prestigious law enforcement agency announced the reopening of an investigation into the mishandling of classified material by Democratic presidential candidate, Hillary Clinton. The surprise announcement was delivered last Friday by FBI Director James Comey who knew that the action would create a cloud of suspicion around Clinton that could directly effect the outcome of the election.\\nRecent surveys suggest that that indeed has been the case, and that Hillary is now neck in neck with GOP contender Donald Trump going into the home-stretch of the bitterly contested campaign.\\nBy inserting himself into the democratic process, Comey has ignored traditional protocols for postponing such announcements 60-days prior to an election, shrugged off the counsel of his bosses at the DOJ, and tilted the election in Trump\\x92s favor. His action is as close to a coup d\\x92état as anything we\\x92ve seen in the U.S. since the Supreme Court stopped the counting of ballots in Florida in 2000 handing the election to George W. Bush.\\nIt is not the job of the FBI to inform Congress about ongoing investigations. Comey\\x92s job is to gather information and evidence that is pertinent to the case and present it to the DOJ where the decision to convene a grand jury is ultimately made. Comey is a renegade, a lone wolf who arbitrarily decided to abandon normal bureaucratic procedures in order to torpedo Clinton\\x92s prospects for election. The widespread belief that Comey is a \\x93good man who made a bad decision\\x94 is nonsense. He is an extremely intelligent and competent attorney with a keen grasp of Beltway politics. He knew what he was doing and he did it anyway. It\\x92s absurd to make excuses for him.\\nIn a carefully-crafted statement designed to deflect attention from his flagrant election tampering, Comey said this to his fellow agents:\\n\\x93We don\\x92t ordinarily tell Congress about ongoing investigations, but here I feel an obligation to do so given that I testified repeatedly in recent months that our investigation was completed,\\x94 Comey said. \\x93I also think it would be misleading to the American people were we not to supplement the record.\\x94 ( CNN )\\nLet\\x92s take a minute and parse this statement. First: \\x93We don\\x92t ordinarily tell Congress about ongoing investigations.\\x94\\nTrue, because it is not the FBI\\x92s job to do so. The FBI\\x92s job is to dig up evidence and refer it to the Justice Department. Comey is not the Attorney General although he has arbitrarily assumed her duties and authority.\\nSecond: \\x93I also think it would be misleading to the American people were we not to supplement the record.\\x94\\n\\x93Supplement the record\\x94?\\nThat\\x92s a pretty suggestive statement, don\\x92t you think? When someone says they\\x92re going to supplement the record, you naturally assume that they\\x92re going to add important details to what the public already knows. Obviously, those details are not going to be flattering to Hillary or there\\x92d be no reason to reopen the case. So the public is left with the impression Comey is going to produce damning information that could lead to an indictment of Hillary sometime in the future.\\nThis is precisely why normal protocols require that no new investigations be announced 60 days before an election. Why?\\nBecause the public invariably assumes that \\x93investigation\\x94 equals \\x93guilt\\x94. In other words, \\x93The FBI wouldn\\x92t be investigating Hillary unless they had some dirt on her. Therefore, I\\x92d better not waste my vote on Hillary.\\x94\\nThis is the logic upon which Comey\\x92s dirty trick rests. He knows the effect his announcement will have because he is law enforcements version of Karl Rove, a bone fide partisan who\\x92s mastered the dark art of political sabotage.\\nAnd just in case Comey\\x92s announcement didn\\x92t produce the desired effect (by destroying Hillary\\x92s chances for victory), a former assistant director at the FBI, Tom Fuentes, appeared on CNN shortly after the announcement was made with more explicit information. Here\\x92s a clip from the interview:\\n\\x93The FBI has an intensive investigation ongoing into the Clinton Foundation,\\x94 Fuentes said Saturday, citing current and former senior FBI officials as sources\\nAccording to the CNN report, officials with the FBI and Justice Department met in Washington earlier this year to discuss opening an investigation into possible conflicts of interest between the Clinton Foundation and Hillary Clinton State Department.\\x94\\n(\\x93 Former FBI Official: FBI Has An \\x91Intensive Investigation\\x92 Ongoing Into Clinton Foundation \\x93, Daily Caller)\\nOkay. So we\\x92re no longer dealing with just classified emails. The FBI expanded its investigation and is now wading through the real sewage, the pay-to-play corruption scandal that surrounds that vast reservoir of illicit contributions known as the Clinton Foundation. In other words, the FBI is on to something big, really BIG. I can almost see them dragging poor Hillary off to the hoosegow in leg irons and shackles. Isn\\x92t that the impression the above Quote: is supposed to produce? Here\\x92s more from Fuentes:\\n\\x93Several FBI field offices and U.S. attorneys offices pushed for the investigation after receiving a tip from a bank about suspicious donations to the Clinton Foundation from a foreign donor, according to the report .\\x94 (Daily Caller)\\n\\x93Foreign donors\\x94, \\x93suspicious donations\\x94, smoky rooms, bundles of money. It all fits, doesn\\x92t it? It\\x92s all designed to increase suspicion and make Hillary look like a crook which, coincidentally, is the relentless mantra of the Trump campaign. Funny how the FBI and Trump appear to be reading from the same script, isn\\x92t it? It\\x92s almost like it was planned that way.\\nBut what about the timing of all this? Is it really a coincidence or are Comey and Fuentes part of a one-two punch from the Trump campaign?\\nAnd, more important, what does the FBI actually have on Hillary? According to Fuentes:\\n\\x93When the team looking at the Weiner computers went to the team of investigators who worked on the Clinton email case, and showed the emails to them earlier in the week, they said, \\x93This is really significant. We need to take this to the Director.\\x94 ( 2:05 to 2:23 video )\\nRepeat: \\x93This is significant\\x94.\\nWhat\\x92s significant? Neither Comey nor Fuentes nor the more than year-long investigation has uncovered anything, unless you think the ridiculous rehash of the 15-year old Marc Rich investigation (which popped up on the FBI website this week) is \\x93new news\\x94 that should alter the course of the election. This is pathetic. If they have something, show us. Otherwise, Ferme ta bouche.\\nCheck this out from Thursday\\x92s Wall Street Journal:\\n\\x93As 2015 came to a close, the FBI and Justice Department had a general understanding that neither side would take major action on Clinton Foundation matters without meeting and discussing it first.\\nThe public-integrity prosecutors weren\\x92t impressed with the FBI presentation, people familiar with the discussion said. \\x93The message was, \\x91We\\x92re done here,\\x92 \\x94 a person familiar with the matter said.\\nJustice Department officials became increasingly frustrated that the agents seemed to be disregarding or disobeying their instructions.\\nFollowing the February meeting, officials at Justice Department headquarters sent a message to all the offices involved to \\x93stand down,\\x92\\x92 a person familiar with the matter said .\\nAs prosecutors rebuffed their requests to proceed more overtly, those Justice Department officials became more annoyed that the investigators didn\\x92t seem to understand or care about the instructions issued by their own bosses and prosecutors to act discreetly.\\nIn subsequent conversations with the Justice Department, Mr. Capers told officials in Washington that the FBI agents on the case \\x93won\\x92t let it go,\\x94 these people said.\\x94 ( Wall Street Journal )\\nCan you see what\\x92s going on here? There\\x92s a nest of rogue agents running wild at the FBI who\\x92ve been giving the DOJ the finger while they conduct their witch hunt on Hillary. And what have they achieved?\\nNothing! So far, they have nothing.\\nNow, I\\x92m not a fan of Madame Clinton either, in fact I wouldn\\x92t vote for her if they rubbed me down with bacon grease and stuck me in a bear cage, but, c\\x92mon now, do we really want rogue cops and self righteous bureaucrats inserting themselves into our elections and picking the winners?\\nThat\\x92s bullshit.\\nIf the FBI has some solid proof of wrongdoing that will put Hillary behind bars for good, than I say, \\x93Bravo\\x94. But until then, they should keep their damn hands off our elections!\\nMike Whitney lives in Washington state. He is a contributor to Hopeless: Barack Obama and the Politics of Illusion (AK Press). Hopeless is also available in a Kindle edition . He can be reached at fergiewhitney@msn.com .'"}, "time": 1742628511.787779}