{"duration": 0.14195013046264648, "input_args": {"text": "'Good morning. (Want to get California Today by email? Here’s the  .) Today’s introduction comes to us from Adam Popescu, a reporter based in Los Angeles.  In turning the Trayvon Martin tragedy into a virtual reality film, the director Nonny de la Peña combed through public court records and stitched together 911 calls to structure an auditory narrative of the rainy night that ended in the shooting death of the unarmed    by George Zimmerman. To get the look of the apartment complex in Sanford, Fla. where the events took place, Ms. de la Peña, a former Newsweek correspondent who runs a virtual reality company in Santa Monica, found architectural drawings of the location online, designs that were then rendered as video   C. G. I. models. The final product, called “One Dark Night,” was recently shown at Los Angeles’ Hammer Museum and is now available on Google Play and Steam. “This is immersive journalism,” she said, intended to drive empathy. But it also raises issues about taste and truth. I caught up with Ms. de la Peña by phone. Here are some excerpts from the conversation: Q. How did this piece come together? A. “One Dark Night” is sourced entirely from 911 calls, trial testimony and architectural drawings of the condo complex where the shooting took place. I’m still an investigative journalist at heart, and it was very much the kind of story I used to cover as a print reporter. I really wanted to make a piece about the shooting, to be able to cast any kind of additional spotlight on the case using V. R. Q. Why Trayvon Martin? Why not Freddie Gray or another tragedy? A. Nothing other than I had the ability and I had the time and I felt I was the person to do it. Something clicked when I began investigating the Trayvon case. Q. You say it’s meant to draw empathy. Do you acknowledge that videos of shootings can be interpreted in multiple ways, and that this piece is subject to such questions? A. Definitely. I’ve had a journalist say that they better understood Zimmerman’s position. We’re always trying to figure out what we can convey to the viewer and what’s appropriate to show. For audiences not reading newspapers or watching broadcast TV, V. R. can reach them where they play. This is how you keep an informed global citizenry and keep democracy robust. What do we decide to shield them from? I think that that question is only going to be more pronounced as this media becomes more mature. (Please note: We regularly highlight articles on news sites that have limited access for nonsubscribers.) • The Trump administration said it would crack down on marijuana sales in states that have approved recreational use. [The Cannifornian] • “This has violated the trust of our community. ” The Santa Cruz police chief accused federal officials of misleading the city on immigration raids. [NBC Bay Area] • Far fewer students are applying for financial aid through the California Dream Act amid fears over deportation. [Los Angeles Times] • How an   Los Angeles police officer telling teenagers to stay off his yard escalated to gunfire, protests and investigations. [Los Angeles Times] • America’s dams are showing their age  —   more than 70 percent are more than 50 years old. [The New York Times] • Some Silicon Valley executives think a universal income will be the answer to automation. The beta test is happening in Kenya. [The New York Times] • Since moving to Venice, Snap has alienated a community that prizes itself for a quirky sensibility. [Bloomberg] • Google’s   car unit noticed a “striking resemblance” in Uber’s design and its own. [The New York Times] • Bette Kroening, whose Bette’s Oceanview Diner in Berkeley exerted influence on the Bay Area restaurant world, died at 71. [San Francisco Chronicle] • Famous during the 1980s for hosting game shows like “Love Connection,” Chuck Woolery has turned to   podcasting. [The New York Times] • The Academy Awards are on Sunday. And the winners will be . .. [The New York Times] • Isabelle Huppert’s subversiveness and underplayed chic have transformed the actress, an Oscar contender, into fashion’s unlikely new muse. [The New York Times] • A new book includes about 170 images  —   many never before published  —   from the internment of   during World War II. [The New York Times] • Video: Aerial views of the intense flooding in San Jose. [YouTube | Kevin Lowe] Among those most pleased by the return of rain to California have been wild mushroom enthusiasts. Years of drought put a damper on the foraging of fungus in the state’s forests, a hobby that has burgeoned with the growing popularity of fresh, local food. Amateur clubs up and down the state are organized around both the culinary and scientific celebration of California’s many mushroom species. As the rainfall began to surge last October, so did the autumn mushrooms, said Debbie Viess, a   of the Bay Area Mycological Society. “We had a tremendous year for porcinis,” she said, “and it’s been a really good year for chanterelles too. ” Even with the continuing rain, several mushroom experts were wary about making predictions for the spring season, when popular morel mushrooms are normally abundant. While water is necessary, it isn’t sufficient, said Patrick Hamilton, a longtime mushroom picker in Sonoma County. “There are so many things, from soil conditions, to climatic conditions, to the age of the trees, all these things are difficult to understand,” he said. But the mystery, he added, “is part of the fun. ” California Today goes live at 6 a. m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes. com. The California Today columnist, Mike McPhate, is a   Californian  —   born outside Sacramento and raised in San Juan Capistrano. He lives in Davis. Follow him on Twitter. California Today is edited by Julie Bloom, who grew up in Los Angeles and attended U. C. Berkeley.'"}, "time": 1742561693.3088439}