{"duration": 0.0686497688293457, "input_args": {"text": "'We know by now that various governmental institutions have spilled the beans regarding the existence of UFOs, but the Chinese want to break the ice and expose it all. \\nVia AlternativeNews \\n\\nBecause of the constant pressure posed by the people willing to know the truth of what’s really happening on this planet, they had no choice other than declassify decades of thorough investigations of unidentified flying objects.\\nThe CIA, the FBI, the Navy, NASA, military officials, retired astronauts, ex-personnel of area 51, plus many other governments from Brazil, Russia, and recently China, are all admitting at least in part or in full that really some messed up things are happening around us, with cause probably being otherworldly.\\nScroll Down For Video Although this data has been known for quite some time by those actively investigating the UFO phenomenon, there are others who are just waking up to this reality and who deserve to know the truth.\\nIn a recent gathering of the non-profit organization known as Citizen Hearing, Shi-Li Sun, an esteemed researcher and president of the Chinese UFO Federation has stepped forward denouncing this concealed reality of UFOs.\\nAccording to him, the UFO phenomenon not only is authentic, but it stretches back tens of thousands of years, to a time when ancient China was barely shaping its culture and traits. In his acceptance, otherworldly visitors might had impacted our entire society, and for an unknown period of time contributed to the foundation of humanity before vanishing into outer space, probably to return at a later date to check on Earth’s well-being. In Chinese culture, all these otherworldly beings personified as deities were converted into a single great cosmic beast – the Dragon.\\nChinese people consider ourselves as the descendant of Dragon, and Dragon is from outer space in the Chinese culture, so in the Chinese culture we are from outer space as descendant of Dragon,” Shi-Li affirmed.\\nTo break this short, here is what he had to say on behalf of himself, and all the prominent figures involved in the Chinese UFO Organization:\\nCertainly, after years of research, a large number of Chinese UFO scholars, including myself, are convinced of the authenticity of UFO, the existence of UFOs and aliens…So, we believe in the existence of UFOs, we believe in the existence of aliens and extraterrestrials.”\\nIf you want to find all the spicy details unraveled by the Chinese, make sure to watch the official statement in the video below. Oh, and don’t forget to spread the word about these groundbreaking news, everyone deserves to know about this. [Skip to 6:50 mark for the statement]\\n'"}, "time": 1742564494.7071147}