{"duration": 0.1420881748199463, "input_args": {"text": "'According to John Kaminski, the New Boss is the same as the Old Boss. FORGET IT! “If that’s what you think,” Kaminski says, “you’re kidding yourself!” \\nPresident-elect Donald Trump’s claim he is reinvestigating 9/11 is just so much meaningless hot air — more neocon crapola — if he intends to solve the greatest crime in American history by including two of the event’s participating perpetrators — Rudy Giuliani and Lewis Eisenberg — on his team of detectives. \\nWhat kind of truth can we expect from this kind of sandbagged scrutiny? None at all. Once again our government is investigating itself with predictable results. It will do no better than the first time — which was a total whitewash, because it is the very system itself that all these political functionaries are trying to defend which bears responsibility for this event and its impact on history. \\nHiring the people who played minor supporting roles in the 9/11 bloodbath to identify its architects and actors may yield a few sacrificial scapegoats like Cheney and some generals, but the top of the line power structure will remain solidly in place, hidden from view and utterly in control of world events. \\nThat Trump has surrounded himself with the tainted players who have carried out all these wars for Israel augurs for a dark future in which the militarization of America will further shrink individual rights, and the harsh crackdown on legitimate dissent — which will soon be banned — plainly signals the end of free speech as we have known it in the United States. \\nRecall Thomas Jefferson’s dictum: “Freedom of the press cannot be limited without being lost.” Today, it is long gone. The press prints only what the government allows it to print. \\nFor Trump to hire such rancid refugees from the Bush administration means that he won’t be investigating 9/11. Instead he will be crafting a new more realistic coverup that lambastes Saudi renegades and totally omits the overwhelming presence of Israeli Jews in all aspects of the tragedy — the same presence that now dominates the U.S. government and its criminal activities throughout the world. \\nPreemptive war is criminal activity, in case you didn’t know. The U.S. is practicing it everywhere under the cynical guise of fighting terror, which it itself creates by hiring thugs from around the world to fit into the proper terror slots and become believable enemies for the press to vilify and our military to bomb. \\nThe U.S. has literally slaughtered millions of people around the world at the behest of a small group of mostly Jewish men (and the gentiles they have bought) who control not only virtually all the money of the people in the world, but also control their thoughts as a result. \\nMayor Giuliani ran the command post in Building 7. You remember Building 7, that building that was knocked down by not being hit by an airplane. Giuliani knows everything that happened, and who did what. \\nEisenberg, one of the world’s foremost financiers, was the head of the New York Port Authority who leased the Twin Towers to Silverstein. Silverstein, who spoke frequently with top Israeli leaders, wound up with $4.55 billion. \\nThe question with regard to Trump’s integrity kind of splits down the middle since he seems to have a genuine desire to succeed and restore the peace, but he is indebted to forces far larger than himself, which he is now trying to placate by surrounding himself with the traditional pseudo Republican goons like Gingrich and Romney. \\nIf only they were genuine Republicans it wouldn’t be so bad, but they’re poseurs, all ultimately working for the Rockefellers and the Rothschilds. \\nBusiness as usual in the Jewish American empire, gnawing on the fatted calf while   bleeds. \\nTrump’s choices reveal a desire to continue the swashbuckling sadism of the Bush Administration. Throughout his campaign I always shuddered when Trump would proclaim that we needed a stronger military, and I thought, tell that to the people beneath the bombs because they want no part of any of this. \\nAs a newspaper blows trivial events into earthshaking issues, so politicians identify all manner of enemies that demonstrate the desperate need for them to be elected. \\nLike the Boston Marathon bombing that turned a mercenary drill into a region wide suspension of freedom of movement, the worst story possible is presented even as inconvenient facts are left behind. \\nThink about the atrocities and false flag shockers that have been foisted on us since 9/11. Statistics reveal that more than 90 of significant terror incidents began life as FBI sting operations manipulating low IQ bigmouths into capital crimes. \\nWhy is it the cops can commit crimes against the people but the people can’t commit crimes against the cops? This is not the kind of freedom we thought we’d get while growing up. \\nTrump certainly is not addressing any of these issues, and a Trump administration will merely continue the clumsy depredations and smokescreen lies that have exemplified the utterly corrupt and criminal nature of the United States as it is run by Jews bankers holed up in the City of London, and wreaking havoc throughout the world by their control of everyone’s money. \\nWhat is really needed is a full accounting of what the Jews have done to the United States, and restitution to United States citizens over moneys illegally stolen by the Federal Reserve Corporation to be taken from its stockholders immediately. \\nOf course this is impossible because the Jews own the government and all the corrupt minions within it. One word from them and you’re out of a job. \\nThe avaricious Jews are really only a reflection of the darker side of humanity. Like good sociopaths, they learned everything they know by mimicking others, and have become better than everyone else at what they do simply by practice and cooperation. \\nThey have never once considered that the fate of the world ultimately depends on treating everyone in the world as members of your own family, even as that becomes impossible on a continent overrun by hungry savages who were put there by these very same sadists who control the United States and its fearsome war machine. \\nA war machine that is now being used against its own people — through media, medicine and food — as the people who control everything consolidate their hold on a population rapidly being shaped into the cattle our Hebrew herders have always called us. DISCLAIMER. All articles, comments, and videos published on this website reflect the views of their original authors and in no way necessarily mirror the outlook of anyone associated with this website. VIDEO : 8:46 mins'"}, "time": 1742561965.1892655}