{"duration": 0.030247211456298828, "input_args": {"text": "'by ARIANA MARISOL \\nWith pollution everywhere, it has become hard to find healthy soil that can support a good, healthy garden. This can be especially hard if you live in an urban area. Growing this grass will remove nearly half of all PCB contamination from your soil in only six months. \\nSwitchgrass, otherwise knowns as Panicum virgatum, is a perennial warm season bunchgrass native to North America. The prairies of the Midwestern United States were once covered with vast swaths of this grass, bringing nutrition to the soil. A versatile and adaptable plant, switchgrass can grow and thrive in many different weather conditions and soil types. It can grow in soil that is considered to be too erodible, too sandy, or even gravelly for most other crops. \\nA study that was funded by the National Institute of Environmental Health Sciences Superfund Research Program and the University of Iowa found Switchgrass to be a highly effective soil detoxifier. \\n\\nResults Polychlorinated biphenyls, also known as PCB’s, are highly toxic chemicals that were once widely used for industrial development. They are classified as persistent organic pollutants, meaning they are very hard to break down and have a tendency to accumulate in the bodies of living creatures. Even though the U.S. Congress banned these chemicals in 1979, PCB contamination is still a rampant issue.This contamination is the reason why residents are advised not to eat too much fish from regions of the Great Lakes. \\nTo test the effectiveness of switchgrass to clean soil, researchers took clean soil and contaminated it with dangerously high amounts of PCB, concentrations that are regularly found in soils throughout the U.S. In order to make sure the PCB fully leached into the soil, they sealed the soil in tubs and let them sit for two months at 77 degrees Fahrenheit (22 degrees Celsius). \\nResearchers then placed this soil into plastic containers and switchgrass seeds were planted. For comparison, another container was filled with contaminated soil and left unplanted. Researchers also planted switchgrass seeds in a container of healthy soil. All soils were analyzed after 12 and 24 weeks. \\nAfter 24 weeks, the PCB levels in the switchgrass-planted containers had dropped by 40 percent. When researchers added PCB-oxidizing microorganisms to the soil, PCB levels fell to 47 percent. Researchers also found that this good bacteria had a easier time surviving in switchgrass-planted containers than in bare soil. \\nDetox Your Soil \\nThis study helps to prove that we can use natural techniques to rid our soil or harmful toxins. PCB can have detrimental health effects on the people who consume food from the soil it has contaminated. Planting switchgrass can help your soil rid itself from these harmful chemicals and bring you healthy food that is safe for consumption. It can also work as a natural ground cover, companion plant, and erosion preventer. Switchgrass is extremely easy to grow and gives us hope to move towards a healthier future. \\n\\nAriana Marisol is a contributing staff writer for REALfarmacy.com. She is an avid nature enthusiast, gardener, photographer, writer, hiker, dreamer, and lover of all things sustainable, wild, and free. Ariana strives to bring people closer to their true source, Mother Nature. She is currently finishing her last year at The Evergreen State College getting her undergraduate degree in Sustainable Design and Environmental Science. Follow her adventures on Instagram.'"}, "time": 1742628549.0425045}