{"duration": 0.048012733459472656, "input_args": {"text": "'Home › POLITICS | US NEWS › PETER THIEL’S CIA-BACKED DATA MINING COMPANY WINS COURT BATTLE AGAINST THE U.S. ARMY PETER THIEL’S CIA-BACKED DATA MINING COMPANY WINS COURT BATTLE AGAINST THE U.S. ARMY 0 SHARES \\n[10/31/16] PALANTIR, A DATA mining behemoth that received startup funding from the CIA, just got its foot in the door to a lucrative U.S. military contract following a months-long legal battle with the Army. \\nOn Monday the software company won the chance to pitch its data services, the Gotham Platform, to help build out an upgrade to the Distributed Common Ground System — an Army program “that gathers intelligence spanning all echelons from space to mud,” according to the service’s website. \\nThe contracts for the project could eventually total in the billions of dollars. \\nThe Army has had a strained relationship with the Silicon Valley startup, despite the company’s coziness with the intelligence community, according to press reports. This summer, Palantir sued the Army , alleging it failed to abide by solicitation rules when it excluded the company from the bid to help design the intelligence system. \\nThe Army asserted Palantir couldn’t sue before the contract was awarded, and didn’t have standing to do so. \\nU.S. Court of Federal Claims Judge Marian Blank Horn agreed with Palantir during an open hearing on Monday, according to Bloomberg News. Her written opinion was filed under seal, giving both parties a chance to request redactions. \\nOnce called “the war on terror’s secret weapon,” Palantir’s software helps users, whether law enforcement officials or businesspeople, understand and track relationships in data. The company’s proprietary algorithms are designed to sift through massive troves of data — whether bank transactions, social media interactions, weather calculations, or crime reports — and spit out conclusions about everything from terrorist cells to car thieves. Post navigation'"}, "time": 1742562228.0740697}