{"duration": 0.07505369186401367, "input_args": {"text": "'Getty - Chip Somodevilla The Wildfire is an opinion platform and any opinions or information put forth by contributors are exclusive to them and do not represent the views of IJR. \\nHillary Clinton advisers Cheryl Mills and Robbie Mook provide one of the most revealing looks inside the campaign yet, courtesy of a WikiLeaks hacked email. \\nIn the email , Robbie Mooks argues that Hillary Clinton would be making a mistake to run on her gender as an argument for her suitability to be president: \\n\"In fact, I think running on her gender would be the SAME mistake as 2008, ie having a message at odds with what voters ultimately want. She ran on experience when voters wanted change...and sure there was plenty of data in marks polls with voters saying her experience appealed to them. But that was missing the larger point—voters wanted change. \\nSame deal here—lots of people are going to say it would be neat for a woman to be president but that doesn\\'t mean that\\'s actually WHY they will vote for her. That\\'s likely to be how she will handle the economy and relate to the middle class. \\nIt\\'s also risky because injecting gender makes her candidacy about HER and not the voters and making their lives better. \\nThat said I would not be surprised if this is a powerful message for donor and activist engagement (vs persuadable voters).\" Image Credit: Michael Buckner/Getty Images \\nThen, Mills responds: \\nInteresting how hard this narrative is being pushed. \\nA friend shared this article with you from The Washington Post: \\nEmbrace being a woman running for president.. \\nhttp://wapo.st/1dbwtNo \\nThe link is to a Chris Cillizza article on “How Hillary Clinton can correct the biggest mistake she made in 2008.” \\nBut one of the most fascinating tidbits is Mooks\\' suggestive off-hand reference to getting a “third party spoiler”: \\n\"Just need a third party spoiler and we\\'ll be all set! \\nI think the chatterers will dissect and criticize whatever she chooses to do but it\\'s going to be so important that the research drive it. I often felt in 08 that the research was being used to back up a premise instead of genuinely find the right target.\" \\nTo which Mills replied cryptically: \\n“WJC redux of 1992” \\nWJC is a common acronym for former President William Jefferson Clinton. The reference is to the three-man race in 1992 between George H.W. Bush, Bill Clinton and Ross Perot. Contrary to what is widely believed, there is fairly convincing evidence that Perot did not “cost” Bush the 1992 election. \\nTrump supporters have mused if presidential candidates Gary Johnson and independent Evan McMullin are in the 2016 race for the sole purpose of sabotaging the Republican presidential nominee. Image Credit: George Frey/Getty Images \\nJohnson, who is running at about six percent in the polls, is running on the Libertarian Party ticket. For historical context, the Libertarians have sent up a presidential candidate every year for the last 44 years . Libertarians have plenty to disagree about regarding Trump\\'s plan for the United States, whether it be on national security, immigration or trade. \\nThat leads us to Evan McMullin, a man whose name recently caught fire on Twitter due to the so-called “ Mormon mafia ” started by Mitt Romney. Lou Dobbs, an ardent Trump advocate, coined the phrase while labeling McMullin... — Lou Dobbs (@LouDobbs) October 23, 2016 \\nMcMullin was indeed a Mormon missionary, but reports of him belonging to a “mafia” remain unconfirmed. The candidate was a CIA operative and an investment banker at Goldman Sachs, which has fueled speculation and conspiracy theories about his run. \\nInterestingly, the candidate is currently surging in Utah and his support may be underestimated . If McMullin could pull off a victory, it would launch an improbable scenario that could see the election thrown to the House of Representatives and an all-out scramble to nominate a president and vice president of the Congress\\'s choosing. \\nThis potential monkey wrench in Trump\\'s plans has fueled outrage and concern among supporters: Team Hillary is all set: Ex-CIA Evan McMullin is the expert covert spoiler. Drink up, #Utah , the Kool-Aid tastes fine! | #RedNationRising pic.twitter.com/nMVR1fqehz — RNR Ohio (@RNROhio) October 27, 2016 Evan McMullin is a tool of the entrenched corrupt DC politicians, this is a spoiler campaign, nothing sincere about it. #ldschurch #mormon '"}, "time": 1742564162.91186}