{"duration": 0.08678102493286133, "input_args": {"text": "'Waking Times \\nOne of the greatest takeaways of election 2016 is that mainstream, corporate news no longer cares about maintaining the appearance of objectivity, and that the internet has made it possible to counter the top-down state driven narrative with genuine, alternative journalism. This of course challenges the king-making abilities of the corporate media who were shocked when their preferred candidate lost. \\n“Hillary Clinton was the choice of nearly every American newspaper editorial board. It didn’t matter.” ~ The Los Angeles Times \\nJust a week after the election, Google, Facebook, Twitter and other internet giants are now declaring a war on so-called fake news sites , trumpeting the idea that unregulated information is confusing and misleading the public and interfering with our ability to make sound decisions. \\nThe sub-text here is that the public can not be trusted, and therefore information in the public domain must be controlled and regulated. But by whom, exactly? \\nAlready several lists of websites are being widely circulated around the internet and heralded as go-to places to instantly determine the credibility of an internet publisher. There are a number of alarming problems with this, especially for a nation that supposedly values freedom of speech and freedom of the press. Several of these lists taxonomize websites under multiple categories, which are only tangentially related, yet grouped under the all encompassing banner of ‘fake’ news. \\nBut, what is the difference, for instance, between fake news and misleading news? And, is there a material difference between misleading news and ‘clickbaity’ news, or is it just about wording of the article title? Also, what is the difference between a fake news site and a hoax site? And, where does editorial news fit into this spectrum, and if the term propaganda is being used, does it now apply to editorializing in general? \\nThe most important concern, though, is who decides what fake news is? The Zimdars Hit List \\nThe most widely circulated list right now was created and is maintained by Melissa ‘Mish’ Zimdars , a professor and researcher at Merrimack College in North Andover, Massachusetts. \\n“Bio: I am an assistant professor of communication & media, and this list started as a resource for my students, who are learning about journalism/social media/media literacy.” ~ Melissa Zimdars \\nThe Zimdars list of news site you should avoid is located here . It breaks down some 100+ websites with different ratings under the broad introductory headline, “ False, Misleading, Clickbait-y, and/or Satirical “News” Sources.” There are zero examples given for any of these sites explaining why they fall under the heading of fake news, or why their content is to be considered questionable, just a link to their homepage. In other words, these sites are fake news sites because Melissa Zimdars says they are. \\nWhen I first saw this list, I was actually not surprised to find that my site, www.WakingTimes.com , was on this list, given our easy to spot anti-status quo perspectives, although it was intriguing to me that my site was misnamed Walking Times, which I took as a sign of the author’s carelessness in creating this list. \\nWaking Times has a five-year history as an internet blog and content publisher, with almost 7000 original, guest authored and aggregated articles which express the personal interests, biases and world views of the editor, myself, Dylan Charles . This is perfectly legal and acceptable in a free society. I contacted Ms. Zimdars and demanded that she remove our site from the list, and although I have not heard back from her personally, to her credit, our site was removed from the list within half an hour of my email. \\nFor background on her biases, Ms. Zimdars has publicly responded to the question of what news sites trusts and visits: \\n“Some people are asking which news sources I trust, and all I can say is that I read/watch/listen very widely, from mainstream, corporate owned sources ( The New York Times , The Washington Post, The Boston Globe , The Wall Street Journal , Forbes ) as well as The Atlantic, National Public Radio, and various local and alternative sources with different political perspectives, some of which are included on this list.” ~Melissa Zimdars \\nWithout question, many of these mainstream sites are guilty of publishing false, biased, clickbaity, and propagandistic news, especially so in this election season, so it is clear that an agenda is in play here. The U.S. News Hit List \\nThis list, published by U.S. News & World Report by Rachel Dicker , Associate Editor of Social Media, only features 16 websites, out of thousands, defaming other people’s work without proof, citation or even examples. \\nTitled, Avoid These Fake News Sites at All Costs , the Dicker list, which includes the well-known satirical site, The Onion , offers three categories, satire, hoax, and propaganda, all lumped under the banner of fake news. Serious anti-establishment blogs like Activist Post are grouped along satire and hoax as propaganda. \\nWho decides which propaganda is allowable? \\nRachel Dicker has published a number of articles for U.S. News, which can be seen on her author page, here . A quick scan of her work reveals an overt bias towards liberalism, against Donald Trump, for social justice issues, and towards leftist political causes. In other words, Rachel Dicker herself has a bias and an agenda, and is a propagandist. The Growing List of Other Hit Lists \\nNow that it’s all the rage to castigate supposedly fake news in frenzy of coming official censorship, the list of lists is growing, and propagandists have now been given franchise to defame others. Ed Brayton has a list, here . Inquisitr has its elaborated list, here . Snopes, the self-proclaimed oracle of internet truth has published its warning, here . The Independent has posted their version of the Zimdars list, here . \\nPardon the pun, but the list goes on and on. Real Issues – Censorship and Personal Responsibility \\nWhat’s really happening here is a portal towards total internet censorship is being opened and exploited by the establishment. \\nThe internet has in recent years been flooded with bogus news sites, and it has long been my suspicion that this phenomenon would lead to exactly the scenario we see unfolding right now. The public would clamor for a crackdown on so-called fake news, and in the wake, real, truthful, and critical alternative journalists will be forced out of business and off the internet by an authoritarian corporate government. \\nAnother real issue at play here, though, is the concept of personal responsibility on the part of both publishers and internet users. There is inarguably some gray area when looking at how the internet will evolve, as there are no doubt players who will publish anything just to make money, but does that mean that individuals shouldn’t be trusted with making up their own minds? \\nThe following message from activist John Vibes does well to sum up the conflux of these two issues in the following statement: \\n“The internet and the alternative media has given us freedom of information. One drawback to this is that people did not seem to get the memo that responsibility is somewhat of a prerequisite for true freedom. \\nIn previous eras, the mainstream media spoon-fed people information, and whether it was true or not, everyone accepted it at face value because they didn’t have much of an ability to fact check even if they wanted to. \\nNow we have a sea of information thanks to the intern et and the alt-media. Just like the mainstream media in the past, some of this information is factual, while some of it is not. With the mainstream media though, since they only gave you one narrative instead of a sea of information to sift through, it was easy for someone to make up their mind about things. \\nNow with all this freedom of information, people really need to do their due diligence and actually research the information they come across, instead of letting a media organization spoon feed them a particular point of view, this goes for both alternative and mainstream media. \\nI say this in light of the fact that multiple sites that i write for have been targeted as “fake news sites” because we present a viewpoint that is alternative to the mainstream. We are being lumped in with bullshit clickbait sites and i think that is all a part of the plan that the mainstream has to reassert their legitimacy. \\nWe work very hard to fact check our info, and always make corrections when necessary, however, people need to realize they are in a new era of media, one that requires research and personal responsibility.” Final Thoughts \\nThe changing face of news and information with the advent of the internet and user friendly content management systems means that anyone can share their ideas with people who are willing to look at them. And people naturally have opinions about politics and life, meaning that we are all propagandists when we publish on the internet. \\nAs the corporate and political establishment look for more ways to control the debate and control public opinion, we will see the rise of self-appointed truth czars and the rise of an official ministry of truth. Unless you do something about it.   Dylan Charles . About the Author \\nDylan Charles is a student and teacher of Shaolin Kung Fu, Tai Chi and Qi Gong, a practitioner of Yoga and Taoist arts, and an activist and idealist passionately engaged in the struggle for a more sustainable and just world for future generations. He is the editor of WakingTimes.com , the proprietor   a grateful father and a man who seeks to enlighten others with the power of inspiring information and action. He may be contacted at . This article ( Self-Proclaimed Truth Czars Create Lists of ‘Fake News’ Sites to Control Your Mind   Dylan Charles   \\n '"}, "time": 1742628589.827067}