{"duration": 0.10291218757629395, "input_args": {"text": "\"Email \\nA report by market research group GfK indicates that half of ObamaCare’s enrollees avoid visiting the doctor to save money, underscoring once more that despite the Obama administration’s claims that the healthcare law has helped to insure more Americans, it remains unaffordable and inefficient and fails to service the very Americans it has enrolled. \\nThe Washington Free Beacon reports that GfK conducted a study in which it asked ObamaCare enrollees which measures they’ve taken over the course of the past year to save money on healthcare costs. \\nThirty-six percent admitted to skipping doctors’ visits even when sick, while 22 percent stated that they’ve avoided preventative care visits. Twelve percent avoided lab testing, while another 12 percent said they even delayed surgery. “Exchange users with lower incomes (below $25,000 a year) are turning to urgent care facilities and ‘minute clinics’ in huge numbers; 27% have done so in the past year, compared to just 12% of the overall [Affordable Care Act] customer population,” the study says. \\n“Visiting one of these outlets is often appealing to people who may have not formed lasting relationships with providers, especially as costs can be substantially lower,” the study said. \\nBut that was one of the many things that the healthcare law was supposed to fix — another broken promise, along with consumers being able to keep their doctors and health plans and actually being able to afford insurance. \\nTwenty-four percent of ObamaCare enrollees in the GfK study stated that in an effort to save money, they purchased cheaper insurance plans on the market, which sadly also come with higher deductibles, deterring enrollees from actually using their health insurance. They simply selected plans to ward off the fine. \\nIt appears there will not be a reprieve for these consumers in the near future. With healthcare costs set to increase an average of 25 percent next year, one must assume that more people will be compelled to opt out of using the healthcare for which they pay. \\n“Even before the news broke that the cost of mid-range health insurance from the Affordable Care Act exchanges will rise about 25%, millions of Obamacare customers were already skipping doctor visits to save money,” GfK’s study said. “With mid-level exchange premiums set to rise about 25%, more cutbacks in care seem likely.” \\nAnd still, President Obama touts the Affordable Care Act as his signature achievement. This administration cares more about how many people have insurance than how many people can actually use their insurance, which is really the more important component. What good is having insurance when it is virtually unusable? \\nIn addition to the increased costs, consumers are left with limited options for their insurance plans, as the total number of HealthCare.gov insurers will drop from 232 to 167 in 2017, Fox News reports. What’s more, the co-ops that were created to keep prices competitive are struggling just as much as the healthcare insurers. Seventy-percent of the original co-ops have gone under. \\nEarlier this year, President Obama told a crowd in Milwaukee that 20 million more Americans have health insurance “thanks to the law.” \\nBut according to Brian Blase, senior research fellow at the Mercatus Center, only those who receive subsidies are continuing to sign up for coverage in droves. Blase adds that many of those new enrollees are “gaming the new rules to enroll only when they need expensive medical services.” \\nUnfortunately, enrollment in ObamaCare is concentrated among those low-income individuals who receive significant subsidies to reduce premiums. As noted by Fox News last week, five to seven million Americans with insurance are either ineligible for that same assistance, or purchase their policies outside of the marketplace, where subsidies are not available. \\nBlase opines, “This year’s huge premium increases combined with much less choice of plans for Americans across the country demonstrate the law is wrecking the individual market for insurance and needs large scale revision.” \\nWill that revision come after the presidential election? That remains to be seen. \\nWhile Republican presidential contender Donald Trump announced that he would repeal ObamaCare and replace it with a health savings account program, Democrat Hillary Clinton has proposed increasing subsidies and making them available to more people, a solution that would greatly increase taxpayer costs. \\nSadly, none of the candidates have offered the best solution, which is for the federal government to adhere to its constitutional limitations and remove itself from the healthcare industry entirely. Government intrusion in healthcare is what has caused the very problems that led to calls for healthcare “reform” in the first place. True free market healthcare would be far better for all Americans, including those who have difficulty affording insurance under today's system. Under this constitutional system, customers would be able to work with their physicians directly and the marketplace would offer competitive pricing and plans. \\nOnly with true free market healthcare would consumers be able to afford both owning their health insurance plans, and also using them. What a novel concept. Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.\""}, "time": 1742561927.2148542}