{"duration": 0.14354443550109863, "input_args": {"text": "'Email \\nBradley Birkenfeld held a book launch party at the National Press Club tonight. \\nAnd it is telling that he invited some of the nation’s top whistleblowers — including John Kiriakou who spent two years in prison — to be his guests. \\nOne of the ironies that was not lost on anyone in the room is that increasingly, it’s not corporate executives but whistleblowers who are doing jail time. \\nBirkenfeld himself blew the whistle on his employer, the giant Swiss bank UBS, where the rich and famous stashed their millions in numbered accounts to evade U.S. tax authorities. \\nGuess who went to jail? \\nBirkenfeld. \\nA copy of Birkenfeld’s book — Lucifer’s Banker: The Untold Story of How I Destroyed Swiss Bank Secrecy — was given to each guest at the book launch. \\nAnd tucked inside was a book mark — a laminated copy of the check that Birkenfeld got from the U.S. government for helping recover over $15 billion from American tax cheats. \\nThe government paid Birkenfeld $104 million as a bounty, but the check is made out to Birkenfeld in the amount of $75 million. (Why minus $29 million? Taxes.) \\nThis is perhaps one of the best corporate crime books ever written. \\nAnd the reason is that it clearly exposes our system of no fault corporate crime. \\nDeferred prosecutions. Non prosecutions. Neither admit nor deny consent decrees. Executives rarely sent to jail. \\nJust have the corporation write a check. Thank you. \\nBirkenfeld exposes the perverse outcomes of that system at almost every turn. \\nIt’s not just that whistleblowers are doing prison time and corporate executives are not. \\nIt’s that when corporate executives are sent to jail — \\nWell, take the case of Joe Nacchio. \\nWhile doing his 30 months in prison at Schuylkill Federal Correctional Institution in Minersville, Pennsylvania, Birkenfeld ran into Nacchio. \\n“Joe Nacchio had been the President and CEO of Qwest, a huge telephone company,” Birkenfeld writes. “He was close to the Bush people, even visiting the White House on occasion. Shortly after 9/11, the Bush administration had gone to all the phone companies and demanded their customer records and email. AT&T and Verizon had caved right away, but Joe told the Feds to fuck off.” \\n“We’re a private company,” Naccio said. “I can’t do that” \\n“Yes, you can,” said the Bushies. “Matter of national security.” \\n“It’s unconstitutional,” Joe protested. “Without warrants from a judge, on a case-by-case basis, I won’t do it.” \\n“Oh, really?” \\n“So the Bushies charged him with insider trading and put him away for seven years. Joe’s replacement at Qwest got the message, and the Feds got the records.” \\nI’m in Washington and I like this book because it exposes the system of no fault corporate crime enforcement. \\nBut a lot of people in Washington are not going to like this book. \\nBirkenfeld asks some pointed questions — including — why was the Department of Justice so reckless as to allow UBS to disclose the identities of only 4,700 (including some relatively low income dentists) of the 19,000 illegal account holders? \\nThose protected probably included many names you would recognize. \\nWhy were these names never made public? \\nThat’s why Hillary Clinton is not going to like this book. \\nBirkenfeld recounts the deal Clinton cut with the Swiss that Birkenfeld says kept the big names secret. \\nPrior to Clinton’s deal with the Swiss, UBS had only seen fit to contribute $60,000 to the Clinton Foundation, “an amount that wouldn’t even cover the bank’s annual parking tickets,” Birkenfeld writes. \\n“Afterward the Clinton Foundation’s cash registers rang up $600,000 in UBS gifts,” he writes. “The bank also decided to partner with the Foundation on some inner-city development programs, issuing a $32 million loan at very reasonable rates. Oh, and suddenly UBS also thought that Bill Clinton would make a very fine paid speaker about global affairs, so they paid him $1.52 million for a series of fireside chats with the bank’s Wealth Management Chief Executive, Bob McCann. It was Bill Clinton’s biggest payday since leaving the office of the Presidency.” \\nMost of the lawyers who Birkenfeld ran into are not going to like this book because they are caught up in the corporate crime industrial complex that defines inside the beltway lawyers. \\nFor example, when Birkenfeld approach Skadden Arps partner Bob Bennett to take his case against UBS, Bennett begged off. \\n“Don’t tell me Bob, they’re your client,” Birkenfeld asked. \\n“They’re everyone’s client,” Bennett tells Birkenfeld. “That’s what all the major financial firms do, especially if they have big interests and lobbyists here in Wonderland. They put everyone on retainer. It’s like buying lawsuit insurance.” \\nBut most importantly, the Justice Department is not going to like this book because Birkenfeld says it’s not about the facts, the law and justice. \\nIt’s about brute corporate power. \\nWhy did the Department of Justice fail to fine UBS adequately — settling for only $780 million in 2009 — not even commensurate with the billions of dollars illegally earned in profits by UBS over many decades? \\nWhy did the Department of Justice release from custody two of the most senior UBS executives who oversaw this massive fraud? \\nBirkenfeld says it’s about corporate connections. \\nWhich he lays out in intimate detail. \\nAt the book launch party, Birkenfeld said he had sent a copy of the book to the President Obama at the White House. \\n“The American taxpayers need to know why the Department of Justice took such extraordinary actions to protect the perpetrators of the largest tax fraud in history.” \\n“Why the keen interest to shield from the American public all of those getting a free ride off the backs of tax-paying, law-abiding citizens? I ask you Mr. President, what will you do to investigate these serious injustices?” \\nThat question Birkenfeld asked sort of tongue in cheek. \\nAfter all, Birkenfeld knows about Obama’s UBS connection. \\nIn August 2009, on the first Sunday after Birkenfeld was sentenced in prison, at the Farm Neck Golf Club in Martha’s Vineyard, President Barack Obama had strolled out onto the links. \\n“His golfing partner that day was Robert Wolf, Chairman of UBS Americas,” Birkenfeld writes. “I’m sure it was a fine day of patter and play, guarded by a throng of Secret Service agents, and I wondered if Obama and Wolf had high-fived over my downfall, or maybe sent a ‘good job’ text to (the sentencing judge.) But I’d never know, because much like Swiss bankers, Secret Service agents don’t talk.”'"}, "time": 1742563014.0150988}