{"duration": 0.09920215606689453, "input_args": {"text": "'When we invited the columnist Thomas Friedman onto The   to discuss the latest tempest surrounding Donald J. Trump, we had no idea that his column would touch off a   of its own. In it, Mr. Friedman compared a remark by Donald J. Trump  —   widely interpreted as a call for gun owners anxious about Hillary Clinton to take the law into their own hands  —   to the kind of incendiary political language that Mr. Friedman said had incited the assassination of Prime Minister Yitzhak Rabin of Israel in 1995. “His children,” Mr. Friedman wrote of Mr. Trump, “should be ashamed of him. ” Right before we taped the show, a prominent fellow journalist, Bob Woodward of The Washington Post, scolded Mr. Friedman for engaging in “hyperbolic” and “excessive” criticism in the column by mentioning Mr. Trump’s children as he did. “That makes no sense,” said Mr. Woodward, who argued that there should be a “zone of protection” around a candidate’s children. On today’s episode, Mr. Friedman rejects that argument, saying that Mr. Trump had forfeited any such “zone of protection” when his children became top advisers to his campaign and highly public spokesmen for it. “Oh my God. I mean, who are the main speakers at Trump’s convention?” Mr. Friedman asked. “They are his kids. Who has he cited as his top advisers? His kids. ” An edited excerpt from our interview: I asked whether Mr. Friedman was trying to encourage Mr. Trump’s children to intervene and rein in their father.  “If you want to change his behavior, it seems to me legitimate to call on them,” he said. In the same episode, we asked a former top employee of Mr. Trump’s, Barbara Res, once the head of construction at his company, whether the inflammatory language he is now using resembled his choice of words and his shading of the truth as a boss in the workplace. Her answer? “Absolutely. ” Ms. Res, the author of “All Alone on the 68th Floor,” a memoir about her days as a woman in the   construction industry, said Mr. Trump’s inaccurate claim that Hillary Clinton was a “founder of ISIS” reminded her of how he talked in the office. “For one thing he tends to exaggerate tremendously,” she said. “Like the thing about being the founder of ISIS. ” “He used to do that all the time. He would make a tremendously exaggerated remark, or make something up that wasn’t even exaggerated, and then he would pounce on it and repeat it,” Ms. Res recalled. Please let us know what you think of the show. You can reach us at therunup@nytimes. com, or find me on Twitter, and you can leave ratings and feedback on iTunes. From a desktop or laptop, you can listen by pressing play on the button above. Or if you’re on a mobile device, the instructions below will help you find and subscribe to the series. On your iPhone or iPad: 1. Open your podcast app. It’s a   app called “Podcasts” with a purple icon. 2. Search for the series. Tap on the “search” magnifying glass icon at the bottom of the screen, type in “The  ” and select it from the list of results. 3. Subscribe. Once on the series page, tap on the “subscribe” button to have new episodes sent to your phone free. You may want to adjust your notifications to be alerted when a new episode arrives. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, just tap on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode. On your Android phone or tablet: 1. Open your podcast app. It’s a   app called “Play Music” with an    icon. 2. Search for the series. Click on the magnifying glass icon at the top of the screen, search for the name of the series and select it from the list of results. You may have to scroll down to find the “Podcasts” search results. 3. Subscribe. Once on the series page, click on the word “subscribe” to have new episodes sent to your phone free. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, just click on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode.'"}, "time": 1742561782.9441016}