{"duration": 0.06003093719482422, "input_args": {"text": "'Share This \\nFriday was a bad day for Hillary Clinton as the FBI announced the investigation into her emails and private server was being reopened. While news coverage was occupied with the controversial revelation, another one of the Clintons’ unlawful dealings was also exposed that many people missed. Hillary and Bill were busted in New York, and their habitual criminality is getting harder to deny. Bill & Hillary Clinton \\nHillary Clinton wants you to believe that she’s just like everyone else, but her actions speak louder than words. She’s nothing like the average American, and she doesn’t think she should be held to the same standards. Her criminal activity proves it, but if you need more convincing, just have a look at what Hillary and Bill were busted for in New York while all eyes were on the FBI. \\nAfter dropping $1.15 million in August for the 3,631-square-foot house next door to their original Westchester home, the Clintons decided it was time for renovations. Originally hiring a contractor for “a paint job,” apparently turned into so much more when the Clintons’ wishlist grew and the duo decided that the work must be done before Thanksgiving. Demanding such a rushed deadline, they apparently also decided that time-consuming permits weren’t going to stand in their way. Unfortunately for them, someone didn’t like them skirting the law. The $1.15 million home they bought next door to their original house. (Source: HouseBeautiful ) \\nAn unidentified tipster ratted them out, which brought Building Inspector William Maskiell to their Chappaqua property for an inspection, and he didn’t like what he found. The “Clintons’ contractors filled in an in-ground pool, covering it with gravel, and extensively remodeled the interior of the property — all without applying for permits and paying the required fees to the town of New Castle ,” New York Post reports. \\nThe contractors were quick to point their finger at the Clintons for the missing permits, explaining the pressure they were put under by Bill and Hillary to have the job completed by Thanksgiving. Now, Maskiell says the two face “several thousand dollars, at least,” in fees and penalties for failing to complete the paperwork. The Clintons were notified of the violations in a letter dated October 17, which disclosed the missing permits and more, according to The Post : \\nAttached to the letter was another document titled “ Clinton Violation Inspection Report ” in which Maskiell said the contractor told him the Clintons “were quite adamant about [the Thanksgiving deadline] and what had started as a paint job turned into this,” meaning the major renovation. \\nThe outlet further reports, “Maskiell told the foreman for the contractor, Carl Petty Associates of Washington, DC, that he would not issue a stop work order if the contractor sought the proper permits,” but as of Friday, “the general contractor still had not filed all of the required paperwork or paid the fees.” Maskiell also explained that, although permit applications are usually submitted by the contractor, the owners are ultimately responsible and must sign the paperwork. Bill & Hillary’s original Chappaqua home, purchased for $1.7 million in 1999. \\nWhat’s worse, the missing permits isn’t the only problem the Clintons are facing regarding their properties. \\nThe Clintons also have outstanding zoning and Building Department problems at their residence next door at 15 Old House Lane, which they bought for $1.7 million in 1999 to establish residency so Hillary could run for the Senate, Maskiell said. \\nThey obtained variances in 2000 for a guard house on the property, for a higher fence and for “lot coverage,” or the amount of space buildings take up on the property. \\nThe variances must be renewed every five years — but the Clintons never showed up before the Zoning Board of Appeals. \\n“Consequently, they are null and void. They should have come back in 2005, 2010 and 2015. So the variances have expired and they have to start from scratch” and reapply, said the inspector. \\nThe original home and a combination library and gym in an outbuilding still have outstanding building permit issues as well, including a sprinkler “sign off” by the town engineer and an electrical inspection in the library/gym. \\nMany may be thinking, “What’s the big deal?” considering all the other things that Hillary and Bill have been accused of doing. However, it’s important to see that, even with the simplest of things, the Clintons don’t think the laws apply to them. Their criminality is habitual and never-ending. \\nSadly, this woman, who can’t complete even the most mundane task lawfully, is running for President of the United States. Shall I remind everyone that the president, as the Executive Branch of our government, is responsible for implementing and enforcing the laws written by Congress? Someone with no regard for our laws shouldn’t be given that power. Hillary Clinton shouldn’t be in charge of law enforcement, she should be on the receiving end of it.'"}, "time": 1742561780.899013}