{"duration": 0.11857271194458008, "input_args": {"text": "' Good morning. (Want to get California Today by email? Here’s the  .) At 56, Henry Rollins is still angry. When he was a younger man, the rage flowed out of him as the scowling frontman for Black Flag, the pioneering Southern California punk band. Today, Mr. Rollins may no longer scream to get his point across. But as a spoken word performer, radio host and, notably, a widely read columnist at LA Weekly, he has reinvented himself as a political voice that is similarly hard to ignore. “It’s definitely one of the most popular regular features that we run,” his editor at LA Weekly, Andy Hermann, said of his writing. “He’s just a great commentator and satirist. ” (Here are a couple of pieces that Mr. Hermann said struck a big chord with readers.) We caught up with Mr. Rollins by phone. Some excerpts from the conversation: Q. What’s your approach to the column? A. As far as political writing, to use the baseball idea, if you can’t hit them where they ain’t and score, then  —   basically don’t be obvious. And if you’re going to make a point, if you can’t bring some humor into it  —   I mean obviously someone getting shot and killed in Ferguson, Mo. there’s no fun there. But anything with Donald Trump, where there’s so much to say, if you don’t bring some humor in, it’s going to be unreadable. Q. Have you mellowed with age? A. Not really. I’ve just been able to prioritize and direct my energies with a little bit more care and aim, where I don’t need to scorch the entire forest because I’m angry. I can just pick out the three trees and that turns into a column or that turns into something on stage. Q. You’ve said you cultivate your anger. Why? A. Because it turns into good things. I saw the HBO documentary on the West Memphis Three and I said, ‘Oh, O. K. you’ve officially pissed me off. Arkansas we’re coming for you.’ And it was out of anger. I was concerned for guys in jail, yeah, but it was anger that got my civic muscle going. And I started calling rich, famous people I knew  —   ‘Hey can I have a thousand dollars [to donate to a legal fund]?’ I couldn’t believe it. I was like a member of Congress dialing for dollars. Q. Do you ever think about making music again? A. No. For me it was a real time and place. I never really enjoyed being in a band. It was never fun. It was necessary. I really had to say those words. But I never enjoyed it and I’ll be the first to admit I was never all that good at it. But it was real. (Please note: We regularly highlight articles on news sites that have limited access for nonsubscribers.) • Democrats fiercely criticized Representative Devin Nunes, the Tulare Republican who heads a House panel investigating Russian interference in the election, for taking information straight to the president. [The New York Times] • “Mr. Nunes is a lapdog in a watchdog role. ” [Opinion | The New York Times] • Representative Duncan D. Hunter, a San Diego County Republican, is under criminal investigation. He’s accused of spending campaign funds on vacations and video games. [The New York Times] • California passed the nation’s toughest methane emission regulations even as federal rules are expected to be rolled back. [San Francisco Chronicle] • “Measure S was not the answer to L. A.’s housing crisis, but neither is returning to business as usual. ” [Opinion | Los Angeles Times] • A former U. C. Berkeley student said a renowned philosophy professor sexually assaulted her. [Daily Californian] • Four people were found dead inside a Sacramento home. A man was detained. [Sacramento Bee] • Big banks and Silicon Valley are battling over something akin to gold: your data. [The New York Times] • Disney is looking for a successor to its chief executive, Robert A. Iger. But nobody seems to measure up. [The New York Times] • In Sequoia National Park, communing with some of the biggest trees on Earth. [The New York Times] • U. C. L. A. faces Kentucky in the N. C. A. A. men’s basketball tournament. Here’s how they match up. [Los Angeles Times] It wasn’t looking good for Nalu. The small,   dog inhaled a lot of smoke after a fire erupted at a Santa Monica apartment on Tuesday. The fire was quickly put out. Nalu, a    bichon   tzu mix, was limp and not breathing. “He was essentially dead,” said Andrew Klein, the firefighter who pulled the dog from the burning home. Mr. Klein set Nalu on the grass and began delivering oxygen with a specialized pet mask and performing    resuscitation. Minutes passed. Nothing. Kneeling nearby, the dog’s owner, Crystal Lamirande, who had been running errands when the blaze broke out, was distraught. She put her hand on the dog’s belly. “Come on Nalu,” she said. Then, an improbable 20 minutes after efforts to revive him began, Nalu blinked and, slowly, his chest rose. Ms. Lamirande, 35, a nurse, had just lost her home. Yet for the moment she was elated. “She couldn’t stop saying, ‘Thank you,’” said Billy Fernando, a   who watched the drama. Speaking by phone Thursday, Ms. Lamirande said Nalu was back to his old self. “He’s so lovely. People just love him,” she said. Ms. Lamirande said she lost sentimental objects in the fire, whose origin was unknown. But she was coping, she added, “It’s just stuff. ” California Today goes live at 6 a. m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes. com. The California Today columnist, Mike McPhate, is a   Californian  —   born outside Sacramento and raised in San Juan Capistrano. He lives in Davis. Follow him on Twitter. California Today is edited by Julie Bloom, who grew up in Los Angeles and graduated from U. C. Berkeley.'"}, "time": 1742562282.351577}