{"duration": 0.05370664596557617, "input_args": {"text": "'The ongoing efforts by Democrats, the mainstream media, and elements of the federal bureaucracy to bring down President Donald Trump raise alarms for the safety of our constitutional democracy. [Trump won the election fairly  —   there is not a shred of evidence to suggest otherwise  —   and yet his opponents have never accepted the result, nor ceased trying to frustrate his efforts to govern. If they succeed, American democracy will effectively be finished.  Amidst the giddy enthusiasm of outlets like CNN to report sensational  —   and almost certainly false  —   stories like “Sources: White House lawyers research impeachment”  —   little thought is being given to the consequences if their wildest dreams come true. And those who have considered the fact that Vice President Mike Pence would take over  —   like   Sally Kohn and NeverTrumper Bill Kristol  —   assume that Pence will be just as easily dispatched. Straightforward from here:1. Impeach Trump  Pence2. Constitutional crisis3. Call special election4. Ryan v Clinton5. President Clinton,  —   Sally Kohn (@sallykohn) February 15, 2017,  Straightforward from here:1 Joe Lieberman to FBI2 Mueller  Joe do in Trump3 Pence makes Joe VP4 Pence impeached5 President Lieberman,  —   Bill Kristol (@BillKristol) May 18, 2017, Trump won nearly 63 million votes. Those voters would be instantly disenfranchised by his removal. Opinion polls suggest nearly all of them would vote the same way again, and no facts have emerged from the Russia conspiracy theory, nor have any major policy betrayals taken place, that would sever that trust. Seeing him deposed would trigger nationwide anger, and perhaps a real “Resistance,” not the   “Resistance” the left has contrived. Even by considering the possibility of impeaching Trump  —   which some conservatives, rightly, have called a “silent coup”  —   the Beltway elites are sowing division and uncertainty. They have laid bare their contempt for democracy  —   even those who, like Kristol, enthusiastically support imposing democracy abroad. Trump’s voters believed they were taking their country back  —   and did so through the ballot box. God help us if that victory is taken from them. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742564505.587871}