{"duration": 0.13846540451049805, "input_args": {"text": "'We Are Change \\nOn the 50th anniversary of the Free Speech Movement, its hypocrisy is exposed \\nNovember 2013 : Berkeley student government unanimously passes a bill to ban the term “illegal alien” from campus discourse.\\nSeptember 2013 : After several Mexican-American members of the campus fraternity Delta Chi suggest hosting a quinceanera-themed party, the student government condemns the frat for “appropriating the culture” of Mexican-Americans.\\nDecember 2012 : Citing their “disapproval” of the viewpoints espoused by the second largest charity in the Unites States, the Berkeley student government passes a bill to boot Salvation Army donation boxes from campus, arguing the charity’s presence on campus creates a hostile and uncomfortable environment. \\nSeptember 2011 : Berkeley’s student government unanimously passes a bill condemning disrespectful speech.\\nAnd on Friday, as UC Berkeley students and faculty wrapped up a week-long celebration to mark the 50th anniversary of its Free Speech Movement, the UC Berkeley College Republicans illustrated to our peers how the university has actually turned its back on the First Amendment.\\nTo that end, club members stood in front of Sproul Hall holding a large banner that read “Free Speech [does not equal] Comfortable Speech” – and it got students’ attention, as the positive platitudes they’d heard all week about the movement were vehemently challenged.\\nAccording to the Berkeley College Republicans, the true essence of the Free Speech Movement has been lost in recent decades. The ideals of the movement have been discarded, replaced with notions such as tolerance and civility.\\nIn the 1960s, students broke out from within the constraints of the status quo. They said the things parents and professors and peers were telling them not to. Today, and especially on the Berkeley campus, conservative students are the ones taking a stand, and yet we’re maligned and ostracized for it.\\nIn the aftermath of the Berkeley College Republicans’ 2011 “Diversity Bake Sale,” the student government attempted to have the club de-funded due to the argument that the speech the club engaged in was disrespectful and uncomfortable.\\nFree speech, huh?\\nOur display on Friday intended to bring to light the many breaches of free speech that have taken place on campus, sponsored by organizations such as the student-body government at UC Berkeley.\\nAlongside the banner, club members passed out fliers containing a list of incidents in which campus leaders limited various students’ right to exercise their personal liberties.\\nThe flier also attacked the campus for its recent movement to discontinue the exchange of academe between the UC system and Israeli universities, another example of UC Berkeley silencing any communication and discourse that may offend or upset some individuals.\\nThere is a strange perversion of free speech taking place on this campus. It’s perfectly acceptable to occupy campus buildings and create pinatas out of the UC president’s image, but that’s only because the individuals in question fall under one school of thought. As soon as someone different comes along, and stirs the pot, they’re pointedly silenced.\\nThroughout the day, our club passed out hundreds of fliers and displayed our sign from the morning until late into the afternoon. Students came up and asked questions, and many seemed interested in the cause. Others were shocked to learn about the many times their campus – the birthplace of the Free Speech Movement – had overtly suppressed open dialogue.\\n“The people I talked to seemed to agree with the point our message was trying to get across,” said Edward Saenz, a member of the Berkeley College Republicans. “No one I talked to believed that free speech should have stipulations tied to it.” \\nCollege Fix contributor Claire Chiara is a student at UC Berkeley and president of the Berkeley College Republicans. \\nLike The College Fix on Facebook / Follow us on Twitter \\nIMAGES: Courtesy of Berkeley College Republicans\\nRELATED: \\nStudent protesters at the University of California-Berkeley gathered in front of a bridge on campus and forcibly prevented white people from crossing it. Students of color were allowed to pass. \\nThe massive human wall was conceived as a pro-safe space demonstration. Activists wanted the university administration to designate additional safe spaces for trans students, gay students, and students of color. They were apparently incensed that one of their official safe spaces had been moved from the fifth floor of a building to the basement. \\nAccording to video footage of the protest, demonstrators blocked off the bridge completely. Students who needed to get to class had no choice but to cross the stream by jumping from rock to rock. Dozens of people can be seen doing so. \\nFollow WE ARE CHANGE on SOCIAL MEDIA SnapChat: LukeWeAreChange \\nfbook: https://facebook.com/LukeWeAreChange \\nTwitter: https://twitter.com/Lukewearechange I nstagram: http://instagram.com/lukewearechange Sign up become a patron and Show your support for alternative news for Just 1$ a month you can help Grow We are change We use Bitcoin Too ! 12HdLgeeuA87t2JU8m4tbRo247Yj5u2TVP Join and Up Vote Our STEEMIT The post Berkeley College Republicans Call Bullsh*t on Free Speech Celebrations appeared first on We Are Change .\\n'"}, "time": 1742564547.5238125}