{"duration": 0.09092020988464355, "input_args": {"text": "'Is too much \\'screen time\\' hurting your kids\\' mental growth? \\n  Daniel Barker Tags: children , screen time , limits (NaturalNews) In an effort to steer away from its previous one-size-fits-all policy, the American Association of Pediatrics (AAP) has issued a new set of guidelines regarding how much time children should spend in front of television and computer screens.Until now, the AAP had recommended no more than two hours of \"screen time\" for children – regardless of their age, the type of content viewed or which medium was being used.Recognizing that such a blanket approach could not effectively address the issues at hand, the AAP has recently taken steps to broaden its policies.From Gizmodo.com:\"In a series of papers published today in the science journal Pediatrics, it\\'s clear that the AAP has significantly revised its thinking on the matter, breaking down media use according to all these criteria. And to support parents with these new recommendations, the AAP has published an interactive, online tool that families can use to create a personalized Family Media Use Plan.\" AAP\\'s new \\'screen time\\' guidelines The new recommendations are aimed at the unique circumstances of various age groups. For example, the AAP recommends that children under 18 months should avoid screens altogether, except for limited occasions, such as social media sessions with grandparents.Children between the ages of 18 and 24 months may be introduced to digital media, but the content should be \"high-quality programming,\" and watched together with parents.Kids between the ages of 2 and 5 should be limited to one hour of high-quality programming, which also should be watched in the presence of parents.Parents should impose \"consistent limits\" on the time spent in front of a screen by children 6 and older, especially for entertainment purposes. Children should not be allowed to sleep with their smartphones, tablets, etc., and should have one media-free hour before bedtime.Media-free times such as during meals should be established, and media-free zones in the household should be defined.Making sure kids get an hour of daily exercise and enough sleep at night is also part of the equation, according to the AAP. Parenting in the digital age ain\\'t easy As logical as these recommendations may sound, implementing them may not always be easy. Most parents know that limiting their kids\\' online time isn\\'t always easy, and many would be forced to admit that digital media can be a helpful tool in managing children :\"Parents obviously want to raise healthy children who aren\\'t constantly glued to computer screens, but these devices are a godsend for those moments when a parent needs to make dinner, or when they simply need to go to the bathroom. ...\"When it comes to limiting screen time , there\\'s a tradeoff between parental health, and the needs of a child—and that needs to be acknowledged.\"Let\\'s face it, smartphones play a big part in our children\\'s lives now, for better or for worse. There is also an age when a parent can no longer police a child\\'s online activity without invading his or her privacy.The best thing a parent can do is to set consistent rules for younger children\\'s screen time, and to try to help them learn to use the technology without becoming hopelessly addicted to it.One way to accomplish that is by setting an example. How much time do you spend in front of a TV, computer or smartphone screen yourself in the presence of your children?Many adults are as hopelessly addicted to digital media as their teens or children are. If you expect a child to limit their time online, you must be willing to do the same.You might even try doing something completely out of the ordinary, like reading a book to your child, or having your child read one to you.As crazy as it might sound, there was a time when such practices were common. ... Sources:'"}, "time": 1742563584.880895}