{"duration": 0.0158998966217041, "input_args": {"text": "'  Miss USA Kara McCullough is walking back an answer she gave during Sunday night’s competition, during which she called health care “a privilege. ”[In an interview Tuesday on Good Morning America, McCullough changed her position and said she now believes health care is “a right. ”  “I am privileged to have health care and I do believe that it should be a right,” McCullough said. “I hope and pray moving forward that health care is a right for all worldwide. ” “I just want people to see where I was coming from,” said the    chemist and employee of the U. S. Nuclear Regulatory Commission. “Having a job, I have to look at health care like it is a privilege. ” On Sunday night, McCullough sparked a social media firestorm over her answer at the pageant, after she was asked if affordable health care should be considered a right for all Americans. “I’m definitely going to say it’s a privilege,” she said at the time. “As a government employee, I am granted health care and I see firsthand that for one to have health care, you need to have jobs. ” ”I’m definitely going to say it’s a privilege.” Listen to your new #MissUSA talk about healthcare in the USA. pic. twitter.   —   Miss USA (@MissUSA) May 15, 2017,  McCullough also clarified her thoughts on feminism, after saying Sunday that she doesn’t want to be called a feminist and prefers the term “equalism. ” “For me, where I work at with the Nuclear Regulatory Commission, ‘equalism’ is more of a term of understanding that no matter your gender, you are still just kind of given the same accolades on your work,” McCullough said Tuesday. “I believe that if a person does a good job, they should be, you know, credited for that in a sense. ” She added, “I don’t want anyone to look at it as if I’m not all about women’s rights, because I am. We deserve a lot when it comes to opportunity in the workplace as well as just like leadership positions. I’ve seen and witnessed firsthand the impact that women have. ” WATCH: @MissUSA 2017 Kára McCullough speaks out following her victory the other night and social response: https:  .  pic. twitter.   —   Good Morning America (@GMA) May 16, 2017,  McCullough said she was “not at all” surprised by the backlash she faced for her original comments. “I believe that is what America is based on, like having opinions and views,” she said. “But I would like to just take this moment to truly just clarify   …     what I said. ”   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742628475.3479507}