{"duration": 0.08687996864318848, "input_args": {"text": "'NEW DELHI  —   Fourteen coaches of an Indian train derailed early Sunday, killing at least 108 people in one of the worst rail accidents here in recent years, the police said. At least 75 others were admitted to hospitals, many of them with head injuries and fractures, and the death toll was likely to rise, said Rahul Srivastav, a spokesman for the police in Uttar Pradesh State, where the derailment took place. The accident occurred at 3 a. m. about a mile from the Pukhrayan railway station, about 40 miles southwest of the northern city of Kanpur, on a train bound for Patna, the capital of Bihar State. Mr. Srivastav noted that passengers were sleeping at the time. The deaths and injuries occurred when people were “falling over each other and colliding against the compartment,” he said. Two coaches were crushed in the derailment, he said. The cause of the accident was unclear on Sunday. Ved Prakash, a spokesman for the railway, said he suspected that a “rail fracture,” or a crack in the train track, might have been the cause, though it was too early to be sure. Indian railways have had dozens of such cracks on various tracks, The Hindu newspaper reported. “The whole train was shaking,” a young passenger said in a televised interview with NDTV, a news channel. “My sister was there and my brothers were there. I found everyone except for my father. ” In another televised interview, a young woman said, “I became very numb and I thought, ‘What has happened here? ’” The Uttar Pradesh police, the railway police, the National Disaster Response Force and the state health department were dispatched to the scene. Rescue efforts continued on Sunday. “All kind of instruments are needed when coaches get mangled and topple over each other,” Mr. Srivastav said. India has long struggled to modernize its creaking railway system, which is one of the largest in the world but suffers from neglect and age. Prime Minister Narendra Modi announced that the government would provide 200, 000 rupees, or nearly $3, 000, to the families of those killed in the accident, above any amount offered by the Indian railways.'"}, "time": 1742563083.5044992}