{"duration": 0.24565935134887695, "input_args": {"text": "'Homeschooling families throughout the nation are voicing opposition to a   school choice bill that they say will ultimately result in regulation of homeschooling in the United States. [Many parents who homeschool their children, as well as their numerous local and national homeschooling organizations, are protesting the bill, introduced by Iowa Rep. Steve King (R) and calling upon the members of Congress who are its sponsors to “leave homeschooling families alone. ”  School vouchers created by H. R. 610, the Choices in Education Act of 2017, “would be a slippery slope toward more federal involvement and control in homeschooling,” asserts William Estrada, director of federal relations for the Home School Legal Defense Association (HSLDA). King’s bill would first repeal the Elementary and Secondary Education Act (ESEA) of 1965. While many homeschoolers agree with the repeal of ESEA, the bill next would send all federal education funds to the states in the form of grants, which states would then distribute as vouchers to public, private, and homeschooled students. Estrada asserts the bill would essentially create a “federal right to homeschool. ” Section 104 of the bill states, “To be eligible to receive a grant  …    the State will  …    make it lawful for parents of an eligible child to elect  …    to enroll their child in any public or private elementary or secondary school in the State or to   their child. ” Estrada explains: While this sounds good, HSLDA has fought  —   successfully —  for decades to make sure that there is no “federal right to homeschool” because what could be created by a favorable Congress could be regulated by a future, hostile Congress. It is far better (and far more constitutionally sound) for education decisions —  and homeschool freedom —  to be protected at the state level. We ask our friends at the federal level to simply leave homeschooling families alone. Section 105 of the bill further states: The State shall distribute funds  …    based on the number of eligible children enrolled in the public schools operated by each local educational agency and the number of eligible children within each local educational agency’s geographical area whose parents elect to send their child to a private school or to   their child.   …     On an annual basis, on a date to be determined by the Secretary, each local education agency shall inform the State educational agency of  …    the number of eligible children within each local educational agency’s geographical area whose parents elect  …    to   their child. Estrada says the bill allows states to “track” homeschooling students. “There is only one way that states and school districts can do this: by requiring homeschooling families to register with them, and be tracked by the school district,” he asserts. “This will be especially problematic in states that do not require homeschooling families to file a notice of intent with the local school district. H. R. 610 will require homeschooling families in all 50 states to register with the local school district. This would be just the first cost of ‘free government money. ’” In a statement on his website about the bill, King says: In order to receive a grant or voucher under my legislation, the State must ensure that the funds be distributed appropriately on a per pupil basis. Additionally and most importantly, this bill makes it lawful for the parent to make the ultimate decision between public, private or   education for their children. However, Estrada asserts it is not the job of the federal government to grant parents the freedom to decide their children’s education. “The Constitution protects the right of parents to direct the education and upbringing of their children, as the U. S. Supreme Court has ruled in its seminal cases of Meyer, Pierce, and Yoder,” he says. “Federal legislation to ‘protect’ homeschooling is unnecessary. ” In an interview with Breitbart News, King says he “regrets” most of all that a    meeting has not taken place with homeschooling parents prior to the uproar over his bill. The Iowa congressman says that while his legislative director has been on the phone with homeschoolers opposed to his legislation, a meeting he had slated with them may have been canceled due to his schedule. He said he and his staff have asked homeschoolers to hold back on their open criticism of the bill until he could meet with them. “And now we’ve got a national thing going on here that didn’t need to happen,” King says. “I’ve been trying for the last several weeks to have a meeting with them, and I’ve said to my staff I want to look them in the eye and I want to talk this through reasonably. ” “I’ve tried to talk openly and do business and we haven’t been able to have that meeting, and I regret that,” King emphasizes, still adding that he is surprised “there’s a nationwide effort to oppose the broadest, most sweeping bill that supports parents being in charge of their children’s education that this Congress has ever seen. ” He explains his view of the legislation: The objective is this, that we’re watching as a nationwide curriculum is being established, and that nationwide curriculum, coupled with the money that goes to that, pushes all the public schools into that system, and eventually drags the parochial schools into that curriculum. I’m watching as our   values are being undermined, and I’m watching as western civilization is being deconstructed systemically throughout our public school system and especially in our universities  —   which we don’t touch with this, by the way. The object is to put parents back in control of their children’s education and curriculum and put it in a position where the public schools compete with the parochial schools. To have exempted homeschools from this, would have made the bill the target of homeschoolers, too. King thinks homeschoolers should participate in his bill for the sake of the new system  —   the intention of which, he says, is to save the culture of the country that is being destroyed by the public school monopoly. He continues: They’re missing the objective of this bill, which is to put the public schools in a position where they have to compete with the parochial schools and respect and honor the homeschools, and let the states regulate those things at that level, not the federal government. States that are unwilling to pass a voucher program have to give up their federal money. So isn’t that a much bigger goal for us  —   to put the public schools into competition with parochial schools than it is to preserve the status quo of homeschool? Homeschoolers, King argues, want “to be protected from ever being threatened by a state approving federal funds going through a voucher system that might tempt some of their people to accept some money that comes from the state and federal government. ” “To do that, they would not want to have parochial schools have an opportunity to compete with the public schools, which takes down our ability to allow masses of parents to decide curriculums, moral values, etc. ,” he continues. “Many parents can’t afford to send their children to a parochial school, nor can they actually homeschool their children. ” Wisconsin homeschooling parent Tina Hollenbeck, however, writes at her blog about the level of regulation King’s bill is inviting in for homeschoolers. The measure, she says, provides for states to be “mandated to send information about all children  —   yes, every child using any form of education  —   to the federal Secretary of Education in order to get the voucher money H. R. 610 claims the states are due. ” Hollenbeck continues: Of course, the states will want to report on all the children anyway  —   more children equals more money for state coffers even if some of us don’t take it  —   but even if a state wanted to behave ethically in order to protect the privacy of home educators who refuse voucher money, they are not allowed to do so under this bill. Thus, any state that currently requires any sort of notification from homeschoolers  —   information that previously remained at the local or state level  —   will now violate our privacy by giving information about us to the federal Secretary of Education  —   without regard to either the 4th or 10th Amendments to the Constitution. And we can expect swift ( ) action from states whose homeschool laws currently require no  . They will assert that they “must” know who the homeschooled children are according to H. R. 610  …     Karen Braun, a homeschooling parent from Michigan, also tells Breitbart News she is opposed to H. R. 610. “Reading the fine print, it is clear they will make sure that states distribute the funds in a manner so as to ‘ensure that such payments will be used for appropriate educational expenses,’” she explains. “And who gets to define ‘appropriate educational expense?’ They do. ” “This isn’t about giving homeschoolers help, or offering choices, but about giving the nanny state more control,” Braun concludes. The bill is   by Republican Reps. Andy Harris (MD) Trent Franks (AZ) and Pete Olson (TX). Estrada observes to members of HSLDA that Franks has clarified his position on the bill after speaking with homeschoolers: [W]e talked with Franks and his staff and they agree with our concerns about homeschooling families being included in H. R. 610. As a result, there is no need to contact his office, and we are deeply grateful to him for his commitment to protecting homeschool freedom from “help” by the federal government. Here is the statement Franks gave us: “I understand the concerns of the homeschool community. My support for the bill only extends to vouchers for public school and private school students. If this bill moves forward, I would request that any language that would impose vouchers upon homeschools is taken out. ” Breitbart News reached out to Franks’ office, and his staff confirmed his statement to Estrada. The bill is introduced just as Betsy DeVos takes her post as U. S. education secretary. DeVos  —   whose primary areas of interest have been school choice and school voucher programs  —   experienced unprecedented controversy during her confirmation process from both those on the left, who fear privatization of public schools, and those on the right who have warned against regulation of private and home schools through vouchers. The school voucher  —   as a transfer of taxpayer funds  —   is a finance mechanism to create school choice and one that is associated with the highest level of regulation for schools that agree to accept them. If parents use vouchers to send their children to a private school or to homeschool them, that school choice may have additional regulatory burdens placed upon it by the state in which it is located  —   in the name of “accountability. ” In a 2010 study at Cato Institute, Andrew Coulson studied the question of school vouchers and increased regulation of private schools. He concluded that “vouchers  …     impose a substantial and statistically significant additional regulatory burden on participating private schools. ” Voucher programs, Coulson concluded, are more likely to “suffocate the very markets to which they aim to expand access,” because state funds —  which invariably come with state regulation —  are directly transferred, in the form of vouchers, to parents to spend in an alternate education setting. Cindy Nicolai writes at the   Constitutional Home Educators Alliance that, for homeschoolers, government regulations are binding “strings. ” “  and   home education must avoid those strings in order to retain our independence, sovereignty, autonomy, and most importantly, our freedom,” she explains. “We recognize the value of that freedom and are willing to pay the cost to keep   home education unrestricted and free from government control. ” “Homeschools are not threatened under this bill,” King insists, but adds, “I’m still open to listen to viewpoints, but they also must listen to mine, and they have not done that. They should come and talk to me in a reasonable fashion instead of unleashing letters across the state and asking people to send tweets at me, send letters, and call my office. ”'"}, "time": 1742564561.437542}