{"duration": 0.15914607048034668, "input_args": {"text": "'Shut the roof, and closure will finally and deservedly come for Aaron Krickstein. When it next rains during the United States Open, there will be no lengthy delay or complete washout at Arthur Ashe Stadium  —   and no more reason for a television producer seeking to fill time to consider reminding Krickstein of his long, lugubrious Labor Day in 1991. “Part of me feels like it’s really a long time ago,” Krickstein said in a recent telephone interview. “And part of me feels like it was yesterday. ” He is not the only one. Krickstein’s   loss to Jimmy Connors  —   the ultimate   crasher in a   sport  —   was a seminal match in the tournament’s modern history and the first significant story to break on my live watch for The New York Times after I was hired in April 1991. This year’s event will be my last assignment as a staff reporter. Just in time, the tournament will unveil a $150 million retractable roof over the court named for Ashe, who died in 1993 and with whom I happened to watch the fifth set of the   classic in the press box high atop what used to be the main court, Louis Armstrong Stadium. “It’s all come full circle,” Krickstein said, unintentionally speaking for us both. I was not exactly a kid out of college, or a tennis newbie, when Connors whipped the Armstrong crowd into a panting frenzy in that   match on his 39th birthday. I had covered my first Open in 1978 for a newspaper that existed for a few weeks during a protracted strike by New York’s three dailies. Connors had destroyed Bjorn Borg in the final that year, as Ashe reminded me after seating himself close by while Connors chased Krickstein, 15 years his junior, across the evening shadows to emerge with a   tiebreaker victory. “He was unbelievable that day,” Ashe said of the Borg demolition, recounting the scores  —          —   as if they were flashing on the glass enclosure in front of us. “If you’re talking about Connors’s performances here, to me, that was first. This is second. ” In a paean to career resurrection, Connors later called his highly improbable run to a semifinal trouncing by Jim Courier in 1991 as “the best 11 days of my career. ” Like no other tournament, that Open fortified the working man’s ethos Connors proudly and sometimes obnoxiously embodied throughout his career. For years, Krickstein chafed at the thought of Connors’s birthday theatrics and body gyrations, and how behaviorally dismissive he had been of a friendship that began as a mentorship. Krickstein was so deflated after the match that he could barely lift his head when facing reporters. He and Connors would not speak more than a few words for almost 24 years. They did play once more on tour, months later in Memphis. “I was up a set and a break  —   lost that one, too,” Krickstein said. “Never did beat him. ” Connors being an   great, Krickstein could live with that, but what most annoyed him was the reputational residue of their Labor Day epic. Krickstein was cast in too many   reruns as a chronic loser, in perpetuity. Years later, when Krickstein was playing at a   senior event in Long Island, the woman on the public address kept introducing him as Connors’s hapless 1991 sparring partner. The typically reserved Krickstein took a moment to inform her that he had actually been a   player, the winner of nine ATP events and the   conqueror of Andre Agassi at that 1991 Open. Alas, even the Agassi triumph was obscured by Connors, who summoned his inner Houdini in a   night match against Patrick McEnroe, rallying from two sets down and     behind in the third. “Did you talk to Patrick?” Krickstein asked me. “He started the whole thing. ” To which McEnroe said, “Yep, still rubs me the wrong way. ” He, too, had a relationship with Connors, who would occasionally call him to practice, “probably to tick off” McEnroe’s older brother, John, a bitter Connors rival. But the worst part of Patrick’s coughing up a match he believed he had won  —   “the kiss of death against Jimmy,” he said  —   was that he was having his best year as a singles player, having survived his own   deficit against a Swede named Thomas Hogstedt on the way to the Australian Open semifinals. McEnroe went into a monthslong funk after his   nightmare, struggling to watch Connors and the tournament proceed. Except he remembered John, on a network broadcast, saying, “My brother unleashed a monster. ” Patrick McEnroe did get another shot at Connors the following spring in Florida, finally beating the     Jimbo in straight sets. Krickstein had to wait more than two decades to reconfigure an old conversation. As the tennis director of St. Andrews Country Club in Boca Raton, Fla. he had begun a custom of staging annual events for members, summoning old tour friends to come entertain them by hitting a few balls. He took a deep breath and called Connors near the end of 2014. “It was a little awkward, to say the least,” Krickstein said. “First we just talked about our families. I told him where I was working, what I liked to do for our members, how it would be a great honor to have him come down. ” Krickstein proposed that they play a set for old times’ sake, carefully describing it as “a reunion match,” not one for revenge. “Jimmy asked a few questions, little details, but he couldn’t have been nicer,” Krickstein said. At 62, with both hips replaced, a few reporters in attendance and the former American tour player Jimmy Arias poking fun in the chair, Connors dropped an   pro set to Krickstein in February 2015. He cast it as his last public match while Krickstein called it “a cool way to reconnect. ” Adulthood happens. Middle age sneaks up on you. Krickstein is 49, a father of two, more reflective on what he can now admit was “an iconic match. ” Yes, he hated when people told him they had seen it during United States Open rain delays, in one depressing stretch over four consecutive years. Over time, “it’s bothered me less and less,” Krickstein said, but he still found himself nodding in agreement when he read somewhere recently that “nobody will be happier about the U. S. Open roof than Aaron Krickstein. ” He has plans to visit the tournament during the first week, meet sponsor obligations, stroll the grounds in Flushing Meadows, maybe take in a match or two. If the clouds happen to burst and the two fabric panels roll across the    opening to meet above Ashe while he is there, Krickstein won’t complain. These days he has little to grouse about, he said. Life has been good, very good. But he’ll still happily accept full closure on Connors, along with the roof, after 25 years. He also won’t be alone in wondering, where have they gone?'"}, "time": 1742562132.0439515}