{"duration": 0.4431459903717041, "input_args": {"text": "'shorty BY REV. WILLIAM ALBERTS T he common humanity everyone shares should be the epicenter of the moral universe. Not religion. Our religious founders and saints have different beginnings and beliefs, but all of us share similar birth stories, and at the moment of birth we are most alike. We have different faith traditions, but the same universal need to be loved and to love. We speak different languages, but laugh alike. We don’t look alike, but our facial expressions tell the same story – of surprise and pleasure, frustration and anger, joy and sadness. We sing different anthems — with the same pride. We may regard each other as foreigners, yet we love and grieve the same. Anywhere in the world, when people are oppressed, their innate human response is to struggle for justice. Everyone bleeds human. Thus the common humanity all people share is the frame of reference for the moral universe. And our common humanity is powerfully expressed in most religions’ shared belief in The Golden Rule: “So in everything, do to others what you would have them do to you, for this sums up the Law and the Prophets.” (Matthew 7: 12) But, to everyone’s endangerment, political and faith leaders alike are redefining and thus shrinking the moral universe to accommodate their self-interests. Their selective morality is especially seen in today’s presidential campaign. For many white evangelical Christians, morality takes a back seat to belief. Jesus is recorded as teaching, “I was a stranger and you welcomed me.” (Matthew 25: 36), and “You shall love your neighbor as yourself.” (Matthew 22: 39). Yet a high majority of evangelicals and their leaders have had no problem supporting Republican presidential candidate Donald Trump, despite his denigration of women, Mexicans, Muslims, immigrants, black persons and even a disabled reporter. In fact, a number of evangelical Christian leaders have formed a Faith Advisory Council to help guide Trump’s presidential campaign, and evangelical ministers are repeatedly photographed surrounding him and laying their hands on him in prayer. It is about their religious beliefs, not his immoral behavior. Numerous white evangelical Christian leaders have an unwavering faith in Donald Trump. Recently, a video showed an “aroused” Trump boasting about being a compulsive sexual predator, who is “automatically attracted to beautiful . . . I just start kissing them . . . It’s like a magnet . . . I don’t even wait. And when you’re a star . . . you can do anything” to them, including, “grab them by the pussy.” (“US election: Full transcript of Donald Trump’s obscene videotape”, BBC News , Oct. 8, 2016) Ironically, in the second presidential debate, shortly before the video surfaced, Donald Trump told Hillary Clinton that, as president, he would have a special prosecutor investigate her misuse of emails when Secretary of State, and said to her, “You’d be in jail.” Actually, Trump’s self-reported sexual assaults on women indicate he should be prosecuted, and jailed if found guilty – and, when released, be registered as a sex offender – for the protection of unsuspecting women. While the leaked videotape has led some white evangelical Christian supporters to distance themselves from Donald Trump’s campaign, many others still support him, believing that he will “make America great again” — to their Biblical liking . Typical is Ralph Reed, leader of Trump’s religious advisory board and founder and chair of the Faith and Freedom Coalition. The father of two daughters, Reed was reported as being “disappointed by” Trump’s “ ‘Inappropriate’ comments.” But Reed said, “I think a 10-year-old tape of a private conversation with a TV talk show host ranks pretty low on their [evangelical voters] hierarchy of their concerns.” He stated that, “people of faith are voting on issues like who will protect unborn life, defend religious freedom, grow the economy, appoint conservative judges and oppose the Iran nuclear deal.” (“ ‘Still the best candidate’: Some evangelicals still back Trump despite lewd video,” By Sarah Pulliam Bailey, The Washington Post , Oct. 8, 2016) For Ralph Reed and many other evangelical Christian leaders and their flocks, it is the authority of their selective Biblical beliefs. The Bible says, “So God created mankind in his own image, in the image of God he created them; male and female he created them.” (Genesis 1: 27) Therefore, these evangelical leaders believe that unborn American children are more worthy of protection than already born Muslim children and adults – who are protected, by “the Iran nuclear deal,” from another falsely-based, Iraqi-type, pre-emptive U.S. invasion. The aim of evangelical Christian leaders is not just to protect the unborn, but to proselytize those already born, especially Muslims. Thus a reported “87 percent of all white evangelical Christians in the United States supported” the George W. Bush Administration’s illegal pre-emptive invasion of defenseless Iraq — certain evangelical leaders even “claiming that the American invasion of Iraq would create exciting new prospects for proselytizing Muslims.” (“Wayward Christian Soldiers, By Charles Marsh, The New York Times , Jan. 20, 2006) In the wake of that devastating criminal war, certain evangelical groups, like Muslim-hating Rev. Franklin Graham and his Samaritan’s Purse organization, flocked to Iraq to join the “humanitarian effort,” with the motivation to harvest for Jesus the Muslims fortunate enough to survive the slaughter. Ibrahim Hooper, spokesman for the Council on American-Islamic Relations said of this obscenely immoral reality: “Franklin Graham obviously thinks it is a war against Islam. . . . This is a guy who gave the invocation at President Bush’s inauguration and believes Islam is a wicked faith. And,“ Hooper questioned, “he’s going into Iraq in the wake of an invading army and convert people to Christianity? Nothing good is coming from that.” (“Group to Aid, Proselytize in Postwar Iraq,” By Deborah Caldwell, ABC News , March 27, 2003) Nothing good came out of that worst war crime of the 21 st century. It merely provided another tragic example of the fact that “American exceptionalism” and belief that Jesus is “the savior of the world” are two sides of the same imperialistic coin. For many evangelical Christians, it is about belief, not behavior. It is about Psalm 139: “For you created my innermost being: you knit me together in my mother’s womb. I praise you because I am fearfully and wonderfully made.” (verses 13, 14) It is about, “You shall not lie with a male as with a woman; it is an abomination.” (Leviticus 18: 25) And Jesus is reported as saying to Pharisees, “Have you not read that the one who made them at the beginning made them male and female. . . . For this reason a man shall leave his father and mother and be joined to his wife, and the two shall become one flesh?” (Matthew 19: 4, 5) Abortion, homosexuality and same-sex marriage are all an “abomination.” It is one’s birth that counts, Not the circumstances surrounding pregnancy and birth. Nor the individual’s “innermost being” after birth. Especially not one’s “ innermost being” leading one to “leave father and mother and be joined” in love to one’s same-sex partner. Republican vice presidential candidate Mike Pence is a classic example of the Biblically-shrunken moral universe of many evangelical Christians. In his debate with Democratic vice-presidential candidate, Tim Kaine, Pence said, “For me the sanctity of life proceeds out of the belief . . . where God says before you were formed in the womb, I knew you and so . . . I sought to stand with great compassion for the sanctity of life.” (“The most important exchanges of the vice presidential debate, annotated,” LA Times , Oct. 4, 2016) “The sanctity of life” before a child is born. As governor of Indiana, Mike Pence signed a “Religious Freedom Restoration Act” that, as reported, “would have allowed businesses to refuse service to LGBT customers, for example, by citing their religious beliefs.” That legislation cost Indiana dearly in lost revenue from the boycott of celebrities and conventions that cancelled their planned appearances and meetings in the state. Documented is Pence’s consistent opposition to “marriage equality,” his opposition to “protecting LGBT employees,” and his refusal to support “LGBT-inclusive hate-crimes legislation.” (”Donald Trump Clearly Didn’t ‘Ask the Gays’ About Mike Pence,” By Advocate.com Editors/Authors, advocate.com , July 15, 2016) For Pence, “the sanctity of life” ends at birth. It is about belief in the inerrancy of The Bible – which then becomes the epicenter of the moral universe for word-for-word- Bible -believing Christians. Here one finds certainty and authority, which allow one to seek to convert other persons to one’s true beliefs, rather than engage with them, and the truths they live by, as equals. Thus for such Bible -believing Christians, it is not about loving your neighbor as yourself as Jesus taught, but wanting your neighbor to be like yourself. The Bible allows them to act out their need to gain power over and control other persons – and allay their own innermost anxieties and doubts. The Bible is often used by people to avoid understanding why they behave as they do. Forgiveness covers a multitude of sins, and while liberating one from conscious guilt, may provide little self-insight into one’s behavior. Unquestioning belief in “the “Word of God” allows those with anti-introspective tendencies to dismiss scientifically-based psychological knowledge of human development and behavior that contradicts the Source of their authority. This belief allows them to dumb down their God to accommodate their cultural conditioning and rationalizations. Again, the words of Republican vice-presidential candidate Mike Pence are revealing. After Donald Trump gave a brief automatic apology for his sexually abusive behavior toward women in that videotape, Pence used words of faith to make Trump’s compulsive criminal behavior disappear. “ ‘We all fall short of the glory of God,’ “ Pence said, “and praised Trump for his ‘humility’ in asking forgiveness.” Pence continued, “It takes a big man to know when he is wrong and to admit it and to have the humility to apologize and be transparent and be vulnerable with people. . . . Donald Trump last night showed that he is a big man.” (“Pence: Trump showed ‘humility’ with apology,” By Jessie Hellmann, TheHill , Oct. 10, 2016) In a New Hampshire campaign speech, which was greatly lauded by mainstream media, Michelle Obama said entirely different words regarding Donald Trump’s lewd video boasts about sexually assaulting women. While effectively denouncing Trump’s self-professed criminal behavior toward women, she took the occasion to declare that the epicenter of the moral universe is America and that Hillary Clinton possesses the moral compass. “Shaken to my core” by Trump’s “lewd comments,” Mrs. Obama emphasized that, “the measure of any society is how it treats its women and girls.” Then, referring to Trump, she said, “We have a candidate for President of the United States who . . . last week . . . [was] actually bragging about sexually assaulting women. . . . The disrespect of our ambitions and intellect. The belief that you can do anything you want to a woman.” (“Read Michelle Obama’s Speech Condemning Donald Trump’s Comments About Women,” By Katie Reilly, motto.time.com , Oct. 13, 2016) Michelle Obama then pivoted to Hillary Clinton’s presidential candidacy, saying, “I believe with all my heart that Hillary Clinton will be that president . . . who truly cares about us and our children.“ Thus, she said, “If we let Hillary’s opponent win this election . . . we won’t be just setting a bad example for our kids, but for our entire world. Because, “she added, “ for so long America has been a model for countries across the globe, pushing them to educate their girls, insisting they give more rights to their women.” She called America “the greatest nation on earth,” and also stated, “We have the power to show our children that America’s greatness comes from recognizing the inherent dignity and worth of all our people.” ( Ibid ) “The measure of any society is how it treats its women and girls.” How about: the measure of any society is also how it treats the women and girls in other societies ? That measure goes to the heart of The Golden Rule and the epicenter of the moral universe. And with that inclusiveness as the measure, Hillary Clinton fails miserably. If “the measure of any society is how it treats its women and girls,” Iraq was measuring up comparably well. Under Saddam Hussein’s rule, Iraq’s education system was reported to be “top notch and female literacy rates were the highest in the region.” In fact, “education was a major priority for Saddam Hussein’s regime, so much so that in 1982 Iraq received . . . the United Nations Educational, Scientific and Cultural Organization (UNESCO) award for eradicating illiteracy.” Furthermore, “Women were integral to Iraq’s economy and held high positions in both the private and public sectors, thanks in large part to labor and employment laws that guaranteed equal pay, six months fully paid maternity leave and protection from sexual harassment . . . conditions enjoyed by working women in Iraq rival[ing] those of working women in the United States.” (“Was Life for Iraqi Women Better Under Saddam?,” By Rania Khalek, muftah.org , March 19, 2013) Also reported, “Iraq had one of the best national health care systems in the Middle East. . . . and the Iraqi people enjoyed one of the highest standards of living in the Middle East.” (“Living Conditions in Iraq: A Criminal Tragedy,” by Ghali Hassan, globalresearch.ca , June 3, 2005) Then came the devastating U.S.-controlled UN economic sanctions that resulted in the deaths of over 500,000 Iraqi children under five years of age. Following those murderous sanctions, the George W. Bush administration, with the support of then Senator Hillary Clinton, launched an illegal, falsely-based pre-emptive was against defenseless Iraq. That unnecessary criminal war killed over a million Iraqi civilians, left some two million Iraqi women widowed, and an estimated five million girls and boys orphaned. (“Was life for Iraqi Women Better Under Saddam?,” Ibid) And loved ones are grieving for almost 5,000 American troops killed and over 100,000 wounded in body and mind. In response to this carnage, Hillary Clinton said her vote for the invasion of Iraq was a “mistake” – as she announced her candidacy for president in the 2016 campaign. And with her candidacy, she cites her “lifelong commitment to fighting for children and families,” saying, “I’ve spent my life fighting for children, families and our country and I’m not stopping now.” (“Documentary Style Ad Features Hillary Clinton’s Lifelong Record Fighting for Children and Families, hillaryclinton.com ) With her presidential campaign supported by American Iraq war hawks, nothing may stop her from continuing to destroy “children and families” in other societies. (See, “Neocon War Hawks Want Hillary Clinton Over Donald Trump. No Surprise – They’ve Always Backed Her,” By Branko Marcetic, inthesetimes.com , March 23, 2016) It is the same story with Libya. If “the measure of a society is how it treats its women and girls,” Libya excelled. According to Harvard researcher Dr. Garikai Chengu, “Gaddafi’s Libya was Africa’s most prosperous democracy.” Concerning women, Chengu writes “The United Nations Human Rights Council praised Mr. Gaddafi profusely [for] women’s rights.” They included “the right to education, hold jobs, divorce, hold property” and “equal pay for equal work.” Plus, “Libyan working mothers enjoyed a range of benefits including cash bonuses for children, free day care, free health care centers and retirement at 55.” Education was a human right and it was free for all Libyans. And “health care was a human right.” (“Gaddafi’s Libya was Africa’s Most Prosperous Democracy,” Foreign Policy Journal , Jan. 12, 2013) Dr. Chengu states that “prior to Colonel Gaddafi, King Idris let Standard Oil essentially write Libya’s petroleum laws. Mr. Gaddafi put an end to all of that.” He deposited the “money from oil proceeds . . . directly into every Libyan citizen’s bank account.” Chengu muses: “One wonders if Exxon Mobil and British Petroleum will continue this practice under the new democratic Libya?” He also asks: “With regard to health care, education and economic justice, is America in any position to export democracy to Libya or should America have taken a leaf out of Libya’s book?” He then adds this commentary: “Therefore, isn’t it ironic that America supposedly bombarded Libya to spread democracy, but increasingly education in America is becoming a privilege, not a right, and ultimately a debt sentence.” ( Ibid ) Col. Gaddafi himself looked at the invasion and plunder of Iraq, and saw the handwriting on America’s imperialistic wall. He wrote, “They want to do to Libya what they did to Iraq and what they are itching to do to Iran. They want to take back the oil that was nationalized by these countries’ revolutions.” And, “They want to re-establish military bases that were shut down by the revolutions and to install client regimes that will subordinate the country’s wealth and labor to imperialistic corporate interests. All else is lies and deception.” (“Facts about Libya under Gaddafi that you probably did not know about!,” By mystory2323, ireport.cnn.com , Nov. 21, 2012) The rights and prosperity enjoyed by woman and girls – and everyone else – in Libya was enough to threaten any capitalistic society. Col. Gaddafi had to go. And, as reported, Hillary Clinton played a key role in his overthrow and death. In his article, “Benghazi Won’t Stick to Hillary Clinton, But the Disastrous Libyan Intervention Should,” foreign policy journalist Joel Gillin writes that, as Secretary of State, she helped to convince President Obama that a “humanitarian intervention” — in the form of military force was needed ”to stop the imminent slaughter of civilians in Benghazi” – the intervention opposed by Robert Gates, then Secretary of Defense, “and other top national security officials.” Gillin states that “no solid evidence existed to back up Clinton’s statements of the impending bloodbath in Benghazi.” ( New Republic, May 27, 2015) (See also, “Even Critics understate how catastrophically bad the Hillary Clinton-led NATO bombing of Libya was,” By Ben Norton, salon.com , Mar. 2, 2016) In his article, “Who said Gaddafi had to go?,” Hugh Roberts, professor of North African History, wrote that the decision “was to declare Gaddafi guilty in advance of a massacre of defenseless civilians and instigate a process of destroying his regime and him (and his family) by way of punishment of a crime he was yet to commit, and actually unlikely to commit, and to persist with this process despite his repeated offers to suspend military action.” Ironically, Roberts states, it was the U.S.-led NATO forces that committed a “blood bath” against the Libyan people, not Muammar Gaddafi. Possibly 25,000 Libyans were killed, “many thousands injured and hundreds of thousands . . . displaced.” ( London Review of Books , Nov. 17, 2011) How many of those victims were women and girls? Afterwards, Secretary of State Clinton appeared on television, and in response to the news of the toppling of Col. Gaddafi’s government and his brutal death, she laughed and chuckled, “We came, we saw, and he died!” (“See Flashback 2011: Hillary Clinton Laughs About Killing Muammar Gaddafi: ‘We Came, We Saw, He Died!’,” realclearpolitics.com , Posted June 19, 2015) That shocking television scene provides insight into her circumscribed morality. “The measure of a society is how it treats its women and girls.” Tell that to the Palestinian people. Hillary Clinton repeatedly says that “women’s rights are human rights.” But in her mind, that does not apply to Palestinian women and girls. In an article, “Hillary Clinton Is No Feminist: Just Look at Her Stance on Palestine,” Nadia Elia, Diaspora Palestinian writer and political commentator, quotes “a young Palestinian student, Layali Awwad,” who, in a letter to Clinton, wrote, “When you choose to speak about my homeland, not once do you mention Israel’s human rights violations against Palestinian women and children.” Elia continues, “In 2014, Clinton again expressed full support for Israel as it was engaging in a massive military assault on Gaza,” whereas “even the mainstream US media, while otherwise supportive of Israel, repeatedly commented on the disproportionate number of women and children killed by Israeli fire.” And when a journalist asked Clinton “about the bombing of a UN school where homeless civilians had taken shelter, she began with her formulaic ‘Israel has the right to defend itself’ reply.” Elia states that, “fifteen people were killed in that bombing and more than 100 injured, but to her ‘women and children’ were merely a complication.” ( commondreams.com , Aug. 8, 2016) To Hillary Clinton, “the measure of how a society treats its women and children” does not apply to how the occupying Israeli power treats Palestinian women and children. Nada Elia sums up Clinton’s moral blind spot this way: “We can go back to every instance of Israel violating international law and the human rights of Palestinians and Clinton will invariably be on the side of the oppressor, the illegal occupier, the racist regime. This is not what feminism is about.” Elia then says, “Feminism is not only concerned with women and children, but also seeks to eliminate various systems of structural violence. And,” she states, “while the examples above are from Palestine, we can look elsewhere, around the globe to see how detrimental her hawkish political interventions have proven, from Pakistan to Libya, Honduras and beyond.” ( Ibid ) There is also the Clinton campaign’s demonizing of President Putin, and linking him as favoring Donald Trump’s candidacy. And the campaign’s attempt to deflect the revelation of Hillary Clinton’s dishonesty, revealed in her emails, leaked by WikiLeaks: by alleging, without documented proof, that the emails were hacked by the Russians to influence the U.S. election on behalf of Trump’s campaign. Echoes of McCarthyism and the “Communist scare?” Never mind that the emails reveal a two-faced Clinton, telling bankers in private, who paid her around $225,000 for a speech, that they can count on her, and saying to voters in public what she believes they want to hear. Donald Trump’s crime is his compulsion to sexually assault individual women. If he obtains the power of the presidency, his delusions of grandeur, paranoia, distortion of reality and impulsiveness would be boundlessly destructive. Hillary Clinton’s crime is her compulsion to militarily assault whole countries. As president, she would continue America’s imperialistic global war on terrorism, with countless more women and girls at risk. In 2005, the United Methodist News Service reported that a delegation of five United Methodist Bishops paid a “pastoral visit” to President George W. Bush at the White House. They “presented Bush, a fellow United Methodist, with a Bible signed by the Council of Bishops, and they shared a moment of prayer with him.” Their “pastoral visit” also included “telling the president . . . they shared his commitment to building a better world.” (“United Methodist bishops meet with president, open door to future,” by Tim Tanton, archives.gcah.org , May 3, 2005) Bush continued his devastating criminal war against Iraq. Later, United Methodist leaders built him a monument (The George W. Bush Presidential Library and Museum) on the campus of Southern Methodist University. If Hillary Clinton, a United Methodist, is elected president, beware of a delegation of proud United Methodist Bishops, with Bible in hand, visiting her at the White House. For many United Methodist leaders, the epicenter of the universe is power, not morality. The election is rigged, but not in the way Donald Trump repeatedly charges. It is rigged by the Democratic and Republican parties, and the corporate media, to limit our choices to their two immoral presidential candidates. Neither Donald Trump nor Hillary Clinton is worthy of one’s vote. The moral universe encircles all women and girls, and all men and boys – everywhere . NOTE: ALL IMAGE CAPTIONS, PULL QUOTES AND COMMENTARY BY THE EDITORS, NOT THE AUTHORS PLEASE COMMENT AND DEBATE DIRECTLY ON OUR FACEBOOK GROUP INSTALLATION ABOUT THE AUTHOR Rev. William E. Alberts, Ph.D. , a former hospital chaplain at Boston Medical Center, is both a Unitarian Universalist and United Methodist minister. His new book, The Counterpunching Minister (who couldn’t be “preyed” away) is now published and available on Amazon.com. The book’s Foreword, Drawing the Line, is written by Counterpunch editor, Jeffrey St. Clair. Alberts is also author of A Hospital Chaplain at the Crossroads of Humanity, which “demonstrates what top-notch pastoral care looks like, feels like, maybe even smells like,” states the review in the Journal of Pastoral Care & Counseling. His e-mail address is wm.alberts@gmail.com . Note to Commenters Due to severe hacking attacks in the recent past that brought our site down for up to 11 days with considerable loss of circulation, we exercise extreme caution in the comments we publish, as the comment box has been one of the main arteries to inject malicious code. Because of that comments may not appear immediately, but rest assured that if you are a legitimate commenter your opinion will be published within 24 hours. If your comment fails to appear, and you wish to reach us directly, send us a mail at: editor@greanvillepost.com \\nWe apologize for this inconvenience. \\nWhat will it take to bring America to live according to its own propaganda? =SUBSCRIBE TODAY! NOTHING TO LOSE, EVERYTHING TO GAIN.= free • safe • invaluable If you appreciate our articles, do the right thing and let us know by subscribing. It’s free and it implies no obligation to you— ever. We just want to have a way to reach our most loyal readers on important occasions when their input is necessary. In return you get our email newsletter compiling the best of The Greanville Post several times a week.'"}, "time": 1742561743.739196}