{"duration": 0.03629446029663086, "input_args": {"text": "'A Philadelphia television reporter who lost her job after she was caught screaming expletives at a police officer outside a comedy club said she is now receiving thousands of “sexual and violent” phone messages and threats. [Colleen Campbell, 28, said she is the one being targeted now after she claimed she was “ruined” when the video of her   tirade went viral and caused her to lose her job as a reporter at PHL 17.  “From the time the video was made public, Ms. Campbell has been the recipient of thousands of lewd and threatening phone calls, texts, messages, and emails ranging from angry, profane, and defamatory insults to deeply disturbing sexual and violent threats,” Campbell family spokesman and attorney Wayne Pollock told the New York Post in a statement. “Ms. Campbell and her family are still sorting out the events of that night. Their highest priority is the health and   of Ms. Campbell. ” Pollock added that Campbell is trying to reach out to the Philadelphia police officer to offer an apology for her behavior. The video showed Campbell verbally lashing out at the officer while the officer just asked her to walk away. “Or what? Or what, motherf —  ker? Lick my a —  hole,” Campbell says in the video. “How about that? F —  king piece of s —  t. That’s why nobody likes f —  king police   …     idiots in this f —  king town. ” Police told Philadelphia magazine that Campbell faces assault charges for allegedly kicking the unidentified officer as well as the doors and windows of the police cruiser multiple times after her arrest. The assault charges are in addition to the charges of resisting arrest, criminal mischief, and disorderly conduct that she already faces. Campbell originally claimed to have consumed two drinks at the comedy club and believes she was drugged. The Post reports that she later admitted to having five drinks, including two shots she consumed before the show and a few drinks she had while bartending at the Devil’s Den in South Philadelphia earlier in the evening.'"}, "time": 1742561724.2158163}