{"duration": 0.1850566864013672, "input_args": {"text": "'RICHARD NIXONThe LifeBy John A. FarrellIllustrated. 737 pages. Doubleday. $35. While writing “Richard Nixon: The Life,” John A. Farrell could not possibly have known who would be president on the day his fine book was published. That it happens to be Donald J. Trump is, for him, an extraordinary stroke of luck. To read this biography with an eye only toward the parallels between the two presidents would be lazy and unfair, a disservice to Farrell’s nuanced scholarship. But the context here is unignorable. The similarities between Nixon and Trump leap off the page like crickets. There is, first and most superficially, their nonpresidential looks  —   Trump with his roosterly combover, Nixon with jowls so low they formed an   with his nose. More substantively, there’s the matter of their Old Testament fury at the news media. (“The press is the enemy,” Nixon told his aides. “Write that on the blackboard 100 times and never forget it. ”) What else? Their thin skin. Their skyscraping paranoia. Their cavernous memory for slights. It’s hard to think of two modern presidents with a more dire case of political hemophilia. Once wounded, these men never stop bleeding. Like Trump, Nixon was a monomaniac on the stump, obsessed with the enemies lurking within. Nixon, too, had a penchant for sowing mayhem and a gourmand’s appetite for revenge, especially in the wee hours of the morning. (Trump tweets. Nixon made phone calls.) And members of Nixon’s own party feared for his stability. As vice president, he once flew into a rage after contending with a group of hostile student journalists at Cornell University. “What scares the hell out of me is that you would blow sky high over a thing as inconsequential as this,” an adviser told him. “What in goddamn would you do if you were president and get into a really bad situation?” These similarities in character lead to eerily similar behavioral consequences. In 1968, Nixon opened up a back channel to the president of South Vietnam, assuring him he’d get further support if he could just hold out for a Nixon presidency and resist Lyndon B. Johnson’s offers to broker peace. Nearly 50 years later, Michael Flynn had private discussions with the Russians that seemed to promise them a friendlier American policy  —   if they could just sit tight until Trump was inaugurated. Both men went on to claim that their predecessors had wiretapped these discussions. Nixon said he’d been tipped off by J. Edgar Hoover. Confirmation of Nixon’s meddling in Johnson’s peace efforts is the only real news that “Richard Nixon” breaks. But startling revelations are hardly the only criterion for a good Nixon biography. He’s an electrifying subject, a muttering Lear, of perennial interest to anyone with even an average curiosity about politics or psychology. The real test of a good Nixon biography, given how many there are, is far simpler: Is it elegantly written? And, even more important, can it tolerate paradoxes and complexity, the spikier stuff that distinguishes   sinners from   villains? The answer, in the case of “Richard Nixon,” is yes, on both counts. Farrell has a liquid style that slips easily down the gullet, and he understands all too well that Nixon was a vat of contradictions. Some readers may find Farrell’s portrait too sympathetic  —   he’s as apt to describe Nixon as a tortured depressive as he is to call him a malevolent sneak  —   but more readers, I think, will find this book complicating and  . It’s also hard to read a   history of a president’s life without feeling like you’re crawling over the dense folds of an accordion. But most chapters in “Richard Nixon” have room to breathe. The development of Nixon’s character in this book is subtle. He doesn’t start out as a rampaging narcissist and megalomaniac. Over time, it was power combined with profound insecurity that misshaped him. He had no ability to tolerate the slings and arrows of outrageous public humiliations, of which he probably suffered a disproportionate many, and he responded with the venom of a toadfish. The press trolled him. Even Dwight D. Eisenhower trolled him. Once, Ike was asked to name an important decision Nixon had helped him make as his vice president. “If you give me a week, I might think of one,” he replied. Farrell follows a mostly chronological structure. We go to Whittier, Calif. where Nixon was raised by an ogre of a father, a fellow so bad at farming he couldn’t grow lemons. As a young man, Nixon was awkward, square, hopeless at making small talk. I could read a whole book of his love letters to Pat, his future wife. They’re endearing and pathetic, the desperate pleas of the runt of the litter. “Yes, I know I’m crazy!” he wrote in a note he shoved under her door. “And that   …     I don’t take hints, but you see, Miss Pat, I like you!” In some ways, the Watergate years, because they’re so familiar, are the least interesting stretch of this book. (Though here’s a detail I’d forgotten: Nixon had a mole in almost every opponent’s campaign, a thumb in every pie.) It’s Farrell’s chapters about race that prove the most textured and dizzying: It was over this issue that the president’s Quaker upbringing and Machiavellian impulses seemed most overtly at war. When Nixon first ran for Congress, he was made an honorary member of the local N. A. A. C. P. so progressive was he on matters of race. Yet while running for president, he made it clear he’d “lay off   crap,” and once in office he mastered the rhetorical art of exploiting racial grievances. Thus began the South’s transformation from a block of   states to a G. O. P. sea. You can also draw a through line from Nixon’s contempt for the liberal elite to Trump’s boastful claims of political incorrectness. That vaudevillian public disdain for East Coast intellectuals, Ivy League blue bloods, cosmopolites  —   all of it started with Nixon. It was he who first used the phrase “the silent majority. ” He came by that populism honestly. He started from nothing, and he found the culture of Washington, which went gaga over pretty, privileged boys like John F. Kennedy, infuriating. What his populism didn’t mean, however, was stripping the welfare state to the studs. The public still had a taste for big government back then. During Nixon’s presidency, he signed the Occupational Safety and Health Act and established the Environmental Protection Agency. The most charitable biographies paint Nixon as a tragic figure, and that’s precisely what the president is here. Farrell’s Nixon is smart and ambitious, a visionary in some ways (China) but also skinless, both driven and utterly undone by  . It may be the way he differs most, at least psychologically, from our current president. Trump has shown almost no evidence of   ever, about anything. He appears to sail through life unencumbered by introspection. He’d yield no more depth if you used an oil rig. But grandiosity and profound insecurity often find the same form of public expression: recklessness. “I sometimes had the impression that he invited crisis and that he couldn’t stand normalcy,” Henry Kissinger once said. I’ll leave it up to the reader to determine which president he’s best describing.'"}, "time": 1742562011.1510797}