{"duration": 0.06829309463500977, "input_args": {"text": "'November 1: Daily Contrarian Reads By David Stockman.   Here It Comes----The Great Dollar Short That Will Shatter The Global Bubbles \\nSurging rates on dollar Libor contracts are rapidly tightening conditions across large parts of the global economy, incubating stress in the credit markets and ultimately threatening overvalued bourses....Fear that the US Federal Reserve may have to raise rates uncomfortably fast is leading to an acute dollar shortage, draining global liquidity. ETF Warning: Shift To Passive Investing Amplifies Systemic Risk----Will Make Crashes Worse \\nThis unprecedented shift in capital away from active managers and toward passive strategies has resulted in not only a chilling effect on the hedge fund industry but also concerns about a market in which \"passive\", robotic, algo-driven decision makers are the marginal buyers and sellers of securities. And while it is the case that so far, the market has been spared an observation of how a largely passive investing crowd would respond during a downturn (and more importantly what happens to market liquidity), the time is drawing nearer with every passing day, and certainly as central bankers collectively try to prop up global yield curves. After Peak Monetary Stimulus----Look Out Below! \\nThere’s deep complacency in the U.S. regarding vulnerability to reduced monetary stimulus. The Fed wound down QE and implemented a rate increase without major market instability. I believe this was only possible because of the extraordinary monetary stimulus measures in play globally. “Whatever it takes” central banking, in particular from the ECB and BOJ, unleashed Trillions of liquidity (and currency devaluation) that certainly underpinned U.S. securities and asset markets. Prices of sovereign debt, including Treasuries, have traded at levels that assume global central banker support will last indefinitely. Markets have begun reassessing this assumption. The Disaster of Inflation--For the Bottom 95% \\nCentral banks are obsessed with boosting inflation, but the \"why inflation is good\" arguments make no sense for households being ravaged by inflation. The basic argument is that inflation makes it easier for debtors to service their debts. But this is only true if income rises along with costs. If income stays flat while costs rise, households lose ground--debt remains a burden as the purchasing power of income plummets. Hillary Clinton\\'s Warped Notion Of American Exceptionalism And Indispensability \\nThe unique moral revolution to which the Founding Fathers pledged their lives, their fortunes, and their sacred honor has little connection to the bastard term (usually capitalized as “American Exceptionalism”) that describes post-Cold War U.S. global behavior, by which policymakers in Washington assert both an exclusive “leadership” privilege and unsupportable obligation to undertake open-ended international missions in the name of the “Free World” and the “international community.” This is the counterfeit “Exceptionalism” of a tiny clique of bipartisan apparatchiki —GOP “neoconservatives” and Democrat “liberal interventionists” and their mainstream media mouthpieces—who have little regard for our country’s oldest traditions or the security and welfare of the American people. The So-Called OPEC Cartel Whiffs Again-'"}, "time": 1742563942.0452056}