{"duration": 0.12810707092285156, "input_args": {"text": "'Experimental GM crops from Dow Chemical and DuPont fail to repel pests \\nSunday, October 30, 2016 by: Ethan A. Huff, staff writer Tags: Herculex , Yield Guard , crop failures (NaturalNews) The utter failure of genetically-modified crops (GMOs) is once again on full display, this time with crop products made by companies other than the usual Monsanto . A novel variety of transgenic corn produced and marketed by both Dow Chemical Corporation and DuPont is not exactly working as claimed, new reports indicate, and agricultural experts are urging the chemical industry to immediately cease selling these failed products to farmers.Known as \"Herculex,\" the synthetic corn in question contains a gene modification that\\'s supposed to prevent a pest known as the western bean cutworm from destroying crops. But so far, the genetic alteration has done nothing to stop this worm, which means farmers everywhere have been paying through their teeth for a technology that not only doesn\\'t work , but that\\'s also proprietary and exceptionally costly, especially when compared to non-GMO and organic crops that are open-source, and are not patented or owned by multi-national corporations.A group of six entomologists published an open letter to the seed industry in a recent issue of Purdue University\\'s Pest & Crop Newsletter , calling on those involved to do the right thing and fess up to the fact that Herculex doesn\\'t work. Farmers will soon be gearing up to plant next year\\'s crops, and they need to know that it\\'s best to look elsewhere for corn that\\'s not going to result in massive yield reductions.\"People are frustrated and angry and, more importantly, yield was lost,\" the letter states. \"Before growers make seed choices for 2017, we again urge the seed industry to acknowledge the reality of what is happening in the field.\" DuPont quietly admits Herculex doesn\\'t work, but refuses to take responsibility In typical corporate fashion, the owners of Herculex are refusing to take the letter seriously, resorting instead to excuses and legal speak to try to explain away the GM crop\\'s failure. Rather than pull the Herculex product from the market, DuPont, according to Bloomberg , has instead decided to merely decreased its efficiency rating in the company\\'s 2017 Product Use Guide from \"very good\" to \"moderate.\"DuPont has also issued an accompanying statement urging farmers to add other inputs to try to control cutworms, including spraying additional chemical insecticides. In other words, Herculex doesn\\'t actually work, and DuPont\\'s solution is to have farmers just go ahead and blast away with all those endocrine-disrupting, cancer-causing chemicals to kill anything and everything that might be living on or around the crop .It\\'s basically the same advice that Monsanto is giving to farmers who foolishly adopted a similar GM corn product known as \"YieldGard\" that was supposed to deter the western corn root worm. The insecticidal proteins in this crop product, just like the one in Herculex – known as Cry1F – haven\\'t lived up to all the wild marketing claims, and yet both Monsanto and DuPont\\'s products continue to be sold to farmers.\"Cry1F has failed in our states,\" the letter continues, adding that the scientists involved have already received dozens of calls and emails about the problem from concerned farmers. \"For growers in our states, the costs of scouting and spraying Cry1F corn negates a major reason they purchased and planted a hybrid with the trait in the first place.\"If left to run their course, western bean cutworms and western corn root rooms will effectively eat up all the corn kernels and leave the plant defenseless, encouraging the growth of harmful fungi and mycotoxins. And since none of what the chemical industry has proposed as a solution is working, their only recommended option is to spray more glyphosate, dicamba, 2,4-D and other chemicals on their products. Sources for this article include:'"}, "time": 1742562608.5216136}