{"duration": 0.12743330001831055, "input_args": {"text": "'Four taps of the microphone were all Michelle Obama needed to take down Donald J. Trump. “Hillary Clinton is tough,” Mrs. Obama, the first lady, told a crowd of several thousand in Charlotte, N. C. on Tuesday. “See,” she continued, “I’ve watched her when she gets knocked down  —   she doesn’t complain. She doesn’t cry foul. ” Tap, tap, tap, tap. It took a second for the audience to catch on: Mrs. Obama was mocking Mr. Trump’s complaint that a faulty microphone had hindered his performance in his first presidential debate with Mrs. Clinton. But as Mrs. Obama continued  —   “No, she gets right back up, comes back stronger”  —   the mostly young and heavily   crowd let out a deafening howl. They called her “the closer” during Barack Obama’s 2008 campaign, like a   relief pitcher used sparingly but with devastating effect. Mrs. Obama preferred spending time with her daughters over attending political rallies. But when she was unleashed before a pivotal caucus or primary, her story of growing up on the South Side of Chicago and falling in love with a young community organizer had an unmatched, almost magical power to turn out voters, campaign officials discovered. Eight years later, Mrs. Obama is playing a similar role for the woman whom she helped her husband defeat in that race. To divine the places where the Clinton campaign’s turnout operation is under the greatest pressure, and the constituencies about which it is most concerned, look no further than where Clinton aides dispatch the popular first lady. She has appeared in North Carolina, at college campuses in Philadelphia and Pittsburgh, and at George Mason University in Fairfax, Va.  —   all areas where Mrs. Clinton needs to drive up turnout among blacks and younger voters. “She chooses her moments, and she has made clear to her staff and the Democratic Party that she wants to go places where she can make a difference,” said Peter Slevin, the author of “Michelle Obama: A Life. ” “If a candidate is up by 15 or down by 15, you’re not going to see Michelle Obama there. ” Mrs. Obama has made only about a   campaign appearances for Mrs. Clinton in the general election, each carefully approved by the White House. Each has become something of an event  —   and her warm, spunky delivery has given rise to several of the kind of   moments that rarely emerge from Mrs. Clinton’s rallies. President Obama, of course, has proved an immensely valuable surrogate for Mrs. Clinton, appealing frequently to the young, black and Latino voters who turned out in record numbers for him but who have proved lukewarm to Mrs. Clinton’s candidacy. He has gone so far as to tell black voters he would consider it a “personal insult” if they did not help elect Mrs. Clinton. But the first lady’s reluctance to campaign means that the events she does attend speak volumes about the places Mrs. Clinton views as most critical in November. She is virtually tied with Mr. Trump in North Carolina, with its younger and diverse population. Enter Mrs. Obama. In Raleigh and Charlotte this week, where thousands of mostly younger voters turned out to hear her, Mrs. Obama came armed with data points about turnout from Mr. Obama’s narrow victory in North Carolina in 2008. (He lost the state in 2012.) “Barack won North Carolina by about 14, 000 votes,” she said in Charlotte on Tuesday. “That sounds like a lot, but when you break that number down, the difference between winning and losing this state was a little over two voters per precinct. ” Mrs. Obama paused and gave a stern look to her largely young crowd. “Do you hear that?” she continued. “If just two or three folks per precinct had gone the other way, or stayed home, Barack would have lost this state. ” Straight talk is a specialty. At La Salle University in Philadelphia last month, Mrs. Obama soberly warned college students not to support a   candidate. “If you vote for someone other than Hillary, or if you don’t vote at all,” she said, “then you are helping to elect Hillary’s opponent. ” Mrs. Obama has also gone further than her husband in laying bare the emotional toll of the   birther movement, including Mr. Trump’s   campaign to sow doubts about whether Mr. Obama was born in the United States. “Back then, people had all kinds of questions about what kind of a president Barack would be,” Mrs. Obama said in Fairfax in September on the same day Mr. Trump tried to distance himself from the birther claim. “Things like: Does he understand us? Will he protect us? And then, of course, there were those who questioned  —   and continue to question, for the past eight years, up through this very day  —   whether my husband was even born in this country. ” Mrs. Obama’s hard feelings from the 2008 campaign for a time extended to Mrs. Clinton and her husband, former President Bill Clinton, after an acrimonious South Carolina primary battle in which Mr. Clinton dismissed Mr. Obama’s antiwar image as a “fairy tale. ” But Mrs. Obama has long since come around, and often refers to Mrs. Clinton now as “my friend Hillary. ” She brings undeniable advantages to Mrs. Clinton 64 percent of Americans view Mrs. Obama favorably, according to a Gallup poll in August. But Gallup polling this week found 54 percent of the public holds an unfavorable opinion of Mrs. Clinton. Jennifer Palmieri, Mrs. Clinton’s communications director, called Mrs. Obama “one of the most popular public figures in America” and “a highly effective messenger both at our convention and throughout the campaign. ” Mrs. Obama appears in an ad for Mrs. Clinton, called “Watch,” being shown in Florida, North Carolina, Ohio and Pennsylvania. “Our children watch everything we do,” the first lady says, as images of Mrs. Clinton working with children flash on screen. “The person we elect as president has the power to shape their lives for years to come. ” Before making the case for Mrs. Clinton, Mrs. Obama often describes her mixed emotions about leaving the White House. “We are experiencing a great transition for me and Barack and Malia and Sasha and Bo and Sunny and Grandma,” she said in Charlotte on Tuesday. “I’m going to need a job, but it will be a job out of politics,” she said. “My husband’s got to get a job  —   somebody has got to hire that man. ” There were shouts of “Michelle for president!” and “Michelle for mayor!”  —   but the first lady was having none of it. “Can you believe I’m campaigning again?” she said. “But I’m happy to be out here. Because this is the last time. ”'"}, "time": 1742562288.8238752}