{"duration": 0.06859755516052246, "input_args": {"text": "'Russian experts collecting evidence of anti-govt chemical attack in Aleppo – Defense Ministry ‹ › GPD is our General Posting Department whereby we share posts from other sources along with general information with our readers. It is managed by our Editorial Board “Wikileaks is the Mossad, Stupid, Not the Russians, We are playing them like a fiddle…” Assange (sort of) By GPD on November 3, 2016 \\n[Editor’s note: John Pilger was identified long ago as an Israel operative by author Jeff Gates. Wikileaks by VT and Zbigniew Brzezinski. RT was identified some time ago as “penetrated.” Both RT and Sputnik News have been used and, to some extent, “turned” to seem propaganda-like, more than usual and to make them an easy target. This is huge damage to Russia. g] \\nIn a John Pilger Special, to be exclusively broadcast by RT on Saturday courtesy of Dartmouth Films, whistleblower Julian Assange categorically denied that the troves of US Democratic Party and Clinton work and staff emails released this year have come from the Russian government. \\n“The Clinton camp has been able to project a neo-McCarthyist hysteria that Russia is responsible for everything. Hillary Clinton has stated multiple times, falsely, that 17 US intelligence agencies had assessed that Russia was the source of our publications. That’s false – we can say that the Russian government is not the source,” Assange told the veteran Australian broadcaster as part of a 25-minute John Pilger Special, courtesy of Dartmouth Films. \\nAssange, who spoke with Pilger at the Ecuadorian Embassy in London, where he has been for four years, also accused the US presidential candidate of being a pawn of behind-the-scenes interests, and voiced doubts about her physical fitness to take charge of the White House. Assange claims ‘crazed’ Clinton campaign tried to hack WikiLeaks \\n“Hillary Clinton is just one person. I actually feel quite sorry for Hillary Clinton as a person, because I see someone who is eaten alive by their ambitions, tormented literally to the point where they become sick – for example faint – as a result of going on, and going with their ambitions. But she represents a whole network of people, and a whole network of relationships with particular states.” \\nOver the past nine months, WikiLeaks uploaded over 30,000 emails from Hillary Clinton’s private email server, while she was Secretary of State. This was followed by nearly 20,000 emails sent to and by members of the US Democratic National Committee, exposing the party leadership’s dismissive attitude to Bernie Sanders, and his outsider primaries campaign. \\nFinally, last month, WikiLeaks posted over 50,000 emails connected to John Podesta, Bill Clinton’s chief of staff, and a close associate of the current presidential frontrunner. \\nThe Homeland Security Department and Office of the Director of National Intelligence posted a joint statement in October, claiming they were “confident” that the Russian government “directed” this year’s leaks. \\nMoscow has rejected the accusation, with presidential press secretary Dmitry Peskov calling the claims “nonsense,” while Foreign Ministry spokeswoman Maria Zakharova said the “public bickering with Russia” before the US election is probably a “smokescreen” to draw the voters’ attention away from serious domestic issues. Related Posts:'"}, "time": 1742563964.9661717}