{"duration": 0.10885334014892578, "input_args": {"text": "'Outraged reporters piled onto Principal Deputy Press Secretary Sarah Sanders Friday during a press conference, demanding to know why the White House had dared mention an alleged rape committed by   suspects after initial charges were dropped. [“I want to ask you about this case out of Maryland,” ABC News reporter Cecilia Vega began, and went on to say:  As you probably know, the prosecutors have dropped the rape charges against the two, undocumented teens [sic] accused of attacking that    classmate. This White House has been —  was vocal on that case from this podium. Sean Spicer said that ‘a big of the reason this president has made illegal immigration and crackdown such a big deed —  deal, is because of tragedies like this.’ Vega then made a   expression and asked: “Did this White House unfairly jump to conclusions in this case?” On Mar. 16, Maryland police arrested two illegal alien suspects,    Guatemalan Henry E. Sanchez Milian and    El Salvadoran Jose Montano, after staff at Rockville High School in Maryland reported an alleged rape of a    freshman who claimed to a police detective she had been raped orally, anally, and vaginally simultaneously by the two suspects after being stripped naked and “bent over a toilet” in the boys’ bathroom. A forensic specialist found blood and bodily fluids in the bathroom after the alleged victim said she was raped.  Prosecutors in the case, which sparked a national uproar, said on Friday they planned to drop the   rape and sex offense charges, citing the “challenges corroborating events the girl described,” according to the Washington Post. The alleged victim had exchanged   text messages and images with at least one of the alleged assailants beforehand. Sanchez Milian will likely face child pornography charges, however. White House press secretary Sean Spicer had expressed indignation at the alleged   of the    freshman. Spicer said at the White House in late March: This is a tragic event, and it is horrendous, and horrible, and disgusting what this young woman in Rockville went through. I can’t possibly imagine. Part of the reason the president has made illegal immigration and [a] crackdown such a big deal is because of tragedies like this. Part of the reason is the tragedy this young girl dealt with, had inflicted upon her, whatever the word is. This is why he’s passionate about this. Because people are victims of these crimes. But since prosecutors dropped some of the charges against the   suspects —  and have decided to pursue others —  leftist reporters thought they had a “gotcha” moment against anyone concerned about illegal immigration. “Look, I think we’re always looking to protect the American people,” Sanders replied. “Sean was speaking about what he knew at the time. And certainly, I haven’t had a chance to dive into the latest on that, but we will, and we’ll get back to you. ” “You wanna retract anything that —  that the White House has said so far?” Vega said. “I’m not gonna retract anything without further information in front of me,” Sanders said. Bizarrely, another CBS reporter wanted to know if the White House regretted speaking about a national scandal that would never have happened had illegal immigration from Central America been stymied, not encouraged, during the Obama years. “Have you talked to Sean and does he have any regrets about what he said?” CBS News’s Chip Reid asked. “I have not talked to Sean,” Sanders said, adding he was on Navy duty. Another reporter asked if “there is a general danger that the White House, through its rhetoric, is animating too many people to jump to conclusions against immigrants [sic] and in the process, diminishing the entire immigrant community [sic] whether they’re   or not?” “Not at all,” Sanders said, adding, “The president has been incredibly outspoken against crime in any form, fashion —  certainly from his joint address, to his speech last week on Holocaust Remembrance Day. Look, this is a    president. He’s focused on restoring law and order. We’ve seen a spike in crime rates, starting in 2015, across the board, not just in any particular sector. I think that’s why he campaigned and talked so much about needing to restore law and order in this country. It’s why he’s focused on securing our border —  stopping drug trafficking, human trafficking. Those are things that have been a priority for him. And I think the reason is, is because he places such a high value on that. And I think to call into question his rhetoric, to be anything other than someone who has condemned hate and violence in all of its forms, is simply a complete misrepresentation. Not only of who the president is, but also what he’s said. ”'"}, "time": 1742563192.6974063}