{"duration": 0.07935523986816406, "input_args": {"text": "'WASHINGTON  —   It was a golden year for Rudolph W. Giuliani, a mad dash that would take him to 11 countries on four continents, and by the time 2006 was done, earn him $16 million  —   a princely sum compared with the $7, 000 he claimed to have in 2001, when he went through a divorce. With salaries from a law firm and a consulting firm, and most of all $10 million from 108 speeches he delivered to audiences around the world, the lucrative year of 2006 will now, along with the rest of Mr. Giuliani’s career after his tenure as New York’s mayor, be getting a new round of scrutiny if he is nominated as secretary of state by   Donald J. Trump. The blitz of activity by Mr. Giuliani in 2006  —   speaking to Wall Street banks oil, gold mining and pharmaceutical companies and investor groups in Japan and Singapore  —   is public because the next year, he began a campaign for president and had to file a financial disclosure form. But that public ledger offers the most detailed look at just how Mr. Giuliani managed to become so wealthy after he left office, with assets worth tens of millions of dollars, including homes he now owns in Palm Beach, Fla. the Hamptons and New York City. Mr. Giuliani’s speeches and travel that year and in the decade since were often related to business deals he was pursuing, or even standing agreements he had reached, like one with backers of the dissident Iranian political party known as the Mujahedeen Khalq, which until 2012 was considered a foreign terrorist organization by the State Department. They offer a road map of sorts to the kinds of potential conflict of interest questions that are already emerging as Mr. Giuliani’s name is floated as a possible Trump cabinet member, particularly given that Mr. Trump repeatedly mocked Hillary Clinton, his Democratic opponent, for the many speeches she and her husband gave after they left public office. “When she left, she made $21. 6 million giving speeches to Wall Street banks and other special interests in less than two years  —   secret speeches that she does not want to reveal to the public,” Mr. Trump said in June. “Together, she and Bill made $153 million giving speeches to lobbyists, C. E. O.s and foreign governments in the years since 2001. They totally own her, and that will never change. ” In particular, Mr. Trump criticized Mrs. Clinton’s speeches to Wall Street banks. But Mr. Giuliani, in a   period that ended in January 2007, earned $750, 000 in speaking fees  —   before the 20 percent cut taken by the speakers’ agency  —   for eight speeches he gave to Wall Street banks and other major financial institutions, including JPMorgan Chase, Merrill Lynch and Lehman Brothers, before its collapse. As with Mrs. Clinton, there is little public record of what Mr. Giuliani said during these events. Mr. Giuliani had rules about keeping his remarks private, as a contract “addendum” to which organizations that invited him to speak had to agree makes clear. Mr. Giuliani stipulated that his remarks could not be recorded, nor could “general press or other media coverage” of the remarks be allowed without his explicit permission. He also had some elaborate demands, including that if he traveled by private plane, it be a Gulfstream IV or bigger, a plane that costs about $40, 000 for a   trip within the United States. Some members of the Senate, which will hold hearings and vote on his nomination if Mr. Trump selects him, are already saying they want to learn more about Mr. Giuliani’s work in the years since he left City Hall. “I’m concerned generally about conflicts of interest on the part of prospective members of the administration, in every role,” Senator Richard Blumenthal, Democrat of Connecticut, said when asked about Mr. Giuliani’s business ventures since he left office. “And that concern is well justified in terms of the backgrounds of some of the potential nominees that have been discussed. ” Mr. Giuliani, in an interview this week, defended his activities since he left office, saying he had been open about his dealings with private companies and foreign states or political parties, including the Iranian group. “My ties to them are completely open,” Mr. Giuliani said. Mr. Giuliani certainly kept up a feverish pace. In one month alone during 2006, he gave 20 speeches. From 2001 to 2008, the year he ran for president, he was on the road as much as 200 days a year, according to Anthony V. Carbonetti, a former New York City Hall aide. “Every time I turned, he was calling me from a different country or a different city,” Mr. Carbonetti said. For most of those trips, he had a standard speech that mixed a retelling of leadership lessons outlined in his book and memories from the Sept. 11, 2001, terrorist attacks, which ultimately earned him the nickname “America’s mayor. ” “I heard it so many times, I could have given the speech,” Mr. Carbonetti joked. One area of particularly focused travel was Asia. Mr. Giuliani formed a partnership with Sage Capital Growth, a   investment firm that was exploring business opportunities in Japan. Mr. Giuliani’s disclosure form showed a $300, 000 speaking fee for one event in November 2005, the largest single fee on the form, which covered 123 speeches given over a   period. Mr. Giuliani was separately retained by Mark Advent, a Las   casino developer, to help him with his attempt to build a resort and casino in Singapore. Mr. Giuliani personally presented parts of the plan to Singapore’s authorities in hearings during an arduous review process. One of Mr. Giuliani’s most frequent employers as a speaker was HSM, a company that arranges “executive education” events around the world. In 2006, he made eight speeches for the company and was paid $550, 000 (his booking agent kept 20 percent of that). At least three times, in 2003, 2004 and 2006, Mr. Giuliani was to be among the featured speakers at HSM World Business Forums, along with Bill Clinton. The speeches that have drawn the greatest scrutiny are those he gave from 2012 through last year at events organized by the Mujahedeen Khalq, a dissident group of Iranians that holds a rally in France every year to draw attention to the persecution of its members by the government of Iran. Mr. Giuliani was paid for “three or four” speeches he delivered to the group, said Robert G. Torricelli, a former senator from New Jersey who served as a lawyer for the M. E. K. as the group is known, as it sought to be removed from a State Department list of terrorist organizations. Mr. Giuliani, after receiving payments from   groups of Iranian immigrants who had ties to the Iranian dissidents, gave rousing speeches at these annual rallies condemning Iranian leaders and the Obama administration for negotiating with them. “The ayatollah must go,” Mr. Giuliani yelled, referring to Ayatollah Ali Khamenei, the supreme leader of Iran, as thousands stood and cheered him. “Gone, out, no more,” he said, adding that Mr. Khamenei and other leaders of Iran should “be put on trial for crimes against humanity for the thousands and hundreds of thousands of people that they have killed. ” Paul S. Ryan, a vice president for policy and litigation at Common Cause, a nonprofit group that examines special interest influence in politics, said there would be no legal prohibition on Mr. Giuliani’s moving from being paid by the group to a government job. But he still found it troubling. “People would reasonably question his fitness for this political appointment given that he received payments from supporters of this organization, and these are matters he would be charged with dealing with as secretary of state,” he said. Mr. Torricelli said that Mr. Giuliani had agreed to give the paid speeches because he supported the group’s message, and that he had volunteered his time to participate in negotiations in Europe to help prevent further attacks on refugees from the group who were then living in Iraq. Mr. Giuliani’s work earned him a spot on several lists of the   speakers in the world, just one spot below Mr. Clinton in one ranking. In one instance in 2006, Mr. Giuliani collected $100, 000 for speaking at Oklahoma State University. His contract with the university, which is public, laid out what appeared to be his standard demands beyond a fee. Besides the requests related to air travel, his team required a sedan and an S. U. V. and an extra S. U. V. for luggage when he traveled to other countries. His room tastes were specific: a “large   nonsmoking suite with a   bed, on an upper floor, with a balcony and view if applicable. ” He required four more rooms on the same floor for security and staff. Eric C. Money, who led the speakers bureau at Oklahoma State University at the time Mr. Giuliani visited the campus, said Mr. Giuliani’s speech to students and faculty members in the university’s basketball arena had focused on leadership and Sept. 11. Mr. Money said the fee was high, but he did not recall hearing complaints. “That is what Bill Clinton was getting at the time,” Mr. Money said. “It was on par. I did not have sticker shock. ” In the afterglow of his    fame, Mr. Giuliani could certainly ignite large rooms. Mr. Giuliani spoke at dozens of events with Zig Ziglar, a motivational speaker. Mr. Ziglar’s daughter, Julie Ziglar Norman, who traveled with her father in those years, said Mr. Giuliani was a crowd favorite, along with her father and Colin L. Powell. “I know everybody always loved what he had to say,” Ms. Ziglar said. “It was always very   American. And he was just beloved. That’s the best way I can describe him. ”'"}, "time": 1742628517.900552}