{"duration": 0.12450361251831055, "input_args": {"text": "'$23 How Deep Will 2016’s Blue Wave Be? Progressives Push Candidates, Issues Up and Down Political Ladder   Steven Rosenfeld / AlterNet Jason Morrison / CC BY-NC 2.0 \\nAs the 2016 election closes, progressives are on the frontline of the latest rallying cry by Democrats Hillary Clinton, Tim Kaine, President Obama and the rest of the party’s leaders to sweep Republicans out of office up and down the political ladder.It’s no secret the Clinton campaign, its surrogates and state party operations have built and unleashed a giant ground game, registering voters and urging them to turn out, with five times as many paid staffers as the GOP. But a parallel track is unfolding in progressive circles, where collectively, groups like Democracy for America, Progressive Democrats of America, Our Revolution and others are pushing, promoting, fundraising for and urging their ranks—even those who don’t like Clinton—to elect scores of other candidates and vote on statewide ballot measures to move a progressive agenda. \\n“I think there is growing confidence that we can win the presidential election. So that’s not new,” said Neil Sroka, spokesman for Democracy for America, which has endorsed 125 candidates . “What we have been focusing on are the down-ballot races, the U.S. Senate races that up until recently haven’t started getting a lot of attention. But also on city council races and state legislative races.”“On November 8, we can measure how successful the progressive political revolution has been,” said Shannon Jackson, executive director of Our Revolution , which grew out of Bernie Sanders’ campaign. “We have 105 progressive champions we are supporting. We have 31 different ballot races we are behind. We’re calling, we’re texting, we are organizing online. We are doing e-mails. We are assisting through our fundraising. We want to make sure they have the tools available to them so they can succeed.”In some cases, mainstream Democrats and progressive groups are supporting the same candidates and taking the same stances on ballot measures, such as pushing for health care reforms, raising the minimum wage and enacting campaign finance reform. But in other cases, the progressives are further to the left, embracing all forms of marijuana legalization, repealing the death penalty and opposing charter school expansion and anti-union right-to-work ballot measures. Donna Smith, executive director of Progressive Democrats of America , gave two examples illustrating these parallel tracks. \\n“PDA is intensely focused on electing Doug Applegate in California’s 49th Congressional District, where defeating Darrell Issa would be an added bonus,” she said, referring to a Republican who has repeatedly sought to undermine President Obama. “Applegate is a strong progressive who has been attacked by Issa on his progressive stands as highlighted by the PDA endorsement questionnaire. We have put substantial resources into that race.”“We are also backing Nanette Barragan, CA CD-44, where even in a relatively safe Democratic district we must push to make sure we elect the most progressive candidate with a solid, respected track record,” Smith continued. “Across the country we have focused on other congressional races where we can make real inroads and where we can still see hope for the policy agenda Sen. Bernie Sanders so brilliantly articulated during the presidential primary. The challenge has been to overcome some voter fatigue in areas where the coverage of the presidential contest has overshadowed many of these critical congressional races.” The open question for progressives like Smith, who want to see the political landscape reshuffled to the left, and also for the Clinton campaign, which is urging Democrats to retake congressional majorities and governors’ mansions, is how much attention will voters pay to down-ballot races? With Election Day quickly approaching, these groups are making every effort to engage them. This goes beyond the fundraising bonanza Paul Ryan unleashed when he groused that a Democratic Senate majority would put Sanders in the Senate Budget Committee chairman’s seat, which DFA and Our Revolution seized on to raise several million dollars online for their candidates. DFA, for example, is pushing its Washington and Colorado members to pay attention to their state senate races, because picking up one or two seats would shift the legislative majority from red to blue. “If you can get people volunteering and taking action to support a candidate for local state legislature, those votes will trickle up,” said Sroka, referring to the likelihood that people working hard for local races would end up supporting the federal candidates. “Also, there are some progressive Democrats who aren’t super excited about the presidential race, and so that’s okay.”“We want to make sure that there’s a space for everyone in the fight to November,” he continued, “because frankly, we need everyone’s help. So focusing on the Senate race in North Carolina, as one example, is another one that until recently folks weren’t focusing on [nationally]. We were paying attention to it, because it’s a place where people could take action, have a meaningful role and help the ticket as well.”Sroka said DFA and Our Revolution are coordinating, explaining that DFA has more on-the-ground experience and a better grassroots network at this stage of the campaign, while Our Revolution is more of an online community. Jackson agreed, saying many Sanders supporters needed to pause after the Democratic Convention but rejoined the fray after Labor Day. Raising $2 million in 72 hours after Ryan’s remarks showed how potent these progressives remain, injecting needed funds into dozens of races.“We want to make sure they have the tools available to them so they can succeed,” Jackson said. “From [U.S. House candidate] Zephyr Teachout in New York, from [U.S. House] candidate Pramila Jayapal out in Washington, from coast to coast. However you measure it, we are going to see progressive champions winning seats from school board to state senate to U.S. representatives and senators.” It’s hard to dissect all the factors that prompt voter registration and turnout. But registration for the 2016 election has closed in many states, with the number of registered voters across America breaching the 200 million mark for the first time. Meanwhile, ballots cast in early voting by registered Democrats are outpacing Republicans in many states at a comparable period before the 2012 election, according to media reports from Florida , North Carolina , Virginia , Colorado , and Arizona .“When we look at the early voting numbers, we go, hmm. Something definitely is going on. Something different from the past. But it’s very much on a state-by-state basis,” Sroka said. “What we do know is whether it is Florida or North Carolina or Nevada, Democrats are taking advantage of the organization structure they have on the ground this year in a significant way.” \\n  \\n“That kind of success… is a reflection of grassroots power,” he continued. “To get those kinds of numbers we are seeing with early voting takes contacts for volunteers, or contacts from the campaign. It’s reflective of the kind of ground game that the Democrats may have over Republicans looking at the country overall.”That ground game isn’t just coming from what’s called the coordinated Democratic campaign—the presidential and state party effort. In Nevada, big multi-ethnic unions like the Culinary Workers have been pushing voter registration for months and are now focusing on get-out-the-vote efforts. In California, the National Nurses United union and Sanders have been pushing a ballot measure requiring state government health programs pay the same price for drugs as the federal Veterans Administration, which would cut costs. That’s not the only health care proposal pushed by Our Revolution. Colorado will vote on creating a statewide single-payer system.Down-ballot candidates and statewide initiative measures often don’t get as many votes as the presidential campaign; people just skip them if they’re not sure, which means they can pass or fail by smaller margins. Jackson said he did not know the latest polling on all of the statewide measures pushed or opposed by Our Revolution. But on those where he did review recent surveys, Jackson said it looks like many progressive positions are going to win.That appeared to be the case with the California drug-pricing measure, another California proposal to repeal the state’s death penalty, measures in California and Washington calling for overturning the Supreme Court’s Citizens United campaign finance decision, the medical or recreational marijuana legalization measures (outside the South), minimum wage hikes in Maine and Washington, and opposing charter school expansion in Massachusetts. Our Revolution is also pushing an automatic statewide voter registration proposal in Alaska, where any resident who receives an annual oil industry dividend from the state—including 50,000 Native Alaskans—would be on voter lists.So while the mainsteam media coverage is centered on the Clinton campaign and its enlarged focus to retake the Senate and shrink Republican majorities in the House and state capitals, the efforts of progressive groups, working inside and outside of traditional Democratic circles, may determine how deep and wide 2016’s blue wave will be.'"}, "time": 1742561769.6618893}