{"duration": 0.05794095993041992, "input_args": {"text": "'KINSHASA, Democratic Republic of Congo  —   The bodies were still smoking Tuesday morning, hours after the sun had risen and the killers had driven off. They were charred beyond recognition, arms held up in agony, every piece of skin burned away. “It was the government who did this,” said Félix Tshisekedi, the son of one of Congo’s most popular opposition figures. “I have no doubt. ” A dirty war is shaping up on the streets of Kinshasa, Congo’s capital. In the past two days, at least 25 people from opposing sides of the political divide have been killed by machetes, gunshots, grenades or fire. The burst of violence has paralyzed one of Africa’s biggest cities and could be a harbinger of more bloodshed to come. An expression gaining currency here is “Toyebi indako. ” In Lingala, Kinshasa’s most widely spoken language, it means: I know your house. A crashing economy, Congo’s history of brutality, inescapable poverty and a huge unemployed youth population are all fueling the unrest. As one Western diplomat said on Tuesday, there is a lot of tinder lying around. But the spark is relatively straightforward: a presidential election. Or more precisely, the absence of one. According to the Congolese constitution, President Joseph Kabila, who has been in power for the past 15 years, is required to step down in December. But Mr. Kabila has shown no signs of doing that. There are no firm plans  —   or even a date  —   for the next election. Millions of new voters must be registered, funds need to be raised and an election calendar has to be agreed upon, but none of this has happened. So the questions spread. Is Mr. Kabila trying to delay the election as long as possible? Is he ever going to leave? On Monday, thousands of opposition supporters protested in a Kinshasa slum. The demonstration spun out of control when young men rampaged through different neighborhoods, burning down stores, ransacking banks and killing several police officers. The protesters seemed to reserve a special hatred for offices belonging to Mr. Kabila’s political party. At one, they punched a   hole through a solid brick wall, set fire to a giant picture of Mr. Kabila’s face and then helped themselves to desks, chairs, computers and   TVs. The revenge came about 18 hours later. According to witnesses, an army truck full of uniformed soldiers zoomed up to the headquarters of the Union for Democracy and Social Progress, a leading opposition party. The soldiers fired   grenades into the building and sprayed it with gunfire. By Tuesday morning, the bodies of three men lay on doors that had been ripped off their hinges to serve as stretchers. The three worked as volunteer guards at the opposition headquarters and had been inside the building when it was hit by the grenades. Beyond them lay the other victims, face up, in the rubble. Two other opposition headquarters were attacked, and all witnesses accused the army, though Congo’s government spokesman, Lambert Mende, vigorously denied its involvement. “The army’s not stupid,” he said. “What are they going to do, kill people while they’re wearing their uniforms?” In recent years, human rights groups have documented many instances of Congolese government soldiers killing and raping civilians. Mr. Mende said the government was committed to finding a solution to the election impasse and that it hoped a process called the “dialogue”  —   which opposition leaders called the “monologue”  —   would produce a compromise. Mr. Mende said that Mr. Kabila did not intend to stay in power but that he could not simply come out and say that. “When a president here in our country says ‘I won’t run again,’ even if he will be there for three months or one year, it will be three months or one year of anarchy,” Mr. Mende said. “It’s our culture. We need to have a chief plainly in charge. ” Étienne Tshisekedi, who at 83 is considered the grandfather of the opposition, said he would agree to delay the election under one condition: Mr. Kabila leaves in December. “If he doesn’t,” he said, “we will call on the people to take power themselves. ”'"}, "time": 1742628404.9366238}