{"duration": 0.04309892654418945, "input_args": {"text": "'Tuesday on NBC’s “The Tonight Show,” comedian Chris Rock offered details about the final party thrown at the White House by Barack Obama.  Rock described the scene to fellow “Saturday Night Live” alum and “Tonight Show” host Jimmy Fallon as having “died and went to black heaven. ” “Everybody was there,” Rock said. “It was like  —   whoa, the last party at the White House. First of all, have you been to the White House? It’s amazing. You walk in. You see these humongous portraits of the presidents everywhere you go, right? So I’m there, and it’s me and Jay Z, Beyoncé, Oprah  —   it’s like I died and went to black heaven. ” “There were a few white people there, too,” he continued. “You know, a couple  —   Kid Rock or somebody. And, somebody  —   Katie Couric, something. There was a couple. There’s a lot more now, I’ll tell you that. And so  —   there’s a lot more now. ” After “mingling,” as he described it, he talked about his encounter with   lady Michelle Obama. “At one point, it’s me and Michelle Obama just talking,” Rock explained. “I’m not really supposed to be alone with Michelle Obama. That’s not really my lane. I don’t know how to talk politics. And you now, Michelle Obama is like, ‘I don’t know what we’re going to do for the country,’ and we’re talking the election and stuff. ‘I don’t know what’s going to happen. This is such a crazy time.’ And I go, ‘You’ll be alright. ’” After telling her she’d be a candidate for a job on “The View” or “The Real Housewive,” Rock said she steered him back on she had to explain to him she was talking about the country. “Michelle Obama looks at me and was like, ‘I was talking about the country. I wasn’t talking about me. I was talking about the country,’” he added. “I’d never felt so stupid in my life. It’s like my GED flared up. ” Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742563701.4330883}