{"duration": 0.10551643371582031, "input_args": {"text": "'Event Chronicle Scorpio New Moon Meditation — Make This Viral! October 28 – November 1, 2016 \\nIt is time for us to come together and tell the universe “We Are Ready!!!” The upcoming period from Friday, October 28 through Tuesday, November 1 offers a wonderful chance for us to assert our free will and hasten the Event! \\nThis window begins and ends with what is known as a ‘Void Of Course’ (VOC) moon. This is when the moon is ‘between signs’; these are periods of immense occult importance, as the the anecdotes in the first link below demonstrate: \\nhttp://www.astrologybyjudithryan.com/void-of-course-calendar-2016 \\nThe second link helps to literally ‘fill in the gap’ regarding the second VOC which occurs as the calendar transitions from October to November on both sides of the Atlantic. Hence, this second VOC period crosses months and is not explicitly identified in either link. \\nThis period is often described in many cultures as a time when the separation between the physical and non-physical realms is much thinner. Hence, this is also time each year when light & dark forces do battle. This represents a key moment for us to reassert control of the plasma plane within the Solar System via a spoken declaration of our free will. The instructions are quite simple: \\n\\n1) Face – as closely as possible – toward the general direction of the Sun, Moon, Galactic Central Sun, and the important light stronghold of Antares during all three meditations. A general rule of thumb is to direct your gaze a bit to the left of where the sun is (or would be if you could see it through either clouds or the ground below) at all three key meditation times. \\nNote – if it is not possible to face the direction of the Sun/Moon/GC/Antares, please focus your intention instead on the first image of the woman at the beginning of this article; this picture can inspire each of us to reach toward the goddess energies of the Galactic Central Sun – beckoning them to come quickly into our Solar System. \\n2) Follow the regular ‘Ascension Meditation’ instructions at three separate times: \\nA. 4 PM GMT Friday, October 28 (during the first VOC period) \\nB. 4 PM GMT Sunday, October 30 (the actual day of the Scorpio New Moon) \\nC. 3 AM GMT Tuesday, November 1 (during the second VOA period) \\nFor those seeking a refresher, the instructions can be found at the first link below, and an English-language guided-meditation audio can be found at the second link below (A “P.S.” statement regarding the guided meditation audio can be found at the end of this article): \\nhttp://recreatingbalance1.blogspot.com/2016/09/weekly-ascension-meditation-guided-audio.html \\n3) Speak the words below aloud after the end of the guided meditation audio – note that you will be speaking these words with no other sounds – just your true voice expressing your free will: \\nWe, the awakened starseeds of Gaia, announce our readiness for the pulse of Goddess energies from the Galactic Central Sun to bring an end to spiritual duality. \\nWe declare our desire for a peaceful transition to the Golden Age and a speedy end to this final galactic war in our solar system – for peace, abundance, and happiness to be present throughout our solar system forever more. \\nWe demand an end to any further delays to the Event: that all remaining secrets of the dark forces be made known immediately, that all dark rituals from this day forward be rendered ineffective, and that all tactical advantages which are used to maintain Quarantine Earth be nullified so that the Ascension of Gaia and her inhabitants can commence. \\nIt is our free will that the effects of biochips, implants, and scalar interference cease completely so that our fellow Lightworker & Lightwarrior Starseeds fully awaken to their respective missions and assist in leading the way into the Golden Age. \\nThe time for our freedom is now. We use the energies of this Scorpio New Moon to announce our desire for liberation, abundance and First Contact. \\nLet the Goddess finally bring peace to Earth and the galaxy. \\nSo be it, and so it is. \\nWe demand peace. We demand the Event. Let us make our free will known throughout the cosmos. \\nVictory of the Light! \\nP.S. The guided audio track at the “Recreating Balance” blog is highly important for many reasons. Foremost, the evolution of modern communications is such that English ends up being the most universally spoken & understood language in the world. Let all of us Lightworkers and Lightwarriors use that to our advantage… there’s a reason Cobra writes his blog posts in English. \\nAdditionally, the audio was recorded in 432 HZ and contains healing codes which lend energetic support and focus for the intention of the meditation. \\nFor the audio please go to Event Chronicle Share:'"}, "time": 1742564316.4206343}