{"duration": 0.049427032470703125, "input_args": {"text": "'White House press secretary Sean Spicer suggested that the media was downplaying the news revealing that former President Obama’s national security advisor Susan Rice unmasked the identities of Trump campaign aides during the 2016 election. [“I’m somewhat surprised in terms of the level of interest that I’ve seen from the press corps, one set of developments versus another set of developments,” Spicer said during the White House press briefing on Monday.  Since President Donald Trump accused former President Obama’s administration of spying on his campaign staff, journalists have demanded evidence to back up his claims. Spicer suggested that the media was approaching the issue with a double standard after Rice’s activity was exposed. “I’m somewhat more from a media standpoint somewhat intrigued by the lack of interest that we’ve seen in some of these public revelations and reporting that has gone in that direction that we’ve seen in some of the other directions that we’ve seen,” he said. Spicer declined to comment about the new revelations, citing the ongoing investigation. “There’s a troubling direction that some of this is going in, but we’re going to let this review go on before we jump to it,” he said. In the aftermath of the news, some reporters suggested that Rice was merely doing her job by unmasking Trump’s National Security Advisor Michael Flynn. “If victim Flynn hadn’t been ‘unmasked’  —   would Trump had fired him? Would it be better to have ‘masked’ man Flynn running NSC?” New York Times reporter Glenn Thrush asked on Twitter. “’Unmasking’ sounds better than ‘we picked a national security adviser who was on the payroll of 2 other countries. ’” Trump has not reacted to questions about the revelations in the press and has not shared his opinion about the news on Twitter. Spicer said that the administration would not try to assign a motive to Rice’s reported behavior, but wait to see the results of the investigation. “We’re not going to start going down guessing the motives of something that is not assumed in fact yet,” he said.'"}, "time": 1742563646.1845307}