{"duration": 0.0476994514465332, "input_args": {"text": "\"Thu, Oct 27th, 2016 at 9:02 pm It's amazing how often a microphone can be the root of a presidential candidate's troubles. Share on Twitter Print This Post \\nIn an interview with Bill O’Reilly on Thursday, Donald Trump was again asked about the ‘Access Hollywood’ tape in which the Republican nominee was caught bragging about sexually assaulting women. This time, though, he put up a new defense strategy, at least when it comes to this particular issue – blame the microphone. \\nWhen asked by O’Reilly if he thinks he would be winning the election if not for the release of the video, Trump once again repeated that it was only “locker room talk,” and then started complaining that a microphone shouldn’t have been allowed to capture his comments. \\nShockingly, he did not express any regrets for his language. \\nVideo: \\n— Sean Colarossi (@SeanColarossi) October 28, 2016 \\n“It was locker room talk. The microphone was not supposed to be on … it was an illegal act that was NBC. It was not supposed to be on… that was a private dressing room.” \\nIt’s amazing how often a microphone can be the root of a presidential candidate’s troubles. \\nIt should also be noted that Trump’s complaint about his dressing room privacy being breached is particularly rich given his history of storming into the dressing rooms of teenage pageant contestants, some as young as 15 years old. \\nWhen asked by O’Reilly if he would take legal action against NBC’s role in uncovering and releasing the tape, Trump said, “You’ll see.” \\nAll of this comes after Trump recently promised to sue the growing number of women who have come forward saying that they were sexually assaulted by him. \\nTrump also spent an absurd amount of time in the interview complaining that the media is rigged (not true), voter fraud is widespread (false), and the polls are dirty (they’re not). \\nEven in the right-wing safe haven that is Fox News, Donald Trump still managed to prove himself as dangerously unfit to be president.\""}, "time": 1742562327.5588148}