{"duration": 0.03139495849609375, "input_args": {"text": "'In a bizarre scene that could have been lifted from a Francis Ford Coppola film, the son of Sicilian Mafia boss Totò Riina returned to his native town of Corleone to stand as godfather in his niece’s baptism, an act now denounced by the local bishop. [Salvo Riina, who was released from prison in 2011 but prohibited from returning to Sicily, obtained special permission from the court to attend his niece’s baptism in his native town of Corleone, and furthermore convinced a Catholic priest in Padua to issue a declaration that Riina is a practicing Catholic in good standing and therefore a suitable godfather for the child.  On learning of the gangster’s role in the baptism, the bishop of Monreale, Michele Pennisi, stated Wednesday: “Neither I, nor the offices of the Curia were informed. Allowing the son of Riina to be the baptismal godfather was an imprudent and reprehensible choice, which I do not approve. ” The baptism was performed last December 29, but the circumstances only recently came to the attention of Bishop Pennisi, who is one of Sicily’s most vocal critics of Cosa Nostra, the local branch of the Italian Mafia. Salvatore “Totò” Riina ruled over Cosa Nostra from the early 1980s through the dramatic period of the early 90s, when he notoriously ordered the assassination of two antimafia prosecutors, Giovanni Falcone and Paolo Borsellino. He was eventually arrested in 1993 and is serving several life sentences in an Italian   prison. Riina’s youngest son Giuseppe Salvatore (“Salvo”) reportedly killed his first victim before he turned 20, and was later arrested in 2002 and sentenced two years later for crimes of Mafia association, extortion,   and money laundering. Salvo Riina was released in 2011, but the district   prosecutor of Palermo forbade Riina from returning to Sicily, saying he had never interrupted his relations with Cosa Nostra. Since then, Riina has lived in the norther Italian city of Padua. The bishop of Monreale said he understood why the local priest accepted Riina as godfather for the baptism, since he had presented a valid certificate from his local pastor, “still, I will not change my mind about what happened,” he said. Bishop Pennisi recalled that the godfather “must be the guarantor of the faith and must give witness with his actions. ” “And I am not aware that the young man has ever expressed words of repentance for his conduct,” he said. Bishop Pennisi has announced that soon he will carry out a pastoral visit to Corleone. “We need clear words about the mafia,” he said. “Certain episodes are no longer tolerable. ” Follow Thomas D. Williams on Twitter  Follow @tdwilliamsrome'"}, "time": 1742628434.9156353}