{"duration": 0.09725785255432129, "input_args": {"text": "'The commander of a Brooklyn police precinct has apologized for remarks he made to the media and at a local community meeting last week in which he played down a recent surge in rapes in his neighborhood, saying most were date rapes, not “true stranger rapes. ” In a post on Twitter on Monday afternoon, Capt. Peter R. Rose of the 94th Precinct in Greenpoint said, “I deeply regret the statements I made last week about rape,” adding that his comments “were not meant to minimize the seriousness of sexual assault. ” “Every rape whether it is perpetrated by a stranger or someone known to them is fully investigated,” Captain Rose wrote. “We make no distinction in our response. ” The apology came days after the officer was quoted in an article on the local news website DNAinfo. com about an increase of sexual violence in the neighborhood of Greenpoint, where there were eight reported attacks or attempted attacks in 2015 and 13 last year. Of last year’s cases, three led to arrests, but 10  —   including two allegedly by taxi drivers on young female passengers  —   remain unsolved. In the article, which appeared on Friday, Captain Rose told DNAinfo. com that while every rape should be investigated, the spike in reported assaults was “not a trend that we’re too worried about” because many of them had been committed by acquaintances of the victims. “If there’s a true stranger rape,” Captain Rose went on, “a random guy who picks up a stranger off the street, those are the troubling ones. That person has, like, no moral standards. ” Not long after the interview, Captain Rose elaborated on the unsolved sex assault cases at a meeting of the 94th Precinct community council, where he said some of the attacks had involved   of the victims and others hookup apps like Tinder and thus were “not   rapes where strangers are being dragged off the streets. ” He added that the cases remained open because the victims refused to cooperate with investigators and in some cases left New York for their homes in other states. Both of his comments set off a firestorm of criticism from public officials and advocates for victims of sexual assault who condemned Captain Rose for perpetuating the idea that rapes committed by those who know their victims are somehow less troubling than those committed by strangers. “Rape is rape,” Eric Phillips, a spokesman for Mayor Bill de Blasio, said in remarks published on Friday in a separate article on DNAinfo. “The crime merits no moral qualification and does not involve shades of criminality or degrees of danger. ” The same day, Stephen Davis, a spokesman for the New York Police Department, issued a statement saying, “Captain Rose’s comments did not properly explain the complexity of issues involved with investigating rape complaints. ” The statement added: “All complaints of rape and other types of sexual crimes are taken seriously whether they are committed by domestic partners, acquaintances or strangers. ” Then on Monday, the city’s new police commissioner, James P. O’Neill, wrote a rare opinion article in The Daily News in which he called Captain Rose’s comment “insensitive” and said that they had “left the misleading and inaccurate impression that the N. Y. P. D. treats these types of cases differently. ” Commissioner O’Neill continued: “We do not, either as a matter of policy or practice. ” In his article, the commissioner also said that only some rape victims report their attacks to the police, and he detailed a number of steps that the department has taken in recent years to change that. Those steps, he said, included collaborating with victims’ advocates, sponsoring poster contests on college campuses to encourage students to report rapes and assaults, and creating a hotline so that victims can directly call the detectives who investigate such crimes. Commissioner O’Neill did not say whether Captain Rose would face any disciplinary action. Reports of sexual assault have greatly decreased in the last 20 years. Quoting federal crime statistics from 2010 to 2014,  the Rape Abuse Incest National Network said seven in 10 rapes were committed by someone known to the victim. That was the argument of two dozen demonstrators who gathered in the snow on Tuesday outside the 94th Precinct station house to protest Captain Rose’s statements, with signs reading “Take Rape Seriously” and “Rape Is Always a Crime. ” “It is an outrageous idea that acquaintance rape matters less  —   it isn’t just bad policy, it’s bad law enforcement,” Jane Manning, the director of advocacy for Women’s Justice NOW. “Most rapists target women they know because they’ll have a better chance to get away with it by claiming consent. “The idea that acquaintance matters less is pervasive in our culture,” Ms. Manning added. “Captain Rose was unfortunately saying something out loud that many, many people already believe. ”'"}, "time": 1742563810.8487377}