{"duration": 0.11390829086303711, "input_args": {"text": "'Drew Stratton November 19, 2016 Prep Blog Review: About Living Off-grid \\nPeople today have become overly dependent on energy and this is the main reason why starting living off-grid seems difficult. But it is not. Think about the fact that people lived before the grid even existed. \\nAs we all know, an EMP attack is a disaster most of us are preparing for. When our electricity driven society will suddenly fall, how long will you survive? \\nFrom today’s Prep Blog Review you will find out how it is like to live off-grid for 37 years, how to build a faraday cage or how to build your off-grid cooking stove. Confessions Off A Man Who Lived 37 Years Off-grid \\n“Imagine if you can, a homestead nestled deep in the forest, fronting a beautiful lake. Oh sure… that sounds dreamy and might be reality for a lucky few. \\nBut now let’s take it a step further. The homestead sits on the shore of a remote, pristine lake which is located 100 miles in the wilderness. \\nNo roads, no trails, no neighbors. Only forest, water, animals and silence. Float plane is the only way in and out. When the float plane drops you off, accelerates down the lake, lifts off the surface and becomes a speck on the horizon, you then realize your last physical connection with humanity just left. \\nStanding on the dock, you have the overwhelming sense you are the only person left on the planet. Exciting!” \\nRead more on Ask A Prepper . The Smokeless & Easy-To-Build Off-Grid Cooking Stove \\n“Outdoor cooking is a major part of my off-grid experience, and so a reliable outdoor stove was a must-have. And with many options of wood-burning stoves out there, fuel-efficiency and minimal smoke were at the top of my list. \\nAfter much research, the rocket stove because our outdoor stove of choice. In this article, I will share with you the concept of the rocket stove, how we built two of them, and its advantages and disadvantages. \\nA wood-burning smokeless stove sounds impossible, right? Let me explain it this way. Smoke is un-burned fuel. The rocket stove makes use of all the fuel. Everything gets burned in the combustion chamber before leaving the chimney. This concept is also seen in the Dakota fire pit. \\nThe rocket stove, when fired up, sounds similar to that of a rocket taking off – hence, its name.” \\nRead more on Off The Grid News . How To Build A Faraday Cage To Protect Your Electronics \\n“One of the things that gives us the most troubled sleep of all is the risk of, and outcomes from, an EMP attack on the US. In case you’re not fully up to speed on this draconian danger, we discuss EMP attacks – what they are, how fearsome their impacts would be, and how easy they are to stage – in several articles here. \\nOur sense is that the danger of an EMP event is steadily increasing. To be blunt, the world is becoming an increasingly unfriendly place, and with growing sophistication of both nuclear weapons and their associated delivery systems (ie missiles) by both North Korea and Iran (as well as other countries that aren’t being quite so public about their actions) and some threats that translate quite clearly to ‘if we need to, we’ll use an EMP device to bring your country to its knees’, the thought of an EMP attack is far from impossible to countenance. \\nAt the same time, our lives continue to become more and more dependent on electronics for everything we do.” \\nRead more on Backdoor Prepper . 10 Widespread Disaster That Could Happen At Any Time \\n“When preparing for a widespread disaster, it’s helpful to have a specific type of disaster in mind. Envisioning a particular survival scenario helps you to be more focused and think of preparations that might not have occurred to you otherwise. \\nHow would a pandemic play out in your town? Or a terrorist attack? Or an economic collapse? What specifically would happen to your community, and how would it affect you and your family? And based on that, are there any other preparations you could make to ensure your family’s safety? \\nAs you can see, mentally walking yourself through various types of disasters will help you to be more prepared. With that in mind, here is a list of the 10 most likely widespread disasters. You should seriously consider the possibility of experiencing these events. I’m not saying you should obsess over them–don’t spend your life in fear–but you should do your best to be ready for them.” \\nRead more on Urban Survival Site . Starting Your Off-grid Living With Solar Power \\n“Harnessing the sun’s power has become a popular trend in the last ten years and we now have a large array of options for powering our homes using solar power. \\nLiving off the grid requires a lot of work and innovation in order to reach a certain level of self-sufficiency. Things get easier if you are able to harness the power of the sun and use it for all your needs. \\nFrom passive cooling to batch solar water heaters, everything is now available when it comes to DIY solar power projects. \\nPeople are beginning to understand that solar power is not as complicated as certain individuals would want you to believe. \\nThis is a technology that has become extremely accessible in our modern times and you just need a few basic skills in order to make your own project.” \\nRead more on Prepper’s Will . \\nYou can generate power and keep your loved ones safe with the right power generator. You can choose your right now. \\nThis article has been written by Drew Stratton for Survivopedia. 49 total views, 49 views today'"}, "time": 1742563764.0351908}