{"duration": 0.03178048133850098, "input_args": {"text": "'Japan’s Prime Minister Shinzo Abe has arrived in Washington for a long day of talks with his American counterpart President Donald Trump, which the pair will follow with a casual visit to Trump’s    estate in Florida. [A senior Trump administration official told reporters Thursday that Abe’s stay in Florida will involve some business discussions, but will largely consist of “a fair bit of golf” and a chance for Trump and Abe to bond personally, and in so doing strengthen the bilateral relationship between America and Japan.  On Friday, the official said, Abe will “have a conversation [with Trump] that’s going to cover a very wide range of subjects dealing with the bilateral relationship, the security piece of the relationship, as well as the economic, and also talking about matters of mutual interest regionally and globally as well. ” The two will join other senior officials for a “working lunch” and end the day in Florida. “Prime Minister Abe is well acquainted with President Trump’s priorities, which you could sum up in three words: jobs, jobs, jobs,” the senior official noted, responding to reporters’ questions on the content of their talks by noting that economics will likely take up most of their time. While regional national security threats, like China’s colonization of the South and East China Seas, are priority issues for the two world leaders, the official stressed that Japan’s territorial claim in the East China Sea “is really something that I would not expect to see addressed in this visit. ” The meeting will take place following an unexpected phone conversation between Trump and Chinese President Xi Jinping, the first such conversation between the two world leaders. While the Chinese government has been repeatedly threatening Japan to cease seeking support abroad against the Chinese colonization of the Senkaku Islands, reports indicate the topic did not surface when Trump and Xi spoke, the two instead agreeing on the Chinese position dismissing the sovereignty of Taiwan, the “One China” policy. The official added that President Trump “believes he can get the measure of the people through more informal settings” and will likely “from time to time” invite other world leaders to spend time with him at   . Abe was the first world leader to meet with Trump in November following his election victory and has expressed extreme confidence in the Trump White House. He has also taken the lead globally in forging bonds with new populist leaders, spending a weekend at the humble home of Philippines President Rodrigo Duterte last month. Duterte appreciated the visit enough to lend the Prime Minister what Philippine officials described as the president’s “favorite mosquito net. ” While Trump has long maintained a reputation for being a fan of golf, Japanese media have suggested that it was Abe’s suggestion that led to the scheduling of a golf summit. “During a phone conversation late on Jan. 28, Abe told Trump that he would like to play golf with the president one day,” the Japanese newspaper Asahi Shimbun reported on Friday. “Trump suggested they play a round a day after their Feb. 10 meeting in Washington. ” Asahi notes that Abe’s grandfather, Prime Minister Nobusuke Kishi, also played a game of golf with his American counterpart, Dwight Eisenhower. ” Abe appeared to confirm the Asahi report that golfing was his idea before boarding his plane in Tokyo. “He [Kishi] once told me, ‘When I saw President Eisenhower become upset about missing a putt right in front of me, I felt the distance between us had suddenly grown much closer,’” Abe told reporters. “I hope to build a strong relationship of trust (with Trump) outside of work. ” That relationship, the Japanese publication Mainichi Shimbun notes, appears to weigh heavily on the Abe administration. The newspaper quotes a senior official saying that Abe described the use of leisure to build a “close friendship” with Trump as “the only option available,” despite criticism from opposition party officials that Abe should stick to business with the U. S. president.  '"}, "time": 1742628444.3730536}