{"duration": 0.11834716796875, "input_args": {"text": "\"Comments \\nRepublicans often talk about yard signs in their neighborhood as proof of their candidate’s fitness for office, but a photograph of one Florida resident’s Trump sign with lynched black people hanging from a tree has gone viral. It’s a terrifying reminder of the pervasive racial hatred pitched by Donald Trump’s new Republican Party, which he normalized by accepting the endorsement of former KKK chief David Duke and by leading the “alt-right” movement to Make America Discriminatory Again. \\nMiami’s New Times reports : There needs to be a hell of a lot of hate in your heart to think lynching people on Halloween is funny. And yet, here we are, Miami. A homeowner in Three Lakes, a small community in suburban Kendall, is celebrating the holiday by lynching two black-looking dummies in his or her yard. It’s also impossible to ignore what’s just in front of the display on the same lawn: A “Trump/Pence 2016” sign. \\nThe two men are faceless, but their skin appears to be dark. They’re each wearing traditionally “hip-hop” clothing: One of the dead men has a sports jersey on and a crooked baseball cap, and the other has his pants sagged low. Black activists have been circulating the photos on Facebook all day and calling for a quick response from the neighborhood. The community’s property manager, Orelys Canas, tells New Times they’ve contacted the homeowner and asked him or her to remove the installation. \\nAfter the story went viral, the homeowner contacted the local news to pretend that his lynching display was actually some form of tolerance. They also claimed that the Trump/Pence sign didn’t even belong to them, but other tipsters made it clear that the entire display clearly depicted a lynching scene with a Trump sign. \\nTrump supporters instantly bombarded the news editors who published the chilling photos: Well it took exactly ten minutes for a guy to suggest Hillary planted the lynched black dummies at a Trump supporter's house #wakeupsheeple pic.twitter.com/MbIoC0PQds \\n— Tim Elfrink (@timelfrinkmia) October 28, 2016 \\nIt’s unconscionable that anyone would present a mock lynching in their neighborhood and portray it as anything other than an act of racial hatred. Shamefully, the Republican Party and their dreadful presidential nominee Donald Trump have done everything within their power this year to normalize racism and bigotry. \\nThis is the end result:\""}, "time": 1742562714.477399}