{"duration": 0.07604169845581055, "input_args": {"text": "'posted by Eddie “Beer adds longevity and strengthens bones, whereas milk causes obesity, diabetes, and cancer.” – PETA Yes! You read it right. And this is not a hoax. People for Ethical Treatment of Animals (PETA) has approved in Madison, America’s Dairy Land that Beer is indeed healthier than milk. PETA is leaving no stone unturned in its campaign to promote ‘Beer over Milk.’ It’s noteworthy that, PETA is targeting youth and teenagers to become part of this campaign. It might be aiming at to save the animals, but the facts which PETA has shared about beer over milk are quite interesting. You might be thinking how come beer becomes healthier? Well, that’s one great story, my friend, and with the proofs which cannot be challenged. Last time when ‘beer’ took over food was in the 1930’s. The Great Depression got 100,000 people unemployed only in New York City, and the only thing which forced people to come out on the streets for something was the ‘paid jobs.’ And jobs were rare, and morale was low. In this time of struggle, the one thing which drove the masses to the streets of NY City was Beer . The reason behind the march was the government’s move to impose a tax on beer. At that time around early 1932, showman Jimmy Walker led the beer for taxation March, which became famous as “We Want Beer.” Since then, many researchers are working to make beer a household drink… And it seems like they’ve succeeded in making it one of the most commonly served drinks around the world. Today, if you’ll go to any bar and ask for a beer, you’d never have to hear a ‘No’ in the answer. Many ‘ Branded Beers ‘ are serving the purpose. Alcohol in moderation is good for your health. There’s nothing wrong with the consumption of alcohol if done in moderation. But there’s no sense in having dairy products that can harm your health. Moreover, it’s the animals who suffer most. Watch the one-minute video that we’ve for you in the climax of this story. Here’s how beer can help you. Consumption of dairy products is a matter of serious health issues like diabetes, obesity, excess-mucus, heart disease, etc. On the other hand, beer is known for saving bones from brittle, and according to Harvard Medical School, more than 100 prospective studies show that moderate consumption of alcohol can not only lower the risk of heart attack, but it can also prevent you from gallstones and Type 2 diabetes. Thanks to PETA for highlighting the research. It’s official: Beer is better than milk. A lot of social organizations and activists have accused PETA of promoting beer over milk and also for encouraging the younger generation to opt for it. In reply, PETA answered: we also recommend juices, soy, and mineral water, then why to create hype over beer? PETA organization added on their website: “Had we used soda instead of beer, there would have been no media interest in the campaign, of course. PETA urges everyone, beer-drinkers included, to drink responsibly. Where milk is concerned, there’s no such thing!” So, when’s your plan to go on a date with Beer? Drink beer, but drink responsibly.” Let me tell you one thing clearly; there’s nothing bad about beer if you know when to stop. Alcohol consumption is considered a bad habit and has been banned it in certain states as people consume it in excess which eventually leads to broken marital relationships, and domestic altercation. Beer is accepted worldwide, and the matter of concern is: how responsibly we consume it. So, let’s conclude it here and when you go out next time with your friends, drink beer sha. Source:'"}, "time": 1742563144.2424464}