{"duration": 0.031510353088378906, "input_args": {"text": "'Monday on his nationally syndicated radio show, conservative talker Rush Limbaugh maintained a House Intelligence Committee hearing that featured testimony from FBI Director James Comey and NSA Director Michael Rogers was meant to send a message to President Donald Trump and his administration.  Limbaugh argued that although there were some good questions from Republicans members during the hearing, it was meant to be a warning shot at Trump  —   allow Washington Republicans to run the town or face possible impeachment. Partial transcript as follows (courtesy of RushLimbaugh. com): These hearings today, what happened last week and the week before that, what happened during the transition period  …     What all of this is can be explained simply by saying, “Look at how terrified they are in the   York establishment, of Donald Trump and draining the swamp. ” The Never Trumpers on both sides of the aisle. There are conservative Never Trumpers today celebrating over the fact that Comey made it official that there’s an investigation of Trump and colluding with the Russians. These people know that there isn’t any evidence of this, but that doesn’t matter. What everybody in Washington supports is the smearing, the slander, and the libel of Donald Trump. And these hearings today? The FBI director, James Comey, is trying to save the jobs of a lot of people. He’s trying to save the careers of a whole lot of people  —   his included  —   in, I think, an inappropriate way. And the Republicans in this committee? Look folks, I’ve been waiting. I’ve been patiently waiting. I’ve been trying to hold it, keep the powder dry. But the Republicans on this committee  …     I know it’s early, and they’re gonna go on all day. But so far, outside of Trey Gowdy and a question from Peter King and Devin Nunes the chairman, there just hasn’t been much. For example, “Are you still investigating the Clinton Foundation, Director Comey?” “I can’t say. ” By the way, Comey said he got special permission to reveal this investigation. Who gave him that special permission? He said he went to the Department of Justice. Who’s over there? Who runs that? That it would be Jeff Sessions. The Trump administration itself granted permission for Comey to announce this today. (interruption) Well, no. My point there is that there’s no attempted   of anything going on there. The Trump administration could very well have said, Jeff Sessions could have said, “Comey, look, it’s just like you said last summer about Hillary: We don’t detail ongoing investigations. ” But he today was given permission to do just that, and he’s running with it. And the whole point of this today  —   and, by the way, it doesn’t mean I’m not gonna go through this and give you what the real news of these hearings is today and what the backdrop of all this is. Because there’s a really salient factor that’s driving this from the Democrat side that is never going to be reported or commented on, which I’m going to touch on myself today. But, as I say, the purpose of this is to further the narrative that Trump is illegitimate, that he should not be president, that his election was the result of tampering by the Russians. So the objective is that Trump either stops this reform business he’s got, stops this    stuff, and starts letting the Washington Republicans run the town again, or they’re gonna impeach him. That’s the message being sent today: “You either straighten up and fly right or you’re gone. ” “We’re coming for you,” is the message of these hearings today. Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742628609.06933}