{"duration": 0.035830020904541016, "input_args": {"text": "'You are here: Home / US / Biden Explains Why Hillary Set Up Her Email Server (This Doesn’t Help Her) Biden Explains Why Hillary Set Up Her Email Server (This Doesn’t Help Her) October 28, 2016 Pinterest \\nCrazy Uncle Joe is at it again. Vice President Joe Biden, and potentially secretary of state should Hillary Clinton be elected (let that sink in for a minute), claimed that Clinton didn’t understand “the gravity” of using private servers to send and receive classified information as secretary of state. \\nSocial media users pointed out the obviously ridiculous nature of this defense, as many have throughout the whole email debacle. Clinton is either pathetically inept of dangerously corrupt — I’d argue that there’s a lot of both in the equation. Both options mean that she should be behind bars and not running for president. Interviewed by @jdickerson for @FaceTheNation , @VP says @HillaryClinton didnt understand \"the gravity\" of setting up own e-mail system. pic.twitter.com/abIZ1f0kvO \\n— Mark Knoller (@markknoller) October 28, 2016 So to quote Dave Chapelle: “I’m sorry officer I … didn’t know I couldn’t do that.\" https://t.co/a1mLeOv0KL \\n— Ben Howe (@BenHowe) October 28, 2016 \\nBen Howe of Red State quoted comedian Dave Chapelle: “I’m sorry officer I … didn’t know I couldn’t do that.” Ummm, she did it specifically to evade FOIA. I\\'m quite certain she \"understood the gravity\" https://t.co/nZK9EBQp27 \\n— The H2 (@TheH2) October 28, 2016 \\nTwitter user “The H2” pointed out that Clinton very likely understood the gravity just fine; it’s probably why she set up the servers in the first place. The H2 tweeted: “Ummm, she did it specifically to evade FOIA. I’m quite certain she “understood the gravity.” \\nAbsolutely. Clinton almost certainly set up the servers to “evade FOIA,” and the inevitable failures/corruption (such as the pay-to-play operation) she would need to cover up as secretary of state. \\nThe thousands of emails deleted from Clinton’s servers weren’t just yoga schedules and wedding planning — the State Department admitted there were Benghazi-related emails in there. \\nClinton is responsible for the deaths of four Americans in Benghazi, Libya on Sept. 11, 2012, and it is almost a certainty that emails pointing to her involvement were scrubbed — in addition to what we already know that points to her responsibility. She understood \"the gravity\" she just thought she could \"get away with it\" #Corruption #draintheswamp #newsisback https://t.co/TrN0xUSbaX \\n— Jesse Eaton (@landho69) October 28, 2016 \\nJesse Eaton tweeted: “She understood ‘the gravity’ she just thought she could ‘get away with it.\\'” \\nThat about covers it. She knew what she was doing, but since she also knows where all the bodies are buried she gets to play by a different set of rules. \\nWe found out that President Obama, using a pseudonym, communicated with Clinton via her private email server — not her state.gov address — even though he claimed not to know about the servers until the scandal came out in the press. Why would he do that if he thought things were on the up and up and didn’t know a thing about the private server? \\nThat might have been part of Clinton’s insurance here as well. She may have figured that if she goes down, so does Obama. That would be pretty stupid considering Clinton found out where she sat on the totem pole in 2008, but no one ever said the woman was a genius. \\nThe FBI announced on Friday that it reopened the investigation of Clinton’s email scandal, and hopefully Clinton will finally be brought to justice. Not likely, but who knows?'"}, "time": 1742628590.1704586}