{"duration": 0.05565762519836426, "input_args": {"text": "'President Donald Trump reassured supporters that he was still planning to build a wall in his first term as president, despite reports that he was willing to drop wall funding during FY2017 budget negotiations. [“I don’t know what people are talking. I watch these shows, and the pundits in the morning. They don’t know what they’re talking about. The wall gets built, 100 percent,” Trump told reporters at the White House Tuesday.  Reporters asked Trump if he would sign a continuing budget resolution if it didn’t include funding for the wall. “The wall’s going to get built, folks. In case anybody has any questions, the wall is going to get built,” Trump replied. He added that construction for the wall would start “soon. ” “We’re already preparing. We’re doing plans, we’re doing specifications, we’re doing a lot of work on the wall, and the wall is going to get built,” he added. Democrats seized on reports that Trump said during a meeting with conservative media on Monday that he could get funding this week or in September budget negotiations for FY2018, as a sign that he was caving on his priorities. Senate Democrats insist that they will not support any budget that includes wall funding. White House Press Secretary Sean Spicer insisted that nothing had changed in the president’s priorities. “No one said ‘delayed,’” Spicer said, when asked if the president was willing to delay wall funding. Behind the scenes, White House aides are reluctant to play “shutdown theater” with Democrats, telling reporters that they are not going to negotiate budget deals with the Democrats through the media. Spicer did not say whether funding for the wall was a firm requirement for the president’s budget, suggesting to his opponents that it was open to interpretation. “I don’t think anything has changed,” Spicer said, adding that discussions were ongoing with both houses of Congress. The wall, he insisted, would be built, but he did not offer a construction timetable. “It’s not a question of wait until the fall. I think that there’s a lot of things that have to happen,” Spicer said. “It’s like any construction   …     we will take the first steps now and we will continue to seek funding through the FY2018 and further budget to make sure that it’s completed. ”'"}, "time": 1742562214.4224484}