{"duration": 0.13747835159301758, "input_args": {"text": "'WASHINGTON  —   In recent days, Sri Lanka, Zimbabwe and South Africa joined the growing list of countries hunting down tax evaders among citizens who own offshore accounts. The French bank BNP Paribas said it would shut its Cayman Islands branch. In Pakistan, a cricketer turned politician who had attacked the prime minister over his family’s offshore accounts admitted that he, too, had used a shell company. And the Group of 7 nations, meeting in Japan, agreed to crack down on illicit finance. It was the latest fallout from the Panama Papers, the largest leak of secret documents to journalists in history. In the eight weeks since the publication of the first articles by some 370 reporters in 76 countries, an effort organized by the International Consortium of Investigative Journalists, the impact of the revelations on the shadowy world of offshore finance has been striking  —   even as prospects for   reform remain uncertain. Investigations are underway in dozens of countries, including the United States. Proposed laws requiring disclosure of the true owners of offshore companies to tax collectors or to the public have new momentum. Cartoonists have had a field day, reflecting the widespread anger and disgust pressuring governments to act. “The reaction around the world has been pretty spectacular,” said Gabriel Zucman, an economist at the University of California, Berkeley, who has estimated that 8 percent of the world’s personal wealth is hidden in tax havens. “The demand for financial transparency and tax reform is really growing. It’s the first time there’s been public outrage at the global level on these issues. ” The disclosure by an anonymous leaker of 11. 5 million documents from a Panamanian law firm at the center of the offshore industry to a German newspaper was a landmark in another way as well. It was the latest and biggest in a series of recent megaleaks, establishing the   unauthorized disclosure of government and corporate secrets as a contagious phenomenon that is unlikely to go away. Since 2010, when a   intelligence analyst in Iraq copied thousands of classified files onto CDs labeled as Lady Gaga songs and gave them to the antisecrecy organization WikiLeaks, it has become clear that technology has revolutionized leaking. Pfc. Chelsea Manning, then known as Bradley, disclosed hundreds of thousands of diplomatic cables and military field reports. In 2013, Edward J. Snowden, citing Private Manning as an inspiration, gave a similar number of highly classified National Security Agency documents to a few journalists. About a year ago, a     using the name John Doe contacted Bastian Obermayer, a reporter for the newspaper Süddeutsche Zeitung in Munich, and eventually passed to him a far greater volume of material from the Panamanian law firm Mossack Fonseca: The trove totaled 2. 6 terabytes, more than 1, 000 times the size of the Manning files. In a subsequent manifesto issued by way of the German newspaper, John Doe cited the precedent of Mr. Snowden, who he said deserved “a hero’s welcome. ” Trevor Timm, the executive director of the Freedom of the Press Foundation, which supports what it calls transparency journalism, said the impact of each leak had inspired the next leaker. “Especially with the Panama Papers, I think it’s now a trend,” Mr. Timm said. “When people inside organizations see the impact that   on this scale can have, they follow that example. ” None of this would have been conceivable in the photocopier era, when the Panama Papers would have required a fleet of   to deliver. “These are disclosures not of documents but of databases  —   entire libraries,” said Steven Aftergood, who tracks government secrecy for the Federation of American Scientists. John Doe’s manifesto was tellingly titled “The Revolution Will Be Digitized. ” Of course, what many advocates cheer, the organizations exposed by the leaks denounce. In a series of statements, Mossack Fonseca has criticized journalists’ use of “information stolen from our files,” asserted that news reports “misrepresented the nature of our work” and threatened legal action. It is not clear whether John Doe is a disgruntled insider or a hacker who broke into the law firm’s files, as the firm has suggested. The same tools that are being used by activists and journalists for what they consider to be   purposes can be used by others. Hackers stole nude photographs from celebrities’ Apple accounts in 2014 and posted them on the web. A computer   later that year, attributed to North Korea, obtained hundreds of Sony Corporation emails, many of which were made public. The hacker group known as Anonymous has released voluminous email files of two security firms, Stratfor and HBGary Federal. For Mr. Obermayer and a colleague at Süddeutsche Zeitung, Frederik Obermaier, the fact that anonymous companies created by Mossack Fonseca were being used to evade taxes and launder illicit money justified publication. They shared the Panama Papers with the international journalists’ group to bring strength and local expertise to the data. When the articles were published, their newspaper’s web servers crashed from the initial volume of readers. Mr. Obermayer said it was “a really strange feeling  —   that something that started with you has led to mass demonstrations in several countries. ” Within days, Iceland’s prime minister, whose offshore company was revealed by the papers, had stepped down. So had a Spanish government minister, an Armenian justice official and a member of the ethics committee of FIFA, the world soccer association. President Vladimir V. Putin of Russia, whose friends had moved $2 billion through offshore companies, denounced the disclosures as an American plot to smear his country. A Mexican cartel suspect was arrested in Uruguay at an address disclosed in the documents. Sierra Leone began to investigate mining contracts. The Swiss police raided the European soccer headquarters. The art market was rocked by revelations of subterfuge in the sale of valuable paintings. The list went on. In the United States, the revelations of hidden wealth have resonated amid growing public concern about economic inequality the word yacht appears in the documents 19, 380 times. President Obama has deplored how the rich and some companies are “gaming the system,” as he said the documents showed, and has proposed multiple reforms. In fact, some experts believe the “Panama” label is misleading, obscuring the central role of several states, including Delaware, Wyoming and Nevada, in registering companies with hidden ownership. Mossack Fonseca probably represents just 5 or 10 percent of the industry creating anonymous companies, Mr. Zucman of Berkeley said, so the disclosures have left the vast majority hidden. And no matter where shell companies may be registered, he said, much of the wealth they own is invested in the United States, in real estate, stocks and bonds. “The U. S. could find out who the true owners are,” Mr. Zucman said. But the United States may illustrate the difficulty of moving from splashy revelations to serious change. States with a stake in the lucrative corporate registration business are likely to resist serious changes, and Congress appears unlikely to act anytime soon on comprehensive reform bills. “The offshore system is incredibly resilient, with a ton of smart lawyers and accountants to find new ways to hide money,” said Marina Walker Guevara, the deputy director of the international journalists’ consortium. David Marchant, the editor of OffshoreAlert, a news site that covers offshore finance, called the Panama Papers “an extraordinary event” that dwarfs past exposés of the industry. A session on the leak at the annual OffshoreAlert conference in Miami this month grew heated, he said, as champions of transparency debated industry players who said privacy had been trampled. Mr. Marchant said he believed the reform push from the leak would fade. “The people using the offshore system to evade their financial responsibilities tend to be very wealthy and influential people,” he said. He predicted that any changes in laws and regulations after the disclosures would be “mostly window dressing. ” On the other hand, Mr. Marchant said, the example of John Doe will probably be followed by other leakers. “This is the age we live in,” he said. “This record will be broken before long. ”'"}, "time": 1742563764.1765194}