{"duration": 0.044966697692871094, "input_args": {"text": "'Conservative commentator Sonnie Johnson slammed progressive politics for hurting black business owners and wrecking families in a fiery Feb. 23 CPAC speech at the National Harbor. [“What if I told you I actually agree with Black Lives Matter? What if I told you institutionalized racism is real in America?” Johnson said, describing how progressive president Woodrow Wilson believed America would be better “if the races were segregated. ” She continued:  What if I told you institutionalized racism was real in America and came through a president named FDR? What if I told you that minimum wage [laws] was to protect white jobs from black workers, through unionization? That actually happened in this country. What if I told you that price controls put out by FDR actually bankrupted black farms? People who worked for themselves their entire lives were now forced to go to government and beg for welfare? What if I told you excessive taxation and regulation took these people that were   slaves already  …     and crushed those businesses? “What if I told you that white supremacy is real in America, and it came with the very first gun law? That black people had no right to protect themselves from the KKK?” Johnson said to applause and appreciative “amens” from the audience. “What if I told you white supremacy was real in the form of Planned Parenthood?” Johnson continued to growing applause. Progressives put “Planned Parenthood centers right in black neighborhoods. ” “What if I told you white supremacism was real in the criminal justice system, because you have people that think they can change human nature by passing a law, and they realized that they could [bypass] the Thirteenth Amendment and still restrict you to slavery by convicting you of a crime?” All of these factors “culminated in a campaign of a   Woodrow   progressive,” Johnson said. “Who wants to push an FDR jobs program. Who loves Planned Parenthood. And who hasn’t met a gun law she didn’t like. And who ran on the Democrats’ side: Hillary Clinton. ” (“” the audience replied in unison.) “Every single aspect of systemic racism and white supremacy they have pushed remains on the Democratic side,” she said, later adding: “They came from the Democrat side and they remain on the Democrat side. ” Johnson concluded that she had a message to deliver to “those black families out there that are listening. ” “You have an option. You have a choice. I am not telling you this administration. I am not telling you this president. I am telling you this conservative ideology is your choice. I’m not telling you it’s fun. I am not telling you it is easy. I’m telling you in the end, it is worth it,” she said. “Every single drop is worth it. ” “So, before I go, it’s a battle with Black Lives Matter. Can we build our own damn army, please?” she said to wild applause.'"}, "time": 1742561878.6848724}