{"duration": 0.05740022659301758, "input_args": {"text": "'HOUSTON  —   In the   to Super Bowl LI on Sunday, politics has permeated the N. F. L. ’s shield to an unusual degree, with players, owners and even the league’s commissioner being asked about President Trump and his recent policy decisions. But in a news conference to discuss Sunday’s halftime show, Lady Gaga, one of the most outspoken pop stars and a vocal critic of the president, remained coy when asked if her performance would include any strong political statements. “The only statements that I’ll be making during the halftime show are the ones that I’ve been consistently making throughout my career,” Lady Gaga said. “I believe in a passion for inclusion. I believe in the spirit of equality, and that the spirit of this country is one of love and compassion and kindness. My performance will uphold those philosophies. ” She also did not divulge any details about what songs she would perform, what outfits she would wear, or if the bee emoji that she recently posted in a comment on Instagram was an indication that Beyoncé would be involved in her performance. But she did suggest the show would be one for her legions of fans who represent the margins of society. “That kid that couldn’t get a seat at the cool kids’ table, and that kid that was kicked out of the house because his mom and dad didn’t accept him for who he was?” Lady Gaga said. “That kid is going to have the stage for 13 minutes. And I’m excited to give it to them. ” She said the goal of the performance, which will include an introduction featuring her fans and her friend and frequent collaborator Tony Bennett, was to have a unifying message, but she understood that was a hard goal to achieve. “I don’t know if I will succeed in unifying America,” Lady Gaga said. “You’ll have to ask America when it’s over. ” Lady Gaga, 30, who was born Stefani Germanotta, has often seemed to seek out controversy, including stunts like wearing a dress made out of meat to the MTV Video Music Awards in 2010. She has embraced a persona as an outcast of sorts by labeling herself as Mother Monster and her fans as Little Monsters. But after criticizing Mr. Trump before the election, she has remained mostly quiet about him on social media since. On Twitter, where she speaks to an audience of more than 65 million people, she has shown support for the Women’s March on Washington and various other causes, but has not posted about Mr. Trump directly since Nov. 13. Considering her politically active nature and her vocal support of Hillary Clinton, Lady Gaga’s selection to perform at the halftime show was a somewhat atypical choice for the   N. F. L. Shortly after her selection, “Entertainment Tonight,” citing unnamed sources, claimed she would be prohibited from mentioning Mr. Trump during the performance, but in a statement at the time a representative for the league called that “nonsense. ” The history of the halftime show has been largely without controversy, progressing from marching bands to upbeat groups like Up With People and then safe pop acts like New Kids on the Block. The league was forced to try to mix things up when in 1992 the sketch show “In Living Color” staged an alternative halftime show on Fox that drew more than 20 million viewers and an estimated 10 rating points away from the official performance by Gloria Estefan at the game. The show’s   comedy appealed to younger viewers more than Ms. Estefan’s performance, in which she was joined by the figure skaters Brian Boitano and Dorothy Hamill. By 1993, the league had learned its lesson, and had Michael Jackson perform, and in the years that followed they had a string of other top performers including U2, Paul McCartney and Prince. While recent years have seen the league try to go for younger, possibly more relevant performers, the controversies have been few and far between. When the Red Hot Chili Peppers admitted to not having played their instruments live it qualified as a notable event. The one exception to the rule, of course, came in the halftime performance for Super Bowl XXXVIII in 2004, when Justin Timberlake infamously tore away part of Janet Jackson’s top, thus creating a new meaning for the term “wardrobe malfunction. ” It just so happens that the one controversial event happened at Reliant Stadium, which was renamed NRG Stadium in 2014 and will be the setting of Lady Gaga’s performance on Sunday. Lady Gaga insisted there would be no repeat of Ms. Jackson’s wardrobe malfunction, saying that everything would be “nice and tight,” but said she wanted to preserve the mystery of her performance. “There will be no meat dress there, so don’t wait for that,” Lady Gaga said. “Get excited to see something that you haven’t seen before. ”'"}, "time": 1742628431.7050676}