{"duration": 0.10616230964660645, "input_args": {"text": "'The executive director of the Association of American Physicians and Surgeons (AAPS) observes that any Obamacare health care replacement plan that attempts to implement “universal coverage” will suffer the same outcome as the Affordable Care Act (ACA) since the more “coverage” that is mandated, the less actual “health care” will be available. [Orient emphasizes what has ultimately been the demise of Obamacare. Its supporters say millions more have “coverage,” i. e. insurance cards, though many can’t afford its high premiums and deductibles.  “The reported success of the Affordable Care Act (ACA or ObamaCare) is based on enrollment numbers,” Orient explains. “Millions more have ‘coverage.’ Similarly, the predicted disasters from repeal have to do with loss of coverage. ” The physician continues that plans to provide universal coverage will result in “tens of thousands of deaths. ” In the fervor to keep Obamacare’s   conditions provision and the push further for universal coverage, Orient asks where the data are on the ACA’s actual impact: Where are the statistics about the number of heart operations done on babies born with birth defects, the latest poster children? How about the number of babies saved by this surgery, and the number allowed to die without an attempt at surgery —  before and after ACA? I haven’t seen them. Note that an insurance plan doesn’t do the operation. A doctor does. The insurer can, however, try to block it. Also missing are figures on the number of courses of cancer chemotherapy given, or not given, or the time from diagnosis to death in cancer patients before and after ACA.   survival of cancer patients in the U. S. is generally better than in countries that have universal coverage, or the type of plan progressives want to import. Again, the insurance plan isn’t medicine. You can get medicine without insurance, and if you have insurance it might refuse to pay. Orient observes that, between 2014 and 2015, U. S. mortality rates increased for the first time in decades. “This primarily affected   whites,” she notes. “Is Obamacare the cause? There are many factors involved, drug abuse probably being the most important. But I suspect that if repeal had happened in 2012 or 2013, it would have been blamed. ” “Medicaid expansion may have alleviated fears of medical bankruptcy, but we don’t know that more patients got treatment,” Orient continues. “In   Canada, there is no fear of a medical bill. But there might not be any treatment either. ” In October of last year, Obamacare architect Jonathan Gruber admitted the ACA was working just as it was designed  —   jacking up premiums and deductibles, and limiting choices for its customers. “The main goal of Obamacare was ” Gruber, an MIT economics professor, said on CNN, continuing: One was to cover the uninsured, of which we’ve covered 20 million, the largest expansion in American history. The other was to fix broken insurance markets where insurers could deny people insurance just because they were sick or they had been sick. Those have been fixed, and for the vast majority of Americans, costs in those markets have come down, thanks to the subsidies made available under Obamacare. “Jonathan Gruber exposed himself as not credible and simply a propaganda minister of Obamacare when he was exposed explaining the grand deception perpetrated on the American public,” Dr. Gerard Gianoli, a specialist in   and skull base surgery, told Breitbart News. “To claim that Obamacare is working is almost too ridiculous to comment upon, unless the purpose of Obamacare was to drive up insurance premiums, while providing less options for health care and destroying the best medical care system in the world. ” Orient agrees, observing that experts beating the universal healthcare drum “know very well that resources are limited, and that spending (‘costs’) must be contained. ” She adds: They also understand that the burgeoning bureaucracy and its minions and retainers must be well paid. So the answer is to cut services. Some plans “incentivize” doctors to make more money by skimping on care. Others call for a “global budget” —  the deliberate creation of scarcity. When the money is gone, treatment is canceled. There will be fewer beds, fewer CT scanners, fewer drugs, and fewer doctors. But all will be fair. No rationing by price, just by waiting lines, political pull  —   and death. There will be no medical bills to pay after a service, if you get any service. Only taxes in advance, service or no service. Dr. Kristin Held, a   ophthalmologist and surgeon, explains how Obamacare obliterated   medical care and that even many Republicans still refuse to embrace the free market when it comes to health care, a situation that will keep healthcare costs high: In a normal free market, people can look for a less expensive car or a different dealer. But ObamaCare outlawed the insurance products that millions of people had and were satisfied with. No more “bare bones” policies for instance. The leather seats and   entertainment “option” are no longer optional. And no heading to the dealer across the street —  or the state line —  who’ll make you a better deal. The government has fixed the prices, the products, and the dealers. You may be shocked to hear that “ ” Republicans didn’t fix that. They’ll let you do without the car, but you can’t get a cheaper one. After all, the Obama car features are immensely popular. They are certainly popular with certain groups: Held explains that if Republicans retain the “’guaranteed   rating’ features that always and everywhere send premiums into the stratosphere,” insurers can’t price their products by level of risk, and premiums will still go higher. She urges Republicans to address “the entrenched flaws that keep the costs up” in health care. “We must continuously remind ourselves that the goal is survival of our patients, not the survival of big insurance corporations, political careers, and   parasites,” she asserts. “We need an ambulance not a Monster truck, and most importantly we must drain the swamp. ”'"}, "time": 1742563176.6097481}