{"duration": 0.126237154006958, "input_args": {"text": "'Videos WikiLeaks’ Podesta Emails Highlight Strong Ties Between DOJ & Clinton Campaign ‘Fantastic lawyer. Kept me out of jail,’ wrote John Podesta, Hillary Clinton’s campaign chair, in a 2008 email about an assistant attorney general at the Department of Justice who is now overseeing the FBI’s investigation of Clinton’s emails. | November 3, 2016 Be Sociable, Share! Secretary of State Hillary Rodham Clinton gestures as she gives a speech: “Frontlines and Frontiers: Making Human Rights a Human Reality,” Thursday, Dec. 6, 2012, at Dublin City University in Dublin, Ireland. (AP Photo/Kevin Lamarque, Pool) \\nMINNEAPOLIS — WikiLeaks’ archive of emails taken from the Gmail account of Hillary Clinton’s campaign chair continue to shed new light on the close relationships between the Democratic Party elite and the U.S. government. \\nThe latest wave of John Podesta’s emails to be published by WikiLeaks has thrust into the spotlight Peter Kadzik, a well-connected Washington attorney who currently serves as an assistant attorney general at the Justice Department’s Office of Legislative Affairs. \\n“DoJ Assistant Attorney Peter Kadzik outed as a mole for Hillary Clinton campaign,” WikiLeaks tweeted on Wednesday. The tweet highlighted an email Kadzik sent to Podesta on May 19, 2015, warning him of a congressional hearing and updating the team on the State Department’s progress in publishing Clinton’s emails in response to Freedom of Information Act requests. DoJ Assistant Attorney Peter Kadzik outed as a mole for Hillary Clinton campaign https://t.co/MNHzJ310Nl pic.twitter.com/uTQF6baWBC \\n— WikiLeaks (@wikileaks) November 2, 2016 \\nIn the email, Kadzik wrote: \\n“There is a HJC [House Judiciary Committee] oversight hearing today where the head of our Civil Division will testify. Likely to get questions on State Department emails. Another filing in the FOIA case went in last night or will go in this am that indicates it will be awhile (2016) before the State Department posts the emails.” \\nPodesta forwarded the email to several members of the Clinton campaign team. \\nBen Brody, a Bloomberg politics reporter assigned to cover the election, noted that all of the information Kadzik provided was public. On Wednesday, Brody reported: \\n“Kadzik was alerting Podesta to public events: The Judiciary Committee held an open hearing that day, and a new filing in the court case a day earlier set out the State Department’s proposed timetable.” \\nBut the May 19 email and others like it are still prompting concerns over Kadzik’s close ties to the DOJ and the Clinton campaign. On Monday, Kadzik sent letters to members of Congress, assuring them that the Justice Department would closely supervise a renewed FBI investigation into Clinton’s emails in light of evidence uncovered in an unrelated investigation regarding Anthony Weiner, the New York congressman who resigned amid accusations that he’d “sexted” minors. Weiner is estranged from his wife, Huma Abedin, one of Clinton’s top aides. Kadzik wrote: \\n“We assure you that the [Justice] Department will continue to work closely with the FBI and together, dedicate all necessary resources and take appropriate steps as expeditiously as possible.” #BREAKING Senior DOJ official sends letter to lawmakers responding to request for more information about email review. #8days pic.twitter.com/PCgT2ODkQd \\n— Just the Facts (@JTF_News) October 31, 2016 \\nThe ties between Kadzik and Podesta go far beyond a single email, however. On Oct. 18, the conservative site The Washington Free Beacon highlighted a Sept. 8, 2008 email from Podesta to Cassandra Butts, a close advisor to President Barack Obama who died later that year. In the email, with the subject line “Peter Kadzik,” Podesta wrote: \\n“Willing to help. Fantastic lawyer. Kept me out of jail. I’m sure Christine knows him. Wants to help. Think he would be an excellent vet lead.” \\nAn anonymous contributor to Zero Hedge writing under the name “Tyler Durden” has been connecting the dots in an analysis of WikiLeaks’ Podesta Emails archive published on Tuesday. “Tyler Durden” elaborated on the ways Kadzik may have helped Podesta in the past: \\n“Podesta was caught in a sticky situation in both the Lewinsky affair and the Rich pardon scandal. As deputy chief of staff to Clinton in 1996, Podesta asked then-United Nations ambassador Bill Richardson to hire the 23-year-old Lewinsky. In April 1996, the White House transferred Lewinsky from her job as a White House intern to the Pentagon in order to keep her and Bill Clinton separate. But the Clinton team also wanted to keep Lewinsky happy so that she would not spill the beans about her sexual relationship with Clinton.” \\nThe anonymous blogger also noted that, “in the waning days of the Bill Clinton administration, Kadzik lobbied Podesta on behalf of Marc Rich, the fugitive who Bill Clinton controversially pardoned on his last day in office.” \\nWhile it’s unclear if Podesta and Kadzik are truly “best friends,” as “Tyler Durden” asserts, the writer is correct in arguing that voters should be concerned that “the DOJ will be in charge of a probe that could potentially sink Hillary Clinton” even as the department’s leadership maintains such close connections to Clinton, her team, and the Obama administration. Be Sociable, Share!'"}, "time": 1742563951.3662636}