{"duration": 0.10625267028808594, "input_args": {"text": "'Diversity Macht Frei October 29, 2016 \\nConservatism is the defence of ancestral peoplehood. It is an affirmation of a people’s uniqueness, their culture, traditions, values and trans-generational connectedness; in short, their ethnic identity. In America, however, thanks to infiltration and subversion of the movement by Jewish intellectuals, conservatism has been defined as its opposite. Instead of affirming ancestral peoplehood, this ersatz or kosher conservatism denies it; furthermore, it depicts genuine conservatism – the attempt to preserve a people’s distinctiveness – as somehow shameful or morally tainted. This it accomplishes by expansively redefining the peoplehood to embrace outsiders. In place of a time-honoured community linked by genetic descent, the new criteria for “tribal” belonging become shallow and abstract: place of birth; an administrative status; a bit of paper from the government; a list of “values”, usually ones such as “openesss” or “tolerance” that are simply disguised demands for ethnic self-dissolution. \\nThis redefinition of European, and only European, peoplehood into something abstract is a form of intellectual genocide, one largely effected by Jewish intellectuals who have mastered the art of manipulating Europeans by evoking shame responses. And insofar as this intellectual redefinition of our peoplehood prevails in the public conversation, which it does to the point of being almost unchallenged, it forms the basis for government policies that must necessarily bring about an actual genocide in which the ancestral ethnic community is dissolved through an influx of outsiders. Since, according to the rules of kosher conservatism, Europeans are not allowed to define themselves as an ancestral community, they cannot defend themselves as such. \\nWhat we see in the Trump movement and the various populisms springing up around Europe is a response to this twin genocide, the intellectual and the actual, being perpetrated on Europeans by Jewish intellectuals whose ideas have achieved an ascendancy in our public conversation. These kosher conservatives are mortified by the sight of genuine conservatism, the element of ethnic self-defence that is manifest in the Trump movement. Here neo-con (((David Brooks))) of the New York Times laments the good old days when the goy knew their place. \\nI feel very lucky to have entered the conservative movement when I did, back in the 1980s and 1990s. I was working at National Review, The Washington Times, The Wall Street Journalâ\\x80\\x99s editorial page. The role models in front of us were people like Bill Buckley, Irving Kristol, James Q. Wilson, Russell Kirk and Midge Decter. \\n… The Buckley-era establishment self-confidently enforced intellectual and moral standards. It rebuffed the nativists like the John Birch Society, the apocalyptic polemicists who popped up with the New Right, and they exiled conspiracy-mongers and anti-Semites, like Joe Sobran, an engaging man who was rightly fired from National Review. \\nSource \\nSobran was one of the old-school, proudly Christian, conservatives who attempted to resist the Jewish takeover of the American conservative movement, failed and paid the price for his failure. Here are some extracts from his New York Times obituary. \\nJoseph Sobran, a hard-hitting conservative writer and moralist whose outspoken antipathy to Israel and what he saw as the undue influence of a Jewish lobby on American foreign policy led to his removal as a senior editor of National Review in 1993, died on Thursday in Fairfax, Va. He was 64 and lived in Burke, Va. \\nMr. Sobran (pronounced SO-brun), one of the conservative whiz kids whom William F. Buckley draft-picked for National Review straight out of college, made his mark with witty, thoughtful essays on moral and social questions. He was an unapologetic paleoconservative, opposed to military intervention abroad, big government at home and moral permissiveness everywhere. \\n… In the mid-1980s he ran into trouble with Mr. Buckley for the first time after writing several columns critical of American policy in the Middle East. Matters came to a head in 1993. Mr. Sobran, unhappy with National Reviewâ\\x80\\x99s support for the 1991 Persian Gulf war, and with Mr. Buckleyâ\\x80\\x99s criticism of his writing on Jews and the Middle East, attacked Mr. Buckley in his â\\x80\\x9cWashington Watchâ\\x80\\x9d column in The Wanderer, a traditionalist Roman Catholic weekly. When informed by National Reviewâ\\x80\\x99s editor in chief, John Oâ\\x80\\x99Sullivan, that the column amounted to a letter of resignation, Mr. Sobran was fired. \\nMr. Buckley, angry that Mr. Sobran had included conversations from a private dinner that the two had had, and stung by the depiction of him as kowtowing to Manhattanâ\\x80\\x99s social elite, wrote in a letter to The Wanderer that the column â\\x80\\x9cgives evidence of an incapacitation moral and perhaps medical, which news is both bad, and sad,â\\x80\\x9d adding that Mr. Sobranâ\\x80\\x99s criticisms were â\\x80\\x9ca breath-catching libel.â\\x80\\x9d \\nThe two men later reconciled. Mr. Sobranâ\\x80\\x99s isolationist views on American foreign policy and Israel became increasingly extreme. He took a skeptical line on the Holocaust and said the Sept. 11 terror attacks were a result of American foreign policy in the Middle East, which he believed that a Jewish lobby directed. Not surprisingly, he spent much of his time defending himself against charges of anti-Semitism. \\nâ\\x80\\x9cNobody has ever accused me of the slightest personal indecency to a Jew,â\\x80\\x9d he said in a speech delivered at a 2002 conference of the Institute for Historical Review. â\\x80\\x9cMy chief offense, it appears, has been to insist that the state of Israel has been a costly and treacherous â\\x80\\x98allyâ\\x80\\x99 to the United States. As of last Sept. 11, I should think that is undeniable. But I have yet to receive a single apology for having been correct.â\\x80\\x9d \\nSource \\nBrooks laments the corrosion of the establishment media monolith that has allowed the dumb goy plebs to have a voice. \\nThe conservative intellectual landscape has changed in three important ways since then, paving the way for the ruination of the Republican Party. First, talk radio, cable TV and the internet have turned conservative opinion into a mass-market enterprise. Small magazines have been overwhelmed by Rush, Oâ\\x80\\x99Reilly and Breitbart. \\nTodayâ\\x80\\x99s dominant conservative voices try to appeal to people by the millions. You win attention in the mass media through perpetual hysteria and simple-minded polemics and by exploiting social resentment. In search of that mass right-wing audience that, say, Coulter enjoys, conservatism has done its best to make itself offensive to people who value education and disdain made-for-TV rage. \\nItâ\\x80\\x99s ironic that an intellectual tendency that champions free markets was ruined by the forces of commercialism, but that is the essential truth. Conservatism went down-market in search of revenue. It got swallowed by its own anti-intellectual media-politico complex â\\x80\\x94 from Beck to Palin to Trump. Hillary Clinton is therefore now winning among white college graduates by 52 to 36 percent. \\nSourceÂ \\nThat more highly educated Europeans now tend disproportionately to embrace their own destruction is the result of their heightened exposure to Jewish sophistry through academia and Establishment media. \\nAll over (see here and here for other examples), the Kosher conservatives are wringing their hands in anguish at the Trump movement, hoping it will go away soon. But the ethnic anguish the Trump movement channels is not going away any time soon, driven, as it is, by the harsh reality that Europeans are being turned into ethnic minorities in almost all of their ancestral living spaces. Even if Trump falls by the wayside, their anguish will continue to deepen and seek other forms of expression.'"}, "time": 1742562552.9358187}