{"duration": 0.1505746841430664, "input_args": {"text": "'Discerning the Mystery Wednesday, October 26, 2016 The Pitfalls of Partial Disclosure – Examining the Process of Disclosure and the Reasons why a String of Half-Truths Just Won’t Cut It \\nFor almost a decade, many of us have heard about the concept and process of Disclosure . This is the complete release of formerly secret, official and governmental information through the public media. We have heard about the numerous possibilities of the truth of past events which exists behind closed doors—locked away in secret files protectively stamped with the word “Classified.” We know that to a very large extent, we as the common public know very little about the truth behind roughly a century of government and corporate secrecy on matters of high technology, ET life, and the heinous crimes committed for the sake of maintaining this secrecy. The subjects within the topic of disclosure are extremely dense and weighty to consider. One could spend hours digesting just one of these topics, which are commonly considered fringe in today’s society. However, we are here to discuss a different and yet parallel subject. This is the subject of individual choice, or more specifically, the choice to know . In order to see Disclosure, we must make the choice to be aware and have the courage to face the possibilities behind the truth which the disclosure will bring to light. Many of these truths will be unconventional, considering the fact that secrecy has defined convention for the past century. This does not mean that we should abandon our responsibility of thorough research and verification. It simply means that from vigorous research and diligent scrutiny, we must have the courage to face the information we encounter. \\nConscious Life Expo – David Wilcock – Page 1 – New Intel, The Human Evolutionary Leap, Sacred Geometry, Illuminati Secrets, and More This article is dedicated to examining the concept of the partial disclosure , or the hindrance of the Disclosure process for the sake of a few financial interests. It is my hope that this article will help each and every one of us to discern and to face the truth the moment it is revealed. The Balance of Power There is one main reason for the need for a full-disclosure event to revolutionize the various societies of this planet. This Full Disclosure is to end the entirety of the secrecy for the sake of respect for the equality of all people. This disclosure is an acknowledgment to our right to know about all that affects our daily lives and represents the balancing of power among all people around the globe. With this balance in mind, it is important for us to know what power truly is. When we speak of power , many ideas may come to mind. Some of us may believe this word refers to one’s ability to control others. Others may think of it as a matter of economic influence, and there are those who simply think of power as one’s own ability to make their own choices. The truth is that all of these are valid definitions. To clarify, let’s check the definition from Merriam-Webster for the word “power.” : the ability or right to control people or things : political control of a country or area : a person or organization that has a lot of control and influence over other people or organizations If we consider these definitions of this word, we may notice something. Aside from the definitions which refer to mathematical applications, there seems to be no reference to human equality of any kind. It seems that in this official definition, the modern English language has all but completely done away with the fact that true power comes from the individual, and in essence, is equally distributed among all people. Let’s consider a few examples. \\nAmerican Mind Control: The Cost of Secrecy Part 1 – Examining the Effects of Secrecy, Propaganda, and Organized, White-Collar Crime \\nMost of us are familiar with the concept of governmental monarchy. This is of course, the form of centralized government in which a single figurehead holds complete control over an area, province, or country. Yet even though this one individual supposedly holds all of this power, they would have no control at all unless everyone else agreed to allow them that control. Jacques Louis David – The-Coronation of Napoleon In every ancient monarchical government structure, no single ruling figure could have held any such authority without the entire kingdom agreeing that they should. Generally speaking, if the people do not decide to follow, no authority can lead anyone in any way. A king or queen has dozens of servants, maids, butlers, cooks, groundskeepers and gardeners, craftsmen, and guards. They have advisers and clergymen who direct their political decisions, and armies of thousands who obey their every whim. However, not a single order of this monarchic figure would ever mean anything if the people chose not to follow them. \\nFull Disclosure and Ascension – Commentary of the Latest Article from David Wilcock In the common social interaction in which equality of power is acknowledged, there is no hierarchy. When one person starts giving orders to another, they probably won’t get much from the person (except maybe the finger and/or some choice words). Now take these same two people—one giving the order and the other receiving that order—and place beside these two, five other people who are following the orders. Due to this situation, the compulsion to obey is somewhat increased. Now add in 10, 20, 50, or even an entire country of people doing as they are mandated to do by some unseen authority, and the compulsion to obey is compounded. Add in the ability of the authority to order punishment upon those who disobey, and this control is solidified. We as human beings have the conditioning to conform to whatever social situation we find ourselves in. This is not to say that this tendency cannot be overcome. It is merely to say that we are raised to conform to the collective of society. This social conformity may have a few positive aspects up to a certain point. However for those who appreciate independent thought and the freedom to choose for themselves, this pull to conform can be somewhat of an annoyance. The above example of this social tendency to conform demonstrates the psychological concept of social conditioning , or what many in modern days refer to as the sheep effect . \\nPsych Central – “Herd” Mentality Explained \\nThe sheep effect could be described as the tendency of a person to automatically do whatever those around them are doing. This could simply be initiated by one person repeating an action, or it could be an entire group practicing . Eventually, you may have a large group of people doing the same thing over and over again without knowing why. The following clip comes from a show which airs on the National Geographic channel called Brain Games , and demonstrates a prime example of the sheep effect in action. Brain games – Social conformity What Lies Beyond the Haze of Social Conditioning? So as we can see, it seems fairly easy to subtly coerce a suggestible person into following a social norm even though they have no logical reason for doing so. To be fair, this woman most likely reasoned to herself that the bell had something to do with being called for her appointment. What is interesting to see is that she never actually asked about why the group kept standing. There seems to have simply been the rationalization, immediately followed by conformity. This tendency of social conformity is a pervasive phenomenon which seems to grip the entirety of developed societies around the world. In fact, this conformity may be the one of the main reasons why large civilizations have developed in the way that they have. It is very likely that this coercion to conform has been used to create various facets of society, and to build that which has been built. However, as we may have seen, modern society doesn’t serve all people equally. Instead the supposedly civilized world appears to be designed to use the individual for their entire lifetime. When society has taken the best years of life of the individual, it discards them while at the same time, it grooms their children to be used in the exact same way. \\nWisdom Teachings with David Wilcock – “The Cabal’s Downward Spiral” – Assessing the Final Days of a Crumbling Cabal, and a Prelude to Breakthrough This grossly exploitative societal structure appears to have been designed by those who benefit from it most. These benefactors don’t work. They don’t contribute, but in many ways they use and enjoy the spoils of everything that we the people work for. Due to their elitist mentality and upbringing, these manipulators have, in a sense, domesticated the rest of humanity to work as their own servants, and have collectively assumed the position of the monarch of ancient times—creating an oligarchy. So what’s the significance of these discoveries, and what do they have to do with to partial disclosure? The Nature of Unbalanced Power The bottom line is that a partial disclosure would serve as a prime opportunity for more elitists to assume even more influential positions, and to seize more power than they deserve. Just like we have seen over the last century, any excess of power only compounds, and eventually corrupt those who hold it. \\nWho’s Investing in the Dakota Access Pipeline? Meet the Banks Financing Attacks on Protesters – Extended Commentary and Links Included Over time, the common people will typically adapt to their lower societal positions—becoming more and more comfortable and increasingly dependent upon the state to direct their lives. At the same time, the common people will become less and less self responsible. Eventually, the people become so dependent and the state becomes so domineering and power-drunk that the people will submit to any plan—no matter how foolish or ridiculous—simply so that they can avoid self-awareness and self-responsibility. Continue reading at Discerning the Mystery Share:'"}, "time": 1742563424.0901184}