{"duration": 1.3832628726959229, "input_args": {"text": "'CINCINNATI  —   After the slaughter of nine worshipers at a South Carolina church last June, but before the massacre of eight students and a teacher at an Oregon community college in October, there was a shooting that the police here have labeled Incident 159022597. 01. It happened on a clear Friday night at an Elks Lodge, on a modest block of clapboard houses northeast of this city’s hilly downtown. Unlike the butchery that bookended it, it merited no presidential statements, no saturation television coverage. But what took place at 6101 Prentice Street on Aug. 21 may say more about the nature of gun violence in the United States than any of those far more famous rampages. It is a snapshot of a different sort of mass violence  —   one that erupts with such anesthetic regularity that it is rendered almost invisible, except to the mostly black victims, survivors and attackers. According to the police account, more than 30 people had gathered in the paneled basement bar of the lodge to mark the 39th birthday of a man named Greg Wallace when a former neighbor, Timothy Murphy, showed up, drunk. Fists flew. Mr. Murphy ducked out the door, burst back in with a handgun, and opened fire. As partygoers scrambled for the door, he chased Greg Wallace’s younger brother Dawaun to a tiny     bathroom, where he shot him nine times before the violence spilled out onto the street. There, another Wallace relative, also armed with a handgun, fired back at him. By the end, 27 bullets had flown, hitting seven people: Mr. Murphy, who died Dawaun Wallace, who was grievously wounded four bystanders, one of whom was hit in the genitals, another in the leg. And Barry Washington. A seasonal packer for Amazon. com, Mr. Washington, 56, had stopped at the lodge on his way to the store for cigarettes, said his sister, Jaci Washington. He was in the bathroom when Mr. Murphy cornered Dawaun Wallace there. A single bullet pierced Mr. Washington’s arm, then his heart. He left behind a son, a daughter, a brother, a sister, a mother and four grandchildren. “My brother died on the floor of a bathroom for no reason,” Ms. Washington said. “He had nothing to do with the whole situation. I can’t believe I lost my brother like this. ” Yet many in the neighborhood where they grew up, she said, responded with a shrug. “The reality is, this happens quite frequently,” she said. “And it’s kind of, ‘Oh, well, this guy was killed today. Somebody else will be killed tomorrow.’ ” That is more than correct. The Elks Lodge episode was one of at least 358 armed encounters nationwide last year  —   nearly one a day, on average  —   in which four or more people were killed or wounded, including attackers. The toll: 462 dead and 1, 330 injured, sometimes for life, typically in bursts of gunfire lasting but seconds. In some cities, law enforcement officials say a growing share of shootings involve more than one victim, possibly driven by increased violence between street gangs. But data are scarce. Seeking deeper insight into the phenomenon, The New York Times identified and analyzed these 358 shootings with four or more casualties, drawing on two databases assembled from news reports and citizen contributors, and then verifying details with law enforcement agencies. Only a small handful were   mass shootings like those in South Carolina and Oregon. The rest are a pencil sketch of everyday America at its most violent. They chronicle how easily lives are shattered when a firearm is readily available  —   in a waistband, a glove compartment, a mailbox or garbage can that serves as a gang’s gun locker. They document the mayhem spawned by the most banal of offenses: a push in a bar, a Facebook taunt, the wrong choice of music at a house party. They tally scores of unfortunates in the wrong place at the wrong time: an    clinging to his mother’s hip, shot as she prepared to load him into a car a    church deacon, killed by a stray bullet while watching television on his couch. The shootings took place everywhere, but mostly outdoors: at neighborhood barbecues, family reunions, music festivals, basketball tournaments, movie theaters, housing project courtyards, Sweet 16 parties, public parks. Where motives could be gleaned, roughly half involved or suggested crime or gang activity. Arguments that spun out of control accounted for most other shootings, followed by acts of domestic violence. The typical victim was a man between 18 and 30, but more than 1 in 10 were 17 or younger. Less is known about those who pulled the triggers because nearly half of the cases remain unsolved. But of those arrested or identified as suspects, the average age was 27. Most of the shootings occurred in economically downtrodden neighborhoods. These shootings, by and large, are not a   phenomenon. The divide is racial as well. Among the cases examined by The Times were 39 domestic violence shootings, and they largely involved white attackers and victims. So did many of the   massacres, including a wild shootout between Texas biker gangs that left nine people dead and 18 wounded. Over all, though, nearly   of victims and suspected assailants whose race could be identified were black. Some experts suggest that helps explain why the drumbeat of dead and wounded does not inspire more outrage. “Clearly, if it’s    we don’t get the same attention because most people don’t identify with that. Most Americans are white,” said James Alan Fox, a professor of criminology at Northeastern University in Boston. “People think, ‘That’s not my world. That’s not going to happen to me.’ ” Michael Nutter, a former Philadelphia mayor, who is black, said that society would not be so complacent if whites were dying from gun violence at the same rate as blacks. “The general view is it’s one bad black guy who has shot another bad black guy,” he said. “And so, one less person to worry about. ” Droves of experts study   massacres by     assailants, usually driven by mental disorders, at schools, workplaces and other public spaces. Academics regularly crunch data on single homicides and assaults. But the   shootings that wound or kill several victims  —   a relatively small subset of the shootings that kill nearly 11, 000 people and wound roughly 60, 000 more each year  —   are uncharted territory for researchers, said Richard B. Rosenfeld, a professor of criminology at the University of  . Louis. The Times compiled its list of 358 shootings with four or more casualties from largely   lists managed by the social media network Reddit and Gun Violence Archive, a nonprofit organization. The groups recently combined their efforts at the website gunviolencearchive. org. Four or more casualties is a far broader measure than “mass shootings,” which are commonly defined as the killing of at least four people, not including the attacker. But it captures many victims who some criminologists say are too often ignored: people who might have died given a slightly different trajectory of a bullet, or   medical care. Counting assailants among casualties increased the total number of cases by fewer than three dozen, most of them domestic violence shootings that ended in suicide. Hispanics were not separately identified, because police reports do not systematically identify victims and suspects by ethnicity, only by race. There are 358 reasons for those 358 shootings, though some remain a mystery in about a fourth of the cases, investigators have discerned no motive. As for the rest, some patterns stand out. The fewest occurred while another felony, such as a burglary, was underway. Domestic violence shootings were nearly as infrequent, but were among the deadliest. About a third were provoked by arguments, typically   or   often over petty grievances. A sampling: Outside a crowded bar in Decatur, Ill. a customer found an expensive watch. When another man insisted it was his, the customer pulled out a semiautomatic handgun, shot the man in the face and wounded four people near him. After a day of drinking, singing karaoke and watching football, four   friends in a small town north of Baton Rouge, La. got into a fight  —   some said over the choice of music. One shot the other three, then killed himself. Outside an Orlando, Fla. housing project, lewd comments about a young man’s pregnant girlfriend resulted in 15 to 20 gunshots. A    boy who peered out his window at the fracas was struck directly in one eye. One of three wounded adults later acknowledged that “a    fist fight would have settled the issue,” the police report said. Another third of the 358 cases  —   and the most common in cities with more than 250, 000 residents  —   were either   or were   shootings typical of gangs. But the police and prosecutors say many of those were not directly linked to criminal activity, such as a dispute over a drug deal. More often, a minor    —   a boast, an insult, a decision to play basketball on another gang’s favorite court  —   was taken as a sign of disrespect and answered with a bullet, said Andrew V. Papachristos, a Yale University professor who studies gang behavior. Over all,   of shootings took place outdoors, endangering innocent people. More than 100 bystanders, from toddlers to grandparents, were injured or killed. Among them: eight family members shot as they bade one another goodbye after a reunion in Philadelphia a soldier struck by a stray bullet during a shootout in a public square in Savannah, Ga. a    college sophomore killed when a gunman sprayed a crowd outside an Ocala, Fla. club. In Cincinnati, where last year’s toll of 479 gun deaths and injuries was the highest in nine years, a growing share of shootings involves more than one victim  —   1 in 8 attacks with guns in the first half of last year compared with 1 in 12 over the same span in 2010. Police officials in some other cities have noted a similar trend, though others say they have not. What is behind the upticks, they said, is a matter of speculation. In Rochester,   shootings accounted for fewer than 15 percent of victims in 2006 so far this year, they make up 38 percent. Police Chief Michael Ciminelli said that he suspected that social media was playing a role by simultaneously catalyzing minor disputes into deadly standoffs and drawing more people into them. Larry C. Smith, interim chief of police in Durham, N. C. and a   veteran of the force, said, “Are we starting to reap the   age? I don’t know. ” “But five, or certainly 10 years ago,” he added, “it wasn’t like this. ” The Elks Lodge shooting was one of five last year in Cincinnati that resulted in at least four casualties. The others took place on street corners, on a front porch and at a cookout in a parking lot. Police officials say they suspect that as many as half of the 24 victims were not the intended targets community workers blame   gunmen who are often high on drugs or are drunk. “They are not marksmen,” said Aaron Pullins, an   worker. “They don’t know how to hold the gun. They just shoot. ” Investigators have linked three of those shootings to gangs, although like many of their counterparts in other cities, they say the word gang conjures up a false image of a   hierarchical criminal organization. Instead, they describe fluid, sometimes tiny bands of teenagers and young adults bound by illegal activity. “They are groups of friends who rob and shoot each other,” Detective Greg Gehring said. “That’s just what they do. ” And they do it all too well. Last year such groups accounted for 40 of Cincinnati’s 58 gun homicides and more than half of its 421 nonfatal shootings. Two of the five shootings with four or more casualties occurred just 300 feet apart in East Westwood, an impoverished neighborhood with high unemployment and dropout rates, on a block that averaged a shooting nearly every other month. A third occurred a mile away. That pattern is typical: Urban gun violence tends to spread around specific blocks or intersections, like a contagious disease. Rival gang members, seeking revenge for an earlier shooting, had already tried to run Jonathan Austin, 24, off the road when they caught up to him in early December outside the Schwarz Market in East Westwood, the police said. They chased him and his friends for an entire block, firing up to 50 shots. Mr. Austin was killed. Three of his friends were injured, including an    who was shot repeatedly in the back, damaging his spine. Detective Gehring said that when he talked to the teenager last month, he was bedridden in his mother’s apartment, worried he would never move his legs again. With the help of the market’s surveillance video and one witness, the police arrested a    felon on charges of murder and illegal possession of a weapon. But as many as five other gunmen got away. A few weeks ago, one of the suspects was shot 11 times, possibly in retaliation, the detective said. Street violence is   that way: Shootings beget shootings that beget more gunmen. Professor Papachristos, the gang expert, said the more violent the neighborhood, the more teenagers and young men seek safety in numbers. “The No. 1 reason people join gangs is for protection,” he said. “The perverse irony is they are then more at risk. ”   Abdullah, 67 and   with a neatly trimmed gray beard, is an   turned outreach worker for Cincinnati’s Human Relations Commission. He or his   were at the scenes of all five of Cincinnati’s shootings with four or more casualties last year, working the crowds outside the yellow police tape, trying to defuse the potential for further gunfire. They see themselves as stop signs for young black men bound for  . They also see themselves as   about the intersection of race and gun violence  —   a topic that neither the city’s mayor, who is white, nor its police chief, who is black, publicly addresses. “White folks don’t want to say it because it’s politically incorrect, and black folks don’t know how to deal with it because it is their children pulling the trigger as well as being shot,” said Mr. Abdullah, who is black. No one worries more about    violence than  . Surveys show that they are more fearful than whites that they will be crime victims and that they feel less safe in their neighborhoods. Most parents Mr. Abdullah meets are desperate to protect their children but are trapped in unsafe neighborhoods, he said, “just trying to survive. ” And some are in denial, refusing to believe that their sons are carrying or using pistols, even in the face of clear evidence. “ ‘Not my child,’ ” he said, adopting the resentful tone of a defensive mother. “ ‘It may be his friends, but not my child, because I know how I raised my child.’ ” His reply, he said, is blunt: “These are our children killing our children, slaughtering our children, robbing our children. It’s our responsibility first. ”   make up 44 percent of Cincinnati’s nearly 300, 000 residents. But last year they accounted for 91 percent of shooting victims, and very likely the same share of suspects arrested in shootings, according to the city’s assistant police chief, Lt. Col. Paul Neudigate. Nationally, reliable racial breakdowns exist only for victims and offenders in gun homicides, not assaults, but those show a huge disparity. The gun homicide rate peaked in 1993, in tandem with a nationwide crack epidemic, and then plummeted over the next seven years. But blacks still die from gun attacks at six to 10 times the rate of whites, depending on whether the data is drawn from medical sources or the police. F. B. I. statistics show that   who constitute about 13 percent of the population, make up about half of both gun homicide victims and their known or suspected attackers. “Every time we look at the numbers, we are pretty discouraged, I have to tell you,” said Gary LaFree, a professor of criminology at the University of Maryland. Some researchers say the single strongest predictor of gun homicide rates is the proportion of an area’s population that is black. But race, they say, is merely a proxy for poverty, joblessness and other   disadvantages that help breed violence. Mr. Nutter, now an urban policy professor at Columbia University, spoke out repeatedly about the disparity during his eight years as Philadelphia’s mayor  —   and was accused of casting   in a bad light. “Some people got upset,” he said. “I said, ‘I’ll stop talking about it when you stop killing each other.’ ” Cloaking the issue, he said, only makes it easier for the country to tune out what amounts to “mass murder occurring in slow motion every day. ” Both he and Mr. Abdullah say they wish some of the outrage over police killings of unarmed   would spill over to victims who die in anonymity in routine gun violence. After a white University of Cincinnati police officer fatally shot an unarmed black driver in July, street protests erupted here, Mr. Abdullah noted. But “when we kill each other,” he said, “it seems an acceptable way of life. ” Every month, the outreach workers attend more ceremonies, outpourings of grief marked by teddy bears, high school photos, candles and scrawled tributes to the victim of the day. “I feel so burned out,” said Steve Sherman, one of the workers. “We go to vigil, after vigil, after vigil, after vigil. ” From his hospital bed, one of four young men shot last May at one of Cincinnati’s most violent intersections pointed a police officer to a suspect. He gave the man’s first name. And he suggested that he had been shot in retaliation for an earlier shooting in the same area. Officers were able to identify the suspect and confirm that his car had been shot up a few days earlier, said Police Specialist Mark Longworth, who headed the inquiry. But “that’s where this case died,” he said. The injured victim attributed his information purely to “street talk,” not to direct knowledge that would stand in court. Hints are not evidence. “It’s frustrating because if people would do the right thing, we could probably prevent some of these shootings from happening,” Specialist Longworth said. “But in that world, very few things are worse than being labeled a snitch. ” Nationally, nearly half of last year’s shootings with four or more casualties ended in the same way: no arrest often, not even a suspect. At least 160 assailants, responsible for 102 murders and 635 gun injuries, were still on the streets at year’s end. A case was more likely to be solved if one or more victims died  —   the situation in about half the cases. But even some double, triple and quadruple murders continue to stump investigators. The national clearance rate for homicides has fallen from nearly three in four in 1980 to fewer than two in three today. That is partly because public attention has driven down the share of domestic violence killings, which are routinely solved, Professor Rosenfeld said. Much of what remains are killings involving gangs, drugs and witnesses with criminal backgrounds who are wary of talking to the police. “You are left with a larger percentage of homicides that are more difficult for police to clear,” he said. A shift in law enforcement from solving crimes to preventing them has also contributed, as has rising distrust of the police in some cities, said Charles F. Wellford, emeritus professor of criminology at the University of Maryland. Still, he said, some law enforcement agencies are much worse at closing murder cases than others. Some of those same departments are worse at closing shootings with four or more casualties, too. In Baltimore, the police have not solved any of 11 shootings last year. New Orleans made arrests in only one of eight cases Chicago, two of 16. Cincinnati was more typical, solving two of its five cases, at least in part. Detective Charles Zopfi had real hopes of arresting the gunmen behind a   shooting here last September. About 20 people had gathered on a warm Monday night for a cookout in a parking lot beside an apartment building. “There were kids and older people, not your usual crowd of   to    guys,” the detective said. As a car sped down the street, someone fired at least 10 bullets out a window. Detective Zopfi said he knew from experience how people respond in such situations: They look in the direction of the gunfire, and only then dive for cover. But eight months later, he said, he has been unable even to nail down whether the vehicle was black or green. He heard that of the five victims, a      man was left paralyzed from the waist down. But that man refused to take his phone calls, then changed his telephone number. A wounded    named Jabarri seemed the best hope of persuading witnesses to come forward, the detective said. Sometimes, the moral outrage over a child victim overwhelms the code of silence. And Jabarri, he said, was “the cutest little boy” who had smiled beguilingly at him from a hospital gurney even after being shot in the leg. At the detective’s request, Jabarri’s mother agreed to meet with a reporter. But when the reporter showed up at her home, she backed out, pleading a haircut appointment. “The code of silence is strictly enforced,” the detective said. Mr. Abdullah, the   worker, talks to some of the victims and witnesses who will not give information to the police. “They are scared,” he said. “We have had cases where people found out who talked and that person wound up dead. ‘So if the police cannot protect me, why would I jeopardize my life and my family?’ ” “It’s so much bigger than the idea of ‘no snitching,’ ” he said. Barry Washington was a neighborhood fixture in Madisonville, a racially mixed community of small, neat homes in northeastern Cincinnati where he grew up. Slim, handsome and barely    he had an infectious smile and a weakness for hats, from jaunty duckbills to baseball caps worn backward. He helped out   families at the Presbyterian church, and brought household goods to the   apartment he shared with his    mother, Amanda. He was getting to know a son, then 37, whose existence he had only recently discovered. “An   good guy,” said his sister, Jaci. “There wasn’t a woman who didn’t love him, or a man who didn’t want to hang out with him. ” A     Mr. Washington could landscape a yard, operate a forklift, mend a torn basketball. He had to revert to odd jobs after the bus stopped running last year to Amazon. com’s northern Kentucky warehouse, where he had packed shipments. But his sister said he had planned to share an apartment near the warehouse so he could resume work there. Madisonville is neither Cincinnati’s safest nor its most dangerous neighborhood. The Washingtons had avoided brushes with gunmen, but Mr. Washington was wary even around ninth graders. “ ‘Be careful,’ ” his sister recalled him saying. “ ‘The little young kids are getting crazy.’ ” Sometime before 11 p. m. on Aug. 21, Mr. Washington left his apartment in a green pullover, telling his niece he needed cigarettes. His mother was in bed, watching a police drama. The next morning, Jaci Washington awoke to a blizzard of text messages about a shooting. She called her mother, who said her brother had not come home. Soon Amanda Washington’s phone rang: a detective, asking repeatedly whether she was alone. “Why? What happened to my son?” she demanded. “Is he dead?” Mr. Washington had stopped at the Elks Lodge, a narrow,   building clad in pale green siding a   walk from their apartment. Greg Wallace’s party was underway in the basement bar, a “Happy Birthday” banner and blue and yellow balloons on the walls. Tins of muffins and rolls sat on tables covered with plastic tablecloths. Mr. Wallace and his brother Dawaun had recently been feuding with Timothy Murphy. The three men had grown up together in the neighborhood, and as adults had each been convicted of drug trafficking, court records show. Mr. Murphy’s mother, Christine Poindexter, said her son was upset because the Wallaces were selling drugs out of his father’s house. The argument resumed when Mr. Murphy showed up at the party, and ended only when Mr. Murphy was dead and Dawaun Wallace had been peppered with nine bullets. Tests later showed that Mr. Murphy’s blood alcohol level was nearly three times the legal driving limit, and that there was evidence of recent marijuana use. Mr. Murphy’s killer was not prosecuted, Detective David Gregory said, because he appeared to have fired in  . Barry Washington’s death was collateral damage  —   a stray bullet, meant for Dawaun. Nine months later, Mr. Washington’s family is still reeling. His mother, a cancer survivor, is virtually a  . “We loved him dearly, and with a pull of the trigger, he was gone,” she said. “That I cannot accept. ” Jaci Washington’s    son is withdrawn and angry. Her    daughter has nightmares. Her brother, she said, probably would have counseled her to forgive his killer. “He kept telling me, ‘You have to look for the good in everybody, ’” she said. But she says she cannot forgive. She grasps for metaphors to capture the family’s loss. “It’s like the world crashing in. It’s like a nuclear bomb went off on my couch,” she said. “It’s like someone hit ‘pause’ in my life. I just saw him, and I will never see him again. ” Mr. Murphy’s mother is not seeking forgiveness. In an interview, she said she did not believe her son had fired a gun at anyone, insisting that the police had botched the investigation and let the real culprits go free. And she is angry with Jaci Washington for characterizing her son as a murderer at community meetings on gun violence. Ms. Washington and her mother no longer go to those meetings. They seemed futile, they said  —   more broken people, describing more senseless deaths. “I don’t want pity. I want results,” Jaci Washington said. “One more black shooting in a black neighborhood. ‘Let’s rally around.’ It’s a facade. When all is said and done, we’re still left with the grief. ”'"}, "time": 1742562771.497204}