{"duration": 0.2577638626098633, "input_args": {"text": "'La influencia de Estados Unidos y la OTAN en las relaciones de la Unión Europea con China por Manlio Dinucci Al intervenir en un foro internacional, el geógrafo italiano Manlio Dinucci sintetiza su análisis sobre el arsenal que Estados Unidos ha venido acumulando para imponer su voluntad al mundo. Este trabajo reviste especial importancia ya que esa voluntad claramente asumida de dominación y esa organización unipolar del mundo son precisamente lo que Siria, Rusia y China cuestionan hoy por la vía de las armas.\\nRed Voltaire | Roma (Italia) | 27 de octubre de 2016 français Entro de inmediato en el quid de la cuestión. Pienso que no podemos hablar de las relaciones entre la Unión Europea y China sin abordar la influencia que Estados Unidos ejerce sobre la Unión Europea, tanto directamente como a través de la OTAN.\\nHoy en día, 22 de los 28 países miembros de la Unión Europea (21 de los 27 después de la salida del Reino Unido) son miembros de la OTAN, reconocida por la Unión Europea como « base fundamental de la defensa colectiva ». Y la OTAN se halla bajo el mando de Estados Unidos: el Comandante Supremo de las fuerzas de la OTAN es siempre un general estadounidense nombrado directamente por el presidente de Estados Unidos y todos los demás mandos de la OTAN también están en manos de militares estadounidenses. La política exterior y militar de la Unión Europea se ve así fundamentalmente subordinada a la estrategia estadounidense, tras la cual se alinean las principales potencias europeas.\\nEsa estrategia, claramente enunciada en los documentos oficiales, es trazada en el momento histórico en que la situación mundial cambia como resultado de la desintegración de la URSS. En 1991, la Casa Blanca declara en la National Security Strategy of the United States :\\n«Estados Unidos queda como el único Estado que dispone de una fuerza, de un alcance y de una influencia en todos los aspectos –político, económico y militar– realmente globales. No existe sustituto del liderazgo estadounidense.»\\nEn 1992, en su Defense Planning Guidance , el Pentágono subraya:\\n«Nuestro primer objetivo es impedir que cualquier otra potencia domine una región cuyos recursos sean suficientes como para engendrar un poderío mundial. Esas regiones incluyen Europa occidental, el Asia oriental, el territorio de la ex Unión Soviética y el Asia sudoccidental.»\\nEn 2001, en el informe Quadrennial Defense Review –publicado una semana antes de la guerra de Estados Unidos y la OTAN contra Afganistán, área de primera importancia geoestratégica en relación con Rusia y China–, el Pentágono anuncia:\\n«Existe la posibilidad de que surja en la región un rival militar con una formidable base de recursos. Nuestras fuerzas armadas deben conservar la capacidad de imponer la voluntad de Estados Unidos a cualquier adversario, ya sean Estados o entidades no estatales, cambiando el régimen de un Estado adverso o ocupando un territorio extranjero hasta que se alcancen los objetivos estratégicos estadounidenses.»\\nEn base a esa estrategia, la OTAN –bajo el mando de Estados Unidos– ha emprendido su ofensiva en el frente oriental: luego de haber destruido la Federación Yugoslava mediante la guerra, desde 1999 hasta este momento la OTAN ha abarcado todos los Estados del desaparecido Pacto de Varsovia, 3 Estados de la antigua Yugoslavia, 3 de la antigua URSS y dentro de poco abarcará otros (comenzando por Georgia y Ucrania, esta última ya está de hecho en la OTAN), moviendo bases y fuerzas, incluso nucleares, hacia zonas cada vez más cercanas a Rusia. Al mismo tiempo, en el frente sur, estrechamente vinculado al oriental, la OTAN bajo el mando estadounidense destruyó el Estado libio –también recurriendo a una guerra– y también trata de destruir el Estado en Siria.\\nEstados Unidos y la OTAN hicieron estallar la crisis ucraniana y, acusando a Rusia de « desestabilizar la seguridad europea », arrastraron Europa a una nueva guerra fría, principalmente por voluntad de Washington –y a expensas de las economías europeas, ampliamente afectadas por sanciones y contrasanciones– para destruir las relaciones económicas y politicas entre Rusia y la Unión Europea, [relaciones] nefastas para los intereses estadounidenses. En esa misma estrategia se inscribe el creciente traslado de fuerzas militares estadounidenses hacia la región Asia/Pacífico, con objetivos antichinos. La US Navy anunció que, en 2020, tendrá concentrado en esa región el 60% de sus fuerzas navales y aereas.\\nLa estrategia estadounidense está enfocada hacia el Mar de China Meridional, cuya importancia subraya el almirante Harris, jefe del PaCom (el mando militar estadounidense para el Pacífico): por ahí transitan anualmente 5 000 millardos [ 1 ] de dólares en mercancías por vía marítima, incluyendo un 25% de las ventas mundiales de petróleo y un 50% de las ventas de gas natural.\\nEstados Unidos quiere controlar esa vía marítima en nombre de lo que el almirante Harris define como una « libertad de navegación fundamental para nuestro modo de vida aquí y en Estados Unidos » y atribuye a China « acciones agresivas en el Mar de China Meridional, similares a las de Rusia en Crimea ». Así que la US Navy « patrulla » el Mar de China Meridional.\\nTras Estados Unidos llegan las principales potencias europeas: en julio pasado, Francia pidió a la Unión Europea « coordinar el patrullaje naval en el Mar de China Oriental para garantizar una presencia regular y visible en esas aguas ilegalmente reclamadas por China ». Y mientras Estados Unidos instala en Corea del Sur sistemas « antimisiles » –pero capaces de lanzar también misiles nucleares, como los instalados contra Rusia en Rumania y próximamente en Polonia, además de los que llevan los navíos de guerra desplegados en el Mediterráneo– el secretario general de la OTAN Jens Stoltenberg recibe el 6 de octubre, en Bruselas, al ministro de Exteriores sudcoreano Yun Byung-se para « fortalecer la asociación de la OTAN con Seúl ».\\nEsos hechos y muchos más demuestran que en Europa y en Asia se está aplicando la misma estrategia. Es el intento desesperado de Estados Unidos y las demás potencias occidentales por conservar la supremacía económica, política y militar en un mundo en plena transición, donde están surgiendo nuevos actores estatales y sociales.\\nLa Organización de Cooperación de Shanghai (OCS), nacida del acercamiento estratégico entre China y Rusia, dispone de recursos y capacidades de trabajo que pueden convertirla en el área de integración económica más grande del mundo. La organización de Shanghai y los países del grupo BRICS (Brasil, Rusia, India, China, Sudáfrica) son capaces, con sus organismos financieros, de tomar en gran parte el lugar que actualmente ocupan el Banco Mundial y el Fondo Monetario Internacional (FMI), dos instituciones que durante los últimos 70 años permitieron a Estados Unidos y las principales potencias occidentales dominar la economía mundial mediante préstamos dignos de usureros a los países endeudados y otros instrumentos financieros. Los nuevos organismos pueden concretar a la vez la desdolarización de los intercambios comerciales, con lo cual privarían a Estados Unidos de la posibilidad de transferir a otros países su propia deuda al imprimir el papel moneda utilizado como divisa internacional dominante.\\nPara mantener su cada vez más tambaleante supremacía, Estados Unidos no sólo utiliza la fuerza militar sino también otras armas a menudo más eficaces que las armas propriamente dichas.\\n Primera arma: los llamados « acuerdos de libre comercio », como la « Asociación Transatlántica de Comercio e Inversiones » (TTIP) con la Unión Europea y la « Asociación Transpacífica » (TPP) cuyo objetivo no es solamente económico sino también geopolítico y geoestratégico. Es por eso que Hillary Clinton califica la asociación Estados Unidos-Unión Europea como el « objetivo estratégico más grande de nuestra alianza transatlántica », proyectando una « OTAN económica » que integraría [la OTAN] política y militar.\\nEl proyecto está claro: formar un bloque político, económico y militar Estados Unidos-Unión Europea, también bajo el mando de Estados Unidos, para oponerlo al área euroasiática en ascenso, que a su vez se basa en la cooperación entre China y Rusia; y oponerlo también a los BRICS, a Irán y a cualquier otro país que se sustraiga al control de Occidente.\\nComo las negociaciones sobre el TTIP encuentran dificultades para avanzar, a causa de las divergencias en materia de intereses y de una amplia oposición en Europa, actualmente tratan de recurrir al « Acuerdo Económico y Comercial Global » (CETA) entre Canadá y la Unión Europea, que no es otra cosa que un TTIP disimulado ya que Canadá es firmante del NAFTA [ 2 ] con Estados Unidos. El CETA será probable firmado por la Unión Europea el próximo 27 de octubre, en ocasión de la visita del primer ministro canadiense a Bruselas.\\n Segunda arma: la penetración en los países designados como blancos para desintegrarlos desde adentro.\\nSe recurre para ello a los puntos débiles que todo país puede presentar: la corrupción, el deseo de ganar dinero, el arribismo político, el secesionismo fomentado por grupos de poder locales, el fanatismo religioso, la vulnerabilidad de las masas ante la demagogia política. Apoyándose también, en ciertos casos, en un descontento popular justificado hacia la conducta del gobierno del país.\\nLos instrumentos de penetración son las llamadas « organizaciones no gubernamentales » (ONGs) que en realidad obedecen al largo brazo del Departamento de Estado y de la CIA, que con enormes medios financieros han organizado las « revoluciones de colores » en el este de Europa y que también trataron de realizar una operación similar en Hong Kong con la llamada « Revolución de los Paraguas » (« Umbrella Révolution »), tendiente a fomentar movimientos similares en otras zonas de China pobladas por minorías.\\nEsas mismas organizaciones operan en Latinoamérica, fundamentalmente tratando de subvertir las instituciones democráticas en Brasil [país miembro del grupo BRICS], saboteando así a los BRICS desde adentro.\\nOtro instrumento de la misma estrategia son los grupos terroristas, como los grupos armados e infiltrados en Libia y en Siria para sembrar el caos, contribuyendo a la destrucción de Estados enteros que son al mismo tiempo agredidos desde el exterior.\\n Tercera arma: las « PsyOps » (Operaciones psicológicas) que se realizan a través de los canales mediáticos mundiales, operaciones que el Pentágono define de la siguiente manera:\\n« Operaciones planificadas para influir a través de determinadads informaciones sobre las emociones y motivaciones, y por tanto en el comportamiento de la opinión pública, de organizaciones y gobiernos extranjeros, con el fin de inducir o fortalecer actitudes favorables a los objetivos predeterminados. »\\nMediante esas operaciones, que acondicionan a la opinión pública para que acepte la escalada belicista, se presenta a Rusia como responsable de las tensiones en Europa y a China como responsable de las tensiones en Asia, acusándolas simultáneamente de « violaciones de los derechos humanos ».\\nManlio Dinucci y su esposa, Carla, ante la casa natal de Mao Tse Tung, en 1965. Permítanme una última consideración. Por haber trabajado en Pekín en los años 1960, donde contribuimos juntos a la publicación de la primera revista china en italiano, puedo decir que viví una experiencia formativa fundamental en el momento en que China –liberada desde hacía apenas 15 años del control colonial, semicolonial y semifeudal– se hallaba completamente aislada y ni Occidente ni las Naciones Unidas la reconocían como Estado soberano.\\nDe aquel periodo quedaron profundamente grabados en mi recuerdo la capacidad de resistencia y la conciencia de aquel pueblo –por entonces 600 millones de personas– inmerso, bajo la dirección del Partido Comunista, en la construcción de una sociedad con bases económicas y culturales totalmente nuevas. Pienso que aquella capacidad es también necesaria hoy en día para que la China de nuestros tiempos, que está desarrollando su enorme potencial, logre resistir ante los nuevos planes imperiales de dominación, contribuyendo con ello a la lucha decisiva por el porvenir de la Humanidad: la lucha por un mundo sin guerras, donde triunfe la paz indisolublemente vinculada a la justicia social.\\nManlio Dinucci'"}, "time": 1742564405.8454}