{"duration": 0.06015348434448242, "input_args": {"text": "'UNITED NATIONS  —   The American envoy to the United Nations, Nikki R. Haley, described the United States on Wednesday as the “moral conscience” of the world, and she dismissed the United Nations Human Rights Council as “so corrupt” without offering evidence. Ms. Haley said the United States would never close its doors to foreigners who flee persecution, even as she defended the Trump administration’s travel ban, which closed the door to refugees from six   mainly Muslim nations. She insisted that American taxpayers should get value for the money they contribute to the United Nations. She said nothing about whether the United States would help head off a potential humanitarian disaster from famine that the United Nations has warned is looming over 20 million people abroad. Ms. Haley’s remarks, made at the Council on Foreign Relations in New York early Wednesday morning, were her first as ambassador to an audience of foreign policy experts. She called it “an intimidating crowd. ” She briefly channeled her boss, President Trump, by describing the United Nations as “basically a club” that needed to be disrupted. “The fact is, a wave is building throughout the world,” Ms. Haley said. “It’s a wave of populism that is challenging institutions like the United Nations, and shaking them to their foundations. ” Exactly how Ms. Haley proposes to disrupt the world body is not clear, beyond slashing American financial support, as Mr. Trump signaled with his budget outline. She declined to say how deep those cuts would turn out to be, saying she was in discussions with members of Congress who ultimately control the purse strings. “This is a time, in short, to show the people reasons to support the U. N.,” she said. Speaking to the council, Ms. Haley took a very different tone than she had with a different audience earlier in the week. On Monday night, at a policy conference held by the American Israel Public Affairs Committee, the   lobbying group, Ms. Haley spoke of the utility of   shoes in diplomacy: “If I see something wrong, we’re going to kick them. ” The remark was met with huge applause. In her remarks on Wednesday, Ms. Haley, a former governor of South Carolina, relied on familiar colloquial expressions and offered few specifics about the many foreign policy challenges facing the administration. “We’re not afraid to call out the governments that don’t have our backs,” she said in her opening remarks, without naming names. “The beauty of this administration is, all bets are off,” she said in response to a question. “We’re not going to look at how things were done in the past. ” Ms. Haley mentioned, as she has before, that the administration would closely scrutinize United Nations peacekeeping efforts, and said that the United States should bear no more than 25 percent of the total costs, a reduction from the current 28 percent. She cited what she called a “ridiculously biased report attacking Israel,” and criticized the Security Council for holding monthly meetings about the   conflict. (The council also discusses Yemen every month and Syria three times a month.) Ms. Haley demurred when asked about proposals to expand the Security Council and about how to achieve peace in Syria, except to say that the country’s president, Bashar   was “a big hindrance. ” She was not asked about two important challenges for the United Nations system, climate change and famine. She used her address to deliver a pointed attack on the United Nations Human Rights Council, the main international body meant to promote and defend human rights. “I mean, the Human Rights Council is so corrupt,” she said, adding that it includes “bad actors” who use it to protect themselves. Several countries with poor human rights records, including China and Saudi Arabia, have indeed won seats on the council. But the United States has itself used its seat to forcefully defend its allies, including Saudi Arabia, which has been accused of abuses in the war in Yemen. Ms. Haley said she would attend the Human Rights Council’s June session, but declined to say whether she favored withdrawing from the body. The United States withdrew from its predecessor, the Commission on Human Rights. Ms. Haley argued that the Security Council  —   where the United States has a veto  —   should be the United Nations body addressing human rights issues. She said she would organize a session on the topic in April when the United States takes its turn in the council’s rotating presidency. The Security Council has taken up human rights in the past, and sought to refer the situation in Syria to the International Criminal Court, but Russia and China blocked the move with their vetoes. Perhaps the most uncomfortable moment of Ms. Haley’s speech on Wednesday came when she tried to defend Mr. Trump’s travel ban. She insisted that it was not meant to exclude Muslims, but to strengthen vetting procedures for asylum seekers. At one point, she cited this month’s London terrorist attack as a justification for the travel ban. The audience murmured audibly the London assailant was a   Briton.'"}, "time": 1742562072.5033684}