{"duration": 0.1369781494140625, "input_args": {"text": "'Le terrorisme régional vise à protéger les intérêts d\\'Israël Wed Oct 26, 2016 9:35AM Iran Le ministre iranien de la Défense, le général Hossein Dehqan. ©Tasnim #iran #terrorisme \\nSelon le ministre iranien de la Défense, le général de brigade Hossein Dehqan, l\\'objectif de la création et de la propagation du terrorisme et de l\\'extrémisme dans la région est de protéger le régime israélien. \\nLe général Hossein Dehqan, ministre iranien de la Défense, a indiqué, lors d\\'une réunion du comité stratégique de défense de ce ministère, que la création et l\\'extension du terrorisme et de l\\'extrémisme visaient à protéger les intérêts du régime israélien, à maintenir l\\'instabilité dans la région et à y prolonger la présence des forces d\\'occupation arrogantes. \\n\"Les États-Unis et leurs alliés régionaux et internationaux scandent des slogans humanitaires d\\'un côté, mais de l\\'autre ils donnent le feu vert aux groupes terroristes tels que Fatah al-Cham (ex-Front al-Nosra), les autorisant ainsi à enfermer les civils dans les zones de combat et à les utiliser comme boucliers humains pour endiguer les opérations antiterroristes de l\\'armée syrienne, ce qui assure la survie des terroristes,\" a dit le ministre iranien de la Défense. \\n\"Pourtant, l\\'une des priorités et des principales préoccupations des commandants du front de la Résistance, est de sauver le peuple et de préparer leur évacuation hors des régions non sécurisées. C\\'est avec ce même souci qu\\'ils ont sauvé, d\\'ores et déjà, la vie de milliers de gens sans défense\", poursuit-il. \\n\"Dans tout lieu où une opération antiterroriste se dirigeait vers la victoire, les États-Unis et leurs alliés ont recouru à des projets mensongers de cessez-le-feu et procédéà des démarches prétendument pacifistes, dans le but, en fait, de sauver les terroristes, alors qu\\'au moment où les terroristes commettaient crimes et massacres, ils n\\'avaient fait qu\\'observer le silence.\", a regretté le général Dehqan. \\n\"Dès le début de la formation des groupes terroristes takfiristes, la RII avait mis en garde contre les maux inimaginables que causeraient ces derniers en menaçant la sécurité de la région, voire du monde entier. L\\'ordre de l\\'Arrogance poursuit toutefois tous ses soutiens à ces groupes extrémistes\", a-t-il rappelé. \\nLe ministre iranien de la Défense a exigé alors que l\\'on mette fin à la crise régionale, ce qui n\\'est possible, selon le responsable iranien, qu\\'avec la fin du soutien des États-Unis et de leurs alliés au terrorisme, le rejet du projet de démembrement des pays de la région, la reconnaissance des gouvernements légaux et l\\'aide à la lutte contre le terrorisme. Loading ... '"}, "time": 1742561708.982726}