{"duration": 0.10420966148376465, "input_args": {"text": "'I remember signing up for Facebook ten years ago. At this point in time, the new social media site was geared mostly toward college students and it was uncommon for anyone over the age of 25 to have an account. \\nBut over the last decade we’ve seen Facebook morph into a $50 billion conglomerate and information kingpin acquiring massive power and wealth from the endless amounts of time users waste scrolling through their news feeds. This beast of a social media platform has gone on to consume the lives of millions, gather nefarious amounts of data, foster unnecessary personal dramas, and often cause more harm than good for its users. \\nIt would be prudent to take a good hard look at your Facebook experience and ask yourself if it’s something that’s actually adding value to your life. Here are five reasons why you should think carefully before using the world’s largest social media site. \\n1. Your Facebook Feed Is A Black Hole Of Completely Worthless Information \\nI think it’s important to create streams of information that add real value to your life. Through platforms such as Twitter, Feedly, and YouTube, I’ve followed writers and content producers that have dedicated their lives to self-improvement, entrepreneurship, higher meaning, and the search for truth. \\nSo you can probably imagine the stark difference between an intellectually curated Twitter feed and the dumbed-down Facebook community of people you went to high school with that peaked in the 12th grade. \\nLog into your Facebook and the most common information you’ll likely find is who got married, who had kids, and who got fat. Scrolling through your Facebook feed is akin to flipping through a more personalized celebrity gossip magazine at the grocery store checkout line. \\nEvery time I log onto Facebook I’m immediately reminded why I never log onto Facebook. \\n2. It’s No Longer Useful For Dating \\nIn college, I gained some value out of the site by using its chat feature to build up attraction with girls in my social circle and get their phone numbers. \\nBut over the years, most girls have attached the “creepy” stigma to guys who hit them up via Facebook messenger. \\nIn addition to that, you don’t really need a Facebook profile for “social proof” as you once did since Instagram is a better social media app for meeting girls . \\n3. Forfeiture Of Your Privacy \\nMost people have realized by now that the first thing a potential employer will do after interviewing you is look you up on Facebook. They’re basically searching for any and every reason not to hire you. Lock your account down as best you can with privacy functions. Don’t let that one drunk picture of you from 5 years ago ruin a potential job offer. \\nIf that wasn’t enough, Facebook has a long history of shady activities when it comes to privacy. They’ve already been caught accessing your location without permission. We can only speculate what else they’ve been infringing on.\\n\\n4. Censorship \\nAlthough Facebook has a right to control the information broadcasted on it’s platform, that doesn’t mean they should abuse that right by censoring anything they might find disagreeable or offensive. \\nMuch like an overbearing parent, Facebook proactively controls the discourse of its children, eagerly censoring content that might rub someone the wrong way. Facebook has so many overreaches that an entire website has been dedicated to documenting their affronts on freedom of opinion. You can probably guess which side of the political spectrum they try to stifle.\\n\\n5. It Brings Out The Worst In People \\nPlenty of time has now passed for in-depth research to come out regarding the long-term effects that too much Facebook can have on a person’s mental well-being. It gives the illusion that everyone else has it better than you and that your life just isn’t fair. This is a slippery slope into a victim mindset and blaming others for your circumstances. How oppressed these chronic Facebook users are as they sip lattes from a comfy chair in Starbucks and scroll through their Facebook feeds on the latest Macbook.\\n\\nI won’t completely deny the merits of Facebook. If you’re using it to build a brand or a business then it could be a good investment of your time, simply because so many people actively use it. I’ve also witnessed the joy it brings to older users for connecting with long lost friends they haven’t seen in decades. \\nBut the truth is that in many cases, Facebook does cause more trouble than it’s worth. It’s never a bad idea to cut back on your usage or even just opt out entirely. You may no longer be the first to know about an upcoming dinner party or what Brad and Sarah from freshman year have been up to all these years, but I suspect you might be better off as a person.\\n\\nRead More: Is Western Civilization Worth Saving? \\n'"}, "time": 1742561975.598081}