{"duration": 0.009274482727050781, "input_args": {"text": "'Liberals Brag With Pic Of Hillary, FURIOUS At What Snuck In Behind Her Posted on November 1, 2016 by Alisha Rich in Politics Share This \\nIt’s been a rough week for crooked Hillary Clinton, and things only seem to be getting worse. She’s panicking behind closed doors, and things are now spiraling out of control after a popular liberal newspaper attempted to brag about the presidential hopeful by using a picture of her in Florida. However, liberals were left furious when they realized what snuck in behind her in the photo. \\nHillary Clinton stopped at an early voting location to do a little last-minute campaigning in Pompano Beach, Florida. When The New York Times obtained a picture of Hillary at the event, they decided to run the picture in their newspaper. However, the editors made one massive mistake that left them not only furious but embarrassed as to what they had accidentally published behind Hillary in the picture \\nAccording to The Gateway Pundit , “You know the wheels are falling off your crooked campaign when the far left NY Times” publishes a picture of Hillary Clinton surrounded by Trump supporters. At least six Trump signs can be seen in the photo, making them hard to miss, but liberals have been known to turn a blind eye to obvious things, such as the dirty deeds of their crooked candidate. \\nAs Mad World News has previously reported, Hillary’s problems only got worse when those Trump supporters were heard chanting three brutal words, “Lock her up.” Of course, she chose to ignore their bold statement and focused on her few supporters who were in attendance and were mildly excited for her presence. \\nClearly, Hillary Clinton’s campaign is imploding and her chances of being elected as the next president are getting smaller and smaller on a daily basis. Obviously, it’s her own fault. \\nPerhaps if she had learned how to be a bit more honest and a lot less corrupt, she wouldn’t have anything to worry about from the FBI or the American voters. However, that’s not the case for the crooked Clinton, and it’s becoming a no-brainer that Donald Trump is going to be in the Oval Office, working to make America great again.'"}, "time": 1742628433.818238}