{"duration": 0.0676412582397461, "input_args": {"text": "'What does the future hold for Russian politics? The September parliamentary elections in Russia proved once again that the power of the Russian president and his party remains largely uncontested. But how will this impact Russia’s future political and economic development? The September parliamentary elections in Russia proved once again that the power of the Russian president and his party remains largely uncontested. But how will this impact Russia’s future political and economic development? \\n\\nGrigory Yavlinsky, the leader of the one of the major liberal parties in Russia - Yabloko. Even though the party\\'s ;claim for the role of a uniting force for all democrats appeared more convincing than five years ago, Yabloko failed to attract supporters in Duma elections. Photo: TASS \\nOn Sept. 18, the Russian public went to the election polls to vote for candidates for the State Duma, the lower chamber of the country’s parliament. But, as many experts predicted, the election did not bring any change to the current political system. Similarly to the previous parliament, the new one contains the same four parties – United Russia, the Liberal Democratic Party of Russia (LDPR), the Communist Party and A Just Russia.\\nThe success of Putin and United Russia as the “party of power” is unquestionable, but does it mean that this status quo will remain for long? And how will the recent shakeups in the country’s political elite influence the direction the country is taking?\\nRussia Direct examines these question in its new analytical report, \" Hawks vs. Doves: Russia\\'s political drama heading into 2018 ,\" featuring expert insights from several prominent Russian experts: Yuri Korgunyuk of INDEM Foundation, Andrei Kolesnikov of Carnegie Moscow Center, and Mikhail Zygar, former editor-in-chief of the independent Russian TV channel Dozhd.\\nIn his thorough analysis of the outcomes of the State Duma elections, Korgunyuk explains what tools helped the Kremlin ensure its leading position in power and discusses what factors accounted for the defeat of the liberal opposition, represented most importantly by the Yabloko and PARNAS parties.\\nAlthough the victory of United Russia is clear, it still will face many challenges in keeping its power in the long run . According to him, one cannot exclude that at some point, when the regime feels vulnerable, it will turn to using tough measures to strengthen its position, as it was exactly these measures that helped to stop the nation’s incipient protest wave in 2011-2012.\\n“Such measures will only cement the problems accumulated in the economy and society while erasing the traditional ways of solving them within the existing system,” he writes. This in turn might make political regime change more possible.\\nJames Sherr, associate fellow at Chatham House, also thinks that the success of the ruling party in the election does not necessarily reflect a positive trend. As he sees it, the real issues in Russia involve the relationship between the people and power at various levels. While in some parts of the country it is good, in other places it leaves much to be desired. “There is still a real possibility of discord rising locally at different levels in ways that people had difficulties predicting before,” he says.\\nAccording to Kolesnikov, the results of the Duma elections provide a preview of what to expect in 2018 presidential elections and beyond that. Building on his analysis on the results, he argues that even though it is highly likely that Putin is going to be re-elected in 2018, it poses problems for the authorities to create at least some kind of competition in 2018 elections. The expert discusses the liberal and conservative camps in Putin’s closest circle and explains why the transition of power (which is bound to happen at some point) will be very difficult in Russia.\\n“If technocrats and liberals are able to persuade him that his security depends on democracy, he might chose this path, yet, again, not because he likes democracy,” he argues.\\nThe question of whether Russian society is ready for democracy has been on the table for quite some time now. However, according Zygar, who has recently authored a book on Putin and the people surrounding him, that’s not the best way to think about the current Russian political scene.\\nZygar warns against oversimplifying the picture and supports those who see Russia as a country where people differ in their political views and aspirations. While liberals and conservatives oppose each other in many respects, they do not represent the general public, which tends to remain politically apathetic. They are occupied with their daily routines and don’t want to be bothered. Hence, “a lot depends on the current political situation,” he argues.\\nWho will dominate in the Kremlin before the 2018 elections? ; Download the report and find out . '"}, "time": 1742561833.1888416}