{"duration": 0.17173385620117188, "input_args": {"text": "'Written by Tyler Durden Sunday November 20, 2016 In late October, when it was still conventional wisdom that Hillary was \"guaranteed\" to win the presidency, the WaPo explained that among the neo-con, foreign policy \"elites\" of the Pentagon, a feeling of calm content had spread: after all, it was just a matter of time before the \"pacifist\" Obama was out, replaced by the more hawkish Hillary. As the WaPo reported , \"there is one corner of Washington where Donald Trump’s scorched-earth presidential campaign is treated as a mere distraction and where bipartisanship reigns. In the rarefied world of the Washington foreign policy establishment, President Obama’s departure from the White House — and the possible return of a more conventional and hawkish Hillary Clinton — is being met with quiet relief.\" The Republicans and Democrats who make up the foreign policy elite are laying the groundwork for a more assertive American foreign policy via a flurry of reports shaped by officials who are likely to play senior roles in a potential Clinton White House. Oops. Not only did the \"foreign policy\" elite get the Trump \"scorched-earth distraction\" dead wrong, it now has to scramble to find what leverage - if any - it has in defining Trump\\'s foreign policy. Worse, America\\'s warmongers are now waging war (if only metaphorically: we all know they can\\'t wait for the real thing) against libertarians for direct access to Trump\\'s front door, a contingency they had never planned for. As The Hill reported earlier , \"a battle is brewing between the GOP foreign policy establishment and outsiders over who will sit on President-elect Donald Trump’s national security team. The fight pits hawks and neoconservatives who served in the former Bush administrations against those on the GOP foreign policy edges.\" Taking a page out of Ron Paul\\'s book, the libertarians, isolationists and realists see an opportunity to pull back America\\'s commitments around the world, spend less money on foreign aid and “nation-building,” curtail expensive military campaigns and troop deployments, and intervene militarily only to protect American interests. In short: these are people who believe that human life, and the avoidance of war, is more valuable than another record quarter for Raytheon, Lockheed or Boeing. On the other hand, the so-called establishment camp, many of whom disavowed Trump during the campaign, is made up of the same people who effectively ran Hillary Clinton\\'s tenure while she was Secretary of State, fully intent on creating zones of conflict, political instability and outright war in every imaginable place, from North Africa to Ukraine. This group is pushing for Stephen Hadley, who served as national security adviser under George W. Bush. Another Bush ally, John Bolton whose name has been floated as a possible secretary of State, also falls into this camp. According to The Hill, other neo-con, establishment candidates floated include Senate Foreign Relations Committee Chairman Bob Corker (R-Tenn.), outgoing Sen. Kelly Ayotte (R-N.H.), rising star Sen. Tom Cotton (R-Ark.), and senior fellow at conservative think-tank American Enterprise Institute and former Sen. Jim Talent (R-Mo.). \"These figures all generally believe that the United States needs to take an active role in the world from the Middle East to East Asia to deter enemies and reassure allies.\" In short, should this group prevail, it would be the equivalent of 4 more years of HIllary Clinton running the State Department. The outsider group sees things differently. They want to revamp American foreign policy in a different direction from the last two administrations. Luckily, this particular camp is also more in line with Trump’s views questioning the value of NATO, a position that horrified many in the establishment camp. “How many people sleep better knowing that the Baltics are part of NATO? They don\\'t make us safer, in fact, quite the opposite. We need to think really hard about these commitments,” said William Ruger, vice president of research and policy at the Charles Koch Institute. A prominent member of the outsiders is Rand Paul, skeptic of Bush’s foreign policy, who has criticized Bolton in the last few days. Paul on Tuesday blasted Bolton in an op-ed in Rare as “a longtime member of the failed Washington elite that Trump vowed to oppose.” Others, however, have defended Bolton. Eliot Cohen, a former Bush State Department senior adviser, tweeted late Tuesday that Bolton “would be a capable Secretary of State — experienced & tough.” Then again, what Cohen thinks does not matter: he is perhaps the most visible foreign policy establishment type who has been critical of Trump’s transition. He said this week that he had been asked by a friend in Trump’s orbit to submit names of people in the establishment who might want to serve. Cohen told his friend that those skeptical of Trump would want to know who was leading his administration on foreign policy. When Cohen grew critical of those questions, he wrote a biting op-ed in The Washington Post advising people to not work for Trump, at least for the time being. “At the very least, they should wait to see who gets the top jobs. Until then, let the Trump team fill the deputy assistant secretary and assistant secretary jobs with civil servants, retired military officers and diplomats, or the large supply of loyal or obsequious second-raters who will be eager to serve,” he wrote. Some saw the op-ed as good news, believing it signified a radical turn by Trump from a foreign party establishment that should be ignored. “The first encouraging news I\\'ve heard in days. If a leader of #NeverTrump is saying this, that means the establishment hasn\\'t won. Yet,” said Christopher Preble of the CATO Institute. However, neo-cons are bad at losing, so they have redoubled efforts to land one of their own next to Trump. Lindsey Graham, a prominent foreign policy hawk in the Senate, issued an endorsement of Bolton on Thursday, saying: \"He understands who our friends and enemies are. We see the world in very similar ways.\" He also slammed Paul\\'s criticism of Bolton: “You could put the number of Republicans who will follow Rand Paul’s advice on national security in a very small car. Rand is my friend but he’s a libertarian and an outlier in the party on these issues.\" Funny, that\\'s exactly what the experts said about Trump\\'s chances of winning not even two weeks ago. Meanwhile, the biggest warmonger, Senate Armed Services Committee Chairman John McCain, who has not said who he\\'d like to see in Trump\\'s cabinet, laid down a marker on Tuesday by warning the future Trump administration against trying to seek an improved relationship with adversary Russia. “When America has been at its greatest, it is when we have stood on the side those fighting tyranny. That is where we must stand again,” he warned. Luckily, McCain - whose relationship with Trump has been at rock bottom ever since Trump\\'s first appearance in the presidential campaign - has zero impact on the thinking of Trump. Furthermore, speaking of Russia, Retired Amy Col. Andrew Bacevich said there needs to be a rethink of American foreign policy. He said the US must consider whether Saudi Arabia and Pakistan qualify as US allies, and the growing divergence between the US and Israel. “The establishment doesn\\'t want to touch questions like these with a ten foot pole,” he said at a conference on Tuesday hosted by The American Conservative, the Charles Koch Institute, and the George Washington University Department of Political Science. Furthermore, resetting the \"deplorable\" relations with Russia is a necessary if not sufficient condition to halt the incipient nuclear arms build up that has resulted of the recent dramatic return of the Cold War. As such, a Trump presidency while potentially a failure, may be best remember for avoiding the launch of World War III. If, that is, he manages to prevent the influence of neo-cons in his cabinet. And then there are the wildcards: those Trump advisers who are difficult to peg into which camp they fall into. One example is retired Army Lt. Gen. Michael Flynn, former head of the Defense Intelligence Agency, who was selected by Trump as his national security adviser. Flynn is a “curious case,” said Daniel Larison, senior editor at The American Conservative. The retired Army general has said he wants to work with Russia, but also expressed contrary views in his book \"Field of Fight.\" According to Larison, Flynn writes of an “enemy alliance” against the US that includes Russia, North Korea, China, Iran, Syria, Cuba, Bolivia, Venezuela, Nicaragua, al-Qaida, Hezbollah, and the Islamic State in Iraq and Syria. From that standpoint, he is about as \"establishment\" as they come. It\\'s also not crystal clear which camp Giuliani falls into. The former mayor is known as a fierce critic of Islamic extremism but has scant foreign policy experience. Most say what is likely is change. “Change is coming to American grand strategy whether we like it or not,’ said Christopher Layne, Robert M. Gates Chair in National Security at Texas A&M University. “I think we are overdue for American retrenchment. Americans are beginning to suffer from hegemony fatigue,” he said. And, let\\'s not forget, the tens of thousands of innocent men, women and children who are droned to death every year by anonymous remote-control operators in the US just so the US can pursue its global hegemonic interest.They most certainly have, and unless something indeed changes, will continue to suffer, leading to even more resentment against the US, and even more attacks against US citizens around the globe, and on US soil. Some call them terrorism, others call them retaliation. Reprinted with permission from ZeroHedge . Related'"}, "time": 1742561873.394788}