{"duration": 0.06316566467285156, "input_args": {"text": "'The U.S. government’s power to assassinate By Jacob Hornberger Posted on November 2, 2016 by Jacob Hornberger \\nThroughout the presidential campaign, including the presidential debates, among the issues that have not been raised or discussed is the federal government’s power to assassinate. The power to assassinate is now consider an accepted power of the federal government. In fact, most people, especially mainstream reporters and pundits, treat federal assassinations with blasé and nonchalance. \\nMost people undoubtedly believe that the federal government’s power of assassination was acquired only after the 9/11 attacks and as part of its “war on terrorism.” \\nBut that’s simply not true. The federal government’s power to assassinate people stretches all the way back to the decision to convert the federal government into a national-security state in the latter half of the 1940s. It didn’t take the CIA, one of the principal components of the national-security establishment, long before it adopted and exercised this extraordinary power in its effort to defeat the Soviet Union in the Cold War and to protect the United States from going communist. \\nLet’s go back to 1954. The CIA had decided that the people of Guatemala had made a mistake in electing a man named Jacobo Arbenz as their president. Arbenz was a socialist. He was also a person who believed that everyone, including communists, had the right to participate in the political process. \\nWhen Arbenz began seizing land belong the giant U.S. corporation United Fruit, which was the largest landowner in Guatemala and had connections to members of Congress and members of the national-security establishment, and distributing it to the poor, the CIA targeted him for a regime-change operation. In the eyes of the CIA, Arbenz’s land-reform plan confirmed that he was operating under the direction of an international communist conspiracy based in Moscow. \\nAs part of that operation, the CIA prepared a kill list for the man who would replace Arbenz, a brutal army colonel named Carlos Castillo Armas. The CIA’s kill list consisted of suspected socialists. The idea was that there would be nothing wrong with assassinating or executing people who believed in socialism or communism. \\nFortunately for Arbenz, he decided to leave the country before the CIA’s handpicked replacement was able to kill him. \\nIn the 1960s, the CIA entered into a partnership with the Mafia to assassinate Fidel Castro. What had Castro done to deserve being assassinated? He had certainly never attacked the United States or even threatened to do so. Like Arbenz, his “crime” was that he was a socialist or a communist. That’s all the justification the CIA needed to murder him. \\nIn the 1970s, the CIA participated in the assassination of a man named Rene Schneider. Who was Schneider? He was the commanding general of Chile’s armed forces. He also had a wife and children. \\nMore important, he was an insurmountable obstacle to U.S. hopes for a military coup that would prevent Chile’s democratically elected socialist president, Salvador Allende, from taking office. Schneider’s position was that he had taken an oath to support and defend the constitution of Chile, which, like the U.S. Constitution, did not provide for a military coup as a way of replacing a democratically elected president. \\nSince President Richard Nixon and the CIA wanted the coup, the CIA targeted Schneider for a violent kidnapping that would remove him from the scene. When the kidnapping attempt took place, Schneider, who was armed, fought back and was shot dead by the kidnappers. \\nWhen the CIA’s role in the kidnapping-murder came to light years later, the CIA maintained that it only wanted Schneider kidnapped, not killed. The CIA’s claim, however, was disingenuous. After all, what did the CIA think the kidnappers would do with Schneider after he was kidnapped? Since the reason he was being violently removed from the scene was so that he could no longer obstruct a U.S.-orchestrated military coup, there was no possibility that he would ever be returned alive. Assassination/execution had to be part and parcel of the original kidnapping scheme, something that Schneider himself undoubtedly recognized, which had to be the reason he fought back rather than letting himself be taken captive. \\nOf course, under the legal concept of felony-murder, the CIA was as responsible for the murder of Rene Schneider as the people who shot him dead. That concept holds that when a person is killed during the commission of the felony, all the participants to the felony are legally responsible for the murder as well as the felony. \\nConsider the execution/assassination of two young American men during the Chilean coup—Charles Horman and Frank Teruggi. Many years after the coup, a top-secret State Department investigative report stated that U.S. intelligence had played a role in their murders and recommended deeper investigation. \\nOf course, no further investigation took place and no one, needless to say, was ever indicted here in the United States for the murders of those two men. By the 1970s, the CIA had simply become too powerful for any U.S. official to suggest that it be held to account for the murder of two innocent men. \\nWhy did U.S. intelligence agents want Horman and Teruggi killed? They were socialists. They had supported Salvador Allende, Chile’s democratically elected socialist president. They also opposed the Vietnam War. As journalists, they were also exposing the deep U.S. involvement in Chile’s democratic affairs. Moreover, Horman had inadvertently discovered U.S. complicity in the coup itself, which he planned to write about. Of course, U.S. officials were equally determined to keep their role in the coup top secret. \\nSeveral weeks ago, the U.S. mainstream press commemorated the 40th anniversary of the assassination on the streets of Washington, D.C., of former Allende administration official Orlando Letelier and his 25-year-old assistant Ronni Moffitt. The assassination was carried out as part of Augusto Pinochet’s top-secret international assassination program known as Operation Condor, an operation that the CIA not only partnered in but also most likely planned and orchestrated as part of its post-coup relationship with Pinochet. \\nWhy did Pinochet target Orlando Letelier for assassination? For the same reason that the CIA, which helped install Pinochet into power, targeted Arbenz, Castro, Horman, and Teruggi for assassination: Letelier was a socialist, as was Ronni Moffitt. \\nIronically, while still condemning Pinochet for assassinating Letelier and Moffitt, the U.S. mainstream press remains silent., blasé, or even supportive of the U.S. national-security state’s assassinations or assassination attempts against Jacobo Arbenz, Fidel Castro, Rene Schneider, Charles Horman, and Frank Teruggi. \\nBut let’s face it: when they assassinated Orlando Letelier and Ronni Moffitt the U.S.-installed and U.S-supported dictator Augusto Pinochet and his national-security establishment were simply exercising the same power of assassination that the U.S. national-security establishment has been exercising since its inception in the 1940s and, equally important, that it continues to exercise today. \\nThis work by MWC News is licensed under a Creative Commons Attribution-NonCommercial-NoDerivs 3.0 Unported License . \\nJacob G. Hornberger is founder and president of The Future of Freedom Foundation. This entry was posted in Commentary . Bookmark the permalink .'"}, "time": 1742628495.9350371}