{"duration": 0.16394352912902832, "input_args": {"text": "'MINNEAPOLIS  —   John Kundla sat in a wheelchair playing cribbage opposite his    son, calling out numbers in a quiet, deep voice. The efficiency apartment here had a twin bed under a painting of Jesus tending sheep a desk topped with a large magnifying glass and a Bible and, resting on a shelf, a photograph taken on a basketball court in 1952 showing Kundla atop the shoulders of a jubilant George Mikan, the sport’s most dominant big man in the first half of the 20th century. Kundla, 99, was the head coach of the Minneapolis Lakers’ championship teams of the 1940s and 1950s  —   professional basketball’s first modern dynasty. He is the oldest living Hall of Famer in any of the four major American team sports and one of three N. B. A. coaches, along with Red Auerbach and Phil Jackson, to have won three or more consecutive titles. Kundla is “a forgotten legend of basketball,” according to the historian John Christgau, author of the book “The Origins of the Jump Shot. ” Kundla’s Lakers ruled the league in the years before the shot clock, when players were still shooting free throws underhand. Kundla coached in the N. B. A. ’s first four   Games, and his five league titles are tied for third with Pat Riley and Gregg Popovich. He is also the only coach in league history to win a title in his first two N. B. A. seasons (the first when it was called the Basketball Association of America)  —   a feat that Steve Kerr will match if the Golden State Warriors win this season’s championship. Yet even at the peak of his team’s success, Kundla was so   during games and overshadowed by his talented players that The Sporting News once said, “Few ever heard of John Kundla. ” After coaching, Kundla taught physical education today, he lives about five blocks east of the Mississippi River, in an assisted living home where he plays bingo several days a week, and where, sometimes, he positions his wheelchair a few inches from a small analog television and watches basketball, marveling at the size and speed of modern players. Kundla dresses and cooks by himself, and he exercises daily on a stationary bicycle. His hearing and eyesight have waned, though, and recollections of certain events and facts  —   like the circumstances surrounding his Lakers hiring and how many championships he won  —   have grown hazy with time. Identifying dates and years can give him trouble. But many memories remain vivid and accurate: details about his youth the story of how he met his wife the names and tendencies of players he coached. He still visualizes and recounts plays that he designed around Mikan. He tells of how playing in New York made him a “nervous wreck” of how after winning one title there, he and his players celebrated at the Copacabana nightclub of the joy he felt in that moment, after capturing another championship, when Mikan lifted him onto his shoulders. And it was early one recent evening, in front of a shelf stuffed with worn books on his Minneapolis Lakers and on basketball history, that Kundla spoke about his life, and the game that has defined it. Born in Star Junction, Pa. Kundla moved to Minneapolis at age 5 with his mother, an   immigrant. Neither spoke English. But Kundla learned the language  —   and basketball  —   and went on to star in high school and at the University of Minnesota. In 1937, The New York Times heralded the    Kundla as one “of the finest players in the Midwest. ” In the early 1940s, he coached at Ascension, a Catholic grade school, and then at DeLaSalle, a high school on an island in the Mississippi River. After serving in the Navy during World War II  —   he played pickup basketball games on a ship in the Atlantic Ocean, he said  —   he coached at the College of St. Thomas in St. Paul. In 1947, two Minnesota businessmen bought the Detroit Gems, a team in the National Basketball League that had disbanded after a   season. The new club was called the Lakers, and Kundla, at 31, became its coach. The franchise signed Jim Pollard, a swift and     forward, and Mikan, the   center who wore thick glasses and had an unstoppable hook shot with each hand. Kundla developed set plays, including a   game involving his two superstars, and preached wise shot selection. “Don’t shoot too quick,” he urged his players. “Nobody in for a rebound. ” He emphasized fundamentals, like sprinting back on defense after missed shots and communicating passionately while defending screens. The Lakers were   and won the 1948 N. B. L. championship. The next season, they joined the B. A. A. (which the N. B. A. considers its predecessor) defeating the Washington Capitols, coached by Auerbach, in the finals. The Lakers played most of their home games at Minneapolis Auditorium, which had steep seats and a theatrical stage behind one basket. Christgau, 82, who attended Lakers games there growing up, recalls peering through the arena’s cigar smoke during timeouts to see an “always calm and cool” Kundla, with “players all clumped around him, like a hog pile, all listening and paying attention. ” Road trips often meant long journeys by train, during which Kundla and his players bonded over card games. “It was like a family playing for John,” said Arnie Ferrin, 90, who played for the Lakers from 1948 to 1951. Before the   season, the B. A. A. and the N. B. L. merged to form the N. B. A. The Lakers acquired the rookies Vern Mikkelsen, a rugged and savvy big man, and Slater Martin, a short,   Texan known for gritty defense. They were   and beat the Syracuse Nationals in the championship. Guard Pep Saul, whom the Lakers purchased in 1952, was struck by how quiet Kundla was compared with other coaches. If a player made a mistake, “he didn’t holler at you,” Saul, 92, said. “He would talk to you like a man and say, ‘Here’s what you have to do to correct it.’ He was a teacher as well as a coach. ” The Lakers kept winning, even after the league doubled the lane’s width in 1951 to slow down Mikan, who had led the N. B. A. with more than 27 points per game for three straight seasons. They beat the Knicks in the 1952 and 1953 championships, and in 1954, they won their third straight title and fifth in six years. By late 1956, Mikan and Pollard had retired. The game had evolved: Scoring was up  —   the shot clock had been instituted in 1954  —   and the racial makeup of the league was changing. The Lakers’ title teams had been all white in the   season, the team had three black players. The Lakers were   that season. Behind the rookie Elgin Baylor, they advanced to the championship before falling to the Boston Celtics, led by Bob Cousy and Bill Russell. Kundla resigned at age 42 with a   record. (In 1960, the Lakers moved to Los Angeles, becoming the league’s first West Coast team.) Kundla, meanwhile, took over as head coach at the University of Minnesota. During his tenure, the basketball program included black players for the first time, and he became its first coach to give scholarships to   players. (Hate mail arrived regularly at his house, he said.) Led by the future N. B. A.   Lou Hudson and Archie Clark, the Gophers were   in   and   in  . In 1968, Kundla retired, finishing his career there with a   record. He accepted a position teaching physical education on the university’s St. Paul campus, including courses in basketball and tennis. He and his wife, Marie, who had met as undergraduates, had raised six children in a white,   suburban house with a wooden hoop nailed to the garage. The couple went ice skating together every Tuesday and took their children on fishing trips. In 1981, Kundla retired from teaching. Throughout the years, he had remained close with Mikan and Mikkelsen often, the three would meet for breakfast, and reminisce. In a 1992 column for USA Today, Peter Vecsey, lamenting Kundla’s exclusion from the Hall of Fame, labeled him “all but forgotten. ” From Kundla’s   window, one can see beyond the river, to downtown Minneapolis, where the Lakers’ arena once stood. He moved into this assisted living community in 2008, the year after Marie died, after 67 years of marriage. Kundla’s son James, a retired railroad track worker, walks over every morning from his nearby home and keeps him company. Once a month, Kundla rides by bus with fellow residents to a church downtown for bingo and lunch organized by the League of Catholic Women. He also plays bingo downstairs and at an adjoining nursing home, where he sits beside residents in need and helps them with their cards. Kundla keeps his own winnings, green notes called Bingo Bucks, in a billfold in the cupboard under his TV, which he redeems every Friday for Hershey bars. At night, Kundla, who has short silver hair and wears hearing aids, watches TV programs like “Dancing With the Stars” and reruns of “The Lawrence Welk Show. ” Earlier this year, James said, the cable company offered a free promotion allowing Kundla to watch N. B. A. games daily. But when the deal expired, the additional cost was “not in the budget,” James said. Kundla listens to Minnesota Timberwolves games on the radio, and when he watches a game on TV, he looks for those “little things,” he said  —   like distinguishing between a good and bad shot  —   that consumed him as a Lakers coach. Basketball has changed for the better, he said. Defensive intensity has improved (“Jeez, they get after you!” he said) and when a team hustles back on defense after a missed shot, he is delighted. The   shot excites him. “That’s the big difference,” he said. “You get behind  —   you can catch up, you know?” Referring to today’s players, Kundla said: “It’s unbelievable how big they’ve grown. But there’s still finesse in there  —   the way they handle that ball, pass it around. ” For Kundla, who turns 100 on July 3 (“Another day and I would have been born with a bang,” he likes to say) proper recognition came relatively late in life: He was inducted into the  Basketball Hall of Fame at age 78, in 1995. The next year, for the “N. B. A. at 50” celebration, he was voted one of the top 10 coaches in league history. In 2002, during a ceremony at Staples Center in Los Angeles, Kundla and living Minneapolis Lakers players were awarded championship rings, and two banners commemorating their dynasty were raised. Since then, four of the five Hall of Famers who played on Kundla’s title teams have died: Mikan, Mikkelsen, Martin and Clyde Lovellette. (Pollard died in 1993.) Bob Harrison, 88, who hit a long   for the Lakers to win Game 1 of the inaugural postmerger N. B. A. championship in 1950, was emotional when reached at his home in Palm City, Fla. and asked about Kundla. In 1954, Harrison said, upon being traded to the Milwaukee Hawks, Kundla sat him down and apologized. “He made me feel important,” Harrison said. “A lot of coaches are more interested in building their reputation, and John wasn’t like that. Naturally, he wanted to win, and he did. But he did it with kindness and love. ” One evening in May, Kundla sat glued to a TV in the dimly lit lounge down the hall from his apartment, watching Game 1 of the Eastern Conference finals. “Look at the tattoos on the shoulders  —   jeez,” Kundla said, as the Cavaliers’ J. R. Smith shot free throws in the first quarter. The second quarter was a noisy blur of fast breaks,   and acrobatic layups by the host Cavaliers. Kundla looked riveted, gradually inching his wheelchair closer to the screen. On one play, Cavaliers guard Kyrie Irving blew past a defender on a fancy    dribble and converted a layup. “Jeez,” Kundla muttered, “poor defense there by Toronto. ” With the Cavaliers ahead by 15, Kundla watched as LeBron James drove the baseline, cupped the ball in his right hand and dunked ferociously, screaming in celebration as he backpedaled. “Oh, my God, another one,” Kundla said. At halftime, Kundla returned to his room. A nurse arrived to check in and then left, and Kundla was alone. On a desk next to his bed was a picture of Kundla and Marie on their wedding day, and a photo of a smiling Mikkelsen in his later years, signed: “To John, my leader and good friend. ” Kundla settled into bed. It was dark now, but from the wall by his pillow came a radiant orange glow: from a tiny night light, in the design of a basketball.'"}, "time": 1742628605.6448483}