{"duration": 0.03261399269104004, "input_args": {"text": "\"Florida’s “deceptive” solar initiative, backed by utilities companies, loses support ‘It's a monopoly wolf in solar sheep's clothing’ By Nika Knight Posted on November 4, 2016 by Nika Knight \\nAs utilities companies funnel millions of dollars into a last-ditch effort to convince Florida voters to pass an anti-solar initiative, the latest polling data shows support for the measure falling . \\nFlorida’s Amendment 1 is “ deceptive ,” environmentalists argue, as it is written in pro-solar language but would in actuality block widespread adoption of solar power in the Sunshine State. \\nThe measure is backed by a political committee formed by utilities companies, which has so far raised more than $26 million to fund the campaign. \\n“As we like to say, ‘it’s a monopoly wolf in solar sheep’s clothing,’” Dr. Stephen Smith, executive director of Southern Alliance for Clean Energy and a founding member of Floridians for Solar Choice, told the Sierra Club’s Sierra magazine. “We are in a pitted battle to stop the utilities from choking off citizen-owned solar.” \\nThe initiative would “write people’s right to own or lease solar panels and other equipment into the state constitution,” InsideClimate News explains . “But it would also make it unconstitutional to require a utility’s non-solar customers to subsidize those who do go solar. Those subsidies have helped make home solar affordable and are the best incentive to push the fast-growing energy source to widespread use.” \\nSupport for the measure fell markedly after an audio recording leaked to the public last month in which a lobbyist working for electric companies bragged about the measure to industry insiders. \\nThe Miami Herald/Times , which released the recording, reported : \\nSal Nuzzo, a vice president at the James Madison Institute in Tallahassee, [ . . . ] called the amendment, which has received more than $21 million in utility industry financing, “an incredibly savvy maneuver” that “would completely negate anything they [pro-solar interests] would try to do either legislatively or constitutionally down the road,” according to an audio recording of the event supplied to the Herald/Times . \\nHe offered others a recommendation: “As you guys look at policy in your state, or constitutional ballot initiatives in your state, remember this: Solar polls very well,” he said. \\n“To the degree that we can use a little bit of political jiu-jitsu and take what they’re kind of pinning us on and use it to our benefit either in policy, in legislation or in constitutional referendums—if that’s the direction you want to take—use the language of promoting solar, and kind of, kind of put in these protections for consumers that choose not to install rooftop. \\n“I’m discouraged as a citizen how far we have slipped and see Amendment 1 as a means of accelerating that decline in solar in Florida,” Graham said, according to the Miami Herald \\nAnd Graham’s far from the only prominent voice to condemn the measure: “Former Vice President Al Gore, speaking at a rally for Hillary Clinton, described the amendment as ‘ phony baloney. ‘ Carl Hiassen, Florida’s best-known opinion journalist, has called the proposal a ‘ slick, oily fraud, ‘ and even the usually apolitical Jimmy Buffett has urged a no vote, noted \\nSuch statements from opponents of the initiative have gone far to quell support, according to a new poll \\nOne of those voters was “Barbara Waks, a retiree who had already mailed in her early-voting ballot when the Herald story appeared. She said that she thought she was supporting renewable energy,” the New York Times reported \\n“I felt so stupid,” she told the Times. “I’m familiar with the political arena and the garbage that exists, but this is beyond the pale. \\nNika Knight is a Common Dreams\""}, "time": 1742628607.3910053}