{"duration": 0.1327054500579834, "input_args": {"text": "'DAVOS, Switzerland  —   You have perhaps noticed that in many countries,   numbers of people have grown enraged at the economic elite and their tendency to hog the spoils of globalization. This wave of anger has delivered Donald J. Trump to the White House, sent Britain toward the exit of the European Union, and threatened the future of global trade. The people gathered here this week in the Swiss Alps for the annual World Economic Forum have noticed this, too. They are the elite  —   heads of state, billionaire hedge fund managers, technology executives. They are eager to talk about how to set things right, soothing the populist fury by making globalization a more lucrative proposition for the masses. Myriad panel discussions are focused on finding the best way to “reform capitalism,” make globalization work and revive the middle class. What is striking is what generally is not discussed: bolstering the power of workers to bargain for better wages and redistributing wealth from the top to the bottom. “That agenda is anathema to a lot of Davos men and women,” said Joseph E. Stiglitz, a Nobel laureate economist and author of numerous books on globalization and economic inequality. “More rights to bargain for workers, that’s the part where Davos man is going to get stuck. The stark reality is that globalization has reduced the bargaining power of workers, and corporations have taken advantage of it. ” Davos is  —   at least rhetorically  —   consumed with worries about the shortcomings of globalization. About the deepening anxieties of the middle class in many developed economies. About the threat of trade protectionism and its attendant hit to economic growth. About the fear that robots are on the verge of sowing mass unemployment. It is a conversation fueled in part by fear: If the world is indeed in the throes of a populist insurrection, the pitchforks could do worse than to point here. The Davos elites have enjoyed outsize influence over economic policies in recent decades as a growing share of wealth has, perhaps not coincidentally, landed in the coffers of people with a need for bank accounts in the British Virgin Islands, while poor and   households have seen their earnings stagnate and decline. Yet the solutions that have currency seem calculated to spare corporations and the wealthiest people from having to make any sacrifices at all, as if there is a way to be found to tilt the balance of inequality while those at the top hang on to everything they have. More entrepreneurialism, mindfulness training, education focused on the modern ways of technology: These are the sorts of items that tend to get discussed here as the response to the plight of those left behind by globalization. That perhaps private equity overseers should not be paid 1, 000 times as much as teachers while availing themselves of tax breaks is thinking that gets little airing here. At a dinner on Monday evening as the forum got underway, Ian Goldin, a professor of globalization and development at Oxford University, celebrated the connectedness of the global economy and the technological advancements that have liberated humans from disease, poverty and the drudgery of manual labor. “There’s never been a better time to be alive, and yet we feel so glum,” Mr. Goldin said. “So many people feel anxious. So many people feel that this is one of the most dangerous times. ” He denounced the frightened retreat from globalization manifest in Mr. Trump’s threats of a trade war with China, and in Britain’s abandonment of Europe, commonly known as Brexit. “You can’t stop managing an entangled environment by disconnecting,” he said. “This is the fundamental mistake of Brexit, of Trump, and of so many others. We are not simply connected. We are entangled. Our lives, our destinies are intertwined. What happens in China, what happens in Indonesia, what happens in India, what happens across Europe, and what happens in North America, across Africa and Latin America will affect all of us in dramatic new ways. The idea that somehow we can forge our future in an insular way, even for the biggest countries like the U. S. is a fantasy. ” And yet, Mr. Goldin said, if the benefits of globalization are not spread more equitably, the world could be in for a replay of the Renaissance, an extraordinary period of scientific progress, commercial growth and artistic creativity in Europe that ultimately yielded popular resentment. The gold leaf landing on cathedrals was not bettering the lot of the peasantry. The spices coming in from Asia were too expensive for most. The Medici family that ruled Florence was sent packing by the mob. Intellectuals were persecuted and books burned. “We need to learn these historical lessons and realize that this is the most precious moment in human history,” Mr. Goldin said. “We need to make the choices to ensure that globalization is sustainable, that connectivity is sustainable, that we deal with the intractable problems that are worrying people. ” But Mr. Goldin’s comments were merely the prelude to a conversation that was supposed to be about how to pull that off. The answers from the corporate executives who comprised a panel could be crudely boiled down to this: The people who have not benefited from globalization need to try harder to emulate those who have succeeded. Abidali Neemuchwala, the chief executive officer of Wipro, the global information technology and consulting company that hosted the event along with The Financial Times  —   and who last year earned some $1. 8 million plus stock grants worth an additional $2 million or so  —   said working people would have to pursue training for the jobs of the future. “People have to take more ownership of upgrading themselves on a continuous basis,” he said. No one can reasonably argue against the merits of training (or entrepreneurialism for that matter). The jobs of the future have not yet been invented. New skills will be required to seize them. But nowhere in the discussion was there a mention of tax policy, or addressing the soaring costs of gaining higher education, or access to health care. At a panel on Wednesday morning, Christine Lagarde, managing director of the International Monetary Fund, injected a rarely heard word into a conversation about the crisis for   households: redistribution. “There are things that can be done,” she said. “It probably means more redistribution than we have at the moment. ” But then the conversation moved on to other subjects. Ray Dalio, founder of the American investment firm Bridgewater Associates  —   who took home $1. 4 billion in compensation in 2015  —   suggested the key to reinvigorating the middle class was to “create a favorable environment for making money. ” He touted in particular the “animal spirits” unleashed by stripping away regulations. For years, economic inequality has ranked as one of the most discussed issues at Davos, both in the formal conference agenda and in the conversations that fill hallways and the private parties and dinners held throughout town. For years, little to nothing has changed. “People talk about inequality, how it’s a major problem, the greatest threat to globalization and the global economy,” Mr. Stiglitz said. “You have to recognize that the way we have managed globalization has contributed significantly to inequality. But I have not yet heard a good conversation about what changes in globalization would address inequality. ” That is not an accident, he surmised. Any sincere list would have to include items that involve transferring wealth and power from the sorts of people who come to Davos to ordinary workers via more progressive taxation, increased bargaining rights for labor unions, and greater protections for labor in general. Same as every other year, Davos is again plastered with the slogan of the World Economic Forum: “Committed to Improving the State of the World. ” But whatever improvements are supposed to be made, one can safely assume they will not conflict with those in attendance continuing to enjoy the state of the world as it is now, with canapés and aged Bordeaux and private jets at the ready. Which means that the global populism insurrection is unlikely to lose momentum anytime soon.'"}, "time": 1742628468.0269313}