{"duration": 0.09497737884521484, "input_args": {"text": "'Good morning.  Here’s what you need to know: • Serious disagreements emerged between   Donald J. Trump and some of his nominees in the third day of confirmation hearings. Mr. Trump’s choice for defense secretary, Gen. James N. Mattis, said Russia was trying to break NATO. Here’s where General Mattis stands on other issues. Rex W. Tillerson, the choice for secretary of state, faces a second round of questions  —   Wednesday, he called for China to be denied access to its artificial islands in the South China Sea. Follow our coverage of the hearings. _____ • The intrigue over a sensational but entirely unverified dossier on Mr. Trump’s ties to Russia deepened. The   who compiled the information disappeared from his home in Britain, saying he feared for his safety. Mr. Trump discussed the dossier with James R. Clapper Jr. the director of national intelligence. They had radically different takeaways from the conversation. And the Justice Department said it would investigate the decision by James B. Comey, above, the F. B. I. chief, to inform Congress about a new review in the Hillary Clinton email investigation ahead of the election. _____ • Prosecutors in South Korea are planning to use revelations about a cultural blacklist to strengthen the impeachment charges against President Park  . So far, two versions of the blacklist have been reported by the news media, citing anonymous sources. One version listed more than 9, 000 people, including some of the country’s most beloved filmmakers, actors and writers. Above, Hong   one of the artists who was reportedly blacklisted. _____ • Japan’s prime minister, Shinzo Abe, ended a   visit with President Rodrigo Duterte of the Philippines in which he promised the country about $8. 7 billion worth of business deals, investments and equipment. Mr. Abe is on   diplomatic push that will continue with stops in Australia, Indonesia and Vietnam. Separately, Mr. Duterte ordered government agencies to provide free contraception to women, especially the poor, in a move that is likely to face strong resistance from Catholic leadership in the country. Above, protesters in the Philippines. _____ • And we look at Aceh Province, Indonesia, which began enforcing Shariah law in 2001. Women are required to wear head scarves, alcohol is prohibited and many offenses are punishable by public whipping. The   nation has drifted in a conservative direction, but one Aceh politician says that “a silent majority” thinks the local government has gone too far. In the country’s capital, Jakarta, three candidates vying to be governor of the city will meet for a televised debate tonight. The incumbent, a Christian, is on trial over charges that he insulted the Quran. _____ • India’s largest conglomerate, the Tata Group, named Natarajan Chandrasekaran, 53, to be chairman of its holding company, Tata Sons, ending months of turmoil. • Health care stocks tumbled after Mr. Trump denounced pharmaceutical companies for shifting manufacturing abroad. But many of the imports are generic drugs  —   a large percentage of which are manufactured in India  —   that help keep costs down. • The Environmental Protection Agency accused Fiat Chrysler of cheating on emissions tests on at least 104, 000 diesel vehicles, a case with echoes of the Volkswagen scandal. • Vietnam’s industrial policy will take a hit if Mr. Trump follows through on his pledge to scrap the   Partnership, but companies have their own plans for going global. • U. S. stocks were down. Here’s a snapshot of global markets. • President Obama will end the policy that allows Cubans who reach U. S. soil to stay legally, a move long sought by the Cuban government. Above, Mr. Obama in March last year. [The New York Times] • Hong Kong’s chief secretary, Carrie Lam, leaves her post today. She submitted her resignation and, if approved, will run for chief executive. [Hong Kong Free Press] • President Xi Jinping of China called for “greater coordination” on South China Sea disputes in a meeting with Nguyen Phu Trong, the general secretary of Vietnam’s ruling party. Mr. Xi is headed to Switzerland on Sunday. [South China Morning Post] • In Bangladesh, a popular restaurant in Dhaka’s diplomatic quarter reopened after a terrorist attack in July that killed 22 people. [The New York Times] • Wilbur Ross, the billionaire chosen by Mr. Trump to manage trade with China, once volunteered to be part of project by a famous Chinese artist. [South China Morning Post] • “Star Wars” was the inspiration for the common name scientists gave to the world’s newest primate  —   the Skywalker hoolock gibbon  —   which was discovered in the Chinese province of Yunnan. [BBC] (In this new section, we’ll help you start your day right.) • We’re not saying you will need this tomorrow, we’re simply presenting it for your consideration: Here’s how to nurse a hangover (and how to head one off). Have a great weekend! • An inspiring story of weight loss and its aftermath: Brooklyn’s borough president reversed his Type 2 diabetes through diet and exercise, without taking medication. • Recipe of the day: Give baked sweet potato fries a shot. • Portraits of addiction. A photographer spent a year traveling in Thailand, Laos, Cambodia, Myanmar and the Philippines to explore the region’s underworld of “ice,” or crystal methamphetamine. • In an opinion column, a nuclear scientist argues that the Trump administration should   links of communication with North Korea to avoid a nuclear catastrophe. • “The Handmaiden,” an erotic period drama from South Korea, earned six nominations for the Asian Film Awards. Here’s the full list. If you’re superstitious, today isn’t your day. But Friday the 13th isn’t universally feared. Many countries disregard it. In Greece and some   countries, Tuesday the 13th is the dreaded day. It’s Friday the 17th in Italy. The number four is unlucky in parts of Asia  —   its pronunciation in several languages is close to the word “death,” making April 4 ( ) a day to stay inside. A   a cute charm showing a cat with a raised paw, is used to ward off the bad luck. Other animals believed to combat bad omens include pigs. In Germany, marzipan pigs are given as gifts on New Year’s Eve. And if a cricket is chirping in your house, don’t kill it. Across Asia, Africa and Europe, the insects are viewed as harbingers of wealth. Magpies have great significance in Britain. Seeing a single magpie can be bad luck, it is believed, though saluting one can ward off ill fortune. But if you spot a group, you may be in luck, according to an old nursery rhyme that goes: _____ Des Shoe contributed reporting. Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742564150.1978729}