{"duration": 0.09723186492919922, "input_args": {"text": "'ATLANTA  —   Gasoline prices increased again across the Deep South on Monday, 10 days after the discovery in Alabama of a pipeline rupture that threatened fuel supplies and prompted worries about environmental contamination. The AAA motor club said that Monday’s average price of a gallon of regular gasoline in Georgia was nearly $2. 32, up from $2. 26 on Sunday and about $2. 10 the previous Monday. Prices also increased in Alabama, North Carolina, South Carolina, Tennessee and Virginia, even as state officials asked drivers to conserve supplies and avoid topping off their tanks. “I urge the public to maintain regular consumption levels and travel schedules in order to reduce further interruption in fuel supply,” Gov. Nathan Deal of Georgia said in a statement. The rising prices and sporadic uncertainty here followed the rupture of a   pipeline that ordinarily carries about 1. 3 million barrels of refined gasoline a day. Colonial Pipeline, which operates the system and shut down the line soon after the discovery of the leak on Sept. 9, said up to 336, 000 gallons might have been spilled in Shelby County, Ala. south of Birmingham. Colonial said that it was installing a bypass and that the line could resume normal operations this week. Industry observers said the effects of the disruption would fade once gas was again flowing freely. “Prices are likely to rise even further until the pipeline is fully restored,” said Mark Jenkins, a spokesman for AAA. “Once repaired, prices should quickly begin to decline. ” But over the weekend and into Monday, people across the South used social media to document scattered shortages. Service station operators posted notices of how they had been forced to bring in gas from distant areas, and the authorities warned against price gouging. Despite the increases, most Southern states still posted lower average gasoline prices than other parts of the country. In South Carolina on Monday, drivers typically paid $2. 04 a gallon, well below the national average of $2. 21. In Alabama, officials said they were working to restore service and measure the damage from the leak. On Friday, the federal Pipeline and Hazardous Materials Safety Administration issued a corrective action order, noting the “unknown probable cause of the failure” and barring Colonial from reopening the pipeline without the government’s approval. The agency, which used the order to outline its preliminary findings, also said high benzene and gasoline vapor levels had at one point kept emergency responders from the “assumed failure site” for about 83 hours. But officials appeared cautiously optimistic that the leak had not led to an environmental calamity. Although the federal government’s order said officials found dead vegetation and wildlife after the spill was detected, the gasoline was not expected to reach the nearby Cahaba River. “There has been no indication that any material has made it to the river,” the Cahaba Riverkeeper, a nonprofit organization in Birmingham, said in a statement on Facebook. “We remain confident that there has been no impact to area drinking water. ” Gov. Robert Bentley of Alabama, who repeatedly praised Colonial’s response after he visited a command center on Monday, expressed concern about the spill and its effects, but he also acknowledged the frailty of pipelines like the one that leaked in his state. “We don’t know that won’t happen again,” Mr. Bentley said. “That’s like saying is there a tornado going to happen again. ”'"}, "time": 1742561786.1950238}