{"duration": 0.08360671997070312, "input_args": {"text": "'Millions of Americans are missing out on a chance to avoid debilitating fractures from weakened bones, researchers say, because they are terrified of exceedingly rare side effects from drugs that can help them. Reports of the drugs’ causing jawbones to rot and thighbones to snap in two have shaken many osteoporosis patients so much that they say they would rather take their chances with the disease. Use of the most commonly prescribed osteoporosis drugs fell by 50 percent from 2008 to 2012, according to a recent paper, and doctors say the trend is continuing. Last month, three professional groups  —   the American Society for Bone and Mineral Research, the National Osteoporosis Foundation and the National Bone Health Alliance  —   put out an urgent call for doctors to be more aggressive in treating patients at high risk, and for patients to be more aware of the need for treatment. It followed a flurry of recent articles in medical journals documenting and bemoaning patients’ abandonment of traditional osteoporosis drugs. But osteoporosis experts are afraid their efforts will do little to change minds. “Ninety percent of patients, when you talk to them about starting one of these drugs, won’t go on,” said Dr. Paul D. Miller, medical director of the Colorado Center for Bone Research, a medical practice in Lakewood. “Ninety percent who are on the drugs want to come off. The fear factor is huge. ” Half of those who start taking the drugs stop within a year. Even patients who just broke a hip, which makes another hip fracture extremely likely, are refusing them. In 2011, only 20 percent of patients discharged from a hospital with a broken hip had a prescription for one of the drugs, compared with 50 percent in 2002. There is little question that fractures caused by fragile bones are a real problem, particularly for women. A    woman has a 50 percent chance of having an osteoporotic fracture in her remaining years. The drugs, meant to be started when bone density falls very low and the chance of a fracture soars, can reduce that risk by half, studies show. But to many, it matters little that the drugs’ frightening side effects are extremely rare. Estimates are that 10 to 40 in 100, 000 osteoporosis patients taking the drugs  —   including alendronate, ibandronate, risedronate and zoledronate  —   have sustained broken thighbones. Fewer than one in 100, 000 have had the jawbone problem. “You only need to treat 50 people to prevent a fracture, but you need to treat 40, 000 to see an atypical fracture,” said Dr. Clifford J. Rosen, a professor of medicine at Tufts University who has no association with the makers of the drugs. Lawsuits over the rare side effects resulted in large jury awards and drew widespread attention. And after reports of these problems began to surface, the Food and Drug Administration requested that the drugs’ labels include a warning about the association. Doctors had hoped that a new class of medications might avoid the rare side effects, but their hopes were dashed when Amgen announced the same problems in a clinical trial of a drug called romosozumab: a sudden shattering of a thigh bone in one patient and an area of jawbone that inexplicably rotted in two. “This was the new miracle drug,” Dr. Rosen said. “It means these effects might occur with any of the newer drugs for osteoporosis. ” Some patients say that even though their doctors have explained the relative risks to them, the specter of those side effects frightens them. That is what happened with Mildred Canipe, 79, who lives in Charlotte, N. C. She had a spine fracture two years ago and now lives with continual back pain. She worries about another spine fracture or, even worse, a fractured hip. But she resists taking osteoporosis drugs, she said, because she tends to have side effects with almost any drug, and that makes her think that if anyone will suffer an atypical fracture from the medicine, it is she. “Of course I am worried about my bones,” Mrs. Canipe said. “Who wouldn’t be? But I am between a rock and a hard place. ” She is right to worry about a hip fracture, doctors say. Those injuries are often the start of a downward spiral for older adults. Many never walk normally again. Many end up in nursing homes, unable to care for themselves. “You see someone go from being a mobile elderly person to someone gripping a walker, afraid to move,” said Joan A. McGowan, who directs the division of musculoskeletal diseases at the National Institute of Arthritis and Musculoskeletal and Skin Diseases. “And the less they walk, the more frail they become. ” Dr. McGowan has no associations with makers of osteoporosis drugs. The pain from spine fractures may improve, but physical disfigurement does not. Many patients with osteoporosis have multiple fractures of their spines. They become hunched and have trouble breathing. Their posture makes it hard for their hearts to pump blood, Dr. McGowan said, adding, “It’s not pretty. ” Yet it is an uphill battle trying to persuade people to take the drugs, said Dr. Steven T. Harris, an osteoporosis specialist at the University of California, San Francisco. “I have that discussion all day every day with my patients,” he said. One issue, Dr. Harris said, is the relentless promotion of diet and exercise for patients with fragile bones, which, he said, is insufficient to protect them from fractures. It gives people a false sense that they can control their risk. Another, said Dr. Ethel S. Siris, an osteoporosis expert at Columbia, is that with the drugs off patent, there is no longer an aggressive advertising push to make people aware of them. Their cost ranges from less than $10 a month for alendronate pills to about $1, 200 for a    infusion of zoledronate. Doctors who have seen one of the rare patients who have an atypical fracture are shaken by the experience and have to remind themselves of the power of the data showing that the drugs’ benefits far outweigh their risks. Dr. Elaine Carlson, who until her recent retirement practiced internal medicine in Kennebunk, Me. had a patient who sustained two such fractures. The patient, 89, who asked that her name not be used to protect her privacy, said her left leg had broken suddenly when she was walking across her kitchen floor. A surgeon put in a rod and three screws, and it healed. Then, she said, her right thigh began to hurt six months later. She called Dr. Carlson’s office and was talking to her nurse practitioner when suddenly her right leg broke. She saw three doctors and had two operations before it healed, but she still cannot walk normally and can no longer do the gardening she loves. “I hobble around on a cane,” she said. “I am a cripple. ” She called the drug she took for osteoporosis “that wretched, dreadful stuff. ” Having that happen to her patient was “very tough, very tough,” Dr. Carlson said. And when the next osteoporosis patient came to her office? “Yeah, you do hesitate,” she said. “Your job is ‘do no harm. ’” But Dr. Carlson said she had continued to prescribe the drugs. “You do have to stick with the science,” she said.'"}, "time": 1742628358.6950283}