{"duration": 0.5588703155517578, "input_args": {"text": "'Julian Assange was in classic didactic form, holding forth on the topic that consumes him  —   the perfidy of big government and especially of the United States. Mr. Assange, the editor of WikiLeaks, rose to global fame in 2010 for releasing huge caches of highly classified American government communications that exposed the underbelly of its wars in Afghanistan and Iraq and its sometimes cynical diplomatic maneuvering around the world. But in a televised interview last September, it was clear that he still had plenty to say about “The World According to US Empire,” the subtitle of his latest book, “The WikiLeaks Files. ” From the cramped confines of the Ecuadorean Embassy in London, where he was granted asylum four years ago amid a legal imbroglio, Mr. Assange proffered a vision of America as superbully: a nation that has achieved imperial power by proclaiming allegiance to principles of human rights while deploying its   apparatus in “pincer” formation to “push” countries into doing its bidding, and punishing people like him who dare to speak the truth. Notably absent from Mr. Assange’s analysis, however, was criticism of another world power, Russia, or its president, Vladimir V. Putin, who has hardly lived up to WikiLeaks’ ideal of transparency. Mr. Putin’s government has cracked down hard on dissent  —   spying on, jailing, and, critics charge, sometimes assassinating opponents while consolidating control over the news media and internet. If Mr. Assange appreciated the irony of the moment  —   denouncing censorship in an interview on Russia Today, the     propaganda channel  —   it was not readily apparent. Now, Mr. Assange and WikiLeaks are back in the spotlight, roiling the geopolitical landscape with new disclosures and a promise of more to come. In July, the organization released nearly 20, 000 Democratic National Committee emails suggesting that the party had conspired with Hillary Clinton’s campaign to undermine her primary opponent, Senator Bernie Sanders. Mr. Assange  —   who has been openly critical of Mrs. Clinton  —   has promised further disclosures that could upend her campaign against the Republican nominee, Donald J. Trump. Separately, WikiLeaks announced that it would soon release some of the crown jewels of American intelligence: a “pristine” set of cyberspying codes. United States officials say they believe with a high degree of confidence that the Democratic Party material was hacked by the Russian government, and suspect that the codes may have been stolen by the Russians as well. That raises a question: Has WikiLeaks become a laundering machine for compromising material gathered by Russian spies? And more broadly, what precisely is the relationship between Mr. Assange and Mr. Putin’s Kremlin? Those questions are made all the more pointed by Russia’s prominent place in the American presidential election campaign. Mr. Putin, who clashed repeatedly with Mrs. Clinton when she was secretary of state, has publicly praised Mr. Trump, who has returned the compliment, calling for closer ties to Russia and speaking favorably of Mr. Putin’s annexation of Crimea. From the outset of WikiLeaks, Mr. Assange said he was motivated by a desire to use “cryptography to protect human rights,” and would focus on authoritarian governments like Russia’s. But a New York Times examination of WikiLeaks’ activities during Mr. Assange’s years in exile found a different pattern: Whether by conviction, convenience or coincidence, WikiLeaks’ document releases, along with many of Mr. Assange’s statements, have often benefited Russia, at the expense of the West. Among United States officials, the emerging consensus is that Mr. Assange and WikiLeaks probably have no direct ties to Russian intelligence services. But they say that, at least in the case of the Democrats’ emails, Moscow knew it had a sympathetic outlet in WikiLeaks, where intermediaries could drop pilfered documents in the group’s anonymized digital inbox. In an interview on Wednesday with The Times, Mr. Assange said Mrs. Clinton and the Democrats were “whipping up a   hysteria about Russia. ” There is “no concrete evidence” that what WikiLeaks publishes comes from intelligence agencies, he said, even as he indicated that he would happily accept such material. WikiLeaks neither targets nor spares any particular nation, he added, but rather works to verify whatever material it is given in service of the public, which “loves it when they get a glimpse into the corrupt machinery that is attempting to rule them. ” But given WikiLeaks’ limited resources and the hurdles of translation, Mr. Assange said, why focus on Russia, which he described as a “bit player on the world stage,” compared with countries like China and the United States? In any event, he said, Kremlin corruption is an old story. “Every man and his dog is criticizing Russia,” he said. “It’s a bit boring, isn’t it?” Since its inception, WikiLeaks has succeeded spectacularly on some fronts, uncovering indiscriminate killing, hypocrisy and corruption, and helping spark the Arab Spring. To Gavin MacFadyen, a WikiLeaks supporter who runs the Center for Investigative Journalism at the University of London, the question for Mr. Assange is not where the material comes from, but whether it is true and in the public interest. He noted that intelligence services had a long history of using news organizations to plant stories, and that Western news outlets often published “material that comes from the C. I. A. uncritically. ” Recent events, though, have left some transparency advocates wondering if WikiLeaks has lost its way. There is a big difference between publishing materials from a   like Chelsea Manning  —   the soldier who gave WikiLeaks its war log and diplomatic cable scoops  —   and accepting information, even indirectly, from a foreign intelligence service seeking to advance its own powerful interests, said John Wonderlich, the executive director of the Sunlight Foundation, a group devoted to government transparency. “They’re just aligning themselves with whoever gives them information to get attention or revenge against their enemies,” Mr. Wonderlich said. “They’re welcoming governments to hack into each other and disrupt each other’s democratic processes, all on a pretty weak case for the public interest. ” Others see Mr. Assange assuming an increasingly blinkered approach to the world that, coupled with his own secrecy, has left them disillusioned. “The battle for transparency was supposed to be global at least Assange claimed that at the beginning,” said Andrei A. Soldatov, an investigative journalist who has written extensively about Russia’s security services. “It is strange that this principle is not being applied to Assange himself and his dealings with one particular country, and that is Russia,” Mr. Soldatov said. “He seems to think that one may compromise a lot fighting a bigger evil. ” WikiLeaks was just getting started in 2006 when Mr. Assange, an Australian national, sent a mission statement to potential collaborators. One of his goals, he said, was to help expose “illegal or immoral” behavior by governments in the West. Mr. Assange made clear, though, that his main focus lay elsewhere. “Our primary targets are those highly oppressive regimes in China, Russia and Central Eurasia,” he wrote. Shortly after releasing the war logs in 2010, Mr. Assange threatened to make good on that promise. WikiLeaks, he told a Moscow newspaper, had obtained compromising materials “about Russia, about your government and your businessmen. ” But Mr. Assange’s life was soon upended. On Nov. 20 of that year, an international warrant was issued for his arrest in connection with allegations of sexual assault in Sweden, which he denies. Eight days later, WikiLeaks’ release of a cache of State Department cables cast unvarnished  —   and unwelcome  —   light on the United States’ diplomatic relationships. As Mr. Assange pointed out in the interview with The Times, many of the cables involved blunt judgments on Russia one called it a “mafia state. ” But the documents proved far more damaging to the United States’ interests than to Russia’s, and officials in Moscow seemed unperturbed. Russia’s foreign minister, Sergey V. Lavrov, dismissed Mr. Assange as a “petty thief running around on the internet. ” Mr. Assange, asked soon after by Time magazine whether he still planned to expose the secret dealings of the Kremlin, reiterated his earlier vow. “Yes indeed,” he said. But that promised assault would not materialize. Instead, with Mr. Assange’s legal troubles mounting, Mr. Putin would come to his defense. In late November 2010, United States officials announced an investigation of WikiLeaks Mrs. Clinton, whose State Department was scrambled by what became known as “Cablegate,” vowed to take “aggressive” steps to hold those responsible to account. The next month, Mr. Assange was arrested by the London police to face questioning by the Swedes, who he feared would turn him over to the Americans. Out on bail, he holed up and fought extradition at a Georgian country house owned by a supporter, Vaughan Smith, who said in an interview that he believed Mr. Assange to be the victim of an “intense online bullying and disinformation” campaign. One day after Mr. Assange’s arrest, the Russian president appeared at a news conference with the French prime minister. Brushing off a questioner who suggested that the diplomatic cables portrayed Russia as undemocratic, Mr. Putin used the opportunity to bash the West. “As far as democracy goes, it should be a complete democracy. Why then did they put Mr. Assange behind bars?” he asked. “There’s an American saying: He who lives in a glass house shouldn’t throw stones. ” It was the first of several times that Mr. Putin would take up Mr. Assange’s cause. He has called the charges against Mr. Assange “politically motivated” and declared that the WikiLeaks founder is being “persecuted for spreading the information he received from the U. S. military regarding the actions of the U. S. A. in the Middle East, including Iraq. ” In January 2011, the Kremlin issued Mr. Assange a visa, and one Russian official suggested that he deserved the Nobel Peace Prize. Then, in April 2012, with WikiLeaks’ funding drying up  —   under American pressure, Visa and MasterCard had stopped accepting donations  —   Russia Today began broadcasting a show called “The World Tomorrow” with Mr. Assange as the host. How much he or WikiLeaks was paid for the 12 episodes remains unclear. In a written statement, Sunshine Press, which works as his spokesman, said Russia Today “was among a dozen broadcasters that purchased a broadcasting license for his show. ” But on June 19, 2012, Mr. Assange’s narrative quickly took a different turn. He broke bail after losing an appeal against extradition to Sweden and was granted asylum in the tiny embassy of Ecuador in London, overlooking the back of Harrods department store. One year later, a man who would soon eclipse Mr. Assange in terms of   fame boarded a plane in Hong Kong. His name was Edward J. Snowden, and he was a National Security Agency    having stunned the world and strained American alliances by leaking documents that revealed a United   network of global surveillance programs. Mr. Snowden had not given his thousands of classified documents to WikiLeaks. Still, it was at the suggestion of Mr. Assange that the flight Mr. Snowden boarded on June 23, 2013, accompanied by his WikiLeaks colleague Sarah Harrison, was bound for Moscow, where Mr. Snowden remains today after the United States canceled his passport en route. In fact, worried that he would be seen as a spy, Mr. Snowden had hoped merely to pass through Russia on his way to South America, Mr. Assange later recounted, a plan he had not fully endorsed. Russia, he believed, could best protect Mr. Snowden from a C. I. A. kidnapping, or worse. “Now I thought, and in fact advised Edward Snowden, that he would be safest in Moscow,” Mr. Assange told the news program Democracy Now. Years earlier, during a November 2010 meeting with New York Times journalists negotiating for access to the diplomatic cables, Mr. Assange had mused about seeking refuge in Russia. Anticipating the likely fallout from the cables’ release, Mr. Assange spoke of relocating to Russia and setting up WikiLeaks there. His associates were openly skeptical of the idea, given the Kremlin’s ruthless surveillance apparatus and tight control over the news media. That Mr. Assange would now advise Mr. Snowden to travel that path is a measure not just of his worldview, but also of his circumstances and personality, friends and former colleagues say. Suelette Dreyfus, a longtime friend of Mr. Assange’s and an academic who studies   says his sole motivation is a   belief that governments and other large and powerful institutions must be held in check to safeguard the rights of individuals. “This is not an   fight,” she said, though “it is being presented as such by people with an agenda. But even as other longtime supporters continue to see Mr. Assange as a courageous crusader  —   “a moral individual in a world of mass societies,” as one put it  —   they say he can be vain and childlike, with a tendency to see the world as divided into those who support him and those who do not. During his time isolated in the Ecuadorean Embassy, under constant surveillance, his instinctive mistrust of the West hardened even as he became increasingly numb to the abuses of the Kremlin, which he viewed as a “bulwark against Western imperialism,” said one supporter, who like many others asked for anonymity for fear of angering Mr. Assange. Another person who collaborated with WikiLeaks in the past added: “He views everything through the prism of how he’s treated. America and Hillary Clinton have caused him trouble, and Russia never has. ” The result has been a “  confrontation with the U. S. A. ,” Daniel   who before quitting WikiLeaks in 2010 was one of Mr. Assange’s closest partners, has said. And the beneficiary of that confrontation, played out in a series of public statements by Mr. Assange and strategically timed document releases by WikiLeaks, has often been Mr. Putin. While the release of the Democratic Party documents appears to be the first time WikiLeaks has published material that United States officials assert was stolen by Russian intelligence, the agendas of WikiLeaks and Mr. Putin have repeatedly dovetailed since Mr. Assange fled to the embassy. Mr. Assange has at times offered mild criticisms of the Putin government. In a 2011 interview, for instance, he spoke of the “Putinization” of Russia. On Twitter, he has also called attention to Pussy Riot, the punk band whose members were jailed after taking on Mr. Putin. But for the most part, Mr. Assange has remained silent about some of the Russian president’s harshest moves. It was Mr. Snowden, for instance, not Mr. Assange, who took to Twitter in July to denounce a law giving the Kremlin sweeping new surveillance powers. Mr. Assange, asked during Wednesday’s interview about the new law and others like it, acknowledged that Russia had undergone “creeping authoritarianism. ” But he suggested that “that same development” had occurred in the United States. Mr. Assange has also taken a decidedly   view of hostilities in Ukraine, where the Obama administration has accused Mr. Putin of supporting the separatists. The United States, Mr. Assange told an Argentine newspaper in March of last year, has been the one meddling there, fomenting unrest by “trying to draw Ukraine into the Western orbit, to pluck it out of Russia’s sphere of influence. ” After the annexation of Crimea, he said Washington and its intelligence allies had “annexed the whole world” through global surveillance. Like Mr. Trump, who stood to gain from the Democratic Party leak, Mr. Assange supported Britain’s vote to leave the European Union, and he has repeatedly gone after NATO  —   taking on two organizations that Mr. Putin would like nothing more than to defang or dismantle. In September 2014, for instance, Mr. Assange wrote on Twitter about what he called the “corrupt deal” that Turkey engineered to force the suppression of a   television station in Denmark in return for allowing that country’s prime minister, Anders Fogh Rasmussen, to take the helm of NATO. The timing of his Twitter post was curious on two fronts. It relied on a diplomatic cable that had garnered headlines when WikiLeaks released it four years earlier. And it followed a monthslong tit for tat between Mr. Rasmussen and Mr. Putin, with the Russian president taking the NATO chief to task for secretly recording their private conversation, and Mr. Rasmussen accusing Mr. Putin of playing a “double game” in Ukraine by issuing conciliatory statements while massing troops on the border and shipping weapons to the separatists. Mr. Assange again recycled the story this past June  —   days after President Petro O. Poroshenko of Ukraine named Mr. Rasmussen a special adviser  —   this time via a video appearance at a Russian media forum attended by Mr. Putin and timed to coincide with the 75th anniversary of the Soviet Information Bureau. Then there are the leaks themselves. Some, such as hacked Church of Scientology documents, are of no obvious benefit to the Russians. But many are. The organization has published leaks of material from Saudi Arabia and Turkey, which are United States allies, but also to varying degrees from authoritarian regimes. The leaks came during times of heightened tension between those countries and Russia. The Saudi documents, for instance, which highlighted efforts to manipulate world opinion about the kingdom, were published months after Mr. Putin accused the Saudis of holding down oil prices to harm the economies of Russia and its allies Iran and Venezuela. Another set of leaks indirectly benefited Rosatom, Russia’s   atomic energy company. Those documents detailed a “corrupt    war by Western and Chinese companies”  —   including Rosatom’s chief competitors  —   to obtain uranium and other mining rights in the Central African Republic. WikiLeaks seems aware of a perception problem when it comes to Russia. When Russia Today began broadcasting Mr. Assange’s television program, he joked in a statement that it would be used to “smear” him: “Assange is a hopeless Kremlin stooge!” And Sunshine Press, the group’s public relations voice, pointed out that in 2012 WikiLeaks also published an archive it called the Syria files  —   more than two million emails from and about the government of President Bashar   whom Russia is supporting in Syria’s civil war. Yet at the time of the release, Mr. Assange’s associate, Ms. Harrison, characterized the material as “embarrassing to Syria, but it is also embarrassing to Syria’s opponents. ” Since then, Mr. Assange has accused the United States of deliberately destabilizing Syria, but has not publicly criticized human rights abuses by Mr. Assad and Russian forces fighting there. Many of the documents WikiLeaks has published are classified, such as a C. I. A. tutorial on how to maintain cover in foreign airports. But what may be WikiLeaks’ most intriguing release of secret documents involved what is, on the surface, a less sensational topic: trade negotiations. From November 2013 to May 2016, WikiLeaks published documents describing internal deliberations on two trade pacts: the   Partnership, which would liberalize trade between the United States, Japan and 10 other Pacific Rim countries, and the Trade in Services Agreement, an accord between the United States, 21 other countries and the European Union. Russia, which was excluded, has been the most vocal opponent of the pacts, with Mr. Putin portraying them as an effort to give the United States an unfair leg up in the global economy. The drafts released by WikiLeaks stirred controversy among environmentalists, advocates of internet freedom and privacy, labor leaders and corporate governance watchdogs, among others. They also stoked populist resentment against free trade that has become an important factor in American and European politics. The material was released at critical moments, with the apparent aim of thwarting negotiations, American trade officials said. WikiLeaks highlighted the domestic and international discord on its Twitter accounts. American negotiators assumed that the leaks had come from a party at the table seeking leverage. Then in July 2015, on the day American and Japanese negotiators were working out the final details of the   Partnership, came what WikiLeaks dubbed its “Target Tokyo” release. Relying on   N. S. A. documents, the release highlighted 35 American espionage targets in Japan, including cabinet members and trade negotiators, as well as companies like Mitsubishi. The trade accord was finally agreed on  —   though it has not been ratified by the United States Senate  —   but the document release threw a wrench into the talks. “The lesson for Japan is this: Do not expect a global surveillance superpower to act with honor or respect,” Mr. Assange said in a news release at the time. “There is only one rule: There are no rules. ” Because of the files’ provenance, United States intelligence officials assumed that Mr. Assange had gotten his hands on some of the N. S. A. documents copied by Mr. Snowden. But in an interview, Glenn Greenwald, one of the two journalists entrusted with the full Snowden archive, said that Mr. Snowden had not given his documents to WikiLeaks and that the “Target Tokyo” documents were not even among those Mr. Snowden had taken. The same is true, Mr. Greenwald said, of another set of N. S. A. intercepts released by WikiLeaks that showed that the United States bugged conversations of United Nations officials and European allies, including private   talks between Chancellor Angela Merkel of Germany and the United Nations secretary general, Ban  . On Wednesday, Mr. Assange said he had his own separate sources for N. S. A. material. That raises the question of whether another,   N. S. A.   is leaking documents to WikiLeaks, or whether the files were obtained from the outside via a sophisticated cyberespionage operation, possibly sponsored by a state actor. That question was underscored by Mr. Assange’s statement a few weeks ago that he would release the codes that the United States uses to hack others. And that has some former collaborators questioning just who is giving Mr. Assange his information these days. “It’s not in his temperament to be a cat’s paw, and I don’t think he would take anything overtly from the F. S. B. ,” said one, referring to the Russian intelligence agency. “He wouldn’t trust them enough. But if someone could plausibly be seen as a hacker group, he’d be fine. He was never too thorough about checking out sources or motivations. ” In April of this year, the International Consortium of Investigative Journalists unleashed a torrent of articles that reverberated around the world. Based on 11. 5 million leaked documents from a Panamanian law firm that specialized in creating secretive offshore companies, the “Panama Papers” offered a look inside a shadowy world in which banks, law firms and asset management companies help the world’s rich and powerful hide wealth and avoid taxes. It was the largest archive of leaked documents that journalists had ever handled, and so it was no surprise that WikiLeaks initially linked to the consortium’s work on Twitter. But what shocked some of the journalists involved was what WikiLeaks did next. Among the biggest stories was one showing how billions of dollars had wound up in shell companies controlled by one of Mr. Putin’s closest friends, a cellist named Sergei P. Roldugin. Nearly a dozen news organizations, including two of Russia’s last independent newspapers, Vedomosti and Novaya Gazeta, had collaborated in tracing the money. But WikiLeaks seized on the contribution of just one: the Organized Crime and Corruption Reporting Project. In a series of Twitter posts after the revelations about Mr. Roldugin, WikiLeaks questioned the integrity of the reporting, noting that the project had received grants from the Soros Foundation and the United States Agency for International Development. Mr. Assange, in an interview with Al Jazeera, reiterated the suggestion that the consortium, with a   agenda, had   the documents it chose to release. “There was clearly a conscious effort to go with the Putin bashing, North Korea bashing, sanctions bashing, etc. ,” he said. In fact, the consortium’s opening salvo featured many   articles with Western targets, including one on the use of offshore companies in tax havens by the father of   Minister David Cameron of Britain. Another focused on an offshore company set up by the Ukrainian president, Mr. Poroshenko, a Putin enemy. Nevertheless, Mr. Putin seized on WikiLeaks’ take on the controversy to defend himself. He declared that while the articles suggested that “there is this friend of the Russian president, and they say he has done something, probably   in fact there is no corruption involved at all. ” “Besides,” he added, “we now know from WikiLeaks that officials and state agencies in the United States are behind all this. ” Gerard Ryle, the consortium’s director, chalked Mr. Assange’s actions up to professional jealousy. The leaker, who remains anonymous, said in a manifesto in May that the Panama Papers had first been offered to WikiLeaks, but that multiple attempts to contact the organization had gone unanswered. (Mr. Assange said he had no knowledge of that.) But Mr. Soldatov, the Russian investigative journalist, was so furious that he confronted Ms. Harrison, Mr. Assange’s associate, at a journalism conference in Italy the next day. “Many journalists at Novaya Gazeta were killed” after reporting on Mr. Putin’s Russia, he told her, “and now their integrity is questioned by WikiLeaks?” It is striking, Mr. Soldatov said in an interview, that Mr. Snowden, who is stuck in Moscow, is far more willing to criticize Mr. Putin than is Mr. Assange, whom he sees as an apologist. Roman Shleynov, who worked on the project first at Vedmosti and then as an editor at the Organized Crime and Reporting Project, said that he, too, was “at a loss” to explain Mr. Assange’s attack on the Panama Papers. “For me it was a surprise that Mr. Assange was repeating the same excuse that our officials, even back in Soviet days, used to say  —   that it’s all some conspiracy from abroad,” Mr. Shleynov said. “I understand his struggle with the United States,” he added, “but I never thought he’d use our work, the work of Russian journalists, to make such a statement. I respected and still respect what Julian Assange has done, but I have changed my opinion of him as a person. ” Mr. Assange has always insisted, “I am WikiLeaks,” and it seems truer now than ever. Four years into his time at the Ecuadorean Embassy, he is increasingly isolated. Now 45, he lives in two small rooms: an office equipped with a bed, sunlamp, phone, computer, kitchenette, shower, treadmill and bookshelves, and a conference room where he can meet with visitors and oversee the operation with the help of a few dozen employees, mostly in Berlin. One person familiar with the setup called it “a gas station with two attendants. ” Melinda Taylor, one of Mr. Assange’s lawyers, said that he needed dental work and a magnetic resonance imaging scan for a painful shoulder, but that those procedures could not be done inside the embassy for practical and insurance reasons. He also has a vitamin D deficiency from a lack of sunlight, she said, and “severe depression exacerbated” by his legal travails. Mr. Smith, who still supports and visits Mr. Assange, said, “Julian’s a big bloke, with big bones, and he fills the room physically and intellectually. ” “It’s a tiny embassy with a tiny balcony,” he added, “small, hot and with not great air flow, and it must be jolly difficult for everyone there. ” And public spats with   allies are not uncommon. One involves Mr. Assange’s insistence that document troves should be published in their entirety, not curated by journalists who might have agendas. In his interview with The Times on Wednesday, Mr. Assange criticized the Panama Papers consortium for not making all the documents in its possession public, calling it censorship. “It is not the WikiLeaks model,” he said. “In fact, it is the   model. ” WikiLeaks did collaborate with journalists on the war logs and diplomatic cables. But Mr. Assange’s decision to abandon that approach in the name of total transparency is what led Mr. Snowden to work with Mr. Greenwald and another journalist on the N. S. A. revelations. Mr. Snowden felt openness should be balanced with concern for people’s privacy and safety. After the release of the Democratic Party documents this summer, Mr. Snowden criticized WikiLeaks on Twitter for not redacting the Social Security numbers and credit card information of private individuals named in the trove. WikiLeaks shot back on Twitter: “Opportunism won’t earn you a pardon from Clinton  curation is not censorship of ruling party cash flows. ” Mr. Greenwald said of Mr. Assange, “He’s alienated a lot of people. ” “It’s often hard for me to separate my personal views of Julian with my views of WikiLeaks” he added. “I do think on balance WikiLeaks is a force for good. ” Friends can differ, Mr. Assange said in the interview. Still, some of his staunchest supporters, like the heiress Jemima Goldsmith Khan, have turned on him, troubled by what they see as a double standard. In an opinion piece for the New Statesman, Ms. Khan wrote that WikiLeaks, which was created to produce a more just society, “has been guilty of the same obfuscation and misinformation as those it sought to expose. ” In February, Mr. Assange received legal news that he hoped would be a game changer. The United Nations Working Group on Arbitrary Detention ruled that he was being arbitrarily detained and should be released freely and with compensation for the violation of his rights. But the opinion was nonbinding and has been rejected by British and Swedish courts. “The U. S. and the West will hold out a U. N. working group decision when it is in their favor,” said Jennifer Robinson, one of his lawyers. “But when it’s about Julian Assange, they criticize and undermine. ” A few weeks ago came a possible breakthrough: an agreement for Swedish prosecutors to question Mr. Assange about the rape allegations. But Ms. Taylor said that even if the Swedes declined to prosecute, Mr. Assange still feared being held by Britain on   charges and turned over to the United States, where an investigation into his leak activities remains open. “The uncertainty gets to him,” she said. Mr. Assange tries to keep his mind off his troubles with his guitar and a cat given to him by his children, but what really lifts his spirits is publishing new leaks like the Democrats’ files. “The work keeps him going,” said his colleague, Ms. Harrison. Is there an October surprise in his back pocket? “Julian loves misinformation it’s his passion,” Mr. Greenwald said. “He’d likely say this just to make the Clintons uncomfortable. ” For his part, Mr. Assange is looking a bit further on. “Let’s leap forward a couple of years,” he said in the interview. “Let’s imagine that rival intelligence services  —   in the U. S. in China  —   went to settle their conflicts about who is right, who’s the good actor, who’s the bad actor, on a particular situation by presenting the public the truth. “That’s the most amazing advance I can think of. ”'"}, "time": 1742564499.2174196}