{"duration": 0.07964038848876953, "input_args": {"text": "'Of all the silver linings one might have expected from this   election, a new national understanding of sexual assault would have been quite hard to imagine. Until two weeks ago. One   recording of Donald J. Trump boasting about how his stardom gave him license to grope women’s private parts appears to have prompted the kind of change in public consciousness that usually takes decades. The lewd and aggressive comments by Mr. Trump, the Manhattan tycoon turned Republican presidential nominee, revealed a generational divide in the way many Americans understand sexual assault and consent. But, remarkably, the widespread outrage and outpouring it unleashed, with millions of women speaking out about their own experiences  —   appear to have narrowed that gap. “This is a moment of transition,” said Estelle B. Freedman, a Stanford University historian who studies the evolution of laws and norms surrounding sexual assault. “We are having a national conversation about new rules,” she added. “We are nationally trying to rethink issues of sexuality, consent, autonomy, relationships. ” While the Trump tape and its aftermath feel like a turning point in the public understanding of sexual assault, Alexandra Brodsky, a   of Know Your IX, an organization dedicated to ending sexual violence on college campuses, believes that “it’s actually a reflection that we are already past the turning point. ” “It is not obvious to me that five years ago, grabbing or kissing someone without her permission would have been recognized as sexual assault,” she said. Dr. Freedman sees this moment as the culmination of decades of change. Until the   century, her research shows, sexual assault and rape were viewed primarily as crimes against the honor of women’s husbands and fathers, not themselves. As women gained new rights to control their own property and legal decisions, sexual assault began to be considered a matter of consent, not honor. But there was little agreement about what consent meant, Dr. Freedman said. Many people believed consent could be implied or presumed by the way a woman dressed, for instance, or even her decision to accept a job with a male boss. By the 1990s, feminist advocacy had begun to push the idea of “no means no. ” Antioch College in 1991 adopted a code of conduct requiring students to affirmatively opt in to sexual activity starting with a kiss. While such   rules were lampooned on “Saturday Night Live” as political correctness run amok, they have become increasingly mainstream. States including New York and California require colleges and universities to adopt them. The widespread backlash to Mr. Trump’s comments, experts say, was fueled in part by the growing view, among people in their 20s and 30s, of affirmative consent as a guiding principle, not a lofty ideal or extreme demand. “I think that affirmative consent is an imperfect legal concept,” Ms. Brodsky, a recent graduate of Yale Law School, allowed. “But it’s a powerful normative concept. ” But old beliefs about honor and consent persist. Mr. Trump’s bragging in the video that women “let” him kiss and grope them because he was a star, for instance, seems straight out of the   era, in which anything other than a clear “no” could be seen as passive acquiescence. Dr. Freedman also detects shades of the old   system in some men’s responses that, as husbands and fathers, they found the video unacceptable. Until recently, pervasive shame and stigma meant that silence was often the rational choice for survivors of sexual violence. That was particularly true for women who grew up in an era when any sexual activity outside of marriage was considered unacceptable: revealing an assault risked being labeled promiscuous or worse. But as those norms have changed, the costs of speaking out have dropped. Younger women in particular are becoming more willing to protest sexual assaults that once might have been deemed too minor to merit reporting. And that, in turn, may be affecting the way older generations of women perceive episodes from their own pasts. It certainly worked that way for Emily Hoffman, 25, who works in the television industry in New York, and her mother, Amy Plummer. “I really don’t want to post this,” Ms. Hoffman wrote on Facebook on Oct. 10, a few days after the Trump tape was aired. But she went on to reveal to her 1, 326 Facebook friends what for seven years had been one of her most private secrets: that she had been assaulted by a senior male colleague while an    intern at a   company. He attacked her in a deserted stairwell, Ms. Hoffman announced, kissing her, groping her breasts and genitals, and then forcibly masturbating against her. “My experience mimicked what Donald Trump described in those tapes,” she said in an interview. “It was very upsetting. ” For Ms. Plummer, who is in her 60s, seeing her daughter’s post was transformative. “When Emily felt brave enough to put her experiences down was when I specifically started to think about my own experiences,” she said. “And I realized I would not have had the courage she had to say it publicly. ” But she also realized she had things of her own to share. She still felt that some of her experiences were too “explicit” to discuss. But she shared others with her daughter. How in junior high, for instance, her male guidance counselor told her that she should “consider a career as a Playboy bunny. ” And how she left graduate school without her master’s degree after a professor told her that she would not be able to pass her oral exams “unless I was ‘nice’ to him. ” One thing is notably missing from most of the stories survivors are now sharing: perpetrators’ names. The stigma of having been assaulted may have waned, but making an accusation against a specific individual is a different matter. It can raise the risk of legal consequences such as libel or slander suits. Many survivors, however, say social consequences are a more significant deterrent. “There is a sense that a ‘good victim’ merely shares her story to raise awareness or make people feel less alone,” Ms. Brodsky said. “But the minute there is a desire for accountability or change or retribution, suddenly she’s untrustworthy. ” When women accuse celebrities or other   people like Mr. Trump or Roger Ailes, the former Fox News executive, she said, “that triggers the unfounded but insidious myth that women say that they’ve been assaulted for attention or money. ” The pressure not to name names can be strong whenever the perpetrator is someone the woman knows. An accusation forces everyone who knows the two people to choose a side: accuser or accused? Choosing the accuser often means going against the broader group or community. In her work on college campuses around the country, Ms. Brodsky said, she has observed that “peers and friends are much more inclined to be sympathetic to victims if they don’t make anyone’s life more complicated. ” “Naming names creates an inconvenience,” she added. Psychological research shows that people find it extremely difficult  —   even painful  —   to challenge their peer groups. In the famous “conformity study” conducted by Solomon Asch, a professor of social psychology at the University of Pennsylvania who died in 1996, participants were asked to answer a series of simple, questions with obvious answers. There was a catch, though: Before the subject had a chance to respond, other research assistants disguised as participants all confidently selected the same wrong answer. That set up a dilemma: Choose the right answer, or conform to the group by selecting the wrong one? Even though the stakes were very low, about   of participants capitulated to group pressure at least once. Ms. Hoffman believes that her decision not to name her accuser is the reason her post has received such a uniformly positive response. “I’m not naming anybody in particular,” she said. “So they don’t feel like there’s somebody who they need to defend. ” But according to the federal Bureau of Justice Statistics, 60 percent of sexual assaults are committed by an intimate partner, relative, friend or acquaintance. So the pressure on individuals not to name names can add up to widespread impunity for perpetrators. Nancy Erika Smith, a New Jersey lawyer who has represented victims of sexual assault and discrimination for more than two decades, said she recognized that asking people to identify who had harmed them was in many ways an unfair burden. “Don’t do it for yourself,” she said. “Do it for all of us. Speak up. ”'"}, "time": 1742628606.0447268}