{"duration": 0.2721230983734131, "input_args": {"text": "'The humorist and social commentator says her ideal literary dinner party is one that nobody is invited to: “My idea of a great literary dinner party is Fran, eating alone, reading a book. ” What books are on your night stand now? There are no books on my night stand, because I’m a lifelong insomniac, so eight or nine years ago, I thought: “Don’t read in bed. It’s too stimulating. Watch TV instead. It’s boring. ” And it’s true. TV is boring, but apparently not boring enough to make me fall asleep. So now instead of being overstimulated and awake, I’m bored and awake. What has your postelection reading looked like? My postelection reading has looked pretty much like tea leaves, with just exactly the success you might imagine. I’ve definitely noticed since the election that even though generally I have a lifelong preference for reading fiction, I have less interest in it now. Except for rereading, which I’ve been doing a lot. Especially John O’Hara. I suppose this is my way of comforting myself. What’s the last great book you read? This really kind of stumped me. Unlike almost everyone else I can think of, when I say great, I mean great. Not just great this year or not just extremely good. I know you’re not supposed to have this kind of   hierarchy of books. But I do. So I’m trying to think of the last really great book I read. And all I can come up with is something I reread, which was “Memoirs of Hadrian,” by Marguerite Yourcenar, which is actually great, and by great, I mean forever. What’s the best classic novel you recently read for the first time? “Little Dorrit. ” I never was a Dickens fanatic. Except for “Martin Chuzzlewit,” which I loved. But I was looking for something to read and I asked Deborah Eisenberg and she said, “Have you ever read ‘Little Dorrit’?” Which I had not, and I was so startled  —   since she rarely recommends a book that wasn’t written by a dead Hungarian  —   that I immediately read it, and I loved it. What’s your favorite book no one else has heard of?  This is a question that I really find odd. How do I know what no one else has heard of? I can name books that I think are fairly obscure. I could say Henry Green. But now, as of last summer, everyone is reading Henry Green. There is a writer named Wyndham Lewis, whom you’re supposed to hate, but I don’t. He wrote a book called, “The Apes of God,” which is a book I particularly like and am interested in. I suppose other people like it and have heard of it, but I assume it is obscure enough for this answer. Which writers  —   novelists, playwrights, critics, journalists, poets  —   working today do you admire most?  This is something I usually avoid answering, because you always leave someone out. But I wrote up a list. Toni Morrison, Deborah Eisenberg, Lynne Tillman, Wallace Shawn, Junot Díaz, Ben Katchor and Cynthia Ozick. Who is shockingly smart. Whose opinion on books do you most trust? Mine. When do you read? Pretty much all the time. Especially if I’m supposed to be doing something else. I was very frequently punished for reading as a child because I was reading when I was supposed to be doing homework. I got in trouble in school for reading, I got in trouble at home for reading. My mother would actually bang on my door and say, “I know you’re reading in there!” In my adult life, I’ve gotten in trouble for reading because I’m not writing when I’m reading. So it’s really rare that reading is unaccompanied by guilt for me. But I’ve learned to live with it. I feel guilty pretty much all the time. The only time I read without feeling guilty is on a plane, because what else could I possibly be doing? What moves you most in a work of literature? I think it might be the word “move” that kind of perplexes me, because that’s a word connected with emotion. I don’t really seek out emotion when reading. The feeling that’s most important to me when reading is that I’m absorbed. I just want to be taken away. I really like being dazzled. That would be nice. The thing I care least about in reading is the story. I just don’t care that much about stories. That may have to do with being older. Tell me a story I don’t know. But really, I read in order not to be in life. Reading is better than life. Without reading, you’re stuck with life. Which genres do you especially enjoy reading? And which do you avoid? In my lifetime, I’ve read one zillion mysteries. This is not because I care about who did it. I don’t care. And I almost never figure it out. I don’t have that kind of mind at all. I don’t care who did it. I have reread mysteries numerous times and I don’t even remember who did it. I’ve read all the Agatha Christies. I’ve read all the Nero Wolfe books by Rex Stout. He wrote many of them, but not enough for Fran. I’m always hoping to find one I’ve never read. It’s the same as the New Yorker’s dream of finding an extra room in your apartment that you didn’t know was there. One thing I like about mysteries is that they end. Which is true of so little else. I have avoided science fiction my entire life, or any kind of fantasy. When the Harry Potter books came out, I bought the first one because everyone said how great it was. But I didn’t like it. And I realized I would not have liked it as a child either. I’m not saying I don’t love her, because she did a great thing. To see children lined up outside bookstores  —   that was fantastic. But those kinds of books. . ’u2008. ’u2008. It’s like adventures or people who climb mountains or jump out of airplanes I find real life challenging enough. How do you like to read? Paper or electronic? One book at a time or several simultaneously?  Obviously, paper. I mean, actually, on his show once, Jimmy Fallon gave me a Kindle. He actually gave it to me as a present. I said: “I know you gave me this because I don’t have one. You know what else I don’t have? A Bentley. ” I don’t think they’re horrible. I don’t object to them. I’m just not interested in them. People are always showing me this stuff like I’m from outer space and I’ve never heard of it. I have really bad eyesight, so they always tell me you can make the type bigger. I suppose that would be a good thing for me, but I don’t care. I’d rather squint. I see people using them on the subway. It seems to me that the majority of people you see reading on these things are in their 40s. I see fewer kids reading on them, and by kids I mean people in their 20s. These are the people I see most frequently reading actual books, which I find very encouraging. How do you organize your books? My books are organized first by category. Fiction, letters, essays. Those kinds of categories. And then there are many subdivisions. Then within categories, they’re alphabetized. I always have arguments with the guy who helps me organize my books, because I have a biography section. He says: “You can’t have a biography section. You have to have them arranged by writer. For instance, Henry James’s fiction, then the letters, the biographies, etc. ” And I say: “I know. That’s the right way to do it. But that would take up too much space. ” All the apartments I buy or rent are for my books, not for myself. I don’t need the space. I’m   . I have a whole bookcase that this guy calls “your crazy books. ” The crazy book category. Those books are not alphabetized. I also have a large reference library. I have numerous encyclopedias I have many, many dictionaries. I actually bought myself the Encyclopaedia Britannica in 1978. I always wanted it, and when I wrote my first book and had some money, I bought it. I didn’t have it growing up I had the World Book, because it was less expensive. The Encyclopaedia Britannica was so hard to buy, I can’t tell you. I had to make one million phone calls. Because it was generally sold on an installment plan. They didn’t know how to send these books to someone who is just going to send a check. Nobody uses these books anymore, but I do. When the second edition of the O. E. D. came out, there was nothing I wanted more. It was like $10, 000. I had a friend who owned a bookstore, and I begged her to let me buy it at cost, and she did. It was still several thousand dollars, but I’m delighted to own it, even though I think it’s now free on the internet. You’re in the process of moving your personal library. What’s that been like?  Believe me, I’m not in the process of it yet. Because it’s so awful, I keep putting it off. But I just did it a year and a half ago. They come and pack the books. That takes three days. But two times before that, it took two months to organize them first. I have many bookcases. They have glass doors. They are mostly  . The books all go in certain places in my apartment. I like to have fiction in the living room, reference books in the writing room. I have 10, 000 books. I know this because I move them. When I move, I go through them and take some out. Many books come to this house unbidden. And unbidden books, I don’t want to keep them. Once the books are all rearranged, I can put my hand on any book. I know where they all are. What book might people be surprised to find on your shelves? I don’t know. Maybe my small library of soap carving books, because most people don’t have them. People are surprised at the fairly large number of cookbooks I have, because I don’t cook. I hate cooking, and I never cook. But I like to eat, and I like to read about food. The very first book in my library was a book my mother bought me at a house sale in the late 1950s called “Six Little Cooks. ” She bought it for a quarter. I couldn’t believe that I was allowed to have such a beautiful thing. This was my first book that I thought of as very valuable. It’s a story about a woman who goes to visit her niece and her friends and decides to spend the summer teaching them how to cook. It’s signed by the author and all the girls. Maybe because of this book, and maybe because they used to be so cheap (they no longer are) I have quite a few cookbooks. What’s the best book you’ve ever received as a gift? I don’t know. I’ve received some really wonderful books as gifts. I have some first editions of Dawn Powell, whom I love. I would never buy these books. I buy books to read. It adds about 80 zillion dollars to the price of a book to have a signed or first edition. I have some first edition Thurbers. I’m thrilled to have them, believe me. I got a first edition Thurber for my birthday this year, and that was the last book to make me laugh out loud when I reread it. I got kicked out of class in third grade reading Thurber. I couldn’t contain myself. I could not stop laughing. But not all funny writers are necessarily funny in that way. Oscar Wilde is probably the wittiest writer in English, but he doesn’t make me laugh out loud. There was a writer named Peter De Vries who did make me laugh out loud, so hard that when I was reading one of his books when I was in the hospital as a teenager, the nurse took it away from me because she thought I was going to break my stitches. Who is your favorite fictional hero or heroine? Your favorite antihero or villain?  I don’t really have these kinds of favorites. I probably had them as a child. I associate having favorite things with being a child. I’m not youthful enough to have these kinds of favorites. What kind of reader were you as a child? Which childhood books and authors stick with you most? I was a constant reader. Just like I am now. I was constantly reading. I read under the covers with a flashlight. I loved “The Secret Garden. ” The ones every girl my age read. I also have a lot of my mother’s books. Mostly I went to the library as a child. “Heidi,” Nancy Drew. I would say mostly conventional kinds of books. You’re organizing a literary dinner party. Which three writers, dead or alive, do you invite? None. I would never do it. My idea of a great literary dinner party is Fran, eating alone, reading a book. That’s my idea of a literary dinner party. When I eat alone, I spend a lot of time, before I sit down to my meager meal, choosing what to read. And I’m a lot better choosing a book than preparing a meal. And I never eat anything without reading. Ever. If I’m eating an apple, I have to get a book. Disappointing, overrated, just not good: What book did you feel you were supposed to like, and didn’t? Do you remember the last book you put down without finishing? I wouldn’t say disappointing or not good, but I will say that I have never enjoyed reading William Faulkner. I am not saying he’s not a great writer. I will just say that I prefer not to read him. I don’t enjoy reading him. I did not acquire the ability to not finish a book until I was 50 years old, which probably has to do with scarcity as a child: You have a book  —   finish it! But I’ve made a number of decisions since then. If you don’t like a book, stop reading it. If you don’t like a movie, walk out. Life is not a jail sentence. When I used to be able to go into bookstores all the time, when there were lots of bookstores, I could read a few sentences and put it down. Now I hear about a book and get someone to order it on the internet, and when the book arrives I find I don’t like it. I only read for pleasure. I don’t have to finish a book. Sometimes, I don’t realize how little I care about a book. Sometimes, I start reading a book and then realize I forgot I was reading it. And it disappears under a pile of books. Whom would you want to write your bio?  I would say Carolyn Keene. Because then at least I know they would find the culprit. If I’d known Carolyn Keene was not a person as a child, I would have been crushed. All women my age loved Nancy Drew books. In the ’80s, they had this Nancy Drew party to celebrate some new editions, and every single woman writer in New York was there, dying to talk about Nancy Drew. There weren’t many books about girls, let’s face it. It was pretty uncommon. What do you plan to read next? I don’t plan my reading. I really don’t. I’m always surprised. I can’t believe that people keep these lists of the books they read. People are so organized! This is a cast of mind so different from mine. I do have piles of books that I haven’t read yet. When I finish a book, I go through that pile. I recently noticed a book that hadn’t been read through two moves. I’ll give it to someone. It’s a good book. It’s just not for Fran. If you could require the president to read one book, what would it be?  It would depend on who’s reading it to him.'"}, "time": 1742562506.6515687}