{"duration": 0.043150901794433594, "input_args": {"text": "'“SportsCenter” anchor Linda Cohn stated on Thursday what Breitbart News has been asserting for years: that ESPN’s constant insertion of politics in their sports coverage contributed to the network’s massive loss of subscribers over the last five years. [ESPN has pushed a narrative that the loss of about 12 million subscribers, down to 88 million from its 100 million subscriber high in 2011, is due to viewers preferring to watch streaming video platforms such as Netflix, Hulu, Amazon, and others, which can be purchased at a considerably lower price than cable packages.  The popular host commented on 77 WABC’s “Bernie and Sid” show that broadcasters sharing political opinions definitely turned off some viewers, prompting them to turn off ESPN. “That is definitely a percentage of it,” said Cohn when asked whether certain social or political opinions played a part in the “bloodbath” this week when parent company Disney ordered the firing of some 100 employees. Most of those let go were radio and TV   broadcasters and sports writers. “I don’t know how big a percentage, but if anyone wants to ignore that fact, they’re blind. “You know, when you work for a big company, you have to follow in line, you have to pay the bills. But you just kind of look in the mirror and do what you think is right no matter what else is going on around you. And that’s what I always tried to do. ” According to the New York Post, the    ESPN veteran believes that certain sports fans did not like the way the network covered controversial personalities like Roger Goodell, Colin Kaepernick, and Caitlyn Jenner. Cohn cited ESPN’s granting of the 2015 Arthur Ashe Award for Courage to Jenner, right after Bruce transitioned to Caitlyn, as an example of a political statement that turned off viewers. Many felt that athletes suffering from disease or disability  —   particularly women’s basketball player Lauren Hill, who died from cancer three months before the ESPY Award Show, and   marathoner Noah Galloway who lost an arm and a leg in the Iraq War, would have been better selections for the prestigious award.'"}, "time": 1742564598.7367752}