{"duration": 0.15121030807495117, "input_args": {"text": "\"Email \\nClinton wins “by a landslide” — in the corruption department. So says columnist, New York Times bestselling author, and admitted Clinton “bagman” Jeff Rovin. Initially presenting his story anonymously in the National Enquirer , Rovin subsequently revealed his identity in a Monday interview with Fox News’ Sean Hannity. Among his striking claims: The Clintons have an “open marriage,” Hillary has had affairs with both men and women, and he paid off reporters to keep the copious Clinton dirt hush-hush. And these allegations are backed up by 24-years' worth of documentation. \\nRovin’s appearance on Hannity (video below) adds further weight to his claims, as people often associate the Enquirer with fanciful tales. Yet as Hannity himself pointed out, that paper has at times broken major stories, catching the rest of the media napping. Hannity cited scoops concerning O.J. Simpson, John Edwards’ mistress, Gary Hart, Jesse Jackson’s out-of-wedlock child, Tiger Woods’ marriage woes, and others. In fact, Rovin said that such Enquirer stories are, ironically, “probably better vetted than most of the stories in other media” because they’re “so controversial.” \\nOf course, the Enquirer 's scoops almost invariably involve salacious matters, and the Clinton story is no exception. Yet most significant are Rovin’s disclosures about media suppression of truth — and efforts to destroy people such as Monica Lewinsky. \\nRovin explains that as a Hollywood reporter in the '80s and '90s, his close relationship with the Tinseltown power set and press allowed him to become, as he put it, “‘a fixer’: someone who helps stars keep embarrassing stories out of the press.” Rovin did his job so well that in 1991 he was asked to work for a rising political couple who, together, were an embarrassing-story-disgorging machine: Arkansas governor William Jefferson Clinton and his wife, Hillary Rodham. As he wrote : I was informed that these stories would involve rumors of Bill Clinton' s many sexual dalliances and an alleged ongoing affair of Hillary Clinton with a male member of her law firm, Vince Foster, as well as a female mover-and-shaker in Hollywood. For a retainer of $4,000 a month — paid by a third party, not the campaign — I was told to keep these stories hush-hush in one of two ways: by trading access to the Clintons for “positive” interviews, or by paying the reporters. The payments were always cash, usually delivered in a movie theater or restaurant on Sunset Boulevard, and came in two denominations: $100 for a heads-up that a bad story was coming; or considerably more to kill the piece. \\nRovin’s claims align perfectly with the recent WikiLeaks revelations about direct collusion between the corrupt mainstream media and Clinton campaign; among the examples are a New York Times reporter giving the campaign veto power over quotations, a CNBC reporter advising the campaign, and CNN commentator Donna Brazile forwarding Clinton a debate question prior to a March face-off against Bernie Sanders (yes, Sandernistas, the fix was really in). \\nYet bribery wasn’t the only method for getting stories spiked; deception was another. As Rovin told Hannity, reporters “were paid to soften the stories.… What would happen is, if we got wind of a story from the tabloids, chances were pretty good it would end up in one of the mainstream newspapers or magazines. We would then contact one of those people and say, ‘This isn't true, don't run it.’” \\nAnd this apparently does ring true to Hannity, who spoke of the evidence he saw, saying to Rovin, “I went through with your editor everything that you had. You do have ledgers; you did have the faxes with the letterhead and the timestamps. The Clintons know you…. They know you fixed things for them.” \\nAnd Rovin says this fixing became a full-time job, as the Clintons committed continual sexual indiscretions in what he described as a “polyamorous” and “open” marriage — which matches the “open borders” Hillary said, in an e-mail, that she wanted. \\nRovin appears to believe the Clintons’ sexual depravity was so all-consuming that it distracted Bill from the business of running the country. He cites as the worst example of judgment the bachelor party in March 1994 for Clinton’s half-brother, Roger Clinton, who, in quintessential Clinton style, was marrying a bride eight-months-pregnant. Prostitutes were present, and recordings were made — they included Bill Clinton. \\nNone of this will surprise those who know of Bill’s having taken 26 flights on billionaire pedophile Jeffrey Epstein’s “Lolita Express,” but the recording was a problem: It was offered for sale to the Enquirer , says Rovin. This is when he says he swooped in and negotiated a deal to keep the recording suppressed. (Note: This would be a national-security concern, too. A foreign power that obtained such a recording conceivably could use it to blackmail the president.) \\nAlso in 1994, Rovin “arranged a meeting for Hillary and a woman in an exclusive Beverly Hills hotel,” he said . “I helped her slip out of a back exit for a one-on-one session with the other woman.” The journalist described this encounter as “sordid.” \\nRovin also reveals that he was part of a “team effort” to damage Monica Lewinsky; in fact, Rovin later felt so bad about this smear campaign that he apologized to Lewinsky personally. In addition, the journalist “told Hannity he was tasked with distracting the media while Hillary’s crew rummaged through [Vince] Foster’s office … to snatch documents related to the Whitewater scandal,” as WND.com put it . \\nAs to Rovin’s motivations for finally coming forward, he mentioned two significant factors. He told Hannity that when he learned that Enquirer editor Dylan Howard was doing the Clinton story and was naming sources he wanted kept confidential, he agreed to participate under the condition he could protect those sources. Second, he wrote in the Enquirer piece, “I am coming forward now because of the endless attention the alleged indiscretions of Donald Trump have received. Nothing I have heard comes close to the sexual and moral corruption of the Clintons — many of which have [sic] yet to be revealed.” \\nHaving said this, Rovin was dismayed at the campaign emphasis on dirt, saying to Hannity, “The election is too important to focus on this salacious material.” Identifying as a libertarian, the journalist expressed the common idea that politicians’ sexual indiscretions are none of anyone’s business and should be beyond scrutiny. And while many issues are more important — such as Clinton’s internationalist, open-borders dreams; amnesty plans; warmongering stance vis-à-vis Russia; and radical social agenda — that common idea is also a mistaken idea. \\nQuestion: Is there any sexual indiscretion a politician could commit that would bring his psychological fitness into question? What if a person habitually engages in bestiality? Would you want such an individual managing your finances or babysitting your child? If not, why not, if “private” sexual behavior has no bearing on whether the person can “do the job”? \\nIf so, however, then would you want such a person’s finger on the nuclear button? \\nNow, what kind of sexual depravity is not a red flag? \\nDuring the Bill Clinton years, “Character doesn’t matter” became a meme used to justify Clinton corruption. But would you want to be pulled over by a cop with bad character or have your car repaired by a mechanic with same? Character is integral to everything we do . \\nThe Bible speaks of “eyes blinded by sin,” “For the eye altering alters all,” wrote poet William Blake. Habitually engaging in wrongdoing and (as man will do) rationalizing it away — which is when we deny reality — causes us to lose touch with reality. Twisting the truth in our own minds twists our minds; conning ourselves corrupts our judgment. The eye altering… \\nHillary Clinton is poised to continue the “fundamental change” Barack Obama infamously promised. But do we really want someone in an altered state altering these United States? Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.\""}, "time": 1742564172.3255503}