{"duration": 0.0629124641418457, "input_args": {"text": "'Hillary Horrified As 2 Pics Surfaced Overnight That She Didn’t Want Out Posted on October 31, 2016 by Amanda Shea in Politics Share This Worried Hillary Clinton (left), Vindicated Donald Trump (right) \\nHillary Clinton got a Halloween surprise early when she turned on her computer and saw what was on Google. While she slept, forgetting about everything that came against her on Friday when the FBI decided to re-investigate her emails and private server, someone else was taking full advantage of the situation and exposing the truth about her as two posts showed. \\nAfter Barack Obama gave control of the Internet to International Corporation for Assigned Names and Numbers (ICANN), Hillary may have thought that her secrets would be safe. As WikiLeaks continues to prove, that couldn’t be further from the truth. Clever conservative web users are alive and well, working hard to expose the secrets that she’s enjoyed keeping behind closed doors before the Internet came along and swung them wide open, exposing the scandalous and criminal behavior that she almost got away with. \\nSince Google tends to lean left and caters to liberal agendas, it’s not often that the search results you’re looking for are all that accurate. However, on Sunday, almost 36 hours after news broke about the FBI investigating Hillary, if you were to search two separate terms, the results were awesomely accurate. \\nA tricky hacker managed to mess with the algorithm so that if anyone was looking for the definition of “pathological liar” on the popular search engine, the top result showed Hillary’s headshot alongside the description, but that wasn’t all. @triplejHack What in the Wide World of Sports is going on with Google!? pic.twitter.com/PJHC23CzDK \\n— Dilo on Fire (@FireDilo) October 31, 2016 \\nThe definition of this term said, “It is a stand-alone disorder as well as a symptom of other disorders such as psychopathy and antisocial, narcissistic, and historic personality disorders, but people who are pathological liars may not possess characteristics of the other disorders. Excessive lying is a common symptom of several mental disorders.” While that description may always come up in Google for “Pathological liar,” Hillary’s picture isn’t typically there, but it is the perfect example of the mental illness. \\nAdding to the insult was another search result the hacker altered for better accuracy. When searching for who the “45th President” is, Donald Trump’s picture showed up, which Hillary probably wasn’t too happy about. The comparison between the two searches perfectly represents both presidential candidates. With any luck, the results will stay the same after November 8 and the treatment for Hillary’s diagnosis of “pathological liar” will be prison time.'"}, "time": 1742561708.1955562}