{"duration": 0.14968037605285645, "input_args": {"text": "'GOSHEN, N. Y.  —   In chilling detail, a State Police investigator on Monday publicly described for the first time a   walk he took on a Hudson River island with Angelika Graswald, whose remarks to him soon led to charges that she murdered her fiancé while the two had been kayaking there last year. Ms. Graswald said she felt “trapped” and had withheld her fiancé’s paddle after his kayak capsized, the investigator, Donald DeQuarto, testified during a pretrial hearing. “‘I took his paddle when he was in the water,’” Ms. Graswald had told him, Investigator DeQuarto said. The walk and subsequent questioning last spring occurred 10 days after the fiancé, Vincent Viafore, 46, disappeared into the cold waters of the Hudson, on April 19, 2015. Ms. Graswald was visiting Bannerman Island, where the couple had stopped on the day of the drowning, and ran into investigators who were searching for clues to the episode, which was still being treated as an accident. Ms. Graswald, who is 36, revealed that she had removed the plug from the kayak and sabotaged the paddle, according to Investigator DeQuarto. He added that she had also said that after Mr. Viafore capsized, and was holding onto his kayak and a dry bag for flotation, he had begged Ms. Graswald to call 911, but that she “kind of reached over and took his paddle from him and strapped it onto her kayak. ” The testimony by Investigator DeQuarto came on the fourth day of the hearing here in Goshen. The purpose of the hearing is to examine how investigators obtained their evidence, which in the case against Ms. Graswald relies heavily on her own words. Ms. Graswald and Mr. Viafore, who shared an apartment in Poughkeepsie, N. Y. set out in two kayaks from the western shore of the Hudson on a mild Sunday. They paddled to Bannerman Island, where, the police say, they spent a few hours drinking beer and taking pictures. On the return crossing, however, the boat belonging to Mr. Viafore, who was not wearing a life vest, capsized. He vanished under the choppy water, which at 46 degrees was cold enough to bring on hypothermia. For 10 days, Ms. Graswald was treated as a fiancée in mourning, while rescuers searched for the body. On April 29, investigators came upon Ms. Graswald on the island, a historic site with the ruins of a castle. Another investigator testified that Ms. Graswald, who was leaving flowers on the island for Mr. Viafore, also said that he had recently postponed their wedding. She was charged with murder the next day, after an   police interrogation. Her lawyer, Richard A. Portale, is seeking to suppress a videotape of the questioning. Investigator DeQuarto testified that Ms. Graswald had also indicated that she could have pictured herself with Mr. Viafore if things had been different. “She wanted a normal life with Vincent, she wanted to get married, she wanted to have children,” he said. Investigator DeQuarto had asked her how she felt about Mr. Viafore’s death. Her response, he said, was: “Fine. Over it. ” “She felt like herself,” he testified. “She felt free. ” Prosecutors said Ms. Graswald stood to receive $250, 000 in life insurance benefits from Mr. Viafore’s death. Mr. Portale has portrayed Mr. Viafore’s death as a tragic drowning, triggered by the waters of the rough, cold river. Investigator DeQuarto also testified that Ms. Graswald was angry that Mr. Viafore had pressured her to have sex with him and another woman. Ms. Graswald, he said, had talked about Mr. Viafore’s making “sexual demands to her, how he wanted to have threesomes with other women, how he made her have sex when he wanted sex. ” Ms. Graswald, according to Investigator DeQuarto, had said her fiancé even had a third partner in mind, a woman he knew, named Tina. He testified that, according to what Ms. Graswald had told him on the island, Mr. Viafore would say, “‘Why can’t you do a threesome with Tina?’ Tina would do this, Tina would do that. It made her upset. ” Investigator DeQuarto said he had asked Ms. Graswald why she did not break up with Mr. Viafore. “She said she’s a very spiritual person, she knew he would never be gone” if she only broke up with him, he testified. “I asked, ‘Did you remove that plug so he would drown? ’” Mr. DeQuarto said, adding that Ms. Graswald had paused for a moment. “She said, ‘I guess I did. ’” He also said she had admitted tampering with his paddle. Kayaking experts have said that removal of the tiny drain plug, located on top of the kayak’s hull, would not have caused the kayak to fill with water. But they said waves splashing into the cockpit could have made it unstable. Investigator DeQuarto recalled that shortly after he encountered Ms. Graswald on Bannerman Island, she began breathing heavily and holding her stomach. She had also asked to take breaks to smoke cigarettes, he said. He said he and another officer had encouraged Ms. Graswald to be more forthcoming, pointing out that she had made inconsistent statements about her cellphone, and appeared physically agitated. Mr. DeQuarto testified that Ms. Graswald had begun her confession on the island by saying that she “wanted to be free. ” “I wanted to go on and I wanted to be myself,” he recalled her saying, adding that she had later said of Mr. Viafore: “He trapped me. ” Investigator DeQuarto said he had asked Ms. Graswald if she would come to the police station to continue talking in a more formal setting. She said she would. On the way, Investigator DeQuarto said, she expressed feelings of freedom and of wanting to buy a motorcycle to ride. And one other thing. “‘You know, when I first saw you I thought you were cute,’” Investigator DeQuarto said she had told him. “I didn’t know what to say to that. I said, ‘Thank you. ’”'"}, "time": 1742561978.7152584}