{"duration": 0.07498788833618164, "input_args": {"text": "'When the fashion designer Tommy Hilfiger wanted to sell five works from his collection of Pop and contemporary art at auction this fall, he considered Sotheby’s and Christie’s, but ultimately took them to Phillips, long considered a distant third behind those two behemoths. “I decided this would be the best house,” Mr. Hilfiger said in an interview. “They did a great job. ” The works, by   Basquiat, Andy Warhol, Jean Dubuffet, Keith Haring and Damien Hirst, ultimately sold in Phillips’s 20th Century  Contemporary Art evening sale on Nov. 16 for a combined $7 million  —   a small sum compared with the astronomical prices that art has been commanding at auction these days. But by positioning itself as a boutique house that would show the relatively modest collection some marketing love, bring to bear the expertise of its new team of   specialists  —   and include an undisclosed guarantee for the Basquiat, “Untitled (Devil’s Head)”  —   Phillips won the consignment. (The piece sold for $3. 6 million on a low estimate of $3 million.) Phillips’s forthright use of guarantees, as well as its roster of new specialists able to attract   material, succeeded in making the auction house a player this season. “They definitely stepped up their game,” said Alex Rotter, who recently left Sotheby’s to become chairman of postwar and contemporary art at Christie’s Americas. “They’re building something that needs to be seriously considered in the   and contemporary art world. ” After the November sale, even the   art press offered Phillips kudos. “The company is gaining some traction in chipping some market share away from the auction giants,” wrote the longtime art critic Judd Tully in Blouin Artinfo. Phillips was the only auction house whose contemporary and   total was up this season, over the equivalent sale last year (by 66 percent, to $111. 2 million from $67 million). Phillips’s sale was also 92 percent successful and captured 17 percent of the market share for all contemporary evening sales in November, a 10 percent increase from a year ago. “That last sale was by far the best sale they’ve had,” said the art dealer Larry Gagosian. “You opened the catalog, and there were things you really wanted  —   it did not look like a bunch of things dealers were trying to unload. The material looked fresh. ” The auction house, which is privately owned by the Russian luxury retail group Mercury, is investing and expanding rapidly in Asia on Sunday, it held its first full   sale in Hong Kong, which totaled $19. 6 million (the low estimate was $13. 8 million) and had a respectable 82 percent success rate. Phillips’s watch department is now the world leader this month, it set an auction high with a Patek Philippe that brought $11 million, thanks to Phillips’s partnering with the team of Aurel Bacs and Livia Russo, who formerly led Christie’s international watch department. This helps the auction house broaden its client base, since watch collectors often also collect art. And Phillips’s design and photographs departments are already competitive. To be sure, there was not a flurry of bidding throughout the November sale. Phillips’s top lot  —   Gerhard Richter’s 1963 painting “Düsenjäger,” consigned by the Microsoft   Paul Allen  —   sold on a   bid of $25. 5 million with fees to its   guarantor, based in Asia. (The buyer received about $1. 6 million from Phillips for serving as the guarantor.) But the auction house also sold its first work by the Abstract Expressionist painter Clyfford Still after multiple bids  —   albeit to the guarantor. “There was quite a bit of bidding on quite a few lots at the sale,” said Edward Dolman, who became chairman and chief executive officer of Phillips in 2014, “but the air remains thin right at the top end. ” Over the last year, the two big auction houses have been wrestling with the issue of competitive guarantees: They are reluctant to offer these minimum prices, which can eat into profits, but are also compelled to give them to secure   consignments. Phillips, however, does not hesitate to rely on guarantees, even as it also tries to offload some of the risk to third parties. Thirteen of the 37 lots in the November sale had guarantees, 10 by third parties and three by the house. “Guarantees are here to stay  —   it’s something all our clients want to consider,” Mr. Dolman said. “Success is in making the right decisions around those guarantees  —   making sure the risks are laid off, if you can lay them off, and not expose the company to huge losses if you get it wrong. ” Phillips acknowledges that these are early days in Mr. Dolman’s tenure many of the specialists he has lured away from other houses only recently took up their new positions after completing their noncompete agreements. In   and contemporary art, this crew includes the Christie’s alumni   Engelen and Robert Manley, and the former Sotheby’s experts Scott Nussbaum and Jonathan Crockett (who is based in Asia). Cheyenne Westphal, Sotheby’s former worldwide head of contemporary art, and Marianne Hoet, previously an international director at Christie’s, begin positions at Phillips next year. “What people don’t understand about this business is it needs an absolute core of infrastructure,” Mr. Dolman said. Mr. Dolman himself is widely respected in the industry, having been Christie’s chief executive and later director of the office of Sheikha al Mayassa bint Hamad bin Khalifa   chairwoman of the Qatar Museums Authority. He left Qatar the year after Sheikh Tamim bin Hamad   took over as emir in 2013 the fate of contemporary art in that country is unclear, since the sheikh is known to be more conservative. “I was asked to develop a   plan for the arts sector in Qatar and had completed that work,” Mr. Dolman said. “The change of emir certainly acted as a catalyst for my decision, as the priorities of the new government became uncertain. The old emir had been a great supporter of the arts in Qatar. ” Phillips took some risks in its contemporary evening sale this season that paid off, like featuring two   artists, Carmen Herrera, the   abstract painter, and Mira Schendel, a Brazilian artist, who both would have typically been featured in a Latin American sale but here sold at auction highs. “It was great to put these amazing women artists on a platform with Richter and Dubuffet and Calder,” Mr. Manley said. “Starting next season, we’re going to break down those boundaries more and more. ” Phillips is also taking an approach to auction catalogs that is different from that of its competitors, which tend to publish costly “huge tomes that are these    textbooks that increasingly few people will ever read,” Mr. Manley said. “We try to focus on the information that really matters to clients,” he added. This fall, for example, Phillips published a separate catalog detailing the restoration of Roy Lichtenstein’s 1994 canvas “Nudes in Mirror,” which was slashed during a 2005 exhibition. (The painting sold for $21. 5 million, with no guarantee.) “They were always upfront with me about their assessment of the painting and the sale,” said Richard Rush, whose family consigned the work. “We were all 100 percent behind this strategy, and it was really a team effort. ” The Phillips specialists acknowledge that their November sale was only an opening move the larger effort to disrupt the duopoly has just begun. “We’re still in this phase when we get the sympathy vote,” Mr. Engelen said. “I don’t think it’s a giant leap. It’s just a good step to take. ” “As long as we have a seat at the table, that was the whole point,” he added. “Let’s get a seat at the table. ”'"}, "time": 1742628423.5232084}