{"duration": 0.0869901180267334, "input_args": {"text": "'STANFORD, CALIF.  —   Take out your flow journals. We’re going to talk about flow moments. You’re going to learn how to find a fulfilling career. You’re going to learn how to better navigate life’s   decisions and kill your “wicked problems” dead. How? By training yourself to think like a designer. That, anyway, is the premise of “Designing Your Life,” a class taught at Stanford University (the school’s “most popular class,” according to Fast Company magazine) as well as the   book that grew out of it, “Designing Your Life: How to Build a   Joyful Life” (Knopf). The two men who created the class and wrote the book are Silicon Valley veterans, Bill Burnett and Dave Evans. They believe they have hit upon a system to help you deal with almost any challenge. “How do you find the one to love  —   we don’t do that,” Mr. Burnett said. “We also don’t give advice on weight loss. ” But everything else? The two professors claim that you can design an amazing life in the same way that Jonathan Ive designed the iPhone. They say the practices taught in the class and the book can help you (in    ) “reframe” dysfunctional beliefs that surround life and career decisions and help you “wayfind” in a chaotic world through the adoption of such design tenets as    prototyping and  . After nine years of teaching their secrets to future Google product managers and   wunderkinds, Mr. Burnett and Mr. Evans are opening up the curriculum to everyone. “What do I want to be when I grow up?” and “Am I living a meaningful life?” aren’t only subjects for     dorm hangouts, the men said. “The question of ‘What do I do with the rest of my one wild and wonderful life?’ is on everyone’s mind,” Mr. Evans said. Mr. Burnett recalled a conversation with Stanford’s dean of the engineering department, who was about to retire. “He said: ‘Can I take your class? Because I don’t know what I’m going to be now that I’m not the dean anymore. ’” Mr. Burnett added: “One of the   out there is that you should figure it out by 25, or maybe it’s 27 now. Then there’s the other thing of failure to launch, that millennials are slackers. Part of the permission we give people is: Reframe this. You’re not supposed to have it figured out. ” Mr. Burnett and Mr. Evans looked on as the roughly 50 Stanford students in their charge took out and read from their flow journals. Then they broke the class into discussion groups of six or seven. It was early May, and the students were in the final weeks of “Designing Your Life. ” Standing in the front of the room, Mr. Burnett and Mr. Evans began to make their way through a PowerPoint presentation. “When did you seem the most animated, the most present?” Mr. Burnett said, by way of guiding the discussion groups. Silviana Ilcus, an art history major who had completed more than 230 units at Stanford without having arrived at a firm idea of what she wanted to with her life, addressed the other members of her group. “I don’t have flow when I’m doing art history,” Ms. Ilcus said. “I hate writing. ” The others listened patiently. “My flow was doing math,” she said, seeming to have a   moment in real time. “I’m wondering why it didn’t guide my choice of major. ” Sitting at an outdoor campus food court after class, Mr. Burnett and Mr. Evans nodded in recognition after hearing of the exchange. “The course surfaces stuff that people haven’t worked through yet, almost universally,” Mr. Evans said. Mr. Burnett said, “It’s a place to have this conversation, because nobody is asking them these questions, and they’re not asking themselves. ” College students are promising empty vessels, as yet unburdened by the   and compromises that keep the rest of us up at night  —   say, hating your corporate job but loving the house it pays for, or wanting to fulfill your dream of backpacking across Europe with two young children in school. To make “Designing Your Life” workable for people in midcareer, the professors had to do their own reframe of the curriculum. The book includes things that are not in the class, like what Mr. Burnett and Mr. Evans call “anchor problems”  —   overcommitted life choices that keep people stuck and unhappy. A common mistake that people make, they said, is to assume that there’s only one right solution or optimal version of your life, and that if you choose wrong, you’ve blown it. That’s completely absurd, Mr. Evans said: “There are lots of you. There are lots of right answers. ” As   messengers, the two men are an odd couple. Mr. Burnett, 59, is a   acerbic, existential atheist with an earring, while Mr. Evans, 63, is an outgoing, verbose, practicing Christian with the gray beard of a philosopher. Both are Stanford grads, and while they have accomplished résumés (Mr. Burnett helped to design the original “Star Wars” toys and worked at Apple before becoming executive director of Stanford’s design program Mr. Evans also worked at Apple and   Electronic Arts, the game company) each said his younger self would have been well served by the course. For his part, Mr. Evans struggled as a biology student, a major he chose because he had watched a Jacques Cousteau television special as a boy, and one he clung to because, he said, “I don’t think I had conscious permission to not know what I was doing. ” He switched to mechanical engineering and graduated with a master’s degree in the  ’70s. But when an Apple recruiter called, he initially hung up, because he was bored by computers. In doing so, Mr. Evans said ruefully, he violated several principles of “Designing Your Life,” among them staying open to “latent wonderfulness. ” “If you’re wrong, you go: ‘Oh, computers are boring. O. K. I’m going home now,’” Mr. Evans explained. “ ‘Yes’ is easy. ‘No’ is hard to come back from. ” Mr. Burnett had an easier time on the surface, finding his way to the design program at Stanford and a lifelong vocation. Through a professor mentor, he landed a job as a toy designer and went on to greater success. But, he said: “My method was a blind walk. I didn’t have any strategies. I trusted my intuition, but I worried that I didn’t know what I was doing. ” Before joining forces, they hashed out the concepts they had been developing over a   lunch at a Portola Valley beer garden then known as Zott’s (short for Rissotti’s it is now called the Alpine Inn) using their life experiences as grist for the curriculum. In a place like Stanford, where yearly tuition is about $50, 000, they thought it was worthwhile to send students into the world with practical knowledge about how to find a fulfilling job and excel at it. They began holding workshops for adults a few years ago, including for the employees of Google. The workshop and the book are an effort to take their approach beyond its cloistered campus setting. As Mr. Evans put it, “We’re trying to give this thing away. ” If you can get past the   language and Silicon Valley preciousness, many of the principles of “Designing Your Life” are, in fact, helpful. Design thinking, as rendered in the book, is about treating life in a more improvisational way. It’s a welcome counterbalance to the   engineering   gripping the culture. Follow Mr. Burnett’s and Mr. Evans’s teachings, and the   process of decision making suddenly seems more playful. Their method is experiential and accepts that failure is part of the process. Central to the philosophy is prototyping, a concept borrowed from how product designers work. Let’s say you’re thinking of changing careers. Interview someone who does the job you’re considering. Better yet, ask to shadow them for a day, or work in the field on weekends. If it feels right, take it a step further if it doesn’t, move on. “It’s a classic form of design,” Mr. Burnett said. “You build a lot of stuff, you try a lot of stuff. But it’s always less than the whole product. ” Prototyping big decisions like a career change or a move, meanwhile, guards against blowing up your life to rush headlong into the alluring unknown, or worse, taking no action for years, unhappily. Emma Wood, a    Stanford graduate and a consultant at McKinsey  Company who took “Designing Your Life” as an undergraduate, said the class released the pressure she felt about the life she would face after graduation. “Your whole future and happiness aren’t tied to this one plan working out,” she said. “You can make mistakes. Failure is good. ” The capstone of the Stanford class, and a key part of the book, is an assignment to come up with three “Odyssey Plans” that map out the next five years of your life in radically different ways. The activity is designed to reinforce the sense of multiple viable options, unlock the imagination and eliminate the attractive power of the unknown alternative. Lingtong Sun, who graduated from Stanford last year, said he continues to use the “Odyssey Plan” and other concepts from the class to decide his   career. “On the grand level, I haven’t figured out what I want to do yet,” said Mr. Sun, who works as a software engineer for a tech   in the Bay Area. “But I’m more open to trying something and seeing how it goes. It’s that bias toward action. You can’t think your way into your future. ” Breaking down the system to its basic parts, as a designer would, Mr. Evans said, “There are only two things we offer in the class: ideas and tools. ” He added, “If you think with these ideas rather than the ones you had before, and you use these tools, we believe your chance of building and getting what you want will go up. ”'"}, "time": 1742628605.0123286}