{"duration": 0.06664037704467773, "input_args": {"text": "'Share on Twitter \\nSonia Morales didn\\'t hesitate for a moment when she was told that her unborn daughter would be born with a severe birth defect. While doctors suggested she terminate the pregnancy, Sonia knew she had been given a gift. \\nAnd when online strangers make hateful comments about her daughter now, Sonia has the perfect response. Loading Facebook Post... \\nAs WJLA News reports, Sonia was 16 weeks pregnant when she learned that her child had anencephaly. Her daughter would be born without a portion of her brain, skull, and scalp. \\nDoctors predicted that the baby would survive a few hours or days, but Sonia refused to consider abortion. She tells WJLA: \\n“God made no mistake giving Angela to Rony, Elizabeth, and I. He chose us for this sacred task and we said yes to his calling. We made the commitment even before her birth. We will take care of her the rest of her life here on earth.” \\nSonia and her family welcomed baby Angela on March 23, 2014. Sonia began working to raise awareness about anencephaly, creating a Facebook page about her daughter and her “miraculous journey.” Loading Facebook Post... \\nWith the internet being what it is, however, it was only a matter of time before the horrible remarks came trickling in. \\nQuite a few commenters wrote about how they thought Angela was less than human. Some even suggested that Sonia would be doing her daughter a favor if she ended Angela\\'s life. \\nSonia says that the hateful messages bring tears to her eyes, but that she tries to move past them. However, one comment in particular drove her to respond. She recounts on Facebook what one poster wrote: \\n“Angela looks less attractive now that she is growing and gaining weight.” \\nSonia decided to reply for the daughter who could not. After pointing out that beauty lies within, she writes: \\n“I know that Angela looks different from my typical child, but she is beautiful just the way she is. ... She is full of grace and has great peace despite the struggles. She is a radiant light in the darkness in this materialistic and shallow culture that defines beauty in the pleasure of interests. She is a true picture of strength; she is a precious little girl with a beautiful soul. So this statement does not define whom Angela IS, it defines who YOU really are!” \\nIn response to those who hold her daughter\\'s life cheap, Sonia only says that they can\\'t know what it\\'s like to enjoy her daughter\\'s smiles and laughter. She tells WJLA: \\n\"Even if her life does not please some people, we can’t play God and assume the right to dictate who should live and die. If you get to spend five minutes with her, you will see that she is perfect the way she is.” \\nNow two years old, Angela has defied expectations, and her family says that they are blessed to have her with them for as long as they can. Loading Facebook Post... \\nAfter seeing how her daughter has been an inspiration to so many, Sonia knows exactly how meaningless the harsh words from strangers are. She tells NBC10 News : \\n“It is so amazing to see how many lives Angela has touched around the world. She hasn\\'t said a word, but her testimony of life and love has reached more than 50 countries. God chose Angela before she was even born. She might never walk or talk or go to school or run a marathon, but she has done more than I have ever done in my entire life.” \\nAnd despite the negative comments, Sonia knows that she gets to spend her days with a miracle. '"}, "time": 1742628363.8263338}