{"duration": 0.06362032890319824, "input_args": {"text": "'For most of her presidential campaign, whenever Hillary Clinton has been confronted with polls showing that a majority of voters do not trust her, she has attributed the problem to decades of wild Republican attacks and   conspiracy theories. Last week, speaking to a sympathetic crowd in Chicago, she also pointed a finger in a surprising new direction: at herself. “I personally know I have work to do on this front a lot of people tell pollsters they don’t trust me,” Mrs. Clinton said in a speech to the   Coalition on June 27. “It is certainly true I have made mistakes,” she said a moment later, adding, “So I understand people having questions. ” The questions grew far more intense after the F. B. I. director, James B. Comey Jr. on Tuesday bluntly contradicted numerous statements Mrs. Clinton and her aides had made over the past year in defending her email practices as secretary of state. Though Mr. Comey’s stark critique of her actions as “extremely careless” came after he recommended that she not be criminally charged, it cast a harsh light on perhaps the central challenge to Mrs. Clinton and her campaign: how to get skeptical voters to trust her. Yet the snippet of introspection last week from Mrs. Clinton, a candidate not known for public   may have signaled an important shift in how she and her campaign hope to do just that. “You can’t just talk someone into trusting you,” she told her audience. “You’ve got to earn it. ” Mrs. Clinton’s advisers say there is little she can do to address this trust deficit  . While a candidate seen as unprepared could give speeches and interviews to demonstrate intellectual and policy heft, and intimate, folksy events could help address likability issues, distrust is not something that a week of themed events or a rollout of new proposals can correct. “There’s no magic set of words you can say to wash all that away,” said Jennifer Palmieri, a campaign spokeswoman, who was referring specifically to Republican attacks, not to Mrs. Clinton’s own acts, as having eroded trust. “Once she has the job,” Ms. Palmieri added, “her performance, and how hard she works for the people she represents, quells those doubts. ” So Mrs. Clinton will not bluntly ask voters to trust her, aides said. Instead, she will try to own up to the fact that many voters do not, and will discuss this in more personal terms, depending on the setting and audience. At the same time, aides said, Mrs. Clinton will try to build, or rebuild, trust with voters by demonstrating competence and a devotion to policies that are important to them, like making college more affordable, achieving equal pay for women, and enacting paid family and medical leave. For Mrs. Clinton, that means emphasizing how she won over skeptical New Yorkers when she ran for the Senate in 2000 after having just moved to the state. “A lot of voters had doubts about me,” she said in the Chicago speech. “I delivered for people, and they learned they could count on me to fight for them. And in the end, I earned their trust. ” Trust is not a problem exclusive to Mrs. Clinton: Never have polls shown the presumptive nominees of both major parties so distrusted or disliked. A Quinnipiac University poll released last week found that only 45 percent of voters considered the presumptive Republican nominee, Donald J. Trump, honest and trustworthy just 37 percent said so of Mrs. Clinton. The nearest comparison to her predicament may involve Richard M. Nixon, who polished his image before successfully reintroducing himself to voters in 1968. “He did it by focusing on all the things he brought to the table: foreign policy experience and a different approach to Johnson on Vietnam,” said Kenneth L. Khachigian, a speechwriter for Nixon and later Ronald Reagan. Yet the time for reintroductions is long past, and opinions about Mrs. Clinton are arguably even more entrenched. Even the brochure at the Chicago luncheon referred to the Whitewater and Monica Lewinsky scandals and described Mrs. Clinton as “the only first lady to have been subpoenaed. ” (A   spokesman told The Chicago Tribune that a volunteer’s “brain freeze” was to blame.) “Realistically speaking, it is pretty hard in today’s media and political environment for the   candidate to significantly lift up how voters perceive them on trust,” said Geoff Garin, a Democratic pollster and senior adviser to Priorities USA Action, a “super PAC” supporting Mrs. Clinton. “Voters are much more inclined to believe the bad things they hear about a political figure than the good things,” he said. Showing contrition so close to the election could also ring hollow: It took months after the email scandal broke for Mrs. Clinton to admit she had made a mistake. Mrs. Clinton’s trust problem is also different from Mr. Trump’s, polls show. In the most recent New York   News poll, some 62 percent of registered voters said Mrs. Clinton said what she thought people wanted to hear most of the time, rather than what she believed, compared with 39 percent who said the same about Mr. Trump. “It’s more like she’s saying things because they’re politically correct or because they further her agenda, rather than because it’s coming from the heart,” said Alan Podmore, 53, of West Hills, Calif. Even her supporters tell pollsters that they do not trust her, a weakness Republicans identified early and have tried to capitalize on for more than a year. Voters often cite the emails or her paid speeches to Wall Street banks as reasons for their distrust, but they also point to past Clinton scandals and to a vague gut feeling that she has never been completely truthful. “It goes all the way back to when she was first lady,” said Misty Leach, 43, a high school teacher in McDonough, Ga. “I remember her going on TV about the Monica Lewinsky thing and saying, ‘It was just a Republican conspiracy to get my husband.’ No, it wasn’t. ” Mrs. Clinton must also tread carefully in asking voters to trust her as a policy maker while forgiving or setting aside mistakes like the email imbroglio. Thanks to Mr. Comey, Republicans can now argue more persuasively that she neglected the public interest, took risks with national security and broke faith with voters. “Hillary Clinton has spent the last 16 months looking into cameras deliberately lying to the American people,” said Reince Priebus, chairman of the Republican National Committee. The Democratic convention in Philadelphia this month will present Mrs. Clinton with her most significant opportunity to address her trustworthiness. Her campaign plans to release biographical videos showing how she has delivered on promises to help children and families throughout her career. And the party will lean on President Obama, Vice President Joseph R. Biden Jr. and Senator Elizabeth Warren, among others, to vouch for her. Conventions can indeed work wonders: In the 1992 campaign, when Bill Clinton contended with accusations of adultery and   his aides produced the “Man from Hope” video, which reintroduced him as a   kid who made good. But aides to Mrs. Clinton also take solace from polls showing that voters believe she is more prepared than Mr. Trump to be commander in chief and that she is looking out for the middle class. “You can never forget that elections are about choices,” said Joel Benenson, Mrs. Clinton’s chief strategist. Demolishing an opponent’s trustworthiness can also be fairly quick work in politics: Mrs. Clinton is assailing Mr. Trump’s credibility and honesty in many areas, from his record in business to his campaign promises. Still, attacking Mr. Trump, no matter how successfully, will not necessarily fix what is broken in Mrs. Clinton’s relationship with voters. “Trust is one of the hardest things to regain once it’s lost, whether it’s with   friends, relatives, spouses, kids,” said Russell J. Schriefer, a Republican strategist who was a senior adviser to Mitt Romney. “There are two things that drive us in politics: the head and the heart,” he added. “Trust is a question of heart. ”'"}, "time": 1742628458.0042608}