{"duration": 0.08785438537597656, "input_args": {"text": "'“I’m sorry. ” Two simple words, not so simply said. On Wednesday, the public representatives of two embattled American institutions  —   United Airlines and the White House  —   found themselves on national television grappling with a delicate and increasingly common ritual of the corporate and political worlds: the public apology. Oscar Munoz, United’s chief executive, recalled his “shame” upon seeing a cellphone video, shared by millions of people, of a paying passenger being violently evicted from one of his airline’s flights. Face taut, voice soft, Mr. Munoz’s televised prostration was a far cry from the robotic statement issued by United days earlier, expressing regret for “ ” a traveler. Around the same time, President Trump’s press secretary, Sean Spicer, was denouncing himself as “reprehensible” for having favorably compared Hitler to President Bashar   of Syria and referring to Nazi death camps as “Holocaust centers,” all while standing at the White House podium. The fine art of repentance is a skill taught in business schools and promoted by   consultants. But all kinds of offenders in public life still seem to struggle with the execution. Corporations like BP and Wells Fargo have faced criticism for dawdling responses to cascading crises, while politicians from Bill Clinton to Anthony Weiner have had difficulty admitting to peccadilloes. The key to contrition, according to   experts, is projecting sincerity, humanity, and a   demeanor  —   the better to convince a cynical public. And in this age of whipsawing social media, you had better do it fast. “The head of United should never have been allowed to take three swings at correcting and apologizing for an incident that was on more social media than Kim and Kanye’s wedding,” said Mortimer Matz, a New York consultant who has guided decades’ worth of clients through crises small and large. United issued several halting statements about the plane episode, which first emerged Monday morning, before Mr. Munoz made his abject appearance on Wednesday on ABC. Mr. Matz said the airline had missed its moment. “You’ve got to be a fast thinker in the digital age,” said Mr. Matz, who will be 93 in July. Many companies now take steps to be nimble and responsive when a furor erupts online. Last week, Pepsi took less than 24 hours to apologize and retract a   advertising campaign that used populist imagery to sell soda. It was a rapid   that would have been unthinkable a few years ago. This week, Mr. Spicer was quick to recognize the damage done by his   remarks, which prompted immediate denunciations on Twitter as well as calls for his resignation. He appeared on CNN within hours of his gaffe, while Mr. Munoz waited two days. Still, Mr. Spicer’s apology came only after his office tried to clarify his remarks with several statements that, while remorseful, did not clearly admit error. On Wednesday, in a previously scheduled interview at the Newseum in Washington, Mr. Spicer took a new tack: no excuses. “I made a mistake there’s no other way to say it,” Mr. Spicer told Greta van Susteren, the MSNBC anchor, his tone notably subdued. “I got into a topic that I shouldn’t have, and I screwed up. ” He added: “It really is painful to myself to know that I did something like that. ” Mr. Munoz, interviewed on “Good Morning America” on Wednesday, was similarly solemn. “That shame and embarrassment was pretty palpable for me,” he told the correspondent Rebecca Jarvis, emotion in his voice. “This can never  —   will never  —   happen again on a United Airlines flight. That’s my premise and that’s my promise. ” Later on Wednesday, United said it would refund the fares of all passengers on the affected flight. Both Mr. Munoz, who was named “communicator of the year” by PR Week magazine last month, and Mr. Spicer took pains to personalize their apologies. It’s a technique that, conscious or not, is recommended by crisis experts. “That’s on me, I have to fix that,” Mr. Munoz said when asked about the airline policies that led to the violent ejection. Mr. Spicer described his blunder as “mine to own, mine to apologize for, mine to ask forgiveness for. ” That    approach, consultants say, is one of the few ways to start rebuilding trust. The accounting firm PwC, for instance, gave a detailed explanation, and quick apology, for this year’s Oscar best picture fiasco, eventually holding onto its Academy Awards account. “People want someone to throw the book at,” said Katie Sprehe, a senior director at the communications firm APCO Worldwide. Ms. Sprehe, who studies reputation maintenance, said United had erred by not moving swiftly to mirror its customers’ outrage. “You need to speak your stakeholders’ language, and coming out with P. R. mumbo jumbo, like ‘’ is the wrong thing to do,” she said. Stu Loeser, an adviser to executives in the technology and finance industries, said that a   apology must be considered in context. “Oscar Munoz answers to more than 85, 000 employees who want to know that if they were the ones caught in a viral video maelstrom, he’d back them up,” said Mr. Loeser, who was press secretary to former Mayor Michael R. Bloomberg of New York. “Sean Spicer ultimately answers to one person and one person only”  —   Mr. Trump  —   “someone who sees backing down or apologizing as not only a weakness, but a character flaw. ” “In both cases,” Mr. Loeser added, “what might appear to be an irrational series of statements that got you into trouble makes more sense, when you think about who they’re actually answering to. ” Mr. Munoz ended his interview by saying he had no plans to resign. “I was hired to make United better, and I’ve been doing that, and that’s what I’ll continue to do,” he said. Mr. Spicer, asked by Ms. Van Susteren if he enjoyed being press secretary, said he loved it. “I truly do believe it’s an honor to have this job,” he said. “It is a privilege. And if you don’t believe it, then you shouldn’t be here. ” Whether the apologies outlive the gaffes remains to be seen. Ken Sunshine, who founded the   firm Sunshine Sachs, said he was skeptical. “My rule?” he said. “You get one shot. ”'"}, "time": 1742563709.357447}