{"duration": 0.23711395263671875, "input_args": {"text": "'Leave a reply AA Michael – When you are attuned to the mid-4th-dimensional frequencies of light, you relinquish the idea of being human as you have known it in the past. It is a time of the emergence of your soul consciousness as you allow it to become the reigning influence within your life. this means you begin to listen to the wisdom of your body elemental, and the signals it sends as to what is appropriate for your physical and emotional well-being. Your DNA and the cells of your body begin to integrate the higher frequencies of light, and gradually, you begin to vibrate and attune to the refined energy of the New Age. This period of the transformation process could be likened to a death of your old self-consciousness, which is really the process of removing the veils of illusion. As you integrate each new level of your oversoul/higher self, you absorb the wisdom and illumination of that facet of your vaster being. You are in the process of shedding the multiple layers of density, which you have absorbed within your auric field down through the many ages of earthly experience. The saying “the Light shall set you free” is a true statement, for the Light is dissolving the layers upon layers of negativity that you have carried for such a very long time. You begin to function within an auric field of refined light of your own creation, as you turn inward, and learn to stay focused and centered within your sacred heart in the power of the Now moment. Over time you, as light transformers, begin to draw forth and integrate the maximum amount of adamantine particles of creator light, and you then consciously radiate forth the remainder out to humanity and to the world. When you achieve a certain level of harmony within, you open the physical body gateways or portals to the higher dimensions: the ascension chakra or the medulla oblongata, and the vagus nerve at the base of the skull, and also the back portal of your sacred heart and your sacred mind. These are major steps in the ascension process. When this process is complete, you are well on your way to gaining access to the first sub-level of the fifth dimension, where your entry-level sacred triad is waiting to welcome you. The Adam/Eve Kadmon body is your original individualized seed atom god-self in a fully conscious light body form, created by the Elohim (lords of light/builders of) as the archetype of humanity. The Adam Kadmon embodies the original complete divine and spiritual nature of man/woman. It is not the same as your personal oversoul body of light which is itself evolving towards divine consciousness. Your higher selves, your spiritual/oversoul body, and your sacred triads are refracted facets of your god self, your original light body. The Kadmon light body has the ability to take on any form necessary to create and experience all forms of creation in your father/mother God’s plan for this universe. The Adam/Eve Kadmon is a spiritual-physical creation, which incarnates in the planetary worlds during all cycles of divine creation. Physical Body : In the beginning awakening process there is a desire to turn inward and to listen to the Inner wisdom of the Soul. This Soul awareness includes your Body Elemental, the Memory Seed Atom which contains the perfect blueprint for your original Adam/Eve Kadmon Light Form. Emotional Body : First you become aware that your emotions control you through your wants, needs and desires, which in the long run do not bring you a sense of happiness or satisfaction. You begin to turn inward and to question your life choices, asking Awhat have been the results of your actions@? You begin to seek answers for the pain and dissatisfaction in your life. The voice of your Super-conscious mind becomes stronger as you gradually take heed and follow your soul’s guidance. As you become comfortable, and begin to rely on this voice of higher wisdom, the ego-desire body gradually relinquishes control, and the soul-self becomes the director and guiding influence in your life. You begin to align your will with the will of your higher self, for you have gradually learned to trust the inspirational and intuitive thoughts from your sacred mind. Eventually, you begin to view all interactive events in your life from a higher vantage point. You develop emotional detachment through a more refined view of human interactions. Having experienced most of the important tests of the emotions, you develop a better understanding of the human emotional nature. Again, you learn to go with the flow, and you view your tests and challenges as gifts and opportunities for growth. You have learned to make peace with the past, and to script your future, as you endeavor to live and focus on the NOW moment. Gradually, over time, the vibrational patterns of the emotional body are lifted above the magnetic pull of the physical realm. The Mental Body : You begin to realize the limitations of your subconscious and conscious minds, and you see how rigid, limited and stuck you have been in the mass consciousness belief structure. You willingly begin a self-analysis process, whereby you reevaluate your attitudes, judgment and programmed concepts. You begin to feel a burning desire to expand your knowledge beyond your physical reality, as you seek to learn why you are here on Earth, and the greater meaning of life. Your instinctive mind gives way to your higher intellectual mind, and gradually you gain access to your sacred/intuitive mind. As your Soul-self becomes the director of your destiny. Your life begins to change dramatically for the better; then faith and trust become an inborn certainty that all is happening in Divine order. You also know with certainty that you are on an upward spiraling path to a more refined, harmonious and loving reality. All you have to do is stay in the moment, and take one step at a time as the WAY is opened before you. A self-master is: self-determined * self-conditioned * self-aware * soul-conscious. A self-master is responsive to the surrounding environment, while being the observer of mundane life experiences from a higher vantage point. Being in the world, but not of it. A most profound event is when you first experience the abounding loving energy and joy radiating forth from within your Sacred Heart and Soul. The soul’s nature is love, and while residing within the limitations of the 3rd-/4th-Dimensional environment, it is through the soul self that you connect with the love essence of your mother/father God. A self-master stands firmly centered within the sacred heart, within the midst of chaos and change, holding fast to the wisdom of the sacred mind, while gathering strength from our Father/Mother God as the illusions of the lower dimensions slowly fade away. An Adept: An Adept is a person who is firmly centered upon the path of light, and whose point of focus is from within the sacred mind and the sacred heart. He/she has balanced, harmonized and integrated all the facets of the soul self, from within the 3rd-/4th-dimensional planes of consciousness. He/she is now directly connected to his/her over-lighting sacred triad, which resides, at least, within the entry level of the 5th dimension. In order to reach this stage, an aspirant must have completed the first four stages of en-Lighten-ment, and have attained self-mastery of the first Four dimensions. This is the level of ascension open to humanity at this time, and it can, and will be, accomplished by many brave souls while in the physical vessel. A Disciple: A disciple is a person who has heeded the whisperings of the Soul Self, and who is actively seeking en-Lighten-ment, wisdom, Self-realization, and ultimately Self-mastery. Sacred Mind / Higher Mind : The human Sacred Mind is an etheric, crystalline Seed Atom stored within the upper back portion of your brain. There is a membrane of Light protecting your access to the portal into, and to the contents of your Sacred Mind, until you have raised your frequencies to the appropriate level of the higher 4th dimension. Your sacred mind contains a condensed version of your ancient past history, and a portion of the wisdom and vital information you have integrated during your many past lives in this Universe. Becoming a self-master on Earth involves gaining access to and integrating the requisite portion of the attributes, qualities and talents stored within your Sacred Mind. The mental aspect of your Higher self, or the wisdom you tap into when you connect with many facets of your vaster oversoul, will ultimately connect you with your I Am Presence / God ray / God-seed atom, which has access to the wisdom of your Father/Mother God, or the collective intelligence of this sub-universe. Divine Mind : The divine mind is the totality of your divine God-seed atom at an ever higher level: ultimately, the sacred minds of our father/mother God. For better understanding, you could say that the higher mind is a refined frequency of your consciousness, and you obtain higher consciousness levels with each download of a facet of your oversoul /higher self. As you traverse the path of ascension, and move into an accepted spectrum of light and shadow, your goal is to develop the ability to stay centered within your sacred mind and sacred heart. You learn to consciously maintain a higher perspective about what is going on around you, as you express compassion and unconditional love for everyone. That is the goal of a self-master. As you become attuned to the higher frequencies of Light, you will become accustomed to the flow of sacred fire breath, which has been called the river of life/love/light or the antakarana in ancient teachings. There is a hidden, powerful, radiant current of knowledge encoded within this living river of life. It is a code of creative genius; however, you must tap into the wisdom of the Sacred Mind and your Soul Self in order to access this inborn power. You are called “Star Seeds” for a reason, for as you return to Self-mastery, you will initiate the process of creating crystalline, life code seed atoms c a new, advanced evolutionary process, which will eventually be used by life forms within the next, forthcoming golden galaxy. We ask you to study what we have revealed, and endeavor to get the universal schematic we have created firmly within your mind, so that you will understand the next phase of the wondrous cosmic events, which are unfolding before your eyes. As a bearer of light, you promised to be our representatives on Earth. Within, you have all that you need to complete your earthly journey through the remainder of the 4th-dimensional realms. As doubts arise, remember, all of your experiences of the past, whether they were successful or seemingly failures, have given you a wealth of experience to draw upon. Shine your light for all to see. Call on us, and we will assist you in every way possible. Know that I am with you always, and you are loved most profoundly. I AM Archangel Michael Transmitted through Ronna/Sacred Scribe * SF Source Ronna Star  '"}, "time": 1742628473.5097516}