{"duration": 0.031013011932373047, "input_args": {"text": "'Dienstag, 22. November 2016 Facebook geht gegen Fake-News vor: Alle Meldungen von Bild.de und Focus.de gelöscht Menlo Park (dpo) - Hunderttausende Facebook-User dürften sich heute Morgen verwundert die Augen gerieben haben: Das soziale Netzwerk hat durch eine Änderung seines Algorithmus sämtliche Meldungen von Bild.de und Focus.de mit sofortiger Wirkung aus seiner Timeline verbannt. Ziel der Maßnahme sei es, die massenhafte Verbreitung von Fake-News einzudämmen, teilte das Unternehmen heute mit. Auch die Facebook-Seiten der Fake-News-Seiten Bild ( https://www.facebook.com/biId/ ) und Focus ( https://www.facebook.com/focus-onIine/ ) wurden gelöscht und sind nicht mehr erreichbar. \"Desinformation ist kein Kavaliersdelikt\", so Facebook-Boss Mark Zuckerberg. \"Zwei der schlimmsten Sünder haben wir aus dem Verkehr gezogen. Weitere werden folgen.\" Hier und da könne zwar immer noch eine Nachricht durchrutschen, so der Facebook-Gründer. \"Wir arbeiten aber mit Hochdruck daran, dass das in Zukunft nicht mehr passiert.\" Sollten User noch einzelne Bild - oder Focus -Nachrichten in der Timeline haben, helfe nur eines. \"Ignorieren!\" Typische \"Meldungen\" auf Focus Online und Bild Falsche Nachrichten waren in den vergangenen Tagen und Wochen von vielen Beobachtern für den Wahlsieg von Donald Trump mitverantwortlich gemacht worden. Auch die Bundestagswahl 2017 läuft möglicherweise Gefahr, von Fake-Nachrichtenportalen massiv beeinflusst zu werden. Angeblich sollen einschlägige Falschnews-Verbreiter wie Bild.de und Focus.de sogar ganze Redaktionen beschäftigen, die täglich Hunderte Fake-Meldungen ausstoßen – der Schaden für die Gesellschaft ist noch gar nicht abschätzbar. \"News\" Bei Bild.de, einem der größten Player, ist man selbst überrascht über die Gutgläubigkeit des Publikums. \"Dass das so lange gut gegangen ist, hätten ich nie gedacht\", so Julian Reichelt, der sogenannte Chefredakteur der Seite. \"Keine Ahnung, warum so viele Menschen unsere Meldungen zu Pietro und Sarah Lombardis Trennung oder das neueste Tattoo von Sophia Thomalla für Nachrichten gehalten haben.\" Er muss jetzt neue Wege finden, um seine Fake-News im Internet zu verbreiten. In der \"Redaktion\" von Focus Online wiederum ist man sogar froh über die Löschung. \"Wir schreiben ohnehin immer nur Bild-Artikel minimal um und veröffentlichen die dann mit einer Clickbait-Überschrift oder einem fiesen Spruch gegen Migranten neu. Wenn wir nicht auf Facebook sehen, was gerade gut auf Bild.de läuft, wissen wir eh nicht mehr, worüber wir berichten sollen\", so Focus-Chef Daniel Steil, der beim Standesamt einen Antrag eingereicht hat, seinen Namen in Julian \"wie mein zweiter Vorname lautet, wird Sie überraschen\" Reichelt ändern zu lassen. Medienexperten raten Usern im Netz prinzipiell zur Vorsicht – und zur Skepsis. Seriöse Nachrichtenportale, deren Meldungen man ernst nehmen kann, erkenne man vor allem an ihrer schlichten Schwarz-Weiß-Optik. Sie hätten in der Regel ein Posthorn und Steckenpferd im Logo (oder beides, das ist noch glaubwürdiger!) und seien langjährig am Markt erfolgreich, zum Beispiel schon seit 1845. swo, ssi, dan'"}, "time": 1742628596.0292728}