{"duration": 1.2196555137634277, "input_args": {"text": "'David Longstreth makes music in a former  ’s workshop on the east side of Los Angeles, in an unlovely, industrial part of town. His studio sits beside a wide boulevard without nearby stop signs, red lights or crosswalks, so cars and trucks hurtle past day and night at terrifying speeds. One recent afternoon, Longstreth edged up to the curb, head swiveling. He wore an unkempt beard and scuffed desert boots that  —   after he spotted a narrow gap in traffic  —   transported him across the asphalt and into a bodega on the other side. There, he bought two gallon jugs of filtered water. He was planning a full night of recording and, he explained, “the tap water here is kind of jank. ” For the last decade and a half, Longstreth has been putting out music under the name Dirty Projectors, and it was here, beside the   death gantlet, that he finished his first new LP in four years, out next week: a   breakup album that he calls the most emotionally taxing thing he has made. His studio was cavernous, with gaping skylights and a battalion of movable soundproofing panels that Longstreth built D. I. Y.  using materials from Home Depot. These stood sentry around a drum kit, a piano and assorted microphones and amps. An iMac, loaded with ProTools production software, sat atop a Giotto monograph and a massive tome called “Recording the Beatles. ” Leaned against a wall were framed portraits of Missy Elliott, Joni Mitchell and Beethoven  —   an unimpeachable holy trinity. Longstreth, 35, draws from a wide range of references, and in between seven   Dirty Projectors albums he has put his fingerprints all over work by an impressive variety of artists. He teamed up with David Byrne to write a song and with Bjork to write several he   adventurous R. B. with Solange Knowles devised orchestral arrangements for Joanna Newsom produced an album by the Tuareg rock guitarist Bombino and, most recognizably, wrote the luminous bridge that Rihanna sings on “FourFiveSeconds,” a smash hit from 2015 that also features Kanye West and Paul McCartney. Speaking to an interviewer in 2012, Bjork praised Longstreth’s “almost psychic ability to write for other voices. ” A freight train rumbled past the studio on tracks abutting the building. Fiddling with the placement of two microphones, Longstreth seemed not to notice. Before long, I detected another, gentler source of noise pollution. A cricket had moved into the ceiling, and its intermittent chirping provided a hypnotic overhead beat. Longstreth moved to a worn old couch and, fooling around on an electric guitar, briefly improvised against it. Longstreth has not yet made an LP of cricket duets, but you could almost imagine it. He is a playful conceptualist whose music moves in a handful of directions all at once. Dirty Projectors’ critical breakthrough was the album “Rise Above,” from 2007, in which Longstreth tried to recreate Black Flag’s 1981 punk landmark, “Damaged,” wholly from memory. The result  —   a covers record riddled with the flubs and inventions of forgetfulness  —   was a jumble of intricate syncopations, vertiginous time changes and splintery guitar work. “Rise Above” was Longstreth’s fourth album, and his first to feature the singer and guitarist Amber Coffman, who joined the cast of musicians Longstreth relied upon to tour and record. Coffman became his girlfriend, and she proved crucial to the success of the band’s next album, “Bitte Orca,” which came out in 2009 and won Dirty Projectors a wave of new fans. Longstreth’s ideas about harmony, rhythm and arranging remained unconventional, but his songwriting grew brighter and more direct. Coffman’s voice, with its strong, clean phrasing, helped this music to pass, after a fashion, as a kind of alien pop. At the couple’s apartment in Greenpoint, Brooklyn, domestic rituals bled into the creative process, and vice versa. When they watched Wim Wenders’s “Wings of Desire” together, Longstreth asked Coffman to write down dialogue that resonated with her. These jottings became lyrics for the band’s biggest single, “Stillness Is the Move,” in 2009, on which Coffman emulated the   feats of R. B. stars like Mariah Carey and Destiny’s Child. Accompanying her, Longstreth played a West   guitar riff that sounded like something colorful shattering. The song put Dirty Projectors at the forefront of the booming Brooklyn   scene, alongside simpatico acts like Vampire Weekend, Animal Collective and Grizzly Bear. These bands booked worldwide tours, landed prominent festival slots, licensed songs to ad campaigns and crossed over to mainstream audiences. Among Dirty Projectors’ converts was Jay Z, who sent a handwritten note asking them to join a festival he was organizing the   star Diplo, who flew Coffman and Longstreth to Jamaica to work with him and the French rockers Phoenix, who invited the band to open for them at Madison Square Garden. In 2013, after a year of intense touring to support Dirty Projectors’ assured sixth album, “Swing Lo Magellan,” Longstreth and Coffman split. The album was not the commercial success Longstreth had hoped for. “You think an album’s gonna propel you forward, and then it doesn’t, at least not immediately,” says Brett Williams, the music manager who represents both Longstreth and Coffman. This shortfall, paired with the breakup, sent Longstreth into a depression. “I was super bummed,” he said. “The band and my relationship with Amber had become so intertwined that, when we broke up, it felt like everything that had defined my life for a decade was suddenly gone. ” Gradually he began making music again “to try to work through what I was feeling. ” The first song he released was the sparse, glitchy “Keep Your Name. ” In writing the lyrics, he drew on a     convention: “It’s a divorce song,” Longstreth said. The opening line is “I don’t know why you abandoned me,” and he soon drops a knotty clue about fissures between him and Coffman: “What I want from art is truth  —   what you want is fame. ” In building the vocals, meanwhile, Longstreth digitally lowered the pitch of his singing in a nod to DJ Screw, a Houston   innovator who wrung from this effect a narcotic quality that Longstreth was curious to explore in his song about heartbreak. The single, smoldering with recrimination, offered the first outward sign of turbulence within the group. Two weeks after its release, last fall, Coffman put out her own single, “All to Myself,” about finding solace in solitude. It emerged that she had an album of solo material due in 2017. Conjecture filled blog posts and comment sections. What was going on with Dirty Projectors? What did these dueling releases mean? The answer was complicated. After their breakup, Longstreth and Coffman reached a détente solid enough that she asked him to produce her solo record. “It was a good thing for our friendship, to reverse the roles we’d played in Dirty Projectors, where everything had been in the service of my vision,” Longstreth said. “Here, I was in service of her ideas, trying to bring them out into the world. We were reinventing how we related to each other. ” By the end of 2015, they’d more or less finished the album. In an act of symbolic accord, its last song shared musical motifs with the last song on Longstreth’s. Around this time, however, things soured again, and when I spoke with Longstreth in his studio, he said that, with some stray exceptions, he and Coffman hadn’t spoken in a year. “I want us to be close friends, and to work together again,” he said. But “things between us,” he noted unhappily, “have been better. ” Now each of their projects was scheduled to come out within a couple of months of the other: They weren’t talking, but their music was in direct conversation. On the floor of Longstreth’s studio were 15 stacks of index cards. The topmost cards bore different inscriptions in black Sharpie: These were names of new songs in various stages of completion, with each stack containing Longstreth’s notes for a different song. “Uh, I guess you can look at those,” he said when he saw me standing over the stacks. He explained that this organizational system was one he used on “Dirty Projectors” too, but as to whether another album was underway, he demurred: “I’m just working through some numbers. ” An engineer named Robby Moncrieff commandeered the iMac, dialing up the ProTools session for a song currently called “Suck My Lifestyle. ” It featured a riot of snares, bongos, tambourines, cabasas,   and claps. Some of these instruments were acoustic others,  . The acoustic sounds derived from recordings Longstreth made of the virtuoso percussionist Mauro Refosco, who backs Thom Yorke and Flea in the band Atoms for Peace. Longstreth had manipulated these recordings, sampling individual hits and rearranging them, with software, into wild new configurations. “It’s a way to use the dynamics and imperfections of his performance to make an impossible rhythm,” Longstreth said. “Suck My Lifestyle” contained a place holder guitar riff that was, like the beat, a product of ample technological mediation. Longstreth had cut and pasted recordings of his own playing, then rearranged these snippets to compose a new riff. The ensuing melody behaved in unexpected ways  —   doubling back on itself, unfurling, stammering. As Moncrieff recorded him, Longstreth sat with an acoustic guitar and diligently replayed the digitized riff live, returning it to the realm of the analog: an oil painting of a Photoshop collage. Much of the music on “Dirty Projectors,” he told me, had come together in this way. Whereas fragmentation and reconciliation are major themes on any breakup album, Longstreth had made them compositional strategies too. When I asked him to explain the tensions with Coffman, Longstreth declined, out of respect for her, he said, and to “keep certain personal things personal. ” But many lyrics on “Dirty Projectors” grapple with the breakup, whether it’s lines in “Keep Your Name” about   or his seeming admission, on the slithering “Death Spiral,” that he “condescended relentlessly. ” After I inquired into their romantic troubles, Longstreth said his desire was to “leave it to the music,” while reminding me that the album was a work of art, grounded in truth but subject to distortions. “Not a journal,” he said. (Coffman declined to speak to me for this article. Her publicist said, “Her focus right now is on her own music. ”) For Longstreth, moreover, the three years it took to make the album had allowed its meaning to dilate. He initially wrote the second single, “Little Bubble,” to describe the sphere of happiness he and Coffman temporarily shared, but here in 2017 “bubble” had become a buzzword, referring to the supposedly cosseted perspective of “coastal elites,” and now the song’s poignant refrain  —   “we had our own little bubble, for a while”  —   sounded like a postelection elegy. Longstreth hoped when he wrote “Dirty Projectors” for such added resonances to accrue, and in devising motifs that worked in the context of a breakup album but also brooked alternate interpretations, he was inspired in part by his exposure, while working on “FourFiveSeconds,” to the songwriting methods of Kanye West. (According to Longstreth, West initially envisioned that track as a solo, then added Rihanna.) In 2015 West asked Longstreth over to his L. A. home to toss around ideas. West routinely assembles motley creative brain trusts, and the brusque,   Bronx rapper French Montana and the slick Canadian singer the Weeknd were there, too. This invitation led to another, to the Mexican seaside village of Punta Mita, where West rented a mansion belonging to the “Girls Gone Wild” impresario Joe Francis and transformed it into a songwriting headquarters for his album “The Life of Pablo. ” Longstreth, a coffee geek who observes a precise   ritual, brought along his own ceramic dripper and, as he   put it, “Third Wave roasted beans,” which apparently entertained West’s wife, Kim Kardashian. “She asked me, ‘Are you making, like, a caramel macchiato? ’’u2009” Longstreth recalled. Other guests included Ezra Koenig of Vampire Weekend and the rappers Rhymefest and Big Sean. “Kanye has this discursive way of working, getting input from a range of people, that I thought was really cool,” Longstreth said. He described a moment when West played a tape he’d made of Paul McCartney playing a Wurlitzer while West improvised a vocal, feeling his way through the music by making nonsense sounds. Amid this gibberish, “something he sang sounded sort of like ‘Memories can get you into trouble,’’u2009” Longstreth recalled. Struck by this phrase, he and Koenig went off to write a song exploring its potential meanings. “Like, maybe you’re with your girlfriend but thinking of your ex,” Longstreth explained. After Mexico, Longstreth kept in touch with Elon Rutberg, one of West’s main creative advisers, and solicited his feedback about “Dirty Projectors. ” Of the “Memories” song, Longstreth added, “Kanye didn’t wind up using it, but it was good  —   maybe something will come of it down the line. ” The path that Longstreth took to hanging out with Kanye West in Mexican mansions is improbable. He grew up on five acres of farmland in central Connecticut, where his parents moved from the Bay Area in the late ’70s. They levied a prohibition on video games and grew their own food. “They were into subsistence farming  —   ‘back to the land,’’u2009” he says. “They had a cow or two, sheep, goats, geese. They made their own cheese. We ate eggs from our chickens, who were my responsibility. ” His older brother, Jake, exposed him to “cool stuff,” David recalls, like “music and drawing. He showed me how to play the riff from Nirvana’s ‘Come as You Are. ’’u2009” Through Nirvana, Jake, who is now a painter in Los Angeles, got into “other weirder, smaller bands from the late ’80s and ’90s West Coast underground,” Longstreth continued, “and from there, into the first generation of punk. ” Their parents, he added, “were rock ’n’ rollers in the ’60s, but they listened pretty widely: baroque music titans of ’40s, ’50s, ’60s jazz the ‘Big Chill’ soundtrack. ” In 1999, when Jake left for college in Portland, Ore. David inherited his Tascam   recorder. With all these influences swimming through his head, he recalled, he “started making albums. My brother still has a suitcase with, like, 100 tapes we made as kids. ” Longstreth’s early recordings were rough by design:     and even ugly. “I used to feel that musical knowledge and emotional   were antagonistic,” he said, invoking bedrock punk principles. “But I was too curious about chords and instruments and recording to stay locked in that mentality. ” He enrolled at Yale, where he studied music, but was unhappy. “It was about training the next generation of global power elite,” Longstreth said of the campus culture. “It wasn’t about intellectual curiosity or mastery. ” He dropped out and traveled to Portland, where Jake had enmeshed himself in the   demimonde, and where David began giving his own concerts at house parties. After about a year, he returned to Yale to finish his degree. “It would not have been cool with my parents if I didn’t,” he explained. There, he assumed the name Dirty Projectors and made one of his best, and strangest, albums, “The Getty Address,” which was a   tracing the spiritual wanderings of a fictitious version of the Eagles’ Don Henley. The libretto was a fanciful meditation on, among other things, entwined forms of imperialism, and in Longstreth’s rendering Henley became a sort of   Oppenheimer, conflicted about his epochal hits and their role in the flattening of world culture. For the music, Longstreth “wrote and recorded arrangements for wind septet, women’s choir and cello octet,” according to accompanying text, then “digitally deconstructed” these sessions “and sang over the reconstituted parts. ” Songs alluded to Steve Reich, Justin Timberlake and, as Longstreth put it to me, “a kitschy, exoticist, American fantasy of what Chinese music sounds like. ” These collisions of era and idiom doubled, for him, as elaborate   arguments, but you didn’t need to fully grasp these in order to appreciate the album’s   beauty. By the time Longstreth moved to Brooklyn, he was something of a minor legend in   circles: ascetic, eccentric and respected for it. Ezra Koenig told me that, in college, he passingly considered becoming a music critic, but the only review he ever wrote was an “embarrassing” rave, published in the online magazine Dusted, about Dirty Projectors’ 2003 debut album. A couple of years later, Koenig befriended Longstreth and came aboard Dirty Projectors as a touring saxophonist and keyboardist  —   joining an   group of musicians whose members also included the bassist Nat Baldwin, the drummer Brian McOmber and the singers Haley Dekle and Angel Deradoorian. When Longstreth moved to a place in   Koenig, then a schoolteacher, was among his roommates. “I remember him recording music in the middle of the night, when I had to be up at 7 a. m. for work,” Koenig said. The friendship survived, and Koenig was among Longstreth’s sounding boards as he   “Dirty Projectors” for release. “I watched him go from living in a windowless room, making what most people would call difficult music, to being a part of Rihanna and Solange songs,” Koenig said. He added that, even as Longstreth’s profile has risen, there has been a constancy to his music: “Compositionally, he does harmonic stuff no one else is doing. There’s a thread that runs through all Dave’s work, where the sensibility is unmistakably him. ” One morning, I met Longstreth for breakfast burritos near the house in Highland Park that he shares with his girlfriend, an artist liaison at an L. A. gallery. Afterward we walked to his cluttered Prius, where he retrieved “The Fractal Geometry of Nature,” a book by the mathematician Benoit Mandelbrot featuring   fractals. “This is a late Christmas present for my friend Zach Harris,” Longstreth explained. “He’s a painter, and his studio’s just down the block. Do you want to pop in on him?” Longstreth moved to California in 2014, and through his girlfriend and his brother, he gained entry into a circle of fine artists in town. He enjoyed visiting with Harris, he said, and trading ideas about work: “Zach has this whole cosmology behind everything he does. ” Lately they’d been discussing tantalizing geometries, like Fibonacci spirals and Mandelbrot sets, and these conversations inspired Longstreth’s gift. Harris welcomed Longstreth into his studio with a hug. He wore a mustache and   white jeans. His work space, he explained, “used to be a grow house. I converted it three years ago, and we found all this weed still here. Some bullets too. ” A dozen or so paintings ringed the room, all very large. Many were covered and crisscrossed by carved pieces of wood that Harris had machined with a laser, then painted   colors. Between these lattices he’d inscribed legions of   tiny figures engaged in odd, feverish interactions. I spied a roaring lion near a cluster of winged archers and, in a cheekier register, a parody of the “March of Progress” illustration that riffed on Nike’s Jumpman logo. Longstreth inspected a painting up close, in which a woman and a devil were engaged in a contortive sex act. “Stories start suggesting themselves,” Harris said, “and I follow them. I’m really into making these little universes you can get lost in. ” The two seemed to regard each other as kindred spirits. “Dave and I talk a lot about structures that all art forms share,” Harris went on. Longstreth nodded. “I love thinking of one medium as analogous to another, even if they aren’t, quite,” he replied. “Working on this new album, I’d lose focus on a song after a while, but thinking of it as if it were a painting allowed me to come at it again, in a new light. ” Harris waved a hand over one of his canvases. “There’s a   thing here and an Egyptian thing here  —   in painting, you can take all these different visual languages and styles and put them together. There’s a sense of that in Dave’s songs, too. Traditions he’s bringing together and synthesizing. ” Longstreth appeared to blush at the sound of his friend describing his music with such care. “Maybe,” he said, shrugging. He lingered a bit more, paging through the Mandelbrot book. “He figured out the math and ratios that generate this stuff,” Longstreth said. “There are names for all of these. ” Before long, Longstreth said goodbye and made for his Prius, which he pointed toward his studio. It was nearly noon, and he had his own little universe to get lost in.'"}, "time": 1742562961.848842}