{"duration": 0.12107348442077637, "input_args": {"text": "'YANJIAO, China  —   Artists in need of cheap, affordable studio space are often drawn to     or hardscrabble neighborhoods. The visual artists who flocked to SoHo in Manhattan decades ago helped resurrect what had been a deteriorating factory and warehouse district. Young artists also helped revive parts of Brooklyn neighborhoods like Williamsburg and Bushwick, and a similar pattern has occurred in many other major cities, including Berlin, Paris and Detroit. In China, a small and decidedly nondescript city called Yanjiao, about an hour’s drive from Beijing, has been experiencing a similar influx of artists, though it is highly unlikely that they will initiate the kind of renaissance that has tourists flocking to Williamsburg and SoHo. That’s because the artists’ inexpensive studios in Yanjiao lack exposed brick walls or distressed wood beams. Instead, they tend to feature concrete walls and cheap metal fittings, and they are generally in large, uninspired apartment blocks. Yanjiao, with a population of about 300, 000, was once known mostly as a “sleeper city,” whose residents commuted to jobs in Beijing. During the day, its wide, dusty streets are nearly empty, flanked by apartment buildings waiting for tenants to return from work. The idealistic but impoverished artists here, many of them young graduates from Beijing’s elite art schools, work and live in these apartment blocks. Driven by high rents and the constant threat of demolition in Beijing, many artists who might previously have hunkered down in the city, China’s unofficial cultural capital, are flocking to Yanjiao as a   spot from which to chase their dreams. “The only reason for artists living in Yanjiao is that it’s cheap,” one of them, Zhang Yongji, 27, said with a laugh. Like many young artists, Mr. Zhang dreamed of making it big in Beijing. But after graduating from the prestigious Central Academy of Fine Arts there in 2012, he looked into renting a studio in the city and found he could not afford one. A friend of his was living in Yanjiao, and after visiting, he decided to move here. Eventually, he settled into an apartment complex called the South Side of Hawaii, one of the city’s many sprawling, colorfully named residential complexes designed in a faux European style. (Others include the North Side of Hawaii, Hawaii Valley and Sweet Seoul City.) In 2013, he and a group of friends founded On Space, an apartment turned experimental art gallery. In the last decade, urbanization and gentrification have accelerated in Beijing. “These forces are pushing artists to think of alternative models for running art spaces, including, yes, spaces in Yanjiao,” said Kira   a   and the director of China Residencies, a nonprofit arts organization. Many of China’s most famous contemporary artists emerged from   artist villages on the urban fringes of Beijing, where rent was low and distractions from making art were few. One of the best known of these enclaves is Caochangdi Village, which became an artists’ hub after Ai Weiwei built his studio there in 1999. However, as Beijing’s city limits have expanded, many smaller artist villages have been torn down to make way for new development. “Art is always pushed to the edge,” said He Miao, a curator of contemporary art in Beijing. “In China, contemporary art cannot be made in cities. Where the urban meets the rural, that’s where art happens. ” Yanjiao initially attracted attention from the artistic community in 2006, when the Central Academy of Fine Arts established a satellite campus not far from the South Side of Hawaii. Art supply, printing and framing shops quickly popped up to serve the students, teachers and artists who would be living and working nearby. The first artists found it lonely. “When I first got here, my building was completely empty, and there were no lights at night,” said Pange Yang, 26, who arrived in 2012. “I was the only person in the building. ” But as word of mouth about Yanjiao spread, more artists began coming. “I was preparing to really do the poor, starving artist thing in Songzhuang,” a   artist village about a   away, said Li Tianqi, 24, another founder of On Space. “But why rent a tiny shack in Songzhuang when you can have a nice studio in Yanjiao?” No one knows how many young artists now call Yanjiao home, though the On Space founders estimate that at least several hundred have space here. Last year, the gallerists tried an informal census of the city’s artists, but ran out of time after conducting interviews with about 60 people. Yanjiao has also caught the eye of established artists. Its most famous tenants are the Gao brothers, a pair of multimedia artists internationally known for their irreverent sculptures. In 2013, they bought a former factory building and turned it into an airy studio complex they call Blessgo, which they use for making larger works. Referring to the quickly gentrifying 798 Art District in Beijing, Gao Zhen, the older brother, said in an interview, “In 798, we still won’t be allowed to exhibit certain works of art, and you just can’t completely let go of your worries because even renting studios in 798 isn’t completely stable, with demolitions and relocations. ” The siblings still maintain a studio in the 798 district, but plan to eventually relocate entirely to Yanjiao. Most artists in Yanjiao work in more humble circumstances. Much of the city’s surplus of residential space takes the form of cheap, unfinished apartments called maopifang. Little more than concrete shells, they are perfect for artists looking to create studios on a shoestring. Because of the dominance of residential space in Yanjiao, its atmosphere differs markedly from the gritty industrial hipness of Caochangdi or the more touristic 798, where cafes, boutiques and galleries have sprung up alongside artists’ studios. In Yanjiao, virtually nothing comparable has appeared. But many of the Yanjiao artists have embraced its decidedly suburban aesthetic. Zhang Zhanzhan, a painter, has completely transformed his maopifang over the years, covering the concrete floors with whitewashed pine slats and the empty doorways with colored fabric. Pictures of his chic studio have been viewed by thousands of users on WeChat, a Chinese social media app. “I once went to drop off some paintings at a Beijing gallery, and the person there asked me if I was the artist with the ‘  studio,’” he recalled. Yanjiao’s days as an affordable outpost may be numbered. Rents have more than tripled since the first artists moved in, mainly because of property speculation, and the number of unfinished maopifangs has dwindled. Moreover, despite the city’s now solid reputation as an offshoot artistic community, Beijing’s   allure remains. While a fresh wave of graduates from the capital’s art academies move into Yanjiao each summer, many older artists have already left. Last year, On Space decided not to renew its lease, because most of its events are now held in collaboration with organizations in Beijing. Zhang Yongji is going back to the capital to pursue a master’s degree. “This is a very temporary place,” he said. “We’re all here still hoping to someday make it in Beijing. ”'"}, "time": 1742563235.394835}