{"duration": 0.07201910018920898, "input_args": {"text": "'For a generation of   adolescents, it was an indelible image: an egg, sizzling in a frying pan, representing “your brain on drugs. ” It was a straightforward message, and the ad’s final line  —   “Any questions?”  —   asked as the egg white clouded and cooked, was strictly rhetorical. Three decades later, the Partnership for   Kids (the group formerly known as the Partnership for a   America) is bringing the frying pan out of retirement and firing up the stove again. But this time questions are the point. The group hopes it can tap into the nostalgia parents may have for the old frying egg ad while also letting them know their children do indeed want answers about drugs. “‘Any questions’ was the end. Now it’s the beginning,” said Scott Seymour, chief creative officer at BFG Communications, which created print and digital banner ads for the new campaign. “The landscape of drugs has really gotten a lot more complex, so we took this idea of having a succession of questions delivered by kids,” he said. The group drew on real inquiries from parents to develop the questions featured in the ads, which cover topics like prescription drugs and marijuana legalization. Children today feel empowered and entitled to ask questions about drugs, and parents are more willing to entertain those questions, observers say. “Because of parenting styles today, parents are engaged with their kids in a different way,” said Kristi Rowe, chief marketing officer at the Partnership for   Kids. “They’re really stumped by the questions. They don’t know how to answer them. ” The new ads open with an egg frying in a pan, as in the original, but then build on that by showing children asking their questions. Parents are then pointed to the partnership’s website, which offers suggestions for how to answer questions like if and when prescription drugs are O. K. how marijuana can be “bad” if it’s also legal, and whether or not parents tried drugs when they were younger. (The partnership calls that one the toughest to address.) “There’s definitely been a shift in parents wanting to answer those questions thoughtfully,” said Jo Shoesmith, chief creative officer at Campbell Ewald, the agency that worked on the new TV spot. “Hence the execution where we start off asking those questions. ” The campaign includes print and digital advertising, as well as a television spot that begins this week, with a   by the actress Allison Janney (“The West Wing,” “Mom”). Ms. Rowe said all of the creative work, print space and airtime were donated. “It would have cost us well over $1 million, just from the production values alone,” she said. Getting networks to donate commercial time to air a public service announcement is a huge advantage for groups like the partnership, but the drawback is that networks have more latitude about when they choose to show the ads than they would with a paying customer. Working with an already familiar motif like the fried egg takes some of the pressure off the partnership because the ad does not have to waste time introducing the organization and its goals to the audience. “It’s one of the most famous P. S. A. campaigns of all time,” said Adam Duhachek, a professor of marketing at Indiana University, adding that nostalgia can be a very effective tool for marketers. “We see lots of examples of it being done, so I think it’s one of the tropes advertisers continually rely on,” he said. “I think they’re hoping that the success they had 30 years ago and this powerful visual metaphor will still resonate. ” Since this new campaign is aimed at parents rather than their children, the famous tag line has been tweaked a bit, from “your brain on drugs” to “a brain on drugs,” and the ads refer parents to the partnership’s website, a digital resource that didn’t exist at the time of the initial campaign. Despite these differences, the egg is what sticks. “Given that it was the 30th anniversary, we thought it was a perfect time to build off the imagery and equity of the fried egg spot,” Ms. Shoesmith said. “It was a perfect opportunity to reflect the new strategy and changing parenting styles. ” Allen Rosenshine, executive creative director for the partnership and chairman emeritus of ad agency BBDO Worldwide, echoed that thought. “The entire drug scene has changed so much that strategies we might have employed even 10 years ago aren’t relatable today,” he said. “If you go back to the original   spot, it was a rather    statement that drugs are dangerous. ” Bringing back the egg in the frying pan gives parents a familiar frame of reference even as it conveys to parents that today’s conversations about drugs need to be more nuanced, Ms. Shoesmith said. “We acknowledge where we were, and it’s this evolution to reflect the conversation parents are having with their kids now,” she said.'"}, "time": 1742562194.2853363}