{"duration": 0.1274416446685791, "input_args": {"text": "'Carolyn B. Maloney, a congresswoman from the Upper East Side, was riding in a taxi on Friday when she heard the news: Emails discovered in an investigation into Anthony D. Weiner’s sexting had revived the F. B. I. ’s interest in the case of Hillary Clinton’s private server. “I said: ‘Oh, no, not this, not happening now,’” she said. And then Ms. Maloney’s thoughts turned to Mr. Weiner. “I can’t stand him  —   even before this,” Ms. Maloney said. On the West Coast, John L. Burton, the chairman of the California Democratic Party, informed of Mr. Weiner’s inadvertent intrusion into the election on Friday evening, let loose an emphatic expletive. “We’re still talking about that guy during a presidential election?” Mr. Burton fumed, using a profane   word instead of “guy. ” Weiner  —   the name became almost a curse word among senior Democrats over the past two days, as the disgraced congressman unexpectedly surfaced in the final stretch of the presidential contest. The news resurrected memories of previous Weiner scandals. “He is like a recurring nightmare,” said the Rev. Al Sharpton. “It’s like one of those ‘Damien’ movies  —   it’s like every time you think he’s dead, he keeps coming again. ” The fury that many leading Democrats feel toward Mr. Weiner had been building for years. His sexting habits embarrassed them. His attempted political comeback in 2013 disgusted them. But their high regard for his   wife, Huma Abedin, always kept them from going public. On Friday that was over. Randi Weingarten, the president of the American Federation of Teachers and an influential Clinton supporter, said she had long held her tongue out of “enormous respect and love” for Ms. Abedin. But Ms. Weingarten said Mr. Weiner’s treatment of women demanded forceful censure. “I don’t care who it is, no one should be a sexual predator,” Ms. Weingarten said. “I think we all have to take a stand about that, and I think what’s happening now is that people are. ” Mr. Weiner, who lost his seat in Congress and his mayoral hopes after repeated episodes in which he sent lewd messages to women, is now under federal investigation for allegedly sending sexual messages to a    girl in North Carolina. In that inquiry, the F. B. I. this month seized a laptop that contained thousands of messages belonging to Ms. Abedin, a top aide to Mrs. Clinton. The F. B. I. director, James B. Comey, told Congress on Friday that investigators will now review those messages for possible relevance to the Clinton inquiry, news that rattled the Clinton campaign and stung her supporters. For some, the development touched off more worry than anger: former President Bill Clinton, who learned of the news en route to his last event of the day, in Pennsylvania, fretted that it would draw hostile attention to Ms. Abedin, according to a person familiar with his thinking. Around the country, former aides to Mr. Weiner, who spoke on the condition of anonymity, traded emails and texts throughout the weekend, fuming at the “collateral damage” inflicted by their onetime boss. Mr. Weiner did not respond to an email seeking comment. Mrs. Clinton’s campaign has largely ignored Mr. Weiner’s connection so far, and has instructed campaign surrogates to avoid discussing his role. But amid fears that Mr. Weiner’s behavior might undermine the party in a critical election, Democrats  —   especially in his native New York  —   said that perhaps they had given Mr. Weiner too many second chances over the years, and given him too much latitude out of deference to Ms. Abedin. Beyond New York, there was a sense of disbelief that one former lawmaker, whose memorable surname and lewd online habits made him a staple of   comedy, could disrupt the election of an American president. Vice President Joseph R. Biden Jr. in an interview with CNN, blurted out, “Oh, God,” at the mention of Mr. Weiner’s name. He added, “I’m not a big fan. ” But Mr. Weiner has been a figure of consternation in Democratic politics for years, in New York and nationally, regarded simultaneously as a sharp political mind and a man of striking immaturity and   ambition. With a gift for combat on cable television, Mr. Weiner repeatedly forced himself to the fore of Democratic politics, despite being seen by many in the party as too clever by half, too boastful about his intelligence  —   and too hungry for attention from reporters and women. A 2001 story in Vanity Fair captured Mr. Weiner, then unmarried, leering at congressional interns while presenting himself as an   salesman. When Mr. Weiner explored a campaign for mayor in 2009, aides to Michael R. Bloomberg, who was seeking a third term, highlighted media coverage of his support for legislation making it easier for foreign models to get approval for visas. “We had a sense of who he was,” said Bradley Tusk, who was campaign manager for Mr. Bloomberg. “He knew exactly who he was. ” Also before the same election, Senator Chuck Schumer, for whom Mr. Weiner once worked, privately expressed frustration that Mr. Weiner was insufficiently interested in substance, telling one aide: “It’s all political ricochet. ” The senator is said to have made his peace with Mr. Weiner’s problems long ago. But Mr. Schumer is in line to lead Senate Democrats next year, and any damage from Mr. Weiner’s latest scandal could impede the party’s quest for a majority. Still, he won the lasting appreciation of Mrs. Clinton during the 2008 election, defending her in   fashion during a difficult primary against Barack Obama. And Mr. Weiner’s marriage to Ms. Abedin, in 2010, seemed to install him permanently among party elites  —   whatever their reservations about his company. So tied into the party’s power brokers was he, by marriage, that when Mr. Weiner sought to resurrect his political career with a bid for mayor in 2013, numerous Democratic donors cut checks to his campaign at Ms. Abedin’s urging. John P. Coale, a wealthy lawyer supportive of Mrs. Clinton, said many donors gave money to Mr. Weiner out of friendship with Ms. Abedin. But Mr. Coale said the 2013 race, which brought new revelations of more sexting, had been exasperating. “It was just too much for everybody,” Mr. Coale said. “And now, it’s out of the park. Come on. ” Bill Hyers, a Democratic strategist who managed Mayor Bill de Blasio’s campaign that year, said the party establishment had erred by allowing Mr. Weiner “a second breath of life. ” “They knew he was a narcissist who was massively flawed,” Mr. Hyers said. “And now we’re all still stuck with him. ” Among Democrats who shunned Mr. Weiner from the start, there was little joy at the apparent vindication of their judgment. Sarah Kovner, a major Democratic donor, said there was less concern that   injuries might cost Mrs. Clinton the election, than sheer frustration that a known bad seed had created such endless tumult. “We basically never wanted to have anything to do with him,” Ms. Kovner said of herself and her husband, Victor Kovner. “  too wise for himself, too glib, too full of himself  —   that’s how we felt about him. ” While predicting Mr. Weiner’s latest scandal would not doom Mrs. Clinton’s presidential hopes, Ms. Kovner sighed: “It is more pain. ”'"}, "time": 1742564570.4630167}