{"duration": 0.08275365829467773, "input_args": {"text": "'The White House and Republicans in Congress remain hopeful about prospects for repealing Obamacare despite mounting moderate GOP opposition. [Both President Donald Trump and Vice President Mike Pence in television interviews on Sunday said they were confident they could win enough votes to repeal Obamacare.  In an interview on Sunday, Trump called the health care vote imminent. The president said, “I didn’t put a timeline” on it. He added, “Now we have a really good bill   …     I think they could have voted on Friday. ” Monday morning, White House economic adviser Gary Cohn said the administration thinks it possesses the votes to repeal Obamacare. Cohn told CBS, “This is going to be a great week. ” He continued, “We’re going to get healthcare down to the floor of the House. We’re convinced we got the votes and we’re going to keep moving on with our agenda. ” Axios reported on Monday that House Republicans told Democrats that they expect the Obamacare repeal vote to take place on Wednesday. Sources say that they wanted to announce the budget agreement last night to prepare for the vote on Wednesday. As of Tuesday, a vote has yet to be scheduled. House leadership’s American Health Care Act failed to muster enough votes earlier this spring when conservatives opposed the bill for leaving too much of Obamacare intact. Many conservatives labelled the bill “ ” and “Ryancare. ” A coalition between House Freedom Caucus chairman Mark Meadows ( ) and Tuesday Group   Tom MacArthur ( ) worked to strike a deal to allow states to repeal Obamacare regulations known as essential health benefits and community ratings. The essential health benefits rule prevents health insurers from pricing health care plans based on age, gender, or health status, while the essential health benefits provision requires that health plans cover services such as mental health, pregnancy, and hospital visits. However, states can only receive these waivers if they opt into the bill’s $100 billion   pool fund to subsidize coverage for older and less healthy patients. The   pools would lower costs for these individuals and lower premiums for everyone else. Congressional staffers told Breitbart News that the vote could take place this week, although nothing will move forward unless the bill secures enough votes to proceed. Meadows previously told Breitbart News that he fully expects an Obamacare bill to pass by the end of May. He said, “I fully expect that we will repeal most aspects of Obamacare by the end of May. It may have been a deterrent in the first 100 days, but by the end of the first 120 days or so it will be seen as a significant accomplishment. It’s not how you start, it’s how you finish, as the song used to say. We will have an excellent finish. ” Congressman Jordan echoed the sentiments of Congressman Meadows, saying that the House Republicans soon will strike a deal on health care. Jordan told Breitbart News: You know we haven’t passed health care yet, but I’m cautiously optimistic that we’ll get it done in the next week or two. Our chairman Mark Meadows has been working very hard over this break. So I think there’s a chance to get an amendment put in the bill that will result in premiums coming down for a lot of American families. I think that we can get it done in a way that is consistent with what we told voters we’re going to do. Earlier reports that there could be a Wednesday vote on Obamacare repeal appear to be premature. Increasing skepticism from Republican moderates could tank the bill’s chances of passing the House. House deputy whips David Valadao ( ) Elise Stefanik ( ) Kevin Yoder ( ) and Erik Paulsen ( ) have yet to decide on whether to support the bill. Congressman Billy Long ( ) a strong House leadership ally, said that he would not support the bill over concerns that the bill “strips away any guarantee that   conditions would be covered and affordable. ” Long said in an interview on Monday, “They got 40 Freedom Caucus votes,” asking, “Why do they need me?” Fred Upton, the former Energy and Commerce Committee chairman, said Tuesday he will not vote for the Obamacare repeal bill. He said, “I’ve supported the practice of not allowing   illnesses to be discriminated against from the very  . ” Upton told WHTC this morning. “This amendment torpedos that, and I told leadership I cannot support this bill with this provision in it. ” Upton could provide cover for   centrists to oppose the bill. Upton supported full repeal of Obamacare several times in Congress, and previously released a statement in 2013 titled, “Upton Supports Full Repeal of Obamacare as Rate Hikes Loom. ” The report stated: As the documents provided by the insurers indicate, the primary reason costs will increase is that the PPACA [i. e. Obamacare] requires insurers to provide increased services and benefits while, at the same time, it limits their ability to charge consumers based on age or health status. The minimum coverage requirements will increase premiums for those who had previously purchased less robust coverage, while ‘the infusion of less healthy individuals into the risk pool’ will compound premium increases. The report slams Obamacare’s community rating and essential health benefits provisions for raising the cost of health insurance. Upton claims he cannot support repealing those Obamacare regulations. Despite the hesitation from moderate Republicans, a senior GOP aide told reporters that they believe it would be easier to flip moderate Republicans over conservative Freedom Caucus members. Representative Mike Coffman ( ) seems to think that moderate Republicans might have overreacted about the the bill rescinding protections for patients with   conditions. He said, “There are many moderates who overreacted to the amendment, thinking that it does more than it actually does   …     So I think people are taking a second look at it. ” Various news sources report that  roughly 19 Republicans oppose the health care repeal bill in its current form. House Republicans can only afford to lose 22 votes or the bill will sink in the House. If the bill passes the House, it will most likely see changes in the Senate. Sens. Bob Portman ( ) and Shelley Moore Capito ( ) remain concerned about a provision in the American Health Care Act that freezes Medicaid expansion. Senator John Thune ( ) the third   Republican in the Senate, crafted a measure to better compensate older Americans for the high cost of health insurance. Congressman Mark Meadows ( ) told Breitbart News that he will work with Senate colleagues to push for a more conservative version. “I am having conversations with my colleagues in the Senate,” he explained, “where we can push for even more conservative solutions, because it was more difficult to push amendments procedurally in the House. ” Senators Rand Paul ( ) Mike Lee ( ) and Ted Cruz ( ) were the strongest opponents of the American Health Care Act. Senator Paul crafted his own conservative plan for repealing Obamacare and worked with the Freedom Caucus to push for an even more conservative Obamacare repeal bill. The Freedom Caucus endorsed Sen. Paul’s plan. Outside conservative groups such as the Club for Growth and FreedomWorks endorsed the MacArthur amendment to bolster conservative support for the bill. President Donald Trump tweeted that a new health care plan is on its way and the new plan will lower premiums while protecting those with   conditions. You can’t compare anything to ObamaCare because ObamaCare is dead. Dems want billions to go to Insurance Companies to bail out donors  …    . New,  —   Donald J. Trump (@realDonaldTrump) April 30, 2017,    …    healthcare plan is on its way. Will have much lower premiums  deductibles while at the same time taking care of   conditions!  —   Donald J. Trump (@realDonaldTrump) April 30, 2017, '"}, "time": 1742628427.9729073}