{"duration": 0.05036664009094238, "input_args": {"text": "'JERUSALEM  —   While Israelis here are celebrating the country’s Independence Day today, the United Nations Educational, Scientific and Cultural Organization (UNESCO) passed a resolution disavowing Israeli sovereignty over Jerusalem and ignoring Jewish ties to the religion’s holiest sites. [In no particular order, here are five outrages within the text of the nonbinding UNESCO resolution, which was submitted by Algeria, Egypt, Lebanon, Morocco, Oman, Qatar, and Sudan and passed in a   UNESCO vote:  1  —   The resolution designates Judaism’s second holiest site, the Tomb of the Patriarchs and Matriarchs, and Judaism’s third holiest site, Rachel’s Tomb, as “an integral part of the Occupied Palestinian Territory. ” 2  —   The resolution claims it is “safeguarding” the “cultural heritage of Palestine,” despite the fact that no such country exists. Palestine previously referred to territories that encompass present day Israel and Jordan. It was utilized in the 1917 Balfour Declaration to call for “the establishment in Palestine of a national home for the Jewish people. ”  In the case of the resolution, UNESCO clearly intended “Palestine” to connote a Palestinian state within Israel even though there is no such state. 3  —   The text refers to eastern sections of Jerusalem as an entity called “East Jerusalem” in a clear attempt to lobby for the division of Jerusalem. The full clause states: Affirming that nothing in the current decision, which aims, inter alia, at the safeguarding of the cultural heritage of Palestine and the distinctive character of East Jerusalem, shall in any way affect the relevant Security Council and United Nations resolutions and decisions on the legal status of Palestine and Jerusalem, including United Nations Security Council resolution 2334 (2016). In reality, Jerusalem is one city there is no city called East Jerusalem. The term is largely utilized to claim that Israel is occupying “East Jerusalem,” and that the city section should become part of a future Palestinian state.   Jews maintained a historic presence in Jerusalem, including in the eastern sections, until they were forced to leave the Old City en masse in 1948. Jordan illegally occupied and annexed the West Bank and eastern Jerusalem from 1948 until Israel captured the lands in a defensive war in 1967. The 1967 Six Day War was launched after Arab countries used the territories to stage attacks against the Jewish state.  In 1988, Jordan officially renounced its claims to the West Bank and eastern Jerusalem and unilaterally recognized terrorist Yasser Arafat’s Palestine Liberation Organization as “the sole legitimate representative of the Palestinian people. ” 4  —   The resolution refers to Israel as an “occupying power” in its own capital, Jerusalem. It claims all fundamental Israeli territorial actions in Jerusalem are “null and void. ” The text states:  Reminding that all legislative and administrative measures and actions taken by Israel, the occupying Power, which have altered or purport to alter the character and status of the Holy City of Jerusalem, and in particular the “basic law” on Jerusalem, are null and void and must be rescinded forthwith. In actuality, the Palestinians never had a state in either the West Bank or eastern Jerusalem and they are not legally recognized as the authorities in those areas for Israel to be occupying the land from.  The UNESCO resolution further ignores that the Temple Mount and Western Wall  —   the holiest sites in Judaism  —   are located in eastern Jerusalem, which is steeped in Jewish history. 5  —   The resolution forbids Israel to carry out “excavations, tunneling, works and projects in East Jerusalem, particularly in and around the Old City of Jerusalem. ” The sponsoring countries seem to fear that excavations in these areas routinely uncover archaeological evidence further tying Jews to Jerusalem. For example, discoveries at the City of David, an archeological site just outside the Temple Mount, have unearthed the core of ancient Jerusalem, including Hezekiah’s Tunnel, evidence of the Gihon Spring, Jewish Temple artifacts, Temple purifying pools and more. Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio. ” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.'"}, "time": 1742628346.0993187}