{"duration": 0.02327704429626465, "input_args": {"text": "'Last Sunday the public editor’s column addressed the fraught discussions around the use of the term “ . ” Using the column as a springboard, one reader took issue with another term used frequently in The Times’s pages. We asked the editor overseeing standards, Phil Corbett, whether The Times has had discussions around the term’s use. He said, “I’m aware that there’s debate over these terms, but we haven’t come up with any style rules as of yet. ” The public editor’s column also recently addressed how much an   story should disclose about its author. A piece in Sunday’s Times Magazine on a Palestinian refugee camp in East Jerusalem similarly raised readers’ eyebrows regarding a piece of information it did not include: the name of the organization partly financing the project. In the piece, Kushner notes, “I was invited on an extensive tour of the occupied West Bank, including East Jerusalem, and was asked to choose a subject to write about, for a book to be published next year. ” We asked the magazine’s editor, Jake Silverstein, to talk about the story’s provenance: The public editor’s take: I found Kushner’s magazine story to be an exceptional piece of reporting and writing, one that didn’t seem to be carrying anyone’s political agenda. That said, the wiser choice would have been to make clear the role of Breaking the Silence in the project. Disclosure ahead of time is better than questions afterward. Another reader also finds The Times’s performance coming up short  —   though her complaint is not about the news coverage. When the reader tried to pay for her Times subscription, the online payment system refused to accept her last name. The reader notified The Times’s customer service department, explaining, “My card is working and I think it goes without saying that my surname is too. ” But she got this reply: “Our Credit Card system has a minimum of three characters for the first and last name. ” The reader then came to us. Ng also noted that the problem has yet to be fixed, so we reached out to Eileen Murphy, the head of communications at The Times, for comment. “First, this customer should have been responded to in a timely fashion, and we apologize that didn’t happen,” Murphy said. “Clearly, this is a flaw in our system, one that we have prioritized fixing. ” Finally, there was the public editor appearance on Fox News’s Tucker Carlson show last Friday. The downpour of mail on this subject this past week fell into two camps. One group appreciated that someone from The New York Times went on Fox to address the subject of media bias. But another group was incensed that the public editor was even on the show, much less criticizing The Times. A firestorm erupted on Twitter, and some of the flames singed the public editor’s inbox, too. The public editor’s take: Let me start with the biggest question: Why did I go on? Simple. I wanted to get before an audience that doesn’t normally read The New York Times. A voyage outside the echo chamber. I gave my honest view of The Times’s sometimes leftward political tilt, expressed in various forms. And sometimes I pushed back, pressing my belief, for example, that the vast majority of journalists who walk into the Times building everyday have the highest journalistic standards. Twitter? It’s not a place for reporters to express their political opinions  —   though I wish I would have made clear that Carlson’s list of offenders was his, not mine. In response to the reader above, Twitter isn’t a venue where journalists should banter about their ideological beliefs  —   or clearly suggest them in judgmental terms. That’s not just my view  —   it’s the official newsroom policy, regularly sent around to reporters and editors to remind them.  In the alternative universe of email fans  —   those surprised and pleased that I spoke honestly to conservatives  —   I’m glad you listened and I’m glad some expressed an interest in giving The Times another look. I’m paid to be the house critic, but I will say to the reader who raised it, the work that’s produced here is most definitely a public service. Till next week.'"}, "time": 1742628447.941393}