{"duration": 0.14618706703186035, "input_args": {"text": "'ALTO TURIAÇU INDIAN TERRITORY, Brazil  —   Deep in the Amazon jungle, a squad of nerds is on the loose. One of its members spent more than a decade as an environmental activist for a   nonprofit. Another studied Arctic oceanography in Germany. Their commander is a former high school science teacher. But together they have forged one of Latin America’s most feared elite fighting units, on the front lines of Brazil’s struggle to curb the destruction of the Amazon. The team’s commander, Roberto Cabral, laughed when I asked him recently how his assemblage of Special Ops nerds came together. “In the universe of illegal activities in Amazonia, there’s deforestation, gold prospecting, bush meat hunting, clandestine logging and animal smuggling,” said Mr. Cabral, 48, who was shot in the shoulder in 2015 while pursuing gunmen who were razing tracts of forest. “We wanted to combat these dealings with brains as well as boots on the ground. ” I went on a grueling patrol in March with the   unit, which has the decidedly unglamorous name of Grupo Especializado de Fiscalização, or Specialized Inspection Group. The squad, better known by its Portuguese acronym, GEF (pronounced  ) operates in some of the most lawless swaths of the Amazon River basin  —   places so remote that it takes days to reach them by riverboat or truck from the nearest settlement. Facing such logistical obstacles, GEF, which operates as part of Ibama, Brazil’s environmental protection agency, usually patrols in helicopters, using satellite images and intelligence gathered through Ibama’s regional offices, to detect deforestation and signs of illegal mining. The unit, which Ibama created in 2014, needs all the help it can get. Deforestation is surging once again in the Brazilian Amazon, climbing 29 percent between August 2015 and July 2016. Nearly two million acres of forest were destroyed during the period, according to estimates by the National Institute for Space Research in Brazil. But even as GEF relies on   technology, its missions often resemble an elusively frustrating game of cat and mouse. On the first day that I accompanied an operation in Maranhão State on the fringes of the Amazon, members of the unit rose at 3 a. m. Clad in combat fatigues, body armor and bulletproof helmets, they strapped Taurus assault rifles around their shoulders and journeyed for hours in    pickup trucks along potholed roads from São Luís, the state capital, to Santa Inês, an outpost in the interior. Then they waited for the weather to improve. Heavy rain prevented the unit’s two Bell helicopters from taking off for patrols over Maranhão and the vast neighboring state of Pará. After hours of standing by, the choppers finally lifted off around midday, flying for monotonously long stretches over lands cleared for cattle ranching. “You have to see the Amazon from above to get a sense of how much of it has already been devastated,” said Maurício Brichta, 44, an oceanographer who specialized in studying Arctic algae at Germany’s Alfred Wegener Institute for Polar and Marine Research before joining Ibama. “As you can imagine,” he added with a grin, “there wasn’t much demand in Brazil for expertise in the Arctic regions. ” Like nearly everyone else in the unit  —   which includes forestry engineers, a wildlife biologist, a fisheries specialist, even someone who used to work in advertising  —   Mr. Brichta said he never expected to take up arms to protect the Amazon. Before this phase in his life, he was a    father in Jakarta and New York, cities where his   was stationed as a diplomat for Brazil’s Foreign Ministry. After returning to Brazil, Mr. Brichta said he was drawn to Ibama by the agency’s sense of idealism and the strides it had made in lowering deforestation rates from alarmingly high levels at the start of the previous decade. When GEF was created, he made the cut by completing a punishing survival course in which candidates endure jumping out of helicopters, protracted treks through the jungle, foraging for food, treating snakebites, going for long stretches without food and sleep, and training for gun battles and knife fights. “Obviously, this kind of work isn’t for everybody,” said Eduardo Rafael de Souza, 39, a bearded,   military veteran who often pilots the helicopters used for GEF’s missions. The unit’s members returned in a closelipped mood to Santa Inês after the first day on patrol with nothing to show for their efforts after flying for hours over remote logging roads in search of deforestation crews. Some wondered if there could be moles in Ibama’s ranks that could have tipped loggers off about their patrols. Like other parts of Brazil’s federal government, Ibama has grappled with its own graft scandals, sometimes involving inspectors effectively acting as double agents to protect the interests of ranchers or logging outfits. But environmental activists argue that a major reason for resurgent deforestation in Brazil involves efforts to reduce Ibama’s sway, drawing parallels with the Trump administration’s plans to overhaul the Environmental Protection Agency. Since 2013, Ibama’s budget was slashed by about 46 percent. Either way, GEF’s fortunes shifted on the second day of their patrol. Homing in on indigenous lands where logging crews make forays to illegally extract coveted hardwoods, the squad spotted from the air a makeshift sawmill near the boundary of the Alto Turiaçu Indian Territory, home to the Ka’apor people. “I saw their helicopter land in a clearing, like a scene out of some Hollywood movie,” said Francinaldo Martins Araújo, 43, who was arriving in his truck to buy scraps of discarded timber from the sawmill as the unit swooped down for its raid. Members of the squad, some hiding their faces behind balaclavas out of fear of retribution if their identities are made public, quickly went to work. They set the sawmill on fire and destroyed two domed furnaces used to make charcoal, before setting out again in the helicopters for their next target. A few minutes later, they hit pay dirt again when one of the pilots observed a truck on a logging road. The unit jumped out of the choppers in a nearby clearing, as one member punctured the truck’s fuel tank and set the vehicle on fire. Then the shouting came from the forest. While searching for the logging crew, two GEF members stumbled across a tractor used for hauling felled trees. A chain saw, still warm from being used minutes earlier, was left stuck in a tree, evidence of a hasty getaway. The unit set fire to the tractor and chain saw before resuming the search for the loggers. Nerves were on edge. It was on such an operation in a nearby jungle that Mr. Cabral, GEF’s commander, was taken by surprise by a fleeing logger and wounded by gunfire. No shots were fired this time, but the loggers managed to elude the squad, fleeing into the forest. A pilot radioed the coordinates of the exfiltration point and the unit started the long trek back to the choppers in humidity so thick it felt as if they could slice through it with their hunting knives. Drenched in sweat as they boarded the helicopters, the squad could see the smoke billowing from the destroyed vehicles, a small victory in the battle against deforestation. “I never dreamed that I would hold a rifle in my hands to defend the Amazon,” said one    GEF member, a former environmental activist who declined to disclose his name because of security fears. “But this is war, and war can open your eyes to what needs to be done. ”'"}, "time": 1742563589.7692502}