{"duration": 0.07250356674194336, "input_args": {"text": "'As more members of the media discover that San Francisco 49ers   quarterback Colin Kaepernick’s free agency is going ignored by the NFL, many are pegging his failure an example of “racism. ”[Kaepernick became the subject of both praise and condemnation last season with his   protests, by refusing to stand for the playing of the national anthem at the start of each game. After the season, the quarterback declared his free agency but with the announcement also announced an abrupt end to his refusal to stand for the anthem. But, with the league’s free agents signing to teams at a quickening pace, Kaepernick has thus far gone unsigned.  Only last week, Bleacher Report’s Mike Freeman took a look at Kaepernick’s inability to find a new team and noted that many executives don’t want his type of disruption in their locker rooms. Over the weekend, a Fox News article revealed that “70 percent of NFL managers genuinely hate” Colin Kaepernick. Many reasons have been listed. Some analysts criticize Kaepernick’s throwing accuracy, others think he isn’t much of a team player because he is a moody loner, and still others say he seems out of his depth when asked to learn new plays and plans. Rumors circled early in the season that Kaepernick only began his protests to raise his profile as a race activist to head off being traded by the 49ers. This rumor charged that Kaepernick meant use his activism as a weapon against the team, so that in case they tried to trade him he could claim racism. And in that vein, it appears that some in the media fell right into line with that tactic. TV One host and former CNN personality Roland Martin is a case in point. Martin made just that very charge in a March 17 tweet. If not a single @NFL team signs @Kaepernick7, it shows their hatred of a Black man taking a social stand. These execs are pathetic.  —   rolandsmartin (@rolandsmartin) March 17, 2017,  By not signing @Kaepernick7, these @NFL teams are sending a signal to their players: Don’t you dare use your voice. We own you!  —   rolandsmartin (@rolandsmartin) March 17, 2017,  The fired CNNer isn’t alone. Activist filmmaker Spike Lee also called the NFL’s refusal to hire Kaepernick an example of “racism. ” Just Had Brunch With My Brother Colin @Kaepernick7 . How Is It That There Are 32 NFL Teams And Kap Is Still A Free Agent? WTF. Smells MAD Fishy To Me, Stinks To The High Heavens. The New York     Need A Quarterback. Who Is The     Quarterback? Is My Man Joe Willie Namath Coming Back? Crazy Times We Live In. The Question Remains What Owner And GM Is Going To Step Up And Sign Colin So Their Team Has A Better Chance To WIN? What Crime Has Colin Committed? Look At The QB’s Of All 32 Teams. This Is Some Straight Up Shenanigans, Subterfuge, Skullduggery And BS.  ?  . By Any Means Necessary. And Dat’s Da NoFunLeague Truth, Ruth. A post shared by Spike Lee (@officialspikelee) on Mar 19, 2017 at 2:10pm PDT,  The claim that Kaepernick is being punished because he is black or outspoken has been taken up by many in an effort to use him for their own activist purposes. . @ShannonSharpe: The NFL owners are sending a message. By punishing Colin Kaepernick, they are deterring others from taking such acts. pic. twitter.   —   UNDISPUTED (@undisputed) March 20, 2017,  . @MichaelSam52 came out  he’s out of NFL. @brendon310  @ChrisWarcraft support gay rights  are gone. @Kaepernick7 took knee  is unsigned.  —   Hari Kondabolu (@harikondabolu) March 11, 2017,  @TheEconomist tell that to the conservatives who crucified colin kaepernick —  for having the temerity to kneel.  —   Gordon Ballingrud (@gdb50001) March 10, 2017,  The NFL proved how racist it is with its lack of support for #ColinKaepernick. To be honest it will be hard for  …     https:  .   —   Jackie Rae (@JRaethefanatic) March 20, 2017,  Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742564576.9543936}