{"duration": 0.07936882972717285, "input_args": {"text": "'Home › POLITICS › CLASSIFIED MALFEASANCE: CLINTON & AIDES JEOPARDIZED NATIONAL SECURITY CLASSIFIED MALFEASANCE: CLINTON & AIDES JEOPARDIZED NATIONAL SECURITY 0 SHARES \\n[11/3/16] The WikiLeaks e-mail releases are not the only revelations Hillary Clinton and the Clinton Campaign team are cursing these days. Official State Department documents released pursuant to Freedom of Information Act (FOIA) requests and lawsuits are also delivering severe body blows to Team Clinton’s White House aspirations. \\nOn Wednesday, Judicial Watch, the government accountability watchdog group, released nearly 70 pages of Department of State (DOS) records confirming that, while secretary of state, Hillary Clinton and her top aides, Deputy Chiefs of Staff Huma Abedin and Jake Sullivan, received and sent classified information on their non-state.gov e-mail accounts. Former Secretary Clinton has repeatedly denied — in interviews, debates, testimony, and speeches — that she divulged any classified material, even though the e-mail evidence and FBI Director James Comey’s testimony contradict that claim. At other times she has fudged, waffled, and evaded questions on this subject, bringing to mind the infamous weasel quote of her husband, then-President Bill Clinton, “It depends on what the meaning of ‘is’ is.” \\nThe new Judicial Watch e-mails are completely separate from the WikiLeaks e-mails, which the Clinton campaign and its allies have tried to discredit by claiming, without foundation, that they are the product of a Russian intelligence operation. The Judicial Watch documents were obtained recently in response to a court order from a May 5, 2015 lawsuit filed against the DOS after it refused to cooperate with a Freedom of Information Act (FOIA) request. That request was seeking: “All emails of official State Department business received or sent by former Deputy Chief of Staff Huma Abedin from January 1, 2009 through February 1, 2013 using a non-‘state.gov’ email address.” \\nThe newly released documents, which are now also available on the State Department website, were obtained after the U.S. District Court for the District of Columbia ruled in favor of the watchdog group in January ( Judicial Watch, Inc. v. U.S. Department of State ). \\nThere are thus no grounds for questioning the provenance or authenticity of these recent Clinton e-mail revelations, since they come directly — albeit very reluctantly — from the State Department. Among the new documents are e-mails showing that Hillary Clinton used the clintonemail.com system to ask Huma Abedin (also on a non-state.gov e-mail account) to print two March 2011 e-mails that were sent from former British Prime Minister Tony Blair (using the moniker “aclb”) to Jake Sullivan on Sullivan’s non-state.gov e-mail account. \\nThe Obama State Department has redacted the Blair e-mails under the FOIA Exemption (b)(1) rule which allows the withholding of classified material. The material is marked as being classified as “Foreign government information” and “foreign relations or foreign activities of the US, including confidential sources.” The irony is beyond rich, is it not? Secretary Clinton says she didn’t send any classified material by private, unsecured e-mail — while the State Department refuses to release certain of her private e-mails, claiming exemption because, says DOS, the e-mails contain classified information. Reasonable observers might be inclined to take that as an official confirmation that Hillary Rodham Clinton has lied and weaseled — repeatedly, and under oath — on this important national security matter. Is there any other reasonable way to view it? \\nIn another private e-mail, Clinton asks Huma Abedin how appointments in Washington, including a four-hour meeting concerning the Obama/Clinton war on Libya, would affect her vacation schedule in the Hamptons, the fabulous playground of the ultra-rich. As an aside, the Clintons have been longtime seasonal residents of the Hamptons, where many of their Wall Street and Hollywood billionaire cronies (and donors) own eye-popping mansions on sumptuous estates. Hillary, who regularly tries to make political hay by verbally attacking the rich “one percent,” apparently suffers no qualms of conscience about taking millions of dollars in speaking fees from the most notorious of the one percenters at Goldman Sachs, JPMorgan Chase, Citibank, Blackstone, etc. Nor do she and Bill flinch at spending $50,000 per week for a beachfront mansion in the Hamptons near their movie mogul pal (and campaign contributor) Harvey Weinstein. Their populist rhetoric and faux working-class appeals notwithstanding, the Clintons are happiest and most comfortable consorting with the top one percent of the top one percent. But back to the e-mails. Responding to a message that details the sensitive Libya meetings in Washington, D.C., Clinton e-mails Abedin on August 26, 2011: “Ok. What time would I get back to Hamptons?” As with tens of thousands of Clinton DOS e-mails, this discussion relative to classified meetings, plans, and official policies, took place on private, unsecure e-mail accounts. Post navigation'"}, "time": 1742563554.9038024}