{"duration": 0.12392711639404297, "input_args": {"text": "'Media Matters for America, the George   progressive activist organization, has been secretly planning a major campaign to “stop” Breitbart News. [The scheme was documented in a Media Matters briefing book obtained by the Washington Free Beacon at a retreat for current and prospective donors held in Florida over the weekend.  The   pamphlet listed a core budget goal for 2017 of $13. 4 million, which the booklet says would pay for a staff of 81, ostensibly to wage war on independent news media outlets like Breitbart.  The briefing book focused heavily on Breitbart News, which was repeatedly singled out as a target. In one section of the pamphlet, in which Media Matters bills itself as “the top watchdog against fake news and propaganda,” the progressive media activist group falsely claims that Breitbart News “provides a nexus point for the     (the newest branding for American white nationalism,   and misogyny) to exploit vulnerabilities throughout the media landscape. ” “With a powerful ally in the White House (former chief executive Steve Bannon will be Trump’s chief strategist) Breitbart plans to export its brand of   racism on a global scale. ” Media Matters, founded by Hillary Clinton ally David Brock, did not provide a single example to back up its numerous smears against Breitbart News. “In a   media environment, the right is aggressively exploiting vulnerabilities and finding new ways to poison the information ecosystem with lies,” Media Matters claimed of Breitbart News and “Trump TV,” the conservative media outlet run by the Right Side Broadcasting Network. “Media Matters is ready to stop them. ” Another section of the pamphlet, titled, “Media Advocacy  —   Punish enabling and complacency,” singles out Breitbart News after boasting that “Media Matters will be vigilant in holding news media accountable for even the slightest bit of normalization of Trump. ” The pamphlet claims that Media Matters “first sounded the alarm about Breitbart’s international expansion and began working with journalists in the United States and abroad to educate them on Breitbart’s model as well as the larger universe of   activity for which Breitbart is the nexus. ” Breitbart’s international expansion included the launch last year of Breitbart Jerusalem, headed by this reporter, which daily shines the light of accurate reportage on one of the most unfairly reported arenas in the international market and is known to be one of the most   news media outlets in America. To combat Breitbart News and other outlets, Media Matters mapped out a strategy that includes engagement with social media giants like Facebook, as the Free Beacon first reported. The pamphlet states: After Facebook responded to our campaign by acknowledging the problem of fake news and agreeing to do something about it, we began a dialogue. It became clear from these conversations that Facebook needed our help in fully understanding the problem and identifying concrete solutions. Further, it also became clear that we had information and insight that they didn’t have that was helpful in educating them on the full scope of the problem. Later, the pamphlet reveals (emphasis added): Our campaign was covered by prominent national political, business, and tech media outlets, and we’ve been engaging with Facebook leadership behind the scenes to share our expertise and offer input on developing meaningful solutions. The Free Beacon attempted to get a comment from Facebook: A Facebook spokesperson declined to comment on its interactions with Media Matters, but a source familiar with the company’s thinking stressed that it routinely speaks with groups from across the political spectrum. Separately, Brock recently announced that he intends to turn his   news website, Shareblue, into a “Breitbart of the left. ” A different pamphlet, also obtained by the Free Beacon and distributed at last weekend’s donors retreat, presents a grand strategy for Shareblue, declaring, “We must become the antidote to Breitbart. ”  The pamphlet reveals a 2017 budget of $2 million, which “covers 18 total staff, including six   content producers. ” The booklet says of Shareblue’s plans: To compete with Breitbart and the   media infrastructure that will do Trump’s bidding, Shareblue must scale up from a Facebook native news site to a diversified media company, operating across platforms with varied and   content offerings and products. Shareblue plans to continuously monitor the following outcomes to ensure Brock’s outlet is “on track,” the pamphlet states (emphasis was in original pamphlet): Shareblue becomes the   news outlet for grassroots Trump opponents. Facebook engagement with our content doubles each year. Shareblue. com traffic also doubles each year. Twitter following increases 25% per year. Shareblue becomes the de facto news outlet for opposition leaders. Democratic offices, campaigns, and progressive organizations will routinely pitch us stories, funnel us information, and share our content, and we’ll measure ally engagement. Shareblue content will be used in paid political ads on television and digital mediums. Trump allies are forced to step down or change course due to news we push. Intel and oppo given to us exclusively will become higher quality, with higher potential for impact, as our credibility and footprint grows. Under pressure from Shareblue, Democrats take more aggressive positions against Trump. Democrats will echo the aggressive, emotive messaging Shareblue models and take action accordingly. Media Matters, meanwhile, is not publicly listed as a partner of Facebook in its quest to fight   fake news. Facebook last month explained it will work with “    organizations” that are signatories to the code of principles crafted by the International   Network (IFCN) which is a project of the Poynter Institute. Facebook says that if the “fact checking organizations” determine that a certain story is fake, it will get flagged as disputed and, according to the Facebook announcement, “there will be a link to the corresponding article explaining why. Stories that have been disputed may also appear lower in News Feed. ” A cursory search of the Poynter Institute website finds that Poynter’s IFCN is openly funded by Soros’ Open Society Foundations as well as the Bill  Melinda Gates Foundation, Google, and the National Endowment for Democracy. Soros has also financed Media Matters, including by providing a $1 million donation in 2010 “to hold Fox News accountable for the false and misleading information they so often broadcast. ” Media Matters is known for its controversial tactics against outlets like Fox News, Breitbart and talk radio. Earlier this week, Media Matters Senior Fellow Matthew Gertz asked for help in maintaining a “comprehensive database of who gets to ask questions at” Trump press briefings. Brock once described Media Matters as aiming to wage an   campaign of “guerrilla warfare and sabotage” against Fox News. An extensive Daily Caller investigation in 2012 reported that internal Media Matters memos revealed a comprehensive enemies list. The Daily Caller reported: An internal Media Matters For America memo obtained by The Daily Caller reveals that the   media watchdog group employs an “opposition research team” to target its political enemies. Included in the list of targets are   websites, conservative think tanks, prominent financiers and donors, and more than a dozen specific Fox News Channel and News Corporation employees. “We will conduct extensive public records searches and compile opposition books on individuals,” declares the memo, likely written in late 2009. Investigations, it says, “will focus on the backgrounds, connections, operations and political and financial activities of the individuals. ” Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio. ” Follow him on Twitter @AaronKleinShow. Follow him on Facebook. With additional research by Joshua Klein.'"}, "time": 1742563233.4705105}