{"duration": 0.07920408248901367, "input_args": {"text": "'  have long been among the country’s most fervent Christians, from the choir to the pulpit to the affirming voices from every “amen corner. ” Their deep faith saw them through the trials of slavery and then a century of Jim Crow repression. Finally, it emboldened them to leave the sanctuary of their churches and join the Rev. Martin Luther King Jr. in a quest, his “dream,” for their full freedom and equality. Just when and how their ancestors broke with traditional African spirit practices and adopted Christianity has never been fully resolved. Now archaeologists in Maryland have announced the discovery of an intact set of objects that they interpret as religious symbols  —   traditional ones from Africa, mixed with what they believe to be a biblical image: a representation of Ezekiel’s Wheel. No one had found this combination of religious artifacts before, said Mark P. Leone, a University of Maryland archaeologist who led the discovery team. “Christianity had not erased traditional African spirit practices,” he concluded. ”It had merged with them to form a potent blend that still thrives today. ” Two of Dr. Leone’s graduate students, Benjamin A. Skolnik and Elizabeth Pruitt, made the discovery and excavated the artifacts, which were just below the surface where a tenant farmer’s house once stood on land of a former plantation near Easton, Md. That was four years ago. Dr. Leone and others familiar with the religious history of   then sought to interpret what they had found. In the late 18th century, Methodist Episcopal and later African Methodist Episcopal (A. M. E.) preachers carried the Christian message to the plantations on Maryland’s Eastern Shore. They seemed to have been successful converting slaves, in part by giving new meaning to traditional symbols. For example, a powerful symbol from the BaKongo belief system in West Central Africa, where many of the slaves came from, was the cosmogram, a circle with an X inside.   repurposed these materials because they had symbolic value as well in the form of Ezekiel’s blazing chariot wheel, Dr. Pruitt said. The wheel imagery is described in the Book of Ezekiel 10: : “And when I looked, behold the four wheels by the cherubim, one wheel by one cherub, and another wheel by another cherub and the appearance of the wheels was as the color of aberyl stone. And as for their appearances, the four had one likeness, as if a wheel had been in the midst of a wheel. ” The   image in the Book of Ezekiel and the cosmogram, Dr. Pruitt suggested, “represented the universe, and the path we travel through this world and the afterlife” and “it stands for the enduring connections between this world and the next, the power from above and below. ” For the first time, the two circle images had been found together virtually side by side. It seems that the Christian preachers had discovered the powerful resonance the wheel image held for  . One of the most popular spirituals among people in A. M. E. churches and camp meetings on the Eastern Shore is “’Zekiel Saw the Wheel. ” ‘Zekiel saw de wheel, way up in the middle of the air‘Zekiel saw de wheel, way up in the middle of the airDe big wheel run by faith, little wheel by the grace of GodWheel in a wheel, way in de middle of de air.’ An A. M. E. bishop in the 19th century, Daniel Payne, wrote that the circle and wheel imagery extended the “Ring Shout,” in which participants move counterclockwise singing and dancing at camp meetings. This motion is in the same direction as the cycle of life in the cosmogram. It was said that “sinners won’t get converted unless there is a ring here, a ring there, a ring over yonder, or sinners will not get converted. ” The artifacts gathered by Dr. Leone’s team are on display at a new exhibition at the University of Maryland’s Hornbake Library. The display, “Frederick Douglass  Wye House: Archaeology and African American Culture in Maryland” runs through July 2017, Monday through Saturday, 9 a. m. to 5 p. m.'"}, "time": 1742562596.9044056}