{"duration": 0.14435315132141113, "input_args": {"text": "'BLACK OPS ADVERTISINGNative Ads, Content Marketing, and the Covert World of the Digital Sell By Mara Einstein248 pp. OR Books. Paper, $18. I don’t often watch late night television, which may be why I was caught unawares. Jimmy Fallon’s opening monologue began hilariously enough, when abruptly he pivoted to a series of inexplicably weak jokes centered on a forthcoming football game. It slowly dawned on me that I was watching a commercial for NBC’s “Sunday Night Football,” albeit one baked right into the opening monologue and delivered by Fallon himself. The realization that something you thought to be “real” is actually an advertisement is an increasingly common, if unsettling, sensation. Mara Einstein calls it “content confusion,” and if her book, “Black Ops Advertising,” is right, we’re in for even more such trickery, indeed a possible future where nearly everything becomes hidden commercial propaganda of one form or another. She forecasts the potential of a “world where there is no real content: Everything we experience is some form of sales pitch. ” Einstein, a former advertising executive turned media professor (who, among other things, worked campaigns for Uncle Ben’s and Miller Lite) makes it clear that things were not always this way. Once upon a time the line between editorial and advertising, if not exactly a Chinese wall, was somewhat clearer. Einstein’s   and accomplished book is mainly about the effort to tear down that wall. The sledgehammers and pick axes in this case are things like “sponsored content,” “native advertising” and “content marketing” designed to fool you into thinking they are real. Such stealth advertising may entertain or inform, yet it also brands, or more cleverly, facilitates a later branding exercise or sales pitch. The handoff can be smooth enough that you don’t notice you’ve been steered to exit through the gift shop. “Black Ops” presents some startling examples of stealth advertising. Remember that guy who in 2012 jumped out of a helium balloon at 128, 000 feet for a new world record? Covered widely in the media, it was all, according to Einstein, a disguised Red Bull marketing campaign, but one where Red Bull’s role was so discreet as to be almost invisible. You may also recall the audacious “tagging” of Air Force One by a graffiti artist named Marc Ecko, which has been viewed nearly a million times on YouTube. It was a hoax intended for the branding of a clothing and accessories label. That “ad” fooled so many members of the public and press that it was awarded the top prize for digital media at the annual Cannes Lions advertising festival. The book is slightly guilty of exaggerating the novelty of   advertising techniques. Content that doubles as brand advertising is not exactly new. In the 1980s, “The Transformers” and “G. I. Joe” were popular children’s cartoons but also advertisements, and so of course was the much beloved “Mickey Mouse Club” back in the 1960s. The idea of inventing media stories for commercial purpose also has a long pedigree, dating to at least the late 1920s, when Lucky Strike staged a protest (the “torches of liberty”) featuring attractive women demanding the right to smoke outdoors as a part of suffragist liberation (yielding, ultimately, an equal right to lung cancer). Subliminal advertising, perhaps the blackest of all black ops, was popular in the 1950s, until it was banned. The difference, Einstein argues, lies in how much effort is going toward the dark arts. It is, she suggests, for one simple reason: that we, the public, are so good at avoiding or ignoring traditional advertising. We are fickle fish, cynical creatures who have already been hooked so many times that the simpler lures no longer work. We avoid ads using devices as simple as the remote control (originally conceived as an   technology) and as sophisticated as   phones (thanks, Apple). Many of us have developed a mental blindness that helps us see through advertising as if it were not there. Indeed, ad avoidance has become a lifestyle, so much so that some people will simply declare, “I don’t watch advertising” the same way one might declare adherence to a   diet. Einstein’s book wanders from its main topic into a fuller review of contemporary advertising practice, including   on social media, mass harvesting of private data and other unappealing practices. Perhaps the most important contribution she makes is providing a clear sense of what free content actually costs. There was a time when the idealists among us prophesied that the 21st century would be a golden age of free stuff, powered by a culture of sharing, and that targeted advertising would be a blessing for consumers. Today that vision has soured and even seems like a bad joke given how plagued we are by the rise of stealth advertising, the invasions of privacy, the proliferation of clickbait and stalking advertising, and the general degradation of much of the web. Einstein is not enthusiastic about contemporary advertising practice, and few of us are likely to regard constant deception as attractive. But what’s the remedy? One, briefly mentioned by Einstein, is legal. The Federal Trade Commission regards advertising posing as legitimate content to be an illegal form of “consumer deception. ” Einstein calls for more enforcement, but admits that it’s not easy. What does one do, for example, about the many movies (like “The Transformers”) and reality shows (“Keeping Up With the Kardashians”) that are simultaneously entertainment and advertisement? Einstein is not the first former marketing executive to turn on her profession James Rorty, in 1934, wrote of his colleagues: “They are dead men. Their bones are Bakelite. Their blood is water, their flesh is pallid  —   yes, prick them and they do not bleed. ” But unlike Rorty, who wanted to destroy advertising, she would prefer to save it: She is nostalgic for the recent past, when audiences sitting through commercials made deception unnecessary. But if that’s the remedy, it is a lost cause: No one who figures out how to avoid advertising willingly goes back. Einstein too quickly discards the most important remedy for advertising’s abuses: paying for content. A broader historical view can remind us that   media competes with paid media (like HBO, film, books). Those who don’t want to live in a world constantly trying to trick us into watching ads may have the most impact by voting with their dollars and starving the beast of the attention it needs to survive. Paying for things (Facebook, if it let you pay, Einstein tells us, might be $12 a year) strikes at the heart of the business model, and indeed a partial revolt is already underway, as suggested by the popularity of   subscription services like Netflix. It is a reminder that   supported entertainment is hardly indelible or eternal, but a relatively recent invention whose future is insecure. From this perspective, the rise of black ops advertising may be less a sign of power than of desperation.'"}, "time": 1742562439.7645738}