{"duration": 0.11848926544189453, "input_args": {"text": "'Before he became president, Donald J. Trump called climate change a hoax, questioned the safety of vaccines and mocked renewable energy as a plaything of “ . ” So perhaps it is no surprise that Mr. Trump’s first budget took direct aim at basic scientific and medical research. Still, the extent of the cuts in the proposed budget unveiled early Thursday shocked scientists, researchers and program administrators. The reductions include $5. 8 billion, or 18 percent, from the National Institutes of Health, which fund thousands of researchers working on cancer and other diseases, and $900 million, or a little less than 20 percent, from the Department of Energy’s Office of Science, which funds the national laboratories, considered among the crown jewels of basic research in the world. The White House is also proposing to eliminate climate science programs throughout the federal government, including at the Environmental Protection Agency. “As to climate change, I think the president was fairly straightforward: We’re not spending money on that anymore,” Mick Mulvaney, the director of the Office of Management and Budget, said at a White House briefing on Thursday. “We consider that to be a waste of your money to go out and do that. ” While the budget is only a blueprint and is sure to face strong opposition from members of both parties in Congress  —   many lawmakers have already said that certain cuts, like those to the N. I. H. are nonstarters  —   policy makers expressed concern about what the proposal says about the administration’s commitment to science. “Do they not think that there are advances to be made, improvements to be made, in the human condition?” said Rush D. Holt, a physicist and the chief executive of the American Association for the Advancement of Science. “The record of scientific research is so good, for so many years  —   who would want to sell it short? What are they thinking?” The American Society of Clinical Oncology, the leading professional society for cancer specialists, issued a statement warning that the proposed budget “will devastate our nation’s already fragile federal research infrastructure. ” “Now is not the time to slow progress in finding new treatments and cures for patients with cancer,” the group said. Others said the proposed cuts would motivate more scientists to become politically active. Referring to the budget released early Thursday, Dr. Caroline Weinberg, a public health researcher and one of the organizers of a protest march by scientists set for April 22 in Washington, said, “It is a   document detailing exactly why thousands of people around the world will join together to march for science. ” Some cuts were singled out for criticism. The proposed budget would eliminate the Fogarty International Center, an N. I. H. program focused on global health. The center, founded in the 1960s, has worked on H. I. V.  Ebola, diabetes, dengue, maternal mortality and numerous other health problems, and trains American and foreign doctors and researchers in developing countries. “The Fogarty Center advances United States national interests in a multitude of ways, and it would be terribly unfortunate for the institution to cease to exist,” said J. Stephen Morrison, senior vice president of the Center for Strategic and International Studies and a member of the Fogarty Center’s advisory board. “It has a high reputation outside our borders,” Dr. Morrison said of the center, which has had annual appropriations of about $70 million. “It’s a very tiny institution,” he added, in terms of the overall budget. Judith Enck, a regional E. P. A. official in the Obama administration and now a visiting scholar at Pace University School of Law, called the proposed science cuts in her former agency “nonsensical. ” Noting that one of the programs being cut monitors chemicals known as endocrine disrupters, she said, “Not having the latest science on endocrine disrupters will make more people sick. And that is not something the states will pick up. ” The administration proposal spares some programs. It would continue development of the National Oceanic and Atmospheric Administration’s current generation of weather satellites, for example. NASA’s budget would be cut only slightly, by less than 1 percent, but the White House is proposing a shift in where the money would be spent  —   eliminating four earth science missions and the $115 million the agency is spending on education. Eliminating laboratory research on climate change, as the budget proposes, can have   effects, experts said, by making it harder to predict storms or other weather events that cause devastation and loss of life. “Cutting scientific research in E. P. A. and NASA and NOAA and other science agencies is not going to help us have more information on the causes and, more important, the effects of climate change,” said Vicki Arroyo, the executive director of the Georgetown Climate Center and a former E. P. A. official. The budget also calls for eliminating some programs that help bridge the divide between basic research and commercialization. Among the most prominent of these is the Advanced Research Projects Agency  —   Energy, known as   the Energy Department office that funds research in innovative energy technologies with a goal of getting products to market. Its annual appropriation of about $300 million would be eliminated. James J. Greenberger, the executive director of NAATBatt International, a trade group for the advanced battery industry, said   had been of enormous benefit to the industry. “We’re absolutely stunned by it,” Mr. Greenberger said of the agency’s potential elimination, which he announced to industry leaders gathered at his group’s annual conference in Arizona. “I don’t know what’s going through the administration’s head. It’s almost surreal. ”'"}, "time": 1742564151.9746962}