{"duration": 0.033154964447021484, "input_args": {"text": "'Ivana Says Young Donald Trump Was A Cry-Baby – Has Anything Changed? (VIDEO) By Carrie MacDonald on October 27, 2016 Subscribe \\nIvana Trump, the first wife of Republican presidential nominee Donald Trump, confirmed what many of us have been thinking for a long time now: Trump is a childish buffoon. Her story of a young Donald Trump on the ski slopes is telling of the temperament we see in the nominee now. Ivana Trump: ‘He Could Not Take It’ \\nTrump biographer Michael D’Antonio spoke with Ivana Trump about her marriage to The Donald, and she remembered a time he took her skiing. This was early on, before they married, and one would think Donald would want to show his best side, right? \\nNo. \\nYou see, Ivana neglected to tell the young Donald Trump that she was a very accomplished skier. According to Ivana Trump, Donald skied down the slope first, and then: “… He goes and stops, and he says, ‘Come on, baby. Come on, baby.’ I went up. I went two flips up in the air, two flips in front of him. I disappeared. Donald was so angry, he took off his skis, his ski boots, and walked up to the restaurant. He could not take it. He could not take it.” \\nShe said he stormed off, saying: “I’m not going to do this for anybody, including Ivana.” \\nWe all know by now that Donald Trump is a man who doesn’t like to lose. Ever. He is a man easily baited, easily goaded, and he has the temper of a petulant child. His outbursts have sparked the hashtag #trumpertantrum . \\nDemocratic presidential nominee Hillary Clinton was correct when she said, in her speech at the Democratic National Convention: “A man you can bait with a tweet is not a man we can trust with nuclear weapons.” \\nNor is a man who storms off in a huff when bested by his girlfriend on the ski slopes. Donald Trump: ‘I Loved To Fight’ \\nD’Antonio also said that Donald told him how he loved a good fight. “I loved to fight. I always loved to fight. All types of fights. Any kind of fight, I loved it, including physical.” \\nThere’s a word for people who act like that: Bully. \\nOf course, Trump has put his childish, bullying ways on display for the world during this election cycle. Ivana just happened to be one of his earlier victims. \\nWatch their appearance on Oprah in 1988, when Trump said she does what he tells her to do: \\nFeatured image via screenshot from YouTube video About Carrie MacDonald \\nCarrie is a progressive mom and wife living in the upper Midwest. Connect'"}, "time": 1742628321.1906314}