{"duration": 0.060417890548706055, "input_args": {"text": "'Posted on October 30, 2016 by Edmondo Burr in Weird // 0 Comments The discovery of an ancient coin in an Egyptian house which depicts an alien- like creature is proof that UFOs and aliens have visited earth during its history, according to UFO researchers. \\nResearchers have found numerous coins in the past that depict ‘flying objects’, but a discovery like the one posted below seems to offer more concrete proof that we have indeed been visiting by aliens – tens of thousands of years ago. \\nA newly found coin – which by the way has all the right ingredients for being called out as a fake — has woken interest among skeptics and UFOlogists who are debating about its origin and authenticity. related content World Leader Set To Confirm Aliens Visit Earth By End of 2016 \\nAccording to thesun.co.uk , “during a house renovation in Egypt, someone came across a mysterious coin that seems to show the head of an extra-terrestrial being, with huge hollow eyes, a bald head and thin cheeks.” \\nMysterious Earth writes that: “A group of people who worked on the renovation of a house in southern Egypt found a number of very rare coins.” \\nWhile any have rushed forward suggesting this is by far the best evidence of alien visitations, we need to hold on for a minute here and look at other possibilities. \\nWhile the coin is sensational to say the least, it doesn’t necessarily mean its authentic, but for that matter neither fake. The truth is that with all findings of a similar controversy, people rush to make conclusions without considering all possibilities. \\nThe truth is that detailed information about the coin ‘depicting an alien-like creature’ is extremely limited. The only information we have is that it was discovered among ‘other ancient coins’ during a house renovation in Egypt. Nearly all of these coins have an inscription in Latin, which obviously mean they did not originate in Egypt, but most likely somewhere else. \\nThe coin with the mystery creature on its side has “ OPPORTUNUS Adest ” carved on the back, Latin for “ its here in due time. ” \\nWhether or not the newly found coin depicting an alien-like creature is real or not remains a profound mystery. The most likely conclusion is that the coin is a modern forgery since NO EXPERTS have actually verified the item, analyzed it or seen it. All the information comes from different websites which can’t agree on what’s what. related content'"}, "time": 1742561973.3576374}