{"duration": 0.15507149696350098, "input_args": {"text": "'IQUITOS, Peru  —   Venezuela took its strongest step yet toward   rule under the leftist President Nicolás Maduro as his loyalists on the Supreme Court seized power from the National Assembly in a ruling late Wednesday night. The ruling effectively dissolved the elected legislature, which is led by Mr. Maduro’s opponents, and allows the court to write laws itself, experts said. The move caps a year in which the last vestiges of Venezuela’s democracy have been torn down, critics and regional leaders say, leaving what many now describe as not just an authoritarian regime, but an outright dictatorship. “What we have warned of has finally come to pass,” said Luis Almagro, the head of the Organization of American States, a regional diplomacy group that includes Venezuela and is investigating the country for violating the bloc’s Democratic Charter. Mr. Almagro called the move a “  coup,” a term used in Latin America to denote takeovers typical of the 1990s in Guatemala and Peru  —   but virtually   in the region today. Recent months have seen a swift consolidation of power by Mr. Maduro as scores of political prisoners have been detained without trial, protesters violently repressed and local elections postponed. In taking power from the National Assembly, the ruling removed what most consider to be the only remaining counterbalance to the president’s growing power in the country. The court said that lawmakers were “in a situation of contempt,” and that while that lasted, the justices themselves would step in to “ensure that parliamentary powers were exercised directly by this chamber, or by the body that the chamber chooses. ” It did not say whether it might hand power back. Members of the National Assembly denounced the ruling on Thursday. “They have kidnapped the Constitution, they have kidnapped our rights, they have kidnapped our liberty,” said Julio Borges, the opposition lawmaker who heads the body, holding a crumpled copy of the ruling before reporters on Thursday. Oneida Guaipe, an opposition lawmaker from the country’s central coast, said the body would continue to do its work, even if its laws would now be ignored when it produced legislation. “This is demonstrating before the world the authoritarianism here,” she said. “The people chose us through a popular vote. ” The ruling was also a challenge to Venezuela’s neighbors, which met in Washington this week to put pressure on the country to hold elections, and to discuss a possible expulsion of Venezuela from the O. A. S. on the grounds that the country is not democratic. Last week, the United States, Canada and a dozen of Latin America’s largest nations called for Mr. Maduro to recognize the National Assembly’s powers, a rare joint statement that reflected deep impatience with his government. “We consider it a serious setback for democracy in Venezuela,” the United States State Department said on Thursday of the court decision. Peru withdrew its ambassador in protest. David Smilde, an analyst from the Washington Office on Latin America, a human rights advocacy group, said it might now be up to Venezuela’s neighbors to encourage the country to hold elections again, given resistance from within the government. “The Maduro government seems to have no intention of respecting the basic elements of electoral democracy,” he said. Critics say a long litany of other moves by the government are taking a toll on Venezuela’s democracy. Perhaps most visible to Venezuelans was an effort last year to hold a recall referendum against the president, whose popularity is sinking along with the country’s collapsing economy. While such a referendum was permitted by the country’s Constitution, and highly favored in polls, Mr. Maduro alternatively called the effort illegal or a coup staged by his opponents. In October, a lower court suspended the process on the grounds that there had been irregularities in the gathering of signatures. Meanwhile, political prisoners continued to be arrested. In January, Mr. Maduro established a new “  commando” to round up political dissidents accused of treason. The group has taken aim at members of the opposition, arresting many, including a city councilman from central Venezuela and a deputy lawmaker in the National Assembly. In February, after CNN en Español, the network’s Spanish language channel, broadcast an investigation that linked Venezuela’s vice president to a passport fraud scheme in the Middle East, Mr. Maduro ordered the channel off the air. The government has blocked the Caracas bureau chief of The New York Times from entering the country since October. But to many, the gradual assault against the National Assembly, more than a year in the making, was the most telling sign of democratic erosion in Venezuela. “It has come in fragments,” Carlos Ayala Corao, a Venezuelan lawyer and legal analyst, said of the court’s actions against the legislature. “They have been slicing it in pieces. ” The conflicts began in December 2015, when rising grievances about the country’s faltering economy propelled Mr. Maduro’s opposition to win control of the legislature. It was the first time in years that the chamber was not dominated by the movement founded by the former leftist President Hugo Chávez. Mr. Maduro initially said he accepted the vote. He even appeared before opposition lawmakers to give his annual address on the state of the government in January of last year. But the Supreme Court, packed with loyalists to Mr. Maduro shortly before the National Assembly took power, was chipping away at the chamber’s powers. It refused to let it seat four lawmakers on the grounds that there had been voting irregularities. That denied the opposition of a supermajority, which would have given it expanded powers over Mr. Maduro. The National Assembly went back and forth on the ruling, but eventually complied. As the National Assembly began to get to work, it continued to clash with the court. By last spring, the legislature had written laws delivering on campaign promises like one measure to invigorate the economy and another to free more than 100 political prisoners, only to see the court overturn them as unconstitutional. When Mr. Maduro tried to increase his own powers under a state of emergency that he declared, the legislature rejected the effort. But the court sided with the president. In October, the court stripped the National Assembly of its power to review the annual budget, leaving Mr. Maduro in charge of the country’s purse strings. More recently, legislators tried to block the president from pursuing oil ventures without their approval. In Wednesday’s ruling stripping the National Assembly of its lawmaking powers, the court said the president had the right to make these oil deals. It said its ruling was justified by the Assembly’s choice to keep the lawmakers onboard whose elections had been questioned earlier. This act, it said, rendered the Assembly itself invalid. With few protesters in the streets of Caracas on Thursday, it was unclear what popular support the opposition might get from the public. Analysts say many Venezuelans feel as dispirited by the opposition as by leftist leaders, given the opposition’s continued defeat by the government. Opposition leaders called for protests on Saturday and in the coming week but have been unable to draw large crowds since last fall. John Magdaleno, a political consultant, said he expected a wider crackdown against the opposition from Mr. Maduro in coming weeks, and possibly more arrests. “In my opinion, from now on, there will be growing pressures against lawmakers,” he said, “and it’s probable there will be much greater persecution of political leaders. ”'"}, "time": 1742561633.0325992}