{"duration": 0.1129605770111084, "input_args": {"text": "'Share on Twitter \\nYouTube sensation Eugenia Cooney is being slammed by many of her near 900,000 fans for “negatively influencing” followers with her frail frame. \\nIn fact, a Change.org petition was recently created to temporarily ban Cooney from YouTube due to her thinness “triggering her fan base.” \\nThe petition has garnered over 9,000 signatures and explains that it wasn\\'t created to insult her, rather, people are hoping she takes a break from YouTube to get the help she needs. \\nIt reads , in part: \\n\"Eugenia Cooney has a serious medical condition and needs to seek help. She has been influencing her viewers by her serious underweight condition. She has not been getting better since the day she started YouTube, she\\'s getting more and more sick each day. And it\\'s honestly like she does this bodily harm to herself and shows young girls, such as her viewers on social media that it is \\'okay\\', to be suffering from a medical condition such as Anorexia-Nervosa. It is physically & medically to be that skinny without denying treatment such as she does. She has not got any treatment. And is triggering her fan base. \\nShe may not be intentionally influencing her viewers, but showing more than 50% of her body in her videos and pictures are not helping girls with Anorexia or any eating disorder.\" A photo posted by Eugenia Cooney (@eugeniacooney) on Sep 23, 2016 at 6:24pm PDT \\nWhat\\'s more heartbreaking is the fact nearly all comments on her YouTube videos and social media pages are negative. \\nHere are just a few of the jabs made at Cooney on her most recent video, uploaded October 26th: \\n“I just realized she can\\'t make her thighs touch no matter how hard she tries.” \\n“She\\'s so skinny her butt cheeks don\\'t even touch each other.” \\n“No...just, no. I\\'m sorry but I can\\'t look at you anymore. You need help! You\\'re actually scaring me!” \\n“Wow! That\\'s the most realistic skeleton costume ever!” \\nCooney responded to the negative comments last week in a video title, “I\\'m Sorry.” She explained that she\\'s used to getting a lot of hate on the Internet, but lately, it seems like she\\'s upsetting a lot of people: \\n“It really sucks, a lot, to feel like a lot of the Internet really hates you.” A photo posted by Eugenia Cooney (@eugeniacooney) on Oct 18, 2016 at 9:28am PDT \\nCooney added in the description box the following statement: \\n\"I just wanted to make this because I\\'m really sorry to everyone who is angry or upset with me and I\\'m really not trying to do anything wrong! I\\'ve never tried to influence anyone badly and I never encourage people to try to look like me or to look like anyone so that\\'s why I\\'m making this video since some people are saying that about me which can be really upsetting. \\nI love you guys and everyone who does support me and who is nice on here, you guys mean so much to me! I just wish people would be less hateful and be more positive and everyone who is positive you guys are so great. Thank you to the people who care about me though, I definitely am fine and am not dead or anything like that! Haha I love you guys!\" \\nAccording to the Change.org petition , her fan base consists of primarily 12- to 21-year-olds, who allegedly “thrive” on photos of her thin body. A photo posted by Eugenia Cooney (@eugeniacooney) on Aug 24, 2016 at 12:33pm PDT \\nErin Hillard, program manager of the University of Notre Dame’s Body Image and Eating Disorder Lab, told Yahoo Beauty that even if she\\'s not intentionally “promoting” her lifestyle, her audience is likely seeking to emulate her look: \\n“We know that media images have the power to influence girls’ eating behaviors and feelings about their body, and it does seem as though YouTube is more and more becoming another form of media that pushes products and lifestyles on young girls. I think it’s reasonable to be concerned that viewing her channel could have a negative impact on girls who may already be struggling with body image issues. The life of a YouTube celebrity is often presented as very glamorous and fabulous, and young girls may look up to that and think that Eugenia’s appearance is something they should be striving for to achieve her level of success.” A photo posted by Eugenia Cooney (@eugeniacooney) on Oct 25, 2016 at 4:02pm PDT \\nResearchers at the National Institute of Mental Health found eating disorders frequently occur during teenage years, with women 2.5 times more likely to suffer from eating disorders than their male counterparts. '"}, "time": 1742563382.053901}