{"duration": 0.04192495346069336, "input_args": {"text": "'Hostages Trapped Inside Walmart Insisting They Never Shop At Walmart A gunman at a Dearborn, MI Walmart is holding dozens of shoppers who say they only happened to be at the tacky megachain by coincidence. Nation Puts 2016 Election Into Perspective By Reminding Itself Some Species Of Sea Turtles Get Eaten By Birds Just Seconds After They Hatch WASHINGTON—Saying they felt anxious and overwhelmed just days before heading to the polls to decide a historically fraught presidential race, Americans throughout the country reportedly took a moment Thursday to put the 2016 election into perspective by reminding themselves that some species of sea turtles are eaten by birds just seconds after they hatch. Report: Election Day Most Americans’ Only Time In 2016 Being In Same Room With Person Supporting Other Candidate WASHINGTON—According to a report released Thursday by the Pew Research Center, Election Day 2016 will, for the majority of Americans, mark the only time this year they will occupy the same room as a person who supports a different presidential candidate. New Heavy-Duty Voting Machine Allows Americans To Take Out Frustration On It Before Casting Ballot WASHINGTON—Saying the circumstances of this year’s presidential race made the upgrade necessary, election commissions throughout the country were reportedly working to install new heavy-duty voting machines this week that will allow Americans to physically take out their frustrations on the devices before casting their votes. Clinton Staff Readies EMP Launch To Disable All Nation’s Electronic Devices NEW YORK—In an effort to prepare for any new revelations that might emerge about her emails during her tenure as secretary of state, Democratic presidential nominee Hillary Clinton reportedly told her staff Tuesday to ready the launch of several electromagnetic pulses to disable all of the nation’s electronic devices. New Report Finds Voters Have No Idea How Outraged They Supposed To Be About Anything Anymore WASHINGTON—Saying that at this point, they were just taking their best guesses at how they should react to each new scandal that emerged about the presidential nominees, voters across the country admitted Monday they had no clue how outraged they are supposed to be about anything anymore. Anthony Weiner Sends Apology Sext To Entire Clinton Campaign BROOKLYN, NY—In response to the FBI’s announcement that its investigation of him had produced new evidence that could pertain to its probe of the Democratic presidential nominee, Anthony Weiner reportedly sent an apology sext early Monday morning to the entire Hillary Clinton campaign. Nation Too Terrified To Look At What Trump’s Recent Rise In Polls Attributed To WASHINGTON—Claiming it felt queasy just thinking about what the cause could be, the nation’s populace said Monday it was too terrified to look at what Republican presidential nominee Donald Trump’s recent rise in the polls was attributed to. Anthropologists Discover Isolated Tribe Of Joyful Americans Living In Remote Village Untouched By 2016 Election WALDPORT, OR—A team of anthropologists announced Friday it had discovered an isolated tribe of blissful Americans who have never been exposed to the current presidential campaign or its candidates, noting that the newly identified population lives contentedly in a remote village completely untouched by the 2016 race. '"}, "time": 1742563080.8493814}