{"duration": 0.1797327995300293, "input_args": {"text": "'Email \\nVoters in at least four states decided to nullify unconstitutional federal statutes and United Nations drug-control treaties by officially ending marijuana prohibition, a major victory for the U.S. Constitution and the 10th Amendment. Three states — California, Massachusetts, and Nevada — completely legalized marijuana, even for recreational use by adults. By press time, it appeared that Maine\\'s initiative to do the same was on its way to being successful. In Arizona, where conservative nullification efforts on other issues have been popular, voters narrowly decided to keep pot prohibition in place. Still, regardless of one’s views on cannabis, states’ rights scored a string of impressive successes this week. \\nIn Florida, voters overwhelmingly amended the state Constitution to end prohibition of medical marijuana for patients suffering from certain ailments. Recreational pot possession remains illegal. Joining Florida were Arkansas and North Dakota, two reliably conservative states where voters also decided to nullify federal and UN schemes by ending the criminalization of the controversial plant when used under doctors’ orders. Montana voters decided to further liberalize that state’s medical marijuana laws. Over half of American states have now in practice nullified unconstitutional federal cannabis policy, which generally prohibits the plant even for medicinal purposes. \\nIn the successful referenda on cannabis this week, the states’ decisions to buck the U.S. government and the UN all rely — whether knowingly or not — on a proper constitutional tool known as “nullification.” Essentially, nullification is a time-tested legal strategy to check unconstitutional federal statutes and policies at the state level. It was promoted by some of America’s most prominent Founders, such as Thomas Jefferson and James Madison, two of the men responsible for the nation’s founding documents. \\nThe idea behind nullification is simple: Under the U.S. Constitution, the federal government was delegated a few defined powers by the states. Prohibiting substances was not among those powers, hence the need for a constitutional amendment to ban alcohol. Ratifying UN treaties, whether on drugs or anything else, does not grant new powers to the federal government, as even the Supreme Court has made clear. As such, states have an obligation to interpose on behalf of their citizens by rejecting unconstitutional power grabs. In the past, numerous states have relied on similar strategies, including Wisconsin, which refused to return run-away slaves under the Fugitive Slave Act. \\nUnder the 10th Amendment to the U.S. Constitution, state governments and the people explicitly reserved all powers not specifically granted to the feds under the U.S. Constitution. Because drug policy is not constitutionally a federal power, states and the people retained all power in this field — unconstitutional federal statutes, regulations, and UN treaties notwithstanding. A constitutional amendment would be needed to legally change that. Regardless of one’s own feelings about marijuana, then, conservatives and constitutionalists concerned about federal lawlessness in other areas — everything from healthcare and environmental policy to gun control and abortion — should take a lesson. \\n\"The lesson here is pretty straight forward,\" said Michael Boldin, executive director of the non-profit Tenth Amendment Center. \"When enough people say, ‘No!’ to the federal government, and enough states pass laws backing those people up, there’s not much the feds can do to shove their so-called laws, regulations or mandates down our throats.\" The TAC, which advocates for state nullification of unconstitutional acts, said the feds would be unable to enforce the drug war without state help, essentially nullifying the UN-inspired federal ban . \\nCalifornia was, of course, the biggest prize for anti-prohibition forces. After becoming the first state to nullify federal and UN policies purporting to criminalize the plant for medicinal purposes some two decades ago, the most populous state in the union now joins Alaska, Colorado, Oregon, Washington State, and the District of Columbia in totally ending pot prohibition — even for recreation. With 56 percent support, the Golden State’s Proposition 64 ending prohibition of marijuana possession and cultivation for those over 21, also known as Adult Use of Marijuana Act, cruised to an easy victory. A tax of 15 percent and a range of regulations were also part of the measure. \\nSome experts expect the trend to continue spreading. But not everybody is happy about it. While the federal government is constitutionally prohibited from interfering in state’s marijuana policies, the UN has been fuming about the anti-prohibition nullification wave for years . “I don’t see how [ending marijuana prohibition] can be compatible with existing [UN drug] conventions,” former Soviet diplomat Yury Fedotov, who serves as executive director of the UN Office on Drugs and Crime (UNODC), complained in 2014 after years of demanding that the U.S. government violate the Constitution to crack down on the phenomenon. “Of course, such laws fall out of line with the demands of these conventions.” \\nFedotov said the UN “Commission on Narcotic Drugs,” another globalist bureaucracy, shared his views. Speaking to reporters, the UN drug czar and former operative for the brutal communist regime ruling the Soviet Union, said it appeared to be part of a growing trend that the UN was monitoring. Asked whether there was anything the agency he runs could do about it, however, Fedotov promised merely to “raise the problem” with Obama’s State Department and other UN outfits next week. But even top Obama law-enforcement officials have publicly acknowledged that there is little to nothing they can do , and have “requested” a “flexible” interpretation of the crumbling UN regime . The Constitution is the reason why Obama has been powerless to stop the nullification. \\nAmong those at the forefront of the movement to stop prohibition is Law Enforcement Against Prohibition , a non-profit group of police, judges, prosecutors, and others who oppose prohibition for a number of reasons. In a phone interview with The New American , LEAP Executive Director Major Neill Franklin, a retired 34-year law-enforcement veteran, pointed to the U.S. Constitution and the Bill of Rights as among the key reasons why Americans from across the political spectrum should be celebrating the successful ballot initiatives to end marijuana prohibition from California to Massachusetts. \\n“The Constitution and the Bill of Rights call for small, limited, less expensive government,” he said, expressing concerns that there may be federal efforts to push back against the trend in the years ahead amid a potential renewed focus on “law-and-order” policies. “The rights of the states to set their own policy — that’s one of the foundational principles of this country. I’m really hoping that we continue moving toward this return of powers to the states. This is about the 10th Amendment and the states´ rights to implement these reforms.” \\n“We should be seeing this from the conservative perspective, to hold on to these constitutional principles, and the 10th Amendment,” he added, before wondering how many conservatives and average Americans in general today truly understand the U.S. Constitution, the Bill of Rights, and what they mean. “If people understood this, we would support reducing the size and cost of government, doing everything possible to support the 10th Amendment, and all the amendments that are in the Constitution. We need to also ensure that our Fourth Amendment principles are upheld by our law-enforcement community.” \\nExpressing concerns about the militarization of law enforcement in recent decades — much of it fueled by the federal government and justified under the drug war — Maj. Franklin argued that a nationwide constitutional education campaign was needed. “All of our rights need to be afforded to everyone in our country,” he explained. “We need some education, and quick. We need a concerted effort to spread the principles of the Constitution and the Bill of Rights, and to undo any policy that upholds the federal war on drugs. These things need to be dealt with at state level.” \\nHaving served on the front-lines of the war, first as a major in the Maryland State Police commanding as many as nine drug task-forces covering half the state, and later as a lieutenant colonel in the Baltimore Police Department, Major Franklin said he had seen the problems first-hand. “I’ve seen the carnage, the damage, the violence, the number of people we’ve put in prison,” he said. “Our criminal justice system for the last few decades has been a huge drain on our resources, not just at the federal level, but for our states as well. The war on drugs has been a huge driver of this.” \\n“Now the individual states are trying to roll back these types of policies that have strained our resources and harmed our communities,” continued Franklin, calling the policies counter-productive and expressing hope that the trends would continue to unfold across the country. “It would be extremely unpopular for the federal government to try to turn back the clock, if you look at the polls. But the constitutional principles at stake here are, again, foundational to America. We must not lose sight of that.” \\nFranklin also praised a group of law-enforcement and military personnel across America who have re-affirmed their oaths to defend the U.S. Constitution and Bill of Rights of America. While noting that not everyone agrees with everything when it comes to the Oath Keepers, the longtime police official said it was important that this was a group of lawmen and servicemen who really understand and stand by the U.S. Constitution they swore an oath to uphold. \\n“This goes for everybody, as a country: If we don’t have a concrete foundation to work from and stick to, despite how you feel about it — and in our country that’s the Constitution and the Bill of Rights — then anything goes,” Franklin cautioned. “And if there´s any group that needs to understand this 100 percent, and abide by it 100 percent, it is our law-enforcement officials, because of the power and the influence they have. That’s how I feel from over three decades in law enforcement, that is extremely important to me.... We have to ensure — the people and politicians do — that the laws we place in front of our law enforcement folks are based upon, and do not contradict, these foundational principles.” \\nEven some proponents of prohibition appear to have largely accepted the legitimacy or at least the inevitability of the growing nullification tsunami. Rather than try — and almost certainly fail — to get the feds to defy the U.S. Constitution in a bid to prod states into re-prohibiting the plant, anti-marijuana campaigners have vowed to fight pot use at the state and local level using a variety of methods. One group, Smart Approaches to Marijuana, has launched the “Marijuana Accountability Project” (MAP) that aims to “keep state officials and the industry accountable.” It will also seek to help municipalities rein in the marijuana businesses. \\nMAP officials, who have been fighting the growing wave of legalization, made clear that the fight was not over. “I’d be lying if I said election night/morning wasn’t tough,” said SAM President Kevin Sabet, a former White House drug advisor who said his side was drastically outspent by anti-prohibition forces. “But unlike with prior year losses, I am feeling (strangely, maybe) optimistic. We won in Arizona. We have a friendly governor in Vermont, which was the next target for the legalizers, and we won in a large handful of cities and counties in Oregon. And we know that no matter what happens in Maine, we will be in a very strong place to shape and restrict any policy that goes forward.” \\nOf course, there are plenty of critics of marijuana, many of whom cite studies showing that the drug can cause or at least contribute to memory problems, mental health issues, driving risks, and other concerns. Certainly, some constitutionalists were concerned that an end to prohibition might lead to increased marijuana use, though the evidence supporting this proposition is mixed . The sudden surge in the use of nullification to rein in the feds’ unconstitutional war on marijuana, then, was met with mixed feelings by some constitutionalists, who feel that states should continue to prohibit the plant even if the federal-UN war that underpins prohibition is illegal. \\nStill, the federal government has self-evidently grown far outside the bounds of the Constitution in virtually every policy area. The horrifying consequences of this lawlessness are becoming obvious for all to see — $20 trillion in debt, growing attacks on constitutionally protected rights, an out-of-control regulatory regime, and more. The dangers of tolerating continued anti-constitutional policies from Washington, D.C., and the UN are enormous, and represent a threat to even the most fundamental liberties. \\nAs liberals and Democrat Party-controlled states increasingly rely on state nullification to protect self-government and their own states’ rights under the Constitution’s 10th Amendment, it is past time for conservatives, constitutionalists, Republicans, libertarians, and others to do the same. Whether one approves of marijuana or not is beside the point — the real issue is whether America will have lawful, limited, constitutional government, or lawless, unlimited, globalized tyranny . \\nAlex Newman is a correspondent for The New American , covering economics, education, politics, and more. Follow him on Twitter @ALEXNEWMAN_JOU. He can be reached at: This email address is being protected from spambots. You need JavaScript enabled to view it. \\nRelated articles:'"}, "time": 1742562069.0039396}