{"duration": 0.033442020416259766, "input_args": {"text": "'Email Print Sean Hannity said on his radio show Friday that he doesn’t believe reports from ‘The New York Times’ that the FBI’s latest investigation into the Clinton Foundation is related to Huma Abedin and Anthony Weiner. Instead, Hannity suspects that the FBI is protecting itself because they know that WikiLeaks is about to drop proof that Hillary Clinton should have been indicted in July. \\nSEAN HANNITY: If you believe The New York Times, they have a new story that just broke. “New emails in Clinton case came from Anthony Weiner’s electronic devices. Federal law enforcement officials said Friday that new emails uncovered in closed investigation into Hillary Clinton’s use of a private email server discovered after the FBI seized electronic devices belonging to Huma Abedin, and aide to Mrs. Clinton, and her husband Anthony Weiner. The FBI told Congress that uncovered new emails.” \\nLet me tell you how. I am going to say something that I know is true. This story is total bull. I don’t believe this for a minute. “Hannity, it’s The New York Times.” I have no doubt the New York Times got on-the-record leaks that this is related to Anthony Weiner and Huma Abedin’s emails. I have no doubt — maybe Huma didn’t take a sledgehammer to her devices the way Hillary Clinton did. But this is not what resulted in the reopening of this case. No way, shape, manner, or form. They know Julian Assange — there’s too much in WikiLeaks that is coming, that has tipped them off that they’re dead. That they’re about to be exposed. And that is, more than anything else, this is about preservation now. \\nBecause James Comey, and and now we get back to… this this sky Andrew McCabe who was the FBI deputy director supervising the investigation of Clinton not long after Terry McAuliffe through a PAC gave $675,000 dollars to Jo McCabe, the wife of the chief the FBI deputy Director looking into the investigation into Clinton for a long shot bid, and that $675,000 came from Hillary, who went out there and raise money for the Super PACs that McAuliffe coudl give it to her. \\nThe wife of the guy doing the key investigation here. Now if that doesn’t impress you, I don’t know what does.. \\nNow let’s go back to Trey Gowdy grilling James Comey. What did he say? \\nSecretary Clinton said she never sent or received classified information over a private email server, is that true? “Comey: Our investigation found there was classified information sent.” \\nStop right there. Comey is admitting a crime is committed. That raises the question why did Comey then make a determination on his own not to send this to or grand jury or special prosecutor or anybody else? In other words, the statute requires, she doesn’t even have to be negligent. I’m sorry the statute requires negligence or gross negligence, yet Hillary was knowingly, purposefully, and WikiLeaks proves this, in her decisions and actions setting up a server under her control. \\nHere’s the question Comey has to ask: Why did you give all these people immunity?Why did you destroy evidence in the case as part of a proffered deal, why in under any circumstances do you close this case down when the evidence was overwhelming and incontrovertible and had sent numerous other people to jail for a far lesser offenses? That’s called a two-tiered Justice system, that’s a problem… \\nHillary knowingly and purposely hurt decisions and actions set up a server under her exclusive control and possession in order to control (violate the law) in ordered to control information that was available to the American public and Congress regarding actions as Secretary of State. \\nFurthermore, she took those government-owned communications into our own personal possession after leaving her position, knowingly and willingly attempted to destroy them, by the way that’s obstruction of justice, violation of the law, penalty of which a minor offenses you never get a government position for the rest of your life. And was so nefarious in her actions, could never be known used as evidence… \\nThis gets more curious day by day. Now there were reports out today that FBI agents were reportedly close to revolting over the treatment of Clinton, they’re so disgusted, and every FBI special agent I know … nobody has a good answer because they don’t understand why organizes pretty deep \\nNew emails tied to discovered– I don’t believe the New York Times, and I think the the FBI did this because they know what is coming. That’s my take. Stay connected by subscribing to our news letter. Click on the button. '"}, "time": 1742628348.4647868}