{"duration": 1.652259111404419, "input_args": {"text": "'\\nThe FBI won’t overturn its decision to not charge Hillary Clinton over her illegal activities involving classified emails, according to FBI Director James Comey.\\nRep. Jason Chaffetz (R-Utah) broke the news on Twitter:\\nFBI Dir just informed us “Based on our review, we have not changed our conclusions that we expressed in July with respect to Sec Clinton”\\nWe, here at the EU Times have reported back on 30 October 2016 that we believe the 2nd investigation is just a scam because if James Comey really wanted to indict Hillary Clinton then he would have done so back in July 2016 when he first investigated her.\\nHere’s a quote from our previous article, WE NAILED IT!\\nJames Comey did not provide any recent proof he stumbled upon and neither will he until the election is over. Yes he’s technically not allowed to but he could just indict Hillary in a second if he truly wanted just for lying to the FBI or wiping the server to get rid of all the evidence after receiving a congressional subpoena.\\nUnfortunately we got it all wrong regarding the reason on why he reopened the investigation. We thought he did so just to protect himself from a possible Trump victory followed by a retaliation. We thought he would keep the case opened until after the election and then support the winner. We were wrong…\\nWe did however predict that he was being blackmailed live on TV without anyone even noticing it, when Clinton said: “I’m confident whatever they are will not change the conclusion reached in July.” Whatever they are? Including crime and whatever is found? Such a declaration is a public warning to Comey.\\nSo it appears that James Comey is totally in the sack for the Clintons. Only God knows what they have on him. The real reason on WHY he reopened the investigation has been told to Alex Jones of Infowars by Larry Nichols also on 30 October 2016 (top video).\\nLike the EU Times, Larry Nichols also predicted that the new investigation is a sham and he also nailed the reason. He told Alex the FBI reopened the investigation only to distract the media from Wikileaks. He even told Alex that by Saturday or Sunday before the elections, Comey would close the case and declare her innocent again. Larry Nichols also said that James Comey is compromised because the Clintons have heavy dirt on him which they use for blackmail.\\nRepublican Representative Trey Gowdy also predicted the exact same thing . He also said that the 2nd FBI investigation on Hillary is a sham and that there will be no indictment with Loretta Lynch ordering around.\\nAs a fun fact, all Democrats are praising James Comey now while only a few days ago they were calling him “Russian Agent” and “ Disgusting White Males “.\\n'"}, "time": 1742562945.077789}