{"duration": 0.09267354011535645, "input_args": {"text": "'“And would sir like a regular or large fries, with that? And how about a McFlurry? ”[I do hope that Gavin “Toast” Schmidt, the head of NASA’s Goddard Institute of Space Studies (GISS) followed the advice I gave him a few months back. Because it now looks very much as if he and many of his colleagues are about to face exciting new job opportunities, hopefully in areas best suited to their talents, such as the challenging world of   retail.  Yes, as we predicted, NASA is going to be stripped of the two main roles it enjoyed under the Obama administration  —   Muslim outreach and green propaganda  —   and return to its original day (and night) job as an agency dedicated to space exploration. The U. S. Senate passed legislation recently cutting funding for NASA’s global warming research. The House is expected to pass the bill, and President Trump will likely sign it. Supporters say it “ ” NASA’s budget back toward space exploration and away from global warming and earth science research. Republicans plan to end the more than $2 billion NASA spends on its Earth Science Mission Directorate. “By rebalancing, I’d like for more funds to go into space exploration we’re not going to zero out earth sciences,” Texas Republican Rep. Lamar Smith, who chairs the House Committee on Science, Space and Technology, told EE News. “I’d like for us to remember what our priorities are, and there are another dozen agencies that study earth science and climate change, and they can continue to do that. ” Before we shed too many tears for the plight of Gavin Schmidt and the rest of his global warming research team, though, let’s just pause to reflect on how much damage they have done to the cause of honest science over the years and what   vast quantities of our money they have wasted. A good place to start is this excellent piece by Steve Goddard, entitled The Pause Is Real: NASA Temperatures Aren’t. Here is the damning chart that says it all: How did a supposedly respectable government agency get away with such blatant fraud? Well, one answer is that it was encouraged to do so by the US government which paid its Earth Science research division $2 billion a year, while giving only $781. 5 million and $826. 7 million to its astrophysics and space technology divisions. Obama wanted “global warming” to be real and dangerous: and  —   lo!  —   thanks to the magic of his crack prestidigitators at NASA, NOAA and the rest, it was. But the longer answer is that this is what happens when green ideologues are allowed to infiltrate and hijack government institutions. As we’ve reported before, NASA has been caught out fiddling temperature data on “an unbelievable scale”. So too has NOAA. That’s because their global warming departments are mostly run by true believers  —   scientists who want to show the world that global warming is a major threat in urgent need of more grant funding, regardless of what the actual temperature data shows. Hence the many, many adjustments. This has done tremendous damage not just in the US but across the world because it has enabled green propagandists to point at the dodgy adjusted data from NASA and NOAA and claim: “The Experts say  …    ” Now, thanks to Donald Trump, that fraud is about to come to a sudden and painful end. It never ceases to amaze and nauseate me that more people, especially on the right, aren’t more grateful for what is being done here. While mainstream media commentators on both left and right bloviate about Trump’s style (clearly they prefer Obama’s empty rhetoric) and stoke up fake news stories about Russian plots, Trump is busily getting on with one of the most valuable and important missions ever conducted by a US president: he is putting an end to the biggest and most expensive scientific scam in history. Oh, and he is also working wonders for property rights and business by rescinding such damaging regulations as the Waters Of The US and the Climate Action Plan. A source briefed on the matter told The Washington Post one of the orders “will instruct the Environmental Protection Agency to begin rewriting the 2015 regulation that limits   emissions from existing electric utilities” and order “the Interior Department’s Bureau of Land Management (BLM) to lift a moratorium on federal coal leasing. ” Trump will issue a second order instructing the EPA and U. S. Army Corps of Engineers to rewrite the “Waters of the U. S. ” (WOTUS) rule that expanded federal control over rivers, streams and wetlands  —   even those on private property. If ever a swamp needed draining, it’s the swamp of the $1. 5 trillion environmental scam. This could have gone on for ever and ever. Our grandchildren ought to be properly grateful to President Trump that it didn’t.'"}, "time": 1742563916.8322756}