{"duration": 0.23928618431091309, "input_args": {"text": "'Originally appeared at The Nation \\ns we approach the final months of the Obama presidency, it’s clear that the “change” in foreign policy that candidate Obama promised voters has not materialized. His pledges to end the Iraq War, to pursue a nuclear-free world, to improve relations with Russia, to act as an honest broker between Israel and Palestine, and to improve relations with the Arab world have all been left unfulfilled. That his likely successor, former secretary of state Hillary Clinton, is to the right of the president on matters of national security is, in a way, an all-too-fitting monument to an era of dashed expectations. \\nAs of this writing, more than 5,000 troops are deployed in Iraq and nearly 10,000 in Afghanistan. These deployments run parallel with the dangerously misconceived interventions in Libya and Syria and a counterproductive drone war that stretches from the Maghreb and the Arabian Peninsula to the mountains and plains of Central Asia. Worryingly, the Obama administration has given these military adventures a veneer of legality by deriving justification from the Authorization for Use of Military Force passed by Congress on September 14, 2001. These US interventions are supported by nearly 2.1 million reserve and active-duty troops, 200,000 of whom are stationed overseas at a yearly cost of $600 billion. By some estimates, the US military is currently operating in more than 160 countries. \\nMeanwhile, in addition to waging a new and more dangerous cold war with Russia, the administration—which views the South China Sea as a core national interest—launched the so-called “Asia pivot,” which moves US policy toward China from one largely based on shared business interests to one that seeks to contain China’s rise. The president’s much-publicized trip to Southeast Asia this year was a good indication that Washington intends to surround and isolate China by employing “bandwagoning” states like Vietnam. \\nIt was widely assumed that Obama would pick up the pieces of the Bush years and exorcise hegemonic fantasies from the body politic. Instead, over his two terms in office, the convergence of the neoconservative and Wilsonian interventionist creeds has solidified into orthodoxy. No better evidence of this exists than the fact that the neocons who served as the instigators and defenders of George W. Bush’s foreign policy have become devoted supporters of Hillary Clinton. Robert Kagan, Max Boot, and Eliot Cohen, among others, have all voiced their preference for Clinton over the Republican nominee, Donald Trump. \\nThis is less surprising than it might first seem. After all, the neoconservative and Wilsonian weltanschauungs are, like Marxism, teleological: History, for them, has specific and definable ends. For the neocons and Wilsonians (also commonly known, in recent decades, as liberal interventionists), humanity’s march toward democracy is not only in sight, but achievable. America’s foreign-policy orthodoxy can be summed up by the claim made by then–Secretary of State Madeleine Albright, during Bill Clinton’s presidency, that America is the one “indispensable nation” because “we stand tall. We see further into the future.” \\nObama’s UN ambassador, Samantha Power, expressed well an integral element of this orthodoxy when she recently wrote that “it is now objectively the case that our national interests are increasingly affected not just by what happens between states, but also by how people are treated within states [emphasis added].” \\nPower’s casual disregard for the Westphalian principle of noninterference in the internal affairs of other states, now de rigueur among interventionists of both parties, is fused with a belief in American global hegemony, of which the Obama administration’s 2010 Quadrennial Defense Review is representative: \\nThe United States remains the only nation able to project and sustain large-scale operations over extended distances. This unique position generates an obligation to be responsible stewards of the power and influence that history, determination, and circumstance have provided. \\nClearly, change has failed to materialize. Instead, Obama remains firmly in the grip of a foreign-policy orthodoxy that he himself has dismissed as “the Washington playbook,” and which the scholar Andrew Bacevich describes as the “faith-based belief in American global primacy to be pursued regardless of how the world may be changing and heedless of costs.” In late October, The Washington Post observed that while “it is not unusual for Washington’s establishment to launch major studies in the final months of an administration,” the flurry of recommendations coming from Washington think tanks like the Center for American Progress “reflect a remarkable consensus among the foreign policy elite.” Perhaps the question that will flummox future historians most as they survey the record of the Obama years is this: How did a president who so eloquently and cogently promised a break with the past become captive to the regnant orthodoxy calling for seemingly endless interventions abroad? \\nAs it became more and more difficult to deny that the 2003 invasion of Iraq was a debacle, George W. Bush tried to justify his administration’s policies by appropriating the language of the Wilsonians in an attempt to make his actions palatable to the guardians of respectable opinion. In his second inaugural address, Bush proclaimed: “It is the policy of the United States to seek and support the growth of democratic movements and institutions in every nation and culture, with the ultimate goal of ending tyranny in our world.” By employing such language, Bush cleared the way for the convergence of the neoconservative and Wilsonian ideologies, which have now congealed into the orthodoxy holding US foreign policy hostage. \\nThat orthodoxy is enforced by what historian William Appleman Williams has described as the “climate of assumption.” This prevailing climate is shaped by an “inside-outside” dynamic, whereby the narrative that defines any given crisis is set on the “inside,” by administration officials and sitting ambassadors, and reinforced on the “outside,” by the establishment media. What amounts to is a process of preemptive agenda-setting. In the case of policy regarding Syria, Libya, and Russia, the inside-outside dynamic has shaped a narrative that seeks to delegitimize the regimes in question, thereby obviating the need for nuance and crowding out the moral, consequential, or realist implications of any given policy decision. It is therefore exceedingly difficult, even for a chief executive with Obama’s obvious talents, to depart from this orthodoxy, because of the way it narrows the spectrum of “acceptable” policy options. * * * \\nThe Obama administration’s counterproductive intervention in Syria stems from an interpretation of the Arab Spring, painted by administration insiders and the establishment media, as a series of peaceful, pro-democracy mass movements. Such movements were deemed deserving of US support because, according to the democratic-peace theory (a key tenet of the neoconservative/Wilsonian ideologies), the spread of democracy is de facto in US interests; as the oft-stated argument goes, democracies don’t wage war against one another. \\nThe protests that roiled Syria in the spring of 2011 surely gave voice to elements of the population with legitimate grievances against the Assad regime. But did that necessarily mean that the overthrow of the country’s secular government would serve US national interests—or the interests of the vast majority of Syrians? That question never seems to have been asked, because the orthodoxy deemed it out of bounds. The Syrian narrative was set early on: Bashar al-Assad, an obstacle to democratization and killer of his own people, “must go.” \\nThe pr \\nThe narrative of illegitimacy, once established, allows for almost anything, regardless of the legality or morality of the chosen policy. Witness former CIA director David Petraeus’s call for Washington to ally with elements of Al Qaeda in Syria, or the US government’s funding of the Nour al-din al-Zinki movement, which beheaded a 12-year-old boy in July—to say nothing of the CIA’s illegal and counterproductive train-and-equip program, which has only served to prolong the Syrian conflict. \\nA similar dynamic played out during the Libyan crisis: Very early on, the president—driven by rumors circulated as fact in the establishment media that Libyan dictator Moammar El-Gadhafi was about to conduct a wholesale massacre in the rebel stronghold of Benghazi—declared that he “must leave.” The narrative of impending slaughter was reinforced by a spate of breathless news reports and op-eds. \\nYet the basis of the administration’s case for intervention proved to be illusory. There was not then, nor is there now, a shred of evidence that Gadhafi intended to unleash a genocidal slaughter in Benghazi. And this was clear at the time: As University of Texas scholar Alan Kuperman pointed out in April 2011, “The best evidence that Khadafy did not plan genocide in Benghazi is that he did not perpetrate it in the other cities he had recaptured either fully or partially—including Zawiya, Misurata, and Ajdabiya, which together have a population greater than Benghazi.” \\nBut no matter: Once the narrative was set, the orthodoxy dictated intervention in spite of the fact, as reported by Rolling Stone in 2011, that Gadhafi’s son Saif “tried to arrange a phone call with Hillary Clinton, thinking he could talk the Americans out of intervening. But when Saif placed the call, Clinton refused to speak to him.” NATO intervened in March 2011, and Gadhafi was dead by October, creating a vacuum that has since been filled by civil war and the rise of ISIS. \\nIn the case of Russia, the administration’s call to oust Vladimir Putin has been tacit rather than overt. After Putin’s decision to stand for election in March 2012, the goal of isolating Russia with an eye toward regime change became default US policy. Indeed, in March 2011, the Russian politician Boris Nemtsov wrote that Vice President Joe Biden told a gathering of opposition figures in Moscow that if he were Putin, “he would not stand for president in 2012 because this would be bad for the country and for himself.” \\nAfter that, the narrative was set: Putin, returning for a third term in the Kremlin, was to be treated as an obstacle to be removed. For proof of this, one need look no further than an e-mail from Hillary Clinton, then secretary of state, to a departing aide in February 2012, in which she noted that she was pleased to see the aide heading to the White House to “plan and execute our Russia strategy post-Putin.” \\nThe push by inside and outside voices to brand Putin’s Russia as an outlaw state picked up steam in the winter of 2013–14, with the start of the Maidan revolution in Ukraine. Recall that the initial cause of the rift between the protesters and the Ukrainian government was over the latter’s failure to sign an association agreement with the European Union. And while US national-security interests weren’t even remotely at stake, that was beside the point: The agreement included trade and security provisions that would have effectively wrenched Ukraine from Russia’s traditional sphere of influence, and it was pursued regardless of the consequences, which have included the violent overthrow of Ukraine’s democratically elected president and a civil war that has killed nearly 10,000 people. By the end of 2015, the United States had provided Ukraine with $2 billion in loan guarantees and nearly $760 million in security assistance—all part of a needless and costly new cold war with Russia that could one day be seen as President Obama’s principal foreign-policy legacy. * * * \\nIn addition to the inside-outside dynamic between the administration and establishment media, Washington’s think tanks and NGOs play an important role as enforcers of orthodoxy—one that has become increasingly pronounced over the course of the Obama administration. While purporting to be nonpartisan, outfits like the Center for a New American Security (CNAS) and the Brookings Institution in effect launder neoconservative policy proposals by dressing them up in the softer, more palatable language of Wilsonianism. In just the past few years, think tanks have served as incubators and champions of policies like arming Ukraine and overthrowing the government of Syria. \\nOften, these organizations are deeply compromised by their funders. For example, after Brookings accepted $14.8 million from the government of Qatar—which has financed Salafist terrorist groups like Syria’s Nusra Front (now the Levant Conquest Front)—the think tank published an op-ed that made the case for Syria’s radical Sunni extremist group Ahrar al-Sham, arguing against “designating [it] as a terrorist organization.” \\nWashi \\nAnalysts associated with Brookings and its center in Qatar—whose co-chair is Sheikh Hamad bin Jassim bin Jaber al-Thani, a former prime minister and member of the Qatari ruling family—have repeatedly complained that the Obama administration isn’t doing enough to help the “moderate” opposition in Syria. And yet Gerd Müller, Germany’s international-development minister, told The Telegraph in 2014, “You have to ask who is arming, who is financing [ISIS] troops. The keyword there is Qatar.” Indeed, it has recently come to light that Hillary Clinton shared Müller’s concerns, noting in an August 2014 e-mail to John Podesta that the Qatari and Saudi governments “are providing clandestine financial and logistic support to ISIL and other radical Sunni groups in the region.” \\nThis June, while Democratic Representative (and combat veteran) Tulsi Gabbard was pushing a bill to defund the CIA’s train-and-equip program in Syria, Brookings senior fellow Shadi Hamid took to Twitter to declare that “@TulsiGabbard might be one of worst/least knowledgeable foreign policy thinkers in Democratic party. Not just bad ideas, but dangerous ones.” Hamid followed this up with: “Neo-isolationist left (@tulsigabbard) & far right (Trump) have pretty similar views on how Putin’s actually not so bad: He can help on ISIS!” \\nIn smearing Gabbard, Hamid was only echoing the sentiments of his colleague in Qatar, Charles Lister, who had previously accused Gabbard of being “the Democratic Party’s chief defender of Bashar al-#Assad.” As Brookings fellows, Hamid and Lister take their role as enforcers of the orthodoxy seriously—as well they might, since Gabbard’s legislation, if passed, would be a serious setback for the grand designs of Beltway Caesars like themselves. \\nIn addition to plumping for further involvement in Syria, Hamid has tried to whitewash the administration’s disastrous Libya intervention, which even Obama has admitted was his “worst mistake.” Hamid, though, claims it was “successful,” arguing: “The country is better off today than it would have been had the international community allowed dictator Muammar Qaddafi to continue his rampage across the country.” Never mind that a civil war has been ravaging Libya for the past five years. \\nIn addition to producing op-ed columns of questionable value, think tanks also influence the climate of assumption by publishing special reports that are meant to serve as guides for policy-makers. Indeed, sometimes the resemblance between government memoranda and think-tank literature is uncanny, as was the case this past June when CNAS Middle East director Ilan Goldenberg was pleased to point out the “many similarities” between the State Department’s hawkish “dissent channel” cable on Syria and a CNAS report titled “Defeating the Islamic State: A Bottom-Up Approach.” Both, needless to say, called for greater US involvement in the Syrian civil war. \\nIn the past year, CNAS has published several notable reports that have advocated, among other things, the wider use of drones ( “The Promise of Unmanned Systems in the Asia Pacific” ); increased military spending and more overseas commitments ( “Extending American Power: Strategies to Expand U.S. Engagement in a Competitive World Order” ); directly arming the Syrian opposition ( “From the Bottom, Up: A Strategy for U.S. Military Support to Syria’s Armed Opposition” ); and yet more military spending ( “While We Can: Arresting the Erosion of America’s Military Edge” ). Even the ostensibly center-left Center for American Progress recently unveiled a report that urged the imposition of a no-fly zone over Syria, a move that Hillary Clinton herself has admitted, albeit behind closed doors, risks the possibility of a wider war and would “kill lots of Syrians.” \\nMeanwhile, the Atlantic Council (funded in part by the US government and NATO) has released a series of articles and reports urging greater action in Ukraine. In February 2015, in conjunction with Brookings and the Chicago Council on Global Affairs, it released “Preserving Ukraine’s Independence, Resisting Russian Aggression: What the United States and NATO Must Do,” which urged the administration to arm Kiev. \\nOver the past few years, the Atlantic Council has gone from espousing a sensible, if staid, transatlanticism to producing some of the most virulent specimens of the new cold-war propaganda. Examples of its prodigious output relating to Russia and the Ukraine crisis can be seen in reports like “Human Rights Abuses in Russia-Occupied Crimea” (August 2015); “Hiding in Plain Sight: Putin’s War in Ukraine” (October 2015); and “Arming for Deterrence” (July 2016). Not surprisingly, in addition to NATO and the US government, the Atlantic Council lists the Ukrainian World Congress, the Ukrainian oligarch Victor Pinchuk, the Lithuanian government, and the Latvian embassy among its many funders. \\nThere is also the collusion between private, ostensibly nongovernmental organizations and those agencies of the US government that seek—and sometimes, in the case of Ukraine, manage to engineer—regime-change movements. The founding father of what might be called “ideological humanitarianism” is surely the financier and self-styled political philosopher George Soros, who, through his network of Open Society Foundations, seeks to influence and leverage civil-society opposition groups in countries throughout Eastern Europe. \\n\\n\\nSoros has spawned many imitators. Perhaps the most emblematic of the new techno-crusaders is eBay founder Pierre Omidyar, whose involvement in the Ukraine uprising has complemented Washington’s. According to journalist Mark Ames, “The American government—in the form of the US Agency for International Development (USAID)—played a major role in funding opposition groups prior to the revolution.” Ames also notes that a large percentage of the funding for those groups came from Omidyar. \\nIndeed, Omidyar’s work has been praised by none other than Samantha Power, who, in November 2013, singled him out as an heir to Soros in a speech hailing the “new philanthropists” who are working to advance the vision that “George popularized and resourced: open economy, open government, open society.” And while it’s certainly the case that the Open Society Foundations have done valuable work in the fields of public health and criminal-justice reform, particularly here in the United States, Soros’s activism takes on a decidedly less benign character abroad. A recent tranche of leaked Open Society e-mails shows that Soros was actively trying to shape the politics of post-Maidan Ukraine. In a meeting with US Ambassador Geoffrey Pyatt in March 2014, Soros urged Washington to provide “professional PR assistance to [the] Ukrainian government,” while also voicing his opinion that the neofascist group Right Sector was little more than “an FSB [Federal Security Service] plot” funded by Russia “to destabilize Ukraine.” * * * \\nThe US government, in appointing itself the global arbiter of legitimacy, has set a series of dangerous precedents. Today, the United States reserves the right to intervene anywhere in the world, regardless of the consequences, morality, or costs in blood and treasure. In the Middle East, US interventions have created space for ISIS in Iraq, Syria, and Libya, while our alleged allies Saudi Arabia, Turkey, and Qatar have been among the principal benefactors of ISIS and like-minded religious extremists. \\nIn addition to what is fast becoming a strange obsession with Russian President Vladimir Putin, the foreign-policy establishment has turned a blind eye to the ravages of the Ukrainian civil war, as well as to the fact that the main—and perhaps insuperable—obstacle to the implementation of the 2014 Minsk cease-fire agreement is the US-supported and -funded government in Kiev, which boasts a neo-Nazi as its parliamentary speaker. \\nAs we approach November 8, it is clear that this foreign-policy orthodoxy is something the establishment takes on faith. But foreign policy should not be a faith-based business. Progressives and like-minded anti-interventionist conservatives and libertarians need to alert the American public to this dangerous state of affairs and fashion a coherent, sound, and popular alternative to the orthodoxy holding US foreign policy hostage. That may require the formation of a 21st-century peace movement, with allies inside a “peace” wing of the Democratic Party. A second Clinton administration looks increasingly likely; if that is the case, the progressive, responsible left will have to serve as a check on its interventionist impulses. This will not be easy, nor should we delude ourselves about the prospects for success. \\nBut we must, for all our sakes, attempt it.'"}, "time": 1742628521.0086188}