{"duration": 0.06354594230651855, "input_args": {"text": "\"The Jorge Cabrera Scandal First Lady Photo-OP with Convicted Cocaine Dealer [INLINE] Star The Economics Section - Page A4 Star [USEMAP] October 24, 1996 First Lady Photo-OP with Convicted Cocaine Dealer Inside White House Secured Perimeter! by Staff Journalists, The Daily Republican Newspaper [INLINE] WASHINGTON DESK - The Justice Department released on Wednesday photographs showing a convicted Miami cocaine trafficker who is seen standing next to and posing with vice president Al Gore. The two were attending a party in Florida last December. Apparently, Cabrera was asked to make a large donation to the Clinton-Gore campaign in exchange for perks like hob-nobbing with Al Gore and the first lady, Hillary Rodham Clinton. Jorge Cabrera's cash contributions to the Clinton-Gore campaign were so generous, that Cabrera was also invited to the White House and gained entrance there without any FBI & Secret Service security clearance. [INLINE] CNN reported Wednesday that Cabrera's attorney, Stephen Bronis, said $20,000(given to the Clinton-Gore campaign) was not intended to buy protection for drug smuggling. 'He had a lobster and stone crab fishery in the Keys and felt that contribution might promote that future course,' Bronis said. The Clinton-Gore campaign only returned the $20,000 last week after the full story had reached ABC News, and the Clinton administration had been asked for comment by the media. Cabrera was arrested in January during a Miami drug bust of nearly three tons of cocaine. Cabrera was arrested and pleaded guilty to one drug count. He was also imprisoned in the 1980s on narcotics charges. A report that the picture of Cabrera and Gore had been impounded by the Justice Department prompted an angry reaction from Republicans, including Bob Dole's presidential campaign, House Speaker Newt Gingrich and Rep. Bob Livingston of Louisiana, chairman of the House Appropriations Committee. Republicans sent letters to Attorney General Janet Reno and the directors of the FBI and the Secret Service seeking information about Cabrera and the campaign contribution. Livingston asked the federal agencies for a complete accounting of the facts relating to the story within three days: whether Cabrera had dined at the White House, details of his relationship with Clinton and Gore and, if he did dine with them, how he passed FBI & Secret Service scrutiny to gain access to them. The U.S. attorney's office in Miami was contacted by reporters. Justice said it would not provide photographs of Cabrera and Gore in Florida and at the White House when reporters requested them on Monday. The Justice Department attempted to claim that Cabrera's story is covered by the Privacy Act law in turning down the media request for information on the arrest for cocaine possession of tons of the illegal drug and dealing. Janet Reno put out information that the photo of Cabrera with Gore and Clinton could not be released without the consent of Cabrera. Later, the Justice Department did release the photographs after Cabrera submitted written authorization. The delay by the Justice Department appeared to be an effort to distance itself from accusations that are mounting from the American public that the Justice Department is receiving guidance from the Clinton White House and the vice president's office on the timing of Janet Reno's investigation. Justice says it is looking into the breach of National Security by Cabrera's ready access to secured areas of the White House and its grounds when he entered as an invited quest of president Clinton for dinner and photo-ops. COMMENT\""}, "time": 1742563975.9930642}