{"duration": 1.7529292106628418, "input_args": {"text": "'By Robert Fisk on November 6, 2016 Robert Fisk — The Independent Nov 4, 2016 Syrian soldiers stand before their tanks at Quneitra, a few hundred metres from the front line with Nusrah Islamists and only five miles from Israeli troops on the Golan Heights. Click to enlarge \\nFrom Colonel Saleh’s forward position on his front line north of Quneitra, he has a unique and exclusive view of the Syrian war. To his west and south is a vast area of his country which is occupied by Jabhat al-Nusra Islamist fighters – their earthen ramparts and supply roads are scarcely half a mile away. Then, another couple of miles away, Israeli soldiers are inside their concrete positions on the occupied Syrian Golan Heights, above the old and Nusra-held Syrian city of Quneitra. \\n“You see that mosque over there, just to the right of the water tower?” the colonel asks. “Well, Nusra is there. And you see the triangular hill beyond? The Israelis are there.” It’s what you call a politically intriguing battlefield – yes, shells do come whizzing in towards the Syrians from Nusra and also from the Israelis. The Syrians concentrate their fire on Nusra but Nusra’s casualties are often taken through the Israeli lines for hospital treatment in Haifa. \\nSo whose side is Israel on? Baath City is a concrete conurbation created back in pre-civil war days to defy the vandalisation of the old Quenitra. It was occupied by the Israeli army during the 1973 Middle East war and then – before they abandoned it under the Kissinger agreement – totally destroyed with explosives by Israeli troops. Nusra now occupy these 43-year old ruins. As for Baath City, its university, banks, fire station, schools, police force and hospitals are defiantly maintained by the Syrians under the eyes of their two enemies: the Nusra Islamists and the Israelis. Israeli Prime Minister Benjamin Netanyahu visits a military field hospital in the Golan Heights medical facility where wounded “Syrian rebels” are being treated. Click to enlarge \\nAccording to the Syrian army in Baath City – their forward lines and tanks are positioned in unfinished apartment blocks on the edge of the town – their intelligence department’s Hebrew speakers constantly monitor conversations between the Israelis and between Israeli and Nusra fighters. They know – and the Israelis have made no secret of the fact – that wounded Nusrah fighters are taken to Haifa for hospital treatment. On one occasion, a Nusrah man travelling in an Israeli ambulance on the Golan was dragged from the vehicle and lynched by a crowd of enraged Druze men who are largely loyal to the Syrian government and regard Nusrah as their mortal enemies. Reports of the man’s murder highlighted the highly ambiguous relationship between Israel and the Islamists, whose name-changing cannot conceal their al-Qaeda roots. \\nDruze towns inside Syria and close to Baath City have taken the side of the regime – this does not apply to other Druze areas – but it makes the geography of the front line here all the more surreal. One Syrian lieutenant described to me how he directed his artillery fire onto an Israeli jeep in the Nusra-occupied town of Al-Hamidiya inside Syria and destroyed it. The jeep might have been a gift or borrowed from Israel – whether there were any Israeli personnel inside it if it was hit is another matter. The Syrians, however, also say that Israeli bulldozers were used to build a new supply route for Nusrah between Quneitra and Golan – again, inside Syria’s frontiers. \\nAll of which raises a compelling question. The Nusra-controlled territory between the Syrians and the Israeli lines on Golan – and other Islamist groups and a few remnants of the old “Free Syrian Army” allied to them in this location – stretches all the way south to the edge of the Syrian city of Deraa and right down to the Jordanian frontier. And beyond that frontier is the so-called “Military Operations Centre” – the “MOC” of which both the Islamists and the Syrian army refer – where Western intelligence officers maintain a liaison and weapons supply depot for the anti-government Syrian forces. \\nSo what is the relationship between the MOC and its Western backers – who maintain contact with Nusra – and the Israelis who treat Nusra’s wounded in their hospitals? The Jordanian border and the Israeli lines on Golan are at their most only about 70 miles apart and opposition fighters hold all the land in between. \\nLittered around the front lines outside Baath City are the wreckage of past battles and the abandoned UN posts from which Filipino UN soldiers were kidnapped en masse more than a year ago; the Syrian army now occupies several of these positions, the UN logo still painted on the walls although several of the “igloo”-type UN accommodation huts have migrated to Syrian compounds in the rear lines. The UN force on Golan now operates only inside Israeli-occupied territory. \\nOnly a few hundred yards away from Nusra-held territory, we found Abu Hashem, a farmer who fled from his village, now held by the Islamists, living today in family property close to one of the old UN posts. He fed us tea and coffee and walnuts from his orchard. His wife and six children now exist in this unfinished, cold house along with a small library of books – the speeches of Imam Ali (the “Najul Blagha”) and a collection of medical books of Aleppo herbal cures for headaches and kidney infection, published in Beirut. He says the people in his Nusra-occupied village are divided. Some are sympathetic towards the Islamists – they are not fighters – while others are sometimes permitted by Nusrah to cross the front lines for treatment in Syrian government hospitals. They are Bedouins and farmers, the unsettled and the landowners, always prey to the wolves of civil war insurgents. \\nColonel Saleh, who is 50 years old, has been guarding his echoing and weed-strewn apartment blocks on the edge of Baath City for three years, noting wearily that the Israelis attack his army but never attack Nusra who – being al-Qaeda – might logically have earned Israel’s enmity. But no. “I know every stone here,” the colonel says. “I can see if a rock or a vehicle has moved across the fields in front of us – and I can immediately see if one vehicle has become two vehicles. We know when they are going to attack – they always precede their offensives with a big artillery and mortar barrage.” \\nSometimes the voices of Nusra men shout insults at the Syrians on their own radio sets, calling them “kafirs” – ‘“infidels” or “unbelievers”. “If I am in a good mood, I invite them for coffee,” Colonel Saleh says. “If I’m in a bad mood, I am silent. Their accents are very similar to the Jordanians. They come from the south of Deraa, along the Jordanian border.” \\nAs we spoke, further down the line, the Syrians and Nusra were fighting with tanks, artillery and mortars. The Syrians claimed that their enemies arrived in several directions in a convoy of at least 13 vehicles. They spoke, too, of a Nusra female officer called Souad al-Qatahani (nicknamed “Al-Nood”), the 30-year-old sister of a Nusrah general called Qais al-Omani who commanded 1,200 fighters. She was, they pointed out rather remarkably, a former first lieutenant in their own Syrian government army. \\nAnd one further feature that the Syrians have noted about their enemies outside Baath City. Whenever Nusra fire a missile, they have to take a photograph of the rocket leaving its launcher – presumably to prove to their suppliers that they have not sold the weapon to someone else. Trust, as usual in the Syrian war, is in short supply.'"}, "time": 1742563331.1249144}