{"duration": 0.03670096397399902, "input_args": {"text": "'Pinterest \\nDespite the multiple attempts to throw Republican presidential candidate Donald Trump off his game and into the gauntlet, he has proved resilient and potentially victorious. \\nThe Clinton campaign has left no stone unturned in an attempt to destroy Trump and create distractions from her criminal activity. \\nHowever, one of the most reliable formulas is predicting a Trump victory. \\nAccording to the New York Post : \\nA data-crunching artificial intelligence system that’s correctly predicted the last three US presidential elections is picking Donald Trump to be the next commander in chief. \\nThe AI system, called MogIA, crunches 20 million data points from sites such as Google, Facebook, Twitter and YouTube to spew out its predictions, CNBC reported. \\nIt shows that Trump has overtaken the social media engagement numbers of Barack Obama’s peak in 2008 — by 25 percent. \\nAnd that’s important, because the candidate in each election who led in engagement data ended up winning the presidency, according to MogIA creator Sanjiv Rai, founder of an Indian startup company called Genic.ai \\nNow, some of you may be raising an eyebrow to this “engagement data” since Trump is talked about a lot on social media–the good, the bad, and the ugly. \\nHow does the data sort out positive and negative comments? Trump supporters talking about Trump, versus Hillary supporters criticizing Trump? \\nIt turns out that doesn’t matter. \\nThis same system–relying on engagement data–also successfully predicted Trump’s win in the Republican primaries. \\nDemocratic presidential candidate should not get too comfortable in her alleged lead. \\nUltimately, Trump supporters and Trump haters are extreme. But, ultimately, it appears no news is bad news. \\nAs the founder of this artificial intelligence system stated, “If Trump loses, it will defy the data trend for the first time in the last 12 years since internet engagement began in full earnest,” Rai told CNBC. \\nHopefully, come November, anyone possessing a modicum of human intelligence will vote this artificial intelligence prediction into reality.'"}, "time": 1742564191.2737992}