{"duration": 0.05678153038024902, "input_args": {"text": "'Fransız askerlere IŞİD’çi formasyonu eğitimi Voltaire İletişim Ağı | 27 Ekim 2016 français Español italiano Deutsch English 22 Eylül 2016 günü, Saumur (Fransa) çıkışında, Saint-Florent Kilisesinin yakınlarında, terk edilmiş bir mağara sığınağı temizleyen işçiler, apar topar beyaz bir kamyonetle uzaklaşan üç adam gördüler. Mağaraya girdiklerinde, video malzemeleri, bir jeneratör, Arapça gazeteler ve IŞİD bayrakları buldular.\\nHalkın, polisin, jandarmanın ve vali yardımcısının heyecanını yatıştıran Saumur Askeri Okullar Komutanı General Arnaud Nicolazo de Barmon, bunların teröristlere ait olmadığını, ama Ordulararası Nükleer, Radyolojik, Biyolojik ve Kimyasal Savunma Merkezinin (CİA NBCR) bir eğitim tatbikatının söz konusu olduğunu söyledi.\\nEğer durum böyleyse, olağanüstü halin tam ortasında, CİA NBCR bu tatbikatı yapmadan önce yerel kamu idarelerine bildirimde bulunmaya yönelik kuralları ihlal etti demektir. Ayrıca, nükleer, radyolojik, biyolojik ya da kimyasal savunma tatbikatlarında bu malzemelerin ne işe yarayabileceğini bilemiyoruz.\\nSaumur’daki CİA NBCR’nin aynı tesislerinde, İstihbarat ve Ordulararası Muharebe konusunda uzmanlaşmış okullar da yer alıyor.\\n2011’de Suriye’deki olayların en başından beri, Fransız birliklerinin bu ülkedeki varlığı kanıtlandı. 2012’de, esir alınan 19 Fransız askeri, Lübnan sınırında, Baba Amr’da İslam Emirliğini eğiten başka askerlerle birlikte, Genelkurmay Başkanı Amiral Edouard Guillaud’ya teslim edilmişti. İslamcı güçleri eğiten Fransız askerlerinin ölümü, özellikle 2013 yılında Sannayeh’te olduğu gibi, birçok farklı yerde kanıtlanmıştı. Her ne kadar Fransa 2014 yılında IŞİD’e karşı El Kaide’yi desteklese de, Halifeliğin içerisinde Fransız subaylarının varlığı 2016 yılında birçok tanık tarafından doğrulandı.\\nKasım 2014’te Pentagon, Samarda’da El-Kaide içerisinde faaliyet yürüten, David Drugeon isimli bir DGSE ajanını öldürdüğünü açıkladı. Bu arada Fransız Savunma Bakanı kurbanla herhangi bir bağlarının olmadığını belirtti. Ardından ABD basını da David Drugeon’un Muhammet Mera (Toulouse ve Montauban saldırıları) ve Kuaşi kardeşleri ( Charlie Hebdo ’ya yönelik saldırı) eğittiğini belirtiyordu.\\nFransa, her ne kadar müttefik özel kuvvetleriyle birlikte ortak bir ana karargahı olduğunu tanısa da, bugüne kadar Suriye’de kara birliklerinin varlığını hiçbir zaman resmi olarak kabul etmedi.\\nÇeviri\\nOsman Soysal'"}, "time": 1742561956.203208}