{"duration": 0.03174781799316406, "input_args": {"text": "'Home / Be The Change / Government Corruption / FBI Insider Reveals Agent Revolt Inside the Bureau Made Comey Reopen Clinton Investigation to ‘Save Face’ FBI Insider Reveals Agent Revolt Inside the Bureau Made Comey Reopen Clinton Investigation to ‘Save Face’ Jack Burns October 31, 2016 Leave a comment \\nJust after the FBI opened a criminal investigation into Hillary Clinton’s email scandal, the Free Thought Project spoke with a high-level FBI agent (retired). He said if Clinton wasn’t eventually indicted, it was almost certain there would be a data dump ( click for related story ) from within the FBI, from agents who were upset with James Comey’s decision not to recommend Clinton be indicted for mishandling classified information. When Comey, in July, didn’t recommend to Attorney General Loretta Lynch that Clinton be indicted, a data dump of sorts did take place when the Democratic National Committee’s server was hacked. \\nCould it be that the DNC hack was done from within the federal government? After its server’s emails were hacked for the whole world to see, the DNC was exposed for working with mainstream media members to rig the primaries for Clinton against Bernie Sanders, and a concerted effort was made to paint him in a negative light (something that led to the resignation of DNC head Debbie Wasserman Schultz). But the Democrats responded by declaring the intrusion was the work of Russian hackers — an allegation the Russians deny. \\nBut now, it seems, the effects of not recommending Clinton for indictment are far worse than predicted. On Friday, James Comey conveyed to members of Congress that the once closed investigation of Clinton’s private email server is now open again, just days before Clinton or Donald Trump will be elected as the next U.S. president. The announcement was made after more Clinton emails turned up in an investigation into Anthony Weiner’s sexting of a 15-year-old girl from NC . Weiner is Huma Abedin’s estranged husband and Abedin is Clinton’s closest confidant. \\nBut according to The Daily Mail, there exists an even greater problem Comey is facing which prompted him to reopen the case; the wholesale resignation of disgruntled FBI agents. One source close to Comey says it’s his last ditch attempt to save face for himself and the reputation of the FBI. \\nAccording to the Daily Mail , and a source close to James Comey, the decision, at least in part, came after he “could no longer resist mounting pressure by mutinous agents in the FBI” who “felt that he betrayed them and brought disgrace on the bureau by letting Hillary off with a slap on the wrist.” \\nEd Klein, journalist for the Mail, described Comey as being depressed over the mounting stack of resignation letters he’s received as a result of his decision not to recommend charges be brought against Clinton. Klein quoted a close friend of Comey’s as saying, “’The atmosphere at the FBI has been toxic ever since Jim announced last July that he wouldn’t recommend an indictment against Hillary,’ said the source, a close friend who has known Comey for nearly two decades, shares family outings with him, and accompanies him to Catholic mass every week.” \\nKlein’s source continued, “’Some people, including department heads, stopped talking to Jim, and even ignored his greetings when they passed him in the hall,’ said the source. ‘They felt that he betrayed them and brought disgrace on the bureau by letting Hillary off with a slap on the wrist.’” \\nThe DM journalist continued quoting his informant as saying, “’When new emails that appeared to be related to Hillary’s personal email server turned up in a computer used [her close aide] Huma Abedin and [Abedin’s disgraced husband,] Anthony Weiner, Comey jumped at the excuse to reopen the investigation.’” \\nBut Comey’s problems aren’t isolated to his workplace. He reportedly has problems at home as well. Klein’s source continued, “’The people he trusts the most have been the angriest at him…that includes his wife, Pat. She kept urging him to admit that he had been wrong when he refused to press charges against the former secretary of state.’” \\nComey’s friend told Klein he’s being shunned by many within the FBI and that President Obama and Lynch are “furious” with him for reopening the case against Clinton. According to the DM’s source, “’Lynch and Obama haven’t contacted Jim directly…they’ve made it crystal clear through third parties that they disapprove of his effort to save face.’” \\nBut the reopened investigation may be too little too late. The damage to the FBI’s investigation appears to be done, and no amount of scrambling to save face is likely to fix it. In the mind of many Americans, when former president Bill Clinton met AG Lynch on the tarmac in Phoenix, Arizona, the fix was in for Hillary. Comey proved to be a pawn and has passed himself off as an impotent benefactor of the Clintons. Share Social Trending'"}, "time": 1742628497.5792723}