{"duration": 0.028279781341552734, "input_args": {"text": "'Sex toy company   has been ordered to pay out nearly $3 million after it was revealed that a “smart vibrator” was secretly collecting intimate data. [The   4 Plus vibrator, which allows users to customize their sexual experience with a variety of options via an app, was discovered to be secretly sending “vast quantities of user data to  ’s parent company,” while it was also revealed that the device could be hacked from a “close proximity. ”  “Following a   lawsuit in an Illinois federal court,  ’s parent company Standard Innovation has been ordered to pay a total of C$4m [Canadian dollars] to owners, with those who used the vibrator’s associated app entitled to the full amount each. Those who simply bought the vibrator can claim up to $199,” reports The Guardian. “The app that controls the vibrator is barely secured, allowing anyone within Bluetooth range to seize control of the device. ” “In addition, data is collected and sent back to Standard Innovation, letting the company know about the temperature of the device and the vibration intensity  —   which, combined, reveal intimate information about the user’s sexual habits,” they continued. The security concerns were reportedly exposed at 2016’s Def Con Hacking Conference in Las Vegas. “At Standard Innovation we take customer privacy and data security seriously,” declared the company in a statement. “We have enhanced our privacy notice, increased app security, provided customers [with] more choice in the data they share, and we continue to work with leading privacy and security experts to enhance the app. With this settlement, Standard Innovation can continue to focus on making new, innovative products for our customers. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742562239.590318}