{"duration": 0.06687164306640625, "input_args": {"text": "'WASHINGTON  —   Senate Democrats concede they have little leverage to stop Donald J. Trump’s cabinet nominees. But that will not discourage them from trying to make life as uncomfortable as possible for many of his choices, with the hope of forcing their Republican colleagues and Mr. Trump to squirm along the way. With nominees like Representative Tom Price, a proponent of fundamental changes to Medicare, to be health secretary, and Steven Mnuchin, a Goldman Sachs trader turned hedge fund manager, as Treasury secretary, Democrats hope to use the confirmation hearings to highlight the wide river of incongruities between Mr. Trump’s campaign promises and much of the team he is assembling. The goal: to fuel a narrative that the incoming president, and the Republicans who support him, cannot be trusted. “  Trump promised that he was going to clean up the swamp,” said Senator Chuck Schumer of New York, the incoming Democratic leader, “and a whole lot of his nominees have had their career in the swamp. ” One by one, Mr. Schumer said, Democrats will use the confirmation process to highlight positions held by nominees that are either inconsistent with Mr. Trump’s campaign promises or raise the sorts of ethical questions that Democrats tried in vain to hang around Mr. Trump’s neck during the campaign, like refusing to release his tax returns. Senator Elizabeth Warren, Democrat of Massachusetts, who serves on committees that are likely to have contentious hearings, can be counted on to work over many nominees. “We should know what direction this administration is headed in,” Mr. Schumer said. “They didn’t win the election by saying they were going to hire people who want to cut Social Security and Medicare. I will also be looking for any ethical transgressions. ” For starters, Democrats announced this past week that they would push for a rule requiring all   nominees to provide Congress with their tax returns, a move made to suggest that some of Mr. Trump’s selections may share    and tax issues with the incoming president. Democrats have themselves to blame for their weakened position in challenging a nominee. In 2013, the Senate voted largely along party lines to remove the   threshold on   and   Court judicial nominees. Mr. Trump’s nominees will now need the support of only 51 senators to be confirmed Republicans are expected to hold 52 seats next year. “At the end of the day, we were the ones who changed it to 51,” said Senator Claire McCaskill, Democrat of Missouri, who voted for the measure. “I think it’s important to remember how righteous we were. ” It is highly unusual for Congress, even in an era of divided government, to outright filibuster cabinet nominees. Republicans have shown broad support for Mr. Trump’s choices so far, even those lawmakers who have been otherwise critical of him. In one telling move, Senator Susan Collins gave a fast nod to Mr. Trump’s choice of attorney general, Senator Jeff Sessions of Alabama, who came under immediate fire by Democrats for his   positions on civil rights issues and his   immigration stance that made him an early Trump ally. In short, Republicans say, bring it on. “Responsible Democrats responded to the election by saying they heard the message of the American people and pledged to work with the incoming administration and Republicans in Congress to move America forward,” said Antonia Ferrier, a spokeswoman for Senator Mitch McConnell of Kentucky, the majority leader. She added, “We hope responsible Democrats won’t be bullied by the radical left to turn the confirmation process into some political side show. ” But Democratic lawmakers can make the process afflictive. Mr. Price is expected to receive a particularly hot grilling. As a congressman from Georgia, Mr. Price has been the chief architect of a plan to repeal the Affordable Care Act and has long desired to transform Medicare into a voucherlike program for future participants. Mr. Sessions is likely to undergo tough questioning about accusations of racially insensitive comments from the 1980s that doomed his nomination to be a federal judge and his tentative embrace of Mr. Trump’s call for a ban on Muslim immigration. That effort seems most likely to backfire because Mr. Sessions has served in the Senate for more than a decade and has a complex record on civil rights back home in Alabama, and his Republican colleagues will likely be quick to defend him. “Our friend,” said Senator John Cornyn of Texas, the No. 2 Senate Republican, referring to Mr. Sessions, “is undoubtedly qualified and prepared for this role as attorney general because of the long career he spent protecting and defending our Constitution and the rule of law. ” Betsy DeVos, the Michigan billionaire Mr. Trump chose to lead the Department of Education, will also be questioned by Democrats for her unwavering support of charter schools, many of which have fared poorly in her state, and tax issues concerning her summer home. “There are a lot of pointed questions I plan to ask,” said Senator Ron Wyden of Oregon, the highest ranking Democrat on the Senate Finance Committee, which oversees the Medicare program and already requires tax returns from nominees. “These nomination hearings are extremely important in that they are going to provide a key opportunity to lay out the concerns we have. ” Democrats hope that moderate Republicans, especially those up for   in two years, will face an uncomfortable vote on someone like Mr. Price, given the popularity of the Medicare program. “Are Republicans going to want to vote for a guy who wants to raise the Medicare eligibility age?” said Senator Sherrod Brown, Democrat of Ohio. “I don’t think it’s a done deal. ” (It probably is a done deal.) But most Democrats seem more interested in pointing out that Mr. Trump’s nominees largely stand out of step with his campaign promises to “drain the swamp” of lobbyists, former bankers and Washington insiders. Mr. Mnuchin is a   veteran of Goldman Sachs, and the billionaire investor Wilbur Ross, the choice for commerce secretary, signed a letter in support of the   Partnership trade deal, which Mr. Trump has ridiculed as disastrous. Democrats plan to use the nomination process to underscore the dichotomy. “He’s filling it with bigger swamp creatures,” said Senator Patty Murray, Democrat of Washington, who is pressing for nominees to be required to disclose tax returns. And for whatever bumps Mr. Price or Mr. Sessions might face, other nominees will probably breeze through confirmation. Gov. Nikki R. Haley of South Carolina, whom Mr. Trump has chosen to be his ambassador to the United Nations, and Elaine L. Chao, a former labor secretary whom he has nominated for secretary of transportation, have encountered little opposition. Mr. McConnell is especially excited for Ms. Chao, his wife. “I think it was an outstanding choice,” he said.'"}, "time": 1742628345.632674}