{"duration": 0.07920527458190918, "input_args": {"text": "'Joseph Farah, a    author, had long labored on the fringes of political life, publishing a   series claiming that soybeans caused homosexuality and fretting that “cultural Marxists” were plotting to destroy the country. But in early 2011, he received the first of several calls from a Manhattan real estate developer who wanted to take one of his theories mainstream. That developer, Donald J. Trump, told Mr. Farah that he shared his suspicion that President Obama might have been born outside the United States and that he was looking for a way to prove it. “What can we do to get to the bottom of this?” Mr. Trump asked him. “What can we do to turn the tide?” Mr. Farah recalled that Mr. Trump even proposed dispatching private investigators to Hawaii, Mr. Obama’s birthplace, to resolve the debate. Mr. Trump’s eagerness to embrace the   birther idea  —   long debunked, and until then confined to   conspiracy theorists  —   foreshadowed how, just five years later, Mr. Trump would bedevil his rivals in the Republican presidential primary race and upend the political system. In the birther movement, Mr. Trump recognized an opportunity to connect with the electorate over an issue many considered taboo: the discomfort, in some quarters of American society, with the election of the nation’s first black president. He harnessed it for political gain, beginning his connection with the largely white Republican base that, in his 2016 campaign, helped clinch his party’s nomination. “The appeal of the birther issue was, ‘I’m going to take this guy on, and I’m going to beat him,’” said Sam Nunberg, who was one of Mr. Trump’s advisers during that period but was fired from his current campaign. “It was a great niche and wedge issue. ” And starting in March 2011, when he first began to test the idea that a reality television star with no political experience could mount a campaign for the presidency, Mr. Trump could not stop talking about it. “Why doesn’t he show his birth certificate?” he asked on ABC’s “The View. ” “I want to see his birth certificate,” he told Fox News’s “On the Record. ” And on NBC’s “Today Show,” he declared, “I’m starting to think that he was not born here. ” The more Mr. Trump questioned the legitimacy of Mr. Obama’s presidency, the better he performed in the early polls of the 2012 Republican field, springing from fifth place to a virtual tie for first. That frenzied period culminated six weeks after it began in a surreal televised split screen between Mr. Trump and the White House briefing room, where aides released an image of the president’s birth certificate proving he was born in Honolulu and Mr. Obama directly addressed the issue. It was a remarkable moment that Mr. Trump celebrated as a political victory. Then Mr. Trump did something decidedly   : He dropped the issue and rarely spoke of it publicly again. According to people apprised of the conversations, people close to him had been worried about the negative attention. Officials at NBC had also been concerned that he was alienating the large black audience of his hit show, “The Apprentice. ” Indeed, damage had already been done. Some black leaders denounced him, with Jesse Jackson accusing Mr. Trump of appealing to the president’s detractors with “coded and covert rhetoric for stirring up racial fears. ” Several days later, Mr. Obama relished his own chance to belittle Mr. Trump with a string of taunts at the White House Correspondents’ Association dinner, as Mr. Trump, seated in the audience, grew increasingly  . “But no one is happier, no one is prouder, to put this birth certificate matter to rest than the Donald,” he said to laughter. “And that’s because he can finally get back to focusing on the issues that matter: Like, did we fake the moon landing?” Mr. Trump, who declined to be interviewed about the subject, was not the first to question Mr. Obama’s birthplace. The narrative that Mr. Obama, whose father was Kenyan and mother American, might not meet the requirement that the president be a “  citizen” first arose during his 2008 bid. Mr. Obama’s aides initially decided it was better to ignore the questions addressing them, they reasoned, would just given them credibility. And Mr. Trump, too, at first seemed uncertain about just how much skepticism to express over the president’s place of birth. “The reason I have a little doubt, just a little, is because he grew up and nobody knew him,” he said in a March 2011 interview. “The whole thing is very strange. ” Yet, quickly, the world took notice. One headline referred to Mr. Trump going “Birther Lite. ” Another said he was a “Teeny Bit Birther. ” And MSNBC’s “Hardball” replayed the comments, with the intro: “Let’s listen to how he joins the birthers. ” If Mr. Trump was offering a political trial balloon, he appeared to like the results. He started making the rounds, offering interviews on the topic and stoking public interest in the birther claims. Mr. Trump was egged on by one key adviser  —   Roger J. Stone Jr. a dapper dresser and political operative known for mischief and mayhem. Mr. Stone said that he did not plant the idea with Mr. Trump, but that once Mr. Trump came to him with it, he extolled what he saw as the political upside. “He was suspicious about it, or at least interested in it,” Mr. Stone said. Among Republican base voters, he added, “many of them believe the president is   and Trump has an ability to interject any idea that is outside of the mainstream into the mainstream. ” A Gallup poll from that period showed that only 38 percent of Americans surveyed believed that Mr. Obama was “definitely” born in the United States. That number rose to 47 percent after Mr. Obama released his   birth certificate. Mr. Trump also continued to reach out to Mr. Farah, founder of WorldNetDaily, a conservative website, as well as to Jerome Corsi, another conservative writer and author of “Where’s the Birth Certificate? The Case That Barack Obama is Not Eligible to Be President. ” (The book came out shortly after Mr. Obama released his birth certificate, but shot to the top of Amazon. com’s best sellers before it was even officially published.) “He was looking for affirmation that he was on the right track,” Mr. Farah said. “He was looking for a smoking gun kind of sound bite that would resonate with people. ” But what most impressed Mr. Farah was just how many hours Mr. Trump was willing to devote to the question. “This was a busy guy, this was a multibillionaire, and I was surprised that he was willing to spend that kind of time on it,” he said. Mr. Farah also stressed to Mr. Trump that the issue was one of “transparency,” and Mr. Trump began using the phrase. “He started saying ‘transparency,’” said Mr. Nunberg, Mr. Trump’s former adviser. “It’s code for, ‘This guy is the Manchurian candidate. ’” Mr. Trump also said repeatedly that he had sent a team of investigators to Hawaii to unearth information about Mr. Obama’s birth records. “They cannot believe what they are finding,” Mr. Trump told ABC’s “The View. ” But as the issue exploded, people close to Mr. Trump were growing nervous. Some people in Mr. Trump’s orbit were discomfited by the line of attack, which had already been examined and rejected by many conservative news outlets. Among them was an informal political adviser, Kellyanne Conway, a Republican pollster, who cautioned that if he did run, he would need to beat Mr. Obama “on the merits. ” Even executives at NBC, which aired “The Apprentice,” privately called on him to tone down his remarks, fearing he would hurt ratings at a time when more than a million   tuned in every Thursday night, according to a former executive with knowledge of the discussions, speaking anonymously to share candid conversations. The White House, too, had growing concerns. Once reserved to the fringe, the issue had now begun popping up at    events around the country. The turning point came in   2011, when the president delivered a major speech on the budget, only to find his remarks obscured by questions about his birth certificate. “It was basically a message blocker that was preventing us from talking about the issues we needed to talk about because the press was chasing Donald Trump around for the next crazy thing he was going to say,” said Dan Pfeiffer, the White House communications director then. The White House counsel dispatched someone to Hawaii to find the president’s original   birth certificate from 1961. (Years before, the president had released the “short form,” an official   document that contains the information from the original.) With the document finally in hand, aides quickly scheduled a news conference. They worried that having Mr. Obama himself release his birth certificate from the White House briefing room would undermine the dignity of the office. So they first passed out copies to reporters, and then had the president deliver remarks, in which he warned the nation about getting distracted by “sideshows and carnival barkers. ” Then, almost as quickly as it began, the controversy subsided. And several weeks later, Mr. Trump decided not to seek the Republican nomination. Though he continued to do well in polls, he seemed to be more focused on his reality television pursuits. Now, Mr. Trump almost assiduously refuses to discuss the topic, which, according to several people close to him, was always more about political performance art than ideology. “I don’t talk about that anymore,” Mr. Trump told the MSNBC host Chris Matthews after a Republican debate last year. Raising questions about the president’s birth certificate  —   and even threatening to send a team of investigators to Hawaii  —   had served its purpose, raising Mr. Trump’s political profile and, whether he knew it or not at the time, providing him with the rudimentary foundation upon which he built his 2016 campaign. He even skirted close to birther innuendo after the massacre in Orlando, Fla. last month, calling into “Fox  Friends” to insinuate that Mr. Obama might sympathize with Islamic extremists. “He doesn’t get it or he gets it better than anybody understands,” Mr. Trump said. But for all of his fascination with the president’s birth certificate, Mr. Trump apparently never dispatched investigators or made much of an effort to find the documents. Dr. Alvin Onaka, the Hawaii state registrar who handled queries about Mr. Obama, said recently through a spokeswoman that he had no evidence or recollection of Mr. Trump or any of his representatives ever requesting the records from the Hawaii State Department of Health.'"}, "time": 1742628488.276999}