{"duration": 0.12613248825073242, "input_args": {"text": "'Videos Police Departments Refuse Participation In Dakota Access Pipeline Crackdown In addition to the general retreat of departments, two officers have already turned in their badges in support of the protesters.   Members of the Stutsman County SWAT watch protesters demonstrating against the Dakota Access Pipeline near the Stand Rock Sioux Reservation, as they stand next to a police barricade on Highway 1806 in Cannon Ball, N.D., Sunday, Oct. 30, 2016. \\nStanding Rock, North Dakota — Widespread outrage over both the construction of the Dakota Access Pipeline and violent police crackdowns rages on. That outrage is spreading even to police agencies now returning from deployment to the reservation. Two departments have already refused to return, citing personal and public objections. As if that wasn’t enough, an army of sympathizers is re-purposing social media to combat police efforts in Standing Rock. \\nMinnesota’s Hennepin County Sheriff’s Department is among that group. Lawmakers, according to MPR News , found police activities in Standing Rock “inappropriate”. It’s to the point where they’re considering rewriting legislation to avoid future deployments to incidents like the pipeline resistance. \\nPolice officials, of course, declined to comment on their return from North Dakota or their feelings on what’s happening there. It’s also made the task of rebuilding trust with the community an even loftier uphill battle. “I do not support Sheriff Stanek’s decision to send his deputies to North Dakota”, says LT. Governor Tina Smith, “nor did we approve his decision to begin with. I do not have any control over the Sheriff’s actions, which I think were wrong, and I believe he should bring his deputies home if he hasn’t already.” \\nSmith’s comments split the state’s government, however, and she was targeted. Minnesota State Rep. Tony Cornish condemned Smith for prioritizing “the rights of protesters over the needs of law enforcement”, saying she should apologize to the cops. \\nSheriffs from Wisconsin’s Dane County were more empathetic, pulling out and refusing to return. According to the Bismarck Tribune , Sheriff Dave Mahoney made the decision after a “wide cross-section of the community” decried the deployment. “All share the opinion that our deputies should not be involved in this situation”, says Mahoney. Dane County’s deputies were deployed to Standing Rock for around a week. Sources report Dane County wasn’t involved in recent arrests, a string of which scooped up an alderwoman from Madison Wisconsin. \\nAld. Rebecca Kemble traveled to North Dakota as a “legal observer”, filming and participating in prayer ceremonies. When Morton County officers–if they cans till be called that–grabbed and arrested her for engaging in a riot. According to Kemble, no riot was happening. Other Wisconsin departments have been recalled, with at least one staying behind for a more couple weeks. \\nMany other citizens have been charged for trespassing and participating in non-existent riots, including journalists. One of the most renowned reporters who’s faced DAPL (Dakota Access Pipeline)- related charges was Amy Goodman of Democracy Now . Goodman’s team filmed dog attacks by DAPL contractors who lacked proper K9 licenses. The contractors have also been accused of unethical surveillance, intimidation, and sabotaging the movement by attempting to make authorities believe the protesters have finally turned violent. \\nOther journalists, including documentarian Deia Schlosberg, face decades in prison for filming climate activists at a separate oil project. Journalists from the independent outlet Unicorn Riot, who recently reported use of a sound cannon on water protectors, have also been arrested. \\nThousands of opponents to the pipeline have flooded Standing Rock to repel construction and police brutality. More still have taken to the internet, spreading information in the form of writing, video, photography, and art. Among the renegade tactics is using Facebook to “check-in” at Standing Rock. According the Guardian , over a million people–even people I know–have joined the action. \\nIt began with a Facebook post, disclosing that Morton County sheriffs are allegedly using Facebook check-ins to track protesters. “Checking in”–whether you’re at a friend’s, restaurant, or escalating resistance–pinpoints your location to a tee. Once you check in, a notification is sent out to, yes, your friends, but theoretically anyone who’s capable of watching. It’s yet another tool in the bag of tricks authorities have deployed against civilians, and are likely utilizing in Standing Rock. \\nSome detractors have dismissed the social media action as a waste of time. An editor at The Fifth Column challenged these in a Facebook post, narrating a debate on the subject he’d had. Editor Justin King pointed out that even if the check-in’s wasted two minutes of time, multiplied by hundreds of thousands, that equates to two months of wasted police work. Now imagine how ineffective the surveillance may be with millions continuously checking. \\nMorton County Sheriff’s, Guardian reports, called claims of police surveillance misguided “rumors”. Morton County, by their own account, isn’t “monitoring Facebook check-ins for the protest camp or any location for that matter.” Before you trust them, consider that Facebook access for water protectors was reported as “blocked’ during a military-style raid on a camp. \\nData Collection Nationwide \\nOther police departments are similarly sketchy when pressured to speak on their surveillance technologies. Wisconsin’s Milwaukee PD hid the use of cell site simulators , or Stingrays, from courts for months. Stingrays mimic cellphone towers, thus tricking phones into providing all manner of user information and data \\nNearby, the Wauwatosa Police Department , despite having admitting to “collecting and analyzing cell phone data” in its public reports, denied ever even coming close to a Stingray. It took the department 5 weeks to respond to that open records request, which is considered unusually long. It remains unknown how Wauwatosa PD, which has been blasted for lack of transparency before , collects cell phone data. \\nThe Hand’s Fingers In Open Rebellion \\nIn addition to the general retreat of departments, two officers have already turned in their badges in support of the protesters. North Dakota water protector Redhawk, MintPress reports , disclosed the revelation. The individual also pointed out “you can see it in some of them, that they do not support the police actions.” “Some are waking up”, they continued, “we must keep reminding them that they are welcome to put down their weapons and badge and take a stand against the pipeline as well.” Hints of shame could be seen in the faces of officers who confronted protesters as they blocked them from prayer grounds. As the protesters condemned officers , some of whom looked down or off to the horizon in shame. \\nThe modern era of internet and technology gifts us with a plethora of ways to express ourselves, and help one another. Standing Rock is quickly becoming a stand out of that fact. Citizens, journalists, and activists are all using the internet to achieve their own goals. Whether that be spreading information being blocked, tracking police movements, sending food and rations or just voicing opinions. Standing Rock’s resistance is spreading globally, with protests occurring in Europe and elsewhere. As long as construction doesn’t stop, the movement won’t rest.'"}, "time": 1742561780.8367689}