{"duration": 0.16980195045471191, "input_args": {"text": "'Waking Times \\nYou can only get so far with orders, and the misuse of power. The same goes with the restriction of human action. The war on drugs has been an abject failure , as has been the American ‘democracy.’ It is the same with a corporatized prison system, and so too, will be the attempted overtaking of the American people by a corrupt cabal. If the 2016 elections have taught us nothing else, it is that we should be very careful who we make into our political martyrs. \\nDespots and tyrants can rule effectively for a time, but in the end, they always perish – their civilizations and accomplishments with them. The fall of Rome ring any bells? It doesn’t matter if you voted for Hillary Clinton with her ties to the Rothschilds and Rockefellers, or for Trump who has alienated women, minorities, gays, and educated leftists alike with his misogynistic comments, and brash unpredictable actions. This election is a call to find our inner hero . We need her/him, as never before. \\nThis election has caused monumental stress because it has exposed our deep, perhaps subconscious desire to shirk responsibility and off-load it onto a public figure. We want an external hero. What happens when someone truly leads , is a different, and positively inspiring story altogether. 1.) What a Leader Isn’t \\n“When we quit thinking primarily about ourselves and our own self-preservation, we undergo a truly heroic transformation of consciousness.” ~ Joseph Campbell \\nA true hero, or heroin — the quintessential leader of our time is not a politician. The etymology of the word leader comes from the root word ‘lead’, which means, to guide and inspire. The word hero is derived from both Greek and Latin words meaning to watch over and to protect. It doesn’t mean to lord over. It has nothing to do with warnings and chastisements, nor the use of force, either legislatively, financially, socially, or politically to get people to do what you want them to do. \\nA true leader doesn’t divide and conquer. They gather masses without trying in a unified cause by being in service, by acting, as Anthony Robbins once said, ‘as a slave’ to a purpose higher than protecting themselves. This could be family. It could be community. A leader might inspire a few, or several thousand but their work endures, even after they perish because its intent was pure. \\nMany leaders are quiet. Others are bold, but they are never self-serving. A tell-tale sign of a true leader, is one who needs no ‘credit’ for what they have given to society, and who simply thrives on the action of their own internally driven inspiration. They don’t check the poles and they don’t need your ‘vote.’ As Lao Tzu has said, “A leader is best when people barely know he exists, when his work is done, his aim fulfilled, they will say: we did it ourselves.” \\nHitler wasn’t a true leader, nor was Stalin. Their rise to fame and power was brief. Add to that list, George Soros, Bill Gates, The Clinton’s, the Trumps, the Rothschilds, the Rockefellers, et al. \\nInstead, look to individuals like Edward Leedskalnin , the Latvian emigrant who built one of the most impressive structures on the planet, not for fame, but to honor a lost love. People still can’t surmise how coral castle was created. Look to Nikola Tesla whose work is used in every conceivable manner still today (some of his inventions known and others still hidden by those who seek false power.) \\nAs another true leader, R. Buckminster Fuller would say , “ You never change things by fighting existing reality . To change something you create a new model which makes the old one obsolete.” \\nThe self-appointed ‘leaders’ of our time fight against the masses. They fight against Mother Nature , and they torment themselves trying to accumulate more power to wield over the world. What could they be reflecting in us is the question we should really be asking. 2.) A True Leader Often Won’t Fit in with ‘Regular’ Society \\n“Men do not accept their prophets and slay them, but they love their martyrs and worship those whom they have tortured to death.” ~ Fyodor Dostoevsky \\nBetween the years 325 and 787 A.D., many people were treated poorly by society at large because of the different conflicts that were going on. One of the main conflicts in this era surrounded religion. If you were not like the Roman Catholics, and decided to believe in freedom of religion, you were “excluded” from the Roman Catholic Church and thereby, society. Those seeking religious freedom were deemed sinners, and lawless hooligans. \\nThis is just one of many incidents in history that we can look back on and observe that the societal conscience always changes. It isn’t absolute. A leader is never swayed by the ‘popular’ or the ‘common.’ They think only about what is best for society in that time and space. \\nThere have been numerous outcasts of various degree who were true leaders. Malcolm X, Bob Marley, Indira Gandhi, Hatshepsut, Aung San Suu Kyi, etc. 3.) A True Leader Can’t Solve All of Your Problems \\nNumber three is a big one. A true leader will never solve all your problems, and they don’t even try. Their sole purpose is to help you find the strength to display heroic acts of your own. They inspire. They exemplify, but they realize that by solving your problems they would actually be taking away your opportunity to learn, and grow. You’ve earned whatever lessons you currently face, but you will also receive the gifts hidden in a challenge, only when you take full responsibility and face your shadowed projections. \\nThe wicked will shout for you to change your ways. The divine will whisper, and wait for you to heed the encouragement of grace. 4.) A True Leader Will Never Ask You to Follow Them \\nSaints and yogis are notorious for sending aspiring followers away. They’ll ignore them, cajole, them, and even ridicule their seemingly fervent desire to learn from a master. That’s because they want you to do your work first. If you are expecting some miraculous cure or salvation from anyone, even a saint, you’ll be waiting a good long while. This doesn’t mean that divine intervention doesn’t happen, or that we shouldn’t look to others for help or advice, but ultimately, a leader shows the way simply by doing his own work. The one thing we can learn from this example is to do ours, too. \\nA final note — A true leader is ‘God’ in action. As Joseph Campbell has said, “What is a god? A god is a personification of a motivating power of a value system that functions in human life and in the universe.” No credentials or filibusters needed. About the Author \\nChristina Sarich is a freelance writer, musician, yogi, and humanitarian. Her insights appear in magazines as diverse as Weston A. Price, Nexus, Atlantis Rising, and the Cuyamungue Institute, among others. She was recently a featured author in the Journal, “Wise Traditions in Food, Farming, and Healing Arts,” and her commentary on healing, ascension, and human potential inform a large body of the alternative news lexicon. She is also a staff writer for Waking Times . Like Waking Times on Facebook . Follow Waking Times on Twitter . This article ( 4 Secrets About True Leaders ) was originally created and published by Waking Times and is published here under a Creative Commons license with attribution to Nathaniel Mauka and WakingTimes.com . It may be re-posted freely with proper attribution and author bio. ~~ Help Waking Times to raise the vibration by sharing this article with friends and family…'"}, "time": 1742561652.7507188}