{"duration": 0.11436057090759277, "input_args": {"text": "'By karencole \\nPosted Thursday, October 27, 2016 at 10:20am EDT \\nHaving a great smile can say so much about someone. This is the first thing when making a conversation with someone. If your teeth are not white enough, it may greatly lower your self-esteem, and you lack confidence. In the long run, you end up losing opportunities, and you are unable to express yourself. There are so many people with discolored teeth, and they have spent a fortune in dental visits, yet there are several ways that they can be controlled by below home remedies . Watch what you eat. \\nEnsure that you frequently eat crunchy fruits as well as vegetable . Fruits such as apples, carrots act as a natural toothbrush. They are important in removing any bacteria that may be present in the mouth. Also, these fruits remove any food particles that may be left in the mouth. They are also useful in scrubbing any stain that may be on the surface of the teeth. \\nAlso, consider taking strawberries. They are known to contain a Malic acid enzyme which is important in removing any stains on the teeth surface thus whitening the teeth. While eating them, you should chew them thoroughly to ensure that they are brushing the teeth. Always brush and floss your teeth on a daily basis. \\nBrushing and flossing your teeth regularly helps a lot in avoiding the formation of plaque. It is recommended that you should brush and floss at least twice a day. The time taken to brush the teeth may not mean much but it is the quality and how well you do it that matters. While brushing, ensure that u reach the surfaces that are behind your teeth as well as the back molars. The bottom line is removing any food particles and bacteria that may facilitate the formation of plaque. Use the oil pulling method. \\nThis method is quite common with the Indian community. It helps in improving their oral health and cleansing their bodies. For this method, it entails moving a tablespoon of oil in your mouth for a few minutes while pulling it in between your teeth. After about 20 minutes, spit the oil and clean your mouth using plenty of water. Doing this frequently can go a long way in whitening your teeth thus better oral health . Use of a mixture of baking soda and lemon. \\nThis method is used by so many people in whitening the teeth. The mixture has a reaction that often results in brighter teeth. However, you should be very careful in ensuring that the mixture doesn’t stay in your mouth for long without brushing as it will result in enamel erosion. \\nBy following the above natural home remedies, you can rest assured that you will have whiter teeth. Ensure practice these tips frequently. \\nAuthor Bio: Karen Cole is working as a freelance writer from last 4 years. Currently, she is doing research on oral health and working with some dentists of USA . You might also like…'"}, "time": 1742563036.9975183}