{"duration": 0.05760908126831055, "input_args": {"text": "'Newsbusters October 27, 2016 \\nOn Wednesday’s Morning Joe , co-host Joe Scarborough once again was forced to actually tell the truth about the liberal bias in media coverage throughout this entire election. \\nScarborough, a former Florida Republican congressman, began the discussion stating that: \\n“[A]s a Republican there’s a natural reaction to press bias and it has been so overwhelming even if it is has been earned. The media has taken sides. They’ve aggressively taken sides and they’ve admitted that we’re aggressively taking sides and I think you get some Republicans that see that every four years. It’s so funny. They do that every four years. Every four years it’s like the end of the world if a Republican gets elected president because they’re all racist. It’s the boy that cried wolf.” \\nIn a sense, what was articulated is that the mass media’s historic liberal bias against conservatives is reflected in every election so much so that in this one, their usual partisan attacks against Trump’s controversial personality are not as effective. Also, Scarborough stated the fact shared by many conservatives that there is an overwhelming and aggressive agenda by the press to defend liberals. \\nFurthermore, in conversation with frequent panelist Mike Barnicle, Scarborough added: “Also, it’s such a confounding election where we go back and forth on what it’s about, Mike Barnicle said all along that it’s about Hillary Clinton. People say ‘I’m going to vote for Hillary Clinton as a protest against…’ and then after sitting on that for a couple of weeks that thought for a couple weeks they go ‘eh…maybe not.’” \\nIn a way, they were all trying to explain how Trump is still almost tied to Clinton in a number of battleground state polls, despite the disproportionate amount of negative coverage. Later on in response to co-host Willie Geist’s remarks about the race being almost over, Scarborough proved his earlier point about the media’s disconnect: \\n“I got to say, Willie. Everybody that is saying it’s over and you’re a fool if you’re suggesting that the American people may have the final say at the voting booth are the same people that were saying in August, September, October, November, December, January, February that there was no way in a million years that Donald Trump would ever win the Republican nomination. Stating it just as emphatically as they’re stating now that we need to avert our eyes, this race is over. “ \\nHere are the excerpts from the October 26th discussion on Morning Joe : \\nMSNBC’s Morning Joe \\n10/26/2016 \\n6:07:14-6:08:04 AM \\nJOE SCARBOROUGH: People in the press won’t like to hear there also is – as a Republican there’s a natural reaction to press bias and it has been so overwhelming even if it is has been earned. The media has taken sides. They’ve aggressively taken sides and they’ve admitted that we’re aggressively taking sides and I think you get some Republicans that see that every four years. It’s so funny. They do that every four years. Every four years it’s like the end of the world if a Republican gets elected president because they’re all racist. It’s the boy that cried wolf. Also, it’s such a confounding election where we go back and forth on what it’s about, Mike Barnicle said all along that it’s about Hillary Clinton. People say ‘I’m going to vote for Hillary Clinton as a protest against…’ and then after sitting on that for a couple of weeks that thought for a couple weeks they go ‘eh…maybe not.’ \\n(….) \\n6:18:25 – 6:19:01 AM \\nSCARBOROUGH: I got to say, Willie. Everybody that is saying it’s over and you’re a fool if you’re suggesting that the American people may have the final say at the voting booth are the same people that were saying in August, September, October, November, December, January, February that there was no way in a million years that Donald Trump would ever win the Republican nomination. Stating it just as emphatically as they’re stating now that we need to avert our eyes, this race is over.   8:20  '"}, "time": 1742562886.9234385}