{"duration": 0.0694267749786377, "input_args": {"text": "'Nükleer silahlara « Hayır » oyu nasıl verilir? yazan Manlio Dinucci Amerika Birleşik Devletleri, BM Genel Kurulunun Birinci Komitesi’ndeki müttefikleri tarafından nükleer silahların topyekun ortadan kaldırılmasını amaçlayan bir karar tasarısının reddedilmesini sağladı. Bu arada, gayrimeşru olarak ABD atom bombalarına ev sahipliği yapan Devletlerin, Nükleer Silahların Yayılmasının Önlenmesi Anlaşmasının 2nci Maddesi gereğince bunların topraklarından geri çekilmesini şart koşmaları muhtemeldir.\\nVoltaire İletişim Ağı | Roma (İtalya) | 5 Kasım 2016 français italiano English Español « Teşekkürler, Başkan Obama. İtalya nükleer güvenlik için çabalarını büyük bir kararlılıkla sürdürmeye devam edecektir »: Başbakan Matteo Renzi, tarihi bir tweeter mesajında böyle yazıyordu. Altı ay sonra aynı Renzi Birleşmiş Milletlerde, nükleer silahlara « evet » oyu verdi. ABD’nin kuyruğuna takılan İtalyan Hükümeti, Genel Kurul Birinci Komitesinde büyük çoğunlukla onay gören, 2017 yılında Birleşmiş Milletlerde « tamamen ortadan kaldırılmalarıyla sonuçlanacak şekilde, nükleer silahların yasaklanması için zorlayıcı yasal bir aracı müzakere etmek » için bir konferans toplanması davetini öngören karar tasarısına karşı tavır aldı.\\nBöylece İtalyan Hükümeti, bundan iki yıl önce Viyana Konferansı sırasında, « sabır ve diplomasiyle arabulucu rolü » oynayarak nükleer silahsızlanma adına hareket etme iradesi konusunda güvence vererek, « kolay tatmin olmayan » nükleer karşıtı hareketlere verdiği söz konusunda tükürdüğünü yaladı. Böylece, hükümetten İtalya’nın « aktiften de öte, muhtemelen uç noktada bir rol » oynayabileceği, « nükleer silahsızlanmaya doğru giden insani ve hukuksal » bir güzergah içerisinde, « nükleer silahların ülke dışına çıkarılması için yürütülen çaba ve mücadelenin sürdürülmesinin » talep edildiği, « topyekun nükleer silahsızlanmayı şart koşuyoruz » çağrısı boşluğa düşüyor.\\nBunun sonucunda, aynı şekilde aynı içerikteki parlamento önergeleri de boşluğa düşüyor. Nükleer silahsızlanmaya yönelik jenerik çağrılar kolayca araçsallaştırılabilir: 1 000 milyar dolarlık yeniden nükleer silahlanmanın mimarı ABD Başkanının, « nükleer silahlardan arınmış bir dünya vizyonu » için Nobel Barış Ödülü’ne layık görüldüğünü düşünmek yeterli.\\nBirleşmiş Milletlerin karar tasarısında sözü edilen nükleer silahsızlanma hedefine varmak için İtalya’dan katkıda bulunabileceğimiz somut yöntem, ülkemizi ABD’nin nükleer silahlarından kurtarmaktır. Bu amaçla hükümete çağrıda bulunmak yerine, onu, 2nci maddesinde « sözleşmeye taraf olan ve askeri açıdan nükleer olmayan Devletlerin her biri, herhangi birinden nükleer silah ya da diğer patlayıcı nükleer aygıtları almamayı ve bu tür silah ve patlayıcı aygıtları üzerinde doğrudan ya da dolaylı olarak denetimi altında bulundurmamayı taahhüt eder » koşulunu içeren ve İtalya tarafından imzalanan ve onaylanan Nükleer Silahların Yayılmasının Önlenmesi Anlaşmasına uymaya zorlamamız gerekiyor. İtalya’nın Nükleer Silahların Yayılmasının Önlenmesi Anlaşmasını ihlal etmeye son vermesini ve ABD’den topraklarımızdaki bütün nükleer silahları derhal geri çekmesini ve buraya, Rusya’ya karşı ABD/NATO’nun mızrak başı yeni B-61-12 bombalarını, ne de başka nükleer silahları yerleştirmemesini talep etmeye zorlamalıyız. İtalyan pilotlarının, ABD komutası altında nükleer silahların kullanımı konusunda eğitim almamalarını talep etmeliyiz.\\nBu, No Guerra, No Nato komitesi ve başka özneler tarafından başlatılan kampanyanın hedefidir. Kampanyanın elde ettiği ilk önemli kazanım, 26 Ekim’de Toskana Bölgesel Konseyinde, Si Toscana a Sinistra (Evet, Toskana sola) grubunun verdiği ve « Nükleer Silahların Yayılmasının Önlenmesi Anlaşmasına uymayı ve ABD’nin derhal her türlü nükleer silahı İtalyan topraklarından geri çekmesi ve yeni B-61-12 bombalarını ve diğer nükleer silahları yerleştirmemesi için gerekeni yapmasını hükümetten talep etmesi için yerel idareyi yetkilendiren » bir önerge kabul edildi. Bu girişimler ve diğerleri aracılığıyla, güçlü bir seferberlikle hükümete Nükleer Silahların Yayılmasının Önlenmesi Anlaşmasına uymasını dayatacak geniş bir cephe oluşturabiliriz.\\nBundan altı ay önce Manifesto sayfalarında, Parlamentoda, Nükleer Silahların Yayılmasının Önlenmesi Anlaşması temelinde, İtalya’dan ABD nükleer silahlarının derhal geri çekilmesini şart koşmaya hazır birisi olup olmadığını soruyorduk. Bu sorunun cevabını hala bekliyoruz.\\nManlio Dinucci Çeviri\\nOsman Soysal\\nKaynak\\nIl Manifesto (İtalya)'"}, "time": 1742564130.300934}