{"duration": 0.13122844696044922, "input_args": {"text": "'In its first new episode under the presidency of Donald J. Trump, “Saturday Night Live” opened with its vision of the most powerful man in the world  —   President Vladimir V. Putin of Russia, smirking and chiding Mr. Trump for early missteps  —   followed by a monologue from the show’s host, Aziz Ansari, who commented on issues of race in   America and implored Mr. Trump to directly address them himself. Airing one day after Mr. Trump’s inauguration, “S. N. L. ,” which the president hosted as a candidate and has regularly attacked on Twitter, did not feature an appearance from its resident Trump impersonator, Alec Baldwin. Instead the show opened with the cast member Beck Bennett playing a   Mr. Putin and boasting of helping to get Mr. Trump elected. “Today many of you are scared and marching in the streets,” the Putin character said. “You are worried that your country is in the hands of this unpredictable man. But don’t worry. It’s not. Relax. I got this. Putey’s going to make everything O. K. ” He added that Russia would take care of America because “it’s the most expensive thing we’ve ever bought. ” Addressing Mr. Trump directly, he said, “You’re not off to a great start, man. I thought you’d be better at this. However, I’m glad to see so many people showed up to your inauguration. ” The screen then showed video of a crowd of demonstrators on Saturday at the Women’s March on Washington, which was then corrected to an image of the more sparsely populated National Mall on Friday during the Trump inaugural festivities. “Today,” the Putin character said, “you went to the C. I. A. and said one million people came to see you in Washington D. C.? If you’re going to lie, don’t make it so obvious. Say you are friends with LeBron James, not that you are LeBron James. ” Mr. Ansari, the Emmy     and star of the Netflix series “Master of None,” and the first performer of South Asian descent to host “S. N. L. ,” picked up on some of these themes in his monologue. “Yesterday, Trump was inaugurated,” Mr. Ansari said. “Today, an entire gender protested against him. ” Urging Americans to treat each other with respect, Mr. Ansari said that Mr. Trump’s victory had nonetheless empowered a “tiny slice of people that have gotten way too fired up. ” “I’m talking about these people that, as soon as Trump won, they’re like, ‘We don’t have to pretend like we’re not racist anymore!’ ” he said. (In doing so, he gave a fist pump that gradually became a Nazi salute.) “No, no,” Mr. Ansari added. “If you’re one of these people, please go back to pretending. ” Mr. Ansari reflected on the ascent of what he called “this new   K. K. K. movement that started  —   this kind of casual white supremacy,” which includes people who tell him to go back to where he came from, but don’t know his heritage. (“They’re not usually geography buffs,” he said.) “My parents moved from India to South Carolina in the early ’80s,” Mr. Ansari said. “They didn’t move until nine years ago. You know where they moved? North Carolina. They love it here. They’re not leaving. ” He continued: “I think Trump should make a speech. A real speech denouncing the   K. K. K. Don’t tweet about me being lame or the show. Write a speech. A real speech. ” Mr. Ansari pointed out that President George W. Bush made a speech after the Sept. 11 attacks in which he said its perpetrators did not represent Islam. “Everyone applauded  —   Democrats, Republicans, didn’t matter,” Mr. Ansari said. “It was not about politics. It was about basic human decency and remembering why the country was founded in the first place. ” He continued: “I was like, what the hell has happened? I’m sitting here wistfully watching old George W. Bush speeches?” In closing, Mr. Ansari acknowledged that many viewers were likely to be fearful of what the next four years held in store. “If you’re excited about Trump, great,” he said. “He’s president. Let’s hope he does a great job. If you’re scared about Trump and you’re very worried, you’re going to be O. K. too. “Because if you look at our country’s history,” he continued, “change doesn’t come from presidents. Change comes from large groups of angry people. And if Day 1 is any indication, you are part of the largest group of angry people I have ever seen. ” Other segments in the show included a musical   of Kellyanne Conway, Mr. Trump’s adviser, where Kate McKinnon played her as Roxie Hart from “Chicago,” and a   to President Obama in which Cecily Strong and Sasheer Zamata serenaded his picture with the title song from “To Sir, With Love. ” Mr. Trump most recently denounced his satirical portrayal on “Saturday Night Live” last week, writing in a tweet: “NBC News is bad but Saturday Night Live is the worst of NBC. Not funny, cast is terrible, always a complete hit job. Really bad television!” Whether he will comment on the show now that he is in the White House remains to be seen as of early Sunday, he had not done so. On Friday, Katie Rich, a writer for “Saturday Night Live,” was widely criticized for a tweet she posted in which she wrote that Mr. Trump’s    son, Barron, would be “this country’s first homeschool shooter. ” Ms. Rich subsequently deleted the tweet and took down her personal Twitter account.'"}, "time": 1742561992.5908706}