{"duration": 0.12763619422912598, "input_args": {"text": "'Pollster and analyst Pat Caddell spoke with Breitbart News Daily SiriusXM host Matt Boyle on Friday about his reaction to Thursday’s testimony by former FBI Director James Comey as well as the media’s reaction. [“I didn’t think it was a great day for the media, said Caddell. “However, if you watched some of the other cable news networks, you’d think this was a disaster for Trump. It was anything but. ” He went on to call out the media for pursuing a political agenda, as opposed to the truth, saying that media today is actually “a danger to democracy. ”  “The media really took it on the nose,” he went on, pointing out that Trump was not lying about the three times he claims Comey told him he personally was not under investigation. “How come that didn’t leak out? That is an interesting question because enough people knew on Capitol Hill, and it tells me that it was the media. And this was really the chilling part, that they have their narrative agenda, that Trump is in collusion, Trump is this, and Trump is that, and he’s under investigation. They did not want to challenge that narrative. ” “They weren’t reporting facts,” continued Caddell. “They were reporting sources who would give them statements that would contribute to their   narrative. This is not a press. This is a propaganda machine. It’s full speed against the president. ” Caddell said he could turn to almost any network and predict its coverage, “If Trump walked on water, they’d say he couldn’t swim. ” “They are so negative, as they were in the campaign,” he went on. “They haven’t let up, and they have invested themselves in a political result, not in telling the truth, and that is a danger to democracy. ” Caddell said the press has damaged the very institution of the press by having decided to bring down a president versus report the truth, and “Democrats are falling right into the path with them. ” As for Trump and Comey, Caddell said, “Comey basically vindicated him, first of all, on the question if there was collusion, or even on the Flynn matter  —   whether there was obstruction, and it just doesn’t hold,” he continued. “Obviously, Mueller wouldn’t let him testify if he thought there was an obstruction case. ” Added Caddell, “Comey’s behavior is just bizarre. This man really believes that he is a demigod when it comes to the law. He keeps changing the goal lines. His weakness, which he confessed to, but I think it was more a device than a critical perception, whether it was with Loretta Lynch, when she asked him to conform to the Clinton campaign, which I thought was a revealing comment and opened up a lot of other doors, when he talked about his own leaking, volunteered how he had leaked and what he had done with those memos, I thought that was just really strange. His criticism of the media, he basically denied their stories. He’s basically a very angry man, and I thought the White House handled Comey terribly, but that’s neither here nor there. ” Caddell stated, “He was the one in the meetings, and he never raised a protest, and then he said a sentence that I was stunned by. He said, ‘I did it because I gave my friend the memo to give to the New York Times because I thought we needed a special counsel.’ Here’s a man who wouldn’t have a special counsel or wouldn’t even investigate the IRS stuff, a person who didn’t do it with Hillary Clinton, particularly in terms of the Clinton Foundation, and yet it was pointed out to him by a couple of the senators, you know, basically he gave her a whitewash. He wants to do this with Trump. I thought that was devastating and puts him in a very precarious place. ” Caddell added, “It chills me to think that this person was running the FBI. ” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742564349.4048393}