{"duration": 0.05336189270019531, "input_args": {"text": "'Senate Minority Leader Charles Schumer ( ) told CNN’s State of the Union on Sunday that he supports a proposal by Sen. Mark Warner ( ) to block the confirmation of the next FBI director until a special prosecutor is named to investigate allegations of collusion between Trump’s 2016 campaign and the Russian government. [“We’ll have to discuss it as a caucus, but I would support that move,” Schumer told host Jake Tapper.  However, under the filibuster rule changes initiated by former Majority Leader Harry Reid ( ) in 2013, the Senate minority cannot actually block the confirmation of any executive branch appointees. Schumer himself seemed to acknowledge the point implicitly: “The key here, of course, is getting some of our Republican colleagues to join us,” he told Tapper. There is almost no Republican support for a special prosecutor  —   largely because there are no crimes yet to prosecute. President Donald Trump is not even under investigation. The FBI’s inquiry has reportedly centered around three Trump campaign aides who played minor roles, and former National Security Adviser Michael Flynn. Even perennial gadfly Sen. John McCain has only called for a select committee, not a special prosecutor. Also, as Breitbart News’ Ken Klukowski has pointed out, Trump was within his legal authority to fire former FBI Director James Comey  —   something Democrats had demanded for months. Moreover, Deputy Attorney General Rod Rosenstein, who was confirmed last month by the Senate in a   vote, is overseeing the Russia investigation, with which Trump has not interfered  —   even if he has objected to the way it is being used by Democrats to justify their 2016 losses and rally political enthusiasm among their frustrated   base. The Trump administration reportedly interviewed eight possible candidates to replace Comey this weekend, and more continue to be proposed. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742563040.3826551}