{"duration": 0.04799604415893555, "input_args": {"text": "'Tweet \\nINDIANAPOLIS, IN – An infectious diseases clinic is thinking outside the box in an effort to promote safe sex practices by passing out free chastity belts to their clinic patients and anyone who strolls into their clinic and simply asks for one. Their slogan is “Chas-T-D, yes… S-T-D, no!” \\n“If there’s one barrier more sturdy than a condom or a diaphragm , it has to be this,” said infectious diseases physician Mark Rappaport. He pulls back his white coat to demonstrate his iron chastity belt, which he’s wearing over his work pants. He knocks his knuckles against it a few times, causing a hard metallic clank to resonate. “Good luck trying to get me infected, STDs.” \\n“Remember that scene in Robin Hood’s Men in Tights where Robin Hood clanks his junk against Princess Marian’s chastity belt?” asked one of Rappaport’s patients Ariana Manning. “Sure, that scene is funny when you watch it, but it really makes you think. So I thought about it and I can’t wait to put this thing on. Safety first, right?” \\nRappaport’s clinic teamed up with local welders to create thousands of sturdy chastity belts. Not only will the clinic offer these chastity belts and STD counseling for free, they will help any patients put their belt on and happily throw away the key to ensure lifelong abstinence. \\n“Urinating and defecating is a bit messy, but you get used to it,” admits Rappaport, blushing a bit. “That’s why I always have some Handi Wipes on me. For the leakage. There’s always some leakage.” He added later: “On the other hand, you never have to worry about any cheap shots to the nuts .” \\nDepending on the success of their program, Rappaport’s clinic may start customizing chastity belts for more widespread dissemination. “People like options, colors,” explained Manning. “If you were to tell me I could get a personalized chastity belt in rose gold so that it matches my iPhone and has my name on it, I’d be in heaven.” 146 Shares '"}, "time": 1742563668.8842058}