{"duration": 0.05522441864013672, "input_args": {"text": "'  Hollywood talent agency   (William Morris Endeavor Entertainment) is forming a federal political action committee and plans to invest a “substantial” amount of money to develop “actionable public policy solutions,” according to a report.[  chief executives Ari Emanuel and Patrick Whitesell reportedly plan to launch the PAC in response to Donald Trump’s election and announced the news in a   email on Tuesday, according to Variety.   “No matter what side of the aisle you sit on or where you live in the world, the call for meaningful and sustained civic engagement is louder than ever,” the memo reads. While it never mentions Trump by name, the memo says the Beverly   company’s PAC will focus on “convening internal and external forums with politicians and allied stakeholders, connecting our clients with elected officials, introducing   matching policies to support donations of time and money, and developing actionable public policy solutions. ” “This company’s greatest asset is the diversity of our backgrounds and beliefs. Please know that we will do everything in our power to support and protect this diversity now and in the months and years ahead,” the email concludes. Emanuel has deep ties to both Republicans and Democrats. He donated to Hillary Clinton’s presidential campaign and his brother, Rahm Emanuel, served as President Barack Obama’s chief of staff and is now the mayor of Chicago. President Trump called Ari Emanuel the “King of Hollywood” during a meeting between the two at his New Jersey golf club two weeks after the election. News of   forming a federal PAC comes on the heels of reports that United Talent Agency, another major talent agency in Hollywood, has canceled its annual Oscar party and will instead host a rally in support of refugees at its Los Angeles office.   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742563667.8246424}