{"duration": 0.055438995361328125, "input_args": {"text": "\"Home / Badge Abuse / Abuse Survivor Speaks Out: “Cops Stood Guard as I was Raped by Politicians as a Child” Abuse Survivor Speaks Out: “Cops Stood Guard as I was Raped by Politicians as a Child” Matt Agorist May 26, 2015 143 Comments \\nStaffordshire, Eng — An abuse survivor has bravely broken her silence to tell her horrific childhood story. In an interview with Sky News, Esther Baker, 32, explained how she and other children were raped by politicians as uniformed police officers stood guard. \\n“I got the feeling very much that they were protecting somebody, that they were with one of the men,” said Baker. \\n“One of them (police officers) I knew from church. There were a few occasions where they would be in uniform, and I kind of knew, I learnt that when they were in uniform that it was going to be a rough night,” she explained. “On occasion they would – they would sort of join in.” \\nDuring one of the incidents, Baker recalls that she was able to run away, only to be chased down and caught by a police officer. Apparently the police officer was apologetic as he carried her back to the rapist politicians. He must have “just been doing his job.” \\n“There was one that I can remember, one of the times I tried to run away and tried to get away from them and he came after me, caught up with me and he was carrying me back to where the rest of them were and he said he was sorry,” she said. \\nBaker explained how she and other children around the age of 6 were often brought to various properties and given alcohol and then raped by judges and lords. \\nThis poor young girl thought the rape was normal. Since everyone called these men “lords,” she thought they were doing God’s work. \\n“I don’t quite know how to explain. I was brought up in a religious household and one thing that kept me so sure that what they were doing was right was that there were references to people, Lords and a judge,” she said. “I picked up on those names because I thought one of them must have been God because one of them was ‘Our Lord.'” \\n“I just thought that they were on God’s authority.” \\nNow that Baker has courageously come forward, despite the deadly threats she received and the police being involved, authorities are claiming that they will investigate her claims thoroughly. \\n“I always swore I would never go near the police again – never. I was scared because it feels like, yeah, they are going to know I have said something so the only way I can now protect myself is now to tell,” Baker said. “I just hope others will do the same. That is the only way we are going to be safe.” \\nSadly Baker’s story is not an isolated one. \\nJessa Dillow-Crisp recently testified at the Colorado State Capitol, during Human Trafficking Awareness and Advocacy Day, about the horrible experiences that she had in her past. \\nShe was unable to report the abuse or go to the police because there were a number of police officers who were involved in her kidnapping and abuse. \\n“There was gang raping, the police officer who handcuffed me and raped me, told me I would be put in jail if I opened my voice, ” she said. Share\""}, "time": 1742628412.5596921}