{"duration": 0.1752164363861084, "input_args": {"text": "'VATICAN CITY  —   The Roman Catholic Church will allow priests throughout the world to grant absolution for abortion, the Vatican said on Monday, making permanent a policy that Pope Francis announced a year ago. In a document marking the conclusion of the church’s yearlong  Jubilee of Mercy, the pope extended a policy of allowing priests  —   and not only bishops or special confessors  —   to grant forgiveness for abortion, which the church considers a sin. The announcement was a signal of the pope’s vision of a more welcoming, merciful and inclusive church. While firmly restating his opposition to abortion as “a grave sin, since it puts an end to an innocent life,” the pope affirmed that “there is no sin that God’s mercy cannot reach and wipe away when it finds a repentant heart seeking to be reconciled with the Father. ” The document, an apostolic letter, was signed on Sunday after a Mass denoting the end of the jubilee year. It was made public on Monday. Pope Francis’ decision last year, at the start of the jubilee, followed in the footsteps of Pope John Paul II, who granted priests the same right during the previous holy year, in 2000. Under canon law, abortion brings automatic excommunication unless the person receiving or performing it confesses and receives absolution. Abortion is considered a “reserved sin,” meaning that permission to grant forgiveness usually must come from a bishop. Bishops could already delegate the authority to grant absolution to parish priests  —   and many bishops in the United States had done so  —   but the practice varied widely by country and even by diocese. In parts of the world, observant Catholics who have sought absolution for abortions have faced delays at times, or even rejection. In some places, priests have been delegated the power to absolve abortions during certain times of year, like Lent, Archbishop Rino Fisichella, the president of the Pontifical Council for Promoting New Evangelization, said at a news conference at the Vatican on Monday. “Now that right is extended to all priests,” he said, noting that changes would have to be made to canon law to reflect the new practice. The decision underscores the pope’s idea of a church that leaves nobody outside its doors, and the apostolic letter calls on the clergy and the world’s 1. 2 billion Catholics to reflect, and to act, upon the message at the heart of the yearlong meditation on mercy. In the document, a blend of religious teachings and acute social commentary, “Pope Francis delineates the path of the future life of the church so that it can always be an instrument of mercy toward everyone, without ever excluding anyone,” Archbishop Fisichella said. The archbishop said that the apostolic letter offered guidelines to priests who were called on to exercise forgiveness, referring to an April proclamation on family life that, among other things, created a path for divorced and remarried Catholics to receive holy communion. Francis’ letter also noted that the church would celebrate a World Day of the Poor every November “to help communities and each of the baptized to reflect on how poverty is at the very heart of the Gospel. ” He also called on the faithful to “promote a culture of mercy based on the rediscovery of encounter with others, a culture in which no one looks at another with indifference or turns away from the suffering of our brothers and sisters. ” At a ceremony naming 17 new cardinals on Saturday, the pope warned against what he described as a “virus of polarization and animosity. ” He said that “in God’s heart there are no enemies,” and chided those who “raise walls, build barriers and label people. ” The comments were seen by some Vatican observers as a rebuke to calls by   Donald J. Trump to build a border wall and to restrict Muslims from entering the United States. Pope Francis did not single out any country, but he has expressed dismay over the harsh tone on immigration that Mr. Trump has taken. In February, the pope suggested that Mr. Trump was “not Christian” because of the campaign promise to build a wall on the United   border. (Mr. Trump, who is not Catholic, called the pope’s admonishments “disgraceful. ”) The pope on Saturday denounced the tendency to treat “a stranger, an immigrant or a refugee” as the enemy, warning that such thinking invited hatred. “Little by little, our differences turn into symptoms of hostility, threats and violence,” he said. Harassment and violence against immigrants and other marginalized groups surged after Election Day in the United States, according to the Southern Poverty Law Center, which tracks hate crimes and domestic extremist groups.'"}, "time": 1742564023.8647566}