{"duration": 0.08725309371948242, "input_args": {"text": "'Philippine’s Duterte Seeks Peace November 25, 2016 \\nExclusive: Filipino President Duterte oversaw a brutal anti-drug campaign but is now seeking peace with leftist revolutionaries and rejecting U.S. pressure for more counterinsurgency warfare, writes Marjorie Cohn. \\nBy Marjorie Cohn \\nIn April 2016, Rodrigo Duterte won the Philippine presidential election by a landslide, with more than 6 million votes. He openly declared that he was the nation’s first Left president, calling himself a socialist but not a communist. So far, his regime has been controversial, to put it mildly. \\nThe U.S. press has focused on Duterte’s vicious war on drugs that claimed upwards of 2,000 lives and led to the incarceration of tens of thousands of people. His decision to allow former Filipino dictator Ferdinand Marcos’s burial in the National Cemetery of the Heroes also has drawn the ire of those who recall Marcos’s brutal two-decade regime that killed more than 3,000, tortured tens of thousands, and stole $10 billion from the Philippines. Philippine President Rodrigo Duterte (Photo credit: rodrigo-duterte.com) \\nBut, significantly, Duterte is engaging with revolutionary forces in the peace process that aims to end 47 years of armed struggle against the repressive Filipino government. And Duterte has taken actions that, for the first time, challenge the longstanding military and economic power of the United States in the Philippines. \\nPeace Process With Opposition \\nSince 1969, a civil war has been raging in the Philippines. The roots of the armed conflict can be traced to the colonial and neocolonial domination of the Philippines by the Spanish, then U.S. imperialism, feudal exploitation by big landlords and capitalist interests, as well as widespread bureaucratic corruption. After Duterte’s election, he cited peace as a top priority of his administration, vowing to engage in peace negotiations with the National Democratic Front of the Philippines (NDFP). \\nAccording to JustPeacePH, an international platform that supports the Philippine peace process and takes its name from its Internet site, “justpeace.ph,” “The daily, systematic and systemic injustice experienced by the people drive them to desire and seek fundamental changes in society through various means. But because the forces against fundamental social change use all means including the instruments and violence of the state to defend the status quo, many Filipinos over many generations have embraced armed struggle to overthrow the ruling system.” \\nThe NDFP “is the alliance of progressive forces seeking to bring about fundamental change in the existing social system in the Philippines through armed revolution,” JustPeacePH states in its Primer on Just and Lasting Peace in the Philippines. The NDFP alliance includes trade unions, peasants, youth, women, national minorities, teachers, health workers, religious clergy, the Communist Party of the Philippines (CPP), and the New People’s Army. \\nDuterte’s Peace Initiative \\nTwo rounds of peace negotiations have already occurred since Duterte took office, with a third scheduled for January 2017 in Oslo, Norway. \\nIn May, Duterte declared he would release all political prisoners, which number more than 400, through a presidential declaration of amnesty, provided both houses of congress approve. Nineteen NDFP consultants, who have been involved in the revolutionary movement for years, have already been released. \\nDuterte offered four cabinet positions to the CCP, but they declined, stating there must first be a comprehensive peace agreement. The CCP, however, recommended a veteran peasant leader who was appointed Secretary of Agrarian Reform and a veteran academic activist leader who was named secretary of social welfare and development. \\n“These are major appointments,” Luis Jalandoni, NDFP’s Senior Adviser on the Peace Negotiating Panel, told me at a recent conference of the International Association of Democratic Lawyers in Lisbon, Portugal. \\nNDFP has a people’s army and organs of political power with mass organizations in 71 out of the 81 provinces in the country, Jalandoni said. He noted that landlessness and poverty afflict the 100 million people in the Philippines. \\n“The NDFP insists on addressing the roots of the armed conflict in order to achieve a just and lasting peace,” Jalandoni said. \\nThe demands in the peace talks are: Release of all political prisoners; Land reform for the peasantry (70% of the population); National industrialization to develop the economy using available human and natural resources; Protect the environment and ancestral lands of the indigenous peoples; and Philippine national sovereignty and abrogation of all unequal treaties with the United States. \\nChallenging U.S. Power \\nU.S. domination and interference in the Philippines date back to 1898, when the United States annexed the Philippines. The U.S. continued to exercise colonial rule over the country until 1946, when the Philippines gained its independence although the United States retained many military installations there and the Filipino economy maintained its dependence on the U.S. President George W. Bush, seen announcing the start of his invasion of Iraq on March 19, 2003, included the Philippines in his “global war on terror.” \\nWith U.S. assistance, Marcos ruled the Philippines with an iron fist from 1965 through 1986, under martial law from 1972 to 1981. In 2002, the Gloria Macapagal-Arroyo government developed Oplan Bayanihan, a counterinsurgency program modeled on U.S. strategies. After 9/11, the Bush administration gave Arroyo $100 million to fund that campaign in the Philippines. \\nOplan Bayanihan led to large numbers of extrajudicial killings, forced disappearances, torture and cruel treatment. Many civilians, including children, have been killed. Philippine military and paramilitary death squads murdered hundreds of members of progressive organizations. Communities and leaders opposed to large-scale and invasive mining have been targeted. Even ordinary people with no political affiliation have not escaped the government’s reign of terror. \\nFrom 2001 to 2010, the U.S. government provided more than $507 in military assistance to the Philippine government, facilitating tremendous repression. \\nBetween 2010 and 2015, the Philippine police, military and paramilitary forces perpetrated extrajudicial killings, forced disappearances, torture, illegal arrests and forced evacuation, many to enable extraction by mining companies. \\nThe 2014 Enhanced Defense Cooperation Agreement, which President Barack Obama negotiated with Duterte’s predecessor, gave U.S. troops the right to prolonged deployment in the Philippines. The agreement is widely seen in the Philippines as a threat to the country’s sovereignty. \\nIn September 2016, Duterte declared, “I am not a fan of the Americans … Filipinos should be first before everybody else.” He added, “In our relations to the world, the Philippines will pursue an independent foreign policy. I repeat: The Philippines will pursue an independent foreign policy.” \\nThe United States has not apologized for all the atrocities it committed against the Filipino people, Duterte said. Responding to U.S. criticism of the Philippines for its human rights violations, he stated, “Why are you Americans killing the black people there, shooting them down when they are already on the ground.” \\nDuterte promised to end joint military maneuvers with U.S. forces and expel the hundreds of U.S. troops currently stationed in the Philippines. He also expressed his intention to end bilateral agreements concluded by his predecessor with the United States and reverse permission for the United States’ use of five Philippine military bases. \\n“I will break up with America,” Duterte said. “I would rather go to Russia and to China.” He vowed to rescind joint patrols with U.S. and Filipino forces against Chinese expansion in the disputed South China Sea. Indeed, Duterte recently traveled to China and secured valuable fishing rights for Filipinos in the South China Sea. \\nHope for Peace Prospects \\nIn an unprecedented development, both the government and the opposition declared unilateral ceasefires in August. But there are still problems with the government’s ceasefire, says Jalandoni, as Duterte doesn’t have full control of the military. The military and paramilitary forces, which are protected by the military, have engaged in several violations that imperil the ceasefire, he said. \\n“There is high optimism that the peace talks will prosper under the presidency of Duterte,” according to JustPeacePH. “Unlike past presidents who harbor strong anti-communist bias, Duterte seems capable of rethinking the government’s peace strategy since he claims to be a socialist.” \\nOpposition forces are not uncritical of the excesses in Duterte’s war on drugs. The CCP declared the campaign is becoming anti-people and anti-democratic. Due process must be respected, human rights must be upheld; the drug users and small drug dealers, who come from poverty, require rehabilitation and care, the CCP maintains. \\n“Understandably, Duterte’s war on drugs and other crimes is given more coverage by the global media,” JustPeacePH wrote in its primer. “But Duterte’s aim to establish a lasting peace in the provinces deserves even more attention as this strikes at the root causes of the problem of illegal drugs and related crimes.” \\nJalandoni said, “Duterte is not a saint but he stands for an independent foreign policy. His stand against the United States is respected and has received a lot of support.” \\nThe NDFP, Jalandoni noted, says that “if there are threats against Duterte by U.S. imperialism, the Left will be a reliable ally to him,” adding, “He is the first president to stand up to the United States.” \\nMarjorie Cohn is professor emerita at Thomas Jefferson School of Law, former president of the National Lawyers Guild, and deputy secretary general of the International Association of Democratic Lawyers. She is a member of the International Legal Assistance Team that advises the National Democratic Front of the Philippines on human rights and humanitarian law in their peace negotiations. Her most recent book is Drones and Targeted Killing: Legal, Moral, and Geopolitical Issues. Visit her website at http://marjoriecohn.com/ and follow her on Twitter @marjoriecohn.'"}, "time": 1742628505.938413}