{"duration": 0.18043756484985352, "input_args": {"text": "'. 22 Signs That You Are Embodying Your Higher Self The Higher Self is the blissful superconscious, higher mind part of ourselves that is the expression... Print Email http://humansarefree.com/2016/11/22-signs-that-you-are-embodying-your.html The Higher Self is the blissful superconscious, higher mind part of ourselves that is the expression of Divine Love, spiritual wisdom, and creative power. During spiritual awakening , our personal consciousness grows to become aware of the greater parts of ourselves. We may feel energies, intuition and even psychic knowledge. We raise our energy vibration and spiritually purify ourselves to embody more of our Higher Self – the eternal Soul aspect of our being. Full spiritual realization and enlightenment occurs when we attain the conscious experience of blissful union with the Source of Life and all of creation. Everything is One and we are home! 1. Higher Sensory Perception Your intuition is developing at a rapid rate. Other higher senses like clairvoyance and clairaudience can also be turned on. These higher senses allow you to access information and wisdom that otherwise would be unavailable through the use of your rational mind. Harmonious lucid dreaming and out of body experiences are also ways to access higher dimensional information. 2. Knowing Your Soul Purpose With your higher senses turned on, it has become crystal clear what your Soul’s Purpose is. Not only you know what your mission here on earth is but you are fulfilling this mission by taking action and walking your path. Your are fulfilling your basic human needs of self-growth and contribution by being on the path of eternal self actualization and being at the service of others. 3. Meeting Your Soul Family Your frequency has attracted you to people with whom you resonate at a soul level. When you met these individuals you felt a strong and undeniable connection with them, like if you had met them before (from a past life). Even if they live on the other side of the world, the spiritual ties between you are so strong that years can go by and when you meet again is like no time has passed. 4. Meeting Your Twin Flame or Soul Mate You are in a relationship with a person that highlights and enhances your best qualities. As well, this person will mirror back to you everything you need to work on yourself. This relationship thrives on self-growth, contribution, higher giving love and fulfillment. A necessary step for the manifestation of this relationship is cutting cords of attachments and karmic ties with previous relationships. 5. Synchronicities and Accelerated Manifestations Your connection with the universe and life is evident. Your questions are answered through synchronicities and hidden messages are easily revealed to you by the power of your higher senses . You find messages and answers in books, nature and even random conversations. As well, you become aware of how strong and powerful your intent has become. Whatever you focus on manifests at a much faster than ever before. 6. Taking Responsibility For Your Happiness As you embody your Higher Self you realize how powerful you are and how you co-create reality through your thoughts and emotions . You take full responsibility for your own happiness and you stop blaming other people, the government or any other outside sources. Victimization is a thing of the past and you take full charge of your healing and evolutionary process. 7. Embracing All Emotions You have finally transcended the spiritual bypass that some emotions are ‘bad’ or ‘negative’. Instead you embrace all e-motions and instead of repressing them you allow them to flow through you. You can use anger for passion or motivation. You can easily empathize with others while maintaining the integrity of your field. 8. Holographic Nature of Reality Like Rumi said ‘You are not a drop of water in an ocean, you are the entire ocean in a drop of water.’ The holographic nature of reality is encoded within you and you can sense the interconnectedness of everything. It is obvious to you that we live in a multidimensional matrix and that you have a multidimensional anatomy. You also feel very attracted to sacred geometry. 9. Alchemical and Healing Powers Whether it’s hands on healing, soul retrieval or any other type of healing modality you have learned how to direct your intent and manipulate energy to remove energetic blockages. You can easily connect to your Higher Self and disengage discordant energies that hinder your spiritual evolution. Often you will assist others in their healing and ascension process with your siddhis. 10. Activating Your DNA DNA activation is the process of accreting more light into your morphogenetic field by activating the dormant strands of DNA that correspond to your Higher Self. You have at least a 12 strand DNA template that allows 12 dimensions of consciousness. DNA activation is the key to spiritual ascension and the embodiment of your Higher Self. It’s quite common for a person who goes through DNA activation to progressively experience all the other signs mentioned in this page. 11. Unconditional Self-Love Your 4th strand of DNA corresponds to your heart chakra. One of the main benefits of DNA activation is being able to access and embody a state of unconditional self-love. No longer do you feel the need to extract love from other people, instead you see yourself as an infinite source of love. A sense of wholeness begins to unfold as you love ALL aspects of yourself, including your shadow self. 12. Integrating and Transcending Your Shadow Self Your shadow self is the part of you that is running in reverse. It is mainly made up of archetypes, personas and complexes. Some examples are the Professional Victim Persona, the Rescuer Archetype, the Sorcerer, The Tyrant and the Absolute Perfectionist. The shadow self is what causes self-sabotage and causes you to create chaos in your life. The shadow self is created by making decisions that are not aligned with your Higher Self and manifest as reverse codes in your DNA. 13. Frequency Resonance As you continue to raise your frequency you notice how some people begin to fall out of your holographic reality . You understand that your frequencies no longer match. The same can happen with your job or even your country of origin. In turn your higher frequency attracts you to a new grid of people, places, times, things and events that are in line with your Higher Self. 14. Honest Yes and Honest No You are not afraid of saying ‘no’ to other people when you inner guidance tells you not to do something or go somewhere. You are not afraid of other people’s reactions and you are true to yourself. Every time you are congruent with what you want and what you don’t want you feel more powerful. As well you embrace the art of an honest ‘yes’ when the universe delivers what you desire. You don’t try to appear ‘humble’ or ‘spiritual’ by rejecting what you truly desire in your life. 15. Harmonious Family Relationships ‘If you think you are enlightened, go spend a weekend with your family.’ Ram Dass You have realized that enlightenment doesn’t happen in a cave. You have cleared the cords of attachments and karmic ties with your family. Gone are the days where you kept experiencing the same old family drama. Your family members have shifted their approach to connect with you to higher ways and you accept/love them just how they are. 16. No Guilt, No Shame Shame and guilt are the two lowest frequency energetic blockages in humanity. In order to embody your Higher Self you have let go of the identification with shame and guilt. You have cleared the guilt and shame you inherited from your parents through the DNA and you have released the shame and guilt that has been implanted by society and religions. Instead you choose to embrace the states of joy and bliss. You have become immune to guilt manipulating strategies often used by victims. 17. Making Decision In Line With Your Higher Self Instead of making decisions based on fear, righteousness, competition or lack you are making decisions in line with your Higher Self and ultimately with Source-will. You are aware of Source’s intentions: the Law of One, Unconditional Love, Cooperation, Evolution, Perpetual Motion, Cause and Effect, Non-Judgment and Free-will. Even though we all have free-will and can ultimately go against Source-will (you’re unconditionally loved), you’re aware that making such decisions will trigger the Law of Cause and Effect and create a karmic imprint to re-mind you must heal that karmic miasm at some point. 18. Inner and Outer Abundance Lack and limitation are a thing of the past. You have embodied a state of absolute inner abundance that is being reflected onto your holographic reality. You no longer seek to extract love, approval and appreciation from other people, you are the source. Happiness is within you. As well you have transcended the spiritual bypass that money is ‘evil’ and you know that money is just energy, made up of consciousness just like everything else. You enjoy financial abundance and use this abundance to create a more harmonious reality for yourself and others. 19. Mind Unplugged From the Matrix One sign that your mind has been unplugged from the matrix is that you can clearly see the hidden agenda of those who desire to control this planet. You no longer resonate with the news and their ‘official story’. You inner truth detector can sense when someone is lying and you have become immune to the low frequency strategies and implants that constantly try to tell you ‘you are not enough’. Mindless consumerism and the herd mentality seem absurd to you. 20. Bye-Bye Idolatry As you awaken to your co-creative powers and God-like nature, you no longer put other people on a pedestal. Your inner guru precedes any external guru and you see teachers as a reflection of your own unlimited potential. The forces of your worthiness and deservedness drive you to achieve whatever you set your mind upon. You have become the master of your own reality . 21. Overflowing with Gratitude Gratitude is your attitude. Gratitude is your prayer . The sense of lack has become foreign to you, instead you cannot stop counting your blessings. The feeling of gratitude multiplies whatever you have and brings you even more positive experiences. You are even grateful for the challenges and setbacks that are inevitable in life, you can’t help to see them as opportunities for growth. And you probably have a gratitude journal. 22. Don’t Take Yourself Too Seriously Life is meant to be fun, you know that. Being extremely rigid and disciplined suck the fun out of everything. Even though you are adamant when it comes to working on yourself and achieving self mastery, you always allow yourself to make mistakes. In fact making mistakes is part of the learning process. You have a great sense of humor and you don’t take yourself too seriously. Your inner child is thriving and you often feel energized, inspired and overflowing with creativity. Gustavo Castaner is the founder of AscendedRelationships.com and In-Light-Ment.com . Gustavo specializes in helping people change their frequency so they can embody their Higher Self and manifest higher vibrational relationships. Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related'"}, "time": 1742564102.999417}