{"duration": 0.03139042854309082, "input_args": {"text": "'The marching band of Talladega College, Alabama’s oldest private historically black college, is set to perform at   Donald Trump’s inauguration, causing outrage and backlash from some of the school’s former students. [“We were a bit horrified to hear of the invitation,” Talladega alumni Shirley Ferrill told the Associated Press. “I don’t want my alma mater to give the appearance of supporting him. Ignore, decline or whatever, but please don’t send our band out in our name to do that. ”  The Presidential Inaugural Committee announced the news Friday that some 40 groups, including high school bands and military organizations, were accepted to perform in the inaugural parade. Talladega College Marching Tornadoes’ decision to perform at the prestigious event quickly consumed the college’s social media sites. “The news that Talladega College has forgotten its steady and proud 150 years of history, by making the decision to not stand in solidarity with other   and courageous people, academic institutions, and organizations, protesting the inauguration of one of the most antagonistic,   unrepentant racists, has simply and unequivocally broken my heart today,” wrote Nikky Finney, a 1979 graduate of Talladega, who’s now chair of creative writing and southern studies at the University of South Carolina. “This should have been a teachable moment for the President of Talladega College instead it has become a moment of divisiveness and shame,” Finney wrote. There were some who applauded Talladega’s decision. “It’s a Presidential Inauguration, a high profile event. It’s a great experience for the band,” one user wrote on the popular marching band online message board bandhead. org. “Some of you have got this all wrong,” another user wrote. “You all were wrong about the Presidential Election and you are wrong about Talladega. This is great news for Talladega College and the Marching Tornadoes. This will open up the door for the band and College to make a remarkable rise. ” Talladega College, which was founded by descendants of slaves in 1867, is set to make the   trip to the nation’s capital for the January 20 event. Talladega’s acceptance is also noteworthy considering  . C.  Howard University, another historically black college, declined to sign up to participate in the inaugural parade. Howard’s band director, John Newson, cited budgetary concerns among the reasons the band declined to perform. Trump’s inauguration has been a lighting rod in recent weeks with threats of boycott being leveled against   opera singer Andrea Bocelli and a petition calling for the Mormon Tabernacle Choir to back out of the inauguration gathering several thousand signatures. The Mormon Tabernacle Choir and the Radio City Rockettes will perform at the inauguration, while teenage opera singer Jackie Evancho will sing the National Anthem.   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742628478.5187593}