{"duration": 0.2942624092102051, "input_args": {"text": "'BAYONNE, N. J.  —   Nicole Adamczyk’s drinking water used to slosh through a snarl of pipes dating from the Coolidge administration  —   a rusty, rickety symbol of the nation’s failing infrastructure. So, in 2012, this   port city cut a deal with a Wall Street investment firm to manage its municipal waterworks. Four years later, many of those crusty brown pipes have been replaced by shiny   ones, reflecting a broader infrastructure overhaul in Bayonne. But Ms. Adamczyk’s water and sewer bill has jumped so much that she is thinking about moving out of town. “My reaction was, ‘Oh, so I guess I’m screwed now? ’” said Ms. Adamczyk, an accountant and mother of two who received a quarterly bill for almost $500 this year. She’s not alone: Another resident’s bill jumped 5 percent, despite the household’s having used 11 percent less water. Even as Wall Street deals like the one with Bayonne help financially desperate municipalities to make   repairs, they can come with a hefty price tag  —   not just to pay for new pipes, but also to help the investors earn a nice return, a New York Times analysis has found. Often, these contracts guarantee a specific amount of revenue, The Times found, which can send water bills soaring. Water rates in Bayonne have risen nearly 28 percent since Kohlberg Kravis Roberts  —   one of Wall Street’s most storied private equity firms  —   teamed up with another company to manage the city’s water system, the Times analysis shows. City officials also promised residents a   rate freeze that never materialized. In one measure of residents’ distress, people are falling so far behind on their bills that the city is placing more liens against their homes, which can eventually lead to foreclosures. In the typical private equity water deal, higher rates help the firms earn returns of anywhere from 8 to 18 percent, more than what a regular   water company may expect. And to accelerate their returns, two of the firms have applied a common strategy from the private equity playbook: quickly flipping their investment to another firm. This includes K. K. R. which is said to be shopping its 90 percent stake in the Bayonne venture, a partnership with the water company Suez. Rich Henning, a Suez spokesman, said that “Bayonne had chronically underinvested in their water and sewer infrastructure, which has certainly contributed to rate increases during the past few years. ” He added, “We understand that these increases create stresses for ratepayers. ”   Donald J. Trump has made the privatization of public works a centerpiece of his strategy to rebuild America’s airports, bridges, tunnels and roads. Members of his inner circle have sketched out a vision, including billions of dollars of tax credits for private investors willing to tackle big infrastructure projects. And Mr. Trump himself promised in his victory speech “to rebuild our infrastructure, which will become, by the way, second to none. ” Private equity firms like K. K. R. have already presented themselves as a willing partner, and Bayonne provides an important case study. Its arrangement is one of a handful of deals across the country in the last few years in which private equity firms have managed public water systems. While these deals are a small corner of private equity’s sprawling interests, they represent the leading edge of the industry’s profound expansion into public services. For residents, the financial   from these water deals can be painful. The Times analyzed three deals in which private equity firms have recently run a community’s water or sewer services through a   contract. In all three places  —   Bayonne, and two cities in California, Rialto and Santa Paula  —   rates rose more quickly than in comparable towns, which included both publicly and privately run water systems. In Santa Paula, where Alinda Capital Partners controlled the sewer plant, the city more than doubled the rates. A fourth municipality, Middletown, Pa. raised its rates before striking a deal. Now, some of these cities are trying to take back their water. Missoula, Mont. wrested away its water system, which had been owned by the Carlyle Group. Apple Valley, Calif. whose waterworks were also owned by Carlyle, has filed a similar lawsuit. Santa Paula bought its sewer plant from Alinda last year. Of course, there’s a reason many communities look for private partners to begin with: Their water systems are in poor shape. Budget shortfalls and political mismanagement can represent a real threat to both infrastructure and citizens. For evidence, look no further than the crisis in Flint, Mich. where the drinking water became tainted with lead. “Keeping rates down may sound like the ultimate righteous good for ratepayers, but the truth is, not if you’re failing to provide basic care and maintenance,” said Megan Matson, a partner at Table Rock Capital, the boutique private equity firm that invested in Rialto’s water and sewer system. She added that it helps for deals to “provide more obvious public benefits,” noting that her firm partnered with Ullico, the nation’s only   insurance and investment company. Proponents of the   partnerships, citing recent studies in Canada and Europe, argue that private businesses operate more efficiently than governments do and that this translates into cost savings for citizens. And private equity firms, lacking technical expertise in how to manage infrastructure, often team up with private water companies. Supporters also say that the deals require private equity to spend millions of dollars a year to fix things (money that towns may not spend on their own) and that the firms sometimes pay towns millions more up front. Bayonne, for instance, got $150 million up front from K. K. R. ’s team, which the city used to pay off a pile of debt. In a statement, a K. K. R. spokeswoman said, “Our partnership has provided Bayonne residents with better service, modernized technology to detect leaks and conserve water, improved infrastructure and safer conditions for workers  —   all without a tax increase or public expenditure. ” In Bayonne, a city of about 65, 000 on a peninsula in the shadow of the fallen twin towers, a crucial test for its private equity deal came in July 2012. By then, Bayonne had already spent nearly a year haggling with some of K. K. R. ’s top negotiators. Next, city officials presented the deal to a more skeptical crowd: their own residents. Bayonne’s sales pitch to its citizens illustrates the bold steps town officials can take  —   including making promises that are at odds with the actual terms of the deal  —   to attract private equity money. Private equity, in turn, can earn significant returns. At a public meeting in city hall, a lawyer for the city promised that, after an initial rate bump, there would be “a rate freeze for four years,” according to a meeting transcript. Bayonne’s mayor, Mark Smith, later reiterated the   freeze in a magazine article. That promise turned out to be fleeting. The contract allowed additional rate increases after only two years. There was no   freeze. In fact, rates rose even more than the Bayonne contract predicted  —   in part because K. K. R’s team had to make unexpected infrastructure upgrades, but also because residents were using less water than expected. The contract guarantees revenue to the team  —   more than half a billion dollars over 40 years  —   so water rates have jumped, in part, to make up the difference. The city said it saw the revenue requirement as a way for K. K. R. ’s team to earn steady returns, but not a windfall. But the Times analysis showed that Bayonne’s water rates grew almost 28 percent under the deal, growth that far exceeded that of three other municipalities to which Bayonne has compared itself. (Daniel Van Abs, an associate professor at Rutgers University who specializes in water management, said that a true    comparison of water rates in different towns was “extremely difficult” because of the different factors that can influence rates, including the size of the utility, the municipality’s population, droughts and infrastructure investment  —   or lack thereof. The Times analysis for Bayonne did not include sewer rates.) Former Bayonne officials who had promised the   rate freeze said in interviews that they had not meant to mislead residents. They said they had earmarked some of the K. K. R. team’s $150 million   payment to offset rate increases in the contract’s early years. But then voters ousted Mayor Smith. And once he left office, the new administration put that money elsewhere. “I think we could have accomplished that   minimum,” the former mayor said in an interview. The town’s water rates, he said, are now “exorbitant. ” Tim Boyle, who took over Bayonne’s utilities authority after Mr. Smith was voted out of office, said that various regulations required the city to use that money for property tax relief rather than to stabilize rates. He also blamed the previous administration for guaranteeing too much revenue to K. K. R. ’s team in the early part of the deal, calling those figures “wildly optimistic. ” Bayonne officials also stress the deal’s benefits, including the   payment that let Bayonne pay off more than $100 million in old debts. Within three months, Moody’s Investor Service revised the city’s debt outlook from “negative” to “stable” for the first time in five years, and it has since upgraded the city’s credit rating. K. K. R. ’s team contributes about $2. 5 million annually to pay for repairs to water infrastructure, plus $500, 000 to the city itself. K. K. R. and Suez said they have upgraded their safety equipment and replaced inoperable hydrants around town. They also installed sophisticated water meters that can detect leaks in people’s homes, and sent nearly 2, 000 letters to customers warning when such leaks occurred. As such, use has declined, according to Mr. Henning, who said Suez had received “many notes of thanks” for the warnings. But   meters could lead to higher bills for some residents whose water use wasn’t fully captured in the past. When negotiating the deal, K. K. R. called this process “meter uplift,” according to emails obtained through records requests. “We gave away too much,” said Gary La Pelusa Sr. a city councilman and former commissioner of Bayonne’s utilities authority, which approved the deal over his objections. Bayonne originally promised residents that the city’s utilities authority would oversee K. K. R. and Suez. But the City Council recently decided to shutter the agency and handle the oversight itself. Stephen Gallo, who headed that authority when the deal was struck, still believes that it benefits Bayonne. “But you’ve got to watch them, you’ve got to keep an eye on things,” he said. “I don’t know who’s doing that now. ” In interviews with The Times, more than a dozen Bayonne residents, including Ms. Adamczyk, expressed dismay over the rate increases. One reason is that people who fall behind on payments face   risks: Unpaid water and sewer bills can be sold to investors who try to collect on that debt, a common practice across the country. Failure to pay can ultimately lead to foreclosure. In 2012, the year Bayonne struck its deal, water bill delinquencies led to 200 government liens against local properties, tax records show. That figure more than tripled the next year, the first full year under K. K. R. ’s team. In 2015, the most recent year with data available, the number remained elevated, at 465. The city publishes its lien notices in the local newspaper and residents receive mailed delinquency letters. Still, when a reporter asked one Bayonne resident, Carlos Jimenez, about a water and sewer bill lien that had been listed against his property, he expressed surprise, saying he wasn’t aware of it. “I didn’t know this could happen,” Mr. Jimenez said. “It’s a different ballgame. ” One of the few things Republicans and Democrats can agree on is that the nation faces an infrastructure crisis. In water infrastructure alone, the nation needs about $600 billion over the next 20 years, according to federal estimates. And yet federal spending on water utilities has declined, prompting state and federal officials to try to play matchmaker, courting private investors to fix what needs fixing. For years, the Obama administration has been cheerleading   partnerships. In a statement, the White House said it backed them “when they are well structured, include strong labor standards, and when there is confidence that taxpayers are getting a good deal. ” During the presidential campaign, Mr. Trump’s team outlined a new plan to incentivize private investors to take on large infrastructure projects. Wall Street has responded to the call to action. There are now 84 active financial infrastructure funds, according to Pitchbook, a private financial data platform, up 25 percent in just three years. Some belong to big banks like Goldman Sachs, but many are run by private equity firms. “Across our country, we need solutions for infrastructure deficiencies,” said James Maloney, a spokesman for the American Investment Council, the private equity trade group. “Private equity serves as one of these solutions. ” Some critics are wary of expanding private investment in public infrastructure. Although cities may get cash up front in these deals, “there is no ‘free’ money” in   partnerships, says a 2008 Government Accountability Office report. Using roads as an example, the report observed “it is likely” that tolls will increase more on a privately operated highway than one run by the government. Ms. Matson, of Table Rock, who has attended White House meetings on infrastructure, has tried to dispel concerns about these deals. Table Rock is part of a team that finances and manages the water system in Rialto, Calif. a deal that provided the city about $41 million to improve the water and wastewater infrastructure, she said. Rialto residents have seen their water rates increase about 68 percent since the deal, according to the Times analysis, more than any other comparable city. But Table Rock said rates were artificially low after the city had declined to raise them for about a decade, giving it the lowest rates among those towns. And unlike in most other deals, Rialto residents had a say in the increases and ultimately approved them in a public vote, as required under state law. This year’s rate increase was delayed. When the deal closed in 2012, all the public water utility employees kept their jobs. Everyone has since received raises. And Table Rock, like its partner Ullico, has committed to all 30 years of the arrangement. “We don’t do flips, we invest for life,” Ms. Matson said, meaning that Table Rock doesn’t seek quick profits by unloading its investments. She also said that Table Rock declined to make deals that provided big   payments to towns without a sufficient commitment to infrastructure repairs. “Those deals give the rest of us a bad name,” she said. In an upscale Washington, D. C. restaurant in 2012, an executive from the Carlyle Group, one of the world’s largest private equity firms, put his arm around the mayor of Missoula, Mont. “Mayor,” the executive said, “are you ready to buy a water system?” Three years later, the comments by the executive, Robert Dove, were recounted from a witness stand in the Missoula County Courthouse. The city was suing Carlyle, which ultimately refused to sell to Missoula, to gain control of its water system. Missoula is one of several places in recent years that have tried getting back their water systems from a private company. But after waging costly battles, the towns cannot always guarantee the same services at lower rates. At the time of that dinner in Washington, Missoula was the only city in Montana that did not own its water system  —   and John Engen, Missoula’s mayor, wanted to change that. So, months before, he had supported Carlyle’s purchase of the regional water company (Park Water) that owned Missoula’s local system (Mountain Water) believing that Carlyle would then sell Mountain Water back to his town. But the mayor’s plans derailed. In October 2013, Missoula made an informal offer to buy its local system. Carlyle declined. Missoula made a formal offer. Carlyle declined again. Missoula then sued, and it won. But the court decided the system was worth $88. 6 million, substantially more than what the city had offered. On top of that, the city must spend millions of dollars on legal and other fees and must also pay some of its opponents’ costs, according to court records. Those costs included lawyers’ fees, limo services and dinners at some of Missoula’s finest restaurants. They also included at least one order of boneless chicken wings at Hooters, and one bottle of Metamucil. In a statement, a Carlyle spokesman said that the firm had considered the city’s offers in good faith. “The city offered many millions less than the company was worth, and an independent panel agreed,” the spokesman said. He also said that under Carlyle’s watch, “capital expenditures more than doubled, leakage was reduced by 19 percent, water quality was excellent and employment was stable. ” And under Missoula’s watch, water rates may rise anyway. Further costly repairs are still needed, for one thing. For Carlyle, the deal was a financial success. The firm sold Park Water in January to another private company for $327 million, more than double what Carlyle had paid. Missoula is not the only city seeking control over its infrastructure. Last year, Santa Paula bought its wastewater recycling plant for about $70 million from Alinda Capital Partners. Alinda, which specializes in infrastructure investing, had teamed up with a private water recycling company to finance, design, build and operate the plant after the city awarded them the contract in 2008. The new facility, Alinda noted, replaced an old plant owned by Santa Paula that had been violating state environmental regulations, saving the city from paying fines. But after years of raising sewer rates, partly to pay “service fees” to Alinda, Santa Paula’s thinking changed: It would be better for Santa Paula to issue its own debt to purchase the plant than to saddle citizens with annual rate increases. Now the town  —   at the urging of its city manager, Jaime Fontes, and several council members, including Ginger Gherardi  —   has started issuing rebates to citizens. Still, there will be bumps along the road. After all, cities like Missoula and Santa Paula are now responsible for running an important, and occasionally messy, public service. Soon after Santa Paula regained control of its sewer plant, an equipment failure let partly treated wastewater pour from the plant. The discharge turned a pond green and flowed onto a nearby organic farm. And wastewater, Mr. Fontes said, is “not the kind of organic you want. ”'"}, "time": 1742562280.6903567}