{"duration": 0.09614276885986328, "input_args": {"text": "'Home › POLITICS › CLINTON, COMEY AND THE E-MAIL SCANDAL: IS THERE A REBELLION AT THE FBI? CLINTON, COMEY AND THE E-MAIL SCANDAL: IS THERE A REBELLION AT THE FBI? 0 SHARES \\n[10/31/16] The Clintons are a “crime family” and Hillary a “pathological liar,” said former assistant FBI director James Kallstrom during an interview Sunday. And it appears his belief is shared by current rank-and-file FBI agents, as a rebellion has apparently been brewing within the bureau. \\nThe latest shocking news on this front is that despite a plea deal to destroy laptops (evidence) belonging to Clinton associates, those devices were not destroyed and are still in the possession of the FBI. As the Daily Caller reports : \\nWashington D.C. attorney Joe DiGenova said on The David Webb Show on SiriusXM Friday night that despite the FBI agreeing to destroy the laptops of Clinton aide Cheryl Mills and ex-campaign staffer Heather Samuelson as part of immunity deals made during the initial investigation of Clinton’s email server, agents involved in the case refused to destroy the laptops. \\n“According to the agreement reached with the attorneys who handed over their laptops, the laptops were to be destroyed per the agreement after the testimony was given — the interviews were given — by the attorneys. The bureau and the department agreed to that,” DiGenova said. “However the laptops contrary to published reports were not destroyed and the reason is the agents who are tasked with destroying them refused to do so. And by the way the laptops are at the FBI for inspection by Congress or federal courts.” \\nDiGenova said the laptops have already been subpoenaed and the FBI is waiting for Congress to ask for them. \\nAs to this report’s credibility, American Thinker’s Thomas Lifson notes that “DiGenova, a former US Attorney and Washington, DC superlawyer is no flake. He has plenty of contacts within the FBI and a reputation to protect. So I take his words on Sirius/XM’s David Webb show quite seriously.” \\nEver since FBI director James Comey (shown above) shook the political world Friday by announcing that the bureau was reopening the investigation into Clinton’s illegal use of a private e-mail server, theories as to why he’s acting now have proliferated. After all, since consensus was that Comey was covering for the Democrats at the Obama administration’s behest, no one expected a revisiting of Clinton’s criminality just over a week before the election. \\nOf course, given that tens of thousands of e-mails — some apparently Clinton related — were recovered from ex-congressman Anthony Wiener’s laptop during an investigation into his having sent illicit text messages to a 15-year-old girl, the most obvious explanation is that of Watergate journalist Carl Bernstein , that whatever was found is “a real bombshell.” As Thomas Lifson wrote in “3 competing theories on why the FBI re-opened the Hillary email server investigation,” “It is possible that something so dramatic came up in the pertinent emails that postponing a public reaction by not announcing the reopening of the investigation would, [sic] be regarded as political interference by covering up a smoking gun until after the election. In this scenario, Comey is assuming the evidence cannot be suppressed, and that he would be held accountable after it comes out. This scenario also indicates that we could be headed for a constitutional crisis, involving the possible indictment of a president-elect before an election. Or the evidence being turned over to the House of Representatives for impeachment hearings.” \\nThe second theory Lifson outlined was one put forth by radio host Rush Limbaugh. As Lifson wrote, “By announcing an FBI Investigation resuming, Comey is putting a lid on further attention to Wikileaks. I guess this means that Clinton forces will argue we must wait for the investigation to be complete (after the election) before speaking about what the evil Russians are planting into our politics.” \\nLastly, Lifson wrote that Comey “might be seeking to restore his badly damaged reputation, recognizing that the damage he has inflicted on the FBI is substantial. Three days ago, American Thinker published an open letter from a retired FBI agent, Hugh Galyean, that laid out some of the damage Comey has inflicted on the institution he leads. There is little doubt that this reached many in the FBI family, putting in print what people have only whispered about. If those silenced voices start speaking out, Comey could face a serious loss of face. In this scenario, he is heading off a staff rebellion, possibly including mass resignations.” \\nThis last theory is lent great credence by the news that the plea-deal laptops were never destroyed. If that story is true, it reflects a rebellion more serious than most anyone had imagined — with agents defying a direct order . This also adds weight to a related theory: that agents are so disgruntled that not only could some “resign and reveal,” but that active personnel could actually leak the truth to the media. If this is the case, Comey might be trying to get out ahead of such a development. Post navigation'"}, "time": 1742563673.5768464}