{"duration": 0.21339654922485352, "input_args": {"text": "'November 4, 2016 \\nThe government has caused further controversy this morning by announcing that its appeal against the High Court’s ruling on Article 50 will not be heard by the Supreme Court but by Mary Berry, Mel and Sue, the former stars of The Great British Bake Off. \\nThe news comes after polling showed that 52% of voters were sick of so-called ‘experts’ being asked to make decisions about the governance of the United Kingdom. A government source said: ‘The ex-Bake Off team were definitely our first choice to make a call on Article 50. They are far more likely to reach a decision that meets with public approval than those boring old farts in the Supreme Court. I mean, what have they got? OK, 265 years’ worth of legal experience between them and significant expertise in relevant fields of constitutional precedent and interpreting centuries of law. But you know, Mary Berry! Mel and Sue! Soggy bottoms! Ha ha! What do you mean, “is that really sufficient”? You’re obviously some kind of rabid anti-democratic elitist.’ \\nBerry admitted to being ‘surprised’ but willing to rise to the challenge proposed by the government. ‘Up to now my experience hasn’t really included very much British constitutional law or international jurisprudence,’ she said. ‘But I do know when something is half-baked, impossible to prove, likely to crumble into a mess, or just leaves an absolutely disgusting taste in the mouth. So perhaps I will be able to understand the government’s Brexit strategy after all.’ \\n‘There are all sorts of reasons why this is an absolute blinder of an idea,’ said prime minister Theresa May in a Commons statement. ‘It’s great for the employment figures as it keeps these three women in work when they’d otherwise be on the scrap heap. They’re significantly more popular with the public than those fusty old bastards who found against us last week. Although I understand Sue is openly gay, so we’ll have to make sure nobody tells the Mail. She doesn’t fence, does she? \\n‘Mind you, “Giedroyc”…what’s that, Polish? Somebody get Amber Rudd on the phone, quick.’ Share this story... \\nPosted: Nov 4th, 2016 by NewsBiscuit Click for more article by NewsBiscuit .. More Stories about: Politics'"}, "time": 1742564435.2271957}