{"duration": 0.11700892448425293, "input_args": {"text": "'Celebrities took to their social media accounts over the weekend to protest President Donald Trump’s executive order temporarily suspending the U. S. Refugee Admissions Program. [On Friday, the President signed an executive order titled, “Protection Of The Nation From Foreign Terrorist Entry Into The United States,” which Trump says established “new vetting measures to keep radical Islamic terrorists out of the United States of America. ”  It didn’t take long for some of Hollywood biggest stars and most outspoken political activists to jump on their Twitter accounts to express outrage at Trump’s latest actions. Below is a roundup of Hollywood’s reactions to the executive order. He doesn’t understand that this will lead to people in America becoming radicalized as a result of his ignorance and cruelty. https:  .   —   Judd Apatow (@JuddApatow) January 28, 2017,  To our Muslim neighbors in the world: I  tens of millions of others are so very sorry. The majority of Americans did not vote 4 this man.  —   Michael Moore (@MMFlint) January 28, 2017,  What’s happening is repugnant.  We’re supposed to be unique, a haven.  We’re betraying our heroes.  —   Andy Richter (@AndyRichter) January 28, 2017,    USA Turned Away Thousands of Jewish Refugees Fearing That They Were Nazi Spies.   Trump signs order banning Syrian refugees. https:  .   —   Jessica Chastain (@jes_chastain) January 27, 2017,  Can 240 Years of FREEDOM BeUndone In One Week⁉️#Resist,  —   Cher (@cher) January 28, 2017,  Obviously we must prioritize keeping Americans safe. But we mustn’t become   in the process.  —   Chris Evans (@ChrisEvans) January 29, 2017,  Statistics pic. twitter.   —   Kim Kardashian West (@KimKardashian) January 29, 2017,  LA Protest on #Muslimban TODAY   at Federal Immigration Office, 300 N. Los Angeles St. https:  .   —   Seth Rogen (@Sethrogen) January 28, 2017,  It’s like we’re watching history repeat itself but only half the population know how bad it turns out.  —   Ricky Gervais (@rickygervais) January 28, 2017,  We might need to think about returning this beauty to France Now pic. twitter.   —   Patricia Arquette (@PattyArquette) January 28, 2017,  All the indignation is fine. But we gotta get him out! We must demand a competency test! He is ill! Mentally ill!  —   ABFoundation (@ABFalecbaldwin) January 29, 2017,  ❤💛💙💚 pic. twitter.   —   Miley Ray Cyrus (@MileyCyrus) January 28, 2017,  Protest happening at LAX ( airports around the country)! Let’s stand up 4 one another LA! #NoBanNoWall #RefugeesWelcome #ImmigrantsWelcome pic. twitter.   —   America Ferrera (@AmericaFerrera) January 28, 2017,  THESE are the HUMAN BEINGS Trump banned today. REFUGEES fleeing ISIS. Children. Their families. Shame on him. May God help us. https:  .   —   Sophia Bush (@SophiaBush) January 28, 2017,  Paul Ryan’s office address. Go show upJanesville: 20 South Main ST, Suite 10, Janesville, WI 53545. 608. 752. 4050.  —   Chelsea Handler (@chelseahandler) January 29, 2017,  Along with   the Muslim ban we can now add heartless  evil to DT’s repertoire.  —   Rob Reiner (@robreiner) January 28, 2017,  The   attackers were from Saudi Arabia, Egypt  UAE —  not the 7 nations in the immigration ban. These all do have Trump properties though.  —   George Takei (@GeorgeTakei) January 28, 2017,  130 million people from 7 country are being denied entry  if you were on a plane and landed you are not allowed in  where’s the outrage ?  —   George Lopez (@georgelopez) January 28, 2017,  the #MuslimBan is dehumanizing beyond words  …     im in shock. THIS IS NOT WHO WE ARE THIS IS NOT WHO WE ARE THIS IS NOT WHO WE ARE,  —   Camila Cabello (@camilacabello97) January 29, 2017,  #protest #NoBanNoWall @realDonaldTrump @POTUS @SenateMajLdr @SpeakerRyan @jasoninthehouse @GOP @foxnews https:  .   —   John Leguizamo (@JohnLeguizamo) January 28, 2017,  My 13 yr. old,   daughter is at her 8th grade dance right now. What are Muslim parents saying to their daughters tonight? https:  .   —   Michael Ian Black (@michaelianblack) January 28, 2017,  This #MuslimBan is also messing up attendance at our   ”Undermine Western Civilization” meetings.  —   Kumail Nanjiani (@kumailn) January 28, 2017,  I have worked for decades on religious tolerance. @realDonaldTrump’s Muslim ban is against everything this country was founded on. Shameful.  —   Russell Simmons (@UncleRUSH) January 28, 2017,  Theresa May should come out against these executive orders, apologise to British Muslims for not doing so earlier and resign. Truly shameful.  —   lily allen (@lilyallen) January 28, 2017,  My best friend, Alaa Mohammad Khaled, is Muslim. His parents were Palestinian refugees. His brother is DJ Khaled. #RefugeesWelcome pic. twitter.   —   Alyssa Milano (@Alyssa_Milano) January 28, 2017,  Really want to smack the hell out of folk lamenting what Trump ”is doing.” He told every1 his plan from jump! https:  .  #  —   Star Jones (@StarJonesEsq) January 28, 2017,  #muslimban is making me cry LIBERAL TEARS for our country and its future, and you know what that means? COMPASSION, YOU MOFOS!! 😥😥😥😥😥😥😥😥😥😥😥  —   Rachel Dratch (@TheRealDratch) January 28, 2017,    Follow Jerome Hudson on Twitter: @jeromeehudson'"}, "time": 1742561825.4783366}