{"duration": 0.09570169448852539, "input_args": {"text": "'Most Top Retailers Sell Food Produced With Bee-Killing Pesticides Only Aldi, Costco, and Whole Foods got passing grades Julie Fidler | Infowars.com - October 27, 2016 Comments \\nA new ‘scorecard’ report gives a failing grade to 17 out of 20 major food retailers in the United States, based on their policies and practices regarding pollinator protection, organic options, and pesticide reduction. [1] Source: Friends of the Earth \\nTiffany Finck-Haynes, food futures campaigner with Friends of the Earth, said: \\n“U.S. food retailers must take responsibility for how the products they sell are contributing to the bee crisis. \\nThe majority of the food sold at top U.S. food retailers is produced with pollinator-toxic pesticides. We urge all major retailers to work with their suppliers to eliminate pollinator-toxic pesticides and to expand domestic organic offerings that protect pollinators, people and the planet.” [1] Organic Offerings And Transparency Are Lacking \\nThe report “Swarming the Aisles: Rating Top Retailers on Bee-Friendly and Organic Food” is the work of a coalition led by Friends of the Earth and more than 50 farmer, beekeeper, farmworker, environmental, and public interest organizations. [1] \\nThe coalition sent a letter urging food retailers to eliminate pesticides that are toxic to bees and other pollinators , and increase U.S. Department of Agriculture (USDA) certified organic food and beverages to 15% of overall offerings by 2025. The group would like to see retailers prioritize domestic, regional, and local p\\xadroducers. \\nFriends of the Earth and its allies have been successful in the past at convincing more than 65 garden retailers, including Lowe’s and Home Depot, to commit to eliminate pollinator-toxic neonicotinoid (neonic) pesticides. \\nAccording to Haynes, the demand for organic foods has grown by double-digits , but grocers aren’t keeping up. She said: \\n“A lot of the major food retailers have started to increase their organic offerings, but few of them have really adopted clear goals or metrics to continue to significantly increase their organic food offerings in the future.” [2] \\nAs evidenced by the group’s research, it’s difficult for the public to know where retailers stand concerning pesticide use and organic food. Eleven of the 20 retailers’ websites examined by Friends of the Earth don’t provide basic information concerning their policies on organic food, pollinators, and/or pesticides , Haynes said, adding: \\n“There’s a lot that retailers could do by adopting creative programs with their supply chain to help farmers grow their organic offerings, and then be able to sell that in their stores.” Americans Are Ready For Change \\nA YouGov poll released 25 October 2016 by Friends of the Earth and SumOfUs reveals that 80% of Americans believe neonics should not be used in agriculture , and 65% of those who do the grocery shopping for their household would be more likely to shop at a store that has made a formal commitment to eliminate neonicotinoids. [1] \\nAdditionally, the poll shows that 59% of respondents believe it’s important for supermarkets to sell organic food. Another 43% said they’d likely spend more time at a different grocery store if it sold more organic food than the store they currently frequent. \\nSaid Angus Wong, lead campaign strategist at SumOfUs, a consumer watchdog with ten million members: \\n“Over 750,000 SumOfUs members have spoken out advocating that U.S. Hardware stores take action to protect our pollinators. And after years of pressure, Home Depot and Lowe’s have finally enacted more bee-friendly policies. \\nAnd the findings of this poll show that a vast majority of consumers want to eliminate neonicotinoids from their grocery stores too. This is why food retailers must commit policies that protect our bees immediately.” \\nOnly four of the nation’s top food retailers – Albertsons, Costco, Target, and Whole Foods – have adopted and made public a company-wide commitment to increase offerings of certified organic food . They are also the only retailers to disclose data on the current percentage of organic food they offer, or organic sales. \\nAldi, Food Lion, part of the Delhaize Group, and Kroger disclosed data on the current percentage of organic offerings or organic sales. \\nNone of the retailers that the group looked at have publicly committed to sourcing organic food from American farmers . Retailer Apathy Is Killing Pollinators \\nOf the top 20 food retailers surveyed by Friends of the Earth, a shocking 16 were predominantly unresponsive to Friends of the Earth’s requests for information via surveys, calls, and letters. The group was forced to turn to publicly available information, including company websites, company annual reports, U.S. Securities and Exchange Commission filings, corporate social responsibility and sustainability reports, press coverage, and industry analyses, for their data. \\nWe have bees to thank for every 1 in 3 bites of food we take ; and without bees, stores would run low on everything from strawberries to almonds. Source: Bee Cause \\nScience increasingly points to neonicotinoid pesticides as a leading cause of pollinator decline. Glyphosate, the main ingredient in Monsanto’s blockbuster herbicide, Roundup, has been shown to play a significant role in monarch butterfly declines . \\nSeveral U.S. cities have banned neonics, including Boulder City, Colorado , and Portland, Oregon . This past spring, Maryland became the first state to ban the pesticides . \\nThis article originally appeared at Natural Society . NEWSLETTER SIGN UP Get the latest breaking news & specials from Alex Jones and the Infowars Crew. Related Articles'"}, "time": 1742562055.7197006}