{"duration": 0.10241293907165527, "input_args": {"text": "'On Thursday, Nov. 3, 2016, Tshililo Michael Masutha, the Minister of Justice of South Africa, presented a bill to parliament for the withdrawal from the International Criminal Court (ICC). South Africa, Burundi, and Gambia announced in October their intention to leave the ICC due to what they believe is unbalanced treatment of the Court’s members. This move is drawing much attention internationally and some are concerned an African exodus from the ICC could be taking place. Support for the ICC in Africa is reflected in a statement issued on Oct. 22 by 24 African and international organizations that have called South Africa’s decision, “a slap in the face for victims.”\\nSouth Africa’s decision to withdraw from the International Criminal Court is being seen as more significant than the Burundian lawmakers’ decision to vote themselves out on Oct. 12. Burundi has experienced an increase in “violence and conflict” since President Pierre Nkurunziza’s announcement that he will be seeking a third term in office. Due to this violence, the ICC opened a Preliminary Investigation into the situation in Burundi, causing some resentment from its leadership. Gambia’s decision to leave is also no surprise to many after President Yahya Jammeh and his government was again criticized for “cracking down” on political opposition.\\n\\nSouth Africa has not been the target of an ICC investigation which is why their decision is being received differently. Criticisms of the ICC include ineffective prosecution and uneven treatment of the Court’s members. Frustration was experienced by Africa’s ICC members recently when Sudanese President Omar al-Bashir, while being indicted for “multiple counts of genocide, crimes against humanity, and war crimes,” was allowed to freely travel to ICC member-states where the ICC holds jurisdiction. ICC jurisdiction can be a complicated matter. The Rome Statute, the international legal treaty that established the ICC, dictates that it will be the obligation of the Court’s members’ policing agencies to “cooperate fully with the Court in its investigation and prosecution of crimes.”\\nThis essentially means while the ICC holds the jurisdiction to prosecute those who have committed the worst crimes, domestic authorities need to aid in the facilitation of such procedures. This notion that local remedies must be exhausted prior to ICC intervention was exhibited by Nigeria during Bashir’s international trip. Upon arriving in Nigeria legal charges were brought against him in Nigeria’s domestic court system, perhaps prompting him to leave just 24 hours after arriving. The prosecution of Bashir is also complicated due to the African Unions policy, established in 2013, of not prosecuting sitting “heads of state.”\\nThe other criticism, that the ICC treats its member’s unbalanced looks to be an accurate statement, but it may also carry a complicated explanation. The Rome Statute has been ratified by 124 nations. These nations did not all join at once and African countries have been more zealous than others in referring criminals to The Hague for prosecution. Over half of the investigations being conducted by the ICC at present were referred by African ICC members. In fact, nine out of ten of the current investigations are of African individuals and all 32 individuals who have been indicted under the jurisdiction of the ICC have been from Africa. So, while the numbers reflect a heavy focus on African criminals, these people have been referred to the Court by African nations.\\nSouth Africa’s decision to proceed with their withdrawal from the ICC could bring more attention to the above criticisms. Many argue, though, that there is still strong support for the ICC in Africa. On Thursday, coinciding with Masutha’s submission of the bill, the Acting Spokesperson for Nigeria’s Ministry of Foreign Affairs, Jane Adams, communicated in a statement that Nigeria would not be leaving the ICC. Adams believes, “A strengthened, reinvigorated and fine-tuned ICC as a symbol of the International Criminal system has an important role to play to offer solace to victims of heinous despicable and dastardly crimes.”\\nBy Joel Wickwire\\nSources:\\nForeign Affairs – ICC on Ice?\\nHuman Rights Watch – Africa Speaks Out Against ICC Withdrawal\\nInternational Criminal Court (ICC) – Statement of the Prosecutor of the International Criminal Court, Fatou Bensouda, on Opening a Preliminary Examination into the Situation in Burundi\\nInternational Criminal Court (ICC) – Situations Under Investigation\\nThe Jurist – South Africa Justice Minister Submits Bill to Withdraw from ICC\\nTop Image Courtesy GovernmentZA’s Flickr Page – Creative Commons License\\nIn-Line and Feature Image Courtesy of Christopher A. Dominic’s Flickr Page – Creative Commons License\\n     court'"}, "time": 1742562094.9366226}