{"duration": 1.6291162967681885, "input_args": {"text": "'You are here: Home / US / After FBI Reopens Hillary Email Case Trump Supporters Chant 3 Brutal Words After FBI Reopens Hillary Email Case Trump Supporters Chant 3 Brutal Words October 28, 2016 Pinterest \\nDuring a campaign rally in New Hampshire, Donald Trump supporters chanted “lock her up” when Trump announced to the crowd that the FBI had reopened their investigation into former Secretary of State Hillary Clinton’s mishandling of classified information. \\nTrump told the Manchester, New Hampshire crowd, “The FBI has just sent a letter to Congress informing them that they have discovered new emails pertaining to the former Secretary of State, Hillary Clinton’s, investigation, and they are reopening the case.” \\nIn response, the crowd of around 2,000 people chanted “lock her up.” Trump waited for the cheers to die down before he said, “The rest of my speech was going to be so boring.” He asked the crowd, “Should I even make the speech?” \\nTrump added : \\nHillary Clinton’s corruption is on a scale that we have never seen before. We must not let her take her criminal scheme into the Oval Office. I have great respect for the fact that the FBI and the Department of Justice are now willing to have the courage to right the horrible mistake that they made. \\nAs Breitbart reported , the focus of the day was supposed to be Obamacare and the enormous premium increases hitting Americans, but the FBI announcement changed things for not only Trump’s speech, but maybe for the rest of the campaign. \\nIn light of the huge FBI announcement, advisers reportedly told Trump to skip the speech, but he said, “I don’t have the courage to skip the speech in New Hampshire.” \\nTrump went ahead with his speech and touched on the major themes of his campaign, with bits about the FBI revelation sprinkled in. \\n“Job-killing Obamacare is one more way the system is rigged. But with what I just announced, previously, it might not be as rigged as I thought, right? Right?” Trump said. “The FBI, I think they are going to right the ship, folks. I think they are going to right the ship and they’re going to save their great reputation by doing so.” \\nWe’ll see if this investigation does anything to “right the ship.” As FBI Director James Comey noted in his letter to Congress: \\nAlthough the FBI cannot yet assess whether or not this material may be significant, and I cannot predict how long it will take us to complete this additional work, I believe it is important to update your Committees about our efforts in light of my previous testimony. \\nThis could all be one big smokescreen in an effort to somehow help Clinton, particularly if she should be elected president. It could also be something so damning that even Comey felt like he couldn’t look the other way…which, given the cover-up and lack of indictment, that would really be saying something. \\nTime will tell, of course, but at the very least this revelation is another blow to the Clinton campaign. It doesn’t seem likely that an investigation will be completed before election day, so there will certainly be yet another cloud hanging over the corrupt campaign.'"}, "time": 1742563432.6244657}