{"duration": 0.08975505828857422, "input_args": {"text": "'Internet Under Attack Since Transfer to the UN, Washington Prepares for EMP Posted on Tweet Home » Headlines » Finance News » Internet Under Attack Since Transfer to the UN, Washington Prepares for EMP \\nRemember how we pondered whether the internet would be shut off (or highly censored) upon being transferred to the UN on October 1st? Just a few weeks later, large swathes of the internet went down. Coincidence or trial run? \\n\\nSubmitted by Jeff Berwick : \\nWe’ll get into that below. \\nBeforehand, however, there have been a number of new “Executive Orders” straight from the e-pen of Barack O’Bomber in the last few months of a “very strange” variety. \\nOver the summer, a number of orders were given for succession plans in the case of multiple deaths in numerous US agencies. \\nAnd now, Obama just signed an executive order mandating preparations for a future “extreme space weather event” that has the ability to cripple or destroy the North American power grid and other major electrical infrastructure. \\nSigned on October 13th, the order states, “Space weather has the potential to simultaneously affect and disrupt health and safety across entire continents.” \\nWhat is needed, we’re informed, is an “all-of-nation” endeavor, that includes the military space agency (NASA), the private sector, academia, and the insurance industry – among others. Presumably the federal government would “coordinate” all this – i.e.: mandate it. \\nThere are some very strange things afoot! Why this? Why now? \\nWith each passing day it seems we’re getting closer to a major event. Maybe it’s one that causes a war or economic collapse. Perhaps it will be an “EMP” attack masquerading as a “space event.” It’s also possible a long term internet Denial of Service attack could be the cause of collapse. The bankers need a reason to blame for the collapse they’ve engineered. \\nWe’d be less suspicious of what’s going on if the US wasn’t well down the road toward a kind of neo-fascism. It’s one with two kinds of justice (Hillary and the elites versus the rest of us), a state of deepening economic depression and heightened military confrontation with both Russia and China as part of endless serial warfare abroad – and increased repression and censorship at home. In fact, the amount of censorship of alternative media sources is running at an all-time high. Barely a day goes by where I don’t see one source claiming its post/tweet/video have been removed. \\nObviously, the free flow of information doesn’t fit into this “brave, new world” and thus the US is jettisoning it. \\nNo coincidence, for instance, that the internet changed hands in the beginning of October when the Internet Corporation for Assigned Names and Numbers, or ICANN, was handed over to the UN by the US’s own Nobel Peace Prize winner, Barack O’Bomber. \\nJust about a week ago, we witnessed a massive DDOS attack in the US. According to mainstream reports, it was done by “hackers” and naturally Killary Clinton took the opportunity to place blame on Russia. These are the same Russians who she says are behind the Wikileaks emails – which incriminate her – and the same Russians who, she claims, are propping up Donald Trump. \\nBloomberg reported that the enormous (and underreported) attack was perpetrated via a Chinese security camera maker. In fact, officials at this Chinese firm admitted that its products, which contained malware, were used to launch the cyber-attack which blocked internet access for millions of users. They then highlighted the threat which they claim is posed by “the global proliferation of connected devices.” \\nWas this all a coincidence or was it a premeditated attack to test the limits of “control” over the internet? Is it possible that Chinese and US authorities are cooperating to probe internet weaknesses in order to further their ‘net dominance. \\nCould NASA or the North Atlantic Terrorist Organization (NATO) potentially play a future role in staging an electromagnetic disturbance with the help of the Chinese or the US private sector? These are strange and violent times … \\nAs Franklin D. Roosevelt said, “Nothing happens in politics by accident, if it happens, it was planned that way”. \\nAnd, as John Kerry stated, “This little thing called the internet is making it hard to govern.” \\nThey appear to have their sights set on this little thing called the internet, in one way or another, to make sure these absurd conspiracy theorists and “truthers” can’t report on what is actually and factually, going on. \\nIt certainly seems like the US is preparing for something big – maybe a nationwide electro-magnetic catastrophe. One that many reports state would see the population cut by 90% in a matter of months in today’s uber-connected and digitally dependent world. \\nLast year, we reported on the North American Aerospace Defense Command’s plan to re-use the subterranean Cheyenne Mountain bunker in Colorado Springs. NORAD’s Commander Admiral William E. Gortney, explained that the EMP hardened mountain base would serve as protection from future “electromagnetic pulses”. \\nApparently all this arose over concern for NORAD’s supposed vulnerability to a potential North Korean nuclear missile attack. Cartoonish Kim Jong-un, or Lil’ Kim, who couldn’t blow up his own sock drawer if he tried, supposedly has an operational KN-08 nuclear armed missile capable of shutting down the entire North American electrical grid. \\nNow, combine these points with Vladimir Putin’s promise that only Donald Trump can prevent a potential nuclear war between world superpowers. Then add in Russia’s war drills and emergency preparations plus Germany moving its military equipment to the Eastern borders. It’s beginning to look like Putin is aware of something “big” on the horizon as well – just like Obama and the Pentagon. \\nFor the record, I don’t enjoy doing these blogs. It seems every day I am warning of some cataclysmic event or nefarious plot. I don’t want to do this. I’d rather live on the beach in Mexico and write about cryptocurrencies or fantastic investment opportunities. \\nBut, I feel an obligation to report on these things. Because hardly anyone else seems to even mention it. \\nNobody seems to notice, nobody seems to care. \\n2017 Gold Pandas and 2017 Silver Pandas Are Now Available! Secure Your 2017 Panda Coins Today at SD Bullion! This entry was posted in Finance News and tagged EMP , Jeff Berwick , The Dollar Vigilante . Bookmark the permalink . Post navigation'"}, "time": 1742564029.2593024}