{"duration": 0.03160357475280762, "input_args": {"text": "'EU In this December 30, 2015 photo, Iraqi Izadi Nadia Murad Basee (C) is welcomed by Greek President Prokopis Pavlopoulos (R) before their meeting in Athens. (Photo by AP) \\nThe European Parliament has awarded two Iraqi women from the Izadi minority group its prestigious human rights prize. \\nOn Thursday, Nadia Murad and Lamia Haji Bashar won the European Parliament\\'s prestigious Sakharov Prize for Freedom of Thought for their plight when they, along with other women and girls were abducted, tortured and sexually abused by Daesh terrorists after the militants overran northern Iraq two years ago. \\nThe two were awarded the prize as part of efforts to protect the Izadis, who are followers of an ancient religion mostly practiced by more than half a million people in northern Iraq. \\nThe community members, especially women, have been subject to torture, sexual abuse and slavery by Daesh. \\nEuropean Parliament chief, Martin Schulz, hailed the two Izadi women for their bravery, saying they had“a painful and tragic story” but “felt compelled to survive to bear witness.” \\n\"The courage of these two women, [and] the dignity they represent defies all description,” Schulz told the assembly in Strasbourg. This photo taken on May 5, 2016 shows Lamia Haji Bashar, an 18-year-old Izadi girl who escaped Daesh, in northern Iraq. (Photo by AP) \\nDaesh abducted Murad from her home village of Kocho near Iraq\\'s northern town of Sinjar in August 2014. The slight, softly-spoken young woman, who is now 23, was then brought to the city of Mosul, where she was tortured and raped. \\nBashar, from the same village, was enslaved and sold two years ago after watching the slaughter of her family and friends by Daesh. The 18-year-old then fell prey to an Iraqi hospital director after 20 months of captivity. She later lost her right eye in a mine explosion which hit one of her friends. \\nThe annual Sakharov human rights prize honors individuals who combat intolerance, fanaticism and oppression. It is named after dissident Soviet scientist Andrei Sakharov, who died in 1989. Loading ...'"}, "time": 1742628607.6123223}