{"duration": 0.04796719551086426, "input_args": {"text": "'NEW DELHI  —   For days, many in Delhi have been living as if under siege, trying to keep the dirty air away from their children and older parents. But it is not easy: Open a window or a door, and the haze enters the room within seconds. Outside, the sky is white, the sun a white circle so pale that you can barely make it out. The smog is acrid,   and   and so thick that it is being blamed for a   pileup north of the city. If in past years Delhi’s roughly 20 million residents shrugged off wintertime pollution as fog, over the past week they viewed it as a crisis. Schools have been ordered closed for three days  —   an unprecedented measure, but not a reassuring one because experts say the concentration of pollutants inside Indian homes is typically not much lower than outside. Levels of the most dangerous particles, called PM 2. 5, reached 700 micrograms per cubic meter on Monday, and over the weekend they soared in some places to 1, 000, or more than 16 times the limit India’s government considers safe. The damage from sustained exposure to such high concentrations of PM 2. 5 is equivalent to smoking more than two packs of cigarettes a day, experts say. “There is so much smog outside that today, inside my house, I felt as though someone had just burned a few sheets of paper,” said Amaan Ahuja, one of dozens who shared their families’ experiences in response to a request from The New York Times. “You can literally see smoke in the air, and when you breathe, you can smell it, too,” he said. “We are trying to keep the kids indoors with all the windows closed. ” Another reader, Tulika Seth, described her family’s life over the past week as “unnatural and disturbing. ” Asked where she lived, she responded, “a gas chamber. ” To understand the health consequences of the dense smog that settled over India’s capital over the past week, scientists are looking back decades in search of a historical precedent: to the 1952 Great Smog of London, which is believed to have caused as many as 12, 000 premature deaths. In that case, a layer of dense pollution  —   caused largely by emissions from burning coal  —   dissipated after four days, when the weather changed. But an uptick in deaths continued for weeks afterward, so shocking the public that it spurred a wave of environmental regulations. Delhi’s chief minister on Sunday announced a series of emergency measures, including a   moratorium on construction, a   closure of a power plant and a   closure of about 1, 800 public schools. On Monday, the city government released a list of health guidelines, advising citizens to wash their eyes with running water and to go to a hospital if they were experiencing symptoms like “breathlessness, giddiness, chest pain and chest constriction. ” But experts said mitigating the conditions would have required policies to be put in place months ago. “These are all decent emergency measures, but they’re not solving the   problem,” said Bhargav Krishna, who manages the Public Health Foundation of India’s environmental health center. “The best we can hope for, in a way, is to plan for next year,” he added. “This year is almost a washout. ” Changing weather conditions are likely to disperse the dense cloud of pollutants over the next few days. But they will also bring the beginning of the widespread burning of trash, including plastic and rubber, for warmth by Delhi’s poor. Among the persistent problems for policy makers is that the sources of the pollution  —   vehicles, construction, crop burning and holiday fireworks  —   fall under the authority of half a dozen city, state and federal government bodies, which are in some cases at odds with one another politically, Mr. Krishna said. “Where exactly is the responsibility for implementing these plans?” he said. “At whose desk does this all lie?” He added, “The diffuse nature of power means that it is easy to pass on responsibility to others. ” Public anger over Delhi’s air is more palpable than in previous years, and people are more likely to identify pollution as the cause of their health problems. Anumita Roychowdhury, who runs the air pollution program at the Center for Science and Environment, said that sense of urgency would have to be sustained if the city were to impose lifestyle changes, including restraints on car travel. “This has to translate to very strong support for very hard decisions,” she said. “All soft options are over. ” First, though, people here must get through the next few days. Sherebanu Frosh, who lives in Gurgaon, south of Delhi, said she and her children were “cowering by our air purifiers,” which had become overloaded with the concentration of particles in the air. “So we’re putting both our purifiers in one room and spending the day there,” she said. “If we leave, we wear masks. ” Jessica Farmer, whose children attend the American Embassy School in Delhi, said she had moved five purifiers into three rooms of her house, but the concentration of PM 2. 5 in some places remained at 300, five times the W. H. O. recommended limit. “It is as though we are under siege,” Ms. Farmer said. “We can’t go outside, to malls or movies where the air is not purified. “How can one live like this?”'"}, "time": 1742628441.011597}