{"duration": 0.1585853099822998, "input_args": {"text": "'The New York Police Department on Wednesday announced plans to send 75 new investigators to the Bronx to address a steep and longstanding shortage of detectives in the department’s most violent and underserved borough. The chief of detectives, Robert K. Boyce, told city lawmakers at a hearing that the influx was aimed at easing enormous caseloads, which retired police leaders say have hindered investigative work in the Bronx for decades. Homicides in New York City have been falling, but the department’s plans for the Bronx reflect a growing recognition by police chiefs in cities experiencing upticks in murder that heavy caseloads let crimes go unsolved and feed a cycle of street violence. The plan for the infusion of resources comes five weeks after The New York Times published an analysis of confidential deployment data showing that precinct detectives in the Bronx last year carried more than twice as many violent felony cases on average as detectives in Manhattan or on Staten Island, and over 50 percent more than those in Brooklyn or Queens. The new deployment is a significant investment in   investigative work for parts of the Bronx that have not experienced the same improvements in overall crime rates in recent decades as wealthier parts of the city, especially at a time when detective resources are increasingly pulled toward counterterrorism operations. Department leaders, who for years have kept deployment information under wraps even amid major budgetary decisions, acknowledged in frank terms on Wednesday that parts of the city remained in need. “We saw that some of the detective squads up there are more than just a little bit challenged,” Chief Boyce said of the Bronx. “They’re flooded with more cases than they were last year. ” Police supervisors in the Bronx embraced the news of the reinforcements, known as   investigators, a class of officers who are training to become   detectives. Working under experienced detectives, the investigators often shoulder the more   tasks, like canvassing buildings for witnesses and searching for video. After 18 months, they become eligible to be promoted to detectives. “It’s great, this new wave of young, inspired police officers who want to be detectives,” said a   commander in the Bronx who spoke on the condition of anonymity because he was not authorized to talk about departmental deployment decisions. “Not only are you building the present, but you are building the future,” the commander added. “And it is good for the Bronx. ” The Times’s deployment analysis grew out of a series of articles about murder in the 40th Precinct, a    section of the South Bronx where three detectives last year carried more than 400 cases and many others had loads in the high 300s, markedly more than the 150 cases per year the department recommends for precincts with high rates of violent crime. Chief Boyce said Wednesday that about 40 of the city’s 77 precincts needed additional help to meet caseload goals. In the Bronx, he said, the 40th and the 47th, covering Wakefield and Williamsbridge, were especially burdened, some of that owing to increases in crime there last year. The department has already identified and interviewed the 75 new investigators and will send them to squads by the end of the month, Chief Boyce said. Six of them will be sent to the 40th Precinct, in addition to three detectives and one investigator added in   giving the squad a total of 33 detectives and investigators. The Times analysis last year focused on detectives and deliberately excluded   investigators because they are in training and primarily act in support roles. Police officials and elected leaders said that adding   investigators, although not as quick a fix as transferring detectives from one precinct to another, was more politically palatable and would have a lasting impact. The investigators, once promoted, typically stay in the same precinct squads where they were trained. The district attorney in the Bronx, Darcel D. Clark, said she was “very pleased” with the plan. “The people of the Bronx have been underserved too long,” Ms. Clark said. After the publication of the Times article in December, she said, she asked her office’s bureau chiefs to submit ideas for addressing the paucity in investigative resources and pressed Chief Boyce to add detectives. Ms. Clark worried that the understaffing scared off witnesses  —   who did not believe the police could protect them  —   from testifying. Michael J. Palladino, the head of the union representing New York City’s 5, 500 detectives, said that even 75 new investigators was only a first step. “Chief Boyce would like nothing more than to have a few hundred extra white shields for assignment to Bronx detective squads, but budget constraints prevent that,” Mr. Palladino said. “Getting its complement of the allotment will help the 40th Detective Squad, but historically speaking, that precinct seems resistant to crime strategies. ” Chief Boyce characterized the influx to the Bronx as a specific response to high crime and caseloads there, not as a way to fill a gap because of attrition or routine transfers. Other cities, like Boston, have improved their arrest rates by adding detectives and augmenting them with more civilian crime analysts. New York City’s Independent Budget Office has pointed out recently that the department has left empty jobs that were authorized for civilians and kept   officers in other jobs that were fit for civilians, effectively tying up officers who could otherwise do   or investigative work. Elected leaders and watchdogs have struggled to gain a clear understanding of the Police Department’s staffing and the decision making behind deployment practices. Many said Wednesday’s hearing was the first time they got specific answers, and they vowed to pursue legislation to require the department to regularly report staffing and arrest rates. “Clearly this is a backhanded acknowledgment that a problem existed,” said the city’s public advocate, Letitia James. She said the department needed to focus more on “open cases in our underserved communities,” especially in the Brownsville and East New York neighborhoods of Brooklyn and the South Bronx. “It should not have taken investigations done by others to reveal inequities in police resources,” Ms. James said. Vanessa Gibson, a City Council member from the Bronx who presided over Wednesday’s hearing, said that Bronx cases were especially difficult to solve because of drug and gang ties and that, as a result, “sometimes it’s hard to attract detectives in the Bronx. ” Jumaane Williams, a council member from Brooklyn, said that for several years he had been seeking data on the size of boroughwide homicide squads, which often work with precinct squads on   homicides, and that he had not gotten direct answers until Wednesday. Chief Boyce said the Bronx had fewer homicide detectives than Manhattan or Queens despite having more than twice as many murders as either borough, although he said Manhattan detectives also worked on nonfatal shootings.'"}, "time": 1742564098.7831655}