{"duration": 0.023092985153198242, "input_args": {"text": "'Ivanka Trump has called for “religious tolerance” in a message on Twitter Monday, after a series of bomb threats were made against 11 Jewish community centers across the country. [“America is a nation built on the principle of religious tolerance,” Ivanka wrote. “We must protect our houses of worship  religious centers. ”  America is a nation built on the principle of religious tolerance. We must protect our houses of worship  religious centers. #JCC,  —   Ivanka Trump (@IvankaTrump) February 20, 2017,  The White House also denounced the threats in a statement. “Hatred and   violence of any kind have no place in a country founded on the promise of individual freedom,” the White House said. “The President has made it abundantly clear that these actions are unacceptable. ” The JCC Association of North America reported that 11 Jewish community centers in cities such as Chicago, Buffalo, Houston, and Tampa received bomb threats Monday. The threats “were determined to be hoaxes. ” “Our JCCs are strongly rooted in communities across the country,” David Posner, director of strategic performance at JCC Association of North America, said in a statement. “We will not be cowed by threats intended to disrupt people’s lives or the vital role Jewish community centers play as gathering places, schools, camps, and fitness and recreation centers. ” Vandals also destroyed 100 headstones at a Jewish cemetery in St. Louis, according to CNN. Police responded to the incident at Chesed Shel Emeth Society Cemetery Monday at 8:30 a. m. the news outlet reported. Disgusted to hear about the senseless act of desecration at the cemetery in University City. We must fight acts of intolerance and hate.  —   Eric Greitens (@EricGreitens) February 21, 2017,  “Disgusted to hear about the senseless act of desecration at the cemetery in University City. We must fight acts of intolerance and hate,” Missouri Gov. Eric Greitens (R) wrote on Twitter Monday evening.'"}, "time": 1742563318.7812073}