{"duration": 0.0491793155670166, "input_args": {"text": "'We Are Change \\nThe FBI is on round two of their investigation into the emails sent and received by Hillary Clinton on her private server, and a recently released undercover video serves as a reminder of everything that was wrong with the initial investigation. It all starts with who they did and did not interview.\\nIn March 2015, reports first surfaced revealing that Clinton did not have a government email address, and opted to use her personal address during her tenure as Secretary of State from 2009 to 2013. Reports then concluded that her private address was linked to a private server at her home in Chappaqua, New York.\\nHowever, the FBI did not publicly admit that they were conducting an investigation into whether Clinton mishandled classified information until June 2016, when FBI general counsel James Baker sent a letter to the State Department confirming that there was, in fact, an “ongoing investigation.” \\nThe public knowledge of Clinton’s email practices came about because she was already being investigated by the House Select Committee on Benghazi for her involvement in the 2012 terrorist attack in Benghzi, Libya.\\nDespite the fact that a former Secretary of State who was already being investigated , admitted that she used a private server for government business, and then told the public that she deleted 33,000 emails, the FBI still waited nearly a year to confirm that they were conducting an investigation into her email practices.\\nAccording to a recent video from Project Veritas, the FBI’s initial investigation into Clinton’s email was not nearly as thorough as it should have been.\\nThe undercover report revealed that State Department IT Systems Administrator Cindy Almodovar knew of Clinton’s email practices in 2010, and even “met with Huma Abedin for 30 minutes regarding emails at the then unknown, but now notorious, @clintoneail.com site.” \\nHowever, Almodovar claims in the video that she was never interviewed by the FBI in connection with their investigation, despite the fact that her name was mentioned in the emails and her knowledge of Clinton’s practices was clear.\\nWhile the FBI failed to interview Almodovar, they did manage to interview Clinton’s close confidante and top aide: Huma Abedin.\\nAt the time, Adedin swore under oath that she turned in all of the “all of the devices” she owned that contained State Department emails. However, the FBI now claims to have found “tens of thousands” of emails belonging to Abedin on the laptop of her estranged husband, Anthony Weiner. Weiner is currently being investigated for engaging in a sexual relationship with an underage girl.\\nSome sources have said that Clinton is “likely to be indicted” this time around, but this comes after FBI Director James Comey laid out of all of the reasons Clinton should have been arrested in the first investigation, and then ultimately defended her.\\nWhy should we trust that Comey and the FBI will get it right this time around? With all of the recent revelations from WikiLeaks and Project Veritas coming together, it serves as a reminder that it’s not just about Clinton this time. It is not about both Hillary Clinton and the entire FBI being held accountable for their actions.\\nFollow Rachel Blevins on Facebook and Twitter . \\n \\nThe post HIDDEN CAM: FBI Botched First Clinton Investigation – Why Trust Them Now? appeared first on We Are Change .\\n'"}, "time": 1742628368.1908276}