{"duration": 0.062215328216552734, "input_args": {"text": "'Abby Martin Exposes What Hillary Clinton Really Represents ‹ › Since 2011, VNN has operated as part of the Veterans Today Network ; a group that operates over 50 plus media, information and service online sites for U.S. Military Veterans. 65 US ‘journalists’ at a private dinner with Hillary Clinton’s team and John Podesta By VNN on October 26, 2016 We wanted to make sure everyone on this email had the latest information on the two upcoming dinners with reporters. Both are off-the-record. \\nHang The Bankers \\nSeveral top journalists and TV news anchors RSVPed “yes” to attend a private, off-the-record gathering at the New York home of Joel Benenson, the chief campaign strategist for Hillary Clinton, two days before she announced her candidacy in 2015, according to emails Wikileaks has published from John Podesta ’s purported accounts. \\nThe guest list for an earlier event at the home of John Podesta was limited to reporters who were expected to cover Clinton on the campaign trail. \\nThe email thread starts with Jesse Ferguson, the campaign’s Deputy National Press Secretary and Senior Spokesman, describing the venues and target audience of each gathering: \\nWe wanted to make sure everyone on this email had the latest information on the two upcoming dinners with reporters. Both are off-the-record. \\n1) Thursday night, April 9th at 7:00p.m. Dinner at the Home of John Podesta… This will be with about 20 reporters who will closely cover the campaign (aka the bus). \\n2) Friday night, April 10th at 6:30p.m. Cocktails and Hors D’oeuvre at the Home of Joel Benenson… This is with a broader universe of New York reporters. \\nThe “broader universe of New York reporters” includes several top news anchors for network and cable channels, many of whom are listed as a “yes” for the appearance: \\nFrom ABC: Cecilia Vega, David Muir, Diane Sawyer (who could only stay for 30 minutes), and George Stephanopoulos. \\nFrom CBS News: Norah O’Donnell. \\nFrom CNN: Brianna Keilar, Gloria Borger, John Berman, and Kate Bolduan. \\nFrom MSNBC: Alex Wagner and Rachel Maddow (“TRYING”). \\nFrom NBC: Savannah Guthrie. \\n“Yes” respondent George Stephanopoulos worked for Bill Clinton’s presidential campaign and was a Senior Adviser to the President during Clinton’s first White House term. Stephanopoulos does not disclose this fact when reporting on the 2016 Clinton campaign for ABC News. \\nThe nascent Clinton campaign invited Jeff Zucker and Phil Griffin, the presidents of CNN and MSNBC, respectively. Zucker declined while Griffin RSVPed “yes.” CNBC’s John Harwood \\nWikileaks’ release of emails from the Democratic National Committee showed then-DNC Chairwoman Debbie Wasserman Schultz scheduled or attempted to schedule private meetings with both executives.Other “yes” RSVPs come from journalists who have been sighted in the Wikileaks Podesta emails, outing them as friendly or fawning towards Hillary’s campaign. \\nCNBC’s John Harwood, who was also a moderator for a 2015 presidential debate, emailed Podesta frequently , practically begging for approval and access . Politico’s Glenn Thrush \\nPolitico’s Glenn Thrush also emailed Podesta periodically. On Monday, a newly-released email revealed a particularly humiliating incident where Thrush sent Podesta a passage from an upcoming article for his personal approval. \\n“Because I have become a hack I will send u the whole section that pertains to u,” Thrush wrote. “Please don’t share or tell anyone I did this… Tell me if I fucked up anything.” \\nSandra Sobieraj Westfall, Washington Bureau Chief at PEOPLE magazine, boasted two days after this confab that stories on Clinton’s campaign were generating “absolutely off the charts” traffic and asked for “color you can whisper on background” about what Hillary was up to. Joel Benenson – Clinton Chief Strategist \\nThe full RSVP list for Benenson’s gathering is shown in an attachment on a separate email : \\nThis is an off-the-record cocktails with the key national reporters, especially (though not exclusively) those that are based in New York. Much of the group includes influential reporters, anchors and editors. \\nThe goals of the dinner include: (1) Give reporters their first thoughts from team HRC in advance of the announcement (2) Setting expectations for the announcement and launch period (3) Framing the HRC message and framing the race (4) Enjoy a Friday night drink before working more \\nTIME/DATE: As a reminder, this is called for 6:30 p.m. on Friday, April 10th . \\nThere are several attendees – including Diane Sawyer – who will be there promptly at 6:30 p.m. but have to leave by 7 p.m. \\n… \\nFOOD: This will include cocktails and passed hours devours. \\nREPORTER RSVPs'"}, "time": 1742564461.2839448}