{"duration": 0.07117104530334473, "input_args": {"text": "'The Senior National   for Counter Terrorism has confirmed that police are now making   arrests “on a near daily basis”. Meanwhile, a noted security expert has estimated the number of “committed Islamists” in the country is “between 6, 000 and 10, 000”. [Metropolitan Police Deputy Assistant Commissioner Neil Basu revealed the astonishing scale of the struggle to contain terrorism in a statement outside New Scotland Yard on Friday.  “I wanted to reassure the public that our increased activity to combat terrorism over the last two years continues,” he said. The statement came following an “extraordinary day” in which police apprehended a migrant carrying a rucksack filled with knives in Whitehall and, in a separate incident, shot a woman in a niqab in a raid to foil an “active plot” in Willesden. “Activity continues around the clock to identify and stop these threats,” said Basu, before his shocking admission that “we are making arrests on a near daily basis”. Latest on London counter terror operations https:  .   —   Breitbart London (@BreitbartLondon) April 28, 2017,  Mr. Basu added a tribute “to the bravery of my uniform and detective colleagues” having previously alluded to the “horrors in London” on 22 March, when a radicalised Muslim ran down several people in Westminster before stabbing Police Constable Keith Palmer to death. “There are constant acts of immense bravery by officers  —   armed and unarmed  —   those that the public see when our officers run towards danger, just like yesterday, but a huge amount of unseen work that the public will never know about from us and our brilliant security services. ” “We are all one big blue family”: 5, 000 cops pay respects to PC Keith Palmer https:  .  pic. twitter.   —     Belle Fever (@bellefever) April 12, 2017,  Meanwhile, the director of the Centre for Security and Intelligence Studies at the University of Buckingham, Anthony Glees, has estimated there may be “between 6, 000 and 10, 000” extremists in Britain. “About 1, 000 young British Muslims have left the freedom of the UK to travel to the Middle East and become murderous foot soldiers of Islamic State,” Gleeson wrote in the Daily Mail. “Of that large group, 400 are believed to have returned. Only a tiny fraction  —   fewer than ten  —   have ever been brought to justice for their treachery. ” To tackle the threat, Gleeson recommended the number of officers in the security services be expanded from 3, 800 to 10, 000, and that the “useless” Terrorism Prevention and Investigation Measures (TPIMs) which Theresa May introduced as home secretary, be dropped to make way for the return of Control Orders “in even tougher form”.'"}, "time": 1742563117.5694807}