{"duration": 0.06416440010070801, "input_args": {"text": "\"Tesla's Solar Roof To Cost Less Than Normal Roof Says Elon Musk Nov 18, 2016 23 0 \\nWonderful news for the solar and renewable energy industry keeps coming in. Yesterday, Tesla and SolarCity shareholders approved Tesla’s acquisition of SolarCity, with 85% of the voters in favor. Depiction of a solar roofed home. \\nHowever, the big news of the day came when Elon Musk said that the cost to install their solar roofs will likely be less than a normal roof, even before adding in the electricity savings that will be gained from the homeowner: \\n“It’s looking quite promising that a solar roof will actually cost less than a normal roof before you even take in the value of electricity into account. So the basic proposition would be, ‘Would you like a roof that looks better than a normal roof, lasts twice as long, costs less and by the way generates electricity?’ It’s like, why would you get anything else?” \\nA few weeks ago, Elon Musk unveiled Tesla’s plan for their solar roofs which he presented a couple weeks ago. The plans include four different types, which can be seen in detail here . The solar cells are tucked in behind the glass so that the roofs look appealing, sharp and clean. \\nMusk also said that the glass tiles can incorporate heating elements that melt snow while still generating electricity. He stated further that such a process wouldn’t be energy intensive to do so, but would be extremely net positive. \\nThe four types of roofs are expected to be available in 2017, starting with 1-2 of them from the beginning. Tesla is also planning to unveil the Model 3 in 2017 , which will be much less expensive than the Model X and Model S. Tesla’s goal with the Model 3 is to make this type of vehicle available to a wider audience. \\nWith good reason too, as renewable energy is experiencing much momentum right now in the world. As we reported four days ago, Tesla made more money in one quarter this year than all U.S. oil companies made together last year. Jointly due to falling oil prices and the global awakening to the need for renewable energy, these oil companies actually lost over $67 billion last year. \\nAdditionally, it was announced in the UK recently that for the first time ever, solar power supplied more energy to the UK this summer than coal-generated electricity. \\nAlso, back in September, China, Russia, Japan and South Korea announced plans to create the Asian Super-Grid , which will consist of wind and solar energy to help power those countries, as well as places in Europe, Southern Africa and Southeast Asia. \\n2017 is shaping up to be quite a year in many different regards. For renewable energy, the year and years ahead look extremely bright. If Tesla can indeed get their solar roof price below regular roofing prices, this will catalyze humanity’s transition into clean, sustainable and renewable energy very quickly. Let’s intend for the best! \\nLance Schuttler graduated from the University of Iowa with a degree in Health Science and does health coaching through his website Orgonlight Health . You can follow the Orgonlight Health facebook page or visit the website for more information and other inspiring articles.\""}, "time": 1742563514.5620205}