{"duration": 0.03321957588195801, "input_args": {"text": "'It started with a Detroit Free Press reporter tweeting that when President Donald Trump attempts to hold Melania’s hand as they arrived in Tel Aviv, the first lady “slaps away” her husband’s hand. [It appears First Lady Melania Trump slaps away Pres. Trump’s hand as he reaches to hold it while on tarmac in Israel pic. twitter.   —   Niraj Warikoo (@nwarikoo) May 22, 2017,   Despite repeated views of the video in which that conclusion seems doubtful at best and impossible at worst, the   media eagerly reposted the video, with many including a narrative based on it that calls into question the Trumps’ relationship.  —   Marie Claire: “ Yikes. Speculation around Donald Trump and Melania Trump’s marriage is about to get a whole lot more intense. In a video of the pair walking away from Air Force One after landing in Tel Aviv, Melania Trump can be seen slapping her husband’s hand away when he reaches out to hold hers. ”  —    Slate: One imagines that many world leaders throughout history —  especially those named Bill Clinton —  have made public appearances with their spouses while their relationships, in private, were less than serene. Still, you rarely see tension break through in the way it appears to have done in the video above of Donald and Melania Trump’s arrival in Tel Aviv Monday. To use a few technical terms commonly thrown around in the world of geopolitical analysis: Yikes! Ouch! No bueno! Melania Trump, of course, does not live in the White House, ostensibly because she is staying with Barron Trump while he finishes his school year in New York City.  —   Vibe, “No action has encapsulated the essence of the presidency of Donald Trump quite like his wife, First Lady Melania Trump, slapping his hand away during their recent visit to Tel Aviv. ”  —   Albany New York Times Union: Headline: “Does Melania Trump hate her husband (with video)?” Kristi Gustafson Barlette says in her article: Many suggest the reason Melania and Barron aren’t relocating from their penthouse in New York City to Washington, D. C. has more to do with the First Lady’s feelings for her husband than her desire to keep the couple’s son in his school. And then today there’s the video circulating with the headline that Melania slapped Donald’s hand away when he tried taking it on the tarmac in Israel.  —   UK Express, The First Lady slapped away the President’s hand, in front of the world’s media, as they were greeted by Israeli prime minister Benjamin Netanyahu and wife, Sara, who walked side by side as they left. With Mr. Netanyahu and his partner holding hands as they strolled down the red carpet, President Trump offered the same gesture to his wife. However, the First Lady appears to bat away his hand as they continue their journey away from Air Force One.  —   Cosmo: “Almost immediately after arriving at Tel Aviv’s airport to kick off their   trip to Israel, cameras caught Melania Trump swatting away the president’s hand after he repeatedly reached out to hold hers. The moment can be seen about four seconds into the above video. ”'"}, "time": 1742628404.6453025}