{"duration": 0.18347764015197754, "input_args": {"text": "'Email \\nThe WikiLeaks e-mail releases are not the only revelations Hillary Clinton and the Clinton Campaign team are cursing these days. Official State Department documents released pursuant to Freedom of Information Act (FOIA) requests and lawsuits are also delivering severe body blows to Team Clinton’s White House aspirations. \\nOn Wednesday, Judicial Watch, the government accountability watchdog group, released nearly 70 pages of Department of State (DOS) records confirming that, while secretary of state, Hillary Clinton and her top aides, Deputy Chiefs of Staff Huma Abedin and Jake Sullivan, received and sent classified information on their non-state.gov e-mail accounts. Former Secretary Clinton has repeatedly denied — in interviews, debates, testimony, and speeches — that she divulged any classified material, even though the e-mail evidence and FBI Director James Comey’s testimony contradict that claim. At other times she has fudged, waffled, and evaded questions on this subject, bringing to mind the infamous weasel quote of her husband, then-President Bill Clinton, “It depends on what the meaning of ‘is’ is.” \\nThe new Judicial Watch e-mails are completely separate from the WikiLeaks e-mails, which the Clinton campaign and its allies have tried to discredit by claiming, without foundation, that they are the product of a Russian intelligence operation. The Judicial Watch documents were obtained recently in response to a court order from a May 5, 2015 lawsuit filed against the DOS after it refused to cooperate with a Freedom of Information Act (FOIA) request. That request was seeking: “All emails of official State Department business received or sent by former Deputy Chief of Staff Huma Abedin from January 1, 2009 through February 1, 2013 using a non-‘state.gov’ email address.” \\nThe newly released documents, which are now also available on the State Department website, were obtained after the U.S. District Court for the District of Columbia ruled in favor of the watchdog group in January ( Judicial Watch, Inc. v. U.S. Department of State ). There are thus no grounds for questioning the provenance or authenticity of these recent Clinton e-mail revelations, since they come directly — albeit very reluctantly — from the State Department. Among the new documents are e-mails showing that Hillary Clinton used the clintonemail.com system to ask Huma Abedin (also on a non-state.gov e-mail account) to print two March 2011 e-mails that were sent from former British Prime Minister Tony Blair (using the moniker “aclb”) to Jake Sullivan on Sullivan’s non-state.gov e-mail account. \\nThe Obama State Department has redacted the Blair e-mails under the FOIA Exemption (b)(1) rule which allows the withholding of classified material. The material is marked as being classified as “Foreign government information” and “foreign relations or foreign activities of the US, including confidential sources.” The irony is beyond rich, is it not? Secretary Clinton says she didn’t send any classified material by private, unsecured e-mail — while the State Department refuses to release certain of her private e-mails, claiming exemption because, says DOS, the e-mails contain classified information. Reasonable observers might be inclined to take that as an official confirmation that Hillary Rodham Clinton has lied and weaseled — repeatedly, and under oath — on this important national security matter. Is there any other reasonable way to view it? \\nIn another private e-mail, Clinton asks Huma Abedin how appointments in Washington, including a four-hour meeting concerning the Obama/Clinton war on Libya, would affect her vacation schedule in the Hamptons, the fabulous playground of the ultra-rich. As an aside, the Clintons have been longtime seasonal residents of the Hamptons, where many of their Wall Street and Hollywood billionaire cronies (and donors) own eye-popping mansions on sumptuous estates. Hillary, who regularly tries to make political hay by verbally attacking the rich “one percent,” apparently suffers no qualms of conscience about taking millions of dollars in speaking fees from the most notorious of the one percenters at Goldman Sachs, JPMorgan Chase, Citibank, Blackstone, etc. Nor do she and Bill flinch at spending $50,000 per week for a beachfront mansion in the Hamptons near their movie mogul pal (and campaign contributor) Harvey Weinstein. Their populist rhetoric and faux working-class appeals notwithstanding, the Clintons are happiest and most comfortable consorting with the top one percent of the top one percent. But back to the e-mails. Responding to a message that details the sensitive Libya meetings in Washington, D.C., Clinton e-mails Abedin on August 26, 2011: “Ok. What time would I get back to Hamptons?” As with tens of thousands of Clinton DOS e-mails, this discussion relative to classified meetings, plans, and official policies, took place on private, unsecure e-mail accounts. \\nThe new Judicial Watch documents also include advice to Hillary on Libya from veteran Clinton operative Sidney Blumenthal, more infamously known to friend and foe alike as “Sid Vicious,” a reference to the raunchy and rancorous bass guitarist of the punk rock group the Sex Pistols. A reliable hatchet man for the Clintons for three decades, Blumenthal could always be counted on to come up with, and to carry out, dirty tricks to discredit and undermine the Clintons’ opponents. Trouble is, he also attacked and alienated many of the Clintons’ closest confidants, friends, and staff members. When Hillary Clinton wanted to bring Blumenthal on staff at State, President Obama nixed the idea. \\n“President Obama would not allow it: key White House staffers had grown to detest the man,” writes James Warren, in an article on Blumenthal in Vanity Fair last July. “Two of them — Press Secretary Robert Gibbs and Senior Adviser David Axelrod — threatened to quit if Blumenthal was hired. They believed that he had been involved in spreading unsubstantiated allegations against the Obamas during the 2008 Democratic primary, as detailed in the campaign chronicle Game Change , by John Heilemann and Mark Halperin.” \\nIndeed, as has been firmly established, it was Hillary Clinton’s hit man Sid Vicious Blumenthal, not Donald Trump, who started the Obama “birther” controversy, during the 2008 campaign when Clinton and Obama were locked in a fight for the Democratic nomination. (See here and here .)But an operative with Blumenthal’s unique talents for intrigue is always in demand at Foggy Bottom and other shadowy dens of the DC Beltway netherworld. His official rejection at State didn’t mean he was totally out, nor did it prevent him from collecting a check from the Clinton Foundation, where he began pulling down a $10,000/month stipend as a key personal fixer/ambassador for Bill Clinton. He also began collecting a $200,000/year salary as a writer/staffer for Media Matters , the ultra-far-Left media group headed by an equally venomous viper, David Brock, and copiously funded by George Soros, and the Rockefeller, Ford, and Carnegie foundations — among others. But Blumenthal’s big payoffs would be in consultancy fees and partnerships with companies connected to the Clinton Foundation, who would get contracts through the good graces of Hillary Clinton’s State Department. And it is those DOS-Clinton Foundation ties that most interest Clinton’s critics concerned about the national security and conflict-of-interest implications of her relationship with the notorious political operator. Blumenthal had a personal financial stake in Libya, where he was using his connections to win U.S. government contracts for weapons providers, such as Osprey Global Solutions . The latest Clinton/Blumenthal e-mail release is sure to reignite the Blumenthal furor that erupted during last year’s incendiary hearings on Secretary Clinton’s role in the deadly 2012 Benghazi fiasco. House Benghazi Committee chairman Representative Trey Gowdy then grilled Secretary Clinton on her relationship with, and reliance upon, Blumenthal for important Libya decisions. “While Blumenthal, an old friend of the Clintons, admittedly knew little about Libya and had not ever been to Libya, Clinton seemingly read every one of his emails on the topic that began appearing out of nowhere in February 2011,” Gowdy wrote in a letter to Representative Trey Gowdy Elijah Cummings, a Democrat member of the Benghazi Committee who ran interference for Clinton. \\n“Nearly half of all the emails sent to and from Secretary Clinton regarding Benghazi and Libya prior to the Benghazi terrorist attacks involved Sidney Blumenthal,” Chairman Gowdy wrote. “That number — nearly half — is simply astonishing.” The 13-minute segment of the House Benghazi hearing imbedded below is one of the key sections of the hearings in which Representative Gowdy roasts Secretary Clinton to a fare-thee-well on her e-mails from Blumenthall that she insisted were “unsolicited” and were merely part of her effort to avoid Washington group-think, and not get “caught in a bubble.” \\nObviously, for Clinton, Blumenthal, and partners, the dark money and blood money involved in these Libya deals would be best left in the shadows. Hence the need to resort to private e-mail. There are additional reasons, of course, for the clandestine activity. Since then-Secretary Clinton’s boss, President Obama, had forbidden Blumenthal’s employment at State, and since Sid Vicious had alienated top staff members in the administration, it is easy to see why Clinton would use a back channel to communicate with the hatchet man/bag man, so as not to tip off Blumenthal haters at DOS and the White House. For these reasons (and perhaps others) Clinton insisted Blumenthal’s March 9, 2011 Libya memo be printed “without any identifiers.” \\nAmong the newly released Abedin e-mails is a lengthy exchange giving precise details of Clinton’s schedule using unsecured government e-mails, Judicial Watch notes. The e-mail from Lona J. Valmoro, former special assistant to Secretary of State Clinton, to Abedin and Clinton reveals exact times (including driving times) and locations of all appointments throughout the day. Yet another itinerary e-mail provides details about a meeting at the United Nations in New York at 3:00 on Tuesday, January 31, 2012, with the precise disclosure, “that would mean wheels up from Andrews at approximately 12:00pm/12:15pm.” \\n“These emails show that Hillary Clinton isn’t the only Obama official who should be worried about being prosecuted for mishandling classified information. Her former top State aides (and current campaign advisers) Huma Abedin and Jake Sullivan should be in the dock, as well,” said Judicial Watch President Tom Fitton. “The Obama State Department has now confirmed that Clinton, Abedin, and Sullivan used unsecured, non-government email accounts to communicate information that should now be withheld from the American people ‘in the interest of national defense or foreign policy, and properly classified.’ When can we expect the indictments?” \\nIndeed, when? Team Hillary’s “Run-out-the-clock strategy” has almost worked — and it may yet succeed. However, there are, undoubtedly, among the operatives in her inner circle many with white knuckles and faint hearts, wondering if they will make it to the November 8 finish line before the Clintonworld corruption and criminality spill out in eruptions too huge even for her Big Media allies to cover up.'"}, "time": 1742564219.388572}