{"duration": 0.056009769439697266, "input_args": {"text": "\"NEW DETAILS: Trump’s Gaffe With Khan Family Was Even Worse Than We Thought (VIDEO) By Natalie Dailey on October 29, 2016 Subscribe \\nRepublican presidential nominee Donald Trump made a fool out of himself at and after the Democratic National Convention. Trump got into a feud with the Khan family, a Gold Star family who spoke about him. \\nTrump apparently didn’t know what a Gold Star family is. This term is generally used to describe families who have lost a loved one in the military. \\nPaul Manafort, former advisor to George H.W. Bush’s, Gerald Ford’s, and Bob Dole’s presidential campaigns, became an advisor for the Donald Trump campaign during the general election season. His plan was for Trump to go low profile, so the media would then focus on his rival, Democratic presidential nominee, Hillary Clinton. \\nManafort was mad when Trump went after the Khan family instead of focusing on the issues. He said: “The election is about the American people, it’s not about you.” \\nNow that we have less than two weeks until the election, Trump wants to rehash some of his craziest feuds. Trump said that if he were president Humayun Khan would still be alive. Khizr said : “This is the most cruel thing you can say to grieving parents, that if I was there this would not have happened. There’s no sincerity in those remarks … This is one character that a leader must have to be the leader of a great country, to be the commander-in-chief of the Armed Forces of the United States: empathy. And this person totally lacks that.” \\nKhan is now joining Democratic presidential nominee Hillary Clinton on the campaign trail. \\nCheck out the campaign ad he made for the Clinton campaign: \\nAnd watch Khan’s entire speech from the convention : \\nFeatured image via YouTube screenshot . About Natalie Dailey \\nHi, I'm from Huntsville, AL. I'm a Liberal living in the Bible Belt, which can be quite challenging at times. I'm passionate about many issues including mental health, women's rights, gay rights, and many others. Check out my blog abravealabamaatheist.com. Check out my other blog weneedtotalkaboutmentalhealth.com Connect\""}, "time": 1742561786.4651215}