{"duration": 0.0365447998046875, "input_args": {"text": "'Hamas has turned down Egypt’s request to extradite detained jihadists who have been involved in insurgency against the Egyptian army, a Hamas official told Breitbart Jerusalem. [Hamas’ deputy diplomatic leader Mousa Abu Marzouk and former Prime Minister Ismail Haniyeh met with Egyptian military officials this week.  “Extraditing jihadists to Egypt would send significant shockwaves across the Gaza Strip and will create a backlash among Hamas loyalists, most notably its military wing operatives,” a Hamas official told Breitbart Jerusalem. He said the fate of the jihadists detained by Hamas was a central part of the negotiation between the two parties and the main impediment to progress in an overall positive process of rapprochement with Egypt. “Haniyeh and Marzouk gave all the information they had about Islamic State loyalists in the Gaza Strip, including some specific names that the Egyptians raised,” he said. “They also pledged that they’ll pass on any information their interrogation may yield. But extradition remains a bone of contention. ” He said that security arrangements across the border to prevent the movement of militants between Sinai and Gaza have been discussed, as well as the establishment of a joint force. He failed to disclose any further details about this. Meanwhile, Hamas has continued to loosen its grip on IS sympathizers in Gaza. A Gaza jihadi affiliated with IS ideology said that for the first time in almost a year Hamas has allowed detainees to be visited by their families. Abu Baker Almuhajer surmised that Hamas is hoping to persuade Welayat Sinai, IS’s Egyptian affiliate, to send a weapons shipment it has delayed. Speaking to Egyptian journalists in Cairo, Marzouk said that Hamas “turned over a new leaf with Egypt, and no longer shelters anyone who may be a risk to Egypt’s national security. ” He said Hamas’ relationship with Egypt was better than it had ever been, and that the Egyptian judiciary had failed to link Hamas to attacks against Egyptian targets. “Currently, there are no more outstanding issues between us and our Egyptian brothers,” he said. “We received from them a wanted list, comprising very few names, and we’ll discuss each of them individually. ”'"}, "time": 1742561983.2163126}