{"duration": 0.06852221488952637, "input_args": {"text": "'Trump Supporters Get Last Laugh After Hillary Disrespects Them On Radio Show Posted on October 27, 2016 by Rebecca Diserio in Politics Share This \\nHillary Clinton is once again pandering to the black community as she’s often done, changing who she is depending on who she is talking to. However, just yesterday, she made a wrong move, hitting Donald Trump’s supporters as she told a hip-hop radio show that Trump and his supporters need to do one thing. Unfortunately for her, she quickly learned that she can’t talk trash and get away with it anymore. \\nHillary showed up on some hip-hop radio station in New York yesterday, and the interview was pure propaganda as she tried to pander to the black community. Hillary even agreed that she gets her fashion look from Death Row Records’ Suge Knight and Snoop Dogg. \\nWherever she gets it, that look is hideous and horrible. Not to mention, Death Row Records was made famous by a song titled “F*ck The Police.” That seems rather fitting since Hillary doesn’t care about cops. She just needs black voters to show up on election day. Hillary agreed with a black radio host that she gets her look from Death Row records, a known cop-hating label that produced the song “F*ck The Police.” \\nAfter talking about her failed fashion sense, she had to get her jab in on Donald Trump, but she took it further than she should have. The Breakfast Club radio host told Hillary that the whole country is divided and that she has to bring it back together. This sparked Hillary to launch her attack, saying: \\n“ What Trump has done is to make it possible for people who have racist and sexist and all kinds of prejudices and bigotry to put them right out there ,” Hillary said. “But what he’s done really [is] unleashed a lot of darkness and divisiveness.” \\nWe all know the only game Hillary’s got going is this thinly veiled narrative that Trump supporters are racist, sexist, and violent. We are “deplorables,” a remark she purposefully made to describe Trump supporters because it is her campaign plan. \\nUnfortunately for her, Trump supporters aren’t stupid, and those who are very active on social media fought back at her false rhetoric. For hours after her comments on that radio show, the hashtag # HillarysBullies was trending worldwide. \\nTrump supporters made a mockery out of Hillary , sending a truth bomb straight at her. It’s Hillary who is purposely dividing the country with her rhetoric. It’s Hillary who hired paid thugs to beat up Trump supporters. Even Mike Pence got into the act, and below is his tweet to Hillary: \"I\\'m Hillary Clinton & I approve this message.\" #HillarysBullies were bought & paid for. pic.twitter.com/onahYVpGlw \\n— Deplorable VP (@MikePenceVP) October 27, 2016 \\nHillary is losing this election. Every indication outside the mainstream press shows that there’s little to no enthusiasm for her campaign. Record-breaking numbers of Trump supporters have been seen across the country where early voting is allowed, and even today, Hillary needed Michelle Obama to beg North Carolinians to bring out people to vote. \\nWith only days left, Trump supporters slapped Hillary hard on social media, and all she’s got is a weak campaign slogan and the lie that Trump’s a racist and so are his deplorable supporters. From her small rally sizes, it’s clear, Americans smell her bullcrap and no one really wants to hear that screeching voice or see her win.'"}, "time": 1742562050.101251}