{"duration": 0.10492587089538574, "input_args": {"text": "'QUICK, IS KLM a brand of milk, the call letters for a radio station or a    Dutch airline? Frequent fliers probably know the correct answer, but market research shows that many Americans often think KLM means either milk or music. So the airline, which is formally known as Royal Dutch Airlines, is embarking on an advertising campaign that is heavy on   humor to explain what the letters mean. “The brand has not been so visible, but we want people to know it’s an airline, and that it’s Dutch,” said Christophe Attard, the vice president of marketing for Air  . The carrier, whose name in Dutch is Koninklijke Luchtvaart Maatschappij, merged with Air France in 2004, but the branding for the two airlines is separate. “We wanted KLM to reflect the nationality of the country,” Mr. Attard said. “It’s friendly and innovative. ” And the humor is  . Ken Marino, an American actor who starred in the NBC sitcom “Marry Me,” wryly comments on questions such as “What is an airline?” and “What is a flight attendant?” He delivers his remarks with an exaggerated sincerity intended to provoke a smile or a chuckle from social media viewers, who are the target audience of the video. The humor makes a product or service more approachable, said John Limotte, chief executive of Mustache, a video production company based in Brooklyn that worked with KLM on the campaign. “It’s not a   or broadly comedic humor, but more of a charmingly clueless approach where stating the obvious is likable,” he said. The approach underscores KLM’s effort to solidify its American market, where it currently has eight gateways for passengers to fly directly to Amsterdam. The Dutch carrier is striving to keep its footing against competition from   rivals, as well as carriers based in the Middle East that are trying to expand their service networks. And, like other airlines, KLM must contend with the impact of terrorist attacks on its leisure travel business. KLM said   traffic is 15 percent of its   business, and it has experienced a 7 percent increase in traffic between the United States and Europe since 2014. “The United States, for decades and in the future, serves as the backbone of our worldwide operations outside of Europe,” said Pieter Elbers, KLM’s president and chief executive. “It is an incredibly important market to the company. ” Last year, KLM expanded its business between Amsterdam, Atlanta and Los Angeles, and began direct service between Salt Lake City and Amsterdam this year. In November, the carrier plans to introduce direct service between Amsterdam and Miami. The airline must first ensure that American travelers know what it is. The company commissioned a consumer awareness survey two years ago to gauge familiarity with its brand. The survey, conducted by phone and in person at airports, found that potential customers did not have a clear idea that KLM was an airline, Mr. Attard said. One reason could be that KLM and Air France partner with Delta Air Lines on   flights, so tickets show Delta’s name first. The Dutch carrier’s name was little seen in the United States for years because of a joint venture from 1997 to 2009 with Northwest Airlines, which handled sales in North America. That ended after Northwest’s merger with Delta. Currently, KLM and Air France  —   members of the SkyTeam global airline alliance  —   offer a points program called Flying Blue but market their brands individually. To distinguish KLM’s separate identity, the carrier decided to refresh its brand: It retained its blue letters on a white background and longstanding logo, a crown, but enlarged it. Mustache developed four brand identity videos with the   droll humor KLM was seeking. The creative agency drew attention to its understated humor with its   2014 travel video series on the Netherlands, called “Holland. The Original Cool. ” The first video in the series received more than a million views on YouTube. Humor in advertising is appealing “because the entertainment aspect is the hook to get people to watch,” said Michael Lewis, an associate professor of marketing at Emory University’s Goizueta Business School. “It gives legitimacy to a brand that’s less familiar,” he said. “That is more important for KLM than for carriers like Air France or British Airways, which have the country in their name. ” Mr. Lewis added: “But while differentiating brands has been a holy grail for airlines, more consumers are viewing the airline trip as a commodity product. It’s the ability to go to point A, then to point B, except, perhaps, for frequent fliers who still want to have access to upgrades and airport lounges. ” Mr. Attard, however, said market research showed a perceptional difference between KLM and Air France, which he said was viewed as snobbish and expensive. KLM wanted to underscore its innovation, which the airline had demonstrated through a partnership with Facebook that enabled booking flights via the Messenger app, he said. KLM’s new campaign will appear on Facebook, Twitter, Instagram and YouTube, as well as on a site, ItsAnAirline. com. It will feature interactive elements, including letting visitors earn loyalty points by finding hidden objects.'"}, "time": 1742562799.6811914}