{"duration": 0.0680532455444336, "input_args": {"text": "'A suburban Chicago high school is taking the Obama education agenda all the way with new classes and seminars that teach kids that whites are committing “genocide” against blacks, that America is violating the “rights” of transgender Americans, that whites are suppressing the voting rights of blacks, and a long list of other   activist ideas. [New Trier Township High School is one of the Chicago area’s premier high schools in the tony suburb of Winnetka, a lake shore town north of Chicago. But, along with teaching math, science, English, and history, the school is launching into a major   indoctrination project based on Obama’s agenda of liberal activism.  An exposé of the agenda by the Illinois Family Institute shows that “progressivism” is coming fast and furious at New Trier’s kids. The list of classes and speakers for this new series is being called “a rather bold and raw effort at   propaganda with decidedly          and bigoted biases on display. ” Some of the titles of these seminars and workshops are “Whose Civil Rights?: Transpeople of Color Navigating the U. S.,” “21st Century Voter Supression,” “Blackenomics 101 (The Movement, The Music, The Solution),” “Mass Incarceration: Race and Prison in America,” and “R. E. A. L.: Race, Equity, and Leadership  —   A Unique Course for High School Students. ” Revisionist history is also a major topic of this agenda and will include programs titled, “A People’s History of Chicago” and “Western Bias in Science. ” Even the smallest children will be targeted for Obama’s   project with a program being called, “Developing Empathy  Acceptance by Reading Picture Books to Children. ” As part of the “Blackenomics 101” program, a special rap song has been written which includes the lyrics, “Blackenomics nigga, Black beat black, nigga” and “Die motherf*cker die. ” This agenda, though, is not something isolated to one Chicago school it is part and parcel to a huge program Barack Obama has forced onto schools all across the country. As F. H. Buckley, a professor at Scalia Law School, recently revealed in an   at The New York Post, these sort of extreme,   programs based on a virulently   agenda is part of Obama’s “New Civics” program imposed on schools that receive federal funding. “Making Citizens: How American Universities Teach Civics” shows how the Obama DOE has indoctrinated college students through progressive “New Civics” programs that seek to repurpose higher education away from the study of Western institutions, and even away from scholarship in general, in order to make little   community organizers of our students. The goal of the New Civics movement, concludes the NAS, is to teach students “that a good citizen is a radical activist,” putting “political activism at the center of everything that students do in college, including academic study,   pursuits, and   ventures. ” Instead of a civics education that studies the foundations of American government, New Civics teaches students “how to organize protests, occupy buildings, and stage demonstrations. ” Programs like those described above being forced on kids at New Trier are also being programmed into schools all across the nation from the earliest grade school classes to the halls of higher education. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742562441.1764276}