{"duration": 0.07535934448242188, "input_args": {"text": "'On Thursday’s Breitbart News Daily, Dr. Sebastian Gorka, deputy assistant to President Trump and former National Security editor for Breitbart News, addressed the judicial injunction against President Trump’s revised executive order on immigration. The judge blocked Trump’s order on the grounds that it constituted unfair discrimination against Muslims. [“It’s very simple,” Gorka told SiriusXM host Alex Marlow. “There is absolutely no way on God’s earth that they can make that case, that this is something to do with xenophobia or a religious group. ”  “There is not one instance on the campaign trail or after the president took office in which the travel suspension was mentioned without reference to national security,” he pointed out. “It was never mentioned that we’re doing this because of a certain religious group. In every single instance, every campaign speech, every statement out of the White House after January 20, this measure was linked to the security of the United States. National security is the prerogative of the    and immigration  —   including immigration standards and the issuance of visas  —   is not a local, is not a federal, is not a judicial function. It is a function of the White House and the executive arm. ” “This attempt to block a national security executive order will fail,” he declared. Gorka said this interference with the president’s order illustrates “the depth of the problem” with judicial activism. “If we truly believe in a republic, if we believe in checks and balances, and if we believe in separations of power, then the executive cannot bring constitutional decisions. That’s the job of the Supreme Court. Judges cannot behave as if they are the executive and determine what is good for the national security of the United States,” he said. “When they proceed to do so, they have stepped out of their mandate. They have stepped out of the way we constructed this country originally. ” “This is a perfect case study of just how much politics has intruded into the judicial sphere,” Gorka said. “As such, we have to welcome it because this is when the scales fall from the eyes of many, many Americans, and we understand that this isn’t about the law. This isn’t about the judicial process. This is about politics. ” Marlow turned the conversation to the release of President Trump’s budget and its basic theme of “raise military spending, cut spending from the various agencies. ” “If there’s one thing in the meetings I’ve been a party to with the president over the last eight weeks, one of the most trying issues for him, again and again and again, is waste  —   the gargantuan amounts of waste we have inside the federal government,” Gorka said.  “That’s why we have our rule that you can’t bring a new regulation unless two are rescinded in its place. That’s why we’re concentrating on what really matters to national security after eight years of cuts, after eight years of undermining our armed forces, and saving money where we can,” he explained. “When you are as successful as Donald J. Trump was in the private sector, the bottom line really matters,” Gorka said. “This is a man who cares about national security but also cares about your pocketbook. Whether you voted for him or not, he is driven by saving money for the U. S. taxpayer, and that’s what you’re going to see in the budget. ” Gorka said the biggest military budget issue at the moment is combat readiness. “The Marine Corps, for example, is having to cannibalize not old aircraft, but cannibalize current aircraft, that are in current use, to keep other aircraft flying. That is just untenable. This is the United States of America. We don’t do that. One of the key priorities is going to be making sure that our warfighters have what they need to prosecute their missions,” he vowed. Marlow described President Trump’s $1. 2 billion infrastructure plan that could be difficult to sell to   voters and challenging to execute in a manner that provides good return on the taxpayers’ investment. “As somebody who travels a fair bit, you just have to understand that if you go around other parts of the world  —   whether it’s Europe, whether it’s Asia, or elsewhere  —   we have lagged behind,” Gorka contended. “We have seen our infrastructure not looked after in recent decades. It simply is not at the standard that would match our role in the world. ” “So number one, there is a problem. Number two, when the president first announced this initiative, he chose his words very, very carefully. He didn’t say it’s one trillion dollars’ worth of taxpayer money. He said there will be this initiative, but it’s not all going to come out of your pocket. That’s very important to understand. We are looking at more than just the federal budget to fund these kinds of measures,” he noted. “Lastly, it’s not pork barrel. It’s not simply projects, bridges to nowhere. It’s about getting America back on track, and infrastructure is essential to that. You can concentrate on jobs for Americans, you can concentrate on the automotive industry, you can concentrate on manufacturing  —   but if you can’t move those people, if you can’t move those materials, then it’s only one small part of the national economy,” he argued.  “Infrastructure is the veins, it’s the system, it is the lifeblood of the economy,” he stated, agreeing with Marlow’s proposition that effective execution of the president’s infrastructure plan would leave a “great legacy” for Trump. Marlow asked if there was any progress to report on President Trump’s allegation that the Obama administration “wiretapped” his campaign. “I’m not going to speak for the president, but as somebody who works in the national security sphere, I’m really concerned with this issue in general,” Gorka replied. “We have now had for months and months and months and months this absurd obsession, this talk, this insinuation of the Russian connection. Where’s the smoking gun? What is the former administration and their lackeys in the media actually positing?” “There’s no ‘there’ there,” he said. “A phone call was made to an ambassador. Okay, but what else is there? There’s nothing. So that’s why the president said, ‘Okay, you want to open this can of worms? Let’s look at the whole issue.’ Let’s go right back to Russian involvement on Left and Right, as far back as the beginning of the Obama administration. Let’s shine light on this issue. ” Gorka said there was a deeper issue: “When we know that sensitive,   sensitive intelligence, transcripts of conversations with U. S. individuals are being given lock, stock, and barrel to the mainstream media, that is what we call the political exploitation of intelligence. That’s not what happens in banana republics, that’s what happens in authoritarian nations. That is something that we must look into. When you start to use the intelligence community’s assets or their product for partisan political purposes, you undermine the whole democratic system. That’s why we want to shed light on all of these issues, to finally stop this kind of perverted exploitation. ” Marlow said Democrats seem determined to provoke hostility between Trump and Russia by pushing the narrative of Trump as either a sympathizer of Russian President Vladimir Putin or his pawn. He noted that Breitbart News was strongly critical of Russia during Gorka’s tenure as National Security editor and remains so under editor Frances Martel. Gorka suggested asking Obama and Clinton hands like Ben Rhodes and John Podesta why the Democrats are pursuing this strategy. He chuckled as Marlow promptly issued instructions to invite them as guests for the next edition of Breitbart News Daily. “I think there’s a couple of potential explanations,” Gorka speculated, to tide the audience over until such time as Rhodes and Podesta swing by the studio to explain themselves. “With regards to Syria, I think some personal animus was built up between Moscow and the last administration. Beyond that, I think it’s laziness. I think it’s scapegoating. ” “I take umbrage at your saying Frances takes a stronger line than I did, but we can talk about that later,” he added humorously. “My family history is very clear, what my parents went through under communism and et cetera. ”  “The bottom line is they need an explanation for why they lost,” Gorka said of the Democrats. “If you cannot admit that your candidate was an appalling candidate who lost because she had no message except ‘I’m a woman and I deserve to be president,’ you’re going to have to find an answer as to why she was trounced. The easiest one is Russia, WikiLeaks, the KGB, the SVR, everything else. I think it’s handy, it’s easy, it’s lazy, it’s scapegoating. ” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742628559.023758}