{"duration": 0.01848745346069336, "input_args": {"text": "'Comments \\nDuring the middle of the night, the city of Des Moines in Iowa was rocked with violence as a man opened fire on police officers in “ambush” style, killing two. The suspect is a white male, as per police reports, and has just been taken into custody. \\nWhat we do know about this man is that his mind is a whirlwind of hatred and hypocrisy. He was kicked out of a football game in October for waving a Confederate flag at football players kneeling during the National Anthem in protest of police violence against blacks. \\n“I was offended by the blacks sitting through our anthem. Thousands more whites fought and died for their freedom. However this is not about the Armed forces, they are cop haters.” said Greene in a rant tinged with white nationalist themes, three weeks before he would ambush two policemen in their patrol car and killing them both. \\nThe Trump camp is silent as a man who supports him embarks on an act of anti-government violence that Trump himself has been calling for . The muted response is infuriating, especially for the blacks and Muslims of America who have been demonized by right-wingers for trying to stop racial/ethnic profiling and ask they be given the benefit of the doubt that white Americans get. \\nWhy does the media refuse to call this what it is – terrorism? Where was Greene radicalized? Why won’t Donald Trump say “radical white terrorism?” Is he part of a larger white supremacist terror group? We need to put a stop to white men entering this country until we can figure out what the hell is going on. Sound familiar? \\nWhile civic institutions like Black Lives Matter and the Council of American-Islamic Relations (CAIR) are smeared as terror groups for daring to ask some uncomfortable questions and demanding that the rights bestowed upon the American people are enforced equally for all her citizens, the real terror threat – as confirmed by the FBI, no less – comes from white conservatives. \\n'"}, "time": 1742628511.1478465}