{"duration": 0.032744407653808594, "input_args": {"text": "'0 comments \\nSometimes racial profiling doesn’t work in your favor. That’s what an MSNBC reporter found out when he tried to interview a group of three black citizens in line for early voting in South Carolina. \\nThe reporter deliberately tried to bait the black voters into saying something negative about Trump, and was shocked to find out that they were actually supporters of the Republican nominee. \\n“We’ve heard a lot of criticism of Trump’s inner city policy, but what do you make of that criticism? I’m sure you’ve heard it…” questioned the reporter. \\n“Well, I think that Trump’s reaching out to all citizens, including African-Americans. I think he’s trying to address a problem,” responded one of the women. \\n“It shouldn’t be a problem if you address that there’s something’s wrong and that you’ve got a plan to want to help people. That what a president should do for us, he should reach out and try to help people and address problems that are going on in our country.” \\nNot yet deterred, the reporter tried to bait them again, asking, “Some of the criticism has been because he’ll often say, ‘What do you have to lose?’ Being specifically African-American, what do you think about that criticism?” \\n“My word to all black Americans, one thing I would like to say,” answered another woman. “Let’s not be deceived. Look at the record. Look at the promises that have been made over the past from the Democratic Party. We’re not voting for a party, we’re voting for a man who has been standing by…” \\n“He loves America! That’s what I love about him – he loves America. We need somebody that loves America. And he also loves all people. All people! And there’s that deception out there that he has no black supporters. WRONG! He does!” \\nWell, all that was just way too much Republican support for MSNBC to handle and the reporter immediately ended the interview. \\nSee it for yourself:'"}, "time": 1742564587.2109861}