{"duration": 0.33599853515625, "input_args": {"text": "'Wed, 26 Oct 2016 21:12 UTC © Alice Martins/The Washington Posy View of a heavily damaged neighborhood in Kobane, Syria, which had been targetted by a series of US-led coalition airstrikes. The hypocritical Western heart beats for all except those the US Empire drowns in blood . [1] \"In Syria almost everybody is under siege to a greater or lesser degree,\" observes the Independent\\'s Patrick Cockburn. [2] Most people, however, think the only siege in Syria is the one imposed on (East) Aleppo by Syrian and Russian forces. But siege as a form of warfare is hardly uniquely embraced by the Syrian Arab Army and Russian military. On the contrary, the United States and its allies have been practicing siege warfare in the Levant and beyond for years, and continue to do so. It\\'s just that US-led siege warfare has been concealed behind anodyne, even heroic, labels , while the siege warfare of countries Washington is hostile to, is abominated by Western state officials crying crocodile tears. Here\\'s how the deception works: Sieges of cities controlled by Islamic State, carried out by US forces and their allies, are called rescue operations, or campaigns to liberate or retake cities—never sieges. Other sieges— the ones carried out by Al Qaeda\\'s affiliate in Syria , Jabhat Fatah al-Sham, formerly Al Nusra, which, herein, I\\'ll call Al Qaeda for convenience— are ignored altogether (which might suggest something about the relationship of Al Qaeda\\'s Syria affiliate to the United States.) And a particularly injurious form of siege— economic sanctions — is presented as a separate category altogether and not siege warfare at all. But sanctions, imposed by rich countries , such as the United States and those of the European Union, on poor countries, such as Syria, are a modern form of siege, and have been called sanctions of mass destruction, in recognition of their devastating character. In the Levant, the sieges which are identified as such by Western state officials , and in train, by the Western mass media, are sieges of cities controlled by Al Qaeda, carried out by Syrian forces and their allies. These sieges —which cause hunger, kill civilians, and destroy buildings— are denounced in the West as ferocious attacks on innocents which amount to war crimes. \"Russia\\'s bombardment backing the siege of Aleppo by Syrian government forces,\" notes the Wall Street Journal , \"has created a humanitarian crisis.\" [3] A UN Security Council resolution—vetoed by Russia—has called for an end to Russian bombing of Aleppo. British foreign minister Boris Johnson has mused openly about war crimes indictments against Syria and Russia. Yet US campaigns to drive Islamic State out of Manbij, Kobani, Ramadi, Fallujah, Baiji and Tikrit, and now Mosul, have also caused hunger, killed civilians, and destroyed buildings. Unlike the Syrian military\\'s siege of East Aleppo, these campaigns have been celebrated as great and necessary military victories, but have, themselves, created vast humanitarian crises. Cockburn observes that the \"recapture\" of \"cities like Ramadi, Fallujah, Baiji and Tikrit...would scarcely have happened without the coalition air umbrella overhead.\" [4] That is, the cities liberated by Iraqi forces and their US patron were bombed into submission, even though civilians were trapped inside. Iraqi ground forces only moved in after these cities were left in ruins by coalition airstrikes and Iraqi artillery bombardment, as mopping up forces. © Ali al-Mashhadani, Reuters Market in Ramadi destroyed by US coalition airstrikes Rania Khalek, writing in the Intercept , points out that \"U.S.-backed ground forces laid siege to Manbij, a city in northern Syria not far from Aleppo that is home to tens of thousands of civilians. U.S. airstrikes pounded the city over the summer, killing up to 125 civilians in a single attack. The U.S. replicated this strategy to drive ISIS out of Kobane, Ramadi, and Fallujah, leaving behind flattened neighborhoods.\" [5] To recover Ramadi from Islamic State, Iraqi forces surrounded and cordoned off the city. [6] In addition, the US led coalition bombarded Ramadi with airstrikes and artillery fire. [7] The bombardment left 70 percent of Ramadi\\'s buildings in ruins. The city was recovered, but \"the great majority of its 400,000 people\" were left homeless. [8] Iraqi forces also besieged the city of Fallujah, preventing most food, medicine and fuel from entering it. [9] Militias \"prevented civilians from leaving Islamic State territory while resisting calls to allow humanitarian aid to reach the city.\" [10] This was done \"to strangle Islamic State\" [11] with the result that civilians were also \"strangled.\" Inside the city, tens of thousands endured famine and sickness due to lack of medicine. [12] Civilians reportedly survived on grass and plants. [13] Many civilians \"died under buildings that collapsed under\" artillery bombardment and coalition air strikes. [14] © US Defense Department The US-led coalition has been bombarding Mosul for months. The current campaign to recover Mosul is based on the same siege strategy US forces and their Iraqi client used to liberate Ramadi and Fallujah. US and allied warplanes have been bombarding the city for months. [15] Iraqi forces, aided by US Special Forces, are moving to cordon it off. \"Some aid groups estimate that as many as a million people could be displaced by fighting to recapture the city, creating a daunting humanitarian task that the United Nations and other organizations say they are not yet ready to deal with.\" [16] Writer and journalist Jonathan Cook commented on the utter hypocrisy of Westerners who condemn the Syrian/Russian campaign to liberate East Aleppo from Islamist fighters while celebrating the Iraqi/US campaign to do the same in Mosul. Targeting the British newspaper, the Guardian , beloved by progressives, Cook contrasted two reports which appeared in the newspaper to illustrate the Western heart beating for all except those the US Empire drowns in blood. Report one: The Guardian provides supportive coverage of the beginning of a full-throttle assault by Iraqi forces, backed by the US and UK, on Mosul to win it back from the jihadists of ISIS - an assault that will inevitably lead to massive casualties and humanitarian suffering among the civilian population. Report two: The Guardian provides supportive coverage of the US and UK for considering increased sanctions against Syria and Russia. On what grounds? Because Syrian forces, backed by Russia, have been waging a full-throttle assault on Aleppo to win it back from the jihadists of ISIS and Al-Qaeda - an assault that has led to massive casualties and humanitarian suffering among the civilian population. [17] Aleppo’s rebels, members of the Al Qaeda derived Jabhat Fatah al-Sham. Central to Western propaganda is the elision of the Islamist character of the Al Qaeda militants who tyrannize East Aleppo. This is accomplished by labeling them \"rebels,\" while the \"rebels\" who tyrannize the cities the United States and its allies besiege are called \"Islamic State,\" ISIL\" or \"ISIS\" fighters. The aim is to conjure the impression that US-led sieges are directed at Islamic terrorists, and therefore are justifiable , despite the humanitarian crises they precipitate, while the Syrian-led campaign in East Aleppo is directed at rebels, presumably moderates, or secular democrats, and therefore is illegitimate. This is part of a broader US propaganda campaign to create two classes of Islamist militants—good Islamists, and bad ones. The first class, the good Islamists , comprises Al Qaeda and fighters cooperating with it, including US-backed groups, whose operations are limited to fighting secularists in Damascus, and therefore are useful to the US foreign policy goal of overthrowing Syria\\'s Arab nationalist government. These Islamist fighters are sanitized as \"rebels.\" The second class, the bad Islamists , comprises Islamic State. Islamic State has a mbitions which make it far less acceptable to Washington as an instrument to be used in pursuit of US foreign policy goals. The organization\\'s leader, Abu Bakr al-Baghdadi, aspires to lead a caliphate which effaces the Sykes-Picot borders, and is therefore a threat, not only to the Arab nationalists in Damascus—an enemy the organization shares in common with Washington— but also to the US client states of Iraq and Saudi Arabia, which Islamic State attacks. The US objective in connection with Islamic State is to push the organization out of Iraq (and out of areas in Syria that can be brought under the control of US-backed fighters) and into the remainder of Syria, where they can wear down Arab nationalist forces. Syria\\'s \"moderates\"—the \"rebels\"—if there are any in the sense of secular pro-democrats, are few in number. Certainly, their ranks are so limited that arming them, in the view of US president Barack Obama, would make little difference. The US president told New York Times columnist Thomas Friedman that his administration had \"difficulty finding, training and arming a sufficient cadre of secular Syrian rebels: \\'There\\'s not as much capacity as you would hope,\\'\" Obama confessed. [18] Obama\\'s assessment was underscored when \"a US general admitted that it had just four such \\'moderate\\' fighters in Syria after spending $500 million on training them.\" [19] Veteran Middle East correspondent Robert Fisk dismissed the idea of the \"moderates\" as little more than a fantasy. \"I doubt if there are 700 active \\'moderate\\' foot soldiers in Syria,\" he wrote. And \"I am being very generous, for the figure may be nearer 70.\" [20] Elizabeth O\\'Bagy, who has made numerous trips to Syria to interview insurgent commanders for the Institute for the Study of War, told the New York Times\\' Ben Hubbard that my \"sense is that there are no seculars.\" [21] Anti-government fighters interviewed by the Wall Street Journal found the Western concept of the secular Syrian rebel to be incomprehensible. [22] To be clear: Syrian and Russian forces are waging a campaign to liberate East Aleppo from Islamists, whose only difference from Islamic State is that they\\'re not a threat to the US client states, Iraq and Saudi Arabia. It\\'s \"primarily al-Nusra who holds Aleppo,\" US Department of Defense spokesperson Colonel Steve Warren said on April 25, referring to Al Qaeda. [23] Other militant Islamist organizations, including US-backed groups, are also in Aleppo, intertwined with, embedded with, sharing weapons with, cooperating with, and acting as auxiliaries of Al-Qaeda. Author and journalist Stephen Kinzer, writing in the Boston Globe , reminds us that: For three years, violent militants have run Aleppo. Their rule began with a wave of repression. They posted notices warning residents: \"Don\\'t send your children to school. If you do, we will get the backpack and you will get the coffin.\" Then they destroyed factories, hoping that unemployed workers would have no recourse other than to become fighters. They trucked looted machinery to Turkey and sold it. [24] The Invisible Sieges While sieges imposed by US-led forces are hidden by not calling them sieges, sieges imposed by Washington\\'s Al-Qaeda ally are simply ignored. \"Only three years ago,\" notes Fisk, the same Islamist fighters who are under siege today in East Aleppo, \"were besieging the surrounded Syrian army western enclave of Aleppo and firing shells and mortars into the sector where hundreds of thousands of civilians lived under regime control.\" [25] Fisk observes acidly that the \"first siege didn\\'t elicit many tears from the satellite channel lads and lassies\" while the \"second siege comes with oceans of tears.\" [26] © Delil Souleiman/Agence France Presse Wreckage of Manbij in the wake of US coalition airstrikes, June 23, 2016 To the ignored Al Qaeda-orchestrated siege of West Aleppo can be added \"the untold story of the three-and-a-half-year siege of two small Shia Muslim villages in northern Syria,\" Nubl and Zahra. Those sieges, carried out by Al-Qaeda against villages which remained loyal to Syria\\'s Arab nationalist government, left at least 500 civilians dead, 100 of them children, through famine and artillery bombardment. [27] The \"world paid no heed to the suffering of these people,\" preferring to remain \"largely fixed on those civilians suffering under siege by (Syrian) government forces elsewhere.\" [28] And then there\\'s the largely untold story of the 13 year-long siege imposed on a whole country, Syria, by the United States and European Union . That siege, initiated by Washington in 2003, with the Syria Accountability Act, and then followed by EU sanctions, blocks Western exports of almost all products to Syria and isolates the country financially. This massive, wide-scale siege plunged Syria\\'s economy into crisis even before the 2011 eruption of upheavals in the Arab world [29]—demonstrating that Washington\\'s efforts to force Syrian president Bashar al-Assad to step down began long before the Arab Spring. The roots of US hostility to Assad\\'s government are found in the danger of its becoming \"a focus of Arab nationalistic struggle against an American regional presence and interests\" [30] - another way of saying that the Arab nationalist goals of unity, independence and socialism, which guide the Syrian state, are an anathema to the US demand—expressed in the 2015 US National Security Strategy—that all countries fall in behind US global \"leadership.\" Under US siege warfare, unemployment shot up, factories closed, food prices skyrocketed and fuel prices doubled. [31] \"Syrian officials\" were forced \"to stop providing education, health care and other essential services in some parts of the country.\" [32] Indeed, so comprehensive was the siege, that by 2011 US \"officials acknowledged that the country was already under so many sanctions that the United States held little leverage.\" [33] Western siege warfare on Syria has blocked \"access to blood safety equipment, medicines, medical devices, food, fuel, water pumps, spare parts for power plants, and more,\" [34] leading Patrick Cockburn to compare the regime change campaign to \"UN sanctions on Iraq between 1990 and 2003.\" [35] The siege of Iraq—at a time when the country was led by secular Arab nationalists who troubled Washington as much, if not more, than the secular Arab nationalists in Syria vex Washington today—led to the deaths, though disease and hunger, of 500,000 children, according to the United Nations. Political scientists John Meuller and Karl Meuller called the siege a campaign of economic warfare amounting to \"sanctions of mass destruction,\" more devastating than all the weapons of mass destruction used in history. [36] When the West\\'s siege warfare on Arab nationalist Iraq ended in 2003 it was immediately resumed on Arab nationalist Syria, with the same devastating consequences. According to a leaked UN internal report, the \"US and EU economic sanctions on Syria are causing huge suffering among ordinary Syrians and preventing the delivery of humanitarian aid.\" [37] Cockburn notes that \"Aid agencies cited in the report say they cannot procure basic medicines or medical equipment for hospitals because sanctions are preventing foreign commercial companies and banks having anything to do with Syria.\" [38] \"In effect\" concludes the veteran British journalists, \" the US and EU sanctions are imposing an economic siege on Syria as a whole which may be killing more Syrians than die of illness and malnutrition in the sieges which EU and US leaders have described as war crimes.\" [39]'"}, "time": 1742561716.8741918}