{"duration": 0.10977673530578613, "input_args": {"text": "'Posted on November 7, 2016 by DCG | 3 Comments \\nThat’s how the Clintons roll… \\nFrom Fox News : Former President Bill Clinton’s top aide wrote in 2012 that Chelsea Clinton used Clinton Foundation resources “for her wedding and life for a decade” and a top Foundation donor was responsible for “killing” unfavorable press coverage – all as an internal Foundation audit uncovered numerous conflicts of interest and “quid pro quo benefits,” according to emails released Sunday by WikiLeaks. \\nDoug Band, founder of global strategies company Teneo and Bill Clinton’s personal assistant since the 1990s, wrote the Jan. 4, 2012, email to future Hillary Clinton presidential campaign chair John Podesta and two other Clinton aides after receiving word that Chelsea had told “one of the [President] bush 43 kids” and others about “an internal investigation of money within the foundation.” Band wrote such chatter was “not smart.” Bill Clinton and Doug Band \\n“The investigation into her getting paid for campaigning, using foundation resources for her wedding and life for a decade, taxes on money from her parents….,” Band wrote . “ I hope that you will speak to her and end this[.] Once we go down this road….” \\nThe FBI reportedly is looking into The Clinton Foundation, although the extent and focus of the investigation is unclear. Hillary Clinton, the Democratic presidential nominee, had previously said some of the “personal” emails she deleted from her secret, homebrew server – the subject of another FBI probe – were related to Chelsea’s wedding. \\nBand’s email, which was revealed after Podesta’s Gmail account was hacked and subsequently uploaded to WikiLeaks, came at a time of turmoil and upheaval within The Clinton Foundation. Aside from the internal audit, previous emails show a prolonged effort to untangle Teneo from the Foundation. When Band launched the company in summer 2011, he was still employed by the Foundation and Bill Clinton was listed as a Teneo adviser. \\nBut after much haggling, Clinton’s and Band’s roles were clearly delineated: Band continued on as a personal aide to Clinton and Clinton became a Teneo client. During the back-and-forth that produced the final document spelling out each of the men’s roles, Band on Nov. 12, 2011 wrote an 11-page memo outlining how Teneo was created and how it had helped to enrich Clinton and the Foundation . In that draft of the memo, Band wrote he had “sought to leverage my activities, including my partner role at Teneo, to support and to raise funds for the Foundation.” \\n“I am sure I have done so imperfectly,” he added. Marc Lasry and Bill Clinton \\nIn another section of the memo, which was later deleted, Band wrote about billionaire hedge fund manager Marc Lasry as a “good example of the complex relationships a friend/supporter can have within the foundation.” Chelsea Clinton worked for Lasry, Lasry held Foundation fundraisers and Band was a paid adviser for Lasry’s firm, Avenue Capital, an investment company whose holding American Media Inc. publishes The National Enquirer. \\nBut fundraisers and jobs weren’t Lasry’s lone contribution to Team Clinton. \\n“He has been helpful on a number of fronts, including … responding favorably to our requests to use his plane for Foundation and the Clintons’ personal purposes, killing potential unfavorable stories in the Enquirer [of which he owns a controlling share of the debt]…” Band wrote. \\nLess than a month after Band’s Teneo memo went out, lawyers from Simpson, Thacher & Bartlett LLP, the firm contracted to run the internal Foundation audit, emailed a draft of a governance memorandum and recommendations to Podesta, who was serving as a special adviser to the Foundation, and Bruce Lindsey, then the Foundation’s CEO. \\nThe audit draft noted substantial issues, including a Conflict-of-Interest Policy that had not been implemented, conflicts that were not disclosed in a timely fashion and board members not following the policy when they became aware of conflicts. \\n“In addition, some interviewees reported conflicts of those raising funds or donors, some of whom may have an expectation of quid pro quo benefits in return for gifts,” according to the Dec. 5, 2011, draft. Another section of the document noted that “interviewees also mentioned instances in which gifts and payments received by staff had not been properly disclosed.” \\nThere were other problems, including 1,298 “complimentary” $20,000 memberships for the Clinton Global Initiative as opposed to just 500 paid memberships. Of the “complimentary” group, “276 were coded ‘discretionary,’” the audit noted. “Interviewees informed us that there is no transparency into how the comp list is developed,” the document stated. \\nThe lawyers conducting the audit also noticed problems in the Foundation’s IRS Form 990, the tax return document of an organization that is exempt from income tax. While charitable groups are allowed to pay board members and staff a reasonable salary, none of the reasonable compensation calculations identified by the lawyers were ever done, the 990 form showed. The lawyers also wrote the 990 indicated the Foundation had a written conflict-of-interest policy that was enforced. \\n“However, we did not find evidence of that enforcement,” the memo stated. \\nOther problems included a “very small” Foundation Board “comprised solely of ‘insiders’”; unsigned Board minutes that “appear to have been cloned from one year to the next; “material weaknesses” in the “segregation of accounting duties, review of journal entries, audit adjustments and financial statement preparation, and lack of Board meetings.” \\nDCG'"}, "time": 1742562190.9517975}