{"duration": 0.0795445442199707, "input_args": {"text": "'Email \\nThe United States’ abstention on a resolution to end its economic embargo on Cuba-a first time it happens after opposing it for 24 years- is an implicit acknowledgement of the wrongness of such a measure. It has brought considerable and unnecessary suffering to the Cuban people and hasn’t brought any positive results to the U.S. \\nCuba’s Foreign Minister Bruno Rodriguez said in September that damage from the embargo between April 2015 and March 2016 amounted to $4.6 billion and to $125.9 billion since the beginning of the embargo more than 50 years ago. By maintaining the embargo, the U.S. has been a target of derision throughout the world, as shown by the repeated and overwhelming U.N. Assembly decisions against the embargo in the last 24 years. \\nIn repeated visits to Cuba I was able to observe the impact of the embargo on the Cuban people. During my first visit to Cuba in 1981 to attend a public health-related meeting, I witnessed an unusual incident. As friends and I walked into the Bodeguita del Medio — a traditional restaurant famous for its many illustrious visitors over the years (Hemingway was a frequent patron) — a young Cuban male was discreetly asked to leave. \\nRealizing we weren’t locals, the young man began ranting against government restrictions on Cubans. “I have money,” he told us. “But they prefer foreigners to eat and spend their money here. I am fed up with this regime.” As we were observing the scene, he asked us, “Do you see something in that corner?” \\n“Yes,” I said, “there is a man standing there.” “You are wrong,” he replied. “He is not a man. That’s a gigantic ear listening to everything I say to you. But I don’t care. I am so sick and tired of this situation.” In those few minutes, I got a first-hand sense of the problems besieging Cuban society: the need for foreign money, the oppressive nature of the regime and the dissatisfaction of the country’s youth. These impressions were later confirmed during a later visit to the island when I headed a UN mission to assess the progress of Cuban scientists in developing interferon, an antiviral substance. \\nHighlighting the Cuban government’s shortcomings doesn’t diminish its achievements. During my last visit I met Fidel Castro. Although we didn’t raise any political issues in our conversation, I was able to assess his enormous interest in — and knowledge of — health issues. This interest and knowledge underlies the Castro’s government accomplishments in health and education. \\nCuba, for all its other faults and drawbacks, is in the forefront in both fields when compared to other Latin American countries. And in some areas, it is on par with the United States. This progress, however, has been hindered by the unnecessary and ineffective embargo against the country, a situation that has cost the United States materially. In addition, the embargo has hurt U.S. prestige among Latin American governments, which consider it a violation of a fellow Latin nation’s rights and sovereignty. \\nThere is no doubt that political pressure from the powerful Cuban exile community in Florida has been an important factor in maintaining the U.S. embargo. However, the descendants of that immigrant generation have now a more nuanced view of the Cuban regime. In particular, they have seen the damage caused by decades of antagonism between both countries — and are eager for friendlier relations between them. \\nWhile Cubans have always been clear about their admiration for the American people — which I have observed first hand during my visits to the island — the embargo has fostered more hate and mistrust of the U.S. government than of the Cuban government among Cubans. \\nIf votes in the UN General Assembly are a test, no country in the world now supports the embargo. President Barack Obama has wisely eased restrictions on travel to the island by Cubans and their descendants. This policy should be followed by an intense exchange of scientists, doctors, artists and ordinary citizens. The effect would be dramatic in neutralizing the atmosphere of antagonism and should be followed by the rapid lifting of the embargo and the complete normalization of relations between both countries.'"}, "time": 1742563317.1149116}