{"duration": 0.06777715682983398, "input_args": {"text": "'CHATTANOOGA, Tenn.  —   At least five children were killed on Monday afternoon when a school bus carrying nearly three dozen elementary school students overturned and crashed into a tree in Chattanooga, according to local officials. About two dozen of the 35 Woodmore Elementary School students on the bus were taken to hospitals here after the accident, which occurred before 3:30 p. m. about a mile from the school, Chief Fred Fletcher of the Chattanooga Police Department said on Monday night. The police arrested the bus driver, Johnthony Walker, 24, on Monday night and charged him with five counts of vehicular homicide, as well as reckless endangerment and reckless driving, the police chief said. “Our thoughts, our prayers and all of our efforts are with the families of these children and others impacted by this tragedy,” said Chief Fletcher, who described the accident as a   crash. Information on the conditions of the children who were taken to hospitals was unavailable. An earlier report from the Hamilton County district attorney general’s office had said at least six children died. Road conditions at the accident site, at Howard Avenue and Talley Road, appeared to be “clear and dry,” Chief Fletcher said. He added that officials were investigating whether speed or alcohol had played a role in the crash. “Certainly speed is being investigated very, very strongly,” he said, noting that the investigation was continuing. The National Transportation Safety Board was sending a team to investigate. Emergency crews worked for hours to remove the children from the bus. Students who were not taken to the hospital walked away “looking dazed with cuts on their faces,” The Chattanooga Times Free Press reported. On Monday night, more than a dozen cars filled the parking lot of Woodmore Elementary School, where school district employees had gathered to prepare the school for a day of grief. Sometime after the accident, a woman went to a nearby store and bought every stuffed animal in stock, about 50. She told employees at Woodmore, where an orange crate of plush Fuzzy Friends sat in the school office after nightfall, that she planned to return with an animal for every student by day’s end on Tuesday. Blood Assurance, a nonprofit regional blood center, extended its hours at three locations in Chattanooga, a city of about 175, 000 in southeastern Tennessee. At 9 p. m. there was still a line out the door at one site. “The response has been enormous,” said Mindy Quinn, a spokeswoman for the center. Representative Chuck Fleischmann, who represents the state’s Third Congressional District, which includes Chattanooga, turned to Twitter to express his condolences to the victims. “I am absolutely heartbroken over this tragedy,” he said, “and I will pray for the children and their families. ”'"}, "time": 1742564426.4847085}