{"duration": 0.04122138023376465, "input_args": {"text": "'Getty - Chip Somodevilla \\nTwo of Hillary Clinton’s top advisers, including her campaign chairman, agreed in a leaked email exchange that the Democratic nominee\\'s “instincts can be terrible.” \\nClinton adviser Neera Tanden, president of the far-left Center for American Progress, wrote to John Podesta on Sept. 6, 2015, to check in. \\n“How are you feeling about things?” she wrote. \\nBiden will get in \\nWe are still way more likely than not to win nomination \\nWe\\'ve taken on a lot of water that won\\'t be easy to pump out of the boat. \\nMost of that has to do with terrible decisions made pre-campaign, but a lot has to do with her instincts. \\nShe\\'s nervous so prepping more and performing better. \\nGot to do something to pump up excitement but not certain how to do that. \\nTanden agreed about Clinton’s “instincts” in her response: \\nYou know I\\'m not a sycophant to you by any means. But the thing that makes me most confident she will prevail is that you are there. \\nAlmost no one knows better me that her instincts can be terrible. \\nShe does have to give time to allow new things to take hold. Clinton\\'s campaign chair John Podesta and adviser Neera Tanden agree on Hillary: \"...her instincts can be terrible\" pic.twitter.com/spAihHm9IP — Jason Howerton (@jason_howerton) October 26, 2016 \\nTrump used the email during the Las Vegas presidential debate, claiming even Clinton\\'s own campaign chairman thinks her instincts are terrible, causing Podesta to push back and express his “love” for Clinton in a statement to The Daily Mail: \\n“No, I think, you know, I love Hillary Clinton and I think if any fair reading of what I\\'ve said about her or what I think about her indicates that I think she is someone who\\'s a tremendous leader who\\'s gotten tremendous results for kids, for families, for people throughout her public service.” Image Credit: Rick Wilking-Pool/Getty Images \\nIn another awkward email exchange , Podesta and Tanden wondered in shock why Clinton\\'s team didn\\'t disclose information about her private email server long before her presidential campaign to avoid the distraction. \\n“Why didn\\'t they get this stuff out like 18 months ago? So crazy,” Tanden wrote to Podesta. \\n“Unbelievable,” Podesta replied. \\nThen Tanden answered her own question: “[I] guess I know the answer. [T]hey wanted to get away with it.” '"}, "time": 1742562394.003689}