{"duration": 0.9369730949401855, "input_args": {"text": "'Still Not Thanking Native Americans November 24, 2016 \\nReturned to its historical roots, Thanksgiving would be a day to express thanks to Native Americans whose generosity saved the Pilgrims, but that never seems to be a lesson learned, as Dennis J Bernstein reports on the Dakota pipeline standoff. \\nBy Dennis J Bernstein \\nLate Sunday night — at the start of Thanksgiving week — Native American protesters were attacked by law enforcement agents near the site of the Dakota Access pipeline, a project that Native Americans and environmentalists have been trying to block. \\nPolice and other security forces deployed tear gas, rubber bullets, percussion grenades and water hoses to stop about 400 protesters from crossing the Blackwater Bridge on state Highway 1806, about a mile from an uncompleted section under Lake Oahe, a Missouri River reservoir, where work has been on hold by order of federal agencies. \\n“As medical professionals, we are concerned for the real risk of loss of life due to severe hypothermia under these conditions,” the Standing Rock Medic & Healer Council said in a statement posted on Facebook. One hundred sixty-seven people were injured and seven were taken to the hospital, according to Jade Begay, a spokeswoman for the Indigenous Environmental Network. Protest against the Dakota Access Pipeline in St. Paul, Minnesota on September 13, 2016 (Fibonacci Blue Flickr) \\nSunday’s standoff began around 6 p.m. local time, when a group of about 100 “water protectors” attempted to clear burned out trucks that were blocking the bridge, which is on the most direct route from the Standing Rock Sioux Reservation to Bismarck, North Dakota. The trucks have been in place for several weeks, and law enforcement has constructed a barricade behind them, forcing all traffic to take an approximately 20-mile detour. \\n“The purpose of this action was to do something to remove that barricade because it’s dangerous,” said Begay, a member of the Tesuque Pueblo and Diné, who has been at the Standing Rock encampments since September. “That barricade poses a danger not just to everyone at the camp, but also to Cannon Ball and other communities that are south.” \\n“They’re using that barricade as an excuse for us not to be able to lawfully protest,” said Frank Archambault, a member of the Standing Rock Sioux Tribe from Little Eagle, South Dakota. “We got word that the drill is now on the pad so tensions are high right now.” \\nThe 1,200-mile, four-state pipeline is intended to carry oil from western North Dakota to a shipping point in Illinois. But construction of the $3.8 billion pipeline has been protested for months by the Standing Rock Sioux, whose reservation lies near the pipeline route and there are fears a leak could contaminate the drinking water. They also worry that construction could threaten sacred sites. \\nCheryl Angel, an Elder member of the Rosebud Nation, was an eyewitness to what happened Sunday night [Nov. 20] in sub-freezing weather with water hoses. “Security” forces stationed at the Dakota Access pipeline construction spray protesters with pepper spray. (Photo by Tim Yakaitis) \\nCheryl Angel: I’m a member of the Rosebud Sioux Tribe. I am Sasusaku, Lakota. I currently live at Cannonball, to support Standing Rock, in their efforts to save the water that millions of Americans [depend upon]. [On the evening of November 20 th ], after a day of prayer and ceremony at all three camps, our security attempted to open the bridge by removing the burnt out trucks that the North Dakota authorities had put there themselves, and had started on fire themselves and left on the bridge. \\nSo our security forces tried to remove them from the bridge and the North Dakota authorities then decided to escalate their presence by calling in a militarized vehicle, and I’m going to say … maybe 100 more law enforcement vehicles. There were so many you couldn’t even count them. You need to understand that … what separates the tribe from the pipeline area that’s being excavated is the Cannonball River. At some points it’s about 40 feet wide, at other points it’s only 20 feet wide. But there is a bridge that connects between those two lands, those two boundaries. And that’s where the armored vehicles were parked that were already burnt out. \\nDennis Bernstein: And, in terms of what happened… we understand that a number of people were wounded with these tear gas canisters. We understand that they were using water hoses in, I guess, 20 – 25 degree [Fahrenheit] weather. Tell us more about that kind of violence. So people can really, you know, get a human face on what’s going on there. \\nCA: I felt like I was in a war zone. I had … been called to a meeting so I was heading for the meeting. I could hear young warriors running through the camps, saying “Everybody to the north bridge.” So everybody answered the call. They got in their vehicles and they drove to the north bridge. So both sides of the road had cars facing north. People were walking on the sides of the road. The DAPL (Dakota Access Pipeline) being installed between farms, as seen from 50th Avenue in New Salem, North Dakota. August 25, 2016. (Tony Webster Flickr) \\nI had taken a back path that the deer, the wildlife, use and I entered from between two hills on a deer path. And I walked through the trees up along the fence and then from that point on … there was flood lights, there was at least 40 floodlights on the north side of the river, about a quarter mile apart, along the entire path of that pipeline. So it’s like moonlight… it’s like daylight on the north side of the river. On the south side, not so much. And people had gathered there, they had… they were singing at the front line. They were playing music at the front line. They were chanting “Water is life.” \\nBy the time I had gotten there, people were coming back, soaked in water, and it was really cold out, and the wind had picked up. And truckloads of people with assistance had brought blankets and jackets, and water, and goggles and face masks. So when you entered the bridge you could look to your right and pick up a blanket, and pick up a goggle, and pick up a face mask, and you could walk further to where the encounter was taking place. \\nSo, I kept to the right of the bridge, and I went down to where the razor wire is, because it’s like a war zone there. I’m not kidding. They have floodlights, they have the tank right centered on the bridge, and there was no instructions. They … had a water cannon there. I heard throughout the night that they had used seven fire engine trucks. They emptied seven of them. It was unbelievable. I didn’t think that they would continue to water cannon people. And I asked them… I went to the front lines and said “Stop this… please go home. We’re here praying for you. We’ll find you new jobs. Pray with us, stand with us. We’re protecting the water for millions.” \\nAnd they didn’t listen, they stood behind the barbed wire and they continued … they would lift their rifles and they would pick out, literally pick out, individuals in the crowd and they would shoot them. And so water protectors had plastic container tops, and they were using those as shields. And they were protecting people whenever they could. I was on the front line. I was very, very lucky, because I didn’t get shot. I got maced, I got peppered sprayed, I got water cannoned. A woman holds a sign protesting the Dakota Access Pipeline. Opposite side reads: Water is Life. Washington, D.C. November 17, 2016. (Photo by Chelsea Gilmour) \\nThe force of a water cannon if you haven’t had one… it knocks you off your feet. And we had built fires to warm up the people who were soaking wet, in the frigid weather, people are shaking, they were drenched in water and tear gas. Our medics were out there in full force, doing what was necessary to keep people breathing. People were sharing their inhalers. Those who couldn’t breathe… it was unbelievable. I didn’t think that things would come to this end. But unless Obama stands up, unless people start calling their senators, our lives are in danger, not only the water, but our lives, are physically in danger. So, it hurts me to talk like this.But a call needs to be made. Hundreds of calls need to be made. \\nOur water needs to be protected. We need support up here. We need wool blankets. We need wool clothes. We need to replenish our first aid kits. We need more thermal blankets. We need batteries. We need jerky. We need those snack bars that you eat, when you’re not able to eat a hot meal. Thermoses. We need… I think we need hundreds of thermoses, because we can’t even carry hot water with us anywhere we go. It was just unbelievable. It was… between being shot with water and then dodging bullets, I’m trying to deliver a peaceful message, and saying prayer. It was hard. \\nI mean, I slid down the hill, I was knocked off the hill by a water cannon, people picked me up. There was a man standing right next to … a military vehicle, without any face protection, without any blanket and he was singing. And he kept singing, and they just kept spraying him over and over. I picked up an army blanket, I covered him up with it. I stood beside him. We sang together, we prayed together. And they still shot at us, they still maced us, and they still used the water cannon on whoever they wanted to… on everybody that was within their reach, everybody. \\nAnd the fires that were started to protect everybody, to warm people up… those fires that were set to warm people up because there was no warming station at that site, were targeted by the police… were targeted by the water cannons. […] The fires that were keeping us warm, they intended on [extinguishing the fires that were there for warmth] and that was there intent. \\nWe didn’t start the fires, only the warming stations. The fires that were started randomly out in the field those were by the tear gas canisters that they were shooting off there. They were shooting canisters at us, into the crowd, everybody at one point thought they were trapped on the bridge because lights were coming over from the south of us. And those turned out to be our own warriors, our own water protectors, our own horse riders to support us. They stood up on the hill, on both sides of the bridge, on the south end, and we were down at the bottom on the bridge, up against the razor wire. I asked them to stop, repeatedly, repeatedly. They wouldn’t stop. They just kept going. Activists gather in Seattle to protest the Dakota Access Pipeline, September 2016. (John Duffy Flickr) \\nBut the thing that really hurt me the most, is when they were trying to put out the fires that were literally saving peoples’ lives. I had got knocked down and was totally drenched in water, I walked over to the fire to warm up and I was only there long enough to empty the water out of my shoes and then they started targeting the fires. So the protectors put up a shield. And for thirty seconds they stood there with a continuous blast of water, and they were totally drenched. And then they all split. First the water hit the fire and there was so much steam and smoke that came out of there. We were blinded. \\nBut there were two of us and we grabbed one of those Teflon, Mylar body armors, and we stretched it between us, and we knelt down on it, and held it between us, we crouched together, we covered one end of the fire. And we just sat there and we prayed. And they kept putting the water over us, until we were completely drenched, again, over and over. \\nAnd I could hear a young girl, when the smoke cleared, she was saying “grab the logs, grab the logs” and so people ran over, they grabbed the logs out of the fire and they ran a few yards south, put them together and started another fire, so people could warm up before they were taken to the medic tents. Because there were hundreds of people soaking wet. They weren’t dressed in wool. \\nWhen I make a call out for clothing it’s not for any cotton, it’s not for polyester, it’s for waterproof jackets and there’s hardly any waterproof tents at all, snow pants, snow bibs, anything that’s waterproof, and wool. We need wool sweaters, wool socks, wool gloves, wool jackets. Those are the things that we need right now. \\nI wish the Red Cross would show up. I really do wish that whoever has power to send the Red Cross over there [would]. We could do that because we are in a state of emergency. That’s how it was on the front line. The #NoDAPL water Protectors took non-violent direct action by locking themselves to construction equipment. This is “Happy” American Horse from the Sicangu Nation, hailing from Rosebud. August 31, 2016 (Desiree Kane, Wikipedia) \\nDB: It’s really important … you sort of hit this really hard but just to underline it… because places like NPR and the local police are saying that they had the water there because you all were starting fires, and that you were throwing Molotov cocktails. That was the story that was coming out of the police, and the local press. You want to talk a little bit more about that? \\nCA: I’m not afraid to call a liar to their face. If they’re going to post things like that they should be standing on the front lines, getting eyewitness testimony, instead of just passing on the lies [that] the sheriff, … and the governor of North Dakota, and the DAPL are putting out. Because they are taking their own words and using them against the people, to not know the truth. And that should be a crime. It should be. \\nIf I was lying to get people to hurt other people, would I be called a good person? Would I be fit to wear a uniform? Would I be fit to lead a state? I don’t think so. Not according to the values that America claims that it follows. And so, NPR, get on the front line, take your own video, because you weren’t there. So I would like all these major media outlets to quit reprinting lies that are undocumented, undocumented statements from the police. \\nAll that happened is our security wanted to open that road, because it is a public road. And that’s what they said to us when we had our vehicles parked on it. On October 24th they said “go on” they said “we need to open the road. It’s a public road. Move your cars.” So why can’t we move those 3 trucks off the bridge? It’s a public road. That’s how it all started. \\nDB: But those are two burnt trucks? \\nCA: That the military forces had placed there themselves. The North Dakota officials put those there and they started them on fire. And before they left they said, “Please stay away from the vehicles. They have propane inside of them, they’re explosive devices.” Which, of course, made everybody to move back from the bridge. And they left them there. And then they put razor wire, which is also unconstitutional. You cannot use that type of razor wire. I mean you only see those in war zones. You don’t see them in the United States. But I’m starting to feel we’re in a war zone. So it’s a battle, people. We need bodies, up front. \\nWe need the world to know that water is a precious commodity and it is sacred to natives. When you understand its relationship to life you will understand the sacredness of it. And we need your support. We need this economy to stop being the oil and gas industries, it’s not good for our country. We need to divest from fossil fuels, and start being a leader in the world by adopting a green policy and getting new jobs for these people who are in the oil industry. Thank you for listening to me. My flight is about to leave. And I’m leaving for ceremony. I’ll be in ceremony for four days. And I’ll be available after four days. And things will probably change by then too. \\nDennis J Bernstein is a host of “Flashpoints” on the Pacifica radio network and the author of Special Ed: Voices from a Hidden Classroom . You can access the audio archives at www.flashpoints.net . [To support the DAPL protesters, click here .]'"}, "time": 1742562730.0815616}