{"duration": 0.15455126762390137, "input_args": {"text": "'Donate We Are All Deplorables If left activists are concerned about future political victories, they should take seriously the proposition of open dialogue with Trump supporters. For, as far as the political establishment is concerned, we, both left and right, are all “deplorables”. By Matthew Ricci / counterpunch.org \\nOutside of right-wing circles, explanation of Trump’s disheartening victory in the sordid 2016 election has taken two forms. The first, offered by liberal elites in politics, the mainstream media and academia, is that the bewildered herd of benighted voters has delivered a victory to the forces of evil. From incurable racists, xenophobes and misogynists to Sanders loyalists, third-party voters and Russian spies, there is no shortage of scapegoats that the Democratic establishment and their apologists will find to divert attention from their overconfident, self-sabotaged campaign. \\nThis view has been rightly criticized by those espousing the second explanation, namely, that, independent of the possible bigotry of Trump’s supporters, they do constitute a genuinely downtrodden population, abused by decades of neoliberal policy. Naturally, this is the minority opinion in a political discourse dominated by what was, during the homestretch of the election, the hugely pro-Clinton media. Yet, in this minority voice lies not only the truth about Trump’s rise, but also the seeds of future action. \\nIf left activists are concerned about future political victories, they should take seriously the proposition of open dialogue with Trump supporters. For, as far as the political establishment is concerned, we, both left and right, are all “deplorables”. \\nThe possibility of cooperation has already been articulated by Bernie Sanders who stated the day after the election that “[he] and other progressives are prepared to work with [Trump]”, unless the President-elect resorted to “racist, sexist, xenophobic and anti-environment policies” (1). Sanders did not denigrate Trump voters as witless cave-dwellers or plead with them to change their regressive views. Inherent in Sanders’ statement is the idea, recognized by some commentators (2) for years, that the poor, white, Republican-voting working class shares material concerns with the progressive left. Further calls for solidarity have come from Michael Albert, who claimed we should approach Trump’s advocates “not as enemies, but as potential allies” (3). \\nThese voices call for cooperation with the white working class after an election featuring a Democratic party that held them entirely in contempt. Hillary Clinton, scandal-ridden, hopelessly unpopular and emblematic of liberal technocracy, is now famous for her “basket of deplorables” remark. The leaked Podesta emails, which reveal her admission to Wall Street audiences that she maintains “public” and “private” political personas, further demonstrate her disdain for working people (4). This should come as no surprise after her ardent initial defense of the disastrous TPP, which, as rumblings in her entourage suggested (5), she may have ultimately supported. Of course, anti-democratic sentiment on the part of liberal elites is an invariant feature of political history, so Clinton’s remarks should come as no surprise. \\nThe disdain-behind-closed-doors of the Clinton campaign has been fully unveiled after the election, with oversimplified depictions of Trump voters as mere racists/misogynists/xenophobes and unending denial in the media of their economic plight. This plight of the white, working class was in plain sight, having been carefully analyzed by thoughtful, mainstream economists for months prior to the election. For example, on issue of the global rise of populist parties, Brown University political economist Mark Blyth noted in a September lecture the correlation between lack of education, chronically low wages and exposure to Chinese import competition with support for right-wing authoritarian leaders (6). A few weeks later, Blyth was left completely unsurprised by Clinton’s defeat. What else but an abandonment of the finance-friendly Democrats could one expect in a world in which $28.5 billion dollars in bonuses were awarded to as yet unprosecuted Wall Street bankers in 2015 (compared to the $15 billion paid to all American workers making minimum wage in the same year) (7), and in which $12 trillion were recently estimated to be stored away in offshore tax havens (8)? What else can one expect from a group now suffering from an increasing death rate (9) in a country where real wages have stagnated since the 1960s (10)? \\nThis is not to say there are no serious racist and nativist elements to the Trump constituency, including the thug-in-chief himself. These dark elements have been extensively explored and rightly denounced. Yet, this is immaterial to the tactical issue of creating a unified people’s movement in the country. Either the left abandons the sometimes-racist, white poor or it makes a genuine attempt to understand, empathize, and cooperate with them. Serious efforts in this regard have already been mounted, including by Berkley sociologist Arlie Russell Hochschild, who lived deep in Tea Party country, the Louisiana bayou, for five years, as recounted in her book, Strangers in Their Own Land: Anger and Mourning on the American Right . Here, she met an embattled people, facing poverty and environmental disaster, who were deeply religious, fiercely anti-government and professedly non-racist. Hochschild and the Louisianans differed in their understanding of racism, though her goal was not to proselytize. Instead, she wanted to scale an “empathy wall” and to feel what it was like to have political beliefs the opposite of her own. “We,” she writes, “on both sides, wrongly imagine that empathy with the ‘other’ side brings an end to clearheaded analysis when, in truth, it’s on the other side of that bridge that the most important analysis can begin” (11). \\nThe notion that real politics only begins when we sincerely address those who disagree with us is not a new one. Gandhi, both a political leader and the head of a strict religious group, recognized that politics was about reaching a broad public and not about cultish self-congratulation (12). Naturally, this entails approaching those who disagree with us, with empathy and understanding as our primary strategy. Goodwill and openness should not be reserved only for those whose views we find palatable. Indeed, goodwill and openness mean nothing unless they are applied precisely to those who disagree with us, perhaps staunchly. \\nIn fact, the job has been made all the easier since Trump’s supporters often materially agree with the progressive left, and, importantly, dislike Trump. For example, 21% of those who claimed Trump was not “honest and trustworthy” actually voted for him; moreover, Democratic and Republican voters had “reservations” about their candidate in equal numbers (13). Hoschschild also noted this lack of enthusiasm among Louisianan Trump supporters, who recognized the plutocrat’s clownishness, but, nevertheless, felt completely abandoned by the Democratic Party (14). In the aftermath of an election featuring earth’s two least popular humans, we can be sure that only a small minority will be inexorably attached to their candidates. \\nThis could leave open the door to genuine dialogue between progressives and the typically-Republican right, though such discussion is no certainty. For example, there have been a number of meetings at Ivy League universities about solidarity with endangered minorities and the plan-of-attack against Trump (15), but no meetings, to my knowledge, explicitly designed to reach out to Trump voters. It goes without saying that the former types of meetings are absolutely necessary, but there is no reason why they cannot co-exist with the latter type. Where is, for example, the effort at elite universities to organize discussions with Republican voters who often live in rural areas not an hour’s drive from campus? Where are the burgeoning coalitions between equally-dissatisfied left and right voters bent on holding Trump’s feet to the fire on the promises, which, with high probability, he will break? Major marches are planned for the period around Trump’s inauguration, though not a great deal of thought has been given to the antagonizing effect of such events in the absence of sincere, widespread desire for cross-party collaboration. \\nSimple repulsion at Trump supporters amounts to the discarding of 60 million votes in a world where, alarmingly, elections still matter. There can be no strategic reason for such repulsion, especially since Middle America, despite its votes for Trump, was (16) and is (17) a hotbed of left politics. Nor does lack of repulsion equate to capitulation to Trump’s assuredly monstrous regime, which marches the planet ever closer to self-destruction. Instead, genuine openness and principled collaboration with Trump’s supporters may be the only thing to turn the one major bright spot of the election, the Sanders campaign, into an ongoing, overwhelming political force. The only confirmed adversary of left activists should be the political establishment, the smug network of technocratic state planners, financiers and war profiteers, which forsook Trump voters, along with much of the global population, in the first place. \\nMatthew Ricci is a PhD student at Brown University studying machine learning and neuroscience. He can be reached at . \\nNotes. \\n1/ “Sanders Statement on Trump”, November 9, 2016 http://www.sanders.senate.gov/newsroom/press-releases/sanders-statement-on-trump \\n2/ See, for example, Noam Chomsky’s remarks: https://www.youtube.com/watch?v=DwTht2L4jqA&app=desktop , from 2014. \\n3/ Michael Albert, “Why No Trumpist Celebrations and Finding Our New Old Path”, ZNet , November 13, 2016, https://zcomm.org/znetarticle/why-no-trumpist-celebrations-and-finding-our-new-old-path/ \\n5/ https://wikileaks.org/podesta-emails/emailid/6616 \\n6/ Mark Blyth, “Watson Institute Student Seminar Series – American Democracy: The Dangers and Opportunities of Right Here and Right Now”, September 27, 2016, https://www.youtube.com/watch?v=Bkm2Vfj42FY \\n7/ Nicholas Kristoff, “Inequality is a Choice,” The New York Times, May 2, 2015, http://www.nytimes.com/2015/05/03/opinion/sunday/nicholas-kristof-inequality-is-a-choice.html \\n8/ Shaxson, Nicholas. Treasure Islands: Tax Havens and the Men who Stole the World , Bodley Head, London, 2011 \\n9/ Case, A., & Deaton, A. (2015). Rising morbidity and mortality in midlife among white non-Hispanic Americans in the 21st century. Proceedings of the National Academy of Sciences , 112 (49), 201518393. http://doi.org/10.1073/pnas.1518393112 \\n10/ Drew Desilver, “For most workers, real wages have barely budged for decades,” Pew Research Center , October 9, 2014, http://www.pewresearch.org/fact-tank/2014/10/09/for-most-workers-real-wages-have-barely-budged-for-decades/ \\n11/ Hochschild, Arlie Russell. Strangers in Their Own Land: Anger and Mourning on the American Right , The New Press, New York, NY, 2016. \\n12/ Finkelstein, Norman G. What Gandhi Says: About Nonviolence, Resistance and Courage , OR Books, New York, NY, 2012 \\n13/ Jon Huang, Samuel Jacoby, K. Rebecca Lai and Michael Strickland, “Election 2016: Exit Polls”, The New York Times , November 8, 2016 http://www.nytimes.com/interactive/2016/11/08/us/politics/election-exit-polls.html \\n14/ See Hochschild’s interview at http://www.democracynow.org/2016/9/28/arlie_russell_hochschild_on_strangers_in \\n15/ See, for example, https://www.brown.edu/about/administration/president/statements/20161109 and https://www.sp2.upenn.edu/sp2-event/post-election-town-hall-meeting/ . The latter university, incidentally, produced Donald Trump. \\n16/ Dubofsky, Melvyn. Labor in America: A History . Wiley-Blackwell, Hobeken, NJ, 8 th , 2012 \\n17/ Alperovitz, Gar. America Beyond Capitalism: Reclaiming Our Wealth, Our Liberty and Our Democracy . Democracy Collaborative Press 0.0 ·'"}, "time": 1742561976.3003614}