{"duration": 0.047391414642333984, "input_args": {"text": "'Rodrigo Duterte, the president of the Philippines, told reporters Monday that he could not yet accept an invitation from his American counterpart Donald Trump to the White House because he is unsure of whether he has the time to make it. [While he did not reject the invitation, either, he said he was “tied up” and could not “make any definite promise. ”  “I’m supposed to go to Russia, I’m also supposed to go to Israel,” Duterte noted. If Duterte accepts the invitation, it is unclear whether the State Department would grant him a visa to enter the United States. He has joked in the past that he refuses to even try to enter the country because “I will just be insulted there” and “they won’t give me a visa. ” In October, he claimed to have once attempted to enter the United States when he was in college and was denied a visa, threatening to impose visa restrictions on U. S. citizens in revenge. Duterte is facing a case before the International Criminal Court for allegedly using “death squads” to curb   violence as mayor of his native Davao City, a position he held for 22 years before assuming the presidency. He has claimed to have personally participated in these death squads, wandering the city at night and shooting people dead. President Trump invited Duterte to the White House during a telephone conversation this weekend, a move that baffled observers who have noted Duterte’s consistent   rhetoric since taking office in June 2016, as well as his record of supporting extrajudicial killings vigilante justice against drug criminals. The two world leaders reportedly engaged in a “very friendly conversation” in which Trump offered to host Duterte in the White House. “President Trump also invited President Duterte to the White House to discuss the importance of the United   alliance, which is now heading in a very positive direction,” the White House said in a statement. The statement added that the two “discussed the fact that the Philippine government is fighting very hard to rid its country of drugs, a scourge that affects many countries throughout the world. ” While not endorsing Duterte’s war on drugs, the statement did not condemn Duterte’s efforts to rid the country of a methamphetamine (“shabu”) epidemic and the thousands of deaths occurring since he took office. Speaking to reporters Monday, Duterte echoed the warmth of the White House statement, adding that he had also mentioned growing tensions with North Korea. “Our greatest chance there of getting some dialogue with America and North Korea would be through the intercession of China,” he said. Duterte’s civil exchanges with Trump stand in stark contrast to his relationship with the Obama administration. Duterte repeatedly referred to President Barack Obama as a “son of a whore,” told him to “go to hell,” and vowed to sever ties between the United States and the Philippines. “I’ve realigned myself in your ideological flow and maybe I will also go to Russia to talk to (President Vladimir) Putin and tell him that there are three of us against the world  —   China, Philippines and Russia. It’s the only way,” he said in October. On Monday, Duterte denied that those comments were a “distancing. ” “It was not a distancing but it was rather a rift between me maybe and the State Department and Mr. Obama, who spoke openly against me,” he claimed. “Things have changed, the new leadership wants to make friends. Well, things have changed, because the new leadership, he (Trump) wants to make friends and he says that we are friends. So, why do you have to pick a fight?” he added. Duterte has presented a favorable disposition towards President Trump since the latter assumed office. In March, Duterte said in public remarks that he was “okay with President Trump and I can assure him also of our friendship and cooperation. ” “But for the previous president, I was an evil man,” he added at the time. “That crazy man was planning to jail me. This other one [Trump] he said, ‘you’re right. ’” In the same remarks, he condemned the European Union for issuing a statement demanding Duterte cease to endorse police brutality against drug suspects, asking of the EU, “why do you have to fuck with us?”   media outlets and   commentators have condemned the White House invitation extended to Duterte. President Obama met with his Filipino counterpart in September at a regional summit despite claiming to have refused to do so, shaking his hand after Duterte had publicly referred to him as a “son of a whore. ” “It was not a long interaction,” Obama claimed. An anonymous official in the Trump White House similarly rejected the idea that meeting the head of state in person was an endorsement. “It’s not a ‘thank you,’ it’s a meeting,” the official told Reuters.'"}, "time": 1742628454.5890691}