{"duration": 0.07581543922424316, "input_args": {"text": "'The health and science editor at the New York Times told a reader in the newspaper’s “mailbag” feature that she decided not to use the term “female genital mutilation” because it is a “culturally loaded” term that widens the “gulf” between the West and the countries where the abuse is practiced. [“I never minced words in describing exactly what form of cutting was involved, and there are many gradations of severity, and the terrible damage it did, and stayed away from the euphemistic circumcision, but chose to use the less culturally loaded term, genital cutting,” Dugger wrote in response to a reader’s question about the semantics.  Dugger said she made the decision following a trip to Africa in the 1990s. “There’s a gulf between the Western (and some African) advocates who campaign against the practice and the people who follow the rite, and I felt the language used widened that chasm,” Dugger said. The United Nations Population Fund (UNFPA) said that some 200 million girls “alive today” are believed to have suffered the abuse, according to the FAQ portion of its website. “The term ‘female genital mutilation’ is used by a wide range of women’s health and human rights organizations,” the UN website states. “It establishes a clear distinction from male circumcision. Use of the word “mutilation” also emphasizes the gravity of the act and reinforces that the practice is a violation of women’s and girls’ basic human rights. “This expression gained support in the late 1970s, and since 1994, it has been used in several United Nations conference documents and has served as a policy and advocacy tool. ” The website text notes that “female genital cutting” was introduced in the late 1990s because of “concern that communities could find the term ‘mutilation,’ demeaning, or that it could imply that parents or practitioners perform this procedure maliciously. ” In recent days three arrests were made in Detroit where two physicians and one physician’s wife are charged with performing the abuse on minor girls. The three suspects represent the first prosecution in the United States for the practice, which is common primarily in Muslim countries, particularly in Africa.'"}, "time": 1742562632.273911}