{"duration": 0.14633679389953613, "input_args": {"text": "'The future is dire, the past a blur and the present heartbroken yet hinting at possibilities on Radiohead’s “A Moon Shaped Pool,” its ninth studio album and perhaps its darkest statement  —   though the one with the band’s most pastoral surface. Radiohead worries throughout the album: about environmental devastation, about mass thoughtlessness, about love gone cold, about finding some way forward. “You’ve really messed up everything,” Thom Yorke sings in “Ful Stop,” one of the album’s few   songs, though it uses its insistent beat for jitters, not pleasurable motion. On this album, grim tidings arrive amid gorgeous backdrops: gentle pianos and acoustic guitars reinforced by a string orchestra. Multilayered tinklings and murmurings give the music a subliminally shimmering aura. But this is Radiohead, whose beauty is always laced with dread for the most part, “A Moon Shaped Pool” is an album of nightmare lullabies. In “Daydreaming,” a somber, undulating piano waltz, Mr. Yorke croons, “Beyond the point of no   it’s too late, the damage is done. ” The album’s opening track, “Burn the Witch,” is a spiral of tension, cryptically portraying a society ignoring its own witch hunts as a clattery, insistent string arrangement ratchets up the dissonance and agitation. Throughout the album, the state of the world and the state of the singer’s heart shade into one another. “When I see you messing me around, I don’t want to know,” Mr. Yorke sings in “Identikit,” and whether he’s thinking about personal, political or corporate betrayal  —   or just about the way facial features can be interchanged and messed around with in a police    —   is unclear, even after the   chorus arrives: “Broken hearts make it rain. ” In “Present Tense,” a bittersweet bossa nova akin to past Radiohead songs like “Knives Out” and “House of Cards,” Mr. Yorke sings, “As my world comes crashing  ’ll be dancing, freaking out” and wonders, “Will all this love have been in vain?” Mr. Yorke, 47, and his partner of 23 years, Rachel Owen, separated last year, releasing a statement that the parting was “perfectly amicable” at the end of “Daydreaming,” Mr. Yorke’s voice is played in reverse, repeating “Half my life. ” But the songs shouldn’t be reduced to autobiography. Radiohead, and Mr. Yorke on his own, have been playing some of the album’s material  —   ”Identikit,” “Present Tense” and “True Love Waits”  —   onstage for years as they painstakingly tinkered with them in the studio. “Burn the Witch” has been hinted at for more than a decade. Every hiss and creak on the album has probably been weighed and considered. “A Moon Shaped Pool” was five years in the making, a little longer than the   gaps between “Hail to the Thief” (2003) “In Rainbows” (2007) and “The King of Limbs” (2011). That’s how Radiohead works now, in fits and starts between Mr. Yorke’s side projects (Atoms for Peace, appearances at protests and benefit concerts) and the guitarist Jonny Greenwood’s soundtracks (among them “There Will Be Blood,” “The Master” and “Inherent Vice”) and collaborations (such as “Junun,” with the composer Shye Ben Tzur). The songs thrive on their coalition, melding Mr. Yorke’s troubled words and aching melodies with Mr. Greenwood’s textural mastery (including, presumably, the string arrangements) and the   contributions of the rest of the band. Both Mr. Yorke and Mr. Greenwood are relentlessly inquisitive listeners, lovers of melody and explorers of idioms, makers of puzzles who don’t shy away from emotion. One thing Radiohead no longer worries about is digital technology. During the 1990s, when Radiohead made “OK Computer,” its songs warned desperately about technology’s incursions on individuality. But in Radiohead’s music now, technology is just a tool, ubiquitous and unremarkable, not the center of attention. “A Moon Shaped Pool” uses the studio extensively, but reveals the human activity there. Regardless of how it was assembled, the sound of the album is largely acoustic and analog: a little hazy, a little noisy, avoiding the metronomic. “Daydreaming” opens with that most analog of effects, a wavering pitch like a tape slipping  . The technology just helps capture and loop the tones of acoustic guitars, keyboards, percussion and voices, whether or not they’re fed through analog distortion gadgets it’s as amoral as a microphone or an amplifier. And the music sounds unplugged even where it’s obviously programmed. The results often hark back to the late 1960s in a way, “A Moon Shaped Pool” is Radiohead’s   album. “The Numbers,” which Radiohead fans have previously known as “Silent Spring,” counsels, “We are of the   her we do return,” and comes as close as Radiohead gets to a call to arms: “We’ll take back what is ours,” it insists. The production hints at Buffalo Springfield’s “Expecting to Fly,” with stately swells of guitar and gusts of strings. “Desert Island Disk” recalls the   folk experiments of Pentangle and the electronic phantasms of early Tim Buckley as Mr. Yorke envisions “the wind rushing ’round my open heart, an open ravine. ” Yet it’s the rare song on the album that offers a glimpse of hope  —   a feeling of being “totally alive, totally released. ” “Glass Eyes” starts as the bleakest of ballads, with minor piano chords drifting into the fog as the singer arrives in a frightening unknown town and finds, perhaps, an escape. “A path trails off and heads down the mountain,” he sings. “I don’t know where it   don’t really care. ” The album ends with “True Love Waits,” a love song Radiohead wrote in the 1990s and first recorded on a 2001 live EP, “I Might Be Wrong,” with Mr. Yorke simply strumming and singing alone, building up to the song’s pleading refrain, “Don’t leave, don’t leave. ” Two decades later, its studio version testifies to what Radiohead’s patient perfectionism can achieve. Instead of guitar chords, it starts with four repeating piano notes, a chord dissected and laid bare. The same piano figure sketches the song’s other chords through the first verse. Gradually, more pianos are overdubbed: in rippling loops, low resonant tones and repeated chords, not so much filling out the arrangement as emanating alongside it, somewhere between harmonious and oblivious. It’s a world that exists outside one man’s longings, and won’t be eclipsed by them.'"}, "time": 1742561666.4923506}