{"duration": 0.11065983772277832, "input_args": {"text": "'President Barack Obama’s administration institutionalized a drone program that involves a targeted assassination policy for individuals put on kill lists. It not only devastated the lives of hundreds of thousands of people in countries, like Afghanistan, but it traumatizes the military officers, who are part of the system which makes strikes possible. But for them, there is little to no support for the depression, suicidal ideations, or post-traumatic stress disorder (PTSD) they develop as a result of the horrible things they are asked to do. \\nAs the documentary, “National Bird,” shows, the officers struggle with the morality of their actions, but they face a presidential administration, which has criminalized more whistleblowers than all other previous presidential administrations combined. Officers who speak out about the drone program face the prospect of harsh prosecution under the Espionage Act, as if talking about what they saw as officers is treasonous. That weighs heavy on veterans of the drone program and makes them terrified to be labeled whistleblowers because they know how the government could destroy their lives if they become known to the public as whistleblowers. \\nThe film highlights the lives of three former officers: Heather, a former drone imagery analyst, Daniel, a former private contractor and signals intelligence analyst, and Lisa, a former technology sergeant for a drone surveillance system. Director Sonia Kennebeck centers their experiences instead of simply using them to explore the mechanics of the drone program. Each one of them is painfully aware of how they could attract the government’s attention by participating in the film, and the credits note, “No person on this film disclosed classified material to the filmmakers.” \\nLisa travels to Afghanistan with a friend named Asma, who was born in Afghanistan. Once a population she viewed remotely through a massive surveillance system, it is her chance to see Afghans as human beings. She shares, “I lost part of my humanity working in the drone program,” and plans to make reparations for the role she played in the drone program with this trip.\\nThe trip provides a means for the filmmakers to highlight the perspectives of survivors of a drone attack by U.S. forces on February 21, 2010, which according to an official military investigation was carried out by a Predator drone crew at Creech Air Force Base in Nevada. The attack killed 23 people, including children. General Stanley McChrystal signed off on the investigation, and a reenactment of the drone crew’s exchanges during the bombing highlights the bloodlust of those involved. \\n“Why didn’t he say possible child? Why are they so quick to call fucking kids but not a fucking rifle?” the pilot asks. The sensor replies, “I really doubt that children call, man. I really fucking hate that.” Later, the pilot says, “Adolescent near the rear of the SUV.” The sensor replies, “Well, teenagers can fight.” A military officer states, “12-13 years old with a weapon is just as dangerous.” Right before the strike, the sensor cheers, “Let the party begin.” \\nThe video footage, combined with the reenacted radio exchange, evokes memories of the infamous “Collateral Murder” video disclosed by Manning and released by WikiLeaks. The drone crew is quite eager to kill. If they can claim in the aftermath the children were teens with possible access to weapons, they have no qualms with putting a Hellfire missile through a pickup truck with kids. \\nDaniel considers whether he is afraid of possibly going to prison for speaking out (Credit to Ten Forward Films)\\nWhat stands out about Daniel’s story is how careful he is to choose his words and even backtrack during his answers to questions. He wears a pin for U.S. Army whistleblower Chelea Manning in one scene in the film. He watches “Democracy Now!”, including a broadcast covering CIA whistleblower Jeffrey Sterling’s prosecution. He has a copy of Wired magazine with Snowden on the cover wrapped in the American flag. There are posters with radical political messages in his apartment, and he participates in antiwar demonstrations. But he does not want to take any chances that he will invite the ire of the global security state. Nevertheless, as the film progresses, Daniel winds up in the crosshairs. The FBI conducts a raid against him on August 8, 2014, while the film is still in production. It deeply frightens Daniel, and clearly undermines his ability to contribute to the film. He reaches out to prominent whistleblower attorney, Jesselyn Radack—just as Heather did—and receives legal assistance in order to defend himself while the government investigates him for “espionage.” \\nRadack communicates the severity of the situation. Such an investigation paints a person as an “enemy of the state.” It is a “David versus Goliath struggle,” a “single person against the entire executive branch of the United States government.” \\nHeather grapples with the anxiety and fear of whether speaking to citizens at public libraries or bookstores or through a column published by the Guardian will make a difference. At a bookstore, she breaks down, as she shares the fact that she does not speak out for herself. She does it for her veteran friends struggling with alcoholism, who cannot talk to citizens as well as she can. Or, she does it in honor of veteran friends who died. But will it make a difference? Is it really worth it to detail how the government does not want to acknowledge the drone program traumatizes the people carrying out attacks? \\nShe shudders at the thought that anyone would cast her as the “next Edward Snowden,” especially if policymakers are not going to listen to the message she has for the public. “If I am going to get all this awful horrifying attention from the government, what’s the point? If someone comes to my house and puts a bag over my head and hauls me away, what was the point in anything I did? Am I really changing people’s minds or are people going to just share it on Facebook and move along?”\\nIt is a tremendously powerful moment that communicates the sacrifice of former military officers or government officials, who speak out about the unspeakable things they did. As Heather says, she could try to live a normal life. She has psychological problems and was a suicide risk before she left the U.S. Air Force. She would be better off spending time with family and friends. Plus, she adds, the left sees people like her as “baby killers.” They believe she should be put on trial for war crimes. The right is unconvinced that drone strikes cause trauma because officers involved are not in combat zones. So, why open up about what drone crew do and attempt to educate the public when insensitivity and indifference is what follows? \\n“National Bird” gives voice to people on both sides of a Hellfire missile. These are individuals who the U.S. government will not hesitate to silence if at all possible. It also challenges the way in which the drone program normalizes and makes war permanent. And, as Donald Trump prepares to take over control of this apparatus entrenched by Obama, the film encourages audiences to reflect on whether they have any problem with a government that assassinates and destroys the lives of entire villages and punishes any officers involved, who cannot bear the sins they committed and dare to speak out so they may heal their soul.\\nThe post Film Review: ‘National Bird’ Confronts Perils Of Becoming Drone Whistleblower appeared first on Shadowproof .\\n'"}, "time": 1742562080.9473348}