{"duration": 0.04627251625061035, "input_args": {"text": "'A Washington Post reporter is looking for a family of illegal aliens so she can “help readers place themselves in the shoes of someone who feels no longer welcome in the United States,” according to an email obtained by Breitbart. [The request comes hot on the heels of a widely reported violent gang rape of a   old in the same area for which two illegal aliens have been charged.  The request from Washington Post reporter Jessica Contrera was sent to an immigration lawyer, who then shared it Tuesday, March 28, via an email list with other lawyers at the Maryland State Bar Association. “I spend my time working on   stories about the lives of people who are being affected by topics unfolding in the news,” Contrera wrote.  She continued: I’m reaching out because I’m hoping my next story will be focused on an undocumented family. Specifically, I’m looking for a person or family who is voluntarily choosing to leave the U. S. and return to their home country, given the political climate and the increased threat of deportation I can’t begin to imagine what a stressful and difficult decision it must be to leave your life behind, and I’m hoping that by spending time with a person or family as they prepare for their departure, I can help readers place themselves in the shoes of someone who feels no longer welcome in the United States. I’m getting in touch with you in hopes of finding out if the situation I described is something that’s happening in your area, and if you know anyone who might be leaving the country in the coming weeks. If so, I’d love to talk with you about my work and how I might best find this story. According to a confidential source privy to the mailing list, reporters from   news outlets routinely query the immigration section for sympathetic clients to help build their narrative. The same source said he believes the focus on Maryland was specifically tailored to counter last week’s reporting on the Rockville high school’s alleged gang rape, which defense attorneys are already trying to spin into an attack on innocent illegal aliens. Even the New York Times reported that several liberal media outlets refused to report on the gang rape as that story unfolded, saying, “Viewers would not have heard about [the rape] if they had turned to CNN or MSNBC. ” Contrera did not respond to emails and phone calls made by Breitbart. Contrera’s strategy of seeking out anecdotes to build empathy with illegal aliens matches President Donald Trump’s description of establishment immigration reporting: that it focuses on the plight of illegal aliens before that of Americans. “The truth is, the central issue is not the needs of the 11 million illegal immigrants or however many there may be   …     There is only one core issue in the immigration debate, and that issue is the   of the American people,” Trump told a crowd of supporters on the campaign trail in August 2016. “The mainstream media always looks for sob stories to undermine the legitimacy of immigration enforcement,” said Mark Krikorian, the director of the Center for Immigration Studies, a   which studies the impact of immigration on the United States. “They almost never like to tell comparable stories   …     of people killed by illegal immigrants, of the small contractor put out of business by those employing immigrant labor,” he told Breitbart. “Reporters themselves internalize this. ” According to her letter, Contrera is not seeking an American family to highlight the plight of the American communities most affected by mass illegal immigration. Her own publication periodically describes their economic woes, but rarely links them to the flood of labor enabled by lax federal immigration enforcement and permissive immigration policies. In September 2016, the National Academies of Sciences, Engineering, and Medicine issued a long report on immigration, which included an analysis showing that   immigration annually transfers roughly $500 million from Americans’ salaries and wages, over to investors and company owners. The report also shows that each unskilled immigrant costs state and local taxpayers $1, 600 per year. Asked about Contrera’s Maryland solicitation being so close in time and place to the Rockville High arrests, Krikorian said, “It makes perfect sense. The Rockville rape case is interfering with the narrative   …     [and progressive] reporters instinctually try to ‘balance the narrative’ with these kinds of anecdotes. ”'"}, "time": 1742628451.1689932}