{"duration": 0.09379100799560547, "input_args": {"text": "'Dakota Access Pipeline Protesters Maced, Hit with Rubber Bullets in Standoff Over Ancestral Land Posted on Nov 3, 2016 \\nBy Emma Niles \\nTensions flared again Wednesday between North Dakota law enforcement and protesters of the Dakota Access pipeline. Filmmaker and activist Josh Fox was at the scene of the violent confrontation, where journalist Erin Schrode, among others, was shot with a rubber bullet at the front lines of the protest. \\n“This is an insane situation,” Fox begins in a video streamed live to his Facebook page after the confrontation. “We had a line of peaceful water protectors in the water, up to their waists, who were freezing cold. Those people were standing in front of a line of police, the police were occupying treaty land—not their land. Police were there with riot gear on, with shotguns, with rubber bullets, with mace, with pepper spray.” \\nAccording to NBC , Wednesday’s conflict took place at Cantapeta Creek, which runs just north of the Standing Rock Sioux Indian Reservation. Protesters grew agitated when police “dismantled a wooden bridge that demonstrators constructed to access the sacred site.” The “sacred site” refers to the hilltop across the creek where Standing Rock Sioux tribal ancestors are buried. \\nThe Young Turks network shared a brief video highlighting the escalating tensions: \\n“This is land that is theirs, per the Laramie Treaty of 1851 ,” Schrode says in the video above. “This is a militarized police force up against an unarmed, peaceful, prayerful people.” \\n  \\nWomen and children were reportedly present at the demonstrations. \\nAnother video, streamed live on Facebook by user Cempoalli Twenny, provides a clear shot of the bridge in question. Drumbeats and chants can be heard as several “water protectors” attempt to cross the river: \\n\\nIn a separate video , Twenny says that while being interviewed, police “shot at the reporter” but were “possibly aiming for me.” \\n“[A] sista reporter was hit [instead],” he writes, referring to Schrode. \\nOn Facebook, Schrode shared video of the incident, which shows her interviewing Twenny when suddenly she is hit: \\n\\n“I was just shot,” says Schrode, a journalist who has worked with CNN, NBC and The New York Times, in a Wednesday post . “Militarized police fired at me from point blank range with a rubber bullet on the front lines of Standing Rock.” \\nShe continues: \\nMy body will be okay, but I am hurting, I am incensed, I am weeping, I am scared. Peaceful, prayerful, unarmed, nonviolent people on one side of a river; militarized police with armed vehicles and assault weapons occupying treaty land on the other, where sacred burial grounds have already been destroyed. What is happening here in North Dakota is like nothing I have ever seen in my life, anywhere in the world. … \\nIt is inexcusable for the President Obama to say he will “let it play out for several more weeks.” It is unjustifiable for the Attorney General to not be here. It is unconscionable for mainstream media to not cover this. It is indefensible for all politicians to not condemn what is occurring here. It is disgraceful for more people to not speak out and show up to stop the Dakota Access Pipeline. \\nCass County Sheriff Paul Laney provided a very different perspective on the conflict. “In my 27 years in law enforcement, I have never seen such an absolute disregard for the law, or other people’s rights because of someone else’s ideology,” he states in a press release. “The idea that because you have a strong opinion about something means you can threaten, harass and intimidate other American citizens is just plain wrong.” \\nNumerous video accounts show police officers firing rubber bullets at those standing in the water. The Morton County Sheriff’s Department released a statement regarding its tactics. \\n“Law enforcement witnessed protesters building an illegal, man-made, wooden bridge across the Cantapeta Creek,” the statement reads. “Protesters involved in building the bridge violated numerous federal and state laws including the Clean Water Act and the Safe River and Harbors Act.” \\nThe statement continues: \\nAuthorities used less-than-lethal ammunition to control the situation. In one incident a male was at a boat and was throwing bottles at officers on the police line. A second incident occurred when a man wearing a gas mask, refused to show his hands, refused to disperse and charged the police line. Officers also deployed pepper spray and tear gas to disperse the group of protesters who came across the water and camp at officers. No lethal shots were fired from law enforcement. \\nAccording to the press release, one person was arrested for “conspiracy to commit obstruction of a government function” after purchasing kayaks and canoes for the demonstrators. In the past few months, hundreds of people have been arrested while fighting to halt the DAPL. \\n“It was like witnessing Gandhi’s Salt March,” Fox says, “then suddenly I am watching people being maced, and I hear a pop and see that they shot Erin Schrode with a rubber bullet. How is it possible that from 10 feet away, they are shooting at   journalists, bystanders, medics?” TAGS:'"}, "time": 1742564169.9293487}