{"duration": 0.2536654472351074, "input_args": {"text": "' The Euro Is Murdering Europe\\nBy F. William Engdahl\\nNovember 13, \" NEO \" - The Euro is murdering the nations and economies of the EU quite literally. Since the fixed currency regime came into effect, replacing national currencies in transactions in 2002, the fixed exchange rate regime has devastated industry in the periphery states of the 19 Euro members while giving disproportionate benefit to Germany. The consequence has been a little-noted industrial contraction and lack of possibility to deal with resulting banking crises. The Euro is a monetarist disaster and the EU dissolution is now pre-programmed as just one consequence.\\nThose of you familiar with my thoughts on the economy will know I feel the entire concept of globalization, a term which was popularized under the presidency of Bill Clinton to glamorize the corporativist agenda that had just come into being with creation of the World Trade Organization in 1994, is fundamentally a destructive rigged game of the few hundred or so giant \\x93global players. Globalization destroys nations to advance the agenda of a few hundred giant, unregulated multinationals. It\\x92s based on a disproven theory put forward in the 18 th Century by English free trade proponent David Ricardo, known as the Theory of Comparative Advantage, used by Washington to justify removing any and all national trade protectionism in order to benefit the most powerful \\x93Global Players,\\x94 mostly US-based.\\nThe faltering US project known as Trans-Pacific Trade Partnership or the Trans-Atlantic Trade and Investment Partnership, is little more than Mussolini on steroids. The most powerful few hundred corporations will formally stand above national law if we are foolish enough to elect corrupt politicians that will endorse such nonsense. Yet few have really looked closely at the effect that surrender of currency sovereignty under the Euro regime is having.\\nCollapse of Industry\\nThe nations of what today is misleadingly known as the European Union follow a concept ratified by a then-far-smaller number of European members\\x96twelve versus 28 states today\\x96of what had been the European Economic Community (EEC). A European version of giganto-mania appeared during the EEC Commission presidency of French globalist politician Jacques Delors when he unveiled what was called the Single European Act in February 1986.\\nDelors overturned the principle established by France\\x92s Charles de Gaulle, the principle which de Gaulle referred to as \\x93Europe of the Fatherlands.\\x94 De Gaulle\\x92s concept of the European Economic Community\\x96then six nations including France, Germany, Italy and the Benelux three\\x96was one in which there would be periodical meetings of the premiers of the six Common Market nations. There, with elected heads of states, policies would be formulated and decisions made. An assembly elected from members of national parliaments would review the actions of the ministers. De Gaulle viewed the Brussels EEC bureaucracy as a purely technical administrative body, subordinate to national governments. Cooperation should be based on the \\x93reality\\x94 of state sovereignty. Supranational acquisition of power over individual nations of the EEC was anathema for de Gaulle, rightly so. As with individuals so with nations\\x97autonomy is basic and borders do matter.\\nDelors\\x92 Single Act proposed to overturn that Europe of the Fatherlands through radical reforms to the EEC aimed at the destructive idea that the diverse nations, with diverse histories, cultures and diverse languages, could dissolve borders and become a kind of ersatz United States of Europe, run top down by unelected bureaucrats in Brussels. It in essence is a Mussolini-style corporativist or fascist vision of a non-democratic, non-responsible European bureaucracy controlling populations arbitrarily, answerable only to corporate influence, pressure, corruption.\\nIt was an agenda developed by the largest multinationals of Europe, whose lobby organization was the European Roundtable of Industrialists (ERT), the influential lobby group of Europe\\x92s major multinationals (by personal invitation only) such as Swiss-based Nestle, Royal Dutch Shell, BP, Vodafone, BASF, Deutsche Telekom, ThyssenKrupp, Siemens and other giant European multinationals. The ERT, not surprisingly, is the major lobby in Brussels pushing adoption of the TIPP trade deal with Washington .\\nThe ERT was a major driver for the 1986 Delors Single Act proposals that led to the Frankenstein Monster called the European Union. The idea of the EU is creation of a top-down central unelected political authority that would decide the future of Europe without democratic checks and balances, at heart a truly feudal notion.\\nThe concept of a single United States of Europe, dissolving national identities that went back more than a thousand years or more, can be traced back to the 1950\\x92s when the Bilderberg Meeting of 1955 in Garmisch-Partenkirchen, West Germany, first discussed the creation out of the six member nations of the European Coal and Steel Community of \\x93a common currency, and this necessarily implied the creation of a central political authority .\\x94 De Gaulle was not present.\\nThe project to create a monetary union was unveiled at a 1992 EEC conference in Maastricht, Holland following the unification of Germany. France and Italy, backed by Margaret Thatcher\\x92s Britain, forced it through over German misgivings in order to \\x93contain the power of a unified Germany.\\x94 British Tory press railed against Germany as an emerging \\x93Fourth Reich,\\x94 conquering Europe economically, not militarily. Ironically, this is what has very much de facto emerged from the structures of the Euro today. Because of the Euro, Germany economically dominates the entire 19 Eurozone countries.\\nThe problem with the creation of the European Monetary Union (EMU) prescribed in Maastricht Treaty is that the single currency and the \\x93independent\\x94 European Central Bank were launched without being tied to a political single legal entity, a genuine United States of Europe. The Euro and the European Central Bank is a supranational creation without answerability to anyone. It was done in absence of a genuine organic political union such as that created when 13 states, with common English language and following a commonly-fought war of independence from Great Britain, created and adopted the Constitution of the United States of America. In 1788 the delegates from the 13 states agreed to establish a republican form of government grounded in representing the people in the states, with separation of powers between the legislative, judicial and executive branches. Not so the EMU.\\nThe EU bureaucrats have a cute name for this disconnect between unelected central bank officials of the ECB controlling the economic destiny of the 19 member states with 340 million citizens of the so-called Eurozone. They call it the \\x93democratic deficit.\\x94 That deficit has grown gargantuan since the 2008 global financial and banking crisis and the emergence of the not-sovereign European Central Bank.\\nCollapse of Industry\\nThe creation of the Euro single currency since 1992 has put the Euro member states into an economic strait-jacket. The currency value cannot be changed to boost national exports during economic downturns such as that experienced since 2008. The result has been that the largest industrial power in the Eurozone, Germany, has benefited from the stable euro while weaker economies on the periphery of the EU, including most notably, France, have endured catastrophic consequences to the rigid Euro rate.\\nIn a new report, the Dutch think-tank, Gefira Foundation, notes that French industry has been contracting since the adoption of the euro. \\x93It was not able to recover after either of the 2001 or 2008 crises because the euro, a currency stronger than the French franc would be, has become a burden to France\\x92s economy. The floating exchange rate works like an indicator of the strength of the economy and like an automatic stabilizer. A weaker currency helps to regain competitiveness during a crisis, while a stronger currency supports consumption of foreign goods .\\x94\\nThe study notes that because of this currency strait-jacket, ECB\\x92s policy has created a Euro too high versus other major currencies to enable France to maintain exports since the economic downturn of 2001. The Euro has led to increased imports into France and because France had no exchange rate flexibility, her industry \\x93could not regain international competitiveness in the world\\x92s market after the 2001 crisis, so its industry has been slowly dying ever since.\\x94 They lost the economic stabilizing tool of a floating exchange rate .\\nToday, according to the Eurostat, industry makes up 14.1% of the French total gross value added. In 1995 it was 19.2%. In Germany it is 25.9%. Most striking has been the collapse of a once-vibrant French car industry. Despite the fact that world car production almost doubled from 1997 to 2015 from 53 million to 90 million vehicles annually, and while Germany increased its car production by 20% from 5 to 6 million, from the time France joined the Euro in 2002, French car production almost halved from nearly 4 million to less than 2 million .\\nEuro Bail-in Laws\\nThe same Euro strait-jacket is preventing a serious reorganization of troubled banks across the Eurozone since the 2008 crisis. The creation of the supra-national, non-sovereign European central Bank has made it impossible for member countries of the Eurozone to resolve their banking problems created during the excesses of the pre-2008 period. The case of Italy with its request to make a state bailout of its third-largest bank, Monte dei Paschi, is exemplary. Though draconian layoffs and closings have for the moment eased panic, Brussels refused to permit a $5 billion Italian state rescue of the bank, instead demanding the bank revert to a new EU banking law called \\x93Bail in.\\x94 While they may not yet dare to implement bail-in just yet in Italy, it is EU law and will certainly be the instrument of choice by the unelected Eurogroup when the next banking crisis hits.\\nBail-in, while it sounds better than taxpayer bailout, actually requires that a bank\\x92s depositors be robbed of their deposits to \\x93rescue\\x94 a failed bank, if Brussels or the unelected Eurogroup decides such a bail-in of deposits is needed after bank bond holders and stock holders and creditors have not been able to meet the losses. This bail-in confiscation was applied in Cyprus banks in 2013 by the EU. Depositors there with over \\x80100,000 either lost 40% of their money .\\nIf you are a depositor in, say, Deutsche Bank, and the stock shares are tanking, as they have been, and legal troubles threaten their existence, and the German government refuses to talk bailout, but rather leaves the bank to potential bail-in, you can be sure every depositor with an account over \\x80100,000 will begin to look to other banks, worsening the crisis for Deutsche Bank. Then all other remaining depositors would be vulnerable to bail-in as was initially proposed by the Eurogroup for Cyprus banks.\\nSurrender of monetary sovereignty\\nUnder the Euro and the rules of Eurogroup and ECB, decisions are no longer sovereign but central, taken by not-democratically appointed faceless bureaucrats like Holland Finance Minister, Jeroen Dijsselbloem, President of Eurogroup. During the Cyprus bank crisis Dijsselbloem proposed confiscating all depositor money, big or small, to recapitalize the banks. He was forced to back down at the last minute, but it shows what is possible in the coming EU bank crisis that is pre-programmed by the defective Euro institution and its fatally flawed ECB.\\nUnder current Eurozone rules, effective January, 2016, EU national governments are prohibited from taxpayer rescue of their banks, preventing orderly resolution of bank liquidity problems until too late. Germany has adopted a bank bail-in law as have other EU governments. The new bail-in rules are the result of a bureaucratic directive from the unelected, faceless bureaucrats of the EU Commission known as the EU Bank Recovery and Resolution Directive (\\x93 BRRD \\x94).\\nIn 1992 when Swedish banks went into insolvency as a real estate bubble popped, the state stepped in with Securum, a bad-bank/good bank rescue. The bankrupt banks were temporarily nationalized. Non-performing real estate loans in billions were put into the state corporation, Securum, the so-called bad bank. The risk-addicted bank directors were dismissed. The nationalized banks, minus bad loans, were allowed, under state management, to resume lending and return to profit before being reprivatized as the economy improved. The non-performing real estate became again profitable as the economy recovered over several years, and after five years the state could sell the assets for a total net profit and liquidate Securum . Taxpayers were not burdened.\\nECB Prevents Bank Resolutions\\nNow, as the EU faces a new round of bank solvency crises with banks like Deutsche Bank, Commerzbank and major banks across the Eurozone facing new capital crises, because the EU lacks a central taxation power, no flexible tax-payer or bank nationalization is possible. New national bank rules adjusted to local circumstances are not possible. Measures to give troubled banks time such as allowing a temporary moratorium on foreclosures and repossessions if people fall behind on their payments, outsourcing national electronic payment system to commercial banks, are not possible.\\nThe EuroZone has no central fiscal authority, so such solutions cannot be implemented. Banking system problems are only being solved by monetary authorities, by the insane ECB policy of negative interest rates, so-called Quantitative Easing where the ECB buys endless billions of Euros in dodgy corporate and state debt with no end in sight, and in the process making insurance companies and pension funds insolvent.\\nThe answer is definitely not that proposed by the kleptocratic George Soros and others, namely to give the unelected Brussels super-state the central fiscal power to issue Brussels Euro bonds. The only possible solution short of destroying the economies of the entire Eurozone in the coming next European bank solvency crisis, is to dismantle the Frankenstein Monster called the European Monetary Union with its ECB and common currency.\\nThe individual countries in the 19 country Euro Zone do not form what economists call an \\x93optimum currency area,\\x94 never did. The economic problems of a Greece or Italy or even France are vastly different from those of Germany, or of Portugal or Spain.\\nIn 1997 before his death, one of my least-favorite economists, Milton Friedman, stated, \\x93Europe exemplifies a situation unfavorable to a common currency. It is composed of separate nations, speaking different languages, with different customs, and having citizens feeling far greater loyalty and attachment to their own country than to a common market or to the idea of Europe.\\x94 On that, I have to say, he was right. It\\x92s even more so the case today. The Euro and its European Central Bank are murdering Europe as effectively as the Second World War did, only without the bombs and rubble.\\nF. William Engdahl is strategic risk consultant and lecturer, he holds a degree in politics from Princeton University and is a best-selling author on oil and geopolitics, exclusively for the online magazine \\x93New Eastern Outlook.\\x94'"}, "time": 1742561890.1603441}