{"duration": 0.1424870491027832, "input_args": {"text": "'Chris Black November 21, 2016 5 DIY Survival Tools To Make From Scratch \\nLet’s begin today’s article with a question: do you know what homo sapiens means? Well, I bet you do. But then again, how about homo faber? What’s the relation between homo sapiens and homo faber? \\nTranslated literally, homo faber means “man, the maker.” \\nTo put it simply, let’s assume that dolphins are very intelligent creatures since that’s what I hear constantly on National Geo and the Discovery Channel. \\nBut that intelligence doesn’t help them much; they’re just the same as they were 500,000 years ago. Cute, intelligent creatures that constantly get caught in our fishing nets (by mistake) and they can’t get out. They often end up in tuna cans (that’s why I never eat tuna, but I’m digressing). \\nAre you starting to get the picture? \\nHomo faber is a peculiar creature, and I mean us, the people, the only “animals” on the planet which are able to control their environment through the use of – you guessed it – tools. Okay, tools and a juicy brain-to-body ratio. Some say that we control our fate too with those same tools , but I have my doubts about that. \\nRegardless of what you’re thinking about your fate or the lack thereof, tools are pretty cool to have, especially in a survival situation . But then again, tools aren’t necessarily defined by what you can buy for $3.99 in your local hardware store. \\nActually, some while ago, I saw an octopus on TV that was using a small rock to break a clam’s shell. By most accounts, octopuses are pretty stupid compared to humans. \\nThe idea is that when confronted with an outdoors survival scenario, you can improvise tools from scratch, thus living to fight another day. If an octopus can do it, so can you, right? \\nSo, if early humans were able to manufacture tools using first animal bones, then stones, then metal and then via 3D printing, what’s there to stop you from learning from your ancestors? \\nNow that you have the general idea, let’s see about a few primitive-technology ideas which may very well save your life someday, or at least improve the quality of life for you and your family in a survival scenario, which is the next best thing. \\n1. How to build a fresh water prawn trap from scratch \\nThe idea is very simple and straightforward: one must eat in order to stay alive. So, with the prawn trap you can catch prawns and eat them. The trap is very easy to build using lawyer cane, vine, and sticks. Prawn/fish traps are very easy DIY traps which can successfully be used to catch aquatic life thanks to their peculiar shape. \\nBasically, you’ll have to build a simple basket with an entrance designed in a funnel-like fashion so that the prawn will get funneled in, but it will not be able to get out. Here’s the detailed video tutorial about the DIY-ing job itself. Video first seen on Primitive Technology . \\nThe trap must be placed under some tree roots or something similar in the water and it doesn’t require bait, as curiosity kills the cat … err, prawns. You’ll require a little bit of basketry practice but if you’re into outdoor survival, learning this skill may prove very useful some day for many different tasks. \\n2. How to make a survival spear from scratch \\nSpears were among the first hunting/ self defense weapons used by mankind and this video tutorial will teach you how to make your own survival spear from (almost) scratch. Video first seen on Animal Man Survivor . \\nAll that’s required is a cutting tool, which may very well be a knife or a stone with a sharp edge. and a piece of wood of the desired length. Watching the video will also teach you how to make a fire using what’s available in the woods, i.e. almost nothing. \\nOh, I almost forgot – here’s how to make a rock knife if you don’t carry a survival blade on your person 24/7 (not good). Video first seen on Captain Quinn . \\n3. How to build a grass hut from scratch \\nYou do remember the holy trinity of survival, right? Food, water and shelter. I know that a grass hut made from scratch is not a tool per se, but it’s a shelter by any definition and it can be built basically anywhere on Earth, provided there’s grass available. Which means, almost anywhere. \\nThis project is easy to build, with a simple yet effective design and you’ll only require a sharp stone (or a knife) and a digging tool (stick, shovel, whatever). Here’s the video tutorial. Video first seen on Primitive Technology . \\n4. How to DIY a Bow and Arrow from scratch \\nWhile hunting with a spear requires some mad skills, bows and arrows are the ideal hunting tools for long-term wilderness survival. \\nThis video tutorial will teach you how to DIY a bow and arrow outdoors, using primitive “technology” – natural materials and tools made from scratch, i.e. a stone chisel, a stone hatchet, fire sticks and various stone blades. Video first seen on Primitive Technology . \\n5. How to DIY a cord drill from scratch \\nCheck out this video tutorial and you’ll learn how to make a cord drill from scratch. This baby consists of a fly wheel, a shaft, and a piece of cord and it can be used for making a fire without getting blisters on your (soft) hands or for drilling holes. Video first seen on Primitive Technology . \\nNow, with the “survival stuff” taken care of, let’s see about a few life-hacks, i.e. some “more benign” tools made from recycled materials. \\nNext time you destroy a tape measure, you can improvise a depth gauge using a piece from the broken tape-measure by cutting out a twelve inch section using a pair of tin snips. To get an usable zero to twelve inch scale, start cutting at the beginning of a one footmarker and then use the ultra-thin, elastic material for measuring stuff in small/confined places \\nYou can use scrap wood from the shop for improvising a table saw push stick for keeping your hands and fingers on the safe side when feeding wood to the saw at a consistent rate. Video first seen on Adam Gabbert . \\nHere’s how to make a scratch stock cutter from an old hand saw which can be used for scraping/scratching a decorative profile into a piece of wood, a method used by furniture manufacturers on historic pieces for creating a hand-made appearance. Video first seen on Wood By Wright . \\nYou can improvise an adjustable marking gauge by driving a dry-wall screw into a piece of wood. Video first seen on Paul Sellers . \\nYou can use an empty bottle as a glue dispenser, thus saving money by buying glue in bulk. You’ll require an empty bottle that features an extendable cap, which allows you to distribute a consistent amount of adhesive for, let’s say edge-gluing boards. \\nWhen closing the cap, you’ll prevent the glue from drying out. The best bottles to use are bottles with sports caps, such as water bottles,, Gatorade bottles, or dish soap bottles. An expired credit card is excellent as a glue spreader. \\nIf you want to drill perfectly perpendicular deep holes without a drill-press, just use an old piece of mirror and position it against the drill bit. \\nYou’ll have to fine-tune the position of the drill until the reflection and the bit are combined in such a way that they look perfectly aligned. That’s all! \\nOr you can make your own smart saw at home. Click the banner below to find out how to transform your ideas into real projects. \\n  Chris Black for Survivopedia. 363 total views, 363 views today'"}, "time": 1742564577.4730144}