{"duration": 0.059644460678100586, "input_args": {"text": "'The city of San Francisco is demanding statistics and details from   companies Uber and Lyft to “assess their impact on traffic congestion, safety, pollution, and parking and ascertain whether they are accessible for disabled and   riders. ”[“City Attorney Dennis Herrera on Monday subpoenaed Uber and Lyft to disgorge records on four years of driving practices, disability access and service in San Francisco,” reported the San Francisco Chronicle this week. “The companies have steadfastly declined to share data other than that they have about 45, 000 drivers in the Bay Area. ”  The city is demanding information on “miles and hours logged by drivers, incentives that encourage drivers to ‘commute’ from as far away as Fresno or Los Angeles, driver guidance and training, accessible vehicle information, and the services provided to residents of every San Francisco neighborhood,” according to the Chronicle, and if they fail to comply within fifteen days, court penalties will be imposed. “No one disputes the convenience of the   industry, but that convenience evaporates when you’re stuck in traffic behind a   Uber or Lyft, or when you can’t get a ride because the vehicle isn’t accessible to someone with a disability or because the algorithm disfavors the neighborhood where you live,” said City Attorney Dennis Herrera, before also criticizing the effects of fatigued drivers who work for too many hours. “These fatigued drivers are not only a threat to themselves, but to San Francisco pedestrians, bicyclists and drivers,” Herrera claimed. “Policies that encourage or turn a blind eye to drowsy driving by drivers with little or no familiarity with San Francisco’s roads or weather conditions make our city less safe. They are a public nuisance. ” Both Uber and Lyft claim that releasing such information to the city could risk company secrets, and empower competition. “We’re more than happy to work with the city to address congestion, but it should be a comprehensive solution including construction, the city’s population increase, and the rise of online delivery services,” said Uber spokesman Eva Behrend. “In San Francisco, nearly 30 percent of rides take place in underserved neighborhoods and 20 percent of Lyft rides begin or end at a public transit station,” said spokeswoman Chelsea Harrison in a statement, addressing concerns about access to transportation. “We also have a track record of working collaboratively with policymakers who regulate us, including the (PUC) here in California, to ensure that our service complements existing transportation options. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742562263.8216221}