{"duration": 0.132371187210083, "input_args": {"text": "'Email \\nEven amidst the bluster, lies, and anger unleashed by the presidential election—the last of these captured this morning in a vivid photo essay in Germany’s leading daily, the Süddeutsche Zeitung , I often hear the calming strains of one of Johann Sebastian Bach’s most famous arias, “Sheep May Safely Graze.” The first duty of the president, we are often told by the candidates, is the security of the American people. In this piece Bach presents a sonic vision of safety secured by enlightened leadership. \\nAbove a pulsing B-flat drone whose static harmony conveys contented repose, a pair of pastoral recorders waft over an untroubled landscape: this is artfully managed nature with no suggestion of the horrors of the wild, nowhere the menace of danger. There are no armies or terrorists massing beyond the verdant hills. When, after two bars of instrumental introduction, the drone breaks into a gentle gait it is not done to worry the listener but to lift the eyes and ears over welcome fields. In just four graceful measures Bach has painted an expansive, tranquil canvas. Over these Bachian fields floats the soprano voice of Pales, the Roman deity of shepherds: \\nSheep may safe graze, When watched over by a good shepherd. Where rulers govern well Peaceful calm is to be felt That makes a country happy. \\nRuling your subjects well is like animal husbandry: manage the flock, be concerned, competent and watchful. Let your charges nibble and roam but never too far towards unknown perils. \\nWe may have the notorious Bundy gang getting let off federal conspiracy and weapons charges after its attempt at an armed takeover of huge stretches of the American landscape (the rogues gallery of the exonerated is to be seen in New York Times today is even scarier than the just-mentioned photo essay in the Süddeutsche Zeitung ), but Bach’s aria nonetheless projects a pursuit of happiness that can readily be transposed from its premiere on February 23 rd , 1713 in a castle banqueting hall set in the green hills of central Germany to the Land of the Free on October 28, 2016 little more than a week before Election Day. Heard today, the aria confirms that what Americans want most is a nice lawn; a pet or two; and to be left in peace. \\nIn the three century’s since its first performance, the aria has proliferating in myriad transcription and arrangements, the most famous of them by the visionary Italian piano virtuoso F erruccio Busoni . Given the work’s graceful beauty, it is not surprising that in one version or another it’s a favorite at weddings: having played the thing countless times for nuptial proceedings, I can assert that its popularity indicates that security and stability, not passion, are the enduring foundation of the institution of marriage, and in turn therefore of American democracy. The aria text’s praising male rule remains unheard in these instrumental transcriptions, and the wedding pairs remain blissful ignorant of it. \\nThis Best-of-Bach track comes from the so-called Hunt Cantata (BWV 208), composed for the thirty-first birthday of Duke Christian of Saxe-Weißenfels. He loved music, but even more, hunting, a proclivity captured by Bach in his musical tribute. At his own wedding the previous year, Duke Christian’s distant relative, the mighty Saxon Elector and Polish King, Frederick the Strong, had had his jewelers, the miraculous Dinglinger brothers, fashion a lavish hunting cup that he presented to the couple and which is now to be marveled at in Dresden’s famous museum, the Grünes Gewölbe. Bach’s music was meant to match this level of opulence and artifice, one which even minor German princes like Christian enjoyed. \\nBut hunting was not just a topic for artistic representation at the hands of a Dinglinger or a Bach. It was a dangerous pursuit, especially since prevailing attitudes towards gun control and safety were almost as primitive as those held in America today. Musicians were not spared mortal danger. The Weißenfels male alto and writer on music Johann Beer, who was also among the funniest and most prolific of early German novelists, got himself killed in a hunting accident with one of the dukes. His colleague David Heinrich Garthoff, who must have known Bach, came to the court as an oboist (an instrument often deployed for accompanying the hunt) but got his lower lip shot off while hunting birds. Garthoff was a versatile musician and became the court’s lipless organist. \\nLucky for us, Christian didn’t hand Bach a blunderbuss and command him into the fields when the composer visited the court for the Duke’s birthday festivities in 1713, otherwise we might have been deprived of hundreds of cantatas, the Goldberg Variations, the B-Minor Mass and heaps of other hits and only a few misses. \\nBoth Countess Clinton and Sir Donald are all for protecting the gun rights of hunters, so this is a movement both could get behind. Indeed, it’s any gun-lover’s dream, even if he didn’t—or doesn’t—have a tenth of the arsenal of the Duke. At the aria’s start the obligatory horns fill the banqueting with tales of the day’s daring escapades taking down massive bucks beaten towards the hunting party so that the Duke could dispatch these trophies-to-be at close range. Then the goddess Diana, sung by the famed German soprano Pauline Kellner (also likely Anna Magdalena Bach’s teacher), unleashed her own dazzling vocal firepower, shoots off a coloratura melisma on the very first syllable before listeners can even figure out what she was referring to, though the hunting horns have left little doubt: “Hunting is the passion of the gods,” she sings, following that blast with a line that would make a fine bumper sticker for a Ford F-250 pick-up on the back roads of Upstate New York: “Hunting is for heroes.” Even if there had been rather too much of the above-mentioned collateral damage among Weißenfels musicians, this is bracing bipartisan defense of guns and game. While the aria may indeed represent Hilary’s views on the second amendment, she could use more than a little of the panache of Bach’s Diana in getting her message out. \\nBefore we leave this hugely entertaining cantata let’s listen quickly to the political lessons to be gleaned from the first aria of Pan, the god of shepherds and a lusty rustic type who, like Donald, you wouldn’t want to sit next to in first-class. Bach makes his Pan a fun-loving, loose cannon of a bass, who goes off half-cocked claiming that he would make a worthy leader: like Bill Clinton and Donald Trump , this libertine purports to have great erotic powers, and it can only be assumed he thinks these will help him as head-of-state. A pair of brash oboes starts bragging even before the voice enters, making the absurd claim that “A Prince is the Pan of his country.” The bass sounds-off through a lurching gigue that suggests too much drink. After his opening comic comparison, one about as funny as imagining Donald Trump in the Oval Office, Pan goes on to make a decent point of political theory, though hardly an original one since the analogy between a ruler-less country and a headless body politic was a trope of the time: \\nJust as the body without the soul Cannot live or control itself, So a country is a cave of death When it no longer has a head and prince And therefore lacks its best part. \\nPan holds resolutely to long notes on “live” and “rule” but then tumbles drunkenly down from them as he runs out of breath. On entering the mortal cavern with its minor shadows and chromatic crags, the drunk goes dark, only brightening just before the close when he remembers that he is after all “the best part”—the happy head to the nation’s body. It’s a raucous, rambling stump speech worthy of you-know-who. \\nSumptuous entertainments like this cantata drained the ducal coffers in Weißenfels such that many of the court’s musicians—including some of Bach’s own in-laws—were eventually owed years of unpaid salary. As a result, the duchy was dissolved by the higher-up royals in Dresden. Even the marital Hunting Cup came back to the giver. If you believe the gun-loving Trump, a similar fate awaits the Americans once the Chinese debt-holders come calling—and not just to bag a couple of big horn sheep for their trophy wall.'"}, "time": 1742562144.4328778}