{"duration": 0.03333306312561035, "input_args": {"text": "'During his speech in Harrisburg, Pennsylvania, Donald Trump attacked Minority Leader Sen. Chuck Schumer ( ) describing him as a “bad leader” who is “leading the Democrats to doom. ”[Discussing the opposition from Democrats to his plans to build a border wall, Trump said, “Unfortunately, Democrats in Congress have no leadership, they are rudderless. ”  “Senator Schumer is a bad leader. I’ve known him a long time, Senator Schumer is a bad leader, not a natural leader at all. He works hard to study leadership   …     Well if you have to study leadership you’ve got problems,” Trump said. “His policies are hurting innocent Americans and making it easier for drug dealers to enter our country. Schumer is weak on crime and wants to raise your taxes through the roof. He is a poor leader, and he is leading the Democrats to doom,” Trump continued. Trump also criticized Democrats in Congress for opposing his immigration agenda, arguing that “If the Democrats knew what the hell they were doing, they would approve [the wall] so fast, as we want to stop crime in our country. ” He said: Obviously they don’t mind illegals coming in, they don’t mind drugs pouring in, they don’t mind MS13 coming in. Members of Congress who’ll be voting on border security have a simple choice, they can either help to vote drug cartels and criminal aliens trying to enter the United States, like frankly, the Democrats are doing. Or they can vote to help American citizens and American families be safe, that’s the choice. In March, Sen. Chuck Schumer claimed that Trump’s plans to build a wall on the southern border would not get sufficient votes from Democrats or Republicans, as “It’s not the best way to protect the border” and “It’s very expensive. ” You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742628369.041365}