{"duration": 0.15015029907226562, "input_args": {"text": "'on October 30, 2016 2:24 pm · \\nOne thing that has continuously dogged the Donald Trump for president campaign is the fact that racists, anti-semites, xenophobes, misogynists, and various other bigots have stuck with the bombastic real estate mogul since he first launched his travesty of a campaign. No matter how much Trump’s people try to say he doesn’t want the support of such folks, the candidate himself refuses to take the fact that there is anything about the campaign he has been running that attracts these people seriously. So, naturally, when Trump’s campaign manager Kellyanne Conway sat down with an interview with CNN’s Jake Tapper on Sunday , that particular issue came up again. Of course, Conway was not happy. Tapper began: \\n“There are a lot of anti-Semites and racists and misogynists who support the Trump candidacy.” \\nConway immediately went on defense, saying, “wow.” Tapper went on to reference a man who was shouting ‘JEW-S-A’ at the press pen at a recent Trump rally, and directly asked Conway if she would refer to such people as ‘deplorable.’ She responded: \\n“Yes, I would. Wow, I have to push back on some of the adjectives you just used to describe — I hope you’ve been to Trump rallies and I hope that you’ve seen the tens of thousands. I mean, he’s had over half a million people easily, I think in excess of that. These are U.S.A.-loving Americans.” \\nTapper went on to say that no, he isn’t putting all Trump supporters into that camp, but went on to force Conway’s hand on this one: \\n“But without question, people who are experts on hate groups say that there has been a comfort level that has been offered to people who are anti-Semitic that has been offered to people who are anti-Semitic and racists and on and on. And these people are comfortable coming out in the open and supporting Mr. Trump. \\nMr. Trump has refused to condemn in a very serious way his racist and anti-Semitic fans,” Tapper continued. “He just has. He says things like, “Oh, sure, I disavow, I disavow.’ But he has never serious said, ‘I don’t want the support of those people, they are reprehensible, they have nothing to do with me.’ He has never seriously done it.” \\nConway used the pushing to pivot back to the idea that the Trump campaign is winning, saying: \\n“I think this exchange is frankly the best piece of evidence I have that we’re actually going to win in nine days because the idea that we’re going to shift away from the pattern of corruption the cloud of ethical stain that Hillary Clinton would bring to the Oval Office in such an important week.” \\nNo, Kellyanne, it’s not a sign that Trump is winning. It’s pointing something out that has been true since this whole fiasco began: That Donald Trump is a raging bigot, and he has been so openly. Dog whistles have turned into fog horns this election cycle, and it’s all because of Donald Trump. He embraces these bigots because he’s one of them. The quicker you learn that, the better. \\nWatch the exchange below: \\nFeatured image via video screen capture Share this Article! Share on Facebook Author: Shannon Barber Shannon Barber is a self- described queer feminist and activist for racial equality, LGBT rights, women’s rights, and secular rights in America. She is a lifelong lover of words, though her educational background is in computer science. She currently writes for 2 liberal websites, and keeps her own humor blog for lesbians. She hopes to change the world, one mind at a time. Search'"}, "time": 1742628352.1304262}