{"duration": 0.03276371955871582, "input_args": {"text": "'WikiLeaks threatened to sue CNN for defamation after the network aired a clip of CNN counterterrorism analyst Phil Mudd accusing WikiLeaks founder Julian Assange of being a pedophile. [Tweeting from the official WikiLeaks Task Force account  —   a support account for the organisation  —   a tweet reads, “CNN airs    of the CIA falsely calling Assange a ‘pedophile. ’”   CNN airs    of the CIA falsely calling Assange a ’pedophile’ https:  .   The plot: https:  .   —   WikiLeaks Task Force (@WLTaskForce) January 4, 2017,  The clip attached to the tweet shows Phil Mudd on CNN’s New Day program discussing the recent Fox News interview with Julian Assange. Mudd accuses Fox News’ Sean Hannity of “skirting the bottom line” in relation to questions about Russian interference in the US election, despite Assange openly stating that WikiLeaks’ source of DNC documents was in no way related to Russia. Mudd further stated that he thought there was an “effort by WikiLeaks to protect a pedophile that lives in the Ecuadorian embassy in London,” and further claimed that Julian Assange was “not credible. ” In response to this, the official WikiLeaks Twitter account has retweeted the Task Force tweet with the added quote, “We have issued instructions to sue CNN for defamation,” clarifying, “Unless within 48h they air a one hour expose of the plot. ” We have issued instructions to sue CNN for defamation:https:  .  Unless within 48h they air a one hour expose of the plot.  —   WikiLeaks (@wikileaks) January 4, 2017,  CNN’s New Day twitter account has since deleted the tweet WikiLeaks Task Force cited and appears to have removed the segment of the video in which Mudd called Assange a pedophile from the story the tweet originally linked to. It also tweeted out a statement saying CNN had “no evidence” to support the accusation that Assange is a pedophile. We’ve deleted a tweet that included a video clip from New Day earlier this morning. Here’s our statement: pic. twitter.   —   New Day (@NewDay) January 4, 2017,  Lucas Nolan is a reporter for Breitbart Tech covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan_ or email him at lnolan@breitbart. com'"}, "time": 1742563878.7770061}