{"duration": 0.015677690505981445, "input_args": {"text": "'posted by Eddie Scientists at Zurich-based DNA genealogy center, iGENEA, have reconstructed the DNA profile of King Tut, his father Akhenaten and grandfather Amenhotep III. Researchers discovered that King Tut belonged to a genetic profile group known as haplogroup R1b1a2. More than 50 per cent of all men in Western Europe belong to this genetic group as do up to 70 per cent of British men. But among modern-day Egyptians, less than 1 per cent of residents belong to this haplogroup, according to scientists. King Tut and Europeans share a common ancestor genetically who lived in the Caucasus region, the blue-eyed race spreading out with agricultural about 9,500 years ago. The geneticists were not sure how Tutankhamun’s paternal lineage came to Egypt from its region of origin, though it is clear that technology such as chariots and domesticated horses was introduced from a foreign source. Along with the discovery, researchers made another announcement this week: they will conduct testing to find which modern-day European is the closest living relative of King Tut. “The offer has only been publicized for three days but we have already seen a lot of interest,” Roman Scholz, lead director at the DNA genealogy center in Zurich, Switzerland. \\nDating almost 6,000 years to the Pre-dynastic period of ancient Egypt, this figure is of a man, with a shaven head and a long pointed beard. There is little detail on the figure but what there is, is concentrated on the face, his eyes are inlaid with light green stones and are the most arresting part of the figure. This is already typical of Egyptian art – they are obsessed with the eyes and more attention is usually given to them than almost any other aspect of a person. Louvre, Paris, France. Archaeologists in Egypt have recently unearthed a beautiful 5,000+ year-old wooden statue, complete with gold wrapping paper and precious lapis lazuli stones as striking blue eyes, dated from Egypt’s pre-dynastic era (3,700-3,200 BC), before the age of pharaohs, among the oldest such artifacts ever found to date. source:'"}, "time": 1742628490.5330803}