{"duration": 0.12039446830749512, "input_args": {"text": "'Fans of shimmery miniskirts,     choruses and beefcake backup dancers are in for a treat, as theater producers are turning to some of pop music’s biggest divas for their latest musical projects (and potential cash cows). News this month of a coming Tina Turner   is making it clear that producers “Believe” demand for such shows is “Strong Enough. ” (Couldn’t help it, Cher.) Here’s a look at four new   shows  —   three of them still in development  —   that act as if the ’70s, ’80s and ’90s never ended. Prediction: The costumes for the “Gypsies, Tramps and Thieves” number are going to be everything. WHAT IS IT? The American premiere of the stage adaptation of “The Bodyguard,” the 1992 film in which Houston, who died in 2012 at 48, made her movie debut, playing a pop star who falls for her protector. Essentially a   revue framed around a romantic thriller script, the musical was a hit in London when it opened four years ago. But the production now at the Paper Mill Playhouse in New Jersey “doesn’t exactly make you want to rush out and dance with somebody,” Charles Isherwood wrote in his New York Times review. WHAT YOU’LL SING Some 15 Houston classics, including “I Will Always Love You,” “Saving All My Love,” “I Have Nothing” and “I Wanna Dance With Somebody” SEE IT At Paper Mill Playhouse through Sunday, then on tour in the United States and other countries. WHAT IS IT? Billed as “The Cher Show,” this musical about that dynamic pop star (and frequent critic of Donald J. Trump on Twitter) aims, according to a casting notice, to “represent Cher at different moments of her life  —   starting as a teenager who falls for Sonny Bono (Babe) a successful music star navigating the challenges of the entertainment industry (Lady) and the lady we know today with a fascinating wealth of life experience, successes and failures (Star). ” Other characters apparently include the costume designer Bob Mackie, the movie mogul David Geffen and, mysteriously, Sigmund Freud. The show, with a book by Rick Elice (“Jersey Boys”) will get help from Jeffrey Seller, the producer of “Hamilton. ” WHAT YOU’LL SING Probably “I Got You Babe,” “If I Could Turn Back Time,” “Believe” and other songs made popular by Cher and her former husband and singing partner, Sonny, although a final song list was not announced. SEE IT The show will receive a series of staged readings  —   good luck trying to score a seat  —   from Monday through Jan. 14 in New York. WHAT IS IT? The story of the life of this disco queen will hustle to the stage in a    . A workshop held this year in New York, with direction by the Tony   Des McAnuff and   choreography by Sergio Trujillo, featured three actresses playing Summer at different stages of her life. (She died in 2012, at 63.) In a possible   nod to Summer’s popularity in gay clubs of the   ’70s, actresses in the workshop   to play some male roles. WHAT YOU’LL SING Over 20 of Summer’s hits, including “Bad Girls,” “Heaven Knows” and “Love to Love You Baby,” if the workshop was any indication. (“I can’t get that cake song out of my head, even though the lyrics are ridiculous, and it goes on forever,” a workshop attendee told Michael Riedel, the theater columnist for The New York Post, about Summer’s dance hit version of “Macarthur Park. ”) SEE IT Performances start in November at La Jolla Playhouse in California. WHAT IS IT? The playwright Katori Hall (“The Mountaintop”) and the   director Phyllida Lloyd (“Mamma Mia! ”) are collaborating with Ms. Turner, a Rock and Roll Hall of Famer, on a musical now being called “Tina. ” According to a report in The Daily Mail, Ms. Turner spent over a year in conversations with Ms. Hall about her “hardscrabble upbringing her marriage to fellow musician Ike Turner and how she fled from the abuse and beatings he inflicted on her. ” The   actress Adrienne Warren (“Shuffle Along”) led a workshop of the show this month in London. WHAT YOU’LL SING “Proud Mary,” “Private Dancer” and “What’s Love Got to Do With It” seem likely, but there is no final song list. SEE IT The producers are aiming to open in London in 2018.'"}, "time": 1742563613.9709523}