{"duration": 0.07531118392944336, "input_args": {"text": "'Criminology Professor Leif GW Persson appeared on a Swedish television programme and backed up claims by   police officer Peter Springare that migrants are vastly overrepresented in criminal cases. [Professor Persson appeared alongside the policeman on an episode of “Weekly Crime” for the Swedish broadcaster SVT and they discussed the recent comments made by U. S. President Donald Trump about the high rate of crime among migrants in Sweden. Persson totally agreed with Springare who was recently slammed for expressing the fact that most of the criminal suspects he sees in his work are from other countries.  “There is a strong prevalence of criminal immigrants. It is so obvious when it comes to crimes of this nature. Very serious violent crimes,” Springare said. Persson agreed with him saying, “Yes, I have made the same observation,” and adding “anyone with eyes to see can know who is doing these kinds of actions. ” “  is a fact,” Persson said and noted how many of the migrant criminals come from countries like Iraq, Somalia, and Afghanistan, while a decade ago they were from Turkey and the Balkans. Both Persson and Springare pointed out the fact that talking about migrant crime in Sweden was a huge taboo, something host Camilla Kvartoft didn’t agree with. “It is a taboo. And it is noticeable now. This has been such an incredible spread widely. And I look at the letters and emails I get that a very large number of police who are involved in serious crimes verifies this data,” Springare said. Persson noted that people were “reluctant” to report migrant crime saying, “The tendency to talk about it decreases the higher up in the police rank you are. But this is no secret. This is a problem you can happily avoid talking about. But times change. ” He claimed the issue could have huge ramifications going into the next general election in 2018. After making his comments on Facebook Springare was investigated for inciting racial hatred for pointing out that the suspects in his cases were overwhelmingly from migrant backgrounds. After President Trump brought global attention to the problems Sweden has had as a result of mass migration Breitbart London published ten reasons why the multicultural experiment in Sweden is falling apart. While crime is a big factor, from deadly shootings to rapes at music festivals, mass migration has had a huge impact on the Swedish school system and has contributed to an already existing housing crisis.  Follow Chris Tomlinson on Twitter at @TomlinsonCJ or email at ctomlinson@breitbart. com,  '"}, "time": 1742561799.340796}