{"duration": 0.11888384819030762, "input_args": {"text": "'| February 18, 2016 at 7:33 am | Reply \\nTrump’s “America We Deserve” book came out on 1/15/2000. I’ve learned magnitudes of mind-changing information in 16 years. Maybe Trump has, too (though he obviously does still have some huge blind spots, such as believing whatever the “Nightly News” says about anything/everything, from mass shootings [not awake to false flags] to boogeymen terrorists/ISIS [not awake to the fact the CIA/Mossad/MI5/6 create/fund the terrorist groups] to believing the lie that we need to give up privacy for “more security” [his current anti-Apple vs. FBI opinion], etc.). Even so, I think Trump is “TEACHABLE,” if the right people are given his ear. \\nSteve B. said: “…I cannot and will not vote for him, until that repudiation of his pro-choice past comes.” \\nHe has told the story quite a few times of his change of opinion re abortion. In short, he had friends who were going to abort but had the baby who then grew up to be a great kid which touched his heart personally. And in just the past few days I heard him say he basically went along with the abortion idea in his prior years because his daughter thought it was an OK thing, so he thought it was an OK thing, too. If Ivanka is nearing 35, then she probably DID think it was OK when she was 20-ish. (He did not say that in a blaming or scapegoating kind of way, btw.) Granted, Trump is obviously NOT a Biblically-discipled follower of Jesus. He may be a BELIEVER in Jesus, but he has obviously never been discipled. Trump needs an Aquila & Priscilla to “…take him unto them, and expound unto him the way of God more perfectly.” (Acts 18:26). \\nHere’s Trump’s anti-abortion statement from two days ago at his FB site. (Of course, I disagree with him still re: exceptions for “rape, incest or the life of the mother being at risk.” That’s still Lefty hogwash. No baby deserves to be murdered. The baby cannot determine the circumstances. Whatever happened to adoption, for pete’s sake?!): \\n[…] Donald J. Trump February 16 at 4:11pm \\nLet me be clear—I am pro-life. I support that position with exceptions allowed for rape, incest or the life of the mother being at risk. I did not always hold this position, but I had a significant personal experience that brought the precious gift of life into perspective for me. My story is well documented, so I will not retell it here. However, what I will do with the remaining space is express my feelings about life, and the culture of life, as we approach the 43nd anniversary of the Roe v. Wade. \\nI build things. There is a process involved in building things. We tap into a lot of disciplines with engineering being one of the most important. The rules for putting structures together are as strict as are the rules of physics. These rules have stood the test of time and have become the path to putting together structures that endure and are beautiful. America, when it is at its best, follows a set of rules that have worked since our founding. One of those rules is that we, as Americans, revere life and have done so since our Founders made it the first, and most important, of our “unalienable” rights. \\nOver time, our culture of life in this country has started sliding toward a culture of death. Perhaps the most significant piece of evidence to support this assertion is that since Roe v. Wade was decided by the Supreme Count 43 years ago over 50 million Americans never had the chance to enjoy the opportunities offered by this country. They never had the chance to become doctors, musicians, farmers, teachers, husbands, fathers, sons or daughters. They never had the chance to enrich the culture of this nation or to bring their skills, lives, loves or passions into the fabric of country. They are missing, and they are missed. \\nThe Supreme Court in 1973 based their decision on imagining rights and liberties in the Constitution that are nowhere to be found. Even if we take the court at its word, that abortion is a matter of privacy, we should then extend the argument to the logical conclusion that private funds, then, should subsidize this choice rather than the half billion dollars given to abortion providers every year by Congress. Public funding of abortion providers is an insult to people of conscience at the least and an affront to good governance at best. \\nIf using taxpayer money to facilitate our slide to a culture of death was not enough, the 1973 decision became a landmark decision demonstrating the utter contempt the court had for federalism and the 10th Amendment. Roe v. Wade gave the court an excuse to dismantle the decisions of state legislatures and the votes of the people. This is a pattern that the court has repeated over and over again since that decision. Perhaps Roe v. Wade became yet another incidence of disconnect between the people and their government. \\nWe are in the middle of a presidential political cycle and votes will be cast in just days. The citizens of this nation will have the chance to vote for candidates that are aligned with their individual worldviews. It is my hope that they will choose the builder, the man who has the ability to imagine the greatness of this nation. The next President must follow those principles that work best and that reinforce the reverence Americans hold for life. A culture of life is too important to let slip away for convenience or political correctness. It is by preserving our culture of life that we will Make America Great Again. \\n120K Likes 12K Comments 23K Shares […]'"}, "time": 1742562038.3243995}