{"duration": 0.0921320915222168, "input_args": {"text": "'Marvel Comic fans will be excited to hear that Marvel Entertainment, Disney|ABC, and IMAX Corporation has announced their unprecedented agreement to premiere the new ABC series, “The Inhumans” in IMAX commercial theaters. This will mark the first time that a live-action television series debuts in this way. The series will be shown in a two-week window, with its first two episodes slated to air in the late summer of 2017.\\nMarvel Comics is producing their first two episodes in conjunction with ABC studios. “The Inhumans” was filmed entirely with IMAX digital cameras. Following the premiere on the big screen, ABC will release the weekly series in the fall.\\nWho are The Inhumans? The Inhumans were first introduced into the Marvel Comics, in 1965, by Stan Lee and Jack Kirby. During the Kree-Skrull War, which occurred millions of years ago in Earth time, the Kree alien species set up a station on Uranus. As they worked on the station they noticed life on Earth had genetic potential. The Kree started experimenting with humans by splicing Eternals DNA into Cro-Magnons.\\nThe Krees’ goal was two-fold; they wanted to stop their own evolutionary stagnation, as well as create a powerful mutant race of soldiers, to help them fight the Skrulls. Though they were successful in their experiments, the Kree abandoned it.\\nHowever, their test subjects, the Inhumans, survived and formed their own society. They thrived in seclusion and developed advanced technology. After experimenting with the mutagenic Terrigen Mist, they found that although they acquired various powers, the mist also caused genetic damage and deformities.\\nThe Unspoken was once the leader of the Inhumans but was dethroned by the current king, Black Bolt. Bolt’s royal family consists of Maximus the Mad, Triton, Medusa, Karnak, Gorgon, Crystal, and their dog Lockjaw. Moreover, Medusa and Crystal were members of Marvel Comics, Fantastic Four and Crystal also teamed with the Avengers. “The Inhumans” will surround the never been told story and epic adventures of Black Bolt.\\nABC’s Other Marvel Comic Series “The Inhumans” marks the latest series to join the ABC network lineup. Unfortunately, last season, the network canceled “Agent Carter,” after two seasons. They also passed on a spin-off of “Agents of SHIELD.”\\nHowever, Marvel Comics is teaming up with Hulu on one of their other comic book-based series, which is in development. Other projects include the upcoming “X-Men” spin-off of “Legion,” on FX.\\nIMAX Marks Its First Debut With ‘Marvel’s The Inhumans’ Marvel Comic’s presentation of “The Inhumans” was originally slated for release in 2018, as a movie, rather than a series. However, it was pushed back to 2019, to make room for the Marvel Comic movie, “Spider-Man: Homecoming,” before it was pulled from the schedule, in April 2016.\\nIMAX is setting an unprecedented first, by hosting the premiere of the Marvel Comics television series. The reason being, IMAX is financing the pilot. Co-chairman of Disney Media Networks Ben Sherwood stated:\\nThis unprecedented alliance represents a bold, innovative approach to launching great TV content for a worldwide audience. It highlights Disney|ABC’s unrelenting commitment to finding new and creative ways to showcasing our very best programming and increasing global engagement and reach.\\nAfter the series premiere in IMAX theaters, Marvel Comics’ “The Inhumans” will move to ABC for the remaining six episodes.\\nBy Tracy Blake\\nEdited by Jeanette Smith\\nSources:\\nNews Everyday: Marvel Comics Partners With ABC For ‘Inhumans’ Series In Summer 2017\\nMarvel: ‘Marvel’s The Inhumans’ Coming to IMAX & ABC in 2017\\nThe Hollywood Reporter: Marvel, ABC Set ‘The Inhumans’ TV Series\\nImage Courtesy of Dennis Amith’s Flickr Page – Creative Common License\\n   IMAX , Marvel comics , spot'"}, "time": 1742561770.109911}