{"duration": 0.048929452896118164, "input_args": {"text": "\"Politics British Prime Minister Theresa May waits for the arrival of the King of Bahrain, Hamad bin Isa Al Khalifa outside 10 Downing Street in London on October 26, 2016. (Photo by AFP) \\nBritish Prime Minister Theresa May is facing growing criticism over her comments about Brexit at a leaked private speech to Goldman Sachs. \\nThe premier, who has publicly made the case for a hard Brexit following a June referendum, speaks of the “benefits” of being an EU member in the hour-long session, whose audio file was leaked to the Guardian on Tuesday night, drawing harsh criticism on Wednesday. \\n“I think the economic arguments are clear. I think being part of a 500 million [population] trading bloc is significant for us. I think, as I was saying to you a little earlier, that one of the issues is that a lot of people will invest here in the UK because it is the UK in Europe,” she is heard saying. “If we were not in Europe, I think there would be firms and companies who would be looking to say, do they need to develop a mainland Europe presence rather than a UK presence? So I think there are definite benefits for us in economic terms.” \\nThe leader of the rival Labour Party, Jeremy Corbyn, attacked the prime minister for having failed to address her own concerns about leaving the European Union. \\nCorbyn has previously been calling on the Tory-held government for a clear plan to exit the bloc. A video grab from footage broadcast by the UK Parliament's Parliamentary Recording Unit (PRU) shows British opposition Labour Party leader Jeremy Corbyn (R) as he responds during Prime Minister's Questions (PMQs) in the House of Commons in London on October 12, 2016. (Photo by AFP) \\n“The prime minister has given her private views on Brexit to Goldman Sachs bankers, but refuses to give the British people a clear plan for negotiations,” said the Labour leader. “It shouldn’t take a leaked tape for the public to find out what she really thinks.” \\nThe former Labour leader and leading member of the Open Britain campaign group, Ed Miliband, also reacted to the comments, saying, the leaked comments prove that May shares the concerns of all the Britons on Brexit. \\n“If private warnings are to be matched by proper public debate, it is essential that the government is not allowed to hoard vital analysis of the impact on our economy of leaving the single market. This work is being done in government and it must now be published,” he said, asserting that May’s comments “demonstrated that the prime minister was just as worried privately as the rest of us are publicly about the economic impact of the hard, destructive Brexit her government seems set on.” \\nAccording to the Guardian , the audio file was leaked as May was “prioritizing cutting immigration over staying in the single market, while refusing to elaborate any further on her plans for taking the UK out of the EU.” British Foreign Minister Boris Johnson leaves the weekly cabinet meeting at 10 Downing Street in London on October 25, 2016. (Photo by AFP) \\nIn an unpublished newspaper column written before the June 23 referendum for the Telegraph , UK Secretary of State for Foreign and Commonwealth Affairs Boris Johnson, who is another Leave campaigner in the public, also defended remaining an EU member. \\n“This is a market on our doorstep, ready for further exploitation by British firms. The membership fee seems rather small for all that access. Why are we so determined to turn our back on it?” he wrote, calling the EU a “boon for the world and for Europe.” Loading ...\""}, "time": 1742564099.7545435}