{"duration": 0.13619399070739746, "input_args": {"text": "'Topics: 2016 Presidential Election , trumphole , Mark Zuckerberg Friday, 11 November 2016 Don\\'t blame me I made plenty of money out of the election as ZuckerNazi arrongantly dismisses his social responsiblity \\nAfter the election result was a complete shock to decent Americans it has come to light it was Zuckerbergs GREED that got the Trumphole elected. \\nEveryone knows how the new Emperor manipulated the media space with constant lies and trump eting fake news stories that whipped normally sensible people into emotional frenzies completely lacking any factual basis. \\nEmperor Trumpholes back room spinners are said to be rolling on the floor in laughter. \"What a bunch of suckers\" they chortled. \"All we had to do was seed facetube with a whole lot of crap and then watch it become \\'fact\\'. The emperor would then spruke it in his next rally and we were able to completely fabricate reality for most Americans\". \\nSocial commentators are collectively in outrage this morning as the ZuckerNazi denies it was his fault. I don\\'t understand the problem he screamed at reporters, \"I made plenty of money out of the election, whats the problem? The fact that democracy and decency were collateral damage isn\\'t my problem\". \\nSome where outraged that despite 40% of the news (none of it validated) drove the Trumpholes victory he is essentially dismissing any complicity. \"Americans are essentially stupid and will believe any hate laden crap, if it wasn\\'t me it would be someone else, so better i make the money than another guy, thats what makes us america great\", he laughed. \\nWhen asked why he didn\\'t use editors to check fake news stories he laughed and replied, \"we tried that but it cost me money and decreased profits so i canned it, after all clickbaiting is great for profit\". Make Jung in the Jungle\\'s day - give this story five thumbs-up (there\\'s no need to register , the thumbs are just down there!)'"}, "time": 1742563397.5174553}