{"duration": 0.09192752838134766, "input_args": {"text": "'The Department of Justice is formally objecting to the March 15 claim by a District Court judge in Maryland that President Donald Trump’s violated the religious freedom clauses of the constitution with his March 6 Executive Order on immigration reform. [The objection goes to the Fourth Circuit Court of Appeals, whose   panel includes ten judges nominated by Democratic presidents and only five nominated by GOP presidents. It will likely be sent to the Supreme Court later this year.  “President Trump’s Muslim ban has fared miserably in the courts, and for good reason  —   it violates fundamental provisions of our Constitution,” said a response from the plaintiff’s lawyer, Omar Jadwat, director of the ACLU’s Immigrants’ Rights Project. “We look forward to defending this careful and   decision in the appeals court. ” The Maryland decision targeted Trump’s March 6 E. O. 13780, titled “Protecting the Nation From Foreign Terrorist Entry Into the United States. ” Much of the judge’s   decision is a complaint about the President’s political statements and promised policies, for which he was elected to implement. The judge declares: [Plaintiff] John Doe No. 1 has stated that the travel ban has “created significant fear, anxiety, and insecurity” for him and his wife and that the “  views” underlying the Executive Orders have caused him “significant stress and anxiety” to the point that he “worr( ies] that I may not be safe in this country. ”   …     John Doe NO. 3 has stated that the “  attitudes that are driving” the Executive Orders cause him “stress and anxiety” and lead him to “question whether I even belong in this country. ” The judge developed his claim that Trump’s policy is an illicit restraint on the religious freedom of Muslims in the United States to get visas for their foreign  . “Plaintiffs, comprised of six individuals and three organizations, assert that they will be harmed by the implementation of the Second Executive Order. Collectively, they assert that because the Individual Plaintiffs are Muslim and the Organizational Plaintiffs serve or represent Muslim clients or members, the   animus underlying the Second Executive Order inflicts stigmatizing injuries on them all. The Individual Plaintiffs, who each have one or more relatives who are nationals of one of the Designated Countries and are currently in the process of seeking permission to enter the United States, also claim that if the Second Executive Order is allowed to go into effect, their separation from their loved ones, many of whom live in dangerous conditions, will be unnecessarily prolonged   …     The judge cited Trump’s campaign promise, plus cited leaks from the Department of Homeland Security, and claims from officials who were in former President Barack Obama’s administration, to justify his claim that: In this highly unique case, the record provides strong indications that the national security purpose is not the primary purpose for the travel ban  …     even if the Second Executive Order has a national security purpose, it is likely that its primary purpose remains the effectuation of the proposed Muslim ban. Accordingly, there is a likelihood that the travel ban violates the Establishment Clause. The judge also revealed his proposal to reverse Trump’s reduction of refugee inflow, via a footnote in his March 15 decision where he denounced Trump’s reformist Executive Orders. Trump’s E. O. cited Section 212( f) of the Immigration and Naturalization Act, which gives the President   power over who gets into the United States, according to a January 2017 report by Congress’ Congressional Research Service. The critical language declares, at 8 U. S. C. § 1182 (f)  that: Whenever the President finds that the entry of any aliens or of any class of aliens into the United States would be detrimental to the interests of the United States, he may by proclamation, and for such period as he shall deem necessary, suspend the entry of all aliens or any class of aliens as immigrants or nonimmigrants, or impose on the entry of aliens any restrictions he may deem to be appropriate, Federal law also allows the president to exclude   threats, including communists and people who wish to overthrow the U. S. Constitution. For example, 212( f) section of the law says the president and his deputies can exclude: Read the decision here.  '"}, "time": 1742564376.073251}