{"duration": 0.2776002883911133, "input_args": {"text": "'Earlier I skewered nine dictators, thugs, demagogues, and politicians adored by leftists despite considerable failings in policy, ethics, and hygiene. Here are six more over-hyped figures revered by leftists who always get everything wrong.\\nFranklin Delano Roosevelt \\nHow the world remembers: FDR led America through the Great Depression and WWII, remembered fondly by seniors who heard his inspiring fireside chats.\\nThe ugly truth: Some economists argue that FDR’s measures prolonged the Great Depression . All the New Deal programs were struck down as unconstitutional, except Social Security. He got the Supreme Court to back off by threatening to pack the Court with more members with views to his liking. That restrained their judicial opinion, though the Constitution doesn’t grant Congress the power to create a Federal retirement system.\\nSocial Security works—though it’s slim pickings if it’s a retiree’s only income—and for decades the surplus has been a cash cow offsetting Congressional overspending . However, the aging Baby Boomers who didn’t have enough children might turn the cash cow into an albatross. Further, the Social Security Number is now a de-facto universal ID number; a convenient database field for monitoring citizens . America’s Founding Fathers would have been appalled at today’s domestic spying , and the Soviet dictators of old would have wept with envy.\\nFDR pledged to keep the USA out of WWII . Meanwhile, he quietly did everything possible to antagonize Japan, a once-friendly nation, such as (among several items) freezing their assets and cutting off their oil supply. When he got intelligence of the upcoming attack on Pearl Harbor, he didn’t order the base to be locked and loaded.\\nIf that wasn’t bad enough: So nearly a quarter million Americans died in battle, but at least the pivotal intervention came just in time to “make the world safe for democracy”, right? Unfortunately, FDR was far too friendly with the USSR, giving them nearly $11 billion in food, weaponry, and other supplies (about $119 billion adjusted for inflation).\\nAt the Yalta conference, FDR agreed to let “Uncle Joe” Stalin take over Eastern Europe. General Patton wanted to press forward at full speed to keep as much territory as possible away from Soviet tyranny, but politics hampered him every step of the way until he got rubbed out . When the Iron Curtain rose and the Cold War began, Winston Churchill said, “We slaughtered the wrong pig.” If only Roosevelt had listened to his generals!\\nFDR wasn’t a Communist, but many of his appointees and trusted advisers were. Later, Joseph McCarthy barely scratched the surface trying to get rid of them.\\nWalter Cronkite \\nHow the world remembers: He was a long-time CBS anchorman, reporting many triumphs and tragedies. A friendly face on living room TVs for decades, he became everyone’s “Uncle Walter”. According to polls, he was the “most trusted man in America”.\\nThe ugly truth: Although a decent fellow in person, Cronkite was the archetypal big-name liberal journalist , spinning the news for decades. Sometimes it was rather subliminal, including his signature subtle sneer. Most of the public then believed journalists were muckrakers and unbiased truth-tellers; as Cronkite’s tagline went, “And that’s the way it is.”\\nUntil Cronkite’s late career, the mainstream media had a veneer of respectability—perhaps like warped plastic barely sticking to crumbling particleboard, but a veneer nonetheless. There once were only three American corporate TV networks. From Manhattan, they were the public’s information gatekeepers; no other broadcast news (besides shortwave radio) was available. Baby Boomer liberals might get a bit misty-eyed remembering those days. Today, six mega-conglomerates own 90% of the media, but at least the Internet lets us present our own perspectives and call out biased reporters .\\nIf that wasn’t bad enough : His biggest whopper was about the Tet Offensive. The Viet Cong launched a desperate all-out assault, suffered very heavy losses, mostly it was over within a day, and ultimately the VC gained no territory. However, “the most trusted man in America” gave them a propaganda victory, reporting that the Vietnam War was hopeless. Public opinion promptly turned against the war. Ho Chi Minh should’ve given Cronkite a medal, an honorary VC generalship, and a dozen roses.\\nMany forget that the 1973 Paris Accords brought peace. Two years later, though, the shaky Ford administration couldn’t persuade Congress to respond appropriately to a Shit Test by North Vietnam. Then they invaded, and Saigon fell. All that’s a long story, but public opinion from biased reporting certainly didn’t help. That affected America’s prestige abroad, along with the lives of millions of South Vietnamese killed or sent to “reeducation camps” .\\nAllen Ginsberg \\nHow the world remembers: He was a pioneer of the beatniks, much beloved by the hippies who followed, and lauded with several literary prizes. Some even credit him with basically starting the 1960s counterculture singlehandedly.\\nThe ugly truth: Ginsberg was neurotic and a degenerate. He wrote a so-called poem about his sphincter (yes, really) but the rest isn’t much better. Anyone considering his bathroom wall ravings as “profound” either is educated beyond his ability to comprehend, believed the hype and didn’t read it, or dropped too much acid.\\n“Howl”, his best-known poem, begins “I saw the best minds of my generation destroyed by madness”. A brief excerpt (get some brain bleach) describing these “best minds”:\\nwho burned cigarette holes in their arms protesting the narcotic tobacco haze of Capitalism,\\nwho distributed Supercommunist pamphlets in Union Square weeping and undressing while the sirens of Los Alamos wailed them down, and wailed down Wall, and the Staten Island ferry also wailed,\\nwho broke down crying in white gymnasiums naked and trembling before the machinery of other skeletons,\\nwho bit detectives in the neck and shrieked with delight in policecars for committing no crime but their own wild cooking pederasty and intoxication,\\nwho howled on their knees in the subway and were dragged off the roof waving genitals and manuscripts,\\nwho let themselves be fucked in the ass by saintly motorcyclists, and screamed with joy,\\nwho blew and were blown by those human seraphim, the sailors, caresses of Atlantic and Caribbean love,\\nwho balled in the morning in the evenings in rosegardens and the grass of public parks and cemeteries scattering their semen freely to whomever come who may, …\\nEven overlooking the lunacy, buggery, and butthurt, Ginsberg’s “free verse” is stylistically lazy. Back when poetry meant Keats and Kipling, it rhymed and had meter.\\nHe was a noted critic of the USA, for example:\\nAmerica, I used to be a communist when I was a kid I’m not sorry\\nGinsberg visited several Communist countries, getting himself deported from some of them for immorality. He abandoned his ancestral faith for Buddhism and had a Hare Krishna phase. What people believe is up to them, of course, but adding these two things up—along with his wretched poetry—reveals a tortured soul. Rejecting everything one belongs to is childish rebellion for rebellion’s sake.\\nGranted, Ginsberg’s popularity was greatest during the screwed-up “kill your parents” 1960s. Still, what were those who promoted his crapulous drivel smoking? Were the literary gatekeepers pushing cultural Marxism running out of talented writers?\\nIf that wasn’t bad enough: Ginsberg joined the North American Man/Boy Love Association, sometimes speaking kindly on their behalf. Explaining in an accurately titled interview—“Politics, Pederasty and Consciousness”—to the Harvard Crimson :\\nAs I get older, having very specialised sexual tastes, it gets harder to make out… I like young boys. Why?… I’d have more chance at making out with younger guys if I were younger, dewier, dewy-limbed.\\nThe media usually portrays pickup artists as reprobates, and screeched about Donald Trump’s years-old private locker room talk, but the presstitutes (likewise the lefty “intelligentsia”) fawningly praised Ginsberg despite his appetite for young boys .\\nTed Kennedy Best friends forever, east and west\\nHow the world remembers: He was “the Lion of the Senate”, representing Massachusetts from 1962 until his death in 2009. This champion of social justice carried on the Kennedy legacy—hailed as America’s nobility—after his two brothers were tragically slain.\\nThe ugly truth: He was as passionate for booze and adultery as he was for social justice, but the suckers kept reelecting him. His lack of character sank way deeper, though; all the way underwater.\\nAfter a night of partying on Chappaquiddick Island, Ted Kennedy drove off a bridge. He escaped, but failed to help his passenger, Mary Jo Kopechne. Per one of the investigators, she suffocated slowly in an air pocket for about two hours. If he’d ran to a nearby house for help—rather than waiting nine hours to sober up—she would’ve survived. He got a two month suspended sentence, barely a slap on the wrist for vehicular manslaughter. The judge basically said poor Teddy had suffered enough. (What about how Miss Kopechne suffered?) There’s one set of rules for the elites , and another for us. Shortly thereafter, he tried to spin-doctor it with a “woe is me” shtick. The suckers kept reelecting him, though a Presidential bid was now beyond reach.\\nAs for his many legislative actions, the Immigration and Nationality Act of 1965 was the most notorious. He promised the public :\\nFirst, our cities will not be flooded with a million immigrants annually. Under the proposed bill, the present level of immigration remains substantially the same… Secondly, the ethnic mix of this country will not be upset… Contrary to the charges in some quarters, [the bill] will not inundate America with immigrants from any one country or area, or the most populated and deprived nations of Africa and Asia…. In the final analysis, the ethnic pattern of immigration under the proposed measure is not expected to change as sharply as the critics seem to think… The bill will not flood our cities with immigrants. It will not upset the ethnic mix of our society. It will not relax the standards of admission. It will not cause American workers to lose their jobs .\\nThe “Lion of the Senate” was lyin’ his fat ass off! This population replacement policy threatens America’s future , just as the Coudenhove-Kalergi Plan is doing in Europe. Still, the suckers kept reelecting him.\\nIf that wasn’t bad enough: Besides giving away the country to which the Constitution granted “the Blessings of Liberty to ourselves and our Posterity “, Lyin’ Ted was in cahoots with the KGB . He proposed to help his Soviet pal Yuri Andropov with tidying up the USSR’s image problem during the Cold War’s endgame. The damning documents suggested that Walter Cronkite (see above) and Barbara Walters might be used for this effort. Conservatives often suspect liberals are soft on Communism; little did they know how cozy Ted Kennedy was in bed with Comrade Andropov.\\nJohn Lennon \\nHow the world remembers: He was a talented musician, arguably the most prominent of the Beatles. Their story was an archetypal garage band becoming a bar band and eventually breaking out into great fame. Lennon produced dozens of hits that still get air play. He’s remembered as a wonderful man, an embodiment of the 1960s (the good parts , anyway), and the conscience of the world.\\nThe ugly truth: Despite Lennon’s considerable talents, not all his songs were excellent. Things slipped with the White Album . (“Revolution 9”, really?) After the Beatles broke up, he started a solo career, often featuring songs with sophomoric political poses. His last album produced during his life—after dragging himself out of a long heroin stupor—was Double Fantasy . Critics at first agreed that it sucked. After a nut shot Lennon, they felt sorry for him and declared it brilliant.\\nLennon was the archetypal leftist celebrity using fame to push politics. Granted, everyone has a right to their opinion, but being able to sing or act confers no special political expertise. His song “Imagine” is particularly telling. As he put it:\\nImagine that there was no more religion, no more country, no more politics,’ is virtually the Communist Manifesto, even though I’m not particularly a Communist and I do not belong to any movement.\\nBeing under the shadow of the Berlin Wall back in their bar gig days should’ve precluded sophomoric posturing like this.\\nIf that wasn’t bad enough: His failings are quite troubling, too numerous to fully detail. One item is abandoning his family the way his own father did. A truly wonderful man wouldn’t do that.\\nAnother item was his extensive substance abuse. He spent 1974 guzzling booze, his “lost weekend”. One night, a waitress refused service because he stuck a menstrual pad on his head. Then:\\nLennon: “Do you know who I am?”\\nWaitress: “Yeah, you’re some asshole with a Kotex on his forehead.”\\nOne Lennon biographer asked Timothy Leary, who’d been on hundreds of acid trips, what Lennon’s extreme LSD consumption would do. Leary had no idea! Finally, what kind of inner vacuum caused this highly successful musician, much beloved by the public, to get himself strung out on heroin?\\nJimmy Carter In this heart-warming scene, Jimmy Carter and Uncle Fidel stand for the Cuban national anthem in Havana\\nHow the world remembers: Carter is praised as a rare honest politician, exemplifying Christian principles and tolerance.\\nThe ugly truth: The economy tanked during the Carter administration: double-digit inflation and high unemployment. Economists are still puzzled by stagflation; normally, unemployment and inflation are inversely correlated. At least Obama gave economists another data point to study.\\nCarter’s commendably not corrupt, but exemplified bleeding-hearted liberalism. Despite winning the Nobel Peace Prize for not being George W. Bush (likewise Al Gore and The Lightworker), Carter was a lackluster embarrassment. He was known for TMI statements, for example about his hemorrhoids and committing adultery in his heart (at least Clinton had the balls to do it for real). He ranked lower than Mr. Whipple on a face recognition survey. The Boston Globe reported on one of his speeches with the headline “More Mush From the Wimp”; finally journalists got something right.\\nCarter’s shining foreign policy moment was the Camp David Accords, establishing peace between Egypt and Israel. America started giving over a billion annually to each party for making peace, which ironically supplies their military. Why? The USA wasn’t even a combatant, aside from the USS Liberty incident which certainly shouldn’t inspire American tribute money. Taxpayers still fund this absurd protection racket.\\nWorse, he badly bungled the Iran hostage crisis. One Iranian official later stated they would’ve released the hostages if the USA had threatened force in the beginning. Yep, Carter failed Iran’s Shit Test. Consequentially, the USA lost tons of international prestige, and the ordeal of the hostages dragged on unnecessarily.\\nIf that wasn’t bad enough: Carter is often a little too cordial with notorious dictators . Worse, Clinton trusted him to represent the USA during disarmament talks with North Korea. They gave him the Potemkin village show; he bought it hook, line, and sinker. Yet again, Carter was played for a chump—the USA opened its wallet and gave North Korea aid, and they pinky-swore to stop their nuclear program. Now the Norks have nukes—surprise! Awesome job, Mister Nice Guy!\\n\\nRead More: The Ugly Truth Of Leftist “Heroes” \\n'"}, "time": 1742562271.6607661}