{"duration": 0.09762096405029297, "input_args": {"text": "'President Donald J. Trump’s admiration for Andrew Jackson is well known. He hung his portrait in the Oval Office, and last spring criticized the Treasury Department’s decision to take Jackson off the front of the $20 bill. And on Wednesday, Jackson’s 250th birthday, Mr. Trump visited the Hermitage, Jackson’s home in Nashville, where he laid a wreath at his tomb and paid tribute to Old Hickory’s populism. “It was during the Revolution that Jackson first confronted and defied an arrogant elite,” Mr. Trump said. “Does that sound familiar?” Jackson’s historical reputation has declined sharply in recent decades, especially among Democrats. The party that once celebrated him as a central pillar has rushed to remove his name from symbolic places of honor, distancing itself from his record on slavery and the forced relocation of American Indian nations from the South. But Mr. Trump’s visit, as it happens, came 50 years to the day after Lyndon B. Johnson laid a birthday wreath on Jackson’s grave, one of a stream of presidential visitors including Theodore Roosevelt, Franklin Roosevelt and Ronald Reagan, each of whom used Jackson to bolster his own vision. “Jackson was a forceful president who attracts presidents who believe in a forceful presidency,” the Princeton historian Sean Wilentz, the author of the recent book “The Politicians and the Egalitarians” (and himself a staunch liberal defender of Jackson) said via email. The roster of visitors, Mr. Wilentz added, showed that Jackson was once “firmly in the progressive pantheon. ” Heather Cox Richardson, a historian at Boston College who takes a less admiring view of Jackson than Mr. Wilentz, said the list reflected the   nature of the populism that Jackson injected into American politics. “Jackson can be seen in two very different ways, just as Americans look at populism in two different ways,” she said. “We like it, because we like the idea of people having power over government. And we don’t like it, because it has within it an undercurrent of racism and violence. ” Here’s a look at how four presidents have invoked Jackson’s complicated legacy. Roosevelt, a Republican and later a member of the Progressive Party, visited the mansion on Oct. 22, 1907, and reportedly coined the phrase “good to the last drop” after being served a cup of Maxwell House coffee there. It’s not clear what Roosevelt said about Jackson that day, but in his 1913 autobiography he cited “Good King Andrew,” as he put it, and Lincoln as the progenitors of the modern idea of the president as a strong leader who sets the nation’s agenda. (Roosevelt also admired Alexander Hamilton, another strong nationalist, for the similar reasons.) “Roosevelt really did change the office, and the two people he cites from the 19th century are Jackson and Lincoln,” said David Greenberg, a historian at Rutgers University. “Jackson was a slave owner, and his Indian policy was reprehensible, but he definitely was a fighter for the people, against the moneyed interests,” Mr. Greenberg said. “That’s why Teddy Roosevelt admired him. ” Roosevelt, a Democrat, briefly visited the mansion and the grave site on Nov. 17, 1934, with Eleanor Roosevelt, while they were on their way to their retreat in Warm Springs, Ga. Mrs. Roosevelt also visited Alfred’s Cabin, a former slave cabin that still stands on the property, and the couple went together to Fisk University, an   institution. In citing Jackson, Ms. Richardson said, Roosevelt generally spoke not of his racial record and what she called the “incredibly racist version of Manifest Destiny” Jackson promoted, but the idea that the government belong to the people, not the wealthy. “This was around the time that Jackson had gone on the $20 bill,” Ms. Richardson noted. In 1940, at the annual Jackson Day dinner, Roosevelt paid tribute to a “great man”: not “Jackson the Democrat,” he said, “but Jackson the American, who did the big job of his day  —   to save the economic democracy of the Union for its westward expansion into a great nation, strengthened in the ideals and practice of popular Government. ” (Roosevelt’s successor, Harry S. Truman, also visited the Hermitage, but before his presidency, when he was the presiding judge of the Jackson County court in Missouri, which was preparing to erect a statue of Jackson. His errand? Truman, a former haberdasher, apparently wanted to measure some of Jackson’s clothes to make sure the statue was the right size, according to information compiled by the Hermitage.) Johnson and his wife, Lady Bird, had breakfast at the Hermitage on March 15, 1967, the 200th anniversary of Jackson’s birth, after a   tour of Appalachia. In a speech, he acknowledged Jackson’s record as a slaveholder but paid tribute to the “political transformation” he had brought to American democracy, bringing power to the people while emphasizing the indivisibility of the Union, a stance Johnson contrasted with the states’ rights ideology of another Southerner, the secessionist John C. Calhoun. Johnson, a Democrat, also painted an inclusive picture of Jackson’s populism, linking it to his own Great Society agenda. “We are still striving to involve the poor, the deprived, the forgotten American, white and Negro, in the future of their society,” he said. “So the task Jackson set is still undone. ” Julian E. Zelizer, a historian at Princeton, noted that in an address to the Tennessee legislature later that day, Johnson changed tack, talking about the Vietnam War and the need for the kind of “rugged confidence” Jackson had. “He used Jackson the military hawk, not Jackson the populist,” Mr. Zelizer said. “He used it to send a tough signal that victory was possible. ” Reagan visited the Hermitage on March 15, 1982, Jackson’s 215th birthday, and also gave an address to the Tennessee legislature. The country had just fallen into a deep recession, Ms. Richardson said, and Reagan made the case for taking on what he saw as a bloated government. “He’s trying to defend his idea, which wasn’t popular even when he was elected by running on it, that if you get rid of regulations, cut back unions and cut taxes, you’re going to create a magical return to the past,” Ms. Richardson said. Reagan, a Republican, also cited Jackson as one in a line of western heroes, which Ms. Richardson said was “not an accident. ” “He is really deliberately trying to use Jackson to say, ‘Everything I’m trying to do as a movement conservative, I’m doing as someone who is not in step with the Republican Party,’” she said. “He’s saying that being an outsider is really just going back to American tradition. He uses Jackson as an avenue to do that. ” Ms. Richardson added Mr. Trump’s embrace of Jackson, a man many liberals and progressives now hate, was doing something similar, with even more powerful effect. “It’s a way of twisting the knife in people’s guts,” she said.'"}, "time": 1742563827.1740415}