{"duration": 0.15154099464416504, "input_args": {"text": "'There have been two recent congressional investigations into the Planned Parenthood selling baby parts scandal. [Both were prompted by the Centre For Medical Progress (CMP) undercover investigation, which caught Planned Parenthood officials discussing how to illegally profit from selling baby parts. The first report in December was by the Senate Judiciary Committee and now House of Representatives Select Investigative Panel has published its report. Neither investigation relied on the CMP undercover videos to come to their conclusions. They carried out their own investigations  —   interviewing officials and employees under oath and using the power of subpoena to get their records.  What they found is horrifying and criminal. It’s disturbing that the results have been virtually ignored in the mainstream media. So to fill this gap, here are the top eight horrifying facts the mainstream media doesn’t want you know about aborted babies bodies being sold for profit. 1) It’s wrong to say the   crowd don’t value the disabled. Advanced Biosciences Resources (ABR) had a “technician” embedded at a Planned Parenthood clinic who reportedly harvested and sold the skin of a Down Syndrome baby for $325. Yes, that’s correct, in America today, you can buy the skin of an aborted Down Syndrome child for $325. The same baby’s leg was sold for $325. 2) Selling baby parts is very profitable. To be clear, the law is unambiguous it is illegal to make a profit providing organs or any part of a human for research or medical treatment. But Planned Parenthood and their business partners made a lot of money selling aborted baby body parts, according to the report. The House investigation found one case where Stem Express harvested an intact aborted baby’s brain at a Planned Parenthood clinic. They reportedly paid Planned Parenthood $55 but sold the brain to a researcher for over $3000  —    that’s a 2, 800% profit. Planned Parenthood reportedly made their money on volume sales and “charitable donations” from these body harvesting companies. The Senate investigation published invoices which showed in June 2014 ABR bought a fetus from Planned Parenthood for $60. From that one fetus ABR “sold its brain to one customer for $325 both of its eyes for $325 each ($650 total) to a second customer, a portion of its liver for $325 to a third customer its thymus for $325 and another portion of liver to a fourth customer and its lung for $325 to a fifth customer. ” Then, the report says, they piled on fees for “disease screening” and shipping. That one aborted baby reportedly brought the company $2, 275. The House Investigative Panel found Stem Express generally marked up the baby parts by 400% to 600%. 3) A bountiful harvest, And “harvesting” is exactly what they were doing. The House investigation uncovered how “technicians” would look at the patient list in advance and try to sell the baby parts before the abortion. After securing the advance sale (with its massive profits) the technician would then be allowed to go and ask the pregnant woman to sign a consent form. This is a huge ethical breach. The person seeking consent from a vulnerable patient is supposed to be neutral in the process. In a letter to HHS last June, the panel wrote: “The fact that StemExpress was attempting to interest a customer in fetal body parts before an abortion had taken place raises serious concerns that there may have been coercion or undue influence upon the patient to consent to procurement” (their emphasis). 4) Sticks and stones, And like any other business, there can be frustrations between buyers and sellers. The House Panel uncovered an email exchange between an excited Stem Express “technician” and a researcher who wanted to know if she could expect some parts the next day because she needed to book time at a very expensive research machine. But a baby’s body is a frustratingly fragile thing. Rather apologetically, the Stem Express employee told the researcher he had a body but: “The calvarium [skull] is mostly intact, with a tear up the back of the suture line, but all pieces look to be there. The limbs, one upper and one lower, are totally intact, with one upper broken at the humerus, and one lower broken right above the knee. Please let me know if these are acceptable. ” They were. The deal was done and a baby’s body, complete with a  broken leg and arm, was shipped overnight to the researcher. 5) Kermit Gosnell was not alone. If there is one thing the abortion defenders agree on, it’s that mass murderer Dr Kermit Gosnell was a   an aberration. In a Supreme Court judgment referencing Gosnell, Justice Ruth Bader Ginsberg described him as “rogue. ” Conor Friedersdorf of The Atlantic explained most people believe “Gosnell is an aberration that says nothing larger about abortion in America. ” And Slate writer William Saletan described Gosnell as an “outlier. ” But then you read the House Investigation Report. They have interviewed, taken evidence, and secured affidavits from employees and patients of a Texas abortion doctor (whose name they have redacted). I have made a movie and written a book about Kermit Gosnell and his   killing spree, and the similarities with this Texas doctor are shocking. According to one employee, the doctor would perform around 40 late   or   abortions every week. Of these abortions, “three to four infants would show signs of life. ” And just like Gosnell, the doctor would immediately kill them, according to the testimony. The employee said he employed Gosnell’s techniques of “snipping the infant’s spinal cord with scissors. ” However, he reportedly also cut the neck with Sopher forceps: “twisting the infants head: using forceps  …     or his finger to crush the ‘soft spot’ of the infant’s head. ” Sometimes the doctor would also kill by crushing the stomach of the child or “inserting his finger down the throat,” according to the testimony. And just like Gosnell  —   the doctor reportedly would manipulate ultrasounds to make babies appear smaller so he could perform illegal   abortions. And just like Gosnell, he had unqualified staff administering drugs and carrying out abortions, according to the report. 6) Planned Parenthood HQ accused of conspiring to break the law. After the baby selling scandal broke, Planned Parenthood told the media they had a policy that prevented their affiliates from profiting from the process. But they didn’t mention that they had brought the policy in just as the CMP scandal developed. In fact, this report suggests a “criminal conspiracy” over their failure to have guidelines before this. According to the Senate Judicial Committee report, in 2001 Planned Parenthood did have a policy stating its clinics had to have an independent accountant verify they were not profiting from the sale of body parts. Those who did not follow these guidelines could be thrown out of the Planned Parenthood network, they were warned. In 2011, when they found their clinics were ignoring the guidelines, Planned Parenthood quietly deleted the guidelines from its requirements. By doing so, Planned Parenthood headquarters made it quite clear they would not stand in the way of their clinics profiting from the sale of baby parts. Or, as the Senate Committee put it, by behaving “in a manner that facilitated the continuation of those fetal tissue payments. Planned Parenthood and the affiliates actions may implicate the federal criminal conspiracy statute   371. ” 7) Privacy for thee and not for me, Planned Parenthood and the companies it was selling baby parts to fought tooth and nail against the investigations. They claimed privacy was an issue. But the House Investigation states they never cared about privacy when there was a lot of money to be made selling the body parts of their patients’ babies. They would regularly give confidential information about their patients to help the companies plan their harvesting in advance, the report says. And Stem Express would reportedly share this information with clients so they could look at what might be available and place advance orders. The committee said: “the [Planned Parenthood] abortion clinics did not have a valid reason to provide, patients’ PHI [Protected Health Information]. Instead the abortion clinics shared patients’ PHI with Stem Express in furtherance of contractual agreements that financially benefited StemExpress and the clinics. ” They recommended an investigation “and, if OHRP agrees that [privacy] violations occurred, to take all appropriate actions. ” 8) Planned Parenthood falsely claimed to help cure AIDS. Yes, you read that right  —   in order to convince women to allow them to harvest their baby’s body parts, the Planned Parenthood consent form told the vulnerable women that the parts had been used to find a cure for AIDS. As a Planned Parenthood official admitted under oath to the House investigation, “there is no cure for AIDS. So that is probably an inaccurate statement. ” They also reportedly misled clients about what they were actually harvesting. The consent form only described “pregnancy tissue”  —   not a baby’s arms, legs, eyes, brains, and skin. Phelim McAleer is the author with Ann McElhinney of Gosnell: The Untold Story of America’s Most Prolific Serial Killer published by Regnery on January 24th and available for   on Amazon.'"}, "time": 1742564150.770543}