{"duration": 0.08093762397766113, "input_args": {"text": "'The British actress Naomie Harris, 40, might have splashed on the scene as the Bond girl Moneypenny, but these days she is banking on riskier roles. Her turn as a crack addict in the lauded “Moonlight” earned her supporting actress nods for the Critics’ Choice Awards, Screen Actors Guild Awards and the Golden Globes, on Sunday. So, too, her red carpet style will keep you guessing. Friend to cutouts, splashy prints, allover sequins, tuxedos and plunging necklines, Ms. Harris seems determined to avoid being typecast. And the fashion establishment appears to love her chameleonic quality. She sat front row at Christian Dior and Michael Kors, and she attended the Met Gala with Burberry. Of course, Ms. Harris doesn’t accomplish her sartorial variety on her own. She has been working with Nola Singer, also a close friend, for the last five years. “She loves to experiment,” Ms. Singer said of their choices. “It’s not so serious. If I tell her someone is a new designer, she gets excited. She gets that this is a kind of freedom. That’s beautiful about her. ” Ms. Singer, who is based in Los Angeles, styled many of Ms. Harris’s looks over the past year, but the actress also worked with Micaela Erlanger, Lupita Nyong’o’s   for her “Collateral Beauty” press tour. With Ms. Singer, Ms. Harris has favored simple fitted silhouettes but often lets color do the talking. Witness a sequined goldenrod Ralph Lauren halterneck dress worn to the Hollywood Foreign Press   cocktail party in November. “Every actress was at that event, and she really stood out, not because she was trying but because of that color, and because it flattered her figure  —   her arms!  —   without showing too much skin,” Ms. Singer said. No   triceps dips were needed for the visual statement made by a Gucci silver metallic tuxedo at the Hollywood Film Awards the same month. Ms. Singer said the outfit, with its sharp tailoring and lion embroidered on the back, was a nod to Hillary Clinton’s presidential campaign. “It was about women being empowered,” she said. Though Ms. Harris knows her way around a pantsuit (see also a white Emanuel Ungaro option at Variety’s Women of Power Luncheon, and a white   Dolce  Gabbana number worn to the TimesTalks event for “Moonlight”) occasionally she likes to go retro. In the navy Carolina Herrera ball gown she wore (with Christian Louboutin flats) to the Governors Awards in November, she was having an Old Hollywood meets modern practicalities moment. Less successful are her quirky moments. An orange Gucci minidress with a frilly black neckline that she wore at the British Independent Film Awards and a brown print Rodarte with    white bust at the “Collateral Beauty” London premiere read   on her lithe frame. Ms. Erlanger’s choice for the “Collateral Beauty” New York premiere was more on point: a neon floral Rosie Assoulin dress that ended above the ankle with Dick   pumps. Sure it was December, but what’s a little   chill when an   campaign is at stake? More unexpected picks with Ms. Erlanger included an offbeat (perhaps dated?) Stella McCartney strapless black bodice with sheer skirt design for the Critics’ Choice Awards last month, and a winning gold sequined tunic and pants by Monse at the Gotham Independent Film Awards in November. And if her predictability is in her unpredictability, Ms. Harris is throwing another wrench in for awards season. She is going back to Ms. Singer but adding the New York stylist Laura Jones, known for her work with Alicia Keys, to her team. It will be Ms. Harris’s first time working with Ms. Jones.'"}, "time": 1742564195.835997}