{"duration": 0.038480520248413086, "input_args": {"text": "'Karlie Kloss apologized Wednesday after her appearance in a Vogue photoshoot was condemned on social media as critics called the fashion model’s spread an example of “yellowface” and cultural appropriation. [“These images appropriate a culture that is not my own and I am truly sorry for participating in a shoot that was not culturally sensitive,” Kloss said in a statement she posted to social media. “My goal is, and always will be, to empower and inspire women. I will ensure my future shoots and projects reflect that mission. ”  pic. twitter.   —   Karlie Kloss (@karliekloss) February 15, 2017,  Floss was featured in the magazine’s March “diversity” issue. She was dressed as a Japanese geisha, wearing black wig posed with Asian artwork in the backdrop. Kloss also posed alongside a sumo wrestler. Some social media users ripped Vogue for casting a white model for a Japanese photoshoot, while others said they didn’t find it offensive. Karlie Kloss is under fire for culture appropriation after the release of her March 2017 Vogue US photoshoot. Thoughts? pic. twitter.   —   Pop Crave (@PopCrave) February 15, 2017,  There is a whole country called Japan with Japanese women and they picked a white girl. Wow. https:  .   —   busan babe (@melaninbarbie) February 14, 2017,  Looks like that Condé Nast diversity panel really did some good 🙃 (ed note: karlie kloss as a geisha in vogue diversity issue) pic. twitter.   —   lindsay peoples (@lrpeoples) February 14, 2017,  SHE DID YELLOW FACE IN THE DIVERSITY ISSUE 🙃🙃🙃 https:  .   —   Ainee Athar (@AineeWrites) February 14, 2017,  In 2017, Karlie Kloss is featured in US Vogue in yellow face. Absolute madness but I can’t say I’m shocked.  —   Christiana A Mbakwe (@Christiana1987) February 14, 2017,  Emma Stone, Scarlett Johansson, and Tilda Swinton turn to Karlie Kloss. ”Your turn, girl.” Karlie on phone: ”Hello, Vogue? Make me Asian.” pic. twitter.   —   Ira Madison III (@ira) February 14, 2017,  @karliekloss I am Japanese and actually love these images. I didn’t feel any uncomfortableness with them. Please don’t be sorry.  —   めで鯛 (@skrokr) February 15, 2017,  @skrokr @karliekloss I guarantee you 99. 99% of the people pretending to be offended here are American.  —   Andri (@TechSwiftie) February 15, 2017,  The Vogue drama is just the latest cultural appropriation offense for Kloss. The    apologized after she wore Native   headdress at the 2012 Victoria’s Secret Fashion Show. I am deeply sorry if what I wore during the VS Show offended anyone. I support VS’s decision to remove the outfit from the broadcast.  —   Karlie Kloss (@karliekloss) November 11, 2012,  Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742563241.3234751}