{"duration": 0.054346323013305664, "input_args": {"text": "'RIO DE JANEIRO  —   Bouncing in the air above the sand of Ipanema Beach, not an Olympic venue in sight, is one of the most remarkable athletes in the world who has nothing to do with the Rio Games. Her name is Giovanna Petrucci, and her acrobatics rival those of the gymnasts and divers competing across this city. Petrucci is a world champion slackliner, performing on a thin strap of nylon or polyester fastened to palm trees. She does front flips and back flips and falls flat on the    strap, her torso parallel to the ground. The move is called “fearless,” and she was the first woman or girl to execute it. “I saw them from a distance and thought they were walking on tightropes, which is remarkable enough as it is, but then they started jumping, flipping  —   it’s just incredible,” said Jerry Daykin, 32, a tourist from London who was here for the Olympics. Brazil would fare much better in the Olympics if Rio’s vibrant beach sports were part of the program. Athletes line the shoreline daily, practicing sports that include the more familiar beach volleyball and the homegrown futevôlei, a combination of volleyball and soccer juggling. If slackline were an Olympic sport, Petrucci, 18, would be a lock for gold. “Slackline originally came from climbing, but it’s evolved to be more like gymnastics,” she said. “But it’s not gymnastics. In gymnastics they have a whole floor for tumbling. Slackline is just on a strip. It requires balance, focus and strength, especially core strength, and also a lot of creativity. ” Petrucci recently graduated from high school but is taking time off before going to college. “Now, I’m living the slack life,” she said. With five sponsors, she is able to travel around the world for competitions. She recently got back from Germany, and next up is Japan. Petrucci grew up three blocks from the beach. She encountered slackline there when she was 13. She is   learning from YouTube videos of slackline stars and getting guidance from others on the beach. Before she had finished high school, Petrucci was considered the best female slackliner in the world, winner of the World Slackline Masters championship. “Now we’re the top reference for people learning slackline  —   beginners are watching our videos,” she said, pointing out that she competed alongside athletes who were once her YouTube heroes. Pedro Rafael Marques, 20, was one of Petrucci’s admirers. He studied her videos while learning to slackline in his hometown in northeastern Brazil. “I thought it was insane when I first saw her videos,” he said. “I was surprised and really impressed to see a young girl doing those kinds of tricks. ” Now, Marques is also one of the best slackliners in Brazil and competes alongside Petrucci. He recently moved to a city near Rio to teach slackline classes and run a slackline program for   children. Petrucci said she admired the Olympic gymnasts competing miles away at the Olympic Park. She said she looked to them for inspiration for new moves. But she is strongly against slacklining becoming an Olympic sport. “I don’t want to get on the line and then have to be like this,” she said, imitating a gymnastics dismount, throwing her arms in the air and flipping her wrists. “It’s too formal. Slackline is freestyle. ”'"}, "time": 1742563609.0339475}