{"duration": 0.06535482406616211, "input_args": {"text": "'Despite the recent move of the Raiders from California to gambling mecca Las Vegas, NFL Commissioner Roger Goodell has reaffirmed the league’s stance against gambling. [With the move to Vegas and the growth of sports betting websites such as Draft Kings, many have wondered just how hard the NFL will continue the fight to restrict gambling. But, Goodell’s recent comments seem to answer that question, at least for now, USA Today reports.  “I would probably tell you that I think society has probably had a little bit of a change with respect to gambling in general,” Goodell said at the league’s annual meeting in Arizona on Tuesday. “I think we still strongly oppose it in that room, and otherwise, legalized sports gambling. The integrity of our game is No. 1. We will not compromise on that. ” Even with that negative assessment, Goodell did admit that Vegas isn’t the same, crooked city it once was. “But I also believe that Las Vegas is not the same city it was 10 years ago or 20 years ago. It’s a much more diverse city. It has become an entertainment mecca. It’s the   city in the country,” he added. “So I think when you look at it today versus what it was a decade or two ago, I think it’s a much different city. And they made a very compelling proposal, which the owners obviously approved overwhelmingly. ” Indeed, many polls have shown an increased tolerance for gambling among the pubic. Polls last year revealed that nearly half of respondents were in favor of legalizing sports betting. Governments are also hungrily eyeing sports betting as a likely new source of tax revenue, as well. Consequently, various bills have been introduced in Congress to lift the federal ban on sports betting. But, other signs pointed to new problems in the internet age when sports fan sites like Draft Kings and Fan Duel came under fire for corrupt practices last year. Yet, even with the controversies, it was reported that several pro sports leagues are looking to work closer with the gambling industry. Unlike the NFL’s Goodell, NBA chief Adam Silver recently went in the opposite direction on sports betting by softening his league’s stance against gambling. But, there is still faint hope for gamblers looking for football to favor them. In the end Goodell noted that the NFL reserves the right to change rules whenever it makes sense to do so. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742562282.7084482}