{"duration": 0.043257951736450195, "input_args": {"text": "'\\nThis article was written by Paul Joseph Watson and originally published at Infowars.com . \\nEditor’s Comment: The blowback from Team Hillary, over their rage and anger at losing the election continues to build, and it is reaching an unsettling point. All sides seem determined to drag out their differences into the street, but not before first attempting to overthrow the electoral college. \\nSince the election, people have been lobbying – or bullying – individual electors in various states, and have left angry, threatening messages and worse. Ironically, those who have threatened violence and attempted to insist on altering the results of the election are trying to convince the electors that Donald Trump is unfit to be president because of his divisive and offensive comments, and his tendency to attack various groups. \\nMore Electors Get Death Threats From Hillary Voters \\nby Paul Joseph Watson\\nA member of the electoral commission in Texas says his colleagues are getting death threats as angry Hillary supporters ramp up the pressure before electors cast their vote on December 19th.\\n\\nHillary voters around the country are bombarding electors with emails, some of them threatening, in an effort to force them to vote against the outcome of the presidential election.\\n“At first everyone was kinda enchanted by it. Now all the electors are starting to get beaten down. There are some electors who have been threatened with harm or with death,” Texas elector Alex Kim told NBC 5. \\n“When people ask me to vote for Hillary Clinton, there’s no way,” he said. “I reject the Democratic Party principles and I reject Hillary Clinton.”\\nKim said he had a message for all the people who are trying to pressure him into changing his vote; “Go to hell”.\\nAs we previously reported , another elector in Michigan said he has also received a number of death threats, including a promise that he would be shot in the head if he voted for Trump.\\n“I’ve had people talk about shoving a gun in my mouth and blowing my brains out. And I’ve received dozens and dozens of those emails. Even the non-threatening-my-life emails are very aggressive,” Michael Banerian told the Detroit News, adding that he has been labeled a “hateful bigot” by the same people who are violently threatening him.\\nA petition to demand electors change their vote to Clinton has also surpassed 4.5 million signatures.\\nMeanwhile on Twitter, Hillary supporters are organizing on how to pressure electors under the hashtag #HamiltonElectors , a reference to Mike Pence being lectured by a cast member of the musical show.\\nUnfortunately for them, conservatives found the hashtag and have now largely taken it over to decry leftists attempting to overturn the results of a democratic election.\\nThis article was written by Paul Joseph Watson and originally published at Infowars.com . '"}, "time": 1742562307.2374356}