{"duration": 0.05822348594665527, "input_args": {"text": "'A Crime Prevention Research Center study looking at    data for 2014 shows that two percent of counties in the U. S. account for 51% of U. S. murders. [The study shows that “54% of counties (with 11% of the population) have no murders” while “69% of counties have no more than one murder. ” Taken together these counties, which represent about 31% of the U. S. population, “account for only 4% of all murders in the country. ”  However, CPRC shows that two percent of U. S. counties —  led by Los Angeles County —  account for 51% of all murders. And “the worst 5% of counties contain 47% of the population and account for 68% of murders. ” This is crucial information because gun controllers continuously point to polls claiming a vast majority of Americans support one type of gun control or another, and those same gun controllers point to homicide rates to bolster their push for new laws. One thing the gun controllers do not explain is where the the poll respondents live —  for example, are they all concentrated in the two percent of counties where 51% of U. S. murders occur? And secondly, when listing homicide rates, gun controllers do not point out that murder is a local problem rather than a national one. In other words, murder is serious problem if you live in Los Angeles County, Cook County, or Harris County —  the locations of   Los Angeles, Chicago, and Houston —  but it is not a problem if you live in a rural county in Kentucky, North Dakota, South Dakota, Nebraska, Iowa, or the rest of “73 percent” of U. S. counties which had zero murders during any given year from 1977 to 2000. The   points out that even among the counties that lead the nation in murder, the murders are occurring only in certain parts of those counties. They point to a 2015 report in the Hartford Courant, wherein “Yale Ph. D. candidate Michael   explained that Yale University sociologists determined ’70 percent of all shootings in Chicago can be located in a social network composed of less than 6 percent of the city’s population. ’” Think about it —  70 percent of Chicago’s bloodshed and mayhem occurs in an area representing “less than 6 percent of the city’s population. ” Gun controllers would say this means more gun control is needed for the other 94% of the population, but such thinking is  . AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742562702.880003}