{"duration": 0.08797240257263184, "input_args": {"text": "'ELIZABETH, N. J.  —   Along the commercial corridor of Elmora Avenue, Salvadoran pupusas are sold next to kosher California rolls and across the street from a salon where three Colombians, a Cuban and a Uruguayan cut hair. Past Las Américas Bakery, the owner of another salon is the proud daughter of southern Italian immigrants. And on that same street, which decades ago used to be populated by Orthodox Jews, there stands an outlier: First American Fried Chicken, owned and operated by the Rahami family, immigrants from Afghanistan. Afghans are not a particularly large group living in Elizabeth. There were only about 200 in a city of nearly 127, 000 people, with 77 born in Afghanistan, according to 2014 census figures compiled by researchers at Queens College. In that same year, 63 percent of Elizabeth residents were Hispanic. But because of Ahmad Khan Rahami, the    arrested on Monday after a gunfight and suspected of planting bombs in Manhattan and New Jersey, Afghans have become the most talked about immigrants in what seemed to be a haven of diversity. “I woke up feeling like it was a dream I never felt like that could happen here,” Agueda Elizabeth Meza, 54, the owner of a Peruvian restaurant on Elizabeth Avenue, said through an interpreter. “Elizabeth is a city of all different bloods  —   as García Márquez said. ” Pick a flag  —   there are more than 50 nationalities, and more than 37 languages spoken, according to the office of Mayor J. Christian Bollwage (who is of German and Irish heritage). From Poland, Portugal and Peru, they all have come to Elizabeth. The International Rescue Committee, one of nine agencies in the United States that work with the government to resettle refugees, said that since 2010, its office here had helped 102 Afghan refugees, which includes 30 families. It is still not clear why Mr. Rahami and his family settled in Elizabeth. The authorities said he arrived in the United States as a child and, while a minor, was naturalized through his father  —   a different path from recent refugees who have come after years of international vetting. “One thing we do not want to see is any sort of backlash against the community in or around Elizabeth,” said Avigail Ziv, the International Rescue Committee’s executive director for New York and New Jersey. “These are refugees who have suffered a lot and have dealt with violence as well. They are just trying to rebuild their lives. ” There are four mosques in Elizabeth, but the largest, and where the agency said its Afghan refugees attended, is Darul Islam, in the northwestern part of the city. The president of the mosque, Hassen Abdellah, said he did not know whether Mr. Rahami had been there. “If he prayed in Elizabeth, my gut is that he did come here, everybody comes here,” said Mr. Abdellah, born in New Jersey, who was one of the mosque’s founding members in 1992. “We have an international community, people from Russia, Turkey, Pakistan. We have Asians, Africans,   we have the whole tree. ” Asked how many Afghans attend his mosque, Mr. Abdellah said it was perhaps “6 to 7 percent. ” On Monday morning, Mr. Abdellah received an email sent to leaders of area mosques with pictures of Mr. Rahami. “I was in shock, like everybody else,” he said. “I can’t believe that somebody in Elizabeth was involved in something like this. We’ve always been in partnership with the city and the government. ” The surprise registered closer to the fried chicken restaurant on Elmora Avenue. Guillermo Niell, 35, from Uruguay, said he and his family live across the street. He would often buy   there and he never noticed anything strange about the owners. But his Uruguayan hair stylist, Pepo Lambrechts, recalled that recently Mr. Rahami was always on his computer or his phone, not paying attention to customers. “My father loved that place,” Cristina Castro, 35, the   owner of the salon, said. Once a week, when he used to visit from Colombia, her daughter, Lesley, 13, would take him there. Ms. Castro’s mother, Gladys Echeverri, said she moved the family to Elizabeth in 1999, after the largest rebel group in Colombia made owning a hair salon too difficult in their small town outside Medellín. Ms. Echeverri was worried that Mr. Rahami’s arrest would affect business in Elizabeth. “It will hurt the reputation,” she said. But Ms. Castro said the city’s image was already tarnished by being in the dingy shadow of Newark. Officials with the Greater Elizabeth Chamber of Commerce would disagree. They are trying to turn Elizabeth into prime tourist destination, with the Jersey Gardens outlet mall as its biggest draw and its history  —   thanks to Alexander Hamilton, who lived and studied in Elizabeth after coming to the American colonies in 1772  —   in vogue. “We were the first capital of New Jersey this is where New Jersey was founded,” said Gordon Haas, the president of the Chamber of Commerce. “We advertise, ‘You can dine the world without a passport,’ because you name a restaurant, we’ve got it,” Mr. Haas said, adding, “including now, I guess, an Afghani chicken place. ” On Monday, as police cars and government vehicles cordoned off the street next to the restaurant and others around downtown Elizabeth, there was another kind of tension in the air for some immigrants. Back in January, immigration officials conducted raids in New Jersey as part of a nationwide effort to deport those who had orders of removal. That brought an increased law enforcement presence and anxiety to Elmora Avenue. “On the one side, you feel some security having all of this police around,” Ms. Meza said, who is a member of Make the Road New Jersey, an immigrant activist group. “But on the other side, there is this feeling of fear because only a few months ago raids were happening in our community, and one cannot help but be reminded. ”'"}, "time": 1742562192.5917742}