{"duration": 1.459625482559204, "input_args": {"text": "'Hillary Clinton: A Hawk in the Wings Hillary Clinton: A Hawk in the Wings By 46 (Photo: Flickr/CSIS) \\nWhen Barack Obama was running for office in 2008, he was determined to redirect U.S. military efforts away from the “bad war” in Iraq and toward the “good war” in Afghanistan. This commitment to extricate the U.S. military from the dismal aftermath of a botched exercise in regime change earned Obama the exaggerated designation of “peace candidate.” \\nJump ahead eight years and listen to how history rhymes. Today, the Obama administration is reluctant to pour more resources into a failed regime change effort in Syria and far more intent on confronting the Islamic State in the battle for Mosul and, ultimately its capital of Raqqa. Once again, the “good” war competes for attention with the “bad” war. \\nMeanwhile, the candidate that challenged Obama as too naïve and peace-loving back in 2008 is poised to succeed him as president. Once again, she has staked out a more hawkish position. And this time she has a large chunk of the foreign policy elite behind her. As Greg Jaffe wrote last week in The Washington Post: \\nIn the rarefied world of the Washington foreign policy establishment, President Obama’s departure from the White House — and the possible return of a more conventional and hawkish Hillary Clinton — is being met with quiet relief. \\nThe Republicans and Democrats who make up the foreign policy elite are laying the groundwork for a more assertive American foreign policy, via a flurry of reports shaped by officials who are likely to play senior roles in a potential Clinton White House. \\nThe foreign policy elite is mercurial and amnesiac. It wasn’t that long ago that this elite expressed not-so-quiet relief at George W. Bush’s departure from the White House and the return of a more conventional and dovish Barack Obama. And what of the more assertive policy of Hillary Clinton? Now that the truly apocalyptic threat of Donald Trump is receding, the lesser catastrophes of a Clinton administration beckon: perhaps Libya II or an expanded role in Yemen. \\nStill, as Jaffe points out, plenty of Obama’s foreign policy advisors continue to warn of the considerable risks of greater U.S. military involvement in the region. And, as Josh Rogin suggested this week in his Post column, even Clinton’s Middle East advisors are divided on this question. So, as it turns out, the foreign policy establishment has not quite established its position. \\nThe headlines are full of the ongoing tragedy of Aleppo and the upcoming showdown in Mosul. But then there’s the battle that determines the battle. Forget the inanities of Donald Trump for a few moments to consider what’s taking place behind the scenes. The latest skirmish over the future of U.S. foreign policy in the Middle East is about to begin. \\nIs there still a chance to influence the trajectory of the hawk as she leaves behind the corpses of her challengers and wings her way to the White House? \\nNo Good Solutions \\nIt’s remotely possible that the United States and its allies, if they’d acted quickly and with maximum power, could have helped to dislodge Syrian leader Bashar al-Assad during the Arab Spring by funding militias on the ground and providing them with air support. \\nHowever, even if the Obama administration had embraced such a strategy, which then-Secretary of State Hillary Clinton supported, Assad and his allies might have fought back to achieve the same kind of stalemate that prevails in Syria today. Or, if Assad had fallen, Syria might have descended into the same kind of maelstrom that has enveloped Libya. The cautionary example of Iraq, a truly poisonous gift from the George W. Bush administration, no doubt helped to stay Obama’s hand. \\nThe options on offer today are no better than in 2012. The Obama administration backed a CIA plan to arm several thousand “moderate” rebels to fight their way to power in Syria, and the CIA wants to increase the flow of weaponry. At best, these rebels have managed to achieve a punishing stalemate. At worst, as one unidentified U.S. official told The Washington Post , the units are “not doing any better on the battlefield, they’re up against a more formidable adversary, and they’re increasingly dominated by extremists.” Sending more weapons for a ground offensive wouldn’t do much, since the conflict is waged most effectively at the moment by air. Providing more sophisticated anti-aircraft weapons to the rebels would risk opposition from Turkey and escalation by Russia. \\nHillary Clinton, meanwhile, has proposed a “no-fly zone” in northern Syria that would presumably create “safe havens” for Syrians fleeing the conflict zones and facilitate humanitarian relief to those stuck in places like Aleppo. For Americans weary of a conflict that has killed hundreds of thousands of Syrians and turned millions into refugees, such a proposal has a certain appeal. Finally the United States would be doing something robust to increase the peace. \\nBut such a zone, as Clinton herself has admitted, is no pacifist solution. It would “kill a lot of Syrians,” she said back in 2013 , and draw both the United States and NATO more deeply into the military conflict. And then there’s the problem of World War III when U.S. planes start shooting down Russian bombers. Ben Rhodes listed the Obama administration’s reasons for opposing such a zone: \\nIf you had an area of geography in Syria where planes couldn’t fly over it, people would still be killing each other on the ground. ISIL doesn’t have planes, so that doesn’t solve the ISIL problem. They would still be able to massacre people on the ground. And we would have to devote an enormous amount of our resources — which are currently devoted to finding ISIL and killing them wherever they are — to maintaining this no-fly zone. \\nA third option would be to focus less on Assad in Syria and more on the Islamic State (or ISIL), which has emerged as Obama’s preferred strategy. But that plan has its own problems. The administration has emphasized the role of Iraqi forces in liberating their own city of Mosul. But the campaign relies heavily on U.S. air strikes as well as the participation of half of the 5,000 American troops that are still on the ground in Iraq. The recapture of Mosul, even if successful, could drag on for many months, and the Islamic State is not the kind of entity that sues for peace. \\nThere will be no “mission accomplished” moment for the Obama administration or its successor. Returning to its stateless mode if and when Raqqa falls, ISIS could prove even more dangerous for the United States and its allies as the terrorist outfit redirects its energies toward inflicting pain on its distant tormenters. \\nClinton and the Meatheads \\nThe Obama administration, for all its use of military force over the last eight years, at least has acknowledged the limited utility of that force. The president has time and again said that military intervention should not be the first tool deployed from the national security toolbox. Despite all the “just war” realism he included in his Nobel Peace Prize speech, Obama has pushed back against his more gung-ho advisors, including Hillary Clinton, who have clung to the notion that the U.S. military can determine facts on the ground. \\nLike Donald Trump, the foreign policy elite in Washington yearns to be unshackled. After a mere eight years in which diplomacy narrowly edged out militarism, this elite has forgotten the lessons of the George W. Bush era. Historically, this is no surprise. John Kenneth Galbraith once said , “The foreign policy elite was always the world’s biggest collection of meatheads.” As an economist, Galbraith knew a meathead when he saw one. Such meatheads are doomed to repeat the history that they didn’t understand even as they were living through it. \\nIt’s relatively easy to point out the flaws in the various options available to the Obama administration in Syria and Iraq. In order to preserve the better parts of the Obama legacy — the nuclear deal with Iran, the elevation of diplomacy, the willingness to lead from behind — what can be done short of cordoning off the entire Middle East and retreating into a fortress of solitude? \\nFirst of all, the next administration should widen its engagement with Iran beyond the narrow focus on nuclear issues. Any sustainable solution in Syria and Iraq will require the involvement of Iran — the posturing of the recent Center for American Progress report on U.S. policy in the Middle East notwithstanding. Pursuing economic and political engagement with Tehran must include a place at the table for the Rouhani administration in negotiations on Iraq and Syria. It’s time to stop complaining about Iranian “meddling” and instead take advantage of the country’s cross-border influence. \\nThe United States also has to rebuild a working relationship with Russia. I’m no fan of Vladimir Putin, and I’ve devoted several columns to what I find objectionable in Russian policy in Ukraine, Syria, and elsewhere. But if the United States could negotiate important agreements with the Soviet Union during the Cold War, surely we can find a modus operandi with the current residents of the Kremlin. Finding common ground in the Middle East can have additional spillover benefits for arms control and perhaps even reducing tensions in Eastern Europe. \\nRegime change in Syria is a mirage at the moment. Assad is not going anywhere as long as he can count on the firm support of Russia and Iran. Yes, he’s a war criminal. But to prevent the further commission of war crimes, sometimes it’s necessary to make a deal with the devil. His punishment will come eventually — just as it did for Slobodan Milosevic six years after the Dayton Accords. In the meantime, Washington has to pursue a diplomatic deal that stops punishing ordinary Syrians every day. \\nThe Islamic State, however, is not a force that is subject to negotiations. I don’t foresee a non-military solution to the specific problem of the would-be caliphate’s territorial ambitions. But the United States should not head up this fight. ISIS wants nothing better than a epic confrontation with America. Syrians and Iraqis must take the lead against IS, with Turkey, Iran, and even the Gulf States playing crucial roles. In the best-case scenario, admittedly a long shot, the terrorist faction inadvertently reduces the conflict between the Shia and Sunni states that cooperate in its annihilation. \\nThe CIA plan, the no-fly zone, the military focus on the Islamic State — these are not long-term strategies. They are proposals that satisfy a bipartisan foreign policy elite that bays for “something to be done.” The true challenge for the next administration is to resist the call of the meatheads. \\nBut that won’t happen without a counterforce that brings together a set of NGOs working for peace in the region, some sympathetic politicians and officials, and a group of foreign policy experts who have not fallen prey to the amnesia that periodically descends upon the Beltway concerning the destructive impact of U.S. military intervention. \\nDonald Trump is almost history. The far more complex challenge of Clinton’s Middle East policy awaits.'"}, "time": 1742563633.2356055}