{"duration": 1.6212468147277832, "input_args": {"text": "'Google Pinterest Digg Linkedin Reddit Stumbleupon Print Delicious Pocket Tumblr \\nDonald Trump has been claiming for weeks that the election is going to be “rigged” to prevent him from winning. He has made repeated calls to his supporters to go to the polls and keep an eye on what is going on. Even though a number of GOP candidates and officeholders have rejected Trump’s claim that there will be massive voter fraud, in some places the Republican Party is holding training classes for poll watchers. \\nIn-person voter fraud, which is what the GOP has claimed for several years is costing their candidates elections, has been repeatedly proven to be so rare as to almost not exist. But that doesn’t stop people like Trump from raising the alarm about it. And what he has been saying is having an effect. \\nAccording to The Washington Times, Arizona Republican officials say that in 2012 their poll watcher training sessions attracted maybe 50 or 60 people. This year, thanks to Trump’s Chicken Little-type warning, that number has increased to over 1,000. \\nIn Virginia, which has moved from red to purple to relatively blue in recent years, poll watcher trainees at a class in Fairfax County, just outside Washington D.C., expressed their belief that Trump is correct , according to The Wall Street Journal. \\nPenny Hendrix, a 52-year-old stay at home mom, said this: \\n“Very clearly there is going to be massive voter fraud, and it will definitely be to ensure Hillary Clinton wins. I’ve been concerned about this for some time, and Trump bringing it up is raising awareness.” \\nExcept that he is raising awareness of a problem that isn’t really a problem at all. Even the extremely right-wing Heritage Foundation, which produced a list of voter fraud convictions , could only put together about 300 examples. Now, 300 cases of voter fraud in one national election where millions of ballots are cast is a very small amount. But the Heritage list covers multiple years and multiple elections, making the impact even smaller than miniscule. The GOP has truly become an organization of Don Quixotes who are preparing to tilt at imaginary illegal voters. \\nThe leader of the Virginia poll watcher training, Republican activist Reagan George, told the attendees that they can’t challenge someone just because it looks like that person is going to be voting for Democrats. But he followed that statement by regaling his audience with stories of Democrats taking pictures of their votes so they can be rewarded by union officials or other GOP bogeymen. He also told them of how Democrats in some areas of the country have been getting the severely disabled to vote, even those who don’t really understand what is going on. And has George seen things like that happen with his own eyes? Of course not! But he has heard stories. And to a conservative, any story you hear from another conservative about some alleged misdeed carries much weight than actual facts and evidence. \\nThere’s not going to be massive voter fraud in this election, just as there has never been massive voter fraud before. Even in what was perhaps the most contentious election in recent U.S. history, the one in 2000, the issues with voting affected the outcome, in only one state — Florida. And as we all well know, those problems were caused not by voter fraud, but by poor election mechanics. What Trump and his GOP allies are attempting is to create bedlam on election day, and maybe in the process manage to win by intimidating hundreds or even thousands of legal voters in key states. \\nFeatured image via Spencer Platt/Getty Images Share this Article!'"}, "time": 1742563799.3683586}