{"duration": 0.07610750198364258, "input_args": {"text": "'Home / #Solutions / Dave Matthews Plays for Standing Rock Camp — Announces ‘Stand with Standing Rock’ Benefit Concert Dave Matthews Plays for Standing Rock Camp — Announces ‘Stand with Standing Rock’ Benefit Concert Jay Syrmopoulos November 2, 2016 1 Comment \\nCannon Ball, ND – Rock star Dave Matthews made an impromptu appearance at Standing Rock, performing for a small group at an overflow encampment. Footage of the undated performance was uploaded to YouTube on October 16, and shows Matthews performing his poignant song “Don’t Drink the Water.” Earlier in the day, Matthews had performed at Standing Rock Elementary as part of a program to promote the importance of art in schools. “Just to be part of maybe helping inspire them to see the greatness inside of each of them, you know. And maybe inspire them to be everything that they could be,” said Dave Matthews. \\nYesterday, Matthews announced that he will be hosting a “Stand With Standing Rock” benefit concert November 27 in Washington, D.C., in support of the Standing Rock Sioux Tribe’s continued fight against the Dakota Access Pipeline (DAPL). The controversial oil pipeline would traverse tribal lands in both North and South Dakota and travel under the Missouri River – which potentially threatens the Standing Rock Sioux’s source of clean water. “How can we continue to allow oil money to dictate our environmental and social policies?” asked Matthews. “The people of Standing Rock, and those who are supporting them, are standing up for their children and all of our children. We are letting the Dakota pipeline silence their voices. Not only are they desecrating sacred lands, but they also threaten to poison the Missouri River.” \\nProceeds from the benefit concert will go toward support of the Standing Rock Tribe’s fight against the DAPL, providing funding for supplies, legal assistance and other necessities. \\nHundreds of tribes from across the nation have gathered to protest the oil pipeline, in what has been called “the largest gathering of Native Americans in more than 100 years.” \\nMatthews is the latest celebrity to use his star power to bring increased attention to the plight of the Standing Rock Sioux, as actor Mark Ruffalo, who plays the Incredible Hulk, recently visited the camps and presented them with mobile solar trailers . \\nPrior to that, actress Shailene Woodley, who plays a hero revolutionary in the “Divergent” film series, was arrested and charged with criminal trespass and engaging in a riot for protesting the construction of the Dakota Access Pipeline. Woodley was specifically targeted by law enforcement, as she was the only person arrested among the group of protestors — even though engaging in the exact same peaceful protest as the other water protectors. Was livestreaming on Facebook at the time of her arrest to 45,000 people. \\n“This pipeline is a black snake that traverses four states and 200 waterways with fracked Bakken oil,” said Ruffalo, co-founder of The Solutions Project, a venture that works to transition society to clean and renewable energy. “We know from experience that pipelines leak, explode, pollute and poison land and water. But it doesn’t have to be that way.” \\nThe reality of the situation is that the Standing Rock tribe is fighting to protect their source of clean water. The Dakota Access Pipeline puts the tribe’s clean water supply, as well as that of millions of others, in danger, as the pipeline is scheduled to go directly under the Missouri River. \\nSeeing these multi-millionaire celebrities taking a stand for the Standing Rock Sioux is an example for all individuals; celebrity, and non-celebrity alike. Rather than simply donating money to a cause, these men and women are utilizing and leveraging their celebrity to bring much needed attention to the continued injustices being perpetuated against the Native American community. \\nIt’s clear that Matthews, Ruffalo and Woodley have taken a page out of Gandhi’s book, and are “being the change they wish to see in the world.” \\nPlease share this inspiring human story — and take a stand for Standing Rock! Share'"}, "time": 1742563233.0173256}