{"duration": 0.05537128448486328, "input_args": {"text": "'In a temporary win for political correctness the Cleveland Indians and parent company, Rogers Communications, lost an interim decision to throw out a discrimination claim alleging that the team’s mascot “Chief Wahoo” and their logo are offensive and discriminatory. [Douglas Cardinal, a Canadian architect who designed the Smithsonian’s National Museum of the American Indian and is a member of the Blackfoot tribe, filed suit in October that using the Cleveland team name “Indians” and the “Chief Wahoo” logo and mascot during games at the Toronto Blue Jays Rogers Centre violates discrimination laws under the Ontario Human Rights Code.   Cardinal’s objective is to ban the Cleveland Indians from donning their team name or logos at MLB games played in Toronto. “As an Indigenous person, I am encouraged that the Ontario Human Rights Tribunal has accepted jurisdiction over my complaint and agrees that it can proceed to a hearing,” said Cardinal in an official statement.  “Unfortunately, the consciousness of genocide and apartheid continues to be fostered by the insensitive use of demeaning and degrading symbols, mocking indigenous peoples,” Cardinal added. “This must cease in order for reconciliation to have any meaning and substance. ” On May 23, according to a document filed at canlii. com, Tribunal adjudicator   Pickel ruled that Cardinal had standing to bring suit against the Indians and Rogers. “If the applicant was either not indigenous, not a baseball fan, and not otherwise interested in attending games at the Rogers Centre, my finding on the issue of standing would have been different,” she wrote. “In my view, the applicant has asserted a sufficient personal interest to have standing to bring this application. ”  You can read Pickel’s  full ruling here. If Cardinal should win, the team would have to remove the name “Indians” and the Wahoo imagery from their uniforms when playing games in Canada.  Bill Baer at NBC Sports reports that MLB fans are the oldest of all sports fans. When they die off, younger fans will be   with Cardinal and the notion that such mascots and imagery are racist. “MLB will have trouble courting them with racist iconography,” he writes.  “Even if the humanity argument doesn’t persuade one —  which it should, full stop —  the business angle should be convincing enough to anyone involved in fighting this battle to preserve Chief Wahoo that it’s a lost cause. ”'"}, "time": 1742564415.1282604}