{"duration": 0.08707189559936523, "input_args": {"text": "'Former Officer Peter Liang will not serve any time in prison for fatally shooting an unarmed man in a Brooklyn housing project stairwell two years ago, but was instead sentenced on Tuesday to probation and community service. The sentence  —   in one of the most divisive police misconduct cases in recent New York City history  —   came just moments after the judge took the unusual steps of ruling that the shooting was essentially an accident and reducing the jury’s verdict on manslaughter charges to the less severe criminally negligent homicide. Though the Brooklyn district attorney’s office promised to appeal the ruling, the sentencing was a decisive move in the politically contentious case that highlighted concerns over police accountability, especially in black neighborhoods, but never neatly fit the narrative of other killings by   officers around the country. It is rare for police officers even to be charged and brought to court in shooting cases while this one resulted in a guilty verdict at a   trial this winter, the sentencing was deeply disappointing to the family of the victim, Akai Gurley. As Justice Danny K. Chun of State Supreme Court in Brooklyn imposed five years of probation and 800 hours of community service, Mr. Liang sat still at the defendant’s table showing little emotion. Behind him, the benches were packed with Mr. Gurley’s loved ones. When the hourlong hearing came to an end and it was clear that Mr. Liang would not serve time in prison, Hertencia Petersen, Mr. Gurley’s aunt, stepped into a hallway shouting: “There is no justice! Akai Gurley’s life didn’t matter!” Mr. Gurley died on Nov. 20, 2014, when his heart was pierced by a ricocheting bullet that Mr. Liang had fired while on a night patrol in a dark stairwell in the Louis H. Pink Houses in the East New York neighborhood. In February, a jury convicted him of manslaughter and official misconduct, rejecting his testimony that the gun had simply gone off in his hand and finding that he had failed to help Mr. Gurley as he lay dying on a   landing. Before the sentence was issued, Mr. Gurley’s girlfriend, Melissa Butler, who was with him when he died, told Mr. Liang that even today, she was still in pain and needed the solace of justice. “You took a piece of me,” she said. “You took a piece of my heart. ” Moments later, Mr. Liang himself stood and turned toward Ms. Butler and the others, apologizing for having killed a man they loved. “The shot was accidental,” he said. “My life has forever changed. ” It was at that point that Justice Chun announced that he was going to reduce the manslaughter verdict, saying there was no evidence that Mr. Liang was even aware of Mr. Gurley’s presence in the stairwell. “This was not an intentional act,” the judge said. “This was a criminally negligent act. As such, I find incarceration not necessary. ” Just minutes earlier, Paul Shechtman, the former officer’s lawyer, had said much the same thing, telling Justice Chun that while other police officers in recent years had maliciously hurt and killed young black men, Mr. Liang “is not them. ” After the hearing, District Attorney Ken Thompson released a statement saying he planned to appeal Justice Chun’s decision to reduce the jury’s verdict  —   an unusual move from a man who all along has taken a Solomonic approach to the complicated case. From the start, Mr. Thompson faced enormous pressure to pursue an indictment against Mr. Liang, who killed Mr. Gurley the same year that Eric Garner died during a police arrest on Staten Island. As Brooklyn’s first black district attorney, Mr. Thompson had vowed to bring a heightened sense of social justice to the borough’s communities of color. But after the conviction, Mr. Thompson issued a letter recommending that Mr. Liang should not serve time in prison. The letter referred to Mr. Gurley as “a completely innocent man who lost his life for no reason,” but also said Mr. Liang had no prior criminal history and posed no threat to public safety. In court on Tuesday, Justice Chun said that Mr. Thompson’s recommendation was “entirely and completely appropriate. ” He added that on that November night two years ago, shooting Mr. Gurley was “probably the last thing” on Mr. Liang’s mind. Speaking after the hearing, Mr. Shechtman said he was pleased with the sentence and understood the disappointment of Mr. Gurley’s family. “We have very mixed emotions,” Mr. Shechtman said. “But this is a good day for Peter Liang in a year and a half when there haven’t been many good days. ” As word of the sentence made its way onto the street, dueling groups of protesters erupted into chants and debate. About 60 people, waving signs and shouting, gathered around Ms. Petersen, Mr. Gurley’s aunt. “Another black man has been murdered by the hands of the Police Department and the officer is not being held accountable,” she said. “This right here is not the end. We’re going to continue to fight until we get justice. ” Across the street, another crowd massed in support of Mr. Liang, who is of Chinese heritage. “Accident does not mean crime,” Helen Zhu said. “Chinese are no more silent. We just want justice  —   justice for all. All people’s lives matter. ”'"}, "time": 1742561983.124721}