{"duration": 1.682443380355835, "input_args": {"text": "'DALLAS  —   Fearful that the nation is locked in a spiral of violence and discord, many Americans took what refuge they could in church on Sunday. In tiny storefronts and suburban megachurches, worshipers mourned the deaths of five Dallas police officers at the hands of an   sniper who was aiming to kill white officers at a demonstration against police violence. They also grieved for two   men killed in shootings by the police in Baton Rouge, La. and Minnesota. Some prayed for the souls of the men who pulled the triggers. Some thanked God for the sacrifices the police made daily to protect their cities. Some thanked God for the technology that allowed the world to see controversial acts of police violence toward  . At St. Patrick’s Cathedral in New York, Cardinal Timothy M. Dolan spoke of a country “worried, frustrated and fatigued over senseless violence. ” “From Minnesota to Louisiana and Texas, one nation under God examines its soul,” he said. “Sadness and heaviness is especially present in our   and law enforcement communities. ” The turbulence felt close, sometimes distressingly so, for many churchgoers. Protests had roiled the streets of San Francisco, Chicago, New York and Philadelphia, among other cities, hours before sunrise. In Dallas, drivers had to maneuver on Sunday morning around a   crime scene that remained closed off in the heart of downtown, where Micah Johnson, a    former Army reservist, used a semiautomatic weapon last week to kill the five officers and wound seven others, as well as two civilians, before the police killed him with a   explosive device. A few blocks from the scene, Mayor Mike Rawlings of Dallas gave an interview on Sunday on CBS’s “Face the Nation,” posing questions about his city that many Americans, Christian and   alike, had begun asking about the nation as a whole. “Can we, in a moment of crisis, when officers are fallen, forgive?” Mr. Rawlings said. “Can we disagree without demonizing? Can we see a better narrative, as opposed to just absurdity, that there’s redemption as we build this great city?” Mr. Rawlings, who is white, also attended a service at the Potter’s House Church, the huge Dallas congregation led by the   televangelist T . D. Jakes. The service was more of a town hall event promising “tools on reconciling and moving forward. ” The city’s police chief, David O. Brown, and other officers were in attendance. Among the panelists and   participants were relatives of Alton Sterling, the black man killed in Louisiana, and the girlfriend of Philando Castile, the black motorist shot to death in Minnesota. Nine miles away, on the outskirts of South Dallas, Pastor Frederick Douglass Haynes III addressed a congregation of hundreds, most of them black, at   Baptist Church. He told them he was not interested in preaching a message of reconciliation if that did not come with change, or of healing if that simply meant patching over the injustice that had led to last week’s violence. “We can’t have normal church today,” he said, explaining that he was tired of delivering services after such tragedies, naming Tamir Rice, Walter Scott and Eric Garner. Calling the nation a racial powder keg, Pastor Haynes said, “You won’t have unity as long as you have structured injustice. ” “The Bible says injustice is a sin,” he added. “The Bible says oppression is a sin. ” Pastor Haynes’s daughter was at the Dallas protest on Thursday night and was   with him from her phone when the shooting began. Pastor Haynes, who said he had watched his daughter’s proud smile transform into screams, struck out at those trying to blame the advocacy group Black Lives Matter for the attack, calling it “racist gall. ” “That was a peaceful march,” he said. “Police and protesters were taking selfies. ” At Watermark Community Church in Dallas, those who dropped off their children for Sunday school walked by the place where Sgt. Michael J. Smith had stood for years, sometimes on Sundays, sometimes during the week, by the glass doors leading to the preschool classrooms. He had been there the previous Sunday, but he was not there for this one. Sergeant Smith, who provided security at the church while off duty and was also a member, was one of the sniper’s victims on Thursday night. That evening, Watermark’s senior pastor, Todd Wagner, posted a letter online to Dallas residents. The city, he said, was “a war zone. ” “As part of that war, darkness has been growing in our country because for some time leaders and citizens alike have mocked” the light of God, he wrote. Onstage Sunday, Pastor Wagner reiterated that theme but also called for a greater sense of understanding among the races. “They very first time I heard ‘Black lives matter,’ I was like: ‘What? Why would you make such a racist statement? ’” Pastor Wagner, who is white, said during an impassioned sermon. Later, he said, he realized that he needed to listen to those making the declaration, try to understand the source of their hurt, love them and preach the Gospel. Others, he said, would be wise to do the same  —   to respond to “Black lives matter” with “Let me understand your pain,” and to show “that white men do care. ” In Baton Rouge, about 20 worshipers, nearly all of them black, gathered at the Ark of Safety, a storefront church sometimes attended by relatives of Mr. Sterling, who was selling CDs in a parking lot before he was killed by the police on Tuesday. The Rev. Tommie Gordon told congregants that if they trusted in the world, they would be lost  —   that if they demanded justice from the world, they would be lost. “When things are going wrong, people always want to shout about it,” he said. “Nobody’s going to listen. This is the time to get on your knees and pray. ” There is nothing wrong with lawful protest, he said. But he added, more than once, “I’ve never seen Jesus at a protest. ” Brandon Lee, 22, who knew Mr. Sterling and whose father bought CDs from him, expressed a belief that did not exactly echo the message of the service. “I just really feel like it starts with man,” he said, speaking of the need for justice. “If you fix man, you fix the world. ” Elsewhere, easy answers seemed equally difficult to come by. At Nativity Lutheran Church in St. Anthony, Minn. not far from where Officer Jeronimo Yanez shot and killed Mr. Castile, the Rev. Glenn Seefeldt called for prayers for both men. “We want to be able to be a part of the solution, not a part of the problem,” he said. “But where do we start?” Pastor Seefeldt, whose congregation is mostly white, mentioned “white privilege” and urged members to think deeply about their actions and hidden biases. “I have a real and tremendous guilt response,” he said. “What have I done to contribute to racism as a white male?” This peculiar and tangled American moment seemed even more vexing for Rose Tolbert, 58, a member of the   church in Dallas. Ms. Tolbert works for the Dallas County Sheriff’s Department and has two sons in law enforcement. Ms. Tolbert is also   and she had wanted to attend Thursday’s protest in a stand against police killings of black men but had to work that night. When she got news of the shootings, she called to make sure her family was O. K. Then she fell asleep crying over the tragedy that had befallen her fellow law enforcement officers. At the same time, she remained devastated by the deaths of Mr. Sterling and Mr. Castile. On Sunday morning, her preacher invited her to the altar for a special prayer for law enforcement officers and their families, for protesters, and for children who he said were being traumatized by violence. Ms. Tolbert went to the altar, then returned with tears streaming down her face. “I needed consolation  —   I needed the word from God,” she said, her voice breaking. She paused and then collapsed against a pole in the church lobby, sobbing. “I came here to get refilled,” she said. “We need to pray and get active. We need to stand up. ”'"}, "time": 1742562889.4333487}