{"duration": 0.12072253227233887, "input_args": {"text": "'Comments (4) Read by 130 people \\nThings have gotten steadily worse for Democrats after Donald Trump’s election to the Presidency of the United States. Scores of celebrities are freaking out across social media, Hillary supporters are holding “Cry Ins” to help each other cope, visits to Canada’s immigration website have skyrocketed , and coping videos are starting to make the rounds online. \\nWhile many shocked Clinton supporters have found solidarity with thousands of others by protesting and rioting in the streets, some, like movie star Robert DeNiro, have fallen into a depressive state . \\nAnd according to The Hill , those overwhelming feelings of depression have led to suicidal thoughts in many. So much so that suicide hotlines across the country are struggling to keep up: \\nPhones have been ringing off the hook at suicide hotlines since Donald Trump was named president-elect Tuesday. \\nAccording to multiple reports, many of those calling or texting into hotlines are members of the LGBTQ community, minorities and victims of sexual assault who are worried about Trump’s victory. The Suicide Prevention Lifeline told “ The Washington Post” it is seeing calls “unmatched in the hotline’s history,” with a response unlike that in 2008 or 2012. \\n… \\nElection stress is nothing new. Psychologists have noted upticks in anxiety and stress during and following contentious election cycles. This specific election, many have observed, is no exception and is exceeding average numbers in those seeking mental care and counseling. \\nIf you are someone you know can’t handle the stress, please share this video.   Mac Slavo Views: Read by 130   12th, 2016 Website: www.SHTFplan.com \\n  Copyright SHTFplan and Mac Slavo. This content may be freely reproduced in full or in part in digital form with full attribution to the author and a link to www.shtfplan.com. Please contact us for permission to reproduce this content in other media formats.'"}, "time": 1742562240.5881133}