{"duration": 0.479215145111084, "input_args": {"text": "'Next Cold War Roundup 11/1/16: Iraqi forces entered the city of Mosul and are advancing rapidly. Russia continues a halt on airstrikes in Aleppo as rebels led by al Qaeda launched an offensive in Aleppo. Turkey masses forces on borders. Experts warn of open-ended conflict with Russia. US politicians continue to accuse Russia of meddling with elections as damning material is exposed. And more from our latest roundup…\\nRussian Carrier Group in the Mediterranean _ The Russian carrier group is in the Mediterranean. Russian defense minister Shoigu said the fact that NATO countries denied them call at their ports along the way did not affect them as they were replenished by supply ship s.\\n_ Ruptly published video on Tuesday of the carrier group in the western Med doing helicopter and fighter jet takeoffs and landings.\\nMosul _ Iraqi forces moved on Mosul as the battle has entered a new phase of urban warfare. Iraqi forces fought ISIS on the eastern side of Mosul and “artillery and air strikes pounded the city, still home to 1.5 million people.” Civilians from eastern Mosul , and residents of the eastern neighborhood of al-Quds said the “ultra-hardline Sunni militants had resorted to street fighting to try to hold the army back,” according to Reuters .\\n_ Iraqi special forces Gen. Shaghati held a press conference, saying: “ This is a good sign for the people of Mosul because the battle to liberate Mosul has effectively begun .” His troops captured a state TV building in Mosul. But reportedly there were also complications . Some of Shaghati’s men raised a Shi’ite flag. A brawl broke out between “Kurdish peshmerga fighters and mainly Arab Iraqi commandos” at a checkpoint on the Mosul-Erbil road, where they threatened to shoot each other. Christians waiting at the checkpoint for hours, scattered.\\n_ Mosul Eye reported that residents are in their homes, the Iraqi forces are advancing rapidly, and ISIS is disappearing from the Al-Karama section. War correspondent Elijah Magnier said Iraqi forces liberated Hay al-Samah and are advancing toward Hay al-Zohur.\\n_ Refugees are leaving Mosul in small boats, crossing the Tigris river ( video ) from the al-Shora area to “reach territory held by government forces” 6 miles away. Ruptly also published graphic (*caution*) video of ISIS fighters “littering the recently liberated village of al-Shora.”\\n_ Meanwhile, Turkey is reportedly massing tanks and troops near its border with Iraq, in the town of Silopi , as they expect the Kurdish PKK to take Sinjar. This makes 2 reports of Turkish forces massing on a border (see below reports of Turkish troops in Gazientep on the Syrian border).\\n_ Patrick Cockburn recalls , first hand, what happened in Mosul during the 2003 US invasion and the fall of Saddam Hussein. The Kurdish Peshmerga and others (but mainly the Kurds) took advantage of the power vacuum and looted the city while US soldiers manned checkpoints. They also took Kirkuk and other Arab territory, expanding the Kurdish territory by 40% after promising that they wouldn’t.\\n“As we drove into the city, we passed lines of pick-up trucks piled high with loot returning to the Kurdish-controlled enclave in northern Iraq.”\\n_ Cockburn gives a masterful summary of the different factions involved in the current anti-ISIS coalition advancing on Mosul and urges the Iraqi government to take and maintain control of Mosul so that it doesn’t get ripped apart and looted like before.\\n“The different segments of the anti-Isis forces potentially involved in seizing Mosul – the Iraqi army, Kurds, Shia and Sunni paramilitaries, Turks – may be temporary allies, but they are also rivals. They all have their own very different and conflicting agendas.”\\nRaqqa Campaign Will Coincide With Mosul Campaign and Will Happen “Soon” _ In a press briefing on Oct. 26 ( video , transcript ) Lt. Gen. Townsend, Operation Inherent Resolve commander, said that the campaign to take Raqqa in Syria will be done simultaneously with the Mosul campaign. They are working on the plans for the “isolation and eventual liberation of Raqqah.” It will be done in stages — first isolation and then “seizure and liberation.”\\n_ The Raqqah operation will be done with “a lot lighter coalition footprint” and with “our local partners in northern Syria.” Townsend said there are sufficient local forces but they plan to “recruit and equip and train more local forces for that operation.” The current Syrian Democratic Forces are 30,000 in number, mostly Kurdish. Townsend plans to recruit more local forces from the Raqqah area, similar to the way it was done in Manbij. The training will be done in northern Syria.\\n_ When asked if the Kurdish YPG element of the Syrian Democratic Forces will participate in the Raqqah campaign, given that Turkey has demanded no involvement of Kurds in Raqqah, Townsend said that is a “tough one.” Townsend said “it’s very important to get isolation in place around Raqqah to start controlling that environment on a pretty short timeline” and “we’re gonna take the force that we have.”\\n_ As for Turkey, Townsend said: “The Turks have expressed an interest to be involved in that. And we’ll — we’ll work through that later […] And I think that we’ll go with the forces that can go on the timeline that we need.” He stressed that they want to move on Raqqah “soon.”\\n_ Lt. Gen. Townsend said they’ll take “any partner that’s willing to join the coalition.” Would that include ex-ISIS fighters? “We’re gonna go with who can go, who’s willing to go soon. And then we’ll — once we get initial isolation in position, we’ll — we’ll look at how we prosecute the operation further.”\\n_ When asked about the urgency of the Raqqah campaign, Townsend said that ISIS is “up to something” and there is “and external plot” “emanating from Raqqah.”\\n_ A Military Times journalist asked if more US troops would be deployed to Syria, and Townsend would not answer directly but inferred that there would.\\nThe Race for Raqqah _ Townsend, several times, avoided questions about Russia and Syria with respect to the Raqqah campaign, during the Oct. 26 briefing ( video , transcript ), until the end of the briefing when Paul Sonne asked directly about Syria and Russia’s response to Turkey participating in the Raqqa campaign and moving even further into Syria. Townsend’s answer was cryptic and hard to summarize, but important to read in full, as he signaled the official justification for US moving on Raqqah and acknowledged that the Syrian government would oppose it:\\nTownsend : “I just know that right now Syria seems to have their hands full. And so it’s necessary for our coalition to move about inside Syria to defeat Daesh-ISIL because it poses a threat to Syria, Iraq, the region, and our own nations.”\\n“So like I said, we’ll welcome any contributing nation that wants to make themselves part of the coalition to go fight Daesh in Syria. But that — join the coalition has to come with not — can’t just come with a whole bunch of strings. They got to be willing to go do what the coalition needs done. We try to employ coalition contributions whether they be troops or capabilities, we try to always, we employ them within the bounds of the wishes of their government. ”\\n“Once we set out what that arrangement is, then the coalition employs those capabilities. So we’ll use whoever wants to go do that, fight Daesh in Raqqa, that’s a tough place, probably won’t be a very long list. And I would imagine Syria probably isn’t thrilled with any of us there doing that. But it’s necessary to do.”\\n_ So the official justification for taking Raqqah, is that the Syrian army has its hands full and somebody has to take down ISIS in their capital.\\n_ Townsend says, multiple times, that any country, any force can join their coalition to isolate and liberate Raqqah. And each time he says it during the briefing, he does not exclude the Syrian coalition forces. When asked about Syria and Russia’s expected reaction to the Raqqah campaign, he brings it up again, that anyone can join the coalition, either with forces or “capabilities.” But they must accept that the US will be leading this coalition, even though they have no legal authority to fight or bomb inside Syria and the Syrian government repeatedly reminds the world of that.\\n_ Townsend then acknowledges that the Syrian government probably won’t be “thrilled” about the US coalition taking Raqqah or “with any of us” meaning Turkey. But he largely blows it off. which is interesting, and completely avoids addressing Russia specifically, again, though several journalists were anxious for him to address it. Very dicey, vague and unlike other parts of his briefing, this part sounded disingenuous.\\n_ Turkey is urging that the battle for Raqqa wait until after the Mosul operation is over. Turkish Deputy Prime Minister Numan Kurtulmus : “It would be better both militarily and strategically to conduct this operation after the Mosul operation and Turkey’s Euphrates Shield operation are completed.”\\nAleppo _ Southfront reports that the Jaish al-Fatah rebel group, led by al Nusra, “has not been able to deliver a devastating blow to the Syrian government forces and to break the siege of eastern Aleppo.”\\n_ The rebels had launched a recent offensive with “over 2,000 so-called moderate opposition members carried out attacks on residential areas, schools and hospitals with the support of 22 tanks, 15 IFVs, multiple launch rocket systems and eight vehicles with suicide bombers.” They killed 80 civilians and injured 300 from Oct. 29 to Oct. 31 alone, and launched shells with chlorine gas on the Al-Hamdaniya neighborhood in West Aleppo.\\n_ Russia has not used warplanes in Aleppo for 16 days now. Rebel groups in East Aleppo continue to attack West Aleppo. Russian defense minister Shoigu said that “militants shoot dozens of civilians every day for trying to approach the humanitarian corridors.” The Russian military asked for permission to do airstrikes on Oct. 28 but Russian president Putin refused , continuing to extend the halt on airstrikes as part of a “humanitarian pause.” The Kremlin spokesman said the “humanitarian pause” will be impossible to continue if the opposition groups “resume offensive operations ” (which they have done). The Kremlin spokesman also indicated that “measures are being taken to ensure the evacuation of civilians and injured from eastern Aleppo.”\\n_ Ruptly published video today of the Syrian army firing “rocket salvos and heavy automatic weapons as they attempted to wrest control of the contested southwestern area.”\\n_ As the Russians wait for the UN and US to convince the “moderate opposition” to separate from designated terrorist groups, and the UN envoy Steffan de Mistura, in Geneva, “called on the fighters to leave the city to help enable aid to reach” East Aleppo’s civilians, the top negotiator, Khaled Khoja, in the Saudi-backed opposition umbrella group, the High Negotiations Committee (HNC), also in Geneva, said it’s impossible for the rebels in East Aleppo to separate from al Nusra (al Qaeda) , and blamed it on the international community. He also denied shelling civilians in West Aleppo, which has been confirmed by numerous officials and media, as have reports of East Aleppo rebels refusing to allow civilians to leave.\\n_ As Russia keeps extending their halt on airstrikes, continue to keep humanitarian corridors that opposition rebels refuse to allow civilians to use to escape, and rebels launch offensives and refuse to separate from al Qaeda, the foggy, propaganda-mired situation in Aleppo becomes more clear to everyone. The US continues to refuse to provide intelligence on the location of al Qaeda or to convince the rebels they are backing to separate from them.\\n_ Khoja is hoping that the election next week will bring Hillary Clinton as a savior for the opposition groups and al Qaeda in East Aleppo:\\nHNC negotiator Khoja : “We heard (Democratic presidential candidate Hillary) Clinton talking about civilian protection, no-fly-zones, which is something we welcome and that we demand.”\\nFlow of ISIS fighters Between Iraq and Syria _ In the Oct. 26 briefing ( video , transcript ), Lt. Gen. Townsend said they don’t have a complete encirclement of Mosul and it’s not necessary, and there is movement out of Mosul but “when we can identify ISIL fighters, we strike them.” He said ISIS has gotten “savvy since Fallujah” and they mix fighters with families in their convoys so it’s hard to strike them.\\nReshaping Syria? _ Turkish government officials are leaking some pretty explosive claims to Turkish pro-government media. Pro-Erdogan Turkish media, Yeni Safak, is reporting that Russia and Turkey made a deal to cede an extensive amount of territory in northern Syria to the control of “local elements and local assemblies after being liberated from the terror groups.” Syrian president Assad’s government” will consolidate its power in Latakia and Tartus.” The Turkish military is reportedly massing on the border in Gaziantep and will advance south to Aleppo, while Assad’s forces will vacate the city. Al Nusra and Ahrar al-Sham will be required to leave.\\n_ Yeni Safak reports that “a new map will be drawn including the Aleppo, Idlib, Latakia, Raqqa, Al-Hasakah and Dery ez-Zor provinces of the country.” Syrian Kurds, allied with the US-led coaliiton, plan to create an “autonomous region” to include “al-Hasakah, Tal Abyad, Ayn al Arab, Jarabulus, Al Rai, Azez, Marea and Afrin.” Turkey and Russia will not accept that plan and the Turkish government sources claimed that Russia and Turkey would fight together under Operation Euphrates Shield.\\n– On Tuesday,. Yeni Safak reported that the Turkish military chief of staff, Gen. Hulusi Akar, traveled to Moscow to meet with his counterpart, Gen. Valery Gerasimov, a deputy defense minister and head of the Russian military, to discuss“military cooperation and regional issues”.\\nOpen-Ended Conflict With Russia _ Spencer Ackerman at the Guardian spoke to people in the US “national security circles,” including “retired senior US military pilots” and the director of national intelligence, who are ” increasingly alarmed that Hillary Clinton’s proposal for “no-fly zones” in Syria could lead to a military confrontation with Russia that could escalate to levels that were previously unthinkable in the post-cold war world.” Clinton’s opponent, Trump. has recently said that her “safe zones” plan could lead to World War III . Many considered the risk of aerial confrontation with Russian planes to be “severe.” DNI Clapper said he wouldn’t put it past the Russians to shoot down American aircraft. Others worry that she’ll commit the air force to an indefinite air occupation.\\n_ A retired Navy pilot who has flown no-fly zone missions went on the record saying no-fly zones are “the cocktail party military application of power of choice” and “it’s going to be a disaster. I hope it’s political posturing.” He also said: “I see almost nothing positive that can come from implementing [a no-fly zone] at the current time over Syria. Conversely, the potential to make a bad situation worse is very, very high.”\\n_ Guardian war correspondent Jonathan Steele calls Hillary Clinton’s no-fly zone plan for Syria “madness” that would not deescalate the war and “threatens to engulf us all.” He then provides a Syrian war rarity — some US/UK media truth-telling about the so called rebels:\\nSteele : “Syria is also mired in a propaganda war, and in the heart-rending images that the rebels put out on social media about life and death in Aleppo, the seamier side of the armed groups’ control is suppressed.”\\n_ Paul Mulshine from the NJ Star Ledger notes that top generals on both sides believe that a no-fly zone in Syria would lead to war with Russia.\\n_ Mnar Muhawesh of Mint Press News interviewed FBI whistleblower Coleen Rowley on the risks of Hillary Clinton starting a world war.\\nPlan B for Syria: Anti-aircraft and Anti-Artillery Weapons to CIA-Backed FSA _ On Sunday, the Washington Post reported that Pres. Obama had neither agreed nor disagreed with a Plan B for Syria, to rush ship heavy weapons to “tens of thousands of” CIA-backed “rebels” in Syria, the Free Syrian Army (FSA), which could be used against Russian aircraft and artillery. Plan B is supported by CIA director John Brennan and Sec. Defense Ash Carter. Some White House officials are skeptical about the CIA’s assessments. Overall, the CIA has backed “50,000 or more” fighters in a “constellation” of groups in Syria. The article had some interesting quotes:\\nAnonymous US official : [CIA-backed fighters are] “not doing any better on the battlefield, they’re up against a more formidable adversary, and they’re increasingly dominated by extremists […] What has this program become, and how will history record this effort?”\\n2nd Anonymous US official : “The FSA remains the only vehicle to pursue those goals […] You can’t defeat ISIL without removing Assad […] As long as there is a failed state in Syria, ISIL will have a homeland.”\\nFormer senior administration official (involved in 2012 White House discussions of CIA program): “It’s a fine mess we’ve gotten ourselves into[…] “There’s a huge risk here since the Russians entered. .\\u2002.\\u2002. The lesson out of this is that if you don’t take action early on, you should almost expect the options to get worse and worse and worse.”\\n2nd administration official involved in Syria discussions : “The Russians have seized the initiative […] You can’t pretend you can go to war against Assad and not go to war against Russia.”\\nSenior Turkish official : “They [US] promised to give more support [… But it now seems like nothing is going to happen. This coalition hasn’t delivered. It’s obsolete now. So we’re going to look at our options. If Aleppo falls, Assad wins.”\\nRussian Ministries Accuse US Anti-ISIS Coalition of War Crimes _ An airstrike on a mourning procession at a Shia shrine in the town of Daquq (near Kirkuk) on Oct. 21 resulted in civilian casualties leaving 17 people (15 women) dead and 50 injured, mainly women and children. Iran and Russia claimed that it was a US coalition airstrike. An official from the Kirkuk provisional council claimed it was an Iraqi plane , misinformed about ISIS positions. Iraq is investigating .\\n_ The Pentagon denied involvement in any airstrikes in Daquq that resulted in civilian casualties. Jason Ditz at antiwar.com notes that the “denial’s very specific caveats, that they didn’t deny attacking Daquq, or indeed the mosque, doesn’t help with credibility.” The US track record on admitting to civilian casualties during anti-ISIS missions hasn’t been very good . Locals identified the attacker as a warplane but could not tell whose plane it was.\\n_ Iran’s foreign ministry spokesman, Bahram Ghasemi, said :\\nGhasemi : “Attacking innocent and mourning people cannot be justified by any excuse. The suffering people of Iraq should not be under terrorist attacks on the one hand, and on the other, bombardment by foreign military forces that prance around in Iraq under the pretext of fighting terrorism.”\\n_ The Russian Ministry of Defense said the US-led coalition was responsible for the strikes and inferred that they commit war crimes almost daily:\\nRussian MoD : “Russian reconnaissance pinpointed two jets conducting airstrikes on Daquq, located 30 kilometers to the south of Kirkuk, where, according to our data, there are no ISIS fighters. […] “These deadly attacks on civilian areas, which have all the marks of war crimes, are becoming almost a daily routine for the international coalition.”\\nAmnesty International: US Coalition Severely Underestimates Civilian Casualties in Syria _ Lynn Maalouf, deputy director for research at Amnesty International’s Beirut regional office said :\\nMaalouf : “It’s high time the U.S. authorities came clean about the full extent of the civilian damage caused by coalition attacks in Syria […] “We fear the U.S.-led coalition is significantly underestimating the harm caused to civilians in its operations in Syria […] “Analysis of available evidence suggests that in each of these cases, coalition forces failed to take adequate precautions to minimize harm to civilians and damage to civilian objects […] Some of these attacks may constitute disproportionate or otherwise indiscriminate attacks.” [Emphasis added]\\n_ Based on Amnesty’s analysis of 11 US coalition attacks, the evidence suggests “as many as 300 civilians were killed.” The Pentagon has only acknowledged 1 death in these attacks. Research by other monitoring organizations indicates that the total number of civilians killed in US coalition airstrikes has been as high as 600 or more than 1000 . The strikes hit villages, homes, public markets, and shelters. In one case, a double-tap strike was reported in the village of Ayn al-Khan, Hasakah, where a helicopter gunship returned and killed first responders, even though the Kurdish fighters claimed to have warned the coalition of civilians in the area. [Emphasis added]\\nSurvivor : “‘At this point I had a two-month-old baby boy in my arms whom I had rescued. The hit caused me to fall and drop him… I fell into the hole made by the air strike. That was what saved me… My mother, aunt, wife and children – a daughter who was four years old and a son who was two and a half were all killed. The woman and her son who I’d rescued were killed. Everyone but me was killed,’ he said.”\\nUN and Rights Groups Condemn Russia and Syria for Airstrikes on Idlib School _ UNICEF and monitoring groups accused Russia or Syria of airstrikes on a school compound in the rebel-held village of Haas in Idlib province. 35 people were killed, including 22 children. A graphic photo of a child with a partially severed arm was circulated on social media. UNICEF’s director called it an outrage and a war crime, if deliberate. The UN humanitarian chief said he was “incandescent with rage” and held the UN Security Council for not stopping the suffering.\\n_ At the UN Security Council meeting, the Russian ambassador Churkin was attacked by several parties including US ambassador to the UN Samantha Power. Churkin said Russia and Syria had halted airstrikes for the past week and there had been no recognition . US Power, after accusing Russia of not cooperating with the UN and mocking the humanitarian pause, said: Power : “You don’t get congratulations and credit for not committing war crimes for a day or a week.” She walked out again when the Syrian ambassador spoke.\\nRussia Lost Seat on UN Human Rights Council _ Russia was stripped of its seat on the UN Human Rights Council during a UN general assembly secret vote for re-election for membership. The US and UK won seats on the council. Rights groups had lobbied for this outcome. Hungary and Croatia gained seats in their region. Saudi Arabia kept their seat on the Human Rights Council.\\nOperation Euphrates Shield: Syria Threatens to Down Turkish Planes _ As Turkish-backed forces (CIA and Turkish-backed Free Syrian Army (FSA) and the Turkish military) invaded Syria in Jarablus late August, in an offensive called Operation Euphrates Shield, under the pretense of clearing ISIS from the Syrian-Turkish border areas but with the real aim of preventing Kurdish forces from securing a contiguous area in northern Syria. As they advanced westward to northern Aleppo, in the vicinity of al-Bab, they began fighting with Kurdish forces and on Oct. 20 hit the majority Kurdish Syrian Democratic Forces (SDF) with airstrikes. Hurriyet reported , via an anonymous official, that the Syrian government then activated their air defense and threatened to shoot down any Turkish planes in Syrian airspace.\\n_ RT reported on Oct. 29 that the Turkish air force has not been used in Operation Euphrates shield for the past week and that “coalition forces have also decreased the number of flights in northern Syria.” The lack of air support has slowed their advance toward al-Bab.\\n_ Until the past few days, the Turkish forces have fought with ISIS and the Kurds in northern Syria, but not Syrian coalition forces. But Turkey claims that the Syrian forces attacked them this week near Marea. On Wednesday the Turkish foreign minister said Operation Euphrates Shield would not be deterred by the government forces “ until retaking the city of al-Bab .”\\nEast Aleppo “Rebels” Firing Chemical Weapons Rockets at Civilian Areas in West Aleppo _ On Sunday, Syrian media reported “shells containing poison gases” fired at residential areas in West Aleppo from opposition fighters in East Aleppo. An RT crew on the ground reported “36 cases of suffocation” and Al-Mayadeen media reported that all victims were civilians. The Russian ambassador to the UN reported via the Russian foreign ministry that 16,000 people were killed by US-backed opposition groups between February and September.\\n_ The head of Aleppo University Hospital said 36 people (both fighters and civilians) were injured by the chlorine gas fired into West Aleppo by the opposition in East Aleppo, who have launched a recent offensive on the government-held areas after more than a week of Russia and Syria halting airstrikes. The London-based and pro-rebel Syrian Observatory for Human Rights confirmed that chemical weapon attacks happened.\\nAir Base in Hasakah _ The air base that US military engineers renovated months ago for use by US special forces and Kurdish forces:\\nFor the first time, mystical Abu Hajar Airport near the town of Rmelan in the al-Hasakah Governorate #Syria #USAF pic.twitter.com/vlj78ew5if \\n— Aldin Abazović (@Ald_Aba) October 30, 2016 \\n\\nUkraine _ Fighting has broken out in “the northern suburbs of Donetsk, the airport district, the Yasinovataya checkpoint, and Spartak village” in Ukraine, where there had been a ceasefire, according to Fort Russ .\\n_ The Ukraine military has reportedly been massing on the frontlines of Lugansk . There is also a report of a team of NATO troops from “Canada, Denmark, and the Netherlands” meeting with the Ukraine miltiary in the Donbass to “study the real situation on the demarcation line in Donbass” and to test weapons.\\nWar and Elections _ Retired Col. Lawrence Wilkerson and Gordon Adams on the National Interest: “ No, Hillary Clinton’s Foreign Policy Judgement Isn’t As Good As Everyone Says .” Wilkerson also discussed the article on The Real News this week. Wilkerson, who served under the George W. Bush administration, says he’s very concerned because of her past history and the fact that a lot of the people who are advising her look like the people who were advising Pres. George W. Bush. Trump has been all over the place, Wilkerson said, but he has also indicated that he wouldn’t get us into the wars “on the edge of empire” that cost us so much and don’t produce good result. Wilkerson said from what he has heard, the military and the Joint Chiefs are reluctant to intervene in Syria against Assad. The policy to take down Assad is a mistake.\\n\\n_ Ray McGovern, on the Real News , said nothing happened at the latest meeting on the Minsk Accords. Germany, France and Russia want the violence in Ukraine to stop, but Poroshenko is “not his own man,” according to McGovern. He’s a puppet of the US. Hillary Clinton “and the people she’s bringing in with her, they’ve openly favored giving arms, offense arms to Ukraine.” The Europeans “to their credit are worried about that.” McGovern recently visited the region on a mission with 20 people. He said Ukraine is in a shambles and the people are malnourished. His unofficial delegation visited Crimea, and other areas in Russia, and they were welcomed by “everyday Russians,” like minded people who want peace and are worried about the demonization of their president and country.\\n_ “ Clinton’s Allies Promise a Tougher Line on Iran .” And “ Clinton Adviser Proposes Attacking Iran to Aid the Saudis in Yemen .”\\n_ “ The Geniuses Who Brought You the Iraq War Are at It Again ” and they’re mainly allied with the Hillary Clinton campaign, something the partisan author of the article “forgets” to mention.\\nAnalysis and Opinion _ Yet another warning from an expert on US-Russian relations about the buildup to war with the nuclear power. Retired intelligence analyst, Ray McGovern, lays out the recent history of the deterioration in relations and asks the right questions about why all the hype about Russia is being built up right now.\\n_ Stephen Walt: “ The Great Myth About U.S. Intervention in Syria : America’s standing in the world has not — and will not — be weakened by staying out of other countries’ humanitarian crises.”\\n_ James Carden at The Nation: “ Obama’s Foreign Policy: A Hostage to Bipartisan Consensus .” “ He may have criticized the ‘Washington playbook,’ but he couldn’t overcome DC’s interventionist orthodoxy .” Carden notes that all of Obama’s foreign policy pledges have been unfulfilled and his likely successor is a hawk which is “ an all-too-fitting monument to an era of dashed expectations.” Obama gave the wars in Libya and Syria “a veneer of legality,” started a “new and more dangerous cold war with Russia,” and launched the “Asia pivot” to begin efforts to contain of China. Obama was expected to improve the mess from the Bush years but instead “the convergence of the neoconservative and Wilsonian interventionist creeds has solidified into orthodoxy” that became necessary for war selling after the 2003 Iraq invasion fiasco. Hardcore neocons “have become devoted supporters of Hillary Clinton.” Samantha Power declared that the US national interest have been expanded from interstate affairs to intrastate affairs as well and Obama “remains firmly in the grip of a foreign-policy orthodoxy that he himself has dismissed” largely because the of the narrow spectrum of policy options considered acceptable by the “Borg”.\\n“Power’s casual disregard for the Westphalian principle of noninterference in the internal affairs of other states, now de rigueur among interventionists of both parties, is fused with a belief in American global hegemony, of which the Obama administration’s 2010 Quadrennial Defense Review is representative.”\\n_ According to Max Keiser, an American finance show host based in London, the UK is “using fake Russian threat to pass ‘snoopers charter’ law.” He cites a Guardian “exclusive”: “‘ Increasingly aggressive’ Russia a growing threat to UK, says MI5 head .” “Exclusive: In first newspaper interview given by a serving spy chief, Andrew Parker talks of terror, espionage and balance between secrecy and privacy.” The Kremlin spokesman refuted the MI5 chief’s claims.\\n \\nThe post Iraqi Forces Enter Mosul; Rebels Launch Offensive in Aleppo; Turkish Forces on Borders appeared first on Shadowproof .\\n'"}, "time": 1742561925.6098247}