{"duration": 0.10560131072998047, "input_args": {"text": "'Serena Shim is an American citizen of Lebanese descent who was born near Detroit. Shim worked for Iranian broadcaster Press TV as a foreign correspondent covering wars, legitimate protests and fake uprisings in multiple countries. \\nVia AnonHQ \\n\\nShe reported live from Syria, Iraq, Turkey, and Lebanon during the conflict since 2011, including in the critical region of Daraa during the beginning of protests, which are misrepresented by American media as the reasons for the fake civil war. Serena Shim was killed two years ago on October 19, 2014, in Turkey while reporting on the intense battle for the Syrian border city of Kobani which was the focus of international media attention. She was 29 when she died.\\nScroll Down For Video Below! The city of Kobani, which has one of Turkey’s major border crossings with Syria, because it was under threat of being completely captured by the Islamic State. The US was forced to respond because Islamic State grew out of control and threatened the border stability of Turkey, and it became the first major area bombed during the US campaign in Syria.\\nThe US and Turkey were also arguing over Washington’s plan to arm Kurdish fighters on the Syrian side of the border and how to allow Kurds from Iraq to support the effort by crossing through Turkey. On the day she was killed, the US began operations to airdrop weapons to the Kurds. Less than two days later, Islamic State fighters released a video showing the capture of an American weapons cache airdropped near the city. The video received international media attention which led the Pentagon to admit the weapons mistakenly reached ISIL terrorists.\\nIt is claimed she was killed in a car accident with a cement truck. However, physical details about the case raise questions about the official explanation by Turkish officials. There are also conflicting stories about the timeline after her death and before the family received her body, which indicate actions by the government of Turkey and possibly the United States.\\nTwo days before her death, Serena Shim reported on live international television that Turkish intelligence services were planning to arrest her for questioning on the suspicion her being a spy. The day after her death, US officials denied releasing any information it had about whether the US government was aware of Turkey’s plans. State Department officials told WTF News it would be December 2017 before a Freedom of Information Act request could be completed for information on what actions were taken by them to assist her as a US citizen.\\nSerena Shim conducted an undercover investigation in Turkey and Syria lasting multiple months during 2012 as she spoke fluent Arabic. Her report aired on Press TV beginning in December 2012. The issues listed below are topics she reported on first or experienced in person before they were reported by major media outlets. US officials continue to hide her death and not a single major media outlet in America reported on her death at the time despite the fact that she was popular in America and the Middle East.\\n1. HILLARY CLINTON’S EMAILS PROVE THE US STATE DEPT AND WHITE HOUSE KNEW SAUDI ARABIA AND QATAR ARE FUNDING ISLAMIC STATE \\nClinton admitted, in an email conversation from August 2014 obtained by Wikileaks, that US allies Saudi Arabia and Qatar were sending money and weapons to ISIL. August 2014 was the height of terror during Islamic State’s rise, leading to the growing international media outrage which forced President Obama to publicly announce the beginning of airstrikes against ISIL in Syria on September 23, 2014.\\nTHE FREE THOUGHT PROJECT \\n“While this military/para-military operation is moving forward, we need to use our diplomatic and more traditional intelligence assets to bring pressure on the governments of Qatar and Saudi Arabia, which are providing clandestine financial and logistic support to ISIL and other radical Sunni groups in the region.” \\n“The Qataris and Saudis will be put in a position of balancing policy between their ongoing competition to dominate the Sunni world and the consequences of serious U.S. pressure.” \\nThe business newspaper Financial Times reported that Prince Saud al-Faisal admitted Saudi Arabia created and funded Islamic State as a response to the US supporting Shia powers in Iraq. The FT also reported in 2013that Qatar had already spent $3 billion on funding the opposition.\\nAmerica’s top military official General Martin Dempsey, the Chairman of the Joint Chiefs of Staff, was asked “Do you know any major Arab ally that embraces ISIL?” by Republican Senator Lindsay Graham. “I know major Arab allies who fund them,” replied Dempsey.\\n2. THE UNITED STATES WANTED THE ISLAMIC STATE TO GROW, AS PROVED BY LEAKED INTELLIGENCE DOCUMENTS \\nThe rapid growth of the Islamic State was not an accident, and many observers of the conflict questioned the US commitment to fighting terrorism as they ignored the group’s rise. Since the start of the armed conflict in 2011, United States officials including Hillary Clinton have publicly stated that their solution to stop the war is to replace Syrian President Bashar al-Assad and other government leaders. The public policy of the United States has been to support what the US calls moderate opposition groups under the name Free Syrian Army (FSA) with the goal of having them weaken the government forces.\\nThat strategy changed in mid-2012 as news reports confirmed these rebels were committing war crimes by killing civilians and executing soldiers. One of the largest factions Al Nusra was specifically identified as a terrorist group in December 2012. At the same time, the Islamic State (known as Al Qaeda in Iraq) was growing in Syria and had become a dominant force by 2013. The Islamic State grew in Syria for almost two years before the US announced it would take military action in September 2014. The intelligence report was dated August 2012 confirms the US government would have known about this threat for two years.\\nJUDICIAL WATCH “If the situation unravels, there is the possibility of establishing a declared or undeclared Salafist Principality in eastern Syria (Hasaka and Der Zor), and this is exactly what the supporting powers to the opposition want, in order to isolate the Syrian regime, which is considered the strategic depth of the Shia expansion (Iraq and Iran).”Syria has been fought over for two separate gas pipeline projects, a pipeline from Qatar rejected by Assad for one from Iran. The second pipeline is a Russian plan to connect with Turkey to deliver gas to Europe; the deal was finalized less than two weeks ago.\\n'"}, "time": 1742561638.4111667}