{"duration": 0.07536792755126953, "input_args": {"text": "'What feminists can learn from Melania Trump. October 28, 2016 Ilana Mercer \\nIn recent interviews, Donald Trump\\'s wife, Melania Trump, observed wryly that almost every malicious, lie-filled article about herself or he husband was written by a … female. Indeed, women seem to have a particular stake in bringing Mr. Trump down. \\nThe contrast between Mrs. Trump and the many histrionic shrews prosecuting her husband is stark. In both her interviews with CNN\\'s condescending Anderson Cooper and Fox News\\'s Ainsley Earhardt, Mrs. Trump was the embodiment of \"strength.\" \\nWhen a liberal woman declares she\\'s a strong woman (usually uttered in a tart-like, staccato inflection), she\\'s using a cliché. Look at her actions. You\\'ll see that \"strong\" to liberal distaff means kicking and screaming until she brings others into compliance with her worldview and ways. \\nA \"strong\" liberal woman is one who hammers you about your obligation to fork-out for her Trojans and her Trivora. And if birth control fails our liberated libertine, then you\\'re on the hook for her abortions and abortifacients. And don\\'t dare doubt any of the intemperate charges leveled by this prototype liberal succubus against a man, any man. To doubt her is to harm her. \\nIt was not without significance that Hillary Clinton’s first general election speech, in June, was before Planned Parenthood. At the time, media buried the story of one named Rajiv K. Fernando , who had donated to the Clinton Foundation and was given a seat as Hillary’s nuclear weapons advisor. Watching this, I was thinking endemic corruption, the $19 trillion debt, the dire jobs report, the terrifying prospect of negative interest rates and the fate of savers. But Hillary and her gyno-brigade in media and across the country were cheering for a universal right to taxpayer-paid dilation and curettage (D&C). \\nMelania Trump, on the other hand, is authentically strong. \\nIn her refusal to impart salacious tell-all tidbits to interviewers, in the way she guards her privacy and that of her family; in her serene, gracious, and beautiful manners and bearing—Mrs. Trump exemplifies a European woman\\'s good breeding. She\\'s a class act. Her enemies are the cultural underclass. \\nNor does Mrs. Trump display any of the histrionics about men exhibited by her American counterparts. There are images on the Internet of presidents being inappropriate with women. In particular, you can watch a grainy YouTube clip of Barack Obama appearing to be showing off his crotch to giggling female reporters. In another, the president, with France\\'s Nicolas Sarkozy, is eying the shapely behind of a young woman passing by. Much to media chagrin, Melania refused to get worked up about the 2005 Access Hollywood tape in which her husband engaged in locker-room talk. \\nMen will be men. If they\\'re not saying it; they\\'re thinking it. \\nMore material than her mien were Melania Trump\\'s words of reason. On the Soviet-style witch-hunt launched against her husband with media mediation, she said this: “All sexual assault allegations should be handled in a court of law. To accuse someone, man or woman, without evidence is damaging and unfair.” This was the exact verdict of famed defense attorney Tom Mesereau, about the Bill Cosby pile-on. Quit the feeding frenzy. Give the man his due process. Investigate the women, counseled Mesereau, Esq., at the time. \\nThe very embodiment of the malevolent liberal matriarchy rising is the sainted Michelle Obama. The First Lady was lauded for an unhinged anti-Trump address to the nation\\'s women. In a world where Americans have been beheaded on camera, women raped en masse on Europe\\'s streets, and Christians exterminated in the Middle East—the First Lady bewailed being \"shaken\" to her shallow core by raunchy words. \"I can\\'t stop thinking about it,\" groaned Michelle about Mr. Trump\\'s Access Hollywood indiscretion. It \"has shaken me to my core in a way I could not have predicted.\" \\nThe ritualistic decapitation on the altar of a Catholic priest by Muslim migrants in France: That\\'s something \"I can\\'t stop thinking about.\" The machine-gunning of five Macy\\'s shoppers and employees by a Turkish Muslim immigrant (Arcan Cetin), in my neck of the woods: That \"has shaken me to my core in a way I could not have predicted.\" Again, Mrs. Obama\\'s pitiful case against Mr. Trump has strengthened nothing but her drama-queen credentials. \\nCandidate Clinton crowed that Mrs. Obama\\'s long whinge for women was a \"compelling and strong case about the stakes in the election, about who we are as Americans.\" Indeed, the implicit case Michelle put to women is this: a mammoth national debt, a shrinking job market, rising lawlessness and racial strife, an annual intake of mostly Third-World immigrants exceeding 3 million, the dangers to life and limb of importing more Islam: fuhgeddaboudit. What counts, whimpered Michelle Obama, voice trembling—yes, Mrs. Obama almost brought herself to tears—was to ferret out microaggression, and find a safe-place to hunker down. \\nAs I write, Sen. Elizabeth Warren has stormed a stage somewhere for Hillary Clinton. Phony Pocahontas is hollering about the power of \"nasty women\" to immiserate. Clinton and Warren make for a resentful, domineering, power-hungry pair, who’ve made it big in life through the use of state power. The human backdrop to their displays of female force invariably looks the same. \\nWhereas Trump rallies are packed with hope-filled, beaming faces; a Clinton-Warren affair is festooned with malevolent-looking, aggrieved women and their frightened, low-T houseboys. The background music: enfeebled squeaking courtesy of a female pop “singer” like Katy Perry, whose out-of-tune yelps and bedroom whispers would be unheard, if not for the marvel of Auto-Tune. (Auto-Tune is the “holy grail of recording” that “corrects intonation problems in vocals or solo instruments, in real time, without distortion or artifacts.” It was invented by a male engineer.) \\nShudder. \\nIf this melodramatic, neurotic message is the voice of America\\'s women—and legions of Republican women have seconded it—then count me with HER, with Melania.'"}, "time": 1742628298.457905}