{"duration": 0.12102341651916504, "input_args": {"text": "'LOS ANGELES  —   YouTube Red, the   paid streaming service, has acquired its first     television drama, moving it into more direct competition with players like Netflix and traditional cable networks. Fittingly, given YouTube’s ambitions, the scripted series will be based on “Step Up,” the   dance movie franchise that started Channing Tatum’s acting career and has taken in more than $650 million at the worldwide box office. Lionsgate will supply a full season of 10 episodes, each running about 45 minutes  —   a long way from the quickie cat videos for which YouTube was once known. “Bigger, bolder” and an offering that will “drive subscription” is how Susanne Daniels, YouTube’s global head of original content, described the   series in an interview. Kevin Beggs, Lionsgate’s television chairman, called it “a distinctive, noisy,   series” that “multiple networks wanted. ” Mr. Tatum will be an executive producer of the drama, expected to arrive next year. It will cost several million dollars per episode to make, signaling the arrival of YouTube Red as a   buyer of content. The series, which will feature YouTube stars as dancers and actors, will be set at a performing arts high school and be most similar in tone to the first of the five “Step Up” movies. For $10 a month, YouTube Red offers   viewing of videos, exclusive programming and a vast selection of music. Ms. Daniels, best known for turning the WB network into a youth powerhouse in the 1990s, joined the company a year ago and is charged with finding YouTube Red’s version of Amazon’s “Transparent” or Netflix’s “House of Cards”  —   a breakout series that will sell subscriptions and send a message to Hollywood’s creative community: This is a viable place for your best show pitches. The verdict is still out. Sundar Pichai, chief executive of Google, said in an   conference call in April that YouTube Red had been “very well received. ” But the company has not released user numbers, and some analysts have been unenthusiastic, especially as more streaming competition has arisen. Hulu, HBO, Netflix, Fullscreen, Go90, Seeso and Amazon, among others, are all pursuing this turf. “It is hard to tell whether the effort is succeeding or will succeed,” Carlos Kirjner, an analyst at Bernstein Research, wrote in a client report last month. “It is possible that it might be too little too late. ” Notably, Mr. Kirjner cited a lack of “   content” as one of YouTube Red’s shortcomings. Ms. Daniels acknowledged in an interview that she was walking “a fine line” with programming decisions. YouTube Red’s original lineup must feel familiar to ardent users of the site (teenagers and young adults) while offering something distinctive enough to convince them to upgrade from YouTube’s free service. So far, efforts have included “A Trip to Unicorn Island,” a documentary about a world tour taken by a YouTube personality, Lilly Singh, and “Foursome,” a high school comedy. “We still don’t know for sure what’s going to resonate,” Ms. Daniels said. “You just have to sort of jump in the water. ” Still, the “Step Up” project represents a very educated guess. “Dance videos on YouTube drive millions of hours of watch time every month,” Ms. Daniels said, adding that dance is a popular genre for YouTube around the world. YouTube Red is available in the United States, Australia and New Zealand, and has plans for overseas expansion, particularly in Europe. Music videos are also enormously popular on YouTube  —   the “Step Up” movies are known for their   montages  —   and some of the biggest traditional television hits of the last decade, including “Empire,” “Glee” and NBC’s live musicals, have been rooted in song. Mr. Beggs of Lionsgate said that Ms. Daniels was able to nab the series in part because she was willing to commit to a full season without first making a pilot episode as a test. “That got everyone’s attention,” he said. The deal got its start at a New Year’s Eve party at the Los Angeles home of Erik Feig,   of Lionsgate’s movie division. Ms. Daniels was among the guests. That night, “Erik said the studio was getting ready to talk to distributors about a ‘Step Up’ TV show, and so I immediately started my hot pursuit,” she said. More than most other Hollywood studios, Lionsgate has been early to spot the promise of streaming services as buyers of   television shows. Lionsgate’s production roster includes “Orange Is the New Black” for Netflix and “Casual,” which was renewed on Hulu for a third season. (The   “Mad Men” is still Lionsgate’s   series, however.) Will “Step Up” provide the studio with another television hit, the kind that mints money by running multiple seasons? It is too early to say, of course, but Mr. Feig, who has been involved with the “Step Up” franchise from its beginning, has high hopes. “‘Step Up’ has always relied on a relatively simple formula, one that has managed to work again and again in different contexts, with different actors,” Mr. Feig said in an email. Combine innovative choreography with “the most current   tracks and an   dollop of   fantasy, and it’s an instant party,” he said. “One that is destined to leave you maybe not all that wiser, but definitely in a better mood. ”'"}, "time": 1742563664.212754}