{"duration": 0.031291961669921875, "input_args": {"text": "'Actor Cuba Gooding Jr. came under fire on social media Sunday night and Monday morning after he appeared to lift up his American Horror Story   Sarah Paulson’s dress during a PaleyFest panel Sunday. [In photos and video that spread online over the weekend, Paulson and her castmates are seen laughing and applauding while welcoming   Kathy Bates to the stage, before Gooding Jr. appeared to lift up Paulson’s dress.  Sarah Paulson introducing Kathy Bates  …    .. name a better friendship pic. twitter.   —   p. c 🍒 (@90sIover) March 27, 2017,  Social media users quickly excoriated the   actor, calling the dress stunt sexist and disrespectful. Okay, yes I went back to screenshot this. But does he seriously think this is okay? @cubagoodingjr @MsSarahPaulson pic. twitter.   —   Elle ☪️ (@MistyyyGoode) March 27, 2017,  What happened to Sarah Paulson yesterday at #PaleyFest was so disrespectful and definitely NOT OK or funny 😡😡  —   Rebecca O’Keeffe (@RebeccaOkeeffe5) March 27, 2017,  Um  …     so is @cubagoodingjr allowed to get away with lifting @MsSarahPaulson skirt at @paleycenter? Total disrespect to a woman,  —   WinterThreds (@piratepenzan) March 27, 2017,  How would @cubagoodingjr react if a man walked up to his daughter, Piper and lifted her dress up behind her back? #itsneverok,  —   SallyThatTwirl (@SupremelyOne) March 27, 2017,  @cubagoodingjr playing OJ was the perfect fit, I see the similarities now.  —   Elle ☪️ (@MistyyyGoode) March 27, 2017,  One Twitter user appeared to blame the political climate in the United States for the actor’s dress stunt. Somebody come get your uncle.  WTF is wrong with @cubagoodingjr?  No decorun.  Stay on some F_boi ish. Reminder: This is Trump’s America.  —   Eyounguns (@AunteeYo) March 27, 2017,  In the photo, Paulson appears to be laughing while Gooding Jr. looks like he’s lifting up her dress. The event took place on Sunday at the Dolby Theater in Los Angeles. Also in attendance at the panel were Kathy Bates, Denis O’Hare, Cheyenne Jackson, Adina Porter and more, who spoke about the upcoming season of the show. During the panel, Paulson was asked which of her AHS characters she’d like to see come back. “Probably [Coven‘s] Cordelia. We only got to see her just getting her powers. I just would like to know  …     if the power might have been something that kind of changed her,” she said. American Horror Story creator Ryan Murphy was not present for the panel. The FX show’s stars, which included Denis O’Hare, Cheyenne Jackson, and Adina Porter, discussed past seasons but didn’t offer clues or tidbits for the forthcoming season 7 premiere. The upcoming season is expected to revolve around the 2016 presidential election. Paulson told the Hollywood Reporter on Saturday that she would like to play Donald Trump on the upcoming season of the show, though Murphy has previously said neither Trump nor Clinton would appear as characters. “Why not? That’s an acting challenge to be sure,” she said.   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742628527.2342274}