{"duration": 0.1154170036315918, "input_args": {"text": "'“Hamilton” is about to hit the road. And, more than a year before it arrives in many cities, theaters around the country are trying to convert the hunger for tickets into subscriptions and memberships. In many cities, theaters are encouraging potential patrons to subscribe to their   seasons, even though “Hamilton” won’t arrive until the following season, with the promise that those who subscribe now  —   and then renew  —   will be guaranteed “Hamilton” tickets and can lock in their chosen subscription seats. The strategy is   because the theaters acknowledge that some tickets will ultimately be available for sale to nonsubscribers. Given the widespread publicity over the scarcity of tickets to the Broadway production of “Hamilton,” though, many theatergoers appear unwilling to risk facing a   show in their hometowns. “In my 38 years of being involved with selling tickets for various activities, I don’t believe there has ever been this kind of ‘but how do I get  ’ conversation,” said Deborah F. Rutter, the president of the John F. Kennedy Center for the Performing Arts in Washington. “Hamilton” is scheduled to be at the Kennedy Center for 14 weeks in the summer of 2018 on Wednesday, the center started selling tickets for its   season, with the promise that anyone who subscribes that season, and renews next, will be guaranteed tickets. The effort to goad people into subscribing for two years to get tickets to the show prompted criticism in The Washington Post from a blogger, who called it a “quite high entrance fee,” and from a letter writer, who criticized what she called “extortionist prices. ” Ms. Rutter said there would be tickets available for purchase to nonsubscribers, but that it only made sense to reach out to try to bolster subscriptions first. “People have accused us of gouging, but it’s not gouging  —   if you want to be first in line, the best way to do that is to be a subscriber,” Ms. Rutter said. The strategy is already proving a significant boon to theaters where “Hamilton” will be staged  —   some are nonprofits, and some are commercial enterprises, but all depend on subscriptions or memberships as important elements of their budgets. Many arts groups have hard times sustaining subscription bases as consumers gravitate toward more à la carte and   planning for their cultural activities. “We live and breathe by the subscription model,” said Lauren Reid, chief executive of the theater unit at Key Brand Entertainment, which brings shows to 40 stages in North America through its Broadway Across America subsidiary. Ms. Reid said she had never seen as high a level of consumer awareness about a new show as for “Hamilton” consequently, she added, every theater expecting “Hamilton” is “teasing” it early to promote subscriptions. “The bottom line is ‘Hamilton’ is really good for our industry,” she said. “It’s an event, and it’s a cultural moment, and it’s unusual that we have an opportunity like this to highlight something special. ” The tactic is working. In Chicago, the first city outside New York where “Hamilton” will be seen (starting on Sept. 27) Broadway in Chicago has sold out its fall subscription package for the first time, according to Lou Raizin, the organization’s president. The company has not yet started selling tickets to nonsubscribers  —   and there will be many such tickets available, because the show plans to stay in Chicago as long as sales are healthy. But, Mr. Raizin said: “We believe there will be very strong demand. You’d have to be hiding under a rock not to have that opinion. ” In San Francisco, where “Hamilton” is expected to run at the SHN Orpheum Theater for 21 weeks, starting next March, SHN, which operates two locations in the city, expects to have 40, 000 members enroll for its   season, up from the usual 20, 000 to 23, 000. “‘Hamilton’ has been an incredible driver for membership sales,” said Greg Holland, SHN’s chief executive. Also noteworthy, Mr. Holland said, was that 80 percent of the new membership buyers were   visitors to the company’s website. In Iowa, Des Moines Performing Arts has said that “Hamilton” will come for an unspecified length of time at unspecified dates during the   season, but that has been enough to cause a spike in subscriptions to the coming season. “We’ve more than doubled the number of new season tickets purchased compared to a year ago, and our renewal rate is shooting up to the levels we always aspire to,” said Jeff Chelesvig, the center’s president and chief executive. “Our goal is 11, 000 subscribers, and I have no doubt we’ll plow through that. ” The lead producer of “Hamilton,” Jeffrey Seller, said he was aware that theaters were using the promise of a future production of the show to market   subscriptions. “I’m O. K. with it  —   it’s good for the theater in general,” he said. “The only thing I don’t want anyone to say is that if you don’t buy a subscription, you won’t be able to get a ticket, because there will be single tickets. They won’t sell out through subscriptions. ” The Broadway production of “Hamilton,” which has been essentially sold out since it opened last August, is expected to continue to run for years. The show is planning to visit other cities through two additional productions: the one that will open in Chicago this fall and stay there indefinitely, and the one that will begin in San Francisco next March and then tour. Thus far, tour stops, often without specific dates or duration, have been announced for Atlanta Boston Costa Mesa, Calif. Des Moines Houston Las Vegas Los Angeles Portland, Ore. Seattle Tempe, Ariz. and Washington. “Hamilton” is also planning a fourth production, in London, but that has not yet been officially announced.'"}, "time": 1742561769.8086753}