{"duration": 0.06486725807189941, "input_args": {"text": "'Posted on November 8, 2016 by Charles Hugh Smith \\nThough it has been billed as the main event for months, the presidential election has always been a side show –or from one point of view, a freak show. \\nAs I write this on Monday, I have no idea who will win the side show unpopularity contest (i.e. the presidential race)–and it doesn’t really matter as much as apoplectic partisans would have us believe. \\nThe reason why it doesn’t matter much which unpopular candidate wins is the issues facing the nation are far larger than partisan politics or the corrupt Ruling Elite that is freaking out about the possibility of a Trump presidency disrupting its self-serving skims and scams. \\nAs I described yesterday in America’s Ruling Elite Has Failed and Deserves to Be Fired ,we are in the midst of a fast-moving Industrial-Digital Revolution that is upending the political, economic and social orders. The global economy’s current mode of production is in fits and starts being replaced with a new mode of production that bypasses the Ruling Elite’s centralized skims and scams. \\nReal reform is impossible in the current Status Quo , a dynamic I described in my book Why Our Status Quo Failed and Is Beyond Reform and illustrated with this chart. \\nThe Ruling Elite will never allow real reform because real reform threatens their dominance and wealth. Instead, the Ruling Elite proposes modest policy tweaks that increase their dominance by limiting innovation and competition and transferring the systemic risks and costs of their skims/scams to the non-elites. \\nIf a crisis does threaten their dominance, any meaningful reforms that result from the crisis will be watered down once the storm has passed. \\nThe core problem is the Status Quo and its Ruling Elite rely on centralized hierarchies, regulatory capture and mobile capital to protect their dominance from innovation and competition. This aligned perfectly with the centralized World War II-era state-cartel/ central-bank mode of production that has dominated the economy and society since 1945. \\nBut the Industrial-Digital Revolution is destabilizing these inflexible, centralized hierarchies which cannot compete with decentralized, flexible networks in output, efficiency or cost. \\nThis presents the self-serving Ruling Elites with an impossible choice: either embrace the Industrial-Digital Revolution’s efficiencies and watch the foundation of their own dominance and wealth crumble, or defend their bloated, inefficient and increasingly bankrupt centralized hierarchies from innovation and competition–a war they are losing and cannot possibly win. \\nThe Status Quo is not just financially bankrupt–it is morally and intellectually bankrupt as well. The level of insider dealing, self-aggrandizement, collusion and corruption in the Ruling Elite is off the charts, and this is now visible for all to see. \\nThe Status Quo’s intellectual grab-bag of narratives and ideologies is devoid of anything remotely aligned with the Industrial-Digital Revolution. The Status Quo’s intellectual grab-bag consists of 70-year old cults (the Keynesian Cargo Cult of Paul Krugman et al.) that have visibly failed and tired throwbacks to 1950: if only corporations weren’t global, and if only capital wasn’t mobile and if only the central state taxed us even more and borrowed and spent more… \\nThese 1945 ideas cannot possibly succeed in the Industrial-Digital Revolution’s mode of production . But both political parties, the Ruling Elites and the Establishment they dominate have no idea of how to manage this radically transformative mode of production . They are a clueless herd trampling the non-elites as they rush headlong over the cliff. \\n(I cover this emerging economy in The Nearly Free University and the Emerging Economy and Get a Job, Build a Real Career and Defy a Bewildering Economy , and sketch a new systemic approach in A Radically Beneficial World: Automation, Technology & Creating Jobs for All .) \\nNo leader can stop the emergence of a new mode of production . All they can do is engineer a crash by clinging to the expiring mode of production . The leadership of the U.S. sees only one path: further centralization that increases the power of the central state-bank-cartel mode of production . This is the road to ruin, akin to protecting the buggy-whip industry and the Whig Party at all costs. \\nPoliticians aren’t actually leaders. All they can do is give voice to what the people are willing to support, resist needed transformation by supporting a corrupt, sclerotic status quo or introduce the people to a new narrative. \\nSadly, our self-serving Ruling Elite is only capable of resisting needed transformation by supporting a corrupt, sclerotic status quo. A new leadership class that actually understands the new mode of production may eventually emerge, but only after the corrupt, sclerotic status quo has deservedly collapsed under its own weight.'"}, "time": 1742563808.2382405}