{"duration": 0.12214970588684082, "input_args": {"text": "'Ain’t you glad, Little Milton sang, that things don’t talk? Especially our bodies. In the 1960s and ’70s Reader’s Digest printed a series of   essays with titles like “I Am Joe’s Lung. ” These were popular, and weird. In “I Am Joe’s Heart,” this vital organ emoted like a stereotypically aggrieved Jewish mother. “When Joe thinks of me at all, he thinks of me as fragile and delicate. Delicate! When so far in his life I have pumped more than 300, 000 tons of blood?” Some of our organs, this time of year, are beyond speech. Recall the headline in The Onion, the satirical magazine, about a   country singer: “Liver Flees George Jones’ Body. ” James Hamblin’s first book is titled “If Our Bodies Could Talk: A Guide to Operating and Maintaining a Human Body. ” He’s a graduate of Indiana University’s medical school and a senior editor at The Atlantic. His book began its life as an online video series, also called “If Our Bodies Could Talk. ” His   segments are like “The Dr. Oz Show,” if “The Dr. Oz Show” were produced by   quirky interns from public radio’s “This American Life. ” Sadly there are no talking spleens or thyroids or wombs in Mr. Hamblin’s book. Sadly too there is little identifiable soul in it. Its cardinal humors are wan. “If Our Bodies Could Talk” is a numbingly upbeat grab bag of anecdotes and factoids and curiosities with no  . As your literary M. D. I cannot recommend it, except in the tiniest doses. To sit by its bedside for very long is to watch a patient expire. The strangling thing about “If Our Bodies Could Talk” is that someone has told Mr. Hamblin that he’s funny  —   there’s an attempt at a joke in almost every other paragraph  —   but he isn’t actually so, at least not on the page. You recognize his jokes as “humor,” but they don’t make you smile. A typical formulation: “Adrenaline is the hormone that’s meant to be released when we are under stress and need energy, say, to outrun a bear or lift a fallen boulder off our climbing partner. (He’s probably not alive anymore, but it’s worth checking. )” Not abysmal, you might think. But over the course of a long book these pokes in the ribs are monstrously wearing. They’re like having a pebble in your ski boot partway down a long slope, or a lash you can’t remove from your eye. Mr. Hamblin is at his best in “If Our Bodies Could Talk” on those rare occasions when he drops his dementedly amiable tone. Once in a while he goes on the attack against greed and waste and stupidity in health matters, and things pick up. “What is gluten?” “What makes hair curl?” “Do I need eight glasses of water a day?” “Why do males have nipples?” This is the sort of trampled ground that Mr. Hamblin’s book mostly covers. He maintains an interest in offbeat diseases, such as one that makes some people scratch constantly and one that causes the human skin to easily rub off. He dispenses offbeat facts as if they were canapés on a tray. “The average person has about six pounds of skin. ” “People with tattoos are six times more likely to have hepatitis C. ” “We produce 1. 5 liters of saliva a day. ” Then he turns to address the charlatans in the supplements industry, and his blood finally begins to simmer. Suddenly your eyeballs don’t have to be forced to remain on the page. He takes aim at a   1994 law called DSHEA (the Dietary Supplement Health and Education Act) that prevents almost any regulation or safety testing of supplements. Supplements, he writes, is “a meaningless word that refers to nothing so much as a parallel pharmaceutical industry  —   one that has accomplished the spectacular feat of selling billions of dollars’ worth of most anything it likes, in almost any way it chooses, promising people anything conceivable about their bodies. ” You read this patriotic and   riff and realize that, in the bizarro world we occupy, it can’t be long before Lance Armstrong and Barry Bonds are named   of the Food and Drug Administration. Mr. Hamblin is just as good on drinks marketed under names like Smartwater and Vitaminwater and Fruitwater and Electrolyte Water. He quotes a doctor who tells him about Electrolyte Water, which is sold at Whole Foods, “The city water in Philadelphia has more electrolytes. ” (The city water in Philadelphia is notoriously mediocre. In her 1974 novel, “Oreo,” the novelist Fran Ross reminded us that it has long been called, after one of the city’s rivers, Schuylkill Punch.) It’s typical of Mr. Hamblin to step on his riff on dubious water products with a joke that’s D. O. A.: “Don’t drink the Oil Water. It’s for cars. ” We have a   relationship with medical knowledge. It’s so interesting and so terrible. Lucia Berlin, in her brilliant collection of stories, “A Manual for Cleaning Women” (2015) wrote about a nurse who considered the nature of clear colostomy bags and thought: “What if our bodies were transparent, like a washing machine window? How wondrous to watch ourselves. Joggers would jog even harder, blood pumping away. Lovers would love more. God damn! Look at that semen go! Diets would improve. ” Like Little Milton, I’d guess, I’m glad we don’t have that either.'"}, "time": 1742562127.628352}