{"duration": 0.1288771629333496, "input_args": {"text": "'Hillary Clinton’s blistering new assault on Donald J. Trump has mollified many Democrats alarmed about the    presidential race  —   while inflaming Republican fears that Mr. Trump’s improvisational style and skeletal campaign will prove inadequate in repelling the type of attack Mrs. Clinton unleashed on Thursday. Mixing stark warnings that Mr. Trump would imperil America’s security with caustic personal critiques  —   “I’ll leave it to the psychiatrists to explain his affection for tyrants”  —   Mrs. Clinton offered the first indication that she was willing to confront her unconventional opponent in the fashion many in her party believe his candidacy demands. “I thought it was one of the most important speeches Secretary Clinton has made throughout this campaign because it drew a line that for most of this campaign has not been drawn,” said Leon E. Panetta, the former defense secretary, arguing that Mr. Trump had “gotten away with murder” with his incendiary proposals and statements. Mrs. Clinton’s speech in San Diego drove home that “this is not just the fun and games of a primary, but a choice for the American people about who is going to sit in the Oval Office,” Mr. Panetta said. Democrats across the country expressed relief on Friday that Mrs. Clinton had finally delivered a comprehensive indictment of Mr. Trump’s fitness for the presidency. Senator Chris Coons of Delaware said there had been “widespread concern” among Senate Democrats that Mrs. Clinton was not drawing sharp enough contrasts with Mr. Trump. “This speech really did that,” he said. Representative Debbie Dingell, Democrat of Michigan, who was attending the Detroit Chamber of Commerce’s annual retreat on Mackinac Island with many of the state’s most influential leaders, said, “The people up here who were worried about her said she is finally finding her groove. ” For several weeks, Mrs. Clinton had tried out a version of the campaign President Obama ran against Mitt Romney in 2012, portraying Mr. Trump as a heartless corporate titan who profited off the housing crisis and avoided paying taxes. But she was receiving scant news media coverage, and Mrs. Clinton’s advisers worried that voters were not as moved by   attacks against someone who unapologetically boasts about his wealth. After weeks in which Mr. Trump viciously attacked Mrs. Clinton and her husband, former President Bill Clinton, over Mr. Clinton’s indiscretions, moreover, it had become clear that she needed a circuit breaker in the form of a more robust counterassault  —   and one that she could deliver herself, rather than relying on surrogates to deal the most forceful blows to Mr. Trump on her behalf. Her campaign’s decision was to seek to disqualify Mr. Trump on terrain that is Mrs. Clinton’s comfort zone: foreign policy. But billing her San Diego speech on Thursday as a foreign policy address was also something of a ruse: It turned out to be an acidly funny takedown of Mr. Trump and his temperament, giving him the same sort of belittling treatment he had used on his opponents to great effect. “There’s no risk of people losing their lives if you blow up a golf course deal,” Mrs. Clinton said at one point. But as satisfying as her new line of attack was to many Democrats, as Mr. Panetta said, “The real question is going to be, ‘Where does it go from here? ’” Indeed, Mrs. Clinton returned to a familiar stump speech later on Thursday in El Centro, Calif. though on a stop to a campaign office in San Diego, she joked about her new offensive. “I was listing all the reasons why Donald Trump should never get near the White House,” she told volunteers, adding, “And even I was getting nervous. ” If Mrs. Clinton is able to overcome that nervousness and drive a sustained attack echoing her San Diego speech, some Democrats said she could negatively define Mr. Trump this summer the same way that Mr. Clinton managed to define Bob Dole in their 1996 presidential race. “What she did sets the parameters about what this election is about,” said Joe Lockhart, who was Mr. Clinton’s campaign press secretary that year. “It is very hard to change that in the    fight after Labor Day. ” That prospect, in turn, has Republicans deeply concerned about Mr. Trump. Despite being the party’s presumptive nominee for a month, Mr. Trump has yet to adapt his campaign to the demands of a general election. His only “war room” so far is his Twitter feed. He is campaigning in California, insisting that he can win one of the country’s most liberal states. He has spent a week attacking a Hispanic federal judge who is handling a lawsuit against him in increasingly racial terms, only drawing more attention to the case. And he continues to divide his attention: He will travel to Scotland and Ireland this month for a business event. Nor have Mr. Trump’s tactical choices inspired confidence. At a rally on Thursday night in San Jose, Calif. his main rejoinder to Mrs. Clinton’s speech was that she ought to be in jail over her use of a private email account as secretary of state. There was no broader counterattack from his campaign or his allies, a remarkable silence after Mrs. Clinton’s harshest critique yet. “He needs to get the Republican chorus singing for him, and making sure he’s got a lot of voices out there,” said Terry Nelson, a longtime Republican strategist. “He’s got to make sure he is reaching out to the party and letting them know what the message is, what to say and how to say it. ” There is little evidence of any such coordination. His campaign sent out no response to the Clinton speech. The Republican National Committee, on which Mr. Trump’s team has been leaning heavily, issued just one   critique of Mrs. Clinton’s foreign policy before her remarks. His campaign is also badly lagging behind the Democrats at   and there are signs this has affected spending: After a group supporting Mrs. Clinton ran ads last month against Mr. Trump, the Trump team asked about rates for television ads of its own, according to two media buyers apprised of those inquiries, but never followed up. Reached by phone, Mr. Trump addressed such concerns by saying he had proved he could rewrite political playbooks. “I think I’m defining her,” he said of Mrs. Clinton. “I think she’s being defined as a weak and ineffective person. ” Mr. Trump has four top aides who worked on Mr. Dole’s 1996 campaign. But his campaign’s problems already resemble some that plagued Mr. Dole, including a formidable opponent mounting an early offensive, and an undisciplined candidate. Mr. Dole said on Friday that Mr. Trump, whom he has endorsed, had mastered   and commanding media attention like no other recent nominee. But he warned that Mrs. Clinton’s speech signaled a need for Mr. Trump to adjust. “I think Hillary tried laying a groundwork, and I think that’s going to be sort of her template,” Mr. Dole said in an interview. “He has criticism of Hillary, but it’s sort of been scattered. ” Mr. Trump, he added, “has got to catch up. ”'"}, "time": 1742562107.7318845}