{"duration": 0.04825448989868164, "input_args": {"text": "'Little Boy Humiliates Himself With What Sick Liberal Mom Made Him Wear Posted on October 31, 2016 by Amanda Shea in Politics Share This @DebbersGar (left), the woman’s son in humiliating attire (right) \\nWhile all of the other children are showing up to class today dressed as their favorite cartoon characters or superheroes of some kind, an ultra-liberal mother used her son to make a sick statement instead. Too young to understand agendas, the little boy humiliated himself in front of his class, which he will have to live with the rest of the school year. \\nSchool administrators have a responsibility to report it when they feel something is wrong at home, which some would think is probably the case with this boy based on what this twisted woman dressed him as. Instead of being given the choice to be whatever he wants, his seemingly controlling mother convinced him to don what she thought was a pretty cool costume without thinking about the emotional damage it could do to her child. \\nThe liberal mother, who goes by @DebbersGar Â online, was proud that she got her son to dress up as her hero, Hillary Clinton, when she posted his photo online with the description, “Our 8-year-old son is with you @Hillary Clinton, today and every day.” Adding to the realistic nature of the female costume, she grew her boy’s hair out so it could be styled in Hillary’s signature winged bouffant. She completed the androgynous costume with a pantsuit, Hillary campaign pin, and slogan briefcase, then topped it off with a pair of pearlescent girl shoes. The 8-year-old boy dressed as Hillary Clinton in his mother’s post \\nWhile the look is atrocious regardless of gender and has no place in a second-grade classroom, the fact that she more or less forced her son to dress as a woman makes it worse â\\x80\\x94 but it’s par for the course with gender-bending liberals. \\nWhile she made her political point and was clearly proud of it, her son likely sat alone at lunch and played by himself at recess in his yellow woman’s pantsuit, but she’ll blame other people’s “bad” parenting for raising kids who treated her son this way.'"}, "time": 1742561928.0008502}