{"duration": 0.06332969665527344, "input_args": {"text": "'HONG KONG  —   It’s not every day that you get to take a selfie with Mao Zedong’s corpse. So at the fifth edition of Art Basel Hong Kong, which runs through Saturday, spectators were seizing the chance to do just that, posing with an eerily lifelike model of a   Mao on display in a clear coffin. The model was part of the 2009 work “Summit,” by the Chinese artist Shen Shaomin. Arranged beside Mao were several other Communist strongmen: Ho Chi Minh, Kim   Fidel Castro and Vladimir Lenin. The installation, presented by Osage Gallery in the fair’s Encounters section, is a stark reminder that in this perfectly lit bubble of expensive art and Champagne, political realities are never too far away. Ahead of this year’s fair, dealers from the 242 participating galleries had voiced a number of concerns, like the coming election for Hong Kong’s chief executive and the overall global uncertainty stemming from Brexit and last year’s American presidential election. Another issue was the increasing capital controls in China, currently the world’s   art market, according to a new report released by Art Basel and UBS on Wednesday. Over the last year, China’s financial regulators have stepped up scrutiny on foreign exchange transactions and overseas investments by Chinese individuals as part of an effort to stem the depreciation pressure on China’s currency, the renminbi. The growing scrutiny of capital outflows has forced many mainland Chinese collectors to find ways to circumvent the currency controls. And while there continue to be workarounds, it has led some to think twice about their art purchases abroad  —   a worrying development for many Western dealers. “Two years ago, it wasn’t a problem,” said Liu Gang, a collector in Beijing. “But then, last year, I bought $300, 000 of art at the fair and I couldn’t remit directly to the gallery, so I sent renminbi to a friend, who helped me settle it abroad. ” “The value of the renminbi is under pressure,” Mr. Liu added. “It’s hard to predict when the policies will change. ” It’s an issue that many dealers said they were watching, coming into this year’s fair. Marc Glimcher, the president of Pace Gallery, for example, said that opening a new space in Seoul this month to diversify further the gallery’s collector base in Asia was “probably a gut reaction” to that concern. “It’s a tough time in Beijing,” he said. But after just a few hours of brisk   on the floor of the Hong Kong Convention and Exhibition Center on Tuesday, any lingering worries appeared to be temporarily assuaged. “The fair feels strong this year,” said Lieselotte Seaton, sales director at Sadie Coles HQ in London. “I thought the currency controls in China would be a major issue, but it hasn’t been, really, and it certainly hasn’t stopped the Chinese collectors from coming out. ” That may be because in the five years since Art Basel first began in Hong Kong, it has become perhaps the most important annual event on the regional art calendar. While it may not have the star power of Art Basel Miami or the gravitas of Art Basel in Switzerland, dealers and collectors agree: When it comes to Asian art, Art Basel Hong Kong is the place to go. “It’s still the best opportunity to learn and discover new trends and artists in the region,” said the art dealer Jeffrey Deitch. “And every year I always make sure to add on an extra stop like Manila or Shanghai, so I can go deeper into what I’m seeing here. ” The opportunity for learning goes in both directions. For many Asian collectors, Art Basel Hong Kong is also an opportunity to discover Western artists. Local collectors noted that after several years of participating in the fair, the Western galleries had become more confident and more willing to take risks, bringing   masterpieces as well as works by emerging artists. The days of pandering to the perceived tastes of Asian collectors, they said, seemed to be over. “Over all, the Western galleries seem much more poised,” said Adrian Cheng, a prominent Hong Kong collector and the scion of a   real estate and retail empire. “They aren’t fidgeting anymore, like in the first few years they really know what the Asian collectors want. ” By the end of the first day, dealers were reporting strong interest from collectors. Ever the optimists, many noted that, as is typical of the fair here, collectors were taking their time to learn about the artists, putting down reserves and finalizing the purchases later. Nonetheless, the fair had a steady stream of sales. Pace sold a number of works, including a Robert Rauschenberg and a Yoshitomo Nara, each for $2. 5 million. Hauser  Wirth had several   sales, including that of a Frank Auerbach painting that was placed in a Chinese private collection. Sales at the booth shared by Kukje Gallery, from Seoul, and the Tina Kim Gallery, from New York, included two works by Haegue Yang, which each went for $35, 000 to $50, 000. Lisson Gallery sold works by Ryan Gander and Julian Opie, who both have solo shows in China opening this month. At David Zwirner, two paintings by the artist Luc Tuymans, who was at the fair, sold within the first hour of the event for $1. 5 million each. Just across the aisle, as the day wound down, Champagne was being poured at Magician Space of Beijing, which reported a number of sales, including a Wu Chen painting sold to Mr. Cheng, the Hong Kong collector, for over $21, 000, and a video work by the artist Wang Shang for over $11, 000. “It was better than we expected,” said Qu Kejie, of Magician Space. “The pace seemed a lot faster than in past years. All of our sales were made in the first two hours. ” The fair has had strong attendance from representatives of major Western museums like the Asian Art Museum in San Francisco, the Los Angeles County Museum of Art, and the Guggenheim Museum in New York. Exposure to such institutions, said Misa Shin, who runs a gallery in Tokyo, is what makes the fair worthwhile. “The fair attracts not just private collectors, but also important museum people, so you can put on a more challenging, more intellectual show,” Ms. Shin said, gesturing toward her booth, which featured a collection of vintage photographs by the Japanese artist Hikosaka Naoyoshi. But there is no denying the fair’s essentially transactional DNA. “Hong Kong is our best Basel fair,” said Rita Targui, director of STPI Gallery, in Singapore. “In Basel Basel and in Miami Basel, sales are, of course, good, but it’s more about outreach. Here, it’s all about sales. ”'"}, "time": 1742628439.3963206}