{"duration": 0.08417201042175293, "input_args": {"text": "'RIO DE JANEIRO  —   Argentine fans were irrepressible, bouncing up and down and back and forth across the stands, waving flags, imploring their compatriots to jump along, and singing that anyone who did not join the fun was Brazilian. The Brazilians yelled right back, heralding the career goal tally of Pelé, their soccer hero, and crowing about their five World Cup trophies. They made sure, of course, to insult Diego Maradona, Argentina’s own World Cup legend. It was, in many ways, a typical sardonic showdown between fans of the two   South American rivals  —   except it was happening on Wednesday night at a basketball game between Argentina and the United States. After the Americans had scuffled through the final three games of the pool stage, Coach Mike Krzyzewski suggested that the presence in the quarterfinal round of the Argentine fans  —   who had been making so much noise the last two weeks  —   might invigorate his players. Whether it helped or not, the Americans looked lively amid the noise, sauntering to a   win that left the Brazilian fans  —   their sports allies for a night  —   singing in joy. As the seconds ticked off the clock in the blowout, Brazilian fans yelled out “Olé!” to usher the Argentines out of Carioca Arena 1. “We didn’t understand what was going on,” said Paul George, who had 17 points and 8 rebounds and galvanized his team with his defensive effort. “We didn’t know if they were against each other or if they were cheering with each other. ” The Americans will face Spain  —   which steamrollered France,    —   on Friday in the semifinals. “We enjoyed it,” George said. “That’s new to us. We enjoyed being in this atmosphere. ” The Americans, many of them still relatively new to international basketball, had found the vibe at their earlier games a bit odd. The stands at the Olympic arena sit far back from the sidelines. Nonpartisan crowds at certain games did not seem compelled to make much noise. “It’s almost like a golf tournament,” DeMarcus Cousins said this week, gently tapping the fingers on his right hand against the palm of his left. “It’s different. ” The Americans are used to the atmosphere of the N. B. A. with the familiar tableau of the league’s arenas. Sound technicians make sure to quash any threat of silence with thunderous music. Courtside seats creep up along the sidelines, eliminating personal space between players and fans. “You can’t hear as much trash talking as usual,” DeAndre Jordan said about the fans in Rio. On Wednesday, Argentine fans arrived early to spread their jollity inside and around the arena. They belted out the country’s national anthem in full voice. They were eager to scream, and it helped that their team got off to a fast start, jumping out to a   lead in the first quarter. Whenever the United States fans started a chant  —   “  !” or “ !”  —   they were drowned in a torrent of whistles and jeers from the Argentine fans. The local Brazilians, who consider Argentina their big sports rival, did some jeering of their own on the Americans’ behalf. “I’m a huge fan of soccer,” Jordan said. “The fans are engaged in the game. They have chants and cheers and the wave going. It’s cool. ” The decibel level dropped for a spell, though, as the Americans charged back, producing a   scoring run at one point. Halfway through the second quarter, Kyrie Irving displayed his exceptional   skills, stringing together a dizzying sequence of crossovers on Nicolas Laprovittola to create an opening to the rim. Amid the momentary quiet, the Americans made their own fun. In the second quarter, when Kevin Durant (27 points) disassembled Andres Nocioni with a crossover  —   before scoring on a     fadeaway combination  —   the reserves on the American bench popped off their seats and pirouetted with delight. Despite the loss, Argentine fans’ spirits were high. Asked at halftime about the atmosphere, Gerardo Genzano, a fan from Argentina, said, “Argentina has taken over Rio. ” Asked who would win, he changed the subject. “We need more beer,” he said. Durant, who averaged 16. 8 points in the first five games, was unstoppable. He shot 9 for 13 from the field, including 7 for 9 from   range, and added seven rebounds and six assists before sitting for most of the fourth quarter. Durant described the knockout game as a Game 7 and praised his teammates for raising their intensity level. He complimented the outward national pride of the Argentine fans. He said he had heard chants of “  !” rising above the din. “It gave me chills,” he said.'"}, "time": 1742562170.5353062}