{"duration": 0.03797006607055664, "input_args": {"text": "'North Korea Ready for New Missile Launch Within Days November 04, 2016 North Korea Ready for New Missile Launch Within Days \\nNorth Korea is preparing to launch an intermediate-range ballistic missile in the next three days, Fox Business Network reported, citing two unidentified U.S. officials. The communist nation planned the launch for between 24 and 72 hours, the cable network reported. It would be the latest in a series of launches by the isolated country this year in violation of U.N. Security Council resolutions, supported by China, that ban all ballistic missile-related activities by the North. North Korea, which is under U.N. and other international sanctions for its nuclear and missile programs, has conducted repeated missile tests this year, the most recent on Oct. 20. That latest test, believed to be an intermediate-range Musudan, failed immediately after launch, the U.S. and South Korean militaries said. It came in spite of the threat of further U.N. sanctions under discussion. The failed launch was the eighth attempt in seven months by North Korea to launch a weapon with a design range of 3,000 km (1,800 miles) that can be fired from road mobile launchers, the U.S. and South Korean militaries said. \\nNews of that launch came during the third and final debate for the Nov. 8 U.S. presidential election. \\nA study published last month by a U.S.-based North Korea research project said North Korean missile and nuclear tests and other major \"provocations\" had clustered increasingly closer to U.S. elections. \\nREAD MORE: COALITION NATIONS SEEK TO PUT NORTH KOREA IN A VISE \\nWashington\\'s Center for Strategic and International Studies said the trend also suggested the possibility of an act during the December transition period for the next U.S. administration. \\nNorth Korea conducted its first nuclear test in 2006 and has since defied U.N. sanctions to press ahead with the development of the weapons and missiles to carry them, which it says it needs for defense. \\nIt carried out its fourth nuclear test in January and fifth and largest on Sept. 9. Article by Doc Burkhart , Vice-President, General Manager and co-host of TRUNEWS with Rick Wiles Got a news tip? Email us at Help support the ministry of TRUNEWS with your one-time or monthly gift of financial support. DONATE NOW ! DOWNLOAD THE TRUNEWS MOBILE APP! CLICK HERE! Donate Today! Support TRUNEWS to help build a global news network that provides a credible source for world news \\nWe believe Christians need and deserve their own global news network to keep the worldwide Church informed, and to offer Christians a positive alternative to the anti-Christian bigotry of the mainstream news media Top Stories'"}, "time": 1742563484.3132012}