{"duration": 0.05272269248962402, "input_args": {"text": "'This post was originally published on this site \\nsott.net/news \\n© Natalia Kolesnikova / Reuters \\nRussian President Vladimir Putin has commented on the recent win of France’s Francois Fillon in the first round of the center-right party’s presidential primary, saying that his “personal relations” with Fillon have shown the politician to be a “decent man.” \\n“We worked together with Francois when he headed the French government, and I chaired the [Russian] government … we had a lot of meetings, and have developed certain personal relations, very kind ones,” Putin told reporters on Wednesday. \\nThe French presidential hopeful, whose convincing win in the Sunday primary took many by surprise, is “very much different” from world politicians, Putin said. \\nHaving characterized Fillon as a “closed up, non-public” person “at first sight,” the Russian leader said that his possible French counterpart “can be very tough in standing up for his point of view.” \\n“He’s a tough negotiator,” Putin said, adding that Fillon is “certainly an ultimate professional, and a decent man.” \\nThe Russian president also pointed out that although he had no experience of working with Fillon’s rival in the Republican party, another ex-prime minister Alain Juppe, he “welcomes” both candidates’ rhetoric with regards to Russia. \\nSaying that both Fillon and Juppe have mentioned their plans “to restore Russian-French relations on a full scale,” Putin said that Moscow would facilitate the process on its part. \\nAfter Francois Fillon, who served as prime minister in Nicolas Sarkozy’s government from 2007 until 2012, won the first primary, French media labeled the unexpected presidential hopeful as “Vladimir Putin’s friend.” Citing the two politicians’ meetings on previous occasions, the media said the French politician “advocated a conciliatory position towards the Russia of Vladimir Putin” and compared his victory to the outcome of the recent presidential elections in the US. \\nAfter France’s ex-president Nicolas Sarkozy was thrown out of the race to be the French conservative nominee, he said he would back Fillon in the runoff. On November 27, Francois Fillon will face Alain Juppe in the Republicans’ second primary, which is widely believed to produce France’s next president in May elections. Related '"}, "time": 1742563643.202666}