{"duration": 0.04649043083190918, "input_args": {"text": "'Pinterest \\nClown-phobia has reached its boiling point. \\nFueled by a media frenzy, the American people Americans are now more afraid of “clowns” than climate change. \\nThe poll shows that America’s top fears now include being attacked by clowns. \\nAnd nitwits who are hell-bent on terrorizing people know that. \\nThis is where our story turns to 20-year-old Sadiq Mohammad. He thought it would be hilarious to dress up as a clown and scare people, film it and post it on his YouTube page, which has been viewed over 6.7 million times. “People love comedy,” Mohammad said.” \\nWell, not everyone. \\nBecause at least one of his “victims” was having none of it. \\nThe Stockton, California, resident was pranking people all day on Monday … he had a run-in with some folks at a Taco Bell drive-through, ran after a kid playing basketball and chased some men carrying a saw. \\nHilarious, right? \\nFor his next prank, he hid behind a bush … a man was walking down the sidewalk, minding his own business. \\nWhen Mohammad jumped out, well … you’ve got to see it: \\nWMC Action News 5 – Memphis, Tennessee \\nThe man hit him with his gun. \\n“When that thing hit me, I was literally like oh dang, it’s a prank it’s a joke, it’s a camera right there,” Sadiq said, telling a reporter he was almost afraid to run. \\n“Yeah. I seen the gun and if I didn’t tell him it was a prank if I wouldn’t have run I felt like he would have shot me.” \\nSacramento attorney Kresta Daly says people have self-defense rights, WMCActionNews5.com is reporting . \\n“So, a person has the right to defend themselves using reasonable force,” she said. “It’s probably not reasonable to pull a gun.” \\nThat’s because in the video the man starts telling him the prank is not funny and then pulls out his gun. \\n“By the time the clown is saying it’s a prank and you know, trying to get away and visibly being very scared, the threat has ended and the right to self-defense ends when the threat ends,” she said. \\nSadiq and his camera man took off running and never looked back. \\nWhat is the lesson learned? \\n“Lesson learned is like people don’t play with the clown stuff,” he said. “Like, people really will shoot anybody.” \\nThis lucky clown is now hanging up his costume for good.'"}, "time": 1742561963.919329}