{"duration": 0.041805267333984375, "input_args": {"text": "'CNN published an article and video about Breitbart Senior editor MILO Thursday which associated MILO with the   and “white nationalist” and “ ” activists despite his explicit rejection of them. [In a video piece accompanying an article headlined, “Milo Yiannopoulos is trying to convince colleges that hate speech is cool,” CNN states that MILO is on a mission to “take on the liberal college establishment, and he’s not the only one” before cutting to an interview with white nationalist Nathan Damigo. The video then shows clips from white nationalist Richard Spencer’s rallies and claims that Spencer’s planned college tour is inspired directly by MILO.  “Why are you seeking to associate me with these people?” MILO asked the CNN interviewer, who replied, “They associate themselves with you. ” “What you are seeking to do, by associating me with people who have odious and disgusting opinions, is suggest that I somehow in some way tacitly enable these people,” MILO replied. “I don’t. I don’t have unsavory opinions about skin color. F*ck you. ” CNN asked some of the students that invited MILO to UC Berkeley about their opinion on what MILO is doing in trying to “take down the ivory tower” of   college campuses, “they’re finally learning from the Democrats. ” One student added, “it’s been years and years that they’ve controlled the university. ” Unlike the protesters at UC Berkeley, MILO has stated multiple times that skin colour and race do not matter, ideas and values do. Last week while speaking at UC Colorado Springs, MILO explicitly denounced racism: “White pride, white nationalism, white supremacy isn’t the way to go,” he continued. “The way to go is reminding them and yourselves that you should be aspiring to values and to ideas. ” “You should be focusing on what unites people and not what drives them apart,” MILO concluded. “You shouldn’t give a shit about skin color, a shit about sexuality  …     You shouldn’t give a shit about gender, and you should be deeply suspicious of the people who do. ” CNN did not include those statements in their story, but they were sure to include this analysis from the   League’s Oren Segal: “Whether Milo considers himself actually   or not, clearly those who represent the   see what he’s doing as an opportunity for them as well. ”'"}, "time": 1742562767.5905678}