{"duration": 0.10917997360229492, "input_args": {"text": "'Trump Avoids Facts Again: Wind Energy Won’t Kill ‘All The Birds’ (VIDEO) By Karen Shiebler on October 27, 2016 Subscribe \\nThe Republican presidential candidate continues to prove himself too uninformed to be President of these United States. \\nIn his latest attack on the facts, Republican hopeful Donald Trump went on a rant against renewable energy. As is so typical for the shallow conservative, he seized the handiest and easiest idea to sell his argument. \\nIn essence, Donald Trump says that we can’t have wind power because it kills all the birds. \\nAll the birds. Killed by wind turbines. \\nTrump was particularly worried about the fate of the eagles. Of course he was. The eagle, the symbol of America. The easiest way to tug on the heartstrings on the uninformed is to threaten the very symbol of our nation. So he did. He claimed that “thousands” of eagles are killed in California by wind energy. \\nTrump appeared on a radio show the other day with Republican has-been Herman Cain. He said : “[Wind power] kills all the birds. Thousands of birds are lying on the ground. And the eagle. You know, certain parts of California — they’ve killed so many eagles. You know, they put you in jail if you kill an eagle. And yet these windmills [kill] them by the hundreds.” \\nWhat an image! Hundreds of dead American eagles, all slaughtered by wind turbines. \\nAnd in keeping with the unapologetic shallowness of his position, Trump went on to complain that wind turbines are unattractive. There is no insult in Trump world more powerful than “ugly”. Here are Donald Trump\\'s views on wind power, and Disneyland: https://t.co/mphn1qSbGU pic.twitter.com/ja1j6wltBx \\n— Daniel Dale (@ddale8) October 26, 2016 \\nSo wind energy is ugly, inefficient and it kills all of those wonderful noble eagles. \\nExcept that NONE of that is true. None of it. \\nHere is the truth, not that it will matter to the fact averse Donald Trump. \\nWhile it is true that many birds are killed by wind turbines (up to 368,000 annually), that figure looks low when compared to the number of birds killed by cell towers each year (6.8 million). \\nThe biggest killer of birds is….are you ready? Cats. Cats kill up to 3.7 billion birds a year. \\nAs for those eagles? The U.S. Fish and Wildlife Service says that two eagles were killed by wind turbines in Palm Springs since 1997. \\nTrump’s rant seems even more deceitful when we consider the fact that climate change is the greatest threat to birds in the world. The Audubon Society says that up to half of the bird species on earth are threatened by rising global temperatures. \\nDonald Trump appears to be incapable of understanding or accepting reality. He says that climate change is a hoax created by China. He claims that wind turbines are killing “all the birds.” He mourns the loss of hundreds of eagles who haven’t died. \\nWhatever it is that he wants to be true is what he believes to be true. \\nHe is delusional. He is dangerous. He has to be stopped. \\nFeatured image by RichardGHawley via Flickr . Available through Creative Commons Attribution No-Derivs Generic license 2.0 About Karen Shiebler \\nKaren is a retired elementary school teacher with many years of progressive activism behind her. She is the proud mother of three young adults who were all arrested with Occupy Wall Street. To see what she writes about in her spare time, check out her blog at \"Empty Nest, Full Life\" Connect'"}, "time": 1742564433.3929577}