{"duration": 0.0493009090423584, "input_args": {"text": "'Date: 2015-12-20 17:26 Subject: Last night Hi John, I wanted to reach out to say thanks for the principled and nuanced stance the Secretary took last night on encryption and the tech sector. Leadership at Apple certainly noticed and I am sure that is true though out the Valley. Please know that Apple will continue its work with law enforcement. We share law enforcement\\'s concerns about the threat to citizens and we work closely with authorities to comply with legal requests for data that have helped solve complex crimes. Thousands of times every month, we give governments information about Apple customers and devices, in response to warrants and other forms of legal process. We have a team that responds to those requests 24 hours a day. Strong encryption does not eliminate Apple\\'s ability to give law enforcement meta-data or any of a number of other very useful categories of data. Tonight, Tim and Apple will be featured on \"60 Minutes.\" We expect encryption and taxes to be covered. In previews, Tim reacts strongly to the EU tax investigation of Apple and other American companies. We will amplify encryption messaging tomorrow when we publicly release our comments on the draft UK Investigatory Powers bill. Best wishes to you and your family and the HRC family for a peaceful and joyous holiday season and a prosperous and bright 2016. Lisa Her comments about handing over data to the government are in marked contrast to the strong pro-customer statement on encryption made by Apple chief executive Tim Cook earlier this year when the FBI demanded that Apple hand over data on an Apple iPhone 5C belonging to one of the two people who participated in a terrorist attack in San Bernardino, California. Jackson was referring to comments made by Hillary Clinton during the third debate between candidates for the Democratic presidential nomination. The email was released by WikiLeaks which has gained access to a trove of correspondence from Podesta\\'s Gmail account. In that debate , Clinton was asked: \"You\\'ve talked a lot about bringing tech leaders and government officials together, but Apple CEO Tim Cook said removing encryption tools from our products altogether would only hurt law-abiding citizens who rely on us to protect their data. So would you force him to give law enforcement a key to encrypted technology by making it law?\" Her response was: \"I would not want to go to that point. I would hope that, given the extraordinary capacities that the tech community has and the legitimate needs and questions from law enforcement, that there could be a Manhattan-like project, something that would bring the government and the tech communities together to see they\\'re not adversaries, they\\'ve got to be partners.\" On 2 December 2015, two terrorists shot and killed 14 people and injured 22 others in San Bernardino. Early this year, there was a pitched battle between the FBI and Apple over a demand by the former that data on an iPhone 5C be handed over to law enforcement authorities. The issue went to court and the FBI finally backed down . Jackson wrote, in what appears to be an effort to stay in the Democrats\\' good books, \"Please know that Apple will continue its work with law enforcement. We share law enforcement\\'s concerns about the threat to citizens and we work closely with authorities to comply with legal requests for data that have helped solve complex crimes. \" Thousands of times every month, we give governments information about Apple customers and devices, in response to warrants and other forms of legal process. We have a team that responds to those requests 24 hours a day. Strong encryption does not eliminate Apple\\'s ability to give law enforcement meta-data or any of a number of other very useful categories of data.\" She concluded: \"Tonight, (Apple chief executive) Tim (Cook) and Apple will be featured on \\'60 Minutes\\'. We expect encryption and taxes to be covered. In previews, Tim reacts strongly to the EU tax investigation of Apple and other American companies. We will amplify encryption messaging tomorrow when we publicly release our comments on the draft UK Investigatory Powers bill.\" Comment: Here we go again, rampant hypocrisy, this time from Apple. Just like Killary, Apple has a public and a private position. The public position for the gullible sleeping consumer \"we care about your privacy, hence our encryption\" The other for the government \"don\\'t worry we can give you whatever you want.\" And you would never have known if not for the WikiLeaks emails.'"}, "time": 1742628439.651524}