{"duration": 0.06634998321533203, "input_args": {"text": "'| October 29, 2016 at 10:52 am | Reply \\nThe Great Climate Change Bamboozle \\n“The whole aim of practical politics is to keep the populace alarmed (and hence clamorous to be led to safety) by menacing it with an endless series of hobgoblins, all of them imaginary.” H. L. Mencken \\nEarth’s carbon cycle contains 46,713 Gt (E15 gr) +/- 850 Gt (+/- 1.8%) of stores and reservoirs with a couple hundred fluxes Gt/y (+/- ??) flowing among those reservoirs. Mankind’s gross contribution over 260 years was 555 Gt or 1.2%. (IPCC AR5 Fig 6.1) Mankind’s net contribution, 240 Gt or 0.53%, (dry labbed by IPCC to make the numbers work) to this bubbling, churning caldron of carbon/carbon dioxide is 4 Gt/y +/- 96%. (IPCC AR5 Table 6.1) Seems relatively trivial to me. IPCC et. al. says natural variations can’t explain the increase in CO2. With these tiny percentages and high levels of uncertainty how would anybody even know? \\nMankind’s modelled additional atmospheric CO2 power flux (W/m^2, watt is power, energy over time) between 1750 and 2011, 261 years, is 2 W/m^2 of radiative forcing. (IPCC AR5 Fig SPM.5) Incoming solar RF is 340 W/m^2, albedo reflects 100 W/m^2 (+/- 30 & can’t be part of the 333), 160 W/m^2 reaches the surface (can’t be part of the 333), latent heat from the water cycle’s evaporation is 88 W/m2 (+/- 8). Mankind’s 2 W/m^2 contribution is obviously trivial, lost in the natural fluctuations. \\nOne popular GHE theory power flux balance (“Atmospheric Moisture…. Trenberth et al 2011jcli24 Figure 10) has a spontaneous perpetual loop (333 W/m^2) flowing from cold to hot violating three fundamental thermodynamic laws. (1. Spontaneous energy out of nowhere, 2. perpetual loop w/o work, 3. cold to hot w/o work, 4. doesn’t matter because what’s in the system stays in the system) Physics must be optional for “climate” science. What really counts is the net W/m^2 balance at ToA which 7 out of 8 re-analyses included in the above cited paper concluded the atmosphere was cooling, not warming (+/- 12.3 W/m^2). Of course Dr. Trenberth says they are wrong because their cooling results are not confirmed by his predicted warming, which hasn’t happened for twenty years. (“All of the net TOA imbalances are not tenable and all except CFSR imply a cooling of the planet that clearly has not occurred.”) \\nEvery year the pause/hiatus/lull/stasis continues (IPCC AR5 Box TS.3) IPCC’s atmospheric and ocean general circulation models diverge further from reality. \\nAs Carl Sagan observed, we have been bamboozled, hustled, conned by those wishing to steal our money and rob us of our liberties. Hardly a new agenda. \\nBTW I have a BSME same as Bill Nye so I’m as much a scientist as he is.'"}, "time": 1742564315.4167051}