{"duration": 0.11833405494689941, "input_args": {"text": "'  …    Is because he has a very powerful bullshit detector. We know this thanks to a fascinating and unwittingly revelatory article in the German newspaper Der Spiegel.[    The paper reveals how, in the days running up to President Trump’s decision to quit the UN Paris accord, he received a series of deputations from EU leaders urging him to change his mind. “For me it’s easier to stay in than step out,” Trump told them. This is perfectly true. Since his momentous Rose Garden speech announcing his plans to pull out of Paris, Trump has taken more flak than a   raid over Berlin in ’44. He has upset his daughter Ivanka, his Secretary of State Rex Tillerson, his financial advisor Gary Cohn. On top of that, he has given the entire liberal half of the planet, plus sundry conservative squishes, the perfect excuse they needed to dismiss him as a   loon in thrall to Big Oil, Big Coal, Big Evil, etc  …     If Trump pulls the US out of the #ParisAgreement he will be committing a traitorous act of war against the American people. My statement: pic. twitter.   —   Tom Steyer (@TomSteyer) May 29, 2017,  USA to Earth: FUCK YOU,  —   Michael Moore (@MMFlint) June 1, 2017,  Am departing presidential councils. Climate change is real. Leaving Paris is not good for America or the world.  —   Elon Musk (@elonmusk) June 1, 2017,  So what was it that tipped Trump over the edge? Well sure, as he made clear in his brilliant White House speech, it was about American jobs. But while I’ve no doubt that that fact provided the rational basis for his bold, principled decision, I think we can look elsewhere for the tipping point. And here it is, in black and white, in Der Spiegel‘s account of how the G7 leaders tried to badger Trump at the summit in Taormina, Sicily. Leaders of the world’s seven most powerful economies were gathered around the table and the issues under discussion were the global economy and sustainable development. The newly elected French president, Emmanuel Macron, went first. It makes sense that the Frenchman would defend the international treaty that bears the name of France’s capital: The Paris Agreement. “Climate change is real and it affects the poorest countries,” Macron said. Then, Canadian Prime Minister Justin Trudeau reminded the U. S. president how successful the fight against the ozone hole had been and how it had been possible to convince industry leaders to reduce emissions of the harmful gas. Finally, it was Merkel’s turn. Renewable energies, said the chancellor, present significant economic opportunities. “If the world’s largest economic power were to pull out, the field would be left to the Chinese,” she warned. Xi Jinping is clever, she added, and would take advantage of the vacuum it created. Even the Saudis were preparing for the   era, she continued, and saving energy is also a worthwhile goal for the economy for many other reasons, not just because of climate change. At which point, Trump’s bullshit detector must have been bleeping off the scale. Let’s examine those arguments, one by one. First, Mummy’s Boy Macron’s line that “Climate change is real and it affects the poorest countries. ” The first half is trivially true: climate has indeed been changing for the 4. 5 billion years of the planet’s existence. But the notion that recent climate change is catastrophic, unprecedented and significantly   is a shaky theory, not a proven fact. And in any case it is beside the point. Even supposing that climate change is all those things, it doesn’t alter the fact that Paris is a pointless waste of money, especially for countries like the U. S. which are expected to bear the burden of the cost. As Bjorn Lomborg has calculated, using the alarmists’ own models and data, if every signatory nation sticks to Paris then the effect will be to reduce global warming by 0. 17 degrees C by 2100. At a cost in excess of $100 trillion. As for the “affects the poorest countries” part  —   even if this is true, there are better ways of helping poor countries than bombing the U. S. economy to the dark ages. Like, promoting a flourishing economy which yields more to spend on foreign aid. Next, Canadian Prime Minister Bieber on the Ozone Layer. As Matt Ridley shows in some detail here, the vanishing ‘ozone layer’ is more or less an urban myth trotted out by environmentalists mainly to justify their insatiable advocacy of     . For reasons I will explain, this news deserves to be taken with a large pinch of salt. You do not have to dig far to find evidence that the ozone hole was never nearly as dangerous as some people said, that it is not necessarily healing yet and that it might not have been caused mainly by CFCs anyway. The timing of the announcement was plainly political: it came on the 25th anniversary of the treaty, and just before a big United Nations climate conference in New York, the aim of which is to push for a climate treaty modelled on the ozone one. See how these memes get repeated, over and over again, as memes are? That piece was from 2014. You can lay money that it won’t be the last time some environmentalist or politician brings it up to “prove” that concerted intergovernmental legislation works because it “healed the ozone layer. ” Finally, the Mutti of all Globalists herself, Mrs Merkel. “Renewable energies, said the chancellor, present significant economic opportunities. ” Yes, I suppose they do, if like Elon Musk you’ve got your snout buried deep in the subsidies trough, or like Warren Buffett you like to profit off the tax credits  or like wind and solar developers everywhere you just don’t care about the bats and birds sliced and diced, the countryside spoiled and the people who have their sleep disturbed and their property values trashed. But strip away the subsidies and the green lies and renewables make no economic or environmental sense at all. As for the green Chinese. The green Chinese are laughing at us. As, by the way, are the Indians. And here’s why  …     Now do you see what I mean? President Trump pulled out of Paris for a lot of sensible reasons. But the one that tipped him over the edge was quite simply this: when you’ve got your fellow leaders of the free world insulting you with arguments you know to be bullshit and treating you like you’re some kind of an idiot, well suddenly it all becomes crystal clear what you’ve gotta do  …     You call those charlatans’ bluff and remember why it was that people voted you to be President of the U. S. A: because they wanted someone real doing the job, for a change, and not yet another of those charlatans  …    '"}, "time": 1742562007.909529}