{"duration": 0.08197879791259766, "input_args": {"text": "'The Department of Justice unsealed a complaint against a journalist who made national headlines for fabricating stories after he allegedly conducted a campaign of harassment against at least eight Jewish community centers while cyberstalking his   on Friday. [The FBI arrested Juan Thompson in St. Louis on Friday, and he’s due to appear in court in Manhattan. Thompson’s arrest is the first since Jewish community centers and schools were targeted for threats and harassment across the country.  “Together with the FBI and the NYPD, we have been investigating the recent threats made on Jewish Community Centers in New York and around the country,” said U. S. Attorney Preet Bharara said in a statement. “Today, we have charged Juan Thompson with allegedly stalking a former romantic interest by, among other things, making bomb threats in her name to Jewish Community Centers and to the   League. ” “Thompson’s alleged pattern of harassment not only involved the defamation of his female victim, but his threats intimidated an entire community,” added FBI Assistant    William F. Sweeney Jr. in the statement. This isn’t the first time Thompson has appeared in headlines. Last February, The Intercept revealed he fabricated sources in stories and made up quotes out of whole cloth. When confronted about this egregious breach of journalistic standards, he blamed racism and “testicular cancer” in a letter sent to the Intercept’s    and the   Gawker. “I’ve been undergoing radiation treatment for testicular cancer and, since I no longer have health insurance, I’ve been feverishly struggling and figuring out how to pay for my treatment. All of this, of course, has taken up my time and energy except for the few moments I’ve spent searching for some relief,” Thompson said, adding: “I lack access to my notebooks (which I took for most stories) to address these matters. ” “I had a habit of writing drafts of stories, placing the names of ppl I wanted to get quotes from in there, and then going to fetch the quotes,” he continued in his letter. “Was it sloppy? Yes? But I’m a cub reporter and expected a sustained and competent editor to guide me, something which I never had at your company and something with which The Intercept continues to struggle as everyone in this business knows. ” Thompson blamed the “Great Problem” of “white media organizations” for failing to understand his approach to journalism: If I couldn’t obtain a quote from the person I wanted, I went somewhere else, and must’ve forgot to change the names —  clearly. Also, yes I encouraged some of my interviewees to use another name they’re poor black people who didn’t want their names in the public given the situations and that was the only was of convincing them otherwise. That also explains why some of them didn’t want to talk with your company’s research team or denied the events. These weren’t articles in Harpers or The Nation. Instead, these are the lives of people forgotten by society and their being in public and talking to white, NY people, no less, could harm and turn them off. They’ve lost loved ones to violence you and others couldn’t possibly imagine. Ultimately, the journalism that covers the experiences of poor black folk and the journalism others, such as you and First Look, are used to differs drastically. This dilemma is the Great Problem with the white media organizations that dominate our media landscape. As   Coates wrote: “The standard [white] progressive approach of the moment is to mix   moral invective with   public policy. ” Such an approach ignores the differences in the way we must navigate these various fields: including journalism. The Intercept published an apology after discovering three of Thompson’s fake news reporting while he worked from November 2014 to January 2016 for them. “Thompson went to great lengths to deceive his editors, creating an email account to impersonate a source and lying about his reporting methods,” the letter said. In one fake news story that went viral, Thompson made up a fictional source called “Scott Roof,” a   cousin of   Dylann Roof’s, who claimed Roof slaughtered nine black parishioners after “he kind of went over the edge when a girl he liked starting dating a black guy two years back. ” Thompson’s Twitter account also reveals he supported socialist Vermont Sen. Bernie Sanders for president. “I voted for Bernie Sanders, but his supporters are annoying as fuck. ‘I almost cried when I got a Bernie sign’. Yuck,” he tweeted in July. This puts Sanders in an awkward position. Only days before Thompson’s arrest, he told J Street: “I hope very much that President Trump and his political adviser Mr. Bannon understand that the entire world is watching, that it is imperative that their voices be loud and clear in condemning  . ” Thompson posted many harassing messages about his  . “Two wks ago it was a visit from the FBI. Right now the Secret Service. This racist white garbage [omitted] is trash,” read one tweet. “. @SecretService [My  ] has made death threats against Trump. And talked about how she wanted to kill him and his kids. Look at her,” Thompson continued on Twitter, before tweeting at Secret Service that she made threats against the president. “. @SecretService [Omitted] a disgusting nasty racist white woman, who filed a false lie against me, has threatened to kill Trump. ” “The @SecretService visited me looked at my tweets, questioned my politics   some awful white woman I date reported me. I won’t be silenced,” he continued. “Y’all know how to get a social worker in NY barred? I’m being stalked and harassed by a white nasty white woman  …     in NYC. ” Thompson also pinned a tweet with a   rant against the victim, adding: “Know any good lawyers? Need to stop this   #whitegirl I dated who sent a bomb threat in my name  wants me to be raped in jail. ” The Twitter account was verified as Thompson’s by the U. S. Attorney’s Office in New York.'"}, "time": 1742562273.8218029}