{"duration": 0.12383747100830078, "input_args": {"text": "'She calls it the “  clause. ” When Sahar Kian needed a new roommate for the home she shares near Georgetown University, she did what many young people here do: She took out an ad on Craigslist and then set down a few ground rules. “Alcohol, pets and meat products are not allowed in the house,” Ms. Kian wrote. “Neither are Trump supporters,” she added. Ms. Kian, 23, is not the first person to add such a clause to a quest for a roommate. A steady trickle of posts like hers have shown up, one or two at a time, on Craigslist since President Trump was inaugurated on Jan. 20. As anyone who has started out in the Washington area with few contacts and an   salary knows, finding a roommate (or three) to share a high rent is common practice. The median cost for a   apartment is around $1, 990 a month, according to Zumper, a rental aggregator. But for some, it’s becoming more important to make sure that political views align before they split the cost with a stranger. On Twitter, Reddit and Craigslist and in Facebook groups, people have been screening for Trump supporters since at least last fall. Such ads, more than a dozen of which have been posted on Craigslist since Inauguration Day, are only a tiny fraction of the thousands of posts on the site, but they nonetheless represent a small act of defiance in an area that heavily favored Hillary Clinton and where residents have remained politically active since the election. “I can’t live with someone who supports a ‘leader’ with those types of ideals,” Jessica, 32, a teacher who did not want her last name used because she feared harassment online, wrote in an email. She posted an ad on Craiglist for a room share shortly after the inauguration. “I feel like I’m going to a protest every single day. ” In one recent ad, a couple in the area who identified themselves as “ ” and liberal advertised a $500 room in their home: “If you’re racist, sexist, homophobic or a Trump supporter please don’t respond. We won’t get along. ” In another, two women in their 20s were searching for a roommate to take over a   room in their Columbia Heights apartment for $550. The women detailed their love of happy hours, a “good Netflix sesh,” pho and tacos. “We’re open to any    ” they added, “so long as you didn’t vote for Trump. In the same neighborhood, a woman posted an ad searching for someone to take over her room: “Trump supporters this is not the house for you (no, seriously),” she wrote. For her part, Ms. Kian, who works at Amideast, a nonprofit that focuses on educational opportunities for Middle Eastern and African students, is fine with taking the extra step to make sure her political filter extends to her home. Ms. Kian, who has American and Iranian citizenship and was raised Muslim, said the idea of the   clause started out as a joke. But it grew serious, she said, after the president signed an executive order that barred people from seven predominantly Muslim countries from entering the United States. “Anybody who is on board with that kind of thinking is not welcome,” she said. Whoever ends up living with her will pay $1, 300 to share the top floor of the house. (Her parents live downstairs.) People who support Mr. Trump, she said, would not be interested in living in her “raging liberal” house. “Frankly, it would not work out,” Ms. Kian said in an interview. “That person would not be comfortable here because we bash Trump nightly. ” People like Ms. Kian may be closing themselves off to others, but their actions are legal, according to Sheila C. Salmon, a Washington lawyer who specializes in housing law. Political views are not protected under the Fair Housing Act, which prohibits discrimination based on such factors as race, religion, national origin and disability. “I don’t see anything illegal about it,” Ms. Salmon said. “It’s like saying you don’t want any nonsmokers. ” Washington has a set of expanded protections that include political affiliation, but Ms. Salmon said it was unclear whether a person’s support of Mr. Trump would fall into this category. “Would it truly be rejection or discrimination on political affiliation?” she said. “I think there’s a reasonable argument to be made that it’s not. ” Kevin Kemp, 29, who works in advertising at Education Week, is another resident who is screening out Trump supporters. Mr. Kemp said he used to subtly gauge the politics of potential roommates by making jokes and seeing how they responded. But about a month ago, when he was searching for a roommate to share a   apartment in Silver Spring, Md. he found himself going a step further as he drafted a post on Reddit. “Please no Imperial Sympathizers, Borg, Vogons, Lannisters (some exceptions) Sith or Trump supporters,” he wrote in a post for a roommate, invoking some of fiction’s most notorious villains. His joke, he said, reflected a deeper frustration. “As a black man, Black Lives Matter is sort of important to me,” he said. “And Trump supporters aren’t known for their fondness of that movement. ” On the other end of the spectrum, people who identify as conservative and support Mr. Trump are navigating difficult terrain. Cole Lyle, a Marine veteran who recently moved here to lobby for funding to provide wounded veterans with service dogs, is using Craigslist and    among his friends to find roommates. He said he was open to living with anyone, but added that the pool of potential roommates who share his political beliefs was small. “D. C. is a small town,” Mr. Lyle said. “Republican D. C. is a smaller town, and conservative Republican D. C. is tiny. ” Mr. Lyle, 27, a former intern with the conservative Heritage Foundation, is for the moment staying in the think tank’s intern residence. He said that he hoped that he and his service dog, Kaya, would eventually live in a place where he could find common ground with someone  —   “dogs are the key to bipartisanship”  —   but that he did not want to live with anyone who would reject him because of his political views. “If somebody’s going to put that in an ad, they’re not the type of person I’d want to associate with,” he said. “If someone said, ‘I will not live with a liberal,’ I would probably be equally as likely not to engage with that person. ” But Ms. Kian, who has lived in Washington only since the Obama era, said she was likely to keep screening out Trump supporters. “I’m not quite sure what this city is going to look like,” Ms. Kian said. “That’s even more reason for me to keep that   supporters clause in there. ”'"}, "time": 1742563259.8663013}