{"duration": 0.015918493270874023, "input_args": {"text": "'As Aging Population Increases, Elders and Allies Fight for Social Supports As Aging Population Increases, Elders and Allies Fight for Social Supports By Support your favorite writers by making sure we can keep publishing them! Make a donation to Truthout to ensure independent journalism survives. \\nAccording to a spring 2016 report released by the Older Women’s League , men in the top 1 percent live 15 years longer than those in the bottom 1 percent. The gap for women is 10 years. And it’s getting worse. As the league’s annual study, “ Aging in Community ,” notes, “The inequality of life spans between rich and poor has widened from 2001 to 2014.” \\nThe result? By the time folks reach age 75, 6.7 percent of men and 12.3 percent of women live below the poverty line: $11,880 for a single person and $16,020 for a household of two. Gender, of course, is a key variable: Women earn, on average, a lower annual income — typically caused by wage disparities as well as breaks in employment to rear children — resulting in smaller monthly Social Security checks. This is no small thing since a lower income impacts everything from access to health care to the ability to secure decent, affordable housing and nutritious food. \\nRace also impacts income, causing many Black and Brown seniors to live in poverty. The federal Administration on Aging reports that in 2013 poverty among the elderly impacted 19.2 percent African Americans; 18.1 percent of Latino and Latinas; 14.7 percent of Asian Americans; and 7.8 percent of whites aged 65 or older. Indigenous seniors have it even worse. Although Indigenous people make up just .05 percent of those over 65 , a full 42 percent of tribal seniors are impoverished. \\nIndeed, the collision between poverty and aging is a problem of startling magnitude. It’s also more complicated than it seems, thanks to the rapid aging of the US population. For one, since 1900, the percentage of Americans aged 65 or older has more than tripled. Two years ago, they numbered 46.2 million and made up 14.5 percent of the total population. Flash forward to 2040 and 21.7 percent will fall into that…'"}, "time": 1742628584.3285785}