{"duration": 0.05640101432800293, "input_args": {"text": "\"Google Pinterest Digg Linkedin Reddit Stumbleupon Print Delicious Pocket Tumblr \\nIt’s do or die time for Trump, and so not surprising the lies are rolling in at a record speed – this time involving a fake celebrity endorsement by Super Bowl champ, Tom Brady. \\nUp until now, the New England Patriots quarterback has remained silent on who he will be voting for in Election 2016, but the cat is out of the bag and it’s in direct contrast to what Trump is saying. \\nAt a Manchester, New Hampshire, rally Monday night, Trump shared with the crowd a phone call he supposedly received from his buddy Brady, where Tom told the Republican presidential candidate he had voted for him. Trump told the cheering crowd: \\n“Great guy, great friend of mine — great, great champion. Unbelievable winner. He called today and he said, ‘Donald, I support you, you’re my friend, and I voted for you. And I said, ‘So Tom. You voted for me, you support me, am I allowed to say it tonight at this massive crowd in New Hampshire?’ He said, ‘If you want to say it, you can say it.’ OK? Tom, that’s what a champ is all about.” \\nWatch Trump’s embarrassing display of buddy name-dropping here: \\nBut there are a couple of problems with this glowing endorsement. Just hours before, on Boston’s “Kirk & Callahan Show” on WEEI Tom Brady said he hadn’t voted yet. Since early voting in Massachusetts ended Friday, he could not have voted in the hours between the show and the phone call, unless he mailed his ballot in, which is highly unlikely. \\nBut what is most damning is an exchange his wife, supermodel Gisele Bündchen, had on her Instagram page on Friday. \\nWhen a follower asked, “Gisele I heard you and Tom were backing Trump! Is that true???” \\nGisele responded with a resounding, “NO!” \\nHere is the exchange as posted on Twitter by Chris Sacca: Three days ago on Instagram, @giseleofficial told a random dude she and Brady weren't backing Donald. 🤔 pic.twitter.com/oiAcUgqkKK \\n— Chris Sacca (@sacca) November 8, 2016 \\nGranted, it is possible Tom Brady lied to Trump. Tom isn’t exactly known for his honesty, having been suspended for the first four games of this NFL season for cheating in the now infamous Deflategate Scandal . \\nEither way, Gisele’s posting speaks volumes about who she and her husband WILL be voting for. Perhaps ending the Brady-Trump bromance for good. \\nFeatured image via Fernanda Calfat/Stringer/Getty Images Share this Article!\""}, "time": 1742562105.0455751}