{"duration": 0.04186296463012695, "input_args": {"text": "'BOMBSHELL: Declassified Documents Reveal Why U.S. Ignored Saudi 9/11 Ties \\nAt long last, the so-called ‘missing’ 28 pages from the Congressional Joint Inquiry into the terror attacks of September 11, 2001, have been released, albeit in redacted form. \\nWhile obviously critical information has been obscured from the general public, the evidence remaining appears to show the hijackers and their associates received and had been receiving funds from individuals working for the government of Saudi Arabia—as has long been rumored and intimated. \\nThe redacted report also keenly criticizes failures in communication between the FBI and CIA, which its authors suggest could have been a crucial intelligence breakdown prior to the attacks. \\nAccording to the report, with all emphasis added: \\n“[T]he committees are particularly concerned about the serious nature of allegations contained in a CIA memorandum found by the Joint Inquiry Staff in the files of the FBI’s San Diego Field Office. That memorandum, which discusses alleged financial connections between the September 11 hijackers, Saudi government officials, and members of the Saudi royal family, was drafted by a CIA officer [REDACTED], relying primarily on information from FBI files. The CIA officer sent it to the CTC to determine whether CIA had additional information. He also provided a copy to the FBI agent responsible for the investigation of one of the individuals discussed in the memorandum. Despite the clear national implications of the CIA memorandum, the FBI agent included the memorandum in an individual case file and did not forward it to FBI headquarters. FBI headquarters, therefore, was unaware of statements in the memorandum until the Joint Inquiry brought the memorandum’s implications to the Bureau’s attention [FULLY REDACTED SENTENCE CONCLUDING THAT PARAGRAPH].” \\nThose connections between the planners of the 9/11 attack and members of the Saudi royal family and Saudi government are fleshed out in many of the remaining pages, despite redaction of many obviously telling points. For instance: \\n“While in the United States, some of the September 11 hijackers were in contact with, or received support and assistance from, individuals who may be connected with the Saudi government. There is information, from FBI sources, that at least two of those individuals were alleged to be Saudi intelligence officers.” \\nEven more damning, a heavily redacted paragraph suggests the reason, prior to 9/11, the FBI did not focus its investigations of possible terrorist ties of “Saudi nationals in the United States was due to Saudi Arabia’s status as an American ‘ally.’” \\nThough it appears the Joint Inquiry discovered telling evidence of ties between terrorist actors and the Saudi principals, the report refused to make a definitive statement on the issue due to the limited scope of its investigation. \\nHowever, the report states, “it is possible that these kinds of connections could suggest as indicated in a [REDACTED] dated July 2, 2002, ‘ incontrovertible evidence that there is support for these terrorists within the Saudi government ,’” though that statement is downplayed with a disclaimer there may be legitimate, innocent reasons for those connections. \\nAnother revelation the Joint Inquiry discovered on examining evidence suggested: \\n“One individual who provided assistance to Nawaf al-Hazmi and Khalid al-Mindhar may be connected to the Saudi Government. A second individual who may have been in contact with al-Hazmi and al-Mindhar also has ties to the Saudi government, including connections to the Saudi Ambassador to the United States. There is reporting in FBI files that persons have alleged that both of these individuals may be Saudi intelligence officers.” \\nIn fact, the hijackers “may have been in contact with other Saudi Government officials in the United States prior to” the attacks, and—perhaps most damning of all— “Saudi Government officials in the United States may have ties to Usama Bin Laden’s terrorist network.” \\nOne subject, in particular, Omar al-Bayoumi, was found to have “extensive ties to the Saudi Government.” Nevertheless, Congress decided not to pursue those allegations any further. \\nIndeed, the report states: \\n“Al-Bayoumi had been an accountant at the Saudi Civil Aviation Administration from 1976 to 1993, when he relocated to the United States,” and, further, the FBI found “Al-Bayoumi was in frequent contact with the Emir at the Saudi Ministry of Defense, responsible for air traffic control.” \\nAl-Bayoumi also received regular payments from the Ministry of Defense through a Saudi company called “Ercan,” and he contacted Saudi government “establishments” in the U.S. “almost 100 times between January and May of 2000.” \\nAt a closed hearing in October 2002, the document notes, a former FBI agent in San Diego testified that al-Bayoumi “acted like a Saudi intelligence officer, in my opinion. And if he was involved with the hijackers, which it looks like he was, if he signed leases, if he provided some sort of financing or payment of some sort, then I would say that there’s a clear possibility that there might be a connection between Saudi intelligence and UBL ,” with UBL being the government’s acronym for Usama, or Osama, bin Laden. \\nAnother former agent in charge in San Diego apparently said he received around six reports from individuals who suspected al-Bayoumi “was a Saudi intelligence officer” —but the FBI ultimately somehow found there was not sufficient evidence to conclude as much. \\nFurther lending credence to theories the Saudis may have been directly involved in the attacks, the Inquiry noted: \\n“In testimony and interviews a number of FBI agents and CIA officers complained to the Joint Inquiry about a lack of Saudi cooperation in terrorism investigations both before and after the September 11 attacks.” \\nOne agent even said the “Saudis had been useless and obstructionist for years” and will “only act when it is in their self-interest.” \\nThese 28 pages certainly seem to indicate the U.S. pursued, targeted, and invaded the wrong country in its choice of Afghanistan and Iraq after the September 11 attacks—as has been widely assumed for some time. \\nThough no definitive statements are made concerning conclusive proof of Saudi involvement—directly or indirectly—in the planning of 9/11, sufficient information is laid bare to conclude as much. In fact, the evidence calls directly into question exactly why the United States government continues to this day to categorize Saudi Arabia as a ‘trusted ally.’ \\nby Claire Bernish, theAntiMedia.org'"}, "time": 1742628591.9359553}