{"duration": 0.027568340301513672, "input_args": {"text": "\"Time: Investigating Hillary is an Attack on All Women November 1, 2016 \\nGood morning. It's Tuesday. \\nWho's up for another silly attempt to claim that Hillary Clinton is only being investigated for her rogue email setup because she's a woman? This gem comes from Robin Lakoff, a Berkeley professor in sustained incoherence and special pleading. \\nHillary Clinton’s Emailgate Is an Attack on Women \\n'It's not about emails; it's about public communication by a woman’ \\nI am mad. I am mad because I am scared. And if you are a woman, you should be, too. Emailgate is a bitch hunt, but the target is not Hillary Clinton. It’s us. \\nThe only reason the whole email flap has legs is because the candidate is female. Can you imagine this happening to a man? \\nHis name was General Petraeus. Thank you. Have a nice day. \\nClinton is guilty of SWF (Speaking While Female), and emailgate is just a reminder to us all that she has no business doing what she’s doing and must be punished, for the sake of all decent women everywhere. There is so much of that going around. \\nThat escalated quickly. And incoherently. Also I'm pretty sure it's not the 20s or whatever decade Robin is parodying or channeling. But yes, Hillary Clinton is only in this mess because she's a woman. It has nothing to do with anything else. That must be why Albright and Rice weren't in the center of similar scandals. \\nIf the candidate were male, there would be no scolding and no “scandal.” Those very ideas would be absurd. Men have a nearly absolute right to freedom of speech. In theory, so do women, but that, as the creationists like to say, is only a theory. \\nEmailing classified information on your server to avoid transparency regulations is not free speech. It's illegal for both public officials of both genders. \\nBut here’s Hillary Rodham Clinton, the very public stand-in for all bossy, uppity and ambitious women. Here are her emails. And since it’s a woman, doing what decent women should never do—engaging in high-level public communication—well, there must be something wrong with that, even if we can’t quite find that something. \\nIllegally... emailing... classified... information.\""}, "time": 1742561848.766168}