{"duration": 0.01796436309814453, "input_args": {"text": "'October 28, 2016 \\nFollowing the revelation that printers, blacksmiths, cigar pen makers and even quilt rack makers have joined bakers, butchers and cheese makers in using the term ‘artisan’, experts have ruled that absolutely anyone is free to claim to be one. The only conditions are that they have to be unemployed marketing graduates and are not funneling over a thousand tonnes a day of cement powder and cows’ vaginas into a mixer and hoping for the best. \\n‘Artisan is a coffee-focused, fun-loving space that flirts with pushing design boundaries,’ said Jason McKillop, owner of the Artisan Café in Stamford Brook. ‘Our Baristas treat each cup like a fine chef does a meal, taking pride and time to ensure each coffee is flawless. We continuously adjust the grind to allow for changes in the atmosphere – yeah, yeah, all right, it’s a café but we need a reason to charge £4 for a cup of coffee, don’t we?’ \\nThe trend has been welcomed by easily impressed simpletons with unaccountably well-paid jobs. ‘I like to know that “Fire is at the literal heart of Artisan; handmade, rustic dishes served straight from the flames”,’ said Manchester-based bell end Thomas Lee-Enderby of his favourite new restaurant. ‘That means they are preparing and cooking the food, right? I also like the bar which “serves handcrafted cocktails alongside cherry picked beers, wines and spirits” because I can’t stand cocktails made by robots.’ \\nMeanwhile, after learning that a nearby artisan chocolatier ‘metamorphoses the finest cocoa in a myriad of chocolate shapes and flavours to surprise and satisfy all cravings and occasions’, while an artisan supplier of flush-mount wedding albums has made them ‘insanely affordable for everyone and every day’, Keith Rogers from Leamington Spa has copied and pasted from some websites and declared himself to be Britain’s first artisan supplier of spare parts and accessories for photocopiers. \\n‘I use parts sourced from lovingly crafted polypropylene of an unmatched quality adhering to a real artisan standard,’ Rogers said. ‘By selecting only the finest toners, dyed to a rich black hue using locally sourced carbon black from South Wales, I am delivering a copier more complex in taste and variety for a more satisfying customer experience. Will that do? Now you can resume photocopying your own arses on it.’ Oxbridge (HT Spartacus)'"}, "time": 1742628489.0488753}