{"duration": 0.056761980056762695, "input_args": {"text": "\"WATCH: Trump Goes Full-On Dictator – Says ‘Cancel The Election’ By Natalie Dailey on October 28, 2016 Subscribe \\nFor weeks,   nominee Donald Trump has been whining that the election is being “rigged” against him. He even called the presidential debates “rigged.” \\nNow, I guess his ego is so YUGE because he wants the election cancelled, and the presidency awarded to him without voting. \\nHe said at a rally in Toledo, Ohio Thursday: “And just thinking to myself right now, we should just cancel the election and just give it to Trump, right? What are we even having it for? What are we having it for? ‘Her policies are so bad. Boy, do we have a big difference.” \\nHe’s against voter fraud, but he’s OK with just yanking the election away from us? That is insane. That is not how a democratic election works, Trumpy. Taking the vote away from the people like that would make Trump our first dictator. \\nTrump may have been trying to make a joke out of it, but with his talk of rigged elections, that comment is just plain scary. \\nOn Thursday, Trump appeared on Bill O’ Reilly’s show. When asked if the polls would be rigged on election day, Trump said he believes they will be. When asked about his trailing in the national polls, Trump said : “I’m winning in certain polls and then in other polls, the dirty polls we call them, I was losing by numbers that were ridiculous. I think we’re winning, but Bill, you look at some of these polls it’s absolutely ridiculous.” \\nJust last week, Trump’s poor Campaign Manager Kellyanne Conway was faced with the undesirable job of defending Trump’s idiocy. After one of the other times he whined about the election being rigged, she said : “His entire campaign is built about the little guy being the victim, the forgotten man and forgotten woman being the victim of the rigged corrupt system. Let’s keep the focus there. That’s who he’s fighting for. I know so many in the media like to just dismiss the crowd sizes. Let me tell you something, you go out on the road with Donald Trump, this election doesn’t feel over.” \\nWhen he refers to himself in the third person, it makes him sound even creepier. \\nCheck out this clip   \\nFeatured image via YouTube screenshot . About Natalie Dailey \\nHi, I'm from Huntsville, AL. I'm a Liberal living in the Bible Belt, which can be quite challenging at times. I'm passionate about many issues including mental health, women's rights, gay rights, and many others. Check out my blog abravealabamaatheist.com. Check out my other blog weneedtotalkaboutmentalhealth.com Connect\""}, "time": 1742563668.3565776}