{"duration": 0.09749555587768555, "input_args": {"text": "'9 News reports : \\nIt is understood the American Journalist died of lung cancer surrounded by loved ones in London on Saturday. \\nColleagues and fellow journalists across the world, including WikiLeaks co-founder Julian Assange, have taken to social media to pay their respects. \\nIn his illustrious career, MacFayden produced and directed more than 50 documentaries on a wide range of topics including neo-Nazis, child labour, the Iraq arms trade and Frank Sinatra\\'s ties to the mafia. \\nMacFadyen seemed to be one that stood up for Whistleblowers and sought to breed a new generation of investigative journalists. His wife Susan Benn said , \"His loyalty to those under attack from powerful forces, particularly whistleblowers and journalistic groups like Wikileaks, will remain a beacon for years to come.\" \\n\"He was the model of what a journalist should be... He spearheaded the creation of a journalistic landscape which has irrevocably lifted the bar for ethical and hard-hitting reporting,\" she added. \"Gavin worked tirelessly to hold power to account.\" \\n\"His life and how he lived it were completely in sync with the principles that he held dear and practiced as a journalist and educator – to comfort the afflicted and afflict the comfortable,\" she concluded. \\nHowever, some have claimed that there may be a cover up involved in the death of MacFadyen due to a tweet that was shortly posted on Twitter and then removed. \\nWe also know that Wikileaks founder Julian Assange fears for his life after he has exposed the corruption in government via leaked documents. In fact, we know that many US politicians, including Hillary Clinton have called for his assassination . Hillary Clinton on Assange \"Can\\'t we just drone this guy\" -- report https://t.co/S7tPrl2QCZ pic.twitter.com/qy2EQBa48y \\n— WikiLeaks (@wikileaks) October 3, 2016 \\nIn an opinion piece by Kristine Moore following MacFadyen\\'s death, she writes , \"Having Julian Assange stand at his window in the Ecuadorian Embassy might not be such a good idea after all. If a sniper is able to take him out from nearly a mile away, I think we can all understand why Julian stays well away from his window these days. Assange clearly fears for his life and if he didn\\'t, he would just saunter over to the window, pull the curtain, and wave to everybody. He knows people are concerned about him, but he is right not to put his life at risk just to reassure us with a physical appearance, however fleeting it may be.\" \\n\"Lest you think I am being paranoid by suggesting that there could be a sniper lying in wait for him, just remember that Hillary Clinton once quipped that he should be taken out by a drone ,\" she added. \"Even if you say that it was just \\'a joke\\' and meant in jest only, what Secretary of State jokes about murdering somebody in front of other government officials? Many of us have no doubt whatsoever in our minds that if she or someone else were able to do this and get away with it, they would.\" \\nI can see why people might question MacFedyen\\'s death, much like the death of Antonin Scalia was questioned , even though both men were advanced in years. It\\'s also understandable why Julian Assange would want to keep out of sight as much as possible considering the criminal in the White House . shares'"}, "time": 1742563320.0692072}