{"duration": 0.10979509353637695, "input_args": {"text": "\"Email \\nPoll results released on Wednesday by Gallup confirm the trend toward the acceptance of the freedom to own guns and support of the Second Amendment. Sixteen years ago 59 percent of those polled favored “a law which would make it illegal to manufacture, sell or possess semi-automatic guns known as assault rifles,” while just 39 percent were opposed. Today those numbers have flipped: Just 36 percent support a ban, while 61 percent of those polled oppose it. \\nEven those polled who don’t have a gun in their home oppose such a ban. Most surprisingly, however, is that support for such a ban has dropped even among those most likely to support one: Democrats. In the year 2000, 63 percent of Democrats supported such a ban, while today just 50 percent do. Wrote Art Swift for Gallup: “It is striking — and unusual — that fewer Democrats than ever support an assault weapons ban, since the Democratic Party has been instrumental in pushing for stricter gun laws.” \\nPerhaps comforting to those watching how Independents might vote in the upcoming presidential election, Gallup reported that just 31 percent of them support such a ban (the same as Democrats), while in 2000, 63 percent did. \\nSwift called the results a “paradox”: Perhaps paradoxically, opposition toward a ban has increased against a backdrop of multiple mass shootings and terrorist attacks in which the perpetrators used assault rifles. These guns were used in high-profile incidents, including the terrorist attacks in San Bernardino, California, and Orlando, and the mass shootings in Aurora, Colorado, and Newtown, Connecticut. \\nGallup could help its cause by defining more carefully the distinct difference between “assault rifles” and “assault weapons.” Assault rifles have been heavily regulated for decades, being defined as rifles used by the military that are “select” fire: able to fire multiple rounds with a single press of the finger on the trigger. “Assault weapons” were never defined until the Brady Bill was passed into law in 1994. Then they were defined as rifles that were “semi-automatic,” firing but a single round with a single press of the trigger. The bill also declared such a weapon as banned if it had any two of five cosmetic features that had nothing to do with its lethality: a collapsible stock, a pistol grip, a bayonet mount, a flash suppressor, or a grenade launcher (which is useless without grenades). \\nCommentators jumped on the Gallup report with all manner of explanations as to the cause of the continuing drop in support for a ban or, conversely, citizens’ increasing support for gun ownership. Sean Davis, the co-founder of The Federalist , declared, “Americans understand that terrorists want to murder us, and that our laws are no obstacle to their blood lust. They will use planes, or bombs, or trucks, or knives, or box cutters, or guns.… Strict gun control laws in cities like Chicago and Washington, D.C. have done nothing to prevent sky-high murder rates in those cities year after year.” \\nIt’s possible that the message offered for years by Pastor Chuck Baldwin, a presidential candidate for the Constitution Party in 2008, is gaining purchase as well. In a recent newsletter Baldwin pulled no punches: To take away the citizen’s right to bear a semi-automatic rifle is to, in effect, completely disarm him…. The only reason that would-be tyrants in the US government have been kept at bay is because of an American citizenry fully armed with semi-automatic rifles. \\nThat they are “fully armed” may be an understatement. The usual estimate of the number of firearms owned by American citizens has routinely been reported at 300 million, plus or minus. But that doesn’t square with the fact of increasing numbers of citizens purchasing firearms, setting records month-after-month for the last year and a half. WeaponsMan blog, written by a former Special Forces soldier and a stickler for details, investigated the publicly available data from government sources, including the ATF itself, and found the number to be vastly larger: upwards of 660 million. His analysis is available here . \\nHe concludes “that the US inventory of firearms is almost certainly between 412 and 660 million, not the lower numbers recently trumpeted by the media.” \\nThe irony remains that, thanks to the media’s propaganda blitz against the private ownership of firearms, awareness of what the true agenda is continues to grow. The harder gun-grabbers push, the harder it will be for them to accomplish their ultimate goal: complete confiscation of every firearm from every private citizen in the country. More than 200 years ago, Thomas Jefferson saw the threat, and gave perhaps the most reasonable explanation for today’s increasing support of the right of the people to buy, bear, keep and use firearms: The strongest reason for the people to retain the right to keep and bear arms is, as a last resort, to protect themselves against tyranny in government. \\nAn Ivy League graduate and former investment advisor, Bob is a regular contributor to The New American magazine and blogs frequently at LightFromTheRight.com, primarily on economics and politics. He can be reached at This email address is being protected from spambots. You need JavaScript enabled to view it. . \\nHillary's Anti-gun Stance Becomes Clearer Thanks to WikiLeaks  \""}, "time": 1742562031.072147}