{"duration": 0.024419546127319336, "input_args": {"text": "'PolitiFact has pulled a 2014   on remarks about Syria by former Secretary of State John Kerry after the claim the Obama administration “got ‘100 percent’ of chemical weapons out of Syria” turned out to be false. [In a post about the recent chemical weapons attack in Syria, PolitiFact admitted, “The outcry leads us to revisit a 2014 claim from former Secretary of State John Kerry. ”  “Kerry said in a television interview that in Syria, ‘we got 100 percent of the chemical weapons out.’ Syria had agreed in 2013 to an ambitious program to destroy its chemical stockpiles under international supervision, as part of a deal brokered by Russia,” they explained. “When Kerry spoke in July 2014, the process seemed far along. Based on reports from the Organization for the Prohibition of Chemical Weapons  —   which later won the Nobel Peace Prize for its efforts  —   we rated that claim Mostly True. There were caveats about incomplete information, but at the time, international experts said the claim largely held up. ” “Given recent events, we have pulled that   (you can read an archived version here) because we now have many unanswered questions,” the   site declared. “We don’t know key details about the reported chemical attack in Syria on April 4, 2017, but it raises two clear possibilities: Either Syria never fully complied with its 2013 promise to reveal all of its chemical weapons or it did, but then converted otherwise   chemicals to military uses. One way or another, subsequent events have proved Kerry wrong. ” PolitiFact is often heralded as a reliable and neutral   source by the mainstream media and political establishment, despite numerous revelations over the past few years that the site is largely biased towards the  . Last year, it was reported that Politifact, which is partially funded by a large Clinton Foundation Donor, had made 13 errors in a   on the Clinton exposé book, Clinton Cash. In a 2013 report, The Weekly Standard claimed that Politifact “has it out for Republicans” after they overwhelmingly focused more on   arguments made by conservatives than Democrats, even spinning jokes made by Republicans into facts. During the 2016 presidential election, Politifact also rated just 15% of Trump’s campaign claims as “true” against a 51% rating for Clinton and spun stories to benefit Clinton and criticize Donald Trump. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742561969.7926242}