{"duration": 0.09626555442810059, "input_args": {"text": "'Monopoly’s Indian version to be launched, real ₹500 and ₹1000 notes to be used Posted on Tweet \\nIn a massive development in the world of board gaming, American toys and gaming brand Hasbro has announced that it will be coming up with its own Indian version of their child company Parker brothers’ cult classic business board game, Monopoly. Cashing in on PM Narendra Modi’s recent shell-shockingly bold move of invalidating currency notes of the ₹500 and ₹1000 denomination, Hasbro has announced that for the first time in the board game’s history, real notes of these denominations will be used. (Image via hasbro.com) \\n“HUGE ANNOUNCEMENT: India, we’re coming soon to you guys, with your own version of Monopoly! Say goodbye to Boardwalk, Vermont, Park Place, Ventnor etc etc. You will soon see Connaught Place, Park Street, Marine Drive, Anna Salai, Silk Board and so on, along with a dozen places that belong to Robert Vadra and DLF! And guess what? For the first time in the history of this classic board game, we will be using real notes for ₹500 and ₹1000! So this is an open offer to you all – please send us all your notes of these denominations and we will transfer the corresponding amount to you online! Avail this historic opportunity!” Hasbro CEO Brian Goldner announced. \\nGoldner added that it’s not just the properties that would be Indian. “There will be a ‘Go to Tihar Jail’ box at one of the corners. There will also be a ‘Get out of Tihar Jail free’ card with Sanjay Dutt’s face on it. As for the vehicles players would use, we will have a bullock cart, a Bajaj Chetak, a Maruti 800 and so on. And guess what – there will be no notes for denominations of ₹1 and ₹5! True to the Indian spirit, we will have Eclairs chocolates and 5-star bars in our game banks. The deal with Cadburys will be finalized soon. We’ll make this game as Indian as it can possibly get, all you folks as well as your illegal Bangladeshi immigrants are going to love it!” the CEO told The UnReal Times . \\nAccording to sources, Hasbro is likely to be helped by Mukesh Ambani’s Reliance Industries Ltd in the distribution of the game. “Oh I absolutely love Monopoly, I just can’t have enough of it!” Ambani reportedly smiled while discussing the deal with Goldner. Hasbro is also said to have been approached by NCP supremo Sharad Pawar for the supply of currency notes in the state of Maharashtra. Sources in Tamil Nadu added that the ruling AIADMK wanted special ‘Amma’ currency notes for the game packs distributed in Tamil Nadu, but their request was reportedly turned down by Goldner. \\nThe announcement has drawn reactions from across the border too. While Pakistan has warned Hasbro of including any property from Kashmir in the game, China has issued a similar warning to not include any property from Arunachal Pradesh. From the center of the country, a letter by the Rashtreeya Swayamsevak Sangh has urged the brand to include other countries like Nepal, Pakistan, Sri Lanka etc and make the game set in Akhand Bharat as opposed to being India-specific. \\nRegardless though, Monopoly India is all set to be officially launched soon at the office of the BJP’s Margdarshak Mandal. “Joshi bhai , Yashwant bhai and I are greatly looking forward to this! Will be quite a change from the usual Rummy or Bridge,” BJP patriarch LK Advani, who recently turned 89, sniffed. Tweet About Ashwin Kumar \\n1 of the proud columnists of URT, former co-editor of URT Tamil, amateur musician, Real Harris Jayaraj devotee, UnReal T. Rajendar fanatic, passionate about stopping female foeticide.'"}, "time": 1742563879.4642804}