{"duration": 0.1094355583190918, "input_args": {"text": "'ROME  —   Italy plunged into political and economic uncertainty early Monday as Prime Minister Matteo Renzi said he would resign after voters decisively rejected constitutional changes, a step certain to reverberate across a European Union already buffeted by   anger. “The ‘no’ won in an incredibly clear way,” Mr. Renzi said from the Chigi Palace. Holding back tears as he spoke in front of Italian and European Union flags, the usually brash and confident    said, “I assume all the responsibility of the defeat,” adding that “my experience of government ends here. ” He said he would go later on Monday to the country’s president, Sergio Mattarella, and “tender my resignation. ” Mr. Renzi’s defeat, and the instability that his resignation is likely to cause, raised the prospect of punishment in the markets, but also a caretaker government staffed with technocrats appointed by the Italian president. Another possibility is the calling of early elections in 2017, though that, too, was unclear because Italy’s new electoral law is itself under review by Italy’s constitutional court. The news sent the euro down sharply in Asian trading. If early elections do occur next year, 2017 is shaping up to be a seminal year in the history of the European Union with founding members Germany, France and potentially Italy all going to the polls with strong   and populist candidates in the running. Mr. Renzi’s defeat came hours after voters in Austria, presented with a stark ideological choice for the largely ceremonial position of head of state, chose Alexander Van der Bellen, the former leader of the small Green Party, over Norbert Hofer of the   Freedom Party. It was but a brief reprieve for a European political establishment that has suffered populist jolts all year. The reaction to Mr. Renzi’s loss illustrated the poisonous tone of the long campaign leading up to the referendum. “The propaganda of the regime and all its lies are the first losers of this referendum,” Beppe Grillo, the leader of Italy’s   Five Star Movement, wrote on his widely read blog. “Times have changed,” he said. Luigi Di Maio, the deputy leader of the lower house of Parliament and a likely candidate for prime minister from the Five Star Movement, spoke about a coming “Five Star government. ” And Matteo Salvini, the leader of the   Northern League, who campaigned vigorously against Mr. Renzi’s proposal, called the result “not just a defeat for Renzi but also his servant, lackeys, bankers, financiers. ” Ostensibly the vote was about arcane changes to Italy’s Constitution that would have streamlined government. But opposition to the proposals came from the same   sentiment  —   spiked with skepticism of globalization, open borders and the feasibility of an   European Union  —   that has transformed the politics of a growing list of European countries. Such movements have already smashed the traditional political structures in Greece and Spain, and forces skeptical of the European Union led Britain to vote in June to leave the union. In Germany, Chancellor Angela Merkel, once untouchable, now seems vulnerable in next year’s elections. And   parties are also seeking power in France. In Austria, the Green Party stalled the advance of populist forces on Sunday by defeating the presidential candidate of the Freedom Party, which was established by former Nazis. The result in Austria might have calmed some nerves, but it was the rejection of Mr. Renzi that most sent shivers through Europe and the world. In a strategic blunder that echoed David Cameron’s call for a “Brexit” referendum, Mr. Renzi had tied his government’s tenure to Sunday’s vote when he was flying high in the polls. But his support eroded, and world leaders anxiously watched the vote in Italy, the   economy in Europe, as a referendum on Mr. Renzi’s centrist government and as a barometer of the strength of   winds blowing across both sides of the Atlantic. Financial analysts have warned that instability caused by Mr. Renzi’s premature departure could result in a renewed and possibly contagious financial crisis in Italy, where banks are saddled with bad loans, and where desperately needed investors are turned off by the return of Italian instability. Some world leaders, seeing in Mr. Renzi a critical defense against populism’s rising tide, had urged him to stay. President Obama, speaking at the White House during Mr. Renzi’s visit in October, said he hoped Mr. Renzi would “hang around for a while no matter what. ” The incoming administration of   Donald J. Trump was less eager to see him remain. Members of Mr. Trump’s inner circle have closely watched, and rooted for, the surging populism in Europe. What was clear, said Stefano Stefanini, who served as a diplomatic adviser to Giorgio Napolitano, a former Italian president, was that the vote was “a test of strength of the   and   forces in Italy. ” Mr. Stefanini said Mr. Renzi’s departure could embolden parties feeding on economic frustration, loss of national identity, anger at Brussels and a desire to break with the   War II belief that Italy’s economic and national security interests were better served within an alliance of liberal democracies. The vote showed that Italy “is reverting to a willingness to go it alone as a ” Mr. Stefanini said. The primary beneficiary of Mr. Renzi’s defeat is Italy’s   Five Star Movement, a party that advocates a referendum to determine whether Italy should give up the euro. “We have the Italian people behind us,” Mr. Di Maio, 30, said in a recent interview. “And he is losing,” he said of Mr. Renzi. Mr. Renzi, in an interview over the summer, compared the party’s leader, Mr. Grillo, to Mr. Trump. “Populism is always the offspring of fear,” Mr. Renzi said at the time. “And in Italy, the answer to fear is the courage to not be defensive, to not be like all the others. ” But Italy instead became like a growing list of European countries, and Italians seemed most moved by the message of Mr. Grillo and other leaders of his party, who campaigned tirelessly against a reform proposal they said would put too much power in the Mr. Renzi’s hands. In the end, heavy opposition in the south and other regions marred by high unemployment levels proved insurmountable, and Mr. Renzi could not persuade enough moderates to stick with him and his government’s plan to modernize Italy. Ultimately, the substance of the reform mattered less than voters’ opinions of Mr. Renzi. In the past, personalizing politics had helped Mr. Renzi, a charismatic Florentine who came to power as a result of an internal Democratic Party coup in 2014. This time, it hurt him. Mr. Renzi proved unable to keep walking the tightrope between outsider and insider that he had navigated so exquisitely during his rapid ascent to the apex of Italian government. On the one hand, Mr. Renzi presented himself as an   demolition man determined to smash the gerontocracy in Italy and shock into action the    bureaucracy in Brussels. On the other, he was the consummate insider, an   expert at working within the system who built unlikely coalitions to get things done. Italy, long mocked as the chaotic home of 63 governments in 70 years, emerged as a safe port of stability, and its young leader took on a special aura as a bulwark against the     and radical forces. Sunday’s vote erased that halo. After casting his ballot against the reform on Sunday morning, Dario Cecchi, 37, said his vote had less to do with Mr. Renzi than the substance of the proposal. Mr. Cecchi added that he was upset that Mr. Renzi had tied his political fate to the referendum, because he did not want him to step down. He said he understood that Mr. Renzi had   Italy as a force within Europe and that a yes vote would only increase his country’s power inside the European Union. But, he said, the reform “shouldn’t just be good for Europe  —   it should be good for Italy. ”'"}, "time": 1742563041.6516013}