{"duration": 0.09094667434692383, "input_args": {"text": "'NEW DELHI  —   American and Indian officials on Sunday swiftly condemned the shooting of a Sikh man in a suburb of Seattle, which followed by less than two weeks a similar episode in Kansas and amid a   crackdown on immigration. The man, 39, was in the driveway of his home in Kent, Wash. working on his car on Friday night when a white man, wearing a mask over the lower part of his face, confronted him and then shot him in the arm, The Seattle Times reported. The police have asked the F. B. I. and other law enforcement agencies for help finding the gunman, who the victim said told him to “go back to your own country. ” The victim was identified as Deep Rai, a United States citizen of Indian origin. India’s minister of external affairs, Sushma Swaraj, said she had spoken to the victim’s father, who said his son was “out of danger and recovering in a private hospital. ” The attack bore a troubling resemblance to the shooting on Feb. 22 of Srinivas Kuchibhotla and Alok Madasani, two immigrants from India who were shot by another patron in a Kansas bar. The suspect in that case, Adam W. Purinton, had confronted the two Indians over their visa status and had been escorted out of the bar, before returning and opening fire. Mr. Kuchibhotla died from his injuries. The episode was   news in India, which sends hundreds of thousands of legal immigrants to the United States each year, among them students and highly skilled workers. Since the Kansas shooting, many Indians have expressed concerns that racially motivated violence will rise in the coming years, as President Trump leads an effort to curtail legal immigration and deport illegal immigrants. The White House has denied that the violence is in any way connected with Mr. Trump’s policies. Immigration was a central focus of   talks last week in Washington, where India’s foreign secretary, Subrahmanyam Jaishankar, met with senior American foreign policy officials. Washington’s top envoy in India, MaryKay Loss Carlson, said she was “saddened by the shooting” in Washington State. “As @POTUS said, we condemn ‘hate and evil in all its forms,’” Ms. Carlson said in a Twitter post. The Sikh Coalition, a Sikh rights group based in New York, has urged the authorities in Washington State to investigate the shooting as a hate crime, and called on top officials in Washington to forcefully condemn such attacks. “Tone matters in our political discourse, because this is a matter of life or death for millions of Americans who are worried about losing loved ones to hate,” Rajdeep Singh, a Sikh Coalition leader, said in a statement to the Hindustan Times.'"}, "time": 1742563672.477026}