{"duration": 0.045549869537353516, "input_args": {"text": "'Financial Markets , Housing Market , U.S. Economy foreclosures , Housing bubble , mortgage rates admin \\nYou wouldn’t know it from the housing industry organizations, Wall Street or the media propaganda, but the housing market is starting to unravel. It does not matter which person or political party occupies the White House and Capitol Hill. The debt orgy that followed the Fed’s QE program is now showing visible signs of unintended but inevitable consequences and it’s beginning smell a lot like 2008. \\nPer RealtyTrac , U.S. foreclosure activity increased 27% from September to October. Foreclose starts posted the biggest monthly increase since…December 2008. Scheduled foreclosure auctions posted the biggest monthly increase since 2006. The data is even more startling in certain States. Foreclosures in Colorado jumped 64% in October from September and foreclosure starts soared 71%. Colorado tends to be an economic and demographic bellweather State. In the housing bubble 1.0, foreclosure activity in Colorado began to accelerate before it hit all the other major MSAs. \\nJust in time for foreclose activity to ramp up, the Obama Government rolled new Fannie and Freddie mortgage programs which removed or reduced required mortgage insurance. Once again the Taxpayers will be left holding the bag and monetizing a mortgage collapse from which the bankers, real estate and mortgage industry collected $100’s of millions in fee money. \\nPer this analysis posted by Wolf Richter, the Miami condo market is in a freefall: LINK . Mortgage rates have spiked up considerably in the last week. This will extinguish a significant amount of home sales and cash-out refi’s – note – the following is an excerpt from the latest issue of my Short Seller’s Journal : \\nI continue to see with my own eyeballs, which I trust a lot more than the manipulated b.s. reported by the National Association of Realtors and the Government’s Census Bureau, a stunning number of “for sale” and “for rent” signs all around central Denver. Note that Colorado has 11,000 people per month moving here, so if inventory in both homes for sale and rentals are visibly increasing here it means they are increasing everywhere. \\nI’ve heard horror stories about the south Florida market from several sources. A colleague who runs a real estate brokerage firm in Houston published a report last week on a growing glut in luxury apartments in Houston: LINK . \\nI bought Toll Brothers (TOL) December $28-strike puts on Thursday for 64 cents. The stock at the time was $29.40. It closed Friday at $28.25. I also bought Pulte Home (PHM) January $18-strike puts for 72 cents. The stock at the time was $18.65. It closed Friday at $18.32. \\nI did this after chatting with the friend of mine mentioned earlier who is a mortgage broker. We are working on a refi for my significant other, which is why he called me on Thursday to see if I wanted to rate-lock her loan after informing me that the mortgage market was getting “funky” and spreads were widening. \\nFinally, again just like the mid-2000’s housing bubble, NYC is showing definitive signs that its housing market is crumbling very quickly. Landlord rent concessions soared 24% in October, more than double the 10.4% concession rate in October 2015. Typical concessions include one free month or payment of broker fees at lease signing. Days to lease an apartment on average increased 15% over 2015 in October to 46 days. And inventory listings are up 23% year over year. \\nDR Horton (DHI) reported earnings on Tuesday. It missed both revenues and earnings. The stock was hit 5.4% that day and closed even lower by Friday. Any stock that sold off on Thursday and Friday while the stock market was going orbital has real problems. DHI reported the slowest order growth rate in three years. More troubling from my perspective is that, with the market obviously slowing down, DHI’s inventories continue to balloon, increasing by $537 million to $8.3 billion vs $7.8 billion at the end of September 2015. The Company’s cancellation rate jumped to 28% from 23% last year. Again, this smells exactly like 2008…perhaps this part of the reason the Dow Jones Home Construction index looks so ugly: \\nThe graph above shows the Dow Jones Home Construction index vs the S&P 500 for the past year. Since hitting 601 on July 26, the index is down 14%. It’s down 16.5% from its 52 week high of 618 on December 1, 2015. As you can see, the index is below both its 50 and 200 dma’s (yellow line and red line, respectively). The 50 dma is about to cross below the 200 dma, another potentially highly bearish techincal indicator. Perhaps first and foremost is the fact that the homebuilders were extremely weak relative to the buying frenzy that gripped the market Wed thru Friday. \\nIn my opinion, it’s safe to put a fork in the housing market. And this is the primary reason that it smells to me a lot like 2008. \\nYou can access the Short Seller’s Journal with this LINK or by clicking on the graphic to the right. Almost all of the ideas I have presented since early August have been working, some have been yielding tremendous returns. It’s a weekly report for $20/month with no minimum subscription requirement. I provide options trading ideas as well as disclose all of my trading activity from the short-side. Share this:'"}, "time": 1742628432.2517102}