{"duration": 0.08233284950256348, "input_args": {"text": "\"0 comments \\nMegyn Kelly seems to think that she can get away with anything she says or does. Rupert Murdoch gave her a rude awakening when he told her that there are tons of other qualified people that would kill to take her spot. \\nRupert Murdoch is making Fox News’ salary negotiations with Megyn Kelly very public by granting an interview to one of the newspapers his company News Corp. owns, The Wall Street Journal. In the interview, Murdoch said that keeping Kelly is a priority, but that he has other hosts who could take over the program should she try and go to a rival network.‘[W]e have a deep bench of talent, many of whom would give their right arm for that spot,’ said Murdoch. Kelly, who is said to be making $15million this year, is reportedly looking to make more than $20million when she renegotiates her contract next July. She declined a request to comment on the story. \\nKelly’s star has continued to rise over the past year, and next month she will be releasing her first book, Settle For More. It has also been revealed that Kelly will be appearing Live With Kelly! the day after the election, marking the first time she is set to appear on Ripa’s morning show as a co-host. \\nHer popularity is one of the main reasons Murdoch says he wants to get her contract signer ‘very soon.’ \\nHe added however that whether or not Kelly stays at the network is ‘up to her.’ It is unclear where Kelly might land if she does not stay with Fox News, but CNN seems like a very likely possibility for the popular host. Kelly also has a huge fan in CNN head honcho Jeff Zucker, who called her a ‘tremendous anchor’ earlier this year. And former CNN president Jon Klein applauded Kelly for not backing down to Donald Trump in the first Republican debate when she questioned him about his treatment of women, this despite the fact that her then boss Roger Ailes was a supporter of the Republican nominee.‘To be able to stand up and ask tough questions to your boss’s choice of president shows a certain steeliness,’ said Klein. The article also points out that Kelly also separated herself from other Fox News anchors during the internal investigation into Ailes’ alleged sexual harrassment by speaking with the lawyers hired to look into the claims being made by former host Gretchen Carlson. That revelation about Kelly’s speaking with investigators was confirmed by people who were familiar with the matter. Some have said that Kelly is set to be the center of Fox News after the exit of Ailes, but Murdoch shot down those claims saying: ‘We’re not changing direction … that would be business suicide.’ Murdoch also said that he wants to make sure Bill O’Reilly also resigns with the network when his contract is up next month. One rival news executive told Vanity Fair in August that the rivalry between Kelly and O’Reilly has devolved to the point that one of them will likely leave when their contracts expire. O’Reilly shot down reports of a feud between himself and Kelly in June however, telling The Hollywood Reporter: ‘Oh, that’s all fabricated. She’s in a totally different part of the building. The last time I saw Megyn Kelly was in Detroit in March [at the Fox News GOP debate].’ Meanwhile, a spokesperson for Fox News said: ‘[Fox News President] Bill Shine and [Executive Vice President, Programming & Development] Suzanne Scott have maintained a close relationship with Bill and Megyn for years and have helped both of them in many instances, all while co-existing under the same roof.’ Kelly has previously hinted that she would be willing to leave the network where she has worked for the last 12 years \\n‘There’s a lot of brain damage that comes from the job. There was probably less brain damage when I worked in the afternoon. I was less well known. I had far less conflict in my life,’ Kelly said in an interview with Variety earlier this year.‘I also have three kids who are soon going to be school from 8am to 3pm I come to work at 3:30. I like to see my children.’ Kelly says she’s thought about hosting her own talk show but isn’t sure ‘what the market looks like for that in 2016’ and just doesn’t think ‘that’s the perfect thing for me’. As for co-hosting a morning show like Today, Kelly said she’s tried that before and she’s not much of a morning person.‘You have to wake up so early. The alarm goes off at 3:30am,’ said Kelly.‘When I did America’s Newsroom, which started at 9am, I remember saying to the makeup artist at the time, “If you could only know the afternoon me, you’d like me so much better.'” She then added: ‘Listen, this is a fickle business. What if they called me and fired me tomorrow? I have to keep my options open.’ \\nEverybody is replaceable, even you Megyn!! Related Items\""}, "time": 1742561682.8762252}