{"duration": 0.060866355895996094, "input_args": {"text": "'An   website called “Migrant Fear” has been shut down and its customers investigated by German authorities for purchasing pistols and rifles that fire rubber bullets. [Migrant Fear presented itself as a resource for Germans who were in fear of the wave of migrants who had entered Germany over the past year and a half and offered   pistols and rifles for   purposes.  The site was unabashedly against German Chancellor Angela Merkel and her government and was based out of Hungary where their weapons are perfectly legal, though the site’s owner is believed to be German, Süddeutche Zeitung reports. German law stipulates that no German can own a weapon that can fire more than 7. 5 joules of muzzle energy unless they hold a full firearms licence. In perspective, it is estimated that a 0. 145 kilogramme baseball travelling at 100 miles per hour, 44 metres per second, would have roughly the equivalent of 140 joules of energy using the formula for kinetic energy ½ mv². One pistol sold on the Migrant Fear site, a revolver that uses blanks to shoot out rubber balls, was estimated to have 125 joules of muzzle energy. A rifle, in the style of an M1 Thompson   or “tommy gun” was registered to have around 140 joules of energy. An actual hunting rifle firing . 308 ammunition records over 3, 000 joules by comparison. The database of people who purchased weapons from the site has been handed over to police who are actively investigating the hundreds of customers. Most are from Germany, but there are also customers from Switzerland and Austria, a dozen countries in total. The price of the weapons, which are made in Hungary, was greatly inflated on the site with the average person paying between €300 and €500 (between £260 and £430) per order. The Migrant Fear site used inflammatory terms to sell its wares with one revolver being called the “  complete package”  referring to the far left extremist group which has routinely clashed with right wing demonstrators and police over the course of the migrant crisis. Firearms purchasing in Germany and neighbouring Austria have been on the rise since the start of the migrant crisis with more and more men and women purchasing firearms or seeking licenses to own them. In reaction to the surge in sales, the German government announced in November it would be strengthening the already tight weapons legislation to crack down on potential extremists, like the   “Reich Citizens”. A member of the right wing group, who deny the legitimacy of the   War Two constitution, shot a policeman to death last year during a raid on his property.'"}, "time": 1742562084.6936796}