{"duration": 0.06064629554748535, "input_args": {"text": "'WASHINGTON  —   Kellyanne Conway, counselor to President Trump, said on NBC’s “Meet the Press” on Sunday that the White House had put forth “alternative facts” to ones reported by the news media about the size of Mr. Trump’s inauguration crowd. She made this assertion  —   which quickly went viral on social media  —   a day after Mr. Trump and Sean Spicer, the White House press secretary, had accused the news media of reporting falsehoods about the inauguration and Mr. Trump’s relationship with the intelligence agencies. In leveling this attack, the president and Mr. Spicer made a series of false statements. Here are the facts. In fact, Mr. Trump repeatedly criticized the intelligence agencies during his transition to office and has questioned their conclusion that Russia meddled in the election to aid his candidacy. He called their assessment “ridiculous” and suggested that it had been politically motivated. After the disclosure of a dossier with unsubstantiated claims about him, Mr. Trump alleged that the intelligence agencies had allowed a leak of the material. “Are we living in Nazi Germany?” he asked in a post on Twitter. Aerial photographs clearly show that the crowd did not stretch to the Washington Monument.  An analysis by The New York Times, comparing photographs from Friday to ones taken of Barack Obama’s 2009 inauguration, showed that Mr. Trump’s crowd was significantly smaller and less than the 1. 5 million people he claimed. An expert hired by The Times found that Mr. Trump’s crowd on the National Mall was about a third of the size of Mr. Obama’s in 2009. The truth is that it began to rain lightly almost exactly as Mr. Trump began to speak and continued to do so throughout his remarks, which lasted about 18 minutes, and after he finished. There is no evidence to support this claim. Not only was Mr. Trump’s inauguration crowd far smaller than Mr. Obama’s in 2009, but he also drew fewer television viewers in the United States (30. 6 million) than Mr. Obama did in 2009 (38 million) and Ronald Reagan did in 1981 (42 million) Nielsen reported. Figures for online viewership were not available. Neither number is correct, according to the transit system, which reported 570, 557 entries into the rail system on Friday, compared with 782, 000 on Inauguration Day in 2013. In fact, similar coverings were used during the 2013 inauguration to protect the grass. The coverings did not hamper analyses of the crowd size. The Secret Service said security measures were largely unchanged this year. There were also few reports of long lines or delays.'"}, "time": 1742561768.6736217}