{"duration": 0.11443376541137695, "input_args": {"text": "'PALM BEACH, Fla.  —   There will be no   this weekend outside the Borislow family’s oceanfront home here: They live across the street from      Donald J. Trump’s winter resort, and now a Coast Guard patrol boat is parked right outside their window. Mr. Trump arrived at    on Tuesday night for his first visit as  . The difference was notable: Police cars stopped trucks trying to pass down the   road approaching the estate, and dark sedans with rather   drivers were parked along the street. Coast Guard boats toured the water that surrounds both sides of the road, while a tent was set up nearby where delivery trucks were searched. News vehicles camped out a few blocks away, for a better shot of   ’s waterfront view. Shelly Borislow, standing in front of her    house, where several Palm Beach County sheriff’s cruisers were parked and officers shooed away pedestrians, had no problem with the excitement. “There are so many handfuls of people who would want to live across the street from the president,” she said. (At least, she hopes so. Her home is for sale for $27. 5 million, and she is thinking now she might have a few takers.) Palm Beach is used to accommodating all kinds of dignitaries  —   the Kennedys spent time here at their winter home when John F. Kennedy was in the White House. But the urgent need to secure Mr. Trump’s   resort and be mindful of car and pedestrian traffic seemed to take the town of less than 9, 000 by storm. Law enforcement officials have long worried about the challenges of protecting    which Marjorie Merriweather Post left to the federal government in 1973 with the intent that it would become a presidential retreat. But according to a club history provided by    the United States government eventually returned the property “due to maintenance and security concerns. ” Mr. Trump purchased it in 1985 and turned it into a membership club a decade later. Now, Mr. Trump’s ascendance means security concerns and presidential buzz are mixing in almost equal measure in this haven for the wealthy and superwealthy. Federal officials, led by the Secret Service, are overseeing an array of security restrictions. The Federal Aviation Administration has limited pilots around Palm Beach, and the Coast Guard established three security zones for the Intracoastal Waterway and offshore areas near Palm Beach. “The security zone is necessary to protect the V. I. P. and accompanying official party, the public and the surrounding waterway from terrorist acts, sabotage or other subversive acts, accidents or other causes of a similar nature,” the Coast Guard said in a statement. Breaching one of the security zones, the Coast Guard warned, could lead to heavy fines and up to 12 years in prison. Secret Service officials, as usual, were tight lipped about security issues, but Palm Beach’s public safety director, Kirk Blouin, emphasized that Mr. Trump’s visit was no stretch for the   department. “We’ve had to protect every president since I’ve worked there in my 28 years,” Mr. Blouin said. “Every president has come multiple times, including world leaders. This is nothing new to us. ” He said the agency was playing a supporting role to the Secret Service. Although he said discussing the challenges of protecting a waterfront estate was a question for the Secret Service, he added, “I think it’s almost obvious that it does present some additional challenge. ” About 20 protesters rallied near    on Saturday night for about three hours, but there were no incidents or need for arrests, Mr. Blouin said. Homeowners have been understanding about the inconveniences, he said. “It’s not bad today, but it may be worse other times,” he said. Mr. Trump has sometimes had a fraught relationship with the surrounding community.    sued Palm Beach County last year, part of a longstanding feud over its request to route air traffic away from the club. After Mr. Trump’s election, which left federal officials poised to put in place flight restrictions, the club’s legal posture changed. On Nov. 16, it asked a court to dismiss the lawsuit. Many locals took this week’s attention in stride. “All the presidents, everyone who runs for public office, comes to Palm Beach,” said Marie Hope Davis, president of the Palm Beach Republican Club and a resident of nearby Singer Island. “And the reason they do is because that’s where they raise money. ” Ms. Davis, who lived in Palm Beach for many years, said she suspected the chief side effect of a presidential outpost in Florida would be clogged streets. Ms. Davis recalled that when her aunts and uncles would visit Palm Beach, they often wanted to see where President Kennedy had stayed. And she was reluctant to describe Mr. Trump as anything resembling a true Palm Beacher. “He’s a businessman, and these clubs are his business,” she said. “I think Trump Tower, that’s his home, that’s where his heart is. ” Others wondered what the changes would mean for their bottom line. Louis Rose is selling one house around the corner from    and is in the market for another. “We’re selling, we’re buying. We’re believers,” Mr. Rose said. “I think he will hopefully begin unifying. ” One homeowner who flew in from Pennsylvania on Tuesday had mixed feelings about the extra attention and the enormous caravan of cars that accompanied the   upon his grand arrival, but was glad the authorities did not hassle residents. She would only give her first name: Mindy. “Clearly there’s a huge difference: a gazillion billion police cars everywhere, Secret Service,” she said. “I haven’t decided whether it’s a good thing or a bad thing. ”'"}, "time": 1742561869.4840753}