{"duration": 0.12639474868774414, "input_args": {"text": "\"The SPLC’s Libelous New Report on 'Anti-Muslim Extremists' Equating counter-jihadists with jihadists. Robert Spencer \\nThe objective of this libelous new report from the hard-Left money-making and incitement machine the Southern Poverty Law Center (SPLC) is made plain within it: “Before you book a spokesperson from an anti-Muslim extremist group or quote them in a story, research their background — detailed in this in-depth guide to 15 of the most visible anti-Muslim activists— and consider the consequences of giving them a platform.” \\nThey wish to silence those who speak honestly about the nature and magnitude of the jihad threat, blaming us for a supposed rise in “Islamophobia.” If they really want to stamp out suspicion of Islam, of course, they will move against not us, but the likes of Omar Mateen, Syed Rizwan Farook, Tashfeen Malik, Nidal Malik Hasan, Mohammed Abdulazeez, Dzhokhar Tsarnaev, and the myriad other Muslims who commit violence in the name of Islam and justify it by reference to Islamic teachings. \\nThe SPLC doesn’t do that because its objective is not really to stop “Islamophobia” at all, but to create the illusion of a powerful and moneyed network of “Islamophobes,” who can only be stopped if you write a check to the SPLC. That’s what this is really all about. \\nIn constructing this illusory edifice, the SPLC labels me and fourteen others “anti-Muslim extremists.” We are, of course, no more “anti-Muslim” than foes of the Nazis were anti-German, but note the word “extremists.” That’s the mainstream media and Obama administration’s term of choice for jihad terrorists. In what way are we “extremists”? Has anyone on the SPLC’s hit list (and given the SPLC’s track record of inciting violence against its targets, that is exactly what it is) ever blown anything or anyone up? Beheaded anyone? Boasted of our imminent conquest of any territory and the massacre of or enslavement of its people? No, all we have done is speak critically about jihad terror and Sharia oppression. The SPLC is trying to further the libel that we are the other side of the coin, the non-Muslim bin Ladens and Awlakis. Until we commit any terror attacks or conspire with others to do so, however, the SPLC’s libel is only that: a libel. \\nIt’s also passingly ironic that the SPLC list includes several people who are doubtless horrified to be in this company, as they have endeavored for years to distinguish their message from that of those whom they themselves would smear as “Islamophobes.” But their temporizing and pandering didn’t work: they ended up on the Index of Prohibited Thinkers anyway, as will, ultimately, anyone who dares to note that Islam just might have something to do with the acts of murder committed in its name and in accord with its teachings. \\nThe “report” as a whole stands as an example of the Left’s strange tendency to present true statements as if they were self-evidently false, without bothering to explain why. Apparently the SPLC knows its supporters and is aware that it doesn’t need to bother with troublesome things like, you know, facts. \\nThe SPLC’s hit list recurrently excoriates people for making true statements that it apparently regards as self-evidently false. For example, it says that Ann Corcoran of Refugee Resettlement Watch “accuses immigrant-run stores of illegally trafficking in food stamps.” This is a case that Corcoran makes with evidence – evidence that the SPLC doesn’t bother to try disproving. It says that Steven Emerson of the Investigative Project on Terrorism “has claimed that the Obama administration ‘extensively collaborates’ with the Muslim Brotherhood.” That he actually has done so doesn’t seem to bother them. As Andrew C. McCarthy has noted , “Barack Obama has spent his presidency cultivating Islamists, particularly from the international Muslim Brotherhood and its affiliates in the United States.” The SPLC also hits Emerison for having “asserted that Europe is riddled with ‘no-go zones.’” Regarding “no-go zones,” here are some news articles from just the past few weeks: \\nGermany: Police “sick” of citizens’ no-go zone fears \\nThe SPLC excoriates Brigitte Gabriel of ACT for America for saying that any “practicing Muslim who believes the word of the Koran to be the word of Allah … who goes to mosque and prays every Friday, who prays five times a day — this practicing Muslim, who believes in the teachings of the Koran, cannot be a loyal citizen of the United States.” Yet it says nothing, of course, about the many teachings of the Qur’an that contradict American Constitutional principles: the denial of the freedom of speech, the death penalty for apostasy, the devaluation of women, and more. How to reconcile these teachings with U.S. citizenship, the SPLC did not bother to explain. \\nThe SPLC quotes David Horowitz saying: “There are only a couple of degrees of separation between anybody on the left and the terrorists — and that includes people in the Democratic Party, even those who are anti-terrorist.” Here again, no refutation is offered – yet the Left’s dalliance with Palestinian jihad groups and overall anti-Americanism make it impossible to dismiss Horowitz’s assertion. \\nFrank Gaffney of the Center for Security Policy, we’re told, “is gripped by paranoid fantasies about Muslims destroying the West from within.” The SPLC doesn’t bother to mention the Explanatory Memorandum on the General Strategic Goal for the Brotherhood in North America , the captured Muslim Brotherhood internal document that explained that Brotherhood members “must understand that their work in America is a kind of grand Jihad in eliminating and destroying the Western civilization from within and ‘sabotaging’ its miserable house by their hands and the hands of the believers so that it is eliminated and God’s religion is made victorious over all other religions.” \\nIn attacking Pamela Geller of the American Freedom Defense Initiative, the SPLC descended to outright fabrications. Notes Geller : “Their claim that I insist that Obama is the ‘love child’ of Malcolm X is patently untrue. The SPLC also states that I ‘have spoken to a neo-fascist group in Germany,’ when in fact I have never even been to Germany.” It characterizes former FBI agent John Guandolo’s claim that CIA director John Brennan was a convert to Islam as an “outlandish accusation,” when in fact “a U.S. asset assigned overseas with Brennan in Saudi Arabia when he was station chief confirmed years ago their firsthand account that Brennan was indeed the target of a Saudi intelligence influence operation that led to his conversion. Brennan has also stated publicly that he visited Mecca, which is impossible for a non-Muslim to do unless he is a special guest of the Saudi King.” \\nEven more strangely, the SPLC targets Ayaan Hirsi Ali, a woman who grew up as a Muslim in Somalia, suffered genital mutilated at the hands of Muslims, is under death threats from Muslims, and lives in exile from her homeland because of Muslims. Instead of trying to discredit her, the SPLC should be honoring her for her stand for human rights against Sharia oppression. But the SPLC has other priorities. \\nOf me, the SPLC concedes that I am a “real intellectual” but complains that I am “entirely self-taught in the study of Islam.” An odd objection. One cannot be both “self-taught” and a “real intellectual”? In any case, it’s false: I am indeed mostly self-taught in the study of Islam, and make no secret of or apologies for it; every day’s headlines proves me correct. Nonetheless, the fact is that I did first read the Qur’an and began studying Islam in earnest while at the University of North Carolina. My claims, says the SPLC, are “provably false,” but then only offers a number of them that are demonstrably true, without any attempt to refute them. \\nIt even says that I have “referred to Barack Obama as ‘the first Muslim president.’” This one epitomizes the dishonesty of the SPLC. The quote comes from an article I wrote in 2007 discussing how Obama was not a Muslim, stating that his obvious affinity for Islam and the Muslim world could make him into “our first Muslim president” the way Bill Clinton was called “our first black president.” After eight years of Obama, I’d say I was proven correct in rather spectacular fashion. \\nThe SPLC, finally, hits me for having “even suggested that the media may be getting money to depict Muslims in a positive light.” \\nThe facts are once again deeply unfortunate for the SPLC: George Soros funded a report on “Islamophobia” on Twitter and gave $200,000 to the Center for American Progress for a defamatory report on alleged “Islamophobes.” He also spent $600,000 for favorable coverage of the Muslim migrant inundation, bought favorable coverage of the Iran deal , and bought “Islamophobia” propaganda after the San Bernardino jihad massacre. \\nBut what need does the SPLC have of facts? It knows its readers won’t check up on the veracity of its claims, but will accept them at face value, since the SPLC is of the camp of the saints, the enlightened and tolerant Left. Those who are outside that camp clearly have no rights that the SPLC feels bound to respect.\""}, "time": 1742562384.3643715}