{"duration": 0.05274486541748047, "input_args": {"text": "'Jeanine Pirro, a Fox News host, is a longtime friend of President Trump. So when Mr. Trump said on Twitter on Saturday  —   a day after his crushing defeat in the House on health care  —   that people should watch her show that night, political observers began guessing what was in store. What she delivered was a diatribe against the House speaker, Paul D. Ryan. “Paul Ryan needs to step down as speaker of the House,” Ms. Pirro, a former prosecutor, said at the opening of her show. “The reason? He failed to deliver the votes on his health care bill. ” In Ms. Pirro’s telling, Mr. Ryan let Mr. Trump down by not doing his share of the work in corralling Republican votes to fulfill a   promise to repeal and replace the Affordable Care Act  —   a view held by a number of the president’s advisers. “Speaker Ryan, you come in with all your swagger and experience and you sell ’em a bill of goods, which ends up a complete and total failure, and you allow our president in his first 100 days to come out of the box like that, based on what?” Ms. Pirro said. On Fox News on Sunday, Mr. Trump’s chief of staff, Reince Priebus, an ally of Mr. Ryan’s, said he had not spoken to the president about the Twitter post, but he called the timing “coincidental. ” Brendan Buck, a spokesman for Mr. Ryan, said, “The speaker and president talked for an hour yesterday about moving forward on the agenda, and their relationship is stronger than ever right now. ” Another spokesman in Mr. Ryan’s office said on Sunday: “The two spoke again today, and the president was clear his tweet had nothing to do with the speaker. They are both eager to get back to work on the agenda. ” On Friday, after House Republicans pulled the health care bill, Mr. Trump voiced support for Mr. Ryan, saying the speaker had worked “very, very hard. ” A person close to the president said that aides did not believe that Mr. Trump had spoken with Ms. Pirro before his Twitter post, or that he was trying to advertise criticism of Mr. Ryan’s leadership. But Mr. Trump has a long history with Ms. Pirro. During the worst weekend of the Trump campaign, when Mr. Trump was under siege over an    outtake from “Access Hollywood,” he told aides that he would do an interview with Ms. Pirro to defend himself, according to a person with direct knowledge of the conversation. He was dissuaded by aides who told him it would not be viewed as credible by voters. In their phone call on Saturday, according to a person briefed on the matter, Mr. Ryan told Mr. Trump that he wanted to proceed with a tax overhaul package. Their relationship, so far, has seemed to hold. But privately, Mr. Trump has been pressed by some advisers to consider the damage wrought by the bill’s failure, and to consider Mr. Ryan’s role. Publicly, at least, Mr. Trump was casting blame on Sunday morning not on Mr. Ryan but on the   conservatives in the House Freedom Caucus, as well as outside conservative groups.'"}, "time": 1742563226.511926}