{"duration": 0.06329512596130371, "input_args": {"text": "'VIDEOS 7 Malheur Wildlife Refuge standoff defendants acquitted in Oregon The federal trial of 7 Malheur Wildlife Refuge occupiers has come to an end and the verdict is in October 28, 2016 Via Pete Santilli/LiveStream \\nPORTLAND (INTELLIHUB) — Seven brave individuals who occupied the Malheur National Wildlife Refuge last winter in protest of the Bureau of Land Management’s treatment of the Hammond Family were acquitted of conspiracy charges Thursday as supporters cheered outside the courthouse. \\nAmmon Bundy, Shawna Cox, David Lee Fry, Jeff Wayne Banta, Neil Wampler and Kenneth Medenbach were found not guilty on all counts, however the court could not reach a verdict on Ryan Bundy regarding a theft charge. \\nThe group’s leader Ammon Bundy will remain in custody to later stand trial for another high-profile standoff which took place at the Bundy Ranch in Nevada where members of militia and the BLM pointed loaded rifles at each other. \\nAmmon’s attorney Marcus Mumford was tased in the courtroom then detained, following a small protest where he demanded that his client be set free, but U.S. District Court Judge Anna Brown said Ammon needed to be held by federal marshals until the Nevada trial. \\nOregon Governor Kate Brown (D), who ordered the FBI to act swiftly during the occupation, was not happy with the verdict, nor were other corrupt local officials, like Harney County Sheriff Dave Ward who violated the U.S. Constitution during the occupation. \\nShockingly, this case is a major victory for ranchers and Americans in general who surprisingly may still have rights. \\nBrian Cavalier, Ammon’s personal bodyguard, was sentenced earlier in the week to time served, 9 months, “but remains under a U.S. Marshals Service hold, and is expected to be transferred to Nevada, where he faces another federal indictment stemming from the 2014 armed standoff with federal agents outside controversial rancher Cliven Bundy’s ranch near Bunkerville, Nevada,” according to a report by OregonLive.com. \\nIntellihub broadcast hours of the FBI’s siege on the final four occupiers live, before and during their surrender, which you can find here . \\nYou can read more about the Malheur Wildlife Refuge standoff here . \\nShepard Ambellas is an opinion journalist, filmmaker , radio talk show host and the founder and editor-in-chief of Intellihub News & Politics. Established in 2013, Intellihub.com is ranked in the upper 1% traffic tier on the World Wide Web. Read more from Shep’s World . Get the Podcast . Follow Shep on Facebook and Twitter .'"}, "time": 1742562314.309714}