{"duration": 0.19116973876953125, "input_args": {"text": "'On Wednesday’s Breitbart News Daily, Center for Security Policy president Frank Gaffney told SiriusXM host Alex Marlow he was deeply concerned about the “Obama holdovers” that are “almost entirely populating” the Trump administration at senior levels. [Gaffney expressed dismay at the combination of these holdovers, globalists President Trump has brought into the White House, plus “a group of establishment Republicans in leadership positions, particularly on the Hill, who align pretty much with those liberal Democrats. ”  “It’s a formula for this president to be foiled at every turn, even if he’s still committed to and pursuing assiduously his agenda,” Gaffney warned. “If he starts trimming sails, or worse yet throwing ballast out of the balloon all of the things that brought him into office, it will never appease this assorted group of adversaries. I think it will simply reinforce their conviction that if they hang tough, and they hang together, they will be able to keep the swamp full of toxic waste and prevent him from draining it, let alone moving the country forward as he promised to do in the 2016 election. ” He suggested the ideas which propelled Trump to victory in 2016 are the glue that holds his unusual coalition of voters together across partisan lines, and also help to explain “why Breitbart connects so well with so many people. ” “It isn’t just on the right,” he noted. “I think it’s that Trump base, which as you know better than anybody, Alex, wound up being an awful lot of Democrats who were sick to the teeth of what their party has become: an   party. ” “I would argue that the thing that brings us together, that brought Donald Trump to the White House as much as anything, was common sense. I think that’s what you serve up in very substantial doses on Breitbart Radio, and it’s a privilege to be able to contribute to that,” said Gaffney. Asked to grade President Trump’s first 100 Days from a national security perspective, Gaffney said “there are some points that are encouraging. ” “I’m very happy with a lot of his rhetoric, notably about restoring American policy to the practice of peace through strength, which my old boss Ronald Reagan of course espoused. I like the fact that he has set his sights on rebuilding our military, ensuring that our military deterrent is once again ‘top of the pack,’ as he put it, that we have a     missile defense for example. I think some of the uses of power that he has conducted have also helped give credibility to those rhetorical statements,” he elaborated. “That’s on the plus side, Alex. On the negative side, I have to say I am very troubled that he is not pursuing what he promised  —   as I think he must  —   in regards to one particularly dangerous aspect of the national security picture, and of course that’s the phenomenon he’s called ‘radical Islamic terrorism.’ I call it sharia supremacism, but whatever term you prefer, it is very much with us,” he continued. “The thing that is most alarming to me, which causes my grade to be considerably lower than it might otherwise be  —   maybe a C,  ?  —   is the appointment of people to his national security team who do not get the threat posed by radical Islamic terrorism. In fact, some of them refuse even to call it that, which is evidence of a disconnect with this president that I think is not only a problem, but it’s undermining his effectiveness in a very critical space,” he said. Gaffney agreed with Marlow that the specter of “climate change” obsession still hangs over the national security apparatus, describing it as “a priority for Ivanka Trump and apparently for Jared Kushner, who are playing outsize roles in all aspects of the administration’s   it seems. ” “There is no question that many of the people that are either holdovers from the previous administration, or that have been brought in by this new administration, have not simply paid lip service to the Obama agenda on national security  —   whether it’s calling radical Islamic   supremacism what they used as a euphemism, ‘violent extremism,’ which really in a way meant that they could justify being as worried about returning veterans and Tea Party activists and constitutionalists as they were about Islamists  —   on the one hand, and then on the other there’s this idea that really the problem that we are confronting is actually climate change, not live human beings seeking our destruction. I think this is, again, completely at odds with common sense and the national security interests of the United States,” he warned. Marlow asked if the Trump administration is “holding Iran accountable for their pursuit of nuclear weapons adequately at this point. ” “This is a classic example of what we’ve just been talking about in the abstract,” Gaffney replied. “You had Obama holdovers who were deeply involved in bringing this disastrous deal  —   the president was absolutely right, it is arguably the worst deal ever negotiated, in fact it isn’t even a deal, nobody signed this thing  —   but it was brought to him by people who are still staffing his administration. One of them, I believe, was instrumental in getting the State Department last week to certify that the Iranians are complying with this deal. ”  “First of all, that’s not true,” he objected. “Second of all, even if they were, it would still mean they could be beavering away at a nuclear weapon, and they are. ”  “The president was furious, I’m told, when he discovered the State Department had done this,” Gaffney revealed. “It shouldn’t come as a surprise, given who’s staffing most of it below Rex Tillerson’s level. But he’s directed, apparently, Rex Tillerson to muster out the next day, Wednesday of last week, and deliver personally a statement essentially denouncing the Iranians both for the nuclear deal and for terrorism, and much much more  —   properly so. ”  “There is a certain incoherence, I think it’s fair to say, that emerged in part because people who lack common sense are still helping to guide his policy, and he’s obliged to try to correct it. This is no way to run a government,” he declared.  “I hope he will clean house at long last, both with respect to this odious deal, but also more generally, and bring in people who supported him in the campaign, who get national security the way I think he does  —   certainly the way he ran on, his platform of peace through strength. By so doing, I think we have a shot at turning this thing around. If we don’t get those changes, though, the grade is going to be a lot worse in the second hundred days, that’s for sure,” he said. Gaffney said he hoped legislators briefed by the White House on North Korea would seize the opportunity to “hear what I think is the single most ominous threat from North Korea, bar none. ” “It’s not gotten a lot of attention. Jim Woolsey, the former director of Central Intelligence under Bill Clinton, Dr. Peter Vincent Pry, among others have been warning for a long time that what the North Koreans have almost certainly done  —   and if they haven’t, they could at any moment  —   is place aboard one of their two satellites now in orbit, or future ones, a small nuclear weapon that is optimized to create something called electromagnetic pulse,” he said. “If a weapon like that were detonated over the United States  —   and those satellites overfly it all the time  —   it would be the end of our electric grid, and our nation,” he predicted. “That threat must be neutralized, Alex. I believe, I hope that’s what the administration is going to talk to them about on the Hill today and in the White House complex. Also, we need to protect the electric grid against these sorts of threats. ” Gaffney expressed gratitude to Breitbart News for “the emphasis it has placed on doing just that. ” He expected the congressional briefings on North Korea to include information about “their ballistic missile program, and about their nuclear weapons testing, and about their belligerent statements, and perhaps about the pathology of this lunatic who runs the country, and those sorts of things. ” “That’s all old news,” he noted. “I don’t know that if that’s all that is described, it will be that useful an exercise. But if, as I pray, these legislators will be told about the sorts of threats that I’ve just described, it will I hope really concentrate the minds and support what the president’s trying to do to bring the North Koreans to heel. ” Gaffney added that if China is “enabling the North Korean threat” instead of helping us contain it, “we’re going to have to do it ourselves. ” “It would start, in my judgment, with neutralizing those satellites now overhead, and ensuring there aren’t new ones put up there that could have this kind of   threat aboard them,” he advised. He noted China certainly could be helpful if it wanted to.  “They could make all the difference in the world. If they say it’s over for Kim   it’s over. But I see no evidence that they intend to do that,” he said. Gaffney pointed out that the missile canisters displayed by North Korea in recent military parades “looked an awful lot like Chinese   canisters, and they were aboard    that were provided by the Chinese. ” “Those are tangible signs that the Chinese think a more dangerous North Korea  —   one that worries us, worries us to the point where we might give them concessions, or at least give concessions to North Korea to prop up this client state of theirs  —   this is a practice, this is a policy that is being deliberately pursued by the Chinese, and has been for years,” he charged. “I don’t think they are on our side. Could they be? Yes. I don’t see evidence of them doing it just yet,” Gaffney said. “I think that the Chinese are pursuing a   strategy which has, at its core, displacing the United States as a global power, certainly in their region of the world, but I think it’s really worldwide. ”  “I think that having strong and dangerous clients like North Korea, and frankly building bases around the world, and fortifying new islands they’re creating in the South China Sea, and massing their military for future global operations are all signs that is where they’re headed. I think their policy toward North Korea is part of that larger strategic design,” he judged. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. '"}, "time": 1742562255.5251212}