{"duration": 0.04248166084289551, "input_args": {"text": "'Senator Ted Cruz ( ) introduced a bill calling for the use of $14 billion seized from cartel drug lord Joaquin “El Chapo” Guzman to be used to pay for the President’s border wall between the U. S. and Mexico. [“Fourteen billion dollars will go a long way toward building a wall that will keep Americans safe and hinder the illegal flow of drugs, weapons, and individuals across our southern border,” Senator Cruz stated, according to a statement obtained by Breitbart Texas from the senator’s office. “Ensuring the safety and security of Texans is one of my top priorities. ”  The Texas senator said that leveraging criminally forfeited assets from El Chapo and other Mexican cartel members and drug dealers can “offset the wall’s cost and make meaningful progress toward achieving President Trump’s stated border security objectives. ” Senator Cruz introduced the Ensuring Lawful Collection of Hidden Assets to Provide Order (EL CHAPO) Act on Tuesday. “The U. S. Government is currently seeking the criminal forfeiture of more than $14 billion in drug proceeds and illicit profits from El Chapo, the former leader of the Sinaloa drug cartel who was recently extradited to the U. S. to face criminal prosecution for numerous alleged   crimes, including conspiracy to commit murder and money laundering,” Cruz stated. The Mexican government extradited the former Mexican drug kingpin in January, Breitbart Texas’ Ildefonso Ortiz reported. The move to an American prison cell followed months of court battles in Mexico and multiple escapes from prison by Guzman. As part of the agreement with Mexico, Guzman will not face the death penalty in the U. S. for his crimes. Prosecutors filed murder charges against the former drug lord in relation to the killings of a U. S. citizen and two relatives. Bob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX and Facebook.'"}, "time": 1742563687.5061123}