{"duration": 0.20356011390686035, "input_args": {"text": "'In the beginning, there was the book. Famously long, and a bit of a slog. But Volume 2 Part 5 caught the cruise ship pianist’s eye. There was that beautiful girl, killing time in the big city while her fiancé was away the   flirtation with a dreamy playboy the unhappily married rich man starting to fall apart the swirl of   aristocrats, Russia at war, and a comet streaking across the sky. This section of “War and Peace,” Dave Malloy thought, would make a perfect musical. That was in 2007, on an ocean liner traveling from New York to Bermuda Mr. Malloy, a struggling musician, was earning his keep in the house band and passing the time talking Tolstoy, via email and phone calls, with his onshore girlfriend. Now, nine years later, the musical birthed from that passage, “Natasha, Pierre  the Great Comet of 1812,” is about to open on Broadway. It is one of the most anticipated shows of the season, and one of the most unusual, pairing a group of experimental downtown theatermakers with Josh Groban, a   pop singer from the mellifluous mainstream. They’re all making their Broadway debuts, as are most of the actors  —   in all, 24 members of the cast and creative team. The show, like most Broadway ventures, is an expensive gamble: in this case, a $14 million bet that what was once a wild night of   storytelling (in its first incarnation, the show provided free vodka at every table) can retain its sense of intimacy and authenticity in a vastly expanded space while broadening its appeal beyond adventurous theatergoers to the tourists who sustain commercially successful musicals. The core creative team  —   the    composer, Mr. Malloy the    director, Rachel Chavkin and the    set designer, Mimi Lien  —   is optimistic. As daunting as selling an adaptation of “War and Peace” to a mass audience may seem, Mr. Malloy notes that the   tenant of the Imperial Theater, where “The Great Comet” begins previews Oct. 18 and opens Nov. 14, was also an adaptation of a sweeping   historical novel  —   Victor Hugo’s “Les Misérables”  —   and these days no one questions that tome’s marketability as a musical. “‘War and Peace’ wouldn’t have lasted 200 years if he hadn’t really tapped into something universal,” Mr. Malloy said, speaking during an interview in his Brooklyn studio, with a portrait of Tolstoy on the wall, Christmas lights still strung over a    piano, a bookcase groaning with volumes of Marvel comics, and a bottle of whiskey atop a  . Mr. Malloy has little interest in writing the   dramas that dominate contemporary theater, and instead said he finds himself drawn to classical literature for subject matter. He first drew attention with a “songplay” celebration of “Beowulf,” is now working on a musicalization of “” and has even tried adapting the Zhuangzi, a foundational Taoist text. He jokes (or dreams?) about an “impossible novels trilogy”: “War and Peace,” “ ” and “Ulysses. ” “There’s a perverse interest in picking the texts that have a reputation as being boring,” he said. “Well, no: ‘War and Peace’ is an amazing book, and here’s all the reasons why. It’s a trashy romance novel. It’s not this unapproachable academic piece. ” The Broadway production is the fourth for “The Great Comet. ” The musical, then billed as an “electropop opera,” was commissioned by, workshopped, and first staged, in 2012, at a   Off Broadway nonprofit, Ars Nova, with 87 seats, rented costumes for the actors and Costco pierogies for the audience. “By the end of the first workshop, I remember thinking, I have no idea what’s going on, but this is going to be incredible,” recalled Jason Eagan, the company’s founding artistic director. (The show was the biggest ever undertaken by Ars Nova, and will be its first ever to transfer to Broadway.) Mr. Malloy had a strong sense of what he wanted the show to feel like, shaped by two experiences: a boozy night at Chez Poulet, a San Francisco warehouse space where “Beowulf” was performed   with actors staging their fighting among the drinkers and another at Cafe Margarita, a Moscow bar with an unmarked door where musicians were    with     diners, so crowded that Mr. Malloy had a viola at his ear. As collaborators for “The Great Comet,” he enlisted two friends who shared his passion for erasing lines between performers and audiences: Ms. Chavkin, a founder of an experimental theater company called the Team, and Ms. Lien, a college architecture major who had studied painting in Italy before finding her way to set design. “The goal from the beginning has been remarkably the same: putting the performers in close proximity to the audience members, and putting the audience members in very close proximity to each other, sitting at a table together, drinking vodka and eating bread,” said Ms. Lien, who last year won a MacArthur Foundation “genius grant” in part for her work on this show. “It’s not so much a show that you sit back and watch from a distance, but it’s an experience that you’re actually inside of,” she added. The Ars Nova staging, which ran for just 39 performances, was a sensation, as much for the environmental production as the energetic storytelling: In an effort to disorient patrons, Ms. Lien routed ticketholders downstairs and past dressing rooms into a makeshift nightclub where actors and musicians performed atop bars and between banquettes while patrons ate black bread and rattled shakers. Mr. Malloy not only conducted the   band but also played the piano and the accordion and starred as Pierre Natasha was portrayed by a recent (and radiant) Juilliard graduate named Phillipa Soo, who was later seen in the role by   Miranda and cast as Eliza in “Hamilton. ” Howard Kagan, a board member at Ars Nova, was taken with the show  —   at first, he thought of it as mostly an unusual experience, akin to “Sleep No More,” but then he began to focus on the songs, and decided, with his wife and   Janet Kagan, to test its   promise. The first commercial production, beginning in 2013, was in a tent, named “Kazino,” erected on an empty lot in Manhattan’s meatpacking district, with full dinner service (for big spenders, a seafood tower with caviar was available) and then in Midtown (this time as a supperless supper club) on a lot, as luck would have it, next to the Imperial. Late last year, “Great Comet” opened at the American Repertory Theater in Cambridge, Mass.  —   the first time in a   house, as a chance to test how the enveloping design and peripatetic players might work in a conventional auditorium. Each production featured vodka (on Broadway, to be sold by vendors walking through the aisles) and free pierogies (on Broadway, served flaky and in boxes, after the   variety tested in Cambridge proved too messy). But with each move, the show has changed: songs rewritten and replaced, an ensemble and then roving musicians hired, a dance break inserted. A handful of defining visual elements have remained: a bleak, unexpected entrance passage (meant to evoke images of a Cold   bunker) a performance space cocooned entirely in red velvet drapery (opulence) walls covered with Russian paintings hung   (aristocracy) multiple chandeliers (the opera) including one giant “Sputnik” chandelier (a comet). The Imperial is being rejiggered to preserve the immersive feel: a couple hundred people will be seated on the stage new internal staircases will permit performers to move between orchestra and mezzanine there will be side tables with lamps and egg shakers interspersed among the seats, along with snaking platforms to allow for elevated action by actors. Among those who came to check out the tent production was Mr. Groban, who has sold more than 35 million albums and DVDs and has long wanted to perform theater. He tweeted his enthusiasm for the material later, the Kagans, looking for a star who could help them justify a Broadway transfer, reached out to him, just as he was also urging his agent to look for stage roles. After an introductory phone call (at 4 a. m. for Mr. Malloy, who was then in Berlin) Mr. Groban, Mr. Malloy and Ms. Chavkin met at the Weather Up bar in TriBeCa as they all began imagining what it might be like for the famed singer to take direction from emerging artists. “I didn’t at all want to push myself into this project, but I wanted to make my interest known,” Mr. Groban said. “It had to be something they felt would be right. ” Mr. Malloy wound up visiting the singer’s apartment, so the two could see what it felt like to sing through, and talk about, the score. “I didn’t want to work with a diva,” Mr. Malloy said. “It turned out he’s supercollaborative. ” Over the last few weeks, as Mr. Groban wrapped up a tour and began preparing for rehearsals, Mr. Malloy has been looking for places to trim the score, while Ms. Lien has overseen construction of the set at Hudson Scenic Studio in Yonkers. Ms. Chavkin has been holed up with her choreography team at the New 42nd Street Studios, moving pennies around theater blueprints to try to plot entrances and exits and quick costume changes. Broadway beckons  —   the production bigger and grander, but, they hope, at heart unchanged. “The whole beauty of the show is to make you feel like stuff’s happening everywhere, and that everyone’s having a different experience but no one is missing a central action,” Ms. Chavkin said. “We want to make sure everyone is feeling the life of the show. ” With each step toward Broadway, “Natasha, Pierre and the Great Comet of 1812” has grown. Ars Nova, 2012 SEATS 87 PERFORMANCES 39 PERFORMERS 16 CHANDELIERS 10 PAINTINGS 59 Kazino,   SEATS 199 PERFORMANCES 303 PERFORMERS 25 CHANDELIERS 11 PAINTINGS 147 American Repertory Theater,   SEATS 503 PERFORMANCES 33 PERFORMERS 34 CHANDELIERS 21 PAINTINGS 273 Imperial Theater, 2016 SEATS 1, 200 BEGINS Oct. 18 PERFORMERS 43 CHANDELIERS 31 PAINTINGS 414'"}, "time": 1742564026.0444174}