{"duration": 0.017536401748657227, "input_args": {"text": "'By Daily News Bin | October 31, 2016 | 3 776 SHARES \\nEven as the heat continues to rise on Donald Trump due to his extensive connections to the Russian government and other Russian entities, new revelations are coming out of the woodwork. Senator Harry Reid has revealed that the FBI has been investigating the Russian hackers for months whose actions benefited Trump’s campaign. And now a group of respected computer scientists has uncovered the secret computer server that Trump has been using to coordinate with the Russians. \\nThe group of computer scientists, whose work has been verified by Slate and vouched for by other members of the cybersecurity community, initially thought they might have uncovered Russian malware. But in studying the specific patterns of data flow, they instead determined that it represented two way communication. While they can’t be certain, their belief based on studying the data patterns is that these communications are emails. Another outside computer scientist was asked to verify the evidence, and he confirmed that it did indeed represent “human-level communication.” \\nSo just whom has Donald Trump been privately coordinating all this time? Alfa Bank, the largest bank in Russia. \\nThis falls in line with the months-ago admission by Donald Trump Jr. that his father has taken on a growing and disproportionate amount of investment (read: debt) from the Russians since he entered the presidential race. Couple that admission with this new revelation that Trump has been secretly coordinating with the Russians to whom he’s suddenly become so egregiously in debt, and it becomes clear why Senator Reid has outed the ongoing secret FBI investigation in question. Read the extensive Slate investigation into Donald Trump’s Russian server. If you enjoy Daily News Bin, consider making a contribution: Contributed by Daily News Bin staff 776 '"}, "time": 1742628537.8244894}