{"duration": 0.05831432342529297, "input_args": {"text": "'Updated, 9:08 p. m. Good evening on this   Monday. This is New York Tonight, a   evening roundup of the day’s most important New York stories. Tell us what you think at nytonight@nytimes. com or in the comments. Sigh. The workweek for many commuters got off to a shaky start. Two New Jersey Transit buses heading into the city collided in the Lincoln Tunnel during the morning commute, shutting down the tunnel’s center tube and snarling traffic for roughly two hours. More than forty people were injured, but luckily, the worst case was a broken jaw. And speaking of drama related to Hudson River crossings, all eyes are (still) on the George Washington Bridge. David Wildstein, the confessed mastermind behind the 2013 lane closings, returned today to the witness stand in Newark. The former official from the Port Authority of New York and New Jersey testified that he and other members of New Jersey Gov. Chris Christie’s inner circle did want to punish Democratic Mayor Mark Sokolich of Fort Lee, N. J. for declining to endorse Mr. Christie in the Republican governor’s 2013   campaign. And they had deliberately decided to do so during the first days of school. “The purpose was to create as big a traffic jam as possible,” Mr. Wildstein said. We leave you, now, to settle onto the couch to watch the first debate of the 2016 general election campaign for president. The   between Hillary Clinton and Donald J. Trump  —   straight from Long Island, at Hofstra University in Hempstead  —   covered topics including the economy, crime statistics and climate. Live analysis, video and fact checks from reporters were on our live blog. • In bittersweet news, Gov. Andrew M. Cuomo signed a bill today that will allow New Yorkers to be buried in the same cemeteries as their pets. [New York State] • NYC Transit has paid a hefty $431 million to settle lawsuits with people injured by Metropolitan Transportation Authority buses and trains. [Daily News] • Part of Greenwich Street disappeared when the first World Trade Center came along, and it was wiped from the map again on  . But now, we’re seeing its resurrection. [New York Times] • Here’s how architects and urban planners are helping to reduce crime around the city. [DNAInfo] • . .. And here’s why the Bronx may be the city’s new arts hot spot. [Crain’s] • On tonight’s sports front: Yankees at Blue Jays, 7 p. m. (YES). Mets at Marlins, 7:10 p. m. (SNY). • For a global look at what’s happening, see Your Evening Briefing. • Looking ahead: The writer and actor Regina Ress shares stories from   in “Compassion, Generosity and Grace,” on Tuesday at the New York Public Library. ‘Sharing a Breeze With a Baby’ The air conditioning on the arriving downtown No. 6 train was working just enough that a smattering of straphangers was visible through the window. Stepping in after ten minutes waiting on the steamy Astor Place platform, and with my    strapped to my chest, I didn’t dare make a dash for the next car. Instead, we grudgingly eased ourselves into a seat by the door. “You look hot. ” I glanced up to find a young woman, dare I say a millennial, dressed in a white maxi dress and gold strappy sandals. “Yes,” I said, blowing air onto my baby’s flushed face. “Let me help you,” she said, moving from her seat across the car. “I’m switching at the next stop,” I said in an attempt at a polite refusal. From her bag, she produced an iPhone and a   fan blade, everything white like her dress. She plugged the fan into the phone’s charging slot. As it came to life, she turned the gentle breeze toward my baby. “I’ve never seen one of those,” I said. “I just got it at Duane Reade,” she said. “I thought it was a joke. ” The beads of sweat forming across her brow and upper lip threatened her perfect hair and makeup, but her only apparent concern was my son. “Thank you,” I said. “He’s adorable,” she said, but offered no other small talk, swiveling the fan between him and me all the way to Bleecker Street. “I’m moving to the next car,” I said as the train came to a stop. I looked back to thank her again, expecting her to follow my move. She was still sitting, eyes closed, finally taking her turn. Read all recent entries and our submissions guidelines. Reach us via email diary@nytimes. com or follow @NYTMetro on Twitter using the hashtag #MetDiary.'"}, "time": 1742628500.887037}