{"duration": 0.04246973991394043, "input_args": {"text": "'Students4Justice, a student activist group at the University of Michigan, is demanding campus officials provide them with “a permanent designated space on central campus for Black students and students of color to organize and do social justice work. ”[The student activists are disappointed with school administrators and launched a petition aimed at University President Mark Schlissel. They claim he has shown “lackluster leadership” in “protecting the safety” of   students on campus.  The activist group spent the last month marching on campus, holding   and even protested outside of Schlissel’s home “in the middle of the night. ” “Our president has blatantly ignored us and it is time for us to speak up. We have been told that our demands are ‘rude,’” states a Facebook post. “We are calling on someone to care about students’ concerns and to lead us with integrity and help us fight against the oppression and hateful acts that try to destroy us and our community. ” The Michigan Review  —   an independent student news outlet that first reported Student4Justice’s list of demands  —   reports the group’s insistence on a segregated space for students of color to launch social justice projects is raising eyebrows, given that the university has already begun construction on a $10 million center for   students in the center of campus. “The same organization that criticizes the University for failing to create ‘an environment that engages in diversity, equity and inclusion,’ is calling upon the University to undermine these ideals by facilitating a sort of de facto segregation? One where space and resources are designated for students based solely on the color of their skin?” the Michigan Review reported. “To advocate for the ideals of diversity, equity and inclusion, while simultaneously calling upon the University to sanction these spaces on campus is both unprincipled and laughably regressive. ” Students4Justice’s list of demands, the College Fix reports, insists that school administrators offer  “‘marginalized” students ‘when oppressive attacks occur,’ increasing the affirmative action of ‘Black, Arab, and other PoC’ in tenured faculty, more readily alerting students on campus of ‘bias incidents,’ and offering more financial aid for those of lower socioeconomic status. ” “Our president has blatantly ignored us and it is time for us to speak up. We have been told that our demands are ‘rude,’” states a Facebook post. “We are calling on someone to care about students’ concerns and to lead us with integrity and help us fight against the oppression and hateful acts that try to destroy us and our community. ” Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742562654.9365742}