{"duration": 0.11075019836425781, "input_args": {"text": "'Rep. Phil Roe ( ) talked about his vote in favor of the American Health Care Act (AHCA) with SiriusXM host Raheem Kassam on Friday’s Breitbart News Daily. [Kassam observed that the Breitbart News Daily audience appeared to be leaning “about 60 percent against” the AHCA because they do not see it as a full repeal of Obamacare or a bold enough step toward getting government out of the health insurance industry.  “A yes vote was an obvious vote for me because the ACA is failing,” said Roe, referring to Obamacare by its legislative name, the Affordable Care Act. “A third of my district this coming year  —   maybe more  —   have no options whatsoever. We’re going to be an Obamacare desert in Tennessee within a year. There’s not going to be anywhere to buy insurance on the ACA. So it’s failed, just like it has in Iowa, just like it is in many places across the country. ”  “The premiums have skyrocketed. The    have gone up. I’ll give you an example locally, the hospital where I practiced for over 30 years,” Rep. Roe, who is a retired medical doctor who also served in the U. S. Army Medical Corps, said. “It’s a large system, a   system: 9, 000 employees 60 to 70 percent of the uncollectable debt are people with insurance  —   not without insurance, with insurance. Their   and    are skyrocketed, and they can’t pay the bills. ” “It wasn’t a matter of not doing anything,” said Roe. “The Republican Study Committee asked me two terms ago to write an alternative to the Affordable Care Act, which I did, and I did it again in the last Congress. We put our ideas out there. ” He said the implementation of those ideas was limited by congressional rules and the large number of votes required to pass a bill. “I agree with people: if I’d have had my way and a magic wand, this bill would have looked differently,” he conceded. “There would have been more free market principles in it. But we got as far as we could get and get the votes. ”  “And by the way, that vote would have been stronger  —   we were five representatives short on our side yesterday,” he added. “We had five people, one out for personal reasons, and then four out in the Trump administration. People have forgotten that in the 2010 vote, the Democrats had 257, not 237, and they passed it by five votes, I believe. So it was a similar vote. Big things like this are hard to do. I understand people’s frustration that it didn’t go far enough. Believe me, this was a giant step, in my opinion  —   positive, not negative. ” Kassam asked about the AHCA’s potential to defund Planned Parenthood and whether such a provision has a chance of surviving in the Senate. “We’ll have to see what the Senate does,” replied Roe. “My hat’s off to them. This is hard work. Look, we spent hours and hours and hours getting to where we were, getting to 216 votes with hiccups and starts. ” “I am a   obstetrician,” he declared. “I’ve delivered almost 5, 000 babies in my career before I retired and ran for Congress. Money from the federal government ought to go into health care. What we decided, we have 141 federally qualified health centers that provide health care in the state of Tennessee and three Planned Parenthood clinics. So we want to put that money where health care is going on, not abortions. ”  “This was a   step. We’ll see what the Senate does. I think most of us are very happy about that, Raheem,” he said. Roe noted that Planned Parenthood provides services other than abortion. “They do sexually transmitted disease screening. They do breast exams, pap smears,” he said. However, he added, “I don’t think any of their clinics actually do mammograms. I think they refer those out. ” “I know this was a big part for some people but a relatively small part of that whole package,” he said of the Planned Parenthood funding issue. “In the state of Tennessee  —   I got this off of the Planned Parenthood website it’s not a number I’m making up  —    they did 918 breast exams in 2016 in the three clinics in the state of Tennessee. I saw myself, just one doctor, between three and four thousand patients a year, every year. ” Roe disagreed with the criticism that the AHCA merely does some “tweaking” of Obamacare, as Kassam put it, rather than substantially repealing the ACA. “Remember, this is only the first part of this, Raheem,” Roe reiterated. “This is all we could get in reconciliation, meaning it just takes 51 votes in the Senate. Again, I go back to the Senate rules. We were hamstrung because of what we could do. We passed already across state lines and association health plans. That’s already been passed over to the Senate. Now, the Senate will filibuster that. ”  “I’m not saying there are not ways you can get around it and do it. Remember, we have a Secretary of HHS, Tom Price, who can also do a lot of things just executively with the stroke of a pen,” he added.  “What we’re trying to do  —   and I did a terrible job of this when we first debated the healthcare bill  —   this part of the market we’re talking about, this individual and   market, is seven percent of the entire insurance market,” said Roe, adding that “160 million of us get our insurance through our employer. There are already ERISA protections in there for   conditions. There is no   exclusion if you have Medicaid, which 74 million people do. ”  “And by the way, this is the first major reform of Medicaid in decades, maybe since it was established,” he continued. “About 57 million people get insurance through Medicare, where there is no   condition exclusion. What we tried to do was create a market in that seven percent to reconstruct the small market. It’s been destroyed by Obamacare. I mean, we have well over a third of the counties in this country, of the 3, 000 or so counties in America, that only have one choice, and that’s going up every day. That market has been destroyed. This will help recreate it. ” Roe said there were other free   features of the Obamacare replacement bill worth praising, such as the expansion of health savings accounts.  “This is just the beginning,” he promised. “Look, if I could have taken the bill I had written and passed it with 216 votes, as written, it would look different. We want to recreate a situation where doctors and patients are making choices, not bureaucrats. ”  “If we fail at this, if we fail with making it where it’s cheaper, where more people can buy insurance, and the quality goes up, then we will have failed. I admit that fully. I think we can hit those targets, and I believe you can do that,” he said. “This is my third iteration of healthcare reform. I was involved in the Tenncare reform in the nineties in Tennessee, which was a failure,” Roe recalled. “I wrote an editorial in 2010, Raheem, about what I thought would happen to the ACA because of what I had seen almost 20 years before, and it exactly came true. ”  Roe argued that Obamacare has failed, according to its own standards and goals. “It’s intention was to increase access and decrease costs. Well, the costs have just gone through the roof. If we don’t do something with the cost of health care in this country, nobody is going to be able to afford it,” he warned. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. '"}, "time": 1742563212.022273}