{"duration": 0.05474495887756348, "input_args": {"text": "'Unthinkable Politics and the Bodies of Children   \\nBy Henry A. Giroux / Truthout Bo / (CC BY-ND 2.0) \\nAs the distinction between the truth and lies fades in public life, politics appears to be increasingly emptied of any substance. As Lucy Marcus has observed , “Nowadays, facts and truth are becoming [more] difficult to uphold in politics (and in business and even sports).” Certainly, in the age of Trump there is a great deal of evidence to suggest that the appeal to reason, informed judgment and facts is at odds with the current political culture. That is, truth and evidence have gone the way of the electric typewriter, or so it seems. \\nAmericans seem to have a growing fondness for ignorance, an attitude that reinforces the downsizing of the civic function of language. Falsehoods and deceptions no longer appear marginal to political debate but now seem to shape much of what is said by the presidential candidates. This is shockingly true for Trump, who has organized much of his campaign around endless fabrications, sending fact checkers into a frenzy of activity. When Trump is caught in a falsehood, he simply ignores the facts and just keeps on lying. His followers could care less about whether he deceives them or not. \\nOn the other hand, Hillary Clinton has earned a reputation as a chameleon, willing to say almost anything to promote her political career, regardless of whether she sacrifices the truth in order to do so. Her email scandal is largely read as symptomatic of a more pronounced and deeper level of dishonesty. Consequently, she is viewed mostly by the general public as untrustworthy. In response, she has managed her truth deficit by invoking her lifelong defense of families and children. For instance, during the second debate she claimed she wanted “America to be for our children” and attempted to bolster her concern for the welfare of children by pointing to her early work with the Children’s Defense Fund. In the third presidential debate, she argued against Trump’s call for exporting 11 million immigrants by stating that she was against his deportation policies because she “didn’t want to rip families apart [and was against] sending parents away from children.” In her political television ads, she points to supporting policies that “will invest in schools and colleges [and will work to] develop an economy where every young American can find a job and start a family of their own.” \\nAdvertisement Square, Site wide \\nUnfortunately, Clinton only focuses on managing some of the problems that young people face, rather than doing anything to change the conditions that produce them. For instance, she says nothing about what education should accomplish in a democracy when educational policies are driven by a neoliberal economy that she supports. And while she talks about providing jobs for young people, she has little to say about transforming rather than adjusting an economy marked by wide gaps in inequality, wealth and power. \\nMatters of power, state violence, extreme poverty, institutional racism, a broken criminal justice system, the school to prison pipeline and the existence of the mass incarceration state, among other important matters, rarely if ever enter her discourse and yet these are major issues negatively affecting the lives of millions of children in the United States. And her alleged regard for children falls apart in light of her hawkish policies on global regime change, drone attacks and cyber-warfare, and her unqualified support for the warfare state. Her alleged support for children abroad does not capture the larger reality they face from when their countries are invaded, attacked by drones and subject to contemporary forms of indiscriminate violence. Rather than critique the US as a powerful engine of violence, Clinton expands its imperialist role around the globe. This is a key point in light of her defense of the rights of children, because her warmongering ideology puts children in the path of lethal violence. \\nAt the same time, Clinton’s promise to address the problems many children face in the United States reeks of a disingenuousness made visible by her history of siding with and supporting policies that were injurious to children. Not only did she once disparagingly call young people super-predators, but as the First Lady she strongly backed her husband’s campaign to “end welfare as we know it.” President Clinton’s welfare policies did great harm to poor children. They eliminated the Aid to Families with Dependent Children federal assistance program and infuriated Marian Wright Edelman, the president of the Children’s Defense Fund, to the degree that she ended her working relationship with Hillary Clinton. According to Edelman , the bill represented a frontal assault on the well-being of poor children and families. Yet as late as 2008, Hillary was still touting this pernicious welfare bill as a success. She also supported Bill Clinton’s “tough on crime” policies, which, according to Michelle Alexander , “resulted in the largest increase in federal and state prison inmates of any president in American history”—which has a devastating effect on the families and children of color. Finally, Clinton supported Bush’s invasion of Iraq, which led to the deaths of hundreds of thousands of children. \\nOccupying the right wing of the Democratic Party, Clinton has aligned herself with a war culture that supports drone warfare and continues to support military policies that result in the needless deaths of millions of children in the Middle East, Yemen, Somalia, and other places that bear the brunt of America’s foreign policy. It is difficult to imagine, given Clinton’s coziness with the financial elite, big corporations, the military-industrial complex and the reigning war culture, that she will do anything that will lessen the violence to which children, both at home and around the globe, will face under her potential reign as President of the United States. Clinton has nothing to say about the need for a collective struggle for economic and political justice. Given her past history, Clinton’s disingenuousness becomes even starker next to the images of war and violence that mark the bodies of youth both in the United States and abroad. Her commitments to war and security have been built on the misery, mutilation and deaths of young people and her recent alleged support for the welfare of children does little to cover up the many ways capitalism, militarism, state violence and racism are killing poor Black and Brown youth. \\nRethinking the Horrors of War \\nThe horrors of war became painfully visible when the image circulated of the lifeless body of Aylan (Alan) Kurdi, a three-year-old who washed up on a beach face-downin the coastal town of Bodrum, Turkey, on September 2, 2015, while traveling with other refugees toward the Greek island of Kos. A second haunting image appeared on August 17, 2016, showing five-year-old Omran Daqneesh, bloodied and covered with dust, sitting silently in an ambulance after an airstrike on Aleppo, a city in northern Syria.'"}, "time": 1742628587.6836245}