{"duration": 1.6560447216033936, "input_args": {"text": "'WASHINGTON  —   The Environmental Protection Agency has concluded that hydraulic fracturing, the oil and gas extraction technique also known as fracking, has contaminated drinking water in some circumstances, according to the final version of a comprehensive study first issued in 2015. The new version is far more worrying than the first, which found “no evidence that fracking systemically contaminates water” supplies. In a significant change, that conclusion was deleted from the final study. “E. P. A. scientists chose not to include that sentence. The scientists concluded it could not be quantitatively supported,” said Thomas A. Burke, the E. P. A. ’s science adviser, and deputy assistant administrator of the agency’s Office of Research and Development. The report, the largest and most comprehensive of its kind to date on the effects of fracking on water supply, comes as   Donald J. Trump has vowed to expand fracking and roll back existing regulations on the process. His choice to run the E. P. A. Scott Pruitt, the attorney general from Oklahoma, has built his career on fighting E. P. A. regulations on energy exploration. Among Mr. Trump’s key energy policy advisers are Harold Hamm, the chief executive of Continental Resources, an energy firm that has been at the forefront of the fracking boom, and Representative Kevin Cramer, Republican of North Dakota, a state transformed by fracking. Now that team must contend with scientific findings that urge caution in an energy sector that Mr. Trump wants to untether. Mr. Burke said that the new report found evidence that fracking has contributed to drinking water contamination in all stages of the process: acquiring water to be used for fracking, mixing the water with chemical additives to make fracking fluids, injecting the chemical fluids underground, collecting the wastewater that flows out of fracking wells after injections, and storing the used wastewater. Still, Mr. Burke said that the report remained “full of gaps and holes,” and that the issue required far more study. He declined to offer policy recommendations based on the study, saying that it will “give a lot of information to help communities and decision makers do better in protecting water supplies. ” What kind of audience the new team of decision makers will be seems clear. In September, Mr. Trump promised a corporate conference of fracking executives in Pittsburgh: “The shale energy revolution will unleash massive wealth for America,” as he vowed to end regulations on fracking. “I think probably no other business has been affected by regulation than your business,” he told the gas executives. “Federal regulations remain a major restriction to shale production. ” Fracking is subject to only light federal regulations. The Obama administration has put forth one rule intended to protect water from fracking waste. But that rule applies only to fracking on public lands, which hold about 100, 000 fracking wells  —   representing about 10 percent of all fracking in the United States. The vast majority of fracking occurs on state or private land and is governed by state and local regulations. Environmentalists seized on the new report as evidence that the federal government should strengthen federal protections on fracking. “This report acknowledges what far too many communities across this country know to be true  —   fracking is a threat to our clean drinking water,” said Madeleine Foote, the legislative representative for the League of Conservation Voters. “Given E. P. A. administrator nominee Scott Pruitt’s record of fighting fracking regulations, it will be important during the confirmation process for senators to ask him if he will follow the recommendations of his agency’s scientists, or continue to rely on industry spin,” she said. Fracking advocates dismissed the report. “Even the new statement is still consistent with the finding that contamination attributable to shale development is neither widespread nor systemic,” Scott H. Segal, a fossil fuel lobbyist with the firm Bracewell Law LLP, wrote in an email. “But evidence of contamination is highly anecdotal and often overblown by the exaggeration often associated with litigation. The vast majority of   professional organizations and governmental officials have found shale development to be highly consistent with environmental protection and energy policy objectives. ” The E. P. A has been working on the report since 2010, when it was requested by Congress. Mr. Burke called the study unprecedented in scope and depth, saying it included a review of over 1, 000 existing studies as well as new research, modeling and analysis conducted by E. P. A scientists. In the process of completing the study, the E. P. A. produced 13   reports and published as many studies in scientific journals.'"}, "time": 1742563442.6420183}