{"duration": 0.10101580619812012, "input_args": {"text": "'In the days leading up to and after Betsy DeVos’s confirmation as secretary of education, a hashtag spread across Twitter: #publicschoolproud. Parents and teachers tweeted photos of their kids studying, performing, eating lunch together. People of all races tweeted about how public schools changed them, saved them, helped them succeed. The hashtag and storytelling was a rebuttal to DeVos, who called traditional public schools a “dead end” and who bankrolled efforts to pass reforms in Michigan, her home state, that would funnel public funds in the form of vouchers into religious and privately operated schools and encouraged the proliferation of   charter schools. The tweets railed against DeVos’s labeling of public schools as an industry that needed to adopt the   principles of competition and choice. #Publicschoolproud was seen as an effort to show that public schools still mattered. But the enthusiastic defense obscured a larger truth: We began moving away from the “public” in public education a long time ago. In fact, treating public schools like a business these days is largely a matter of fact in many places. Parents have pushed for   policies that encourage shopping for public schools that they hope will give their children an advantage and for the expansion of charter schools that are run by private organizations with public funds. Large numbers of public schools have selective admissions policies that keep most kids out. And parents pay top dollar to buy into neighborhoods zoned to “good” public schools that can be as exclusive as private ones. The glaring reality is, whether we are talking about schools or other institutions, it seems as if we have forgotten what “public” really means. The word derives from the Latin word publicus, meaning “of the people. ” This concept  —   that the government belongs to the people and the government should provide for the good of the people  —   was foundational to the world’s nascent democracies. Where once citizens paid taxes to the monarchy in the hope that it would serve the public too, in democracies they paid taxes directly for infrastructure and institutions that benefited society as a whole. The tax dollars of ancient Athenians and Romans built roads and aqueducts, but they also provided free meals to widows whose husbands died in war. “Public” stood not just for how something was financed  —   with the tax dollars of citizens  —   but for a communal ownership of institutions and for a society that privileged the common good over individual advancement. Early on, it was this investment in public institutions that set America apart from other countries. Public hospitals ensured that even the indigent received good medical care  —   health problems for some could turn into epidemics for us all. Public parks gave access to the great outdoors not just to the wealthy who could retreat to their country estates but to the masses in the nation’s cities. Every state invested in public universities. Public schools became widespread in the 1800s, not to provide an advantage for particular individuals but with the understanding that shuffling the wealthy and working class together (though not black Americans and other racial minorities) would create a common sense of citizenship and national identity, that it would tie together the fates of the haves and the   and that doing so benefited the nation. A sense of the public good was a unifying force because it meant that the rich and the poor, the powerful and the meek, shared the spoils  —   as well as the burdens  —   of this messy democracy. Achieving this has never been an easy feat. The tension between individual striving and the common good, between the beliefs that strong government protects and provides for its citizens and that big government leads to tyranny, has always existed in this country. As a result, support for public institutions and expansive government has ebbed and flowed. When Franklin Delano Roosevelt, in response to the Great Depression, ushered through the biggest expansion of federal programs in our nation’s history, he did so because he thought that government regulation was necessary to empower common people against corporations and banks but also that government should provide certain protections for its citizens. Under the New Deal, we got Social Security and unemployment insurance. Federal housing projects  —   public housing  —   meant quality dwellings for the nation’s working people. Federal works projects employed millions of    Americans and brought infrastructure to communities that had not been able to pay for it on their own. At the same time, the New Deal stoked the ire of a   antiregulation minority, who began to push back, though it would take some decades before their views became mainstream. They promoted   principles, deregulation and the privatization of functions normally handled by the government and sought to define all things  —   like the benefits of education  —   strictly in terms of their economic value. Nonetheless, Roosevelt’s government expansion was widely supported, and Americans elected him to an unprecedented four terms as president. But the broad support of public programs and institutions hinged on a narrow definition of who that public was: white Americans. To get his New Deal passed, Roosevelt compromised with white Southerners in Congress, and much of the legislation either explicitly or implicitly discriminated against black citizens, denying them many of its benefits. As the civil rights movement gained ground in the 1950s and 1960s, however, a series of court rulings and new laws ensured that black Americans now had the same legal rights to public schools, libraries, parks and swimming pools as white Americans. But as black Americans became part of the public, white Americans began to pull away. Instead of sharing their public pools with black residents  —   whose tax dollars had also paid for them  —   white Americans founded private clubs (often with public funds) or withdrew behind their fences where they dug their own pools. Public housing was once seen as a community good that drew presidents for photo ops. But after federal housing policies helped white Americans buy their own homes in the suburbs, black Americans, who could not get   mortgages, languished in public housing, which became stigmatized. Where once public transportation showed a city’s forward progress, white communities began to fight its expansion, fearing it would give unwanted people access to their enclaves. And white Americans began to withdraw from public schools or move away from school districts with large numbers of black children once the courts started mandating desegregation. Some communities shuttered public schools altogether rather than allow black children to share publicly funded schools with white children. The very voucher movement that is at the heart of DeVos’s educational ideas was born of white opposition to school desegregation as state and local governments offered white children vouchers to pay for private schools  —   known as segregation academies  —   that sprouted across the South after the Supreme Court struck down school segregation in 1954. “What had been enjoyed as a public thing by white citizens became a place of forced encounter with other people from whom they wanted to be separate,” Bonnie Honig, a professor of political science and modern culture and media at Brown University and author of the forthcoming book “Public Things: Democracy in Disrepair,” told me. “The attractiveness of private schools and other forms of privatization are not just driven by economization but by the desire to control the community with which you interact. ” Even when they fail, the guiding values of public institutions, of the public good, are equality and justice. The guiding value of the free market is profit. The   charters DeVos helped expand have not provided an appreciably better education for Detroit’s children, yet they’ve continued to expand because they are profitable  —   or as Tom Watkins, Michigan’s former education superintendent, said, “In a number of cases, people are making a boatload of money, and the kids aren’t getting educated. ” Democracy works only if those who have the money or the power to opt out of public things choose instead to opt in for the common good. It’s called a social contract, and we’ve seen what happens in cities where the social contract is broken: White residents vote against tax hikes to fund schools where they don’t send their children, parks go untended and libraries shutter because affluent people feel no obligation to help pay for things they don’t need. “The existence of public things  —   to meet each other, to fight about, to pay for together, to enjoy, to complain about  —   this is absolutely indispensable to democratic life,” Honig says. If there is hope for a renewal of our belief in public institutions and a common good, it may reside in the public schools. Nine of 10 children attend one, a rate of participation that few, if any, other public bodies can claim, and schools, as segregated as many are, remain one of the few institutions where Americans of different classes and races mix. The vast multiracial, socioeconomically diverse defense of public schools that DeVos set off may show that we have not yet given up on the ideals of the public  —   and on ourselves.'"}, "time": 1742628578.6822875}