{"duration": 0.06332969665527344, "input_args": {"text": "'Wednesday for his show’s “Opening Monologue,” Fox News Channel host Sean Hannity took aim at NBC News a day after Rachel Maddow, host of MSNBC’s “The Rachel Maddow Show,” released President Donald Trump’s 2005 taxes.  Hannity categorized Maddow’s effort as being part of what he called “the   propaganda media” and offered other examples in addition to Maddow of attacks on Trump. Partial transcript as follows: NBC’s corporate jihad against President Donald Trump continues. Plus, a new report from Circa News shows the investigation into a server connected to Donald Trump was, in fact, a politically motivated hit job pushed by a   Hillary Clinton donor. By the way, that’s tonight’s “Opening Monologue. ” All right, NBC has now hit a new low by releasing the president’s tax returns, or a small portion of them, last night. But what we’re seeing from the alt left propaganda destroy Donald Trump media  —   it’s not new. Now that Donald Trump occupies the Oval Office, the opposition party press is going to new extremes and lows to try and take down his presidency, and they won’t stop until he’s out of office. Now, I’ve been saying since 2008 right here on this program journalism is dead. Now it’s in the ground, buried, flowers on top. And last night’s political hit job by NBC is just the latest example in the media’s long list of attacks against the president. Here’s just a small sampling. (END VIDEO CLIP) UNIDENTIFIED MALE: Here you have a deranged president, or a pathologically lying president, lying about the operations of the American government and lying about the previous president of the United States. That’s enough to invoke the 25th Amendment, but Mike Pence and the cabinet are not there yet. UNIDENTIFIED MALE: When he said today “America first,” it was not just a racial  —   I mean, I shouldn’t say racial, the Hitlerian background to it  …     UNIDENTIFIED FEMALE: I understand why so many people voted for him. I understand where you were coming from. I understand why you liked him. But this man is lying to you. UNIDENTIFIED MALE: Trump’s critics, those who are worried about this president and this White House, saw a live special television event brought to you by narcissism, thin skin, chaos and deeply personal grievances. UNIDENTIFIED MALE: This was a whitelash. This was a whitelash against a changing country. It was a whitelash against a black president in part. And that’s the part where the pain comes. UNIDENTIFIED MALE: This is a really sad night. I’m just going to say it. This is a very sad night for the country. You can’t polish this turd. UNIDENTIFIED MALE: I don’t know  —   are you using the word lie or falsehood? What are you  —   what are you  …     UNIDENTIFIED MALE: Yes. (CROSSTALK) UNIDENTIFIED MALE: I mean, I think you have use  —   the word  —   the word  —   you have to call it what it is. UNIDENTIFIED MALE: It was interesting because I saw Sean Spicer on FOX News, and he said that you were rude. And I thought  …     (CROSSTALK) UNIDENTIFIED MALE: What if you had called him a fake president? (END VIDEO CLIP) HANNITY: Beyond awful. And when the alt left propaganda media isn’t doing what you just saw and attacking the integrity and mental health of the president, well, they’re running wild all kinds of bizarre conspiracy theories about the Trump campaign colluding with the Russians. Now, what the biased press refuses to tell you  —   there is zero  —   no evidence whatsoever that shows any kind of collusion. Well, that didn’t stop the leader of the   propaganda media, Rachel Maddow herself, from going off the deep end last night, claiming that in 2005, a Russian oligarch knew that Donald Trump was going to be president, so he bought a property from him in Florida and Trump made a huge profit, more than two times what he paid for it! And as I said last night, Maddow thinks that somehow, maybe Russia knew in 2005 that Donald Trump would be elected president in 2016. Unfortunately, NBC News didn’t think that was possible even on election night. Now, that’s pretty pathetic, and the media should know better, but they’d rather put their radical   agenda than telling the truth to the American people. That’s why they never vetted Obama. That’s why they colluded with Hillary. Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742563278.3537054}