{"duration": 0.061717987060546875, "input_args": {"text": "\"But God’s law ? \\nUm…no thank you. \\nLaw apart from God is beautiful to most Americans. Law defined by God is abhorrent to most of the same people. \\nThink about that and you’ll quickly get clarity as to why we are where we are in America. \\nJust swap “law” for “God’s law” and the otherwise adored and championed concept as embraced and proclaimed throughout the land by gajillions of supposedly God-loving American people suddenly becomes something to fear, avoid, run away from, deny, ignore, work around and/or generally malign. \\nReplace “law” with “God’s law” and you will find most “conservative Christian” types in America flipping like a switch in conversations about how government and law ought to be approached here in *ahem* God’s creation. \\nMuch like the concepts freedom, liberty, prosperity, success, and peace, the concept of law has been thoroughly separated from God in the minds of most politically active conservatives claiming the name of Christ in America. \\nIn short, it is self-described conservative Christians in America who have long modeled the open contempt for God’s Law that has led us to where we are now. \\nTalk about the importance of generic law in America, and these people will cheer and champion your cause. \\nTalk about the importance of God’s Law in America, and they’ll more often than not rail against the notion and turn on your personally for even bringing the idea into focus. \\n“We the People” are God in practice , after all. \\n“We the People” are free to define our own approach to reality based on our (ever-shifting) standards as we see fit, at least as far as most politically active professing Christian conservatives in the land are concerned. \\nDon’t believe me? \\nJust ask ’em what they think about “law.” \\nLet them go on as long as they like in response. Ask obvious follow-up questions honestly and encourage them to give detailed answers. \\nThen, after they’ve made their view of law and its role in America plain, ask ’em the same question about God’s Law and its binding authority over America and every other part of God’s creation. \\nArticle reposted with permission from Fire Breathing Christian Don't forget to Like Freedom Outpost on Facebook , Google Plus , & Twitter . You can also get Freedom Outpost delivered to your Amazon Kindle device here .\""}, "time": 1742562053.3435957}