{"duration": 0.14172124862670898, "input_args": {"text": "'Cerrar Normas comunitarias \\nEl registro y la autorización del usuario en las páginas web de Sputnik a través de una o varias cuentas implica la aceptación de las siguientes reglas y condiciones de uso. \\nEl usuario se compromete a respetar la legislación nacional e internacional, a dirigirse de forma respetuosa a los demás participantes en los foros, a los otros lectores, así como a las personas mencionadas en las noticias y reportajes. \\nLa administración se reserva el derecho a eliminar los comentarios realizados en otro idioma distinto al usado en el contenido principal del material presentado. \\nLos comentarios publicados por los usuarios en todas las versiones de la web sputniknews.com pueden ser editados. \\nEl comentario del usuario será eliminado si: no se corresponde con la materia comentada; incita al odio, la discriminación racial, étnica, religiosa, social, sexual o menoscaba los derechos de las minorías; viola los derechos de los menores, pudiéndoles provocar daños de cualquier índole, en especial morales; contiene ideas de carácter extremista y terrorista o que inciten a cometer acciones ilegales; contiene insultos, amenazas contra otros usuarios, individuos u organizaciones, denigra la dignidad o perjudica su reputación comercial; contiene insultos o mensajes que expresan una falta de respeto al personal que trabaja en Sputnik; viola la privacidad, divulga datos personales de terceros sin su consentimiento, revela secretos sobre la correspondencia particular; contiene descripciones o hace referencia a escenas de violencia y crueldad hacia los animales; contiene informaciones sobre métodos de suicidio o incita a cometerlo; persigue objetivos comerciales, contiene publicidad engañosa, propaganda política ilegal o enlaces hacia otros recursos ‘online’ que contengan tales informaciones; promueve productos o servicios de terceros sin la debida autorización; contiene lenguaje ofensivo y obscenidades; contiene correo no deseado (\"spam\"), promueve el envío de estos mensajes o servicios de correo masivo y recursos para ganar dinero en Internet; promueve el consumo de narcóticos o sustancias psicotrópicas, contiene informaciones sobre su producción y utilización; contiene enlaces a virus u otro software dañino; forma parte de acciones de movilización, en las que se envían grandes volúmenes de comentarios con contenido idéntico o similar (\"flash mob\"); el autor envía un gran número de mensajes incoherentes, cuyo significado sea difícil o, incluso, imposible de entender (\"flood\"); el autor viola las reglas de comportamiento en internet, mostrando un comportamiento agresivo, humillante o abusivo (\"trolling\"); el autor del mensaje no acata las reglas básicas del lenguaje y su texto contiene en su mayoría letras mayúsculas o no tiene los espacios correspondientes entre palabras, por ejemplo. \\nLa administración tiene derecho a bloquear el acceso del usuario a la página o a eliminar su cuenta sin previo aviso en caso de una violación de las normas de publicación de comentarios o si en sus acciones existen indicios de violencia. \\nEl usuario puede iniciar la recuperación del acceso a su cuenta enviando un mail a la siguiente dirección: \\nEl mensaje debe contener: Asunto: Restauración de la cuenta/desbloqueo del acceso Nombre de acceso del usuario Las explicaciones sobre el motivo de las acciones que acabaron en una violación de las reglas y en el consiguiente bloqueo. \\nLa restauración de la cuenta o el desbloqueo del acceso se efectuarán sólo si los moderadores lo consideran adecuado. \\nEn caso de violación reiterada de las condiciones de uso y un nuevo bloqueo, el acceso del usuario no podrá ser restaurado y, en consecuencia, el bloqueo será definitivo. \\nPara comunicarse con el equipo de moderadores, por favor, escriba al siguiente correo electrónico: Iniciar sesión '"}, "time": 1742563313.3119345}