{"duration": 1.2337141036987305, "input_args": {"text": "'  Camden, New Jersey: One Of Hundreds Of U.S. Cities That Are Turning Into Rotting, Decaying Hellholes   December 15th, 2013 \\nAll over America, formerly prosperous communities are being transformed into crime-infested wastelands of poverty and despair. Of course the most famous example of this is Detroit . At one time, Detroit was the greatest manufacturing city that the world had ever seen and it had the highest per capita income in the entire country. But now it has become a rotting, decaying hellhole that the rest of the planet laughs at. And of course Detroit is far from alone. There are hundreds of other U.S. cities that are suffering a similar fate. In this article, the focus is going to be on Camden, New Jersey, but the truth is that there are lots of other “Detroits” and “Camdens” all over the nation. Jobs and businesses are leaving our cities at a staggering rate, and what is being left behind is poverty, crime and extreme desperation. \\nEarlier this month, Rolling Stone published an article that took a hard look at the nightmare conditions that exist in Camden. A city that once made Campbell’s soup and some of this nation’s most famous warships is now a national disgrace. The following are six of the best quotes out of that article… \\n-“In September, its last supermarket closed, and the city has been declared a “food desert” by the USDA. The place is literally dying, its population having plummeted from above 120,000 in the Fifties to less than 80,000 today.” \\n-“Their home is a city with thousands of abandoned houses but no money to demolish them, leaving whole blocks full of Ninth Ward-style wreckage to gather waste and rats.” \\n-“With legal business mostly gone, illegal business took hold. Those hundreds of industries have been replaced by about 175 open-air drug markets, through which some quarter of a billion dollars in dope moves every year.” \\n-“On January 18th, 2011, the city laid off 168 of its 368 police officers, kicking off a dramatic, years-long, cops-versus-locals, house-to-house battle over a few square miles of North American territory that should have been national news, but has not been, likely because it took place in an isolated black and Hispanic ghost town.” \\n-“After the 2011 layoffs, police went into almost total retreat. Drug dealers cheerfully gave interviews to local reporters while slinging in broad daylight.” \\n-“The carnage left Camden’s crime rate on par with places like Haiti after its 2010 earthquake, and with other infamous Third World hot spots, as police officials later noticed to their dismay when they studied U.N. statistics.” \\nYou can read the rest of the article right here . But as bad as things have become in Camden, this should not be a surprise to most of you. The reality is that this kind of rot and decay is happening in communities all over the United States. \\nOver in Detroit, crime has gotten so bad that even the police are telling people to “ enter Detroit at your own risk “. When you call the police in Detroit it takes them an average of 58 minutes to respond, and more than 90 percent of the crimes committed in the city end up as unsolved mysteries. \\nAt this point, 60 percent of all children in Detroit are living in poverty, and there are approximately 78,000 abandoned homes in the city. \\nFor much more on all this, check out the statistics in this article , and you can find some great photos of the “ruins of Detroit” right here . \\nSo why is all of this happening? \\nWell, there are lots of factors involved of course, but the biggest one is the lack of good jobs in these cities. \\nAt one time, Detroit had the largest and most prosperous middle class in the entire nation. But now those days are long gone. \\nAnd what is happening to Detroit is precisely what is happening to America as a whole. Our good jobs are disappearing and the middle class is being systematically destroyed . \\nIn order to have a middle class, you have got to have middle class jobs. \\nThere is no way around that. \\nAnd right now, hordes of young people are graduating from college and discovering that the middle class jobs that they were promised simply are not there. \\nCNN recently profiled a 37-year-old college graduate named Bobby Bingham. Because he cannot find a good job, he is forced to work four low paying jobs… \\nBobby Bingham works four jobs in Kansas City, Missouri, yet he has very little to show for it. \\nBingham is 37 years old and has a college degree, but like many Americans, is stuck working many hours in low wage, part-time jobs. \\nEach week, he works a total of about 60 hours in his jobs as a massage therapist, a waiter at a Mexican restaurant, a delivery man for sandwich chain Jimmy John’s and a receptionist at his massage school. \\nBingham makes approximately $400 a week, which works out to about $20,000 a year. He has come to the conclusion that he may never be able to make enough to support a family… \\n“I’ve come to the point in my life where I wonder if I can ever support a family,” he said. “I have no idea how that’s ever going to logically happen.” \\nThat deeply saddened my heart when I read that. Here is a young man that wants to get married, have a family and do all the right things, but the economy is so bad that he fears that this may never be possible for him. \\nAs I have written about previously, the economic downturn that we are experiencing right now has hit men particularly hard . The number of men in their prime working years that do not make enough money to support a family is rising with each passing year, and this is causing massive problems in this country. \\nAnd when our politicians proclaim that all we need is “more education”, I feel like vomiting. The U.S. population as a whole has more “education” today than it ever has had before. \\nIf you think that “more education” is the answer, then check out the following excerpt from a recent interview with a law school graduate that is making about $40,000 a year and that has about $200,000 in law school debt… \\nYes, it’s extremely hard to get by. I can’t afford rent or a car and can barely afford food. Anything extra like enjoying myself with friends, going to a movie, traveling, etc. — that’s all out the window for the foreseeable future and possibly for the rest of my life thanks to law school. I live with my parents. I don’t have a car. I don’t go out to socialize. I don’t date. I don’t buy new clothes. I don’t buy electronics. I don’t buy much of anything. I spend my free time working other jobs to put more money toward my debt. I do contract work for other lawyers, but the pay is very low and payment is sporadic. \\nWhy did this happen to him? Well, the truth is that there are way, way too many law school graduates. There are not nearly enough good jobs for all of them. In fact, this particular law school graduate deeply regrets ever going to law school and considers it “an extraordinary waste of money”… \\nI consider law school a waste of my life and an extraordinary waste of money. I feel like I was duped and tricked. At the end of the day, it’s my own fault for being a sucker and I learned an extremely hard lesson. Because I went to law school, I don’t see myself having a family, earning a comfortable wage, or having an enjoyable lifestyle. \\nBut at least he has a job. There are millions of college graduates that do not. And there are hundreds of thousands of other college graduates that are currently working as waiters and waitresses. Large numbers are also working temp jobs or standing behind registers in retail stores. \\nOver the past decade, tens of thousands of businesses and millions of good jobs have left this country. The quality of the jobs that remain continues to decline at a frightening pace , and most of the new jobs that are being “created” these days are part-time jobs. \\nBut you won’t hear the mainstream media or our most prominent politicians talk about these things much. You won’t hear them talk about the fact that median household income in the United States has fallen for five years in a row or about the fact that the rate of homeownership in the United States has fallen for eight years in a row . \\nThe middle class is dying . \\nWake up America. \\nAnd even as millions of our jobs have been shipped to the other side of the planet, some of the most prominent “American companies” have been bought up by foreigners. The following list comes from a recent Economy In Crisis article … —– \\nHere are some of America’s most famous brands currently held in foreign hands: Budweiser, now owned by Anheuser-Busch InBev N.V., which is based in Leuven, Belgium Alka-Seltzer, now owned by German company Bayer Schering Pharma AG Ben & Jerrys, now owned by British-Dutch Unilever AMC theaters, now owned by the Chinese 7-Eleven, now owned by the Japanese company, Seven & I Holdings Woman’s Day Magazine, now owned by the French company, Hachette Filipacchi Médias, S.A Purina, now owned by the Swiss company, Nestle Gerber, now owned by the Swiss pharmaceutical giant, Novartis Firestone, now owned by the Japanese Bridgestone Corporation Citgo, now owned by the government of Venezuela French’s Mustard, now owned by Reckitt Benckiser, a British conglomerate Frigidaire, now owned by Sweden’s AB Electrolux The Plaza Hotel in New York City, now owned by Israeli billionaire Yitzhak Tshuva’s El-Ad Group Trader Joes, now owned by German billionaires Karl and Theo Albrecht Dial soap, now owned by Henkel KGaA, based in Dusseldorf, Germany Sunglass Hut, now owned by Italian eyewear seller Luxottica Group —– \\nAre you starting to get the picture? \\nOur economic infrastructure is being absolutely gutted and more than 46 million Americans are now living in poverty. \\nAnd if you are waiting for the jokers in Washington D.C. to fix things, you are going to be waiting for a very, very long time. \\nOver the past several years, both the Democrats and the Republicans have proven again and again that they are basically completely and totally useless. In fact, just about everything that they try to do actually makes our problems even worse. \\nIn just a few days, Barack Obama leaves for a 17 day holiday vacation in Hawaii. Many have criticized him and the members of Congress for taking so much time off, but perhaps that is the best thing that they can do at this point. As long as they are away from Washington D.C., at least they won’t be making things even worse for all the rest of us. Dent, Faber, Celente, Maloney, Rogers – What Do They Say Is Coming In 2014? » MegaLiberty74 \\nIt’s the deindustrialization of America by big government through taxations, fines, fees, extreme regulations, etc. Eventually, the business owner who can’t pay in D.C. to get exempted from such criminal government as like we are seeing with Obamacare, they throw their hands up and say DONE. \\nWho’s John Galt? This was all predicted and it’s basic economics. JoeD \\nJohn Galt was a creepy celibate perv who settled on being dirty thirds with Dagny Taggart. \\nAmerica as an industrial power could never compete with the rest of the world once the rug was pulled out from under its feet. You blame taxes and regulation but that’s what comes with maintaining a first world country. No way to compete with the China’s of the world that are willing to poison their people with toxic pollution and have billions of people willing to work for slave wages. Of course instead of choosing to protect ourselves we decided it would be a better idea to save a few bucks at Walmart. jox \\nTo reduce the taxes you should cut military expenses, not healthcare nor education. Sonar \\nSo tell that to communist China and Russia which are both increasing military expenditures while spending very little on social services for their people? some-buh-day \\nAnother masterpiece, Michael. That last paragraph is golden lol. Don’t forget that people are leaving the country in record numbers also 1stworlder \\nThose are productive people trying to go Galt to somewhere with lower taxes Chris \\nRoss Perot warned us this would eventually happen, but we failed to listen. In all honesty, we deserve everything we’re getting now. We voted for all of this. Politicians realized a long time ago that most people were uniformed about what was happening around them, thus allowing them to pass these ludicrous trade agreements that only benefited a handful of individuals. I’m afraid it’s too late to save the ship now. Rodster \\nIt was the “giant sucking sound”, so true. Mondobeyondo \\nThe “giant sucking sound” is coming from DC. 2Gary2 \\nthe giant sucking sound is conservative policies sucking the wealth of the middle class up to their 1% who they exclusively represent. Sonar \\nthe giant sucking sound is progressive/liberal/leftist/socialist/communist policies sucking the wealth of the middle class up to their 1% cronies like George Soros along with bankers and hedge funds managers who put their stooge into the White House dbomb12 \\nDon’t forget the “CONSERVATIVE” heritage foundation supported NAFTA. The left / right paradigm is the real divider. All polititcians are part of the same culb and we are not in it FUKyiah \\nWHAT conservative policies? What planet are you from? I’ll bet your parents were related BEFORE they got married. nestazhe265 \\nAunty Elena got a real nice Porsche Boxster by working off of a computer… Read Full Report B\\xadi\\xadg\\xad2\\xad9\\xad.\\xadℂ\\xado\\xadm FounderChurch \\nWe need more of THE RIGHT KIND, and fewer of the wrong kind. By that I mean dumb America haters and I think you would qualify on both counts. Why do you pretend to be so dense and dumb? You know what I meant to start with, and if you are too slow to get it, well then, I just told you. Pablo Solano \\nLaughable. Spouting meaningless rubbish. It saddens me to think of the trees that produced oxygen that has been wasted on you. GSOB \\nI didn’t vote for any of this. In fact, I voted for Ross Perot. Geoff Gariepy \\nRoss Perot was looking out for Ross Perot. Mondobeyondo \\nSo did I. He would have made a difference if he had been elected. But this is a democracy, er, constitutional republic, and the people wanted Clinton. Kannin \\nThe people didn’t want Clinton! He won with less than 50% of the vote. Ross Perot only served to divide the conservative vote. djc \\nI voted for him twice. Its all really hopeless at this stage of the game. JulietteofOhio \\nWE don’t deserve this and WE didn’t fail to listen.There just weren’t enough of US to make a difference, but WE are suffering along with everyone else. I do agree it’s too late to save the ship. J Hall \\nAnd the opportunity is likely to come sooner than most expects. Mondobeyondo \\nHow did these politicians get to such high levels of power? Someone voted for them. We don’t have coup d’etats in America (or do we?) \\nDetroit is my favorite example of mismanagement. And NO, it has NOTHING to do with black politicians in charge for the past 60 years there. It’s government mismanagement, Kannin \\nIt was mismanagement and the unions. At the same time the government was growing too large too fast… and giving in to the public unions, the private unions were killing manufacturing jobs. What followed was fewer jobs and higher taxes to help support the bloated city. Then the wealthiest and the middle class fled to the burbs, and left the city to the poorest… who cannot afford to support the massive amounts of infrastructure and retirees. You can draw a very clear line between Detroit, Michigan and 20 other cities and states… St. Louis, Chicago, California and Illinois to name a few… mismanaged by liberal governments and unions… both, private and public. Annette Smith \\nI am so surprised that California has not declared bankruptcy. I don’t know how it gets along. Used to live there, and glad we don’t anymore. El Pollo de Oro \\nChris: to this day, I hate Rush “Pillhead” Limbaugh with a passion for trashing Ross Perot. Pillhead was a big supporter of NAFTA and called Perot a racist for opposing it. But Perot was absolutely right about that “giant sucking sound.” Americans ignored Perot at their own peril, and I think you’re right about it being too late to save the ship now. Welcome to the Third World. Chris \\nEI Pollo de Oro: NAFTA and the rest of the free trade agreements were never meant to help us “little people.” Its sole purpose was to turn First World countries into Third World dumps. If they pass the Trans-Pacific Partnership, then it’s lights out for good. El Pollo de Oro \\nChris: That’s exactly what NAFTA (No American Factories Taking Applications) was designed to do: turn major developed economies into Third World toilets. And CAFTA made things even worse because it sent out a message that if globalists though minimum-wage workers in México were overpaid, they could always move to countries that are even poorer (Honduras, Guatemalan, El Salvador). Globalism is truly a race to the bottom just as Perot predicted. Sequoia \\nNAFTA also screwed the Mexican people,because it wiped out all of the small family farms.Now the campesinos in Michoacan and other agriculture areas have to compete with the big Agribusiness corpotations in the USSA, and of course they can’t compete with them. The campesinos went broke and could’t compete and some of them had no choice than abandon their farms and try to cross the border ilegally into the USSA,to find work and survive. If there was no NAFTA,most of these people would have stayed in their home states,in Mexico Farming and surviving. NAFTA has screwed the Amaeicans, Mexicans and Canadians El Pollo de Oro \\nSequoia: Excellent point about how badly NAFTA hurt campesinos in México. Although globalists won’t admit it, there’s a major connection between NAFTA and all the narcoviolencia south of the border. When campesinos lost their livelihood, los carteles took full advantage of that and put them to work. Sonar \\nNAFTA was signed into law by President Bill Clinton on December 8, 1993 and entered force January 1, 1994. Although it was signed by President Bush, it was a priority of President Clinton’s, and its passage is considered one of his first successes by the Democrat Party. El Pollo de Oro \\nSonar: NAFTA is one of the many reasons I’m neither a Republi-con nor a Democrap. Clinton and Gore supported NAFTA along with Rush “Pillhead” Limbaugh and the Heritage Foundation. It was bipartisan rape of the American economy. So, bienvenidos, americanos, al tercer mundo. Annette Smith \\nAlways, follow the money. Danger_Close \\nLimbaugh had always been for the Establishment GOP and for Multi National Corporations. He has never cared about what’s best for The Republic   or it’s citizens. \\nHe threatened to leave for Singapore if Obama was reelected, yet for some reason, he’s still in West Palm Beach. \\nAmericans ignored Perot, as the ignored Paul. Trouble is, both were right. El Pollo de Oro \\nDanger Close: Pillhead Limbaugh also threatened to move to Costa Rica because of the Unaffordable Care Act, which gave me a good laugh because in many parts of Latin America, he would be a prime candidate for the dreaded Desperate People Doing Desperate Things Tax. Pillhead might be OK in Costa Rica, which is one of the safer countries in Latin America. But in Venezuela, El Salvador, Guatemala, Mexico, Honduras or Colombia, he would be a prime candidate for a kidnapping. The kidnappers/DPDDTT collectors are no joke in those countries. GSOB \\nI like Rush more than I know you. Annette Smith \\nRush was okay when he started. He has become filthy and vulgar. He has been outright disgustingly trashy. I no longer listen to him for years. No one in my family does, anymore. Once you have to resort to vulgarity, you’re nothing. Sally Q \\nNo, not all of us voted for this crap…many of us either refused to vote (don’t bother with the arguments…), or voted for somebody such as Ron Paul…the problems are not voting; the problems are the banking / corporate conglomerates and various multinational organizations such as the CFR that own the governments of most countries and are deliberately orchestrating these events. If you don’t believe it, do some investigating into the Federal Reserve, the Rothschilds, the Bilderbergs, Trilateral Commission, Council on Foreign Relations and other related people and organizations. Put it together and understand. Chris \\n” the problems are the banking / corporate conglomerates and various multinational organizations such as the CFR that own the governments of most countries and are deliberately orchestrating these events” You just made my point. Like I said in my original post, voting is the problem because the majority keep on voting for politicians who are in cahoots with corporate conglomerates, etc. theblues77 \\nExactly. You can’t write an accurate article or frame the debate accurately without STARTING with NAFTA. bertinanth764 \\nmy Aunty Caroline got Buick Verano Sedan by working part time at home online. my latest blog post B\\xadi\\xadg\\xad2\\xad9\\xad.\\xadℂ\\xado\\xadm GSOB \\ntroll John O’Neill \\nAmen to all of that. It is not just Obama/Biden who caused much of this but it is the millions of Americans who voted for them and who still champion their affirmative action virtuous government. Americans brought this on themselves and as Mencken once said “democracy is people getting what they deserve and getting it good and hard”. Rufus T Firefly \\nDoes the Rolling Drone article point out that, like Detroit, Camden is a Democratic city that voted overhelmingly for Obama? They are getting the hellhole they deserve. WarriorClass III \\nCamden was 89 percent white in 1940 (104,842 out of 117,536 residents), and it was thriving. It attracted a steady flow of black migrants in search of jobs (that they didn’t create, nor could they sustain). By 1980, the city was 53 percent black (45,009 out of 84,910 residents). Only 26,003 white people remained. \\nThis is how the city of Camden died — no more white residents paying the taxes or maintaining some form of civilization to support the city. Eventually, the same non-white population that overwhelmed Camden started to overwhelm the white suburbs surrounding the city. \\nDemography is destiny. \\nYou meant race is destiny. Mondobeyondo \\nRace.. is the 100 meter dash. 1stworlder \\nits inverse. The race that usually wins 100 meter dashes loses out at the math test at payday loan offices. luchia \\nYou are so correct warrior. I live in Camden on Erie St., in 1953. I was a great neighborhood. No crime, but petty stuff. We then moved to N. 24th St. No crime, except the petty. When I would go out and play, Mom would say, be home before dark, and at ages 8,9,10,11, etc., I was gone ALL day long. Couldn’t call Mom either, no phone, oh also no cell phone (lol). Nice clean neighborhoods both of them. Then they build Abbott Village for the low income people and slowly the place deteriorated, it seem like wild fire, slowly thugs and people from Puerto Rico, blacks took over, and it went to crap. Once the whites moved out, it started to become what it is today. Drove thru there about 2 yrs. ago, it was disgusting. Sequoia \\nLos Angeles CA has also turned into a hellhole which is expanding to one day turn all of Southern California into one. Sonar \\nInland California is filled with bankrupt hellholes like Stockton and San Bernardino. Annette Smith \\nSo true, so true! Those of us who grew up there know this to be the absolute truth. Did you know that Los Angeles is filled with illiterate people? There was a news report on the amount of illegals there. So many, now that the whites have moved out, that they are the main population group in Los Angeles city…and they are illiterate. Google it for the story. de malfosse \\nluchia; I also lived on Erie St until ’69. There is no public acceptance of that which we witnessed. Hellfire1968 \\nBaltimore is the way and it is getting worse. k \\nThey shouldnt have been brought from africa then. Blame politicians, not people. JulietteofOhio \\nThere’s not a lot we can do about that, now. Politicians didn’t bring them, it was a business, and a very bad one, which has ongoing ramifications for all of us. We’re still stuck trying to take care of them, and they’re still busily biting the hand that feeds them. k \\nIts not the ones who are being fed, its the ones who arent. k \\nAnd businesses and politicians have been hand in hand since millenia. They are two sides of the same coin. Hammerstrike \\nWho elected the politicians? That´s right! \\nSome are more guilty than others but if you are looking for the guilty, you only need to look into a mirror! k \\nPeople elect politicians believing they will do something good. Now if politicians do something bad instead, its their fault not the peoples. The only other alternative is not to vote…and a lot of people do that already. k \\nI dont know how i missed your comment. Kim \\nThis is racist. The failure of Camden and other us cities is connected to de-industrialization which can be connected to an even bigger cause, namely, peak oil in the United States in 1970. I’m not talking about fracking potentials, but cheap, easily-recoverable oil with large investment to energy recovered ratios. After we drained our wells circa 1970, industrialization declined and the jobs (money) went away and the poor were left inhabiting places like Camden and Detroit. This has nothing to do with the color of anyone’s skin. The only connection I see between race and poverty is lack of opportunity, and the governments refusal to be honest and manage the wind down of industry in a rational way. Eventually, we will all be living in similar Camdens, or worse. \\nThe weapons of mass instruction have done their damage. There are far more poor whites without opportunity than non-whites in America, yet it’s the non-whites that are responsible for more than 80% of the crime. \\nThe ten most dangerous cities in America all have non-white majority populations, new FBI data has revealed. \\nThis not-so-surprising news is just the latest piece of evidence that emphasizes a clear correlation between increased non-white immigration and soaring crime figures. \\nRefer to The New Century Foundation’s The Color of Crime (2005), an American report on the differences in crime rates by race. It found that: \\n• Blacks are seven times more likely than people of other races to commit murder, and eight times more likely to commit robbery. \\n• Hispanics commit violent crimes at roughly three times the white rate. \\n• Of the nearly 770,000 violent interracial crimes committed every year involving blacks and whites, blacks commit 85 percent and whites commit 15 percent. \\n• Blacks are an estimated 39 times more likely to commit a violent crime against a white than vice versa, and 136 times more likely to commit robbery. \\n• Blacks are 2.25 times more likely to commit officially-designated hate crimes against whites than vice versa. \\n• Only 10 percent of youth gang members are white. \\n• Hispanics are 19 times more likely than whites to be members of youth gangs. Blacks are 15 times more likely, and Asians are nine times more likely. \\n• Blacks are seven times more likely to be in prison than whites. Hispanics are three times more likely. \\nYou can keep making excuses for these people, but the facts don’t change. The problems you mention affect us all, but it’s the non-whites committing the crimes. Kim \\nDepends on where u live. I don’t believe criminal behavior is oriented in one’s racial DNA, just as I don’t believe one is homosexuality in the womb and from birth. \\nEnvironment, social status, economic status, inequality, and culture play primary roles in adult behavior. \\nThen u have the added problem of substance abuse. \\nLet’s take a comprehensive look at these statistical outcomes before we make conclusion that if you’re born black or mexican you are destined to have an 80% more probability to commit a violent crime than your white counterparts. Until there is actually something isolated in the human genome pertaining to race and criminal behaviors, I   any reason to take a racist attitude toward crime. WarriorClass III \\nTo some extent it does seem to depend upon where you live. Minorities in Texas are less violent than in other parts of the country. Nevertheless they are still more violent than whites and there are far more whites that are subjected to adverse pressures with regard to the things you mention, like environment, social status, economic status, inequality, drug use and cultural issues. Overall, non-whites are more impulsive and violent and the strongest correlation is race rather than any other factor. This is just observation of the facts, not racism. Whites are not angels, but you don’t see these problems in majority white cities and neighborhoods. Kim \\nIt could be cultural, intellectual and emotional as well. It is well known that Italians are hot tempered. Does that mean they are hot tempered BECAUSE they are Italian? Not necessarily, I am of English heritage mostly and my family is very even tempered. But we have our issues. GSOB \\nGood point Spain is the only Hispanic nation with more bookstores than woman/male donkey shows. Hammerstrike \\n“Minorities in Texas are less violent than in other parts of the country.” \\nEveryone is, because there are a lot of guns there! GSOB \\nP = Perseverance of the Saints 1stworlder \\nIQ has been proven to be at least 85% genetic. This plays out in choices like “should I take a 500+%APR payday loan” or “should I rob a liquor store for $200, which could put me in prison, and prevent me from getting a job at a liquor store” China towns have been some of the poorest neighborhoods in US history but had even less crime than white hoods. Asians are able to succeed because they evolved under similar circumstances as Europeans. Kim \\nOk, no way. Not genetic, it’s environmental, in other words, related to the way you are raised, taught, what sort of examples you have had, I will reach and give u the benefit of nutritional influences. Genetics? Please. No way — this line of thought is akin to predestination, and I don’t believe in predestination, however, if we are talking about some sort of genetic defect, I am open to that. Are u talking about some sort of mental defect that has been diagnosed by a medical doctor? 1stworlder \\nNutrition can only affect it negatively and no one in the US on foodstamps is going to be that deficient. Studies have been done on identical twins separated at birth. The genes for IQ would give no advantage to people in an R style evolution set up where they have to outbreed diseases, High IQ only helps those evolving in K style evolution. If it was environmental 4th generation Hispanics would be able to compete with whites. Reality is what still exists when you stop believing in it. The avg IQ for east Asians is 106, whites 100, Mexicans 90, US/DR blacks 85 and African/Haiti blacks 70. Haiti and the Dominican Republic share a land mass but the avg IQs between the 2 is as great as US vs African blacks due to the histories of each side of the island. Haitis side killed all whites & mixed after slaves where freed while the DR only killed white males. Annette Smith \\nCulture. And, the fact that the way your mom and dad brought you up, generally creates your destiny. Oh, that’s culture. Hammerstrike \\nLook further than peak oil or even wages, it is still more expensive for China to get oil than for the US and A. \\nThe Federal Reserve and central banks in europe, through inflation, are redistributing profits from manufacture and other businesses to themselves and their cronies, they backed bloated governements that are sucking national economies even drier. \\nAs for race… Sonar \\nPeak oil have been proven to be a failed theory put out by alarmists in the environmental movement who refuse to acknowledge the fact that oil production is INCREASING! In 2003, the Bakken formation in North Dakota was producing a mere 10,000 barrels a day. Today, it is over 400,000 barrels, and North Dakota has become the fourth-largest oil-producing state in the country. Such “tight” oil could add as much as two million barrels a day to U.S. oil production after 2020—something that would not have been in any forecast five years ago. \\nOverall U.S. oil production has increased more than 10% since 2008. Net oil imports reached a high point of 60% in 2005, but today, thanks to increased production and greater energy efficiency (plus the use of ethanol), imports are down to 47%. Kim \\nThe Bakken oil play is a joke. As are all fracking operations. Hammerstrike \\nNot when biological warfare, economic collapse and pandemies are involved! Gay Veteran \\n“…So why is all of this happening? Well, there are lots of factors involved of course, but the biggest one is the lack of good jobs in these cities….” \\nI expected this article to bring out the people who wants to blame minorities instead of the multi-national corporations. \\nattributed to Jay Gould: “I can hire one half of the working class to kill the other half.” Mondobeyondo \\nYou know, whenever you discuss Detroit’s politics you run the risk of being racist. \\n*sigh* \\nUmmm.. you know? I’m tired of hearing the old tired arguments that “anywhere black people run the government, trouble is sure to follow”. \\nJust gonna touch on a couple brief points as my time is limited. \\nLadies and gentlemen, may I present….. \\nExhibit #1 The late Nelson Mandela. Black guy, held in prison for 27 years, ran for president, and won. South Africa is a worse, um BETTER country because of Nelson Mandela. \\nIf there was an African American Republican in charge of Detroit, would it have been any different? Really? I don’t know. Maybe, maybe not. English Kev \\nSouth Africa is better,yeah? That’s what you’re saying,right? Jeesh. \\nNope,, didn’t say that at all. Peter \\nThere was only one person who walked on water, and it wasn’t Mandela. There was a reason Mandela went to jail. Did you know his wife put tires around peoples necks and set them on fire. While he was busy organizing car bombing in the city. Does the Liberal media or schools teach this. Or are they too busy renaming the school after him. Anonymous \\nHave you asked some of the South African farmers if they think S.Africa is a better country after Mandela? jox \\nObviously the people that benefited from segregation and racism feel that life was better with the former social structure. Do we have to worry about them? 1stworlder \\nDuring apartheid there was always heavy immigration as it was better than any black nation. Kim \\nIt absolutely would not have made one bit of difference whether a democrat or a republican black or white was running Detroit. Detroit was built on cheap oil. It was a city that thrived on industrialization and collapsed under its own weight when de-industrialization began, and the poor were left holding the bag. Race is so completely irrelevant in the collapse of Detroit and Camden, I find it bizarre that we are even discussing it. Just give it time, we will all be living in Camdens of our own soon enough. De-industrialization itself isn’t an evil thing. But refusal to honestly acknowledge it and manage it in a proper way has led to the Camdens of this country. Pablo Solano \\nHere, here 1stworlder \\nWhen you replace a population with an avg IQ of 100 with one of 85 you get the 3rdworld. 1stworlder \\nMandella’s family was given a free gold mine and the new black guards they hired sold all the equipment for scrap. Not an ounce of gold has left it since it was given, you would think if you were going to steal from a gold mine you would steal gold not scrap metal. Mondobeyondo \\nThree reasons why I’m still awake at 1AM on the Internet. – in no particular order: \\n1) Lady Gaga videos 2) People who think all our nation’s problems are because of the Democrats 3) That “Sound of Music” production that Carrie Underwood (who I suspect is a Democrat) starred in on NBC, on December 5th. Malcolm Reynolds \\n“People who think all our nation’s problems are because of the Democrats” What do you ascribe them to? Gay Veteran \\nBOTH parties. get a clue Malcolm Reynolds \\nOh, I’ve got a clue. It’s a simple question to see what he thinks the issue is. I’m just curious what he thinks. \\nNow lets see if you have that much touted clue. Which philosophy? laura m. \\nOther hellholes are Reading, Pa. Sections in Baltimore, Gary, Ind., Atlanta; some of these row houses are at least 100 yrs old and not kept up in decades, like Detroit falling into ruins. K & Kim: agree, this is not a time to breed kids either. They will have a zero future. 1stworlder \\nReading PA is a sanctuary city. Boo-urns \\nVoting Republican would have made no different. Do you really think the GOP isn’t comprised of the same type of idiots and morons and greedy bastards as the Democrats? Drud \\nI agree with the sentiment and I love the handle. Almost makes me want to change my to Hans Moleman. K \\nMichael once we had a pretty great Country here. Now we are turning into the world norm, 75% poor, 20% middle class, and 5% rich or near rich. Most of the smaller countries have always had these kind of percentages. Now the larger ones are heading down the same road. It is all part of a long term plan, and that plan is approaching the final chapter. Once this sort of plan would have never worked here, the people would have never stood for it. So perhaps this Country may be more educated than ever before. But it sure isn’t as smart as it once was. kfilly \\nYeah, most that are educated are educated idiots. Most of them don’t have a lick of common sense. Anonymous \\nVery true. Some of the most intelligent people are found in the rural areas with little formal education. The song “A Country Boy Can Survive” is likely talking about the Southeast USA. Those people know how to survive and take care of themselves, even when there are no jobs to be found. Annette Smith \\nI am living among some of those folks. It’s good to be here. They take care of one another, too! J Hall \\nkfilly, they were never really educated. They were trained and indoctrinated. There is a significant difference. Mondobeyondo \\nIt’s still a great country. Ask anyone from Cambodia what they think of the U.S. \\nWe are losing the American Dream though. That more than anything, is what made America great. Azrael \\nNo, what made America great was the wholesale killing of indians to get their land for free. If you would have had to pay for it you would have been in the same position as Mexico. K \\nWhat happened to the Native Americans was wrong, but not unique. Except for the most remote, or undesired land. Every place on earth is soaked with human blood. ,All lands, have at some point been violently taken by someone else. Mans civilized nature is a very thin veneer. In times of crisis, it is quite easily ripped away.Those that doubt that are in for quite a shock, albeit a very short shock. k \\nAll great countries, at some point have gone down too. K \\nVery true. But none of those Countries possessed nuclear weapons. If we fail, what happens next. Do the local warlords take over the nukes? Or do the Russians or the Chinese nuke us, to keep that from happening. Or do they invade en masse to secure the nuclear stockpile. No, if we fail, it will be greatly different than anything witnessed before. k \\nRussia, china, india, pak, have the same threat…and more likely than not, they have a greater danger from warlords and economic/societal collapse than america has right now. K \\nRussia and China have a strong enough military, to secure their nukes. As Russia already proved when the communists fell. India is actually in better shape than most, and the core of their military is highly professional. Pak. there are already plans in place to invade, to secure their nukes. k \\nNot as strong as americas. America has the strongest military in the world. And if you think their military is strong enough to protect their nukes, then my friend you have nothing to worry about with regards to americas capability to protect its nukes. GSOB \\nThat is for the time being. \\nAmerica is the atomic weapons franchise dealer of the world. GSOB \\nACTS 17:26 \\nAnd He hath made of one blood all nations of men to dwell on all the face of the earth, and hath determined the times before appointed, and the bounds of their habitation, \\n27 that they should seek the Lord, if perhaps they might feel after Him and find Him, though He be not far from every one of us. Annette Smith \\nEverything has a shelf life. Kim \\nI agree with you. The native Americans were just waiting to be displaced. Someone was going to do it eventually, but, what I find tragic is the WAY they were displaced. I also agree that many are in for quite a shock. I vacillate from being hopeful, to being afraid. Sometimes I feel ambivalent, which I strongly dislike. K \\nUntil the collapse actually happens, there is nothing wrong with a bit of hope. Fear however can paralyze, I find no use for it. Hope for the best, but prepare for the worst seems a good guideline. Many nowadays get caution confused with fear. Caution comes from wisdom, fear does not. So prepare to the point that you can, but do not forget to live your life.. GSOB \\nMatthew 24:6 \\n“You will be hearing of wars and rumors of wars. See that you are not frightened, for those things must take place, but that is not yet the end. 7“For nation will rise against nation, and kingdom against kingdom, and in various places there will be famines and earthquakes.… Annette Smith \\nMy family is gone, except for my son. I am glad that he has chosen to not marry and have kids. So, I only have him to worry about. I would hate to have grand-children in this world. I would worry so much about them. I grew up in the 50’s in a neighborhood that was like Ozzie and Harriet. I miss that place. Anyway, I’m glad that I won’t have immediate family to worry about. Patrick Mallahan \\nOnly the strong survive, it’s nature. J Hall \\nAzrael, the initial settlers did well with the indigenous peoples. Both benefited from the other. What happened is when the ruling class realized that the wilderness they were banishing the undesirables to was, in fact, a very wealthy land – they sent their own to pillage it as they had done everywhere else they could reach. Mondobeyondo \\nNot really. Nations all over the world have this tendency of killing off their native citizens for their (the conquerors’) own benefit. Australia for one. \\nThere are exceptions (Japan, Sweden, etc)… but not many. FUKyiah \\nNative Americans were angels who never killed each other and they never fought over land. Is this the crap they teach the kiddies in public school nowadays? Azrael \\nNo, but they do teach us that it was their land, not yours, and you slaughtered them for it. Which makes you far more evil than they ever were. GSOB \\nProve how that made America great… K \\nYou can always find someplace worse. But my friend consider this. Forty years ago, people from Germany wanted to come here, not so much anymore. We were the great experiment. Could a nation prosper without the greedy psychotic few ruling it? Well it seems the experiment is over, and they getting ready to eliminate the lab rats. Anonymous \\nAsk almost anyone in the military if people from other countries are still hanging around the military bars to get a spouse to get to the USA. The answer is still “yes.” Dave Jenkins \\nBecause most of them living in those other countries who want to marry a spouse to get to the USA still believe that the streets in the USA are paved with gold and money grows on every American tree. Until they arrive.. then they wake up and smell the coffee. I am sure most of them wanted to immigrate to the USA even in 1935 in the depths of the Great Depression. My point : they don`t know any better. FUKyiah \\nThey used to want to come to the U.S. for freedom and opportunity…..now they want free government cheese! Parasites! Patrick Mallahan \\n‘The American Dream’ relied heavily on only a small portion of the world prospering. Now that everyone wants ‘The American Dream’ there aren’t enough of the scraps left from the fat cats to allow it. Malcolm Reynolds \\nIf the American Dream relied on so little, how come when the concept is expanded there’s just not enough? Patrick Mallahan \\nBecause based on my comment you replied to, ‘The American Dream’ only works when a small portion of the world population is experiencing it. Every time a new person takes part in ‘The American Dream’ it takes away from those already enjoying ‘The American Dream’ GSOB \\nDEFINE:‘The American Dream’ \\nIf you can only do that, you’d be speaking for yourself as to what that is. \\nYou don’t understand the half of what you pretend to know. k \\nThats a very good point! \\nIf i am not mistaken i think it was bill clinton who said, america with 5% of the world population consumes 20 % of the worlds resources, and he likes to keep it that way. \\nNot trying to criticise america or anything, given the chance every country will try to do that. GSOB \\nIt is glaringly obvious that ‘The American Dream’ is but materialism to you. \\n‘The American Dream’ did not rely on a small portion of the world for it to propser,… as you say. \\nYou have missed the boat. Go play with your XBOX 1stworlder \\nThe American dream require only that my grandfather didn’t have to pay for Latrina’s 14 illegitimate kids provisioning. Low IQ 3rdworlders bring everything around them down just like in Detroit. Patrick Mallahan \\nWhat it basically comes down to is, do you think it’s the responsibility of the intelligent to take care of the unintelligent? My answer is no. Annette Smith \\nUnfortunately, that is true. I went back to California for a visit. I drove through parts of the better areas of Los Angeles. Santa Monica and West L.A. were where we visited. I could not believe the screaming yellow paint of the hispanic businesses and how garish they had turned to place into. They can only bring with them what they know. How sad. beckjeremy . \\nThe fact you use Cambodia, a country not too long ago bombed into the stone age, as a reference point with which to compare the US says it all. Mondobeyondo \\nDidn’t have to be Cambodia though. Matter of fact, we have a habit of building up countries that we’ve bombed. Japan, Germany, Iraq… El Pollo de Oro \\nGuatemala is a great country compared to Somalia. To the average Somali, Guatamala City would be a big step up. But to globalists, the problem with Guatemala is that it isn’t Third World enough and needs to be more like Somalia. Rogoraeck \\nUSA! USA! USA! USA! USA! USA! USA! USA! USA! USA! USA! USA! Annette Smith \\nAny strong country has to be reduced to nothing, for their to be a One World Gov. Right? \\nAnd while Bingham makes $20K a year, Congress is considering – only considering, mind you – capping spending on official portraits (oil paintings) at $20K each. Currently, a portrait can cost much more than $20K. Rodster \\nEventually this will all lead to a total social breakdown. It’s happening ALL around the world. Places like China are having to dumping cheap money into their system to keep their citizens (all 1.2 billion) from going ballistic. \\nSo in the end as we get closer to a total global economic collapse we are going to read more of these stories. \\nAt some point Amerikans will say enough and that’s when the Tanks, Paramilitary and Militarized Police depts are called in against an UNARMED nations. Douglas M. Green \\ndjgrooveline posted a video on youtube last week showing a mile or more of railcars with light armored vehicles being transported. You have to assume that DHS preparing with assault weapons, ammo, gear and armored vehicles is no coincidence to our economic decay and decline in these years of $ trillion deficits and “recovery.” greanfinisher . \\nThis is why the politicians want to disarm the people. JSB \\nAll the while stock indices soar to new heights. Azrael \\nThat’s not soaring for wealth, it’s inflation. 1stworlder \\nyou can melt down a pre 1965 quarter and get over $5 of silver, that’s how bad inflation is James \\nMichael, \\nMight I suggest taking a look at Thom Hartmann. he recent wrote a book called the crash of 2016. He is liberal in nature but criticizes Obama and the democrats all the time. I have just started the book but based off interviews he is saying that Obama is doing what Bush and his advisors tried to do before 2008. That is delay the crash until he leaves office. Hartmann even suggests that the crash will be before 2016 and that it is long term decline not one epic crash as you have often stated. 1stworlder \\nWhile he has a point about cycles he ignores that leftist George Soros caused in UK to the pound, what he claims the right is trying to do here, instead of leftist Soros slopupy \\nHere is a young man that wants to get married, have a family and do all the right things, but the economy is so bad that he fears that this may never be possible for him. Uhhh…and the problem is?? XSANDIEGOCA \\nLet’s all go to Hawaii! Bushisugly \\nWhat has America become? Is it fair to draw comparisons to an Orwellian state? Well maybe it is not that far from the truth, so let’s make some comparisons. \\nThe first and most obvious similarity is the surveillance of everyone. As the NSA completely unchallenged expands it’s storage capabilities toward infinity, and cameras are popping up everywhere, there will ulitimatly be no place to hide. Not even your thoughts are safe. In an Orwelian society one do have “food rations”, in an American society one have “food stamps”. They are basicly the same, and the percentage that rely upon them in our American system are well into the double digits and rising fast, soon to effect the vast majority of us in true Orwellian style. \\nAs in the totalitarian Oceania, the totalitarian America is run by a shadowy despot who’s identity doesn’t remain clear to the public. In our case most probably a group of ultra-rich and a selected few military commanders, their exact identity and the level of cooperation between them, remains pretty much in the dark. In America, though, the totalitarian system is dressed up like a to-party-democracy, arguably making it even harder for the common man to hold the rigth people accountable for what is happening. Not even Owrell thought of that. \\nAnd of course, the history are being alternated in front of our eyes. Are you one of the numerous Americans that believe the cold blooded murder of a quarter million innocent civilians in Hiroshima and Nagasaki (perhaps the single biggest crime during WWII) was an act of heroism? If so you believe in a giant lie, which for years have been presented to us as a indisputable fact. Sadly not the only example of a lie turned into fact, especially not if you consider withholding the truth as a lie. \\nSo what about those who have rebellious thoughts, what happen to them? Well first of all there are no such things as revolutionaries in America, only terrorists. And such elements of society can of course be put in prison for as long as our masters seems fit, with or without any formal charges against them. Though, such measures are usually not necessary because everybody knows that people who speak against the American moddel are nutters, that is after all what the media constantly keeps telling us, and when the media is directly run by a selected few from the elite, can legally lie, and make sure to drown any kind of alternative opinions by constantly spamming the internett and our TV-screens with the same junk-news and zombifying entertainment day after day after day, it becomes pretty obvious why people end up rather compliant. Sounds like a familiar story? \\nNo wonder then why Americans apparently love their “Big Brother”, I mean, why else would we collectively pay trillions of dollars to bail our “pupet masters” following the financial crisis in 2008, without staging as much as a proper protest? \\nNot so much difference after all perhaps? It might still be some years to og before we are there, but things are deteriorating fast and the future looks rather bleake. Unless, of course, you lern to master the art of “dubblethink”. GSOB \\nOur country has been sold out long ago. Our current leadership on the hill will continue this to achieve the liberal version of it.. Guest \\nAnd some will say the solution is to vote them all out in the next election. Right. We’ve been hearing that for years, and yet the same politicians are voted back into office. Nothing will change. We’re told that approval ratings for the Congress and the President are at new lows, but it doesn’t matter. The President will go on lying to the American people. And the Congress will continue to do nothing about this nation’s growing indebtedness except make it worse. There won’t be a turnaround. The slow death will continue until there are no vital signs whatsoever. Rodster \\nIt’s very sad but true. ConcernedAmerican \\nPoliticians are selected, but not by the voters. GSOB \\n“Those who cast the votes decide nothing. Those who count the votes decide everything.” – Josef V. Stalin \\nhey gary, you must be s proud Rodster \\nThis is Gary’s Progressive/Keynesian world so he needs to embrace it with lots of love. Guest \\nThe Rolling Stone article referred to above states a quarter of a billion dollars flows through the open-air drug markets in Camden. Tax the drug dealers HARD, and spread the wealth! Rodster \\nThis story hot close to home. I remember working on a vehicle for a young couple and the wife to me here and her husband were in debt (dental college) for $374k. She said it was hard paying the bills and here and her husband were getting by even though they were renting a nice house in a gated community. Bill \\nI wonder if Camden will get station #2 for dispensing o-gas? Bill \\nAlthough the original article for this story is traced to a satirical website it is still good cabal fodder as it could lead to street violence which could lead in turn to martial law. This “is” what the cabal wants. GSOB \\nPropaganda is truly phenomenal! Roddy Pfeiffer \\nBeing on top of the heap is only temporary, as America is finding out. When other countries learn to manufacture what we make, they will do it cheaper and we will no longer have jobs. Did we think we could keep all this a secret forever? Tractor \\nSend him and his family to sunny Detroit for a couple of years. They can stay in my cardboard box on S. Michigan Ave. bloggo \\nThe problem is while the rest of the worlds cities and infrastructure where lying in ruins in the fifties after the war there was no competition to US. Its easy to be superpower when NO competition. Go the olympics while all other competitors have a ball and chain. As they recovered the truth comes home.They are a bunch of people who have stole N America from the inhabitants by brutal violence. They will get the due wrath. Alasha \\n“Bobby Bingham works four jobs in Kansas City, Missouri, yet he has very little to show for it.” \\ni worked “three jobs mon and trust me it is is n fun. totally hated every breathing moment…. wondering why did God let me wake up again today. Just a smidget of improvement since i have my $60k job yr past 4 years in this high cost of living area where 2 bedroom apartments can easily go for $4k a month…. now my every other breathing moment is hated and i wake every other day wondering why did He let me live another day……….. sort of. Alasha \\nBen & Jerrys, now owned by British-Dutch Unilever \\nAMC theaters, now owned by the Chinese \\n7-Eleven, now owned by the Japanese company, Seven & I Holdings \\nGerber, now owned by the Swiss pharmaceutical giant, Novartis \\nFirestone, now owned by the Japanese Bridgestone Corporation \\nTrader Joes, now owned by German billionaires Karl and Theo Albrecht \\nDial soap, now owned by Henkel KGaA, based in Dusseldorf, Germany \\nReally – wow I dont want to buy or use ANY of these products,,,, I thought i was supporting our community… Especially with Trader Joes which i Love……. BUMMMER Klenzade \\nNestles bought Gerber from Novartis two years ago. xander cross \\nMore proof that it’s white men that are sending the jobs to Europe and China. JoeD \\nWe all want the first world standard of living but no one is willing to pay more than the third world price. All of this is fine so long as it doesn’t come to my neighborhood! Colin \\nI feel our country has two types of cities; the cities that are gentrifying, like San Francisco and Washington, DC, and the cities that are dying, like Camden and Detroit. Anonymous \\nI didn’t know San Fran was doing well. Last I heard, their homeless population was really growing. Also, who can afford to live in California? Seriously, what kind of work are people doing that they can afford to live in California, New York, and New Jersey? Whenever I look at their home prices and what one gets for the money, I have to make sure I am sitting down to endure the shock. Sonar \\nBoth San Francisco and Washington DC have huge homeless populations and both cities are controlled by the wealthy Democrat elite. 1stworlder \\nHe meant Oakland. San Fran people found out they can up armor houses and pay 24/7 security guards for less than living in San Fran. Annette Smith \\nWell said, Anonymous! As I’ve mentioned before, I am from San Diego. The cost of housing is ridiculous! El Pollo de Oro \\nColin: I’ve said many times that cities run by Democraps tend to fall into two extreme categories. You have the ultra-expensive, hyper-gentrified yuppie ghettoes like Boston, New York, Seattle, and Denver (the places where there is a Starbucks on every corner). And you have the crime-infested, rotting horror movies like Detroit, Camden, Gary, Newark, etc. Philly, where I live, is a combination of the two: it’s Starbucks and Whole Paycheck in some places and toothless crack whores in others. Orange Jean \\nEl P., I wouldn’t exactly place Boston in a “hyper-gentrified yuppie” category. The reason being, while there are plenty of neighborhoods and nearby cities (Cambridge for example) have large areas that are more often frequented by tourists that qualify – there are also large, horribly poverty stricken neighborhoods that are right up there with Detroit. \\nI used to work in the heart of Roxbury, at the Boston Public Health Commission. Roxbury is a very high crime neighborhood of Boston, that looks like something out of a bombed out WWII movie. It was very dangerous to be there at night, I’m sure it still is… \\nAnd even though a place like Cambridge is known for Harvard Square and plenty of hoity-toity neighobrhoods… it also has neighborhoods (some parts of North and East Cambridge for example) that are very high crime similar to Detroit. When I lived in North Cambridge back in the mid-70s and my son was in grammar school… he told me he was afraid of the gangs they had, little kids in 1st and 2nd grade… holding up little old ladies at knife point. El Pollo de Oro \\nMatter of fact, a good friend of mine grew up in Roxbury (the North Philly of Boston). I know that some parts of Dorchester are also really hard. But I think that overall, Boston has a much higher “Starbucks factor” (as I call it) than Baltimore, for example. Baltimore has a handful of gentrified neighborhoods, but most of it is a war zone. 1stworlder \\nBy gentrifying you mean white people with no kids moving in. Imaplaneiac \\nFellow bloggers, a few days ago, I found that the RNC has restored e-mail capability to their web site: http://www.gop.gov . It was removed from their site after the Nov 2012 so-called Presidential ” Election “. I had then wrote the RNC TWICE supplying them with links to reports of WIDESPREAD voter fraud. The RNC FAILED to reply to BOTH of my reports!? But they DID delete e-mail capability; preventing comments from alarmed Americans such as myself! So, the other day, I BLASTED the RNC. YOU may want to do likewise; especially following CAVER Boehner’s recent tirade about the Tea Party! His remarks leave NO DOUBT that he is complicit with the objectives of the DEMONcrats! By his actions … he REGULARLY kisses their rings and CAVES to them! Mondobeyondo \\nYour town or city is next. Trust me. You’re in the crosshairs. \\nCamden today, Des Moines tomorrow, Hellfire1968 \\nand Baltimore the next day. hero \\nI used to live in Philly & consider it my 2nd home. Whenever I rode PATCO & passed through Camden, I broke my heart looking at deserted homes & empty city blocks. Absolutely no economic activity & all I hear on Action News was about people going there to buy drugs. \\nIt is true…When Blacks & Hispanics moved in, whole neighborhoods got destroyed & Camden never recovered from it. North Philly & West Philly are beginning to look like Camden but time will tell. Mondobeyondo \\nI’ve never lived east of the Mississippi River. I do not know what life is like in New York City, or New Orleans, or Philly, Detroit, etc.Can’t speak for those places. I’ve HEARD of Cabrini Green, the Detroit projects, etc. Personal experience? Zero. \\nIs it really that bad in Philly? Because it’s bad here in Phoenix, Arizona. If you are looking for the promised land, don’t come here. You won’t find it here. \\nPhoenix is suburbia gone berzerk; Las Vegas is suburbia gone berzerk with casinos. I live in one, been to the other often. Anonymous \\nNew Orleans does not look like it ever recovered from Hurricane Katrina. IMO it looks like a third world country now. NOLA used to be a beautiful city that could rival the beauty of Savannah. Now you don’t want to go outside the tourist areas in NOLA or Savannah IMO. grumpyhillbilly \\nThe positives for Philadelphia is it has very good med schools and universities. Pharmaceutical companies do research with the med schools, but prefer to work outside the city There are a few posh neighborhood, but they are increasingly getting invaded by criminal. Other than that its a decaying dump. Get past the historical areas and center city, I don’t think they’ve picked up the trash for years. By they – I mean the unioned city trash collectors. Kill a cop – you’ll get swift justice, but don’t bother that union for results in any other circumstances. Many buildings are crumbling. If you look at them side way you can still see there onetime grandeur. If it weren’t for the state, Philadelphia would have likely been the first city to have declared bankruptcy. The schools are teetering on whatever collapse you can think of. But the city Democrat machine is doing quite well. As is the union leadership, despite their dwindling membership. Corruption is thriving. El Pollo de Oro \\nMondobeyondo: Philly is a tale of two cities. You have the crime-infested, dilapidated Philly (Kensington, North Philly, Germantown, Strawberry Mansion, Frankford), and you have the expensive gentrified areas that are full of yuppies with a Starbucks everywhere you turn. I know people here who are doing really well and others who are barely scraping by. Cities run by Democraps range from ultra-expensive places like Boston, San Francisco and Seattle to hellholes like Camden and Detroit, and Philly has both extremes. And such extremes are to be expected in a Third World country like the BRA. Sonar \\nMiddle class families have been largely priced out of San Francisco and Seattle. Both those cities have a small wealthy Democrat elite who run everything and a lot of poor and homeless people who are totally dependent on government handouts like welfare, food stamps and rent subsidies. Anonymous \\nDetroit wasn’t destroyed. It committed suicide. MeMadMax \\nWe paid for NAFTA and all the other so called “free trade” agreements with out country… Rene Girrard \\nThanks Michale for posting another great article. I’m afraid you are so right that the middle class is dying. Why is there no talk of this on the MSM or even internet news sites? A couple in their 50’s just moved out right below me. They wanted to move to some place cheaper so they set u their 35-foot camper at an RV park just north of Ft. Worth. They are paying $300/month for the space, electric & water. It is far cheaper than what they were paying here at the extended stay hotel. There is also an article on Drudge now about people living in their RVs in NYC. I think this may be a trend in the future. smallergovnow \\nI’m considering doing just that. sell my house, buy a fifth wheel trailer and piece of land in the country… Anonymous \\nWhen enough people do it, this too will become unaffordable. xander cross \\nFunny how all of the companies that was sold to other countries are were sold by white men. So once again, who exactly is sending the jobs to other countries? The answer is WHITE MEN. Guest \\nWelcome back sander floss! We missed you…NOT!! xander cross \\nI see you yet again and of course, you cannot refute my statement. Sonar \\nWe see that you cannot substantiate your racist and bigoted comments. xander cross \\nPot, meet kettle. luchia \\nMaybe, they “unionized” themselves out of a job. The owner of a company, didn’t want to pay union wages, got his goods made for cheaper outside the USA. Anonymous \\nYeah, who wants to pay those working class people a wage they can actually live on? How dare the workers form a union. How dare those workers demand humane working conditions and hours. Instead of forming unions, workers should have just jumped in front of their employer’s gunfire at Blair Mountain. Instead of forming unions, workers should have just been quiet and and happy about the company heads that do little real work becoming billionaires off of other people’s work and back. Meanwhile, employers have found a way to get free labor through internships and volunteering. \\nAmericans work more than any other industrialized country. Americans deserve to be paid for their time, hard work, and their backs. No single person at any company should be making 7+ figure salaries. Every employer screams “We are a team” until it is time to cut the paychecks. Then, they pretend that some people on the team are less valuable than other people on the team. Malcolm Reynolds \\nIn case you didn’t notice with all that leftist pap and whining, wages seem to be directly proportional to skills. \\nIf you’re a moron whose job can be filled by basically calling out “NEXT!”, you can expect to make peanuts. If your job is very hard and there are very few of you, you can expect to make boat loads of money. \\nThis is called life honey boo boo. Now go flip a burger, make a buck. Snore! Anonymous \\nSo, are you suggesting a CEO should “be paid peanuts?” What specific “skills” do those at the top of the food chain possess to justify their salary? Have you ever watched them come down from their temperature controlled offices to attempt to do the real work on the show “Undercover Bosses?” Malcolm Reynolds \\nLMAO! You make minimum wage doncha? DiscouragedOne \\nDo you have any actual experience and facts to base your conclusions on, or you ACTUALLY believe what is on reality shows is real. Man, this country is messed up! Anonymous \\nI guess it is better for employers to be allowed to treat workers any way they want to. Perhaps working conditions in the USA should be as they are in China; where some factories have had to place suicide nets to catch the workers that are so miserable they are flinging themselves out of the windows. Is that a better solution than workers forming unions? Malcolm Reynolds \\nBTW, you’re clearly advocating a govt corporate blending, which is Fascism and is what currently exists in this country.. Gay Veteran \\nprofits are easy when you have slave labor in China MrsBulldoggy . \\nYou think all the evil in the world is perpetrated by white men? You are a racist, bigoted fool! There are many examples of narcissistic, evil murderers in this world that were not white: *Blacks in Rwanda committing mass genocide in 1994 (nothing to do with white men) *Pol Pot in the 1970’s exterminating anyone who would not turn to communism in Cambodia (nothing to do with white men) *Kim Jong Un and Il starving and murdering their own people (nothing to do with white men) *Chairman Mao murdering 50 Million+ of his own Chinese people during the 20th century (nothing to do with white men) *Arabic Muslims in Saudi Arabia, Syria, Iran and other middle eastern and north African countries slaughtering non-muslims because they are infidels (has NOTHING to do with white men) The list goes on and on and on. Crimes against humanity have happened in history against all people of every color and creed by all people of every color and creed. Evil is not the sole domain of white men, evil comes in all shapes, sizes, colors, genders, religions, non-religions, creeds. To put forth otherwise makes one look like an illiterate fool that is spouting racist, bigoted rhetoric. BTW, you don’t know if all these people are white or not, Xander. The wealthiest man on Earth right now is a MEXICAN (NOT WHITE MAN) named Carlos Slim. He has his hands in everything just like all the other wealthy men and women who are billionaires. Pull your head out of your southern orifice and get a clue… xander cross \\nI see you failed at reading. I never said all evil are perpetrated by white men. I said that white men sent the jobs to china for over 30 years and still do so to this very day. So, white men are the problem. MrsBulldoggy . \\nNo, Xander you fail at logic and critical reasoning. You have problems, seriously, Xander. Mental health issues that I do not wish to deal with nor am I qualified to handle. I just feel sorry for you and your insane, inane and seriously deranged rantings and ravings. Nothing else to say except God Bless and get some help as soon as you can. xander cross \\nI feel that you’re going to need help when white men finish sending the jobs and resources to china and then send them water resources as well. Lets see how funny this is going to be. Sonar \\nxander cross appears to have forgotten to take medications today to control delusional thinking? xander cross \\nWhy are you continuing to promote medications in China? The fact that you know that your medicine companies are sold to china now, suggest to me that you need mental help. xander cross \\nEvery company that Michael has listed was sold by white men. So once again, white men are the ones that sending the jobs to China for greed. So, this proves to me that white men turned china into an economic superpower. luchia \\nMaybe, they got sick and tired of dealing with all the union b.s. Malcolm Reynolds \\nracist. xander cross \\nSo who exactly sold all of the jobs to china then? The answer would be white men. Malcolm Reynolds \\nThink deeper. I know it’s hard for someone whose posts litter this page like so much garbage and cant get past the color of someone’s skin, but give it a shot anyway. \\nApply whatever electrons you manage to get firing towards govt and redistribution of wealth and then get back to me. Sonar \\nxander cross is delusional again ConcernedAmerican \\nExcellent article. Thank you for making the points about education and it’s cost. I recently read that Rockefeller took a 10 WEEK course to become a bookkeeper. How did we go from needing 10 weeks to begin a career to spending half our lives in school before we can begin a career, or a family? Mondobeyondo \\nMichael is right. The middle clTass is dying. It doesn’t have to be that way, but we kind of chose our fate. Too busy listening to Lady Gaga, and following her example to the T. \\nThat stands for Trouble, and that rhymes with \\nOkay, that’s enough \\nAs I was saying, Lady Gaga. She lives for the applause, and she’s in love with Judas. If she is your example of Miss America, well… \\n; DiscouragedOne \\nI don’t listen to Gaga and am not familiar (nor will I ever be) but I do remember “t and that rhymes with p and that stands for pool”, she sounds like a copycat. Mondobeyondo \\nCamden 2013? Looks more like Warsaw 1943. El Pollo de Oro \\nWhat’s the difference between Berlin in 1945 and Camden in 2013? Berlin in 1945 looked a lot better. FounderChurch \\nWe have. Cursed God and now it’s time for America to die and go to hell. We’ve killed our children with demonic Birth Control and refuse to repent. It’s all over. Pablo Solano \\nReally. We need more people? Why didn’t I think of that. FounderChurch \\nThe answer to your question is: We need more of THE RIGHT KIND, and fewer of the wrong kind. \\nBy that I mean dumb America haters and I think you would qualify on both counts. \\nWhy do you pretend to be so dense and dumb? You know what I meant to start with, and if you are too slow to get it, well then, I just told you. Pablo Solano \\nHow very Christian of you. And who decides who are the RIGHT kind of people, YOU? What in my comment leads you to believe I hate America? Dumb and Dense? coming from an individual who believes in a supernatural spirit that hears prayers. Yer right. FounderChurch \\nBeing an admitted Atheist you have no standing to correct any Religious Believer. Stick to your own kind, and be kind to everyone else. \\nAs to evaluating who are the right kind of people, just about anyone’s opinion would be better than no opinion or standards at all. \\nWe have standards people have to meet for thousands of things, rights and privaledges, why not standards for being a parent? Got anything against that? Afraid you could not muster up? I doubt you have any children or would ever want any. Just guessing. Your object is to prevent anyone else from having any children. GSOB'"}, "time": 1742562317.6556425}