{"duration": 0.07709169387817383, "input_args": {"text": "'Multiple news outlets reported Friday that ousted FBI Director James Comey will testify publicly before the Senate Intelligence Committee sometime after Memorial Day. [Senate Intelligence Committee Chairman Sen. Richard Burr ( ) and ranking Democrat Sen. Mark Warner ( ) were cited by Fox News as the source of the announcement.  Also Friday, the chairman of the Senate Judiciary Committee, Sen. Chuck Grassley ( ) issued a joint statement with the ranking Democrat on that committee Sen. Diane Feinstein ( ) expressing their “extreme disappointment” at Comey’s apparent refusal to testify before their committee. The statement read in part: There is no reason he can’t testify before both the Intelligence and Judiciary Committees, particularly given that the Judiciary Committee is the FBI’s primary oversight committee with broad jurisdiction over federal law enforcement, FISA and the nomination of the next FBI director. This upcoming testimony, which would be made under oath, will mark Comey’s first public statements since his firing on May 9. Since that dismissal, a memo, allegedly written by Comey and leaked by him or those close to him, has been a prominent feature of the news cycle after being reported by The New York Times on Tuesday. The Times claims a portion read to them quotes President Donald Trump as expressing his wish for Comey to “let this go” with regard to   Security Advisor Michael Flynn. Comey is alleged to have made extensive additional memoranda from his notes of private conversations with the president. Comey himself has acknowledged that President Trump had a right to fire him for any reason or no reason, and some reports suggest he testified under oath that he received no request to curtail any investigation into Russia’s alleged meddling in the 2016 presidential election. The controversy now spinning in the mainstream media over these issues, however, would appear likely to form the thrust of Comey’s testimony. After a   briefing Thursday by Deputy Attorney General Rod Rosenstein, Sen. Lindsey Graham ( ) expressed his belief that the probe into Russian interference and any surrounding impropriety, may now include a criminal investigation. As far as the Department of Justice is concerned, that investigation is now under the exclusive purview of Special Counsel and   Director Robert Mueller. Graham, at the same time, expressed concerns the Senate and House Intelligence Committees would now be more limited in their role looking into matters subject to the special counsel. “The ability of Congress to call people who may be witnesses in an investigation conducted by Mr. Mueller, is going to severely restrict what we can do,” Graham told reporters Thursday. Graham did not elaborate on how or why Mueller’s appointment would limit Congress’s involvement in the investigation. The appointment of a special counsel, an act authorized by Department of Justice regulations, does nothing legally to limit the investigative powers of Congress. The existence of a special counsel investigation might make some senators reluctant to dig into the same matters as Mueller is investigating. What bearing this has on the subjects of Mr. Comey’s testimony is unclear, but Comey’s acceptance of the Intelligence Committee’s invitation and rejection of that from the Judiciary Committee, the Senate body most closely concerned with law enforcement, may suggest whatever he is planning to testify on, including his conservations with President Trump, are not matters related to any pending criminal investigation. Graham based his comments on the expansion into the realm of a criminal investigation, most properly the concern of the Judiciary Committee, from a mere “ ” investigation, dealt with by the Intelligence Committee.'"}, "time": 1742563852.8594909}