{"duration": 0.04993438720703125, "input_args": {"text": "'Getty - John Shearer / Staff \\nComedian Patton Oswalt can still recall the details of that horrible day in April where he lost his beloved wife, Michelle McNamara. \\nThe night before, the 46-year-old McNamara, a true crime author, was exhausted from her day and night search for a serial murderer she had dubbed the “Golden State Killer.” She was convinced she was closing in on the man she believed killed dozens in the 1970s and \\'80s. \\nOswalt, who was concerned about her health, suggested that she “sleep until you wake up,\" a common phrase of the parents used, according to a recent interview with The New York Times: \\nSo the weary McNamara took a Xanax and quickly fell into a deep sleep. She would never wake up. \\nThat morning Oswalt took their 7-year-old daughter, Alice, to school and even picked up Michelle\\'s favorite coffee on the way home. \\nAt 9:40 a.m., when Owsalt returned, she was still sound asleep and snoring. Image Credit: Daniel Knighton/Getty Images \\nBy 12:42 that afternoon the paramedics had arrived and McNamara was pronounced dead at the scene. \\nWhile no official cause of death was announced at the time, Oswalt seems to know what tragically killed the mother of their child. \\nHe believes it was the Xanax, he told the Times: \\n“I have a feeling it might have been an overdose. That’s what the paramedics there were saying while I was screaming and throwing up.” \\nThe dangers of the prescription drug Xanax, a brand of benzodiazepines, or “benzos,” cannot be understated. The medication is meant to treat anxiety, but it can easily be abused . \\nIn combination with alcohol, Xanax (and other benzos) can cause users to experience complete “blackouts” for extended periods of time. \\nIt\\'s incredibly addicting and very easy to overdose on. Image Credit: Flickr CC/ Dean812 \\nEven with these very dangerous side effects, Xanax remains one of the most prescribed and best-selling drugs in the United States. \\nIt is very easily accessible to children, teens, and adults. \\nWhile the coroner hasn\\'t officially announced what killed Oswalt\\'s wife, he is still working towards living a normal life with his daughter. \\nHe has returned to the stage to continue his first love, stand-up comedy. It has given him a break from the never-ending grief that comes with the territory of losing such a close loved one. Image Credit: Bryan Bedder/Getty Images for The New Yorker \\nThe 47-year-old told The New York Times that going onstage has been: \\n“...a rebuke to grief, an acceptance of the messiness of life. I’ll never be at 100 percent again, but that won’t stop me from living this.” \\nFor now, Oswalt will continue to grow and live with his daughter. With help from a journalist and a researcher, he\\'s determined to solve the “Golden State Murders” on behalf of his late wife\\'s hard work. '"}, "time": 1742562551.4233277}