{"duration": 0.03427886962890625, "input_args": {"text": "'A    Swedish woman in Dalarna is being prosecuted for hate speech after claiming on Facebook she saw migrants defecating in the streets and setting fire to cars. [According to the prosecution, the woman “expressed a disparaging view of refugees” on Facebook. She stands accused of having taken to the social media website in early July 2015 to make the “derogatory” post, alleging that migrants “set fire to cars, and urinate and defecate on the streets”.  Prosecutors in Sweden say the woman’s message violates the nation’s law on incitement to racial hatred (Hets mot folkgrupp, or HMF) a crime with carries a maximum penalty of four years. The accused admitted that she wrote the post but denied committing any criminal act. The evidence against her consists of a screenshot from Facebook, according to local media. People took to Flashback, the net’s largest Swedish language forum, to criticise the state’s decision to prosecute the pensioner, with one poster lamenting the accused “has fallen into the clutches of the politically correct”. A user with the screen name ‘Nospheratu’ pointed out that the original idea behind HMF was “to prevent   propaganda by political parties” against demographic groups, with lawmakers “having 1930s Germany in mind” whilst passing laws. The user slammed the law for being used to “prosecute old ladies on the bus” criticising immigrants. Another slammed Sweden for hypocrisy, accusing the nation’s media and politicians of condemning restrictions on freedom of speech and expression in other countries “while themselves engaging in the worst kinds of witch hunts of dissidents”. Sweden’s Justice Minister Morgan Johansson cited freedom of speech when he rejected Gothenburg police chief Erik Nord’s suggestion that the country deports Islamic   migrants, after the Islamist terror attack in Stockholm last month. “We have freedom of speech in Sweden. This means people have the right to hold repulsive opinions here,” said Johansson. “But there are always limits  …     For example when it comes to hate speech,” added the minister, who called Nord’s policy suggestion “problematic” and demanded the police chief “explain himself”.'"}, "time": 1742564266.441165}