{"duration": 0.10609078407287598, "input_args": {"text": "'expats , Karelia , regions , folk , vacation , nature \"The Russian countryside reminded me of the Finnish countryside that does not exist anymore. By seeing cows and goats walking along the lanes of the village I got an image of what life was like in my grandmothers’ childhood in Finland.\" Source: Alena Repkina \\n”Terveh,” I saluted a lady in her seventies while walking along the lanes of the village of Vedlozero, in the Republic of Karelia, Russia. I knew that according to statistics, one third of the inhabitants of the village spoke Karelian, a closely relative language to my native Finnish. So I was greeting passers-by in the village in Karelian in order to find out how the situation was in reality and which kind of people still spoke the language. \\n”Please come inside and have Karelian pies,” answered the lady with a friendly voice, in Karelian of course. I went inside, sat at the table, ate freshly baked melting Karelian pies, drank tea and chatted with the lady and her husband. Karelians: Life on the border between cultures \\nWe talked together in mixed Baltic-Finnic: me in Finnish, and my hosts in Karelian. They talked about their offspring, about their children who live in bigger cities and speak Karelian too, and about their grandchildren, who speak only Russian. \\nMy hosts told me about their plantations and their life in the village, which is to a large extent self-sufficient. I saw their milk-producing goats, green cucumbers, red tomatoes and large potato fields. It is impressive what they are able to prepare from their natural resources. The Finland that once was \\nI walked back to the house that belonged to my real hosts, the parents of a friend of mine. On my way there I had a look at the white birches and especially the rowan trees, which are sacred trees for ancient Finns. I realized that lakes and fauna in the village express clearly that Finland is a part of the same continuum extending through all northern Russia until the Ural Mountains. \\nThe Russian countryside reminded me of the Finnish countryside that does not exist anymore. By seeing cows and goats walking along the lanes of the village I got an image of what life was like in my grandmothers’ childhood in Finland. A photographic journey around Karelia in fall \\nI saw neighbors helping each other and grandchildren spending their summer days at their grandparents’ place. I enjoyed dinner together with my hosts. This taught me something about Russian hospitality and mutual solidarity, about the warmth with which they treat their guests. \\nThe parents of a friend of mine offered me pickled cucumbers, sausages, olivier salad, different pies and sour cream, and made me feel relaxed and welcome. We talked about the trip to the lake we had made the day before; how we had caught fish and had lunch on the sands along the shore of the lake. \\nSteaming sauna baths and vodka enjoyed with good company became etched in my mind as a symbol of Russian comradeship. The most important and interesting discussions between true friends in Russia, I learned, are debated in the sauna, or alternatively, in front of the vodka bottle in the small hours. Russia and the village \\nI started to realize, similarly to many Russian writers and social thinkers of the 19th century, the significance of the rural atmosphere to the russkaya dusha (Russian soul). A village community such as Vedlozero reflects for me the Russian soul, the solidarity of people in their community and their hospitality. \\nOn the point of leaving Vedlozero, Anni, an old Karelian-speaking lady, said goodbye in a heart-warming Orthodox style. “Jumalanke”– let God be with you – she wished me from the bottom of her heart. I suddenly realized that at this very moment the lady had unveiled the true face of Russia to me. \\nSakari Linden is Executive Director of the Association of Finnish Culture and Identity, which promotes Finnish identity and maintains cultural relations to Uralic (Finno-Ugric) peoples. He travelled to Russia (St. Petersburg and Karelia) for the first time in July 2011, and, subsequently, has traveled to Russia on several occasions. He studied Russian for two months in Petrozavodsk (the capital of the Republic of Karelia) in fall 2015. \\nSend your entries for this blog to Subscribe to get the hand picked best stories every week Subscribe to our mailing list Facebook'"}, "time": 1742561972.3138363}