{"duration": 0.06334829330444336, "input_args": {"text": "\"In a leaked email between the Democratic Candidate for President of the United States Hillary Clinton and her campaign chairman, John Podesta, the former first lady indicates “Western intelligence, US intelligence and sources in the region” to accuse Qatar and Saudi Arabia of “providing clandestine financial and logistic support to ISIL [or ISIS] and other radical Sunni groups in the region.” \\n\\nHillary told Podesta the current developments in the Middle East were “important to the U.S. for reasons that often differ from country to country.” She also cited the need to “use our diplomatic and more traditional intelligence assets.” The same email also included that Clinton brought effort to sustain and protect the country’s national interests in the region.\\nScroll Down For Video Below! Recently, new information has surfaced from 2012, the Director of Foreign Policy at the Clinton Foundation, Amitabh Desai, insisted the Ambassador from Qatar would “like to see [Bill Clinton] ‘for five minutes’ in NYC, to present $1 million check that Qatar promised for [his] birthday in 2011,” adding that the small but rich nation occupying the Qatar Peninsula would “welcome [the Clinton Foundation’s] suggestions for investments in Haiti — particularly on education and health.” Desai added that while Qatar had already “allocated most of their $20 million … [they were] happy to consider projects we suggest.”\\nEarlier this year, Al Jazeera, a Qatar-based, state-funded news organization ran a list of “revealing, juicy and quirky emails” that were leaked by WikiLeaks. The Clinton Foundation was involved in a “pay-for-play” scheme with the news organization. The King of Morocco offered $12m “for the endowment” — as long as Clinton was willing to participate with the scheme.\\nUnfortunately, there wasn’t enough proof provided by the state-funded broadcaster to bring up the Qatar connection with the Clinton Foundation. WikiLeaks made a post on Facebook stating, ““ Al Jazeera’s list of juiciest Wikileaks forgets to mention the revelation that Qatar funds both ISIS & Bill Clinton. ”\\nRight after WikiLeaks pointed out the omission, Twitter exploded with concerns by users pressuring Al Jazeera to explain why the publication failed to link Qatar to ISIS and Clinton.\\nAl Jazeera's list of juiciest WikiLeaks forgets to mention the revelation that Qatar funds both ISIS & Bill Clinton: https://t.co/aBIuF861kk \\n— Max Abrahms (@MaxAbrahms) October 25, 2016 \\n@MaxAbrahms @wikileaks You mean @AlJazeera is not critical of Qatar? That is utterly shocking haha pic.twitter.com/4XSmuHXQ98 \\n— Eddie Mejia (@MeBeEddie) October 25, 2016 \\n\\nThe country is at its’ tipping point. No matter how much attention the story received from social media, news organizations failed to report them. Is the media afraid to tell the truth because they’re in fear that it will help Clinton lose her the presidential election? Maybe it’s just a difficult topic to talk about. We need answers!\\n\""}, "time": 1742563809.6507623}