{"duration": 0.02352166175842285, "input_args": {"text": "'Posted on October 26, 2016 by GrinNBarrett \\nInternational Liberty – by Dan Mitchell \\nThis arrived in my inbox today. A quick search on the Internet reveals it is not a real article from a Canadian paper. But it is somewhat amusing, so enjoy. \\n“Build a Damn Fence!” From The Manitoba Herald , Canada ; by Clive Runnels, December 1st 2010 \\nThe flood of American liberals sneaking across the border into Canada has intensified in the past week, sparking calls for increased patrols to stop the illegal immigration. The recent actions of the Tea Party are prompting an exodus among left-leaning citizens who fear they’ll soon be required to hunt, pray, and to agree with Bill O’Reilly and Glenn Beck. \\nCanadian border farmers say it’s not uncommon to see dozens of sociology professors, animal-rights activists and Unitarians crossing their fields at night. “I went out to milk the cows the other day, and there was a Hollywood producer huddled in the barn,” said Manitoba farmer Red Greenfield , whose acreage borders North Dakota . The producer was cold, exhausted and hungry. He asked me if I could spare a latte and some free-range chicken. When I said I didn’t have any, he left before I even got a chance to show him my screenplay, eh?” \\nIn an effort to stop the illegal aliens, Greenfield erected higher fences, but the liberals scaled them. He then installed loudspeakers that blared Rush Limbaugh across the fields. “Not real effective,” he said. “The liberals still got through and Rush annoyed the cows so much that they wouldn’t give any milk.” \\nOfficials are particularly concerned about smugglers who meet liberals near the Canadian border, pack them into Volvo station wagons and drive them across the border where they are simply left to fend for themselves.” A lot of these people are not prepared for our rugged conditions,” an Ontario border patrolman said. “I found one carload without a single bottle of imported drinking water. They did have a nice little Napa Valley Cabernet, though.” \\nWhen liberals are caught, they’re sent back across the border, often wailing loudly that they fear retribution from conservatives. Rumors have been circulating about plans being made to build re-education camps where liberals will be forced to drink domestic beer and watch NASCAR races. \\nIn recent days, liberals have turned to ingenious ways of crossing the border. Some have been disguised as senior citizens taking a bus trip to buy cheap Canadian prescription drugs. After catching a half-dozen young vegans in powdered wig disguises, Canadian immigration authorities began stopping buses and quizzing the supposed senior citizens about Perry Como and Rosemary Clooney to prove that they were alive in the ’50s. “If they can’t identify the accordion player on The Lawrence Welk Show, we become very suspicious about their age.” an official said. \\nCanadian citizens have complained that the illegal immigrants are creating an organic-broccoli shortage and are renting all the Michael Moore movies “I really feel sorry for American liberals, but the Canadian economy just can’t support them.” an Ottawa resident said. “How many art-history majors does one country need?”'"}, "time": 1742628514.4617734}