{"duration": 0.05143380165100098, "input_args": {"text": "'Emory University in Atlanta, Georgia, has announced that they will fund ‘100 percent’ of financial aid packages for students that are in the country illegally. [Although international students are expected to pay full tuition, undocumented undergraduate students at Emory will have “100% of demonstrated financial need” covered by the university.  “Emory meets 100% of demonstrated financial need for undergraduate Undocumented Students (with or without DACA) who are admitted as      students, and who graduated from a U. S. High school through a combination of grants and scholarships, institutional work study (DACA students only) and institutional loans. Undocumented Students without DACA status may receive an institutional loan in place of the typical work study award,” the university’s website states. Speaking to The College Fix, Megan McRainey, a spokeswoman for Emory, claimed that providing full financial aid relief to undocumented students reflects the university’s commitment to welcoming students from diverse backgrounds. “Emory accepts undocumented students for admission and financial aid, including those under the Deferred Action for Childhood Arrival (DACA) program,” McRainey wrote, adding that providing financial aid coverage to undocumented students aligns with Emory’s goal of welcoming “students, faculty, and staff from diverse backgrounds. ” International students, who are not afforded the same aid privileges as undocumented students, will be forced to foot a $70, 000 per year tuition bill if they wish to attend the prestigious Georgian university. In 2016, Breitbart News reported that students at Emory claimed that they were scared and “in pain” after students wrote   chalk messages on the university’s sidewalks. Tom Ciccotta is a libertarian who writes about economics and higher education for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com'"}, "time": 1742563788.5703654}