{"duration": 0.04734659194946289, "input_args": {"text": "'in: Mainstream Media , Politics , Propaganda Last week, I reported that the MSM was doing a great deal to try and undermine the truths that are being revealed about our government, the rigged election , and their darling, Hillary Clinton. My suspicion was that they were going so far as to set up fake websites and use skewed polls to prepare us for a Clinton victory. It appears I was not alone in that suspicion because all sorts of people began to bring up the topic of skewed polls, including the Trump campaign. Today, I noticed in the headlines that all of the “ official polls ” are telling a different story. They’re telling a story of a battle that is too close to call. Some are even saying that Trump is ahead by a point or two. Some are saying Clinton is a little bit ahead. It’s because they’ve been busted and they’re scrambling to cover the evidence of their dishonesty, of course. Politico even wrote a scathing article about the conspiratorial nature of the very idea of rigged elections . How did this happen? I believe that the combined voices of people who are sick of their baloney have made a difference. They realized that they weren’t pulling the wool over everyone’s eyes and they regrouped. Don’t let this convince you that the election is somehow magically “unrigged.” They’re just dialing back the rhetoric because it was so blatant that everyone was noticing it. It’s still a disgusting mess but the truth is our defense. Who can you trust? Here are at least two organizations who have a strong record for telling the truth: Project Veritas (It’s hard to doubt your own eyes on secret videos – find them on YouTube and Twitter ) Wikileaks (In 10 years their documents have never once been discredited – find them on Twitter and on their website ) Alternative media sites that have been around for a few years are likely to be more trustworthy than the mainstream sites, but let’s be honest. We have a bias too – nearly all of us despise Hillary Clinton, the Clinton Foundation, and the Clinton Money Machine that has so overloaded the system with corruption that it’s becoming obvious to even the most oblivious Kool-Aid drinker that something is awry. Check the sources. The bottom line is, don’t just blindly trust anyone. Vet your sources. Click the links the websites provide and decide whether or not the sources they’re quoting seem to be legitimate. When you see the exact same wording repeated over and over, generally it’s because it’s a talking point that someone has informed the media they are to emphasize. Have you ever noticed phrases like “an abundance of caution” or “for your own safety” getting used over and over? It’s a talking point and the collusive media is using it as a propaganda tool. Never trust a talking point. We’re all being played. I believe that the decision of who will be the next president has already been made. It would take a scandal of massive proportion to derail this train before it gets to the station on November 8th. And that’s really saying something, considering the scandals that have already been unearthed, many of which should have landed Clinton in an orange jumpsuit but have somehow been glossed over with little mention in the MSM. If you’re as worried about a Clinton presidency as I am, the biggest thing that you can do is fight for the truth to be known. Share reliable information about Hillary Clinton where everyone can learn about it. When we all raise our voices together, we are heard. Telling the truth – and doing so loudly – has never been more important than it is right now. Article first posted at DaisyLuther.com Submit your review'"}, "time": 1742562995.7922404}