{"duration": 0.052376747131347656, "input_args": {"text": "'This post was originally published on this site \\nA Syrian soldier is treated at a hospital in a government-held area of Aleppo on October 30, 2016, following a militant chemical attack in the city. (Photos by AFP) \\nThe Hague-based agency responsible for eliminating chemical weapons has warned that Daesh terrorists returning from Syria could carry out chemical attacks involving mustard gas as they have been taught how to use the toxic agent. \\nThe Organization for the Prohibition of Chemical Weapons (OPCW) issued the warning on Wednesday amid reports of Daesh chemical raids in Syria. \\n“It seems that one of the dangers that we need to face and have a response for – since Daesh has learnt how to make mustard gas – is that sadly one of the people who learnt how to do it comes back to one of our countries and helps carry out an attack like this,” Philippe Denier, the director at the verification division of the OPCW, told a defense conference in Paris. \\nEarlier this month, Syria called for an OPCW investigation into the use of chemical agents by terrorists against civilians in the country’s battered city of Aleppo. \\nThe request came a few days after Russian Defense Ministry spokesman Major General Igor Konashenkov said that the ministry’s experts had uncovered ordnance and fragments of munitions containing chlorine and white phosphorus in Aleppo. \\nThe discovery proved that foreign-backed militants had used chemical weapons against civilians and Syrian army soldiers, he noted. \\nIn a statement on Tuesday, the OPCW announced that Russia had offered to provide samples linked to chemical weapons use in Aleppo. \\nThe samples “may be of use in the ongoing work of the OPCW fact-finding mission,” which is investigating allegations of chemical attacks in Syria, the watchdog added. \\nLast month, a 13-month international inquiry led by the OPCW and the United Nations concluded that Daesh militants had used mustard gas in Syria. Related '"}, "time": 1742563462.321324}