{"duration": 0.08726048469543457, "input_args": {"text": "'The U. S. Commission on Civil Rights says it is launching a   “comprehensive assessment” into the Trump administration, in light of proposed budget cuts and staff eliminations that it says will cause the civil rights of people of color, the LGBT community, and other “marginalized” groups to be at risk. [Americans deserve better.  This civil rights rollback is dangerous for all of us.  https:  .   —   Catherine E. Lhamon (@CatherineLhamon) June 15, 2017,   According to a press release, the commission, which was created in 1957 as an independent agency that advises Congress and the president on civil rights matters, unanimously approved the investigation. The press statement says the commission is especially concerned with what it perceives as the Department of Justice “minimizing its civil rights efforts” by placing ICE officers in courthouses and by not emphasizing the need for protection for the LGBT community or the disabled. In the Department of Education, the commission says the proposed budget and staffing cuts in the Office for Civil Rights will affect those filing complaints based on sex, race, and other specially protected class categories. Proposed staffing and budget cuts, and mergers of various offices in the Departments of Labor, Housing and Urban Development, Health and Human Services will all have a negative impact on the federal government’s job to monitor civil rights compliance efforts, says the commission. The investigation is launched as   ProPublica released an internal memo  —   sent by Acting Assistant Secretary for Civil Rights Candice Jackson  —   it says it “obtained” that suggests “the Department of Education has laid out plans to loosen requirements on investigations into civil rights complaints. ” ProPublica says: Under the Obama administration, the department’s office for civil rights applied an expansive approach to investigations. Individual complaints related to complex issues such as school discipline, sexual violence and harassment, equal access to educational resources, or racism at a single school might have prompted broader probes to determine whether the allegations were part of a pattern of discrimination or harassment. The new memo, sent by Candice Jackson, the acting assistant secretary for civil rights, to regional directors at the department’s civil rights office, trims this approach. Breitbart News reported in April ProPublica’s concern that Jackson “once complained that she experienced discrimination because she is white. ” When an undergraduate at Stanford University, Jackson was critical of an extra help section of a class held solely for minority students. “I am especially disappointed that the University encourages these and other discriminatory programs,” she wrote at Stanford Review. “We need to allow each person to define his or her own achievements instead of assuming competence or incompetence based on race. ” So grateful to hear today from @EByard @MaraKeisling @rea_carey. @MaraKeisling summarized: ”we are the storm raining down justice” https:  .   —   Catherine E. Lhamon (@CatherineLhamon) June 16, 2017,  However, Vanita Gupta, the former acting head of the DOJ’s civil rights division under Obama, said, “At best, this administration believes that civil rights enforcement is superfluous and can be easily cut. At worst, it really is part of a systematic agenda to roll back civil rights. ” In an emailed statement to ProPublica, Elizabeth Hill, press secretary for the U. S. Education Department, said the new “enforcement instructions seek to clear out the backlog while giving every complaint the individualized and thorough consideration it deserves. ” The commission is composed of eight commissioners. Four are appointed by the president and four by Congress. The commissioners serve   terms and are not confirmed by the Senate. Currently, four members of the commission are Democrats, three are independents, and one is a Republican. The four presidential appointees were all selected by former President Barack Obama. “For 60 years, Congress has charged the Commission to monitor Federal civil rights enforcement and recommend necessary change,” says commission chairwoman Catherine E. Lhamon, an Obama appointee. “We take this charge seriously, and we look forward to reporting our findings to Congress, the President, and the American people. ”'"}, "time": 1742562056.9523828}