{"duration": 0.04854774475097656, "input_args": {"text": "'Mel Craig’s    father has been tormented over the past year by swindlers calling him at home, threatening him if he did not send them more money. “Returned after a   trip to find receipts on the table for $300 worth of iTunes cards,” wrote Ms. Craig, a New York Times commenter in Washington, D. C. “Dad doesn’t even know what iTunes is. ” More than 1, 000 readers responded to Ellen Barry’s recent article on a call center in India that is being investigated for fraud against Americans. Many of the commenters, who responded on the article and on The Times’s Facebook post, said they, too, had received calls from strangers demanding payments or personal information. Some expressed sympathy for those who are conned, and others voiced anger at the criminals and a system that seems to do little to protect the vulnerable. Readers also shared their tactics for dealing with the calls. “Sometimes I give the scammer a made up credit card number one digit short of the full complement, then keep changing the sequence when they read it back,” Bruce in Cleveland wrote. “I can still make dinner while I’m doing this on speaker phone. ” Here is a selection of the responses. They have been edited and condensed.  —   Thomas E. Heines in Dallas, who has worked in information technology  —   Eric Beldoch in Ardsley, N. Y.  —   Aryan Nair via Facebook  —   Mel Craig in Washington  —   Richard Garner in Germantown Hills, Ill.  —   Thomas H. Williams in Annapolis, Md.  —   AMM in New York  —   Evelyn in Orlando  —   Ellen D. Murphy in Portland, Me.  —   Jeff in the Slope in New York  —   MNW in Connecticut  —   Joan Morrissey via Facebook  —   Ken in Mont Vernon, N. H.  —   Mary Ann Hymel in Bellevue, Wash.  —   Elizabeth in Washington  —   Crystal Means via Facebook  —   Mosselyn in Silicon Valley'"}, "time": 1742563984.7570424}