{"duration": 0.3634324073791504, "input_args": {"text": "'Lee Carroll \\nKryon – Greetings dear ones I’m Kryon of magnetic service. \\nThis morning. We ask you to feel the wind of truth. It’s a metaphor; when you feel the wind blows often in a gentle way that’s refreshing and that’s the way the truth is of this shift. You’re looking at new energies that you have never had before presented to you in different ways. Years ago we spoke of the recalibration energy. You have passed through that and now comes the work. \\nSo many of you have asked this very day. What’s next, what should I do? What’s possible? Because this is new dear ones, the manual for what’s next hasn’t been written, but there are things we can ask you to do that are so able to be done and it has to be done by old souls. \\nNow this is an overview, it’s a generality that I’m giving you. It’s not a specific. So let’s talk about the specifics first, which is backwards. You ask what you’re gonna do next. What are we supposed to do? What is that which is in the plan for you and almost all of you we say to you, you are unique. So it may be different for each of you, but there is one thing that we’re going to start asking for and you are going to hear it more and more. Old soul, in this new energy things are going to come to you. Watch for the synchronicity. Don’t pass it up. \\nWhen you hear ideas, when you meet people, when somebody says let’s go over here and do something and you’ve never done it before, that is synchronicity. And the second thing we would say to you is that in the synchronicity that you will meet, see it for what it is, because that’s what you should do. What brought you here to this room for those of you sitting here, what’s the synchronicity? \\nNot all of you said oh yes I’m going to go to this meeting. Let’s buy a ticket now. In fact, there’s a lot of you that did not happen at all. And here you sit to hear these messages of hope and truth. Can you feel the wind blowing? Things are changing, dear ones; and the second large thing we ask of you individually is to be patient. \\nHuman beings, when they start feeling the energies and realize the ah ha of truth are so excited and they want to act now. It’s almost like you’re going to run out of time and you’re not. Be patient; let the things develop as they come to you. You’ll know what to do with them. We told you over and over. \\nIt’s time to start practicing mastery, to treat others differently, all, all of these things. That’s what you’re here for. We said before, those of you who are sitting around expecting a plan, what am I supposed to do? “ and we said before, what if you’re already doing it? \\nWhat if your very existence anchors energy for those around you? What if you’re playing a part you don’t even know you’re playing simply by being you around others who are watching you? What if that’s why you’re here? You realize the importance of that, of who you’re touching your changing. so it’s not like you think; it’s not a linear, “What am I to do?” \\nAnd yet, I’m going to ask you for something now, all of you. All of those listening to my voice. All of those in the room. There really is something you can do. My partner touched on an energy. You might call it a scenario that is going on right now on this planet. \\nThe very thing I’m going to discuss is something that is holding you back from the evolution that we speak of, from the wildcards that are coming, for the inventions we told you you need – things that are being developed and are ready right now are being held up by what I’m going to tell you. \\nIt’s very real, what my partner was telling you that most of this planet is still in an ” expectation of doom” mode. \\nMost wherever you go, there is this feeling of what you have called, waiting for the other shoe to drop. You’re overdue for doom. You’re overdue for the world war that was given to you as prediction after prediction after prediction. \\nIt is so odd; everything around you says it’s changed, everything. If you will take a look at the wars that you had, the last world war and the one before. Take a look at who the players were; now take a look at what they’re doing. They drop their borders. They are trading with one another. \\nThe scenario for the next war is not there, yet you expect it. Take a look at all that is around you. It is not then yelling at you ” You’re going to have a war.” There’s so much more. It’s giving you the evidence that’s not what’s going to happen at all. And why is it that you feel like it’s coming. Now, those listening to my voice, old souls; those in the room, old souls. You are awakening to a grander truth for the planet, a truth that doesn’t just belong to a niche amount of believers. It’s for the whole planet. Therefore, I’m telling you something that involves the whole planet. But the old souls are the graduates. You have most of the experience; you have profound consciousness that can change energy. \\nThe world is expecting doom. The books that have been written about the fractals tell you about the ripples of time that repeat themselves, that yell to you that there’s going to be problems, there’s going to be war; that yell to you your economy is going to collapse at any moment. \\nThere are seeds of truth in the ripples. Let me tell you something, perhaps you’ve figured out or not. The ripples of an old energy are dangerous to you dangerous because if enough human beings buy into the old energy, it’s going to slow things down and some of them will occur. \\nNow you know what I would ask you to do. I want you to start spreading the word to everybody you know who would ask you, who would mention it in idle passing or not. Shape your words, for a good future. Don’t buy into this. Don’t be persuaded that something awful has to occur. \\nDear ones, the prophecies have come and gone. You are in the clear. \\nBut the ripples are still there of the old energy. \\nWhen you hear those speak of it. You can tell them this. \\nWell, it didn’t happen. We got a good future ahead. \\nThey will start giving you chapter and verse of the old energy. They’ll tell you what has happened and therefore and therefore. They’ll pull the politics of the day into it, they’ll say and therefore and therefore. And you don’t have to convince them. All you have to do is show them you don’t agree. In a loving way, you can say, ” yeah, I don’t think so. I feel something good is coming.” \\nOld souls carry weight. You carry with your family, with your children, with your friends, with your colleagues. And the weight you carry is because of who you are and who they see in you. Are you a person who is slow to anger, who is quick to love? Are you a person who is not showing their age as much? Are you a person who has more energy than you should for your age? Are you a person that they will look at and they will say I don’t know what you got but I like it. They’re gonna listen to you, old soul. \\nAnyone who listens to my voice. I’m going to call it a name. I want you to rewrite the past. The old ripples of time that say that you are overdue for something was written in an old energy; you are rewriting that energy. You have seen the prophecies of an older time drop away. The Mayan calendar told you that old history and time was over. The new calendar that has been put up by the Maya says that history is going to go into a place nobody expected, that a new long count is here and that human consciousness can go into an evolved state higher than it’s ever been. Where is that realization? I will tell you, it’s only with the wise ones. And that’s you. You come to a meeting like this to get excited because you hear the facts, you see the physics, you hear the predictions, and you walk out the door and you know, absolutely know that things are different and the shift is here and there’s a chance that humanity will pull out of this faster than you know. \\nThat’s the first thing we ask you to do, but the second thing? Well, it may be backwards, dear ones. I do that a lot. Even the logic is in a circle. One thing leads to another. One thing builds on another. There are those listening to my voice that still don’t believe it. How are you going to live in a way that’s going to tell others to expect good things are coming; how are you going to rewrite this past if you haven’t really cognized it; if you don’t believe it? You say, well Kryon, that should have been the first thing. No, I wanted to give you the most profound thing first. \\nYou’re gonna have to change the past; \\nyou’re going to have to avoid the ripple \\nand that can only be done by high consciousness groups of individuals \\nwho arespreading the word in their own way \\nof a bright future for this planet, \\na better consciousness. \\nYou have to cognize it. You are going to have to believe it for yourself. You’re gonna have to know it’s different. It’s got to be your truth. So strong does it have to be that it competes with your belief system of whether gravity is real and not, whether when you drop something it’ll fall on the floor or not. That’s how cognizing works. It has to be part of your cellular structure. That’s why I’m here. I’m here, to carry humanity into a brighter future and to void out those ripples, those old energy things that we have felt coming and are still here. The earth is still expecting to terminate. \\n“Kryon, what do we do about that?” \\nWell if you just wait, it’ll go away. But that’s not what you want is it? Generation after generation will eventually clear the ripples– you are already starting to see it with the indigos. They’re not buying into an old energy system. One of those things they’re not buying into is the ripples. Are you going to wait for another generation and another and perhaps another before you can move forward? Or are you gonna start getting active? \\n“Kryon, I don’t really understand. What am I supposed to do, shout it from the rooftop?” \\nI’ll tell you what you are supposed to do. You watch because suddenly in your life you will have synchronicity to open your mouth. It will come from various sources and you remember this moment and you’ll smile because you say, “here it is.” Somebody will say to you, “do you believe this election? Do you believe what’s going on here; do you believe how bad all of this energy is?” What do you say normally? ” yeah it’s bad; I see it.” Or do you say, “I recognize it and you know what? \\nThe next one is going to be different. Things are changing. It’s going to get better. You just wait.” You say that, dear one; how many people will take that and repeat it? You see what you’ve done? At every single time you get the synchronicity to state a bright future, how many times have people complained to you or saw that you were a listener– and you are– and they come to you and they say, ” things are not going well”, what do you say? \\nWhat should come out of your mouth immediately, “That’s today; just wait for tomorrow. And if you will do this, and if you will believe this and if you will then find the God inside, perhaps you’ll find the joy to understand that humanity is headed for a bright future. You can go faster if you do that. You gotta believe it. Believe it, before it can be passed on. \\nThis is the first time I have broached this, that now your job gets harder. You called yourself a light worker; turn on the light. You’re going to find moment after moment after moment presented to you [wherein] you didn’t even recognize what you are saying or doing. \\nOr you can turn it around in a benevolent way– and not argumentative– and you can say yes I see the election isn’t that interesting. It’s going to be something different next time. Then after that even next time. You can say is that interesting to watch and see the old energy we never saw before. \\nAnd now we can start cleaning up. People will walk away saying either. That’s a wise old cheerful person, even if you’re young, or they’ll say that’s a Pollyanna and they walk away and do whatever they wish. It doesn’t matter what they do with that, dear ones, what you do with it. Can you turn things around so that you are a positive speaker? A positive speaker. \\nNumber three, the final. We will use three because this is the catalyst. This is going to be the catalyst. If enough old souls are doing this regularly, it’s going to be obvious to many. What’s going on with them? They are not echoing anymore the drama that’s here. They’re not agreeing anymore that the old energy is here. Instead, all they are seeing is light. \\nThe third thing. How do I tell you this. You’ve heard it before. This won’t be work [unless] you fall in love with yourself. This won’t be work if you [don’t] fall in love yourself. If you’re with a cheerful person, it’s contagious isn’t it? If you are with a person who is joy and laughter, it’s contagious isn’t it? Who are you? \\nNow you going to see I just went backwards on everything. Should’ve been the first thing I said; fall in love with yourself, cognize it’s real and spread the word. . . . \\nI want you to think about the circle of time you’re in and the fact that that’s why it is the way it is. The circle of time has created the belief that people have that doom is coming. The new energy that was predicted all over the planet is here and yet the old energy circle still exists in the psyche of those who’ve experienced it all their life. \\nEnter the old soul. With joy, with love; with the countenance that is a smiling countenance. Not a depressed one. Are you listening? Some of you need to hear this. You are so concerned with the earth, and what’s happening that you walk around depressed. May I just tell you. Your depression is not helping anyone, even you. You could be as concerned as you want to; you can frown all day long and you haven’t helped a soul. So, are you listening? God is joyful and the things that you worry about will be faster settled if you’ll spread the word of joy. That is all we’re asking. Change your countenance. \\nWatch for the synchronicities and at every single point if you can give a positive outcome, not an agreed on negative one. Oh, it’s easy to listen to somebody complain and say yeah that’s what it is and then you move on. How many times you do that? You might think was none of my business. \\nI don’t want to start an argument. You’re not dear ones, when you just state the obvious. My truth is that we’re climbing out of this. It may not look like it. Don’t watch the news anymore’ you can tell them, because all you’re going to see his ugly stuff and it is going to lay on you and hurt your heart. \\nTurn it off and create the reality that this earth needs. It’s getting better, not worse. There are those who will turn away and not believe you, and then there are those who start understanding what you’re saying. They may even come and listen to the facts that were presented, even this day that you won’t necessarily see on the news that this planet is going through a recalibration and starting to correct things that need correcting, and slowly the integrity of humanity is one that no longer wants war. \\nI want you to analyze how many countries are there on the planet and how many are actually fighting with everybody else. It’s a fraction of what it was 50 years ago, a fraction. There’s really only about three or four holdouts today that have dictators who would willingly invade another country. That’s old energy. Dear ones, that is not what’s going to happen. \\nTake a look at the reaction of the countries to this. Take a look at what what humanity in general is after and trying to do. Putting things together, not tearing them apart. Not circling the wagons and competing for resources anymore; trying to put together, make it work. \\nYou’ve been doing this long enough now that you can see it’s not the way it used to be. Telling friends. This is what the old souls is about today. It’s not going to be that hard. When you believe it. You walk around with a smile and joyful. People ask what have you got, what you doing? Why are you smiling so much? And you can say because things are getting better. They are getting better in my life because I’ve discovered there’s a shift going on. \\nThis this isn’t going to void out somebody’s belief system or religion for you to say the future is going to get better. \\nThe prophecies of the old and they didn’t happen. \\nThe’re not; that didn’t happen. \\nAll the timelines that were given to you, \\nincluding the end of time with the Mayans is not what took place. \\nInstead, things are starting to improve. – kryon \\nThat’s the message. You see because the the synchronicity will be given to you to comment more than you think. And then my advice is that comment in love in joy, not in opposition. There’s a difference. You can hold them to your bosom as friends as mates and at the same time you can give them beautiful information without making them wrong because you’re giving it in joy, with a smile. I believe things are going to improve. That’s the predictions of the ancients. We passed the corner. It’s tough time right now you’re seeing a lot of opposition to light and I am the light. What a joyful, loving answer, not an opposing proposition, not an opinion, that’s different. It’s just a statement of power. Old soul, you know how to do this; you been there, you’ve done that; you know human nature. \\nFall in love with yourself. Start to change your [countenance] in joy. Cognize the truth that things are happening differently and then cancel this ripple of doom. If you can cancel the ripple, or even make a dent in it. I will tell you the speed of what is going to take place will quicken. \\nThe fewer people who expect the end will create a far faster evolution of consciousness on this planet. But those ripples of doom that are not going to happen that people still sense and have got to go away or be erased or at least diminished before some of the things that I know are coming will arrive. \\nYou have a bright future. \\nWait till you see the next wildcard. \\nIt’s not coming until the planet \\nis clear of expecting the end. \\nThere are some movies being developed that may surprise you because the Indigos are young [old] enough now to be writing the scripts. There will be some of hope; there will be some that are rewriting the past and reminding those in the story of the things that did not happen. \\nThere’ll be those who are brave enough to paint the future, something they didn’t expect that would be good. Watch for this. It’s just now beginning to happen. Watch for linear literature that changes with writers who are now writing about a kinder, softer future. What is at hand that might work. Watch for exciting stories, even science fiction about a bright future. Watch for stories about meeting benevolent aliens that might actually help the planet and the drama that would ensue around it and those who might not believe them. It’s all part of voiding the ripples of doom and it can advance your evolution by generations. \\nDo you accept the task? This is the old soul; I’m hearing it all over the planet. It’s not going to be that hard– if you see the truth, and the light that is there. \\nI am Kryon in love with humanity for obvious reasons. I’ll say it again. I have seen this before; you have seen this before. It’s in your akash on another planet. It’s starting to reoccur; starting to come back to you. You are starting to feel better about it, At the same time, you understand, God is inside you. You have help. You are not doing this alone and you’ll see it; you’ll see it. That’s enough for now. And so it is. Kryon channeled by Lee Carroll in St Louis, August 20, 2016 \\nSF Source Rosalie Parker Nov. 2016 Share this:'"}, "time": 1742561794.1774611}