{"duration": 0.01577925682067871, "input_args": {"text": "'India to install modern avionics in Mi-17V5 helicopters 26 October 2016 Sputnik Amid rising militancy in its different regions, India intends to install more avionics that would boost its military strength in fighting militants in the dense forests of Kashmir and other dangerous areas. Facebook A Mi-17 V-5 helicopter is demonstrated at the testing facility of the OAO Kazan Helicopter Plant, part of the Helicopters of Russia, a Russian helicopter building holding. Source:Maksim Bogodvid/RIA Novosti \\nIndia has decided to add some more strength in its Russian made military helicopters Mi-17V5. \\n“Ministry of Defence intends to procure and install approximately 200 sets of Electronic Warfare Suite comprising Radar Warning Receiver (RWR), Missile Approach Warning System (MAWS) and Counter Measure Dispensing System (CMDS) on Mi-17V5 helicopters,” reads a request for information issued by the Indian government. \\nThe system will provide self-protection to the helicopter against radar controlled weapons and IR seeking missiles by employing different counter measures such as chaffs, flares and directed infra-red. The Missile Approach Warning System (MAWS) is intended to provide the capability of detecting, identifying warning and prioritizing air to air and ground to air threat missiles to the pilot. Fifteen Mi-17V5 helicopters would also be integrated with Laser Warning Receiver (LWR) and Directed Infrared Counter Measures. \\nRussian Mi-17 V-5 helicopters to ferry Indian VVIPs - report \\nIndia also wants to secure its helicopters against radar controlled weapons and IR seeking missiles. For this Bharat Dynamics Limited (BDL) has design and developed the Counter Measure Dispensing System that will be integrated on to the platform. \\nIndia plans to buy additional helicopters from Russia out of which more than a dozen will be made available to the BSF. India had already approved the purchase of 48 more Mi-17V-5 medium lift helicopters. Delivery of 151 Mi-17V-5 helicopters was made in February this year. \\nFirst published by Sputnik .'"}, "time": 1742628496.3729348}