{"duration": 1.0022482872009277, "input_args": {"text": "'Archives Michael On Television Barack Obama Is Wrong: 18 Facts Which Prove That Illegal Immigration Is An Absolute Nightmare For The U.S. Economy By Michael Snyder, on May 11th, 2011 \\nBarack Obama has declared that “ immigration reform is an economic imperative “, and is promising to do his best to get an immigration bill pushed through Congress this year. But will “legalizing” all of the illegal immigration that has taken place over the last several decades improve the struggling U.S. economy or will it actually make our economic problems worse? One of the favorite tricks of top politicians is to promise that the economy is going to improve if we just support what it is that they are currently pushing. Hopefully the Americans people will not buy the nonsense that Obama is spewing. The truth is that Barack Obama is wrong about the economic impact of illegal immigration. Illegal immigrants don’t do jobs that Americans “don’t want” to do. A million Americans recently showed up to apply for a job at McDonald’s. That is how desperate Americans are for work these days. Please don’t try to tell me that there aren’t millions of Americans out there that would not pick fruit for minimum wage. The millions upon millions of illegal immigrants in this country are stealing jobs, they are depressing wages in a whole host of industries and they are a huge factor in the erosion of the middle class. Millions of middle class American families can’t afford to provide for their families anymore and are losing their homes, drowning in debt or going bankrupt. Rather than what Barack Obama is proposing (which is to essentially “legalize” illegal immigration), we need an immigration policy that makes sense and that protects American jobs. \\nBefore we go any further, it is important for me to make a few points. It is not a bad thing that people want to come to this nation from another country. A lot of people that want to come to the United States are really hard working and have really solid character. This nation has a long tradition of immigrants arriving to build a better life here. At different times this country will need different levels of immigration, but we will always need new immigrants. People on one side of a border are not more “valuable” than people on another side of a border. There is a reason why our founding fathers believed that “all men are created equal”. In every nation on earth there are really wonderful people. We should love all men, women and children no matter where they were born and no matter what they look like. God created us all and He loves us all dearly. \\nThe reason I went into all that is because of the way politics is played in America in 2011. The moment that anyone suggests that there might be a problem with illegal immigration they are immediately branded with all kinds of horrible labels. To put a horrible label on someone that is completely and totally untrue just to score political points is absolutely despicable. \\nThe funny thing is that some of the organizations that denounce others the loudest should actually be examining themselves. For example, one of the largest pro-illegal immigration organizations is called “La Raza”, which literally means “ The Race ” (as if we all couldn’t figure it out). Perhaps it is time for them to come up with a new name. \\nLook, we all have to start learning to love each other. If not, our society is going to continue to break down. \\nA majority of the American people (yes, that is what the polls show) are not against illegal immigration because they “hate” another group of people. Rather, they just want all immigrants to go through the “front door” and they want the government to be sensitive to changing economic conditions. \\nThe sad truth is that the U.S. government has absolutely refused to secure the U.S. border with Mexico for decades, and this has allowed millions upon millions of criminals, drug dealers and gang members to cross freely into the United States. In addition, by refusing to secure the border we have allowed new diseases to spread unchecked into this country. \\nMeanwhile, the law abiding people that would like to get into this country legally are put through absolute hell. I used to practice law and I have filled out immigration forms. The process is a complete and total nightmare. \\nSo we have been making it really easy for law breakers to sneak in the back door of our country and we have been making it really hard for law abiding people to get in the front door. \\nWhat in the world could be wrong about wanting to fix that? \\nOnce many illegal immigrants arrive in the United States they either try to make a living legally (by directly competing with blue collar American workers for jobs and driving their wages down) or illegally by selling drugs or being involved in other kinds of criminal activity. \\nApparently Barack Obama believes that this kind of behavior should be rewarded with a “path to citizenship”. \\nThe vast majority of illegal immigrants pay absolutely no federal or state income taxes and they never intend to. At the same time, they seem more than happy to take advantage of the free social services and benefits offered to them. In fact, stories of how “good” life in America is just encourages more and more immigrants to come to the United States illegally. \\nWe need an immigration policy that insists that everyone come in through the front door. \\nIs there anyone out there that cannot agree with that? \\nWe also need to set immigration levels that our economy can handle. \\nRight now our economy is struggling. Millions upon millions of Americans are out of work. 44 million Americans are on food stamps. 47 million Americans are living in poverty. We just can’t take in a whole lot of extra workers right now. \\nYou would think that would just be common sense. \\nBut instead, Barack Obama wants to grant amnesty to all of the illegal immigrants that are already here and put them on a path to citizenship. \\nWow – do you think that might embolden millions more illegal immigrants to come flooding in? \\nBarack Obama is against a border fence. He says we don’t need it. \\nMeanwhile, thousands more illegal immigrants pour into this country every single day. \\nBarack Obama supports all of the “sanctuary cities” that have openly declared that they are not going to enforce our immigration laws. \\nSo where do you think illegal immigrants are going to flock to? The truth is that word about these “sanctuary cities” gets around really fast. If you live in one of these cities, then you probably know all about it. \\nIf Barack Obama gets his way, nobody will be breaking our immigration laws because essentially there will not be any more immigration laws. \\nNot that George W. Bush was any better. He was an absolute disaster on immigration as well. \\nThe truth is that our immigration policy has been slowly eroding the U.S. middle class for many decades. \\nBut according to Barack Obama , we desperately need to implement his “immigration reform” plan for the good of the middle class…. \\n“One way to strengthen the middle class in America is to reform the immigration system, so that there is no longer a massive underground economy that exploits a cheap source of labor while depressing wages for everybody else.” \\nWhat a joke. The reality is that illegal immigration hurts that U.S. middle class and it is severely damaging to the U.S. economy. Because of illegal immigration, every single day wages are lost, taxes don’t get collected, hospitals provide “free health care” for which they are never paid, huge criminal gangs of foreigners are roaming our streets and the cost of providing social services to illegal aliens is slowly bankrupting state and local governments. \\nThe following are 18 facts which prove that illegal immigration is an absolute nightmare for the U.S. economy…. \\n#1 Illegal immigrants take jobs away from American citizens. According to a review of U.S. Bureau of Labor Statistics and Census Bureau data, legal and illegal immigrants gained over a million additional jobs between 2008 and 2010 even as millions of American citizens were losing their jobs during that same time period. \\n#2 The majority of our immigrants now sneak in through the “back door” that the federal government purposely leaves open. Thanks to the negligence of the federal government, far more people move into the United States illegally than come in through the legal immigration process. This has got to change. \\n#3 Illegal immigrants generally don’t pay taxes. The vast majority of illegal aliens would never even dream of paying income taxes, but Mexicans living in America send billions upon billions of dollars out of the United States and back to Mexico every single year. \\n#4 Although illegal aliens pay next to nothing in taxes, they have no problem receiving tens of billions of dollars worth of free education benefits, free health care benefits, free housing assistance and free food stamp benefits. Many communities in the United States now openly advertise that they will help illegal aliens with these things. \\n#5 The cost of educating the children of illegal immigrants is staggering. It is estimated that U.S. taxpayers spend $12,000,000,000 a year on primary and secondary school education for the children of illegal immigrants. \\n#6 Thanks to illegal immigration, California’s overstretched health care system is on the verge of collapse . Dozens of California hospitals and emergency rooms have shut down over the last decade because they could not afford to stay open after being endlessly swamped by illegal immigrants who were simply not able to pay for the services that they were receiving. As a result, the remainder of the health care system in the state of California is now beyond overloaded. This had led to brutally long waits, diverted ambulances and even unnecessary patient deaths. Sadly, the state of California now ranks dead last out of all 50 states in the number of emergency rooms per million people. \\n#7 It was estimated that there were approximately 7.7 million illegal aliens employed by U.S. employers during 2008. How much better would our economy look if all of those jobs were being filled by American workers? \\n#8 The region along the U.S./Mexico border is now an open war zone. Just across the U.S. border, the city of Juarez, Mexico is considered to be one of the most dangerous cities on the entire planet because of the brutal drug war being waged there. In fact, Juarez has now become the murder capital of the western hemisphere . Much of that violence has begun to spill over into areas of the southwestern United States. \\nFor example, a while back NPR described one incident in the Juarez Valley that involved American citizens…. \\nA couple of weeks ago, gunmen in the Juarez Valley killed the Mexican relative of a Fort Hancock high school student. When the student’s family in Fort Hancock heard about it, they crossed the border at 10 a.m. to see the body, and took the student with them. \\n“By 10:30, they had stabbed the relatives that went with him, which included his grandparents, with an ice pick,” says school superintendent Jose Franco. “My understanding is that the gentleman is like 90 years old, and they poked his eyes out with an ice pick. I believe those people are still in intensive care here in a hospital in the U.S.” \\n#9 A substantial percentage of young illegal immigrants end up in gangs. U.S. authorities say that there are now over 1 million members of criminal gangs operating inside the United States. According to federal statistics, these 1 million gang members are responsible for up to 80% of the violent crimes committed in the U.S. each year. Latino gangs made up primarily of illegal aliens are responsible for much of this violence. \\nAccording to the Center for Immigration Studies , some of the most notorious gangs in the country are made up almost entirely of illegal immigrants…. \\n“Gang investigators in Virginia estimate that 90% of the members of MS-13, the most notorious immigrant gang, are illegal immigrants.” \\n#10 The “18th Street Gang” is certainly giving MS-13 a run for their money. It is believed that the 18th Street Gang has thousands of members in the city of Los Angeles alone. In fact, the gang has become so notorious that there are even rumors that some police officers in Los Angeles simply will not venture into the areas most heavily controlled by the 18th Street gang. \\nThe following is what Wikipedia says about the 18th Street Gang…. \\nA US Justice Department report from 2009 estimates that the 18th Street gang has a membership of some 30,000 to 50,000 with 80% of them being illegal aliens from Mexico and Central America and is active in 44 cities in 20 states. Its main source of income is street-level distribution of cocaine and marijuana and, to a lesser extent, heroin and methamphetamine. Gang members also commit assault, auto theft, carjacking, drive-by shootings, extortion, homicide, identification fraud, and robbery. \\n#11 The “drug war” in northern Mexico is one gigantic bloodbath. The Mexican government says that as many as 28,000 people have been slaughtered by the drug cartels since 2007. A very significant percentage of those deaths have happened in areas right along the U.S. border, and yet our federal government still sees no reason to get serious about border security. \\n#12 It is an open secret that Mexican drug cartels are openly conducting military operations inside the United States. The handful of border patrol agents that we have guarding the border are massively outgunned and outmanned. \\nOne agent who patrols the border and who asked to remain anonymous told Fox News the following…. \\n“To say that this area is out of control is an understatement.” \\nA different federal agent put it this way in an email to Fox News …. \\n“Every night we’re getting beaten like a pinata at a birthday party by drug, alien smugglers.” \\n#13 Federal border officials say that Mexican drug cartels have not only set up shop on U.S. soil, but they are actually maintaining lookout bases in strategic locations in the hills of southern Arizona. If you go to Arizona today, there are actually signs that have been put up by the federal government warning American citizens not to venture into certain wilderness routes that are used by Mexican drug cartels to bring in drugs. \\n#14 The drug war being waged on both sides of the border is so violent that it is almost unimaginable. For example, one very prominent Mexican assassin known as “the soupmaker” has confessed that he made approximately 300 bodies disappear by dissolving them in acid baths. But right now there is essentially nothing that is preventing the next “soupmaker” from crossing the U.S. border and moving into your neighborhood. \\n#15 Arizona police are being openly warned by the Mexican drug cartels that if they try to interfere with the drug traffic in their area that they will be “taken out” by drug cartel snipers . \\n#16 While the U.S. military endlessly hunts for “members of al-Qaeda” in the caves of Afghanistan and on the streets of Iraqi cities, a very real threat has been building just south of the border. Over the past 15 to 20 years, Hezbollah has set up operations all over Mexico, Central America and South America . Hezbollah is reportedly making a lot of money in the drug trade and in trafficking illegal aliens. Sadly, our government is largely ignoring this. \\n#17 Each year, it costs the states billions of dollars to incarcerate illegal immigrant criminals that should have never been allowed into the country in the first place. It is estimated that illegal aliens make up approximately 30 percent of the population in federal, state and local prisons and that the total cost of incarcerating them is more than $1.6 billion annually . \\n#18 The drug cartels and the gangs always seem to be a couple steps ahead of our agents along the border. Approximately 75 tunnels along the U.S. border with Mexico have been discovered by law enforcement authorities in the last four years alone. \\nHow much do you think all of this crime, gang violence and drug cartel activity is costing our economy? \\nWhy won’t the federal government do what the Constitution requires and secure the border? \\nOh, but Barack Obama says that he has a plan. \\nHe says that he is going to save the day. \\nThe following is how Barack Obama describes his plan… \\n“We are not going to ship back 12 million people, we’re not going to do it as a practical matter. We would have to take all our law enforcement that we have available and we would have to use it and put people on buses, and rip families apart, and that’s not who we are, that’s not what America is about. So what I’ve proposed… is you say we’re going to bring these folks out of the shadows. We’re going to make them pay a fine, they are going to have to learn English, they are going to have to go to the back of the line…but they will have a pathway to citizenship over the course of 10 years.” \\nSo how many illegal immigrants do you think are going to step forward to pay a fine? \\nOne percent? \\nHow many of them do you think are going to show up for English classes? \\nWho is going to make them do it? \\nObama? \\nAre we going to have law enforcement officials running around trying to collect fines from illegal immigrants and trying to get them to attend their English lessons? \\nAccording to Obama, the millions upon millions of illegal immigrants that are in this country are going to be glad to willingly do the following…. \\n1) Admit they broke the law \\n2) Pay back taxes and a fine \\n3) Learn English \\n4) Be willing to undergo background checks before starting the legalization process \\nThose four points are taken directly from Obama’s plan. \\nSo what are illegal immigrants going to do when this plan is passed? \\n99 percent of them are going to laugh and they are just going to keep on doing what they have been doing. \\nLarge numbers of illegal immigrants are already enjoying the “high life” in the dozens of “sanctuary cities” across the United States. \\nThe following is how the Ohio Jobs & Justice PAC defines sanctuary cities…. \\nGenerally, sanctuary policies instruct city employees not to notify the federal government of the presence of illegal aliens living in their communities. The policies also end the distinction between legal resident aliens and illegal aliens–so illegal aliens often benefit from taxpayer funded government services and programs too. \\nSounds like a good deal to me. \\nCan I sign up for that plan? \\nAfter all, who wouldn’t want to earn all income tax-free and yet enjoy unlimited government services? \\nToday we are being told that we need to make life as comfortable as possible for the waves of illegal immigrants that are coming in. In fact, Barack Obama says that all of us need to make sure that our kids are learning how to speak Spanish …. \\n“I don’t understand when people are going around worrying about, we need to have English only. They want to pass a law, we just, we want English only…Now, I agree that immigrants should learn English, I agree with this. But understand this, instead of worrying about whether immigrants can learn English, they’ll learn English, you need to make sure your child can speak Spanish.” \\nAll of this is utter insanity. \\nThe cold, hard reality of the matter is that we have tightly secured the border between South Korea and North Korea for over 50 years and we could secure our own borders if we really wanted to. \\nBut instead, we continue to leave our border with Mexico completely wide open. Thousands of criminals, gang members and drug pushers continue to come in completely unchecked every single day. \\nMeanwhile, the rest of us have to subject ourselves to some of the most humiliating “security measures” imaginable before we are even allowed to get on to an airplane. \\nIt doesn’t make a whole lot of sense, does it? Don’t Buy A House In 2011 Before You Read These 20 Wacky Statistics About The U.S. Real Estate Crisis » Gary2 \\nI am against all illegal immigration. There are more progressives that agree with my point of view on this but we are a minority. \\nThe reason we have illegal immigration is because the scum bag rich and corporations want to pay poverty wages and this has worsened the income and wealth inequality. It has allowed all wages for Americans to be driven down. \\nThis problem could literally be solved in a month if the politicians wanted it fixed. Very few cross form North to South Korea so it can be done. The reason it is not fixed is simply because the rich business owners and corporations buy the politicians to get their way. \\nThere is absolutely nothing positive about illegal immigration for regular folks, only the rich. \\nWe already have way too many low/no skill Americans and many skilled who are grossly underemployed. We also have way too many people in this country period. When is the last time you drove down any road and said that you wished there was more people/cars clogging up the road ways. \\nIt is a myth that there are jobs Americans will not do, they just will not do them for a dollar an hour so some greedy scum business can get rich by exploiting them. \\nMichael I am with you on this one! Michael \\nGary: \\nI have to say I am a little surprised. I am glad we are in agreement! \\nMichael Terry \\nThey will leave when forced to. This will not happen at the hands of government people. \\nHow do you deport 12 (more like 30) million people? One busload at a time. We should not worry about “ripping apart families”? These people created the problem. Take your anchor babies with you. The current interpretation of the 14th amendment is a court perversion (notice a pattern with the judiciary?). This amendment was intended to confer citizenship on the offspring of freed slaves, who otherwise could never be citizens. randy \\nthose “security measures” won’t be limited to airports. wait until the next major phony “terrorist” attack on us soil. try getting on the interstate highway system after the next one! a bomb in the shoe…in the underwear…ya right! Mark \\nYou wrote: “The millions upon millions of illegal immigrants in this country are stealing jobs, they are depressing wages in a whole host of industries and they are a huge factor in the erosion of the middle class”. \\nIt’s not just ourselves at this time of economic chaos that we should think of. What about our children and grandchildren? They are going to have to deal with the descendents of these illegal invaders, not just in economic terms but in social terms as well, as the invaders’ offspring become radicalized politically and then become more and more demanding, hostile, and belligerent toward the European-American population. 2012 the last chance for america \\nread ron pauls position on illegals… http://en.wikipedia.org/wiki/Political_positions_of_Ron_Paul and vote for him..he is the last chance… Hans Kohler \\nWhy it is imperative to have a massive immigration into the United States now: \\nAmericans -mainly the ones of European ancestry- are indeed the offspring failed generations. In fact, the states involved in eugenics during the first decades of the twentieth century did not strictly enforce the sterilization laws on those people (low IQs, retards, deformed individuals, disease carries, imbeciles, etc). In fact, their ancestors were labeled as undesirables in Europe and expelled from their native countries. \\nConsequently, the following generations are the best evidence that defective genes has been transmitted from one breed to the next and worst of all, the chances that their descendants’ DNA carrying a more complex sequence of these defective genes are 100% guaranteed – they can be confirmed by performing scientific tests (i.e. bizarre mutations that will make these individuals being categorized as subhumans). \\nBesides that, never forget the following: “It is better for all the world, if instead of waiting to execute degenerate offspring for crime, or to let them starve for their imbecility, society can prevent those who are manifestly unfit from continuing their kind…Three generations of imbeciles are enough.” Supreme Court Justice Oliver Wendell Holmes, Jr. Buck v. Bell, 274 U.S. 200 (1927) \\nTherefore, the only way to sustain this unproductive generation of Americans (approximately 80% of the entire population of the United States) is by allowing a massive immigration of people from elsewhere in order to be assimilated into the system, so government can heavily tax these newcomers. \\nAmerica will need more than a hundred million foreigners to help paying the upcoming cost related to the care of these subhumans. Bob \\nI used to live in Southwest Phoenix for a while. I am glad I don’t anymore. If it isn’t a sanctuary city, it is very close. Sheriff Joe Arpaio is Public Enemy Number One in most of the media here (and yes, there are chain gangs with shotguns, too.) The reality of the situation is that America had the nicest house on the block, that we worked hard to keep up, and it is now being destroyed a little at a time, every day. Our politicians have lost the political will to deport those people who cannot or will not obey the rules of our country, and do not have the guts to kill (yes I said kill) those who repeatedly commit violent felonies. Mexico’s politicians are worse than hypocrites. Ask a Guatemalan how easy it is to sneak across Mexico’s “other” border. \\nTo me, there is almost no point in fighting Muslim terrorism half a world away, if we will not fight violent armed felons right here. Jane \\n..as the clowns in the house live large, we as a people are heading toward Mad Max. KB \\nIt seems as if the proverbial barn door is trying to be closed after every illegal has left the building. \\nI regularly have contact with multiple Hispanics, and they are all generally wonderful, wonderful people with one major exception: This generation’s disrespect is truly astounding, not to mention the crap that they hide behind. If the young ones do something that is wrong and get caught, they start screaming, “You’re a racist, you’re a racist” to whomever has caught them. What a crock, but they’ve learned that it works in our politically correct society. \\nI truly believe the US government should legalize drugs immediately and monitor them the same way prescription drugs are monitored and take the crime out of it. When Prohibition was instituted, criminal activity flourished. Now with drugs being illegal, the evils that are being committed are beyond belief. And for whatever reason, the American people are committed to indulging in drugs…which is truly beyond my understanding. \\nThe way it is going now, I can easily visualize a United States that is merely an extension of Mexico and South America. You have to wonder if that is what they intend anyway. I give it ten years before Spanish is the official language of the U.S. Singapura \\nThe US has rapidly become a rancid den of whiners that blame everyone but themselves for all the “hardships” they have to endure. They keep buying Chinese goods at low prices and complain if the manufacturers prefer to have their sweatshops set up in China rather than the US. In reality, who in the US (except “illegal immigrants” would want to work 10 hours a day for 2 bucks an hour? Then there’s the outrage against the banks that “sold” the US economy and enriched themselves. Yet at the hard of the economic crisis is the fact that Joe Smoe just had to own a house that was at least as big as his neighbors, preferably bigger. Never mind the fact that he probably couldn’t afford his mortgage in the long run. And every penny that was used to pay of the housing loan was immediately borrowed back to buy that big screen TV everyone was talking about. Renting and saving is for losers. Then there’s the group that cries about all the “illegals” and “criminals” that “poor over the border with Mexico”. As if there aren’t enough criminals inside the US! Most of the poor immigrants are currently mowing your lawns, washing your dishes and cleaning your toilets. Again jobs that “true” Americans feel are beneath them. When is the US going to wake up and take personal responsibility instead of blaming the rest of the world? Just Me \\nyou deport 20 million people by making it public that if you’re here illegally, you have 30 days to get out of the country, if after 30 days, you’re caught, you’ll go thru living hell for 60 days before you’re deported,bring our troops home and put them on our borders after word gets out and thousands are picked up and put thru the process, the borders will be run down with people leaving, other countries do not have this problem.Stop using our cops for just cash cow jobs, writing traffic tickets ect, let them enforce the laws. If lilly white english people are in a car, you usually assume they’re from here, but when spanish speaking people are pulled over, you find out where they are from and what they’re doing here, stop the politically correct crap and inforce our laws. If I was wandering around in the middle of Iran or China, their cops would have no problem asking me where i was from. Mark McBee \\nMS-13 is bad ass and I don’t mean it in a good way. DM \\nIt’s about cheap labor and corruption at the local, state federal levels. Big and small business like illegal workers. They are cheaper than legal workers. If leaders are not willing to enforce our laws, they need to be FIRED. I am not talking elections. I am talking impeachment. When Americans get mad and demand impeachment of corrupt government officials who thumb their noses at our laws, the fear of God will finally set in. \\nNo elections, just straight impeachment. emma \\nas if it wasnt a night mare already, but this is a great article. \\nIt is hard to try and trade this market that is manipulated I reckon. \\nThe guy from FFT is oz is good, I been following him for a while and he called the market crash in 2008. \\nI belong to his membership site, its awesome and has live videos and everything to follow along. Makes it easy to take money from the market even if you are a newbie!. \\nHis new monthly trading club is opening tomorrow, and over at :- Matt \\nYou keep mentioning how insane things are. I’m not sure that you understand the gravity of the situation. When an empire goes into decline with clearly insane policies like we have, then it is a time of great danger. Quite literally, the United States might not be here in two years. \\nHistorically, the probably of war when an empire goes into decline in the presence of powerful rivals is 6 out of 7. One historian even gives more signs to watch – the three Es: Empires in decline, economic volatility and ethnic conflict. \\nThe ethnic conflict to watch is war with Israel. Currently, there is a very high probability of war with Israel before the end of summer. This war will be unlike anything we’ve ever seen before. \\nSo this website is giving you signs that a massive collapse of the present world order is close. Buy American \\nI usually agree with the articles produced, but this one is very biased and doesn’t take into consideration many important points. First of all, many illegals are very law abiding residents who would never do anything to hurt a fly in our country. They respect our laws and have TIN numbers so they can pay their taxes. I doubt many of them cheat on their taxes or try to find loopholes. Secondly, I have known several illegal immigrants and they were working jobs that other Americans didn’t want. I talked once to a fast food restaurant owner and he said a typical American teen or young adult lasted about 1-2 weeks. They were lazy, didn’t want to do anything more than required, wasted time, couldn’t keep their pants up, had poor manners, showed up late or not at all, etc. A foreign worker was alway on time, respectful, did more than required, etc. He often lost money with American workers while foreigners made him profitable. \\nSo the problem isn’t the aliens, it is our society, a large percentage of the lower class doesn’t have the basic job skills necessary to keep an employer in business. Would you want to be served by someone like that young woman who jumped up on the BK counter? I’ve eaten at innercity restaurants where the American workers didn’t give a crap about anyone – In one case my whole family got food poisoning. If we were to get rid of all the immigrants, we would see a lot of business failures and probably wouldn’t find Americans willing to work the jobs these foreigners worked. \\nThere is also one other important factor. For any society to maintain itself, there needs to be a fertility rate of at least 2.2. Americans produce 1.6 kids per family. Muslim (legal) immigrants average 8 kids per family. In 50-80 years our country could become 35% Muslim – what would this do to our congress? Latins tend to have larger families and at least can counterbalance some of the Muslim influence. I would much rather have a Catholic Latin neighbor than a questionable Muslim Yemeni neighbor… \\nI believe we need to have a balanced immigration policy as was proposed about 10 years ago. Let immigrants who can prove they have been good “non-citizens” pay any taxes they owe and come on board. Any showing any type of illegal activity – deport them immediately. Then, after that point make a very clear immigration policy to prevent future illegals from coming in. (With the economy collapsing, this may no longer be a problem). Silver Bean \\nUnfortunately this author rants a lot and offers little substance for preventing more illegal entry. In addition there were no solutions offered on how we send home those who are here now illegally. The article whips up emotions but offers no real solutions. Just like last September, I believe it was the first Friday in September, Bill O’Riley interviewed Sarah Palin. He asked her THREE times what she proposed to do with people who are here now illegally. She offered NO solutions. Why? No politician wants to touch that hot potato. My suggestions: Finish the fence, bring back the troops and station them along the border with “shoot to kill orders”. (Try entering Mexico, North Korea, Iran, and a host of other countries illegally and see what happens to you). As for the ones here, people must offer proof of citizenship or a “green card” before receiving any social services, when pulled over at a traffic stop, and as a condition for employment. If they cannot offer proof then they can go the hell home. As for the sanctuary cities, the elected officials and city, county, state, and federal employees should be required to report suspected illegals. Anyone here illegaly is breaking the law and should be prosecuted and sent the hell home. How about using Americorp “volunteers” to help with the process? Matt \\nGary, we finally agree on something. But, I don’t hate the rich just for being rich. I hate people who cheat, lie, and break the law rich or poor. If you won powerball I would not despise you nor want to tax your winnings. Xander cross \\nAll is going as planned. What are you all upset about? You all voted for this several decades ago staring with the kkk to ms 13. it’s all about gang violence. I wonder if Michael watches gangland that comes on spike tv. Very good and informative show. I think Michael should do an article about that show. American \\nBelow are economic studies from the Immigration Policy Center: \\n“Tax Day would seem to be an appropriate time to inject some bottom-line reality into the long-running debate over whether or not immigrants in the United States “pay their own way” as taxpayers. As with nearly all aspects of the immigration debate, the controversy over how immigrants impact the public treasury is far too often dominated by emotionally charged rhetoric rather than hard facts. Many of these much-needed facts are provided in a forthcoming report from the Immigration Policy Center by Stephen Moore, Senior Economics Writer at the Wall Street Journal and former director of Fiscal Policy Studies at the Cato Institute, and Richard Vedder, Distinguished Professor of Economics at Ohio University. Using data from the U.S. Census Bureau’s 2005 Current Population Survey and other sources, Moore and Vedder find that immigrants not only pay their own way in taxes, but play a hefty role in shoring up the teetering Social Security system, and provide a fiscal windfall to U.S. taxpayers by tending to come to the United States during their prime working years—after the costs of their education and upbringing have been borne by their home countries.” \\n“Immigrants Pay More in Taxes Than They Use in Services Over Their Lifetimes: Depending on skills and level of education, each immigrant pays, on average, between $20,000 and $80,000 more in taxes than he or she consumes in public benefits.” William \\nRemember Carter’s amnesty, followed by amnesty from Ronnie Raygun?? This allowing foreigners to infiltrate America has been deliberate and planned. The result is that the white, Anglo Saxon, Christian way of life in America is being destroyed. WHO benefits??? Your masters, of course. Hint, they are not what they say they are……..they destroyed Russia and they will destroy America, turning what was the home of the free and the brave into a nation of slaves. karen \\nA few years ago Bush met with the president of Mexico and Canada, the reason for this is to combine this to countries to for The North American Union, open borders, research for your selves, all in the Grand Game of a NWO. gohome \\nImmigrants were very important when countries were young and developing. At that time developing countries needed cheap labor. People that were so depressed about their current standard of living would leave to countries like the United States and Australia and Canada for a better life. Now none of these countries needs more people. The message is loud and clear “We do not want you” and “you are not welcomed here”. \\nThis article is missing one big part. The biggest winners of the drug trade are the banks. Wachovia was caught not too long ago washing money for the cartels. They got a slap on the hand. SmokeDogg \\nBut I love Immigrant women….. Sighs.. \\nMuy Caliente!!! SmokeDogg \\nThe MS 13 are here as an NWO plot to start a Race war between us Blacks and Hispanics. The Racial Tribe brainwashing must cease. Bill \\nhttp://www.humanists.net/pdhutcheon/humanist%20articles/Multiculturalism.htm Patriot Alice \\nWith millions of immigrants depressing wages, the Corporations will have a larger pool of cheap labor to choose from, besides China, India etc… We’ve exported our wealth and imported the world’s poverty through globalization. Jane \\nHans is right. I just read an article “Can a society be mentally ill”? Add to that illness: vaccines, fluoride, GMO fake food etc…yep, we have a big problem. David Gurney \\nObama believes that borders are just book stores. Brett \\nWhy are you blaming illegal immigrants for problems that are, at it’s heart, the fault of the US govt? e.g. free education, free health care, etc. How about getting rid of those programs instead? Paul \\nYou can’t take somebody’s job away. A job is given to you – by the employer. \\nSo, book the employer and put him in jail for a year or two when he employs illegal immigrants. Paul David \\nPresident Obama’s immigration reform proposals are simply an attempt to gain Hispanic votes for the 2012 election. \\nSadly, our leaders don’t make decisions based on what’s good for our country… they make them based on how they will help them get reelected. \\nDavid Free Food 2Go \\nWith such a high jobless rate, you would think that our leaders would do everything possible to protect jobs for American citizens. Sadly that is not the case. \\nThe original role of the U.S. government was to SUPPORT states, but this administration is fighting against states who are trying to protect their borders, their jobs and their economy. David \\nPoliticians will continue to say what sounds good to the people, but the real political strength in this country is the corporate business world that pays the politicians. Corporate thinks it needs the illegal immigrants to keep wages low, so nothing really is going to change. \\ncheckpoints on interstate enterances and border walls to keep you in….. Crystal \\nI live in the southwest part of the United States and I can tell you illegal immigration here is a major problem. \\nFor many jobs you need to speak Spanish. This includes jobs such as housekeeping. This is because of the illegal aliens who have these positions. I know. I tried to get a housekeeping job and was told I would have to learn their language. \\nI no longer feel sorry for illegal aliens like I did in the past. I don’t care if they are hard workers. They don’t care about the American citizen who is unemployed and homeless. \\nAlso, many of them are on the social welfare system. Evenutally, I see the social welfare system collapsing and that safety net will not be there for American citizens who need it. \\nIf we ever hope to repair the damange done to the economic system in the US, one of the factors that needs to be addressed is illegal immigration. \\nTo Hans Kohler: You are kidding, right? Bill Meyer \\nAnother aspect of the problem: We the Sheeple LOVE “our” socialism benefits. You can’t have universal access to socialism benefits without setting up a massive police state to try and keep “them” from getting the benefits, too. (certainly when facing national bankruptcy) Dismantling the social welfare state would do much do decrease the attraction for these aliens. Here in Oregon listeners complain about having to jump through the police state drivers license process –“And if we have to, why aren’t those darn Mexicans doing it, too?”. Wrong question…Better to ask “Why are you allowing the USA to force YOU to jump through police state hoops?” One criticism on the post – the focus on all the drug cartel violence…what triggers this, and the profit motive? Yep, state interference and prohibition. These are state-created crimes and conditions. Crystal \\nOh! One more thing. \\nThis was a very good article. I have been fighting against illegal immigration for years and I’m glad that this article lists facts that can be used to stop and reverse illegal immigration. \\nKeep up the good work! VegasBob \\nFew remember that in 1986, a bi-partisan immigration reform bill (Simpson-Mazzoli) was passed that granted amnesty to several million illegals who were in this country as of 1/1/1982. \\nSo what America got as a reward for amnesty was an exponential increase in the number of illegals. \\nVery few native-born Americans seem to understand that both political parties want a continued influx of illegals. \\nDemocrats view the illegals as a source of votes that can be cheaply bought for the cost of a few social programs. \\nRepublicans view the illegals as a source of cheap labor that can be used to force down working class wages so that CEOs and their cronies can keep the mega-million$ in bonuses and stock options flowing. hunter \\nThey should be given 30 days to vacate, after which a bounty of $500. will be placed for each one turned in. After 6 months the bounty will be raised to $2000. and a mandatory sentence of 10 years hard labor will apply. Lets see if that thins them out, if not I have lots of ideas. Ohh and most importantly lets call for the impeachment of Obomba. liberranter \\nThe vast majority of illegal immigrants pay absolutely no federal or state income taxes and they never intend to. At the same time, they seem more than happy to take advantage of the free social services and benefits offered to them. In fact, stories of how “good” life in America is just encourages more and more immigrants to come to the United States illegally. \\nNo one, American citizen or immigrant, illegal or otherwise, should be paying ANY form of tax, period. Conversely, these “bennies” that the illegals enjoy and that serve as the bait for their crossing the border in the dead of night and setting up house here, wouldn’t exist, as no one would be paying taxes used to unjustly enrich anyone at anyone else’s expense. \\nSimply stated, without all these taxpayer-furnished bennies, Juan the Wetback and his one hundred relatives would have no reason to cross the Rio Grande unless they were planning on earning every penny of their bread by themselves, without the American taxpayer’s stolen dollars to assist. (And should Juan and his familia be tempted to turn to some form of organized crime, a well-armed American citizenry would put an abrupt and permanent end to any such scam.) \\n#1 Illegal immigrants take jobs away from American citizens. \\nSo do legal immigrants. Don’t forget about the Reigning State-Corporate Establishment’s gift to itself called the “H-1B visa program.” \\n#11 The “drug war” in northern Mexico is one gigantic bloodbath … \\n#12 It is an open secret that Mexican drug cartels are openly conducting military operations inside the United States. \\nThat the Mexican drug cartels are conducting military operations inside of U.S. sovereign territory should only surprise someone who has been living in a cave or in a coma for the last twenty years. With all of the imperial legions deployed in wars of conquest abroad, there is no one left at home to actually DEFEND THE UNITED STATES ITSELF other than a handful of lightly armed patriots ( real patriots, not the Fox News-viewing, state-worshiping fascists defined by the MSM.) \\nAs for the WoD itself, we’re all aware of the very simple solution to that: complete decriminalization of ALL “controlled substances.” Of course since the both the U.S. government and the Drug Cartels, bound up in a symbiotic relationship. are reaping HUNDREDS OF BILLIONS of dollars in profit off of this bloody criminal enterprise, such a common-sense approach is the last thing either of them want to see implemented. Ron in Colorado \\nWe should have made Joe Arpio head of Homeland Security. We should build a Marine Sniper training base on that border. (let your mind fill in the blanks) I believe that Mr sotoreo (alias Obama) will make this country what it once was, A vast barron wasteland! Fed Up \\nMichael, \\nThanks for the great article and organized info with links. The consequences of massive immigration (both illegal and legal) are bringing our country down super quickly. These immigrants are the poorest, most unskilled and uneducated of Mexico’s society. Basically we are subsidizing Mexico’s poor. Hispanics are now the majority population under 18 years of age in California. This is mostly due to illegals and their anchor babies. Over 5,000 illegals were caught voting in Colorado’s last election. \\nQuestion is always asked, “How do you deport 12-20 million illegals?” \\nThe easiest way to deport them is to stop ALL the incentives that bring them over here—they got here by themselves, they will get back to Mexico by themselves once the incentives are gone: \\n–Stop all welfare, free education, and health care benefits–Stop the enticement of birth right citizenship for all their anchor babies.–Crack down with severe fines and/or jail time to all businesses and landlords that hire and provide housing to them.–Stop being a slave to pollitical correctness, and speak out in your communities–we are too afraid of being called racists, so we don’t show up. \\nWith these enticements gone they will stop coming, and those here will go home on their own—except the gangs which we are stuck with for a LONG time, and will probably only get worse—the consequences of our supidity. bobi \\nThe cause of the economic crisis is NOT because of illegal immigrants. It is with the blatant spending in our government. What does it cost to operate the White House totally for one 24 hour period? The Congress, when they retire, receive the same amount of their salary plus their spouse gets $125,000.00 and this is per year, for life. They also do not pay into Social Security and have a medical plan, paid for by the govt. Nancy Pelosi has her own personal jet, which is owned by the government, to take her home to San Francisco every week and back to DC. The fuel cost is around $100,000.00 per trip. And who pays for all of this? WE DO, taxpayer money for these people to live way above what they need. Think about it. If you have enough money, you can lobby congress and get whatever you want. The big chemical and pharmaceutical corporations have made marijuana illegal and keep it that way by lobbying congress. And it goes on and on. We are all pretty much history anyway so I suppose it really doesn’t matter much now. Open your eyes folks, look and SEE what is up and has been for many many years. The human race is very close to extinction. \\nBoth sides would like to embrace the citizenship of Hispanics -simple put as they would become loyal Catholic, bumper children producers and loyal as VOTERS to the political party that gets them settled. \\nThis is not immigration but is a migration. \\nWe need a constitutional amendment on anchor babies. Since they are born with dual citizenship they are still citizens of south, so send them all back.No anchor children, \\nIt is time to beef up the border and not restrict border patrol from real firearms, ie: paint ball guns. Give up Afganastan and put the troops on the border. \\nYour political party- no mater who is in the white house is all smoke and mirrors. OT^ ZEROtolerance \\nInteresting though is that countries which do not tolerate illegal immigration such as Israel, Saudi Arabia, Kuwait, Australia, China, are doing so much better economically then countries that welcome illegals with open arms. Try to enter one of those countries illegally and see what happens. rickM \\nIf our country wasn’t so badly led, we could turn legal and illegal immagration into our favor. \\nWake up America! It’s time…“Join the Revolution” Don’t expect change when you’ve done nothing. \\nRead “Common Sense 3.1” at ( http://www.revolution2.osixs.org )“Spread the News” \\nThe biggest problems are access to the USA by all sorts of criminals. We need to stop access by smugglers of all stripes. It’s only a matter of time before the same parasite-bombers infesting the Middle East, bring it to our door- steps. \\nWe have much larger problems than immoral hiring practices. This situation is a poster child to the phrase, “the road to Hell is lined with good intentions”. McKinley Morganfield \\nVegasBob has the money quote: \\n“Democrats view the illegals as a source of votes that can be cheaply bought for the cost of a few social programs. Republicans view the illegals as a source of cheap labor that can be used to force down working class wages…” \\nThis is what it is all about. Few of the kleptomaniacs & sex trade workers in DC have any real interest in tackling this issue (or any other issue) head on. Most of them hire illegals as nannies, maids, and groundskeepers without having to pay a decent wage or social security & medicare matching funds. \\nAnyone who looks to DC to solve real problems in the real world is pitifully naive at best. Within 2-5 years the easy credit-debt-deficit bubble will not burst, it will implode. The concept of “too big to fail” will soon become “too big to save”. Ashes, ashes we all fall down. blueskies \\nIf we could trade our welfare generations and alcoholic/drug addicted citizens for a hard working illegal, I’m okay with that. One loser for every hard working illegal. The biggest issue I have with illegal immigration is the Dream Act. The taxpayers send an illegal kid through the 12th grade which is very generous. In Mexico, a family has to pay for this achievement for example. The illegal should apply for citizenship before being given a free ride to college. If this is the only country they’ve known and truly care about it, becoming a citizen should be a priority. It’s total BS that we accept people to do those crap jobs and usher their offspring to compete with our children and let them do it debt free, on the house. In this case, we don’t need no stinking illegals. John \\nIt is too late. The damage has been done. The best thing now is for complete economic and societal collapse, start over on a local level and rebuild. Our government is so corrupt and full of liars, one can expect nothing but more evil comming from Washington. My country abandoned me a long time ago. Look at the wonderful Ronald Reagan, a man whom most Republicans idolize. He signed the amnesty act of 1987, giving eight million illegals, illegal citizenship. It does not matter who you vote for, the game is fixed. Ron Paul won’t make a difference. Prepare for the worst. mark \\nA couple of items would help with this problem. One would not allow employers to deduct from their taxes the wages of workers that the social security number does not match and the other idea would be to move military bases to the border with Mexico. Turn the border into a training area with live fire training and bombing areas. Not many would try to go through a military base. Get rid of the bases in the cushy parts of the country and move them to train in the desert where most of the wars seem to be fought. This would also stop a lot of the drugs coming from Mexico. This would also save on hiring more border guards to patrol the rural areas that the bases would include. We could sell the land where the old bases were located, it would have to be worth a lot more than desert ranch land. Craig \\nAnybody who lives in a major metro area knows that the U.S.A. is overpopulated. ALL immigration needs to be stopped, otherwise our standard of living and quality of life will continue to decline. Adam \\nAmazing you two find agreement on an issue that you tout North Korea as a possible solution. Interlaced \\n“Americans” are here illegally anyways so what’s the point. When was it alright to come here in the first place? … Forget MS-13, they’re small potatoes when you consider the slaughter of nearly an entire race by European expatriation, then set rules to who should and should not come here? Spare me the patriotism … the “Americans” are complaining because they now want the jobs that they didn’t want before. What gives you the right? … The privilege of your ancestory? Drop dead. neo \\nCanadian idiot !!! I live on your stinking border and I know that your borders are AIR TIGHT because you do not want Mexicans coming into CANADA !! Your a typical brain dead young puke wanting a free ride for yourselves or for other greasy deadbeats. Grow up. Shiu Hung \\nI have lived and run my own construction business in the San Francisco Peninsula for over 30 years and over these past few years, my business has been greatly effected by the economic downturn, and especially from the huge influx of “illegal” immigrants from the south of our boarder. I consider myself to be progressive in my political leaning, and now have nearly separated myself from the so-called ‘left’ of this country. The sad thing about this ‘illegal’ immigration issue from the left perspective is that the word ‘illegal’ is always left out when this issue is being discussed and debated. It is obvious that many millions of American workers are being directly effected by the ‘out of control’ entry of ‘illegal’ immigrants, especially from Mexico, and according to President Obama, his logic is that by ‘legalizing’‘illegal’ immigrants, which according to the 2008 census, there are 14 millions ‘illegal’ immmigrants living and working in the US since. The 2011 figure we can bet is a lot higher. Just like everything he says, he doesn’t bother to explain to the American people how will granting Amnesty to ‘illegal’ immigrants, and to completely open the boarder will help our economy? He must think American people are too dumb to figure it out that their own government doesn’t care a damn bit about the citizens of this country. To them, it’s all about their re-elections and insure maximum profits for the corporate fascists that are ruining this great country. Things gets worse by the day, and ‘illegal’ immigrants are now becommng a ‘threat’ to our survival. We need to demand our government to end all international trade policies (NAFTA; GATT; FTA with Panama; Columbia; Korea, etc.)and to demand that big businesses bring back all the factories from overseas. Obama recently told the American people that by giving amnesty and completely open up the US boarder will insure that there will be highly trained and skilled workers from the ‘illegal’ sector, which he claims is sorely lacking in the US currently. That’s deceptive because there are plenty plenty of highly trained and skilled US citizens whom many are out of work. Obama is willing to make Ameican citizens the ‘sacrificial lambs’ by allowing ‘illegal’ immigrants to take away all of our well paying jobs by ‘undercutting’ and ‘falsely competing’ with us. It’s a fact that ‘illegal’ immigrants does not pay income tax and do not pay into our social security system but they are putting a tremendous burden on our social security system; health system; basic societal infranstructure. American citizens who don’t or can’t afford health insurance are turned away at local emergency rooms but ‘illegal’ immigrants are giving full privilage without any consequences. It’s a complete lie and ‘machiavillian’ tactic to claim that Ameican people are too lazy to do work which the ‘illegal’ immigrants are willing to take on. We want the same jobs they are getting but ‘WE WANT LIVING WAGES’ and not willing to undercut our own citizenry. “Illegal” immigration is a genuine problem that we all are facing and we must not be deter from fixing this problem out of fear of being labeled as ‘racists’ or not ‘politically correct’. The US left is living in a myth that our country can continue to carry the current capacity of people, especially from the continuing invasion of ‘illegal’ immigrants from south of the boarder. The US is facing water shortage; fuel and food shortage will also become an issue a lot sooner than we think. Aside from demanding big businesses stop hiring ‘illegal’ immigrants, which is also a must step to take to take on this problem, it is also important that American homeowners STOP hiring ‘illegal’ immigrants for all all their domestic work and to go back to hiring their fellow citizens, and to pay them ‘FAIR’ wages, rather than looking out for ‘cheap labor’ from the illegal immigrants. The solution to the ‘illegal’ immigration problem starts with all of us. Whatever happen to teenagers mowing lawns and doing gardening work for their neighbors, which I remembered from my childhood, was sort of a ‘passage to learning responsibility and work ethics, but from what I can see, even these jobs are taken away by ‘illegal’ immigrants. Everywhere I go these days, I see at least half dozen ‘illegal’ immigrant gardeners on every block in my neighborhood. Many of them are taking on landscaping work that are paid in excess of $600 per job, which if they are not properly licensed per the state’s contractor licencing law, are operating illegally. We need to demand from our state’s licencng board to go after these illegal immigrants whom are taking away these jobs from legitimate licensed landscaping contractors. \\nShiu mondobeyondo \\nWell, as a resident of a border state (Arizona), illegal immigration is an extreme hot-button issue here. \\nIn my view, the best way to attack it is to focus on the causes rather than the effects. Fences won’t help. For every 30 foot fence you build, the illegals have a 31 foot ladder to climb over it. Border Patrol won’t help either. The drug gangs have scouts who use cell phones to tell the “coyotes” (human smugglers) where “La Migra” are, and how to avoid them. These people are determined. They’ll cross miles of desert in 110 degree heat for a better life. \\nWe should focus more on why are they coming here, and try to solve the problem from there. \\n1) Low wage jobs – low wage to us, but to an illegal, it’s like hitting the jackpot. They will gladly pick lettuce for $3.00 an hour. Back home, they’d make $3.00 a DAY. \\n2) Money from the illegal drug trade – it is EXTREMELY lucrative, and that’s an understatement! The reason why there is so much bloodshed in Ciudad Juarez, Guadalajara, etc. is because drug cartels are fighting each other for that lucrative American business in L.A., Phoenix, Denver, Des Moines, New York City, Seattle, Minneapolis, etc. etc. Supply and demand. We have the demand (oh do we ever have the demand!!), and the cartels have the supply. They are literally killing each other, and innocent people too, to supply that demand. \\nIs legalizing drugs the answer? I’m torn on that issue. I do not want to see cocaine sold over the counter at the local Walgreens, but on the other hand, it would greatly reduce the profit incentive of the drug cartels. \\nProhibition during the 1920’s is a good example. Al Capone would not have become such a big gangster if alcohol was legal at that time. Likewise, the Zetas and their ilk would not have such an influence if hard drugs were legalized in the U.S. But again, that’s a rather prickly cactus to put your arms around… Red-blooded American \\nAfter you, jackass. You live off the productivity and ingenuity of our forefathers you ungrateful sack of shit. Enjoy it while it lasts. Richard \\n@ Red-blooded American, we live off the productivity and ingenuity of your forefathers???? lol What productivity?? You call torturing Bull’s, making blankets and pottery productive?? You live like animals, you can’t even feed your own people. Thats why you come to America to escape that cesspool called Mexico that your forefathers “productivity” and “ingenuity” has provided. If it wasn’t for the money coming from America you would starve living off your own productivity. Now go back to your Siesta, it’s the one good thing you do best. Manuel \\nAfter reading and deciding which “facts” do not apply if the U.S. ended the war on drugs and bring the troops back from overseas, i ended up with 7. And most of them have to deal with NAFTA, corporatism and outsourcing. Although i agree that Obama is completely wrong on this -i do not believe any word he says by the way-, they all come down to an external solution that has nothing to do with “legalizing” them. They will always be the scapegoat for politicians to get what they want and people in need that have been robbed so drastically by their government and their nanny state. rhea \\nIllegal immigrant populations seem to rise in proportion to Americans on social assistance. Correlation or causation? I figure that illegal immigrants are only doing the work that Americans on social assistance are too proud to do. \\nWant to do something about illegal immigrants? Make poverty unpleasant so people will choose to work instead of soak off the government. Then, when illegals can’t find work, they will find somewhere else to go. \\nOutsource your job search to us. Premium job search assistance – http://www.jobwaltz.com Tom \\nVery good article, well argumented. I found out a some things that I did not know. Good job. Anthony \\nThere is NO “War on Terror”……..The only “war” is on Your RIGHTS, not Terror. Remember the Jan. 2005 PANIC due to a rumor that Chinese with a NUKE had crossed the Mexican border and were headed to blow up Boston. The border is STILL wide open …… so like …. they care about airplanes but NOT about whole cities being NUKED?! http://www.cbsnews.com/stories/2009/02/26/60minutes/main4831806.shtml Above is a transcript from March 2nd 2009 (rerun on June 21) 60 MINUTES. In brief, the Government acknowledges that it has no control of the border. TONS of drugs and Millions of ILLEGALS enter this country. TONS of cash and TONS of weapons leave this country. They have no way of knowing how many “TERRORISTS” have crossed (IF there IS such a creature) TWO things were of major interest: (1) The Department of Homeland STUPIDITY acknowledges they have no control – therefore, HOW are they going to protect YOU from TERRORISTS, if they cannot stop GANGBANGERS, YARD WORKERS, NANNIES, COOKS from strolling across. (2) The “head” of the Department of Homeland STUPIDITY (and others) tries to blame your RIGHT to keep and bear ARMS for the weapons going south. The only trouble is …….. they showed and talked of MISSILES, HAND GRENADES, BELT FED MACHINES GUNS. Those are weapons STOLEN FROM THE AMERICAN MILITARY. They are not coming from the SEMI-auto Civilian world! They are direct from your Military’s ARMORIES. Not only can your Government NOT PROTECT the borders …. and YOU. The Government CANNOT HANG ON TO IT’S OWN WEAPONS!!! MEANWHILE – Your government cannot stop THESE terrorists ……. just how SAFE is YOUR FAMILY?! To Janet Napolitano and the DHS, What say yee about the footbridges???? - Anthony \\nYou are being TRAINED to SUBMIT …….. The TSA is specifically designed to lull the American Public into passively accepting random, pointless, searches at the whim of the government. Look at them. TSA screeners are being trained to be smiling and polite. WHY? To appear benign and unthreatening as they strip you of your Freedom. The reason they came up with an underwear bomber is the same reason they came up with a shoe bomber. First they wanted to get into your shoes and then they wanted to get into your underwear. After that they want to get into your body. But job one, day one, they want to get into your head. These are stages of humiliation designed to strip you of your dignity. Look at their faces, if YOU seriously believed the next passenger might be an armed and murderously suicidal killer, would you be all relaxed and cheery? If you seriously believed that the next suitcase you open may blow you to Kingdom Come, would you be a Perky Pixie? If you do NOT believe that ……… WHY ARE YOU HERE!? Renee \\nWay too many people are like dazed and confused cattle… hopeless \\nheres an idea, pull our troops from the middle east and liberate mexico of the drug lords, help them set up a new goverment, improve their life style so they may not want to come over the boarder to the USA. they still have pride of their mexican roots when they try to adapt in american (can you imagion their pride if they had a home to proud of?) if we could pull this off we would have a great ally. again just a thought, please don’t grade me on the my spelling or grammer. Pottertill Ron \\nThey will more likely to commit crimes, like theft, because they do not have to worry about getting deported. \\nYou forgot to mention that these southern thugs possess weapons at will to kill innocent Americans and Obama is promoting full speed ahead taking away weapons from Americans. Go Figure! Wake-up America! vanessa \\nIt’s funny cause if you really think about it, the citizens that are already living in the united states legally are killing more people than those who are undocumented. Randome-11 \\nWhat needs to be done? \\n1) Cut welfare for illegals. \\n2) Cut social security for illegals. \\n3) The penalty for employing illegals is jail time. \\n4) The penalty for housing illegals is jail time. \\n5) Cut education for illegals. \\n6) Illegals put in jail are forced to work, so they are no longer a drain to society. \\n7) Revoque citizenship for childrens of illegals, kick the anchor babies out. \\n8) Have the army put along the border, destroy anything trying to sneake in with drones, artillery, tanks and daisy-cutter bombs. \\n9) If illegals comittes heinous crimes against citizens, make them suffer as much as possible. \\n10) Encrochement into territory by military unites shall be considered acts of war and met with airstrikes. \\n11) Deport those who organized “sanctuary cities” along with the illegals. \\n12) Illegals are to be rounded up and sent to worker battalions, where they will work the cost of sending them back to whatever hell-hole they came from. Gunny \\nChuck Schumer, Mayor Blumberg, New Yorkers (city and state), and a number of President Obama’s administration have all endorsed “sanctuary states & communities”, amnesty programs, pathways to legal citizenship, AS WELL AS “anti-gun” programs, etc. So they should ALL love this proposal: \\n1. Make New York state the model “amnesty state”. Build a bus station at all border crossings (Texas, California, Arizona, et al) and have direct bus pathways to New York. All stops along the pathways will be heavily guarded so that these amnesty state seekers CANNOT escape in any other state. Any and all undocumented immigrants who want may go directly to Mr. Schumer’s state to take advantage of all the thousands of excess jobs he and his citizens continue to vote to offer up. (Obviously, most of NY’s citizens WANT this because they keep voting Schumer & Blumberg into office and they are ALWAYS offering up “immigration reform” to legalize the illegal aliens…) I’m sure the social and medical services of New York can easily absorb all the antibiotic-resistant tuberculosis, sexually transmitted disease infected and humans with other pre-existing diseases, etc., that will be coming their way. As well, I’m sure the NY prison system can easily handle all the sociopaths, criminals, non-licensed drivers, alcoholics, and other NY-desirable types that will soon be filling the facilities up. Mr. Schumer wants this not only for his state but also for the rest of our country. 2. Mandate that each and every one (who has come into the country via illegal methods) sign an affidavit verifying that they understand that what they did was illegal – a U.S.A FEDERAL FELONY. Fifth Amendment rights do not apply to non-citizens so if they attempt to invoke this “right”, they will be immediately deported and shipped back to the border. By signing the affidavit, they legally admit and agree to become de facto convicted FEDERAL U.S.A. FELONS, subject to a period of parole of no less than 20 years. By signing said documents, they agree to give up certain U.S.A.-guaranteed citizen rights: 1. The right to vote; 2. The right of gun ownership; 3. The rights to any social service monetary benefits until they have worked and paid taxes for a period of no less than 20 years; 4. They agree to be “on a probation period” of no less than a full 20 years. (should they violate this probation, they will immediately be deported BACK to whatever country the immigrated from); 5. They agree to pay a non-negotiable, flat 10% federal income tax of any income or money they make; 6 They agree to 500 hours of community service PER YEAR for the entire period of their probationary period (to help take care of all the other “immigrants” & services); 7. They agree to learn ENGLISH, the U.S.A.NATIONAL language; 8. They agree not to drive drunk, partake of illegal drugs, create public disturbances, run for elected offices, etc.; 9. They agree to meet with parole agents or to have the parole agents come to their domicile to inspect for any contraband included but not limited to drugs, firearms, ammunition, or whatever may be deemed illegal; 10. Any other requirement that may be levied at the time of enactment of Mr. Schumer’s bill into law. If they successfully pass the 20 year probationary period and meet all these requirements, then and only then will they be granted U.S.A. Citizenship. \\nWhat? Mr. Schumer, Mayor Blumberg, and B. Hussein Obama Bin Laden thinks this is too radical and too harsh? I thought they all wanted GUN CONTROL? They are forcing THOUSANDS of U.S. Military combat veterans to give up gun ownership (due to PTSD, which the government now claims is a “mental disorder”), so why not FELONIOUS ILLEGAL IMMIGRANTS? Why not make New York a test/model amnesty state? We could add Illinois (specifically the city of Chicago)! Let’s let each and every state VOTE on if they want to become an “amnesty state”. \\nSenator Scott Brown was recently elected by the Commonwealth of Massachusetts on a platform that included refusing to legitimize illegal aliens’ rights. Martha Coakley campaigned for the opposite and wanted to make MA an “amnesty state”. In fact, she illegally turned a blind eye on enforcement of immigration laws while she was the state’s attorney general. \\nSend every undocumented alien back to the border, anchor baby or not, no matter how long they’ve been in the U.S.A., no return rights at all. One felony is too many for a non-citizen. \\nI say vote all the anti-U.S.A. leaning bums out of government at all levels, as soon as possible, but most especially come November, 2012. \\nNew York, California, Rhode Island, Nevada, Pennsylvania, Massachusetts, Arizona, Florida, and all you other RED STATES – ARE YOU LISTENING??? Terry Beatty \\nYou might have more credibility if your article wasn’t splattered with random blue, underlined highlights. Just silliness, not not very professional. Great article though, after I got it cleaned up. \\nHey dummy, those “Blue highlights” are links to articles that reinforce his article. Duh! Loveitorleaveit \\nMay 12th, 2011 at 1:28 am Interlace wrote: “Americans” are here illegally anyways so what’s the point. Forget MS-13, Spare me the patriotism … the “Americans” are complaining because they now want the jobs that they didn’t want before. What gives you the right? … The privilege of your ancestory? Drop dead. . \\nHmmm you sound like quite a bitter person. You are probably from Mexico, or some South or Central American country, who is enjoying the American way of life. Yet you would like to bring your intolerance of European Americans to the front. Sorry Chap, pack your bags and get your sorry azzz back to that mud hole of a country you and your parents came from, because European Americans are here to stay! operation iraqi freedom war vet \\nYou really should go to a website about FAIR and how the immigrants are taking the “TRUE AMERICANS” JOBS FROM US BECAUSE THEY WILL TAKE LESS PAY AND DON’T NEED A DEGREE!! I fought for this great nation and WTF!! have you done for it exactly? Oh and not all Americans are immigrants, so why don’t you read up on true American History or do they not have it where you are? ANOTHER THING BECAUSE IMMIGRANTS WILL TAKE LESS PAY THEY ARE CAUSING AMERICANS TO LOSE THERE JOBS AND WHAT ABOUT THEIR FAMILIES? IT SOUNDS TO ME LIKE YOU DON’T REALLY CARE ABOUT THE UNITED STATES OR THE CITIZENS!! Interlace \\n“Hmmm you sound like quite a bitter person. You are probably from Mexico, or some South or Central American country, who is enjoying the American way of life. Yet you would like to bring your intolerance of European Americans to the front. Sorry Chap, pack your bags and get your sorry azzz back to that mud hole of a country you and your parents came from, because European Americans are here to stay!” LOL … I’m Canadian. How does it feel to be someone that has had a American education and still not amount to anything? Or should we pity you because you have had every advantage given to you and your level of intellect is still only a fraction of a primate? So I believe it is you that resembles the mud hole origination. My mudhole is proudly Canada, I don’t live in the US. BTW: How do we have major cities with millions of people and less than 100 homicides? We are more diverse than you are, yet people like you off each other at record rates. Talk about intolerance … LOL! \\nI have nothing against “European Americans” which by your logic makes me “European Canadian” to which I prefer “Canadian” btw. I have something against ignorance, plain and simple and yet you solidify my stance that people like yourself are more fearful than knowledgeable and have to rely on short statements like “You and your sorry azz …” to convey through weakness what your brain can not construct through rationale since you have assumed that I am “probably from Mexico or some …” which isn’t even in the right direction! LOL, that great education at work! \\nBut you are right …“European Americans” are here to stay, albeit I believe the statistics are not in your favor within a few generations … \\nI’m for people without ignorance and am partial enough to disqualify people of my own “race” if they are not general in their overall outlook. Look up north and see how our civilization has broadened … or you can still stay in your “mud hole” to the south … andrew \\nif all illegals had blond hair and blue eyes immigration would not even show up on the radar screen. stop promoting racist nazi propaganda.all races except the Native american Indian and Native Mexicans of the southwest are legal everybody else had ancestors who were illegals. Space \\nWe are not Illegals anymore. No where close, my ancestors yes. But I’m me, and I was born in AMERICA, nowhere else. WAR VETERAN \\nBITTER MUCH?? MAYBE YOU ARE GETTING GOVERNMENT HELP OR GETTING TAX FREE MONEY AND DON’T WANT TO LOSE IT!! Richard \\nandrew, there is no such thing as a Native Mexican in the southwest United States. Mexican’s slaughtered Native Indians who lived there by the thousands and stole their land, they are no more entitled to be called Native Americans than white Europeans are. Maybe you should bone up on history before trying to sound knowledgeable about a subject you obviously know nothing about. Another thing you are mistaken about is the fact that most original immigrants to the U.S didn’t have blond hair and blue eyes. Golden Child \\nI just started at a job at a produce warehouse. Nearly everyone working at this job is Mexican and none of them speak English at all. This comes as no surprise because what American would work for $8 an hour when gas is over $4 a gallon? If you take in to account that a gallon of gas was barely over a dollar eight short years ago, $8 an hour is basically like working for $2 an hour in 2011. The only reason why illegal Mexicans can afford to work for such depressed wages is because most of them live in tiny one bedroom apartments with 20+ other single men! Unless Americans start living like this, there will be hundreds of thousands of more homeless formerly middle class families in the months and years to come. Unemployed Americans will continue to be unemployed month after after month until they accept minimum wage jobs that haven’t been adjusted for inflation and the astronomically rising cost of living. Jordan \\nDecriminalize drugs, completely eliminate the welfare state, and allow open immigration. \\nThis path will provide a huge boost to the economy because only the hard workers and producers will bother coming. The leechers (of free welfare benefits) and drug runners will have no incentive and will no longer be the drain and bad name of immigration. \\nMost importantly, this path fulfills our tradition of liberty where all men have the right to pursue a better life for their families and should not be punished because they had the chance of being born in a failed state. Kudos to this article for doing a nice job of pointing this uniquely American attribute out. \\nLet’s return to our values illustrated in the Constitution and the Bill of Rights that made America the greatest country in the history of humanity. Loveitorleaveit \\nInterlace wrote{ LOL … I’m Canadian. How does it feel to be someone that has had a American education and still not amount to anything? Or should we pity you because you have had every advantage given to you and your level of intellect is still only a fraction of a primate? Figures it would be a “CANADIAN” who proudly and arrogantly trashes their “neighbors” the “USA” and you trash the USA with a envious sense of pride all the time basking in the USA protective Armed forces. Not to forget to mention your country hardly sacrifices anywhere in the world to protect “YOUR” freedom! Just remember what ever befalls our great country of USA will ultimately come to bite you Canadians in the Arzzzz! You despicable, ungrateful, Ice Cold, little brats! A-Ron \\nI’m not reading through all of the comments…. BUT…. \\nWHAT DO YOU DO ABOUT THE CHILDREN OF THE IMMIGRANTS \\nI am for amnesty of all illegals without a rap sheet for the reason that it is inhumane to break up families by sending back dad and/or mom. And then we dig a moat/wall/motion detection system whatever and require “front door” entry into the US. David N \\nI realized the whole focus is on USA illegal immigrants. But many have not seen the other side of the coin yet. Due to global crisis for the past three years, do you know how many Illegal Americans, Canadians, Australians and any other Non European nations are living in Europe? You may be more shocked to know more than what you know what is going on in USA right now! I want to be fair with everyone here, what is like to be an illegal in another country? Because millions have already done that to leave USA, CANADA and other countries for the better life elsewhere. When you get to that situation, then you may open your eyes and your mind about this. People are the victom of politcal agendas of law makers in most country. I am talking about innocent people who decided to better themselves to go elsewhere. What is happening here many criminals and corrupted politicians abusing the laws of the land for special interests sadly to say! But my point is you all need to look at the both side of the coin. Don´t be blind sided about this! Cheryl \\nIt’s not that Obama’s wrong, he knows exactly what he’s doing. They know they are deliberately destroying America with all of their activities. Get a grip, he’s the enemy with the rest of them, posing as our leader. People need to wake up criminals are at the helm and have been slowly destroying our country for decades. Cheryl \\nI also wanted to add we have an illegal immigrant as President, someone who is not a natural born citizen who photoshopped his recent birth certificate. Once these criminals get political power they can basically do whatever they want. Politicians are among the worst criminals on the planet. \\nYou’ve got criminals in the U.S. gov’t and do nothing about it. monk \\nThe real “absolute nightmare for the U.S. economy” isn’t illegal immigration but the U.S. economy itself, which is based primarily on borrowing and spending. And not just government but corporations and households have been in engaged in such, leading to over $57 trillion in total debt, four decades of trade deficits. and very high wages. \\nThe only way out of this is to decrease wages considerably, return to factory work, decrease spending considerably (which means the decline of a middle class lifestyle, military power, and much of infrastructure) and work to export goods to reverse the trade deficit and decrease debt. \\nIronically, if these take place, most will not bother to move to the U.S. \\nThe catch is that most citizens, the government, and corporations will not agree to such terns. In which case, it won’t matter because illegal immigration will be the least of citizens’ worries when the economy collapses. Samantha \\nHave you lost your mind? To say that American economic problems is not made by Illegal immigrants but by the US economy itself. That is like a dog chasing its own tail. \\nAnother reason the economy is in such a mess is too many of jobs are being exported out of the country. Companies do this to save money because labor is cheap in sweat shops. \\nThere is not just one reason the US economy is such a mess but that does not mean illegal immigrants are not one of the reasons things are so bad in this country. \\nSo you want decrease wages. fine I would like to suggest we start with decreasing your wages and that should be enough. How can we go back to the factories when more and more of them are closing every day. That is the true irony. The main export in the US is the American dream. \\nThe middle class lifestyle is needing to work two or three jobs. More and more adult Americans make money by delivering newspapers. More and more white people are homeless because they cannot find work. Thirty-nine percent of white people are homeless compared with 13% Hispanics that are homeless. \\nThe truth is the tide is starting to turn.illegal immigrants are finding out that the wages are not good enough in America these days so they are starting to leave the country. . You can only stretch the dollar so far before it starts to squeal. \\nWho knows maybe time and allot of hard work maybe the economy will start to heal. Americans who earn decent wages are good for the country. Decreasing salaries is not going to cut the cheese. When you decease wages you also decrease the amount of tax dollars that are paid. Americans who spend their money in America and don’t send their income back to their country of origin. \\nI believe Americans are tough and strong. I know that it does not appear so right now but we have lived through bad times before and have come out the other side stronger. When a bone is broken after it is healed the bone is actually stronger then it was before the break. America has proven this time and time again. Loveitorleaveit \\ninterlace wrote: LOL … I’m Canadian. How does it feel to be someone that has had a American education and still not amount to anything? Figures you would be a radical Canadian who would enjoys trashing their neighboring country USA. Of course any country that never has to spend money and Soldiers lives to fight wars on terror to protect their freedoms because their neighboring country USA does all the work for them. They would be the ungrateful, spoiled, little brats the “Canadians” Jeff198524 \\nMass immiation, both legal and illegal, is a failure. The West tells Japan and other nations with declining populations to open up their borders, but look what a nightmare the Unites States of Mexico and Eurabia are because they opened the floodgates and weren’t choosier about who they let in. \\nImmigrants can make a nation better, but mass unchecked immigration destroys the host society. interlace \\n@Loveitorleaveit :“Figures you would be a radical Canadian who would enjoys trashing their neighboring country USA. Of course any country that never has to spend money and Soldiers lives to fight wars on terror to protect their freedoms because their neighboring country USA does all the work for them. They would be the ungrateful, spoiled, little brats the “Canadians”” You make me laugh “Loveitorleaveit”… \\nNot for a second did you address the education or crime situation in the US. All you can do is name call and talk about what we do. \\nOh and you are wrong again in attempting to state that whatever happens to us will happen to you. Detroit and Windsor are a stones throw distance apart and yet the divergences in culture are stunning. Detroit’s culture hasn’t crossed over to Windsor and it’s been there for a while. \\nIf anything, it isn’t the immigration that has caused the majority of problems here but those problems that are caused by motorcycle gangs which have come here UNWANTED via the US. \\nBTW : Your comment about us being spoiled, ungrateful brats … I believe it is your culture that capitalizes on the McMansions, fear, unequal distribution of resources, unfair education policies, horrible unemployment concealment, bad medical practices, crippling tax applications, devastating divorce rates, etc. \\nYou want me to feel sorry for you that you have been put under the bus by your own system and as a way for you to “get back”, you focus your energy on what you think is the problem instead of what the real problem is? … Ok, here is a few tear drops and a violin melody … LOL! \\nThe problem with people like you is that you are non-observant and that your rhetoric is distasteful and untrue yet you believe it since it fills a void in your emotional insecurity. Imagine you are probably a grown man by age but still a child by emotional age. HA! \\nYour problems go deeper than you think and before you breed ugly offspring … do humanity a favor and just end yourself or … Open your eyes … No one is against, you are against yourself … Lindaxxx \\nwell this country does not belong to Mexicans I’m sick and tired of hearing that we stole this land form the Indians ……this Continent was’nt all Habited in the 1st place .If the Europeon’s did’nt come and build this country into what it is now …we would be a 3rd world country like Mexico and Central and south America ……if we do not stand up to to The Illegal Aliens in our Country ….the Quality of Life will change here and it’s already showing that In California …they are so broke and closing Hospitals and schools like crazy …….we need to look at California more closer before this kind of quality moves into the rest of our Nation…….Coming here Legal is the only right thing to do …No to anchor Babies to Illegals, they are draining our system ..this is not a race issue , this is an Illegal Issue….wake up America you Jeff198524 \\nOH please, 9/11 was America’s fault and the war on terror has resulted in untold millions of innocent deaths. Why would anyone be thankful to a nation of savages (America). Madeleine \\nOK, for over five years my family was embattled with two school districts, the Township, the state of New York and approximately 12 of their attorneys. We had to hire attorneys to defend our rights when someone from the school district that my children attended since kindergarten decided that my home was NOT within their district. Really? Funny this home was in the district of the previous homeowner whom I purchased this home from and for over two decades had been treated as being inside the district that my children attended. Suddenly one day out of the blue we are being sued for over one million dollars. For fraud, conversion, stealing a public education on the public and quasi contract. I swear to the good Lord. My husband and I spent over 100,000.00 fighting this on a New York City fire fighters salary. We had to empty the contents of our home and rent a home around the corner, considered in the district, if my poor daughters both in their junior and senior year of high school were to finish up where they started since kindergarten. The district dragged my family through the system, the districts spent tax payers dollars fighting us to the tune of millions and they were 100% wrong! It took five years, my childrens lives being ruined beyond belief (honors students, Captains of the girls varsity soccer team, outgoing and vibrant, bringing nothing but honor and pride to their district) My husband, a first responder on 9/11, walking away with his life, spending months at the site of ground zero digging for his buddies and civilians, was no longer trying to overcome the sufferings of September 2001, but no sooner was suffering the Septembers where his children were being ripped from their life long schools, abused beyond belief by the educators who stress the importance of educational continuity. My children were forced to attend the neighboring district, which we have no neighbors, which they had to walk each day five blocks away to catch the bus. When the bus for their life long school is at the end of our driveway. While the districts raked us (a private homeowner through the coals) being totally wrong, illegal are living here scott free. They are breaking the laws, they are causing havoc while receiving a free public education while my children were punished, treated like criminals, their educational achievements erased, my one daughter ended up spending her final year of high school in the neighboring district. All she had worked for her whole educational career between sports and academics went unrecognized by the district she was forced to graduate in. In the end, after five years of being embattled, after getting rid of our lousy, stupid attorneys that we spent truck loads of money on, as I said, on a firefighters salary, we found the laws that these administrators and educators and politicians were hiding from us. With no attorney to help us, just the laws of New York State as our weapon, we finally won our case. Our dear children were finally returned to their rightful place in the schools of their entire tenure. The damage they have done to their minds and their hearts, and to me and my husband cannot be forgiven. Will never be forgotten. This is a story that can happen to any of you, don’t think it can’t. We were not special and neither are any of you. Had I been illegal and my children illegal this would not have taken place. The law states that the children of illegal parents are not to be injured by the actions of their parents. Yet in one affidavit after the next, these scum bags lawyers for the districts, with the support of the board of ed, each said that if any injury came to the children of said parents(meaning me and my husband) it was our fault for stealing a public education. They were so wrong and yet they got away with what they did to us for over five long years. Imagine being my husband? Surviving the terrorist attack on our soil, running in when everyone else was running out and then he is attacked by our district, shamed in front of our community, his children and me his wife destroyed, mentally and emotionally every single day. These people are huge hypocrites, these law makers are scandalous theives and thugs. I cried every single day weeping for my poor kids, how they suffered. My husband worked so much overtime (when there was any) that he was numb. This poor man came home each day and he persevered when a weaker man would have collapsed. I love him so much! He is my hero! He did get caught in a terrible fire that almost cost him his life, saving another firefighter, his crew. He was badly burned and spent a week in the Cornell Burn unit. We were living in the rental house when that call came in, my children overheard the call, they were sick with grief. This story has so much more to be told but I just am tired of the way laws are broken. The way good and decent Americans, like my husband and I, are abused by the system. We are very good Americans and we don’t live above our means and we are humble people. Illegals can come here and ask for amnesty after breaking our laws? Really? Why did I have to prove our innocence and pay for expensive attorneys who actually were a waste? Why was the governement allowed to rake my husband and I and our children through the fire and be completely wrong doing so and get away with doing so. The only victory we got was to return our children back to their beloved schools where they always belonged along with the 120 other homes who live on the same block. Did we get a financial compensation? NO! Were we made whole again financially? NO! So in my opinion, NO to illegal immigration. They are here breaking our laws and yet no one will do to them what was done to us. It’s wrong and it cannot be justified. I don’t care! Wrong is wrong and liberals like Obama and others are trying to force Americans to break the law, yet hold people like myself and my husband and family to a totally different accountability even while being 100% innocent. Sickening! TheAmericanDream \\nIt Amazes me that Canadians use American products, watch American tv, adopt American slang and wear American made clothing, yet complain CONSTANTLY about “stupid Yanks”, “arrogant Americans”, “dumb Americans” and the like. There are thousands of Canadian people who have never visited the United States or even met an American before, but have based their entire knowledge of the USA on a tv show or the fact that there’s a McDonald’s in their town. It’s disheartening and shows how “small minds” are on both sides of the border. Brittanicus \\nWE THE PEOPLE. \\nAMNESTY or as the Pro-illegal immigration groups prefer to label it–Immigration Reform. The truth is not ever going to happen? The 1986 IRCA was a utter calamity and costly for taxpayers. The 1986 (IRCA) Immigration Control and Reform Act that was a mass amnesty, which became the prime deception, played on the American taxpayer of all time. Because of despicably fraud and supreme neglect, the 2 million farmer’s laborers and other illegal workers who were provided a legal course to citizenship, that ultimately turned into 6 million. Even inexplicable those people, who received this pardon, vanished from their usual places of employment and turned up in the job force around the country that Americans citizens had to compete with. Future wise, Congress proposed the I-9 Form (Employment Eligibility Verification Form.) to ensure that all employees presented documentary proof of their legal eligibility, to accept employment in the United States. If the employee has a hiring issue, and chooses to contest an irregularity notice, the employer prints out the “Referral Letter” from the E-Verify program. \\nThe letter contains information about resolving the problem, as well as the contact information for the (SSA) Social security Administration) or (USCIS) US Citizenship and Immigration Service, depending on which bureau was the source of the non-authorization to resolve the problem? As constantly the open border zealots, US Chamber of Commerce, ACLU and a radical mix of anti American organizations, have used the Liberal Press as a fulcrum to regrettably try to suppress the implementation of E-Verify. Are we not in the poorhouse with China, as it is? But this is no firm binder, because millions more people will strive to reach here, before that ominous Using the media these groups have also brought pressure on the administration not to espouse the Secure Communities law, which identifies criminal aliens through fingerprints by informing ICE. Then Subsequently E-Verify that is increasingly more popular each day by business owners. They are now cautiously aware that an I-9 audit puts their business license in jeopardy, as upheld by the Supreme Court. \\nNOW THE RUSH HAS BEGAN TO DEFEND CITIZENS AND LEGAL RESIDENTS AGAINST THE ILLEGAL ALIEN INVASION. FIRST ARIZONA, NOW ALABAMA, GEORGIA AND SOON MANY MORE STATES WILL FOLLOW. E-VERIFY IS THE LAW OF THE LAND AND THOUSANDS OF FOREIGNERS NOT WANTING BE CONFRONTED THESE LAWS, WILL HEAD FOR THOSE STATES THAT HAVE BEEN KIDNAPPED BY THE LEFTIST PROGRESSIVES OF OPEN BORDERS AGENDA’S. \\nAs with the 1986 (IRCA) bill those who advocate against the laws are profiteers for more wealth, or to accumulate more votes or just to prepare America (according to the WikiLeaks group founder Julian Assange in secret documents) for merging with some kind of traitorous program, with Canada and Mexico with one currency. This stealth agenda was collusion between the Canadian and American Ambassadors. \\nThe other side of the aisle on the corrupt Washington beltway, says we cannot afford to enforce immigration laws? Then my question we had better figure someway, for as the law stands we are just encouraging more illegal newcomers? So the second question, when does this invasion end, when does the lawmakers install laws, that make it impossible to stop this travesty? Are we just going to leave the doors open and hope for the best? All we are encouraging is even more poverty and distressed people, that taxpayers have to bear the full fiscal impact? Ten years from now, population numbers will be skyrocketing and the only winners are the profit-takers. \\nWhether we are coming out this miserable recession or not, we cannot afford any immigration amnesty. The first Amnesty in 1986 Ronald Reagan’s term of office, cost–$76 BILLION DOLLARS–by the time it was fulfilled. In today money it’s expected to cost $2.6 TRILLION DOLLARS as stated the Heritage Foundation. So taxpayers would be expected to cover that bill, lending most of it from China again? Are we not in the poorhouse with China, as it is? But this is no firm binder, because millions more people will strive to reach here, before that ominous inauguration day of a new Immigration Reform bill. If Congress is unable to cut spending in this recent of 14 .5 Trillion dollars US Treasury deficit, can anybody in the right frame of mind, tell us where we intend to get another $2.5 trillion dollars, to subsidize those illegal immigrants already living here? These dollars are inconceivable and even if there was another. It’s outrageous that Washington politicians would expect to bleed even more money from traumatic Taxpayers, when we are confronted by rejuvenating two nations abroad, in millions of dollars a day. \\nAmnesty, it will only further multitudes of people to come here? Washington legislators come and go, author bills, but are never held accountable for the financial wrecks they leave behind? Only Secure Communities, E-Verify can mitigate some of the pressure that will make foreign nationals think twice before crossing the border, or entering America by other means. This isn’t about any particular race, a person’s politics, religion as we are all suffering. It’s not even about the legal Hispanic population, as they are under the same pain of finding a job, stagnant wages and some type of exploitation. We are all the same boat and without stringent restrictions on immigration and its costs, that boat is heading towards rough waters and could easily sink. The TEA PARTY will slow down this process by confronting Washington aggressively on birthright citizenship to rescind it, which will sever the bond of 300.000 babies from foreign nation getting instant citizenship; cutting down on the annual monolithic cost to subsidize these offspring and families. \\nIt will also bring to a halt, which it attributed to this wrongly conferred law, saving taxpayers hundreds of billions of dollars a year? The TEA PARTY will examine these unfair taxes placed on Americans, by Liberal oriented courts, to appoint obligations to educate, provide health care that comes with the never ending tide of illegal aliens skirting our laws. The TEA PARTY will created bills to up the penalty, for entering America as a felony. This should have been the law of the land, decades ago? Personally, it has always translated to prove there was no serious intention to enforce these laws. It’s in the vein of a conspirator’s reason, why the Southern border fences completion remains a fiasco. The Tea Party will enforce the 1986 (IRCA) law as was planned, with no complicity of government agencies to stifle those laws, such as the business influence. \\nThe TEA PARTY in 2012 will remove the Liberal influence and even have the empowerment to construct the real border fence, and mandating with no exemptions E-Verify and Secure Communities and indefinitely remove Sanctuary Cities nationwide. As the Tea Party grows against the powerful influences in Washington, these Representatives like TEA PARTY Rep. Michele Bachmann of Minnesota will retire those pro-illegal immigrant politicians, Governors, mayors and all those who have adversely affected strong laws that have been introduced. The American People should not be forced by law, to pay for the impoverished people that trespass into America from other countries. \\nWe can aid our fellow legal workers out, by taking immigration one step towards generic “Citizens Arrest. We cannot apprehend a suspicious individual, as it could lead to legal action. But we have the opportunity to join other “Whistle blowers” to inform ICE or local police as irregularities stand out. Not speaking reasonable English is a dead give-away, specifically in factory environment and if somebody has an accident through not comprehending a warning notice. \\nThe time is ripe to contact their federal and State Representatives to insist they enact mandatory E-Verify, Secure Communities for every State Wake Up! America \\nWake Up America! We got played out Respect all nationalities but show them the right way if nationalties that dont want to participate the right way send them back This has been a war of its own of potraying our country as the wild west No one is to blame accept our Government allowing our system to collapse without proper structure in policies theres only one road with citizens trying disparely in trying to do the right thing straight collspsr down we are carrying a nation that is NOT promoting HONOR Scams wall street scam private oversea companys Haliburton bad loans AIG should illegals think differantly we showed them there is no ethics or morales from our bad government not stanfing up for the average smerican but covering a sick pyramid of using decieving our own people They will use everyone including our soldiers name in vein They wi ll use illegals for there future credit its as new wave of deThey allready sucked the blood of our tax paying americans and will not stop we are dealing with a sick demonic government that favors the rich breaks the back of the so called middle class pay check to pay check promotes kay os suppression and depression the illegals our smart give an inch take a yard. Everyone deserves to become an American but for god sakes have them pay taxes we cant afford to continue this pattern we are dinking our own boat because we as americans let PIRATES during the George Bush and Republican party yo mske a mockery of our very root of american values complete corruption bailing out AIG out all the elderly americans that they robbed punish the banks that gave bad loans punish a previous government that used there position in making profits in washing out our taxes to private sectors in Iraq who overseas these contracts Dick Sick Cheney our dollars at work ex ceo hsliburton / vicepresident of the United States of America LY AN AMERICAN Wake Up! America \\nIf Americans want justice connect the dots we had a sick governmeny in office that all had a shady past how can we proud when we had a cabinet that tried to destroy our country and values Why would George Bush have so many affiliations in our tragedy because he comes from a root of tragedy the flag he wares is dollar signs of the cost of solid elderly Americans soldiers people who believed and made America now Americans can see how bad people in powerful rule making decisions can use there country and manipulate and hurt our American values and standards he set us up for failure who is going to account for all the money that went to the culprits that should have been for our schools healthcare elderly qaulity of life american values our patrotic troops who came to our front with no choice but in faith. Our government in yhe Bush era should be accountable God Bless you Dick sick Cheneyand George Secret Cloon George Bush using our country name in vien for your agendas an maybe your friends you make for your personal agendas will not have faith in your back door deals and maybe the United States has no faith in you. Because it seems faith is chaklenging corruption and it sure hell seem to be on your crew watch our im sorry watching for personal agendas maybe to many dots that connected I connected mine and that faith is spirit maybe that is what Red Whit and Blue should stand for , for the people not world dominatuon yes we are th 99 percent but the 99 percent who knows what life is all about the rich may have power money control but I know what they dont have is a soul . \\ne back tond you Geoge Cloon Bush your mama \\nobama is doing nothin worng yall just acting like'"}, "time": 1742628484.0244591}