{"duration": 0.03298687934875488, "input_args": {"text": "'Joe Biden unaware he’s first in line for Hillary’s old job, so no one spoil the surprise Posted at 12:33 am on October 28, 2016 by Brett T. Share on Facebook Share on Twitter \\nEven though a quick scan of social media suggests the country is so over old white men, Joe Biden, the fifth hottest vice president ever , holds a special place in the hearts of all Americans. Good news, then, for everyone who was sad to see him go: Politico reported Thursday night that Hillary Clinton was considering asking Biden to take over her old gig at the State Department. \"They are spending a lot of time figuring out the best way to try to persuade him to do it if she wins\" https://t.co/387Su8UptM \\n— POLITICO (@politico) October 28, 2016 \\nPolitico, citing an unnamed source within Camp Clinton, noted that “neither Clinton, nor her aides have yet told Biden,” so it would be appreciated if everyone could keep this under wraps until she determines the best way to approach him with the offer. BREAKING: Clinton wants Joe Biden as secretary of state: report https://t.co/FGgS5anww6 pic.twitter.com/xfZsoT5hbq \\n— Washington Examiner (@dcexaminer) October 28, 2016 \\nIt seems the reality of a Secretary of State Biden is a ways off at best, but the report provides a nice distraction from all the noise surrounding Clinton in the wake of those daily WikiLeaks dumps. Who couldn’t use a nice distraction, Hillary most of all? @politico bs. won\\'t happen. \\n— Yaqub Osman (@yaqub_osman) October 28, 2016 @politico That sounds like BS. Why would you go from VP to SOS? I think somebody\\'s running their mouth for nothing. \\n— Ari Keys (@arionkeys) October 28, 2016 @dcexaminer Total nonsense. The story is nothing more than a scheme to get voters to believe the election is already over. \\n— Don Fredrick (@Colony14) October 28, 2016 Biden won\\'t be Secretary of State. But throwing his name around will amp up enthusiasm among Hillary supporters to make sure they vote. \\n— Comfortably Smug (@ComfortablySmug) October 28, 2016 @politico how much of this article did @johnpodesta and team write? #wikileaks pic.twitter.com/Qv6X1NB6GX \\n— The Haberdasher (@thatjer) October 28, 2016 @politico sounds like a \"leak\" to distract \\n— Kyler Hess (@KylerKHess) October 28, 2016 \\nBut the anonymous source said they were totally considering thinking about asking Biden to consider thinking about it. @politico He would bring the whip out! pic.twitter.com/Vs9Gt0BeFr \\n— Sasi Patkunan (@SPatkunan) October 28, 2016 @dcexaminer @JoeBiden will take Putin behind the gym and rough him up till he gives back our uranium that @HillaryClinton helped Putin get \\n— Dustin Bissette (@bissghetti) October 28, 2016 \\nBeware, enemies of freedom worldwide: if Hillary’s elected, Secretary of State Biden’s gonna put y’all back in chains! @politico Uncle Joe will protect us all pic.twitter.com/qDHTfwba65 \\n— KGB AGENT♢DEPLORABLE (@aj_slown) October 28, 2016 @dcexaminer Can’t we get rid of this guy?'"}, "time": 1742562250.4262457}