{"duration": 0.08315515518188477, "input_args": {"text": "'Russia Russian President Vladimir Putin delivers a speech during an international conference dedicated to the 175th anniversary of Sberbank in Moscow on November 10, 2016. (Photos by AFP) \\nRussian President Vladimir Putin has stressed that his country’s military is not a threat and would not be attacking anybody. \\n“Our Armed Forces are not threatening anybody…I would like to stress once again, to make sure everyone hears – not only people in this hall,” said Putin while giving a speech in Russia’s Yaroslavl on Saturday. \\nReferring to claims that Russia might attack other countries, especially its neighbors in the Baltics, Putin asked, “Why would we do this?” \\n“We have the biggest territory in the world, like I said, everyone knows it, and we need to provide effectively security for our own country, for our own people,” he added. \\nHe noted that Russia’s armed forces are perfectly capable of providing security, and that developing the forces will continue. He also hailed efforts made so far to make the military “efficient… modern and highly effective.” \\n“The number of military drills has increased multiple times, including snap checks, which for some reasons from time to time worry our counterparts, let’s call them as such for now,\" he added. \\nHe added that other countries\\' drills do not worry Russia. The Russian army must be “compact, but highly effective. Thus we shall continue the structural reform, and we shall keep optimizing the personnel, but without any mass cuts.\" Russian female cadets take part in the military parade at Red Square in Moscow on November 7, 2016. \\nPutin’s remarks come at a time that NATO aims to send “battle groups” to the Baltic states and Poland early next year. The groups will consist of 40,000 forces. It will be the biggest military buildup near Russia since the Second World War. More forces would also be deployed if necessary. \\nNATO suspended all ties with Moscow in April 2014, after the then-Ukrainian Crimea Peninsula voted in a referendum to join Russian territory. Loading ... '"}, "time": 1742563957.368729}