{"duration": 0.07896232604980469, "input_args": {"text": "'Project Veritas Releases Fourth Video Exposing Illegal Contributions and High Level Political Corruption Home / #Solutions / A Humanitarian Crisis is Unfolding at #NoDaplProtest and The Media is Silent — Here’s How You Can Help A Humanitarian Crisis is Unfolding at #NoDaplProtest and The Media is Silent — Here’s How You Can Help Claire Bernish October 28, 2016 1 Comment \\nNorth Dakota — A humanitarian crisis is unfolding inside the United States as thousands of Native Americans, indigenous people from around the world, and advocates from every walk of life camp in North Dakota in support of Standing Rock Sioux Tribe water protectors opposing construction of the Dakota Access Pipeline. \\nSlated to run under the Missouri River, the pipeline poses a direct threat to the drinking water supply of the Standing Rock Reservation and at least 18 million people downstream, particularly given Energy Transfer Partners (ETP) — the company in charge of construction — has a horrendous safety record marked by thousands of leaks and spills in the last six years, alone. \\nDespite remaining peaceful on the whole, the protectors of the water have been met with needless escalation and indiscriminate violence by taxpayer-funded, heavily militarized law enforcement protectors of Big Oil and Wall Street — whose vested interests in exporting North Dakota’s sweet, light crude apparently trump human rights and basic decency. \\nOn Thursday, tensions exploded when law enforcement — armed with lethal and nonlethal weaponry and backed by tanks and MRAPS — implemented a no-fly zone and descended on water protectors attempting to block access by construction crews, including some in the midst of prayer. \\nEmploying LRAD sound cannon technology, ‘nonlethal’ beanbag projectiles, Tasers, pepper spray, and mace against the unarmed crowd, law enforcement forcefully cleared the blockade — affecting more than 140 arrests and injuring dozens in the process. \\n“The protesters are not being peaceful or prayerful,” Cass County Sheriff Paul Laney said in a press statement cited by ABC News . “Law enforcement has been very methodical in moving ahead slowly as to not escalate the situation. However, the protesters are using very dangerous means to slow us down. Their aggressive tactics include using horses, fire and trying to flank us with horses and people.” \\nWitnesses on the scene, backed by patchy live stream and recorded video , paint a sharply contrasting picture of the incident. An elder in ceremonial clothing was arrested while praying during #NoDAPL protests (pics: @UR_Ninja @_Native_Life ) https://t.co/10gbqmvS0e pic.twitter.com/hmepGg35NV \\n— RT America (@RT_America) October 27, 2016 \\n“Militarized law enforcement agencies moved in on water protectors with tanks and riot gear today,” said Standing Rock Sioux Tribal Chairman Dave Archambault II in a statement . “We continue to pray for peace. We call on the state of North Dakota to oversee the actions of local law enforcement to, first and foremost, ensure everyone’s safety. The Department of Justice must send overseers immediately to ensure the protection of First Amendment rights and the safety of thousands here at Standing Rock. DOJ can no longer ignore our requests. If harm comes to any who come here to stand in solidarity with us, it is on their watch. They must step in and hold the state of North Dakota and Morton County accountable for their acts of violence against innocent, prayerful people.” VIdeo of police shooting into crowd of water protectors cc: @UNPeacekeeping #NoDAPL https://t.co/7ggsEZ6bUY pic.twitter.com/O5mRsptxZq \\n— Occupy Wall Street (@OccupyWallStNYC) October 27, 2016 \\nIndeed, for weeks, many witnesses have recounted the same violent tactics against those engaged in prayer, as Danny Grassrope told ABC News on Saturday, “This weekend we went to go demonstrate with peaceful action. We went to go pray. Then while we were praying, the cops came and told us we couldn’t be there. We were just standing there and then this police officer came and opened up with some pepper spray. We weren’t antagonizing them or anything, we were just praying.” \\nSo absurdly overzealous was the police response to the unarmed crowd on Thursday, even proponents of the pipeline took to social media to voice deep concerns about the needless escalation. \\nSuch incidents are only likely to continue, as water protectors have vowed to peacefully resist until ETP completely abandons plans to construct the Dakota Access Pipeline — which, incidentally, won’t even benefit Americans in any way as the crude it transports will be shipped overseas to line the pockets of investors in the project. \\nThat resistance and protection of the water supply of millions could come at a steep price in the very near future — an unusually bitter winter looms on the horizon. \\nNorth Dakota winters are notorious for biting winds, heavy snowfall, and generally brutal conditions — but the forecast for this winter predicts lower than average temperatures. By the end of November, daytime highs will hover around the low 30s Fahrenheit, and will continue to slip downward through the month of December into the 20s and even teens. \\nJanuary highs for the Bismarck area average just 24 degrees in a given year — but January 2017, according to the National Oceanic and Atmospheric Association, will be much colder, with many days not even close to breaking 20 degrees, and lows in the negative digits. And that bleak picture doesn’t account for wind chill — roughly, the temperature and wind speed combination which affects the rate of the body’s heat loss when exposed to the elements — and North Dakota’s winter winds are higher than the national average. \\nBecause the Standing Rock Sioux Tribe and their supporters view protection of water — which they consider a living entity — as an unequivocal duty, encampments in various locations include particularly vulnerable populations, including elders, women, and children. \\nIn no uncertain terms, this is a dangerous set of circumstances. \\nThese encampments have been preparing to deal with frigid conditions, but are in desperate need of support from those empathetic to their cause. After all, this is not a protest by any stretch of the imagination, despite mainstream media’s narrative. This movement, this resistance — unprecedented in size and scope in over a century — concerns every person reliant on not only the Missouri River, but every water source in the country. \\nSo, if you have wanted to support the Standing Rock Sioux Tribe in protecting the water but are unable to travel to the camps in person, there are still a number of ways you can help — and it is sorely needed. Remember, Native American reservation populations are among the most impoverished in the nation, thanks to centuries of exploitation and unkept government promises — simply going to a big box store and purchasing necessary supplies isn’t an option. \\nBut many of us can spare a little to help support those on the front lines who are protecting all of us from poisoned water. \\nPerhaps the easiest way to donate is through the Standing Rock Sioux Tribe’s PayPal fund, which will be allotted for “legal, sanitary, and emergency purposes,” and can be found here , or through the Tribe’s GoFundMe page, here . \\nIf you would prefer to write a check, make it payable to “Standing Rock Sioux Tribe” and send it to: Standing Rock Sioux Tribe'"}, "time": 1742628419.3889382}