{"duration": 0.11611628532409668, "input_args": {"text": "'125, 000 illegal immigrants have won new or updated work permits and residency permits since January 2017, according to data published by the U. S. Citizenship and Immigration Services (USCIS). [Officials at the agency accepted new requests from 17, 275 illegals from January 1 to March 31 and approved   extensions for 107, 524 of the illegals who earlier got work permits, Social Security cards and federal financial aid via the “Deferred Action for Childhood Arrivals”   created by former President Barack Obama in the   to the 2012 election.  President Donald Trump was inaugurated January 2o, ensuring most of the new and renewed DACA work permits were approved during his presidency, despite his campaign promises to halt the DACA program which now includes roughly 765, 000 younger illegal immigrants. Trump’s supporters should use their political clout to make Trump do the right thing, said Mark Krikorian, director of the Center for Immigration Studies. “Now we have data, and there’s no question that he’s issuing thousands of work permits to new illegal aliens   …     so probably the correct approach [for Trump supporters] is a determined insistence on [Trump] doing the right thing,” he said.  “The administration is doing a lot of good stuff” on immigration, Krikorian added, noting that Trump is under constant pressure from liberals who won’t give him any credit even when he does something they prefer.  The DACA population is large, given that 4 million young Americans enter the job market each year to face job competition from up to 1 million new immigrants, from 1 million temporary contract workers and from the resident population of 8 million working illegal immigrants. Immigration reformers denounced  the news: HOW TRUMP LOSES THE NEXT ELECTION. Nearly 100, 000 ‘Dreamers’ Granted Amnesty In Trump’s Opening Monthshttps:  .   —   Ann Coulter (@AnnCoulter) June 8, 2017,  WHAT?! The real scandal? Trump has granted amnesty to 125k illegals under Obama’s unconstitutional order https:  .   —   Conservative Review (@CR) June 9, 2017,  “Issuing new work permits to illegals who don’t have them already makes no sense at all, either from a P. R. perspective or politically,” wrote Krikorian wrote: Renewals, at least for a time, I can understand  —   the [media] orgy of sob stories that would result from ending the work permits of some   of a million people would be a wonder to behold   …     Though I was initially skeptical, it might even make sense to try to trade a real, lawful amnesty for the DACAs in exchange for important immigration changes only Congress can pass  —   specifically, universal   and cuts in legal immigration. In that case, announcing that renewals would continue until, say, the end of the year could be a powerful motivator for congressional Democrats. My speculation is that the White House has no idea what to do about DACA and so is just letting it continue on autopilot  —   amnestying 192 new illegals a day. John Kelly, the secretary of the Department of Homeland Security, said June 7 that officials are not seeking to repatriate DACA illegals. “We are not, not, not, targeting DACA registrants right now,” he said. Critics say the DACA program may be vulnerable to a lawsuit by immigration reformers. “We will immediately terminate President Obama’s two illegal executive amnesties in which he defied federal law and the Constitution to give amnesty to approximately five million illegal immigrants, five million,” Trump said August 31, 2016, referring to the DACA and the   ‘DAPA’ amnesty, which was struck down by a federal court in Texas. You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742563779.2846022}