{"duration": 0.04866504669189453, "input_args": {"text": "'Intrepid Report will resume publishing on Monday, November 29 This year’s elections have left yours truly drained. By Bev Conover   Bev Conover \\nYes, Donald Trump, a sexual predator, a misogynist, a racist, a liar, a cheat, a con man extraordinaire, and a narcissist, who has never held public office and may not even be as rich as he claims, will, barring anything unforeseen, become president of the United States on January 20, 2017. \\nHillary Clinton may have won the popular vote but the Trump supporters gave him the necessary 270 Electoral College votes needed for victory. It was half a bloodless revolution. The other half would have been cleaning out Congress, too. \\nWhile Hillary called half of Trump’s supporters “the deplorables,” and some undoubtedly are, all of them have had it with a government that only serves and enriches the plutocrats, and cares nothing about the rest of the people’s welfare and needs. Thus, they saw an opening to revolt and did—call it striking out blindly because they didn’t finish the job and Paul Ryan, if he hangs on to the House speakership, and Senate Majority Leader Mitch McConnell are licking their chops over the prospect of all the damage they intend to cause, i.e., if Trump goes along with them. \\nIt remains to be seen how happy Trump’s supporters will be in a year or so if they lose their health insurance, if Medicare is cut, Social Security is privatized, there is no increase (maybe even a cut) in the federal minimum wage, the Dodd-Frank Act is overturned to let the banks go hog-wild, the wars aren’t ended and the military is further bloated, and millions of undocumented aliens are deported. And those are just the openers on Trump’s list of what he wants to do. Forget about the environment and drill, baby, drill. Global warming? He says it’s a hoax. \\nAll is not doom and gloom if he follows through (at the risk of winding up like John F. Kennedy) on ending globalization, repealing NAFTA, leaving the World Trade Organization (WTO), refusing to sign on to the TPP, TTIP, TISA and any other trade deals that sap the signatories’ of their nations’ sovereignty for the benefit of the corporations. \\nNow is the time for all of us who realize this broken system must be replaced to put aside our petty differences and reach out to each other and organize. We all want the same things: fairness, justice, peace and a sustainable planet. We the people have the power if only we would recognize it; the plutocrats do and that’s what scares them. \\nAnd now is the time for me to spend time with family visitors who have been very patient with me this week while I have been glued to this computer. Plus, it would be an understatement to say I need some R & R. \\nAs usual, I will be checking email daily, so writers may submit articles that aren’t time sensitive. \\nBev Conover is the editor and publisher of Intrepid Report . Email her at .'"}, "time": 1742564046.1003253}