{"duration": 0.10733747482299805, "input_args": {"text": "'Home / #Solutions / Two Days of Pot Raids Turns into Dog Killing Spree — Innocent Woman Shot at, Toddler Terrorized Two Days of Pot Raids Turns into Dog Killing Spree — Innocent Woman Shot at, Toddler Terrorized Matt Agorist August 4, 2016 28 Comments \\nBuffalo, NY — In their relentless and often violent pursuit to control what citizens can and cannot put in their bodies, the state leaves behind a trail of blood and suffering. As the Buffalo Police Department illustrated last week, this trail often contains the blood of defenseless animals. \\nPolice incompetence coupled with deadly training came to a head last week and wreaked havoc on the residents of Buffalo. The Narcotics Division of the Buffalo Police Department executed a series of drug raids last week leading to a handful of arrests and the seizure of small quantities of drugs — mostly cannabis. \\nAfter the department released their heroic numbers to the press on how much dangerous cannabis was taken off the streets, they remained conveniently silent about the dogs they slaughtered along the way. \\nOn Friday morning, Buffalo cops, in their search for a 170 lb 5’11” black male, raided the home of Michael Urban — a 5’11” 210 lb white male. \\nWhile police were ramming the innocent man’s face into his kitchen floor, Urban pleaded with them not to kill his dog. But it was to no avail. \\nPolice took aim at the helpless dog who, according to Urban was simply standing there in a non-threatening manner. ‘Boom,’ one officer fired, but the bullet only injured Urban’s 18-month-old pit bull named Gotham, sending him running away frightened and crying. \\nAs the dog is wailing in agony, another officer fires a round directly into the dog’s skull, exploding the innocent animal’s head. But, it gets worse. \\nUrban lives on the second floor of an apartment. When the second officer shot, that bullet went through the floor and almost killed the tenant downstairs. \\n“What just happened?” Urban recalls. “As the bullet hole went through the floor through the ceiling, as the dog’s blood is dripping through the downstairs apartment… who’s accountable?” \\nAs Gotham’s blood drips from the bullet hole in Urban’s floor and out of the hole of Jami Krafchak’s ceiling in the apartment below, cops decided to go after her too. \\nAfter they nearly killed her, cops raided Krafchak’s home. She was manhandled, searched with no warrant, and humiliated as she stood there in her nightgown. \\nNeither Urban nor Krafchak were charged with a crime. \\nThe night before the heroic cops of the Buffalo Narcotics Division killed an innocent man’s beloved pet, they raided the home of Cory and Cindy Meer. \\nAccording to Meer’s lawyer, Matthew Albert , Meer and his two-year-old son watched helplessly as jackboots murdered their beloved family dog, Damian, a six-year-old Pit Bull. \\nMeer tells Artvoice that his dog was not a threat to officers. “He is the most family friendly dog I’ve ever had… he’s never hurt anyone,” said Meer. “He would have licked the cops.” \\nJust like Urban, Meer lied face down as he begged the cops not to shoot Damian. Again, this was to no avail. \\nAs Meer’s 2-year-old watched in horror, a cop blasted the family dog to death. \\n“My son lost his best friend right in front of him,” Meer said. \\nAlso like Urban, Meer was not arrested. However, a friend at his house allegedly had a small amount of marijuana on him, so the raid was justified, according to police. \\nAccording to Meer’s attorney, he has 12 active cases of dogs being killed by the same squad. \\n“They are going to say they are going after dangerous drug dealers,” Albert said. “Out of the cases I have, they’ve hit the wrong houses numerous times , found nothing numerous times, and I think at best, they’ve found a few pills at one of these houses… charges I got dismissed because they were filed wrong.” \\nIn 2014, the Free Thought Project reported on a Freedom of Information Act request for use of force incidents within the Buffalo police department. The information was shocking. \\nAccording to use of force reports, Buffalo Police shot 92 dogs from Jan. 1, 2011 through Sept. 2014. Seventy-three of those dogs died. Nineteen survived. \\nTo provide a comparison, Buffalo’s numbers more than triple the amount of dog shooting incidents involving police in Cincinnati, a municipality of similar size. \\n“The numbers are what the numbers are,” Buffalo Police Chief of Detectives Dennis Richards said in an interview with WGRZ in 2014. “Certainly, no officer takes any satisfaction in having to dispatch a dog.” \\nApparently, however, they do. It is not like Buffalo residents have more dogs than other parts of the country. This department seemingly takes satisfaction in killing people’s dogs. \\nWhen asked if the Buffalo police have undergone any special training in regards to dealing with dogs, or the handling of dogs in a non-lethal manner, Chief Richards said, “It has not come to that point in Buffalo that we’ve implemented any of those other techniques.” \\nApparently killing a dog every other week, or two in a 12-hour period, is just dandy and they see no problem with it or reason to seek out training to deal with such a high rate of puppycide. \\nSomething has to be done, however, and it is far more than just training. The most effective action that would need to be taken would be to drastically reduce the instance of no-knock search warrants. According to an ACLU report, 62 percent of SWAT raids are searches for drugs. \\nIf we want to end puppycide, we have to end the drug war , the two are not mutually exclusive. Matt Agorist is an honorably discharged veteran of the USMC and former intelligence operator directly tasked by the NSA. This prior experience gives him unique insight into the world of government corruption and the American police state. Agorist has been an independent journalist for over a decade and has been featured on mainstream networks around the world. Follow @MattAgorist Share Google + CousinScootie \\nAdam Arroyo still waiting for justice from a 2013 killing of his dog on a wrong address raid. WTF are the judges in Buffalo doing handing out no-knock search warrants for refer with the track record of Buffalo narcotics? \\n“no-knock search warrants”<< this is the real crime! \\nThe words \"search warrant\" can\\'t even apply in these cases. It\\'s more like an Execution Warrant. \\nThe only acceptable cause to conduct a raid, especially on a civilian residence, is if there is a Hostage Situation. \\nNo Hostage, No Raid! common sense! \\nSo a bunch of Steroid Junkies have to miss out on playing War Games with civilian lives? Well, too bad! We can call that an acceptable loss. Mike \\nI hope and pray that everyone of these thug cops that shot dogs, get shot themselves and left to bleed out in the gutter like the trash they truly are!!!! Gordon Klock \\nThey clearly get some non-admitted, sense of satisfaction, by killing people’s pets in front of them, & we all are coming to know that there is absolutely no reasoning with these sadistic clowns, “the war on drugs” has always been a scam to generate prison labor, & terrorize the populace, whilst maintaining the naive illusion that it is all somehow morally responsible behavior to harm & incarcerate people over such an exaggerated “threat” (more likely to oneself, if at all), & they really seem to enjoy scaring the helpless, as they commit these acts of brutality that would’ve been illegal for them to do three or four decades ago…… katz ro \\ntried to twitter you a link this is all on video. personally I feel felony charges should be lodged against any lea that comes to someones home and shoots their dog for no reason'"}, "time": 1742561939.624433}