{"duration": 0.060245513916015625, "input_args": {"text": "'Former National Guardsman turned Islamic State sympathizer Mohamed Jalloh of Sterling, Virginia pled to guilty in federal court Thursday to a terrorism charge related to a July arrested during an FBI sting operation.\\nJalloh, a 27 year old naturalized citizen from Sierra Leone was arrested on July 3rd as part of an FBI counterterrorism operation in which he had communicated to a federal informant that he was interested in participating in a “Fort Hood ” style attack.\\nJalloh was apprehended by federal agents after purchasing a Stag Arms rifle at a Virginia arms dealer that had been rendered inoperable as part of the operation.\\nAccording to the U.S. Attorney’s office , authorities discovered during their operation that Jalloh was attempting to provide material support to the Islamic State by “assisting in the procurement of weapons” to be used in an attack on U.S. soil.\\nFollowing his arrest, Jalloh admitted to traveling to Africa to join the Islamic State, adding that he had quit the National Guard after listening to online lectures from deceased al-Qaeda leader Anwar al-Aulaqi.\\nVia Justice.Gov \\n…in March 2016, a now-deceased member of ISIL brokered an introduction between Jalloh, 26, of Sterling, Virginia, and an individual in the United States who actually was an FBI confidential human source (CHS). The ISIL member was actively plotting an attack in the United States and believed the attack would be carried out with the assistance of Jalloh and the CHS.\\n…Jalloh stated that he recently had taken a six-month trip to Africa, where he had met with ISIL members in Nigeria and first began communicating online with the ISIL member who later brokered his introduction to the CHS.\\nDuring their meeting, Jalloh also told the CHS that he often thought about conducting an attack and that he knew how to shoot guns. Jalloh praised the gunman who killed five U.S. military members in a terrorist attack in Chattanooga, Tennessee, in July 2015, and stated that he had been thinking about conducting an attack similar to the November 2009 attack at Ft. Hood, Texas.\\nDuring the May 2016 meeting, Jalloh asked the CHS about the timeline for an operation and commented that it was better to plan an operation for the month of Ramadan. Jalloh also asked if the CHS could assist him in providing a donation to ISIL. Ultimately, Jalloh provided a prepaid cash transfer of $500 to a contact of the CHS that Jalloh believed was a member of ISIL, but who was in fact an undercover FBI employee.\\nDuring federal court Thursday Jalloh’s attorney , Joe Flood, stated that the defense plans to “ provide context ” during a February sentencing hearing in an effort to explain the defendant’s actions and what lead to his decisions.\\nJalloh currently faces up to 20 years in federal prison.\\n'"}, "time": 1742561650.456862}