{"duration": 0.0632941722869873, "input_args": {"text": "'  The Biggest Supermoon Since Israel Became A Nation In 1948 Will Happen 6 Days After The Election By   3rd, 2016 \\nOn November 14th, something extraordinary is going to happen. On that date we will witness the closest full moon that we have seen since 1948. Known as a “supermoon”, this full moon will happen just six days after the U.S. presidential election. If you look up into the night sky on November 14th, you will notice that the moon appears to be much bigger and much brighter than usual.   there is some special meaning to the biggest supermoon in almost 70 years? The last time we witnessed a supermoon of this size Israel become a nation, and as you will see below, many believe that the last couple months of 2016 could have historic significance for the Jewish people as well. \\nDo you remember ever seeing the moon so big in the sky that you felt that you could almost reach up and grab it? Well, on the 14th you may feel that way again. According to CNN , supermoons typically “appear to be 14% bigger and 30% brighter than other full moons”. \\nAnd without a doubt, what we are about to witness is an extremely rare event. The last time that a supermoon was this close to our planet was in 1948, and it won’t happen again until 2034 … \\nThe November full moon is not only the closest full moon of 2016, NASA said , but also the closest full moon since 1948 (which is still the last time the Cleveland Indians won the World Series). \\nThis is one you might want to watch out for: The full moon won’t come this close to Earth again until Nov. 25, 2034, NASA says. \\nBut even though this is a highly unusual event, does that mean that it must have some sort of a special meaning? \\nOf course not, and the truth is that I don’t know if this giant supermoon holds any special significance. \\nHowever, before we dismiss this phenomenon completely, let’s remember what the Bible has to say. In the Scriptures, we are told that God intended the moon to serve as a “sign” from the very beginning. The following is what Genesis 1:14 says in the Modern English Version … \\nAnd God said, “Let there be lights in the expanse of the heavens to separate the day from the night, and let them be signs to indicate seasons, and days, and years.” \\nAnd Jesus told us that there would be “signs” in the sun and the moon just prior to His return. The following is what Luke 21:25-26 says in the Modern English Version … \\n25 “ There will be signs in the sun and the moon and the stars ; and on the earth distress of nations, with perplexity, the sea and the waves roaring; 26 men fainting from fear and expectation of what is coming on the inhabited earth. For the powers of heaven will be shaken. \\nSo clearly the Bible tells us that the moon can serve as a sign. \\nBut is that happening in this case? \\nI don’t know, but just like as in 1948, it appears that something very significant may be about to happen concerning the nation of Israel. \\nEarlier this week, the Wall Street Journal published an article entitled “ Obama’s Israel Surprise? ” which warned that Barack Obama “may try to force a diplomatic resolution for Israel and the Palestinians at the United Nations” before the end of his term. \\nThe options that Obama is reportedly considering include “a resolution formally recognizing a Palestinian state”. The following comes from CNS News … \\nThe Wall Street Journal reported on Monday that according to administration sources, “the White House has asked the State Department to develop an options menu for the president’s final weeks.” \\nIt said the possibilities could include supporting – or not vetoing – a U.N. Security Council resolution condemning Israeli settlements; or a resolution formally recognizing a Palestinian state, or setting “parameters” for a final settlement of the long dispute. \\nIf you follow The Most Important News on a regular basis, then you already know that I have been warning about this over and over and over again in recent months. Barack Obama knows that this is his last chance to “leave a legacy” in the Middle East, and at this point the only chance that he has to get something accomplished is at the United Nations. \\nObama’s last day in office is scheduled to be January 20th, and so he is up against a deadline. Prior to the election he was likely extremely hesitant to make a move because he didn’t want to mess up Hillary Clinton’s chances, but after the election there won’t be anything holding him back. \\nPerhaps that is why the Obama administration recently told the Palestinians to wait until after the election for something to get done at the UN… \\nOn the surface, the latest message to the Palestinian Authority from the Obama administration is no different from the past two decades of American policy: the U.S. will veto any resolution attacking Israel or demanding Palestinian independence without them first making peace with the Jewish state. But, as Haaretz reported , there was one significant caveat to the warning. They were told not to push for any such resolution until after the presidential election next month . \\nThe rest of the UN Security Council has been ready to pass a resolution formally establishing a Palestinian state for a long time. The only thing holding it back has been the U.S. veto power. \\nSo right now the fate of the land of Israel is in Barack Obama’s hands, and he only has until January 20th to make his final decision. \\nIf we do see the land of Israel divided at the United Nations, so many of the things   going to start happening in rapid succession. When we divide their land, our land will be divided as well, and so let us hope that nothing happens at the UN Security Council before the end of Obama’s term. \\nWe truly do live in ominous times, and the events of the next several weeks are going to tell us a lot. \\nI have a feeling that this election is not going to end well, and we also need to keep a close eye on the UN Security Council. \\nI have previously described the period of time leading up to January 20th as “the danger zone”, and so much could potentially go wrong during this period of time. \\nAnd we certainly won’t have long to wait to get an indication of where things are heading. Next Tuesday the American people will face their “final exam”, and let us hope that they do not pick Hillary Clinton, because such a choice would have disastrous consequences for all of us. \\n  Amazon.com. November 3rd, 2016 | Tags: A UN Security Council Resolution Establishing A Palestinian State , Barack Obama And A Palestinian State , Israel , Pain , Painful , Palestinians , Supermoon , UN Resolution Dividing The Land Of Israel , UN Resolution Establishing A Palestinian State , UN Resolution On A Palestinian State , UN Resolution Palestinian State , UN Resolution To Divide The Land Of Israel | Category: Christian , Commentary , World'"}, "time": 1742628513.8032243}