{"duration": 0.11012959480285645, "input_args": {"text": "'Given the sheer tonnage of books already devoted to the Nazis and Hitler, you might assume that everything interesting, terrible and bizarre is already known about one of history’s most notorious regimes and its genocidal leader. Then along comes Norman Ohler, a      novelist from Berlin, who rummages through military archives and emerges with this startling fact: The Third Reich was on drugs. All sorts of drugs, actually, and in stupefying quantities, as Mr. Ohler documents in “Blitzed: Drugs in Nazi Germany,” a best seller in Germany and Britain that will be published in the United States by Houghton Mifflin Harcourt in April. He was in New York City last week and sat for an interview before giving a lecture to a salon in a loft in the East Village, near Cooper Union. “This is actually my old neighborhood,” he said, sipping grape juice on a sofa. “I lived around here when I wrote my first novel, a detective story. ” Mr. Ohler fell back on his interest in sleuthing during the five years it took to research and write “Blitzed. ” Through interviews and documents that hadn’t been carefully studied before, he unearthed new details about how soldiers of the Wehrmacht were regularly supplied with methamphetamine of a quality that would give Walter White, of “Breaking Bad,” pangs of envy. Millions of doses, packaged as pills, were gobbled up in battles throughout the war, part of an officially sanctioned    campaign against fatigue. As surely as hangover follows high, this pharmacological stratagem worked for a while  —   it was crucial to the turbocharged 1940 invasion and defeat of France  —   and then did not, most notably when the Nazis were mired in the Soviet Union. But the most vivid portrait of abuse and withdrawal in “Blitzed” is that of Hitler, who for years was regularly injected by his personal physician with powerful opiates, like Eukodal, a brand of oxycodone once praised by William S. Burroughs as “truly awful. ” For a few undoubtedly euphoric months, Hitler was also getting swabs of   cocaine, a sedation and stimulation combo that Mr. Ohler likens to a “classic speedball. ” “There are all these stories of party leaders coming to complain about their   cities,” Mr. Ohler said, “and Hitler just says: ‘We’re going to win. These losses make us stronger.’ And the leaders would say: ‘He knows something we don’t know. He probably has a miracle weapon.’ He didn’t have a miracle weapon. He had a miracle drug, to make everyone think he had a miracle weapon. ” Lanky and angular, Mr. Ohler quietly conveys the mordant humor that occasionally surfaces in his book, which has a chapter titled “High Hitler. ” “Blitzed,” he explained, was born when a Berlin friend who is a D. J. and a fan of   substances asked, “Did you know that the Nazis took loads of drugs?” While growing up in Munich, the friend had heard about wartime meth use from former soldiers. Aside from a documentary on the subject, Mr. Ohler found little information online. So he contacted an academic in the documentary, who provided invaluable leads about how to search military archives, which weren’t indexed for “drug” searches. Initially, the findings were intended as material for a fourth novel, but his publisher told him the story was too weird for fiction. Just tell it straight, he was advised. History can be a treacherous discipline for neophytes, but some professionals have given the exhaustively researched and carefully footnoted “Blitzed” high marks. The renowned Hitler biographer Ian Kershaw called it “a serious piece of scholarship. ” And though elements of this tale have been told, the extent of narcotic consumption by Nazi soldiers and Hitler has surprised even those who have spent decades researching this era. How is that possible? “It’s one of the old problems of specialization,” said Antony Beevor, the author of several highly regarded books about World War II. “No historian knows a lot about drugs. When an outsider comes in with an open mind and different interests, the results can be fantastic and very illuminating. ” Mr. Ohler’s fascination with drugs comes from colorful personal experience. In his 20s, while visiting New York, he took acid and hallucinated a   race riot on Second Avenue. Did he ever trip again? “Yeah,” he said. “Blitzed” begins with Germany’s success in the 19th century as the world’s   inventors, manufacturers and exporters of drugs, ranging from the benign (aspirin) to the infamous (heroin). One of those drugs was meth, which was initially marketed over the counter to the German public as an   upper that beat back everything from depression to hay fever. Red, white and blue tubes of pills, sold under the trade name Pervitin, caught the attention of a doctor at the Academy of Military Medicine in Berlin, who would oversee the logistics of ferrying millions of pills to troops.   soldiers would sprint tirelessly through the Ardennes at the onset of war, an adrenalized performance that left Winston Churchill “dumbfounded,” as he wrote in his memoirs. A German general would later gloat that his men had stayed awake for 17 straight days. “I think that’s an exaggeration,” Mr. Ohler said, “but meth was crucial to that campaign. ” The other focus of “Blitzed” is a man long considered one of the era’s farcical bit players: Theodor Morell, the portly, overweening physician who had won Hitler’s confidence in 1936 by curing the stomach pain that had afflicted the Führer for years. An opportunist and a maestro with a syringe, Dr. Morell responded to the incessant demands of Patient A, as he calls Hitler in his notes, with an escalating regimen of injected vitamins, hormones and steroids, which included extracts from the hearts and livers of animals. (While Hitler’s diet was vegetarian, his veins told a different story.) Starting in the summer of 1943, the cocktail included generous quantities of opiates. By 1944, the doctor had trouble finding veins to shoot. Then, as the Allies bombed the factories that produced Germany’s drugs, he had trouble finding opiates. “Historians have tried to explain Hitler’s tremors that started in 1945 by saying that he suffered from Parkinson’s,” Mr. Ohler said. “I wouldn’t rule it out, but there’s no proof of it. I think Hitler was suffering from cold turkey. ” Mr. Ohler believes that Hitler’s drug consumption prolonged the war, by enabling his delusions. But “Blitzed” does not aspire to recast our understanding of National Socialism, or Hitler’s psyche, fundamentally, so much as to add particulars that make other portraits seem incomplete. For Mr. Ohler, writing the book was cathartic. He grew up with a palpable sense of the horrors of Naziism, learning an unflinching account of the war at school in what was then West Germany. The history was made all the more appalling and personal by his maternal grandfather, a former Nazi Party member who lamented the demise of Hitler whenever something about life in a democracy got on his nerves. Then there was the legacy of his paternal grandfather, who fought for the Nazis in the Soviet Union. “I always wondered why my father never showed any emotions toward me,” he said. “It’s because his father never showed any emotions toward him. The German people coming out of the war were emotionally so disturbed. I had always been in that story. Now, I have written myself out of that story. I have freed myself by writing this book. It was a liberating experience. It was a good five years. ”'"}, "time": 1742562256.5169954}