{"duration": 0.037801504135131836, "input_args": {"text": "'How Crooked Hillary’s “Fixer” Destroyed Bill Clinton’s Women   \\n“I arranged a meeting for Hillary and a woman in an exclusive Beverly Hills hotel,” the man, who was hired by the Clintons, via a Hollywood executive, to cover up their scandals, told The ENQUIRER. PHOTOS: Revenge! Donald Trump Fighting Back Against Hillary Clinton’s Smear Campaign “She had come to the studio to see the filming of a movie in 1994.” “While I was there, I helped her slip out of a back exit for a one-on-one session with the other woman. It was made to look casual, leaving quietly [rather] that being caught up in the melee … but really it was for something presumably more sordid.” What’s more, it wasn’t just Hillary’s flings with women that the shadowy Mr. Fix It helped to orchestrate!– Clinton’s Top 5 Debate Whoppers Hillary’s former bagman finally confessed to The ENQUIRER just how he helped her to cover up her affair with married lover Vince Foster, too! The shadowy figure — who provided PROOF of his employment for the Clintons — also revealed 12 fixes he covered-up, including: + How Hillary secretly plotted to a counter-attack on Bill’s mistress Monica Lewinsky — via a document buried for two decades! + What crooked reporters were on the take from the Clinton camp! + How he covered up Bill’s seedy romp with hookers! + Which A-list celebrity had a secret affair with Bill during his presidency! \\nBill Still is a former newspaper editor and publisher. He has written for USA Today, The Saturday Evening Post, the Los Angeles Times Syndicate, OMNI magazine, and has also produced the syndicated radio program, Health News. He has written 22 books and two documentary videos and is the host of his wildly popular daily YouTube Channel the “Still Report”, the quintessential report on the economy and Washington.'"}, "time": 1742561856.4981747}