{"duration": 0.06327128410339355, "input_args": {"text": "'BEIJING  —   For China, President Trump’s scrapping of the   Pacific trade agreement is a chance to extend Beijing’s economic and political influence. And it is an opportunity to deepen ties with its neighbors in Asia. But with a cooling economy at home and a looming leadership   the last thing President Xi Jinping wants is a trade war, though officials are girding for that possibility. Rather, China’s leaders crave stability and predictability. Early signs indicate they may not get their wish. The Chinese fear that if Mr. Trump was willing to toss aside years of delicate negotiations with allies and decades of American trade policy, he could also go his own way on issues he has staked out with Beijing, including Taiwan and the South China Sea. As if to bolster that point, on Monday  —   the same day that Mr. Trump withdrew from the   Partnership, the   trade agreement  —   his spokesman said the United States would prevent China from accessing islands it claims in the South China Sea, a threat that one nationalist Chinese newspaper had already warned would mean war. “This shows that Trump might act on his words,” Deng Yuwen, a public affairs commentator in Beijing, said in an interview. “With previous presidents, their election promises weren’t taken so seriously. ” He added, “That means China must take his other warnings more seriously, especially about the South China Sea and Taiwan. ” Mr. Trump’s goal in squelching the trade agreement was to protect American jobs and businesses. His trade officials have argued that the deal does not do enough to help the United States or to contain China, which was not invited to join the agreement. But in killing an agreement designed to limit China’s vast economic reach in Asia and anchor America’s presence in the world’s fastest growing region, analysts said, Mr. Trump created a void that President Xi was already practicing to fill. Only last week, Mr. Xi was trying on the mantle of global leadership at the World Economic Forum in Davos, Switzerland, suggesting that with the United States in retreat, China was prepared to step up as a champion of free trade and protector of the global environment. Mr. Xi has kept China’s economy behind high walls, and China remains the world’s biggest emitter of greenhouse gases, but inconsistencies have never ruffled the president. “This is indeed a big win for China in the struggle for global leadership,” said Zhang Baohui, director of the center for Asia Pacific studies at Lingnan University in Hong Kong. “Trump is surrendering this opportunity to prove the continuing relevance of American primacy. ” The death of the trade agreement is likely to accelerate Beijing’s push for its alternative trade agreement, the   Regional Comprehensive Economic Partnership. That agreement would exclude the United States and would reduce or eliminate tariffs on trade among China, Southeast Asian nations, Australia, India, Japan, South Korea and New Zealand. It includes few of the features of T. P. P. that would have been most awkward for Beijing, such as protections for independent labor unions and the environment, and requirements that   enterprises behave more like commercial enterprises. The agreement has stalled on rifts between Southeast Asian nations and the others, but Thailand’s minister of commerce, Apiradi Tantraporn, said Monday that the talks “are expected to be expedited” without the T. P. P. But the end of the T. P. P. will not be Mr. Trump’s last word on trade with China. His trade officials say they expect greater access to the Chinese market in exchange for the easy access Chinese goods have to the United States. And they appear prepared to risk a trade war, an expanding    contest of tariffs and other trade restrictions, to get it. Mr. Trump’s trade officials have threatened to impose high tariffs on Chinese goods, starting with heavily subsidized products such as steel and aluminum, imported into the United States. “It’s a little weird that we have very low tariffs and China has very high tariffs,” Wilbur Ross, the nominee for commerce secretary, said at his Senate confirmation hearing last week. Last week, China proposed allowing greater foreign investment in certain sectors, but there was little confidence the recommendations would be carried out in the foreseeable future, and American businesses said they felt less welcome in China than before. While Mr. Trump’s advisers say that China has more to lose than the United States in a trade war, Chinese officials told visiting American businessmen last week that Beijing was prepared. They had developed lists of punitive options they would take against the United States if Washington took the initiative, they said. “The signals are very clear: If this is going to be a trade war, China will reduce imports of American aircraft from Boeing and agricultural products,” said Wu Xinbo, director of American studies at Fudan University in Shanghai. “We can turn to Europe, Australia and Canada for those products. And we know that 20 to 30 of the states in the United States with big agricultural lobbies and Boeing plants will be putting pressure on Congress. ” A   American trade expert in China agreed, saying China was prepared to go to the mat. “Trump’s trade team would be wise to shelve ‘The Art of the Deal’ and focus on the ‘Art of War,’ if they really want to know what’s ahead in U. S.  trade relations,” said James Zimmerman, a managing partner of the Beijing office of the law firm Sheppard, Mullin, Richter  Hampton who has worked in China for 19 years. “China views Trump as a paper tiger that will likely back down on the complicated, thorny issues that are not negotiable. The Chinese also know that Trump won’t risk a trade war lest the business community will be up in arms. ” Others, though, detect anxiety, and read China’s outward confidence as bluster. Bilahari Kausikan, ambassador at large for Singapore, said China had “a real insecurity about a trade war. ” Both sides are likely to lose, he said, but China stands to lose more “since the U. S. domestic political order is not at stake in the same way as the Chinese Communist Party rule may be at stake. ” The next few months, as Mr. Xi focuses on choosing new members of the ruling Standing Committee for his second   term, will be a particularly tense political period, and economic instability is the last thing he needs. Similarly, he will try at all costs to appear strong to his domestic, nationalistic audience in the face of challenges from Mr. Trump on Taiwan and the South China Sea. Mr. Trump has suggested that the One China policy, under which the United States recognizes the government of Beijing and not Taiwan, is not sacrosanct, a major concern for Mr. Xi. “In a year of political transition, Xi cannot afford to come across as weak,” said Paul Haenle, the director of the   Center for Global Policy in Beijing, who served as China director for the National Security Council under President George W. Bush and President Barack Obama. “Taiwan is the core of core issues for China  —   a bottom line. Many Chinese stress that it is nonnegotiable. ” But for now, at least, the increased contention with Washington is likely to strengthen Mr. Xi’s political hand at home by rallying public and elite support against a foreign threat, said Minxin Pei, a professor at Claremont McKenna College in California who studies Chinese politics and   relations. “Short term, it will almost certainly give the Chinese government a boost in its public support,” Dr. Pei said in a telephone interview. “It helps Xi, because whenever there is such pressure from outside, Chinese officials tend to rally around the top leader. ” Mr. Trump has also threatened China on control of territory it claims in the South China Sea. The comments by Mr. Trump’s press secretary, Sean Spicer, on Monday echoed those made by his nominee for secretary of state, Rex W. Tillerson, at his Senate confirmation hearing. While Mr. Trump has not explained how he will keep China off islands where it has built airstrips and installed weapons, the comments by his appointees suggest the possibility of an American blockade. While Mr. Obama tried unsuccessfully to leverage American allies in the region to compel China to back down, Mr. Trump seems willing to abandon them and face China on his own. That    attitude has raised alarms at the Pentagon and among American Navy experts, who said such a blockade would be tantamount to war. The idea has also alarmed America’s allies. Australia, Washington’s staunchest ally in the Asia Pacific region, would not participate in such a venture, its defense officials said, adding that a blockade could not be successful and could serve to persuade disenchanted American friends in the Asia Pacific to pivot toward China. With Mr. Trump portending divisive action on many fronts, Mr. Xi was calm and prepared, his foreign minister, Wang Yi, suggested. “Serene under the tumultuous clouds,” Mr. Wang said, quoting a line from a poem by Mao Zedong, the founder of Communist China. No one knows how long that will be the case.'"}, "time": 1742628566.9923897}