{"duration": 0.10248255729675293, "input_args": {"text": "\"An Autopsy on the Ruin of Turkish Tourism in 2016 \\nGetting embroiled in Syria, terrorism, and conflict with Russia devastated one of Turkey's principal industries Donate! The author is a Ph.D. student and teaching assistant at the School of Politics, University of Leeds, UK Frankenstein is on the loose... The demons unleashed from Pandora’s box accompany him taunting the earth...A chaos, unseen since WW2, has been decimating the humanity. The anguish in human institutions, the agony of the social and political establishment is echoed on global basis. The Middle East has been the epicentre of this devastating storm with Turkey, a once stable and secure nation, being drawn deeply into this unprecedented vortex of despair. Turkish tourism has descended into turmoil amidst this unrivalled crisis as well. Wave of armed attacks juxtaposed with the still raw trauma of failed coup d’état coinciding with the high season lacerated tourism. According to analyst Wolfango Piccoli of the consulting firm Teneo Intelligence: ‘Taking into account direct and indirect income, tourism accounts for as much as 12 percent (or $96 billion) of Turkey’s GDP and tourist arrivals were down 45 percent compared to 2015’. This is the sharpest drop ever since 1998. However, is it right to put the blame at the gate of regional problems and terrorism only for this bleak situation? Terrorism and a series of unforgiveable domestic and foreign policy blunders such as meddling in Syria, dispute with Russia, failure to acknowledge the threat posed by the rising wave of Jihadism could obviously be held accountable to a considerable extent yet Turkey has a more challenging issue: the image! What actually deterred the Western vacationers from coming to Turkey is not only the fear of terrorism but also anger at the inflammatory politics of Turkey. Germany issued a travel advisory to its citizens not only for terrorism but also for the pathetic fact that those visiting Turkey should not make public statements against the Turkish state whilst Dutch Foreign Minister Bert Koenders warned that the Netherlands cannot guarantee the safety of citizens travelling to Turkey if they have been ‘critical of Turkish leaders.’ German newspaper Die Zeit reported that flow of tourist to Turkey has shown ‘signs of continuous abating’ due to Erdogan’s clampdown on the opposition media and a series of terrorist attacks in the country. “Erdogan’s foreign policy has been an unmitigated disaster for Turkey, but his autocratic domestic tendencies at home have also led to alienation,” said Jonathan Schanzer, vice president for research at the Foundation for Defense of Democracies think tank. Vienna airport displays news at a screen saying “Turkey allows sex with children under the age of 15” upon a story released by Austrian tabloid Kronen (country’s largest newspaper), that Turkey’s constitutional court to cancel a law that designated all sexual activities with children under the age of 15 as abuse. Thomas Schnoell, a spokesman for the Austrian foreign ministry, confirmed the ambassador had been summoned by Ankara. In a fury, he said “this is for us a matter of freedom of the press.” This allegation could be the truth or a fallacy... whatever it was, yet it caused a massive row, led to ‘Don’t Go to Turkey Campaign’ and tarnished the image of Turkey immensely across Europe voicing concerns about Islamization of the state. An outstanding report titled as ‘Tourism as Politics: Turkey’ published in 2014 by professor Thomas Clayton at Middle East Institute, George Washington University seems to have prognosticated the current plight of Turkish tourism. Clayton posits that ‘ the recent domestic and international political upheavals hold both risks and opportunities for Turkey’s tourism potential. The domestic political controversy over the Gezi Park protests and the government’s response have also tarnished Turkey’s image in a way that officials are quick to dismiss but may prove extremely detrimental to Turkey’s long term plans to become a major international tourist destination.’ Admittedly, terrorism has become a hot potato in the hands of Turkey and the survival of Turkish tourism relies not on entirely combating terrorism and resolving the crisis in the perception of its safety. It is actually more linked with ‘re-construction of its image’ on the global stage. The impressions left at home and abroad have impacted tourism antagonistically. Tourism is a crucial part of understanding, and a creative way to analyze, domestic and foreign policy as well. There is an urgent need for a political reset and long-overdue reforms to embrace the political and legal stability and to strengthen the democracy in the foreseeable future. Considering that boosting halal tourism is not the solution, the abrupt restoration of ties with Europe and other estranged regional powers is therefore of paramount significance for a quick recovery of tourism. \\nConsequently, the golden segment of Turkey’s economy could be rejuvenated if the relentless and short-sighted policies are disposed of and above all a dovish rather than a hawkish approach is adopted towards domestic and international crises. Did you enjoy this article? - Consider helping us! Russia Insider depends on your donations: the more you give, the more we can do. $1 $10 Other amount \\nIf you wish you make a tax-deductible contribution of $1,000 or more, please visit our Support page for instructions Click here for our commenting guidelines On fire\""}, "time": 1742563471.1266367}