{"duration": 0.04928398132324219, "input_args": {"text": "'The bodies just keep arriving. On Thursday, only two days into February, the coroner’s office in Dayton, Ohio, had already handled 25 deaths  —   18 caused by drug overdoses. In January, the office processed 145 cases in which the victims’ bodies had been destroyed by opioids. Now, the Montgomery County Coroner’s Office is so crammed with corpses that it has asked a local funeral parlor to take in four bodies for “temporary storage,” the first time it has had to make such a request, Kenneth M. Betz, director of the coroner’s office, said on Thursday. “We’re running at full capacity,” he said in a phone interview. “We’ve never experienced this volume of accidental drug overdoses in our history. We now call funeral homes immediately” to ask if there is space available, he added. Widespread abuse of powerful opioid pain relievers in the United States  —   including oxycodone, hydrocodone, hydromorphone and fentanyl, heroin’s cheaper but deadlier cousin  —   has driven overdose death rates to historic highs, according to the Centers for Disease Control and Prevention. The C. D. C. ’s numbers show that 91 people in the United States die every day from opioid overdose. The number of bodies from accidental overdoses that have come to the Montgomery County Coroner’s Office in the first 33 days of the year  —   163  —   is already more than half the yearly totals for the past two years. In 2015, the total was 259 last year, the number of deaths from January to September was 253,  figures from the office show. In Ohio, fatal overdoses more than quadrupled in the past decade and by 2007 had surpassed car accidents as the leading cause of accidental death, according to the Department of Health. In 2015, 3, 310 deaths were recorded in the state from unintentional drug overdoses, a 21. 5 percent increase from the previous year, according to the C. D. C. Addiction is so entrenched and widespread that police officials say there are now third and fourth generations of prescription drug abusers. These days, hospitals in Cincinnati require drug testing of new mothers and infants because of a surge in newborns exposed to addictive drugs. The five states with the highest rates of death linked to drug overdose were West Virginia (41. 5 per 100, 000) New Hampshire (34. 3 per 100, 000) Kentucky (29. 9 per 100, 000) Ohio (29. 9 per 100, 000) and Rhode Island (28. 2 per 100, 000) according to the C. D. C. But significant increases were also seen in the Northeast and the South, the agency said, including Connecticut, Florida, Maryland, Massachusetts and Rhode Island. Last year, Mr. Betz said Montgomery County’s coroner’s office had to use refrigerated trucks to store bodies for a week. In his 40 years in forensics, Mr. Betz said, he has never seen such a steady increase in overdose deaths, and it has left him and his colleagues feeling overwhelmed. “Our staff is, quite frankly, tired,” he said. “The doctors are tired. The investigators are tired. We’ve never had volumes like this. ” “This increase from year to year  —   I’ve never seen anything like this,” he said. “The drug problem we have is absolutely phenomenal. ”'"}, "time": 1742564511.5721867}