{"duration": 0.10773420333862305, "input_args": {"text": "'  Baxter Dmitry in News , World // 0 Comments \\nIceland’s anti-establishment Pirate Party have plundered an historic victory in Iceland’s general election and are set to form government as the senior partner in a coalition of alternative parties. \\nThe remaining votes are still being counted, but reports suggest Iceland will have a centre-left coalition of the Pirates and three, or possibly four, other non-establishment parties. Governments in Iceland are usually cobbled together coalitions, but the Pirates announced they will not consider working with a mainstream party. \\nBirgitta Jónsdóttir, the Pirates’ parliamentary leader, said her party is willing to form a government with any party that subscribes to its agenda of “fundamental system change”, including the creation of a new, crowdsourced constitution. \\nThe extraordinary victory for the Pirates is the latest example of an outsider gatecrashing the establishment, as voters around the world continue to reject traditional politics as unfit for purpose in the 21st century. \\nFounded in 2012 by former hackers, WikiLeaks collaborators, and activists, the Pirate Party won their first seat in the Althingi parliament one year later – and since then their popularity has exploded. \\n“We have managed to catch and capture the spirit of change with so many young people in Iceland,” said Jonsdottir, who describes herself as a “poetician.” \\n“We are very much about modernizing our system, so that people don’t fall through the cracks all the time.” \\nSupport for the movement surged to 43% in an April poll after the Panama Papers revealed that former Prime Minister Sigmundur David Gunnlaugsson held secret investments in offshore accounts — which led to some of the largest protests the country has ever seen. \\nNamed the “Saucepan revolution” due to the making a racket in the streets with pots and pans, the massive protests removed the Prime Minister from office and kickstarted a societal change. \\nJonsdottir likens Iceland to Sicily in that it has been controlled by a mafia-like handful of elite families. But Icelanders have a deep distrust of the elite, and since the financial crash in 2008 and the Panama Papers revelations last year, the society has vowed enough is enough. \\nIceland has differed from the rest of Europe and the US by allowing bankers to be prosecuted as criminals , rather than treating them as a protected species. Top bankers were thrown in jail earlier this month after a long running case related to the 2008 crash. Now it seems the purge of the political class has begun. The Pirate Party flag next to the Jolly Roger. \\nWhat will Pirates in parliament actually mean? \\nCITIZENSHIP FOR EDWARD SNOWDEN \\nThe Pirates are against state surveillance in any form, and Edward Snowden is a national hero in Iceland. A resolution has been put forward to grant him citizenship of the wind-swept North Atlantic island. \\nAre they worried granting a haven to the NSA whistleblower might rile Iceland’s NATO ally in Washington? \\n“Yeah, well we have done things that don’t make other nations happy before,” she said. “Sometimes it’s a case of what’s doing what is right versus what is easy.” \\nBITCOIN CURRENCY \\nThe backlash against their bankers knows no bounds. Resentment runs deep, and adopting Bitcoin as the official currency will curtail the ability of banks to scam the people. The cryptocurrency is free, safe, is not inflationary, and a central government will never be able to take it off you. \\nDECRIMINALIZATION OF DRUGS \\nThe Pirates want to adopt the “ Portuguese solution “. 15 years ago the Portuguese government did something that the United States and most countries around the world would find entirely alien. After many years of waging a fierce war on drugs, they decided to flip their strategy entirely. By decriminalizing all drugs, and treating addicts rather than punishing them, Portugal has drastically reduced the drug abuse in their country. \\nDIRECT DEMOCRACY \\n“We do not define ourselves as left or right but rather as a party that focuses on the systems,” Jónsdóttir has said. “In other words, we consider ourselves hackers—so to speak—of our current outdated systems of government.” \\nDid the Pirate Party campaign pushing any major legislation of its own? No, not really, because, according to Fortune magazine, “the official party stance on some of Iceland’s biggest political questions is unclear, in part, because its members believe in deferring to the wishes of voters.” That’s called direct democracy. For the first time in their lives, Icelanders have voted a government into power who will not betray their promises \\nThere is a widespread hatred of central authority in Iceland, and the Pirates, with their anti-establishment beliefs and jaunty black-flag logo, are poised to take advantage of the dissident mood. They seem the perfect fit for a self-reliant country with a strong anti-authoritarian streak. \\n“This is a society that is very loosely organized in many ways,” said Asgeir Jonsson, a University of Iceland economist. “We don’t have an army, we never had a king. We hate all central authority.”'"}, "time": 1742563257.173376}