{"duration": 0.14812278747558594, "input_args": {"text": "'Michael’s Latest Video John Bolton Warns That Obama May Divide The Land Of Israel At The UN Before The Inauguration   20th, 2016 \\nIs Barack Obama about to make the most catastrophic decision of his entire presidency? Former UN Ambassador John Bolton is warning that there is “a lot of speculation” over at UN headquarters right now about “resolutions that recognize a Palestinian state or that try and set a boundary for Israel based on the 1967 ceasefire lines”. Of course this would have to happen before the inauguration of Donald Trump on January 20th , because Trump has already made it quite clear that he will not support any UN resolution of such nature. Knowing that Trump is about to take office, advocates of the “two state solution” are putting an immense amount of pressure on Obama to support a UN Security Council resolution that would permanently divide the land of Israel while he is still in the White House, and at this moment we do not know what Barack Obama’s final decision will be. \\nMost Americans have no idea that this drama is playing out behind the scenes, but those in the know are very much aware of what is happening. The Wall Street Journal recently published an article entitled “ Obama’s Israel Surprise? ” that discussed the possibility of Obama supporting a UN Security Council resolution that would permanently divide the land of Israel, and the New York Times editorial board has formally endorsed such a resolution. \\nThe rest of the UN Security Council is ready to agree to such a resolution, and at this point the only obstacle is getting Barack Obama’s approval. That is why it was so exceedingly alarming to wake up on Sunday morning and read former UN Ambassador John Bolton’s very chilling warning about what could soon happen at the UN. The following comes from an article on the website of The Hill … \\nFormer United Nations Ambassador John Bolton warned Sunday that President Obama should not take any actions before leaving office that could hurt Israel at the U.N. \\nBolton said during an interview with radio host John Catsimatidis that there is “a lot of speculation over in Turtle Bay at U.N. headquarters about resolutions that recognize a Palestinian state or that try and set a boundary for Israel based on the 1967 ceasefire lines.” \\n“I think that’d be very inadvisable for the president to do that,” he said. \\nJohn Bolton is still very tied in to the international community, and Donald Trump is reportedly actively considering asking him to serve as Secretary of State. \\nNeedless to say, I would take what he is saying very, very seriously. \\nSo what would this potential UN Security Council resolution look like? \\nWell, it would likely accomplish three historic things… \\n1. It would give formal UN Security Council recognition to a Palestinian state for the very first time. \\n2. It would grant East Jerusalem to the Palestinians as the capital of their new state. \\n3. It would establish the 1967 ceasefire lines as the basis for final negotiations for borders between the two states. \\nUp until now, the U.S. government’s veto power on the UN Security Council has always blocked anti-Israel resolutions from passing, but earlier this year the Obama administration said that such a “parameters resolution” was now “on the table”. \\nAnd at this point we still don’t know what Obama is going to ultimately decide, but the Trump transition team is so concerned about this that they recently warned Obama “against making moves on the Israeli-Palestinian conflict in his last months in office” . \\nBut no matter how much they object, the truth is that Trump and his team cannot actually do anything to stop Obama. \\nIf Obama decides to betray Israel at the UN, it is going to happen. \\nAnd of course the Israeli government is extremely concerned about what might take place as well. According to the New York Post , the Israelis asked Secretary of State John Kerry if the Obama administration would promise to veto any anti-Israel resolutions at the UN for the remainder of Obama’s term, and Kerry flatly refused to make such a promise… \\nIsrael faces a unique window of danger from Nov. 9 to Jan. 20: What might President Obama do in his final days in office to slam the Jewish state? \\nStart with Secretary of State John Kerry’s recent flat refusal to promise a US veto on any upcoming anti-Israel resolution in the UN Security Council . \\nOn Saturday, Haaretz reports, Prime Minister Benjamin Netanyahu told Kerry he’s counting on Washington to stick to its policy of nixing anti-Israel resolutions. Kerry’s reply: The administration has yet to make a decision on the matter . \\nPerhaps equally as alarming is what Obama told the Palestinians. In October, Obama reportedly told them to wait until after the election for any action at the UN Security Council… \\nOn the surface, the latest message to the Palestinian Authority from the Obama administration is no different from the past two decades of American policy: the U.S. will veto any resolution attacking Israel or demanding Palestinian independence without them first making peace with the Jewish state. But, as Haaretz reported , there was one significant caveat to the warning. They were told not to push for any such resolution until after the presidential election next month . \\nSo why would it be so catastrophic if Obama decides to support a UN Security Council resolution that permanently divides the land of Israel? \\nWell, John Kilpatrick, Shane Warren, Bob Jones and many others have warned that when we divide the land of Israel, our land will be divided too. \\nWhether it is Barack Obama, Donald Trump or some other president that does it, someday this will happen. \\nAnd when this happens, the floodgates will open and judgment after judgment will hit this nation. I have warned about many of these events in my latest book , and I hope to write much more about what is coming in the months ahead. \\nSo right now we are in “the danger zone” until January 20th, 2017. \\nIf we can get to January 20th and Donald Trump is peacefully inaugurated and the land of Israel has not been divided, perhaps we can all breathe a little bit easier for a while. \\nBut if the land of Israel is divided between now and then, the consequences for this nation are going to be more severe than most people would dare to imagine. November 20th, 2016 | Tags: 2017 , A UN Security Council Resolution Establishing A Palestinian State , Barack Obama And A Palestinian State , Israel , January 2017 , January 20th , John Bolton , Pain , Painful , Palestinian State , Palestinians , Two State Solution , UN Resolution Dividing The Land Of Israel , UN Resolution Establishing A Palestinian State , UN Resolution On A Palestinian State , UN Resolution Palestinian State , UN Resolution To Divide The Land Of Israel | Category: Christian , Commentary , Politics , World SurrealReality \\nThanks to Michael for having the courage to stand up for the truths of the Bible. God makes it plain in his Word that calamities will come upon whoever seeks to divide Israel. Pray for Israel and that America will stand up for Zion. robert \\nI think it will be fascinating to see how God responds and if evangelical Bible interpretation is accurate. I am in the “don’t know” category. Have heard far too many preachers for 40 years proclaim this and that with no accurate results to show for it. Standing by. SurrealReality \\nForget the preachers. Believe what the Bible says. Tatiana Covington \\nIt’s just a plot of ground. I’ve never seen what the BFD is about it. Given the choice between Cuba itself and Israel itself (as geographical expanses only), I’d take Cuba any day. Much better rainfall and way better beaches. ted j GayVet ;) \\nDear Clueless with and opinion, Sometimes all it takes is for someone to open their mouth just to show how ignorant they are…thanks for proving that it’s still a relavent statement! Rusty Nale \\n“I will also gather all nations, And bring them down to the Valley of Jehoshaphat; And I will enter into judgment with them there On account of My people, My heritage Israel, Whom they have scattered among the nations; They have also divided up My land.” Joel 3:2 live in the light \\nI agree, if president Obama decides to support or refuse to veto a united nations resolution to divide Israel then it will be very catastrophic. We have had people in our church years ago about fifteen years ago and some longer that saw in dreams and visions of a tsunami hitting the east coast and gulf of Mexico with water going all the way to the Rockies of northern new Mexico and Colorado and then coming down. The south was almost completely gone and all of east Texas from Dallas East and Louisiana was completely gone except a few islands there and in parts of east Texas where there was higher ground. I don’t know if those dreams and visions were from the president betraying Israel but it was something they saw. One sister dreamed a huge asteroid hit the trans Atlantic ridge in the Atlantic ocean and when it did it shook the whole earth and the oceans moved back and forth like when someone sits down to fast in a bathtub. She said the devastation was beyond belief but then again I don’t know if it was related to this event or not. live in the light \\nI’m sorry I meant the “mid-Atlantic” ridge.'"}, "time": 1742564446.064866}