{"duration": 0.11766958236694336, "input_args": {"text": "'Emergency managers trying to persuade residents to evacuate as a hurricane approaches can be like parents trying to cajole their children to do something: They rely on a blend of fear, tough love and their authority. Officials have directed residents in parts of Florida, Georgia, North Carolina and South Carolina to leave ahead of Hurricane Matthew, which was a Category 4 storm as of 11 a. m. Thursday and was expected to lash Florida late in the day. Because officials have asked residents to leave does not guarantee it will happen. Even after all of the best practices in emergency communications are exhausted, 5 percent of the population will most likely remain in harm’s way, experts and researchers said. Effectively communicating the need to evacuate means persuading people to act with a sense of urgency and to follow specific instructions. Here’s how experts say it can be done: Before Hurricane Sandy struck in 2012, some residents who refused to evacuate were asked to write their Social Security numbers on their arms in permanent marker so that they could be identified if they did not survive, Cara L. Cuite, an associate research professor at Rutgers University in New Jersey who studies risk communication, wrote in an email. Others were asked to fill out a form on how to notify their next of kin. “Communicators do this to stress the possibility that people who do not evacuate could be killed,” said Professor Cuite, who was a principal investigator of a study called “Best Practices in Coastal Storm Risk Communication. ” Gov. Rick Scott of Florida, for example, while warning that some areas of the state would be hit with  . p. h. winds and millions would lose power, stressed: “This storm will kill you. Time is running out. ” Emergency managers should avoid saying “voluntary evacuation” and make it clear that residents are being ordered to leave, even if no one is going to remove them forcibly from their homes, Madhu Beriwal, the president and chief executive of IEM, a global security consulting firm in Morrisville, N. C. said on Wednesday. The semantics make a difference, she said, because a voluntary evacuation will have a lower rate of compliance than one labeled mandatory. “There are no excuses,” Mr. Scott said at a news conference in Tallahassee, the state capital. “You need to leave. Evacuate, evacuate, evacuate. Are you willing to take a change to risk your life? Are you willing to take a gamble? That’s what you’re doing. ” Public officials should refrain from comparing pending storms with previous ones because every one is unique, with its own size, winds, rains and tracks, said Meghan McPherson, program coordinator of the emergency management graduate program at Adelphi University in Garden City, N. Y. Making comparisons can give residents a false sense of security, she said in an email. The authorities should highlight areas to be evacuated and explain why the residents there are in danger. Officials can follow up with messages tied to specific deadlines and actions, Professor Walter Gillis Peacock, director of the Hazard Reduction and Recovery Center at Texas AM University, said in an email. He suggested saying things like “now you should be” and “by 5 a. m. tomorrow you should be” and filling in the phrases with specific directions. Local authority figures, such as a mayor, police chief or county commissioner, are the best ones to deliver the news because they will be seen as more credible in a community, Ms. Beriwal said. Mr. Scott said he wanted the 1. 5 million residents under mandatory evacuation orders to follow the law. “This is clearly going to either have a direct hit or come right along our coast, and we’re going to have   winds,” the governor said. Emergency planners also have to guard against “shadow evacuations,” in which residents who are on the perimeter of a storm and who do not need to evacuate leave anyway, Ms. Beriwal said. This can have a ripple effect that causes traffic jams for those who truly need to escape. Derek Arnold, an instructor at Villanova University who has a background in crisis communication and management, said radio and television stations can notify residents of evacuations, but apps and text messages can also deliver them right to their smartphones. “The problem is still that there is still so much clutter, many people may not pay attention to such messages, placing them alongside other ‘breaking news’ of the day,” he said. Emergency notifications should look different or have prolonged buzzes to make them stand out, he said. Evacuees need to be assured that resources will be available, such as fuel, rest stops and traffic coordination, Ms. Beriwal said. Relying on a method known as    —   using all highway lanes to move traffic away from danger  —   is critical, she said. This is especially true because hurricane evacuees will take every car they have for fear that any vehicles left behind will be damaged or looted, she said. Professor Peacock added that evacuees do not necessarily have to travel far, and moving inland will generally be a safe place. Overcoming resistance from those who think they know better will be impossible, Professor Peacock said. “There will always be locals that think they know better or are just hardheaded, recalcitrant, blustering individuals,” he said. Ms. Beriwal said there will be people who stay behind and then try to leave when it is too late. “You can’t push people to do things,” she said. “You have to do a pull. You have to attract them to the idea that they need to leave. ”'"}, "time": 1742561796.5516527}