{"duration": 0.07891011238098145, "input_args": {"text": "'. Gardasil is a Decision We Will Always Regret Reading about the young lives that have effectively been destroyed by Gardasil tears my soul; not on... Print Email http://humansarefree.com/2016/11/gardasil-is-decision-we-will-always.html Reading about the young lives that have effectively been destroyed by Gardasil tears my soul; not only for these young women, but for their parents, their friends and for the millions of families around the globe that may yet be hoodwinked into thinking they are protecting their daughter — or son. Sharyl Attkisson, the former CBS reporter who became an independent truth investigator and author, filed this report back in 2008. In 2006, the National Vaccine Information Center railed against Merck’s insistence that Gardasil was just fine to inject into preteens. President Barbara Loe Fisher was livid when she wrote: \"Merck’s pre and post-licensure marketing strategy has positioned mass use of this vaccine by pre-teens as a morality play in order to avoid talking about the flawed science they used to get it licensed.\" But nothing stopped the train. And the shots, and the serious injuries, including death, kept mounting. Natural News reported the tremendous grief of Katy Robinson’s parents, after this vibrant child took the Gardasil shot in 2010 at the tender age of 11. “Katie’s list of symptoms included the following: 24/7 headaches and migraines, 24/7 stabbing ear pain, hyperacusis, fatigue, abdominal pain, nausea, all over joint pain, constant sore throat, visual disturbances, light sensitivity, cognitive issues such as memory and severe comprehension problems, random numbness and tingling, weird “bug crawling” skin sensations, generalized weakness throughout her body (it was difficult for Katie to just sit in the shower to bathe), dizziness, fainting and heart palpitations. “She slept long hours and stayed in her bedroom shielding herself from the noise of everyday living... She was also highly positive for Mycoplasma Pneumonia... Katie even had the classic Bartonella rash (looks like purple and red stretch marks) surrounding her breasts and hips which is confirmation of an active Bartonella infection... [a] diagnostic center diagnosed Katie with the beginning stages of Dysautonomia (a malfunctioning automatic nervous system). We were told that there was no cure and that symptoms were managed with medications...” Thousands of dollars and hours later, the parents discovered that the Gardasil Vaccine can “activate a latent Bartonella infection that was otherwise being suppressed by a properly functioning immune system.” They finally knew that it was Gardasil injections that nearly destroyed their daughter and still do not know if she will ever return to normal. They live with regret. Finally, a little too late, the American College of Pediatricians is now warning parents about Gardasil. But what they are warning about is an entirely new subset of difficulties. The Holistic Works reports: “Gardasil vaccines could be ‘associated with the very rare but serious condition of premature ovarian failure (POF),’ says the America College of Pediatricians (ACP)... “[L]ong-term ovarian function was not assessed in either the original rat safety studies or in the human vaccine trials,” explains the ACP. “Even more, because doctors are so aggressively propagandized by the cash-rich vaccine industry, they don’t even realize that HPV vaccines can cause ovarian failure.” Toxic ingredients in Gardasil and all vaccines are already known to cause harm. From The Holistic Works also stated: “The ACP explained that ‘potential mechanisms of action have been postulated based on autoimmune associations with the aluminum adjuvant used and previously documented ovarian toxicity in rats from another component, polysorbate 80.’ “In other words, the science already knows about the mechanisms of potential harm caused by these ingredients. “It’s not a mystery, and it’s not even debatable that injecting children with aluminum, mercury, MSG, formaldehyde and polysorbate 80 will inevitably cause severe damage in some of those children.” By D. Samuelson  '"}, "time": 1742562017.8415039}