{"duration": 0.5415270328521729, "input_args": {"text": "'Before dawn on a Sunday late last month, a battalion of pesh merga soldiers  —   about 600 Kurdish men, along with a few women  —   gathered in the shadow of Bashiqa Mountain, on the western edge of the autonomous region of Iraqi Kurdistan. They were sons, daughters, fathers, grandfathers. They wore an assortment of camouflage fatigues and traditional Kurdish flowing pants, waist sashes and head scarves. They carried antique Kalashnikovs and new assault rifles. Few had helmets, and fewer had body armor. Strapped to their backs and belts and legs were daggers, revolvers, axes. Some of them had received the call to duty only the day before and were driven to the front by family or rode overnight in taxis. With them was a column of vehicles new, old and very old: armored personnel carriers,     vehicles (MRAPs) Humvees, S. U. V. s, ambulances, Soviet tanks, backhoes, bulldozers,   sedans and a bestiary of retrofitted pickups and battlewagons, whose tenuous welding and argumentative suspensions told of the years Iraqi Kurds had spent fighting with    and homemade hardware in one war or another. At 7 a. m. the idling engines came to life, and cries went up: “Long live pesh merga!” “Death to ISIS!” The troops started down an unpaved track that led southwest through the Tigris River valley toward the city of Mosul. As the march went on, villages gave way to occasional abandoned farmhouses, crop fields to dunes, and the sun made itself felt. A long dust cloud rose in the wake of the column, whose eventual destination was Bashiqa, a small city on the mountain’s edge that was claimed by the Islamic State. The operation to retake Mosul had finally begun one week earlier on Oct. 16. The pesh merga led the charge toward the city, Iraq’s   and ISIS’ last citadel in the country. Mosul had become the focus of the world’s attention, and the battle for it had been criticized even before it began. In the second presidential debate, Donald Trump complained that in revealing its designs on Mosul, the international   coalition was telegraphing its punches. This was inevitably true  —   not even ISIS had ever doubted that Mosul would be invaded  —   but it was also true that the first flurry of blows was too big to duck. Embedded in the column was a unit of American Special Forces, in a cluster of MRAPs. They were there, it was understood, to pick out targets for airstrikes. Rumbling in the distance, the bombs had deposited on the horizon a dome of inky vapor. While the pesh merga attacked ISIS from the north and the east, the Iraqi military was approaching from the south. The job of the battalion moving toward Bashiqa was to shore up the eastern front and extend a cordon around Mosul. The Iraqis’ next moves would depend in part on the Kurds’ success. For the moment, in other words, the progress of the central conflict in the Middle East had come down to this unlikely troop. The first ISIS mortar fire arrived in the midmorning with whizzes and thuds. It was off target, and the soldiers regarded the dirt plumes with indifference. The first incoming bullets soon followed and were cause for more alarm. They flew from a rambling,     house on the crest of a slope. The gunfire split the column in two. The back portion halted behind a berm about 12 feet high and about 300 yards downslope from the house. A few soldiers climbed up the dirt and took aim. The rest got out of their vehicles and pulled out phones and cigarettes. Group photos and selfies were snapped. “Let’s use the cannon,” a commander suggested. A pickup mounted with an   gun pulled in front of the berm. The first shot fell short a second hit the house, leaving a disappointingly small hole in the facade. When there was a pause in the fighting, a group of trucks emerged from behind the berm, raced up the track and cut right onto a hillock that overlooked the house. Some pesh merga got out and gathered. They presented a clear target for snipers and artillery, but they didn’t appear to mind. They chatted, laughed, smoked, checked their phones. More group photos, more selfies. Even after two mortar rounds landed in quick succession on either side of them  —   a sign that a spotter was nearby, bracketing their position  —   they remained unhurried. Eventually they got back into their vehicles and, under fire from the house, headed straight for it. The ISIS fighters had built their own berm beside the house’s exterior wall. The Kurdish soldiers backed their trucks up to it, and one of them opened up on the house with a   machine gun. Others peeked over the berm, taking the occasional potshot. One walked up to a gap in the dirt and, with neither cover nor helmet, a cigarette dangling from his lips, emptied a magazine. The   jammed. The fighting subsided again. The soldiers reclined at the base of the berm. Out came the phones. More selfies. Texting. A man called his mother. Another watched a video of a firefight taking place on some other front around Mosul. None of them seemed eager to storm the house. “I’m deaf from that cannon!” a soldier said. “Did you take any photos of it being shot?” another asked him. The gunner got into an argument with another soldier over whose responsibility it had been to make sure the   was working properly that morning. “You were supposed to fix it!” “It’s not my job!” “It’s not as if you had to build an airplane. It’s simple. ” “You came all the way to the front in a taxi, and now all you do is talk. You just talk. ” Another burst of gunfire from the house, and a soldier climbed behind the   gun. “Come help me,” he instructed a colleague. “I don’t know how. ” “If you don’t get up here and help me, I’m going to do everything that’s bad to you. ” The gun was loaded and fired. The backblast shattered a pickup’s windshield. “Bazan, where are your cigarettes?” Bazan ran to a truck and returned with a pack of cigarettes. “Who wants a cigarette?” The group lit up. “Everyone here talks like a man,” a soldier said, “but no one fights like one. ” There was a note of false modesty in this quip. In fact, for centuries Kurds have fought famously, taking on all comers: Persians, Ottomans, Arabs, British and the various governments of Iraq. A diffuse institution  —   “more an attitude than an army,” as one Kurd put it  —   the pesh merga today contain anywhere from several tens of thousands to about a hundred thousand fighters, depending on who’s counting and how proud he’s feeling. Many are volunteers. Only some of them have training that would warrant the name in a major military. The one thing they all share is that they are willing to die for their land. If their tactics are negligible  —   and sometimes as suicidal as those of the jihadists  —   their bravery is not. The pesh merga are commanded by Massoud Barzani, president of the Kurdish regional government. When ISIS overran Mosul in June 2014, Barzani offered the help of his army to Prime Minister Nuri Kamal   who snubbed him. It was assumed Maliki worried that Barzani intended to annex whatever land his troops took. Maliki’s successor, Haider   may have delayed the invasion of Mosul for the same reason. But earlier this year, Barzani, Abadi and the international coalition arrived at an agreement that called for the Kurdish forces to halt their advance at Bashiqa. About six miles from the eastern outskirts of Mosul, Bashiqa was inhabited largely by Christians, Kurds and members of the Yazidi minority, most of whom fled when ISIS arrived. The city presented an added political wrinkle in the war because it is in the “disputed territories,” land claimed by both Iraq and the Kurdish regional government. Certain Kurds, mainly older ones, consider Mosul theirs, too. Partly for this reason  —   but more because they’re accustomed to fighting against the Iraqi military, not alongside it  —   some pesh merga worried they would be attacked, or at least mistreated, by Iraqi soldiers when the two forces met on the front lines. Speculation about a sequel war between Kurdistan and Iraq was (and still is) commonplace. But so far relations were cordial, and the Iraqi military, knowing it would have its hands full with the close combat in Mosul’s ancient streets, was content to leave the Bashiqa campaign to the Kurds. “This war is very different for us Kurds,” Barzani’s brother, Sihad Barzani, explained several days after the campaign began. “This is the first time we’ve seen airstrikes that we’re not afraid of. This is the first time the Iraqi Army is not trying to kill us  —   and we’re not trying to kill them. We hope it stays this way. ” He was in a large abandoned house that the pesh merga had commandeered and turned into a field headquarters on the periphery of Bashiqa. The march had brought them to the limits of the city. They had not yet entered, but they had it surrounded. “ISIS has no escape. They will have to die now. ” The Barzanis are de facto royalty in Kurdistan. Massoud and Sihad’s father, Mustafa, the patriarch of the incipient Iraqi Kurdish republic, led its revolution against Iraq until his death in 1979. It’s common to meet pesh merga with tattoos of Mustafa’s portrait. As Sihad stepped from the house, a young soldier lifted up his shirt to reveal the face of Mustafa, with his thick black mustache and checkered red head scarf, sprawled across his back. Sihad looked on approvingly. Asked how many of his own family members were fighting ISIS, he gestured at the soldiers gathered in the courtyard and said, “They’re all my family. ” The Tigris River valley is dotted with villages and olive groves. The ISIS fighters inhabiting it were experienced and disciplined. What they lacked in munitions they made up for in patience, as the pesh merga had learned. Some Kurds had developed a reluctant respect for their adversary. “They fight as if they want to die,” it was often said. The night before, the jihadists had told the residents of Buharbuq, an   village near Bashiqa, to be ready to leave at 6 a. m. for Mosul. The intent was obvious: They would be used as human shields. In the middle of the night, the village fled en masse. After leaving the headquarters, Barzani’s convoy passed the refugee caravan, 80 or so cars and trucks stretched along a roadside. The residents of Buharbuq had taken everyone and everything they could: children, mattresses, blankets, grandmothers, pots, buckets, sheep, chickens. One truck contained a motorized wheelchair, another seven newborn lambs. The women were still dressed according to ISIS decree, fully covered in black hijabs and abayas. Officers with the Asayish, a Kurdish internal security agency, met the villagers on the road with a fleet of buses that would take them to a   camp. A soldier pulled up with a freight truck full of crackers and water. “All of our life is wasted in this ISIS mess,” a woman waiting in line said to her husband. “I feel a hundred years old. I hope ISIS goes to hell, then rots in hell. ” “I’m so tired,” her husband replied. There were heartsick roadside reunions. Two old classmates, one a pesh merga who had fled Buharbuq, the other a shop owner who had stayed, hugged for the first time in two years. “Life was very bitter,” the shop owner told his friend. He pulled from his pocket a   note, less than a dollar. “This is all my money. ” A young man found his mother. She clung to his neck and wept and kissed his face again and again. “Thank God,” she muttered. “Thank God. ” Perhaps the bravest pesh merga are the drivers of earthmovers, who toil mere yards from ISIS positions. They are bombed, mortared, rocketed and sniped, all the while doing astonishingly fast work. Within two days of setting off toward Bashiqa, they had turned the valley into a grid of berms and trenches that prevented an ISIS breakout and cut off the group’s supply lines. About 4, 000 Kurdish soldiers now occupied 100 positions and small encampments. The main camp was presided over by Barham Arif, one of the youngest and most respected generals in the pesh merga. Tall and taciturn, he led his men into battle in a jaunty     MRAP with a GoPro camera   to the hood. “ISIS is not smart and not brave, but they brainwash stupid people,” Arif said. “They give drugs to their fighters. They fight for 20 minutes and then run away. ” For months, Arif had lived with his men on the pesh merga’s stalemated front line, on the ridge of Bashiqa Mountain, overlooking the valley. A modest cult of personality had formed around the general, and his camp was home to foreign volunteers and soldiers of fortune. There were American medics, a Brazilian and Czech videographer couple and, constantly at Arif’s side, a   Scottish   sniper in spectacles. On Facebook, under employer, he listed “pesh merga. ” Generations of Kurds also converged in the camp. A few soldiers were in their 20s. Most were in their 30s, 40s and 50s. One soldier who had come down from the mountain with Arif was Kaefe Ahmed. Ahmed’s father, also a pesh merga fighter, was killed by Iraqi soldiers when Ahmed was 4. Ten other family members had died in war. Ahmed refused to wear a camouflage uniform because, he said, “for decades the Iraqi Army destroyed our land with these uniforms. ” He had fought for more than 20 of his 37 years: in the Kurdish civil war, against Saddam Hussein’s forces and now against ISIS. He and his cousin Robar Ali were in a unit with a   group of men, some of them related. When ISIS entered Mosul, they fought on its outskirts, before the pesh merga were ordered to withdraw. Had ISIS stopped there, Ahmed and Ali, like most Iraqi Kurds, wouldn’t have worried much about the jihadists living nearby. This was a conflict among Arabs, they felt, and at first ISIS was better than Saddam’s Baathists ever were. “In the beginning, the ISIS fighters were generally good with people,” Ahmed said. But then ISIS pushed into Kurdistan. Ahmed and Ali fought them in Sinjar, and then in Bashiqa, before it was overrun. The fighting there was particularly bitter. “They’re suicidal,” he said. The oldest soldier in the camp, as far as anyone knew, was a man named Jamil Rashid. When asked about his age, he first said, “A lot. ” Later offerings ranged from 61 to 78. Asked how many battles he’d fought in over the years, he said, “That notebook does not have enough paper to write them all down. ” He ate what food local   brought to the camp and slept wrapped in a thin blanket in a ditch. Five of his sons were in the pesh merga. One had recently been killed by ISIS. He had more grandchildren than he cared to count. “ISIS is nothing  —   they’ve been around for two years,” said Rashid, who was fond of listing, in the profanest terms possible, the Iraqi premiers whose regimes he’d fought against. “Abd   Qasim”  —   the Iraqi prime minister of the early 1960s. “I screwed his mother. Then there was Ahmed Hassan   and then Saddam, and then Nuri  . He was a bad guy. And now  —   what’s his name again?” “Abadi,” a young soldier said. “Right, Abadi. I fought all of them on this holy ground  —   for this holy ground. Our mud is holy. Whoever doesn’t fight for his land takes it in the [expletive]. This land is so precious. ” “Why are you talking about history, Jamil?” another young soldier asked him. “We’re supposed to be discussing now. ” “So what if I talk about history?” Rashid said. “It’s all the same, history and now. ” On Tuesday morning, Arif’s men prepared to assault Omar Qapchi, a village barely a   from his camp that was still under ISIS control. A commander had got hold of some villagers on a cellphone and was telling them what to do when the fighting started. “Stay together, don’t separate,” he said. “If you see any ISIS, call this number. Take care of yourselves. We’re coming. ” The armored personnel carriers and tanks and trucks filled up in moments. Far more soldiers wanted to take part in the assault than there was space in vehicles. Omar Qapchi, spreading about a mile down a slope that ended in an arterial road at the foot of Bashiqa Mountain, was made up of tightly packed   and   homes. Near its western gate, the column split into three smaller convoys. Arif’s convoy cut across a field toward the road. Though the ground was known to be full of I. E. D. s, some pesh merga cut one another off as they careered over suspicious patches of dirt and objects, racing to get into the action. When the convoy reached the road, muzzle flashes appeared in windows, and bullets whizzed by. The pesh merga strafed the buildings with   fire and grenades. At the eastern gate, the convoy hooked into the village. The streets were empty. From the residents who had phoned, it was known that about a dozen ISIS fighters were somewhere in the village. The convoy raced into the village center and suddenly found itself in a firefight with a contingent of ISIS gunmen, who, surrounded, had taken a stand at one end of a short, wide alley. The soldiers, on the other end, jumped from their vehicles, piled into the alley  —   directly in the line of fire  —   and began shooting back. There was little aiming but a lot of yelling. One man stepped into the alley with a grenade launcher. He pulled the trigger. Nothing happened. He held the rocket inches from his nose and looked at it quizzically. As bullets hit the dirt near his feet, he slowly peeled off a piece of plastic wrapping, then lifted the launcher back onto his shoulder and tried again. This time it fired. The ISIS fighters took to their heels, and the soldiers, among them Ahmed, gave chase, eventually cornering several jihadists in a mosque. One detonated a suicide vest another was sheared in half by a rocket. By the end of the day, eight of them had died, three had escaped and one was captured. Three pesh merga sustained minor wounds. Rather than going on foot from house to house to make sure the village was cleared, they gathered outside it and celebrated. “I think I killed someone,” Rashid said. “It would be a shame if I shot my rifle and didn’t kill anyone. ” Two days later, the wind at their backs, Arif’s men moved on Faziliya, a neighboring village. The road to the village was littered with I. E. D. s, which sent up showers of gravel and tarmac. On the wall of a kiosk at the entrance to the village was  : “Every ISIS man who dies goes to paradise. ” An ISIS flag fluttered on a fence post, but the roofs of the houses, which ranged steeply up the foot of the mountain, bore newly hung white flags: The town’s residents were eagerly awaiting the pesh merga’s arrival. Then gun and rocket fire erupted from a small, windowed spire on a building near the road. A tank reduced the building to smoking rubble. The people of Faziliya streamed from their homes and into the streets. They patted their heads  —   a Kurdish gesture of welcome  —   and kissed the soldiers. Children chanted: “Long live pesh merga! Long live pesh merga!” In the village square, a group of boys tore down an ISIS billboard. Soldiers shot off celebratory rounds. “Who has cigarettes?” a man asked the soldiers. “We want to smoke!” A soldier found his wife and children  —   their first meeting in more than two years. His mother emerged. She took hold of her son. They sank to the ground in an embrace, their tears streaming together. Back at Omar Qapchi, the few residents who had remained for the battle were gathered outside the village next to a caged soccer pitch, where they awaited interrogation by the soldiers and Asayish officers. An elderly woman wanted to know where her brother was. A rocket had destroyed his house, and he was nowhere to be seen. “He’s dead,” a neighbor of hers explained, out of earshot, “but she hasn’t found out yet. ” An officer had already determined that one resident was allied with ISIS. The man was dragged from the group, his hands bound behind his back with a scarf. A green knit face mask was pulled down over his eyes, and he was forced to the ground. He pleaded his innocence. “Shut up, you imbecile!” a soldier yelled at him. “It’s obvious he’s ISIS,” another soldier said. “Just look at his color. He’s taken on the jihadists’ color. ” “I’m not with ISIS, I swear!” the prisoner said. “I’m a Kurd!” “Shut up or I’ll stuff this down your throat!” the first soldier said, jabbing his rifle’s stock in the man’s face. The officer was from Omar Qapchi and had fled the village as ISIS approached it in 2014. From his friends who had stayed, he had heard that the prisoner had driven an ambulance for the jihadists. His son, they said, was with ISIS, too. “I haven’t done anything!” the prisoner protested. “I was just told to drive somewhere. ” “Hit him already,” another soldier said. The prisoner’s son, his hands also bound and face covered, was pushed down beside his father. “My son is a student in Bashiqa,” the father said. “I’ll tell you anything about him. Please don’t put the gun to his head. ” “I’m just following orders,” the soldier said. “Don’t worry,” said an Asayish commander who had arrived on the scene. “We don’t know if he’s ISIS. We have to investigate. ” “You’ve humiliated my son!” “So are you saying your son is ISIS or not?” the soldier asked. “He’s a student! He’s in ninth grade!” They were bundled into the bed of a pickup and driven away. The Islamic State, the pesh merga knew, hadn’t conquered such large swaths of the country with weapons alone. It had won sympathy among many Sunni Muslims who felt neglected by Iraq’s   national government and abused by security forces. ISIS promised them protection and pride. Many of them saw ISIS as a way out of an already miserable existence. In a   camp near Khazer, another   town, an elderly farmer who’d fled the village of Topzawa, not far from Bashiqa, which the Iraqi military had taken a few days before, talked about the jihadists fondly. “Most of the young men who joined ISIS were poor,” he said. “They needed the money. They had no other options. ” He confessed that he had come to know some of the ISIS men in Topzawa well. They weren’t foreigners, but Iraqis, ordinary ones. They were kind. They allowed him to travel wherever he wanted to sell his produce. He didn’t mind that the women in his family had to put on more clothing, and he wore a beard anyway. They treated his wife and daughters with the respect that Islam required. “At the beginning of Islam, with Muhammad, there were good rules. But with democracy, there are no rules. I’m a fair person. I believe in justice. But there are rules in Islam. No one can change them. Not you, not me, not anyone. “ISIS treated us as though we were free,” he went on. “We felt secure under them. In the final battle, they conducted themselves honorably. They fought until they died. ” The Iraqi Army, by contrast, relied on foreign airstrikes. The bombs had killed 20 of his sheep, 10 of his chickens and 10 dogs, and when the soldiers finally arrived, they were “very, very bad. ” They forced him from his home and made him come to this camp, where he endured humiliations. His hands were bound. “They attacked my honor. They told me my wife and daughters had been raped by ISIS. I was disgraced. I wanted to kill myself. ” Two weeks after the Bashiqa campaign began, President Barzani still hadn’t given the order to attack the city itself. Rumors about what would be found in it expanded by the day. The number of ISIS fighters supposedly hiding out there crept upward. There would be no end of I. E. D. s, people said, of suicide   of snipers. There would be tunnels everywhere. At General Arif’s camp, the berms had grown taller and the foxholes deeper. ISIS fighters had attacked by night, and by day they lobbed in mortar rounds and handcrafted missiles. Jamil Rashid spoke with a group of younger soldiers as gunfire rang out. “This is nothing,” he said. “It’s air. I like the sound of it. ” Finally, the order was given. The night before the assault, Arif’s troops gathered on the mountain above Bashiqa, in their old position. Ahmed and his cousin Ali were part of group of about 30 men who would descend the slope and enter Bashiqa on foot. In the morning, an armored column collected on a road outside the city. Sihad Barzani arrived to wish them luck. “We must move, but slowly,” he said. For six hours, the column crept toward the city, while airstrikes and artillery pummeled it. As they waited, soldiers checked for news of the American election, the next day, on their phones. Word came down that a sniper was holed up somewhere inside. He had already killed one soldier and wounded four. On the access road into the city’s east end, which climbed up the mountainside, the column drove by a pesh merga bulldozer in flames, the driver incinerated in the cab. As in Omar Qapchi, the streets were quiet. But as the vehicles turned by a small park, a   grenade flew at it. Its orange fireball and white smoke trail, visible for less than a second, were terribly beautiful. The rocket exploded against the low concrete wall of the park. Another quickly followed behind it. The column made it to a central plaza. A handsome old church with a suspicious tower was peppered with   fire and artillery. Jamil Rashid hopped from the front seat of a truck and took up a position outside the church. Standing in the open, his rifle dangling by his leg, he looked around and breathed in the scent of gun smoke, beaming. The column turned back along the same road it had entered. But now there was an empty white sedan in the middle of an intersection. Was this a car bomb? A roadblock? Had some innocent tried to flee and suffered a breakdown? The driver of the lead tank stuck his head from the turret hatch. A shot cracked the air, its tone higher and sharper than that of a Kalashnikov. Blood sprayed from the driver’s head. He slumped over the turret. His crew mates began screaming and crying. Panic passed down the line. “Sniper! Sniper!” The column reversed course, honking and   and labored back to the plaza. The tank sped from the city by a different route. At the staging point, the driver’s body was lifted out and put in an ambulance. His friends bent over the tank’s side skirt and knelt in the dirt, weeping. Before the driver was shot, Ahmed, Ali and their detachment had descended into the same side of the city on foot. They came under fire, retreated back uphill and took up a position. A   crack. Ali lurched forward, falling over Ahmed’s leg. Ahmed thought his cousin had tripped. Then he saw the blood. Three days later, Ahmed was worrying a string of wooden prayer beads in a mosque in his and Ali’s hometown, Rawanduz, in Kurdistan’s eastern mountains. He sat by the muezzin, who sang a death prayer for Ali, a Quran open before him on a desk stand. Old pesh merga in traditional dress and younger ones in suits and jeans filed in. They greeted Ali’s father and Ahmed, their hands to their chests, saying: “May he rest in peace” and “May God forgive him his sins. ” After the service, long rugs were spread on the floor, and Ahmed and the men from his unit sat down to lunch. Their part in the fight against ISIS was over, for now. Bashiqa was liberated, and the Kurdish line stopped there. But the war against ISIS was not going well for the Iraqi Army, which was still stuck on Mosul’s outskirts, taking a lot of casualties. “It will be a heavy fight,” one man said. Ahmed and his friends would fight in Mosul if they were ordered to, they agreed, but they wouldn’t like it. They were not among the Kurds who considered the city part of the homeland. “Is it fair that a Kurd should die for an Arab?” Ahmed said. Anyway, history had taught them that another war would come soon enough. “Once you finish one fight, they prepare another one for you,” a soldier said. “It makes you tired. ”'"}, "time": 1742561675.915857}