{"duration": 0.09890627861022949, "input_args": {"text": "'You’re at the checkout counter. Your items have been bagged. Your credit card is in your hand. Do you swipe it or insert it? The question has become vexing enough in the United States that a plea from one Twitter user for the country to “get on the same page” has become the unofficial, albeit vulgar, mantra of the nation’s consumers, with tens of thousands of retweets and likes. Ten months into the transition to chip cards, it’s clear there’s no going back. But as the national frustration grows, here are answers to some burning questions. There is reason to hope. About 75 percent of credit cards are  . If all businesses upgraded their terminals  —   which they are not required to do by law  —   at least the confusion over whether to swipe or insert would be settled. So far, about   of the nation’s merchants have made the transition, said Jason Oxman, chief executive of Electronic Transactions Association, a trade group for companies that deal with payment products and services. But while many of them have the terminals, they are waiting to get them certified for use, said Jared Drieling, the business intelligence manager for the Strawhecker Group, a consulting company for the industry. Technological improvements generally make things easier, but that’s not what this change is about. The longer wait times at checkout occur because of all  these steps in the process: • The chip creates a   code. • The payment terminal sends it to the bank. • The bank matches it to an identical   code. • The bank then sends back verification. Voilà! The good news: New software is being developed to allow chip cards to be inserted and quickly removed, speeding up the process, Mr. Drieling said. Security. “You can’t counterfeit a chip card,” Mr. Oxman said. “You can very easily counterfeit a strip card. ” Financial institutions changed the rules attached to their terminals last year. Now, if a counterfeit card is used because a merchant doesn’t have the technology to process   cards, the merchant is responsible for paying the fraudulent charges. Businesses that sell goods, like electronics, that can be easily resold on the black market are often targeted by people with fraudulent cards. Because of that, they have a lot of motivation to upgrade. If they don’t, they must pay the bill for all those purchases. “But the local coffee shop might not be getting a lot of fraud activity,” Mr. Oxman said, so there’s less motivation to get the new terminals. There is a chance, then, that at the onset of a purchase, you’ll never really know whether to swipe or dip. Get used to it. “The loud, annoying beep that you’re referring to is to remind you to take the card out,” Mr. Oxman said. “The goal of the noise is to get your attention, and it sounds like it’s working. ” But as Kathleen Dunn, 27, of Nashville pointed out, the sound rings of rejection. “I hate the noise. It makes me feel like my card got declined, and I panic every time,” Ms. Dunn said via a message on Twitter. Dieter Bohn, the executive editor of The Verge, a technology site, characterized the situation as a “checkout dance” in an article. That dance is caused in part by the fact that many places that have the new terminals can’t use the chip reader technology yet. They’re not broken  —   they’re just waiting to be certified, and that process can sometimes take months. Until then, retailers are responsible for any fraudulent charges, and they’re not happy about it. It’s likely, but their transition is long in the past now. “We’re really one of the last G20 nations to adopt E. M. V. ,” said Mr. Drieling, referring to the chip technology by an acronym for Europay, MasterCard and Visa, the technology’s early advocates. The chips work a little differently in the 150 other countries using them: The cardholder also enters a PIN at the terminal, which lets the verification process happen offline, Mr. Oxman said. Banks and retailers are at odds over why the United States isn’t adopting the PIN system. Why it has taken so long to adopt the chip technology in the United States has a lot to do with its bigger and more complex market. “Changing it is a huge undertaking,” Mr. Oxman said. Probably not much longer. Most of the new terminals that accept the   cards are also equipped with the technology to accept contactless payments, like Apple Pay or Android Pay. And while there is disagreement about whether mobile wallets are  faster than chip cards, mobile payment makes it feel as if the transaction is moving more quickly. “There is a perfect storm brewing for mobile wallets,” Mr. Drieling said. Until then, perhaps you can use that extra time at the checkout counter to commiserate with the cashier. “I always bring it up during the awkward silence caused by the amount of time the chip takes to read,” Ross Schickler, 19, of Springfield, N. J. said in a Twitter message. “They always laugh and agree. ”'"}, "time": 1742561653.7229087}