{"duration": 0.15190434455871582, "input_args": {"text": "'Next Cold War Roundup 11/23/16: The official story of how the 3 US Green Berets were killed in Jordan has been disputed. Iraqi militias completed the encirclement of Mosul. The USS Zumwalt broke down again in the Panama Canal. And more in our latest Next Cold War roundup…\\n3 Green Beret Soldiers Killed in Jordan _ By Jack Murphy, Army special operations veteran and editor of SOFREP: “Three Green Berets killed by ISIS infiltrator after CIA ignored warnings.” Green Berets Matthew Lewellen, Kevin McEnroe, and James Moriarty were on an inter-agency mission in Jordan, part of the CIA “Timber Sycamore” covert operation “to train and arm so-called moderate Syrian rebels.” Murphy’s Special Forces (SF) contacts said the official story is not true. It wasn’t an accident. It was a planned, deliberate attack by an ISIS sympathizer who was either a Jordanian military guard or one of the “moderate” rebels the SF are training.\\n_ Special Forces soldiers have complained “repeatedly” that the CIA vetting is “dubious at best” and the so called moderate rebels coming into the the training program “were actually ISIS and al-Nusra infiltrators.” The “CIA’s para-military component, called Ground Branch” have made the same complaints, all of which have been ignored. It’s illegal to provide support to terrorist organizations but there are some ways to override that law using loopholes that require very high level approval from the Secretary of State, Attorney General and the White House.\\nSyrian Rebels Have MANPADs in Southern Syria _ Syrian rebels from the “Ansar al-Islam Front and factions of the FSA” have published a video demonstrating SA-7 MANPADS shoulder-launch missiles. Middle East Eye speculates that the supply of MANPADS might indicate that the US has changed their policy of prohibiting distribution of these weapons because one of their high-level rebel sources said, in September, that this would happen if Syria and Russia increased their attacks on Aleppo. The source said: “Rebels are being told only to target Syrian helicopters, not Russian – but it’s not clear they will abide by this.”\\n\\n_ Al Masdar News reports the Syrian army and local fighters have made gains in the province of Quneitra, near the Golan Heights.\\nMosul _ Iraqi foreign minister al-Jaafari announced that one third of Mosul has been liberated from ISIS. 1000 ISIS fighters were killed and 650 captured.\\n_ The Iraqi Popular Mobilization Units (PMU), also known as Shiite militias though not all the soldiers are Shia, have completed the encirclement of Mosul . “The PMU reached Peshmerga positions in Sino and cut off the last ISIS-controlled road linking Mosul with the rest of Iraq.” They will now continue operations in Tal Afar, near the Syrian border.\\nAnother Zumwalt Breakdown _ The Navy’s newest ship, the USS Zumwalt, broke down again , for the second time in 2 months, this time while passing through the Panama Canal.\\nTurkish Coup: NATO Officers Seeking Asylum _ NATO Secretary-General Jen Stoltenberg confirmed that some Turkish military officers within the NATO command structure are seeking asylum in the countries where they were stationed. He did not provide any specifics on the asylum requests. Turkish Pres. Erdogan said the number was not high.\\n_ Turkey’s crackdown after the failed coup attempt continues and they have made many changes to their own NATO personnel . Stoltenberg said : “I think Turkey will fill these places. It is up to Turkey who will be appointed here.”\\n_ Stoltenberg traveled to Istanbul on Sunday for the annual NATO Parliamentary Assembly session and will meet with Erdogan on Monday.\\n_ 38-40 Turkish officers in Germany, ranking “from non-commissioned officer to colonel” applied for asylum, per Hurriyet’s Turkish military sources . German media DW reported “ close to 60 Turkish nationals holding diplomatic passports ” stayed in Germany when they were summoned or due to return to Turkey, and the majority of those were military personnel (and some family members) from NATO bases.\\n_ At least 2 Turkish officers at NATO headquarters in Brussels requested asylum. 41 of the 50 Turkish military personnel in Brussels were “withdrawn from duty” and Turkey has not yet replaced them.\\n_ On Sunday, Erdogan said : “How can a terrorist, a terrorist soldier, a soldier who has been involved in plotting a coup, be employed in NATO? […] NATO cannot entertain accepting asylum requests of this kind.”\\n_ More than 400 Turkish military and staff were summoned back to Turkey after the coup attempt but some chose not to return, claiming that colleagues who did return were arrested.\\nSyria: De Mistura’s Proposal for Aleppo _ UN envoy Staffan de Mistura proposed that the Syrian government grant autonomy to East Aleppo “in exchange for peace” and he called for the al Qaeda affiliated rebels to leave East Aleppo and go to other rebel-held parts of Syria. The Syrian foreign minister, Foreign Minister Walid al-Moallem, rejected the proposal and said state institutions should be restored across the city and that Syria would not let the people of East Aleppo remain “hostages to 6,000 gunmen […] “We agreed on the need that terrorists should get out of east Aleppo to end the suffering of the civilians in the city.”\\n_ Retired Col. Pat Lang’s response to de Mistura’s proposal: “Say what?” In speculating why de Mistura would do this: “The barrel bombing and hospital destruction memes are not having the desired effect and the “White Helmet” farce has been thoroughly debunked, so something else had to be tried.”\\n_ Moallem welcomed Syrian-to-Syrian talks without foreign influence but de Mistura couldn’t offer help with that, nor could he guarantee a ceasefire.\\n_ De Mistura has made offers to the jihadis in East Aleppo before, including an offer to personally escort them (with their weapons) from the city. The jihadis refused to leave and said they would fight to the death and they continue to shell the government-held West Aleppo, killing 8 school children and a teacher in recent days.\\nSyria: Rebels Continue to Shell Government-Held West Aleppo _ The original headline of this BBC article was “Syria war: Aleppo rebel attack on school kills seven children.” The headline was changed to: “Syria war: Aleppo self-rule rejected by government.” The text of the article changed significantly too, as demonstrated by this comparison tool .\\nSyria: Nusra-Led Rebels Deny Civilian Exit _ The pro-rebel Syrian Observatory for Human Rights has confirmed that the al Nusra-led rebels “are actually blocking the civilians from getting out”of East Aleppo.\\n_ Anti-war.com also reports that the Associated Press has spoken to people whose relatives have told them that the rebels told civilians who decided to leave to do it at night for safety reasons. Then when the civilians approached the crossing, the rebels opened fire on them. Food shortages in East Aleppo are caused by rebels hoarding aid supplies, according to the Syrian army. The rebels deny this.\\nSyria: ISIS Weakening at Deir Ezzor _ ISIS position in Deir Ezzor is weakening . Both the Syrian and Russian air forces have been bombing ISIS in and around Deir Ezzor. They also have ground forces in the area. ISIS manpower is affected by the battles in Mosul and Raqqa.\\n_ ISIS continues to launch offensives on the Syrian army position, and Al Masdar reports that despite repeated offensives, ISIS has not been able to make any significant advances on the Syrian army positions at “Al-Jafra Farms and Deir Ezzor Airport.”\\nSyria: Al-Bab _ Syrian foreign minister Al-Moallem said Turkish forces were violating Syria’s sovereignty: “We cannot accept to have one Turkish soldier to remain on Syria’s land.”\\nHalifax Security Forum _ Turkey’s EU affairs minister, Omer Celik, criticized Turkey’s NATO allies on Saturday while at the Halifax Security Forum in Canada, and while accompanied by French Defense Minister Jean-Yves Le Drian, retired US Gen. John Allen, and US Senator John McCain:\\nCelik : “Iran and Russia intervened in Syria, made a lot of mistakes, and caused the deaths of many people. As NATO allies, do we have a consensus on [reaching] a solution in Syria? […] Turkey proposed a no-fly zone, [but] our allies did not support that. We asked for safe zones, our allies did not support that. We said let’s fight terrorist groups, our allies did not support that. Our NATO allies are not showing solidarity with Turkey.”\\nWar and Elections _ Doug Bandow for Forbes: “ President-Elect Donald Trump: Stay Out Of Syria .” Bandow notes that “American politicians are still attempting to drag America into another tragic, bloody Middle Eastern conflict” and to do so would be “madness” but like Obama, Trump is surrounded by allies and advisors who are militaristic. Bandow calls out “ivory tower warriors” like Charles Lister and Thanassis Cambanis. “Washington has a half dozen or more conflicting goals, none of are important enough to warrant the use of force.”\\n_ From October, a profile of retired Gen. Michael Flynn, Trump’s choice for national security advisor: “ How Mike Flynn Became America’s Angriest General .” “He was one of the most respected intelligence officers of his generation. Now he’s Donald Trump’s national security alter ego, goading a crowd to lock Hillary Clinton up. What happened?”\\n_ Robert Parry: “ Trump’s Tulsi Gabbard Factor .” Parry says that Gabbard might be a signal that Trump intends to do a major break with the neocon foreign policy establishment, moving toward a more libertarian stance, but his choice for Secretary of State will be the biggest tell. If it’s someone like Romney, Giuliani or Bolton, the neocons “can breathe a sigh of relief.”\\nAnalysis and Opinion _ DW interview with researcher Siemon Wezeman: “ Diplomacy and war games in the global arms trade .” “Moscow and Washington are rivals once again, using arms exports to boost their allies and frustrate each other’s plans. The two countries are also renewing their own nuclear arsenals.” Wezeman says that Russia is trying improve relations with Arab countries and sell them weapons but Gulf countries aren’t likely to buy from Russia if Russia sells to Iran.\\n_ Nassim Nicholas Taleb, “ Syria and the Statistics of War : Trust none of what you hear, some of what you read, and half of what you see.”\\nTaleb: “I see propagandists and Al Qaeda apologists such as Charles Lister (at the Salafi-funded Middle East Institute) throw numbers that get cited –yes, some idiot will cite numbers from the Al Qaeda propagandist Charles Lister, and may eventually be cited in turn by some decent newspaper, hence get fixed for posterity.”\\nThe post Green Berets Casualties in Jordan Story Disputed; Mosul Siege Completed; Zumwalt Broke Down Again appeared first on Shadowproof .\\n'"}, "time": 1742562435.0263293}