{"duration": 0.041075706481933594, "input_args": {"text": "'With the media gripped by accusatory speculation regarding the identity of the source behind the Wikileaks leak of hacked Podesta and DNC emails, much of it focused on Russia, a new theory has emerged from Craig Murray, the former British ambassador to Uzbekistan, who tells Sputnik (a Russian media outlet) that the source of the leaks are not Russian hackers but a Washington insider. \\nVia TheAntiMedia \\n\\n“The source of these emails and leaks has nothing to do with Russia at all. I discovered what the source was when I attended the Sam Adam’s whistleblower award in Washington. The source of these emails comes from within official circles in Washington DC. You should look to Washington not to Moscow.”\\nAsked about whether or not WikiLeaks have ever published information at the behest of Moscow, Murray said that “WikiLeaks has never published any material received from the Russian government or from any proxy of the Russian government. It’s simply a completely untrue claim designed to divert attention from the content of the material.”\\nWhile blasted by Washington, first by Republicans several years ago, and most recently by Democrats, the WikiLeaks revelations have often been hailed as a champion of accountability.\\n“I think whistleblowers have become extremely important in the West because the propaganda model — as Chomsky puts it — has been reinforced to the extent that people don’t get any true information out of the media at all. It’s worth saying that Julian Assange and WikiLeaks are publishers; they publish what whistleblowers leak to them,” Mr. Murrary told Sputnik.\\nYet, whistleblowers in the US continue to be subject to lengthy prison sentences. A key example is Chelsea Manning, who was sentenced on August 21, 2013 to a thirty five year sentence for providing WikiLeaks with sensitive military and diplomatic documents highlighting, among other things, US military conduct in Iraq. Murray also mentions the case of John Kiriakou, a former investigator of international terrorism with the CIA who turned whistleblower.\\n“The people who did the torture have suffered no comeback at all,” adds Mr. Murray.\\nTaking a step back and discussing the risk of geopolitical escalation between Russia and the US, Murray told Sputnik that “there is no chance whatsoever that Russia is going to ever attack the United States, that simply isn’t going to happen.”\\n“Just as Russia is not going to attack the United Kingdom. There never has been a chance that Russia would ever attack either of these two countries. But of course the narrative is all to do with power and funneling huge amounts of American taxpayer money into the defense industry and the security industry and these people are both from the class that benefits.”\\nIt’s an extremely dangerous game, says Mr. Murray, and it feeds into a foreign policy that is completely mad.\\n“In Syria — and I should say I’m no fan of the Assad regime at all — but the idea that backing assorted groups of jihadists to tear the country apart is a better solution is crazy and it’s especially crazy when we’ve already messed up Iraq, Afghanistan and now we’re doing exactly the same thing again and you can see it doesn’t work, it only works in terms of promoting continued instability and continued spending for the military and the security services.”\\nFinally, Murray also believes that the public can’t get clear analysis of these issues from mainstream media, because they are part of the same money/power nexus.\\n'"}, "time": 1742561996.4262166}