{"duration": 0.11905407905578613, "input_args": {"text": "'Email \\nWith most of the attention in the presidential contest understandably focused on the major party candidacies of Donald Trump and Hillary Clinton, and to a lesser extent on the minor party efforts of Gary Johnson, the Libertarian, and Green Party hopeful Jill Stein, the independent campaign of Utah resident Evan McMullin (shown) is moving under the national radar. \\nBut he could throw the race into the House of Representatives for it to decide who becomes president. \\nUtah is normally a very reliable Republican state. But Republican nominee Donald Trump is not very popular in the Mormon-dominated state. This is contrary to 2012, when the Republican nominee, Mitt Romney, a prominent member of the Church of Jesus Christ of Latter-Day Saints (commonly known as Mormons because of their extra-biblical book The Book of Mormon ), ran — though Romney may have lost the election to Democrat Barack Obama when millions of evangelical Christians chose not to vote at all rather than vote for a Mormon. \\nIn states in which McMullin appears on the ballot, his candidacy is thought to be costing Trump dearly. McMullin has achieved ballot status in Colorado, Minnesota, Idaho, and South Carolina. He has also announced write-in efforts in Alaska, Montana, Tennessee, and West Virginia. \\nAnd since Trump is only trailing Clinton by two points in a recent poll in Colorado, the McMullin presence on the ballot could conceivably throw that state into the Clinton column. \\nIn Utah, however, McMullin could actually win, as Trump holds a mere 1-point margin over him in the most recent poll. Clinton is five points back. Were McMullin to actually prevail in Utah, it would be the first time since former Alabama Governor George Wallace carried five states in 1968 that a person other than a Democrat or a Republican has both carried a state, and received electoral votes. \\nA victory in Utah by McMullin, however, could do something that has not happened since 1824, when the House of Representatives chose John Quincy Adams over Andrew Jackson — send a presidential contest to Congress. The Constitution provides that should no candidate garner a majority of the vote in the Electoral College, then the House of Representatives shall choose the president. (If this occurred, we can expect the media will call it a “constitutional crisis,” which, of course, it would not be, since the 12th Amendment specifically provides for this method). \\nIt should be understood that a McMullin victory in Utah would not, by itself, give the election to Hillary Clinton. If McMullin actually carried Utah, then that would mean that Clinton did not carry it, and would therefore receive zero electoral votes in the state. The same thing could be said of Trump, of course. \\nAt the present time, if Trump carried Utah and all the states considered “toss ups” by the experts, he would have 266 electoral votes, and would lose the election to Clinton, as it takes 270 electoral votes or better to win the election. However, if Trump could then add the nine votes of Colorado to his column (where he is trailing by only two points to Clinton in the most recent poll), then he would be the victor, with 275 votes. Two other states in which Trump is within striking distance are Wisconsin and Virginia, where he is only behind five points in the most recent poll. Perhaps most interesting is Pennsylvania, where Trump is just three points down in the most recent poll. That state has 20 electoral votes, and a victory there would likely put him into the White House. \\nIf, for some reason, Trump and Clinton were to both receive 269 votes and tie, the election would also be thrown into the House of Representatives [the present House, not the one elected in November]. \\nOnce the election went to the House, it would appear at first glance that Donald Trump would be the winner. The 12th Amendment provides that each state’s delegation of members of the House of Representatives cast only one vote for the entire delegation — regardless of the number of members in the delegation. Thirty-three states have a Republican majority, as opposed to only 13 with Democratic majorities. Three states — Maine, New Hampshire, and New Jersey — are equally divided, and would presumably not be able to cast a vote for either candidate, unless a Democrat or a Republican abandoned their party’s nominee. \\nBut the members would be given a choice of the top three vote-getters in the Electoral College. In a 269-269 tie, with no one besides Clinton and Trump getting votes, the choice would be limited to only those two. However, in the unlikely scenario that McMullin has caused the election to land in the House because he carried Utah, denying either candidate a majority of the electoral college vote, this could lead to some horse-trading. \\nBecause McMullin is a Republican, having served as a former chief policy director for the House Republican Conference, could some Republicans consider casting their state’s lone vote for McMullin? With a 33-13 edge over the Democrats, it is clear that the Republicans, if they acted in concert, could give the presidency either to Trump, the actual Republican nominee, or they could choose McMullin. It is inconceivable that Clinton could win in this circumstance \\nWhile it is unlikely that McMullin will both win the state of Utah and “throw” the election into the House of Representatives, it is certainly possible . \\nBecause of this, it might be wise to know a little bit more about McMullin. \\nWhile there are certainly some things for constitutional conservatives to like about him, there are also some things about the 40-year-old Mormon that should raise some eyebrows. First of all, it is troubling that he seems to be aiming most of his fire at Trump. Perhaps he thinks he can win votes away from disgruntled Republicans who do not like the New York real estate tycoon, but little chance exists to win over a Clinton Democrat voter. \\n“Donald Trump is an absolutely horrendous, terrible candidate. He has no business representing the Republican Party, or being president of the United States,” McMullin told Brett Baier on Fox News Sunday. \\nMcMullin’s remarks about Trump personally are one thing — he has said, “I imagine there are dozens more of these women out there, sadly” — his differences with Trump on policy questions should certainly bear close scrutiny. He differs with Trump on trade, for example. He also told ABC News that Trump’s public comments about Muslims are damaging to U.S. counterterrorism efforts. “What he doesn’t realize,” McMullin said of Trump, “is that we actually depend on Muslims to do counterterrorism, to wage war against terrorists.” Echoing Hillary Clinton, McMullin said Trump was too close to Russian President Vladimir Putin. \\nIt appears that McMullin also differs with Trump at least somewhat, on immigration, saying he does not favor mass deportation, but he does support border security. Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742563010.0535295}