{"duration": 0.09907960891723633, "input_args": {"text": "'It was with some trepidation that I set out last week to try “Soundwalk 9:09,” a piece the Metropolitan Museum of Art commissioned from John Luther Adams, the Pulitzer   composer. Composed of sounds recorded in the area, the work is intended for people to listen to on their smartphones as they make the   walk between the museum’s mother ship, on Fifth Avenue, and its new outpost, the Met Breuer, in the old Whitney building on Madison Avenue. What if I did it wrong? The piece lasts nine minutes and nine seconds, because that’s how long it took Mr. Adams to make the trek. But he’s an avid runner. So should I   and risk arriving at the Breuer before it was over  —   or take my time but possibly run out of music too soon? Then there was a conundrum that I sadly agonize over with even the shortest, most routine of journeys: what route to take. This time, though, each choice really would matter: Listening to the piece on leafy Fifth Avenue, beside Central Park, would offer a very different experience from listening among the elegant jewelers and boutiques and eateries on Madison. Finally, I had to get over my longstanding aversion to wearing earphones while out and about in the city. As a lifelong New Yorker, I’ve never liked being taken out of my surroundings, preferring to rely on auditory cues for advance warning in case, say, a taxi were to jump the curb, or a street scuffle were to break out nearby, or the branch of an elm were to crack. But I was reassured by the composer himself, who wrote on the Met’s website that “these pieces are not complete until you are present  —   listening, walking your own route and creating your own unique mix with the sounds you encounter. ” So, not sure of what I was in for, I downloaded “Soundwalk” on the steps of the Met,   my wingtips and hit “play. ” The sound coming through my earbuds could have been tinkling wind chimes, followed by what reminded me of something I had as a kid, an old corrugated plastic tube that howled a ghostly, breathy high pitch when swung in circles. The sound bleeding in from the street? The theme music from “Rocky,” segueing into “If You’re Happy and You Know It,” played by a saxophonist seeking tips from the crowd on the museum steps. The live and recorded music blended so eerily that you could easily imagine Mr. Adams’s having scored his opening as a backing for the buskers. As I walked through the   atmosphere in front of the museum, a whole battery of noises came pouring in from the outside, soloing over Mr. Adams’s atmospherics: the splashing of the Met’s new fountains tour bus operators’ pushing tickets snippets of conversation in at least four languages hawkers of prints, magnets (“Six for $10! ”)    portraits. Food vendors, it turns out, favor repeated, rhythmic triplets: “Water for one dollar, one dollar, one dollar” was followed just steps later by an offer of “Cashew nut, cashew nut, cashew nut. ” Hearing the jumble of serendipitous noises fuse into something musical suddenly called to mind another work: John Cage’s infamous “4’33”. ” When I first heard about that piece  —   in which performers play nothing at all for four minutes and 33 seconds  —   it struck me as an elaborate     prank. But I came to be intrigued by Cage’s explanations of it, as when he wrote to a critic that it was not silent, but rather “full of sound, but sounds which I did not think of beforehand, which I hear for the first time the same time others hear. ” As I heard the improvised fugue of the Met’s street vendors, his idea began to make sense. The “Soundwalk” was the brainchild of Limor Tomer, the museum’s general manager of concerts and lectures, who was interested in linking the two buildings: one an established outpost, the other a   part of the Met franchise. The Met established a partnership with Q2, WQXR’s online station for contemporary classical music, which invited its listeners to record the sounds Mr. Adams used in the piece and then offered downloads of the finished product from its website. The Met said it could not say how many people had downloaded the work. For my excursion, since this was a piece by Mr. Adams  —   who lived for decades in Alaska, where he was an environmental activist as well as a composer, and whose Pulitzer   composition, “Become Ocean,” was inspired partly by his concerns about climate change  —   Fifth Avenue, under the green canopy of Central Park’s stately trees, seemed like far and away the best route. But the sounds inside and outside my earbuds made it clear that this was no nature preserve. The brakes of an M4 bus squeaked. Food cart generators rattled. Wait, was that siren real or recorded? (Recorded.) Squeals came from children in the park, playing what must have been disorganized sports in fields where signs warned, “No organized sports allowed. ” A   stand became an elaborate percussion instrument, with the staccato paradiddle of metal tongs clanging open the metal bin where the buns were kept, slamming it shut and then repeating the pattern on the metal bin where the franks were cooking. Then another siren, real this time. Turning east on 76th Street, I was distracted by some chirping sparrows, which sounded like some birds on the recording, and by a motorcyclist, when I was jolted out of my reverie. “This marble tombstone marked the resting place of one Abu Bakr ibn Ibrahim,” a woman was saying. I’d been too slow, and the Adams piece, which I had downloaded on Soundcloud, had been followed seamlessly by a track about one of the Met’s exhibitions. But even after I reached the Breuer, on Madison Avenue near 75th Street, I was not done. Mr. Adams, after all, had made two different versions of “Soundwalk,” one for people walking downtown, and one for people heading uptown. And since I don’t like to do things by half measures  —   why go to “Die Walküre” when you could see a whole “Ring” cycle?  —   I wanted to try both. Call it “Soundwalk 18:18. ” This time I’d stay on Madison and pick up the pace. As Mr. Adams’s otherworldly sounds began, they were punctuated almost immediately by a blaring car horn, from a black Mercedes   outside Travers Fine Jewelers. Then came a chorus of resonant express bus motors, doors being slammed shut by chauffeurs, workmen crumpling up the wrappers of their lunches as they sat on overturned   buckets, and kids eating ice cream outside E. A. T. But I didn’t slow down to savor it. I turned west on 81st Street, just before getting to the Frank E. Campbell Funeral Chapel, and ignored a rather quiet fashion shoot that was going on. I reached the Met, where I could hear the faint sound of a sax, just as the “Soundwalk” ended  —   nine minutes and nine seconds later.'"}, "time": 1742562168.6262329}