{"duration": 0.11612343788146973, "input_args": {"text": "'Email \\nSome eight to ten thousand refugees have been living in an improvised camp in Calais currently being demolished by French officials. All they’ve gotten from the French government so far has been tear gas and the bulldozers set to tear down the tents and shacks where they have survived amid the cold and mud thanks to the help of fellow refugees and humanitarian volunteers and organizations. The NGO Help Refugees said that as of 24 October it had a list of 1,028 “unaccompanied” children in the camp, 49 under the age of 13, one an 8-year-old boy. These are kids who lost their families at home, or were separated from them as they travelled across half the world thorough the most difficult and dangerous conditions imaginable. \\nMany of these children – about 40 percent, according to the NGO Terre d’Asile – came to Calais, on the English Channel, because they have family in the UK and are therefore legally entitled to asylum there. During the first ten months of this year, under public pressure, the UK admitted a grand total of 79. This came only after an enormous outcry among British people. A Parliamentary measure to admit all refugees under 13, sponsored by a prominent member of the House of Lords, who was himself given asylum in the UK as a 6-year-old fleeing the Nazi persecution of Jews, went largely ignored until the last week, when the British authorities finally let in 200. It took a strong protest from the British Dental Association to stop plans to x-ray the teeth of children claiming asylum to prove their age. Many other refugees in Calais are entitled to enter the UK because they have a spouse or other close relative to live with there, but neither the British nor French governments care to implement European Union laws and agreements. \\nThis is, in fact, official UK government policy. Prime Minister Theresa May was infamous for her rabidly anti-foreigner positions when she was Home Minister. She took the lead among her European counterparts in cutting off funding to Italian-led search and rescue operations in the Mediterranean, calling saving lives a “pull factor” for “threats we face”. \\nWhen the French police attacked and destroyed about half the Calais camp earlier this year, 129 children simply went missing. A Help Refugees spokeswoman says she fears this will happen again, since no government will take responsibility for these children. One reason that many people do not want to leave the camp is that they have built up ties, mutual-help networks and other arrangements that enable them to survive. They have no reason to believe that the French and other authorities who have displayed nothing but alternating neglect and brutality will offer an acceptable solution to their predicament. These kids reached Calais after travelling through many other countries whose governments were no more welcoming than France. \\nWhat will happen to these refugees when their camp is bulldozed? The plan is for them to be herded into buses, split up into small groups and sent to hundreds of “welcome centres” scattered across the country. Five of these centres have already been fire-bombed. Right now there are about 500 media people in Calais – NGO members say they fear that when the camera lights go out, refugees who have refused to get on a bus “voluntarily” will be attacked by security forces or the small fascist bands that a thousand police mysteriously cannot hold back sometimes. \\nThe biggest nationality group in the camp is people from Afghanistan, who literally crossed mountains and deserts to flee the mess the US and Nato made of their country. Under a recent agreement with the Western powers, the Afghan government is to accept the forcible return of its refugees in Europe, as many as hundreds of thousands. Ethiopians (whose government is closely allied with the US), Eritreans and other Africans are not generally considered deserving of refugee status. Trying to get by as an “illegal” immigrant is the most rational choice for many people, rather than applying for asylum, getting fingerprinted and maybe expelled. Some people have come to Calais seeking safety in numbers after being forced out of smaller camps in Paris and elsewhere. \\nThe people in Calais are not just some unfortunate anomaly, an exception that proves the rule that the world is OK. Their desperate presence tells the truth about an unacceptable world dominated by a handful of countries that have prospered at the expense of the vast majority of the planet’s people, through both plunder and war, and the normal workings of a global system of exploitation. The fact that there are 63.5 million refugees and displaced people in today’s world, according to the UN, is an irrefutable proof – only one of too many – that the capitalist-imperialist system does not work for humanity and the planet. \\nWhile the British, French and other European governments squabble among themselves about who should help which immigrants, each taking in as few as possible as slowly as possible, some people not only refuse to accept this inhumanity but take responsibility to do something about it. A middle aged, middle class woman in the French city of Nice, near Italy, heard on her car radio that French police were blocking the city’s train station to keep out refugees who had walked across the border. She dropped her daily schedule, went to the station, invited refugees into her car and drove them to train stations where the police would not be expecting them. Someone snitched on her and she was arrested and hit with a huge fine. Overnight hundreds of people sent her enough money to pay it. A New York Times article refers to “a French underground railroad, moving African migrants”. While lots of “citizen collaborators tip off the French police”, “a low-key network of citizen smugglers are countering police efforts in a quasi-clandestine resistance, angered by what they see as the French government’s inhumane response to the crisis.” (4 October 2016) The “migrant crisis” that governments today consider a police problem could become part of a political crisis, with big questions at stake about what kind of society people want, or will accept. \\nWhat do the imperialists, fighting amongst themselves to run this world, mean by the words “migrant crisis”? For them, it is a “crisis” that a few people have slipped into Europe, the UK, the US, Australia and other imperialist fortresses. To promote racism, they call the Calais camp “the jungle,” when their capitalist system has turned our planet into the dog-eat-dog place it is today. The real crisis is not Calais but the world. The system’s own workings are generating vast upheavals that no wall can hold back, and that cry out for the overthrow of this system in country after country. \\nPostcript 28 October \\nThe prefect in charge of evacuating the camp pronounced “Mission accomplished”, meaning that the site has been emptied and the riot police will not allow anyone to come back. The departure was hastened by massive fires consuming tents and shelters, which the prefect claimed trhe migrants themselves had set because it was a “custom” in their cultures. According to the 28 October Le Monde , about a hundred refugees are sleeping in the cold and rainy streets of Calais, some of them minors, with no place to go. \\nSome people who let seem to be very happy with their new lodgings, according to Le Monde and other media, but police are accompanying the buses taking them to nearly every corner of the country, with orders not to let anyone change their mind along the way. About 90 people were taken straight to jails, with no explanation as yet. \\nThis article originally appeared in A World to Win News Service, to which Sam Alber is a regular contributor. ( Web site: aworldtowinns.co.uk'"}, "time": 1742628318.4001026}