{"duration": 0.08523368835449219, "input_args": {"text": "'Update: Bank of America has also cancelled its sponsorship of New York City’s Public Theater, becoming the second sponsor to pull its support from the this summer’s season of Shakespeare in the Park. [“Bank of America supports art programs worldwide, including an   partnership with The Public Theater and Shakespeare in the Park,” a spokesperson for the company told the New York Daily News Sunday. “The Public Theater chose to present Julius Caesar in a way that was intended to provoke and offend. Had this intention been made known to us, we would have decided not to sponsor it. ”  Original story below: Delta Air Lines has cancelled its sponsorship of New York City’s Public Theater following backlash surrounding a Shakespeare in the Park production of Julius Caesar, a “contemporary” take on the classic play in which a Donald   twist on the titular character is graphically stabbed to death on stage. Breitbart News previously reported that this summer’s Oskar   production of Julius Caesar  —   which opened in previews last month in Central Park’s Delacorte Theater  —   had sparked controversy over its main character’s striking resemblance to President Trump. The character sports blonde,   hair and a business suit and tie, and his wife Calpurnia speaks with a Slavic accent, similar to that of First Lady Melania Trump. Video captured at a recent performance shows the   Caesar character graphically stabbed to death during the climax of the play. One attendee recently told Mediaite that the character’s resemblance to Trump made the assassination scene particularly “shocking and distasteful. ” In the wake of the controversy, Delta Airlines has reportedly cancelled its sponsorship of the Public Theater, which stages the free productions of Shakespeare in the Park. “No matter what your political stance may be, the graphic staging of Julius Caesar at this summer’s Free Shakespeare in the Park does not reflect Delta Air Lines’ values,” the company said in a statement Sunday. “Their artistic and creative direction crossed the line on the standards of good taste. We have notified them of our decision to end our sponsorship as the official airline of the Public Theater effective immediately,” the statement added. Other sponsors of the New York City’s Public Theater include American Express, the New York Times and Bank of America. The Delta sponsorship cancellation represents a blow to the Public Theater nearly two weeks after another controversy sparked by a graphic depiction of President Trump’s death led to lost sponsorship and business opportunities. In May, comedian Kathy Griffin posed for a photograph with a fake, bloodied head of the president in her outstretched arm. The photograph generated a firestorm of criticism and Griffin was quickly fired from her role on CNN’s annual New Year’s Eve Live broadcast. The comedian also lost out on a commercial deal with a restroom accessories company and had several scheduled performances on her   comedy tour cancelled.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742561873.8406587}