{"duration": 0.08027529716491699, "input_args": {"text": "'November 9, 2016 \\nCalls for unity behind a Donald Trump administration are irresponsible, dangerous, and must be rejected. \\nIn her concession speech this morning, Hillary Clinton told a stunned nation the following: “Last night, I congratulated Donald Trump and offered to work with him on behalf of our country… I hope that he will be a successful president for all Americans.” \\n“We owe him an open mind and the chance to lead,” she added. \\nMany of Clinton’s most fervent supporters were rightly taken aback. After all, these words came from someone who only days earlier was denouncing Trump as a violent misogynist , a racist and Islamophobe, and a would-be dictator unfit to lead, too emotionally unstable to trusted with the country’s nuclear codes. Liberals who had seen in Clinton a last line of defense against the aggressive right were now witnessing her rebrand him as somehow worthy of the presidency. \\nThat Clinton would overlook Trump’s history of sexual assault may be no surprise, given her role in covering-up her own husband’s behavior. That she would overlook his blatant appeals to white nationalism and Islamophobia is similarly unsurprising given her own rhetoric about Black “superpredators” and hawkish interventionism in the Middle East. \\nBut still, this was a campaign consciously designed around stoking the fear that Trump was unlike any other candidate, an abnormally pernicious threat to women, people of color, and even democracy itself. The strategy failed spectacularly, and Clinton’s about-face was predictable if no less spectacular. \\nMeanwhile, Trump was suddenly sounding presidential, insisting in his victory speech that “Now it’s time to bind the wounds of division… to come together as one united people.” Even his exuberant supporters, who had only an hour before been chanting “Lock her up!” must have been shocked to hear him insist that Clinton is owed “a major debt of gratitude for her service to our country.” \\nFor those who have long dismissed the two-party system as a farce, this shared rhetoric by the two candidates wouldn’t be surprising. In a phrase that has become the fodder for memes, superimposed over images of the smiling Clintons and Trumps or Michelle Obama hugging George W. Bush , the Italian Marxist Antonio Gramsci once argued that “The historical unity of the ruling classes is realized in the state.” \\nBut despite this unity among elites, Trump has mobilized and encouraged a ferociously white supremacist movement , and this base won’t go away quietly. \\nWhen Clinton wishes him a “successful” presidency, what does this mean? Successfully building a wall along the southern border? Successfully rolling back what little protections exist for people of color, queer and trans people, and women? No, we wish no success for Trump. \\nAs Keeanga-Yamahtta Taylor, author of From #BlackLivesMatter to Black Liberation , put it this morning: “No, we don’t owe this monster an open mind… Trump deserves revulsion and relentless protest. After a year of calling this man a fascist and a unique evil, they tell us to unite and give him a chance… No one is interested in unifying with this garbage; we have to confront this racism and sexism in the streets and organize like we never have before.” \\nClinton is no ally of the left: her record of support for mass incarceration, neoliberalism, and brutal wars and coups abroad makes this perfectly clear. We don’t owe Trump “an open mind and a chance to lead.” We owe him nothing but our ferocious opposition in the streets, and that starts today. \\n\\nGeorge Ciccariello-Maher is an organizer, radical political theorist, and professor at Drexel University. Follow him on Twitter @ciccmaher . '"}, "time": 1742563757.464166}