{"duration": 0.06205463409423828, "input_args": {"text": "'Forget the team of lawyers. First Lady Melania Trump may be the best hope for White House advisers who are trying to convince President Donald Trump to tweet less or, at the very least, more judiciously.  The First Lady was apparently a big reason why Trump did not tweet as much while he was abroad for his first foreign trip as President, according to Politico’s White House reporter Annie Karni. She tweeted, “I’ve been told a factor in the lack of tweeting abroad overall was the presence of Melania Trump. ”   I’ve been told a factor in the lack of tweeting abroad overall was the presence of Melania Trump. https:  .   —   Annie Karni (@anniekarni) May 27, 2017,  Melania Trump is expected to move into the White House next month, Trump’s advisers have told media outlets in recent days that they may want lawyers to vet Trump’s tweets so they “don’t go from the president’s mind out to the universe. ” According to the New York Times, Trump has “been told by his lawyers to limit his posts. Each one, they argue privately, could be used as evidence in a legal case against him. ” The Times wrote that Trump “went through his entire overseas trip without posting a single incendiary message. ” After former House Speaker John Boehner —  who reportedly, at the urging of Trump’s chief of staff Reince Priebus, called Trump and persuaded him to sign the most recent spending bill that Trump may have wanted to veto —  said last week that Trump’s presidency was a “complete disaster,” Trump reportedly wanted to hammer him on Twitter but refrained from doing so. None other than media pioneer Matt Drudge wondered a few months ago if Melania Trump would be to Trump what Nancy Reagan was to Ronald Reagan once she moves into the White House. While making a rare radio appearance on Michael Savage’s radio show for Savage’s 75th birthday on March 31, Drudge wondered, “could this help soften some of Trump’s edges?” Drudge mentioned that Nancy Reagan was known as the “secret behind Ronnie” because she “soothed him  …     she played watchdog. ” During the 2016 campaign, when asked what advice she gives to her husband, Melania Trump often told media outlets that she told him to stay away from tweeting things that could “get him in trouble. ” When he arrived back at the White House on Sunday, Trump fired off a series of tweets denouncing the “fake media” and calling the mainstream media the “enemy. ” He also said he thought “it is very possible” that the “fake news” mainstream media are making up their sources to harm his presidency.     …    . it is very possible that those sources don’t exist but are made up by fake news writers. #FakeNews is the enemy!  —   Donald J. Trump (@realDonaldTrump) May 28, 2017,  It is my opinion that many of the leaks coming out of the White House are fabricated lies made up by the #FakeNews media.  —   Donald J. Trump (@realDonaldTrump) May 28, 2017,  Does anyone notice how the Montana Congressional race was such a big deal to Dems  Fake News until the Republican won? V was poorly covered,  —   Donald J. Trump (@realDonaldTrump) May 28, 2017, '"}, "time": 1742562069.5981696}