{"duration": 0.12614011764526367, "input_args": {"text": "'Waking Times \\nWas JFK murdered mostly because he was trying to gain access to classified information on UFOs, ETs and aliens? As we approach the 53rd anniversary of the JFK assassination (which occurred on November 22, 1963) and mark the death of the greatest US president ever to challenge the New World Order Secret Government, it is worth briefly looking back in time to realize the tremendous lessons from the Kennedy murder. Last year in 2015 I released an in-depth 3-part series on the JFK assassination, dealing with the Who , How and Why of the event, which was a sacrificial mass ritual designed (among other things) to traumatize the American public. In part 3 I compiled a list of the various motives certain people and groups had to kill Kennedy. JFK had crossed the CIA, the Nazis, the Zionists, the Military Industrial Complex, the Federal Reserve and the Mafia – all the while not being part of Secret Society Freemasonic brotherhood. However, was the ultimate reason he was killed due to his persistence and demands in obtaining top secret intelligence on the alien matter? Was JFK murdered because he challenged the power of Majestic-12 or MJ-12, the hidden group Truman had created to be the keepers of UFO and alien secrets? There is substantial evidence to indicate this is indeed the case. Released JFK Letters to CIA and NASA Show His Demand for UFO Files – 10 Days Before His Death \\nTwo memos authored by Kennedy were released to researcher William Lester under FOIA (Freedom of Information Act). Both were written on November 12, 1963, just 10 days before JFK was murdered. One of them is a letter (pictured below) to CIA Director John McCone, who succeeded CIA Director Allen Dulles, one of the JFK assassination conspirators and masterminds (see part 1 ). In the memorandum with the subject “ Classification review of all UFO intelligent files affecting National Security” , JFK explicitly writes that he has initiated a joint space program with the USSR. He is telling the CIA that he wants to share its UFO, ET and alien data with NASA, and wants to distinguish between knowns and unknowns (we can interpret the “knowns” as US controlled secret technology such as anti-gravity craft and the “unknowns” as genuine extraterrestrial phenomena). Here is the text: \\n“As I had discussed with you previously, I have initiated [redacted] have instructed James Webb to develop a program with the Soviet Union in joint space and inner exploration. It would be very helpful if you would have the high threat cases reviewed with the purpose of identification of bona fide as opposed to classified CIA and USAF sources. It is important that we make a clear distinction between the knowns and unknowns in the event the Soviets try to mistake our extended cooperation as a cover for intelligence gathering of their defense and space programs. \\nWhen this data has been sorted out, I would like you to arrange a program of data sharing with NASA where Unknowns are a factor. This will help NASA mission directors in their defensive responsibilities. \\nI would like an interim report on the data review no later than February 1, 1964.” \\nThe other memorandum (National Security Action Memorandum No. 271, pictured below) is addressed to then NASA administrator James Webb. It carries the subject line of “ Cooperation with the USSR on Outer Space Matters” . JFK outlines how he wants NASA to develop a program of cooperation with the Russians in the field of outer space. JFK Murdered Over UFO Intelligence Access – The Bigger Picture \\nHowever, to put these two memos in context, you need to understand that Kennedy had been chasing the golden goose for a long time. Authors and experts such as Dr. Michael Salla, Richard Hoagland and Mike Bara, some of whose work you can read here in “ President Kennedy’s deadly confrontation with the CIA & MJ-12 over ET/UFO X-Files – Part II” , have done extensive research to show that JFK was determined, before his presidency even began, to get full UFO intelligence access and as president re-take control of the information. He wanted it out of military, unelected hands and placed back into civilian, elected ones. He was out to undo the damage Truman had done, and Eisenhower had continued, by setting up the hidden MJ-12 group in 1947 and keeping the UFO and alien subject under wraps as a giant secret. \\nThe following is from a review or synopsis of Salla’s book Kennedy’s Last Stand: Eisenhower, UFOs, MJ-12 and JFK’s Assassination : \\n“In searching for answers to who killed President Kennedy we need to start with the death of his mentor, James Forrestal in 1949. Forrestal became the first Secretary of Defense in 1947, a position he held until March, 1949. Forrestal was a visionary who thought Americans had a right to know about the existence of extraterrestrial life and technologies. Forrestal was sacked by President Truman because he was revealing the truth to various officials, including Kennedy who was a Congressman at the time. Forrestal’s ideals and vision inspired Kennedy, and laid the seed for what would happen 12 years later. \\nAfter winning the 1960 Presidential election, Kennedy learned a shocking truth from President Eisenhower. The control group set up to run highly classified extraterrestrial technologies, Majestic-12, had become a rogue government agency. Eisenhower warned Kennedy that Majestic-12 had to be reined in. It posed a direct threat to American liberties and democratic processes. Kennedy followed Eisenhower’s advice, and set out to realize James Forrestal’s vision. The same forces that orchestrated Forrestal’s death, opposed Kennedy’s efforts at every turn. When Kennedy was on the verge of succeeding, by forcing the CIA to share classified UFO information with other government agencies on November 12, 1963, he was assassinated ten days later.” Joint US-USSR Space Missions: JFK Murdered Over Clever Strategy \\nAlthough JFK surely and naturally had other reasons for wanting to work together with the Soviets (and thus avoid any possibility of a nuclear war), it is quite possible that his proposed joint US-USSR program was an excuse and a clever means to wrest control of the ET issue from the hands of MJ-12. To have NASA cooperate with the Soviet space administration on lunar missions and outer space exploration would necessarily mean sharing data on UFOs. After all, the existence (and extreme technological capacity) of such craft were an obvious security factor and threat that would impact any space expedition. Kennedy already had Soviet leader Nikita Kruschchev on board. Salla writes: \\n“Documents confirm that on November 12, 1963 Kennedy and Khrushchev had agreed on steps to share UFO information precisely for this reason, and Kennedy identified the CIA as the lead U.S. agency to implement the process. Unknown to Kennedy, the CIA’s chief of counterintelligence, Angleton, implemented a secret set of directives that would deny access to classified UFO information to Kennedy, his national security staff and the Joint Chiefs of Staff.” The MJ-12 Kennedy Assassination Directive \\nTruth is heavily guarded by layers of secrecy, deception, falsehood and propaganda. Often, government officials hide the truth by overseeing partial disclosures which are carefully orchestrated to give away just enough of the secret without going in too deep. Ever since the Roswell crash of 1947, the US Government kept 2 sets of UFO files. The tamer cases and less controversial information were made publicly available through Project Blue Book, which was the official public investigation into UFOs by the USAF. It formally ended in 1970. However, the really good stuff with high classifications was kept under lock and key by the CIA and MJ-12. Kennedy must have learnt enough about the situation to have known this, and have slowly but surely been making his way to the source of the information. By the time it got to November 12th, 1963, it was the final straw; MJ-12 who controlled the CIA would not allow Kennedy to have UFO intelligence access – at any cost. \\nAs mentioned in part 3, the Kennedy assassination directive (pictured above) was written in code language to disguise the hit they were ordering. It uses the Russian spy term “wet” (i.e. wet from being drenched in fresh blood) to mean a killing. The memo reads: \\n“when conditions become nonconductive for growth in our environment and Washington cannot be influenced any further . . . it should be ‘wet.’” \\nThis is from Salla’s commentary: \\n“Dr Robert Wood who is the foremost expert in analyzing MJ-12 documents using forensic methods, has concluded that the burned document is an assassination directive … he pointed out that the cryptic phrase “it should be wet” originates from Russia, where the phrase ‘wet works’ or “wet affairs” denotes someone who had been killed and is drenched with blood. The codeword ‘wet’ was later adopted by the Soviet KGB and other intelligence agencies … In drafting this cryptic directive, Allen Dulles was seeking approval from six of his MJ-12 colleagues, to lay the justification for the assassination of any elected or appointed official in Washington DC whose policies were “non-conducive for growth”. The cryptic directive was a pre-authorization for the assassination of any U.S. President who could not “be influenced any further” to follow MJ-12 policies.” CIA Wiretap of Marilyn Monroe Also Suggests JFK Murdered Over UFO Issue \\nPopular actress Marilyn Monroe was a famous lover of both JFK and his brother Robert, who served as Attorney General in the Kennedy Administration. In April 2014, evidence came to light in the form of an alleged CIA transcription (pictured below). If real – and it appears genuine – it shows that the CIA were wiretapping Monroe and knew she was about to go public and blow the whistle on JFK and UFOs . Here is what the alleged CIA wiretap document (dated August 3, 1962) states: \\n“Rothberg indicated in so many words, that she [Monroe] had secrets to tell, no doubt arising from her trists [sic] with the President and the Attorney General. One such “secret” mentions the visit by the President at a secret air base for the purpose of inspecting things from outer space. 2. Subject repeatedly called the Attorney General and complained about the way she was being ignored by the President and his brother. 3. Subject threatened to hold a press conference and would tell all.” Robert Kennedy Also Briefed On UFOs \\nAnother piece of evidence substantiating the “JFK murdered due to UFOs” hypothesis is that his brother and Attorney General Robert Kennedy was also briefed on the matter. Lieutenant Colonel Philip Corso, a man who served in a number of National Security Council committees from 1953-57 during the Eisenhower presidency, says Bobby actually sought him out. In this short video Corso says he personally briefed Bobby Kennedy on the subject of flying saucers or UFOs. Bobby was JFK’s closest advisor. Conclusion: Highly Likely JFK Murdered Over UFOs and ETs / Aliens \\nSo at the end of the day was JFK murdered over the UFOs and aliens? While there were many motives for (and conspirators involved in) the killing of JFK, the evidence is overwhelming that his demand for more control over the UFO and alien subject was the crucial factor in the decision by MJ-12 to assassinate him. It may have been the straw that broke the camel’s back, but more likely it was the central issue all along. JFK inherited a system from Eisenhower and Truman, US presidents who had already given away substantial control to the Military Industrial Intelligence Complex. Indeed, the very term “Military Industrial Complex” (MIC) has only become so commonplace thanks to Eisenhower using it in his farewell speech , where he issued a grave warning to the American public about the power that the MIC already held (but which he also allowed to a large extent). \\nTo study the New World Order and the worldwide conspiracy at the deepest levels is to study the UFO, ET and alien agenda. To study UFOs and aliens, in turn, is to accept the existence of free energy technology (aka zero point or over unity energy). This is the gamechanger . Once people accept the reality of free energy and learn how to create and share it, the control grid and conspiracy will evaporate – because knowledgeable and abundant people cannot be controlled. There is so much at stake at here! Thank you JFK and to all others who have dedicated their lives to making this information public, widespread and accessible. The truth cannot be hidden forever. About the Author \\nMakia Freeman is the editor of The Freedom Articles and senior researcher at ToolsForFreedom.com ( FaceBook here), writing on many aspects of truth and freedom, from exposing aspects of the worldwide conspiracy to suggesting solutions for how human ity can create a new system of peace and abundance \\n**Sources embedded throughout article.'"}, "time": 1742628481.4082906}