{"duration": 0.015838623046875, "input_args": {"text": "'  Donald J. Trump named Dr. David J. Shulkin as his nominee to run the Department of Veterans Affairs at his Wednesday press conference at Manhattan’s Trump Tower. [“He’s fantastic. He’s fantastic. He will do a truly great job,” said Trump, who called the press conference to discuss his plan to transfer control of his business operations to his two eldest sons, Eric and Donald Jr. and a   Trump Organization executive. “You’ll be very impressed with the job he does. ”  The incoming president said he interviewed more than 100 candidates for the VA job, “some good and some not so good. ” Trump said improving the VA was one of the key commitments he made in the 2016 campaign. “Veterans have been treated horribly,” he said. “They wait for 15, 16, 17 days —  cases when they go in with a minor, easy form of cancer and they can’t see a doctor,” he said. “By the time they see a doctor, they’re terminal,” he said. If Shulkin takes over the VA, it will be a promotion for the internist with more than 20 published academic papers. Sulkin is one of the few holdovers from President Barack Obama’s administration, where he currently serves as the chief executive of the   strong Veterans Health Administration, the nation’s largest integrated health care system with more than 1, 700 sites of care, serving nine million Veterans each year. The VA also conducts medical research and is the largest employer of medical graduate students in the country. “VA is at a historic crossroad and will need to make bold reforms that will shape how we deliver IT services and health care in the future, as well as improve the experiences of Veterans, community providers, and VA staff,” Shulkin said at his June 22 testimony before Congress. “Throughout this transformation, our number one priority has and will always be the Veteran —  ensuring a safe and secure environment for their  information and improving their experience is our goal. ” In addition to naming Shulkin, Trump again talked about the partnerships he is forming between the VA and the Cleveland Clinic, the Mayo Clinic, and other elite private medical institutions to improve the medical care veterans receive. Shulkin was confirmed by the Senate in June 2015 as the VA’s Undersecretary for Health. Before joining the Obama administration, Shulkin held leadership positions in private medical companies and hospitals and was the founder of DoctorQuality, which developed and sold software allowing medical professionals to identify, track, and analyze medical adverse events and other events relevant to lessons learned and exposure to regulatory reporting.  '"}, "time": 1742628441.9064538}