{"duration": 0.0711824893951416, "input_args": {"text": "'After nearly a year of causing hysteria, mass travel cancellations and unnecessary abortions it finally daunts to “journalists” and “experts” that the Zika virus is harmless. It can cause a very minor flue – two days of a low fever and uncomfortable feeling for a quarter of those infected – that is all. It does not cause, as was claimed by sensationalists in the media and various self-serving “scientists”, birth defects like microcephaly. \\nWe told you so. \\nIn February we wrote: The Zika Virus Is Harmless – Who Then Benefits From This Media Panic? .\\nThe piece refereed to a Congressional Research Service report and various sound scientific papers. It concluded:\\nThere is absolutely no sane reason for the scary headlines and the panic they cause.The virus is harmless. It is possible, but seems for now very unlikely, that it affects some unborn children. There is absolutely no reason to be concerned about it.\\nThe artificial media panic continued and huge amounts of money were poured into dangerous insecticides to kill mosquitoes (and important pollinators) that did not do any harm. Indeed, generous use of some of these insecticides likely were the very cause of a blip in microencephaly cases in northeastern Brazil.\\n\\nIn March we wrote: Reading About Zika May Hurt Your Brain .\\nWe listed 35 sensational “news” headlines about potential catastrophes related to a Zika epidemic. The common factor of those panic creating media wave – all those headlines included the miraculous little word may . The pieces were pure speculations with some quoting this or that “expert” who was hunting for research funds or lobbying for some pharmaceutical or pesticide conglomerate.\\nIn June we added: Zika Virus Does Not Cause Birth Defects – Fighting It Probably Does .\\nNew serious research found what some people in Brazil had suspected from the very start of the small and strictly locally limited jump in microencephaly cases in Brazil:\\n[D]octors in the Zika affected areas in Brazil pointed out that the real cause of somewhat increased microcephaly in the region was probably the insecticide pyriproxyfen, used to kill mosquito larvae in drinking water:\\nThe Brazilian doctors noted that the areas of northeast Brazil that had witnessed the greatest number of microcephaly cases match with areas where pyriproxyfen is added to drinking water in an effort to combat Zika-carrying mosquitoes . Pyriproxyfen is reported to cause malformations in mosquito larvae, and has been added to drinking water in the region for the past 18 months.\\nPyriproxyfen is produced by a Sumitomo Chemical – an important Japanese poison giant. It was therefore unsurprising that the New York Times and others called the Brazilian doctors’ report a “conspiracy theory” and trotted out some “experts” to debunk it.\\n…\\nBut [s]cientist at the New England Complex Systems Institute also researched the pyriproxyfen thesis. They found :\\nPyriproxifen is an analog of juvenile hormone, which corresponds in mammals to regulatory molecules including retinoic acid, a vitamin A metabolite, with which it has cross-reactivity and whose application during development causes microcephaly .\\n…\\n[T]ests of pyriproxyfen by the manufacturer, Sumitomo, widely quoted as giving no evidence for developmental toxicity, actually found some evidence for such an effect , including low brain mass and arhinencephaly—incomplete formation of the anterior cerebral hemispheres—in rat pups. Finally, the pyriproxyfen use in Brazil is unprecedented—it has never before been applied to a water supply on such a scale.\\n…\\nGiven this combination of information we strongly recommend that the use of pyriproxyfen in Brazil be suspended pending further investigation.\\nToday the Washington Post finally admits that the Zika virus does not cause birth defects:\\n[T]o the great bewilderment of scientists, the epidemic has not produced the wave of fetal deformities so widely feared when the images of misshapen infants first emerged from Brazil.Instead, Zika has left a puzzling and distinctly uneven pattern of damage across the Americas. According to the latest U.N. figures, of the 2,175 babies born in the past year with undersize heads or other congenital neurological damage linked to Zika, more than 75 percent have been clustered in a single region: northeastern Brazil.\\nThe wide areas where the flue virus occurred outside of the small area in Brazil saw no increase in birth defect numbers. The number of (naturally occurring) microcephality cases stayed constant despite a very large increase in (harmless) Zika virus infections. The numbers in Brazil also turned out to be partially inflated because of a lack of standard diagnosis criteria and unreliable statistics. A factor we had pointed to in our very first piece.\\nThe WaPo piece today muses about several “possible” causes for the local increase in cases in northeastern Brazil that indeed happened. It quotes some of the very “experts”, like from the pharmaceutical industry influenced CDC, that were wrong on the issue since the very first panic headline. It strenuously avoids to even mention the most likely cause – the excessive local use of an insecticide that is supposed to cause birth defects – in developing mosquitoes. Thus the reporting is still void of journalistic ethics and irresponsible in its conclusions.\\nIt did not take much effort to get this right. An hour or two of skimming through publicly available sources of good standing, some basic higher education and sound reasoning was enough. But instead of doing such basic inquiries “journalists” and media “served” panic and speculations by biased “experts”. Keep this story in mind for the next sensationalist onslaught of panic headline. There surely will be some “interests” behind those; just don’t expect unbiased facts and basic logic reasoning.\\nSource: Moon of Alabama \\nVia: Global Research \\nYet, Millions of GMO Mosquitoes set to be released in Brazil & Columbia… Scientists are planning to release an army of millions of modified mosquitoes in areas of Brazil and Colombia.\\nThey say the unusual approach is an attempt to provide “revolutionary protection” against mosquito-borne diseases such as Zika and chikungunya.\\nThe mosquitoes are infected with a bug called Wolbachia which reduces their ability to spread viruses to people.\\nThe $18m dollar project is funded by an international team of donors, including the Bill and Melinda Gates Foundation… \\nSource: BBC \\nRelated: 6 Weird Things About Zika That Don’t Add Up — Must Watch! Depopulation: Zika Virus Funded By Bill Gates Zika Virus For Sale Online Courtesy of the Rockefeller Foundation FDA Approves Genetically Modified Mosquitoes to Combat Zika in Florida Zika Mosquitoes Same As GM Mosquitoes Released Off The Coast Of Florida Feds Going Door-To-Door In Florida Asking For Urine Samples Amid Zika Outbreak Is the Zika virus an offshoot of a secret U.S. Army ‘entomological warfare’ program? Zika ‘scarier than thought’: Top US officials push govt for $1.9bn emergency funding Zika Virus – The Latest Actor in the Fake Pandemic Play? Zika: Who Launched The Fake-Epidemic Story In Brazil? Zika Fear Falters as False Flag Fraud Fizzles GM Mosquitoes With Possible Link To Zika Virus Awaiting Release In Florida Zika Virus Outbreak May Be Result of Bioweapon – Ex-Russian Surgeon General Zika Freakout: The Hoax And The Covert Op Continue Eugenics WMD: Zika Virus Prompts Disturbing New Call For ‘No Child Policy’ '"}, "time": 1742628454.2257705}