{"duration": 0.11132550239562988, "input_args": {"text": "'Go to Article \\nParents who plan on refinancing their homes in order to send their children off to college should instead consider encouraging them to specialize in a trade. \\nSpeaking as a Ph.D. in philosophy who has spent the last 17 years teaching at the college level, I’m perhaps the last person from whom advice of this sort is expected. But it is precisely because of my familiarity with academia that I beseech the college bound and their enablers—I mean their supporters—to revisit their plans. \\nWhether one regards a post-secondary institution as a means to either a remunerative profession or a genuine education, the tragic fact of the matter is that the contemporary academic world is about as politicized a cultural institution as any. More specifically, it is a bastion of Political Correctness, a decidedly leftist ideology that tolerates no competition. \\nFor the last 11 years, Professor Duke Pesta, who is currently an associate professor of English at the University of Wisconsin Oshkosh, has taught literature at a range of colleges. At the outset of each semester, he would quiz his students on their knowledge of American and Western history. What he found is that the “overwhelming” number of them believed that slavery—an institution, mind you, that is as old as humanity itself, was practiced in virtually every society the planet over, and that lasted only some 87 years in the United States— was an exclusively American phenomenon . \\n“Most of my students could not tell me anything meaningful about slavery outside of America,” Pesta told The College Fix. His students “are convinced that slavery was an American problem that more or less ended with the Civil War and they are very fuzzy about slavery prior to the Colonial era.” \\n“Their entire education about slavery,” he adds, “was confined to America.” \\nYet it isn’t just students who display an astonishing ignorance of slavery. Over at Boston University, Saida Grundy , an Assistant Professor of sociology and African-American Studies, tweeted that slavery is “a white people…thing.” \\nGrundy didn’t stop there. She asks: “is white people’s new deflection from dealing with slavery that ‘all races have had slaves’ thing? is this the new ‘#AllLivesMatter’?” \\nProfessor Grundy added other enlightening tweets: \\n“for the record, NO race outside of Europeans had a system that made slavery a *personhood* instead of temporary condition; \\n“there is also no race except Europeans who kidnapped and transported human beings in order to enslave them and their offspring for life; \\n“before Europeans invented it as such, slavery was not a condition that was de facto inherited from parent to child.” \\nIn case white folks couldn’t follow the thrust of her rant, Grundy offers a summation of her sophisticated position: \\n“in other words, deal with your white sh*t, white people. slavery is a *YALL* thing.” \\nIn addition to assigning blame for slavery solely to white Europeans, Grundy claimed that “white masculinity” is “THE problem for america’s colleges.” \\nOver at the University of Pittsburgh, students who were distributing pro-Donald Trump materials were harassed and attacked . The Trump supporters were accused of backing a “racist” candidate who espouses “hate speech.” They were greeted by chants of “f**k the white male patriarchy” and, eventually, physical aggression. \\nOne of the victims said that “my campus shouldn’t be a place where my friends and I are fearful for having opposing opinions.” \\nThese students were accosted by other students. Students elsewhere, however, have had professors with which to contend. \\nAt the University of California at Los Angeles (UCLA), a political science professor, Michael Chwe, wrote in a blog post for Princeton University Press that “the danger to democracy itself” is posed by “Trump supporters[.]” This “danger” is “real and must be confronted.” Chwe maintains that Trump and his supporters are “the greatest danger to democracy since World War II, even perhaps since the Civil War[.]” \\nChwe thinks that had “we” done “a better and earlier job with confronting, as opposed to accommodating, white and male privilege…we might not have reached this situation [the Trump phenomenon].” “We” must set our sights on “combatting” these forms of “privilege” now, though, if we hope to divert “democracy away from self-destruction.” \\nAnd it isn’t just faculty in the humanities and liberal arts that can’t resist injecting their politics into the classroom. A math professor at Mount Holyoke College, an all-female school, was recently captured on video launching into an anti-Trump/pro-Clinton tirade in class. While he never referred to either candidate by name, Peter Rosnick’s choice for president was plain. This election, Rosnick said, is the “scariest” that he’s ever witnessed. He told his students that they should “vote for someone who thinks women are full and capable and responsible and intelligent beings who should not be the object of, um, should not be objectified.” \\nRosnick also prescribed his students to vote “for whoever you want, but vote for somebody who respects the fact that this is a country built on immigrants—that this is a country that couldn’t, that wouldn’t be what it is if it wasn’t for bringing immigrants into our nation and respecting them and respecting what they bring to our country.” \\nAt least one of Rosnick’s students was less than enthused over his proselytizing efforts. Speaking on condition of anonymity, this student told The College Fix that she found “it highly inappropriate for a math teacher to use my class time to try to tell me who to vote for.” \\nIndeed. \\nBut this, unfortunately, is hardly an anomaly in 2016. Thus, parents should think hard before divesting themselves of tens and tens of thousands of dollars so that their children can become targets of political indoctrination.  '"}, "time": 1742562500.3180585}