{"duration": 0.03952932357788086, "input_args": {"text": "'LOS ANGELES  —   Aging fanboys and enthusiasm from critics propelled “Logan,” an   “ ” spinoff, to a fat $85. 3 million in domestic ticket sales over the weekend. “The Shack,” aimed at religious audiences, also got off to a strong start, but the Academy Awards did not drive the multiplex masses into “Moonlight. ” Starring Hugh Jackman as the   Wolverine, “Logan” was an effort by 20th Century Fox to freshen the superhero genre by pushing into “raw, ugly violence,” as Manohla Dargis, a chief movie critic for The New York Times, wrote in her review. To its benefit, she said, the film “doesn’t play like a retread or an ad for the next installment. ” That was the bull’s eye for which Fox was aiming: Having been fed one superhero sequel after another  —   Mr. Jackman has been playing Wolverine for 17 years  —   audiences (in particular, a core fan base that has aged) are demanding that studios get more creative. Fox got the message last year, when its daring   “Deadpool” broke box office records and its rather rote “ : Apocalypse” underperformed. Fox booked “Logan” into 4, 071 theaters, a large number for an   film. “Logan,” which cost roughly $100 million to make, not including marketing costs, collected an additional $152. 5 million overseas. For the weekend in North America, the horror movie “Get Out” (Universal) was second, collecting about $26. 1 million, for a   total of $76 million, according to comScore, which compiles   data. “The Shack” (Lionsgate) starring Octavia Spencer as God and based on William P. Young’s   novel of the same name, was third, arriving at about $16. 1 million in ticket sales, more than industry analysts had predicted before its release. “The Shack” may have been dismissed by most critics, but viewers gave it an A grade in CinemaScore exit polls, suggesting that it will ride    to solid ticket sales in the weeks to come. Lionsgate, which has been on a box office roll, spent a little over $20 million to make “The Shack,” backing it with an aggressive   marketing campaign. Despite its   win at the Oscars, “Moonlight” (A24) only collected about $2. 5 million from more than 1, 500 theaters, its widest release yet, for a new total of $25. 4 million. On the plus side, A24 said that “Moonlight” was a top seller on    platforms. It was also released on DVD on Tuesday.'"}, "time": 1742563702.062447}