{"duration": 0.09109282493591309, "input_args": {"text": "'Obama and Justice Dept. Busted In Rigging Plot After Hillary Memo Leaks Posted on November 1, 2016 by Prissy Holly in Politics Share This \\nOver the weekend, many of us were left cheering over the news that the FBI was reopening their investigation into Hillary Clinton’s private server. Unfortunately, our celebrating might be short lived. Democrats are already scheming with how to get her off with no charges, including Barack Obama and other top officials who were paramount in her walking away scot-free. \\nIt seems that no matter how crooked Hillary is, Democrats will always swarm together to protect their evil queen bee. The whole checks-and-balances thing among our branches of government is completely thrown out the window whenever Hillary is involved, as she simply buys the silence of government officials, or if that doesn’t work, she kills them. It should come as no surprise that the very same people who helped her walk away from her Benghazi scandal, are now flocking once again to save her ass. \\nWe’ve all seen Obama’s “Justice” Department in action over the tenure of his presidency, and it’s anything but contrived of justice. Now, we’re seeing even more evidence of their twisted schemes in practice, proving again that everything in Washington, D.C. is completely rigged. \\nIn a letter to Congressional leaders, Obama’s DOJ stated that when it comes to the investigation of over 650,000 emails on Anthony Weiner’s home computer that they will “work closely with the FBI and together, dedicate all necessary resources and take appropriate steps as expeditiously as possible.” \\nWhile that might sound great and wonderful on the surface, most people missed who signed that letter of compliance — Hillary’s partner in crime, Assistant Attorney General Peter Kadzik. The crooked man not only testified during Benghazi as to Hillary’s “innocence,” but he is also really good friends with Hillary’s presidential campaign chair, John Podesta. Kadzik and Podesta hung out and dined to celebrate the day after Hillary’s Benghazi hearings before Congress, and Kadzik was mentioned a whopping 20 times in Podesta’s emails that were recently released by WikiLeaks. \\nHowever, the conniving doesn’t end there. Rumors are already swirling that if Hillary does get into trouble with this new investigation, that Obama is planning to pardon her, even if it’s done retroactively after he leaves the White House. \\nIn a recent interview, Rep. Blake Farenthold (R-Tx) said that win or lose, Barack Obama will simply pardon Democrat nominee Hillary Clinton. “I think win or lose there’s a presidential pardon in her future. Historical precedent was set when Ford retroactively pardoned Nixon. I don’t think that’s good for our country, but I’m afraid that’s going to happen.” \\nEven more infuriating, if Hillary is elected president, she could simply pardon herself. Presidential pardoning powers come from Article II, Section 2 of the United States Constitution that states that presidents “have Power to grant Reprieves and Pardons for Offenses against the United States, except in Cases of Impeachment.” Basically, as long as she’s not being impeached, she could pardon herself and walk away completely free. \\nOur Founding Fathers were so careful in how they worded our founding documents so that no one in government could ever become too powerful. But how do you plan for someone who encompasses the evil of Hillary Clinton, where she practically owns and controls every single person in Washington, D.C.? If this woman gets elected as the next president, we will soon have a lawless tyrant leading our country.'"}, "time": 1742563168.164031}