{"duration": 0.16867828369140625, "input_args": {"text": "'Each week, Nate Cohn, The Upshot’s elections analyst, and Toni Monkovic, an Upshot editor, discuss the 2016 race and post a lightly edited transcript of their written exchange. This week: How will Democrats’ recent success with   voters change American politics? And who is Gary Locke? But we start with the state of the campaigns, particularly Donald Trump’s.  Toni The Trump campaign is in disarray. You tweeted: “All considered, it appears that Trump hasn’t really done anything since clinching the nomination. Not in battlegrounds, not   etc. ” Nate Yeah, even right now [Wednesday] he’s speaking in New York City. It’s just a big wasted opportunity. He clinched the nomination seven weeks ago, and he has spent most of that time campaigning in noncompetitive states and offending voters. Are you watching this speech? Toni No. What is he saying? Nate He’s giving his speech on the Clintons, which he’s been promising for some time. It’s a bit over the top at times, but it’s a lot better than much of what he’s been saying. And it’s a powerful reminder of how vulnerable Hillary Clinton would be to a version of Trump who wouldn’t defeat himself. Toni Instead of focusing on Clinton, he has been continuing to squabble with Republicans. What is the biggest mistake he’s making? What is the one thing he should prioritize in terms of organization and strategy? He has very little money. He’s not advertising. He has a very small staff. He’s not campaigning in swing states. And the list goes on. Nate Well, a lot of that requires money. He doesn’t have it, and he needs to fix it. Traveling to swing states is the one thing that doesn’t require much money, so that’s inexcusable. He can get on a bus from New York and get to Levittown, Pa. in 90 minutes, Allentown in less than two hours. Scranton in 2. 5 hours. Toni Comedy interlude: Some “Saturday Night Live” fans may remember a segment in which Jason Sudeikis, impersonating Joe Biden in a   debate, says, “If you went to the lowest circle of hell, you’d still be 45 minutes outside of Scranton. ” Nate Haha, all jokes aside, Scranton is exactly the sort of place Trump needs to win this election. Obama won Scranton’s Lackawanna County by a   margin in 2012  —   the best showing by a Democrat since 1964. It’s 90 percent white. It’s working class. It’s traditionally Democratic. Toni If this year has shown us anything, it’s that a better version of a populist candidate like Trump could easily become president. You helped illustrate it with your recent project: “There are more white voters than people think. ” But speaking of Pennsylvania, I’m interested in what you thought of David Plouffe’s recent response to you on Twitter. He was defending the Clinton team’s decision not to advertise in Pennsylvania the Clinton campaign is starting to advertise in many other important states. Is there something we might be missing? Maybe there’s internal polling, or maybe it’s purposeful misdirection on Plouffe’s part? [Plouffe was a campaign manager and adviser for President Obama.] Nate The existence of so many places like Scranton in Pennsylvania  —   white   Democratic strongholds  —   is a big part of why I think it’s a natural target for Trump. There’s a lot of room for Republicans to make gains in Pennsylvania, and I’d note that Trump did very well in these same areas in the primaries. It’s possible that the Clinton campaign’s data suggests that these registered Democrats are sticking with the Democrats yet again. I’m not sure whether Plouffe’s comment reflects that, or if it reflects his experience from the last two cycles, when these registered Democrats did stick with Obama. I was with Plouffe on “Pennsylvania is a pipe dream” in 2012, and you can still read my thoughts on why that was the case somewhere on the internet. But I think it’s a bit less clear now. This time, there’s a lot of evidence that Clinton is underperforming among white   voters  —   by so much as to all but guarantee that she’s underperforming among traditional Democratic voters. Now, maybe that’s happening in other parts of the country but not Pennsylvania. We don’t have much data there. Or maybe it’s canceled out by huge Clinton gains in the Philadelphia suburbs. But for now, the data is not nearly as consistent with Plouffe’s view as it was at this time four years ago. Toni Maybe they’re not advertising in Pennsylvania because  —   if they see slippage  —   they can still try to overwhelm Trump with ads later. The Democrats will also get a little boost from the site of the convention: Philadelphia. And they can swarm the state with effective surrogates: Bill Clinton, Joe Biden (ahem, Scranton) Obama. Nate I think it’s risky. Trump has a narrow path to victory, and Pennsylvania would make it a lot wider. The Democrats have a huge financial advantage they can afford to secure their flank. One last thought here: Clinton’s second stop after clinching the nomination was in Pittsburgh. Before the Orlando shooting, her third stop  —   with President Obama  —   was to be in Green Bay. (Clinton is not advertising in Wisconsin either) So I don’t buy that they think these states are irrelevant, even if they’re not advertising there. Toni Let’s imagine that Trump cratered in the polls, and was consistently behind by double digits in  . Would there be any hope among Republicans of a coup at the convention? It seems impossible. Nate It would be tough. I don’t think it’s impossible. Oddly, I don’t feel that much differently about his chances of winning the election and his chances of getting ousted at the convention, even though clearly the former is likelier given the numbers and how much time there is before the election. Toni The betting markets are at a new high for a Clinton victory: 77 percent (as of Wednesday). Nate Would you buy? Toni I think it’s fair. It’s still early. Nate Yeah. There’s still time to build a campaign. There’s still time to adopt a more consistent and appealing message. But he hasn’t really given much reason to think he can or will do either of those things. That said, there is some progress on both of those fronts. He has been   and his speech [Wednesday] was more focused than some of his other efforts over the last month. Toni In 2012, there was a debate about state polling versus national polling, and which was more accurate. There was a disconnect, with Obama doing slightly better in state polling, and that turned out to be the better gauge. But you have been saying that the quality of state polling is poor right now. Nate Yeah, I mean, the state polling is a disaster, in terms of both coverage and quality. To borrow from Mr. Trump, I’m calling for a total and complete shutdown of all analysis of state polling until we can figure out what is going on. Toni When can we expect an improvement? Nate Maybe there will be a few good state polls after the convention. Toni A big story line for this election is whether Trump can win more white   voters while holding down losses among   ones. But something that doesn’t often get discussed is that support among those groups isn’t necessarily equally important. Studies have shown that the well educated are more likely to vote. So it’s not a good    trade for Republicans in this election, or in the future. Nate Well, that’s definitely true. They’re both less likely to be registered and less likely to turn out. We might be seeing the hints of this already, in recent polls showing Clinton doing better among likely than registered voters, which would be a big departure from recent trends. On the other hand, there are still a lot more white   voters than   white voters, especially in the battleground states. So it is a good trade it’s just not as good as it would be if the turnout rates were more equitable. Toni Could this education shift help stop the bleeding for Democrats in future midterms? I realize there are other factors at play. But if Democrats keep winning   voters, that could help in terms of turnout, and so much of the midterms is about turnout. Nate Maybe. I’m not sure how far this trickles down ballot, though. Toni In The New York Times last month, Thomas Edsall wrote: “A general election that pits Hillary Clinton against Donald Trump will produce a decisively more affluent and better educated Democratic presidential electorate and a decidedly less affluent and less educated Republican one than in any previous election going back as far as 1976. ” Looking beyond this election, what do you see as some of the possible consequences of that? One concern, expressed among some liberals, is that the Democratic Party will be less willing to take up concerns of   voters. Nate My optimistic take: If each party is split between populist and affluent wings, there might be more room for compromises and bipartisanship than there has been over the last decade. That room for compromise could exist on either level  —   whether it’s the   trade deal and tax reform among each side’s corporate elites, or more populist efforts to expand the   tax credit, or something else. Toni I see you’ve been having some fun on Twitter promoting Gary Locke as a “deep sleeper” pick for Clinton’s running mate. Nate Haha, in the interest of full disclosure: There’s a considerable amount of   bias at play here. That said, I do think he’s a very interesting pick. He’s very well qualified  —   a former governor (Washington) commerce secretary and ambassador to China  —   and would complement Clinton’s “experience” and “temperament” message. He’d be the first   vice president (he’s a    ) which would complement the “stronger together” message. He’s worked with her at the State Department. He was an early Clinton endorser in 2008. He checks just about every box, except national name recognition. He’s not a sitting senator, either, so there’s not the problem of possibly losing a Senate seat. Toni Thanks for writing up his bio, and saving me from having to look all that up, because you do realize that 99 percent of the people reading this have probably never heard of him. [Note to readers: Nate is from Seattle, and perhaps feels that that Washington, not Washington, D. C. should be the center of the universe.] But since we’ve been talking about educated voters, and with   tending to be in that group, let’s discuss their influence. Is it fair to say that the power of the   vote is diluted in a general election? They voted for Obama over Romney roughly at a   ratio in 2012 (and would be expected to side against Trump by a wide margin). But a fairly big percentage of them live in California, and not that many in key battleground states. Nate I think that’s right. They’re a fraction of the electorate nationally, and they’re disproportionately concentrated in noncompetitive states. They represent more than 3 percent of the electorate in only two battleground states: Nevada, where they are 7 percent of adult citizens (third highest in the country) and Virginia, at just 4 percent. In recent weeks, Nate and Toni looked at the potential terms of surrender for Bernie Sanders discussed whether the superdelegate system should survive and examined claims from Sanders supporters that elections were rigged.'"}, "time": 1742561856.4504316}