{"duration": 0.17174577713012695, "input_args": {"text": "' A View of the Syrian War From the Golan Heights One Syrian lieutenant described to me how he directed his artillery fire onto an Israeli jeep in the Jabhat al-Nusra occupied town of Al-Hamidiya inside Syria and destroyed it. The jeep might have been a gift or borrowed from Israel\\nBy Robert Fisk\\nNovember 10, 2016 \" Information Clearing House \" - \" The Independent \" - From Colonel Saleh\\x92s forward position on his front line north of Quneitra, he has a unique and exclusive view of the Syrian war. To his west and south is a vast area of his country which is occupied by Jabhat al-Nusra Islamist fighters \\x96 their earthen ramparts and supply roads are scarcely half a mile away. Then, another couple of miles away, Israeli soldiers are inside their concrete positions on the occupied Syrian Golan Heights, above the old and Nusra-held Syrian city of Quneitra.\\n\\x93You see that mosque over there, just to the right of the water tower?\\x94 the colonel asks. \\x93Well, Nusra is there. And you see the triangular hill beyond? The Israelis are there.\\x94 It\\x92s what you call a politically intriguing battlefield \\x96 yes, shells do come whizzing in towards the Syrians from Nusra and also from the Israelis. The Syrians concentrate their fire on Nusra but Nusra\\x92s casualties are often taken through the Israeli lines for hospital treatment in Haifa.\\nSo whose side is Israel on? Baath City is a concrete conurbation created back in pre-civil war days to defy the vandalisation of the old Quenitra. It was occupied by the Israeli army during the 1973 Middle East war and then \\x96 before they abandoned it under the Kissinger agreement \\x96 totally destroyed with explosives by Israeli troops. Nusra now occupy these 43-year old ruins. As for Baath City, its university, banks, fire station, schools, police force and hospitals are defiantly maintained by the Syrians under the eyes of their two enemies: the Nusra Islamists and the Israelis.\\nAccording to the Syrian army in Baath City \\x96 their forward lines and tanks are positioned in unfinished apartment blocks on the edge of the town \\x96 their intelligence department\\x92s Hebrew speakers constantly monitor conversations between the Israelis and between Israeli and Nusra fighters. They know \\x96 and the Israelis have made no secret of the fact \\x96 that wounded Nusrah fighters are taken to Haifa for hospital treatment. On one occasion, a Nusrah man travelling in an Israeli ambulance on the Golan was dragged from the vehicle and lynched by a crowd of enraged Druze men who are largely loyal to the Syrian government and regard Nusrah as their mortal enemies. Reports of the man\\x92s murder highlighted the highly ambiguous relationship between Israel and the Islamists, whose name-changing cannot conceal their al-Qaeda roots.\\nDruze towns inside Syria and close to Baath City have taken the side of the regime \\x96 this does not apply to other Druze areas \\x96 but it makes the geography of the front line here all the more surreal. One Syrian lieutenant described to me how he directed his artillery fire onto an Israeli jeep in the Nusra-occupied town of Al-Hamidiya inside Syria and destroyed it. The jeep might have been a gift or borrowed from Israel \\x96 whether there were any Israeli personnel inside it if it was hit is another matter. The Syrians, however, also say that Israeli bulldozers were used to build a new supply route for Nusrah between Quneitra and Golan \\x96 again, inside Syria\\x92s frontiers.\\nAll of which raises a compelling question. The Nusra-controlled territory between the Syrians and the Israeli lines on Golan \\x96 and other Islamist groups and a few remnants of the old \\x93Free Syrian Army\\x94 allied to them in this location \\x96 stretches all the way south to the edge of the Syrian city of Deraa and right down to the Jordanian frontier. And beyond that frontier is the so-called \\x93Military Operations Centre\\x94 \\x96 the \\x93MOC\\x94 of which both the Islamists and the Syrian army refer \\x96 where Western intelligence officers maintain a liaison and weapons supply depot for the anti-government Syrian forces.\\nSo what is the relationship between the MOC and its Western backers \\x96 who maintain contact with Nusra \\x96 and the Israelis who treat Nusra\\x92s wounded in their hospitals? The Jordanian border and the Israeli lines on Golan are at their most only about 70 miles apart and opposition fighters hold all the land in between.\\nLittered around the front lines outside Baath City are the wreckage of past battles and the abandoned UN posts from which Filipino UN soldiers were kidnapped en masse more than a year ago; the Syrian army now occupies several of these positions, the UN logo still painted on the walls although several of the \\x93igloo\\x94-type UN accommodation huts have migrated to Syrian compounds in the rear lines. The UN force on Golan now operates only inside Israeli-occupied territory.\\nOnly a few hundred yards away from Nusra-held territory, we found Abu Hashem, a farmer who fled from his village, now held by the Islamists, living today in family property close to one of the old UN posts. He fed us tea and coffee and walnuts from his orchard. His wife and six children now exist in this unfinished, cold house along with a small library of books \\x96 the speeches of Imam Ali (the \\x93Najul Blagha\\x94) and a collection of medical books of Aleppo herbal cures for headaches and kidney infection, published in Beirut. He says the people in his Nusra-occupied village are divided. Some are sympathetic towards the Islamists \\x96 they are not fighters \\x96 while others are sometimes permitted by Nusrah to cross the front lines for treatment in Syrian government hospitals. They are Bedouins and farmers, the unsettled and the landowners, always prey to the wolves of civil war insurgents.\\nColonel Saleh, who is 50 years old, has been guarding his echoing and weed-strewn apartment blocks on the edge of Baath City for three years, noting wearily that the Israelis attack his army but never attack Nusra who \\x96 being al-Qaeda \\x96 might logically have earned Israel\\x92s enmity. But no. \\x93I know every stone here,\\x94 the colonel says. \\x93I can see if a rock or a vehicle has moved across the fields in front of us \\x96 and I can immediately see if one vehicle has become two vehicles. We know when they are going to attack \\x96 they always precede their offensives with a big artillery and mortar barrage.\\x94\\nSometimes the voices of Nusra men shout insults at the Syrians on their own radio sets, calling them \\x93kafirs\\x94 \\x96 \\x91\\x93infidels\\x94 or \\x93unbelievers\\x94. \\x93If I am in a good mood, I invite them for coffee,\\x94 Colonel Saleh says. \\x93If I\\x92m in a bad mood, I am silent. Their accents are very similar to the Jordanians. They come from the south of Deraa, along the Jordanian border.\\x94\\nAs we spoke, further down the line, the Syrians and Nusra were fighting with tanks, artillery and mortars. The Syrians claimed that their enemies arrived in several directions in a convoy of at least 13 vehicles. They spoke, too, of a Nusra female officer called Souad al-Qatahani (nicknamed \\x93Al-Nood\\x94), the 30-year-old sister of a Nusrah general called Qais al-Omani who commanded 1,200 fighters. She was, they pointed out rather remarkably, a former first lieutenant in their own Syrian government army.\\nAnd one further feature that the Syrians have noted about their enemies outside Baath City. Whenever Nusra fire a missile, they have to take a photograph of the rocket leaving its launcher \\x96 presumably to prove to their suppliers that they have not sold the weapon to someone else. Trust, as usual in the Syrian war, is in short supply.'"}, "time": 1742563186.9773657}