{"duration": 0.10633683204650879, "input_args": {"text": "'“Be ye therefore perfect . . . even as your Father which is in heaven is perfect.” \\nLet’s compare Christ with the perfected Sufi. First, what are Christ’s teachings on the attainment of perfection? \\nAlmost everyone is familiar with Jesus’ teachings in the Sermon on the Mount. We have all heard of the Master’s injunction to his disciples: “Love thine enemy” and “Turn the other cheek.” These verses from the Gospel of St Matthew are perhaps the most quoted verses in the New Testament: \\n“Ye have heard that it hath been said, An eye for an eye, and a tooth for a tooth: \\nBut I say unto you, That ye resist not evil: but whosoever shall smite thee on thy right cheek, turn to him the other also. \\nAnd if any man will sue thee at the law, and take away thy coat, let him have thy cloke also. \\nAnd whosoever shall compel thee to go a mile, go with him twain. \\nGive to him that asketh thee, and from him that would borrow of thee turn not thou away. \\nYe have heard that it hath been said, Thou shalt love thy neighbour, and hate thine enemy. \\nBut I say unto you, Love your enemies, bless them that curse you, do good to them that hate you, and pray for them which despitefully use you, and persecute you: \\nYe have heard that it hath been said, An eye for an eye, and a tooth for a tooth: \\nBut I say unto you, That ye resist not evil: but whosoever shall smite thee on thy right cheek, turn to him the other also. \\nAnd if any man will sue thee at the law, and take away thy coat, let him have thy cloke also. \\nAnd whosoever shall compel thee to go a mile, go with him twain. \\nGive to him that asketh thee, and from him that would borrow of thee turn not thou away. \\nYe have heard that it hath been said, Thou shalt love thy neighbour, and hate thine enemy. \\nBut I say unto you, Love your enemies, bless them that curse you, do good to them that hate you, and pray for them which despitefully use you, and persecute you; \\nThat ye may be the children of your Father which is in heaven: for he maketh his sun to rise on the evil and on the good, and sendeth rain on the just and on the unjust. \\nFor if ye love them which love you, what reward have ye? do not even the publicans the same? \\nAnd if ye salute your brethren only, what do ye more than others ? do not even the publicans so? \\nBe ye therefore perfect, even as your Father which is in heaven is perfect. \\n(Matt. 5:38-48) \\nHere is a sufi story that addresses the very same concept, but in a different manner; that of strength as opposed to what is typically perceived as weakness. Don’t just read the story, reflect on it, extend it out in your mind and see where it takes you. In that search, you will discover issues within yourself that must be addressed. \\nThere once was a sufi master who was a soldier. \\nDuring a protracted war, he was at one point engaged in fierce, mortal combat. In the thick of furious battle, he finally overcame a vicious, determined foe. Besting the enemy and driving him to ground, the sufi closed in for the kill. \\nAt the very moment he was about to deliver a fatal thrust of his sword to the neck of his prostrate enemy, his foe cried out in anguish, “Ah, If only I had your sword for a single moment, how different things would be!” \\nAt once the sufi stopped his attack and surrendered his sword to his fallen enemy. \\nThe soldier was dumbfounded. \\nTaking the sword from the sufi, he said: “Why did you do this? You could have killed me! I was lost, and now you stop and present me with your sword! Why would you do such a stupid thing? — for it is now I who will kill you! ” \\nThe sufi shrugged. “I come from a family that grants any request, no matter how great,” he replied cooly. “You asked for my sword. I am honor bound to fulfill your request.” \\nThe fallen soldier rose, and recognizing the sufi as a perfected master, returned his sword to him. Falling at the feet of the man who had just spared his life, he asked to become his disciple. \\nFrom that day forth, he followed the sufi as his master. Like this? Share it now.'"}, "time": 1742561851.6752343}