{"duration": 0.051165103912353516, "input_args": {"text": "'HOUSTON  —   The Supreme Court’s ruling Monday tossing out two of the main elements of Texas’ 2013 law regulating abortion, one of the most stringent in the country, has transformed the environment for abortion in the state. Ten abortion clinics that had been in danger of being forced to close  —   about half those still in existence  —   will be allowed to continue operating. The reopening of clinics that already shut their doors became a possibility. And some original opponents of the law  —   including Wendy Davis, the former state senator whose filibuster of the bill brought national attention to the restrictions and set the stage for her unsuccessful bid for governor  —   spoke of feeling vindicated and rejuvenated. “My immediate reaction literally was to burst into tears,” Ms. Davis said on Monday, two days after the third anniversary of the filibuster. “There was so much riding on this. ” Now, after years of the clinics being under siege, there are two main questions about abortion options in the state: Will shuttered clinics reopen, particularly outside the biggest urban areas? And how will Republicans in the Legislature respond to a stinging judicial reversal after a period in which access to abortion has been dramatically reduced? Had the Supreme Court sided with Texas and the 10 clinics closed, the country’s   state by population and by size would have been left with nine abortion facilities. A decision upholding the law would have allowed the measure to be fully put into effect for the first time since the   Legislature passed it in July 2013, and would have shut four clinics in Houston, two in El Paso and one each in Austin, Fort Worth and San Antonio, as well as one in McAllen temporarily. Republican leaders quickly condemned the ruling. The Texas attorney general, Ken Paxton, whose lawyers defended the state in the case, said in a statement on Monday that the law was “an effort to improve minimum safety standards and ensure capable care for Texas women. ” He said the ruling took “the ability to protect women’s health out of the hands of Texas citizens and their duly elected representatives. ” Two of the law’s four provisions were ruled unconstitutional. One required clinic doctors performing abortions to obtain admitting privileges at a nearby hospital, and the other mandated that all clinics, even those that provided nonsurgical medication abortions, meet the same standards as   surgical centers. Three provisions, including the   requirement, had been in place statewide with only a few exceptions. The   rules had never been enforced, because of litigation. Much remained unclear after the ruling, including how many abortion clinics that had closed would reopen and when. Abortion rights advocates said that shuttered clinics would not open again immediately and that it might take years for new clinics to establish themselves. In May 2013, two months before Gov. Rick Perry signed the bill into law, Texas had 41 facilities providing abortions. In November 2013, after the   requirement was put in place, there were 22. “We’ve had to let leases go or sell buildings that had mortgages,” said Amy Hagstrom Miller, the president and chief executive of Whole Woman’s Health, which operates abortion clinics in Texas and was the lead plaintiff. “You’ve got to find physicians and rehire staff and go through relicensing processes, and get equipment and instruments and medicine. It’s not something that is going to happen overnight. ” Nan Little Kirkpatrick, the executive director of the Texas Equal Access Fund, which provides financial assistance to women seeking abortions in the northern half of the state, predicted that some clinics would reopen, especially in the Panhandle region, which has none. “One reason we saw providers close was because they couldn’t get staff to stay on, with their jobs completely up in the air,” she said. “Now that we have some assurance from the Supreme Court, I think it will be easier for providers to attract and keep staff. ” Supporters of the law said it was too early to say what their next steps would be, but they appeared to show no signs of signaling defeat. Lt. Gov. Dan Patrick, a Republican who serves as the president of the Texas Senate, vowed to have senators “revisit” the issue. “We’re going to go through this line by line and see what it is that we can address in a way that a Supreme Court would approve,” Mr. Patrick said. “I’m clearly   but if someone’s going to have an abortion, I want them to have it in the safest possible environment. ” Texas had been experiencing what critics of the law called an “abortion access crisis,” with 19 clinics in a state with 5. 4 million women of reproductive age. If that number had fallen to nine, abortion rights advocates said, the remaining clinics could not have met demand. Waits for appointments would have increased, they said, and more women would have attempted to   abortions using   drugs. There had been much confusion and uncertainty among women seeking abortions in Texas. Reproductive Services, one of two abortion clinics in El Paso, closed in June 2014, but reopened at a new location last fall after the Supreme Court temporarily blocked full enforcement of the law. “Some of the other clinics may be able to reopen, but it’s very difficult,” said Gerri Laster, the clinic’s executive administrator. “We went down that road, and it took us almost six months to get our license back. And that was after having a license for 25 years with no deficiencies, meeting all the state requirements. ” Ms. Laster said her clinic sold all its equipment when it closed, expecting it would be impossible to reopen. It spent $50, 000 to $100, 000 to get back in business, she added. The clinic used to see about 40 patients a week but now sees 20, largely because many women are unaware it reopened, she said. Had Reproductive Services and the other El Paso clinic closed, women there would have had to go to New Mexico or drive more than 500 miles to the nearest clinic in Texas. “It’s like a rock has been released from our stomachs,” Ms. Laster said.'"}, "time": 1742628472.7063324}