{"duration": 0.06365728378295898, "input_args": {"text": "'Labour has sacked a general election candidate who campaigns for workers’ rights after allegations the prospective MP for a safe Conservative seat had ‘liked’ a series of ‘Islamophobic’ posts on Twitter over the years. [The former Labour candidate, Trevor Merralls, is the general secretary of   cooperative United Cabbies Group (UCG) and a black cab driver in London. He previously penned an article published in The Guardian in which the   black cab driver slammed taxi firm Uber for “eroding one of the only paths London’s   kids still have to get a stable job at a time when social mobility has screeched to a halt”.  The decision to ditch Mr. Merralls as the candidate for Old Bexley and Sidcup followed an investigation by Labour which centred around a Twitter account with the handle @wellingboyblue. According to the Independent, the   account “‘liked’ a number of racist and Islamophobic messages over the course of the last few years”. Merralls, who denies the account belongs to him, said in a post on social media: “Already the smears and fake tweets have begun. I’ve been through this before. I’m standing in a safe Tory seat. What are they so afraid of?” “Uber accessed highest level of government and used ministers like paid up lobbyists. Made up, cropped, and photoshopped tweets wont shut me up. ” He added: “That’s categorically not me. ” Activists have pointed to the fact @wellingblueboy identified themself as “trev” and said it was a taxi driver in London and campaigner with the UCG as evidence that Merralls is behind the account. One of the account’s posts which the Independent highlights is a message dating back to March 2014, in which @wellingblueboy said Europe should “eradicate Islam from our continent”. Another aspect of the account the left wing website identified as having been offensive to Labour Party officials was how, at one point, @wellingblueboy identified themself as a supporter of the     correctness BlueHand movement. The organisation’s website says: “Free Speech is a fundamental right, one that is   given. Sadly, it is also a right that our politicians are attempting to take from us, thanks to the appeasement of Islamism coupled with the constant   of certain minority groups. ”'"}, "time": 1742562269.268151}