{"duration": 0.16287446022033691, "input_args": {"text": "'By Rev. Peter M. J. Stravinskas, Ph.D., S.T.D. October 28, 2016 \\nTwice in six months I find myself reviewing works by my dear old friend Joe Sobran. This time around, the Fitzgerald Griffin Foundation has treated us to an anthology of Joe’s essays on Bill Clinton during his two terms in the White House. What strikes the reader immediately is the incisive analysis: Joe cuts to the chase; while being spot-on, he never descends into boorishness or uncivilized prose, which he would have deemed unworthy of a Christian gentleman. Now, of course, in our present culture of hypersensitivity, some might feel “threatened” by his honesty – but that just shows how far we have fallen in so short a time. The other point to keep in mind is that while many took exception to what Joe wrote about Bill (and Hillary) – or Billary since it was Bill himself who promised (or warned) us that we were getting two for the price of one – no one has ever been able to dispute the accuracy of the commentary. \\nI am writing these reflections with a bit more than two weeks before what is arguably the most unpleasant presidential election in history. Sobran’s insights into the character (or lack thereof) of both Bill and Hillary are helpful as one tries to look into his crystal ball to determine what eight years of the former First Lady-turned-President might look like. We also can surmise what Joe would have thought of Donald Trump. \\nIn that light, we can read Sobran’s final paragraph introducing the first edition of this book in 2000: “Clinton has finally defined himself. By surviving the attempt to remove him from the office he has so filthily disgraced, he also defines our age. It says more about us than about him that he stands condoned.” Sobran grimly concluded a 1997 lecture thus: “I’m beginning to think democracy is the cruelest form of government, because it gives people exactly the kind of leaders they deserve. We finally have one who is so transparent that we can hardly complain we’ve been betrayed.” Or, as European friends of mine have been saying for months: “With over three hundred million people, are Trump and Clinton the best you could do?” \\nWho could disagree with the assessment that “liberalism is at war with Christian culture”? Or what about “Republican stupidity” causing our political meltdown for years? \\nAs a lifelong educator, I perked up upon reading: “[This] used to be a country where high-school students learned Latin and Greek; today college students take ‘remedial English’ and can listen to Cliffs Notes on audiotape. And we’re told our best days lie ahead of us!” Indeed, having taught in a community college for the past couple of years and encountering for the first time the products of American “public education,” I can only wince at the thought of the majority of these students voting in any election. Indeed, in a political philosophy class, no one had ever heard of either Winston Churchill or the Magna Carta. Of course, Plato asserted that a republic could not survive without an educated populace – and thus republics tend to devolve into dictatorships – another theme underscored by Sobran. \\nThis gem tends to encapsulate the socio-political landscape perfectly: “It’s all summed up in the word ‘judgmental.’ This idiotic word says it all: the final censure of a relativist age. It’s wrong to say anything is wrong. You must be punished for advocating punishment.” Which reminded me of Pope Benedict XVI’s talk of the “dictatorship of relativism” and Philadelphia Archbishop Charles Chaput’s recent appeal for more “judgmentalism”! \\nGood Catholic that Joe was, his political positions don’t fit neatly into American partisan camps. While “conservative” on issues like abortion, traditional marriage and school choice, he recoiled from unrestrained American interventionism. Like St. John Paul II, he saw what U.S. involvement in the Middle East would bring and considered Bill Clinton’s eagerness for such to be a smokescreen to divert attention from his personal scandals. \\nOn Hillary’s “enabling” behavior in regard to Bill’s dalliances, Sobran is brutally frank: “Mrs. Clinton is playing a curious role. She is the senior wife in what amounts to a walk-in harem. As long as she retains her primacy, she appears not to be jealous of the other women.” Further: “Stalin, for some reason, reminds me of Hillary Clinton. The general view is that she is ‘standing by her man.’ My view is a little different. I think she supports her husband for the same unromantic reason Stalin made his alliance with Hitler.” \\nForgetfulness seems to be a Clinton family trait: “Tragically, our nation has now, for the second time in a few years, seen a president afflicted with Alzheimer’s. Bill Clinton’s fabled memory has broken down. During his August 17, 1998 grand jury testimony, it failed him dozens of times. It’s a shame, because he really needs his memory now. He’s been the victim of so many lying and designing women: Gennifer Flowers, Paula Jones, Kathleen Willey, Linda Tripp, and Monica Lewinsky. He has disputed their accounts of his behavior with as much vigor as a memory-impaired person can, but it’s tough. On the other hand, one advantage of having Alzheimer’s is that you keep meeting new women.” At last count, amnesia struck Hillary 39 times during her FBI encounter. \\nReturning to the state of our national soul, Sobran hits the nail on the head: “A lot of people support Clinton even though they don’t doubt that he committed sexual offenses (not all of them ‘consensual’), perjured himself, solicited perjury from others, lied to the public, and generally broke laws to cover up his offenses. Our traditional morality, public and private, has seriously eroded. The ‘idealism’ of the Sixties has rotted into the nihilism that was always latent in it.” As a priest, I was initially stunned by the willingness of people to overlook Clinton’s immorality until I realized that behind it all was the notion that “compared to him, I look pretty good.” \\nAnd how can we neglect to mention abortion – the eighth sacrament for the Clintons (or perhaps their first and only sacrament)? Eighteen years ago and sounding eerily like Trump in Debate #3, Joe wrote: “Clinton and his ilk are willing to kill children on the very verge of birth, and the phrase ‘partial birth’ abortion concedes too much: it isn’t ‘abortion’ except in a ‘legally accurate’ sense. It’s murder of an infant. The technique of extracting the brains and crushing the skull was developed precisely to stay within the law as the U.S. Supreme Court has warped it.” \\nWith all the Clinton banter about women’s rights, Joe zeroes in on their ultimate inconsistency and hypocrisy when abortion and choice are linked to Communist China: “If ‘choice,’ rather than abortion as such, is the point, you’d think the Clintons and the feminists would be outraged by the Chinese policy of forcing women to have abortions after the first (or in some cases, the second) child. It’s hard to imagine a more barbarous tyranny. . . . In her syndicated column the week of the trip, Hillary (‘It takes a village’) Clinton wrote about the problems of Chinese women. She cited jobs, education, workplace discrimination – but not forced abortion. Apparently the government’s power to control women’s bodies with the most total and cruel rigor isn’t an important concern among them. Neither did feminists at home make any noise about forced abortion.” \\nSince sex comes up so often when Bill is on the horizon, Sobran’s comments on that matter are worth pondering: “[Clinton] finds it easy to trash women when he is through with them because, to him, women are trash in the first place. His preference for oral sex, the leitmotiv of his scandals, says volumes about his regard for the opposite sex. So does his inability to remember Monica Lewinsky’s name after several sessions.” Since Joe was always an equal-opportunity commentator, he might be just as put off by Trump’s “locker-room” talk, even if the alleged actions didn’t follow on the words. Joe would probably also note that the entire Clinton legacy has promoted both dirty talk and immoral action. \\nIn a homily last Sunday, I shared with the congregation my personal voting record. To wit: I have always voted for the Republican candidate (because the alternatives were so morally bankrupt I could not countenance them); after Reagan II, I voted for the Republican “with a clothespin on my nose” and will be doing the same this time around. I suspect that if Joe were still among us, he might be looking for a clothespin, too. Tags:'"}, "time": 1742562156.1939054}