{"duration": 0.20943593978881836, "input_args": {"text": "'The Italian writer Italo Calvino defined a classic as “a book that’s never finished saying what it has to say. ” This year, The Times’s daily critics reviewed nearly 250 titles. What follows are their lists of the fiction and nonfiction books that most moved, excited and enlightened them in 2016  —   books that, in their own ways, are perhaps not finished saying what they have to say. The New York Times has three daily book critics: Michiko Kakutani, Dwight Garner and Jennifer Senior. Because they review different titles, it is impossible for them to compile a single unanimous Top 10 list. They have favorites, however, and are happy to have a chance to list them here. There is also a list from Janet Maslin, who has stepped down from   reviewing but remains a frequent contributor of reviews to The Times. The critics have presented their lists in rough order of preference. ‘MOONGLOW’ By Michael Chabon (Harper). Told as a faux memoir, this moving novel recounts the story of the narrator’s grandfather: a    Augie   hero  —   a former soldier who’s also a dreamer, roughneck, pool shark and jailbird, by turns naïve and proud, impulsive and romantic. Mr. Chabon is one of the most gifted prose stylists at work today, and he writes here with both easy lyricism and caffeinated ardor, capturing his hero’s love affair with a French refugee (who becomes his wife) and his growing obsession with the moon shot and the space race. Through the lives of these two World War II survivors, he gives us an indelible portrait of one family and America’s lurching progress through the 20th century. (Read the review.) ‘HITLER: ASCENT,  ’ By Volker Ullrich (Alfred A. Knopf). How did a man described as a “  rascal” and “pathetic dunderhead” rise to power in the land of Goethe and Beethoven? Why did millions of ordinary Germans embrace him and his doctrine of hatred? How did this “most unlikely pretender to high state office” assume complete control of a once democratic country and set it on a monstrous course through history? In this insightful and revealing biography, Mr. Ullrich shows how Hitler used an arsenal of demagogic tools (lies, fake promises, theatrical rallies, mantralike phrases) to exploit a “constellation of crises” in   War I Germany, including economic woes, unemployment and political dysfunction. He argues that Hitler’s rise was not inevitable but that his domestic adversaries failed to appreciate his ruthlessness, while foreign statesmen naïvely believed that they could control his aggression. His book shows just how the unthinkable can happen. (Read the review.) ‘NIGHT SKY WITH EXIT WOUNDS’ By Ocean Vuong (Copper Canyon Press). These fierce, startling poems capture the history of prejudice in America (where “trees   the weight of history”) and the hopes and fears that bring immigrants to its shores. Mr. Vuong  —   who was born on a rice farm outside Saigon in 1988 and was the first in his immediate family to learn to read  —   writes with a musical appreciation for the sound and rhythm of words. He has a talent for capturing stories and memories (like those of his grandmother, who remembers the fall of Saigon) in unexpected and searing images, and uses the magic of language here to turn “bones to sonatas” and by pressing pen to paper, to touch his family “back from extinction. ” (Read the review.) ‘LAB GIRL’ By Hope Jahren (Alfred A. Knopf). The geobiologist Hope Jahren possesses the two attributes Nabokov deemed essential to the writer: “the precision of a poet and the imagination of a scientist. ” Her memoir communicates the electric excitement of a scientific discovery the discipline and tedium involved in conducting   experiments and the arduous, sometimes thrilling experience of fieldwork. The volume is, at once, an enthralling account of her discovery of her vocation, and a gifted teacher’s guidebook to the secret lives of plants  —   a book that should do for botany what Stephen Jay Gould’s writings did for paleontology, and what Oliver Sacks’s essays did for neurology. (Read the review.) ‘THE NORTH WATER’ By Ian McGuire (Henry Holt). This novel about a   whaling expedition is as gory as Sondheim’s “Sweeney Todd,” as darkly melodramatic as a classic Jacobean drama. Its villain, Henry Drax, is a monster, reminiscent of the demonic Judge Holden in Cormac McCarthy’s operatic masterpiece “Blood Meridian” and the sadistic bully Wolf Larsen in Jack London’s “The  ” and its   plot reverberates with echoes of “” “Lord Jim” and “The Narrative of Arthur Gordon Pym of Nantucket. ” Thanks to its author’s gifts as a writer, however, the novel never reads like a   literary homage, but instead emerges as a gripping and original act of bravura storytelling that immerses us in a Darwinian world that is as unforgiving as it is bloody. (Read the review.) ‘BORN A CRIME: STORIES FROM A SOUTH AFRICAN CHILDHOOD’ By Trevor Noah (Spiegel  Grau). Best known as the host of “The Daily Show,” Mr. Noah brings to his comedy an outsider’s gift for observation and an instinctive radar for the absurdities of life. His sense of humor was forged during his childhood in South Africa, where he grew up the son of a Xhosa mother and a   father  —   a relationship whose very existence violated that country’s racial laws during the apartheid era. Mr. Noah gives us a harrowing understanding of what it was like to grow up in a society where questions of race permeated every aspect of daily life, and at the same time has written a deeply affecting love letter to his mother, Patricia Nombuyiselo Noah, a remarkable woman who was determined that her son “be free to go anywhere, do anything, be anyone. ” (Read the review.) ‘THE RETURN: FATHERS, SONS AND THE LAND IN BETWEEN’ By Hisham Matar (Random House). The author’s father, Jaballa Matar, a leading Libyan dissident, was kidnapped in 1990 by agents for that country’s dictator Muammar   and sent to the notorious Abu Salim prison in Tripoli. In this beautifully chiseled book, the younger Mr. Matar chronicles his   search for his missing father, whose absence has haunted him for decades. It’s a detective story of sorts, with Mr. Matar trying to piece together what happened to his father after his arrest. It’s also a story of exile  —   how the author, his brother and their mother tried to invent new lives for themselves abroad  —   and a story of what’s happened in Libya and the Middle East, as hopes fostered by the Arab Spring crashed and burned in one country after another. (Read the review.) ‘NUTSHELL’ By Ian McEwan (Nan A. Talese). It sounds like a ridiculous premise: a novel narrated by a talking fetus who’s a kind of Hamlet in utero  —   a    (or    as the case may be) who eavesdrops on the affair between his mother, Trudy, and his Uncle Claude. It’s a tribute to Mr. McEwan’s inventiveness and sleight of hand that he turns this incongruous setup into a small tour de force that showcases his gifts as a writer  —   his authority, his imaginative verve, his sly delight in the gymnastics words can perform  —   while conjuring the uncertainties of a contemporary world, troubled by social upheaval, new and old inequities and unexpected political change. (Read the review.) ‘THE UNDERGROUND RAILROAD’ By Colson Whitehead (Doubleday). In this haunting novel, Mr. Whitehead turns the Underground Railroad from a metaphor into an actual train that ferries fugitives north. In doing so, he’s written a potent, hallucinatory novel that leaves us with a devastating understanding of the terrible human costs of slavery. He’s found an elastic voice that accommodates both brute realism and fablelike allegory, the   and the poetic  —   a voice that enables him to convey the emotional fallout of slavery with raw, shocking power, reminding us, in Faulkner’s words: “The past is never dead. It’s not even past. ” (Read the review.) ‘THE REVENGE OF ANALOG: REAL THINGS AND WHY THEY MATTER’ By David Sax (PublicAffairs). In this captivating book, the reporter David Sax provides an entertaining account of how analog technologies are enjoying a spirited revival: vinyl record sales are booming,   cameras have caught on among millennials and their younger siblings, and   paper notebooks and erasable whiteboards have become a   option in many Silicon Valley offices. In an increasingly digital age, Mr. Sax reminds us of the human craving for tactile, physical things, and the persistence of the real. (Read the review.) Follow Michiko Kakutani on Twitter: @michikokakutani ‘THE SPORT OF KINGS’ By C. E. Morgan (Farrar, Straus  Giroux). This ravishing and ambitious   novel, set in Kentucky, is a   epic. The author has a special and almost Darwinian interest in consanguinity, in the barbed things that are passed on in the blood of people and of horses, like curses, from generation to generation. (Read the review.) ‘WHAT BELONGS TO YOU’ By Garth Greenwell (Farrar, Straus  Giroux). This short, incandescent first novel opens as two men meet in a public bathroom beneath the National Palace of Culture in Sofia, the capital of Bulgaria. Thus begins a complicated relationship, so tangled that it allows the talented Mr. Greenwell to parse the largest questions about human loyalty, compassion and desire. (Read the review.) ‘WHITE TRASH: THE   UNTOLD HISTORY OF CLASS IN AMERICA’ By Nancy Isenberg (Viking). Ms. Isenberg retells United States history in a manner that not only includes the weak, the powerless and the stigmatized but places them front and center. As such, she has written an eloquent volume that is more discomforting and more necessary than a semitrailer filled with new biographies of the founding fathers and the most beloved presidents. (Read the review.) ‘BORN TO RUN’ By Bruce Springsteen (Simon  Schuster). Mr. Springsteen’s memoir is big, loose, rangy and intensely satisfying. It has not been utterly sanitized for anyone’s protection, and it is closely observed from end to end, especially on subjects like sex, art and social class. The Boss could have phoned this book in. He didn’t. (Read the review.) ‘COLLECTED POEMS  ’ By Rita Dove (Norton). Ms. Dove, a former poet laureate of the United States, writes poems that have earthiness, originality, power and range. There are so many casual pleasures in her work that the precision and dexterity  —   the darkness, too  —   can catch you unawares. This is a major collection. (Read the review.) ‘ALBERT MURRAY: COLLECTED ESSAYS AND MEMOIRS’ By Albert Murray (Library of America). This is a plump and welcome volume from a seminal American critic. Murray’s great subject was the primacy of jazz and the blues in American cultural life. He built complex arguments about how these forms were vastly more than untutored improvisation, and about how music allowed black people to tell their story in ways that literature often could not. This is an enormous book that feels intimate. (Read the review.) ‘HERE I AM’ By Jonathan Safran Foer (Farrar, Straus  Giroux). Mr. Foer’s first novel in 11 years is a divorce novel and a      novel and running below the narrative, like a headline news ticker, is a plausible dystopian nightmare. I was too hard on this book in my review. It has stuck with me. Its observations are crisp its jokes are funny its intimations of doom resonate. (Read the review.) ‘KENNETH CLARK: LIFE, ART AND ‘CIVILISATION’ By James Stourton (Knopf). Mr. Clark was a   figure of cultural life in Britain during the 20th century. An art historian, he was the crusading director of the National Portrait Gallery during World War II and later the erudite host of the pathbreaking BBC series “Civilisation. ” This biography tells his complicated story with sensitivity, grace and wit. (Read the review.) ‘ALL THAT MAN IS’ By David Szalay (Graywolf). Mr. Szalay writes with voluptuous authority. His collection of subtly linked short stories  —   the title is deeply ironic  —   is about masculinity under duress. This meticulous and persuasive book is a vehicle for pain and insult. It’s about invidious distinctions, the ways men compare themselves to other men and come up short. (Read the review.) ‘THEY CAN’T KILL US ALL: FERGUSON, BALTIMORE, AND A NEW ERA IN AMERICA’S RACIAL JUSTICE MOVEMENT’ By Wesley Lowery (Little, Brown). Mr. Lowery has written an electric book about the shootings of unarmed black men by the police. His account is well reported, plainly told and evidently the work of a man who has not grown a callus on his heart. It contains a great deal of reporting, yet never feels like a data dump. (Read the review.) Follow Dwight Garner on Twitter: @DwightGarner ‘EVICTED: POVERTY AND PROFIT IN THE AMERICAN CITY’ By Matthew Desmond (Crown). I’ve come to think of “Evicted” as a comet book  —   the sort of thing that swings around only every so often, and is, for those who’ve experienced it, pretty much impossible to forget. It regally combines policy reporting and ethnography, following eight families in Milwaukee as they struggle to find that most basic human necessity: shelter. After reading “Evicted,” you’ll realize you cannot have a serious conversation about poverty without talking about housing. You will also have the mad urge to press it into the hands of every elected official you meet. The book is that good, and it’s that unignorable. Nothing else this year came close. (Read the review.) ‘IN THE DARKROOM’ By Susan Faludi (Metropolitan Books). An absolute stunner of a memoir from Ms. Faludi, whose father, a   survivor of the Holocaust, decided at 76 to have a   operation. Ms. Faludi has spent a lifetime interrogating conventions of gender, which makes her the ideal narrator for such a story, told with equal parts skepticism and sympathy. Who knew she’d find the ultimate subject under her own roof? (Read the review.) ‘HILLBILLY ELEGY: A MEMOIR OF A FAMILY AND CULTURE IN CRISIS’ By J. D. Vance (Harper). A compassionate, discerning sociological analysis of the white underclass that helped power the presidential victory of Donald J. Trump, written by a young man who knows whereof he speaks. You may quarrel with Mr. Vance’s conclusions  —   he holds his hillbilly kin personally responsible for much of what ails them  —   but the love he feels for his culture is palpable, and his book is intelligible to Democrats and Republicans alike. Imagine that. (Read the review.) ‘COMMONWEALTH’ By Ann Patchett (Harper). An exquisite novel about escaping the cage of childhood, which for some involves more tools and a stronger crowbar than your average jailbreak. The pain and challenges of marriage, parenthood, blended families  —   all are subjects Ms. Patchett explores with her customary sensitivity so, too, is the redemptive power of art. Be prepared to cry uncontrollably on Page 297. (Read the review.) ‘THE ARAB OF THE FUTURE 2: A CHILDHOOD IN THE MIDDLE EAST,  ’ By Riad Sattouf, translated by Sam Taylor (Metropolitan Books). The second installment of the exuberantly heretical graphic memoir of Mr. Sattouf, a   cartoonist who once had a weekly comic strip in Charlie Hebdo. This volume focuses on his first year of school in Ter Maaleh, Syria. The children remain little beasts his father remains a baron of bluster and a deluded idealist, still smitten with the promise of  . His   mother tolerates it, but you can already see where their family life is headed  —   south  —   which will inevitably mean moving north, to France. (Read the review.) ‘DO NOT SAY WE HAVE NOTHING’ By Madeleine Thien (Norton). Here are the opening two lines of Ms. Thien’s gorgeous, sorrowful novel about the horrors of the Chinese Cultural Revolution: “In a single year, my father left us twice. The first time, to end his marriage, and the second, when he took his own life. ” They reel you in, and you never stop reading. A whole world of embattled classical musicians and brave dissidents pops in three dimensions. (Read the review.) ‘BLOOD AT THE ROOT: A RACIAL CLEANSING IN AMERICA’ By Patrick Phillips (Norton). Stories of savage racism and judicial burlesque were depressingly common in the Jim Crow South, but the tale this book tells is far more astonishing than most: In response to one girl’s murder  —   almost certainly not committed by the three black suspects who were hanged for it  —   the residents of Forsyth County, Ga. drove out all   in 1912, and white that county stayed, right through the end of the 20th century. Mr. Phillips adds texture and context to this shameful,   episode. It’s a powerful reminder that a century isn’t a very long time for hate to dissolve. (Read the review.) ‘HERO OF THE EMPIRE: THE BOER WAR, A DARING ESCAPE AND THE MAKING OF WINSTON CHURCHILL’ By Candice Millard (Doubleday). A thrilling account of the young Winston Churchill’s heroics in the South African Republic in 1899, which culminated in a prison break and nine days on the run. This book is a   and   character study rolled into one: The man who would be prime minister spilled over with bravado, brains and awesome   even as a youth. Could someone be persuaded to make a movie about this episode of his life? I’d watch. (Read the review.) ‘GRACE’ By Natashia Deón (Counterpoint). A dazzling, underappreciated debut novel about a runaway slave, the daughter she never gets to hold, and the saintly man who raises the child instead. Ms. Deón writes with her nerves  —   she’s got a terrific knack for suspense  —   and thinks with her heart, showing just how devastating slavery was to families, and just how powerful maternal love can be. I’d watch a movie of this one, too. (Read the review.) ‘HIGH DIVE’ By Jonathan Lee (Knopf). A vibrantly cinematic (again!) novel about the 1984 plot to kill Margaret Thatcher at the Grand Hotel in Brighton. The beauty of this book lies not just in its prose  —   which, by the way, will shame just about anyone who writes for a living  —   but also in its vulnerable, highly appealing characters, including the Irish Republican Army man who’s tasked with doing the deed (a   accomplice to the   Patrick J. Magee). The tension in the book becomes so overpowering that it takes a monk’s restraint not to flip to the end. I am not a monk. (Read the review.) Follow Jennifer Senior on Twitter: @JenSeniorNY ‘WHEN BREATH BECOMES AIR’ By Paul Kalanithi (Random House). Dr. Kalanithi, a neurosurgeon, had literary ambitions long before he diagnosed his own terminal cancer. He wrote his first book during his last months, with all the joy and hardships that job entailed. To read it is to engage with it actively, thanks to the incisive questions he asked about his life and the enormous immediacy he brought to every page.   and unforgettable, it’s the book I have given as a gift most often in 2016. (Read the review.) ‘HEAT AND LIGHT’ By Jennifer Haigh (Ecco). Ms. Haigh has set many of her lifelike stories Bakerton, a fictitious mining town not unlike the place in Pennsylvania where she grew up. “Heat and Light,” her biggest novel yet, is a sweeping Bakerton tour de force with a contemporary time frame. The book’s subject may sound shockingly unsexy, but you will be amazed by what Ms. Haigh does with the incursion of fracking into this unguarded little world. (Read the review.) ‘VICTORIA: THE QUEEN: AN INTIMATE BIOGRAPHY OF THE WOMAN WHO RULED AN EMPIRE’ By Julia Baird (Random House). Ms. Baird’s uncommonly frisky biography is outstanding for its liveliness and originality. It whisks away any cobwebs of Victorianism from its portrait of a willful, complicated queen whose own father sized her up as “rather a pocket Hercules, than a pocket Venus. ” Ms. Baird’s access to previously unexplored source material casts very new light on her subject. ‘THE TRESPASSER’ By Tana French (Viking). Ms. French has been a corker among crime writers ever since “In the Woods” won the Edgar for best first novel. But her sixth, “The Trespasser,” has expanded her renown. It features Antoinette Conway, the lone woman on the Dublin Murder Squad, who has to put up with    harassment while she tackles the murder of a woman who seems eerily familiar. Be warned: This book is a   ticket to its five predecessors. Ms. French is no genre author. She’s a   novelist who just happens to see dead people at the centers of her stories. (Read the review.) ‘AT THE EXISTENTIALIST CAFÉ: FREEDOM, BEING, AND APRICOT COCKTAILS’ By Sarah Bakewell (Other Press). This is a surprisingly personal book for its author. She became a devotee of Sartre and the existentialists as a teenager. Decades later, she revisits their philosophies and personalities, as well as those of the phenomenologists who influenced them. If this sounds chilly and abstract, it is not. Ms. Bakewell is a wonderful explicator and a highly opinionated one. She makes both her ideas and her affections clear. A tough but splendid book on what, she demonstrates, is a newly fresh school of thought. (Read the review.) ‘TRUEVINE: TWO BROTHERS, A KIDNAPPING AND A MOTHER’S QUEST: A TRUE STORY OF THE JIM CROW SOUTH’ By Beth Macy (Little, Brown). Ms. Macy, whose reporting led to “Factory Man,” a stunning account of what globalization had done to an Appalachian furniture factory and its owners and workers, has once again mined the area for nonfiction. This time, her story revolves around George and Willie Muse, albino   brothers born into a region where there was simply no place for them they disappeared after a recruiter for the circus came to town. The Muse family always believed that they’d been stolen. But Ms. Macy balances compassion and doggedness in pushing past that easy answer. (Read the review.) ‘NEWS OF THE WORLD’ By Paulette Jiles (William Morrow). Set in the winter of 1870, this vigorous National Book Award nominee tells the story of Capt. Jefferson Kyle Kidd, an itinerant news reader in Texas who is asked to make a journey. Would he please go to the San Antonio area to return a white girl “rescued” from the Kiowa Indians to what remains of her family? In Ms. Jiles’s exquisite, unsentimental voice, this novel describes the captain’s journey with the initially surly    he calls Johanna. The novel abounds with the joys of freedom, the adventure of traversing untamed Texas and the discovery of unexpected, proprietary love. (Read the review.) ‘WE LOVE YOU, CHARLIE FREEMAN’ By Kaitlyn Greenidge (Algonquin). Ms. Greenidge’s daringly abrasive debut novel begins with an absurd premise: What if the members of a black family agreed to move to a very white part of the Berkshires and, for scientific purposes, raise a chimp named Charlie as one of their children? That family, the Freemans, lands at a large gated pile called the Toneybee Institute and is much too warmly welcomed. This happens in 1990, but the book also has a section (and a brave heroine) at Toneybee in 1929  —   and it’s here that Ms. Greenidge’s ferocity breaks through. When the real nature of all the institute’s “science” is exposed, she steers her gutsy book toward a devastating conclusion. (Read the review.) ‘IQ’ By Joe Ide (Mulholland Books). This is the start of a   comedic crime franchise with a bright future. Isaiah Quintabe (IQ for short) is an unlikely Sherlock, an incongruously polite cogitator operating out of gangsta turf in East Long Beach, Calif. The commercially savvy Mr. Ide has cast this book well: It features a hugely famous but   rapper IQ’s sidekick, a petty crook named Dodson Dodson’s loudmouthed girlfriend and IQ’s dead older brother, who serves as his conscience and really, really loved Motown. Aggressively entertaining plotting is paired with the kind of dialogue for which readers love Don Winslow. This series is a Los Angeles classic right from the start. (Read the review.) ‘BEFORE THE FALL’ By Noah Hawley (Grand Central). Beach book of the summer. Imagine that Agatha Christie had set a   mystery on an airplane and included Wall Street and entertainment executive types in her lineup of suspects. Now imagine that airplane crashing into the Atlantic before the story even gets going. Foul play, of course. Anyone on the plane could have been the reason it went down. And the poor survivor  —   not an oxymoron here  —   will catch hell just for being alive. Mr. Hawley, the expert TV showrunner, obviously had the skills to pull this off. Good thing he had the free time, too. (Read the review.)'"}, "time": 1742628513.2239406}