{"duration": 0.049550533294677734, "input_args": {"text": "'Screen legend Sir Michael Caine weighed in on Britain’s decision last year to separate from the European Union, saying his own vote to leave was about “freedom. ”[“I voted for Brexit   …     what it is with me, I’d rather be a poor master than a rich servant,” the    Going in Style star told Sky News, adding that his support for Britain’s independence “wasn’t about the racism, immigrants or anything, it was about freedom. ”  Last week, the United Kingdom officially filed to leave the European Union. Caine, a       said “politics is always chaotic. ” “In politics you’re always going into areas you’ve never been before, so you’re going to get lost and then you’re going to find your way, and then it’ll be alright,” he said of Europe’s historic vote. Caine is currently promoting his last film Going in Style, which follows three lifelong friends who rob a bank after it stops paying out their pensions. “I’m playing Brian Reader, who when he did that robbery was 73,” Caine said. “I knew I was going to get a phone call, I said to my wife ‘here’s my next part, I think’. ” And if you were wondering, don’t expect the    star to stop acting anytime soon. “People always say ‘are you going to retire?’ and of course the movie business retires you,” Caine said, adding “You get paid a fortune for kissing the most beautiful women in the world, not a bad job is it?” Caine isn’t the only British celebrity to have revealed he voted for Brexit. Last month, Roger Daltrey, founder and lead singer of the English rock band The Who, reiterated his support for Britain’s independence from the European Union. “We are getting out, and when the dust settles I think that it’ll be seen that it’s the right thing for this country to have done, that’s for sure,” Daltrey told NME.   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742563233.1712244}