{"duration": 0.13611388206481934, "input_args": {"text": "'MEXICO CITY  —   An international panel of experts brought to Mexico to investigate the haunting disappearance of 43 students that ignited a global outcry say they cannot solve the case because of a sustained campaign of harassment, stonewalling and intimidation against them. The investigators say they have endured carefully orchestrated attacks in the Mexican news media, a refusal by the government to turn over documents or grant interviews with essential figures, and even a retaliatory criminal investigation into one of the officials who appointed them. For some, the inevitable conclusion is that the government simply does not want the experts to solve the case. “The conditions to conduct our work don’t exist,” said Claudia Paz y Paz, a panel member who earned international recognition for prosecuting a former Guatemalan dictator on charges of genocide. “And in Mexico, the proof is that the government opposed the extension of our mandate, isn’t it?” The pressure on the investigators  —   described by four of the five panel members in interviews with The New York Times  —   undermines promises by the Mexican government to cooperate fully and uncover what happened to the students, one of the worst human rights abuses in the country’s recent memory. Hundreds of thousands flooded the streets to protest the disappearances, sending President Enrique Peña Nieto’s approval ratings plummeting and contradicting his effort to depict Mexico as a progressive nation ready to assume its place on the world stage. Instead, the case exposed the impunity tearing at the seams of the rule of law. The international investigators say that their job is far from complete. But they will leave Mexico in the coming days nonetheless  —   pushed out, they say, by a government many suspect of covering up what actually happened on the night in September 2014 when the 43 college students were abducted by the police and never seen or heard from again. By contrast, the Mexican government says that it has fully cooperated with the experts, completing the vast majority of their information requests, while it is still processing the rest. For the families of the missing, young men training to be teachers in the impoverished stretches of rural Mexico, the experts’ departure is devastating. All along, they have refused to believe the government’s version of events  —   that their children, who were in the city of Iguala as part of a protest, were kidnapped by local police officers working for powerful criminal gangs, then killed and incinerated in the garbage dump of a nearby town. In its version of the story, the government never gave a clear motive for the attack. But for many Mexicans, the case represents something far greater than 43 people: It is a window onto the tens of thousands of others who have also disappeared during the nation’s   drug war, and the anguish visited on their families. Caught between cartel violence and a government either unwilling or unable to help, they are victims twice. The arrival of the international experts inspired hope and a shot at closure, if only vicariously, for those who suffer their losses quietly on the margins of Mexican society. In an exceptional gesture, Mexico was granting foreigners permission to conduct a true investigation. Now their departure is a bitter one. “This is something that will probably haunt us for a long time,” said Francisco Cox, a Chilean human rights lawyer and another member of the group of experts. “But it didn’t make sense to stay here, because in a certain way it’s giving legitimacy to something deep inside you know isn’t right. ” Though the group’s final report will be issued on Sunday morning, the case is far from solved. The remains of only one of the 43 has been found and identified the rest are all still missing. Another question is how high the collusion between the drug gangs and the government goes. Although the government’s own investigation focused on the complicity of the local authorities, the expert panel uncovered evidence that state and federal officials and even military personnel were present on the night of the students’ disappearance. “It was clear in the government’s investigation and the official account that there was an intention to keep this case at a municipal level, in terms of responsibility,” said Carlos Beristain, another expert in the investigation. “But we revealed the presence of state and federal agents at the crime scenes, and furthermore that their participation implied responsibility. ” The government insists that the parting of ways with the international experts is amicable, and has thanked them in public for their work. The experts were not forced out, according to the government. They ran out of time. The government says it has played no part in a smear campaign. There is a free press in Mexico, and the government cannot prevent certain outlets from writing what they want, it says. In written responses to questions, Eber Betanzos, the deputy attorney general for human rights, said that his office has worked closely with the experts. “The Mexican state recognizes their work, their efforts and the attention to the victims,” he said. But when asked to issue a joint statement denouncing the media campaign against the experts, the government more than once declined to do so. When the experts arrived in Mexico, in March of last year, they received a warm welcome from the government. At first, the experts said, there was a willingness to share documents and respond to requests for information, and a collegiality that seemed to match the government’s public posture. That abruptly changed in September, when the experts published a report that contradicted the government’s version of events, referred to by the former attorney general as the “historic truth. ” The government’s investigation said that the students were killed and then burned in a garbage dump in the town of Cocula. Neither this panel of experts nor another international team of forensics experts also working on the investigation have found any physical evidence at the dump site corroborating a fire of such dimensions. “After our report, it was pretty clear the relationship had changed,” Mr. Cox said. “They still thought that we would sustain their version of what had happened. ” Routine requests from the government took months, the experts said. Suggestions for ways to streamline the investigation were ignored. A media smear campaign began, assaulting individuals in the group, including accusations that they misspent money and had made statements supportive of terrorist acts in the past. For the investigators, the message was clear. “There are sectors within the government that don’t want certain things to be questioned and therefore there is an attempt to reinforce the ‘historical truth,’ without taking into account the new elements we have uncovered,” Mr. Beristain said. “These sectors within the government looked at us as a threat and this hardened their view towards us, which actually reinforces the impunity that stops things from changing in this country. ” The media attacks largely focused on Ms. Paz and another female lawyer, Ángela Buitrago, who earned broad recognition for prosecuting government and military malfeasance in Colombia. In addition to little known outlets, some national newspapers, like El Financiero and Milenio, took part as well. In one instance in January, Ms. Buitrago was waiting in line at the Mexico City airport when she noticed a story on the front page of a local newspaper  —   about her. It began with a characterization of Ms. Buitrago as someone known to “fabricate testimony and pressure alleged witnesses in order to imprison military figures and politicians. ” It also quoted a person she had prosecuted as saying that any investigation in her hands would lack all credibility. “It was unimaginable,” she said. “The purpose of all this was just to delegitimize the investigation, and to discredit and distract us. ” Ms. Paz, too, said she became a target.   organizations claimed that she had protected violent leftists and violated Guatemala’s peace accords by trying former military officers. Though the government has repeatedly denied playing a role in the media campaign, it wields an inordinate amount of control over the news media here. The state spends hundreds of millions of dollars every year in advertising, making it a highly influential voice in the market. “We couldn’t go out on the streets every day and read all the newspaper headlines insulting us,” Ms. Paz said. Perhaps the most direct example of government pressure came in the form of a criminal inquiry opened into Emilio Álvarez Icaza, the executive secretary of the   Commission on Human Rights, the international body that appointed the experts. The inquiry was opened after a   activist filed a complaint against Mr. Icaza, claiming fraudulent use of the money for the experts, funds that had been furnished on agreement by the Mexican government. For weeks, the government sustained its investigation, claiming it had a responsibility to follow up on every complaint. But human rights experts in the region said the action sent a message, warning those agitating against the government’s narrative. Eventually, the government dropped the case, but not before it sent a chill. “It is interesting that they would choose to investigate this patently baseless claim when there are thousands of families who are desperately seeking their loved ones without any assistance from the attorney general,” said James L. Cavallaro, the president of the   Commission on Human Rights. “That is profoundly disturbing. ”'"}, "time": 1742563233.3093426}