{"duration": 0.1600785255432129, "input_args": {"text": "'It Is Up To Us\\nPaul Craig Roberts\\nDid Donald Trump win the election because he is a racist and misogynist and so are the American people? \\nNo. That’s BS from the Oligarchs’ well-paid whores in the media, “liberal progressive” activist groups, think tanks and universities.\\nDid Trump win because he stole the election?\\nMore BS. The Oligarchs controlled the voting machines. They failed to steal the election, because the people outsmarted them and told the pollsters that they were voting for Hillary. This led to the presstitutes’ propaganda that Hillary was the certain winner, and the Oligarchs believed their own propaganda and didn’t believe it necessary to make certain of their victory.\\nTrump won the presidency because he spoke directly and truthfully to the American people, telling them what what they knew to be true and had never before heard from any politician:\\n“Our movement is about replacing a failed and corrupt political establishment with a new government controlled by you, the American people. The establishment has trillions of dollars at stake in this election. Those who control the levers of power in Washington and the global special interests they partner with, don’t have your good in mind. The political establishment that is trying to stop us is the same group responsible for our disastrous trade deals, massive illegal immigration and economic and foreign policies that have bled our country dry.\\n“It’s a global power structure that is responsible for the economic decisions that have robbed our working class, stripped our country of its wealth and put that money into the pockets of a handful of large corporations and political entities. The only thing that can stop this corrupt machine is you. The only force strong enough to save our country is us. The only people brave enough to vote out this corrupt establishment is you, the American people.”\\nTrump did not promise voters a bunch of handouts. He didn’t say he would fix this and that. He said that only the American people could fix our broken country and identified himself as an agent of the people.\\nThe people won the election, but the Oligarchy is still there, as powerful as ever. They have already launched their attack using their whores in the media and liberal progressive groups in attempts to delegitimize Trump with protests, petitions, and endlessly false news reports. George Soros, using the money he made by his attack on the British currency, will pay thousands of protesters to attempt to disrupt the inaugeration. \\nWhat about Trump’s government? As Trump discovered, finding appointees who are not part of the Oligarchy’s economic and foreign policy establishment is very difficult.\\nWashington is not a home for critics and dissidents. Consider Pat Buchanan, for example. As a White House official in two administrations and a two-time presidential candidate, he is experienced, but Washington has marginalized him. \\nMoreover, even if there were a stable of outsiders, they would be eaten alive by the insiders. Trump will have to take insiders. But he has to pick insiders who are to some extent their own person. General Michael Flynn as National Security Advisor is not a bad pick. Flynn is the former head of the Defense Intelligence Agency who advised the Obama regime against employing ISIS against Syria. Flynn has publicly stated on television that the appearance of ISIS in Syria was a “willful decision” of the Obama regime. In other words, ISIS is Washington’s agent, which is why the Obama regime has protected ISIS.\\nTrump’s chief of staff (Priebus) and chief strategist (Bannon) are reasonable choices.\\nSessions (Attorney General) and Pompeo (CIA) are disturbing appointments based on their media-created reputations. But in the US where there is no honest media, we don’t know the truth of the reputations. Nevertheless, if Sessions does support torture, he is disqualified as attorney general, because the Constitution prohibits torture. The US cannot afford yet another attorney general who does not support the US Constitution.\\nIf Pompeo actually is so poorly informed that he opposed the Iran settlement, he is not fit to be CIA director. The CIA itself said that Iran had no nuclear weapons program, and with Russia’s help the matter was resolved. Does Trump want a CIA director who neoconservatives could use to restart the conflict?\\nThe views of Sessions and Pompeo could be products of the time and not visceral. Regardless, Trump is a strong and willful person. If Trump wants peace with the Russians and Chinese, appointees who get in the way will be fired. So let’s see what a Trump government does before we damn it.\\nPresstitute reports of extreme neoconservative John Bolton and former US attorney and NY Mayor Rudy Giuliani being candidates for Secretary of State do not seem credible. If Trump intends to get along with Putin, how can he do that if his Secretary of State wants war with Russia? Trump should find an experienced diplomat who negotiated with the Soviets. Richard Burt, who had a major role in the Strategic Arms Reduction Treaty, is the sort of person it would make sense to consider. Another sensible candidate would be Jack Matlock, Reagan’s Ambassador to the Soviet Union.\\nIf Trump wants peace with Russia, the Secretary of State is the important appointment.\\nIf Trump wants to stop the Oligarchy’s rip off of the American people, the Secretary of the Treasury is the important appointment. \\nUnder the last three presidents, treasury secretaries have been agents for the banks-too-big-to-fail and for Wall Street. It is now a tradition for the financial gangsters to own the Treasury. It remains to be seen if the tradition is too strong for Trump to break.\\nThe Oligarchy is trying to discredit the Trump Presidency before it exists. This effort is discrediting liberal and progressive groups by identifying them with nonenforcement of the immigration laws and with homosexual and transgender rights, issues not on the agenda of an electorate whose economic fortunes have been declining and who are tired of 15 years of war that serves only the hegemony agenda of the neoconservatives and the profits and power of the military/security complex. \\nAccording to The Saker, Putin has begun removing the Atlanticist Integrationists, Russia’s Fifth Column, from influence. Let’s see if Trump can remove our fifth columnists—neoconservatives and neoliberal economists—who have sold out the American people and America’s integrity.\\nIf Trump fails, the only solution is for the American people to become more radical.\\nThe post It Is Up To Us — Paul Craig Roberts appeared first on PaulCraigRoberts.org .'"}, "time": 1742563781.643662}