{"duration": 0.05529665946960449, "input_args": {"text": "'“My Fair Lady,” which won the Tony for best new musical in 1957, will return to Broadway next year for the first time in a quarter century. Lincoln Center Theater said Monday that it would stage a revival of the musical, directed by Bartlett Sher, who has become the nonprofit organization’s   director for revivals of midcentury classics. The show, as any theater lover knows, is about a   flower saleswoman, Eliza Doolittle, who is taking speech lessons from a professor named Henry Higgins. Set in and around London in 1912, it is based on a play, “Pygmalion,” by George Bernard Shaw. The original production of “My Fair Lady,” featuring music by Frederick Loewe and a book and lyrics by Alan Jay Lerner, opened on Broadway in 1956, starring Julie Andrews and Rex Harrison, and by the time it closed, in 1962, it was the   musical in Broadway history, with 2, 717 performances. There were Broadway revivals in 1976, 1981, and 1993, and the New York Philharmonic staged a production in 2007. But the show is probably best known from the 1964 film adaptation, which starred Audrey Hepburn and Rex Harrison and won eight Academy Awards in 1965, including best picture. “It’s a show of great delight and great sophistication,” said André Bishop, the artistic director of Lincoln Center Theater, which will present the revival in association with the Nederlander organization. “And I love the idea that at this particular time, when people are not always precise in the way they speak or write, here’s this show that is about speaking. ” Mr. Sher, a resident director at Lincoln Center Theater, has directed two classic revivals there  —   “The King and I,” in 2015, and “South Pacific,” in 2008, both of which won Tony Awards for best musical revival. In 2015, he also directed a Broadway revival of another midcentury classic, “Fiddler on the Roof. ” “Bart has this very interesting ability to zero in on the themes of an old musical that seem to apply to today,” Mr. Bishop said. “He has his own spin, yet clearly honors the original intention, which is why people like him so much. ” The revival of “My Fair Lady” is scheduled to begin previews on March 22, 2018, and to open on April 19, 2018, at Lincoln Center’s Vivian Beaumont Theater. The cast has not yet been chosen.'"}, "time": 1742562096.3689175}