{"duration": 0.08409500122070312, "input_args": {"text": "'By Headly Westerfield on Fri, Oct 28th, 2016 at 10:20 pm As Megyn Kelly garners headlines for her feminism or lack thereof, Rupert Murdoch seems desperate to keep her. Share on Twitter Print This Post \\nEarlier this week Friday Fox Follies , under the assumption the explosive , and bizarre battle between Megyn Kelly and Newt Gingrich, would be this week’s lede , I had already tricked up an opening paragraph. In case you missed it , that’s when he got personal , accused her of being obsessed by sex and she told him that he should work on his anger issues . This week’s column would have been about how the Fox audience continues to splinter as they take sides in the presidential election. The NYT calls ’em Megyn Moments ; I call them fissures in what had been assumed to be the bedrock foundation of the Fox “News” Channel: it’s unthinking audience. \\nThen came word that Rupert Murdoch was playing hardball as Kelly’s contract negotiations break out into the open. That paragraph, lovingly crafted, went out the window. But, let’s see what this fight was about because heat is always better than light for ratings, as Trump Congratulates Newt Gingrich For Getting His Butt Kicked By Megyn Kelly . Watch: \\nAs Kelly garners headlines for her feminism or lack thereof , Rupert Murdoch seems desperate to keep her. Her contract expires next year and Rupie opened up to the Wall Street Journal — of which he is owner — to partially cajole Kelly and partially to threaten her into extending her contract. Million in Contract Talks With Fox News \\n“If they are going to make a network that is going to be a post-Ailes/post-Trump, it will be around Megyn Kelly, Chris Wallace and Shep Smith, and they are going to have to throw Hannity and O’Reilly overboard,” said Andrew Tyndall, a television-news consultant, of other hosts at the network. That isn’t going to happen, promised Mr. Murdoch. “We’re not changing direction…that would be business suicide,” he said. Mr. O’Reilly’s contract is also up at the end of next year, and Mr. Murdoch said, “we’re going to want Bill to stay with us.” Mr. Hannity’s contract isn’t up until 2020. Ms. Kelly has forged close ties to Mr. Murdoch’s sons, particularly Lachlan Murdoch, who is co-executive chairman of Fox and has taken an active role in contract talks, people close to the situation said. \\nFox would like to settle this before the election and before Kelly’s book is released, both of which could only strengthen her position in the negotiations if all goes well. \\nFrom the The Power of Megyn Kelly’s Feminism—Even if She Doesn’t Call It That , by The Daily Beast’s Tim Teeman : \\nImagine, then, her mix of satisfaction and maybe ennui as she scrolled across some of the praise-ridden screeds out today: “How Megyn Kelly Became an Improbable Feminist Icon” (Vanity Fair); “Megyn Kelly Has Become The Biggest Example of White Feminism At Work (Pajiba); and “Aw Crap—Here’s Proof That Megyn Kelly Is Kind of a Feminist Role Model Now” (The Stir). Note the grudging headlines. Because of Kelly’s employer, and because she has not fought the good feminist fight in a conventional, left-wing context throughout her career to date, the F-word mantle is being conferred upon her with something of a scowl. This, in itself, reveals a kind of blinkeredness on the part of Kelly’s critics: It is perfectly possible to work for a right-facing institution and not be 100 percent right wing yourself, or spout the prevailing dogma of the TV station you work for. (Full disclosure: I worked for The Times of London, a British, Rupert Murdoch-owned newspaper, for over 13 years.) \\nAside from the fact that when she tilts Right, she tends to tilt alt-right, the biggest knock on Kelly is that she’s too hard-edged. Marshall McLuhan spoke of the Medium Cool of tee vee, but Kelly comes across as the opposite of warm and fuzzy . This makes her less attractive to other networks. She’s hoping to change that impression when she co-hosts Live with Kelly Ripa (The Kelly & Kelly Show?) the morning after the election . Think of her as a designated hitter, trying to knock Murdoch’s hardball right out of the park. \\nSTILL WATTERS STILL: A few weeks back FFF reported on a racist Watters World in which the White Privileged Pencil-Necked Geek made fun of Asians. This week Asian American groups meet with Fox News personnel over awful Jesse Watters segment : \\nPaul Cheung, president of AAJA, told the Erik Wemple Blog that the meeting was “productive.” “I think they heard what the community’s reactions are,” he said of the session at New York’s Museum of Chinese in America. Approximately 130 Asian American “groups and allies” have signed an open letter to Fox News regarding the unfortunate episode, said Cheung. Ron Kim, a New York state assemblyman in attendance, told this blog that a representative from “The O’Reilly Factor” and a senior representative from the news side of the channel attended the meeting. Together they played a “good cop, bad cop” routine, said Kim. “The gentleman from O’Reilly’s show was defending what they were doing and trying to explain that this is a part of the opinion section of Fox News and sometimes edgy humor can go too far,” said Kim. Once again, the specter of Fox News’s vaunted news-opinion divide presents itself. As we’ve noted before, this is a convention borrowed from the newspaper industry to justify Fox News hosts such as Sean Hannity openly campaigning for Donald Trump, Steve Doocy of the morning show “Fox & Friends” spreading harmful innuendo into the public square … and O’Reilly allowing his protege to spread racist stereotypes all about Chinatown.'"}, "time": 1742563403.7227433}