{"duration": 0.03170013427734375, "input_args": {"text": "\"\\nThe brilliant Internet mogul Kim Dotcom – founder of the file-sharing website Megaupload – said on Monday that there are more Clinton emails that will be published, and the results will be devastating for the Democratic candidate.\\nThere's unpublished material, yet to come out. Clinton is in serious trouble.\\n— Kim Dotcom (@KimDotcom) November 1, 2016 \\n\\nThere is speculation that Dotcom is referring to the 33,000 missing Clinton emails…and that someone has them (possibly WikiLeaks) and will be releasing them soon.\\nFrom The New Zealand Herald :\\nDotcom has previously hinted that Wikileaks is in possession of the missing emails, which Clinton acknowledged erasing rather than turning over to the State Department upon her retirement, claiming they were not work-related.\\nDotcom last week made a joking reference to the BleachBit software Clinton used to delete the emails, writing “Bleachbit(ch) can’t bleach it.”\\nShortly after, he then tweeted directly at Wikileaks writing “Oh no!” with a video of him reacting to audio saying “You’ve got mail.”\\nAnd days before on October 27, he wrote that he knew where the deleted emails are and how to get them legally.\\n“I know where Hillary Clintons deleted emails are and how to get them legally @TGowdySC @seanhannity @realDonaldTrump. 100% true. Retweet,” he wrote.\\nDotcom pointed out something many have wondered about…\\n“They are all stored in the NSA spy cloud in Utah. Congress or Senate can request the emails from the NSA.”\\nWilliam Binney, architect of NSA mass surveillance system has confirmed that the NSA must have the deleted Clinton emails, by design. @FBI \\n— Kim Dotcom (@KimDotcom) October 30, 2016 \\n\\nI think the FBI has found Clintons deleted emails in NSA spy cloud and now use Wiener laptop as a front to protect NSA secrets. Fine by me \\n— Kim Dotcom (@KimDotcom) October 31, 2016 \\n\\nLast year, Dotcom – who has a long-standing relationship with WikiLeaks and Julian Assange – said that Assange would be Clinton’s worst nightmare in 2016 because he “has access to information.”\\nThe FBI is currently searching a laptop that belonged to Anthony Weiner, Clinton aide Huma Abedin’s estranged husband, for any emails from Clinton’s private server.\\nDotcom just might be the most fascinating person on Twitter. Take a look at some other things he’s had to say lately…\\nHillary, who signed my extradition request, will get busted by the same mass surveillance system the US Govt used to spy on me unlawfully.\\n— Kim Dotcom (@KimDotcom) October 28, 2016 \\n\\nThe US Govt keeps underestimating the strength of oppressed people who'll fight for what's right even if it results in their crucifixion.\\n— Kim Dotcom (@KimDotcom) October 28, 2016 \\n\\nWikileaks will deliver. #LockHerUp pic.twitter.com/jIUSOEWyEv \\n— Kim Dotcom (@KimDotcom) October 30, 2016 \\nDelivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by Lily Dane of The Daily Sheeple . \\nLily Dane is a staff writer for The Daily Sheeple. Her goal is to help people to “Wake the Flock Up!” \""}, "time": 1742628565.5529468}