{"duration": 0.14307188987731934, "input_args": {"text": "'The Oil-Gas War Over Syria, in Maps Eric Zuesse Turkey’s Anadolu News Agency, though government-run, is providing remarkably clear and reliable diagrammatic descriptions of the current status of the U.S-and-fundamentalist-Sunni, versus Russia-and-Shia-and-NON-fundamentalist-Sunni, sides, in the current oil-and-gas war in the Middle East, for control over territory in Syria, for construction of oil-and-gas pipelines through Syria supplying fuel into the world’s largest energy-market: Europe. Russia is now the dominant supplier of both oil and gas, but its ally Iran is a Shiite gas-powerhouse that wants to share the market there, and Russia has no objection. Qatar is a Sunni gas-powerhouse and wants to become the main supplier of gas there, and Saudi Arabia is a Sunni oil-powerhouse, which wants to become the major supplier of oil, but Saudi oil and Qatari gas would be pipelined through secular-controlled (Assad’s) Syria, and this is why the U.S. and its fundamentalist-Sunni allies, the Sauds, and Qataris, are using Al Qaeda and other jihadists to conquer enough of a strip through Syria so that U.S. companies such as Halliburton will be able safely to place pipelines there, to be marketed in Europe by U.S. firms such as Exxon. Iran also wants to pipeline its gas through Syria, and this is one reason why Iran is defending Syria’s government, against the U.S.-Saudi-Qatari-jihadist invasion, which is trying to overthrow and replace Assad. Here are the most-informative of Anadolu’s war-maps: The first presents the effort by many countries to eliminate ISIS control over the large Iraqi city of Mosul. A remarkably frank remark made in this map is “An escape corridor into Syria will be left for Daesh [ISIS] so they can vacate Mosul”— an admission that the U.S.-Saudi-Qatari team want the ISIS jihadists who are in Mosul to relocate into Syria to assist the U.S.-Saudi-Qatari effort there to overthrow and replace the Assad government: The second is about the Egyptian government’s trying to assist the Syrian government’s defense against the Saudi-U.S.-Qatari invasion of Syria, at Aleppo, where Syria’s Al Qaeda branch is trying to retain its current control over part of that large city. The Saud family are punishing the Egyptian government for that: Here is Russia’s proposed gas-pipeline, which would enable Russia to reduce its dependence upon Ukraine (through which Russia currently pipelines its gas into Europe). Obama conquered and took over Ukraine in February 2014 via his coup that overthrew the democratically elected neutralist Ukrainian President there : In addition, there is the following map from oil-price.com : That map shows the competing Shia (Russia-backed) and Sunni (U.S.-backed) gas-pipelines into Europe — the central issue in the invasion and defense of Syria. On 21 September 2016, Gareth Porter headlined “The War Against the Assad Regime Is Not a ‘Pipeline War’,” and he pointed out some errors in Robert F. Kennedy Jr.’s account that had been published under the headline “Syria: Another Pipeline War” . Porter argued: “It’s easy to understand why that explanation would be accepted by many anti-war activists: it is in line with the widely accepted theory that all the US wars in the Middle East have been ‘oil wars’ — about getting control of the petroleum resources of the region and denying them to America’s enemies. But the ‘pipeline war’ theory is based on false history and it represents a distraction from the real problem of US policy in the Middle East — the US war state’s determination to hold onto its military posture in the region.” Porter ignored the key question there, as to why “the US war state” has a “determination to hold onto its military posture in the region.” Opening and protecting potential oil-gas-pipeline routes are important reasons why. Clearly, Kennedy’s documentation that the CIA was trying as early as 1949 to overthrow Syria’s secular government so as to allow to the Sauds a means of cheaply transporting their oil through Syria into Europe, remains unaffected by any of the objections that Porter raised to Kennedy’s article. The recent portion of Kennedy’s timeline is affected, but not his basic argument. Furthermore, any military strategist knows that “the US war state” is intimately connected to the U.S. oil-and-gas industries, including pipelines (“oilfield services”) as well as marketing (Exxon etc.). And Porter got entirely wrong what that connection (which he ignored) actually consists of: it consists of U.S. government taxpayer-funded killers for those U.S. international corporations. Here is how Barack Obama put it , when addressing graduating cadets at West Point, America’s premier military-training institution: Russia’s aggression toward former Soviet states unnerves capitals in Europe, while China’s economic rise and military reach worries its neighbors. From Brazil to India, rising middle classes compete with us, and governments seek a greater say in global forums. And even as developing nations embrace democracy and market economies, 24-hour news and social media makes it impossible to ignore the continuation of sectarian conflicts and failing states and popular uprisings that might have received only passing notice a generation ago. It will be your generation’s task to respond to this new world. The question we face, the question each of you will face, is not whether America will lead, but how we will lead — not just to secure our peace and prosperity, but also extend peace and prosperity around the globe. He was saying there that America’s military is in service to U.S.-based international corporations in their competition against those of Russia, Brazil, China, India, and anywhere else in which “rising middle classes compete with us.” Those places are what Gareth Porter referred to as “America’s enemies.” Economic competitors are “enemies.” Obama thinks that way, and even a progressive journalist such as Porter doesn’t place into a skeptical single-quotation-mark-surround, the phrase ‘America’s enemies’ when that phrase is used in this equational context. On both the right (Obama) and the left (Porter), the equation of a government and of the international corporations that headquarter in its nation — the treatment of the military as being an enforcement-arm for the nation’s international corporations — is simply taken for granted, not questioned, not challenged. RFK Jr. was correct, notwithstanding some recent timeline-errors. Syria is “Another Pipeline War,” and Obama is merely intensifying it. (On 9 November 2015, I offered a different account than RFK Jr. provided of the recent history — the Obama portion — of the longstanding U.S. aggression against Syria; and it links back to Jonathan Marshall’s excellent articles on that, and to other well-sourced articles, in addition to primary sources, none of which contradict RFK Jr.’s basic view, “Syria: Another Pipeline War.”). Another portion of Porter’s commentary is, however, quite accurate: America’s ‘Defense’ (or mass-killing-abroad) industries (such as Lockheed Martin) are not merely servants of the U.S. government, but are also served by the U.S. government: “the US war state’s determination to hold onto its military posture in the region” is protection of the major market — the Middle Eastern market — for U.S. ‘Defense’ products and services. It’s not only America’s firms in the oil, gas, and pipelines, industries, which benefit from America’s military; it is also America’s firms in the mass-killing industries, that do. To the extent that the public (here including Barack Obama and Gareth Porter) do not condemn the presumption that “the business of America is business,” or that a valid function of U.S.-taxpayer-funded military and other foreign-affairs operations is to serve the stockholders of U.S. international corporations, the hell (such as in Syria) will continue. Gareth Porter got lost among the trees because he failed to see (and to point to) that forest.'"}, "time": 1742562031.8722951}