{"duration": 0.0433650016784668, "input_args": {"text": "'RIO DE JANEIRO  —   Why can’t they fix the swimming pools at the Rio Olympics? The water in two of the competition pools has grown progressively greener and murkier all week, even as officials have been unable to provide a plausible explanation for the problem, let alone solve it. Things had gotten so bad on Friday that athletes were complaining of eye irritation, morning diving practice was canceled in one of the pools and officials said that the second pool, which is used for water polo and synchronized swimming, would probably have to be drained completely and refilled with water from a nearby practice pool. Under the worst possible outcome, said Cornel Marculescu, executive director of the international swimming federation, known as FINA, the pools would have to be shut down and the events moved to a different location. “The most important issue is to be sure that the water quality does not affect the health and safety of the athletes, which is why we’re conducting tests throughout the day to make sure everything is O. K.,” he said in an interview. “If it’s not, we will be obliged to say, no more events in the pool. But we are not there yet. ” Compounding the problem is a lack of transparency and a sense that officials are helpless to do anything about it. Since Tuesday, when the water in the diving pool abruptly changed from a pellucid azure to a lurid green, officials have provided an array of different diagnoses, from too many people in the water to not enough wind in the air. Each day, too, they have promised, incorrectly, that things were speedily returning to normal. Not only did the trouble swiftly migrate from the diving pool to a second pool at the venue, the Maria Lenk Aquatics Center, the greenness grew darker by the day. By late Thursday, underwater visibility in the diving pool had been reduced to zero. Diving practice was canceled on Friday morning, with dozens of athletes forced instead to “dry practice” indoors. In a statement explaining the closing, the Rio 2016 committee said, “The reason is that the water must be still so the pool can return to its blue color as soon as possible. ” What they meant, said Mario Andrada, a spokesman, is that “we can clean it easier and faster” without any athletes in the pool. By the afternoon, the water had not returned to the desired hue, but the diving pool was reopened anyway for the first individual diving event, the women’s   springboard preliminaries. Trying to explain the cause, Marculescu said that faulty filtration that messed up “the very sophisticated chemical combination” in the water. “The quality of the water through the filters and the treatment of the water in the filters was inadequate,” Marculescu said. He blamed the trouble on poor oversight by officials in charge of the venue. Athletes leaving the diving competition complained of red eyes and irritation. “I could not see a thing underwater, but luckily I didn’t need to,” said Uschi Freitag, a diver from the Netherlands. Earlier in the day, some athletes were quoted as saying that the pool smelled slightly   but that did not seem to be the case in the afternoon. It seemed, too, that the pool was a bit lighter in color, though it remained murky and swampy. “To change the color of the water is going to take a long time due to the amount of water in the pool,” Marculescu said. “The process is complex. ” Officials have offered an array of explanations, beginning on Tuesday, when Andrada blamed “a proliferation of algae” due to “heat and lack of wind. ” On Wednesday, Andrada had a new theory: “a sudden decrease in the alkalinity in the diving pool,” caused by too many people using it. Sean Johnson, president of the New York franchise of American Pool New York, a   company, rejected that notion. “It’s like the worst excuse ever,” Johnson said in an interview, adding that he believed the cause to be copper or other metals in the water that had been oxidized by the addition of chlorine. He said it was a common problem in pools around New York. “As soon as you fill it up, it’s blue,” he said. “You start to add chlorine to it, it turns green. ” What the pool handlers should have done, he said, is add a chemical known as a sequestering agent that counteracts the effects of the metals. Back in Rio, the international swimming federation offered its own midweek account. “The water tanks ran out of some of the chemicals used in the water treatment process,” it said. “As a result the pH level of the water was outside the usual range. ” By Thursday, Andrada sounded more hopeful. “The water is improved,” he said. That was not really the case, though, and by Friday he had turned a bit philosophical. “Chemistry’s not an exact science,” he said.'"}, "time": 1742628488.007059}