{"duration": 0.1414494514465332, "input_args": {"text": "'Trump Winning: Why It May Have Been Planned All Along Nov 9, 2016 4 0 Just had a thought… (for those who already know both candidates are puppets of the same ruling class and it doesn’t really matter who wins.) What if… the “Elite’s” goal all along was to put Trump up there as a candidate, make sure he would come across as the complete looney that he is, and BECAUSE nearly everyone expects insanity from the guy; use him as a way to more openly and overtly rule like a psycho without having to pretend to be sane. Maybe the establishment is sick of hiding behind “good boy” and “good girl” puppets. Maybe they just want to be themselves now lol. (And use “Crazy President Trump” as the culprit for the crazy things “they” are about to do next…) But regardless of my theory… let’s not lose sight of the fact that “Presidents are selected, not elected.”― Franklin Roosevelt. I wish more of us remembered that. I wish we remembered that politics is really a game show designed to give the illusion of choice, when really we are are simply “voting” for the same big club who “don’t give a f**k about us”, as George Carlin eloquently expressed. Solution: (Most Important Part Of This Blog) I believe we are missing a crucial piece of the puzzle: The understanding that corrupt politicians and evil bankers aren’t the cause of all the world’s ills, but are symptoms of an ill consciousness . Think about it. The rulers behind this system have got to see themselves as separate from everything and everyone, for them to so ruthlessly plunder the earth and enslave humanity for their own immediate benefit. They have got to live through an anxious state of “me/mine/more” to carry on with their insane power-hungry agendas. Now think about how many of us – even in our more “awakened state”– still operate from that same fearful, insecure and disconnected place. Think we’re going to make more wholistic and empowered choices personally and as a society, if we are still so caught up in our personal egos, fears and agendas? “Seek to overcome that in yourself which most disturbs you in other people.” ― Thomas à Kempis All wonderful initiatives and heart-based businesses that already exist in the world are run by people who have undergone a profound transformation of their own consciousness – where they saw that they are INTERCONNECTED with everything and everyone and are here to contribute and uplift the world. (Here’s an example , and another , and another , and many others here …) Therefore, all of the world’s issues are issues of CONSCIOUSNESS, not of politics. It is our consciousness that shape our political and business models. It is our consciousness that shape the quality of our relationships, choices and actions. And it is the quality of our relationships, choices and actions that shape our world. The goal isn’t to simply branch off into a “better system” or elect “better leaders”. It is to transform our own consciousness which will in turn result in us creating better systems… and becoming better leaders ourselves. Here is a wonderful quote from the book Ishmael: An Adventure of the Mind and Spirit (that I am so about to order): “There’s nothing fundamentally wrong with people. Given a story to enact that puts them in accord with the world, they will live in accord with the world. But given a story to enact that puts them at odds with the world, as yours does, they will live at odds with the world. Given a story to enact in which they are the lords of the world, they will ACT like lords of the world. And, given a story to enact in which the world is a foe to be conquered, they will conquer it like a foe, and one day, inevitably, their foe will lie bleeding to death at their feet, as the world is now.” What stories are we feeding our minds and hearts with? What state of being are we letting be the fuel to our actions (or inaction)? The answer to these questions is what shapes our world. I’ll end this blog with a speech by Martin Luther King, which I believe is how we should all begin rethinking about what kind of world-changers we wish to be : “And I say to you, I have also decided to stick with love, for I know that love is ultimately the only answer to humankind’s problems. And I’m going to talk about it everywhere I go. For I have seen too much hate. […] and I say to myself that hate is too great a burden to bear. I have decided to love. If you are seeking the highest good, I think you can find it through love. And the beautiful thing is that we aren’t moving wrong when we do it, because John was right, God is love. He who hates does not know God, but he who loves has the key that unlocks the door to the meaning of ultimate reality. And so I say to you today, my friends, that you may be able to speak with the tongues of men and angels; you may have the eloquence of articulate speech; but if you have not love, it means nothing. Yes, you may have the gift of prophecy; you may have the gift of scientific prediction and understand the behavior of molecules; you may break into the storehouse of nature and bring forth many new insights; yes, you may ascend to the heights of academic achievement so that you have all knowledge; and you may boast of your great institutions of learning and the boundless extent of your degrees; but if you have not love, all of these mean absolutely nothing.” Because the world won’t benefit from what we know. It will benefit from who we are. Be the solution. Be the best person you can be for yourself and those around you. Get involved in something meaningful. Create a situation that is so positive and uplifting around you, that it won’t matter who is president of the United States. When we become the change, the world will have no other choice but to adapt. With all my heart,'"}, "time": 1742563299.2757337}