{"duration": 1.7592813968658447, "input_args": {"text": "'Dr. Zuhdi Jasser, founder and president of the American Islamic Forum for Democracy, joined SiriusXM host Raheem Kassam on Thursday’s Breitbart News Daily to talk about the aftermath of the London Bridge terror attack, and the future of Britain’s struggle against radical Islamic terrorism. [Kassam commiserated with Jasser about the difficulties of being a Muslim reformer in a media environment where stern criticism of Islam, even from Muslims, is treated like racism.  Jasser said apologists for Islam’s excesses were “basically doing takfir on national television,” using the Muslim term for disinformation. “My response is, I’m proud not to be part of their Islamist community, but these guys talk about Muslims like we’re a gang,” he said. “Like they own the gang, and we can’t participate, when in fact they want to shut down free speech, they want to deny that we’re a diverse community. ” “When people say ‘why do these radical attacks keep happening?’ it’s because the free world refuses to treat Muslims like adults,” said Jasser. “They want to coddle the Muslim community, use them for partisan purposes and identity politics, and ignore all of the signs and precursors of radicalization  —   which are, by the way, the signs are hallmarks of the principles of our free society. ”  “Equality of men and women, respect for free speech, a denial of conspiracy theories, ownership of who we are  —   all of these principles, which are basic principles of human rights, in order to coddle Muslims they allow the Islamic supremacists, the sharia supremacists to speak for our community,” he elaborated.  “Meanwhile, they are basically telling Muslims like myself who love America, who want to stand up for our country, ‘Oh, go sit at the back of the bus. You don’t deserve any recognition. We’re going to let the men with the long beards and the apologists basically speak for your community.’ It’s bigoted. It is them who are the bigots. We are being told we don’t love our faith, when in fact it’s the tough love of Muslims like myself that really, I believe, should be honored in a free society,” said Jasser. Kassam asked if the wave of terrorist attacks was a direct result of allowing Islamists and their apologists to “dominate the conversation” at the expense of reformists like Jasser, sometimes equating reformist criticism with apostasy. “It definitely is,” Jasser replied. “ISIS, the Islamic State, is not only ISIS. Every one of the Islamic states of the 56   countries that form the Organization of Islamic Cooperation is based on a sharia state platform. That sharia state basically says that you need to follow the laws as determined by the clerics who define what is and is not Islam, what is and is not permitted speech. If you don’t fit in that construct, then you are not a Muslim. Therefore, how do you control that state? You control it by limited free speech and rejecting those who fall outside the confines of their theocracy. ” “People need to understand, political Islam’s goal is not to dominate   countries, but to evangelize, spread their ideas globally and defeat secular states, defeat   states,” he warned. “They divide the world into the land of Islam and the land of War. ” “We in the West, by virtue of not evangelizing liberty, being offensive in pushing back  —   not only against terror, which is a symptom, but against the theocratic ideology of political Islam  —   are being sheepish. Appeasing, if you will. By not pushing for our ideas of universal human rights, we have been basically unarmed, and we’re starting to see a sonic boom of the lack of assimilation,” he said.  “Those within our society that are Islamists reject who we are. When Britain looks and says wow, there’s almost more jihadis from Britain going to Syria than there are Muslims loving Britain and serving in their own military  —   just look at the numbers. It should be 99 percent for one, serving in the British military, versus going to jihad. It is almost 50 to 50. That is why we’re losing this war,” said Jasser. Kassam asked how adherents of a Westernized Muslim could reconcile themselves to the portions of Koranic doctrine that conflict with Western ideals, such as freedom of speech. “That’s a great question, especially now in this month of Ramadan where we fast and reflect, and seek atonement and humility,” Jasser replied. “The Islam that I believe in and teach my kids is a personal faith. It’s not up to the government. It’s not up to the imam who is the teacher. I can talk to five, six imams and then make up my seventh decision, some different decision. ” “Remember, what people read as the Koran is interpretation. The only thing that is Koran is the Arabic. The battle over interpretation is, what are the original words in Arabic? How do we actually define them? Many of them are fake and intentionally misleading interpretations,” he argued.  “The others that are about wars and battles, we need to separate and say, ‘You know what? Maybe it made sense in 620, 625 C. E. but we need to circumscribe those and say we no longer apply to today.’ You have to separate the historical part of the passages from applies to today,” he advised. “Muslims have done that with the rejection of polygamy that’s permitted, with the rejection of the cutting of hands for stealing, things like that. There’s a way to separate those things, and other ways to reinterpret. ” As a much more delicate example, Jasser noted there is a passage in the Koran about the permissibility of beating women, but he suggested it could be reinterpreted in a modern context as “going on strike” (i. e. separating from her) instead of physically “striking” her. “There are modern ways to reinterpret the exact same words in a     more modern liberal way while staying true to the authenticity of the script,” he stressed, referring to two schools of Islam that reject modernization and insist on highly literal interpretations of the Koran. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern.'"}, "time": 1742563027.8177629}