{"duration": 0.09002375602722168, "input_args": {"text": "'opednews.com - Advertisement - \\nCNN report s that protesters from around the world continue to congregate in North Dakota in solidarity with the Standing Rock Sioux and their struggle to stop construction of the Dakota Access Pipeline through (or placed so as to negatively affect) tribal lands. \\nThe issues and the divide between sides seem to be fairly conventional: Promises of jobs and economic growth motivate the pipeline\\'s supporters. Its opponents cite environmental concerns (especially the prospective damage to tribal lands) and allege violations of the Fort Laramie Treaty of 1851 in Texas-based Energy Transfer Partners\\' wheedling of land use permissions out of federal and state governments. \\nOn balance, the opponents seem to have a good case; the supporters not much of a case at all. \\nFor more than a century and a half the US government has selectively ignored its treaties with the Standing Rock Sioux and other tribes whenever those treaties threaten to stymie the plans of corporations with friends in government. Successfully holding Washington to its word this time might give the politicians and their cronies pause next time. \\nAnd even if letting the US government use treaties as toilet paper just because it can wasn\\'t an incredibly corrosive idea, keep in mind that it\\'s not just the Sioux who are getting mugged. Private land owners all along the pipeline\\'s 1,100 mile route are feeling the pain, too. Like Keystone XL before it, ETP leverages government\\'s power of \"eminent domain\" -- under the pretense that the pipeline is some kind of public service rather than the private for-profit enterprise it actually is -- to steal much of the land required to complete Dakota Access. \\nThe go-to excuse among proponents of these \"public/private partnership\" type land thefts is always \"jobs and economic development,\" but even if that excuse flew (it doesn\\'t), it\\'s a pretty poor one in this case. The $3.7 billion pipeline is advertised as creating a whopping 40 permanent jobs. I\\'m not sure how many people work at the average Wal-Mart, but it looks like more than 40 to me. How many jobs in agriculture and other sectors would Dakota Access destroy along the way? We have no way of knowing. - Advertisement - \\nFor me, the bottom line is this: If the only way to do something you want to do involves stealing other people\\'s stuff, you shouldn\\'t do it. And you certainly shouldn\\'t get government help to do it. Dakota Access is the opposite of the American way. - Advertisement -'"}, "time": 1742563507.9744885}