{"duration": 0.09056901931762695, "input_args": {"text": "'On Saturday, two and a half days before his first show in New York, the German designer Philipp Plein sat behind a long table crowded with Starbucks coffee cups, Red Bull cans and Atkins energy bars in a rented office space on Madison Avenue and 55th Street. To his left sat Carine Roitfeld, a former Tom Ford collaborator and former editor of French Vogue, and the creator of CR Fashion Book. To his right was his girlfriend, the Romanian model Andreea Sasu, whom he calls “Poof. ” Members of his inner circle, like the photographer Dylan Don, the publicist Karla Otto, and Mr. Plein’s sister Gloria Dieth, rotated through the chairs behind them over the course of several hours, chatting quietly or observing. Everyone’s attention was on the fit models who stood patiently as Mr. Plein and Ms. Roitfeld debated how to style each of the show’s 80 or so looks. Ms. Roitfeld’s two assistants, the label’s heads of design for men and women, and various others also offered opinions. The stakes, after all, were high. Mr. Plein would have to top the increasingly ostentatious shows he has thrown in Milan since 2011 (with Jet Skis, swimming pools, roller coasters and performers like Snoop Dogg and Rita Ora). The decision to swap cities was part of the brand’s expansion into the United States, a new frontier for the label, which counts Asia and Eastern Europe as its top markets. As part of the push, last year Mr. Plein hired Graziano de Boni, who had previously held   positions at Giorgio Armani and Prada USA, to be his chief executive of North and South America. “I tried to avoid it for a very long time because the American market is very developed and the consumer is very spoiled,” Mr. Plein said. “Markets like Russia and China are much more open to new brands and much easier to enter. They’re hungry to consume. ” But after 18 years in the business and 120 store openings, Mr. Plein decided it was time. ”We didn’t want to lose money,” Mr. Plein said. His company has no investors and he owns it  . “We had to wait until we were a little bit more mature, and I had some gray hair, as you can see, to come here and start this experience. ” Experience is one way to put it. Mr. de Boni began looking for a show venue in August and considered both the Jacob K. Javits Convention Center and the Statue of Liberty, but the New York Public Library won out. Next, Mr. Plein recruited Ms. Roitfeld to help him style the show. Their partnership was in some ways an unlikely one: Ms. Roitfeld is the consummate fashion insider, and Mr. Plein considers himself an outsider, in part thanks to the refusal of Milan’s Camera Nazionale della Moda to include him on its official fashion week calendar until 2013. Still, they agreed on the show. Mostly. Ms. Roitfeld was not persuaded about a top, arguing that it looked too much like a dress. “The long sweater is more European,” Mr. Plein countered. “O. K. put it long,” Ms. Roitfeld said. “Can you walk? Maybe it is good. ” The model strode across the room. “That’s lit,” Mr. Plein said. “I learned one word today,” Ms. Roitfeld said, referring to Mr. Plein’s frequent use of “lit,” the slang term for something amazing. “That’s a rapper look,” Mr. Plein said. “Like for Desiigner or something. Have you ever styled Desiigner?” “No,” Ms. Roitfeld answered, seemingly confused by the reference. “‘Panda, Panda, Panda,’ ” Mr. Plein said, chanting the lyrics of the rapper’s hit song. “He’s going to walk the show. It was the song of summer. I wore a panda mask in the club, in Jimmy’z in Monte Carlo. ” Mr. Plein began scrolling through his Instagram account in search of an image to illustrate what he meant. As she waited, Ms. Roitfeld considered the concept, then said: “Next time I go with you and I wear a mask, too. I love a masked ball. ” Before Mr. Plein was able to find the photo  —   he sometimes posts as many as 20 Instagram photos in one day, so there were hundreds to get through  —   the two forgot the topic and returned to the outfit. “I like the long sweater because it’s more new,” Mr. Plein said. “It’s fresh. ” Ms. Roitfeld nodded in agreement, and the model headed off to have the look photographed. Ms. Roitfeld and Mr. Plein continued forth, often requesting that the seamstresses, most of them     women working diligently in a quiet room a few feet away (lryna Velychko, the head seamstress, is from Ukraine and speaks only Italian and Russian) alter one detail or another. Around midday, the rapper Willie Maxwell II, known as Fetty Wap, swept in with his entourage. Fetty Wap will be walking in Monday’s show along with the rappers Young Thug and Desiigner the singer Pete Wentz of Fall Out Boy and Jeremy Meeks, the model who was referred to as “the hot felon” after his mug shot, taken after he was arrested on federal weapons charges, went viral in 2014. Their casting is the third crucial component of Mr. Plein’s big New York show, and is in large part the work of Eli Mizrahi, a    man about town who counts the models Sofia Richie and Irina Shayk among his friends. “We want you to look like a king,” Mr. Plein told Fetty Wap. He pulled out a long    fur coat covered with the Philipp Plein logo and skulls. “I call it the   coat. ” As his hit song “Trap Queen” played in the background, Fetty Wap tried on the outfit, took a quick walk to show it off and posed for photos. Before leaving, he made a promise: “I’ll bring my bling bling. ”'"}, "time": 1742564444.223379}