{"duration": 0.06103157997131348, "input_args": {"text": "'Leaked Email: ‘If She Wins, Hillary Will Own The Supreme Court for the Next 30 to 40 Years’ → lloyd Lisco \\nHillary is flipping out, Danny Williams Bill Clintons Black son by an Arkansas prostitute is making himself known to the Obsolete Main Stream Media and to the Legitimate news media on the internet. Hillary has lost control of this latest scandal. braindiseasecalledliberalism \\nShe’s been brain dead for years – now her body is simply playing catch-up! \\nMost believe that a potted plant would have a better handle on running this country than the aspiring devil-in-chief! islamroastschildren \\nA new close-up discloses a gash on her right cheek….of her face…..possibly from a fall. lloyd Lisco \\nThis Evil woman is Dying, She is Hooked on and is using so many Dangerous drugs to keep going, She cannot last much longer. In addition to the Coke and Alcohol she consumes she is taking Modafinil, A very powerful form of Speed, She is taking Ativan, Avonex, Eliquis, Warfarin, Moxatag, Tegretol, Reteplase and a long list of other less powerful drugs. This combination of super powerful drugs would kill a horse. This woman is not capable of running this Country, Her supporters want to see her in charge so that they can continue all the rackets they are using to rob the American people. At Hillary’s death she would be replaced by a body double or a clone, An occasional photo would fool the public along with the MSM scripted lies, So that the racketeers could continue stripping America. That is their plan, Hillary must be defeated. islamroastschildren \\nSounds like she can be replaced by an automated PHARMACY. She can’t DIE fast enough to satisfy. westerling \\nHillary needs to make one last step by entering a Mental instutition and forget the election! altogether \\nThe real truth of Hillary’s medical condition, lies in the eyes of the beholders, such as her current Secret Service handlers, whom could impart a more truthful account of which the MSM is attempting to hide. If this latest episode of HRC’s pooor medical conditon transpired only yesterday, imagine how her condition will appear between now and November 8, 2016. I can only imagine that she will not be campaigning too often between now and then, not after this most recent attach of Parkinson’s disease. Jonathan Brooks \\nI think Hitlery needs to drop the pretence, and use a wheelchair and supplementary oxygen, since her flying demoncrat monkeys will steal the election with Soros backed vote fraud, and dead and illegal alien votes. \\nWhy does she even make the effort to appeal to the voters when she is clearly a sick evil old fraud and the Demoncrats do not care. islamroastschildren \\nAt THIS stage of her worthless life, it can ONLY be for ‘the Fame’ because she can no longer enjoy most of the fruits of what MONEY can buy, being near DEATH’S DOOR as she is. Jonathan Brooks \\nI think Fame is a good pick, but also revenge, because Hill will take out as many of her enemies before Death’s dark Design ends her reign of Evil \\nI have noticed that you have used the English word, “DROP,” therefore, to solve the current conundrum involving this worthless effn Com- munist, Hillary Rotten Clinton, she needs to “DROP” dead. Jonathan Brooks \\nRemove the mask, maybe? I do not want Hillary dead, but hiding in Dubaii, avoiding extradition, and praying to Allah or Lucifer that all her backers do not hunt her down for taking money and not paying off. Jonathan Brooks \\nI want Hillary to feel the embarrassment more than suffering.. Subscribe TODAY and Never Miss Another D.C. Clothesline Article Email Address'"}, "time": 1742563196.911958}