{"duration": 0.03151535987854004, "input_args": {"text": "'Nothing says “ugly American” quite like getting kicked out of a posh Italian mall for playing catch with a pigskin. [Perhaps Michigan coach Jim Harbaugh could have worn a bolo tie, or blasted Rick Derringer’s “Real American,” while accomplishing all that on Monday. But his behavior did enough to offend the Old World cultural sensibilities.  Europeans don’t understand football. Neither do many Americans, including, apparently, the successor to Fielding Yost and Bo Schembechler, who, during his European junket, pleaded ignorance to an African man asking why they call his sport football and not throwball. The foot, not the arm, mattered most in early football, a game, as its name implies, that borrowed heavily from European football only to take it in a very North American direction.   collegiate seasons passed before the rules allowed for a forward pass. Throwball would have struck observers as oddly back then as football does to us today. Players competed with a round soccer ball rather than a prolate spheroid in the early days. The two games, soccer (a truncated name for association football) and American football exhibited a similarity in the size of the field, the number of players, and even the names of certain positions. Football used a goal identical to the soccer goal. The Americans imagined it a greater feat to kick the ball above rather than beneath the goal post. So, they erected uprights, which changed an “n” goal into the “H” goalpost that many high schools still favor over the slingshot goalpost. Once upon a time, Sebastian Janikowski mattered a whole lot more than Tom Brady. The conversion, as its name implies, represented the means by which a team converted a touchdown into points. “No good” meant no points. The early rules favored field goals over touchdowns. The team with more field goals but fewer touchdowns, for instance, won the first two meetings of  . If played under today’s rules, the losing team would have won in both cases. “A match shall be decided by a majority of touchdowns a goal shall be equal to four touchdowns but in case of a tie a goal kicked from a touchdown shall take precedence over four touchdowns,” read an early rulebook. For football’s first 35 seasons, field goals brought more points than touchdowns. In 1897, touchdowns garnered five points. Seven years later, field goals shrank to four points from five. Not until 1912 did the game adopt the scoring system, more or less, that we see today. The ball gradually getting longer and harder (easier to throw, harder to kick) the movement of the goalpost to the end of the end zone, the pushing up of kickoffs, and the elimination of the fair   kick at certain levels (the NFL still retains this quirky rule) all further marginalized kicking. Just as guards no longer guard the hoop and forwards no longer focus on the frontcourt in basketball, football’s name no longer resembles its game. That one of the sport’s greatest coaches appears at a loss to explain his game’s name indicates the totality of, and how much we take for granted, the football’s transformation. Daniel J. Flynn is the author of The War on Football: Saving America’s Game (Regnery, 2013).'"}, "time": 1742628550.0466468}