{"duration": 0.048935890197753906, "input_args": {"text": "'NASA have left members of the public scratching their heads after claiming that they were about to make an imminent ‘amazing’ announcement regarding their New Horizons mission to the tiny ice planet of Pluto, before promptly denying that they had ever intended to make an announcement at all. \\nVia UsualRoutine \\n\\nOnly around 10% of all available data gathered together by the New Horizons mission has been processed by NASA so far. However, what they had found in this relatively short space of time was enough for Dr. Alan Stern, a senior scientist leading the New Horizons mission, to publicly express his excitement at what they had discovered.\\nHe claimed that NASA had news for the public that would amaze them and described the micro planet as being ‘alive’. He said that NASA had forbidden him from speaking publicly about the so-called ‘news’ before they made their official press conference but he did tell an audience assembled for a university lecture that Pluto.\\nScroll Down For Video Below! Has weather, it has hazes in the atmosphere, active geology. Every week, I am floored. The world is alive.\\nThe cryptic nature of Dr. Stern’s speech on what the New Horizons mission had discovered had led some to eagerly anticipate the expected announcement. There was great speculation about what NASA was about to announce, with some believing that they might have even discovered life in the smallest planet in this solar system.\\nHowever, to their immense disappointment, NASA have now released a tweet on their official New Horizons account saying that there will be no announcement. They claimed that the story of a conference was nothing more than a false rumour and that Dr. Stern’s had been totally misinterpreted. This is despite the fact that Dr. Stern explicitly said that NASA would be making an amazing announcement, which leaves little room for interpretation mistakes.\\nNow, people are beginning to wonder what the space agency are trying to hide from the general public.\\n'"}, "time": 1742562671.395934}