{"duration": 0.08944225311279297, "input_args": {"text": "'We are witnessing the unraveling of the fabric of constitutional government, and only a fool can believe it will end well. [The nastiest opponents to President Trump inside and out of government apparently feel justified in using “any means necessary” to defeat and remove him. Every day sees more evidence of a desire not only to block his policies but to drive him from office. While it does not yet rise to the level of an organized conspiracy, it does raise serious issues of constitutional fidelity.  First, in the weeks following the November election, we saw street protest and marches, followed by lawsuits, then leaks from inside government, and then talk of “impeachment” over crimes for which no evidence exists. And folks, in the words of Al Jolson, you ain’t seen nothing yet. It’s probably going to get worse. The seeds of this “cultural embarrassment” over Trump’s victory were planted in the days immediately following the November 8 election: These efforts have at least three obvious things in common: desperation born of utter shock at Trump’s election victory   elitist arrogance and the active participation and support from the nation’s major media organizations. Yet, there is another novel element interwoven in these events that is even more dangerous  —   dangerous not simply as a political obstacle to Trump’s agenda, but inherently dangerous to the survival of our country. That novel element is the active, conscious subversion of lawful Presidential orders and initiatives by the permanent civil service apparatus called the “senior bureaucracy. ” It is also being called the “Deep State,” meaning the part of the government that is immune to political appointment and political accountability. And most dangerous of all is the involvement of our nation’s intelligence agencies in the leaks aimed at embarrassing the President. The earliest news stories about an alleged “Russian connection” openly named America’s intelligence operations as the source. Now comes this month’s FBI testimony that the agency has been conducting an investigation of the Trump campaign, and yet the FBI still has not cited any evidence of any   that justifies the investigation. This involvement of intelligence agencies and the FBI in   investigations  —   and the subsequent leaking of information gathered in the surveillance —   puts into question the President’s ability to trust the information provided to him by those agencies. And THAT, my friends, can seriously impair his ability to manage national security policy and any international or   crisis that occurs. The theme of an “illegitimate presidency” provides a veneer of moral justification for seemingly disconnected acts of political sabotage.  If resistance to Trump’s policies is resistance to “tyranny” by a “usurper,” then nothing is out of bounds or off limits. This “ ” arrogance is what makes the   campaign potentially lethal for constitutional government.  The effort to paint President Trump as a usurper who deserves to be thrown out of office is unprecedented in its scope and intensity, and it will have unintended consequences for the Republic. This week there were revelations from the House Intelligence Committee supporting Trump’s allegation of Obama regime surveillance of the Trump campaign and transition. Intelligence gathered by lawful wiretaps of foreign agent activities recorded “incidental” conversations involving persons inside or close to Trump campaign. Those “intercepted” conversations reportedly had nothing to do with alleged “Russian hacking” of the election, nor did they reveal any “collusion” with Russian agents.  Yet, contrary to law, the conversations were shared with Obama White House staff and then with the media. How do we explain the bizarre obsession of Democrat leaders and the media with the “Russian connection”? Not one tiny shred of evidence has been produced by anyone to show any Trump campaign collusion with Russian activities connected to the 2016 election. And yet, the media and Democrat opponents (sorry, I repeat myself) continue to raise that specter to keep alive the myth of a “stolen election. ” In the last days of the Obama administration, new rules were signed into law by Attorney General Loretta Lynch and the NSA Director as administrative amendments to Executive Order 12333, rules allowing the distribution of certain raw intelligence data to 16 additional government agencies at home and abroad. It may have been those new rules which facilitated the leaking of information concerning conversations Trump’s nominee for   Mike Flynn, had with the Russian Ambassador —  conversations which the FBI later said broke no laws. What this week’s revelations show is not any Russian collusion with Trump to influence the election but nearly the exact opposite: elements of the Obama government colluded with intelligence agencies to spy on the Trump campaign —  or at a minimum, to use information gathered by surveillance to attack and undermine the Trump campaign team’s transition plans for an orderly changing of the guard. Opposition to Trump policies is to be expected, and   by hostile bureaucrats was not unknown in the first year of the Reagan administration and other governmental changeovers. But there are legitimate and lawful means of opposition and illegitimate ones —  even illegal ones, like the leaking of classified information. If the   saboteurs inside government expect the American public and tens of millions of Trump supporters to tolerate organized, incipient treason against constitutional government, they are mistaken.'"}, "time": 1742564438.8336768}