{"duration": 0.029778003692626953, "input_args": {"text": "\"Share on Facebook When you think of a Lynx, chances are a big kitty happily purring in utter contentment does not come to mind! However, that's exactly how Max the Canada Lynx acts when his caretaker pets him and gives him a nice relaxing head massage. Just like his domestic feline relatives, Max is partial to a good ear, cheek, and chin scratch. In fact, he loves it so much that he rolls over on his back and purrs like an engine. Hearing his sweet rumble is so therapeutic and relaxing, if you listen to this you'll be falling asleep before you know it! When you think of a Lynx, chances are a big kitty happily purring in utter contentment does not come to mind! However, that's exactly how Max the Canada Lynx acts when his caretaker pets him and gives him a nice relaxing head massage. Just like his domestic feline relatives, Max is partial to a good ear, cheek, and chin scratch. In fact, he loves it so much that he rolls over on his back and purrs like an engine. Hearing his sweet rumble is so therapeutic and relaxing, if you listen to this you'll be falling asleep before you know it! She runs a program called Wildlife Education by Bernie which Max is a part of. He's an education animal ambassador who helps teach school children and the general public about the ongoing need to both protect and respect our planet and the endangered species who call it home. For centuries the Canada Lynx had endured and survived despite hunters who trap and kill them for their fur. In addition to hunting, an overall loss of habitat has led to their steady decline, so much so that in March of 2002 they were added to the endangered species list as threatened. Hopefully their population and numbers will rebound back to healthy levels. Until then, wildlife ambassadors like Max will continue to raise awareness and spread hope for the survival of all threatened and endangered species everywhere. Check out his beautiful face and listen to the sweet purring noises he makes, they'll definitely make you relax and feel at ease! Related:\""}, "time": 1742561660.1740522}