{"duration": 0.09601831436157227, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. Donald Trump and Hillary Clinton hope to win the Indiana presidential primaries on Tuesday, all but cementing their nominations. Trade experts warn that Mr. Trump’s ideas on international commerce, like imposing heavy tariffs on China, could prompt retaliation and deepen U. S. economic troubles. _____ 2. Mrs. Clinton raised $26. 4 million in April, giving her $30 million in hand and bringing her total in primary funds to $213. 5 million, compared with $210 million for Bernie Sanders. She made a longtime Clinton insider, Minyon Moore, a senior adviser in her campaign. Above, Mrs. Clinton with steelworkers in Kentucky. After Indiana, the next heavyweight primary is California’s on June 7. _____ 3. This Australian computer programmer, Craig Steven Wright, claimed to be Satoshi Nakamoto, the pseudonymous creator of the online currency Bitcoin. But many technical experts say he offered insufficient proof. “It would take the real Satoshi about five minutes to provide conclusive proof to the entire Bitcoin community, if the real Satoshi wanted to do that,” one said. The price of Bitcoin fell about $10, to just over $445. _____ 4. Fair warning for air travelers: Do not cut it close for your next flight. A loss of screeners to budget cuts, new procedures and more passengers are creating epic security lines across the U. S.  —   even before the peak travel season. “This is going to be a rough summer,” an official with the Transportation Security Administration said. _____ 5. The party of the year. The Oscars of the East Coast. An A. T. M. for the Met. Whatever you call it, the Metropolitan Museum of Art hosted its annual Costume Institute gala under the eye of Anna Wintour. Tickets this year were $30, 000 apiece, and Ms. Wintour has final say over every invitation and attendee. Here are photos from the red carpet. _____ 6. A teacher sickout closed nearly all Detroit’s public schools, affecting almost 46, 000 children. The   school district said that if the state did not kick in more money, summer school would be canceled and teachers would not be paid for July and August. _____ 7. Protests and threats of violence against abortion providers have pushed some to try to keep their work quiet. But one gynecologist accuses her hospital in Washington, D. C. of going too far. Dr. Diane   filed a federal civil rights complaint saying the institution had violated the law and personal rights by forbidding her to speak publicly about abortion _____ 8. The Hulu streaming service is working toward offering a “skinny bundle” of broadcast and cable channels, probably for about $40 a month, according to insiders. The service would cater to the individualized expectations of younger viewers, while allowing advertisers to target particular audiences. U. S. stocks rose, recovering from some of last week’s steep declines. Battered technology stocks like Amazon and Microsoft posted gains, but Apple remained down. _____ 9. “The Biggest Loser” has become part of the science of dieting. Researchers tracked competitors as they regained most or all of the weight they lost, and discovered how hard the body fights to undo weight loss. Two key factors: slowed metabolic rates, and hormonal changes that create incessant hunger. “It is frightening and amazing,” an obesity expert said. _____ 10. Negotiations are underway to bring a   back into effect in the Syrian city of Aleppo. “The cessation of hostilities has been put to the test, and it has frayed in certain areas, and it has fallen completely in a few areas,” Secretary of State John Kerry said in Geneva. _____ 11. Our TV and movie experts offer highlights and   on replays and streaming in a new feature, Watching. Netflix has Hitchcock’s “To Catch a Thief,” with Cary Grant and Grace Kelly. HBO is showing the classic “Grapes of Wrath. ” And of course there’s the season finale of “The Good Wife,” on Sunday, 9 p. m. Eastern on CBS. _____ 12. Finally, Cubans celebrated the arrival of the Carnival line’s Adonia, the first U. S. cruise ship to Cuba in nearly 40 years. “This is history,” one said. _____ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s the Weekend Briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742563974.498446}