{"duration": 0.03137087821960449, "input_args": {"text": "'EU In this October 21, 2016 photo provided by Sea-Watch aid group refugees sit in an inflatable boat, background left, while a speedboat labeled Libyan Coast Guard, background right, and Sea-Watch members in a boat foreground arrive off the Libyan coast in the Mediterranean Sea. (Via AP) \\nThe UN refugee agency, also known as the UNHCR, says the number of refugees who died in the Mediterranean Sea on their way to Europe in 2016 has reached an all-time high. \\n\"We can confirm that at least 3,800 people have been reported dead or missing in the Mediterranean Sea so far this year, making the death toll in 2016 the highest ever recorded,\" said the UN refugee agency spokesman, William Spindler, on Wednesday. \\nThe alarming surge, which surpassed the death toll of 3,771 for 2015, comes despite a considerable decline in the number of refugees crossing the Mediterranean in 2016. \\nMore than a million people reached Europe via the Mediterranean in 2016, while fewer than 330,000 crossings have been reported so far this year. \\nThe number of refugees heading to Europe has declined as the European Union in March signed a controversial deal with Turkey aimed at stemming the flow of refugees into the continent by forcing those deported from the EU to either be located in Turkey or go back to the original country of departure. \\nSince then, the route between Libya and Italy across the central Mediterranean has become the main way as pathways to Greece have been closed down. \\nAccording to the agency, the likelihood of perishing in the shorter route between Turkey and Greece was one in 88, while one death for every 47 arrivals was reported in the most perilous route between Libya and Italy in 2016. \\nThe UNHCR attributed the surge mainly to the overcrowded “lower quality vessels, flimsy inflatable rafts” often used by smugglers. In this October 21, 2016 photo provided by Sea-Watch aid group refugees sit in an inflatable boat off the Libyan coast in the Mediterranean Sea. (Via AP) \\n25 refugees found dead in Mediterranean Sea, MSF says \\nEarlier on Wednesday, Doctors Without Borders, known as the MSF by its French acronym, said 25 bodies had been retrieved from a refugee boat during a rescue operation in the Mediterranean. \\nThe MSF said its ship, Bourbon Argos, found the bodies aboard the vessel 26 nautical miles off Libya late on Tuesday. The vessel was carrying 107 survivors. The victims had apparently been burned, suffocated or drowned. \\nThe recovery operation, which took place with the help of a team from the Berlin-based non-governmental organization Sea-Watch, took a long time as the boat was flooded with a mixture of fuel and seawater. \\n\"The mixture of water and fuel was so foul that we could not stay on the boat for long periods. It was horrible,\" said Michele Telaro, the MSF project leader. \\nThe MSF also saved 139 people aboard another dinghy on Tuesday. Sea-Watch recovered a body in another operation. \\nThe Italian Coast Guard reported that 500 refugees were rescued from overcrowded boats on Tuesday. \\nMost of the asylum seekers that have triggered the unprecedented influx of refugees Europe has been dealing with over the past few years flee conflict-ridden zones in North Africa and the Middle East, particularly Syria. Many blame Western policies toward the conflicts for the refugee crisis. Loading ...'"}, "time": 1742628573.8436716}