{"duration": 0.13348746299743652, "input_args": {"text": "'LOUISVILLE, Ky.  —   Hours before some of the biggest names in sports, politics and entertainment converged to honor Muhammad Ali at a memorial service on Friday, tens of thousands of people lined the streets of his hometown chanting “Ali!” and throwing flowers as a hearse carried his body to a cemetery to be laid to rest. There were no barriers to keep people off the street, and they swarmed forward, tossing flowers onto the hearse. A gently chaotic decorum prevailed: Riding with the windows down, people in the limousines accompanying the hearse  —   including members of the Ali family, the actor Will Smith and the mayor, Greg Fischer  —   slapped hands with the spectators as they passed. The procession, more celebratory than somber, past his pink boyhood home and the museum and conference center that bear his name, wove 19 miles through the city to Cave Hill Cemetery, where Ali, who died last week at age 74, was buried in a private service. “Muhammad wants young people to know that adversity can make you stronger,” his wife, Lonnie, said later at a memorial service packed with dignitaries, taking stock of his bouts in and out of the ring. “It cannot rob you of the power to reach your dreams. ” She added, “It is far more difficult to sacrifice oneself in the name of peace than to take up arms in the name of violence. ” At a time of controversy over police shootings of young black people, Lonnie Ali recalled that Muhammad Ali got into boxing at the age of 12, after his bicycle was stolen. A white police officer taking the report suggested he learn to fight if he wanted to confront the person who took it. “America must never forget, when a cop and an inner city kid talk to each other, miracles can happen,” she said. President Bill Clinton alluded to Ali’s long fight with Parkinson’s disease, recalling the 1996 Summer Olympics in Atlanta when Ali, with trembling arms from the ailment, lit the torch to open the games. “Besides being a lot of fun to be around and being a universal soldier for our common humanity, I will always think of him as a truly free man of faith, and being a man of faith, he realized he’d never be in full control of his life,’’ Clinton said. “Something like Parkinson’s could come along. But being free, he realized that life was still open to choices. It’s the choices that Muhammad Ali made that brought us all here today in honor and love. ” Before they spoke, a diverse group of religious leaders at a memorial service later offered prayers, remembrances of Ali and, at times, pointed political remarks. The Rev. Kevin Cosby of St. Stephen Church in Louisville took note of the racial pride Ali instilled in African Americans, particularly during the civil rights struggles of the 1960s and 1970s. “He dared to love black people at a time when black people had a problem loving themselves,” he said. “He dared to affirm the beauty of blackness, he dared to affirm the power and the capacity of  . He dared to love America’s most unloved race. ” Drawing rousing cheers, Rabbi Michael Lerner, the editor of Tikkun magazine and a liberal activist, declared, in what appeared to be a reference to   rhetoric on the presidential campaign trail, “We will not allow politicians to put down Muslims, to blame Muslims for a few people. ” Long before the remarks, and eulogies by other speakers, including President Bill Clinton, Billy Crystal, and Bryant Gumbel, the motorcade offered a chance for Ali to be cheered and honored in the city where he grew up and never seemed to forget. Some of Ali’s opponents joined in. On Broadway in downtown Louisville, people were startled to see Larry Holmes, who beat Ali in February 1980, being led along the sidewalk outside the Brown Hotel with a young man at his elbow. Mr. Holmes smiled and said little as he shook hands and handed out signed picture cards.   lined up eight and 10 deep along both sides of Broadway stretching for blocks. Office workers streamed from their desks to stand vigil as the procession neared and passed. The motorcade, which included more than a dozen vehicles, headed into the largely   neighborhood where Ali spent his formative years. There, in the parking lot of the Liquor Zone, nearly everyone seemed to have a story about either meeting Ali, or being inspired by him. Robert Mitchem, known as “Froot Loop” because people mistakenly think he likes that cereal, set up a shirt stand with two friends early in the morning. Mitchem wanted to be ready for the     chance to commemorate the city’s most famous son, and make a few bucks at it. “Fruit” or “Fruity,” as Mitchem is also known, had an array of different colored   with Ali’s picture and his most famous catchphrases, like “Float like a Butterfly, sting like a bee. ” “I hope to sell all of them, and when I die, I hope someone is going to have my name on a shirt, too,” he said with a chuckle. At $15, the shirts, which Mitchem makes with a silk screen and heat press in the basement of his home, were a relative bargain, and word in the neighborhood was out. First a handful and then a torrent of customers came to buy the shirts. Then they opened lawn chairs, bottles of water and other, stronger beverages and awaited the   heavyweight champion. “He was a dignitary from the sports world who traveled the globe, but he never forgot where he came from,” said Wayne Simon, 72, who remembers Ali visiting their alma mater, Central High School, after he won a gold medal at the 1960 Olympic Games in Rome. Despite the searing sun and rising temperatures, the several hundred people assembled in and around the parking lot celebrated Ali anew. Donald “Doc” Burress, 63, remembers as a kid crowding around his family’s    television to watch Ali knock out Sonny Liston. “What he did for Louisville, he was our spokesman,” Burress said, his daughter and two grandchildren sitting by his side. “He was bigger than Churchill Downs,” the famed horse racing track that hosts the Kentucky Derby. Thalisa Price, who wore a leather vest with her nickname, “Ms. Lovely,” stitched on the back, wanted to buy an Ali shirt before leaving for Memphis on Saturday with her motorcycle club, the Naptown Riders. “I’m going to wear this shirt to let people know we’re from Louisville,” she said. Eventually, the police closed traffic on Broadway and helicopters circled above the big intersection. The crowds on every corner swelled further. One fan who held a pair a red boxing gloves yelled, “Come on, Champ, take your time. We ain’t gonna see you no more. ” A few minutes later, the motorcade arrived and, as in downtown, Ali’s fans rushed into the street. The procession passed, heading toward the boxer’s childhood home on Grand Avenue. People started folding their lawn chairs and heading back to their own homes. Mitchem, though, still had work to do. Having sold more than 10 dozen shirts, he was going to rush home and print some more. “That was awesome,” he said. “It sent chills through me because it was like pure love. ”'"}, "time": 1742561809.2866}