{"duration": 0.1046135425567627, "input_args": {"text": "'A PBS high school lesson plan encourages students to empathize with young Palestinian terrorists who want to become suicide bombers to achieve martyrdom and suggests they would rather die because Palestinians have less land and are restricted. [The “Dying to Be a Martyr” multimedia lesson plan is available free of cost to teachers and students at PBS Learning Media, reports Justin Haskins at the Heartland Institute. It utilizes videos titled “Martyrdom,” “Suicide Bombing,” and “Israel and Palestine,” as well as internet sites and primary sources “to examine the roots of the Middle East conflict. ”  Students are asked to be able to understand “why individuals and groups sometimes turn to tactics of terrorism. ” At first, students are asked to learn about the connections that all three major faiths  —   Judaism, Christianity, and Islam  —   have to Israel. However, later on in the lesson, students view the video “Israel and Palestine,” and are asked to focus on 25   Majdi Amer, who built a bomb in 2003 for a suicide bomber in Haifa who ultimately killed 17 people, and wounded 50 more, on a bus. Students are asked to compare Majdi’s view of suicide bombing with that of    Mohanned Abu Tayyoun, who wavers in carrying out his suicide mission and ultimately goes to jail in Israel. In Part III of the lesson plan, students view an interview with Mohanned in jail and are asked to “identify how Mohanned views his life and how he feels it differs from the lives of Israelis (Jews). ” “Martyrdom leads us to God,” he responds. “I don’t want this life. When you become a martyr, your prize for carrying out the operation is going to heaven  …    We Palestinians prefer to die, just kill ourselves, rather than live this worthless life. Our lives are worthless. We are hollow bodies living a pointless life. ” “Israelis enjoy their life,” Mohanned continues. “They go out at night. They have cafes and nightclubs. They travel all over the world. They go to America and Britain. We can’t even leave Palestine. ” Teachers are asked to check students’ understanding of the reasons Mohanned feels he would rather die and be a martyr than live his life. The lesson suggests that Mohanned may feel that way because “Palestinians have less land, fewer privileges, cannot come and go as they please. ” In Part IV of the lesson plan, Majdi is interviewed in a video and is asked why it is acceptable for him to kill women and children. “If the Israelis kill a child in Gaza, I’m ready to kill one in Tel Aviv,” he says. “If they destroy houses in Gaza, I’ll do it in Tel Aviv. If they give me security in my land, then there’s no problem. ” “No instructions are provided telling teachers to denounce the radical claims made by Majdi, and there are no other lesson plans describing the conflict from the point of view of the Israelis,” observes Haskins. JP Morgan Chase and the Corporation for Public Broadcasting  —   which is funded by the federal government  —   fund the lesson plan’s website. The Christian Action Network (CAN) has filed a demand letter with the U. S. Education Department urging it to stop funding the Islamic lesson plans that are part of a program called “Access Islam. ” “So, PBS Learning Media is one of the websites that is promoting it,” CAN’s president Martin Mawyer recently told Breitbart News. “The Smithsonian also promotes it, the Indiana Department of Education promotes it, and even the United Nations promotes it. ” Mawyer claims that through the Access Islam curriculum, American students are taught the Islamic way of life in a way that crosses the line from academics to indoctrination.'"}, "time": 1742562159.4340467}