{"duration": 0.08278179168701172, "input_args": {"text": "'Wed, 26 Oct 2016 20:25 UTC © NASA/CXC/UA/J.Irwin et al. In this Chandra X-ray Observatory image of NGC 5128 (also known as Centaurus A), low, medium, and high-energy X-rays are coloured red, green, and blue. Five flares were detected from the source located near NGC 5128, which is at a distance of about 14 million light-years from Earth. A movie showing the average change in X-rays for the three flares with the most complete Chandra data, covering both the rise and fall, is shown in the inset. Astronomers have found a pair of extraordinary cosmic objects that dramatically burst in X-rays. This discovery, obtained with NASA\\'s Chandra X-ray Observatory and ESA\\'s XMM-Newton observatory, may represent a new class of explosive events found in space. The mysterious X-ray sources flare up and become about a hundred times brighter in less than a minute, before returning to original X-ray levels after about an hour. At their peak, these objects qualify as ultraluminous X-ray sources (ULXs) that give off hundreds to thousands of times more X-rays than typical binary systems where a star is orbiting a black hole or neutron star. \"We\\'ve never seen anything like this,\" said Jimmy Irwin of the University of Alabama, who led the study that appears in the latest issue of the journal Nature . \"Astronomers have seen many different objects that flare up, but these may be examples of an entirely new phenomenon.\" While magnetars — young neutron stars with powerful magnetic fields — have been known to produce bright and rapid flares in X-rays, these newly discovered objects are different in key ways. First, magnetars only take a few seconds to tens of seconds to decline in X-rays after a flare. Secondly, these new flaring objects are found in populations of old stars in elliptical galaxies, which are spherical or egg-shaped galaxies that are composed mostly of older stars. This makes it unlikely that these new flaring objects are young, astronomically speaking, like magnetars are thought to be. Also, these objects are brighter in X-rays during their \"calm\" periods. \"These flares are extraordinary,\" said Peter Maksym, a co-author from the Harvard-Smithsonian Center for Astrophysics. \"For a brief period, one of the sources became one of the brightest ULX to ever be seen in an elliptical galaxy.\" When they are not flaring, these sources appear to be normal binary systems where a black hole or neutron star is pulling material from a companion star similar to the Sun. This indicates that the flares do not significantly disrupt the binary system. While the nature of these flares is unknown, the team has begun to search for answers. One idea is that the flares represent episodes when matter being pulled away from a companion star falls rapidly onto a black hole or neutron star. This could happen when the companion makes its closest approach to the compact object in an eccentric orbit. Another explanation could involve matter falling onto an intermediate-mass black hole, with a mass of about 800 times that of the Sun for one source and 80 times that of the Sun for the other. \"Now that we\\'ve discovered these flaring objects, observational astronomers and theorists alike are going to be working hard to figure out what\\'s happening,\" said co-author Gregory Sivakoff of the University of Alberta. One of the sources, located near and presumably associated with the galaxy NGC 4636 at a distance of 47 million light-years, was observed with Chandra to flare once. Five flares were detected from the other source, which is located near the galaxy NGC 5128 at a distance of 14 million light-years. Four of these flares were seen with Chandra and one with XMM-Newton. The team looked at the X-ray variation of several thousand X-ray sources in Chandra observations of 70 nearby galaxies. Although several examples of flaring X-ray sources were found, none exhibited the behaviour of the giant rapid flares reported here.'"}, "time": 1742562103.787137}