{"duration": 0.05698966979980469, "input_args": {"text": "'WASHINGTON  —   The Supreme Court agreed on Tuesday to decide whether   George W. Bush administration officials  —   including John Ashcroft, the former attorney general, and Robert S. Mueller III, the former F. B. I. director  —   may be held liable for policies adopted after the Sept. 11 attacks. The case began as a class action in 2002 filed by immigrants, most of them Muslim, over policies and practices that swept hundreds of people into the Metropolitan Detention Center in Brooklyn on immigration violations in the weeks after the attacks. The plaintiffs said they had been subjected to beatings, humiliating searches and other abuses. The roundups drew criticism from the inspector general of the Justice Department, who in 2003 issued reports saying that the government had made little or no effort to distinguish between genuine suspects and Muslim immigrants with minor visa violations. A divided   panel of the United States Court of Appeals for the Second Circuit, in New York, let the case proceed last year. “The suffering endured by those who were imprisoned merely because they were caught up in the hysteria of the days immediately following   is not without a remedy,” Judges Rosemary S. Pooler and Richard C. Wesley wrote in a joint opinion. “Holding individuals in solitary confinement 23 hours a day with regular strip searches because their perceived faith or race placed them in the group targeted for recruitment by Al Qaeda violated the detainees’ constitutional rights,” the judges said. In dissent, Judge Reena Raggi said the majority had erred in allowing a lawsuit against “the nation’s two   law enforcement officials” for “policies propounded to safeguard the nation in the immediate aftermath of the infamous Al Qaeda terrorist attacks. ” “It is difficult to imagine,” she wrote, “a public good more demanding of decisiveness or more tolerant of reasonable, even if mistaken, judgments than the protection of this nation and its people from further terrorist attacks. ” The full Second Circuit divided, 6 to 6, over the government’s request to rehear the case. In its petition seeking Supreme Court review, the Obama administration urged the justices to put an end to the litigation. “The Court of Appeals concluded,” the petition said, “that the nation’s highest ranking law enforcement officers  —   a former attorney general of the United States and former director of the F. B. I.  —   may be subjected to the demands of litigation and potential liability for compensatory and even punitive damages in their individual capacities because they could conceivably have learned about and condoned the allegedly improper ways in which their undisputedly constitutional policies were being implemented by   officials during an unprecedented national security crisis. ” Rachel Meeropol, a lawyer with the Center for Constitutional Rights, which represents the plaintiffs, said the cases, Ashcroft v. Turkmen, No.   and two others, involved fundamental principles. “No one is above the law,” she said. “To suggest that the most powerful people in our nation should escape liability when they violate clearly established law defies the most fundamental principle of our legal system. ” “At a time when racial and religious profiling are put forward as serious policy proposals for dealing with everything from immigration to terrorism, it is more important than ever that the high court affirm that government officials, especially those at the highest levels, can be held accountable when they break the law,” she said. Unless the Senate confirms a new justice in time for arguments, the cases will be heard by just six justices, as Justices Sonia Sotomayor and Elena Kagan have recused themselves. They did not say why, but Justice Sotomayor used to be a judge on the Second Circuit and Justice Kagan was formerly United States solicitor general. They had presumably been involved in the cases in those capacities.'"}, "time": 1742563593.2760484}