{"duration": 0.21633553504943848, "input_args": {"text": "'. We Are Aliens Because Our Souls Are Extra-Terrestrial We are in this physical world, but we are not from this world. It is important to understand that ... http://humansarefree.com/2016/11/we-are-aliens-because-our-souls-are.html We are in this physical world, but we are not from this world. It is important to understand that there is an evolution of Souls going on through the earthly experience, but also a development for every individual Soul. This is how the passage into higher and higher dimensions can be explained in simple terms. There are many immature Souls on planet Earth, and also many misguided Souls. Other Souls do not possess the best intentions, or are simply controlled by beings without a body , whose intentions and evolutionary process are not commendable. Many dope addicts and alcoholics have this unfavorable trait as do many selfish and greedy people.Few humans, because of their inclinations or because of their immaturity allow unknowingly those beings to manipulate them from time to time. The beings I am referring to, are not yet developed as Souls, nor do they possess a Higher Self or higher conscious awareness — only the mortal and limited intellect. This is by no way a reproach towards them, since most Souls are going through a similar process of evolution on Earth, where beings are not born consciously aware, unlike on some other planets. Humans on Earth, because of heredity, do need conscious spiritual work on themselves in order to set themselves free from their genetic compromised DNA (and intelligence), and clear their karma in order to ascend to Higher Dimensions and levels of existence. In other words, perhaps it would help to compare a developing Soul on Earth to that of one of Earth’s children. When the child grows, he develops certain physical attributes, but also awareness, his feelings and understanding, his brain and endocrine system are in formation. Souls undergoes a similar development; they need various experiences to mature, and develop consciousness. The Universe is in perpetual growth — creation never stops. Life comes under various forms, obeys various rules, and there are as many possibilities as universes. Your planet has a heavy history of genetic manipulation and experimentation. Your kind, the pure physical human kind, was developed around a Soul, in order to experience a 3D dimension level of density, so Souls had in effect to descend down the octave of creation in order to experience duality. This occurred because of the Atlantean Fall of your civilization: The Anunnaki, Mankind\\'s Enslavement and the Afterlife Deception However, many of you have previously lived in much higher densities, but because of the fall, you had to learn to adapt to this 3D dimensional density, which was never meant to be your natural home. Other Souls have also volunteered to experience life in lower densities, or were sent here from higher densities in order to further their understanding of your world or of their own world or simply in order to help our Prime Creator on your world. These beings come from a higher plane of existence, which is their natural habitat. None of you, who are reading these messages or have a deep spiritual need, have been created in the 3D dimension, and you long to return home, where you have been created, to a higher dimension. The physical born beings will, in time, mature and become conscious enough to evolve into higher dimensions. These are the ones who are not aware of their Higher Self, but are given the experience here in order to make them aware of their potential. This is a natural process for all Souls, as all Souls will eventually make their journey back home towards our Prime Creator. It is important for you to comprehend also that although all humans look alike, their inner abilities vary greatly . Have you also considered the fact that some civilizations are so old and advanced that they can create soulless beings? Such beings are called ‘clones’ or ‘things’ on your world. This technology is already available to your scientists, and they can create or copy a human body, such as one would grow a plant. However, these beings do not possess a Soul , because they were not created by our Common Creator, but are the results of mechanical genetic engineering. This is another reason why some humans would not have a Higher Self. While their external appearance is in no way different to that of ordinary humans, the Spark of divine Life force and Consciousness is not inside of them. Those beings have mixed their mechanical genetic material with humans having a Soul, which has led to much DNA damage. There are many animals which are in human form, but not all animals are beasts, nor are all beasts animals. The Earth’s population is comprised of many Souls, with many different contracts, coming from various densities of consciousness. What man mistakes for thinking is but an intellectual awareness of things sensed and recorded within the cells of his brain for repetitive usage through what is termed \"memories.\" Memories have no more relation to knowledge of Universal Mind which is in man, than a computer records are related to the source of their recordings. What he thinks of as his living body is but an obedient and motivated mechanical construct which simulates life through motion extended to it from its Soul, which alone lives and wills the body to move. Your physical (Clay) body is terrestrial, but that is not you. Your Soul, that Consciousness which you are, is that which has a temporary physical experience for its own development. The mechanical clay body you use has a Conscious experience. But you are that Consciousness. The physical world and anything in it cannot and never has created Conscious awareness. Intelligence, as found in snakes or spiders, yes, but not Conscious awareness. Some people think that the human body — which is flesh evolved at conscious awareness — is Soul, by some totally unexplained and totally unproven method. Think of that for a minute, Pilgrim. Common sense tells us that it is not reasonable that the human sex act can create a Soul in the Prime Creator’s image, since if it was so, we would not be creations of the Prime Creator, but of our physical parents’ mortal mechanical primate bodies. The human body, which your physical parents gave you, is the vehicle you use. But You are the Soul , created in the Prime Creator’s image, using the human flesh body your parents made ready for you to use. And if a Soul is pre-existent, which it is, and can enter into a body at some time in the baby’s development stage and leave the body when it dies, then logic and reason tells us that the Soul can also enter many more times. All the physical effects in your life are only the effects of the thoughts of your Conscious mind. The so-called sins and evil are not in the action of what your mechanical body does, but in the thoughts that come from what you think. Your Soul is accountable and will reap its own harvest. All the actions and words of your body are the effects of your thoughts. Countless religious and cultural teachings, as well as many different Philosophies, commands us to do good, but sadly, goodness is still veiled like in a thick mist. Many Souls have been stumbling in darkness, scraping their knees; but worry not, for eventually they all learn to walk! Soon after this dark period we live in, there will be so much light that you will have to wear shades. New information and better comprehension periodically transforms mankind into more conscious beings and a new awareness cycle — which will last for many thousands of years to come — is now commencing. The Prime Creators’ omniscience, omnipotence and omnipresence are centered in the consciousness of each and every man; but there are only few who know of the Oneness of their Soul with the Creator. Man requires millennia to become aware of that. Each cycle brings him nearer to the awareness of his Oneness with the Source. Mankind lives in a bewildering complex world of Effects and doesn’t know the original Cause . Because of its seemingly infinite multiplicity and complexity, mankind fails to see or visualize the simple underlying principle of all things. He complicates truths and half-truths until its many angles, sides and facets have lost balance with each other and with him. All knowledge exists and is available. All knowledge will come to mankind in its own season, as needed. Enlightened Souls and messengers, periodically come and give such Universal knowledge, but only when man is able to comprehend it and only that he can bear at the moment, for man is just beginning to comprehend the wholeness. When we will master Enlightenment, we will know no limitations — but man must know the Light within oneself, the ever present Universal Consciousness . And man must want to know and to experience it oneself and then no one can tell otherwise, for Light knows Light intuitively. Mankind is aware of some of these illusions, but we are not aware of the fact that all effects are not what they seem to be. Thus we are misled into forming conclusions which have no relation to Nature and reality whatsoever. An intelligent person has mostly knowledge of the effect, but all real knowledge and understanding lies in the cause. New fundamental laws and principles must be based upon knowledge of the Cause . What little knowledge man has acquired during these last few thousand years, has been given to us by the very few geniuses, prophets, mystics and other messengers of the Light who have come to re-inspire mankind with their insight and knowledge. From these rare few, the beginnings of our culture have sprung. Without them there would be no understanding of beauty in this materialistic world. Without grasp of beauty man would still be living in caves. Through beauty alone will man gradually become consciously aware of his oneness with the Light? When man knows the Light he will know all things. Today, that Light is so dim in all men that no one, perhaps only a few, have fathomed the secret of Light, life, Love, growth, reincarnation and about the third wave of Souls entering now . The great unanswered questions of man have simple answers. The Silent Voice within every man is ceaselessly whispering it to his awakening consciousness. Every desire written upon the heart of man is carried to the Source of the original cause, and its answer will come, but only few ask from their heart and there are fewer still who listen. Many are the ages of preparation for worthiness, for man\\'s consciousness is insulated from his Source by the sensations of his per-conditioned intellect and his selfish personal Self which he wrongly thinks of as being his Mind. What man calls his objective human mind/ intellect is mortal and the seat of both right and wrong information absorption and a multitude of vibrating sensations of his mortal body. What he calls his subjective mind is his sub-consciousness, his spiritual storehouse of memory of all-knowledge, all power, and all-presence. That consciousness is his individual Self, his ETERNAL Self through which his omniscience, omnipresence and omnipotence are expressed as he slowly becomes aware of their presence within him. The electrically vibrating nerve-wires which operate his bodily mechanism act almost entirely through automatic reflexes and instinctive control, and to a very little extent through mental decisions. Each cell and organ of his body has an electrical awareness of its purpose and each fulfills that purpose without any mental action whatsoever upon the part of the Intelligence which occupies that body. The heartbeat, for example, is purely automatic. The white corpuscles of the blood rush to repair an injury to the body as automatically as a bell rings when a button is pushed. In this body and its electric recording brain, man thinks that he thinks and lives, loves and dies. He thinks himself conscious while awake and unconscious when sleeping — unaware that in all Nature there is no such condition as unconsciousness when sensation ceases in sleep. Man does not say that his tooth is unconscious when it is put to sleep by short-circuiting the electric current in the nerve-wire which gives sensed electrical awareness to his tooth. He knows that his tooth cannot be conscious, but he does not know that his mechanical body cannot be Conscious. Nor does he yet know that consciousness never sleeps, and never changes, for consciousness in man is his immortality. Man is still new. He is barely out of the dark of his jungle of ignorance. For the million or more years of his unfolding he has relied upon sensation for his actions and the evidence of his senses for his knowing. Few have been aware of the Spirit (Life force, Conscious awareness) in them. In this beginning of his new awareness he is confused, not knowing which is Mind in him, which is consciousness in him and which is sensation. He has not yet learned that bodies are but Self-created Mechanisms which manifest their centering Self, and that Self manifests the Prime Creator as One with it. Dolores Cannon: “ We Are Living in the Most Important Time in the History of the Universe ” Likewise, he has not yet learned that bodies neither live nor die, but repeat themselves continuously (“Ashes to ashes, dust to dust.”) and forever as all idea of Mind likewise repeats itself. Free will is a gift to everybody from our Creator, by following orthodox religions, scriptures, man-made systems, having blind faith, or admiring individual orators blindly without pondering and wondering if the information you get is real, truthful, or not, many have abdicated their own God given free will to the will of others by being followers and joiners. They became the effects of other people instead of making their own cause by being creative, just like the Prime Creator. (Like being loving co-creators). Think, make up your own mind about what is real and good and what is not! There is so much good in all of us, so use it lavishly and unselfishly toward everybody, but don’t be naïve or gullible. If something doesn’t make sense, it is non-sense. If you don’t search, you won’t find. Light will not come from others, it comes from within your own consciousness — it is already there waiting to escape. There is no dead, ever. The body was never alive; it is a created machine that gets the life force and instructions from the Soul consciousness that uses it — but only temporarily. Yes, we are Aliens — Extra-terrestrials. Humbly compiled in love,I am Rene’ Descartes, HumansAreFree.com I am still conscious, therefore I am. Rene’ can be contacted on  '"}, "time": 1742562887.4905558}