{"duration": 0.03784060478210449, "input_args": {"text": "'  \\nRepublicans just can’t quit fantasizing about doing bodily harm to Hillary Clinton. Over the weekend, Sen. Richard Burr noticed a picture of Clinton hanging in a gun shop and decided the owners should put a “bullseye” on it. \\nSpeaking to GOP volunteers on Saturday , Burr joked that he had recently visited a gun shop and “nothing made me feel better” than seeing a magazine about rifles“with a picture of Hillary Clinton on the front of it.” \\n“I was a little bit shocked at that — it didn’t have a bullseye on it,” Burr told the crowd in Mooresville, North Carolina. “But on the bottom right (of the magazine), it had everybody for federal office in this particular state that they should vote for. So let me assure you, there’s an army of support out there right now for our candidates.” \\nBurr’s comments echo those of his party’s presidential nominee, Donald Trump, who has called on the “Second Amendment people” to “do something” about his Democratic opponent. However, Burr is at least pretending that he feels bad about his remarks. \\nThe Senate Intelligence Committee chairman issued an apology on Monday. “The comment I made was inappropriate, and I apologize for it,” Burr said. \\nA Burr campaign official said the Senator’s remark about feeling “better” had nothing at all to do with the idea of Clinton being shot. Really. He was just referring to the support other right-wing candidates have gotten from various gun rights groups. Honest. \\nBurr also said that if he is re-elected and Hillary should happen to win the White House, he will do all he can to continue obstructing the appointment of a ninth Supreme Court justice. When asked about the possibility of Merrick Garland, President Obama’s nominee, being appointed, Burr said, “it isn’t going to happen — period.” \\n“And if Hillary Clinton becomes president, I am going to do everything I can do to make sure four years from now, we still got an opening on the Supreme Court.” \\nBurr also made it clear that he considers being responsible for the “longest judicial vacancy in history” a badge of honor. \\nYou can listen to Burr fantasize about “bullseyes” on Hillary Clinton, here : \\nFeatured image via Gabriella Demczuk/Getty Images Share this Article!'"}, "time": 1742563323.574993}