{"duration": 0.03954935073852539, "input_args": {"text": "'A series of fake news hoaxes over social media, which falsely suggested authorities had set up immigration checkpoints aimed at deporting illegal aliens, caused panic this weekend across California. [“It appears that unknown subjects are trying to create a public panic and we want our community to be assured that this is a complete hoax,” the Fontana Police Department said in a statement, according to the Los Angeles Times. “We understand that fake news can spread quickly via social media and encourage you to always fact check things you read or hear. ”  U. S. Immigration and Customs Enforcement Spokeswoman Virginia Kice told the Daily Bulletin, “We don’t do checkpoints. ” According to the San Gabriel Valley Tribune, the rumors about the immigration checkpoint were traced to the Mr Checkpoint account on Twitter, which tweeted, “NOW #InlandEmpire Immigration Checkpoint #Ontario near Euclid Ave  60 Freeway. ” @jr1224_ it was on Mr. Checkpoint. They usually get DUI checkpoints correct  they use police scanners. Haven’t passed by personally though.  —   jaime (@himay3000) February 3, 2017,  However, once Mr Checkpoint discovered those rumors were fake news, it posted on Facebook: “[]Looks like we have false reports of Immigration Checkpoints. Many people had messaged this and it looks like intentional misinformation that was meant to spread confusion  negativity. ” It added, “Please move past this so we can shift back to positive energy. ” It’s all about love! pic. twitter.   —   Mr. Checkpoint (@MrCheckpoint) February 3, 2017,  Trying to figure out this whole immigration checkpoint thing going on in Ontario right now. I’m hoping we don’t see more of these.. 😫  —   Mr. Checkpoint (@MrCheckpoint) February 2, 2017,  We received several reports of an immigration checkpoint that were found to not have occurred. Deleting that tweet and will keep you posted.  —   Mr. Checkpoint (@MrCheckpoint) February 3, 2017,  Some social media users reportedly stated that the brief detentions of some individuals in airports this past weekend, coupled with protests that wound up backing up traffic for hours, amplified concerns. “Rumors currently being circulated  —   primarily on social media, claiming the agency has set up checkpoints at multiple locations in Los Angeles  —   or that the agency is conducting random ‘raids’ are completely baseless,” Immigration and Customs Enforcement spokeswoman Virginia Kice told the Times. “The agency is working diligently to address these false reports, and we urge the media not to give them credence. It only encourages   people to act irresponsibly. ” Follow Adelle Nazarian on Twitter and Periscope @AdelleNaz'"}, "time": 1742563400.955738}