{"duration": 0.04564857482910156, "input_args": {"text": "'ISIS loses grip on Mosul: Special Forces surround jihadists November 04, 2016 Iraqi security forces launch a rocket towards Islamic State militants during clashes at the frontline in Ali Rash village, southeast of Mosul, Iraq, November 3, 2016. REUTERS/Alaa Al-Marjani \\nIraqi special forces have recaptured six districts of eastern Mosul, a day after ISIS leader Abu Bakr al-Baghdadi told jihadists they must fight to the death. Counter Terrorism Service troops have ISIS almost surrounded in Mosul, Iraq. CTS special forces took over the neighborhoods of Malayeen, Samah, Khadra, Karkukli, Quds and Karama. CTS officer: Units may try to push all the way to the Tigris river. Senior officer: Iraqi troops had also taken two thirds of another Mosul district, Intisar. Lieutenant-General Qassem Jassim Nazzal: Islamic State fighters \"are trying to get away.” Iraqi Official: \"They\\'re criminals, let the dogs eat them.” Iraqi regular troops and special forces, Shi\\'ite militias, Kurdish peshmerga fighters, backed by US Special Forces/Delta Force launched their assault on Mosul, three weeks ago. Mosul is still home to nearly 1.5 million people. Mosul resident: ISIS fighters were deploying artillery and rocket launchers in and near residential areas. Some are hidden in trees near the Wahda district in the south. Others are deployed on the rooftops of houses taken over by the militants in the Ghizlani district. Mosul resident: \"We saw Daesh (Islamic State) fighters installing a heavy anti-aircraft machine gun alongside a rocket launchpad, and mortars as well.” Hashid spokesman: Progress made on closing western flank, but not complete, ISIS fighters were seen leaving Mosul in cars on Thursday. \\n(ALI RASH/ERBIL, IRAQ) Iraqi special forces recaptured six districts of eastern Mosul on Friday, a military statement said, expanding the army\\'s foothold in the Islamic State stronghold a day after its leader told his jihadist followers there could be no retreat. \\nAn officer in the elite Counter Terrorism Service said CTS troops launched a major operation against the militants, who are now almost surrounded in their last major urban redoubt in Iraq. \\nCTS special forces took over the neighborhoods of Malayeen, Samah, Khadra, Karkukli, Quds and Karama, the statement said, inflicting heavy losses on the militant fighters and raising the Iraqi flag over buildings. \\nOne special forces officer told Reuters the CTS units may try to push all the way to the Tigris river, which runs through the center of Mosul. \\nIraqi television footage from the east of the city showed grey smoke rising, and a Reuters reporter in the village of Ali Rash, 7 km (4 miles) to the south east, heard helicopter gunships and cannon fire. Volleys of automatic rifle fire, possibly from the militants, were also audible. \\nA senior officer in the village said Iraqi troops had also taken two thirds of another Mosul district, Intisar, in the same eastern section of the city. \\nIslamic State fighters \"are trying to get away\", Lieutenant-General Qassem Jassim Nazzal told Reuters.'"}, "time": 1742564168.1443222}