{"duration": 0.08260893821716309, "input_args": {"text": "'The Screen Actors Guild entered the awards season fray with its nominations on Wednesday, which included a few surprises:  —   “Captain Fantastic,” the tale, led by Viggo Mortensen, about a bohemian family   in a woodsy Northwestern paradise, nabbed a spot in the best ensemble category, the SAG equivalent of best picture.  —   “Loving,” directed by Jeff Nichols and starring Ruth Negga and Joel Edgerton as a   couple who changed   laws, got no love.  —   Emily Blunt landed a nomination, for lead actress, for “The Girl on the Train. ”  —   “Silence,” the Martin Scorsese drama, was shut out. The guild nominations  —   still to come are those from producers and directors  —   are significant bellwethers in the awards season because they represent the industry’s favorite performances and films. SAG has 160, 000 members, about 1, 100 of whom are also in the Academy of Motion Picture Arts and Sciences actors’ branch, the largest in the academy. Last year’s SAG winner for best ensemble, “Spotlight,” went on to land the Oscar for best picture. One of this year’s favorites, “La La Land,” isn’t led by an ensemble cast but by two main actors  —   ergo its exclusion from the Screen Actors best ensemble category. “Manchester by the Sea” landed four nominations, the most, followed by “Fences” and “Moonlight,” each with three. The SAG awards will be handed out on Jan. 29. Here’s the list of nominees: Movies Actor in a leading role Casey Affleck, “Manchester by the Sea” Andrew Garfield, “Hacksaw Ridge” Ryan Gosling, “La La Land” Viggo Mortensen, “Captain Fantastic” Denzel Washington, “Fences” Actress in a leading role Amy Adams, “Arrival” Emily Blunt, “The Girl on the Train” Natalie Portman, “Jackie” Emma Stone, “La La Land” Meryl Streep, “Florence Foster Jenkins”  Actor in a supporting role Mahershala Ali, “Moonlight” Jeff Bridges, “Hell or High Water” Hugh Grant, “Florence Foster Jenkins” Lucas Hedges, “Manchester by the Sea” Dev Patel, “Lion”  Actress in a supporting role Viola Davis, “Fences” Naomie Harris, “Moonlight” Nicole Kidman, “Lion” Octavia Spencer, “Hidden Figures” Michelle Williams, “Manchester by the Sea” Outstanding cast “Captain Fantastic” “Fences” “Hidden Figures” “Manchester by the Sea” “Moonlight” Television Outstanding actor, TV movie or limited series Riz Ahmed, “The Night of” Sterling K. Brown, “The People v. O. J. Simpson: American Crime Story” Bryan Cranston, “All the Way” John Turturro, “The Night of” Courtney B. Vance, “The People v. O. J. Simpson: American Crime Story” Outstanding actress, TV movie or limited series Bryce Dallas Howard, “Black Mirror” Felicity Huffman, “American Crime” Audra McDonald, “Lady Day at Emerson’s Bar  Grill” Sarah Paulson, “The People v. O. J. Simpson: American Crime Story” Kerry Washington, “Confirmation” Outstanding actor, drama series Sterling K. Brown, “This Is Us” Peter Dinklage, “Game of Thrones” John Lithgow, “The Crown” Rami Malek, “Mr. Robot” Kevin Spacey, “House of Cards” Outstanding actress, drama series Millie Bobby Brown, “Stranger Things” Claire Foy, “The Crown” Thandie Newton, “Westworld” Winona Ryder, “Stranger Things” Robin Wright, “House of Cards” Outstanding actor, comedy series Anthony Anderson, “ ” Tituss Burgess, “Unbreakable Kimmy Schmidt” Ty Burrell, “Modern Family” William H. Macy, “Shameless” Jeffrey Tambor, “Transparent” Outstanding actress, comedy series Uzo Aduba, “Orange Is the New Black” Jane Fonda, “Grace and Frankie” Ellie Kemper, “Unbreakable Kimmy Schmidt” Julia   “Veep” Lily Tomlin, “Grace and Frankie” Outstanding ensemble, drama series “The Crown” (Netflix) “Downton Abbey ( ) “Game of Thrones” (HBO) “Stranger Things” (Netflix) “Westworld” (HBO) Outstanding ensemble, comedy series “The Big Bang Theory” (CBS) “ ” (ABC) “Modern Family” (ABC) “Orange Is the New Black” (Netflix) “Veep” (HBO) Outstanding stunt ensemble, movie  “Captain America: Civil War” “Doctor Strange” “Hacksaw Ridge” “Jason Bourne” “Nocturnal Animals” Outstanding stunt ensemble, comedy or drama series “Game of Thrones” (HBO) “Marvel’s Daredevil” (Netflix) “Marvel’s Luke Cage” (Netflix) “The Walking Dead” (AMC) “Westworld” (HBO)'"}, "time": 1742564492.4662104}