{"duration": 0.15425777435302734, "input_args": {"text": "'LOS ANGELES  —   John Mayer can explain where he’s been. In fact, once he gets going, he probably won’t stop, given the amount of time he has spent in private processing his recent   irrelevance  —   the “lean years,” as he calls them. A generational guitar talent and reliable   hitmaker with seven Grammys, Mr. Mayer is also a master conversationalist prone to verbal solos, noodling in impressionistic bursts about his nature and career, weaving in   potential   bits and a barrage of mixed metaphors as if he’s writing this story himself. That’s what got him into trouble in the first place. “The elephant in the room is that we’re sort of talking about the   dragon of the Rolling Stone interview and the Playboy interview,” Mr. Mayer said a   into a monologue about why he left pop music’s   and how ready he is, emotionally and musically, to return. Across four hectic days this month, as Mr. Mayer, lucid and optimistic, finished his   new album, “The Search for Everything,” and filmed a music video for what he hopes will be his next hit single, he seemed to especially relish reflecting on his 2010 undoing. Recalling the consequences of those infamous magazine articles  —   in which he used the phrase “sexual napalm,” chronicled his onanism in horrific detail, referred to his male anatomy as David Duke and somehow separately used a racial epithet  —   Mr. Mayer was vivid and virtuosic in his  . “What has to happen for a guy to believe that he’s totally   and be that far out of touch?” he said. “My GPS was shattered, just shattered. ” At 32 and obsessed with outsmarting the idea of a “clichéd rock star,” he explained, “I started to invent my own grenade. ” (His big mouth.) He was “a Mack Truck without brakes. ” Tabloid fame was “a   hormone” and “extracurricular stuff” anyway, Mr. Mayer said. “I basically realized I’m no good at that, so I’m going to drop that major. ” Also: “What I did was probably semiconsciously just reboot it  —   control, alt, delete. ” “It was an induced coma. ” His career had “flatlined. ” “It was cat and mouse,” he said, “and the mouse lost. ” Now approaching 40, “I’m old enough to look back on my life and go: ‘That’s probably the photonegative shot in ‘Behind the Music,’” Mr. Mayer said. “Coming up after the break  —   boom  —   the downfall. ” In reality, after those turbulent moments he moved to Montana, grew out his hair and made two more   albums  —   “Born and Raised” and “Paradise Valley”  —   that were less “Your Body Is a Wonderland” and more Laurel Canyon. “It’s rivers and cows,” he said. “There’s no sexuality there. ” The relatively modest sales reflected that. But the exile couldn’t last, not for this restless   with the baby face and a penchant for dating some of the most famous women in the world (Jennifer Aniston, Taylor Swift, Katy Perry). In late 2014, as he began writing what would become “The Search for Everything,” out April 14, Mr. Mayer realized: “I’m a young guy. I like girls. I want girls to like me. I want to make music and be thought of as attractive. I was finally ready to   that world and grow back into it. ” He thought a lot about George Clooney. “There’s a guy who can make art house films and then just decide that he’s going to be in a blockbuster,” Mr. Mayer said. “I remember thinking to myself, O. K. I’m going to basically come out of retirement from blockbusters. It’s a choice to write pop songs, just like it’s a choice to write blues songs or folk songs. Let’s write the big ones that we are capable of writing. ” And that’s how John Mayer ended up dancing with pandas. In sweats at a Hollywood soundstage, Mr. Mayer was quick to pick up the choreography for the ensemble number that would be the centerpiece for his new video. The song, “Still Feel Like Your Man,” is throwback for him: a wistful but upbeat breakup ditty that, like much of his new music, “moves and throbs and has women in it again,” Mr. Mayer said. It’s also pretty plainly about missing his most recent ex, Ms. Perry, a fact that he acknowledged might get the tabloids chirping again. “Who else would I be thinking about?” he said. “And by the way, it’s a testament to the fact that I have not dated a lot of people in the last five, six years. That was my only relationship. So it’s like, give me this, people. ” For the video, Mr. Mayer wanted to think big, giving the track the best chance to succeed as a single. The syncopation of the guitar riff, he said, reminded him of “ancient Japanese RB”  —   which he acknowledged “isn’t a thing”  —   so the video concept followed suit. “I’m not gonna ever roll around in bedsheets again,” Mr. Mayer added. On set the next day, there was a makeshift bamboo forest, a woman in full geisha garb and two people in giant panda suits, making up a bizarre tableau that Mr. Mayer called a “disco dojo. ” Yet for someone so attuned to the risk of offending people again  —   “I have nightmares about a second occurrence of” the Playboy era, he said  —   Mr. Mayer seemed sanguine about the possibility of a controversy over cultural appropriation, an issue that has dogged other pop stars. “I think we were as sensitive as we could possibly be,” he said over burgers at the Polo Lounge the day after the video shoot. “It was discussed at every juncture. ” “Part of cultural appropriation is blindness,” he added. “I’m on the right side of the line because it’s an idea for the video that has a very multiethnic casting, and nobody who is white or   is playing an Asian person. ” The video’s director, who goes by Mister Whitmore, said he and Mr. Mayer “thought long and hard about how to approach” the “fantasy element” of the concept without offending. “I hope there’s an understanding that we were sensitive to it,” he said. Still, Mr. Mayer acknowledged the current discourse. “Do I think that someone is going to tweet that this is cultural appropriation? Yes,” Mr. Mayer, an internet obsessive, said. “It’s going to be interesting to see. ” (And then there’s the dancing.) The song’s commercial prospects are a separate concern. In Mr. Mayer’s absence from the Top 40, guitars have been further silenced by electronics. Even Ed Sheeran and Shawn Mendes, Mr. Mayer’s direct descendants, work with pop songwriting teams and cover rap tracks. “I do a thing  —   I have sensibilities,” said Mr. Mayer, who has often found himself overcompensating for his pristine but often edgeless bluesy pop and coffeehouse soul. “My instincts as a musician are not exactly my instincts as a listener or a member of the world. But I believe that I am successful because I obey them. ” He added: “The only hits I’ll have left in my life  —   because there are great hit writers, but I will not go into a room with them  —   are luck songs. My record has one name in the parentheses on every song, and it’s my name. That’s important. ” Writing “The Search for Everything,” which was released in two   “waves” before its final iteration to better suit the streaming era, proved spiritually purifying for Mr. Mayer, he said. “This was the only time in my life that I was making something that I could live inside of. I’ve built a home because I needed a place to stay, not because I was into selling homes. ” While it began as a breakup album, with songs like “Moving On and Getting Over” and “Never on the Day You Leave,” it quickly transcended that. “There were times when tears came out of me, and I went, O. K. John, this is not about an     relationship. This is something more profound. ” In the last six months or so, completing the record coincided with the flipping of a biological switch  —   he called it “a chemical care package”  —   for Mr. Mayer, who recently became an uncle for the first time: He really does want to settle down. “That’s the final frontier, man. ” But as he approaches a milestone birthday, “I wish there was somebody to throw me the 40th,” Mr. Mayer said, leaning into his corniness. “I want the baby with the protective earphones” by the side of the stage. He’s even been living out of a hotel for fear of establishing another bachelor pad. “I want to say, ‘We’ll take it,’” he said, adding, “I’m right on time for my career, and I’m running late for my life. ” It’s a process. Though he’s been in therapy to work on his “attachment style” and recently quit drinking (“I’m actually very thoughtfully entering cannabis life”) Mr. Mayer is wary that his notoriety as a womanizer precedes him. “I’ve inherited a younger man’s reputation,” he said. “You can even break ‘bad boy’ into good bad boy and bad bad boy  —   I somehow managed to become a bad version of a bad boy. ” Since splitting with Ms. Perry, he’s hardly been out at all, he insisted, though he does fiddle around on an exclusive dating app. “It’s just a lot of chatter,” he said. “We all talk to the same people. There are very few people actually meeting up. ” Another hurdle is that he will be on tour most of the year, headlining arenas in support of the album  —   he plays Madison Square Garden on April 5  —   plus a jaunt with his side gig, Dead  Company, where he plays guitar alongside members of the Grateful Dead. (“The feeling of inclusion that I have with this band  —   they saved my life,” he said.) The itinerant lifestyle, though, is less fraught than whatever lurks in the   recesses of Mr. Mayer’s soul, depths he is beyond game to probe and excavate. “In the Blood,” the most fully formed, Tom   track from “The Search for Everything,” is a sort of   with Mr. Mayer singing big questions with no answers: “It’s not pretty, those words,” Mr. Mayer said in the studio as he worked on final touches. “But the one thing I look forward to the most as I   this level of the music world is I really want to experience saying something that I can defend no matter what. “It’s like: ‘John, they’re gonna come after you. They’re going to ask about it,’” he said with a cackle. “I say, ‘Let ‘em. ’”'"}, "time": 1742563841.3326805}