{"duration": 0.2152242660522461, "input_args": {"text": "'In the first episode of “One Day at a Time,” Netflix’s reboot of the   Norman Lear sitcom, Penelope (Justina Machado) has an argument with her    son, Alex (Marcel Ruiz) who wants an expensive new pair of sneakers. “Mom,” he says, “I know we’re not rich. But are we poor?” It’s a casual line that sets up a joke. (Penelope reminds Alex that they have a TV, a refrigerator and a laptop. “Those are things poor people have!” he says.) But it’s based on an acknowledgment you don’t really hear in prime time anymore: that there is a class divide, nebulous but real, and that your family is closer to the bad side of it. The new “One Day at a Time,” arriving on Friday, is lively and full of voice, a rare reboot that’s better than the original. It’s a throwback in the best sense, to an era of mainstream, socially engaged   sitcoms. And just as the political debate has pitted diversity against class in a   contest, it’s a reminder that the two aren’t mutually exclusive. In the 1970s, TV was full of characters living paycheck to paycheck, whether cabbies (“Taxi”) waitresses (“Alice”) auto mechanics (“Chico and the Man”) or brewery workers (“Laverne and Shirley”). Mr. Lear, the sitcom maestro of the era, produced a suite of shows like this: “All in the Family,” “Good Times,” “Sanford and Son. ” Mr. Lear, an   populist liberal, made   TV about the little guy. In part, the programming reflected the economy of the time. The average American wage peaked in 1973, and the middle class was broader. But, as income inequality began to grow in the 1980s and ’90s, TV, like any neighborhood buffeted by market forces, got gentrified. Advertising rates became increasingly tied to audience demographics, which made poorer viewers less valuable. Basic cable fragmented the viewership  —   more shows, made for smaller niches  —   and premium networks like HBO focused on series about the kind of people who could afford to pay for networks like HBO. TV courted upscale audiences by showing them versions of themselves. Goodbye, Roseanne Conner hello, Carrie Bradshaw. With few exceptions (like ABC’s “The Middle”) sitcoms moved into offices, cafes and living rooms populated by comfortably   characters. (A recent “ ” slyly acknowledged this remove its affluent parents were mortified when their youngest son took an aptitude test that pegged him as a future “skilled laborer. ”) Work  —   nonprofessional,     work  —   became the stuff of   reality TV (“Deadliest Catch”). Just as actual labor became increasingly invisible to consumers, shunted off overseas or hidden through     people entered TV through the poor door, or not at all. With “One Day at a Time”  —   like “Fuller House” and “Gilmore Girls,” another product of Netflix’s drive to exhume our every nostalgic memory  —   peak TV is restoring something of what peak TV took away: the kind of family that buys discounted meat at the grocery store and whose old car stalls when you turn on the  . The original “One Day at a Time,” based on the   Whitney Blake’s experience as a divorced mother, was lighter and more disposable than “All in the Family. ” (I still have warm memories of Mackenzie Phillips and Valerie Bertinelli duetting on “Don’t Go Breaking My Heart,” but let’s not kid ourselves.) But it spoke to the times. Compared with Mr. Lear’s outspoken Maude, Ann Romano (Bonnie Franklin) expressed her feminism practically  —   bouncing from job to job, getting the rent paid and raising two independent girls. (This was in 1975, just five years after it was deemed too outrageous to have Mary Richards be divorced in “The Mary Tyler Moore Show. ”) The update, which Mr. Lear produces with Gloria Calderón Kellett and Mike Royce, moves the setting from Indianapolis to Echo Park, Los Angeles, and reimagines the family as  . (Mr. Lear’s   remake of his own work recalls how he adapted the British “Steptoe and Son” as “Sanford and Son,” with an   cast.) Gloria Estefan reprises the theme song, now syncopated. There’s a   third generation: a   Rita Moreno as Penelope’s   mother, Lydia. The    daughter, Elena (Isabella Gomez, a charmer) is a school debate champ who sees her coming quinceañera as a tool of the patriarchy. The omnipresent apartment super, Schneider (Todd Grinnell)  —   played in the original by Pat Harrington, with a mustache that defined ’70s    —   is now a stubbly   hipster whose dad owns the building. The most productive rethinking involves Penelope, a veteran of Afghanistan who works as a medical assistant. The war ended her marriage  —   she separated from her husband, also a soldier, who developed a drinking problem from stress  —   and left her with anxiety and a bum shoulder. The show understands, in a way comedies about more privileged families don’t have to, that circumstances shape choices and exact costs. Despite the   laughs, the series works best in   dramedy mode. The season has a serial arc, and Ms. Machado (previously of “Six Feet Under”) handles the emotional material with a light touch. One of the strongest episodes is built around a long, frustrating phone call with the Department of Veterans Affairs as Penelope tries to wrangle a chiropractor referral. The   humor is clunkier. Stephen Tobolowsky carries some familiar workplace subplots as Penelope’s   boss, and the show leans heavily on Ricky   jokes about Lydia’s accent. Still, if the comedy can be dated, the retro approach  —   multicamera, theatrical,    —   feels current, as the headlines recall the tumult of the ’70s and the   seems to be tweeting from Archie Bunker’s armchair. (One of the season’s themes, immigration, lands harder, if differently, from the way it might have before the election.) Of course, one sitcom can represent only so much. Scripted TV still neglects   rural America, though Netflix has lately stepped into that gap with “The Ranch. ” NBC’s affable workplace sitcom “Superstore” speaks to an economy that, campaign rhetoric aside, is more about service and retail jobs than about assembly lines. Maybe they’ll have company soon: ABC, for instance, is talking about making its programming more    after the election. If efforts like this manage to find us the next “Roseanne,” that’s all good. But the new “One Day at a Time,” which arrives while Hispanic TV families are still a rarity, also casually refutes the lazy postelection punditry that “ ” is a euphemism for “white,” that there is an   choice between the “identity politics” of representing the underrepresented and a   focus on people’s economic struggles. If TV can help divided Americans see one another better, it’s by telling more specific stories of every kind. It’s true that we don’t see enough   people on TV, or military veterans or Hispanic families. And guess what? Sometimes, this “One Day at a Time” reminds us, you find all those people under the same roof.'"}, "time": 1742562180.5669107}