{"duration": 0.10442948341369629, "input_args": {"text": "'CORK, Ireland  —   When European officials ordered Ireland to collect a record $14. 5 billion in back taxes from Apple, Kieran O’Connell drew up a wish list for spending the money. A public social worker who deals with   youth, Mr. O’Connell has faced drastic cuts since the Irish government imposed austerity measures six years ago during a financial crisis. His salary was frozen and his pension taxed. With his agency’s budget shrunk 30 percent, he hasn’t been able to replace staff, keep up with the demand for addiction and retraining programs or accommodate all the homeless teenagers looking for shelter. “You could invest it in treatment centers, detox beds and community care,” said Mr. O’Connell, 50, who works in this southern Irish city, where Apple has had its European headquarters for more than 35 years. But Ireland doesn’t want Apple’s billions. Instead, the Irish government is appealing Europe’s tax ruling, a move that is exposing a rift in a country still feeling the aftershocks from years of harsh cutbacks. The Irish government’s defense is a mixture of financial realpolitik, national pride and damage limitation. The European Union’s decision takes direct aim at some of the country’s generous tax policies, calling them illegal incentives in Apple’s case. Local lawmakers, in part, worry that taking the tech giant’s billions could scare off other multinationals from investing in Ireland just as other countries vie to entice them. Many people across the country are also upset that European officials are meddling with the country’s tax policies. Apple, which is also appealing, is taking the same stand, calling the case “politically motivated. ” But it is a big payday to forgo, prompting criticism from   lawmakers, government workers and even some local fans of Apple. European officials calculate that Apple’s tax bill may rise to $21. 3 billion when interest is included. The money would go a long way toward funding hospitals, schools and other social programs. At the height of austerity, Ireland cut government salaries by   percentages, halted investment in public works and introduced a series of new taxes. In Cork, unemployment still hovers around 8 percent, or roughly the national average, after reaching highs of about 15 percent. Many young people still must emigrate in search of jobs. “That money could create at least 100, 000 jobs,” said Mick Barry, a Cork lawmaker from the   Alliance, a small political party. “It would have a transformative effect. ” This tug of war over Apple’s money is part of a broader identity crisis in Ireland since the downturn. Much of the country’s   economic growth has been tied to attracting international companies through low taxes and flexible working conditions. Almost 200, 000 Irish workers, or roughly 10 percent of the total work force, are now employed by overseas companies, according to government statistics. And Ireland is hoping to entice even more. Countries around the region are lining up to woo companies thinking about leaving Britain after it voted in June to leave the European Union. While the Irish are eager for the jobs offered by international companies, years of   are highlighting the yawning inequalities of policies that allow the world’s richest companies to sidestep billions in taxes. The improving economy only adds to the debate. Ireland has roared back from recession, but much of the recent growth is related to financial maneuvering and not longstanding improvements in the domestic economy. “A lot of people don’t have a problem with government’s appeal, but where were they during the financial crisis when Irish workers could have done with the same help?” said Declan Connolly, 39, an information technology worker for Cork’s local government. Almost a third of his colleagues have either been let go or not been replaced when they retired. Extra taxes on his income and pension have left him with roughly 10 percent less cash in his pocket. “The Irish government never did do as much for us as they are now doing for Apple,” Mr. Connolly added. Apple’s chief executive, Timothy D. Cook, has been quick to defend the company’s tax practices. “When you’re accused of doing something that is so foreign to your values, it brings out outrage in you,” he said in an interview with the Irish broadcaster RTE. An Apple spokeswoman declined to comment on the case. Cork, with a population of about 125, 000, is a contradictory blend of Silicon Valley chic and   austerity. A Starbucks in a refurbished   building on the banks of the River Lee, which meanders though the city center, attracts a techie crowd of   millennials, speaking languages as varied as Chinese and Czech.   stores like Tommy Hilfiger line the main thoroughfare, and luxury sedans carry tech and pharmaceutical executives to meetings. Yet only a few blocks away, where street stall vendors once sold fruit and vegetables, pawnshops and mostly empty casinos dot the streets. Posters at a government agency offer tips on how to deal with spiraling personal debt. A longtime port town, Cork in recent decades has made itself an attractive hub for multinationals. Companies can tap into a steady stream of graduates from the local university, along with lucrative tax breaks on any research and development carried out in the city. Rents are roughly half those in Dublin. Apple was at the leading edge of this movement, putting down roots in the early 1980s, when the company was a mere minnow in the tech world. Three decades on, Cork’s suburbs are littered with newly built office parks, where   buildings are emblazoned with logos from some of the world’s largest companies, like Dell Technologies, Intel and Eli Lilly and Company. Apple, with its fortresslike compound, is one of the area’s largest employers. Its army of over 5, 000 workers has been a boon for the local economy, pumping in millions of dollars through income tax, rents and spending at fashionable restaurants and luxury stores. When Apple arrived, its workers mostly assembled computers and other devices. But as labor costs sent production to Asia, the company’s Cork offices have now switched gears, mostly providing global customer and sales support. “Cork and Apple have stuck together through thick and thin,” said Des Cahill, the city’s mayor, who will meet company executives in San Francisco this week as part of an annual trade visit to drum up new investment. “We’re like an old married couple. ” Just a few minutes’ walk from Apple’s main campus, Cork shows a different side. Austere concrete government housing stands crumbling in the   sun. And social workers say many local residents stand little chance of landing   jobs at Apple, mostly because of a lack of   skills. In Cork’s poorest neighborhoods, austerity has meant layoffs, economic uncertainty and often little support. The number of people living on the streets jumped to 345 last year compared with just 38 in 2011, according to Cork Simon, a local homeless charity. The city’s annual budget has been cut by 20 percent, to $170 million, over the same period. For Charlie Harrington, a paramedic, the Apple tax standoff comes down to fairness. Like most people in Cork, Mr. Harrington, 53, said international companies  —   and the jobs they created  —   were more than welcome in the city. But he doesn’t think tax rules are equally applied. When he recently refused to pay a new property tax, authorities took the money directly from his paycheck. If the government was so quick to penalize his   tax avoidance, Mr. Harrington asked, then how could it protect Apple? “If the big guys don’t pay and the government helps them, then everyone else will ask why we are paying too,” he said over a cup of tea in a living room decorated with family photos. “They owe the money, so they should just pay it. ”'"}, "time": 1742563386.3671622}