{"duration": 0.07047224044799805, "input_args": {"text": "'Print \\nIt is rare to see or hear of anyone taking a stand against the rapid increase in legally forced Humanism in public life. Everywhere we look, we see freedom of speech and freedom of religion suppressed to appease a small group of Americans. \\nBut there is hope, as some still know what their duty entails. \\nChristian News reports : \\nAn activist that often works to separate God from the military is seeking the punishment of an Air Force commander who responded to a recent interview question that Jesus is his guide and influences his decisions. \\nOn Sept. 15, the focus was on U.S. Air Force Lt. Col. Michael Kersten, who serves with the 39th Medical Support Squadron. The unit provides “preventative and clinical health and wellness services for U.S. and coalition forces.” \\n“Is there a leader from your career that influenced you the most?” he was asked during the interview. “If so, who, and how did they affect the way you lead?” \\n“There’s no ONE in particular, Kersten responded. “As a Christian, my example is to be like Christ. He is my guide and affects all of my decisions. He teaches to do all things as unto the Lord and I believe this is synonymous with integrity first and excellence in all we do.” \\nOf course, atheist troll Mikey Weinstein was very displeased to see such statements on a government website. Therefore, Weinstein wrote to the base commander to have punishment inflicted for such actions. \\nChristian News continued: \\n“He has essentially stated that Christianity (or his particular interpretation/denomination of same) is the guiding policy of HIS command,” Weinstein said. “He has VERY publicly endorsed his singular view of Christian faith supremacy and it is not unreasonable or irrational to think that this widespread endorsement in an official Air Force internet publication could and/or would lead to preferential treatment of those subordinates who share his views.” \\nHe, therefore, demanded that Kertsen be both rebuked and punished. \\n“MRFF demands that you (1) expeditiously and publicly rebuke Lt. Col. Kersten’s official statement—as contrasted with his private Christian faith belief which is not MRFF’s concern—(2) appropriately and visibly punish Lt. Col. Kersten for his unconstitutional and UCMJ-violating behavior; (3) apologize to your airmen and our Turkish allies, and; (4) reaffirm an inclusive 39th Air Base Wing command climate…” Weinstein wrote. \\nIsn’t it cute that he thinks that someone would be scared of his list? Glad to report that Col. John Walker was not. \\nChristian News reports: \\n“The Air Force places the highest value on the rights of its personnel in matters of religion by its members,” he wrote. “Our Airmen are sworn to protect our rights and liberties as Americans, including the right of all Airmen to practice their religious faith of to practice no faith at all.” \\nA second letter has been sent, but, so far, Walker has not replied. \\nIt is possible that he has just chosen to ignore Weinstein. \\nArticle reposted with permission from Constitution.com shares '"}, "time": 1742562084.2542098}