{"duration": 0.25450944900512695, "input_args": {"text": "'Comments \\nThe teenager whose explosive allegations led to a federal investigation against disgraced former Congressman Anthony Weiner has published an open letter about victim’s rights, and her utter betrayal by FBI Director James Comey’s partisan memo that is so heart wrenching, that it must be shared and read by every single law enforcement officer in the country, if not the world. \\nThis entire weekend, intense media coverage has focused on one woman – Democratic nominee Hillary Clinton – most observers believe was wronged by Comey’s intentionally vague memo. All the while, the woman most harmed by FBI Director Comey’s partisan attack has been suffering in silent agony, victimized first by her abuser and then by the men with badges. \\nFBI agents claimed that they spoke with her to seek justice, only for Comey to turn around and betray her, to victimize her yet again, by thrusting her story into the white heat of the last week in a bitterly contested general election campaign’s final media feeding frenzy with one vaguely worded memo guaranteed to draw maximum questioning by the press. \\nThe anonymous teen who only went to the FBI under the promise of anonymity and was grilled by agents for seven hours just last Friday. Only minutes after ending that interrogation, she was contacted by journalists who knew her identity only minutes after ending the discussions with the federal law enforcement officers. \\nClearly, her identity was somehow no longer a secret. The media contacted the teen victim and her family before even the FBI case manager let her know about Comey’s memo, and it all happened before she could escape the public eye to safeguard her privacy. So she wrote this letter and delivered it to a national entertainment website : \\nI am the 15-year-old (now 16) who was the victim of Anthony Weiner. I now add you to the list of people who have victimized me. I told my story originally to protect other young girls that might be a victim of online predators. \\nYour letter to Congress has now brought this whole matter back into the media spotlight. Not even 10 minutes after being forensically interviewed with the FBI for seven hours, I received a phone call from a REPORTER asking for a statement. Why didn’t you communicate with the local FBI agents that I had just spoken to? They could have scheduled our interview sooner or scheduled a time to interview me later, or change locations of the interview. My neighborhood has been canvassed by reporters asking for details about me. \\nIn your letter, you chose to use a vague approach, meaning the media had to keep searching to try and find out what evidence you had uncovered and how. Every media outlet from local to national has contacted me and my family to get my “story.” Why couldn’t your letter have waited until after the election, so I would not have to be the center of attention the last week of the election cycle? \\nIn his “cooperation” with you and with his love of the spotlight, Anthony Weiner has given information that led to the media finding me. You have assisted him in further victimizing me on every news outlet. I can only assume that you saw an opportunity for political propaganda. \\nI thought your job as FBI Director was to protect me. I thought if I cooperated with your investigation, my identity as a minor would be kept secret. That is no longer the case. My family and I are barraged by reporters’ phone calls and emails. I have been even been blamed in a newspaper for causing Donald Trump to now be leading in some polls and costing Hillary the election. \\nAnthony Weiner is the abuser. Your letter helped that abuse to continue. How can I rebuild my life when you have made finding out my “story” the goal of every reporter? When I meet with my therapist next time, she will already know what we are going to talk about before I get there by reading Friday, October 28th, 2016’s New York Times article. \\nI may have been Weiner’s victim, but the real story here is that I am a survivor. I am strong, intelligent, and certain that I will come out from under this nightmare, but it will not be as a result of your doing your job to protect me. I hope that by making my letter to you public, you will think about how your actions affect the victims of the crimes you are investigating. The election is important, yes, but what happened to me and how it makes me feel and how others see me, is much more important. It’s time that the FBI Director puts his victims’ rights above political views. \\n— Girl that lost her faith in America \\nP.S. To all reporters: AP, FOX, CBS, NBC, and all other media outlets, please respect my position and stop interrupting my life! \\nIt’s impossible to read this letter without tears for the teenage girl who was victimized by Anthony Wiener, and bravely stepped forward to alert the authorities so they could stop a sad sex predator so mentally ill, that after his out of control actions cost him his career and his public image, he continued his behavior until he lost his marriage and perhaps next his freedom for the safety of others. \\nInstead, the very authorities at the FBI who pledged to maintain her anonymity and seek justice for her, and to prevent she, and others from facing the same ills, have turned into a political party with badges – and not a very well coordinated group of people with badges either. \\nOur nation needs leaders who place their duty above partisan politics, and in law enforcement we need cops on the beat to protect the victims, not to abuse the victims for their own partisan games. \\nOur nation needs for FBI Director James Comey to admit his mistakes and vacate his position, before the next victim of crime gets victimized by his unsavory political maneuvering using the country’s top law enforcement agency to slander someone else into political compliance.'"}, "time": 1742564393.7056286}