{"duration": 0.08249878883361816, "input_args": {"text": "'In the name of the people. \\nThis is the only morality. \\nPhilippine Star : \\nIf his scathing and vulgar comments are causing consternation and worry among American investors and businessmen, President Duterte said yesterday they can always pack up and leave. \\nDuterte was reacting to pronouncements from visiting US State Department Assistant Secretary Daniel Russel that his conflicting statements were causing jitters among US businessmen. \\nâ\\x80\\x9cGo ahead. Pack your bags. We will sacrifice. We will recover, I assure you. We will live and survive. We have gone through the worst of times in this planet,â\\x80\\x9d the President said in a press briefing at the NAIA Terminal 2 shortly before his departure for Japan. \\nRussel on Friday said Duterteâ\\x80\\x99s recent statements â\\x80\\x93 especially his â\\x80\\x9cseparationâ\\x80\\x9d from the US â\\x80\\x93 have ushered in a â\\x80\\x9cclimate of uncertainty.â\\x80\\x9d \\nâ\\x80\\x9cThe succession of controversial statements, comments and a real climate of uncertainty about the Philippinesâ\\x80\\x99 intentions have created consternation in a number of countries,â\\x80\\x9d Russel told reporters Monday after meeting Foreign Affairs Secretary Perfecto Yasay Jr. in Manila. \\nâ\\x80\\x9cNot only in mine and not only among governments, but also growing concern in other communities, in the expat Filipino community, in corporate boardrooms as well.â\\x80\\x9d \\nDuterte called the US official gago or stupid for asking him to tone down his anti-US rhetoric, saying it was Washington that started the rift between them. \\nâ\\x80\\x9cI had a talk with Secretary Yasay and hereâ\\x80\\x99s a guy his name is Russel, if you can just tone down our rhetoric. But I was not the one who started this rift. They are the ones who started it,â\\x80\\x9d the President told reporters. \\nHe noted that during the campaign, Ambassador Philip Goldberg got his goat when the diplomat reacted to his joke about the rape-slay of an Australian missionary during a 1989 prison riot in Davao City. \\nâ\\x80\\x9cRemember, it all started during the election. I made a comment in narration of an actual event which happened in Davao and which was covered by all media outlets there. The ambassador said something not very nice,â\\x80\\x9d he pointed out. \\nâ\\x80\\x9cYou are not supposed to do that because in an election of another country, you should be careful with your mouth,â\\x80\\x9d he said, addressing Goldberg. \\nKIKE Goldberg. \\nIn the final stretch of the campaign, Duterte joked about the rape and murder of Australian missionary Jacqueline Hamill during a prison riot. He said Hamill looked like an actress and as mayor â\\x80\\x9che should have been first.â\\x80\\x9d His remarks drew condemnation from several quarters, particularly womenâ\\x80\\x99s groups. \\nThe rising death toll in the Duterte administrationâ\\x80\\x99s war on drugs has sparked concerns among Western countries, particularly the US and the European Union. \\nFor Duterte, Russelâ\\x80\\x99s statement was an insult. â\\x80\\x9cI said donâ\\x80\\x99t do that to me. Every time they threaten us, including the EU (European Union), they think they are brighter than us,â\\x80\\x9d Duterte said. \\nâ\\x80\\x9cThen they will say â\\x80\\x98be careful, we will put you in prison.â\\x80\\x99 Son of a w***e. Go ahead.â\\x80\\x9d \\nDuterte maintained he would never be subservient to the interests of the US or any other foreign country. \\nâ\\x80\\x9cYou know before we can move forward, Mr. America, there are things â\\x80\\x93 so many things â\\x80\\x93 the massacre of the Filipinos before. These are historical hurts that would never go away,â\\x80\\x9d he said. He had earlier called the attention of the US to the massacre by its soldiers of hundreds of Muslims in the early 20th century. \\nâ\\x80\\x9cI am not also a lapdog of any country. Only the Filipinos can treat me as a lapdog. Period. Nothing else. \\nâ\\x80\\x9cDo not make us dogs. Do not. As if I am a dog with a leash and then you throw bread far away that I cannot reach.â\\x80\\x9d \\nDuterte had previously branded US President Barack Obama a â\\x80\\x9cson of a b***hâ\\x80\\x9d and told him to â\\x80\\x9cgo to hell.â\\x80\\x9d \\nDuterte also hit Russel for supposedly being too nervous about his recent state visit to China. \\nâ\\x80\\x9cNow, what did I tell to China? I went there, just being nice,â\\x80\\x9d the President said. â\\x80\\x9cI am just a small person. How can I cause distress? You are nervous because you are guilty.â\\x80\\x9d \\nDuterte said his state visit to China last week triggered a lot of speculations. \\nâ\\x80\\x9cNapakabilis ng malisya ng mga gago (These fools were quick to think maliciously). We did not talk about anything in China except to cook siopao and chopsuey,â\\x80\\x9d the President said in jest. \\nDuterte also scored Goldbergâ\\x80\\x99s statement that the US remains committed to defend the Philippines. \\nâ\\x80\\x9cThere will be no wars anymore. Who will wage war with us? China? What will they get? Japan? What defense? They want to talk about the boogeyman war,â\\x80\\x9d the President said. \\nâ\\x80\\x9cStop that s**t. Nobody is interested in wars anymore. And if there is a fight, you fight your wars. Do not include mine.” \\nPure shitlordery. \\nSo great to see. \\nAnd just for those who don’t get it: Duterte is not “anti-American,” he is anti-ZOGmerican. Filipinos have no problem with the American people, they have a problem with being slaves to international kike financial institutions and then, as already enslaved through massive debt programs and foreign ownership of infrastructure, being told by the Jew globalists that they’re not allowed to slaughter drug dealers because it’s mean. \\nDuterte is doing what every leader should be doing by default: defending the people from enemies foreign and domestic. \\nHe is creating a new model of governance in the post-industrial era.'"}, "time": 1742564156.0219014}