{"duration": 0.051206111907958984, "input_args": {"text": "'Attorney Harmeet Dhillon, who is representing the Berkeley College Republicans in their free speech case against the University of California, Berkeley over failing to allow Ann Coulter to speak on campus on equal terms, slammed the American Civil Liberties Union (ACLU) for ignoring the case. ”[“I don’t see the ACLU here in this room, which is unfortunate,” Dillon said, after listing several prominent Democrats who join her in opposing Berkeley’s efforts to restrict Coulter’s speech.  Asked whether there was “something special” about suing UC Berkeley, the home of the Free Speech Movement, Dillon answered: “I never thought I’d be on the same side of an issue as Willie Brown, Bernie Sanders, Bill Maher, Keith Ellison, and every other person who’s a lawyer. Now, there are some amateur lawyers, like Howard Dean, who looks up a case on the Internet and then thinks he’s a Supreme Court scholar  —   and, you know, some of our members of Congress who play lawyers on TV, apparently. But no, I think I don’t know any lawyers, serious lawyers practicing constitutional law, who think that this is appropriate. “And I have had dozens and dozens of emails and calls from lawyers who don’t know me, around the country. They all start with, ‘I don’t support what Ann Coulter says, but,” you know, or, ‘I hate what Donald Trump stands for, but you’re absolutely right on this, and this cannot stand.’ “And nor should it stand if it were happening on a conservative college campus and it were liberal students whose views were being marginalized. ” She noted that her passion for free speech issues was born when she was a student at Dartmouth, when some students were expelled for criticizing a music professor in print. “Who represented us in the hinterlands of New Hampshire? The American Civil Liberties Union came in to represent my colleagues on the Dartmouth Review. ” She remarked, in that context, that the ACLU’s absence at Berkeley was noteworthy. As Breitbart News noted last month, Dhillon once served on the board of the San Francisco Bay Area chapter of the ACLU. She is a noted Trump supporter, and serves as the vice chair of the California Republican Party. She is reportedly under consideration to be named to lead the Civil Rights Division of the U. S. Department of Justice. Dhillon is also representing Trump supporters who were attacked by   rioters outside a Trump rally in their lawsuit against the city of San Jose for failing to protect them from the mob. Critics say the ACLU has been drifting in a left direction for many years, often abandoning its absolute adherence to basic civil liberties in favor of a   redistributionist, and   concept of rights. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742562187.169681}