{"duration": 0.016121387481689453, "input_args": {"text": "'Share on Twitter Print This Post \\nThe FBI is examining how a Hillary Clinton aide handled emails. The examination has nothing to do with the Democratic nominee, her emails, or her email server. \\nAccording to Newsweek’s Kurt Eichenwald, the “scandal” is related to the process Clinton aide Huma Abedin used to print out emails for the then secretary of state to read. \\nEichenwald reported: Because Clinton preferred to read documents on paper rather than on a screen, emails and other files were often printed out and provided to her either at her office or home, where they were delivered in a diplomatic pouch by a security agent. Abedin, like many State Department officials, found the government network technology to be cumbersome, and she had great trouble printing documents there, investigative records show. As a result, she sometimes transferred emails from her unclassified State Department account to either her Yahoo account or her account on Clinton’s server, and printed the emails from there. It is not clear whether she ever transferred official emails to the account she used for her husband’s campaign. \\nAbedin would use this procedure for printing documents when she received emails she believed Clinton needed to see and when the Secretary forwarded emails to her for printing. Abedin told the FBI she would often print these emails without reading them. Abedin printed a large number of emails this way, in part because, investigative records show, other staff members considered her Clinton’s “gatekeeper” and often sent Abedin electronic communications they wanted the Secretary to see. \\nThe entire scandal is about how emails were printed. It has nothing to do with how Hillary Clinton handled emails or classified information. The investigation is related to how an aide printed emails for Hillary Clinton to read. No wonder Comey didn’t provide more details in his letter to Congress. The details of what is being examined are an embarrassment to the FBI. \\nThere is no evidence that Clinton’s aide committed a crime. For the printing of the emails to be deemed criminal, there must be evidence that Abedin intended to leak classified information. There remains zero evidence of criminal activity. \\nThe FBI examination of new emails is turning out to be one of the most overblown red herrings of the 2016 election , and Comey’s behavior is a disgrace to the US intelligence community. \\nThe new information destroys Republican hopes that the new emails were the game changer that could save them from defeat . Republicans may spend the remaining days pushing the emails, but their behavior will be the hallmark of a desperate party that is facing a crushing defeat. \\nThe emails won’t change anything in 2016, but they will give Congressional Republicans a reason to keep investigating Hillary Clinton in 2017 and beyond. In other words, James Comey is already delegitimizing Hillary Clinton’s potential presidency.'"}, "time": 1742628535.4438431}