{"duration": 0.08355116844177246, "input_args": {"text": "'Home / Be The Change / The State / Sheriff Says Cannabis Makes People Murderers Because “Rational Thought” Leads to Violence Sheriff Says Cannabis Makes People Murderers Because “Rational Thought” Leads to Violence Claire Bernish May 10, 2016 35 Comments \\nIt isn’t gang violence. It isn’t even domestic violence. What is the leading cause of murder in Carson City? According to Sheriff Ken Furlong, it’s marijuana. \\n“It’s against that law,” Furlong told local ABC affiliate, KOLO 8. “It does change people’s attitude and we do see people dying as a result of it, needlessly, and there’s no excuse for it. \\n“In the last 13-15 years, all of the violence we’ve seen that has turned deadly, have [sic] been in someway related to a marijuana issue.” \\nBefore you get too excited, thinking Furlong nailed it — the fact cannabis remains a federal Schedule 1 drug and thus technically illegal in the ongoing yet utterly failed war on drugs — that isn’t all he had to say on the matter. \\nKOLO 8 noted the 2016 deaths of 18-year-old Grant Watkins and 40-year-old Dennis Watkins, Jr. — both killed during transactions involving the sale of cannabis. \\n“During a transaction, they set it up, ‘I’m going to sell this to you,’ then all of a sudden someone gets shot and killed,” Furlong continued. “It’s not because they were under the influence; it’s because they were doing something deadly and it turned out that way.” \\nAs Furlong explained, the threat to life isn’t due to the drug’s effects on the system, per se , but the ‘culture and crimes’ surrounding it ‘that can be overwhelming,’ as KOLO 8 paraphrased. \\n“It’s a very cherished culture and people have very strong beliefs,” the Sheriff elaborated. “When you violate someone’s beliefs, you put them in a position where they can act out.” \\nBut Furlong’s complete lack of understanding of all things cannabis — including both medicinal and recreational aspects — didn’t stop there. According to the Sheriff, the community faces repercussions following a law enforcement drug bust — because addicts suddenly have no way to procure their … cannabis. \\n“We’re watching very closely, not only for a spike in crime, but for people who are in critical need of medical care because of that lack of treatment, based on withdrawal from the drug,” he asserted. \\nYes, you read that right. Carson City’s Sheriff-in-charge firmly believes depriving people of cannabis — a plant scientifically and anecdotally proven to save lives — will lead to a crime wave and health crisis of no small proportions. \\nBut what he explained next, as paraphrased by KOLO 8, harkens back to the earliest days of cannabis prohibition and the propagandist classic, Reefer Madness: \\n‘Sheriff Furlong says unlike other drugs like heroin or methamphetamines that can distort your mind, people using marijuana usually have rational trains of thought which give them the ability to act out and become violent when someone takes away or violates their drug.’ \\nAt this point, if you’re having a good laugh, stunned, or shaking your head, you most certainly are not alone. \\nObviously, Sheriff Furlong grasps the potential perils in black market trade — but he wholly fails to recognize removing cannabis’ illegality would thus remove the risk of violence. When the State is removed from consensual business transactions, individuals are free to conduct trade as they see fit — if cannabis were abundant and legal, it would be highly unlikely people would continue killing each other over soured deals. \\nBut Furlong’s stupefying lack of knowledge concerning the effects cannabis has on the body, though certainly laughable, also should concern the residents he’s tasked with overseeing. \\nMischaracterizing cannabis so broadly as to believe it will warp people’s minds to a heightened frenzy where they’re likely to commit violence is downright dangerous. \\nFor one thing, this inexcusable misperception could color the training Sheriff Furlong decides to give law enforcement trainees and officers. Considering the absolutely epidemic national spate of violence inflicted by trigger-happy cops who already seem to have an irrational fear of the public, training them to further view cannabis users as likely to act out physically is nothing short of dangerous. \\nIf sheriff’s deputies conduct a raid on a residence known for cannabis transactions with the preconception the people inside could turn violent instantly, it’s arguable they would be more likely to misinterpret anything they encounter. This unnecessarily heightened fear that their life could be in peril from a cannabis-crazed maniac would have obvious influence on their decisions for whether or not to employ deadly force. \\nSadly, Sheriff Furlong likely isn’t alone among law enforcement in the United States. As long as the drug war remains firmly entrenched in policy and culture, dangerous misunderstandings and lack of knowledge will arguably be the greater source of violence than would the substances be were they not illegal. \\nIn the meantime, while forced to pick apart drug laws state by state, perhaps drug and cannabis education — not fear- and prohibition-based propaganda, but serious education — should be mandatory in law enforcement training. Share Google + Lannim \\nAll he did, without knowing it, was admit that the real criminals are the ones who enforce prohibition and create this culture of violence. When you suppress a legitimate market it will be replaced by a black market that is regulated by force instead of voluntary interaction. Violence begets violence, and it doesn’t get any more violent than the state. ACAB Matt Agorist \\nEXACTLY! James Michael \\nConsidering the government never created a constitutional amendment allowing prohibition the entire drug war is treason and felonius…. EVERY killing a murder…. EVERY raid a felony home invasion…. EVERY jailing a false imprisonment…. EVERY fine extortion…… The cops and the courts are a criminal enterprise…. AKA RICO….. and meet the definition of it perfectly…. Lannim \\nExactly. I would say that the drug war would be just as illegitimate and criminal with an amendment, but being able to argue that it’s ALSO unconstitutional helps, considering most Americans think their rights are contingent upon what’s written on sacred documents. b4integrity \\nThe federal government is a continuing, criminal, domestic, terrorist enterprise. \\nWe need a DEA eradication program. Paschn \\nGoddamn it does my old heart good to see folks lay things out as you did! Couple that with SCOTUS’ treason with corporate citizenship, Patriot act, Habeas corpus gone, Posse Comitatus, gone granting civil immunity to big pharma, setting up a federal committee to “review” claims made by citizens harmed by “safe” vaccines, then paying off those claims WITH TAX PAYER MONEY to protect the bottom line of the elites…. Murdering Ranchers for pointing out the FED’s treason.. Let us not forget the 2 sets of books most governments run (CAFR). Let me know when you folks have had enough SEWER NATION – IDIOT CULTURE. Centrist Force \\nThis is easy to solve. end the criminal part of this. There is no need for marijuana to be illegal. You want to end drug deals and guns get the cops out of the equation and nobody needs to play this mob games. Gregory Pius \\nWe did that in Oregon and Washington. Tax revenues are bursting the state coffers, and the police now have to find honest work (or at least overzealously enforce something else). Everybody wins. Sadly, almost all LEOs I’ve ever heard to talked to have a deeply-held conviction that legalization of cannabis will result in the loss of their job. A … kaynash \\nWe have far too many ignorant people in positions of power…..of course our press doesn’t help either, they are just as ignorant, so no one is getting educated from that source any longer. But really, a Sheriff? If you are going to criminalize people, you should have a much better understanding of what you are saying. Because thinking people in law enforcement are more than aware that it’s criminalizing drugs that is the problem….and this guy actually comes close to realizing that and then draws the totally wrong conclusions from it. dufas_duck \\n“When you violate someone’s beliefs, you put them in a position where they can act out.” \\nSounds like he described the average policeman…….. Gregory Pius'"}, "time": 1742628404.1124253}