{"duration": 0.04111671447753906, "input_args": {"text": "'Venezuela marked its fiftieth day of nationwide protests against the socialist government Saturday, with an estimated 160, 000 peaceful protesters taking the streets of Caracas and another 40, 000 congregating in   Táchira, state, home to one of the nation’s most resilient   movements. [Venezuelans around the world also congregated in cities with large diaspora populations to demand an end to dictator Nicolás Maduro’s regime. In Miami, celebrations of Cuban Independence Day on Saturday merged with Venezuelan exile protests against Maduro.  Protesters in Caracas  —   participating in a march the opposition called “We are Millions”  —   demanded elections on Saturday, as well as an end to the military violence against unarmed protesters that has left 47 dead since protests began in late March. The protest spanned from the main Francisco Fajardo highway to the Ministry of the Interior in the capital. Francisco Fajardo has been home to some of the most violent clashes between protesters and the Bolivarian National Guard (GNB) which Maduro has permitted to use tear gas, rubber bullets, and armored tanks to killed protesters. The highway has also been the scene of two of the most iconic images of the protests so far: an elder woman defying an armored tank and a nude young man climbing a tank holding a Bible, demanding an end to violence. “I am still here despite all this,” Leonard Quintero, a stylist, told   Presse. “No fear, because we have to support and defeat this with resistance. ” Police attacked protesters with tear gas and rubber bullets yet again. The most violent incident in Caracas on Saturday, however, was a panicked attack on an individual the crowd accused of being a thief and Chavista, who protesters doused in gasoline and set on fire. The man has been identified as Orlando Figuera, 21. (Warning: Graphic Images) In addition to violence from the military, protesters often have to contend with attacks from Chavista gangs known as colectivos, who beat and shoot unarmed protesters as an intimidation measure. In Táchira, a Colombian border state that has borne the brunt of much of Maduro’s   violence, multiple reports estimate that over 40, 000 Venezuelans took the streets of the capital, the college town San Cristóbal, to demand an end to the Maduro era. Táchira was among the first states to rebel against Chavismo, beheading a statue of Chávez during the 2014 wave of protests. The mayor of San Cristóbal, Daniel Ceballos, was arrested by secret police (Sebin) in 2014 for supporting the   protests. Ceballos was sentenced to 12 months in prison in 2014, but remains detained in what his mother has condemned as deplorable conditions. Maduro recently deployed 2, 600 troops to the region in response to peaceful protests. A esta hora, los valientes de Coloncito, Táchira, recorren sus calles en procesión. Ante feroz represión, siguen con más fuerza en la calle! pic. twitter.   —   María Corina Machado (@MariaCorinaYA) May 22, 2017,  Freddy Guevara se apareció sorpresa en Táchira (Video)  https:  .  pic. twitter.   —   DolarToday® (@DolarToday) May 20, 2017,  In Miami, Venezuelan exiles joined   Cuban Americans at José Martí Park, named after the Cuban founding father, holding signs reading “Liberty Trumps Tyranny”  —   a nod to President Donald Trump’s repeated vows to support   dissidents from both Cuba and Venezuela, and calling for an end to state violence against protesters in the South American country. “We hope that Trump blocks the oil of Maduro,” one protester, Carlos Fernandez, told the local outlet WSVN. “That will throw down not only Maduro, but also [Cuban dictator] Castro. ” Venezuela’s government is closely tied to the communist dictatorship in Cuba, and has provided the island with free oil for nearly two decades in exchange for doctors, medical supplies, and support on the international stage. The Venezuelan newspaper El Universal estimated the Miami congregation to be about 2, 000 people strong. At press time Monday, hundreds had congregated throughout Venezuela for Day 52 of protests. These assemblies appeared focused on demanding that the socialist government reform their economic policies and allow the distribution of humanitarian aid, particularly medicine and food. Venezuela’s Pharmaceutical Federation (Fefarven) estimates the nation is lacking 85 percent of medications on the World Health Organization (WHO)’s list of drugs required to run a functional health care system. Hospitals and pharmacies have faced shortages of staples like ibuprofen, birth control, and cancer drugs for years. #22Mayo Sin miedo #Lara sale a la calle este lunes, nuestra lucha no se detiene. Hoy por los pacientes, por los Venezolanos alzamos la voz pic. twitter.   —   María Teresa Perez (@perezmateresa) May 22, 2017,  ”Queremos medicinas, no queremos represión” corearon antes del inicio de la marcha de sector salud #PZO | vía @mramirezcabello pic. twitter.   —   Francisco Sucre (@fcosucre) May 22, 2017,  #22May Desde #Anzoategui exigimos la Apertura del Canal Humanitario.  #GranMarchaPorLaSaludYLaVida pic. twitter.   —   Armando Armas (@ArmandoArmas) May 22, 2017, '"}, "time": 1742628532.1328566}