{"duration": 0.0632619857788086, "input_args": {"text": "'Michele Paccione / Shutterstock.com \\nAll right, we have him. My reaction to Trump’s victory is barely of interest to me, and so it may be that the world is not waiting in quiet desperation for an account. I have no information on this matter from Ulan Bator or Sulawesi. Insofar as my reaction was that of half of the country, it may be of note. \\nMy reaction was, “Yes! Yes! Yessss!” \\nThis of course is because like all of Trump’s supporters I am sick of corruption, oligarchs, New York, candidate’s who sell state favors surrounded by serial rapists and goofy-looking pedophiles, and the goddamned bought-and-paid-for media. \\nAnd then I wondered how much I should be delighted. I am not a particularly enthusiastic Trump fan. The man seems radically incoherent, almost nutty. What now? Of the things Trump has promised, which, if any, make sense? Which are unthought-out huff and puff? From what will he back away? Will he transmute himself by degrees into Hillary? \\nFor example, his Wall. As a metaphorical expression of opposition to immigration, it serves well. As a practical project? No. What are the specifics? A Wall made of what? How high, how deep under ground, requiring how much of what materials? Do the arithmetic on yards of concrete and feet of rebar and then pour yourself a stiff drink. Flimsy is cuttable, tall requires only a taller ladder. \\nElectronic monitoring sounds good, but would require either use of the military as a domestic police force to patrol the Wall–hello, Guatemala–or a huge new federal bureaucracy working three shifts, often housed in barracks in uninhabited country. Helicopters, sensors, big contracts for the same. \\nThings that would actually work to discourage illegals, such as heavy prosecution of people hiring illegals, this by using federal laws already on the books and a Justice Department he will control, do not feature greatly in his talk. Uh…why not? \\nHe wants to put a thirty percent (or whatever: he isn’t consistent) tariff on goods made by American companies in China and brought back for sale in the US. So an iPad goes from $1000 to $1300, whereupon Samsung corners the market. So he puts an equal tariff on Samsung’s tablets. The effect is of a heavy tax on the American consumer. \\nThe underlying problem is that if labor is a dollar an hour in Bangladesh, and $40 an hour in America after including benefits, bringing jobs back to America is going to make things much more expensive for Americans. Breaking unions, which are irrelevant today anyway, or charges of currency manipulation will not make enough of a difference to make a difference. \\nTrump has said that he will rid the country of illegals, of whom there are between ten and fifteen million, in eighteen months to two years. Anyone want to make bets on this? He seems to have backed off, as he seems to back from many things that got him elected. \\nHe wants to end welfare for illegals. This would have the desired effect on unemployed illegals, but a lot of welfare comes from states, no? Does he have the authority? \\nHe has talked of removing citizenship from children of illegals. If he does this by executive order, he will establish a new Presidential power to revoke citizenship of anyone he pleases. Otherwise the question will assuredly go to a hostile Supreme Court. Can he make a state stop offering schooling to children of his choice? \\nAnd of course ending benefits for children of illegals will result in night after night of television of poor little Rosita Gomez, aged eight, being dragged in tears and perhaps handcuffs from second grade by brutal federal marshals when all she wants to to learn English and be a good American, etc. Will California buy into this? Will the country? \\nHe has talked of getting American troops out of Japan and South Korea on grounds that those countries can pay for their own defense if they want it. Good idea. However, it would mean the end of the American Empire in Asia. This would fly like space ships with the public–who really gives a damn about the Empire?–but would face squalling, roaring opposition from NATO, the Neocons, the arms industry, imperialists. and the international welfare clients–countries benefiting from free American stuff. \\nBucking these would take great, clanking brass balls and a really good ballistic vest. Does he have them? Already he seems to be backing off removal of troops from South Korea. \\nHe talks of getting out of, or disbanding, NATO. Great idea. NATO’s real purpose is to keep Europe under Washington’s control and to supply sepoys to provide a thin coating of legitimacy to imperial wars in places like Afghanistan–not excessively a North Atlantic country, but never mind. The idea that Europe, with over twice Russia’s 145 million people, and a much greater economy, needs America to defend it against an uninterested Russia–nuff said. But hey, exuberate the rubes, scare’m, tell them you will protect them, send money. Works every time. Can Trump stand up to this? \\nI hope so. I bet not. \\nHe was going to ban Muslims. This seems to have disappeared from his web site. Again, backing off. \\nIn short, I think he can’t do or won’t do most of the things he said he would do. The question here is not whether he should do them–I think several are splendid ideas–but whether he can or will. \\nEnd “sanctuary cities”? How? By cutting off federal funding, he has suggested. Will he use an executive order–that is, do it by fiat? If he can cut off funding to one city for one reason, he can cut off funding to any city for any reason. (Another interesting new power.) Didn’t Congress use to have something to do with funding? \\nIn his policies on immigration, he faces three grave problems. First, Mexicans at least are not behaving badly enough. While most people would happily keep more from coming in there is no groundswell for kicking them out–furious internet commentators notwithstanding. Second, the President doesn’t have the legal authority to dictate local policies. Can he tell Los Angeles not to treat Latinos in hospitals? To stop issuing driver’s licenses? Third, in places with large Latino populations he will run into passive resistance. A city that doesn’t want to find illegals won’t. \\nMy predictions, subject to ingestion of crow: No ethnic cleansing of illegals. No wall. No tight ban on Muslims. No punishment of sanctuary cities. No termination of welfare by states. No major decrease in military deployments. No war with Russia. Few or no jobs repatriated. \\nFred is reachable at jetpossum-readers@yahoo.com. Put “pdq” in the subject line of your email will be heartlessly autodeleted. Lack of response usually due to volume, not bad manners. (Reprinted from Fred on Everything by permission of author or representative)'"}, "time": 1742628469.9604805}