{"duration": 0.01588916778564453, "input_args": {"text": "\"By Jameson Parker Election 2016 , Miscellaneous , News , Politics November 8, 2016 The Look On Chris Christie’s Face As He Goes To Vote For Trump Says It All (IMAGE) Google Pinterest Digg Linkedin Reddit Stumbleupon Print Delicious Pocket Tumblr \\nChris Christie was once one of Trump’s fiercest critics – shortly before endorsing him. Since that time, Christie has bounced from humiliation to humiliation at the hands of Trump. Stories of Trump’s schoolyard bullying of Christie range from the time he made the Governor of New Jersey get him french fries, to the time he publicly mocked his weight, to the time he told Christie to get off the stage and wait on the plane, to the time he suggested Christie could be vice president only to change him mind at the last minute and pick Mike Pence instead. \\nThe last 16 months have been hard on Christie. The indignities were written all over his face as he walked, alone and in the dark , towards the voting booth in New Jersey. A man, broken and demoralized, casting a vote for the guy who routinely humiliated him. If a picture says a thousand words, then what does this say? Here's a picture of Christie going to vote this morning at 6:06 am, right when polls opened. He didn't tell press. https://t.co/3QIgk1sgBW pic.twitter.com/tJEMSwN1y0 \\n— Annie-Rose Strasser (@ARStrasser) November 8, 2016 \\nPerhaps nobody in America had a worse year than Gov. Chris Christie – and nobody has deserved his comeuppance more. All but conceding that his time in politics was over, the deeply unpopular governor ignored the job he was elected to do in New Jersey to fly around the country with Donald Trump. Those fast food orders weren’t going to pick up themselves. \\nIn the meantime, the “Bridgegate” scandal that had torched his administration was drawing to a close, with several of his former advisers implicating Christie himself in the plan to shut down traffic to punish a political rival. Just last week, things reached their inevitable conclusion with many of his closest staffers being convicted of the crimes. Christie, who has no possible route to office ever again, seems to understand that 2016 marked a Rubicon of sorts. He crossed the river and there is no going back. His reputation, his lifetime’s work in government, his chances for a future presidency, have all gone up in smoke. \\nAnd so he drudged in the bitterly cold New Jersey pre-dawn towards the ballot box. Broken, beaten, and hollow. Chris Christie casts his vote for Donald Trump; his abuser, yes, but also the only man who will take his calls. \\nFeatured image via Twitter\""}, "time": 1742628464.573877}