{"duration": 0.14229702949523926, "input_args": {"text": "'WASHINGTON  —   He didn’t see it coming. Speaker Paul D. Ryan was in a hotel room in Cincinnati last May when he learned that Donald J. Trump  —   a man he barely knew, with no institutional ties to his party and a mouth that had already clacked his nerves  —   had secured the Republican nomination for president. Mr. Trump had recently lost the Wisconsin primary, which Mr. Ryan and other Republicans in the state thought would presage the reality television star’s demise. Senator Ted Cruz of Texas had made strides, and Mr. Ryan thought the campaign would snake into the summer. But he badly miscalculated. The ensuing path, from Mr. Trump’s securing the nomination to Mr. Ryan’s decision not to have the nominee appear with him at a rally in Wisconsin a month before Election Day, has been jagged and treacherous, marked by brief moments of hope that Mr. Trump could be controlled, followed by the sinking realization that he could not. Mr. Ryan heard the persistent  —   at times desperate  —   appeals of Reince Priebus, chairman of the Republican National Committee and a fellow Wisconsinite, and the angry calls from his rank and file, and neither could move him closer to Mr. Trump. Now, Mr. Ryan finds himself in a singular abyss, desperate to maintain the voter enthusiasm needed to preserve Republican control of Congress, yet unable to defend his party’s presidential nominee. If Mr. Trump is defeated on Nov. 8  —   as Mr. Ryan has all but conceded  —   but Republicans maintain their House majority, it will fall largely to Mr. Ryan to piece the rubble of his party back together. There is, of course, the question of whether House members would let him do so. The Republicans’ crisis would have an early reckoning with the House decision on whether the speaker should be Mr. Ryan  —   whose beliefs in free trade, tolerance toward immigration, changes to entitlement programs and conservative governance have long been Republican orthodoxy  —   or a new brand of leader who embodies Trumpism. Democrats have moved quickly to paint Mr. Ryan as spineless and calculating for not outright rescinding his endorsement of Mr. Trump, while the right flank in his own party has taken a polar opposite view, saying Mr. Ryan should not publicly criticize the nominee. On Saturday, Mr. Ryan’s office added to that criticism of Mr. Trump, if indirectly, trying to tamp down the nominee’s talk of a “rigged” election. “Our democracy relies on confidence in election results, and the speaker is fully confident the states will carry out this election with integrity,” said AshLee Strong, a spokeswoman for Mr. Ryan. For his part, Mr. Trump has been unsparing in his disparagement of Mr. Ryan. Last week, in a series of Twitter posts, he called Mr. Ryan “our very weak and ineffective leader,” who was lending “zero support” and “should spend more time on balancing the budget, jobs and illegal immigration and not waste his time on fighting Republican nominee. ” For now, the speaker spends his days treating Mr. Trump like a disgruntled former employee bent on Twitter revenge, essentially ignoring him. Instead, he gives speeches about the   tax credit and the evils of Hillary Clinton, while furiously raising money for suddenly endangered House Republicans. “Right now his objective is crystal clear,” said Representative Tom Cole, Republican of Oklahoma, “to retain the Republican majority in the House. In that effort he has helped members of the Freedom Caucus as well as those in the Tuesday Group and everyone in between,” he said, referring to the most conservative and most moderate members. “We will worry about our internal differences after the election. Right now we are in a bar fight and every Republican is worth saving. ” That Mr. Ryan and Mr. Trump were never natural allies is understandable. They had met only once before the business tycoon decided to run for the White House, an encounter at a   in New York during the 2012 campaign. Mr. Ryan was Mitt Romney’s running mate. Their paths would not cross again. “Trump really wasn’t on Paul’s radar screen,” said A. Mark Neuman, a Ryan friend for two decades. “Before this presidential race, there was almost no intersection in their lives,” he said, noting that Mr. Trump did not share Mr. Ryan’s passions for the Green Bay Packers, hunting, church, intense workouts and Midwest life with children. The relationship showed strains from the start, with Mr. Ryan alarmed by Mr. Trump’s   rhetoric and nationalistic appeals. The speaker decided to offer a policy agenda with no connection to Mr. Trump for other Republicans to embrace, a move almost   during a presidential campaign. “If we try to play our own version of identity politics and try to fuel ourselves based on darker emotions, that’s not productive,” he said. He made calls to several of the Republican presidential candidates to outline the agenda Mr. Trump feigned mild interest but they did not speak again. (The Trump campaign did not return emails with questions for this article. Mr. Ryan also declined to be interviewed.) Mr. Ryan had hoped that Mr. Trump would eventually embrace his plan. When Mr. Trump clinched the nomination in May, Mr. Ryan was rattled, said several people who talked to him that day. “The conventional wisdom among the people we talked to here was, ‘Don’t worry, this will end,’” said Charlie Sykes, a former conservative talk radio host in Milwaukee and a friend of Mr. Ryan’s. “So it was a huge shock. I think a lot of us here believed we were going be the firewall in Wisconsin, that there would be an outbreak of rationality. ” With campaign rhetoric getting increasingly contentious, Mr. Ryan made the unusual choice of announcing that he was not ready to endorse Mr. Trump. None of this pleased Mr. Priebus, who prided himself on building the modern Republican Party in Wisconsin and longed for unity going into the race against Mrs. Clinton. In text messages and phone calls, Mr. Priebus tried to persuade Mr. Ryan  —   who was relishing his independence  —   to accept Mr. Trump, said numerous officials with knowledge of the exchanges who requested anonymity to discuss internal party matters. Mr. Trump would yell at Mr. Priebus and in turn Mr. Priebus would needle Mr. Ryan. When that did not work, Mr. Trump claimed Mr. Ryan had agreed to endorse him before a visit to Capitol Hill to try to woo fellow Republicans, a claim Mr. Ryan viewed as a serious breach. “That was the first realization that Trump wasn’t just a public persona,” said a Republican involved in planning the meeting, who insisted on anonymity so as not to alienate Mr. Trump, “but that his staff does not deal in good faith. ” In June, after a period of relative silence on Mr. Trump’s part, Mr. Ryan finally felt comfortable enough to endorse him. Staff members of both men began to coordinate for the Republican National Convention. But days later Mr. Ryan aggressively criticized Mr. Trump for his remarks about a Hispanic judge. Another outburst, and another brick on the wall was laid. “He was genuinely just outraged after all those comments,” Mr. Sykes said. A bright spot came in July, when Mr. Trump chose Indiana’s governor, Mike Pence, who has long been close to Mr. Ryan, as his running mate. Privately, Mr. Pence tried to assure skeptical Republicans that he would impose Mr. Ryan’s policy agenda if he and Mr. Trump captured the White House. Then in August, Mr. Trump toyed with endorsing Mr. Ryan’s opponent in a primary. Mr. Ryan, for his part, went on with his summer, serving as the chairman at the convention, where his role was unusually diminished. He watched Mr. Trump’s acceptance speech from a sky box. Mr. Trump called Mr. Ryan a handful of times after the convention, once to tell him about his choice of Mr. Pence, and to seek debate advice, which Mr. Ryan said focused on preparation. (Not heeded.) By the fall, Mr. Ryan had basically stopped speaking Mr. Trump’s name. The nominee made a request through the R. N. C. to campaign with Mr. Ryan, whose team agreed to invite Mr. Trump and Mr. Pence to an event this month in Wisconsin. Then came the tape of Mr. Trump making vulgar and lewd comments about women in 2005. Mr. Sykes let Mr. Priebus know via text that Mr. Trump was no longer welcome in Wisconsin. Mr. Sykes said Mr. Priebus responded: “I am the guy trying to fix this! I am in tears over this. ’” (A spokeswoman for Mr. Priebus acknowledged that he was upset, but denied any tears.) Mr. Ryan agonized over his options. Ultimately, he chose not to withdraw his endorsement to keep Republicans motivated to vote, which still angered some of his conference. “I think they ask far too much of the speaker,” said Representative Jason Chaffetz, Republican of Utah, who has renounced Mr. Trump. “His job is to help House Republicans. Period. ” Mr. Ryan will soon find out if those members of his party who support Mr. Trump might come after him in the next speaker election. “We knew they had extreme views and you kind of rolled your eyes and said they were on our team,” Mr. Sykes said. “How much damage could they do?”'"}, "time": 1742564620.5083961}