{"duration": 0.046402931213378906, "input_args": {"text": "'Breitbart News National Security editor Dr. Sebastian Gorka, author of the   book Defeating Jihad: The Winnable War, joined SiriusXM host Raheem Kassam to discuss the Fake News panic over Russians allegedly hacking the U. S. electric grid. [On the former subject, Gorka said the Washington Post’s   ultimately discredited story about the hacking of a Vermont utility by Russian operatives was the epitome of Fake News.   “This is a beautifully juicy example of just what the   media represents today,” he said. “It’s not about truth. It’s not about being the Fourth Estate. It is about maintaining a narrative. And there’s a narrative out there, that has yet to be proven, that Russia somehow hacked our election. Not proven, sorry, fact. And now, a laptop had some malware on it. It wasn’t connected to the system, but it’s got to be the Russians, and it’s got to be a hack on the whole U. S. energy grid. It’s quite incredible. ” “Even the backtracking is so embarrassing because the statement that they issued  —   I don’t think you got to the end of it  —   ends with, ‘Authorities say there is no indication of the hack so far. ” They falsely wrote a story, but it could turn out to be true!” Gorka said. He agreed with Kassam that even though the Washington Post story fell apart, it will become “a new meme in the ‘Russia is hacking America’ story,” and will “stick in the back of the mind of the uninformed reader, and will be raised again and again and again on NPR, and MSNBC, and CNN. ” “You can put money on that, Raheem,” Gorka said. When Kassam said he would expect serious consequences from his editors and publisher if he manufactured a story like the phony electric grid hacking piece, Gorka countered that “in today’s world, at the other outlets, you’d probably be promoted. ” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742563597.5365477}