{"duration": 0.20986461639404297, "input_args": {"text": "'■ President Trump met with airline industry executives and complained that “we spent six trillion dollars in the Middle East, we got nothing. ” ■ Representative Tom Price could finally get a vote as soon as Friday to be confirmed as secretary of health and human services. ■ Senator Chuck Schumer of New York, the Democratic leader, and Senator Patty Murray of Washington, the ranking Democrat on the labor committee, are going after Andrew Puzder, Mr. Trump’s embattled nominee for labor secretary. It was a bit of a    moment when Senator Richard Blumenthal, Democrat of Connecticut, told reporters that President Trump’s nominee for the Supreme Court, Judge Neil M. Gorsuch, had called Mr. Trump’s attacks on the judiciary “demoralizing” and “disheartening. ” The account was readily confirmed on the record by a White House adviser, Ron Bonjean, working to advance the Gorsuch confirmation. But that wasn’t enough to stop the president from going after Mr. Bluementhal where it hurt: The president was referring to 2010 news, broken in The New York Times, a media outlet he has openly criticized, that Mr. Blumenthal had  exaggerated his   service. The president, who might want to be making friends with the senators who need to confirm Judge Gorsuch, tipped his hand as to what news program he was watching Thursday morning: CNN, where Mr. Blumenthal was being interviewed. Mr. Trump registered his discontent. Actually, Mr. Cuomo did ask about Mr. Blumenthal’s service, he said. It is also unclear what was “fake” about a story that relied as much on the people shepherding the Gorsuch nomination through the Senate as on one of the senators who will cast a vote. Senator Ben Sasse, Republican of Nebraska, confirmed the Blumenthal account Thursday morning, as did former Senator Kelly Ayotte, a Republican and one of Judge Gorsuch’s shepherds. Mr. Cuomo also did not ask the senator about the president’s bone spurs. Maybe he was just not positively disposed toward the United States Senate Thursday morning. After taking a whack at Senator Blumenthal, Mr. Trump turned to an old nemesis, Senator John McCain of Arizona, chairman of the Senate Armed Services Committee, whose actual Vietnam heroism, beyond dispute, was disparaged by Mr. Trump. This time, the president was unhappy that Mr. McCain had suggested that the recent raid in Yemen that resulted in the death of an American commando, multiple civilians and possibly a child who was an American citizen was not a success. The president’s tweets came after his press secretary, Sean Spicer, asserted Wednesday that the senator owed an apology to Chief Petty Officer William “Ryan” Owens, who lost his life in the raid. Mr. McCain offered no such thing. “When you lose a $75 million airplane and, more importantly, an American life is lost, I don’t believe you can call it a success,” he told NBC News. Jeff Sessions’ bruising confirmation as attorney general Wednesday evening set off a predictable flurry of news releases that declared the   Alabama senator to be a great American who would “make America a safer place” (the National Rifle Association) or “a lap dog” and a “dangerous gamble” (the Brady Campaign to Prevent Gun Violence). But for all the bombastic pronouncements, a more measured,   note came from, wait for it, the pot industry. Mr. Sessions has been a longtime foe of legalizing marijuana, but the National Cannabis Industry Association was totally chill. “We look forward” to working with Mr. Sessions to maintain the Justice Department’s current   approach to state marijuana policies, the association said. “We will work with him to do that,” the industry said cheerfully. In other words, don’t bogart that joint, my friend. When President Trump met with the airline industry on Thursday, the executives had plenty to complain about: an air traffic control system that is out of date, an airport infrastructure that is failing, computers that are melting down. And in the president, the executives found a sympathetic ear. Airports are getting “the wrong stuff,” he said. The air traffic control network is “a system that’s totally out of whack. ” Why? “We spent six trillion dollars in the Middle East, we got nothing,” the president said. “And we have an obsolete plane system, we have obsolete airports. ” The day President Trump took the oath of office, he filed paperwork to declare his candidacy for   not so much because he was overeager but because money was still flowing into his campaign coffers, and any funds raised over $5, 000 in 2017 would have had to be returned unless Mr. Trump registered as a candidate. And we know the president doesn’t like refunds. So what’s a federal employee to do with a boss who was technically running for office the day he stepped into the Oval Office? The Office of Special Counsel has answers. It has told federal employees that they may not express a view about whether Mr. Trump should be   or defeated in 2020 while on duty or in the workplace, but it assured them that they were otherwise free to express support or disapproval about Mr. Trump and his policies. A new guidance document was issued on Tuesday after the office said that it had received numerous inquiries about the impact of Mr. Trump’s filing for  . In contrast, former President Barack Obama filed such paperwork more than two years after his inauguration. The office  —   an independent agency that watchdogs   protections  —   said that with the exception of expressly advocating Mr. Trump’s success or failure in the 2020 election, federal employees were still pretty free. “Because the 2020 election is still more than three years away, at this time not all expressions of support or opposition to President Trump constitute political activity for purposes of the Hatch Act,” which prohibits federal employees from politicking, it said. The office also developed a new answer to its list of frequently asked questions that spells out with greater detail the scope and limits of federal employees’ right to express their views while they are at work or on duty. The new answer distinguished between expressing a view about current events, policy issues and matters of public interest  —   which federal employees are always free to do  —   and political activity, meaning advocating the success or failure of a particular political candidate or party. For example, it said, federal employees on duty or in the workplace are free to say “I agree with health care reform,” but not, “If you disagree with health care reform you should support candidate X. ” Andrew Puzder, the chief executive of the   corporation that gave the world Carl’s Jr. Hardee’s, and racy ads of   women eating large hamburgers, is finally getting his confirmation hearing (on Feb. 16) after multiple delays. And Democrats see a cabinet nominee they may just be able to derail. Senator Chuck Schumer, the Democratic minority leader, called on the president to withdraw Mr. Puzder’s nomination, describing his business record as “ . ” He also picked up the conservatives’ war cry, assailing Mr. Puzder for hiring an undocumented immigrant to clean his house. “They ought to withdraw Puzder’s nomination before he further embarrasses this administration and further exposes the hypocrisy of President Trump in saying one thing to the workers of America and doing another,” Mr. Schumer said. Momentum may be building. Democrats have attacked his record at CKE, the parent company of the   chains. Opponents have moved to unseal divorce records, which may contain details of domestic violence accusations leveled by his   then retracted. And until Mr. Schumer chimed in, conservatives  —   led by the White House adviser Steve Bannon’s Breitbart News  —   were the leading voices attacking Mr. Puzder for employing an undocumented immigrant. Well, if he doesn’t get confirmed, Mr. Puzder will have a nest egg to fall back on. Ethics documents released Wednesday night showed that he pulled in a $3. 4 million salary last year, owns as much as $55 million in company stock that he must divest himself of, expects a bonus of $1 million to $5 million and even secured a relocation benefit worth between $250, 000 and $500, 000. And he would not be nearly the richest member of the cabinet. Budget season is fast approaching on Capitol Hill, and Defense Secretary Jim Mattis met for a private breakfast on Wednesday with the lawmakers who will largely decide on the Pentagon’s coming request for more money to increase what President Trump has said are the nation’s badly “depleted” armed forces. Mr. Mattis and top aides met with the senior Republican and Democrat on the House and Senate Armed Services Committees, and their counterparts on the House and Senate Appropriations Committees that control the Pentagon’s purse strings. The big   is complicated, however. Under the terms of the 2011 Budget Control Act, both domestic and military spending is subject to hard, statutory budget caps. Republicans want to lift those caps for the Defense Department. Democrats insist that they will go along only if the caps are raised for domestic spending as well. For a guy who famously  —   and rightly  —   rejected the polls that showed he would not win the presidency, Mr. Trump has suddenly become quite enamored with those surveys. Vexed by the federal courts and questioned by the press, the president has turned to public opinion to bolster his policies, especially his temporary ban on visas to travelers from seven predominantly Muslim nations. And it’s not just polls of Americans. Hey, polls of Europeans back him up too. And of course, polls also back up his feeling for the news media  —   which, as you might have noticed, he doesn’t like.'"}, "time": 1742561646.5297923}