{"duration": 0.06293439865112305, "input_args": {"text": "'New Critiques Seek to Adapt Libertarianism to the Warfare/Welfare State By Daily Bell Staff - November 07, 2016 \\nUpdating Libertarianism for the 21st Century … A little while ago, I wrote that libertarianism — the small-government philosophy codified by Robert Nozick and others in the mid-20th century — is looking a little shopworn. As efforts to slash government yield diminishing returns, and empirical evidence piles up that many government interventions are very beneficial, the minimalist state envisioned by Nozick et al. doesn’t seem up to the challenges of the 21st century.- Bloomberg \\nBloomberg’s Noah Smith, who famously has derided libertarianism in many articles, now has decided it would be a good idea to update it. \\nIn this editorial, excerpted above, he announces an ally … a new libertarian think-tank, the Niskanen Center. His editorial builds on one recently posted at the Niskanen website by its vice president of policy, Will Wilkinson. You can see the initial editorial here. \\nNoah calls the longish essay “brilliant” and endorses the approach, which he claims is trying to find ways “to update [the libertarian] doctrine to address today’s problems, while retaining and amplifying the useful parts.” \\nMore: \\nInstead of invoking airy axioms, Wilkinson begins with a hard-nosed look at the data. He confronts libertarians with a stark fact — the richer a country is, the more its government tends to spend. \\nThis is true when we look at different countries, and also when we look at each country over time. Today, the top spenders include countries such as France, Denmark and Finland, while the small-government ranks include Sudan, Nigeria and Bangladesh. \\n… Wilkinson … says that whether government spending is a luxury good or a parasite, rich countries are almost never able to keep it low. Other than a few states like Singapore and Lichtenstein, every rich country chooses big government. \\nThe basic thrust of the essay, and Smith’s endorsement of it, is that to remain relevant in the 21 st century, libertarians will need to be more pragmatic and less idealistic. Stop talking about eliminating government and concentrate on making “government spend more wisely.” \\nRather than promote “theories of unfettered markets,” economists and other serious observers of the market should be “guided by pragmatism.” Libertarians “should be diving into the gritty details of the regulatory state, or gathering evidence on how best to curb government’s excesses.” \\nInterestingly, despite his manifest contempt, Noah ends his article by suggesting that he hopes Wilkinson et. al. have a major impact on libertarianism because as “modernizers” instead of “purists,” they can help the “ideology” stay relevant. \\nFrom a libertarian standpoint, this argument is surely a rehash of the one that took place long ago between Murray Rothbard and the Cato Institute. \\nAt the time, Rothbard had hopes of turning the Cato Institute toward a robust, Misesian approach to free-maket economics. But Cato was in the throes of a coup by the Koch brothers. As a result, Rothbard resigned and concentrated on Mises.org with Lew Rockwell. \\nMises and Rothbard were roundly ignored up until the expansion of the Internet era when their version of libertarianism exploded like a metaphysical supernova and virtually took over portions of the English speaking Internet. \\nWhile this was exactly what Cato and others had hoped to avoid (it was the realization of all the fears that had led to the suppression of Misesian economics in the first place), it’s not hard to understand. \\nPeople want to be free. Misesian economics as taken to its logical conclusion by Rothbard and Rockwell became known as anarcho-capitalism. \\nThere are certainly criticisms that be leveled at Rothbard, especially regarding his addiction to a full gold standard as the only non-criminal form of money, but generally speaking anarcho-capitalism provides a pretty good basis and justification for freedom. \\nAnarcho-capitalism is based on generally accepted economic principles that culminated in the creation of the free-market Austrian school in the mid 1800s based on the refinement of what has become known as marginal utility. \\nMarginal utility is essentially the basis of all modern economics. But its assertion and elaboration irritated German economists so much that they called its economic backers “Austrians,” a term the Austrian-located, free-market economists of the day took as a badge of honor. Thus “Austrian economics” came to be named by its enemies. \\nAustrian economics at root is very simple. Under the Misesian concept of “human action,” humanity’s future behavior can’t be predicted. People will always take action as they choose to in order to confront threats to their survival. \\nThis is why government rules and regulations almost never work as intended. And why economic forecasts have significantly decreasing value over even short spans of time. \\nMarginal utility shows us clearly that the marketplace develops prices and that this has a powerful impact on prices at the margin. This is a second insight provided by Austrian economics: When government tries to “fix prices” via monopolies or even by passing laws and regulations, the market is distorted and prosperity gradually leaks away. \\nOne can marry the impossibility of forecasting to the damage done by passing laws and regulations to come to the conclusion that nothing government does (short or offering protection, perhaps) is either especially valid or useful. \\nThis is simply not a tolerable insight for most people, even now. It was obnoxious to the Germans who continually insulted “Austrians.” It was obnoxious to British economists who invented a whole new dysfunctional form of economics – econometrics – to try to displace the Austrian free-market approach. (The hope was that by making economics sufficiently mathematical and complex, basic dysfunctions could be overcome, or more likely disguised.) \\nFundamentally, markets work and governments don’t. Laws don’t work, nor do regulations because they are predictive and “human action” is not predictable. Laws and regulations also fix prices. Central banks can’t create prosperity because they have monopoly powers to fix the price of the money and price-fixing always ends in disaster and drains prosperity. \\nIt is obvious we are seeing a resurgence of the Cato/Koch approach to restraining and rolling back Misesian anarcho-capitalism. That it is happening now along with Hillary’s evident or possible ascension, is perhaps no accident. \\nThe idea is that people ought to stop repeating that government is injurious to people’s aggregate welfare and to focus on ways to make government “work better.” But government cannot work “better.” It can only work “less worse.” \\nOne counter-argument is that government provides for the poor. But in free-market environments, we can see historically that people take it upon themselves individually, or via spiritual or religious institutions, to do the same thing. \\nAdditionally, there are other reasons to attack anti-authoritarian arguments such as anarcho-capitalism. The urban paradigm that is currently in the ascendant supports the globalist manipulations of a handful of elite bankers who seemingly control monopoly central banking and thus much of the money in the world. \\nFree-market economics shows us clearly that the current urban/authoritarian approach is rife with cogitative dissonance and contradictions. It cannot be justified logically. It can only be insulted. Humans do not need to live in a perpetual state of war, nor is it necessary that handful of people control the production and debasement of money. \\nConclusion: If one is interested in these issues, one faces a choice as to whether to argue privately or publicly for “adjustments” to the current system or to argue holistically for a system of freedom and voluntarism. This will evidently be a defining argument for libertarians as this century wears on.'"}, "time": 1742628551.257158}