{"duration": 0.04356861114501953, "input_args": {"text": "'Actress Rachel Bloom has teamed up with “Science Guy” Bill Nye to debut an LGBT sex anthem on the new Netflix series Bill Nye Saves the World. [During an episode of the   show  —   which debuted on the streaming service this week  —   Nye introduces Bloom’s performance as “very special” and a “cool little segment. ”  Bloom, perhaps best known for her role in the sitcom Crazy   proceeds to give a performance of a song titled “My Sex Junk,” which includes lyrics like: “This world of ours is so full of choice. But must I choose between only John or Joyce? Are my options only hard or moist? My vagina has its own voice. ” Other lines in the performance, which features Nye behind a DJ booth and a man ripping his trousers off, include: “Versatile love may have some butt stuff. It’s evolution, ain’t nothing new. There’s nothing taboo about a sex stew. ” “That’s exactly the right message, Rachel, nice job,” Nye says as Bloom finishes her performance. The video was quickly excoriated by viewers, with the YouTube version receiving more than 10, 000 “dislikes” compared with just 170 “likes. ” Twitter users also blasted the video, with some claiming that Nye’s perspective on gender is not backed by science. *curled up in a therapist chair, shivering arhythmically, scratching my inner elbow* alright so it all began with this video, ”my sex junk”,  —   C✪RBYNISTA (@fuckmuir) April 24, 2017,  Well @BillNye shot his credibility when he decided there’s no science to gender. Oh, and that was SAD. #mysexjunk,  —   Wrongthink Radio (@wrongthinkradio) April 24, 2017,  I’ve seen some stuff in my life, but nothing as bad as ”My Sex Junk”. #RachelBloom,  —   Hazel (@RoseHazel12) April 24, 2017,  Reviewing the rest of Nye’s show, which is intended to inform viewers about science, Maddie Stone of Gizmodo describes it as “a small amount of information packaged to promote a   understanding of a complex science issue, slanted to the POV of an unabashedly political science comedian. ” She adds that Nye spends the majority of the show just “yelling at his audience. ” Earlier this week, Nye told MSNBC that he wanted to remind the Trump administration that “science is political,” arguing that the Constitution grants Congress the power “to promote the progress of science and useful arts. ” However, Nye’s understanding of the Constitutional passage has since been shown to be incorrect.   You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742562198.900957}