{"duration": 0.10213041305541992, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1.  Donald J. Trump trounced his Republican rivals in the New York primary, according to The Associated Press, and extended his delegate lead. The victory was a crucial one for Mr. Trump and again demonstrated the broad appeal of his populist message with Republican voters. _____ 2. Hillary Clinton was expected to do well in her adopted home state, and despite facing a strong challenge from Senator Bernie Sanders, she did. Her win puts Mr. Sanders on the defensive, facing an even larger deficit as he scrambles for delegates. _____ 3. A Taliban truck bombing in Afghanistan’s capital claimed at least 30 lives and wounded more than 300 people. It was the deadliest attack in Kabul since 2011, boosting fears about the militants’ ability and willingness to infiltrate cities as part of their annual spring offensive, which was announced last week. _____ 4. A federal appeals court ruled that Title IX, the federal law that bars gender discrimination in schools, protected the right of a transgender student in Virginia to use the restroom of his choice. The ruling comes amid a nationwide debate on that issue. The student said the decision “gives me hope that my fight will help other kids avoid discriminatory treatment at school. ” _____ 5. President Obama will pay a visit to a jittery Saudi Arabia on Wednesday. The country’s leaders, reeling from low oil prices and competition with Iran, count the White House as another source of discomfort because they doubt that the president shares their vision for the Middle East. Their worry was compounded last month when he criticized the Saudis as “free riders. ” _____ 6. Hillary Clinton isn’t the only New Yorker with a distaste for MetroCards. The Metropolitan Transportation Authority outlined plans on Monday to replace the flimsy yellow cards, which were introduced in the New York City subways in 1993. But don’t throw out your extras just yet. The changes won’t go into effect until at least 2018. _____ 7. Google could face charges in Europe as soon as this week that it unfairly used its Android phone software to promote its own services, including maps and search, over competitors’. Although the company denies it breached any laws, the   charges would represent a major setback as it tries to strengthen its position in the global mobile market. _____ 8. Peter Liang, who was a New York City police officer when he fatally shot a    unarmed black man, Akai Gurley, in a Brooklyn housing project stairwell in 2014, avoided a prison term. He was instead sentenced in State Supreme Court to five years’ probation in the divisive police misconduct case, the exact punishment sought by the  prosecutor. Leaving the courtroom, Mr. Gurley’s aunt cried out: “There is no justice! Akai Gurley’s life didn’t matter!” _____ 9. To marijuana advocates, largely liberal New England is the natural next front for legalization. But given an epidemic of opiate abuse, the region’s authorities may be less than open to the idea of expanding access to any illicit substance. The Massachusetts attorney general, a Democrat, said the “effort at legalization seems to be directly at odds” with efforts to help addicts. _____ 10. Brett Weber is neither a player nor a coach for the Yankees, but he can have as much influence on the outcome of a game as anyone else in pinstripes. The team’s video replay monitor, Mr. Weber alerts the coaching staff to umpire calls he thinks should be challenged. Since replay began in 2014, the Yankees have had baseball’s highest success rate at overturning calls. _____ 11. It took the spy novelist John le Carré (legal name David Cornwell) a while to come around to this   golden age of television: “The Night Manager,” a   based on his 1993 book, is the first   adaptation of his work in 25 years. Starring Tom Hiddleston and Hugh Laurie, it premieres tonight at 10 o’clock Eastern on AMC. (Because of a transcription error, Mr. Cornwell’s last name was misspelled earlier.) _____ 12. Beyoncé’s coming projects are held as close as state secrets. Details about her “Lemonade” broadcast, airing Saturday night on HBO, have been scarce, and USA Today resorted to anonymous sourcing just to report that it would be a “  special. ” Fans, mindful of the music videos that accompanied Beyoncé’s last proper album release, hope the show offers a new one. _____ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742563316.031618}