{"duration": 0.11807537078857422, "input_args": {"text": "'CHARLESTON, W. Va.  —   Cole Chapman and his wife, Silvia Gabriel Fields, were having coffee on their deck when a nearby creek suddenly burst its banks, sending them and their two children sprinting to their pickup truck for safety. “We heard cracking and popping, and a sheet of water just started pouring into the yard,” Mr. Chapman said Saturday night. “It was like something totally exploded. ” Minutes later, their yard submerged beneath gushing,   water, the family raced over muddy roads to higher ground. “My son was in the back seat, saying, ‘We’re going to die, we’re going to die,’” Mr. Chapman recalled. “I’m sitting there thinking, ‘I sure hope you’re not right. ’” The storms that swept West Virginia last Thursday created historic flooding and in the aftermath left hundreds of homes, buildings, bridges, roads and vehicles destroyed. The storms were tied to at least 24 deaths. The authorities said on Sunday that all of the people reported missing had been accounted for except in one county, Greenbrier, which suffered the greatest death toll in the flooding. Sixteen deaths were reported in Greenbrier County, all but one of them in the small town of Rainelle. The town’s mayor, Andrea Pendleton, wept as she surveyed her community on Saturday, The Associated Press reported. “I weep for my people,” she said. “I weep for the businesses. ” The county is home to a luxury resort and golf course that was scheduled to host a P. G. A. tournament from July 4 to 10. But the course, like much of the surrounding countryside, was overrun by floodwaters and the event was canceled. “Canceling the Greenbrier Classic is certainly the most prudent course of action as our foremost concern is the   of those who are having to live through this tragic situation,” the P. G. A. Tour commissioner, Tim Finchem, said in a news release. “Our thoughts and prayers are with them. ” The owner of the resort said that while it was closed for business, he would offer a limited number of free rooms and meals to house some of the people affected by the floods. The powerful storms appeared to have caught many people off guard. Hundreds of people were left stranded, and bodies that were recovered from houses  —   including those of a man and two women at one location, all presumed to have drowned, officials said  —   suggested that either people did not have enough time to flee, or did not heed warnings to evacuate. The state remained under a state of emergency on Sunday, with more than 17, 000 homes and business still without power. Late Saturday, President Obama declared a major disaster in the state that frees up federal funding for relief in three of the   counties  —   Kanawha, Nicholas and Greenbrier. More heavy rain is forecast for Monday in some of the areas in West Virginia already hit hard by flooding, but Greenbrier County is expected to be spared. Mr. Chapman recounted his family’s harrowing escape as his truck crashed and bounced over debris in the road. He said for what seemed like an hour, he fought through water, mud and rain to get to Clendenin, usually a   trip. The pickup almost flipped at one point, he said, as he drove over a fallen tree. “There was enough water hitting the side of the truck to make it rock,” he said. The family escaped, drenched, with little more than the clothes they were wearing. “I left with just what I had in my pockets,” Mr. Chapman said. When he returned to the house later, he said, he saw that their   aboveground pool had been lifted and dashed against the side of the house. The family has no flood insurance, he said, and he is unsure whether they will be able to return home. Storms had been in the forecast for Thursday, but their overpowering strength came as a surprise to many. Most of West Virginia and the western parts of Virginia received 1 to 3 inches of rain in a few hours on Thursday afternoon and evening, but the downpour was far more intense in some places. Parts of Greenbrier County, a sparsely populated area bordering Virginia, got 8 to 10 inches of rain, the National Weather Service reported. Power went out a couple of hours before the creek burst its banks, Mr. Chapman said. But he and Ms. Fields were unaware how quickly the swollen creek was rising. Neighbors reported finding out about flooding only after someone knocked on their door. Over the weekend in Clendenin’s tiny downtown, a church group grilled burgers in a parking lot next to a Dairy Queen that was demolished by the Elk River, which flooded to record levels. Another church group passed out clothes and cleaning supplies to those left homeless. In rural West Virginia, it is not uncommon for multiple generations of a family to live near the same small town. On Thursday, Ms. Fields and two other households of relatives were flooded out. Gerald and Naomi Fields, her parents, live in Clendenin. Mr. Fields said he knew they were in trouble when he saw “a massive amount of water coming off the mountain” on his way home from work on Thursday. He said a rescue team worked for hours to evacuate residents of a nursing home. “Those emergency workers literally put their lives on the line to get them out,” he said. “By 3 in the morning, when they were done, one man just collapsed from exhaustion. ” Another set of relatives 10 houses away lost everything. Ms. Fields’s older sister Erica Babbitt and her husband, David, said their house was ruined. “We’re going to be starting from scratch,” Mr. Babbitt said. For now, all 11 members of the three related households are staying at an empty church rectory in Nitro, west of Charleston. Mr. Babbitt said his church has rallied around them, feeding them, giving them clothes, shelter and a few personal items. Ms. Babbitt said she and her husband had been getting ready to move to Fairmont for a new job. “I was thinking about what it was going to take to move,” she said. “I guess I don’t have to worry about that now. ”'"}, "time": 1742563209.1555753}