{"duration": 0.11031985282897949, "input_args": {"text": "'WASHINGTON  —   When Donald J. Trump first tried a few years ago to line up a speaking slot at the marquee event for the conservative grass roots, the Conservative Political Action Conference, the organizers almost rejected him because they thought he was a fraud who only wanted a platform to promote his hotels, casinos, neckties and golf courses. Stephen K. Bannon, then the head of Breitbart News, found himself essentially blacklisted from the gathering, known as CPAC. So he started a rival conference called The Uninvited and ran it out of a hotel down the street. With Mr. Trump now ensconced in the Oval Office and Mr. Bannon, his chief strategist, right down the hall, it is hardly in dispute who won the fight for control of the Republican Party. But there are still much bigger questions about whether Mr. Trump, who has never claimed to be a conservative but so far has governed conspicuously to the right, will ultimately be loyal to conservatives’ agenda. Mr. Trump does not dwell on policy, right or left. He prefers the transactional to the ideological. And for conservatives devoted to a cause that is fundamentally about ideas, the distance between the new president and the movement he overtook continues to loom as a red flag. That gap has been partly obscured by his first moves as president  —   trying to bar visitors from seven largely Muslim countries, scaling back Wall Street regulations, restricting federal funding that could go to abortion overseas and nominating a judge to the Supreme Court who is adored by conservatives. But some in the movement are unlikely ever to be totally at ease. And Mr. Trump may never fully be at ease with many of them. “With Trump, I do feel his instincts are conservative I do feel he understands the practical implications of an incompetent and inefficient government,” said Matt Schlapp, chairman of the American Conservative Union, which will convene CPAC starting on Wednesday. This time, Mr. Trump has been extended an invitation and is expected to speak. Still, with regard to conservatism, Mr. Schlapp added, “I’m not so sure he understands all the tenets and the philosophical background. ” Other Republican presidents have disappointed conservatives with major policy moves, from Dwight D. Eisenhower’s preservation of New Deal programs to Richard M. Nixon’s regulatory agenda to the elder George Bush’s reversal on his “no new taxes” pledge. But Mr. Trump, who considers himself the consummate deal maker, faces gnawing suspicions that he will find it easy to cut bargains that betray conservative principles. “I think it is safe to say that on the issues that are important to movement conservatives, the president’s actions since the inauguration have significantly reduced concerns by conservatives,” said Morton Blackwell, a longtime conservative activist who served as Ronald Reagan’s liaison to conservative activists and met with Mr. Trump at the White House this month. Still, Mr. Blackwell added, “there are significant numbers of people who are concerned. ” What makes some especially wary of Mr. Trump, said Grover Norquist, the veteran   activist and conservative leader, is how uninterested the president seems in their ideas. “They don’t think he’d ever read their novel, their policy paper, their magazine article  —   or even listen to them for more than five minutes,” he said. Republicans remain traumatized by presidents they believe governed too far to the left despite promises to do the opposite. “They’re used to sending senators, governors, congressmen into Washington and instead of seeing a sewer, they see a hot tub that they want to jump in,” Mr. Norquist said. Mr. Trump has, however, given conservatives plenty of reasons to temper their concerns. Beyond the nomination of Judge Neil M. Gorsuch to the Supreme Court and the flurry of executive orders, he has assembled a cabinet that the American Conservative Union deemed the most conservative of any Republican president, based on ratings given to the appointees who were members of Congress. The group scores lawmakers on a    scale of conservatism. And the six House members and senators Mr. Trump has selected for his cabinet were among the most conservative on Capitol Hill, earning an average score of 90. 6. “I’m seeing a pattern,” Mr. Schlapp said, “where I can more comfortably say he’s governing like a conservative. ” But many of the biggest items on the conservative checklist remain in flux  —   the repeal and replacement of the Affordable Care Act and an overhaul of the tax code being chief among them. And it remains in doubt whether Mr. Trump, whose White House has ricocheted from one distraction to the next in its first few weeks, will retain enough credibility with lawmakers to accomplish those goals. “I think now the question is: Can we get a lot of this stuff done?” said William Kristol, a frequent Trump critic and editor at large of The Weekly Standard. The risk for conservative policy, he said, is that the circuslike atmosphere around the White House will end up shattering Mr. Trump’s relationship with Republican lawmakers. “And if it really is a circus, you don’t want to be just another clown inside the tent,” Mr. Kristol added. One reason that some conservatives believe Mr. Trump’s support from the movement and its loyal lawmakers is so fragile is that it has been predicated on the sugar high of an election everyone told them they could not win against an opponent they loathed. “I think the majority of conservatives celebrating his victory were really celebrating Hillary’s defeat,” said Al Cardenas, a former chairman of the American Conservative Union. “And he was the conduit for that defeat. ” There are also serious policy questions that trouble conservatives, foremost among them what might happen to the federal deficit if Mr. Trump embarks on a plan to spend $1 trillion on revamping the nation’s infrastructure  —   a deal that many Democrats are eager to strike with him. That is where Mr. Trump’s brand of transactional politics could become a liability. “That was sort of the point of view of the tentative Trump supporters  —   you can do transactional politics with them,” said Rich Lowry, the editor of National Review. But the conservatives are hardly guaranteed to come out on the winning end of the transaction every time.'"}, "time": 1742564505.7038054}