{"duration": 0.28411436080932617, "input_args": {"text": "'RICHMOND, VA.  —   Here in the onetime capital of the Confederacy, at the end of the city’s Slave Trail, stands the latest repository for the   dream of L. Douglas Wilder. The     building, with Greek Doric columns flanking the entrance, was once the home of Richmond’s first   Baptist church. For the trailblazing Mr. Wilder, the nation’s first elected   governor, it represents the ideal setting for the United States National Slavery Museum, an institution he has struggled to create for nearly two and a half decades. The building is only an hour’s drive from the Fredericksburg site where Mr. Wilder’s first vision for the project, a $100 million museum designed by one of the world’s leading architecture firms, collapsed amid a welter of debt and recriminations. Two years ago, Mr. Wilder announced his latest plan at a news conference at the state Capitol, a more modest proposal, in an existing building in a town he’s long called home and where his government service and star power can still draw admirers. But this museum project appears no closer to reality than the last. The organization’s most recent tax filing, for 2014, reveals contributions of $0. His new   site, the former First African Baptist Church, is still owned by Virginia Commonwealth University and houses its department of clinical laboratory services. And just over a   away, where a notorious   compound known as “The Devil’s Half Acre” stood, a competing slavery museum proposal  —   championed by this city’s mayor and seeded with $18 million in state and city funding  —   is barreling toward groundbreaking in the fall of 2017. As the $540 million National Museum of African American History and Culture on the Mall in Washington prepares to open this fall, more attention than ever will be paid to the story of slavery and emancipation that Mr. Wilder has sought to recount and memorialize. But his institution will not be a part of that conversation, its artifacts in storage, its allies dwindling and its prospects approaching quixotic. Mr. Wilder, still prickly and proud at 85, remains undaunted. He declined to comment for this article, but in a memoir published last year, he said he’s optimistic his museum could be ready by 2019, the 400th anniversary of the first African slaves arriving in Jamestown. “My struggle has constantly been referred to as a ‘personal crusade,’ implying that it is something I would benefit from in some way,” Mr. Wilder wrote in “Son of Virginia: A Life in America’s Political Arena. ” “Combating that assumption is one reason I have persisted. This is not a personal crusade but a national necessity. ” And the grit of this grandson of slaves, who served in Korea but still had to leave Virginia to find a law school that would admit him, has long been acknowledged. “Governor Wilder has always struck me as a man of great determination and persistence,” said Stephen J. Farnsworth, a professor of political science at the University of Mary Washington, in Fredericksburg. “For him to accomplish what he did, starting in the days of Jim Crow, is an extraordinary accomplishment. And sometimes persistent, determined politicians need to remain persistent and determined to get their initiatives to come to fruition. ” The inspiration for a slavery museum came to Mr. Wilder during a trade mission to Africa he took as governor of Virginia in the early 1990s. In Senegal, he toured the slave houses and, as he recounts in his memoir, “saw how human beings were stuffed into bins, inspected and priced like products, branded like cattle, and packed into the holds of ships. ” “I returned from Africa,” he added, “with a single thought burning in my mind: We had to tell the story and keep our history alive as a charge of eternal vigilance. ” Last decade, he appeared close to realizing his vision. The museum project was given 38 acres by a developer to use as part of a “Celebrate Virginia” tourism and shopping complex in Fredericksburg. The architect C. C. Pei, a son of I. M. Pei, designed a modernist    building, its two halves connected by an atrium in which a replica of a slave ship was to be hung. Bill Cosby donated $1. 2 million. Companies like Philip Morris USA and the Wachovia Corporation pledged   sums. By 2011, though, the museum, strapped for funds to pay city real estate taxes, filed for bankruptcy. Some people who had donated their treasured artifacts demanded them back. The land where the museum was supposed to rise was sold last year. A mix of bafflement and bad feelings still resides in Fredericksburg. “The first inkling I had that something wasn’t right was when Wilder came and met with the Fredericksburg City Council in a closed session,” in 2001, said the city’s mayor at the time, Bill Beck. “He was obviously sincere about the issue and the subject matter. But it struck me that for a guy who’d been talking about a museum at that point for a number of years he really hadn’t given much thought to how a museum operates and what a museum is. ” Mr. Wilder first told the council his museum would cover a period of history that ended with the Civil War, Mr. Beck said. Then, a few minutes later, he suggested that the museum should take the story through the civil rights legislation of the 1960s. Mr. Beck said that he was frustrated by the lack of transparency and professionalism surrounding the project. He said the council, for example, learned the museum might be coming to Fredericksburg only when Mr. Wilder broke the news at a gathering of slave descendants at Montpelier, the estate of James Madison. “He never did any of the things you would do in terms of starting a museum,” he said. Mr. Beck, an antiques dealer, said he was not impressed by items from the collection displayed at a local university in 2004 and didn’t think the museum had hired enough professionals to staff such an ambitious venture. “He never did anything practical,” he said. “It was all show. ” In his memoir, Mr. Wilder writes that he’s at a loss “to fully explain why the project got so badly bogged down. ” Several possible culprits are cited: the city’s refusal to grant the museum   status   competition from other museums, including the Smithsonian’s   museum a deep recession. But foremost, Mr. Wilder said he felt the location was all wrong. Fredericksburg, he wrote in his memoir, was “off the beaten track for tourism. ” Mr. Beck, told of that explanation, tried, but failed, to suppress a chuckle. A significant Civil War battle was fought in Fredericksburg, and George Washington’s boyhood home is just across the river. “We’re not Rockefeller Center,” he said, “but that’s really kind of silly. ” Mr. Wilder has maintained that Richmond was always his first choice for the museum and that he’s learned from previous missteps. “The vision that we had in Fredericksburg was grandiose,” Mr. Wilder said in 2014. “That’s not going to be the case here. The building is built, and it would fit the needs of the museum. ” Except that some of the problems from Fredericksburg  —   communication breakdowns with local officials, for example  —   have resurfaced in Richmond. The building, the former First African Baptist Church, holds deep significance for Mr. Wilder. As a child, he attended Sunday school there, and both his father and grandfather were deacons and trustees. Yet its owner, V. C. U.  —   where the School of Government and Public Affairs is named after Mr. Wilder and where he teaches  —   was caught off guard by his formal announcement. Although Mr. Wilder had casually mentioned the idea to the university’s president over lunch a week before the news conference, the university said no commitment was given. More than two years later, little has changed. In a statement, V. C. U. acknowledged Mr. Wilder’s interest and noted that state funding had come through for a new building for the School of Allied Health Professions that would allow the school to vacate the former church. But, the statement continued, “a number of details about construction of the new building and relocation of the offices will need to be worked out before we can continue the conversation about the slavery museum proposal. ” Talks with the city  —   which controls the state funding for a heritage site  —   have been nonexistent. “I have not heard from anyone about any new ideas for another museum,” Mayor Dwight C. Jones said. Mr. Jones talks emotionally about the historical imperative of building a slavery museum in a city replete with Confederate monuments. But he and others favor not the church but a new museum and pavilion on the site of what was once Lumpkin’s Jail, where slaves were held in horrific conditions before being sold at auction. During the height of the interstate slave trade, when Richmond trailed only New Orleans in sales, Lumpkin’s was arguably the most infamous slave jail in the center of the city’s chattel business. After the Civil War, Robert Lumpkin’s widow, a former slave named Mary, leased the property to a Baptist minister seeking to build a seminary for freed slaves. It eventually became Virginia Union University. What had been known as “The Devil’s Half Acre” had become “God’s Half Acre. ” “You had enslavement you had emancipation then education and enlightenment,” said Delores L. McQuinn, a member of the Virginia House of Delegates and chairwoman of the Richmond Slave Trail Commission. Ms. McQuinn, a champion of the jail site, recalled bumping into Mr. Wilder several years ago during a ceremony to unveil plaques honoring   who served Virginia during Reconstruction. “I said to him at the time: ‘You’re looking for a museum, and we’re working toward that. Is it something we could join forces to do? ’” Ms. McQuinn said. “He said he’d get back with me. I have not heard anything from him. ” And it’s difficult to imagine much good will between those behind the two projects since Mr. Wilder, who served as mayor before Mr. Jones, publicly lambasted his successor and his administration earlier this year. Mr. Jones did not answer directly when asked if Mr. Wilder’s criticism made cooperation more difficult, saying only, “We have the money, we have the site, and what we’re doing is going to happen. ” The city’s plans for the jail site are underway. Architectural and engineering contracts will be awarded soon, and the groundbreaking is projected for next year. Mr. Jones controls $10 million committed by the state and another $8 million from the city for the project. It’s unclear how much money Mr. Wilder’s museum organization has at this point. The museum was able to sell the land in Fredericksburg last year for $400, 000. The math and the politics do not look promising for Mr. Wilder. “The city’s project seems to be on a firmer financial footing, and that will be decisive in all likelihood,” said Mr. Farnsworth, the professor. “And I’m not sure that two separate visions for the same project can both be constructed. ” Still, Mr. Farnsworth doesn’t count out the tenacious Mr. Wilder from securing a role in whatever slavery museum does get built in Richmond. A rambunctious mayoral election is underway. The incumbent, Mr. Jones, is bumping up against term limits. Eight candidates are vying to succeed him. At least one is considered an ally of Mr. Wilder, who recently helped organize and moderate a mayoral forum. Yes, L. Douglas Wilder’s embrace may not carry as much weight as it did when he was governor or Richmond mayor. But he is still L. Douglas Wilder, still a Virginia institution, and he does not go down easy.'"}, "time": 1742561737.0588014}