{"duration": 0.09025931358337402, "input_args": {"text": "'Reports that Democratic National Committee (DNC) staffer Seth Rich was a source for WikiLeaks before his murder leaves us with even more unanswered questions surrounding the case. [1. If Rich was murdered in a robbery gone wrong, why was his wallet, watch, and phone left behind?  Following Rich’s July 2016 death in the Bloomingdale neighborhood of Washington D. C. police officers claimed that it was likely the DNC staffer was shot during a robbery gone wrong. This doesn’t explain, however, why Rich was found to still be in possession of all of his personal items, including wallet, watch, and mobile phone, which are often the primary targets during a street robbery. “There had been a struggle. His hands were bruised, his knees are bruised, his face is bruised, and yet he had two shots to his back, and yet they never took anything,” said Rich’s girlfriend to NBC News. “They didn’t finish robbing him, they just took his life. ” 2. Why haven’t the DNC offered a reward for information related to his murder? Numerous groups, organizations, and individuals offered a reward for information related to Rich’s murder, including WikiLeaks, GOP lobbyist Jack Burkman, crowdfunding bounty site WeSearchr, and author Mike Cernovich. The DNC and other Democratic Party organizations, however, have not. Rich’s death was memorialized by the DNC with a bike rack and plaque. 3. Why are the   and mainstream media ignoring the case? The murder of Seth Rich has been a hot topic among conservative, libertarian, and alternative news outlets since the incident took place last year, however the   and mainstream media has largely ignored the case, only mentioning the staffer’s name during conspiracy articles about Russian hacking. A quick Google search of “Seth Rich” will return dozens of news articles on the subject from sources such as Fox News, The Washington Examiner, and Heat Street, but few from outlets such as CNN or MSNBC. The Washington Post did publish a story related to Rich Wednesday afternoon but focused on Rich’s parents’ claim that reports of him contacting WikiLeaks were without evidence. Those articles which do appear on   sites all feature headlines which immediately brand questions surrounding his death as “conspiracy theories” and seek to deter investigations. The Washington Post published an article in August 2016 titled “Trump allies, WikiLeaks and Russia are pushing a nonsensical conspiracy theory about the DNC hacks,” while The Huffington Post‘s coverage of Rich’s murder last year consisted of stories such as “Donald Trump Has A History Of Linking His Political Opponents To People’s Deaths,” and “Conspiracy Theorists Won’t Stop Accusing The Clintons Of Murder. ” CNN published one single story on Seth Rich’s death last year —   a straight news article on the murder with a quote from former DNC Chairman Debbie Wasserman Schultz. The majority of   sites have also completely ignored the recent reports that Rich was the source of “thousands of internal emails” leaked to WikiLeaks before his death, despite the fact that they worked consistently to refute these claims beforehand. 4. Will the Democrats still push that Russia hacked the DNC? Despite the increasing amount of evidence proving the opposite, a frequent   talking point is to claim that it was “Russia who hacked the DNC” and leaked information to WikiLeaks. This argument, however, ignores the fact that WikiLeaks founder Julian Assange stated on numerous occasions that Russia was not a source of the leaks, implying instead that it was Rich. DNC hacker Guccifer 2. 0 also allegedly claimed in messages to an actress that Rich was one of his whistleblowers, while a private detective claimed this week that Rich was in contact with WikiLeaks before his death. Most of the claims that Russia “hacked the election” are based on reports from CrowdStrike, a cybersecurity firm which has been reported to have ties with Google and the Obama administration, while the FBI did not examine the DNC’s server themselves. CrowdStrike’s report was heavily refuted by DNC hacker Guccifer 2. 0 in a report of his own. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742563101.0449762}