{"duration": 0.12714433670043945, "input_args": {"text": "'Tesla’s Musk Investigated Over SolarCity by Congress   16, 2016 \\nIt’s Time to Stop Spending Taxpayer Dollars on Elon Musk and Cronyism … The Senate Finance Committee and the House Ways and Means Committee have launched a probe into tax incentives paid to solar companies, according to The Wall Street Journal. The committee probes, led by their respective Republican chairmen, Rep. Kevin Brady of Texas and Sen. Orrin Hatch of Utah, have found an appropriate and disturbing target to begin this work. SolarCity, a solar installation company set to be purchased by Tesla Motors Inc., is one of the seven companies named in the initial investigation. –Daily Signal/Heritage Foundation \\nElon Musk is being investigated, but not for the money he’s borrowed to build Tesla – instead it’s over the strange deal he engineered for a company called SolarCity. We’ve written about Musk here, here and here. \\nWe didn’t understand the deal but thanks to this article, we think we do. Apparently – or so we are informed – Musk engineered it to avoid the foundering of the company. It was headed downhill, so Musk simply decided to buy it to hide its failure. \\nWere Musk operating with his own money, he’d have the right to do whatever he wants. But he is using the money of Tesla shareholders for his apparent manipulations. \\nWhat is certain is that Musk is irredeemably PR hungry and always announcing new business gambits or elaborations that tend to obscure the larger facts of his single important business – Tesla, which itself seems to continues as a nearly bottomless cash pit despite its recent announcement of a “profit.” \\nSo why does Tesla continue to get so much money from various government sources? Basically, in our view, Musk is being employed by the government as a leading proponent of cars that will totally control the driving experience for state authorities. By leading the way, Musk provides a justification for much larger corporate automotive entities to pursue him. \\nNonetheless, no matter how it is dressed up, the idea seems to be to remove driving from individual control. Our guess is that the government will ultimately be in charge of where you go, when and how. Don’t like it? Government will shut off the power to your car and you won’t be able to charge it. Tesla fans would do well to consider the larger ramifications of the technology they are supporting. \\nOf course, it won’t only be government. We can see many other wrinkles involved with this technology. Hell, rub an official the wrong way and when you get into your car, it drives you straight to court – or prison. Basically, thanks in large part to Tesla’s hugely funded technology, people will inevitably lose the right and ability to drive where they choose. This is a simple but profound loss. \\nMore: \\nMusk’s SolarCity has become an albatross of waste, fraud, and abuse of tax payer dollars. As legitimate earnings and cash become even scarcer for SolarCity, its entanglement in the Tesla empire suggests that a drastic reckoning not only is imminent, but in fact emboldening Musk to become more outlandish and reckless. \\nNotably, SolarCity is run by Musk’s cousins, Lyndon and Peter Rive. During his chairmanship at SolarCity, Musk’s family enterprise has taken in billions of taxpayer dollars in subsidies from both the federal and local governments. \\nBut the subsidies and sweetheart deals were not enough, as losses and missed projections continued to mount. Ultimately, rather than endure the embarrassment of collapse and further damage to the public image of Musk and Tesla, the cousins conspired to have Tesla simply purchase SolarCity this year. \\nThe article goes on to point out that “Tesla stockholders [are] being forced to absorb a failing, cash-burning company and pay top dollar to do so.” \\nSolarCity has never made a profit despite huge subsidies, and the article goes on to provide a wider context for Musk’s taxpayer support: reportedly some $5 billion in taxpayer support over the past 10 years – or “almost half of Musk’s supposed net worth.” \\nThe money has been distributed among all three Musk enterprises, SolarCity, Tesla, and SpaceX. “The ride is fueled by a cult of personality in Musk.” \\nWe don’t know where this investigation will end up – and of course it could exonerate Musk. But, nonetheless, Musk seems a prime example of a power elite meme, someone positioned as a business “genius” in order to reinforce authoritarian goals, especially those having to do with increasing control of travel. \\nConclusion: Musk defenders will point to the quality of his cars as evidence that Musk is legitimate businessman who deserves a good deal of media and financial latitude. But for us Musk is not entirely what he seems.'"}, "time": 1742561728.2019768}