{"duration": 0.020835161209106445, "input_args": {"text": "'LOL! Social Justice Warriors Were Triggered By This ‘GENDER IDENTITY’ Joke On Saturday Night Live shares Facebook \\nSaturday Night Live definitely leans left, they love to make fun of conservatives. But every once in a while they poke fun at the left. In this case, they made a joke about gender identity on the dating application Tinder. They also pulled the election into it. \\nIn case you didn’t see it, here’s the joke: \\nSocial justice warriors on Twitter were not happy: What the fuck is this @SNLUpdate pic.twitter.com/Q3PTZghM5g \\n— Sam Escobar 👻 (@myhairisblue) November 21, 2016 Trans & gender nonconforming people are more likely to be harassed, attacked, abused, discriminated against — but yeah. LOL DEMS! @SNLUpdate \\n— Sam Escobar 👻 (@myhairisblue) November 21, 2016 Dear @ColinJost and @nbcsnl : thank you so much for supporting the erasure of non-cis people. Thanks for actively contributing to oppression. \\n— Sam Escobar 👻 (@myhairisblue) November 21, 2016 @ColinJost i don\\'t think, as a professional comedian, it can possibly escape you how this joke is punching way way down. \\n— Emma Phipps (@phippsdontlie) November 22, 2016 @ColinJost You wish you had a point. Instead it\\'s just tired old LGBT-shaming disguised as edgy commentary. \\n— Louis Virtel (@louisvirtel) November 22, 2016 The fallout of this election has been a beautiful destruction. Intolerance is everywhere and it is eye opening to the masses. https://t.co/BbdFsO1Frh And before you say its \"just a joke,\" here are 2 reminders:1) jokes like these normalize oppression2) SNL doesn\\'t know how to write jokes. \\n— Sam Escobar 👻 (@myhairisblue) November 21, 2016 \\nLighten up, snowflakes! \\nThe actor in the skit ultimately responded: @PWRBTTMBAND so you think 100 percent of Trump voters were hatred and 0 percent had any other rationale? \\n— Colin Jost (@ColinJost) November 22, 2016 @PWRBTTMBAND It\\'s politics. A lot of politics is messaging and getting America on board. I want to examine how we failed at that goal. \\n— Colin Jost (@ColinJost) November 22, 2016 @PWRBTTMBAND I worry about not doing any self-examination and making the same mistake again. \\n— Colin Jost (@ColinJost) November 22, 2016 \\nWow. It looks like Colin Jost is way ahead of the Democratic Party. shares '"}, "time": 1742628542.5302782}