{"duration": 0.04522585868835449, "input_args": {"text": "'  RESET: Vladimir Putin Says That Russia Is Ready To Do It’s Part To Rebuild Ties With America Under Trump Vladimir Putin earlier became one of the first world leaders to congratulate Trump via a telegram for his surprise triumph over Hillary Clinton.   Russian President Vladimir Putin on Wednesday said Moscow is ready to contribute to rebuilding relations with the United States with Donald Trump as president. EDITOR’S NOTE: Since Hillary Clinton’s and Barack Obama’s failed “Russian Reset” back in 2009, international relations between Russia and the United States have been a chilly 5 or 6 degrees above freezing. For the past year and a half, Russia and America have not talked at all, with Russia assuming power in the Middle East in Syria. Just hours after Donald Trump’s historic Electoral College landslide, Vladimir Putin has extended the olive branch of friendship and it could not have come at a better time. “We have heard the pre-election statements by then-candidate Trump, which were directed at rebuilding relations between Russia and the US,” Putin said during a speech before several ambassadors in the Kremlin. “We understand that this will not be an easy path considering the unfortunate degradation of relations,” he said. “But Russia is ready and wants to restore full-fledged relations with the US.”“We are ready to do our part and do everything to return (US-Russian) relations to the trajectory of development,” he said. “This would be in the interest of Russian and American people and would positively affect the general climate in international relations, considering the special responsibility of Russia and the US for ensuring global stability and security.” Remember this unqualified disaster? \\nSecretary of State Hillary Clinton spearheaded the disastrous “Russian Reset” back in March of 2009 which only served to further damage relations with Russia. They couldn’t even spell the words on the thing properly. With reporters looking on, Clinton met Lavrov and handed him a gift – a green box tied in green ribbon. He unwrapped it to reveal a “ reset button ” a lighthearted reminder of Vice President Joe Biden’s recent remark that the administration of US President Barack Obama is hitting the reset button with Russia after years of friction during the Bush administration. The trouble was , the Russian-language label the Americans put on top of the button had the wrong word. Before she realised the mistake, Clinton assured Lavrov her staff had “worked hard” to get it right. Was it right? she inquired with a smile. “You got it wrong,” Lavrov responded, also smiling. He said the word the Americans chose –“peregruzka”– meant “overloaded” or “overcharged” rather than “reset”. Clinton quickly retorted with: “well, we won’t let you do that to us, I promise”. It was an embarrassment for the United States, to say the very least. Russian Foreign Minister Sergey Lavrov wants people to stop asking him about the failed “reset” with Russia because he says “it was the invention of Hillary Clinton and Obama administration.” Putin earlier became one of the first world leaders to congratulate Trump via a telegram for his surprise triumph over Hillary Clinton. Putin has tacitly supported Trump during the campaign, while Trump repeatedly flattered and praised the Russian leader and said he was willing to work with him. Russia’s parliament on Wednesday broke into applause upon learning of Trump’s win, and Russian markets climbed up, against the global slump on the news. source SHARE THIS ARTICLE  '"}, "time": 1742561853.2401059}