{"duration": 0.09188342094421387, "input_args": {"text": "'The photograph of a Saturday night reveler calmly fleeing the London attacks armed with a   glass of beer he refused to leave at the pub shows that though the attackers and their victims lived in the same city they inhabited different planets. Englishmen are from bars, terrorists are from Kandahar. [The Muslims who murdered seven and injured several dozen Saturday night want women to wear masks, men to stop drinking alcohol, and everyone to drop into half tortoise five times a day. No thanks!  One imagines that the weak pull of such a joyless existence encourages fanatics to resort to strong measures of the type witnessed on London Bridge and around Borough Market. When at first you can’t convert, kill, kill again. Perhaps we should give praise to Allah that instead of using 757s as instruments of death his votaries now rely on the vehicle favored by Scooby Doo, Matt Foley, and Postman Pat. This represents regression, or progress —  depending upon your perspective. The perspective of so many in the West remains jaundiced. London electing a Muslim as its mayor last year and bestowing the name Muhammad —  not Nigel, Simon, or Oliver —  on more of its baby boys than any other strangely represents diversity rather than deterioration. Even the dimmest patron at the Globe Theatre would recognize this in a play as foreshadowing of disaster. But in real life we pretend to imagine the slow conquest of Europe as a multiculturalist dream rather than Charles Martel’s nightmare. Speaking of the mayor, Sadiq Khan announced in the wake of the attacks: “We don’t yet know the full details, but this was a deliberate and cowardly attack on innocent Londoners and visitors. ” What “full details” don’t we know? Khan seems confused about the religious motivation serving as the alpha and omega of the attacks. Perhaps “we don’t know yet” that the murderous trio remained CofE congregants in good standing until the moment of their deaths, but evidence indicates that they shared the same faith as Khan. But Khan, who does not yet know “the full details,” refrains from saying “Islam,” or “Muslim,” or “Allah,” in any of his public statements. The attackers proved more forthcoming. They redundantly shouted “This is for Allah!” as they killed people as though their victims might harbor confusion regarding their motives. Did anybody on London Bridge think their attackers militant Hawkwind fans or exclaim, “Oh, no! Anglican zealots again”? We may never know the “full details” about anything but regarding this thing we know that Muslim extremists murdered people. Why does London’s mayor mute this? The nihilism in responding to such intolerance with the empty mantras of “diversity,” “inclusivity,” and “multiculturalism” misses something obvious and disturbing and obviously disturbing. Outraged Muhammadans did not seize upon some hooligans with cockney accents mucking up the streets of Mecca. They killed Englishmen for behaving as Englishmen in England, a country, in case newcomers misunderstood its traditions, that features a cross on its flag and whose head of state refers to herself as the “defender of the faith. ” And what is London if not the antonym of Mecca? London screams the Ministry of Silly Walks, Page 3 Girls, Bertie Wooster, technicolor Carnaby Street, a ridiculous giant Ferris wheel, and The Beatles blaring Sgt. Pepper’s Lonely Hearts Club Band from the windows at Mama Cass’s Chelsea flat at 6 a. m. The extremists scream against all that. The proper response does not come in kind but involves an unhurried,   imbibing of a pint, in the pub or in public, in the face of whatever disaster envelops. When you leave your beer at the bar, the terrorists win.'"}, "time": 1742563084.8700247}