{"duration": 0.19541382789611816, "input_args": {"text": "'PITTSBURGH  —    There would be no   magic for Henrik Lundqvist and the Rangers this year. After four consecutive postseasons in which they often played their best when their backs were against the wall, the Rangers’   season ended with a thud Saturday. The rookie Bryan Rust had two goals and an assist as the Pittsburgh Penguins wrapped up their Eastern Conference quarterfinal series against the Rangers with a   victory in Game 5. Pittsburgh won the series, four games to one, after losing to the Rangers by the same series margin in the first round last year. “We just got beat,” Rangers defenseman Marc Staal said. “We got beat by the better team. They were better than us. All series. ” The Rangers entered Saturday’s game hoping for a repeat performance of their 2014   series against the Penguins, in which they came back from a     deficit to beat Pittsburgh in seven games. Having won 15 of the past 19 games in which they faced elimination, the Rangers had reason to have confidence that they could do so again. After all, Lundqvist had a 1. 50 goals against average in those games. But these Rangers are not the same Rangers who reached the conference finals three times from 2012 to 2015. And this Lundqvist is not the same Lundqvist. He failed to finish a game for the third time in five outings this series, which began with his being knocked out of Game 1 after he was hit near the eye by a teammate’s stick. The Penguins bombarded Lundqvist for 10 goals during his final four periods. His backup, Antti Raanta, played the third period Saturday after having played the final   minutes in Game 4 on Thursday. Lundqvist allowed four goals on 12 shots in what proved his final period of the season. “The second period, it was a feeling of embarrassment to give up that many goals,” Lundqvist said. “But also a sense of hopelessness. ” He allowed only eight goals in the entire series against Pittsburgh last season. And before Thursday’s   loss in Game 4, he had given up just 16 goals to the Penguins during his previous 11 playoff appearances against them, winning eight of those games. But then Lundqvist gave up 10 goals in 64 minutes 55 seconds  —   the equivalent of a 9. 23 goals against average. “There’s been a lot of big opportunities right in front in this series, and you need strong goaltending,” Lundqvist said. “You need a goalie that’s going to make a lot of big extra saves. And I wasn’t able to come up with that. ” While Lundqvist was not sharp in Game 5  —   four of the goals came on shots that were unscreened but well placed  —   the breakdowns by the remade defensive corps in front of him did not help. Coach Alain Vigneault pulled out all the stops. He brought back the veteran Dan Girardi, who had been out since Game 1 because of a “whole body” injury. Vigneault also dressed seven defensemen, turning to Raphael Diaz, who had not played in an N. H. L. game all season. (Dan Boyle, 39, was a healthy scratch in what was most likely his final game he said in the fall that he planned to retire after the season.) Diaz and Girardi rewarded those decisions as each assisted on a goal. A Girardi shot 62 seconds into the game was deflected in by Rick Nash. Chris Kreider got a piece of a similar shot by Diaz from the point during a power play in the third period for the Rangers’ first goal in the series with a    advantage. Dominic Moore had made the score   just past the midway point of the first period, the puck going into the net after ricocheting off several Penguins. But the Rangers’ final lead of the series lasted only 64 seconds, until a Phil Kessel slap shot from the right circle smacked off the shaft of Lundqvist’s stick and into the far top corner of the net. That made Pittsburgh 8 for 20 on the power play in the series. Then came the   onslaught in the second period, and the Rangers were finished. The Rangers, who lost in the first round of the playoffs for the first time since 2011, had won eight playoff series over the previous four years, including 2014, when they advanced to the finals. “The way they play the game, that’s what we used to do to teams,” Rangers forward Derick Brassard said, noting that Penguins Coach Mike Sullivan had been an assistant with the Rangers from 2009 to 2013. “And they did it to us now. ” With many in the Rangers’ core aging, some will wonder if this is the end of an era. Nine Rangers who played in this series are 30 or older two more will turn 30 before the start of next season. Lundqvist posted the worst goals against average of his   career and tied for his worst save percentage since the   season. Nash, who missed 20 games with a leg injury, had his fewest goals in a season. Girardi had an uneven season. Eric Staal and Keith Yandle, trade acquisitions during the past 14 months, are pending unrestricted free agents. After the game, Vigneault said it was too early to give a   evaluation of where his team would go from here. “Like any organization, we’re going to go through all the steps, from coaches to management,” he said. He added, “Everybody wanted to end this way differently than it did. ”'"}, "time": 1742562199.6809256}