{"duration": 0.1478428840637207, "input_args": {"text": "'Donald J. Trump on Monday invoked comparisons to the Cold War era in arguing that the United States must wage an unrelenting ideological fight if it is to defeat the Islamic State. He said he would temporarily suspend immigration from “the most dangerous and volatile regions of the world” and judge allies solely on their participation in America’s mission to root out Islamic terrorism. In a speech at Youngstown State University in Ohio, a critical swing state where polls show him trailing Hillary Clinton, Mr. Trump combined old vows to seize Middle Eastern oil fields with the announcement of a series of new, if still vague, proposals to change America’s battlefield tactics. “Just as we won the Cold War, in part by exposing the evils of communism and the virtues of free markets, so too must we take on the ideology of radical Islam,” he said. He again tried to change his politically inflammatory approach to immigration, replacing his 2015 vow to bar Muslims from entering the United States with a new commitment to bar anyone from parts of the world where terrorism breeds. Once again, he did not name those countries, or say whether citizens of longtime allies where terrorists have plotted and executed attacks  —   Germany, France and Belgium among them  —   would be included. Mr. Trump, who has pledged to build a wall along the border with Mexico, also said he would call for “extreme vetting” of immigrants that would include requiring them to respond to a questionnaire with an “ideological test. ” Over all, he appeared to be arguing for the kind of   foreign policy that President George W. Bush adopted after the Sept. 11, 2001, attacks. But over time, that approach ran into complications: China and Russia used the fight against terrorism to crack down on Muslim minorities. And the Bush administration eventually discovered that a   approach, measuring countries almost exclusively on their commitment to fighting Islamic terrorists, left it little leverage when their partners in counterterrorism took other steps opposed to American interests  —   from the Chinese claiming portions of the South China Sea to increasing Russian threats against former Soviet states. Monday’s speech represented another attempt by Mr. Trump to focus on issues after a rocky period in his campaign, much as he did last Monday with a speech on the economy. He laid the blame for the rise of Islamic extremism on President Obama and Mrs. Clinton. He said they made “a catastrophic mistake” in “the reckless way in which they pulled out” of Iraq. He charged that Mrs. Clinton compounded the error by attempting to “build a democracy in Libya. ” He argued  —   accurately  —   that Mrs. Clinton had been a vocal proponent of the American intervention in Libya in 2011, which Mr. Obama has repeatedly acknowledged was the most    foreign policy move in his nearly eight years in office. He also charged that “Hillary Clinton wants to be America’s Angela Merkel,” a reference to the German chancellor. Germany has taken in tens of thousands of refugees fleeing the civil war in Syria, in which fighting between forces loyal to President Bashar   rebels opposed to his rule and Islamic State jihadists has claimed 400, 000 lives. Mr. Trump offered no criticism of Mr. Assad, but criticized the Obama administration for advocating the removal of the Syrian leader and Hosni Mubarak of Egypt, who was deposed in the first blush of the Arab Spring, because doing so took out the strongmen who kept the lid on violence in the region. He pledged to form a new partnership with Israel, Egypt and Jordan to try to stop the spread of terrorism, including groups such as Hamas and Hezbollah. He also suggested that the United States would be well served by joining forces with Russia against the Islamic State. And though Mr. Trump made no reference to whether he would send more American troops back to the region, that appeared to be the clear implication. The kind of relentless attacks on the Islamic State he advocates  —   along with taking and holding the oil fields, which may well be a violation of international law  —   would require a considerable presence by American troops or their allies, and foreign bases to launch the drones. Peter Feaver, a former Bush administration official who handled Iraq strategy and now teaches at Duke University, and who has signed two letters from national security officials opposing Mr. Trump’s candidacy, praised Mr. Trump for giving a “surprisingly serious” speech on counterterrorism. But he also said that “given how vehemently Trump has denounced Bush’s national security team, it is striking how much of this speech depends on counterterrorism ideas developed by the Bush administration. It is not a perfect copy  —   we never contemplated seizing the oil for our own purposes and we were far more concerned about how   rhetoric might demoralize the moderate Muslim voices we were seeking to empower. But the good parts are not new  —   they are imported from the Bush approach  —   and the new parts are not good. ” Mr. Trump did not explain how his vision of “extreme vetting” of immigrants, including an “ideological test,” would be enforced, or how it would be different from when prospective terrorists lie on questionnaires now. But he made clear that he views the recent terrorist attacks in the United States through the prism of immigration, pointing out that the common point between the shooting at the Pulse nightclub in Orlando, Fla. and the mass attack in San Bernardino, Calif. was that they were carried out “by immigrants, or the children of immigrants. ” As part of the ideological battle against the Islamic State, he said, a Trump administration will “be a friend to all moderate Muslim reformers in the Middle East,” and would speak out “against the horrible practice of honor killings, where women are murdered by their relatives for dressing, marrying or acting in a way that violates fundamentalist teachings. ” But he never squared that with the   complexities he would confront in the Oval Office. Pakistan, where one recent honor killing occurred that Mr. Trump cited at length, is also considered a key partner in the counterterrorism fight  —   even though its intelligence service has, at times, been accused of supporting the Taliban. Jake Sullivan, Mrs. Clinton’s policy chief, argued that Mr. Trump’s concern about respecting minority rights within the Muslim religion was not sincere. “This   ‘policy’ cannot be taken seriously,” he said in a statement. “How can Trump put this forward with a straight face when he opposes marriage equality and selected as his running mate the man who signed an  . G. B. T. law in Indiana? It’s a cynical ploy to escape scrutiny of his outrageous proposal to ban an entire religion from our country, and no one should fall for it. ” In his address, Mr. Trump said that if he is elected, “the era of   will be ended,” implicitly criticizing efforts to restore stability to Iraq and Afghanistan. He did not note that most of that   began in the Bush administration, and much of it was terminated by President Obama. Mr. Trump was clearly defensive about challenges to his claim that he had opposed the invasion of Iraq, notably a Sept. 11, 2002, comment to Howard Stern, the radio host, in which he was asked whether he supported a future invasion of the country. “Yeah, I guess so,” he responded, “I wish the first time it was done correctly,” a reference to the Persian Gulf war. The day of the invasion in 2003, he described it as a “tremendous success from a military standpoint. ” But in his speech, Mr. Trump quoted himself from an August 2004 statement to Esquire when the Iraq war was beginning to turn against the United States. “It turns out that all the reasons for the war were blatantly wrong,” he said, 17 months after the invasion. “All this for nothing. ” He noted that he had warned that “two minutes after we leave, there’s going to be a revolution, and the meanest, toughest, smartest, most vicious guy will take over. ”'"}, "time": 1742628377.1373043}