{"duration": 0.07733917236328125, "input_args": {"text": "'The Department of Homeland Security (DHS) removed “handcuffs” placed on Border Patrol agents by the Obama Administration, freeing them to expand border enforcement operations. [DHS Secretary John F. Kelly lifted most of the restrictions imposed on Border Patrol agents under the previous administration and ordered Border Patrol agents expand their efforts to enforce laws against illegal border crossings. The order came in a memo obtained by Breitbart Texas from DHS officials and discontinued President Obama’s “catch and release” program known as the “Priority Enforcement Program” (PEP) enacted on November 20, 2014. The order leaves in place, President Obama’s deferred action programs for children brought to the U. S. illegally by their parents.  “Except as specifically noted above, the Department no longer will exempt classes or categories of removable aliens from potential enforcement,” Secretary Kelly wrote in the memorandum. “In faithfully executing the immigration laws, Department personnel should take enforcement actions in accordance with applicable law. ” To support the expanded enforcement actions, Kelly ordered the hiring of an additional 5, 000 Border Patrol agents and 500 U. S. Customs and Border Protection (CBP) Air and Marine Operations (AMO) officers. “CBP has insufficient   to effectively detect, track, and apprehend all aliens illegally entering the United States,” Kelly continued. “The United States needs additional agents and officers to ensure complete operational control of the border. ” Leaked Border Patrol training materials released in an article by Breitbart Texas Managing Director Brandon Darby revealed the frustrating requirements placed on Border Patrol agents under the PEP program. “Nothing says don’t arrest, but it clearly says don’t waste your time because the alien will not be put into detention, sent back or deported,” an official within U. S. Customs and Border Protection (CBP) told Darby at the time. “There is literally no reason to arrest an illegal alien because they are specifically telling Border Patrol there will be no consequence for the illegal alien. It is a waste of time and resources to arrest someone who is off limits for detainment or deportation and the documents make that fact clear. Border Patrol agents are now being trained to be social workers, not law enforcement. ” After the Obama Administration had put the PEP program in place, a high percentage of migrants apprehended at the border were released with a “notice to appear. ” “[The Obama] administration has handcuffed the Border Patrol,” Babeu told reporters in a March 2016 press conference reported by Breitbart Texas. This new set of orders from Secretary Kelly effectively removes those handcuffs and ends Obama’s catch and release programs. “A country has a duty and obligation to secure its border. That didn’t change because Obama was the president,” Jackson County, Texas, Sheriff Andy Louderback told Breitbart Texas on Tuesday. “We are back to the rule of law now, and the gloves are off, there’s no PEP. We are allowed to do our job. I am on cloud 80. ” Louderback previously served as president of the Texas Sheriff’s Association. Breitbart Texas was at a press conference when sheriffs from across the state descended upon the Texas Capitol in August 2015 to decry the federal policies of the Obama administration saying, criminal aliens have free rein. “Policies that facilitate the release of removable aliens apprehended at and between the ports of entry, which allow them to abscond and fail to appear at their removal hearings, undermine the border security mission,” Kelly stated. “Such policies, collectively referred to as ‘ ’ shall end. ” Bob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX.'"}, "time": 1742562077.6967993}