{"duration": 0.08986949920654297, "input_args": {"text": "'It was a historic night that called for soaring rhetoric and unvarnished authenticity. Instead, Hillary Clinton and Donald J. Trump delivered victory speeches on Tuesday that leaned heavily on campaign clichés  —   in many cases, the same ones. On the page, anyway, the ideological and stylistic chasms that separate them start to dissolve in a sea of overlapping oratorical devices, similar phrases and at times identical word choice. Are their speechwriters out of juice? Or is the hackneyed phrase just too irresistible? We identified the passages that sounded the most alike: TRUMP: Tonight we close one chapter in history and we begin another. CLINTON: Now you are writing a new chapter of that story. It’s a country, not a book. But this speechmaking construct won’t die. Mrs. Clinton tries to infuse the familiar trope with the concept of inclusivity. Mr. Trump just trots out the same old wooden metaphor. _____ TRUMP: This is not a testament to me, but a testament to all of the people who believed real change . .. CLINTON: Tonight’s victory is not about one person . .. So we all owe so much to those who came before and tonight belongs to all of you. It’s not really about me, it’s about you! But let’s be honest: it’s really about them. This   device is a clever way to claim a mandate without sounding  . Mr. Trump makes the most direct claim of humility. Mrs. Clinton makes a richer historical reference to previous barrier breakers. _____ TRUMP: And our country will never, ever back down. CLINTON: Our history has moved in that direction, thanks to generations of Americans who refuse to give up or back down. There’s no backing down from this bromide. _____ TRUMP: I’ve traveled to many of our states and seen the suffering in people’s eyes. CLINTON: And I learned about those persistent problems and the unfinished promise of America that you’re living with. Ever since Bill Clinton found the most economical way to say it in 1992, speechwriters have striven to complicate the sentiment: “I feel your pain. ” _____ TRUMP: This election isn’t about Republican or Democrat, it’s about who runs the country. The special interests or the people. CLINTON: We want a government that listens to the people, not the power brokers . .. Everyone is a populist in 2016, even residents of Fifth Avenue and Chappaqua, N. Y. _____ TRUMP: Our campaign received more primary votes than any G. O. P. campaign in history. CLINTON: The first time in our nation’s history that a woman will be a major party’s nominee. Everyone wants to make history. Mrs. Clinton’s breakthrough carries greater weight, but Mr. Trump  —   not to be outdone  —   tosses in his own milestone. _____ TRUMP: To those who voted for someone else, in either party, I’ll work hard to earn your support. CLINTON: But whether you supported me or Senator Sanders or one of the Republicans, we all need to keep working toward a better, stronger America. The olive branch. Both extend it to their skeptics, without much creativity. _____ TRUMP: I’m going to fight for you, the American people. I’m going to be your champion. I am going to be America’s champion. CLINTON: I hear you. I see you. And as your president, I will always have your back. Two approaches to the same trite message. Mr. Trump, ever the pugilist, deploys a slightly more combative construction  —   “fight for you. ” Mrs. Clinton takes a gentler and more supportive approach: “I will have your back. ” _____ TRUMP: The beauty of America is that it brings us all together. CLINTON: Because we are stronger together. Let’s say it together, folks: These campaigns need a thesaurus. _____ (Want to watch the full speeches? Here’s Mrs. Clinton and Mr. Trump.)'"}, "time": 1742561771.0814316}