{"duration": 0.08690166473388672, "input_args": {"text": "'The worst kind, too. The kind who lets a plant starve to death. The evidence, at two opposing corners of his office in Beverly Hills skeletal remnants that long gave up hope of ever being watered. He’s been away for 10 months, he says. An explanation, if not exactly an excuse. Regardless, I vow to expose his   ways because the American public deserves to know, and besides, at 52 one should take whatever notoriety one can get. I’m at Plan B, the film production company Pitt   in 2001 and now owns, and I’ve decided to impress him with my knowledge of architecture, something he learned about while helping to rebuild the Lower Ninth Ward in the aftermath of Hurricane Katrina. I figured I’d introduce him to Shigeru Ban, famous for his Cardboard Cathedral in Christchurch, New Zealand, and other   projects around the world. But there, sitting on Pitt’s bookshelf, is an entire monograph of his work. Near his record player are Joe Strummer’s albums with the Mescaleros, not a surprise, but also rare books on fringe culture, including Danny Lyon’s “The Bikeriders,” which are. This is a revelation not because Pitt is a megastar, which can lead to a certain    but because he’s a father, and the first thing that goes after having kids is coolness. The first thing that comes are jorts. So when he gets up to shake my hand  —   dressed in a white   white jeans and a white fedora  —   he seems more like the Dude than a dad. “War Machine,” one of his two new films out this fall, is based on “The Operators,” Michael Hastings’s blistering account of U. S. military command, their occasionally reckless maneuvers and the political blowback that happened when a certain decorated general  —   played by Pitt  —   let his guard way, way down. (The other movie is Robert Zemeckis’s romantic assassination thriller “Allied,” also based on actual events.) “It’s a satire on the decision makers who end up sending our young men and women to war,” he says. “It’s about the absurdity of the process, the machinery itself, the   involved  —   and it’s insanely funny, until it’s not. ” Discussing the thin line between tragedy and comedy leads us to talking about sadness and happiness in general, which then leads Pitt to an observation: During his frequent travels around the world he has encountered many people who seem to have no cause for happiness  —   and yet it’s those very people, those in the most dire circumstances, who somehow manage to appear the most content. It is why, he says, people like him  —   people with money and time  —   feel so compelled to change those circumstances. Which isn’t always a good thing, and he knows it. “I’ve gone into areas of   countries where people have suffered the most, but those people always seem to have the biggest laugh,” he says. As a Jamaican native who has witnessed quite a few   missions, I tell him that sometimes our biggest laugh is directed at foreign   who really have no idea how to fix our problems. “I’ve been one of those at times,” he admits. “But you’ve got to start somewhere. You start with your best intentions, understanding the world as you do. And then you get in and you see that it’s much more complicated than you could possibly imagine. Our failings in foreign policy have always been to think that we can place our ideas on another culture, while not really understanding the other culture. ” But one of the reasons I agreed to this interview was to do more than remind the world that, aw shucks, he’s just a regular guy. Such a thing would be ridiculous, anyway: A Google search of his name yields roughly 45 million results nearly 10 million pop up for “Brad Pit” alone. This is, after all, the guy who as a seductive thief in “Thelma  Louise” proved there’s no such thing as a small part. Someone once famously said that he is a character actor trapped in a leading man’s body, which is true, but he’s also the last real movie star to come out of Hollywood. I don’t ask him if he likes to puzzle over his kids’ homework. Instead I ask him about Brexit. “Man, I never thought that would happen. Same way I can’t bring myself to think that Trump will be in charge. In the simplest terms, what brings us together is good, and what separates us is bad. We have this great line in ‘The Big Short,’’u2009” he says, referring to the   film about the global financial crisis of 2008, which he produced. “When things are going wrong and we can’t find the reason for it, we just start creating enemies. ” I mention that when creating those enemies, we often look no further than what’s right in front of us. Gays, for example. “Or illegal immigrants,” he says. He keeps wondering aloud about this, not because he’s all that interested in extremism, bigotry, religiosity and fear as part of an actual pathology  —   or Trump supporters and the religious right, for that matter  —   but because in another version of this story, where the movie star thing hadn’t clicked and he remained stuck in his home state, that could have been his fate. “Coming from Oklahoma, southern Missouri, which leans more toward a Trump voice, I try to understand it. ” “It seems that the people who suffer the most end up betting for the party that would hurt them,” he goes on. “And so I try to understand where they’re coming from. ” When I suggest that money has a lot to do with it  —   Belgium supporting Tutsi control over the Hutus, and building resentment, prompted genocide  —   he agrees. But a recent conversation he had with a scholar from the Brookings Institution, the Washington, D. C. think tank, sparked a different view, one where the cause of strife can’t be explained by simple economics. “You gotta understand,” he says, “that it’s also in our DNA. Most Americans don’t have time to watch CNN and Fox and Al Jazeera. They’re trying to make the rent, get the kids fed, they’re tired when they get home and they want to forget about everything. And so suddenly when this voice comes in  —   and it doesn’t have to be a voice of substance  —   saying he’s fed up with all of this, that’s the part that hooks into the DNA. ” A fair point to consider, that our social behaviors, prejudices and even the mental process of who we choose to love or hate is rooted in biology, but how does this convince people to actually buy what Trump is selling? “What I’m most hopeful about is that we’re a global neighborhood now, and we start to understand each other more and more  —   and yet, you see this reactionary push for isolation and separation again. ” Pitt shrugs, and says that he thinks a lot of people feel alone, and on a certain level, again because of his background, he knows what that’s like. “A Trump supporter is fighting against just about everything,” he says. “What does he even mean, take our country back? Would someone please explain that to me?” Pitt looks at me, impish and totally serious at the same time. “Where’d it go?” Like his friend and “Inglourious Basterds” director Quentin Tarantino, Pitt’s scholarship in the craft of the medium has mostly been the medium itself. More than that, film was for him a window into the world. “Movies were a way out,” he says. “If you live in a vacuum and suddenly you’re exposed to the world, you’re exposed to other cultures. And remember, this was  . This was the only lens that could show me how a kid in Brooklyn lived, a kid in Ireland, a kid in Africa. ” On the topic of exotic worlds, he mentions a film he’d like to make about Pontius Pilate, mostly because the script, which focuses on a mediocre Roman official stuck in the middle of nowhere with difficult people he doesn’t like, makes him smile. Jesus doesn’t get much screen time. “It certainly won’t be for the ‘Passion’ crowd,” he says, which reminds me that Mel Gibson’s   epic is one of the things that drove me out of the church. Pitt bursts into laughter. “I felt like I was just watching an L. Ron Hubbard propaganda film. ” Xenu aside, Gibson movies typically do one thing really well: violence. “Oh, extremely well,” Pitt says. “’u2009‘Apocalypto’ is a great film. ” It’s easy to forget that the man is 52  —   if anything he’s too skinny  —   but his children’s interest in relics from the past regularly drives home the point. One of his daughters, for example, loves cassette tapes the way someone Pitt’s age might have a fondness for the gramophone, or making his own daguerreotype. He’s also reminded of his age on set. “When I was making a World War II movie called ‘Fury,’ we did this boot camp for a week, and Logan Lerman, who was the youngest actor of the bunch  —   I think he was 21  —   was given grunt detail. We gave him a watch and he had to keep track of how long it took us to eat and get in and out of our gear. One day he came to me and said the watch has stopped, and I said, ‘You’ve just got to wind it.’ He came back literally 15 minutes later and said, ‘Wait, how do you wind it? ’’u2009” The good thing about playing an interview slow and loose, especially when you’ve caught your subject on a free day, is that you can slide into the type of     conversation only possible with truly friendly people. Not to say that Pitt isn’t sometimes on his guard when it comes to discussing touchy subjects like income inequality and whitewashing in Hollywood. But there’s a casual intimacy to the few hours we’ve spent together, shooting the breeze with a rapport so easy that I keep turning the recorder back on after I assume the interview is over him talking about falling under the spell of New Orleans, or being a “sucker for an underdog story,” or how “Beasts of the Southern Wild” is an amazing film that broke his heart. The bad thing about playing an interview slow and loose is that you’re never sure how to end it. So I keep hanging out at his office, touring the compound and overhearing him on the phone dealing with daddy business, when I realize I’m about to miss my flight. He orders me a car and walks me outside to the gate. It’s not until this moment, under the glare of the California sun, that I’m confronted with the absurdity of standing next to Brad Pitt, on the side of the road, waiting for an Uber.'"}, "time": 1742628547.213482}