{"duration": 0.06241345405578613, "input_args": {"text": "'Bill Maher: That ‘Lesser Of Two Evils’ Election Argument Is ‘BULLSH*T!’ (VIDEO) By Andrew Bradford on October 29, 2016 Subscribe \\nSince it first became clear that this year’s nominees for their respective parties would be Hillary Clinton and Donald Trump, there’s been some whining among voters that they are being forced to choose between the “lesser of two evils.” And for those people, Real Time host Bill Maher has a very simple but direct message : “Grow the fu*k up!” \\nOn his show last night, Maher directly confronted the “less of two evils” griping by explaining what’s at stake in this election: “Republicans have one path to this election and it’s ‘false equivalency.’ They can’t deny Trump is horrible – it’s on tape. So they want voters to believe that Hillary is just as bad. And in pursuit of that goal they have a very powerful ally — lazy people. “People who like to say, ‘they’re all bad.’ Because when you say that, you don’t have to do any homework. Say, ‘they’re all the same,’ and you can sound justifiably jaded by the entire process when, really, you just don’t know anything.” \\nFinally, Maher directed his comments at millennial voters who he said are wrongly obsessed with “bullshit” trivia: “I am so tired of hearing that Hillary doesn’t seem genuine. Grow the fuck up.” \\nExactly! Hillary isn’t “genuine?” So would you rather have a man who is a genuine serial sexual assaulter of women and a threat to the national and economic security of the United States? Those of us who care about what happens in the future because we love our children need to put aside our petty picking at a woman who has devoted her life to helping others and elect her as President. If we fail to do so, future generations will never forgive us. \\nFeatured Image Via YouTube Screengrab About Andrew Bradford \\nAndrew Bradford is a single father who lives in Atlanta. A member of the Christian Left, he has worked in the fields of academia, journalism, and political consulting. His passions are art, music, food, and literature. He believes in equal rights and justice for all. To see what else he likes to write about, check out his blog at Deepleftfield.info. Connect'"}, "time": 1742561934.1911466}