{"duration": 0.13292932510375977, "input_args": {"text": "'Back in March 2014, when Jared LeBoff, a producer at Marc Platt Productions, first read the thriller “The Girl on the Train,” it wasn’t yet a sensation, one that to date has sold more than six million copies in the United States alone. Sent to him in digital form by an agent of an unknown author, Paula  Hawkins, it was a     novel with three untrustworthy female narrators  —   one of them an unhappy, alcoholic divorcée named Rachel Watson who believes she has witnessed something key to a woman’s disappearance. “It was eerie, creepy and enticing,” Mr. LeBoff said about the twisty, Hitchcockian tone of Ms. Hawkins’s book. “It just added up to a juicy piece of material. ” Mr. Platt and DreamWorks Pictures apparently agreed, and without the headache of a bidding war, they soon optioned the rights. In fact, it wasn’t until the following year, around the time the screenwriter Erin Cressida Wilson (“Secretary”) was turning in her first draft of an adaptation, and Ms. Hawkins’s American publisher, Riverhead Books, was releasing her novel here, that those associated with the screen version of “The Girl on the Train” realized this was more than just an ordinary    project. Their source material seemed to be everywhere. “I kept seeing girls on the subway reading the book,” said Ms. Wilson, who made a pastime of surreptitiously photographing people with noses buried in “The Girl on the Train. ” “I sort of started a catalog of girls reading the book, on the subway, in cafes I saw a man reading it in a diner. It sort of confirmed the zeitgeist of something that Paula had captured. ” Within two weeks of hitting shelves and   “The Girl on the Train” shot to the top of the New York Times   list. In reviews, it was often compared with “Gone Girl,” Gillian Flynn’s suspense phenomenon of 2012, which resulted in a   film adaptation grossing roughly $369 million worldwide and earning Rosamund Pike an Oscar nod. While Mr. Platt and DreamWorks didn’t have the same luxury of time as the “Gone Girl” production  —   an almost      journey from print to screen  —   they had Ms. Wilson’s adaptation as interest in Ms. Hawkins’s book exploded. Tate Taylor, who directed another     adaptation, “The Help,” was brought in. By then, everyone was in   mode, Mr. Taylor said. “They were like: ‘We’ve got to get this thing made. We’ve got lightning in a bottle here. We’ve got to get it out for fall of 2016.’ So we just amped it up. ” On a trip to London to meet with Emily Blunt, who would be cast as the     Rachel, Mr. Taylor also met Ms. Hawkins for what he called “a   business talk. She said, ‘What are your intentions?’ and I said, ‘This needs to be really dark and sexy, and it needs to be truthful.’ And she said: ‘I love it! Let’s get a gin and tonic.’ That was the entire thing. ” Another consequence of the book’s meteoric rise was that they now had a   audience to worry about. “In the movie world, everyone is looking to break through all the noise with a brand, and a   book is such a thing,” Mr. Platt said. “But all of the sudden, you have expectations. What starts to creep into the conversation is how much you veer from the source material and how much you don’t. You ask yourself, ‘How can we make something that really works as a film, but yet still satisfy a very large fan base? ’” No one needs to remind him that when the film opens on Oct. 7, roughly 21 months after its original January 2015 book publication date, it will have to satisfy a fan base that has only continued growing. Having now spent more than 80 weeks and counting on the   list, “The Girl on the Train” has hit No. 1 in hardcover and   trade paperback and   paperback. Riverhead has printed close to 1. 4 million copies of a special movie   edition. Given the ubiquity of “The Girl on the Train” billboards, bus shelter posters and book displays in supermarkets, bookstores and airports nationwide, even publishing insiders have trouble pinpointing the exact cause of the exponential increase in sales. That said, every time Universal runs the film’s moody trailer  —   as it did on Aug. 9, right before Michael Phelps won his 20th Olympic gold medal  —   Riverhead sees a buying surge. Ms. Hawkins, speaking by phone from London, said she had watched the finished version of the film and spoke about what it was like to see characters she created walking, talking and moving around. “It’s a shocking film in parts, really frightening,” she said. “It’s an odd thing, because I actually know what’s happening, but it felt really fresh to me. ” Her positive response puts her in the position of addressing some readers’ irritation about changes made for the screen. To appeal to the larger American audience, the action, which originally had Rachel peering woozily into other people’s backyards from a commuter train running through suburban London, now puts her on the   rail line riding from Westchester County to Manhattan. “What I say to everyone is, ‘There’s no such thing as a 100 percent faithful adaptation of a book to screen,’” Ms. Hawkins said, adding that early on, when it came to selling the film rights, agents asked her, “‘Would you have a massive problem if the location was moved?’ I said, No, because what’s important really is the train, not what exists on the outside. ” Audiences should also not expect to catch a glimpse of the   Ms. Hawkins, even though, at one point, she had a cameo in the film. “I was on the set, and Tate persuaded me to be on the train as one of the other passengers,” Ms. Hawkins said with a laugh. “To be very honest with you, I was cut. ”'"}, "time": 1742562366.395415}