{"duration": 0.12628960609436035, "input_args": {"text": "'The fate of Donald Trump’s presidency depends on whether Sen. Chuck Schumer can block construction of the border wall, says Vanity Fair. [The magazine’s writer, T. A. Frank, is a liberal with some understanding of the Trump coalition and he argues that the Democrats hope to break Trump’s presidency by blocking funds for the wall:  Thwart Trump and he looks weak. You force him to break his signature promise. His agenda stalls. The Hispanic vote moves even more solidly to the left. The Democratic base gets energized, and Trump’s base gets demoralized and stays home in the next couple of elections. It’s  . That’s why Chuck Schumer has spoken of “shutting down the government” if Trump tries to get the wall going   …     People are now suggesting Trump has given up on the wall in all but rhetoric. And this would be momentous. If Trump’s wall is dead, then Trump’s presidency is dead, But Trump is still trying to get funds for the wall, in the face of uniform and public Democratic opposition plus widespread   opposition from GOP leaders. In a Friday, April 28 speech to the National Rifle Association, for example, he declared that: “We’ll build a wall. Don’t even think about [not getting a wall]. Don’t even think about it. Don’t even think about it. That’s an easy one. ” Amid unified Democratic opposition, Trump only has two choices, argues Vanity Fair: Trump’s options are limited. He could in theory play —  or have played —  a ruthless game to get his way, since Trump has the power to revoke the “deferred action for childhood arrivals” or DACA order that Barack Obama signed in order to shield those who have arrived here illegally as children. An icier type wouldn’t have hesitated to hold the fate of these people hostage for wall funding, employing rhetoric about the importance of tying today’s forgiveness to tomorrow’s prevention, and so on. But Trump shows few signs of being that callous, and he has conveyed only reassurances to the Dreamers. So threats of this sort will not be his approach. The second option would be to try to sell the wall —  and do a better job of it than he did with Ryancare   …     Trump could try to sell people on a vision of America with tighter labor markets [that push up higher wages] more equitable distribution of wealth, and less [civic] balkanization   …     He could pair this with a pitch for the wall, arguing that walls are peaceful and usually effective, and they reduce the need for more intrusive forms of enforcement such as workplace raids and deportation. But Trump has only figured out how to use the wall to sell himself. He never figured out how to use himself to sell the wall. Democrats oppose the wall, in large part, because it is an effective barrier that future politicians can’t remove, and is also a concrete symbol of Americans’ determination to block the flow of cheap labor,   customers, renters and future voters from Mexico to   cities along the coasts. But Trump also faces a huge problem in getting top GOP leaders to fund his plans for a wall, because the wall would shrink the flow of illegal immigrants sought by many business groups in Texas, Georgia and other red states. Throughout April, that   GOP opposition meant that GOP leaders failed to push Democrats to approve Trump’s request to build an additional 48 miles of border barrier in 2017. The requested $1 billion was blocked by Democrats, although congressional leaders say Trump will get the extra funds for other homeland security tasks in the 2017 supplemental budget, now slated for approval in early May. The   GOP opposition is cloaking itself as a supporter of alternatives to Trump’s permanent    barrier, such as an invisible fence of expensive sensors and border patrol agents which later can be switched off as soon as Trump leaves the White House. A wall “really means ‘security’   …     It could be open surveillance to prevent people from crossing,” Florida GOP Rep. Dennis Ross told Bloomberg in December. “It does not mean an actual wall. ” “I’ve always thought the wall was a metaphor for securing the border,” not an actual wall, claimed Wisconsin GOP Sen. Ron Johnson during an April CNN interview. “There will never be a   wall built, period,” claimed South Carolina GOP Sen. Lindsey Graham, a   Republican. “I think it’s become symbolic of better border security. It’s a code word for better border security. If you make it about actually building a   wall, that’s a bridge too far. ” “I think a wall is anything that will stop people from coming into the country illegally,” claimed Pennsylvania GOP Rep. Lou Barletta. “It could be a variety of what can be used to be successful. ” House Speaker Paul Ryan is also downplaying the wall part of the wall. “Conditions on the ground determine what you need in a particular area,” he told CBS’s “60 Minutes. ” Immigration reformers are pushing Trump to fight for wall funding in the 2018 budget, due in October. “Construction of a border wall was one of the president’s signature promises during his campaign,” said a statement from the Federation for American Immigration Reform. As he has made clear, an effective border security plan would include a wall in areas of the border where it is a viable and effective deterrent and that other sections of the border would be enhanced by technology and additional manpower. We expect that the president will deliver on these commitments. Unfortunately, past versions of a ‘comprehensive border security plan’ have been ineffective because they did not require the laying of a single brick of border wall. Such a cosmetic approach was a precursor to amnesty and both have been consistently rejected by the American people. We look forward to seeing details of the president’s plan that will actually get the job done of securing our southern border. ” However, border security is only one component of a needed overhaul of immigration. Much more is expected by the American people and the White House must demand Congress pass meaningful reforms to eliminate the incentives for illegal immigration and create a legal immigration system that truly serves identifiable national interests. ” Read more about the wall here.'"}, "time": 1742564479.8637092}