{"duration": 0.02318596839904785, "input_args": {"text": "'In an interview with a local television outlet, Evergreen State College President George Bridges claims that he is “deeply disappointed” by the protesters who forced professor Bret Weinstein to move his class off campus.[  In an interview conducted with   News, an   in Seattle, Washington, Evergreen State College President George Bridges condemned the behavior of the protesters who forced professor Bret Weinstein to relocate his class sessions due to safety concerns.   Bridges, who had previously lauded the courage of the student protesters, condemned their behaviors in the interview. “I was immensely disappointed with the students who obstructed his class,” Bridges claimed. “Those actions are indefensible. ” Weinstein has criticized the administration for their silence with regards to his safety on campus, and the faculty for blaming the campus chaos on his appearance on Tucker Carlson’s Fox News program. So far, Evergreen has blamed me, Fox, and the  . Doubled down on everything troubling. Will it dismiss this? https:  .   —   Bret Weinstein (@BretWeinstein) June 12, 2017,  Despite the criticisms hurled at Bridges, he defended Weinstein’s right to appear on Carlson’s program. “Bret Weinstein has every right to speak to whomever he wishes. He has freedom of speech and we have to protect that. He won’t be sanctioned for his actions,” Bridges said. Bridges claimed that the administration is in the process of reviewing “the entire sequence of events” to determine if students will face disciplinary measures for their participation in the protests that drove Weinstein from his classroom. He finished by claiming that the college will forge through this incident into the future. He added that Evergreen has a long history of protest and debate. “We embrace challenges,” Bridges added. “We embrace different issues and tackle them through discourse and debate and that’s a part of who we are. ” Tom Ciccotta is a libertarian who writes about economics and higher education for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com'"}, "time": 1742562264.3677266}