{"duration": 0.11237812042236328, "input_args": {"text": "'BNI Store Oct 31 2016 “He is a pig,” says morbidly obese and tattooed “model” while wearing a ‘Dump Trump’ T-shirt in Times Square Tess Holliday is using her platform as a jumbo-sized so-called “model” to speak out against Donald Trump’s treatment of women. The 31-year-old took to Instagram to share a photo of herself posed with her hands on her mega hips wearing the ‘Respect Women #Dump Trump’ shirt. ( Hey, why wasn’t she arrested for causing visual pollution in Times Square? ) UK Daily Mail ‘Respect Women,’ she captioned the image. ‘Our bodies are not for you to stare at or touch without our consent. Women are not just sexual objects, women are not here for your consumption. (One problem you don’t have, cupcake) The 31-year-old took to Instagram over the weekend to share an ad of herself posing in New York City’s Times Square while modeling a New Look Fashion T-shirt that reads: ‘Respect Women #Dump Trump.’ So many of us have a sexual assault story, myself included,’ she continued. (Gee, were you 100 pounds lighter then?) ‘To endorse someone who not just condones this behavior but actively engages in it would be an awful step backwards for women not just in the US but across the world. ‘Also might I add I’m NOT telling you who to vote for. Trump is a pig & that’s a fact.’ (But obviously, you are supporting a pig – Hillary Clinton – who has verbally abused all the women who were sexually assaulted/raped by her husband) Last week Tess made an appearance (above left) alongside model Iskra Lawrence and Orange is the New Black star Danielle Brooks at Refinery29’s Every Beautiful Body Symposium in New York City, wearing a figure-hugging dress. In celebration of Halloween, Tess also posted a throwback photo of her and Nick dressed as Miss Argentina and Beetlejuice from the 1988 film. ‘But how do I top last year?’ she wrote. We pulled these costumes off in two days, and I’m pretty darn proud.’ There was also a fierce debate about whether or not Tess’ post could be seen as an endorsement for the Democratic nominee, Hillary Clinton, and some people who disagreed with her statement attacked the size 22 model for her weight. ‘There is some super hateful stuff on here,’ one woman wrote. ‘And targeting her weight because you disagree? Really? People are crazy, keep up your positive messages Tess! Whatever your political views are, I still love what you represent!’ '"}, "time": 1742564533.6571803}