{"duration": 0.14568519592285156, "input_args": {"text": "'WASHINGTON  —   Stung by a fierce backlash from Donald J. Trump’s ardent supporters, four Republican members of Congress who had made headlines for demanding that Mr. Trump leave the presidential race retreated quietly this week, conceding that they would still probably vote for the man they had excoriated just days before. From Senator John Thune of South Dakota, the only member of the Republican leadership in either chamber who had disavowed Mr. Trump, to Representative Scott Garrett of New Jersey, who is in a difficult   fight, the lawmakers contorted themselves over Mr. Trump. Some of them would not mention him by name, preferring instead to affirm their support for the generic “Republican ticket,” still grasping for a middle ground. They said that if Mr. Trump would not make way for his running mate, Gov. Mike Pence of Indiana, to lead the party after the release of a recording on Friday showing Mr. Trump bragging about groping women, they had little choice but to vote for their embattled nominee. But the collective   owed less to his refusal to exit a race in which ballots are already being cast than to the fury his supporters unleashed at the defectors at rallies and on social media. And Mr. Trump himself escalated his bitter feud with the country’s   elected Republican, Speaker Paul D. Ryan, saying at a rally in Florida on Wednesday that Mr. Ryan’s refusal to actively support his candidacy was part of a “sinister deal going on. ” The quick reversals back to Mr. Trump’s camp vividly illustrated  Republicans’ predicament  as they grapple with a nominee whom some of their core supporters adore, a Democratic candidate their base loathes  —   and a host of voters who believe that Mr. Trump is   unsuited for high office. In Alabama, Representative Bradley Byrne, who said flatly over the weekend, “It is now clear Donald Trump is not fit to be president of the United States,” insisted to reporters on Wednesday that he had always said he would “be a supporter of the Republican ticket from top to bottom. ” “I’m a Republican,” Mr. Byrne said. “I don’t vote Democrat. ” Mr. Thune, who also said on Saturday that Mr. Pence should be the party’s nominee, “effective immediately,” acknowledged that the recording of Mr. Trump boasting of grabbing women’s genitals was “more offensive than anything that I had seen” from the   Republican  . But he said in an interview Tuesday with KELO television in Sioux Falls, S. D. that he would still cast his ballot for Mr. Trump. “I intend to support the nominee of our party, and if anything should change, then I’ll let you know,” Mr. Thune said. “But he’s got a lot of work to do, I think, if he’s going to have any hope of winning this election. ” Of the Republicans who reversed themselves, only Mr. Garrett is in a competitive race. Mr. Byrne and Mr. Thune are expected to easily defeat their Democratic opponents, and Senator Deb Fischer of Nebraska is not up for   until 2018. On Saturday, Ms. Fischer called Mr. Trump’s comments “disgusting and totally unacceptable under any circumstance” and said, “It would be wise for him to step aside and allow Mike Pence to serve as our party’s nominee. ” But she was almost philosophical in telling a Nebraska radio station on Tuesday why she was still backing Mr. Trump. “He decided he would not step aside. I respect his decision,” she said. “I support the Republican ticket, and it’s a   ticket. ” In New Jersey, Mr. Garrett also initially called for Mr. Pence to lead the party. But by Tuesday, Mr. Garrett, a   lawmaker who was already facing perhaps the stiffest challenge of his career, said he would “vote Trump for president if he is the party’s official nominee come Election Day. ” The legislators’ tortuous efforts to climb down from their earlier clarion calls did not seem to placate Mr. Trump’s admirers much. “If you are not FOR Mr. Trump, then you must be AGAINST Mr. Trump,” Lonnie Lee Mixon II, an Alabamian, wrote on Mr. Byrne’s Facebook page. “Please stop dancing around this. ” A handful of the Republican Party’s recruits also find themselves in a vise. In Nebraska, Don Bacon, who is challenging Representative Brad Ashford, a Democrat, initially issued a statement calling Mr. Trump’s remarks “utterly disgraceful and disqualifying. ” But the news release is nowhere to be found on Mr. Bacon’s website, and at a debate Tuesday night in Omaha, he would not rule out voting for Mr. Trump. The specter of a civil war enveloping the party less than four weeks before Election Day left veteran Republicans deeply worried about what the elected officials who moved so quickly to abandon Mr. Trump last weekend had wrought. One former Virginia congressman, Thomas M. Davis III, said “panicked” Republicans might have made the party’s   problems even worse. “It discourages turnout,” Mr. Davis said, noting that even as Mr. Trump sinks in the polls, he still has at least   of the party behind him. “Publicly disowning and running from him just creates havoc. It hurts everybody. I understand individual decisions, but when this happens institutionally, it hurts. ” Sensing an opportunity to rally his supporters against the wavering Republican leaders, Mr. Trump went after Mr. Ryan at a campaign rally for the first time since the speaker told House Republicans on Monday that he would no longer defend the party’s nominee. Before 7, 000 people in Ocala, Fla. Mr. Trump veered between dark, conspiratorial warnings and strikingly personal expressions of resentment. “There’s a whole deal going on,” he said of Mr. Ryan’s decision to walk away from his candidacy. “We’re going to figure it out. ” Yet even as he used the rally to accuse the speaker of being part of a nefarious, if vague, plot, Mr. Trump also made clear he was wounded that Mr. Ryan had not called to praise him for his debate performance on Sunday. “So wouldn’t you think that Paul Ryan would call and say good going, in front of just about the largest audience for a   debate in the history of the country?” he complained. In a conference call Wednesday night with major donors, Mr. Ryan vented about leaks from the conference call with House Republicans on Monday in which he announced his decision to focus entirely on congressional races. He said the news media had misinterpreted his message to his colleagues  —   that they should not “defend the indefensible”  —   and that Mr. Trump lacked “the discipline” to resist swiping back at him, according to a donor on the call. But Mr. Ryan said that Republican candidates could “help Trump with turnout,” and that he planned to use a speech on Friday to argue against Hillary Clinton. While Mr. Trump had already lashed out at Mr. Ryan on Twitter and in a Fox News interview, his decision to use his own campaign event to hurl attacks at the speaker caused a new wave of fear among Republicans that their now “unshackled” candidate, as he described himself earlier in the week, might use his rallies to similarly attack local Republican lawmakers who have refused to support his candidacy. (They also had to deal with new revelations about Mr. Trump’s behavior, like a report that he had walked into a Miss Teen USA dressing room as contestants were changing, and another report that two women had accused him of groping them.) Mr. Trump’s campaign manager, Kellyanne Conway, would not say whether Mr. Trump planned to start tailoring his intraparty attacks by region. But she pointedly emailed an automated survey of Nevada voters showing that Republicans were punishing Representative Joe Heck in his Senate campaign for withdrawing his support of Mr. Trump. One of Mr. Trump’s most prominent remaining allies, the former House speaker Newt Gingrich, said the nominee’s blasts at other Republicans were an unnecessary diversion from targeting Mrs. Clinton. But Mr. Gingrich added that Mr. Ryan had invited the opprobrium from both Mr. Trump and his admirers. “Ryan wants to find a middle path, but he doesn’t understand that the middle path signals to his own partisans that he’s not hanging tough,” he said. “All you have to say if you’re Ryan is, ‘We need to beat Hillary Clinton, and I’m going to help beat Hillary Clinton. ’” Mrs. Clinton herself was reveling in the Republican conflagration and, in a new sign of confidence, used a rally in Pueblo, Colo. to appeal across state lines to voters in two red states that now appear within reach. ”If you’ve got friends in Utah or Arizona, make sure they vote, too,” she said. “We are competing everywhere. ”'"}, "time": 1742561956.414605}