{"duration": 0.04331088066101074, "input_args": {"text": "'Yes, “The Weight of These Wings” is Miranda Lambert’s first album since divorcing her fellow country star Blake Shelton last year. And yes, it is filled with songs about romantic skepticism and ones about how the first steps you take after an old love breaks are tentative and fragile. And yes, it is a double album, the sort of gesture intended to connote seriousness of artistic and spiritual purpose, as well as suggesting that the font of feelings serving as inspiration is a roaring waterfall that cannot easily be contained. And yet it turns out that “Wings” isn’t so much about Ms. Lambert’s relationship to Mr. Shelton as it is about hers to the Nashville mainstream, which she has shunned, coveted, flirted with and rejected at various points in the last decade. “Wings” is her sixth album, and dating to before her 2005 debut, “Kerosene,” she’s been engaged in an elaborate dance with country music tradition and the current state of the genre. On the   competition “Nashville Star,” she was a striver then, on her first two major label albums, she was a dissenter, upending norms with verve and backbone. In the years since, she’s been, by turns, a traditionalist, a seemingly happy member of the Nashville establishment  —   especially in the years she and Mr. Shelton were winning female and male vocalist of the year at the Country Music Association Awards  —   and, at her most thrilling, a   boundary pusher being yanked (or, more accurately, yanking) in all sorts of wild directions. You could rarely accuse her of complacency, but maybe that’s the most perverse strategy on this album, which no one would have blinked at if it were an earthquake, but which is perhaps more cunning as a tremor. For the most part, these songs  —   vocals and all  —   were recorded live to tape, leaving a texture of rustle and warm air. (There are overdubs and rerecorded vocals here, but they do not dominate.) Ms. Lambert wants to communicate that, through all of her personal struggles, she is working, right down to the flubbed then rerecorded intro to the crunchy, almost rowdy “Bad Boy,” one of this album’s better songs, written with the underheralded   Mando Saenz. This approach is clearest  —   which is to say, the sound is the cloudiest  —   on this double album’s first, and better, half. “The Nerve” is unhurried, verging on indifferent, a perhaps inadvertent nod to when country first went   in the 1990s. “Pushin’ Time” is strikingly intimate, as if recorded from the middle of the round. And “Highway Vagabond” is downright shaggy, even though its lyrics about hippie drifters are better suited to Jake Owen. Produced by Frank Liddell, Glenn Worf and Eric Masse, this “Wings” is modestly scaled  —   something Ms. Lambert never has been, and isn’t always well suited to. Partly that’s because her piercing voice breaks in just the right places when her mood grows downcast, and explodes into colorful curlicues when she’s enthused, or peeved. That rarely happens here, though there is a vicious   “To Learn Her” (written with Ashley Monroe and Waylon Payne) which singes with Gary   acid. And Ms. Lambert takes a quick, zany turn on the album’s first half with the    songs “We Should Be Friends” and “Pink Sunglasses,” lightly comic feminism for the parts of the country where the local    is a Walmart: “If you’re lookin’ for love but willin’ to   men and mamas and Miller   then, we should be friends. ” Mostly, though, fragility reigns. “Tin Man” is a weepy warning: “Better thank your lucky   you ever felt one breakin’ ’d never want a heart. ” And “ ” is a plea, to a new lover, or to a listener expecting fireworks and instead getting a small campfire: “Like a caged bird barely set   me, I’m finding my wings. ” When this album whispers, as it does on large swaths of the second half, it neuters Ms. Lambert’s gifts. Even with a voice as signature as hers, there’s little to elevate songs like “Good Ol’ Days” or “Dear Old Sun. ” Most jarringly, this album doesn’t serve as a retort to its surroundings, and retort is what Ms. Lambert does best, especially because, in her hands, it can take on myriad thrilling shapes. But doing so draws attention, and what’s clear from this album is that Ms. Lambert is in retreat. Maybe the loudest person in the room could do with a little quiet.'"}, "time": 1742628472.1353993}