{"duration": 0.12271475791931152, "input_args": {"text": "'In Washington, D. C. teachers at child care centers will soon join preschool teachers in needing college degrees  —   one of a series of policies nationwide requiring higher education for the people who take care of young children. Advocates say it’s a way to ensure that teachers are qualified to nurture children at a crucial phase of development. They cite evidence that   early childhood education helps children, especially disadvantaged ones, for the rest of their lives  —   but that   preschool can hurt more than none at all. Critics, meanwhile, say there is nothing about taking care of young children that requires a college education. Mandating such credentials, they say, only makes child care even less affordable and reduces the supply and diversity of people able to do the job. The debate has become more urgent as researchers have discovered that children develop wide achievement gaps well before kindergarten, which fuels inequality. Yet teaching and caring for young children is still considered a   job. So what does the data show? Teachers’ level of education is associated with   care and teaching, and there is no evidence that it doesn’t matter. However, there is also no clear evidence that it’s necessary, or sufficient on its own, without being combined with other policies  —   particularly paying teachers higher wages. “Is it just that teachers have degrees? No, it’s all this other stuff,” said Steven Barnett, director of the National Institute for Early Education Research at Rutgers. “But by the same token, there’s no evidence that excellent quality would happen if the teachers don’t receive the education and the compensation that goes with it. ” In 2015, the National Academies of Sciences, Engineering and Medicine called for all preschool teachers to have a bachelor’s degree in early childhood development or education, but added, “A policy requirement for a degree implemented in isolation, without addressing other workforce development considerations, would be insufficient to yield these improvements. ” Of the 57     programs (some states have more than one) 33 require that lead teachers have a bachelor’s degree, according to the Rutgers institute. And   of teachers in Head Start, a federal program, now have college degrees, exceeding a requirement introduced 10 years ago that half of the program’s teachers have such a credential. The new policy in Washington expands the rules beyond   programs, requiring that directors of licensed child care centers or preschools have bachelor’s degrees and that teachers have   associate degrees. One of the challenges in assessing the policies is that there has never been a large   study, like a controlled trial that randomly placed children in a classroom with a   teacher or not  —   and that also controlled for other variables that influence quality. Many studies have looked at whether teacher education is correlated with quality programs, and they have mostly found that it is. Still, it’s impossible to disentangle whether the teachers’ degrees caused the quality to improve or, more likely, whether it was a combination of factors, including compensation, class size,   ratios, classroom atmosphere, curriculum, leadership and continuing education. The studies have also not answered whether a teacher’s major makes a difference, or if a   degree is more helpful than a   one. “You can have the best degree in the world, but you get into a program that has high turnover or a bad director, and you can’t necessarily apply what you know,” said Marcy Whitebook, director of the Center for the Study of Child Care Employment at the University of California, Berkeley, and a former preschool teacher. Studies of public early childhood programs, including in New Jersey and Oklahoma, have found positive outcomes for children when the teachers had college degrees. But since they all had degrees, it’s unclear whether the degree is what helped, something else or a combination. Several   by different researchers analyzing dozens of studies have found positive and statistically significant relationships between teachers’ education and the quality of care and children’s outcomes. But each of the researchers emphasized that the studies could not determine that education caused the difference. “The professionalization of the early childhood sector through more qualified staff may lead to significant gains for children and their families,” Matthew Manning of Australian National University and his   wrote in an analysis, published in January, of 48 studies from various countries. “However, the evidence is from correlational studies, so evidence is needed from studies with designs which can assess causal effects. ” One   of seven studies did not find an overall positive relationship: In two of the studies, it found that quality was higher when the teacher had a bachelor’s degree, but in one study the quality was lower, and in four it was unaffected. Yet the researchers, from the University of North Carolina at Chapel Hill, said there was no way to measure the quality of education the teachers received, which in some cases happened three decades earlier, or whether the schools in which they taught had the resources for them to implement what they learned. Because preschool and child care teachers are paid so little, if people working in or entering the field get college degrees, they eventually take   jobs in elementary schools instead, several analyses have found. The average salary for an early childhood teacher with a bachelor’s degree is $27, 200 to $42, 800, depending on the setting and children’s age, while the average salary for an elementary teacher with the same education is $56, 100, according to the Berkeley center. Access to child care is already insufficient, experts say, and researchers fear that requiring a degree would turn away potential teachers, particularly those who are not white or   at a time when the student population is diversifying. Yet if preschools raise wages enough to make a college degree worth it, the cost could get passed on to parents, possibly making it unaffordable for   families and widening the gap in access, according to Pamela Kelley and Gregory Camilli of Rutgers. There are some efforts to provide scholarships and raise wages. But ultimately, it would probably require something the United States has long resisted: universal public financing of early childhood education. “Compensation policy has to go along with this,” Mr. Barnett said. “If it doesn’t, then really there isn’t any reason to do it. ”'"}, "time": 1742564499.476294}