{"duration": 0.08661341667175293, "input_args": {"text": "'\\nThis article/video was originally published at SGTReport.com . \\nEditor’s Comment: The evidence is now overwhelming – whatever the full truth of the matter, something is very, very suspicious about the “pizza code” that has been discovered in the leaked Podesta emails that many believe is connected to a ring of pedophilia activity. Independent researchers have been scouring the web for supporting information, and have pieced together a disturbing pile of circumstantial evidence connecting many of DC’s most powerful to lewd comments, references to illegal sex acts and child trafficking, dark art and more. It is very likely that this could go to the very top, where powerful people are protected by people with ranking positions inside the power structure. \\nPerhaps that is why many channels and researchers are meeting censorship, threats and bans. Reddit’s thread on the topic, which was quickly becoming the definitive gathering place for the information, was shut down. Meanwhile, the entire The Daily Sheeple website was shutdown temporarily over a copyright claim about an image in “pizza gate” story (see video at bottom). Numerous YouTube accounts have been suspended or blocked as well. Read more: The Disturbing, Disgusting Pedophile Code Hidden in the John Podesta Emails \\nWill the phony clamp down over “fake news” be used to completely cover-up the evidence of what appear to be very serious crimes? \\nPizzaGate Is a Worldwide Citizen Investigation Now \\nby SGT Report\\nWhile the NY Times tries to soft peddle #PizzaGate, Reddit tries to kill the Sub-Reddit investigation and Twitter attempts to censor breaking news on the global pedophile ring – it’s too late. The genie is out of the bottle. We will not be stopped. Truth will be revealed. Because #PizzaGate is a WORLDWIDE CITIZEN INVESTIGATION NOW. And the pedos are running scared.\\nPIZZAGATE IS A WORLDWIDE CITIZEN INVESTIGATION NOW.\\n\\nCharles Ortel: Pardons Won’t Save Clintons From Clinton Foundation Crimes? The De- \\nThe De-Occulting of John Podesta (by martyleeds33) \\nUnderstanding #PizzaGate – Opening the Rabbit hole (by Stirling) \\nINFOWARS WEIGHS IN: PIZZAGATE IS REAL!!! \\nPizzaGate Definitive Factcheck: Oh My God. \\n\\nOur Site Got SHUT DOWN for #Pizzagate Podesta Wikileaks Story \\n\\nThis article/video was originally published at SGTReport.com . \\n'"}, "time": 1742564537.0248966}