{"duration": 0.037856101989746094, "input_args": {"text": "'MarcFaberBlog.com November 1, 2016 \\nIt’s nonsense to claim that inflation is only going up 1 percent per year in the United States. The cost of living of a typical family is going up much more than that—insurance, transportation, schooling are all going up. \\nFor example, health care premiums for insurance policies [are rising], so the typical household is being squeezed. The central banks don’t care about that; they don’t look at it.. \\nI suppose the system will collapse before we become like Venezuela. In the West, if they start to print money, the end game will be brief. Within five years, I expect the system to implode. \\nYou better ask the bureaucrats what their plans are. They had zero rates since December 2008; soon eight years [passed], and that hasn’t boosted economic activity for the average household, not in Japan nor the United States nor the EU. Now they talk about fiscal spending. \\nYou better ask the bureaucrats what their plans are. They had zero rates since December 2008; soon eight years [passed], and that hasn’t boosted economic activity for the average household, not in Japan nor the United States nor the EU. Now they talk about fiscal spending. \\nThen they will find some academics who will blame wealth inequality on the evil capitalists who made so much money out of asset bubbles. \\nThey will blame the economic woes on these people. To some extent this is true. But the rich people did not create the inflated asset values; it was the central banks, by slashing interest rates to zero and negative interest rates in many countries. \\nFirst, you create mispricings through artificially low rates and negative interest rates and you boost the income and wealth of the super-rich. It’s at best the 0.1 percent that really benefit from asset inflation, at the cost of all the people that have no assets and so you have this rising wealth inequality. So we have to tax the rich people and tax them more. \\nTaking money from the rich is appealing if you go to voters, and you say to them, “Look, the reason the economy is doing so badly, it’s because of the rich people, the billionaires. We have to take 20 percent away from them and give it to you.” You can be sure that everybody will vote for that because the wealthy are a minority. This is what happens after monetary policies completely fail. \\nSome well-connected people will hide their wealth but a lot of people won’t. Even if they take 50 percent from the richest, it’s not going to help. The next step will be to take money from less wealthy people; the interventionists will go all the way. \\n- Source, The Epoch Times'"}, "time": 1742563363.1782806}