{"duration": 0.16975092887878418, "input_args": {"text": "'Posted on November 1, 2016 by Eric Zuesse. Eric Zuesse On November 1st, The Intercept headlined “HERE’S THE PROBLEM WITH THE STORY CONNECTING RUSSIA TO DONALD TRUMP’S EMAIL SERVER” , and the reporting team of Sam Biddle, Lee Fang, Micah Lee, and Morgan Marquis-Boire, revealed that: “Slate’s Franklin Foer published a story that’s been circulating through the dark web and various newsrooms since summertime, an enormous, eyebrow-raising claim that Donald Trump uses a secret server to communicate with Russia. That claim resulted in an explosive night of Twitter confusion and misinformation. The gist of the Slate article is dramatic — incredible, even: Cybersecurity researchers found that the Trump Organization used a secret box configured to communicate exclusively with Alfa Bank, Russia’s largest commercial bank. This is a story that any reporter in our election cycle would drool over, and drool Foer did.” The Intercept team concluded their detailed analysis of the evidence by saying: “Could it be that Donald Trump used one of his shoddy empire’s spam marketing machines, one with his last name built right into the domain name, to secretly collaborate with a Moscow bank? Sure. At this moment, there’s literally no way to disprove that. But there’s also literally no way to prove it, and such a grand claim carries a high burden of proof. Without more evidence it would be safer (and saner) to assume that this is exactly what it looks like: A company that Trump has used since 2007 to outsource his hotel spam is doing exactly that. Otherwise, we’re all making the exact same speculation about the unknown that’s caused untold millions of voters to believe Hillary’s deleted emails might have contained Benghazi cover-up PDFs. Given equal evidence for both, go with the less wacky story.” However, they failed to dig deeper to explain what could have motivated this smear of Trump: was it just sloppiness on the part of Slate, and of Foer? Hardly — it was anything but unintentional: A core part of the Democratic Party’s campaign for Hillary Clinton consists of her claim that Donald Trump is secretly a Russian agent. This is an updated version of the Republican Joseph R. McCarthy’s campaign to “root communists out of the federal government,” and of the John Birch Society’s accusation even against the Republican President Dwight Eisenhower that, “With regard to … Eisenhower, it is difficult to avoid raising the question of deliberate treason.” Neoconservatives — in both Parties — are the heirs of the Republican Party’s hard-right, which now, even decades after the 1991 end of communism and the Soviet Union, hate Russia above all of their other passions. Neoconservatism has emerged as today’s Republican Party’s Establishment, and (like with the Democratic Party’s original neocon, U.S. Senator Henry “Scoop” Jackson, the “Senator from Boeing”) they’ve always viewed Russia to be America’s chief enemy, and they have favored the overthrow of any nation’s leader who is friendly toward Russia, such as Saddam Hussein, Muammar Gaddafi, Viktor Yanukovych, and Bashar al-Assad. Hatred and demonization of Russia is the common core of neoconservatism — the post-Cold-War extension of Joseph R. McCarthy and the John Birch Society. Both Slate and especially Foer have long pedigrees as Democratic Party neoconservatives — champions of U.S. invasions, otherwise called PR agents (‘journalists’) promoting the products and services that a few giant and exclusive military corporations such as Raytheon, Lockheed Martin, Dyncorp, and the Carlyle Group, offer to the U.S. federal government. I’ll deal here only with Foer, not with his latest employer (in a string, all of which are neocon Democratic ‘news’ media). Foer wrote in The New York Times , on 10 October 2004, against ‘isolationist’ Republicans, who regretted having supported George W. Bush’s invasion of Iraq, and he headlined about them there, “Once Again, America First” , equating non -neoconservative Republicans with, essentially, the pro-fascist isolationists of the 1930s. He concluded that they would come to regret their regret: “Conservatives could soon find themselves retracing Buckley’s steps, wrestling all over again with their isolationist instincts.” That’s how far-right Franklin Foer is: he’s to the right of those Republicans. On 7 June 2004, Foer, in a tediously long, badly written and argued, article in New York Magazine , “The Source of the Trouble” , described the downfall of The New York Times’s leading stenographer for George W. Bush’s lies to invade Iraq, their reporter Judith Miller. He closed by concluding that “the source of the trouble” was that Miller was simply too earnest and tried too hard — not that she was a stenographer to power: “People like Miller, with her outsize journalistic temperament of ambition, obsession, and competitive fervor, relying on people like Ahmad Chalabi, with his smooth, affable exterior retailing false information for his own motives, for the benefit of people reading a newspaper, trying to get at the truth of what’s what. ” (She was anything but “trying to get at the truth of what’s what.” She was the opposite: a mere stenographer to George W. Bush and to the Administration’s chosen mouthpieces, such as the anti-Saddam exiled Iraqi Ahmad Chalaby.) On 20 December 2004, when the question of whether to bomb Iran was being debated by neoconservatives, Foer, who then was the Editor of the leading Democratic Party neoconservative magazine, The New Republic , headlined in his magazine, “Identity Crisis: Neocon v. Neocon on Iran” , and he introduced a supposed non-neocon from the supposedly non-neocon Brookings Institution, Kenneth Pollack, to comment upon the conflict among ( the other Party’s ) neocons: “In part, the lack of neocon consensus [on whether to, as John McCain was to so poetically put it, ‘Bomb, bomb, bomb Iran’ ] can be attributed to the nature of the problem. Nobody — not the Council on Foreign Relations, not John Kerry’s brain trust — has designed a plausible policy to walk Iran back from the nuclear brink. Or, as Kenneth M. Pollack concludes in his new book, The Persian Puzzle, this is a ‘problem from Hell’ with no good solution.” But, actually, both Pollack and Brookings are Democratic Party neocons themselves; and among the leading proponents of invading Iraq had been not only Pollack but Brookings’s Michael O’Hanlon . Brookings had no prominent opponent of invading Iraq. (Brookings has a long history of neoconservatism , and routinely leads the Democratic Party’s contingent of neocon thinking, even urging a Democratic administration to have its stooge-regimes violate international laws .) The real reason why neocons (being the heirs of the far-right extremists’ Cold-War demonization of Russia, even after communism is gone) wanted to conquer both Iraq and Iran, was that both countries’ leaders were friendly towards Russia, and were opposed by the Saud family who own Saudi Arabia, which family quietly worked not only with the U.S. government but with Israel’s government, against both Iraq and Iran, as well as against Syria — those three nations (Iraq, Iran, and Syria) all being friendly toward Russia, which both the Saudi aristocracy, and not only the U.S. aristocracy, hate. It’s not just the conservative ‘news’ media that are neoconservative now. The so-called ‘liberal’ media are so neoconservative that, for example, Salon can condemn Donald Trump for his having condemned Hillary and Obama’s bombing of Libya. Salon condemned Trump’s having said “We would be so much better off if Qaddafi were in charge right now” — as if Trump weren’t correct, and as if what happened after our overthrow and killing of Qaddafi weren’t far worse for both Libyans and the world than what now exists in Libya is. (But, of course, for Lockheed Martin etc., it is far better). CBS News and Mother Jones condemned the Trilateralist Joseph Nye for having veered temporarily away from his normal neoconservatism. Then, Nye wrote in the neocon Huffington Post saying that David Corn of Mother Jones and Franklin Foer of The New Republic had misrepresented what he had said, and that he was actually a good neocon after all. Nye closed: “In any case, I have never supported Gaddafi and am on record wishing him gone, and also on record supporting Obama’s actions in recent weeks. We now know that Gaddafi’s departure is the only change that will work in Libya.” Sure, it did. Oh, really? It’s Trump who is crazy here? More recently, Foer headlined at Slate, “Putin’s Puppet: If the Russian president could design a candidate to undermine American interests — and advance his own — he’d look a lot like Donald Trump.” Foer proceeded to present the view of Trump that subsequently became parroted by the Hillary Clinton campaign (that Trump=traitor). Wikipedia has a 450-person ”List of Republicans opposing Donald Trump presidential campaign, 2016″ , and it’s almost entirely comprised of well-known neoconservatives — the farthest-right of all Republicans, the people closest to Joseph R. McCarthy and the John Birch Society. Foer cited many neoconservative sources that are not commonly thought of as Republican, such as Buzzfeed; and he even had the gall to blame the Russian government for having made public its best evidence behind its charge (which was true ) that the overthrow of Ukraine’s democratically elected President Viktor Yanukovych in February 2014 was no authentic ‘democratic revolution’ such as the U.S. government and its ‘news’ media said, but was instead a very bloody U.S. coup d’etat in Ukraine , which was organized from the U.S. Embassy there, starting by no later than 1 March 2013 , a year beforehand. Foer wrote: “The Russians have made an art of publicizing the material they have filched to injure their adversaries. The locus classicus of this method was a recording of a blunt call between State Department official Toria [that’s actually ‘Victoria’] Nuland [a close friend of both Hillary Clinton and Dick Cheney] and the American ambassador to Kiev, Geoffrey Pyatt. The Russians allegedly planted the recording on YouTube and then tweeted a link to it — and from there it became international news. Though they never claimed credit for the leak, few doubted the White House’s contention that Russia was the source.” To a neoconservative, even defensive measures (such as Russia’s there exposing the lies that America uses to ‘justify’ economic sanctions and other hostile acts against Russia) — indeed, anything that Russia does against America’s aggressions against Russia, and against Russia’s allies (such as Saddam Hussein, Muammar Gaddafi, Bashar al-Assad, and Viktor Yanukovych) — anything that Russia does, is somehow evil and blameworthy. And, of course, America’s aggressions are not. The U.S. government and its neocon propagandists are outraged that some people are trying to expose — instead of to spread — their lies. The American government isn’t yet neocon enough, in the view of such liars.'"}, "time": 1742628361.7461956}