{"duration": 0.07908153533935547, "input_args": {"text": "'A federal judge approved a consent decree on Friday that would overhaul the Baltimore Police Department, days after the judge thwarted a Justice Department effort to delay a decision. The   agreement between the federal government and city leaders would introduce a wide range of police reforms, including training, new technology and community oversight. The agreement rose from a scathing 2016 Justice Department report that found systemic racial bias in the police department. “The talk is over,” Brandon Scott, a Baltimore city councilman who leads the Police Oversight Committee, said after the decision on Friday. “It’s time for us to handle our business. ” The approval came as a relief to supporters who feared the agreement might be delayed or canceled under the new presidential administration. The pact was signed on Jan. 12, eight days before Donald J. Trump was inaugurated. Its supporters knew President Trump and his attorney general, Jeff Sessions, would be less likely to support it. On Monday, the Justice Department sought a   delay so it could review all police reform agreements, including the one in Baltimore. But Judge James K. Bredar said Friday that he interpreted that request as the department’s trying to determine “whether it wants the court to enter the decree at all, or at least the current version of it. ” That opportunity had passed, he said. “The parties have already agreed to the draft before the court,” Judge Bredar wrote in his decision. “It would be extraordinary for the court to permit one side to unilaterally amend an agreement already jointly reached and signed. ” Mr. Sessions said in a statement that the decree “was negotiated during a rushed process by the previous administration and signed only days before they left office. ” “While the Department of Justice continues to fully support police reform in Baltimore, I have grave concerns that some provisions of this decree will reduce the lawful powers of the police department and result in a less safe city,” he said. He added that the agreement contained “clear departures from many proven principles of good policing that we fear will result in more crime. ” The Justice Department’s report found that the police in Baltimore, a city that is 63 percent black, disproportionately targeted black people, often for dubious reasons. The 2015 death of Freddie Gray, a      man, while in police custody led to violent riots. The   consent decree covers a wide range of reforms. It includes a requirement for officers to undergo 80 hours of training, including best practices on stopping, searching and arresting people, and technological upgrades like video cameras inside police vans. City leaders praised Judge Bredar’s decision to approve the agreement. Tessa   president of the Baltimore branch of the N. A. A. C. P. said on Friday that residents she had spoken to “really wanted this to go through,” and were worried the effort they had put into the agreement would be for naught. “For all of that just to fall apart because they didn’t want to go through with it would have hurt everybody,” she said. The city’s mayor, Catherine Pugh, said at a news conference that the decision was “a great victory for the citizens of Baltimore, as well as the Baltimore Police Department. ” The next step is most likely to be the federal appointment of an independent monitor who will ensure the city is adequately addressing bias complaints. “Until the independent court monitor is assigned, everything else is on hold,” said Mr. Scott, the councilman. In his statement, Mr. Sessions said the Justice Department “stands ready to work with Baltimore to fight violence crime and improve policing in the city. ”'"}, "time": 1742562836.8166265}