{"duration": 0.10271239280700684, "input_args": {"text": "'New York City is undergoing a rare explosion in city government: More people now work for the city  —   287, 002   employees as of July  —   than at any other point in its modern history, with thousands more scheduled to join them. The projected growth finds few parallels in other major American metropolises most, like New York, trimmed their numbers after the financial crash of 2008. Some have rehired, though not at the level that New York has under Mayor Bill de Blasio. But behind all the job growth is a complicated set of factors that explain the possible benefits and costs to the city, the mayor and his supporters. Unions will see new jobs for their members, but the city will see future pension costs rise. And even if the city fails to fill all its projected job openings, there is a benefit: An unfilled job can be taken off the budget, enabling the de Blasio administration to claim   savings from the absence of thousands of workers who were not hired. Every major agency is growing under Mr. de Blasio, a Democrat, but some expansions seem to stand out: His latest budget would have the Sanitation Department’s number of civilian employees increasing by a third since 2014 the Department of Citywide Administrative Services’ by 20 percent and the city information technology department’s by more than 50 percent. The growth in   staffing has worried some budget experts, who fear a lack of fiscal discipline at City Hall, and greater pension obligations down the road. “Every hire is $100, 000 a year, in cost of compensation,” said Carol Kellerman, the executive director of the nonpartisan Citizens Budget Commission. “If they didn’t hire any of the people who were planned for 2017, that’s a billion dollars. ” Indeed, the administration, while hiring at a breakneck pace, may be projecting a higher number of city jobs than it intends to fill, a shrewd, if not entirely transparent, maneuver that budget experts say will allow city agencies to find savings by choosing not to fill surplus jobs. In   the city said in budget documents that it anticipated 320, 569   and   equivalent positions by the end of the month. But by the month’s end, the city had still left 7, 000 positions unfilled, nearly all of them   postings. “Any head count that an agency doesn’t reach, that’s authorized, of course I’m going to bank it of course I’m going to make it savings,” Dean Fuleihan, the head of the mayor’s Office of Management and Budget, said in an interview. He acknowledged that any unfilled positions may be cut entirely when the budget is adjusted in November. “It is a big number, I’m not denying that, and my instinct is, I’m pretty sure you’ll see that adjusted down,” Mr. Fuleihan said. (City Hall officials later disputed the notion that the count was intentionally inflated to take savings later.) The discrepancy has been greeted with some raised eyebrows among the city’s budget watchers. “The difference between the last projection and actual number has grown substantially under Mayor de Blasio,” said Doug Turetsky, the chief of staff for the city’s Independent Budget Office. “It can create a   savings, a kind of    fiscal cushion. ” Even if the city writes down some of its planned hiring this year, the most recent head count of 287, 002, recorded at the end of June, is still a record. The number exceeds the city’s previous peak, recorded before the financial crash of 2008, and rivals the population of entire cities, including Pittsburgh and Cincinnati. No two cities are alike, and New York’s government performs many of the tasks that in other areas are handled by the local counties. But the swift growth in its work force  —   up from 271, 767   workers in July 2014 and driven by spending on new teachers, correction officers and a police force expansion  —   appears to be unique among large cities. In Chicago, for example, there has been little change over the past three years in the number of city workers, which has hovered around 34, 000 after dropping from more than 40, 000 before the crash. The city work force in Los Angeles was 46, 237 as of June, down 3, 000 workers from its recent peak, in 2009. The Houston city government has employed roughly the same number of people, around 22, 000, for several years. Phoenix has steadily cut jobs since 2008. “Will the   days of the city ever return? No, and they shouldn’t,” Ed Zuercher, the Phoenix city manager, said in a statement, adding that the city was stronger because of “the sacrifices that were made. ” Ron Galperin, the Los Angeles comptroller, said the city’s “dedicated employees are doing more with less. ” City Hall officials pointed to other cities, including Washington, Seattle and San Antonio, where the size of the municipal work force in 2015 was larger than before the recession. Mr. de Blasio’s administration has called for even more hiring by the middle of next year, with another 10, 000 workers to be added to the rolls, according to the most recent budget. The expansion has cheered the leadership of the city’s municipal unions. They did not rally behind Mr. de Blasio until after his 2013 primary win, but have since been won over by his   policies, which have also included the settling of outstanding contracts. The unions have been major donors to Mr. de Blasio’s political causes, including the   nonprofit Campaign for One New York and the 2014 effort to elect State Senate Democrats.   for those efforts is now under investigation by state and federal prosecutors. The United Federation of Teachers has grown by roughly 5, 700 members since Mr. de Blasio took office, replenishing ranks that had been reduced by 7 percent during the recession. Though the number of teachers still lags behind that of 2008, the union has made up the difference with teaching assistants known as paraprofessionals, whose ranks have swelled under Mr. de Blasio. District Council 37’s membership also grew as agencies piled on the nonuniformed employees, particularly at the Police and Sanitation Departments, and began using city workers to perform information technology tasks that had been previously handled by outside contractors. About 300 positions were added to replace those contractors, a move that City Hall officials expect to save money over five years by lowering contracting costs. The union had roughly 125, 000 members in its latest count, according to a spokesman, about 3, 200 more than it did before Mr. de Blasio took office. The Patrolmen’s Benevolent Association, a frequent antagonist of the mayor’s, has grown along with the New York Police Department. Mr. Fuleihan said the city’s current $82. 1 billion budget included some overestimation in order to dampen the blow of unanticipated events that have, in recent years, had huge effects on the budget: the Sept. 11, 2001, attacks the 2008 stock market crash and Hurricane Sandy in 2012. “You build against that happening,” he said. “We are a very rapidly growing city with new demands,” he said. “We believe that we’re being thoughtful about this. ” Mr. Fuleihan pointed to the billion dollars set aside in reserves and pension obligations that are set to be amortized by 2032, while observing the mayor’s agenda to address income inequality. City Hall officials highlighted the endorsements of its budgeting practices expressed by ratings agencies. “We put forward dramatic expansion,” Mr. Fuleihan said. “And we’re going to be constantly modifying that, to the extent that we can. ”'"}, "time": 1742562681.4413073}