{"duration": 1.7467560768127441, "input_args": {"text": "'Pinterest \\nWikiLeaks’ email dump is proving a great deal of things about who Hillary Clinton really is and what she stands for. She’s rather comfortable with cozying up to Wall Street , she has nothing but contempt for the everyday American , and employs people who literally want to bring about a complicit and unaware citizenry (which she likely supports 100%). \\nIt is also no secret that she is very much a fan of sweeping foreign-style gun laws which would effectively destroy the Second Amendment without even repealing it (though she obviously has not read my refutation of her unconstitutional and oppressive platform ). She would be more than happy to make the laws of states like California, Maryland, or New York into federal law… \\nSo why did she not fully endorse the highly controversial and oppressive New York gun control law known as the S.A.F.E. Act, which does many of the things that she so ardently desires to do? Good question… \\nThe Washington Free Beacon reported: \\nTop Clinton campaign staffers worried about embracing the 2013 New York gun control law known as the SAFE Act during a speech at a leading gun control group’s awards dinner, and ultimately decided to avoid praising some of the law’s more controversial provisions, hacked emails published on Wednesday show. \\nWhile reviewing the speech Hillary Clinton was slated to give at the Brady Center to Prevent Gun Violence’s 2015 Bear Awards, a number of top Clinton staffers discussed how to praise Democratic New York Governor Andrew Cuomo’s work on gun control without embracing the SAFE Act. \\nThe leaked emails show top Hillary aide Huma Abedin express a desire to fully endorse the NY law, which effectively bans any and all AR and AK style sporting rifles, and limited magazine capacity to 10 rounds (originally it was 7, despite rather few firearms that use a 7 round magazine, but that was struck down as federal court). \\nDespite Huma’s advice that Hillary endorse the law, Corey Ciorciari, a Clinton researcher advised against it. \\n“Don’t see a need to fully embrace the SAFE Act,” he said. “There are some controversial items in there. We can highlight pieces that fit within our agenda.” \\n… \\nCiorciari drafted a line that would highlight the parts of the SAFE Act the campaign liked while ignoring the rest. \\n“I’m working with Megan to incorporate something like this: ‘After the tragedy of Sandy Hook, when Congress failed to heed the call of the American people to take action, you led the fight in New York and expanded life saving background checks,’ he said. \\nCarrk, the campaign’s research director, agreed with Ciorciari. “SAFE is not a safe bet,” he replied. \\nSo the SAFE Act is “not a safe bet,” ehh? What exactly does that mean? \\nIf anything, it shows that the Hillary Clinton campaign knows that gun control is not a winning issue; it’s not a primary platform upon which the Democrats can win. \\nEspecially when it comes to things like banning the most commonly owned sporting rifle in the country, that’s something that is literally toxic for almost any candidate running for office right now, with a few exceptions in certain very Leftist districts. \\nNonetheless, Hillary has touted some very dangerous ideas about new laws that would severely infringe on our right to bear arms; ideas like universal background checks (code words for gun owner registry), placing liability for gun-related deaths on firearms manufacturers, closing the gun show and online “loopholes” (which don’t exist!), etc. Essentially, she’s advocating for things that will not solve crime, but will merely make criminals out of possibly a hundred million or more Americans. \\nBut of course, she can’t say that. She can’t say that she wants to ban your sporting rifle, force you to register it if it’s grandfathered, then prohibit transferring, thus creating de facto confiscation through the passing of a generation. \\nShe knows that saying that, or even saying anything close to that, would be immediately pounced upon by the NRA, National Association for Gun Rights, Gun Owners of America, and countless other national and state-level organizations that fight to protect our rights. So she uses vague language and capitalizes on emotionally charged terms to get support for an extremist agenda. \\nStill, don’t be fooled. Though she did not explicitly endorse NY SAFE Act-style gun laws, she does support them, and you and I both know it. \\nAs is often attributed to Thomas Jefferson, “Eternal vigilance is the price of liberty.”'"}, "time": 1742564259.6192307}