{"duration": 0.08786988258361816, "input_args": {"text": "'The head of Venezuela’s opposition coalition in the legislature denounced the violent takeover of a Catholic Mass in late January by armed Chavista gangs known as colectivos, who forced those congregated to listen to a disparaging rant against the Catholic Church instead of prayer. [Jesús Torrealba, the secretary general of Venezuela’s Democratic Unity Roundtable (MUD) tweeted this week that colectivos stormed into Caracas’s San Pedro Claver Church on January 23  . “The violent government supporters closed the door, prevented the parishioners from leaving, and forced them to listen to a political speech,” Torrealba denounced on Twitter. “The violent colectivos offended the Venezuelan Episcopal Conference and social leaders in the area in their speech. ”  1) GRAVE: La Iglesia San Pedro Claver, Caracas, fue cercada y tomada hoy 29E a la 1pm por paramilitares oficialistas mal llamados colectivos,  —   Jesus Chuo Torrealba (@ChuoTorrealba) January 29, 2017,  3) Los oficialistas violentos cerraron las puertas, impidieron la salida de los feligreses y los obligaron a escuchar un discurso político,  —   Jesus Chuo Torrealba (@ChuoTorrealba) January 29, 2017,  4) Los violentos mal llamados “colectivos” ofendieron en su discurso a la Conferencia Episcopal Venezolana y a dirigentes sociales de la zona,  —   Jesus Chuo Torrealba (@ChuoTorrealba) January 29, 2017,  Torrealba concluded, noting that the incident ended after Monsignor Jesús González de Zárate, an official at the church, pleaded with the gangs to allow the Mass to continue. Following reports of the event, the head of the Venezuelan Episcopal Conference issued a statement condemning the increasingly common attacks on the part of supporters of the socialist government against the Catholic Church. “These are not isolated occurrences but rather, one gets the impression that these are premeditated events meant to intimidate the Catholic Church,” Monsignor Diego Padrón, the head of the conference, said in remarks on an   radio program. The Church, he added, is a target because it “has taken a very clear position before the government, noting its difficulties, problems, and the crisis the nation is currently in. ” Padrón also listed other events that made him believe these were not isolated incidents, including attacks on the homes of multiple clergy members who had openly objected to the socialist government. While the Vatican has not aided the Venezuelan opposition at its highest level  —   Pope Francis notably met with dictator Nicolás Maduro, but not the wives of his political prisoners  —   Venezuelan clergy have vocally opposed the growing infringement on human rights and dire economic situation Maduro’s policies have created. The Episcopal Conference loudly protested Maduro’s edict granting the military full control of the nation’s food supply, objecting to the socialist government’s “constant preaching of hate, criminalization and punishment of all dissidents. ” The Conference also attempted to facilitate talks between the MUD and the government, on Pope Francis’s orders. After months of delays and a refusal by the government to release prisoners of conscience, the bishops sent the head of the government a private letter expressing “pain and concern” over “a disturbing delay in the adoption of necessary measures for the concrete application of the agreements. ” The Socialist Party’s    Diosdado Cabello responded by publicly calling the letter “disrespectful and irresponsible” after it leaked to international outlets. The MUD ultimately backed out of the Vatican talks, objecting to the Maduro government’s “arrogant and rude response  …     to the demands formulated in a letter from the Vatican. ”'"}, "time": 1742563269.136582}