{"duration": 1.1452507972717285, "input_args": {"text": "'Colson Whitehead has long had a thing for the metaphoric possibilities of mechanized modes of transport, the more   the better. His first novel, “The Intuitionist,” was set in the world of    Manhattan elevator repair. His sophomore effort, “John Henry Days,” geeked out on the tunnels dug by that mythic   man. But in his new novel, Mr. Whitehead grabs onto the most richly metaphoric conveyance of all: the Underground Railroad. That book, called simply “The Underground Railroad,” follows a    slave named Cora as she escapes north via a literal network of underground tracks and trains. The novel had generated the biggest buzz of Mr. Whitehead’s career, even before Oprah Winfrey revealed on Tuesday that she had made it her latest book club pick. [ Michiko Kakutani’s review of “The Underground Railroad” ] Mr. Whitehead, 46, may be used to great reviews and enviable prizes, like the MacArthur Fellowship, the   genius grant, which he received in 2002. But a few days before Ms. Winfrey’s announcement, he seemed a bit dazed by his impending ride into a bigger spotlight. “I’m having a hard time wrapping my head around how people are responding to the book,” he said during an interview in his home office in Greenwich Village. “I’m someone who just likes being in my cave and thinking up weird stuff. ” “The Underground Railroad”  —   published by Doubleday, with a first print run of 200, 000 copies  —   is written in a more straightforwardly realist mode than many of Mr. Whitehead’s books, which have tended toward   premises, extended set pieces and jokey riffs. It begins with a harrowing depiction of life on a Georgia plantation around 1850, before taking off on a suspenseful journey through several different states with social systems that mash up racial terrors from decades far into the future. There is Whiteheadian weirdness  —   hints of strange eugenics experiments Friday night lynchings staged like vaudeville shows and a kitschy “living history” museum, where Cora   a sugarcoated version of plantation life  —   but it creeps in slowly, with a subtlety that may send some readers to Google to check their memories of high school history. “I went back and reread ‘100 Years of Solitude,’ and it made me think about what it would be like if I didn’t turn the dial up to 10, but kept the fantasy much more  ” he said. “I wanted it to be like the slave narratives I read, where you get a very    contemplation of all these weird and horrible things that keep happening. ” The idea for the book came to Mr. Whitehead around 2000, when he had just finished “John Henry Days. ” “I had the thought, ‘What if the Underground Railroad were a real train? ’” he said. “I sat on the couch, thinking about it, but it seemed like it would require a lot of real research, and I just wasn’t up to it. ” Instead, he wrote a string of very different books, including a nostalgic    novel (“Sag Harbor”) a   zombie thriller (“Zone One”) and a   account of competing in the World Series of poker (“The Noble Hustle”). In the poker book, Mr. Whitehead, who had recently gone through a divorce, styled himself as a hyperactively wisecracking depressive who had a good poker face because, as he put it in the first line, “I am half dead inside. ” In person, he comes off as friendly but guarded, and wary of the expectations put on an   writer who publishes a big book about race and freedom in the era of Black Lives Matter. He mentioned a bookstore owner from the South who invited him to come down for “a frank talk about race. ” “I’m honored by the response to the novel, but I was like, ‘Can we just talk about the book? ’” he said. “I’m not a representative of blackness, and I’m not a healer. ” Still, he describes “The Underground Railroad,” which he began in earnest in the spring of 2014, as responding to a kind of inner pull. He was about to start another book with another “existential black dude narrator,” as he put it, but the Underground Railroad idea kept coming to mind. “I thought, why not write the book that really scares you?” he said. Mr. Whitehead dived into the subject, reading classic   slave narratives like Harriet Jacobs’s “Incidents in the Life of a Slave Girl” and oral histories of former slaves gathered by the Works Progress Administration  in the 1930s. Above his desk, next to an   menu board with   letters reading “Next  —   The Underground Railroad,” is a   library with scholarly works by Eric Foner and Edward Baptist, Toni Morrison’s “Beloved,” a historical dictionary of   slang and Michelle Alexander’s “The New Jim Crow. ” After he’d written 100 or so pages of the novel, he let himself watch the movie “12 Years a Slave,” but turned it off in the middle. “Seeing the movie really devastated me,” he said. “I could read about slave atrocities for days and days, but watching actors go through it was almost too much. I felt really messed up about what I was writing. ” Where books like “John Henry Days,” which centers on a cheesy festival celebrating a new John Henry postage stamp, have looked at the past through a distancing ironic lens, “The Underground Railroad” goes right into the heart of the   historical experience. “Reading the book, I thought, he’s written his ‘Beloved,” said the poet and critic Kevin Young, who has been close with Mr. Whitehead since their undergraduate days at Harvard. “He really conjures up the ghost of slavery and embodies it in a way that is deeply historically accurate. But the book also has these amazing leaps of imagination that help us think about slavery not just in the past, but in the present. ” Mr. Whitehead, who is married to Julie Barer, a literary agent, grew up in Manhattan, where his parents ran an executive recruiting firm. He went to mostly white private schools, but spent summers in an   beach enclave in Sag Harbor, N. Y. (the inspiration for the novel) where his maternal grandfather, who owned a chain of funeral homes in New Jersey, built a house from materials he hauled out each weekend in his car. Mr. Whitehead said he knew little about his own ancestors’ experiences in slavery. His mother’s family, he said, had included free black tavern owners in Virginia. His father’s family was in Florida by the early 20th century, but how it got there was largely lost “in the mists of time. ” Having children of his own  —   his daughter is 11, his son almost 3  —   made slavery more viscerally, and sometimes terrifyingly, real. “Thinking about the loss of a child, about how my own children would feel if they saw me beaten to death in front of them, made writing this book very different than it would have been if I had tried it when I was 30,” he said. Mr. Whitehead has generally not been one for   celebration of   heroes. He and a friend once played around with a satirical website called Nat Turner Overdrive. The day after Barack Obama’s election in 2008, he published a riff of an   in The New York Times hailing it as a historic victory for “Skinny Black Guys” like Sammy Davis Jr. Michael Jackson and himself. In “The Underground Railroad,” he talks about racial progress, and its limits, in a more direct, even prophetic way. Near the end, a character is seen heading for St. Louis  —   or, perhaps, Ferguson, Mo.   readers might find themselves thinking. Mr. Whitehead said he saw his closing pages as optimistic, but also realistic. “I find the last pages very hopeful,” he said. “But still, wherever we go, we’re still in America, which is an imperfect place. That’s the reality of things. ”'"}, "time": 1742563030.973089}