{"duration": 0.033385276794433594, "input_args": {"text": "'Militarized Police Shot Journalist At Standing Rock During An Interview Please scroll down for video \\nScenes at Cannon Ball in North Dakota are turning increasingly ugly as peaceful protestors continue to clash with riot police and the National Guard. The protest concerns the planned drilling in the area to build a gas pipeline. \\nThe Standing Rock Sioux tribe have spoken out against the plans as they will run through a sacred burial ground in violation of Native American treaties. They have found support and partnership with environmental activists who do not believe that the United States government should be creating new fossil fuel infrastructure. Militarized police tactics escalate at Standing Rock \\nDespite the fact that the United Nation has called on the American government to cease construction, the government shows no signs of abating their plans. Instead, they have turned their attention to a brutal crackdown on the protestors. According to a journalist, an activist Erin Schrode, protestors have been maced, beaten with batons, subject to Taser fire and been shot with rubber bullets. \\nI can’t believe what is happening here in Standing Rock. It’s a scene like I’ve never seen anywhere else in the world, and it’s right here at home. \\nSchrode herself had conducted an interview on camera when she was shot with a rubber bullet. In a post on her Facebook profile, she claims that while she was physically unhurt, she was shaken by the attack and simply could not understand why she had been targeted in such a violent way. In an interview with Fusion she said; \\nI couldn’t fathom that I’d just been hit. Why would they target me? Why would they shoot anyone? There was absolutely nothing violent, aggressive, provocative going on at the protests yesterday. \\nThis entire disturbing incident was caught on camera which Schrode has shared on her Twitter feed. The full video can be viewed here: \\nThe use of rubber bullets for crowd control has been outlawed in most places in the developed world owing to the number of fatalities and serious injuries they caused when deployed in the long-running conflict in Northern Ireland. Their use in situations without the threat of serious violence is practically unheard of. But despite this unprecedented level of police brutality, the protestors at Standing Rock are not intimidated and will refuse to leave the protest site until construction has ceased or they are forced off the land . \\nThis article (Militarized Police Shot Journalist At Standing Rock During An Interview) is free and open source. You have permission to republish this article under a Creative Commons license with full attribution and a link to the original source on Disclose.tv Related Articles'"}, "time": 1742628364.292903}