{"duration": 0.09692001342773438, "input_args": {"text": "'By Reuters   6:34 pm Democrat Hillary Clinton\\'s top aides on Saturday lashed out at FBI Director James Comey for igniting a new controversy over a long-running private email investigation less than two weeks before the presidential election, saying there was no evidence of wrongdoing and accusing him of spreading \"innuendo.\"   \\nBy Roberta Rampton and Steve Holland \\nDAYTONA BEACH, Fla./GOLDEN, Colo. (Reuters) – Democrat Hillary Clinton’s top aides on Saturday lashed out at FBI Director James Comey for igniting a new controversy over a long-running private email investigation less than two weeks before the presidential election, saying there was no evidence of wrongdoing and accusing him of spreading “innuendo.” \\nComey, who has headed the Federal Bureau of Investigation since 2013, notified the U.S. Congress on Friday that the agency is again reviewing emails, even though in July it decided not to seek prosecution of Clinton for her handling of classified materials on a private email server while she was secretary of state. \\nJohn Podesta, who heads Clinton’s presidential campaign, told reporters that Comey’s letter to Congress was “light on facts, heavy on innuendo,” and he urged Comey to “come forward and give those answers to the American public” about the exact nature of the FBI’s latest review of emails. \\nSources close to the investigation on Friday said the latest emails were discovered as part of a separate probe into Anthony Weiner, the estranged husband of top Clinton aide Huma Abedin. \\nWeiner, a former U.S. congressman from New York, is the target of an FBI investigation into illicit text messages he is alleged to have sent to a 15-year-old girl in North Carolina. \\nWith the Nov. 8 elections quickly approaching, Republican presidential candidate Donald Trump pounded away at the new FBI development, devoting a large part of a campaign speech in Golden, Colorado, to attacking Clinton and arguing that she is not to be trusted with the presidency. \\n“Her criminal action was willful, deliberate, intentional and purposeful,” Trump said, standing in front of hay bales stacked in a horse barn. “Hillary set up an illegal server for the obvious purpose of shielding her illegal actions from public disclosure and exposure.” \\nComey, however, has not provided any details on whether the emails now under review are being seen for the first time by the FBI or the nature of their contents. \\nClinton’s campaign tried to play down the new review. “There’s no evidence of wrongdoing, no charge of wrongdoing,” Podesta said, in the FBI’s latest announcement that it was taking “appropriate investigative steps” after learning of emails “that appear to be pertinent” to the earlier probe. \\nClinton campaign manager Robby Mook, trying to tamp down speculation of a voter backlash this late in the campaign, said Americans had already “factored” what they knew about the email investigation into how they would cast their ballots. \\n“We don’t see it changing the landscape” for undecided voters, Mook said. \\nClinton aides also said this latest controversy has further energized her supporters. \\nClinton was campaigning in Florida on Saturday, a battleground state that many analysts say Trump must win in order to have any chance of being elected. \\nIn recent weeks, Trump has been running behind Clinton in most public opinion polls. \\nJustice Department officials, according to a source who asked not to be identified, were opposed to the FBI director’s letter being sent to Congress and believe his actions conflict with a Justice Department memo outlining instructions that agencies should not to act in ways that could influence elections. \\nWhile Attorney General Loretta Lynch did not discuss the matter directly with Comey, the source said aides were in touch with each other. \\nComey let it be known he felt he had to send the letter as a follow-up to his congressional testimony earlier this year regarding the FBI’s probe of Clinton’s emails, the source said. \\nMeanwhile, Clinton supporters rallied to her defense following Friday’s FBI disclosure. \\nThe Congressional Black Caucus, comprised of about 45 members of the House of Representatives, nearly all Democrats, held a news conference in Columbus, Ohio, and urged Comey to release more details. \\n(Reporting by Steve Holland in Golden, Colorado, ans Roberta Rampton in Daytona Beach, Florida; Additional reporting by Mark Hosenball in Washington; Writing by Richard Cowan; Editing by James Dalgleish and Leslie Adlerand Leslie Adler) \\nClinton campaign urges FBI to detail new developments in email case added by Reuters on Sat, Oct 29th, 2016'"}, "time": 1742563750.8854957}