{"duration": 0.029695987701416016, "input_args": {"text": "'WASHINGTON  —     Donald J. Trump has offered the position of secretary of the interior to Montana’s freshman representative, Ryan Zinke, a former Navy SEAL commander, two officials familiar with Mr. Trump’s decision confirmed on Tuesday. The appointment of Mr. Zinke would round out Mr. Trump’s choices to lead the four agencies that will shape the future of the nation’s energy and climate change policies. Last week, he named Scott Pruitt, the Oklahoma attorney general who has built a career out of suing the Environmental Protection Agency, to lead that office. On Tuesday, transition officials said he would name Rick Perry, the former Texas governor who vowed to eliminate the Energy Department, to run that agency. Mr. Trump has also chosen Rex W. Tillerson, the chief executive of Exxon Mobil, to head the State Department, which negotiates international climate change agreements. Mr. Zinke, 55, called Hillary Clinton “the Antichrist” as he campaigned for the House in 2014. Asked that year about the established science of   climate change, Mr. Zinke was quoted in the Billings Gazette, a Montana newspaper, as saying, “It’s not a hoax, but it’s not proven science either. ” Scientists overwhelmingly hold that   climate change is proven. Mr. Zinke was an early supporter of Mr. Trump. His wife, Lolita, is on Mr. Trump’s transition team for the Department of Veterans Affairs. In some ways, Mr. Zinke appears to be an incongruous choice to lead the agency that oversees energy exploration on the nation’s public lands and waters. As interior secretary, Mr. Zinke would be charged with carrying out the aggressive   agenda that Mr. Trump championed on the campaign trail. Mr. Zinke has spent most of his life in the military, and he ran for office largely on a national security platform. He played football at the University of Oregon and earned a degree in geology before joining the Navy. He later became a member of the SEALs. He has served in Iraq, Bosnia, Kosovo and the Pacific. His autobiography, “American Commander,” was published recently. Mr. Zinke conforms with Mr. Trump’s love of military figures. He would join two retired generals, John F. Kelly and James N. Mattis, in the cabinet. Another, Lt. Gen. Michael T. Flynn, has been named national security adviser. Mr. Zinke would be a continuation of the long tradition of interior secretaries from western states, where the agency oversees millions of acres of federal lands. A   Montanan who grew up in Whitefish, a small railroad and logging town, he has defended keeping the nation’s public lands in federal hands, saying he would never advocate their sale or transfer. But he has also been a staunch advocate of mining and logging on those lands. He has also consistently voted in favor of maintaining the Land and Water Conservation Fund, which is funded by royalties from oil and gas exploration on public lands but intended to preserve other natural habitats. Mr. Trump hopes his interior secretary will reverse the Interior Department’s role under President Obama, who used the agency to advance his climate change, land conservation and renewable energy agenda. Under Mr. Obama’s interior secretary, Sally Jewell, the department put forward plans to block oil and gas drilling on expanses of public land and water, freeze new leases for coal mining on public lands, and promote the development of renewable energy on federal property. Mr. Zinke would have the authority to reverse most of those initiatives, although some changes could take as long as three or four years to put in effect. Environmental groups said they feared that Mr. Zinke would be prepared to carry out Mr. Trump’s agenda. “Though Mr. Zinke has expressed support for the Land and Water Conservation Fund and opposes the sale of public lands, he has prioritized the development of oil, gas and other resources over the protection of clean water and air, and wildlife,” said Theresa Pierno, president and chief executive of National Parks Conservation Association. “Mr. Zinke has advocated for state control of energy development on federal lands, a move that threatens our national parks. ” But his confirmation could help Democrats in the Senate. Senator Jon Tester of Montana is one of 10 Democrats up for   in 2018 in states carried by Mr. Trump. If the Interior post suits Mr. Zinke, Mr. Tester has lost a formidable challenger.'"}, "time": 1742628473.5431964}