{"duration": 0.03185129165649414, "input_args": {"text": "'Dilbert creator Scott Adams announced in a blog post that he will stop donating to this alma mater, UC Berkeley, in the aftermath of the riots that erupted on campus last week in response to a scheduled event featuring Breitbart editor MILO. [Adams, who earned an MBA degree at UC Berkeley, announced that he is terminating his support of the public institution over concerns that he wouldn’t “feel safe or welcome on campus. ”  Speaking of Hitler, I’m ending my support of UC Berkeley, where I got my MBA years ago. I have been a big supporter lately, with both my time and money, but that ends today. I wish them well, but I wouldn’t feel safe or welcome on the campus. A Berkeley professor made that clear to me recently. He seems smart, so I’ll take his word for it. I’ve decided to side with the Jewish gay immigrant who has an   boyfriend, not the hypnotized   in black masks who were clubbing people who hold different points of view. I feel that’s reasonable, but I know many will disagree, and possibly try to club me to death if I walk on campus. Adams writes that a Berkeley professor “made it clear” to him that he wouldn’t be welcome on campus due to his political beliefs. In July 2016, Adams regularly placed a disclaimer at the bottom of his blog posts which claimed that his endorsement of Hillary Clinton was made out of concern for his personal safety. Note: I endorsed Hillary Clinton  —   for my personal safety  —   because I live in California. It isn’t safe to be viewed as a Trump supporter where I live. My politics don’t align with either candidate, but backing Clinton reduces my odds of dying at the hands of my fellow citizens. (And yes, I am 100% serious. It just happens to be funny by coincidence.) Adams frequently praised President Trump during his run for the White House and was one of the few public figures who predicted his victory.'"}, "time": 1742561771.113283}