{"duration": 0.10346627235412598, "input_args": {"text": "'After a yearslong wait, compounded by additional delays and   feints, the   often inscrutable RB singer Frank Ocean managed to deliver more than one new album. The first, a streaming   “visual album” titled “Endless,” was released late on Thursday via Apple Music. It was followed on Saturday by two other ambitious projects:   shops in four cities  —   Los Angeles, New York, Chicago and London  —   that handed out free copies of Boys Don’t Cry, an elaborate art magazine created by Mr. Ocean and “Blonde,” a   LP by the singer released on Apple Music, as a stream and paid download. At its center, the magazine also contained a CD version of the new album. In a note on his personal Tumblr blog, Mr. Ocean’s preferred mode of communication with his fans, he wrote: “I had the time of my life making all of this. Thank you all. Especially those of you who never let me forget I had to finish. Which is basically every one of y’all. ” “Blonde,” the   to Mr. Ocean’s   2012 debut, “Channel Orange,” had been one of the most anticipated albums of the year  —   and various delays only added to the expectations. He teased that “Boys Don’t Cry” (initially thought to be the name of both his second album and the magazine) would be released in July 2015. Then, the album had a tentative release date of Aug. 5. Mr. Ocean poked fun at his own lateness with an image on his website of a library   slip with multiple dates crossed out. The subsequent delivery of “Endless,” which featured    footage of Mr. Ocean working in a warehouse, set to a continuous flow of 18 perplexing new songs, raised more questions than it answered, and it was not available for download Apple promised “more from Frank” over the weekend. (On Saturday, in the early morning hours, an additional video for the song “Nikes” also appeared on Apple Music.) “Blonde,” which is spelled “Blond” on the album cover and “Blonde” on Apple and elsewhere, hews more closely to what was expected from a sophomore release by one of the most lauded and enigmatic young singers in pop music. Songs titles include “Pink + White,” “Be Yourself,” “Facebook Story” and “White Ferrari. ” Mr. Ocean’s accompanying glossy magazine lists   album contributors including André 3000, James Blake, Jamie xx, Kanye West, Beyoncé, Kendrick Lamar, Pharrell Williams, Rick Rubin and more. In Manhattan on Saturday, the line to get into Mulberry Iconic Magazines, on the corner of Mulberry Street and Kenmare Street, stretched more than a block just after 7 p. m. Inside the store, the essence of a standard New York bodega remained  —   chips, soda, detergent and so on were still for sale  —   but the shelves also had been stocked with copies of the magazine Boys Don’t Cry in a sealed reflective wrapping. With only a few patrons allowed entry at a time, fans browsed leisurely, helping themselves to one of three editions of the oversized publication (only the covers varied). Among the features inside: an interview with Mr. Ocean’s mother a conversation between Mr. Ocean and the outré rapper Lil B lyrics to the songs on “Blonde” and plentiful photos of sports cars, long an obsession of Mr. Ocean’s. The newest of his new albums played over Sonos speakers that had been installed in the shop. Decals bearing the name of the album and the magazine emphasized the takeover of the ordinary space  —   there was “Blonde” and “Boys Don’t Cry” on the beer refrigerators, the cigar cases, even the deli counter. The everyday essentials, while providing an authentic backdrop, could only be overshadowed.'"}, "time": 1742561918.724559}