{"duration": 0.08349490165710449, "input_args": {"text": "'  Carol Adl in Middle East , News // 0 Comments \\nAmnesty International have received credible witness and photographic evidence of white phosphorus projectiles exploding in the air over an area about 20 kilometres east of the Iraqi city Mosul. Evidence white phosphorus used in area near Mosul, Iraq posing deadly risk to civilians fleeing the fighting https://t.co/TWuLGbokS0 pic.twitter.com/BVROVe91i1 \\n— AmnestyInternational (@AmnestyOnline) October 28, 2016 \\nThe human rights watchdog has urged the Iraqi government and US-backed coalition not to use white phosphorus in the vicinity of Mosul, warning of devastating health consequences for civilians who are trying to flee the ISIS held city. \\nUS forces were reported to be using white phosphorus recently in Iraq, though they insist they’d only done so in ways consistent with their interpretation of international law. \\nWhite phosphorus is an incendiary substance which burns at extremely high temperatures upon exposure to air and is legally used both for smoke screens and for illumination in war zones. Its use in areas where civilians are present is however, considered a war crime. \\n“White phosphorus can cause horrific injuries, burning deep into the muscle and bone. It is possible that some of it will only partially burn and could then reignite weeks after being deployed,” said Donatella Rovera, Senior Crisis Response Adviser at Amnesty International. \\nRT reports: \\nWhile alleging that Assyrian population of Karemlesh had fled the advance of the Islamic State (IS formerly known as ISIS/ISIL) terrorists in August 2014, Amnesty pointed out that during the operation to free Mosul, refugees fleeing towards Erbil will be forced to pass through the contaminated area. \\n“We are urging Iraqi and coalition forces never to use white phosphorus in the vicinity of civilians. Even if civilians are not present at the time of its use, due to the residual risks they should not use airburst white phosphorus munitions unless it is absolutely necessary to achieve military objectives which cannot be accomplished through safer means,” Rovera said. \\nExamining photographs taken by a New York Times photographer on October 20 and then interviewing him, Amnesty could not definitively conclude which forces used the white phosphorus munitions. \\n“It is not clear whether the projectiles were fired by Iraqi central government forces, Peshmerga forces of the Kurdistan Regional Government (KRG), or forces belonging to members of the US-led coalition,” Amnesty said. \\nBut the NGO did conclude based on the photographic evidence that the explosion dispersal pattern “appears consistent with the US-made 155-mm M825A1 projectile, which ejects 116 felt wedges containing white phosphorus over an area between 125 – 250 meters wide.” \\nThe watchdog called on the forces in the area not to use the highly-dangerous weapon or at the very least inform populations about the areas where it was used. \\n“It is absolutely imperative that the forces using white phosphorus publicize details of areas potentially contaminated by the substance, to minimize the risk of accidental harm to civilians,” said Rovera. \\nIraqi and Kurdish forces, supported by the US-led international coalition launched an operation to retake Mosul on October 17. The fighting since then displaced an estimated 100,000 people, while up to 1.5 million people remain trapped in Mosul. \\nJihadists have taken “tens of thousands” civilians hostage and are herding them towards the city of Mosul to use as human shields, the United Nations warned earlier. \\n“Credible reports suggest that ISIL has been forcing tens of thousands of people from their homes in sub-districts around Mosul and have forcibly relocated numbers of civilians inside the city itself since the operation began on the 17th of October to restore Iraqi government control over Mosul,” said UN human rights spokeswoman Ravina Shamdasani on Friday.'"}, "time": 1742564412.6258335}