{"duration": 0.1904757022857666, "input_args": {"text": "'Good morning.  Here’s what you need to know: • China warned of a nuclear arms race after the U. S. began delivering parts of an advanced missile defense system, known as Thaad, to South Korea. It’s meant to counter the growing threat from North Korea, but China fears that such systems could encourage U. S. consideration of a first strike to destroy the relatively small Chinese nuclear arsenal. The tensions are creating a difficult balancing act for the Trump administration. _____ • WikiLeaks’ latest release, if confirmed, would rock the technology world and deliver a serious blow to the C. I. A. The   Vault 7 documents offer details of C. I. A. hacking tools used to break into smartphones, computers and even   televisions. Entirely compromised smart phones yielded the contents of encrypted messaging apps like Signal and WhatsApp. WikiLeaks said the source was raising policy questions that “urgently need to be debated in public. ” Here’s a look at how vulnerable your smartphone might be to hacking. _____ • One of India’s biggest foreign charities, Compassion International, is closing operations in the country, the latest and most prominent victim of the Modi government’s crackdown on outside aid groups. Like more than 11, 000 other nongovernmental agencies, the   Christian group had been blocked from access to foreign funds. Above, one of 500 partner groups that will be forced to shut down. _____ • More than 330, 000 acutely malnourished children, 3. 3 million people in need of medical care, 7, 731 cases of cholera. The U. N. secretary general, António Guterres, listed data points of desperation as he visited Somalia to make an urgent appeal for $825 million in aid for about half the population. • President Trump and his allies have for years accused China, Japan and others of protectionism. Our correspondents analyze that claim and what the Trump administration might do to reduce the U. S. trade deficit, which rose 9. 6 percent in January to a   high. • ZTE, the Chinese tech giant, agreed to pay the U. S. $1. 19 billion for selling electronics to North Korea and Iran, the largest criminal fine in a U. S. sanctions case. • China releases trade data for February, and Japan announces its regular G. D. P. revision. • Beijing’s $300 billion plan to make China   in a range of industries, from planes to computer chips to electric cars, is raising alarm among international companies. • Almost half of Masayoshi Son’s $100 billion SoftBank Vision Fund is made up of Saudi money, prompting our financial columnist to urge a broader discussion of the fund’s plans to invest $50 billion in the U. S. • Saudi Arabia’s oil minister said the initial public offering of   Saudi Aramco was on track for 2018. The Saudis plan to offer 5 percent of the company, which could raise $20 billion to $100 billion, but questions remain about transparency, privatization and  . • Wall Street was lower, but oil was up. Here’s a snapshot of global markets. • Iraqi forces pushed into western Mosul, retaking a major bridge and a ransacked archaeological museum from the Islamic State. [The New York Times] • Thirty people were killed in Myanmar’s Shan State when Kokang rebels attacked a hotel, casinos and police and army posts near the Chinese border. [The New York Times] • Australia’s highest court hears a constitutional challenge to the government’s practice of detaining asylum seekers who are sent to the country from offshore camps for medical treatment. [The New York Times] • Australian police officers in Queensland saved a British woman who had been held captive by a former boyfriend for months. [The New York Times] • A new study put the number of   people living in other countries as of 2015 at 15. 6 million, or one in every 20 global migrants. The top destinations: the United Arab Emirates and Pakistan. [Quartz] • Germany and Turkey have been trading barbs over free speech as campaigning heats up ahead of a Turkish referendum that could expand the powers of President Recep Tayyip Erdogan. Some 1. 5 million Turks living in Germany are eligible to vote. [The New York Times] • Traffic signs of pedestrians in dresses, part of a gender equality campaign in Melbourne, Australia, are getting a mixed reception. [BBC] •  “Real life”     textbooks for Chinese primary schools set off intense debate over their depictions of genitalia, couples having sex and homosexuality. [South China Morning Post] • Kyle Higashioka, a catcher for the New York Yankees, grew up a quintessential Californian. He’s begun to explore his family’s roots  —   by learning to speak Japanese. [The New York Times] • Do you eat before you exercise in the morning? It might be worth reversing that order. • Readers responded to a touching essay by a writer who, after learning she will soon die, composed a dating profile for her husband. • Recipe of the day: Will your St. Patrick’s Day be far from a New York deli? Making your own corned beef takes just a little planning. • Paris Fashion Week is almost over. Then there’s Tokyo. Shanghai. Australia. It seems as if every country now has a fashion week  —   or two, like Kazakhstan, or three, like Indonesia. Above, last year’s Lagos Fashion Week, in Nigeria. • And indulge  your escapist fantasies with this year’s U. S. News  World Report survey of the best countries in the world. Switzerland took the top spot and Japan came in fifth. The best country for retirees was New Zealand, followed by Australia. Today, for International Women’s Day, let’s see which country tops the list of female representation in Parliament. Rwanda. Out of 80 seats in the lower house, 49 are held by women (61 percent) as are 10 of the 26 in the upper house (38 percent) according to an international organization of parliaments. Since 2003, the country has required that at least 30 percent of representatives be female. Next: Bolivia, where a 2009 measure requires women to occupy at least 50 percent of elected positions. Women now hold 69 of the 130 seats in the lower house (53 percent) and 17 of 36 in the upper house (47 percent). Cuba, in third, uses “positive discrimination,” putting women in almost half the seats in the National Assembly. Iceland, Nicaragua, Sweden, Senegal, Mexico, Finland and South Africa fill out the top 10. The U. S. is No. 104, with 83 women out of 435 representatives and 21 of 100 senators. “The size of your dreams must always exceed your current capacity to achieve them,” the Liberian president, Ellen Johnson Sirleaf, told a Harvard graduating class in 2011. “If your dreams do not scare you, they are not big enough. ” Caryn A. Wilson contributed reporting.  _____ Your Morning Briefing is published weekday mornings and updated online.  What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742563504.618566}