{"duration": 0.043593406677246094, "input_args": {"text": "'By Michael Hayne Election 2016 , News , Politics October 28, 2016 Paul Ryan’s Plan To Use Bernie To Scare Voters Blew Up In His Face And Bernie Can’t Stop Laughing   \\nThe 2016 election continues to be the weirdest, dumbest, and most contentious presidential race in ages. But the one saving grace and glimmer of hope amid this Category 4 sh*tstorm is the idea of an empowered Senator Sanders. \\nA week ago, House Speaker Paul Ryan made the fatal mistake of using Bernie Sanders as a scare tactic to ensure that Congress remains in Republican hands. At a gathering of Young Republicans, Ryan implored Republicans to take the polls on Election Day in order to stop the scary “ liberal progressive” agenda. Ryan punctuated his warning by saying “ If we lose the Senate, do you know who becomes chair of the Senate Budget Committee? A guy named Bernie Sanders. You ever heard of him?” \\nWell, that single statement appears to have totally blown up in his face. \\nIt’s not yet clear if the populist and beloved Senator from Vermont would chair the Senate Budget Committee should Democrats take back the Senate, but what is clear is that Bernie Sanders is cashing in on Ryan’s comments. Paul Ryan said if Republicans lose the Senate, a guy named Bernie Sanders becomes Budget Committee Chair. Sounds like a plan! #ThanksPaul \\n— Bernie Sanders (@BernieSanders) October 24, 2016 \\nHoping to convince the intractable “Bernie or Bust” crowd that a Democratically-controlled Senate is the best way to carry out his very progressive agenda, Sanders implored his 3.76 million followers to donate to Democrats. The Sanders team went so far as launching a “We Heard You Paul!” appeal to small donors. And it’s working–insanely well. \\n“Let’s thank Speaker Ryan for helping us raise $2.4 million this week from 500,000 contributions and show everyone how powerful the political revolution still is by using the hashtag #ThanksPaul across all social media channels today,” the Sanders camp announced Monday. \\nSanders is in this thing for the long run and has no intention of slowing down anytime soon. The only way to ensure Ryan’s threat becomes a reality is turning the Congress blue. \\nFeatured image via Alex Wong and Mark Wilson / Getty Share this Article!'"}, "time": 1742561965.3444083}