{"duration": 0.016047000885009766, "input_args": {"text": "'On Friday, FBI Director James Comey informed Congress that the FBI was reopening the Hillary Clinton email investigation due to the discovery of new emails. The emails were reportedly discovered by the FBI while investigating former Congressman Anthony Weiner for possibly illegal sexting with someone under 18.\\nThe emails were contained on Weiner’s laptop and are connected to Hillary Clinton via Weiner’s wife, Huma Abedin. Abedin is one of Clinton’s closest advisors and she apparently did not make the laptop available during the initial investigation which ended in July and exposed that Hillary Clinton had continually lied about her email practices. \\nDue to the timing of Comey’s update in relation to the election, the Clinton campaign has gone into full attack mode against the FBI director. But reports now show the Obama Administration’s Department of Justice had been pressuring the FBI to go easy on Clinton for some time, even to the point of causing an internal revolt within the FBI.\\nComey may have updated Congress to avoid his own staff leaking the information to the press ahead of him, as numerous agents have taken issue with the decision not to make a criminal referral in the email case and the Justice Department’s attempts to weaken investigations into the Clinton Foundation.\\nSo, is Obama’s DOJ working for the Clinton campaign?\\nWell, a new email published by Wikileaks would appear to answer that question in the affirmative. On May 19, 2015, Clinton campaign spokesman Brian Fallon emailed Hillary Clinton: \\nDOJ folks inform me there is a status hearing in this case this morning, so we could have a window into the judge’s thinking about this proposed production schedule as quickly as today.\\nFallon, who previously worked at the Department of Justice, apparently is coordinating with “DOJ folks” on the Clinton campaign. He is telling Hillary Clinton, in an email chain that includes Clinton lawyer Cheryl Mills and Abedin, about a court hearing related to Clinton’s emails that he was informed of by allies that work at the Department of Justice.\\nIt appears that political appointees like Attorney General Loretta Lynch and others at the Justice Department put pressure on the FBI to protect the Clinton campaign. The question is, how far did the coordination go?\\nThe post Leaked Email Shows Department of Justice Coordinating With Clinton Campaign appeared first on Shadowproof .\\n'"}, "time": 1742628510.0157669}