{"duration": 0.050318241119384766, "input_args": {"text": "\"Media Claim Trump Transition Chaos. Trump's Way Ahead of Schedule. By: Ben Shapiro November 18, 2016 \\nThe media, desperately in search of a narrative to cast the incoming Trump administration as dangerously incompetent, are once again overplaying their hands. Instead of focusing on the nepotistic fact that Trump relies heavily on his son-in-law, Jared Kushner, and his daughter, Ivanka – he invited them to a state meeting with Japan – they’re trying to claim that he just isn’t moving fast enough on appointments. \\nThat’s nuts. \\nBarack Obama didn’t name his picks for Secretary of State, Defense, or Attorney General until December 1, nearly a month after the November 4, 2008 election. George W. Bush didn’t name his picks for State, Defense, or Attorney General until mid-December (December 16 for Colin Powell, December 28 for Donald Rumsfeld, December 22 for John Ashcroft). Bill Clinton didn’t name his picks for those positions until at least December 22. George H.W. Bush was the fastest off the mark – he named James Baker Secretary of State the day after the November 8 election. Ronald Reagan waited until December 11 to get started; Jimmy Carter waited until December 3. \\nWe’re still waiting on Trump’s State and Defense picks, but he’s already out of the gate with Senator Jeff Sessions for Attorney General. It’s November 17. \\nThe media are so eager to bury Trump’s administration that they are falling all over themselves to do so. Instead of soberly covering potential problems with top level picks – Steve Bannon, for example, is a rotten pick , but not because he’s a racist or anti-Semite – the media keep proclaiming THE END IS NEAR. This sort of alarmism doesn’t convince Americans, who don’t really see why there’s any giant rush to appoint people who aren’t going to be formally considered by the Senate until January 20 anyway. \\nIf this election was about repudiation of the media – and it was – the media aren’t doing themselves any favors when they promulgate fact-free narratives while simultaneously attempting to label conservative outlets “fake news.” For years, Americans have assumed that the leftist media are ladling them fake news each day. Each day, the media seem determined to prove them right. Tags \""}, "time": 1742561978.3119538}