{"duration": 0.03173685073852539, "input_args": {"text": "'Why did Satan-2 shock the West? 31.10.2016 The recent publication of images of Russia\\'s new intercontinental ballistic missile \" Sarmat \" created quite a stir in Western media. The Daily Mail, for example, terrified British readers with an article saying that the new Russian missile would be able to destroy England and Wales at once. The New York Post called the missile a \"devil in disguise\" which can easily reach New York City. The Daily Star published a map of the US East Coast designating the targets, which the missile could reach. The article even gives an approximate amount of victims (in millions за people). However, there were also skeptics. For example, Igor Sutyagin, a man, who had served nearly eleven years in Russia for espionage, and currently serves as a senior officer at the British Royal Institute for Defense Studies, believes that the new Russian Sarmat missile (Satan-2) is a fake. \"The design details are incorrect, and I doubt that this missile already exists in metal,\" he wrote, having analysed the photo of the missile. He then continued: \"The Russians want to tell the world: we are a great power, Fear us, and don\\'t ignore us.\" Print version Font Size As Pravda.Ru has reported before, the new missile is designed to replace the \"Voevoda\" complex (NATO reporting name \"Satan\"). Military analyst Alexander Perendzhiev told Politonline.ru that Russia did not have to prove anything to anyone. \"In the West, they pay a lot of attention on Russian armed forces. In principle, the current series of publications fits the current anti-Russian hysteria trend. I do not think there is any point in trying to prove whether the news about the missile was true or fake. It\\'s up to them to think and decide what we have and what we don\\'t have. Let the debate begin. There is no point to prove anything here. Russia has to take care of its own security and give either proportional or asymmetrical, yet effective responses, in case something happens. In any case, we show that we are working. At times, we need to warn them, so that they understand that our intentions to defend our own security are serious.\" Politonline'"}, "time": 1742561976.1282747}