{"duration": 0.06580042839050293, "input_args": {"text": "\"Did Trump TV Just Get Axed Before It Even Hits The Air? By Darrell Lucus   \\nFor much of the summer and fall, there’s been talk that if Donald Trump loses to Hillary Clinton, he will launch a right-leaning cable news channel. Well, it turns out someone may have just axed this latest Trump deal before it even got off the ground. The trademark for the network’s most likely name has already been snapped up –by of all people, a Democrat. \\nEarlier this week, the Trump campaign launched a live newscast on Trump’s Facebook page, complete with guests. The campaign branded it as “TrumpTV,” leading to speculation that it was a test for a Trump-branded network. The Trump campaign has been mulling such a venture since the primaries . \\nHowever, they may have reckoned without Mark Grabowsky, a public health doctor from Manhattan and a lifelong Democrat. Grabowsky told Fortune magazine that he was watching on the debates when, purely at random, he did a search for “Trump TV”–and discovered that the trademark was still available. He filed copyright protection for it, jokingly describing it as a chance to “get Russian investment money, go bankrupt, take a big claim and not pay taxes.” \\nGrabowsky says he has no plans to actually launch a network, leading trademark expert Ann Ford to suggest that his claim could get axed by the U. S. Patent and Trademark Office. But this could still have the effect of pulling the plug on Trump’s planned network. If the trademark office decides not to award the trademark to Grabowsky, he would have six months to respond–possibly longer than that, if he strings out the process. \\nFord says that on paper, Trump would have an advantage in any trademark dispute given his fame, which gives him “a kind of superpower.” But if others file for the trademark before Trump can do so, it will make it that much more difficult for Trump to claim it. That could cost Trump valuable time spent on promoting his new network, as well as getting cable and satellite providers to carry it. \\nSo when all is said and done, one of the richest men in the world may have had his latest venture axed because he was slow on the draw to get the trademark locked up. That would be more than fitting, given how anemic Trump’s campaign has been at actually selling itself to voters. The cratering of Trump’s brand may have already started. \\n( featured image courtesy Michael Vadon, available under a Creative Commons BY-SA license) About Darrell Lucus \\nDarrell is a 30-something graduate of the University of North Carolina who considers himself a journalist of the old school. An attempt to turn him into a member of the religious right in college only succeeded in turning him into the religious right's worst nightmare--a charismatic Christian who is an unapologetic liberal. His desire to stand up for those who have been scared into silence only increased when he survived an abusive three-year marriage. You may know him on Daily Kos as Christian Dem in NC . Follow him on Twitter @DarrellLucus or connect with him on Facebook . Click here to buy Darrell a Mello Yello. Connect\""}, "time": 1742562083.4716125}