{"duration": 0.02957439422607422, "input_args": {"text": "'By wmw_admin on October 27, 2016 henrymakw.com — Oct 26, 2016 Fozdyke is usually wrong so Trump fans may rejoice at this prediction. As for the rest, I present it for those who have the interest and stamina to decipher. To the Memory of Peacocks & the Hyena King by Aloysius Fozdyke — (henrymakow.com) I’m loving the American presidential election, the Global Election Management System and fractionalized or fictionalized voting. All sizzle and no steak. One of the better smoke and mirrors shows. American presidents are selected not elected! The sheeple are so easy to fool there’s hardly any fun in it any more. Donald is two-faced and adult diaper Hillary is genital-centred and unwell. ‘Did you just soil yourself?’‘Sure! Do you think I smell this bad all the time?’ It doesn’t matter if every American votes for Donald Trump, because the results will give the election to Hilary Clinton. It’s about sizzle without the steak. We let the sheeple vote so that they feel they still have choices that matter. The outcome is irrelevant, provided that the sheeple feel that they’re contributing and that they still have choices. For what it’s worth, have a look at ‘fractional voting’. We’re so close to conquering and getting the only thing we’ve ever wanted – everything! And honestly, in return we give the masses what they want, which in truth isn’t much at all, just illusions. We give them choices between two predetermined political outcomes, but allow them to select from a myriad of supermarket junk foods, television programmes and glossy magazines, because that’s what they deserve – inconsequential options and diversions. The social crash will be after the American presidential elections – even if Trump wins, which he won’t. The media has conditioned the masses to the predetermined fact that Hilary will win and being placidly obedient, Americans will accept that result. It’s not like our people have to be careful any more. As my mentor used to say, ‘The Lord is my shepherd and eventually, like all good shepherds he will lead you to the slaughterhouse’. Being herd animals, sheeple want safety, not freedom. They want to work harder and longer for less and less. They already live in fear of their own governments while constructing their own prisons. ‘We the sheeple…’ Yeah, right! Right hand path spiritualities – like Xtianity – are suffering and death centred. So we will give you what you want: suffering and death. The third world war is what’s needed to bring Old Numb-Nuts back, with all his egregious double standards. And remember, he came not to bring peace, but a sword, so essentially we’ll continue giving the masses what they want – just like we always have. Enjoy! ESOTERIC SATANICA'"}, "time": 1742628533.9341428}