{"duration": 0.07664084434509277, "input_args": {"text": "'And You Thought the Silver Market was Rigged! Posted on Home » Headlines » Finance News » And You Thought the Silver Market was Rigged! \\nThe great irony will not be lost on precious metals investors… \\n\\nFrom Dr. Jeffrey Lewis : \\nWe live in a world where the yield-starved and tech-savvy conspire in the basement of the underground and unaccounted. While the rise of Bitcoin and the explosion of alternative currencies may become the new scapegoat of behavioral finance, there is nothing quite like the reality of trickle down finance gone wrong. \\nRecently, EU officials called for putting safeguards on Internet currency. \\nThe European Banking Authority called on the EU to develop safeguards for trading platforms. They were also called to start groups to oversee each Internet currency to ensure that no individual can manipulate the integrity of a particular virtual currency scheme and its key components. In the meantime, banks shouldn’t buy, hold or sell virtual currencies. \\nThey stated: \\n“European Union banks should shun virtual currencies such as Bitcoin until rules to prevent abuses are put in place, according to the Bloc.” \\nThis would be sad if it wasn’t so ironic. \\nIt is also ironic that one of the other excuses for regulation is that electronic currencies make it harder for regulators to “manage monetary policy”, which is one of the reasons for using alt currencies to begin with to avoid the unintended consequences of intervention. \\nThe key point is that media and the financial elite see the central banks as regulators and policy makers. \\nThe 100 year old central banking meme is still very much alive and well. \\nOn the surface, Bitcoin represents many things. To the precious metals inclined, it is often framed as an alternative or substitute. \\nBut it is better to view the phenomenon and an anonymous currency with market backing. \\nThe Bitcoin trading is well advanced. Not only do dozens of exchanges exist, but they are also functioning like their mainstream financial counterparts. \\nYes, similar equities and other paper trading vehicles borrowing Bitcoins is a robust and well entrenched phenomenon. Margin swaps run in excess of $25 million on a daily basis. \\nSpin-off currencies are an even more dramatic spectacle. Well in excess of 200 individual currencies, these “software code-backed” instruments are born on an almost weekly basis. Coders, the exchanges, and a handful of insiders collude on the rise and inevitable fall of these new alternative currencies. New crypto currency launches come equipped with the most advanced automated social media marketing tactics. \\nThe tactics used to launch a new currency are an extension of those pioneered by the penny stock ‘pump and dump’ phenomenon. At least the penny stocks have some form of backing — and not just code. \\nRegulation of these markets is a show. \\nFirst of all, regulators do not understand alt currencies anymore than they understand high frequency trading or algorithm. And secondly, while there is certainly a taboo associated with this, there really isn’t much money to go after. \\nIn addition, the rate in which these new currencies crash and burn (and the relatively small size of the pool) results in an odd form of self or market regulation. Alternative currencies beckon for their own form of backing. \\nBut speaking of justice and regulation… \\nIsn’t it ironic that any fuss should be made over these small markets, when a journey up the chain of modern finance reveals the same corruption and collusion – only worse? \\nWhen you consider that mainstream financial regulators are always one step from rotating into the banks they are charged with regulating, it becomes much easier to fathom the astounding degree of corruption. \\nAnd then there are the precious metals markets. \\nRegulators, exchanges, and a small handful of advantaged and well positioned players have access to the greatest ongoing pump and dump scheme imaginable. \\nIt makes what happens in the alt currencies seem like child’s play – which is some ways it is when you consider the average age of the typical coder copying and pasting the next program into the next new currency. \\nThe great irony will not be lost on precious metals investors. As the alt currency markets burn themselves out one by one before regulators have a chance to get close, the fuse has been lit on another (largely) limitless electronic experiment gone wrong. As the gold and silver pump and dump becomes recognized for the scam that it is, the desperate search for wealth will become apparent and too late for most.'"}, "time": 1742561720.0908804}