{"duration": 0.056072235107421875, "input_args": {"text": "'Posted on July 15, 2015 by Dr. Eowyn | 33 Comments \\nIt’s a topsy-turvy world when law-breakers — those who illegally enter and stay in the United States — are sacred cows, while those who criticize the law-breakers are ostracized and demonized. \\nOn June 16, 2015, when Donald Trump announced that he’s entering the crowded race to become the 2016 Republican presidential nominee, he made some remarks about illegal immigration which brought the wrath of the PC Left on his head. Trump said: \\n“When Mexico sends its people, they’re not sending their best. They’re sending people that have lots of problems. They’re bringing drugs. They’re bringing crime. They’re rapists. I will build a great wall – and nobody builds walls better than me, believe me – and I’ll build them very inexpensively. I will build a great, great wall on our southern border, and I will make Mexico pay for that wall. Mark my words.” \\nFor saying that, one business after another severed their ties with Trump. Univision and Comcast’s NBCUniversal cancelled plans to broadcast Trump’s Miss Universe beauty pageant. Mattress giant Serta said it will stop selling Trump-branded products. Department store giant Macy’s also cut its ties with Trump. \\nSuch righteous indignation! You would think Trump were a heinous mass murderer or a child-molester or serial rapist or bestialist! \\nBut Macy’s anti-Trump move has backfired. \\nTMZ reports, July 13, 2015: \\nMacy’s is paying the price for sacking Donald Trump, because we’ve learned thousands of customers are cutting up their Macy’s credit card in protest. \\nSources connected to the department store tell TMZ, Macy’s has received complaints from approximately 30,000 customers since ending its relationship with Trump nearly 2 weeks ago. \\nWe’re told the store has been “inundated with complaints” from customers who believe the department store is unfairly punishing Trump for his views on immigration. \\nOur sources say thousands of customers have vowed never to shop at Macy’s again and many of them say they’re cutting up their Macy’s credit card to make a statement. \\nWe’re told the complaints have come in various ways, including phone, Facebook and email. A Macy’s spokesperson would only say, “Our Facebook page is often times used by our customers to express their feelings or points of view. Many times it does not correlate to any action.” Join the boycott against Macy’s!'"}, "time": 1742563953.7155626}