{"duration": 0.15565252304077148, "input_args": {"text": "'   France  —   The National Front’s leafleteers are no longer spat upon. Its local candidate’s headquarters sit defiantly in a fraying Muslim neighborhood. And last week, Marine Le Pen, the party’s leader, packed thousands into a steamy meeting hall nearby for a pugnacious speech mocking “the system” and vowing victory in this spring’s French presidential election. “There’s been a real evolution,” Philippe   the retired head of a small manufacturing company, said as he handed out National Front leaflets in the market on a recent day. “A few years ago, they would insult us. It’s changed. ” It has long been accepted wisdom that Ms. Le Pen and her   party can make it through the first round of the presidential voting on April 23, when she and four other major candidates will be on the ballot, but that she will never capture the majority needed to win in a runoff in May. But a visit to this southeastern National Front stronghold suggests that Ms. Le Pen may be succeeding in broadening her appeal to the point where a victory is more plausible, even if the odds are still stacked against her. With a month to go, the signs are mixed. Many voters, particularly affluent ones, at markets here and farther up the coast betray a traditional distaste for the   party. Yet others once repelled by a party with a heritage rooted in France’s darkest political traditions  —     xenophobia and a penchant for the fist  —   are considering it. “I’ve said several times I would do it, but I’ve never had the courage,” Christian Pignol, a vendor of plants and vegetables at the Bandol market, said about voting for the National Front. “This time may be the good one. ” “It’s the fear of the unknown,” he continued, as several fellow vendors nodded. “People would like to try it, but they are afraid. But maybe it’s the solution. We’ve tried everything for 30, 40 years. We’d like to try it, but we’re also afraid. ” French politics are particularly volatile this election season. Traditional power centers  —   the governing Socialists and the   Republicans  —   are in turmoil. Ms. Le Pen’s chief rival, Emmanuel Macron, is a youthful and untested politician running at the head of a new party. Those uncertainties  —   and a nagging sense that mainstream parties have failed to offer solutions to France’s economic anemia  —   have left the National Front better positioned than at any time in its   history. But if it is to win nationally, the party must do much better than even the 49 percent support it won in this conservative Var department, home to three National Front mayors, in elections in 2015. More critically, it must turn   areas of the country in Ms. Le Pen’s favor and attract new kinds of voters  —   professionals and the upper and middle classes. Political analysts are skeptical. Frédéric Boccaletti, the party’s leader in the Var, knows exactly what needs to be done. Last week, he and his fellow National Front activists gathered for an evening planning session in La    a   port town devastated by the closing of   naval shipyards nearly 20 years ago. Mr. Boccaletti, who is running for Parliament, keeps his headquarters here. “I’m telling you, you’ve got to go to the difficult neighborhoods  —   it’s not what you think,” Mr. Boccaletti told them, laughing slyly. “Our work has got to be in the areas that have resisted us most”  —   meaning the coast’s more affluent areas. It is not unlike the strategy that President Trump applied in the United States by campaigning in   Democratic strongholds in   Ohio. No one thought he stood a chance there. Yet he won. “Now, we’ve got doctors, lawyers, the liberal professions with us,” Mr. Boccaletti said. “Since the election of Marine” to the party’s presidency in 2011, “it’s all changed. ” Yes and no. Since then, to broaden the party’s appeal, Ms. Le Pen has worked to buff the National Front’s image and distance it from its founder,   Le Pen, her disavowed   father, even kicking him out of the party in 2015. That strategy has helped make the National Front potentially palatable to some voters who had hesitated before. In the early days, four decades ago, winning 10 percent of the vote was considered a triumph for the party. This year, some polls predict Ms. Le Pen will get as much as 45 percent of the vote.   of her own edge toward the mainstream, Ms. Le Pen now buries her most incendiary proclamations. At a rally in nearby   last week, she pledged to cut taxes and “drastically” reduce immigration  —   well inside generic political formulations. Also last week, the party dismissed an official in the region for Holocaust denial. Still, Ms. Le Pen often emits the dog whistles easily recognized by her cheering crowds, as in a recent speech at Nantes, where she denounced in quick succession “the Rothschild bank,” and the   media and telecom magnate Patrick Drahi, a   businessman with French and Israeli citizenship. Ms. Le Pen and her party still show little compunction over using tried and true National Front strategies that stoke racial fears. A wall at Mr. Boccaletti’s tiny party headquarters here is adorned with a poster showing a hand tearing down a star and crescent, a symbol of Islam, with the slogan “Here, We Are in France. ” Another poster showed a veiled Muslim woman accompanied by the words “No to Islamism. ” When the beaming Ms. Le Pen clambers onstage at her rallies, menacing chords give way to triumphant brassy blasts. At the more elaborate rallies, Wagnerian electric flame throwers dramatically cap her closing vows to “renew the ties of national solidarity. ” In   it was Ms. Le Pen’s thrusts against the “mass immigration” and its supposed link to France’s mass unemployment that drew the loudest roars. “This is our country!” the crowd chanted. “She’s going to send home the immigrants,” said Jean Simon, a grizzled construction worker from Nice, who attended. “There’s way too much unemployment. ” Lashing the two issues together is a ploy straight from a playbook that dates to the National Front’s original doctrine in 1972. It is part of legacy that continues to give a good many French people pause. Some 58 percent of them still consider the Front a “danger” for democracy, according to a poll published in Le Monde this month, 11 percentage points more than in 2013. Yet there is enough uncertainty over whether Ms. Pen has sufficiently softened up traditional resistance that, for the first time, the candidate of a party still considered extremist by many has become the person to beat. The mainstream media is in near hysteria. Last week’s cover headline in the Journal du Dimanche warned of the “Le Pen Menace. ” The cover of this week’s L’Obs predicted in bold type: “If Le Pen is elected: The Black Scenario. ” In L’Express it was “Why Le Pen is advancing  —   again. ” Ms. Le Pen is in the unusual position of seeming like a winner and a loser at the same time. She is a winner because every French poll predicts she will come out on top in the first round. Four major candidates will be competing against her that day  —   two on the left, one in the center and one on the right. None, alone, can beat her. But she is a loser because those same polls all say she will be defeated by a hefty margin in the second round of voting on May 7, whoever her opponent is. “I don’t think she will be elected president,” said Joël Gombin of the University of Picardy Jules Verne, one of France’s leading experts on the Front. “But it’s not impossible any longer. “And even if she’s not elected, there’s a strong possibility that French political life will be turned upside down, and the National Front will play a larger role,” he added. The ambiguous status of winner and loser gives her whole campaign  —   the tone of her voters, her activists, her top lieutenants and even Ms. Le Pen herself  —   an uncertain feel, as if all are floating a few feet above reality. Muriel Fiol, a local doctor who was helping Mr. Boccaletti run the meeting, predicted that the “glass ceiling was going to explode. ” “People don’t want this political class any more,” she said. But Mr. Boccaletti urged prudence. There was still some way to go, as attitudes of many locals showed. Even if buoyed by the feeling that Ms. Le Pen is a player for the first time, volunteers conceded that the going was “difficult,” as was sometimes shown by the reception at the colorful market in this fishing port of pastel houses on the Mediterranean. Certainly, not all were convinced that Ms. Le Pen had outrun the long shadow of her party’s ugly reputation. “Sure, I took their leaflet,” Bernard Cornet, a retired teacher, said, broadly grinning. “Only so that I could throw it into the trash straight away. ”'"}, "time": 1742564429.4881978}