{"duration": 0.10490894317626953, "input_args": {"text": "'Posted on November 10, 2016 by DavidSwanson \\nJohn Feffer argued on Wednesday that Demagogue Donald, whose very existence will lead me to pretend I’m not from the U.S. the next time I’m in Europe, is part of a wider trend that’s already hit Europe hard: \\n“The ugliness has been percolating in Europe for some time now. It wasn’t just Brexit, Britain’s unexpected rejection of the European Union. It was the election of militant populists throughout Eastern Europe — Viktor Orban in Hungary, Robert Fico in Slovakia, the party of Jaroslaw Kaczynski in Poland. It was the electoral surge of the National Front in France and the Alternative fur Deutschland in Germany. It was the backlash against immigrants, social welfare programs, and ‘lazy Mediterraneans’ — but also against bankers and Brussels bureaucrats.” \\nI think the trend is even wider and deeper if the trend we’re talking about is that of making everything worse, of increasing inequality, of increasing militarism, of destroying the environment, of pushing profit over people. If that’s the trend, the bankers are its vanguard, not its victims, and it has saturated the international establishment almost as thoroughly as it has the rightwing sectarians. \\nBut the trend Feffer seems to have in mind is one of nationalism or ethnic identity or racism in opposition to global humanitarianism. Feffer’s new dystopian novel, Splinterlands , tells a future of shattered nations and international institutions, replaced with ever smaller and more disastrous warring city states. It’s a vision that should disturb us deeply, a vision of what this world could actually become if it gains nothing in wisdom, miraculously survives its nuclear weapons, and plows right ahead into climate chaos and total capitalist consumption. \\nFeffer’s utopia seems to be a globe unified in peace. But his dystopia is not unlike that of an author like Ian Morris whose utopia is a globe unified by imperial war. The great threat on the horizon for both is balkanization or splintering. Feffer sees this brought on by bigotry, militarism, and environmental destruction. Morris sees the threat as, basically, un-Americanism. But where does barbaric tribalism stop and the promotion of more direct local democracy begin? Is bigger always better and smaller always worse? \\nFeffer may not think so, because, in fact, a small utopia hidden in one corner of a sinking Titanic of an earth shows up in Splinterlands — something of a Luddite communal organic farm of a sort that essentially exists right now, a creation that cannot save us all or even itself unless expanded to a radically larger scale or duplicated innumerable times. The trick, then, may be to duplicate sustainable and just local living within a global system of nonviolent dispute resolution, cooperation, and fairness. \\nFeffer says he thought a Trump figure wouldn’t arrive for four more years — though it’s interesting that a big role in his fictionalized future dismantling of the world is played by a hurricane named Donald. My question is whether Trump’s disastrous arrival might not in some ways be put to good use toward human survival. I’m thinking of a particular good use to which Hillary Clinton’s disastrous arrival would not have leant itself. That is to say, can we not now appeal to other nations to recognize that the presence of U.S. military troops on their soil represents their subservience to the odious Donald Trump, a figure hardly to be imagined as the mythical Barack Obama, man of peace? \\nCan we encourage nonviolent resistance to U.S. militarism without encouraging a dive into a dystopian Splinterlands? Can the world refuse to participate in U.S. wars and U.S. weapons dealing while increasing its participation in cooperative non-military endeavors with the United States and the globe? Can U.S.-led war making, and the war making of other nations, come to be understood as the enemy of good globalism, not as the embodiment of UN humanitarian intervention in the affairs of those deemed less developed? \\nThe alternative to the world figuring out how to resist U.S. wars would seem to be the people of the United States shutting down its war machine from within, without the assistance of the other 96%. But how does that seem to be working out? This entry was posted in General . Bookmark the permalink .'"}, "time": 1742564467.583239}