{"duration": 0.15654873847961426, "input_args": {"text": "'WASHINGTON  —   Stephen K. Bannon has read the book three times. He still keeps a copy of it  —   one that’s creased and copiously underlined  —   in a library with the rest of his favorites at his father’s house in Richmond, Va. The book, “The Fourth Turning,” a 1997 work by two amateur historians, Neil Howe and William Strauss, lays out a theory that American history unfurls in predictable,   cycles of prosperity and catastrophe. And it foresees catastrophe right around the corner. The book delineates history into four seasonal cycles, or “turnings”: growth, maturation, decay and destruction. It is the kind of wild, provocative idea that Mr. Bannon loves. But it is also just the kind of thinking that his opponents see as evidence that he is too Machiavellian and idiosyncratic for the job of President Trump’s chief strategist. The basis of his worldview  —   which has been described as everything from Leninist to   an extremist fringe movement associated with white nationalism  —   is still shrouded in mystery and conjecture. But by his own telling, much of the foundation for his political beliefs can be found in the book, which predicts that America is hurtling toward a crisis on par with the American Revolution, the Civil War and the Great Depression. And the grim future that the book foresees helps explain the underpinnings of the president’s conservative, nationalist “America First” agenda, one that Mr. Bannon has played a large role in shaping. “I don’t think there’s any doubt that the world is in the beginning state of a crisis that it can’t avoid,” Mr. Bannon said in a recent interview, before Mr. Trump removed him from the National Security Council and started contemplating a broader White House   that could further marginalize him. But Mr. Bannon, choosing his words carefully, allowed that while he did not believe a cataclysm like global war was inevitable, failing to prepare as if one might happen would be foolish. “Everything President Trump is doing  —   all of it  —   is to get ahead of or stop any potential crisis,” Mr. Bannon added. But those who question Mr. Trump and Mr. Bannon’s motives say the central premise of “The Fourth Turning,” with its religious subtext and dark premonitions, is a convenient excuse to sow fear and justify extreme action. Many academic historians dismiss the book as about as scientific as astrology or a Nostradamus text. And many will find reason for alarm in its conclusion that the coming crisis will demand loyalty and conformity from citizens. It also leads to unavoidable questions about war and whether Mr. Bannon, who has recommended the book to countless friends and made a film about it in 2010, is resigned to catastrophic global conflict. He says he is not. And he remains unconvinced that the United States can effectively intervene in overseas conflicts like the one unfolding in Syria. As one of the voices in the administration who expressed skepticism about a military strike in response to the Assad regime’s chemical attack on its own citizens, Mr. Bannon insists he is no warmonger. In the interview, Mr. Bannon rattled off a list of White House policies that he said fit with the larger goal of strengthening the country for whatever calamity might await just over the horizon. They included starting the process of building a wall on the southern border, barring foreigners from seven predominantly Muslim nations, and taking steps that he said were meant “to empower the secretary of defense, the C. I. A. to step up the war” against radical Islam. “I think it’s very simple: You’ve got to take care of the country,” Mr. Bannon said. Ultimately, he added, America could reclaim its position as a keeper of peace and stability throughout the world. “America has to be strong  —   economically strong and militarily strong. And a strong America could be ultimately a provider of Pax Americana. ” But to those who see Mr. Trump as someone who instigates crises, rather than defuses them, the knowledge that his senior strategist is an evangelist for a theory that forecasts the destruction of society as we know it is alarming. “If you frame everything as a crisis, then the right response to crisis is action, not deliberation,” said Alexander Livingston, an assistant professor of political theory at Cornell who has written critically about “The Fourth Turning” and Mr. Bannon. “It puts the people who say ‘hold on’ in a position of failing to see the crisis but also of being responsible for the crisis. ” In their book, Mr. Howe and Mr. Strauss note the roughly   intervals between catalytic events in American history like the Declaration of Independence (1776) the attack on Fort Sumter (1861) and the bombing of Pearl Harbor (1941). They predicted the next crisis would begin around 2005 and reach its climax sometime before 2025. “History is seasonal, and winter is coming,” they warn. Precipitating each fourth turning, the authors wrote, is a breakdown of the existing civic order and the institutions that prop it up. Mr. Bannon, who has said the Trump administration will see to the “deconstruction of the administrative state,” believes these institutions are already crumbling, and he seems more than happy to pilot the wrecking ball that demolishes them entirely. In an interview, Mr. Howe recalls getting an email about 10 years ago from Mr. Bannon, whom he had never heard of at the time, asking if he would participate in a film about the book. “We kind of blew him off,” Mr. Howe, who is now a demographer at the investment firm Hedgeye Risk Management, said recently. Mr. Howe, who eventually agreed to be interviewed for the film, said that Mr. Bannon seemed to have no qualms about the destruction part of the cycle. “There is something beneficial about the creative destruction that comes with a fourth turning,” Mr. Howe said. “There has to be a period in which we tear down everything that is no longer functional. ” Mr. Bannon’s suspicion of powerful institutions and the men and women who run them might seem at odds with his personal conservatism. He is a Catholic, a former Navy officer and a traditionalist in many ways. But Peter Schweizer, an author and frequent collaborator with Mr. Bannon on films and books, said Mr. Bannon believes the nation’s elites arrogantly underestimate their own role in creating crises and then overestimate their ability to solve them. “I do think the reason this theory is so powerful in Steve’s mind is it kind of goes to the heart of his problem with elites,” Mr. Schweizer said. “He does have a skeptical view of the limitations of human intellect. This notion that a few smart guys know how to quote unquote run a global economy is just laughable to him. ” In the 2010 film, “Generation Zero,” which was produced by Citizens United, whose films often attack favorite conservative targets like the Clintons, the screen flashes with foreboding imagery: a mushroom cloud from an atomic bomb, a shark fin skimming above the water, a guillotine blade falling. The film’s thesis is that the financial collapse of 2009 was the beginning of the modern fourth turning. But Mr. Bannon sees not just a financial crisis unfolding. A deeper cultural crisis  —   selfishness, excessive political correctness and a lack of civic responsibility  —   has infected the country’s political and economic institutions, which must be purged. Today Mr. Bannon is much more prudent about tossing out predictions of imminent catastrophe and conflict. But some who spoke with him for the film said he was not always so reticent. “If we were in an international crisis that might lead to a major war, I don’t think that would frighten him at all,” said David Kaiser, a former professor at the Naval War College and a historian who subscribes to the Strauss and Howe theories. “I wouldn’t go so far as to say Bannon wants it,” Mr. Kaiser added. “But I think it’s a possibility he willingly accepts it. ” Mr. Bannon insisted that was not his view. “You’re not inexorably pulled into this,” he said. But it seemed undeniable to him that the book got a lot right about the general direction that America is headed. “In the ‘Fourth Turning’ theory you’ve got a country that believes it’s off course,” he said. “  of Americans now think we’re on the wrong track. That’s an extraordinary number. ” He added, “Certainly they feel the country is in some sort of crisis. ”'"}, "time": 1742563614.5301814}