{"duration": 0.06727910041809082, "input_args": {"text": "'LOS ANGELES  —   It was a weekend of nice and naughty at the box office, with two buoyant musicals, “Moana” and “La La Land,” turning in big results alongside the decidedly raunchy “Office Christmas Party. ” After a celebrated run on the fall film festival circuit, the Lionsgate musical “La La Land” arrived in five locations and collected a sizzling $855, 000, one of the best   results on record. The total surpassed the initial outcome for “The Grand Budapest Hotel,” which became a runaway indie hit in 2014. “La La Land,” directed by Damien Chazelle and starring Emma Stone and Ryan Gosling, cost $30 million to make. It is widely considered by awards prognosticators to be the film to beat at the coming Academy Awards. In its third weekend in theaters, “Moana” (Disney) maintained a remarkable hold on multiplex audiences, once again selling the most tickets of any film in North America. The animated juggernaut collected about $18. 8 million, for a new domestic total of $145 million, according to comScore, which compiles ticketing data. Disney is also expected to dominate in the weeks to come. The company’s Lucasfilm division will unleash “Rogue One: A Star Wars Story” on Friday in more than 4, 000 theaters, and sites like MovieTickets. com are reporting breakneck advance sales. “Office Christmas Party,” with an ensemble cast led by Jason Bateman and Jennifer Aniston, took in about $17. 5 million over the weekend, a heftier total than some analysts had predicted before its release. The   comedy, which cost DreamWorks Pictures and a partner $45 million to produce, was distributed by Paramount. Also of note among Oscar hopefuls: “Jackie” (Fox Searchlight) a raw portrait of a newly widowed Jacqueline Kennedy, continued to attract sizable audiences as it pushed into 21 locations in eight cities, taking in about $500, 000, for a   total of $860, 000.'"}, "time": 1742562740.888374}