{"duration": 0.13127422332763672, "input_args": {"text": "'TOPEKA, Kan.  —   Timothy Shahid and Joshua Kalina met, went drinking, became friends and then had a falling out that lead to the murder of one of the young men, all in a matter of hours. The victim’s mother, her life suddenly a disordered jumble marked by panic attacks and nightmares, decided to seek out her son’s killer to try to understand what had prompted an act of violence so baffling that even the gunman was at a loss.  With the aid of a restorative justice program, which brings together victims and those who have caused them harm, the two ultimately met  —   each seeking a way out of grief, fear and guilt. Here’s a look at Timothy, Joshua and Joshua’s mother as she becomes involved in the program. (In this related article, read about a meeting between the parents of a college student and the man convicted in the   accident that killed their son.) “I probably broke my mom’s heart when I told her that,” Timothy, now 30, said. “The road I was leading, I knew I was going to end up in one of those two places. ” At 14, Timothy and some other boys robbed a pawnshop, and he spent two years in a juvenile facility. By age 16, he was “religiously” carrying a gun that he sometimes used. He did not elaborate. “Hanging out with a group of kids gave me hope,” said Timothy, who was tormented by his adoption, and the parents he never knew. “I didn’t think my biological mother loved me. ” At the time of the shooting, Timothy was working at a telemarketing center. He spent his free hours smoking pot and drinking at least a pint of Hennessy a day. He customized the black 2005 Nissan Altima with special wheel rims, and was methodical about keeping the car looking pristine. Joshua grew up in Topeka with his mother, Judi Bergquist, and was especially close to his older brother. He liked to play practical jokes on those close to him. “He was so funny,” his mother said. He had severe attention deficit disorder and graduated from an alternative high school. Problems with social anxiety prompted him to wear a St. Louis Cardinals baseball cap pulled low over his face. Ms. Bergquist said Joshua began hanging out with what she described as a “rougher” group of friends after graduating, so she sent him to Texas to live with her parents. He returned to Topeka about two years later and found work at a   service. But persistent money problems forced him to rely on his mother and grandmother. “The day he died, he called me in the late afternoon,” Ms. Bergquist said. “He was extremely upset because my mom had shut off his cellphone and he had a car payment to make. ” He’d screamed at her. A few hours later, she said Joshua drove slowly by her house but didn’t stop. It was the last time she saw him alive. Hours later, Timothy and Joshua met for the first time through a mutual friend. The two seemed to hit it off. “He didn’t come off as a person I couldn’t get along with. I was easy to get along with,” Timothy said. “I rode around with Josh in his car. ” But as the night of April 23, 2007, wore on, their easy conversation deteriorated into bickering, and the two argued loudly while drinking at a bar. “He said something about one of my friends, so I said something about one of his friends,” said Timothy, who called someone to pick him up. “We were going out the door at the same time, still arguing. I actually opened his car door and then I walk off. I just told him to get in the car. That’s when me and his friend, we’re arguing now . .. All I see was him pull out a weapon . .. I thought he had a gun. ” He fired eight times, and a friend of Timothy’s fired twice more before they fled, the police said. Joshua was left in the parking lot with four gunshot wounds in the chest, one in the left hip, two in the buttocks and three in the left hand. “My   was it was better him than me,” Timothy said. “I didn’t believe in fighting. I just pulled out my gun. I actually ran up to him when I shot him. I don’t blame alcohol. I knew what I was doing. I just saw something in his hand. ” Joshua was unarmed, police said Timothy’s accomplice was never arrested. During pretrial hearings, Timothy would see Ms. Bergquist in the courtroom, and at one court appearance, he taunted her. “I actually took her son’s photo, and held it up and turned around, and that’s when I laughed at her,” he said. Ms. Bergquist, suffering from memory loss and insomnia, panicked every time she saw a tall   man  —   the loose description of Timothy’s accomplice. “If I saw anybody with that vague description, I would just lose it,” she said. Finally, wanting to avoid a trial, Ms. Bergquist agreed to a plea deal in which Timothy would receive about 20 years. Timothy was impassive: “I didn’t care about life. ” “I knew that Timothy held the answers that I needed. I needed reassurance from Timothy that the other person was never going to bother me,” said Ms. Bergquist. “I needed to feel safe. At the same time, I needed to know if Timothy was working to change his life. I didn’t want this to happen to anyone else. ” The first step toward a meeting came after a prison official showed Timothy an article that Ms. Bergquist had written about Joshua. Ms. Bergquist also contacted Holly Chavez, the restorative justice coordinator at the Kansas Department of Corrections, and asked whether a    meeting would be possible. Timothy was also growing more introspective. He was reading the Bible as well as a book that included a passage that seemed written for him: “If you always do what you always did, you always get what you always got. ” The solitude of prison forced him to try to figure out who he was. “I had a lot of time,” he said. “You got to deal with a lot of stuff on your own. It made me go back and look at the things in my life. I became Christian. I understood forgiveness  —   that I took a life that I can never give back. ” What follows is a discussion of the reactions of Timothy and Ms. Bergquist as they worked with Ms. Chavez toward a    encounter. The excerpts, which are from separate interviews that took place after the meeting, capture the thinking of those involved. Judi Bergquist, the victim’s mother Holly Chavez, the program coordinator The pivotal moment came when Ms. Bergquist acknowledged that she knew her son was flawed. Timothy, who killed Joshua Ms. Chavez Ms. Bergquist Timothy Ms. Bergquist Timothy Ms. Bergquist Timothy Ms. Bergquist Timothy Ms. Bergquist In April 2016, the two met again  —   this time at a victims’ awareness event at the prison in front of inmates. “She called me her friend,” Timothy said. “A woman forgiving her son’s killer and calling him her friend. And at the end, she got up and gave me a hug. You just don’t see that too often. ” (In this related article, Zachary Harrison struggles to understand why the parents of the man he killed want to meet him.) '"}, "time": 1742563361.4399328}