{"duration": 0.0514225959777832, "input_args": {"text": "'We Are Change \\n\\nSenator Bernie Sanders is demanding President Barack Obama stand by his commitment to curb climate change by stopping the Dakota pipeline.\\nIn a statement issued on his official U.S. Senate website , Sanders — who garnered over 11 million votes in the Democratic presidential primary — asked Obama to halt construction of the pipeline until federal officials properly conduct a cultural and environmental review.\\n“It is deeply distressing to me that the federal government is putting the profits of the oil industry ahead of the treaty and sovereign rights of Native American communities,” Sanders wrote. “Mr. President, you took a bold and principled stand against the Keystone pipeline – I ask you to take a similar stand against the Dakota Access Pipeline.”\\n“To my mind, the [U.S. Army Corps of Engineers] should have never approved this project on an expedited process in the first place,” he continued.\\nThe Vermont senator also called on the president to send federal observers to the Dakota Access Pipeline construction site to ensure the protection of First Amendment rights for Native Americans fighting for their sovereign land and water.\\n“I urge you to take all appropriate measures to protect the safety of the Native Americans[ sic ] protesters and their supporters who have gathered peacefully to oppose the construction of the pipeline,” Sanders stated. Sanders also reiterated the necessity of preserving the environment, and pointed out the pipeline’s potentially hazardous effect on the climate.\\n“According to one report, burning the oil transported through the pipeline would produce carbon emissions equivalent to 21 million cars or 30 coal plants,” Sanders wrote. “If we have any hope of avoiding the worst consequences of climate change, we should not be building new oil pipelines that lock us into burning fossil fuels for generations to come.”\\nThe letter comes on the heels of state and local law enforcement, along with national guardsmen and private security forces brutalizing indigenous water protectors on Thursday. Videos widely circulated on social media showed law enforcement officers using pepper spray and LRAD sound cannons on Standing Rock protesters. Approximately 140 water protectors engaging in nonviolent civil disobedience were arrested by police in riot gear following the confrontation.\\nClick here to read Sanders’ full letter.\\nRELATED BREAKING: The NEW Election FEC Violation That Should End Clinton’s Campaign . Russia Trolls The U.S., Offers A “Helping Hand” In Overseeing Elections Follow WE ARE CHANGE on SOCIAL MEDIA SnapChat: LukeWeAreChange \\nfbook: https://facebook.com/LukeWeAreChange \\nTwitter: https://twitter.com/Lukewearechange I nstagram: http://instagram.com/lukewearechange Sign up become a patron and Show your support for alternative news for Just 1$ a month you can help Grow We are change We use Bitcoin Too ! 12HdLgeeuA87t2JU8m4tbRo247Yj5u2TVP Join and Up Vote Our STEEMIT The post Bernie Sanders Wrote an Open Letter Calling on President Obama to Stop the Dakota Pipeline appeared first on We Are Change .\\n'"}, "time": 1742563558.3281837}