{"duration": 0.0746612548828125, "input_args": {"text": "'Montag, 21. November 2016 Sicher trainieren: Beim Spinning gilt ab sofort Helmpflicht Berlin (dpo) - Achtung, Freizeit-Sportler: Ab 1. Januar gilt in Deutschlands Fitnessstudios Helmpflicht. Wer sich durch Spinning in Form bringen will, darf das Indoorbike ohne professionellen Kopfschutz nicht mehr besteigen. Durch die Neuregelung soll die Unfall- und Verletzungsgefahr deutlich reduziert werden. Die Helmpflicht sei ein wichtiger Baustein, um die Sicherheit in den Studios weiter zu erhöhen, so der Verband Deutscher Fitness- und Gesundheitsunternehmen in einer Mitteilung. Zwar sei die Gefahr, von einem entgegenkommenden Pkw erfasst zu werden, vergleichsweise gering, doch seien schon mehrere Sportler vor Erschöpfung vom Ergometer gefallen oder von einem unaufmerksamen Bodybuilder angerempelt oder gar umgestoßen worden. Zudem erhöhe ein Helm das Sicherheitsgefühl, gerade bei rasanten Spinning-Einheiten oder Berg- und Talfahrt-Simulationen. Indoorbikes haben keinerlei Knautschzone, weshalb der Kopf besonders geschützt werden muss. Ebenfalls aus Sicherheitsgründen ist es künftig nicht mehr gestattet, während der Fahrt über Kopfhörer Musik zu hören oder auf einen Bildschirm zu starren. \"Wir bauen alle Monitore ab\", so Verena Hardenberg, Betreiberin eines privaten Fitnessstudios in Würzburg. \"Es hat sich herausgestellt, dass die Fahrer dadurch sehr stark abgelenkt werden. Das Risiko ist uns einfach zu groß!\" Und in der Branche sind bereits weitere Maßnahmen im Gespräch, sollte die Helm-Initiative zu kurz greifen. Möglicherweise müssen beim Spinning demnächst neonfarbene Warnwesten übergestreift oder leuchtende Katzenaugen mitgeführt werden. Diese könne man ohnehin ganz bequem am Shirt oder Stirnband befestigen. So sei auch in der Dämmerung und in den Abendstunden ein sicheres Training möglich. Aber nicht jeder ist begeistert. \"Ich fahr doch nicht extra mit meinem Rad 20 Kilometer ins Fitnessstudio, um mich dort dann zu blamieren\", so der kritische Kommentar von McFit-Stammkunde Mirko M. aus Ennepetal. Ein Helm sei umständlich, teuer und verringere, so glaubt er, vor allem seine Flirtchancen vor Ort, weil er albern aussehe. \"Wofür halten die uns? Für Spinner?\" swo; Foto [M]: Shutterstock'"}, "time": 1742561730.9668722}