{"duration": 0.12333345413208008, "input_args": {"text": "'Richard Schickel, who was so captivated by Walt Disney’s “Snow White and the Seven Dwarfs” when he was 5 years old that he grew up to be a noted film critic, Hollywood historian and prolific author and documentarian  —   and estimated that he had watched 22, 590 movies  —   died on Saturday in Los Angeles. He was 84. His daughter Erika Schickel said the cause was complications of dementia. Fortified by boxes of Good  Plenty licorice rather than popcorn, Mr. Schickel reviewed films for Life magazine from 1965 until it closed in 1972, then wrote for Time until 2010 and later for the blog Truthdig. com. In a career that spanned the   studio era and the rise of independent directors, he also wrote 37 books on movies and filmmakers and wrote or directed more than 30 documentaries, mostly for television. He shared or received three Emmy nominations, for “Life Goes to the Movies” in 1976 and “Minnelli on Minnelli: Liza Remembers Vincente” in 1987. Richard Zoglin, a fellow critic and now a contributing editor at Time, said that what distinguished Mr. Schickel among his peers was his comprehensive knowledge of the movie industry’s players and processes coupled with “an astute critical sensibility” that resisted the trendy. “He wrote from the perspective of a film insider,” Mr. Zoglin said in a phone interview, “but responded to films from a gut level and never lost the sense of being an average filmgoer reacting to what was on the screen. ” Mr. Schickel pulled no punches. Reviewing Stanley Kramer’s “Guess Who’s Coming to Dinner” in 1967, the interracial love story starring Sidney Poitier, Katharine Hepburn and Spencer Tracy, Mr. Schickel groused, “Kramer is earnestly preaching away on matters that have long ceased to be true issues. ” He even dismissed “The Maltese Falcon,” John Huston’s 1941 film noir classic starring Humphrey Bogart, as “cramped and static” and was damning in a retrospective look at “Gone With the Wind” in The Atlantic in 1973. Mr. Schickel wrote that two measures of a movie’s quality should be how much a viewer retains and how much one wants to see it again. By both measures, he loved “Citizen Kane,” “Double Indemnity,” “The Godfather,” “The Searchers,” “Chinatown,” “Fargo,” “Meet Me in St. Louis,” “Yankee Doodle Dandy,” “Pinocchio” and the original “King Kong,” as well as outliers like Audie Murphy’s western “No Name on the Bullet” and François Truffaut’s “The 400 Blows. ” Mr. Schickel did not view filmgoing as an experience frozen in memory. “You loved ‘My Friend Flicka’ when you saw it at age 10,” he wrote. “If you see it at age 65, you may respect it, but you won’t think it’s a masterpiece (which does not mean you should deprive your grandchildren of the pleasure of seeing this picture when they are the perfect age for it). ” He also understood that the public’s perception of his role had evolved. A critic, he told The Hedgehog Review in 2005, is “a very endangered species in a nation that wants indulgence more than a criticism that questions its fatuity. ” But responding to an article in The New York Times, which suggested that blogging might be making book reviewing more democratic, he wrote in The Los Angeles Times in 2007: “Criticism  —   and its humble cousin, reviewing  —   is not a democratic activity. It is, or should be, an elite enterprise, ideally undertaken by individuals who bring something to the party beyond their hasty, instinctive opinions of a book (or any other cultural object). It is work that requires disciplined taste, historical and theoretical knowledge and a fairly deep sense of the author’s (or filmmaker’s or painter’s) entire body of work, among other qualities. ” Richard Warren Schickel was born on Feb. 10, 1933, in Milwaukee, the son of Edward Schickel, who worked in advertising, and the former Helen Hendricks, a docent. He was named for an ancestor, Richard Warren, who arrived on the Mayflower. He was raised in suburban Wauwatosa, Wis. and escaped to the movies on weekends with friends, he wrote in a memoir, “Good Morning, Mr. Zip Zip Zip: Movies, Memory, and World War II” (2003) “because the serene and placid little world I inhabited as a kid was so lacking in romantic and heroic adventure. ” He saw Charlie Chaplin’s “The Great Dictator” when he was 8. “I mimed enchantment for my parents’ benefit,” he wrote in American Heritage magazine in 2006. “I did a lot of that in those days. They were so sweetly earnest, as I now appreciatively recall, about introducing me to ‘the finer things.’ Their problem back then was finding, in Milwaukee, finer things for me to appreciate. ” Mr. Schickel graduated from the University of Wisconsin, Madison, in 1955 with a bachelor’s degree in political science and moved to New York, where he freelanced for magazines and reviewed his first film, “A Boy Ten Feet Tall,” starring Edward G. Robinson, in 1965. He described it as “quite a good little movie. ” His marriage to Julia Carroll Whedon, a writer, ended in divorce. In addition to their daughter Erika, who is also a writer, he is survived by another daughter from that marriage, Jessica Vild a stepdaughter, Ali Rubinstein, from his second marriage, to the former Carol Rubinstein, a TV producer who died in 1991 and four grandchildren. His books included biographies of Woody Allen, Marlon Brando, James Cagney, Charlie Chaplin, Gary Cooper, Clint Eastwood, Lena Horne and Elia Kazan. His documentaries include a PBS series, “The Men Who Made the Movies. ” “The truth, very simply, is that most movies are lousy or, at best, routine,” Mr. Schickel wrote in “Keepers: The Greatest Films  —   and Personal Favorites  —   of a Moviegoing Lifetime” (2015). “We go to see them, much of the time, in search of something else  —   the comforting darkness of the theater, the play of light and shadow on the screen, the consolations they offer for some temporary trouble,” he wrote. “A lot of the time we don’t give a hoot what’s playing. We are at a public event for private reasons which we don’t always recognize until later, if at all. It is the occasion, the atmosphere, that we crave. ”'"}, "time": 1742564301.3091283}