{"duration": 0.10243940353393555, "input_args": {"text": "'New PAN report warns of global contamination of health damaging glyphosate \\n  Ethan A. Huff, staff writer Tags: glyphosate , PAN report , toxicity (NaturalNews) The popular herbicide glyphosate, also known as Roundup, is far more toxic to humans than the chemical industry claims it is, a new report has found. The Pesticide Action Network (PAN) in a 96-page document entitled Glyphosate , reveals how people all around the world are being systemically poisoned by glyphosate, and many of them are even dying.Aerial sprayings of the chemical across crop fields are said to be safe for humans, because the so-called \"shikimate\" pathway upon which the herbicide acts exists only in plants, and not in animals or humans. But the report highlights the fact that, regardless of the supposed nonexistence of this pathway in humans, glyphosate is sill wreaking havoc on human health .Some of the acute health effects of glyphosate exposure include gastrointestinal and skin infections, headaches, blistering on the skin, rapid heartbeat, elevated blood pressure, dizziness, numbness, insomnia, blurred vision, abdominal pain, chest pains, problems breathing, respiratory problems, sore throat and strange tastes in the mouth.Other lesser-reported symptoms include problems staying balanced, cognitive abnormalities, impaired senses, muscle paralysis, peripheral neuropathy, decreased motor skills, chronic fatigue and abnormal body temperature. And none of this even touches on the long-term health effects of glyphosate exposure, which are significantly more problematic.According to the report, glyphosate directly interferes with \"numerous mammalian organs and biochemical pathways, including inhibition of numerous enzymes, metabolic disturbances and oxidative stress leading to excessive membrane lipid peroxidation, and cell and tissue damage.\" Furthermore, the report highlights \"genotoxicity and endocrine disruption\" that lead to \"chronic health and developmental effects.\" South American doctors confirm that glyphosate spraying is causing infertility, cancer Though U.S. doctors and health experts appear reluctant to report on their observances with glyphosate, their counterparts in South America have a lot to say on the subject. Doctors in Argentina, for instance, are reporting what\\'s being described as a \"dramatic upsurge\" in long-term health effects where glyphosate is being sprayed on genetically-modified soybean crops.Included in the list of effects are infertility, pregnancy problems, birth defects, respiratory disease and various forms of cancer. Epidemiological studies have established a link between glyphosate exposure and non-Hodgkin lymphoma, hairy cell leukemia, multiple myeloma and DNA damage. Even at very low concentrations, glyphosate has been shown to damage vital organs like the liver and kidney, as well as skin cells.Not only is glyphosate sprayed all over food crops during the growing season to kill weeds, but it\\'s also used as a pre-harvest desiccant to speed up the growing and harvesting process. According to the report, this process is used on wheat, cotton, various cereal grains, peas, and beans, as well as other crops.It\\'s bad for the people who end up eating these food crops, but great for farmers and the chemical companies like Monsanto that they support when they purchase all that extra glyphosate. And the repercussions are startling. Glyphosate residues are now being found in women\\'s breast milk, as well as in blood and urine. Even vaccines are starting to turn up as glyphosate-contaminated, which means developing babies are now being injected with this lethal poison.\"The PAN Report is extremely comprehensive and really needs to be mainstreamed so that food growers, in particular, can understand the harm they are doing to crops, the soil, the environment, wildlife, pollinators, water resources and humans,\" writes Catherine J. Frompovich for Natural Blaze .\"However, it will be up to consumers and farmers ... to make their concerns and priorities known about saving the planet and humankind from toxic chemicals in food, water and the air, if we are to survive toxic chemicals and their currently unavoidable poisonings.\"The full PAN report is available for free online here . Sources for this article include:'"}, "time": 1742564505.4893322}