{"duration": 1.6560938358306885, "input_args": {"text": "'\\nI know Hillary has probably never used a Twitter account personally in her entire life, but if she is, that would make this Tweet sent out on her official account even funnier.\\nHappy birthday to this future president. pic.twitter.com/JT3HiBjYdj \\n— Hillary Clinton (@HillaryClinton) October 26, 2016 \\n\\nNot only does this woman obviously just know, with every fiber of her being, that’s she’s got the election in the bag, but now she’s wishing herself happy birthday?\\nWho does that?\\nOh yeah, that’s right, no one.\\n@HillaryClinton Whomever is managing your social media account needs to be fired immediately. No one wishes themselves a happy birthday.\\n— Steve Peer (@everymahn) October 26, 2016 \\n\\n@HillaryClinton “when you wish a happy birthday to your self” pic.twitter.com/8Rnrjif5Fl \\n— seed (@seed30_Greek) October 26, 2016 \\n\\nWhat’s even more hilarious are the responses.\\n@HillaryClinton I’ve seen that look before. pic.twitter.com/TQ7FaW7Mnr \\n— Ian McKelvey (@mckelvey_ian) October 26, 2016 \\n\\n@HillaryClinton Last picture taken before she became corrupt.\\n— Everyday American (@NashRamblers) October 26, 2016 \\n\\n@HillaryClinton happy bday to the single most corrupt politician in the history of the USA! #NeverHillary \\n— Chuck Norris (@Chuck7817) October 26, 2016 \\n\\nOdd RT @HillaryClinton Happy birthday to this future president. pic.twitter.com/FpluGgnovD \\n— Marcus Hawkins (@HawkinsUSA) October 26, 2016 \\n\\n@HawkinsUSA @HillaryClinton Don’t you mean… pic.twitter.com/5nhQSSnVqT \\n— Truthstream Media (@truthstreamnews) October 26, 2016 \\n\\n@HillaryClinton pic.twitter.com/80Kzpu0WwE \\n— Deplorable Lil Trump (@USAneedsTRUMP) October 26, 2016 \\n\\n@seed30_Greek @HillaryClinton hitler was a sweet little child once too\\n— First name here last (@Anodramazone66) October 26, 2016 \\n\\n@HillaryClinton happy birthday you cruel warmonger. pic.twitter.com/7pY5O6uudo \\n— Veronica (@PotluckPolitico) October 26, 2016 \\n\\n@HillaryClinton This IS a better birthday picture pic.twitter.com/V3bc4adfKL \\n— DeplorableHispanic (@bibi4Trump) October 26, 2016 \\n\\n@HillaryClinton pic.twitter.com/JnPLNrLeFP \\n— Wes Stull (@WesStull) October 26, 2016 \\nDelivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by Melissa Dykes of The Daily Sheeple . \\nMelissa Dykes is a writer, researcher, and analyst for The Daily Sheeple and a co-creator of Truthstream Media with Aaron Dykes, a site that offers teleprompter-free, unscripted analysis of The Matrix we find ourselves living in. Melissa and Aaron also recently launched Revolution of the Method and Informed Dissent . Wake the flock up! '"}, "time": 1742562854.718171}