{"duration": 0.13538527488708496, "input_args": {"text": "'Posted 11/15/2016 9:23 am by PatriotRising with 0 comments \\nAmericans have been to the polls. Everything is over but the shouting — by the loser, that is honest Hil. I predicted that the best Trump could have hoped for was winning the popular vote but losing the Electoral College but I got it wrong: the Donald has triumphed. An underfunded campaign — he spent barely half of what she did — with a skeletal crew and without the party’s full backing won out because not all of America agrees with the values of Jay-Z, Beyoncé, Springsteen, Hollywood in general and gay marriage in particular. \\n\\nTrump appealed to those who have been snubbed, the great ignored. They are mainly blue-collar whites who had long been belittled and overlooked by the media until suddenly their knight in a shiny gold Cadillac appeared. In a rare moment of openness, Hillary described these people as ‘deplorable’. Basically, Trump’s message was that to embrace extremism was to acknowledge the danger in absolute terms: no more Muslims coming in, no more Nafta, a wall to stop Mexicans, and so on. Even more profoundly, even nice, unsophisticated Americans wondered why Hillary or Obama had been so squeamish about calling a spade a spade, i.e., radical Islamic terrorism. As a Trump follower wrote, ‘Moderation in the pursuit of evil is no virtue. \\n\\nImperfect as Trump was a candidate, his enemies are the very same people who are shocked (in the manner of Captain Renault) by the ignorance of hoi polloi, and who decided long ago that these people are not to be trusted. You know the kind: Beltway insiders, media pundits, academics, policy professionals, Hollywood types, fashion elites, TV celebrities, professional race hustlers, gay activists; you name what’s in the news nowadays, they were against the Donald. They are part of the arrangement. Their European counterparts are in the EU, and among the Remainers. \\n\\nIf one had to slice it down even further, this election was basically the politically correct versus the politically incorrect. Although blue collars may not sound too sophisticated to snotty-nosed Beltway insiders, the blues know that this is no longer a war between nation states but a fight between civilizations: Islam and the West. An American president with an IQ lower than his younger daughter’s age invaded the Middle East, claiming that the region would welcome having American values imposed upon it. Hillary voted for that disastrous action; Trump was against it from the start. Americans see Europe and cringe. They see ‘Frenchmen’ cheering as their white countrymen are murdered in cold blood by Muslims and realize that this is a war fought by immigration. They put two and two together and calculate that in 100 years there will be more Muslims in Europe than white European Christians and that Sharia law will be imposed from above. And they also see a Dutch MP on trial for speaking against unlimited immigration, an MP, incidentally, who was refused entry to the UK for being right-wing, whatever that means. \\n\\nOne political philosopher at Oxford asked, ‘What gives a country the right to control its borders?’ Well, I’m asking who gave his mother the right to give birth to such a moron, but then not everyone is as rude as yours truly. And then, of course, the R-word comes into it. That’s what the election was and will be all about in the near future. Race is to America what immigration is to Europe: the large pachyderm crowding everyone out of the chic drawing-room in Chelsea. \\nWhites choose to live, as do blacks, among their own — if they have the choice. Churches self-segregate and whites flee to the suburbs once blacks move in next door. The elites, however, call this racism, although they would not dream of living next to a black family unless they were the Obamas, and then some. And as more and more Africans move to the States, there are more and more natives who feel a kind of cultural dispossession and a belief that Uncle Sam cannot thrive as an increasingly multiracial nation. Those who feel this way have been X-rated by the elites, and are called racists, homophobes, sexists, xenophobes and morally deformed. These people found a champion in Trump. \\n\\nAnd now a word about the fourth estate: I knew the fix was in long ago — never have the media been as incapable of separating fact from fiction and truth be damned — but when Vogue came out slamming Trump, I almost pissed in my St Laurent silk underwear. Never before have so many news outlets abandoned all pretence of fairness in reporting an election. Never before have newspapers — with the exception of the New York Times , which always mixes reporting news with editorialising — allowed reporters to express their opinions in so-called news stories. And the TV reportage was just as bad. You know the kind of thing: the pursed lips and air of healthy scepticism when it came to anything resembling a pro-Trump comment; the head tilt of doubt in response to any Trump announcement; the look of outraged authority when anyone defended Trump. The ones I found amusing were the lightweights of Vogue , those narcissistic onanists who somehow viewed Trump as an American version of Brexit. His hair and make-up was an affront to their preening self-importance. They minced their way to Hillary. \\n\\nBut the Donald has won and, best of all, the New York Times , the Washington Post , the New Yorker and the three main networks have once and for all disgraced themselves by proving they have no idea what this country is about. Yippee! \\n'"}, "time": 1742563315.6760733}