{"duration": 0.11028265953063965, "input_args": {"text": "\"Share on Facebook A leaked Hillary Clinton email has now confirmed that the Obama administration, with Hillary directing policy, orchestrated a civil war in Syria to benefit Israel's geopolitical interests and stability. The new Wikileaks release shows that Clinton, then Secretary of State orchestrated the war in Syria to overthrow the government of President Assad, because it is “best way to help Israel”. Newobserveronline.com reports: The document was one of many unclassified by the US Department of State under case number F-2014-20439, Doc No. C05794498 , following the uproar over Clinton's private email server kept at her house while she served as Secretary of State from 2009 to 2013. Although the Wikileaks transcript dates the email as December 31, 2000, this is an error on their part, as the contents of the email (in particular the reference to May 2012 talks between Iran and the west over its nuclear program in Istanbul) show that the email was in fact sent on December 31, 2012. The email makes it clear that it has been US policy from the very beginning to violently overthrow the Syrian government—and specifically to do this because it is in Israel's interests. “The best way to help Israel deal with Iran's growing nuclear capability is to help the people of Syria overthrow the regime of Bashar Assad,” Clinton forthrightly starts off by saying. Even though all US intelligence reports had long dismissed Iran's “atom bomb” program as a hoax (a conclusion supported by the International Atomic Energy Agency), Clinton continues to use these lies to “justify” destroying Syria in the name of Israel. She specifically links Iran's mythical atom bomb program to Syria because, she says, Iran's “atom bomb” program threatens Israel's “monopoly” on nuclear weapons in the Middle East. If Iran were to acquire a nuclear weapon, Clinton asserts, this would allow Syria (and other “adversaries of Israel” such as Saudi Arabia and Egypt) to “go nuclear as well,” all of which would threaten Israel's interests. Therefore, Clinton, says, Syria has to be destroyed. Iran's nuclear program and Syria's civil war may seem unconnected, but they are. What Israeli military leaders really worry about — but cannot talk about — is losing their nuclear monopoly. An Iranian nuclear weapons capability would not only end that nuclear monopoly but could also prompt other adversaries, like Saudi Arabia and Egypt, to go nuclear as well. The result would be a precarious nuclear balance in which Israel could not respond to provocations with conventional military strikes on Syria and Lebanon, as it can today. If Iran were to reach the threshold of a nuclear weapons state, Tehran would find it much easier to call on its allies in Syria and Hezbollah to strike Israel, knowing that its nuclear weapons would serve as a deterrent to Israel responding against Iran itself. It is, Clinton continues, the “strategic relationship between Iran and the regime of Bashar Assad in Syria” that makes it possible for Iran to undermine Israel's security. This would not come about through a “direct attack,” Clinton admits, because “in the thirty years of hostility between Iran and Israel” this has never occurred, but through its alleged “proxies.” The end of the Assad regime would end this dangerous alliance. Israel's leadership understands well why defeating Assad is now in its interests. Bringing down Assad would not only be a massive boon to Israel's security, it would also ease Israel's understandable fear of losing its nuclear monopoly. Then, Israel and the United States might be able to develop a common view of when the Iranian program is so dangerous that military action could be warranted. Clinton goes on to asset that directly threatening Bashar Assad “and his family” with violence is the “right thing” to do: In short, the White House can ease the tension that has developed with Israel over Iran by doing the right thing in Syria. With his life and his family at risk, only the threat or use of force will change the Syrian dictator Bashar Assad's mind. The email proves—as if any more proof was needed—that the US government has been the main sponsor of the growth of terrorism in the Middle East, and all in order to “protect” Israel. It is also a sobering thought to consider that the “refugee” crisis which currently threatens to destroy Europe, was directly sparked off by this US government action as well, insofar as there are any genuine refugees fleeing the civil war in Syria. In addition, over 250,000 people have been killed in the Syrian conflict, which has spread to Iraq—all thanks to Clinton and the Obama administration backing the “rebels” and stoking the fires of war in Syria. The real and disturbing possibility that a psychopath like Clinton—whose policy has inflicted death and misery upon millions of people—could become the next president of America is the most deeply shocking thought of all. Clinton's public assertion that, if elected president, she would “ take the relationship with Israel to the next level, ” would definitively mark her, and Israel, as the enemy of not just some Arab states in the Middle East, but of all peace-loving people on earth. Related:\""}, "time": 1742564153.1414437}