{"duration": 0.07714009284973145, "input_args": {"text": "'Michelle Runs Her Nasty Mouth At Trump, Then Karma Smacks Her In The Face Posted on October 31, 2016 by Amanda Shea in Politics Share This Hillary Clinton and Michelle Obama at Clinton’s campaign stop in North Carolina \\nMichelle Obama has been hot on the campaign trail to help Hillary Clinton replace her corrupt husband, proving that Democrats care more about power than the American people. After dropping everything for “her girl” Hillary and running to North Carolina to speak on her behalf, Michelle ran her mouth about Donald Trump, but it immediately came back to bite her. \\nWhile Trump is capable of doing his own talking and campaigning, Hillary needs a lot of help to make it through this election season, and she’s getting it from a number of Democrats, namely, the Obamas. Both Michelle and Barack Obama have campaigned for the ailing criminal candidate numerous times, including at her North Carlina stop on Thursday where Michelle acted as Hillary’s sorority sister more than her campaign supporter, after completely bashing Trump. \\nAccording to the Daily Mail , the two “First Ladies” acted as if the campaign stop was a teenage popularity contest as they stood on stage like a couple of best friends, who are actually enemies. Only able to discuss what makes Hillary so great by trash-talking Hillary’s opponent, Michelle said, “We want a president who takes this job seriously and has the temperament and maturity to do it well. Someone who is steady. Someone who we can trust with the nuclear codes.” \\nApparently, Michelle wasn’t paying attention to the presidential debates when her gal pal committed treason by spilling what America’s nuclear response time is. Seemingly forgetting who she was talking about and all that this woman is accused of, sanctimonious Michelle rambled on about what an awesome example Hillary is for our children as if we’re supposed to take parenting advice from a mother who raises her daughters around foul-mouthed rappers. \\n“We know the influence our president has on our children,” she later added. “They turn on the TV and they see the most powerful role model in the world – someone who shows them how to treat others. How to deal with disappointment. Whether to tell the truth. They’re taking it all in.” In making this statement, she didn’t realize she was actually speaking against Hillary, who is the opposite of the honest role model she described. The label is more fitting for Trump. \\nShe closed her speech with a declaration of desperation, pleading with the crowd that if nothing else, choose Hillary because as “First ladies, we rock.” Then, she begged anyone who would listen to keep “working your hearts out for my girl.” This little cheerleading act is very convenient, but it backfired on Michelle when the past came back to haunt her. Hillary isn’t “her girl.” In fact, they’re “frenemies” at best since she was previously recorded talking behind Hillary’s back, saying, “If you can’t run your own house, you can’t run the White House,” in reference to Bill Clinton’s extra-marital affairs. \\nLike “her girl,” Michelle proved herself as a hypocrite in her statements and got a huge dose of karma the next day for supporting Hillary when the FBI announced they are re-opening the investigation into the Democratic candidate’s e-mails. Neither one of these two women or their husbands are “powerful role models” who “tell the truth,” and they certainly aren’t people any child should be looking up to.'"}, "time": 1742563964.3924193}