{"duration": 1.3614611625671387, "input_args": {"text": "'HOUSTON  —   Venezuela had a plan. It was a tactical approach, designed specifically to take Lionel Messi and the other dangerous Argentine attackers out of the game by applying forward pressure and forcing Argentina to make long, hopeful passes. And it worked for about seven minutes. But in the eighth minute, Messi conjured the kind of technical genius that compels most observers to call him the best soccer player in the world, artfully lifting a perfect pass about 15 yards in to Gonzalo Higuaín. With one striking touch, Higuaín converted it into a goal, the first in Argentina’s   victory on Saturday in a Copa América Centenario quarterfinal. In that decisive moment, like so many others experienced by opponents hoping to stop Messi, all of Venezuela’s carefully conceived defensive tactics were laid to waste. “They have that stroke of genius that changes all your schemes,” Venezuela Coach Rafael Dudamel said. “They had an incredible pass from Messi, and they scored. ” Messi has frequently had brilliant strokes like that one, and now it is the United States’ turn to try to find a way to suppress them. The United States earned a spot in Tuesday’s Copa América semifinal here at NRG Stadium by beating Ecuador, but the dubious prize awaiting them is Messi, Argentina’s mesmerizing,    dribbling, passing and shooting virtuoso. “This is special,” United States Coach Jurgen Klinsmann said. “Absolutely, it’s special to play against these type of players. When you get the opportunity to play against one of the biggest players in the world, you want to raise your game you want to enjoy it. ” The United States has had few chances to play a meaningful game against a star of Messi’s caliber who also played on such a quality team. (FIFA has Argentina ranked No. 1 in the world.) Tuesday’s match will be the rough equivalent of taking on Pelé’s Brazil in 1970 or Ferenc Puskas’s Hungary in 1954 or the team led by that other Argentine soccer genius, Diego Maradona, in 1986. As Klinsmann noted, the United States was seconds from beating Portugal at the 2014 World Cup until Cristiano Ronaldo  —   who has at times been considered Messi’s equal  —   provided a gorgeous cross that enabled Portugal to tie the game. Over the years, the United States has faced the likes of England’s Wayne Rooney at the 2010 World Cup, Brazil’s Ronaldinho at the 1999 Confederations Cup and Italy’s Paolo Maldini, one of the best left backs in history, at the 1990 World Cup, as well as Brazil’s duo of Bebeto and Romário and Romania’s Gheorghe Hagi, some of the top players of their era, at the 1994 World Cup. At the 1934 World Cup, the United States lost by   to Italy, and one of the goals was scored by Giuseppe Meazza, whom some historians consider the best player Italy has produced. At the 1998 World Cup, Klinsmann scored against the United States toward the end of his prolific career as one of the most dangerous attackers for the world champions West Germany and Germany. But in recent memory, there is nothing that quite resembles Tuesday’s challenge. Two years ago Ronaldo did not enjoy the kind of team support from Portugal that Messi does now with Javier Mascherano, Ángel Di María (when healthy) Sergio Agüero and particularly Higuaín, Argentina’s penetrating No. 9, who scored twice against Venezuela. Spend too much time focusing on either Messi or Higuaín, and the other could act decisively. “We have two strikers who are really exceptional,” Gerardo Martino, Argentina’s coach, said after Saturday’s match. “I cannot repeat it enough I really feel this. People in Argentina have a hard time accepting the quality of soccer players that we have. We have two No. 9s, and we proceed with what we feel is best. ” Martino watched Venezuela hack down Messi several times in the quarterfinal game and said the United States would certainly use every possible means to stop him. “I just hope that every possible way is a legal way,” he said at a news conference Monday. As superb as Messi is, some believe that he will not have achieved his true potential until he wins a major trophy for Argentina, just as he has numerous times for the club team Barcelona. But after tying Gabriel Batistuta’s record of 54 international goals for Argentina on Saturday, Messi said he felt no pressure. “I’m always going to be in there,” Messi said. “I’m very calm. ” In Maradona’s time, Argentina also had strong supporting players like Claudio Caniggia, Jorge Valdano, Jorge Burruchaga and later Batistuta. But like Messi, Maradona was the team’s clear supremo. When the United States beat Argentina,   at the 1995 Copa América, Maradona was no longer playing for his country. But Klinsmann had the chance to play against Maradona several times. In the 1990 World Cup, West Germany beat Maradona’s Argentina,   in a dismal final in Rome. “You are talking about two wonderful players, the best in the world in their time,” Klinsmann said, referring to Maradona and Messi. “It’s now Messi’s time, and when I had the opportunity to play many games against Maradona, it was Maradona’s time. We all admire these players. But there are also ways to stop them. I am not the type of person who pulls out old stories and tells the players how we did it. That’s not me, but there are ways to play against these wonderful players. ” Klinsmann showed his team video scouting reports of Messi and Argentina and said his players needed to give 10 to 15 percent more in order to achieve an upset Tuesday. But the Argentines are not infallible, he added. They have not won a major tournament in over 20 years, and Messi’s team has come up short twice in the last two years. Germany beat La Albiceleste, as Argentina is known, in the final of the 2014 World Cup, and Chile won in the final of last year’s Copa América. Both times, it took champions to beat Messi and Argentina. “You guys are probably worrying more about Messi than we are,” the United States’ captain, Michael Bradley, told reporters. “Very good player. That’s also probably an understatement. It’s still a soccer game with 11 of their guys against 11 of our guys. ”'"}, "time": 1742562898.8012342}