{"duration": 0.11962366104125977, "input_args": {"text": "'Good morning. (Want to get California Today by email? Here’s the  .) Let’s turn it over to Adam Nagourney, our Los Angeles bureau chief, for today’s introduction. LOS ANGELES  —   And on Thursday, it rained. Again. The arrival of another winter rain here, a wet end to a week that began with heavy snows in the Sierra Nevada, has begged a welcome question: Is the drought that punished California for six years over? No question California has turned a corner. There was more rain in Los Angeles in December than since the drought began for better and worse. The rain this week shut down Laurel Canyon Boulevard after the waterlogged porch of a house collapsed into the roadway, and flash flood warnings were issued in Los Angeles as storms swept back and forth across the area on Thursday evening. In Northern California, the storms produced extensive flooding in Sonoma County and around Sacramento  —   among the   parts of the state. Ski resorts reported that 12 feet of snow fell in Tahoe. Mudslides closed Interstate 80 as the storm passed through Sierra Nevada. At least five people have died, officials said. Reservoirs that were parched last year are close to capacity. The snowpack  —   which keeps the water flowing into the early summer as the snow melts  —   is 161 percent of normal. The United States Drought Monitor for this week reported that 42 percent of the state was out of drought conditions, compared with 3 percent last year. “In terms of surface water, most of California is no longer in drought,” wrote Jay Lund, the director of the Center for Watershed Sciences at the University of California in Davis. Still, winter is not even half over. Many years have started off wet and gone completely dry. Climate change has produced higher temperatures, which could melt away the snowpack before summer. And parts of the state remain dry. But after six years of mandatory conservation orders, there seems reason for celebration. “This series of storms has done more than make a dent in the drought, which is a huge relief,” said Felicia Marcus, the head of the State Water Resources Control Board. “But it’s a little early to have a drought’s over party. ” (Please note: We regularly highlight articles on news sites that have limited access for nonsubscribers.) • Congratulations, Los Angeles, on getting the Chargers. Now you have two terrible football teams. [The New York Times] • The Chargers’ move will add even more money for owners amid growing uncertainties facing the league. [The New York Times] • As rains soak California, farmers are testing how to store water underground. [NPR] • A landmark study found marijuana to be an effective medicine, but with drawbacks. [San Francisco Chronicle] • Levi Felix, who wanted people to untangle themselves from technology, died in Pismo Beach. He was 32. [The New York Times] • An innovative development in Orange County will place homeless veterans in repurposed shipping containers. [Orange County Register] • It’s not just how berries taste, it’s how they’re perceived. A sensory analyst in Watsonville explains. [The New York Times] • No one understands our new era of   populism better than Bravo’s Andy Cohen. [The New York Times] • In East Hollywood, Virgil Normal is where the cool kids shop. [The New York Times] • A debut novel gets inside the heads of Marin County teenagers who have sharpened their claws on social media. [The New York Times] • The Daily 360 Video: At the border near San Diego, separated family members reunite through the fence. [The New York Times] • President Obama granted national monument status to 6, 230 acres of land in California. [KPCC] “Hello, I’m Johnny Cash. ” That opening line, as if the assembled audience needed any introduction, gave way to a giddy roar and then, one of country music’s great performances. It was on this day in 1968 that Johnny Cash played his “At Folsom Prison” concert. The event was meant to revive Mr. Cash’s career, which had flagged since the 1950s thanks to an    amphetamine habit. Executives at Mr. Cash’s record label, Columbia Records, saw him as so unreliable that they kept the planning of the Folsom show a secret from the press, said Robert Hilburn, author of “Johnny Cash: The Life. ” They weren’t certain he would show. Thankfully, he did. “And he was incredible. It was like he sensed this was a moment,” said Mr. Hilburn, who himself attended the concert after hearing about it from a disc jockey. Mr. Cash tailored his song choices along themes of longing, sin and misfortune, including, of course, his 1955 hit “Folsom Prison Blues. ” Assembled in the heavily guarded Dining Room 2, the inmates couldn’t get enough. “You could just sense their spirit rising,” said Mr. Hilburn. “It was just electrifying. ” The band actually performed twice, in the morning and afternoon, to ensure a good recording. “At Folsom Prison” drew largely from the first show and was released four months later. It was a huge success and kicked off a resurgence in Mr. Cash’s popularity. A year later, he did another prison record, “At San Quentin,” which was also successful. In the wake of the performances, he became a prominent voice for prisoner rights. California Today goes live at 6 a. m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes. com. The California Today columnist, Mike McPhate, is a   Californian  —   born outside Sacramento and raised in San Juan Capistrano. He lives in Davis. Follow him on Twitter. California Today is edited by Julie Bloom, who grew up in Los Angeles and attended U. C. Berkeley.'"}, "time": 1742562768.8850725}