{"duration": 0.1115727424621582, "input_args": {"text": "\"The Free Alabama Movement (FAM), one of the groups leading the national prison strike against slavery, argues an intentional lack of access to educational and rehabilitative opportunities foments violence and is central to maintaining an exploitative labor system within prisons.\\n“What is the best way to keep a population of people, where we can exploit them and put them in this system? The best way to do it is to keep us ignorant and uneducated, and thats how its working,” said Bennu Hannibal Ra-Sun, a member of FAM incarcerated at the Donaldson Correctional Facility.\\nThis violence and other related issues, like overcrowding, recently motivated the United States government to announce an investigation into the Alabama prison system. Officers at one facility refused to go to work in recent months in protest against an administration they believe failed to protect them from an unruly population.\\nAccording to statistics [ PDF ] from the Alabama Department of Corrections, the number of prisoners graduating General Education Development (GED) courses and completing drug treatment has fallen since 2007-08. Eight hundred and seventy-two people received their GED while incarcerated in Alabama in 2007, a number that was at 412 in 2014 before rising to 694 in 2015.\\nAlabama Department of Corrections GED recipients, 2007-2015. Data provided by Alabama Department of Corrections; Graph by Shadowproof.\\n“There’s no intervention between the issues that [a person] had when they came to prison and the time that they’ll spend in prison,” Bennu said.\\n“Right now, you got a block where, inside of the dorms, you got 100-200 people. There’s not a single bookshelf in there,” he continued. “There’s not a writing table. There’s no magazines. There’s no dictionaries. There’s no pictures on the walls, ABC’s, 1-2-3’s.”\\n“You remember when we go to school? You know that you’re in an educational environment. There’s pictures and books on the walls, ‘A mind is a terrible thing to waste’—these reinforcements. They don’t have any of that. In these blocks, there’s a TV, a microwave, and a coffee pot, and then there’s just a bunch of bodies strewn all over the place,” Bennu said.\\nSuch programs can make a real difference in the environment inside a prison. “In the Convicts Against Violence Program, we had conflict resolution classes, we had mediation classes. We had peer leadership for gang members to teach them not to be leading guys down the wrong path. So we can make them better leaders by teaching them from a book called, ‘The 21 Laws of Leadership.’ We teach from that book and taught guys leadership skills. So we were able to occupy these guys time.”\\n“These are guys that normally are laying around waiting on the next joint to come through, waiting for the next batch of heroin to fall in, waiting on the next batch of ice to come in,” Bennu said. “But instead of that they’re in class. They’re watching educational DVDs They’re in leadership classes. They’re in group circles.”\\nPrisons that do not provide much programming and rehabilitation commonly do so for punitive or budgetary reasons (or both). But Bennu argued doing so comes with the cost of a volatile population. “We’re filling that time, creating new habits, creating new patterns, creating new thought processes, and so we’re making people more responsible, more mature. But if they don’t allow us to do that, then they’re time is filled with nothing. Whatever happens, they’re gonna jump in and get involved.”\\n“They changed the rule now,” Bennu said. “You can’t go to school no more until you’re within 5 years of your [end of sentence] date. So you come to prison, and you can’t read or write and you don’t have a skill or trade, and you got 20 years. You’ll do 15 years in prison before you go to school. So you gonna develop these bad habits for 15 years, and now they think you’re gonna change with five years to go, but you’re going home anyway. So you don’t even need that shit.”\\nAlabama Department of Corrections Statistics show the number of people completing drug treatment has fallen by more than one half since 2008—from 4,807 to 2,567 in 2016.\\nAlabama Department of Corrections prisoner completing drug treatment, 2008-2015. Data provided by Alabama Department of Corrections; Graph by Shadowproof.\\n“If you have heroin problems, you still got it. Now you’ve got 15 more years of heroin addiction and they’re talking about going to GED—how you gonna get a heroin addict, a full blown heroin addict into a GED class? And he’s not 19 now, he’s 34 now,” Bennu said.\\nBob Horton, a spokesperson for the Alabama Department of Corrections, responded to questions about declining numbers of GED graduates by stating, “The average [GED] completions over the span of years cited is 617 annually. The report reflects 694 completions in 2015, which is actually a substantial increase. FY 2014, which runs Oct 2013 through September 2014, saw a decline, and it is our understanding the requirements for completion was substantially changed during that timeframe.”\\n“The drug treatment numbers have declined for a couple of reasons,” Horton said. “One, because of a shortage of counselors, and two, inmates not meeting the criteria by testing positive for drugs while participating in the program.”\\nHorton said the DOC was short 20 counselors twelve months ago, but through an “intensive effort to hire the needed professionals to administer the program,” that number has improved. The department is working toward filling the twelve remaining counselor positions, he said, while also implementing an “evidenced-based method for evaluating the success rate of the Substance Abuse Treatment program offered to offenders.”\\n“Effective rehabilitation and education programs have been proven to reduce violence in prisons, which are of course occupied by a large number of inmates in a confined area, and who have documented violent backgrounds,” Horton agreed.\\n“Beyond the obvious portals of perimeter security elements and building design, construction, and layout, effective classification and segmentation is the primary means to accomplish our primary mission of protecting the public, staff, visitors, and inmates themselves. Also inherent in our mission is the effort to provide rehabilitative tools, which the ADOC has done for decades.”\\n“There are a plethora of programs,” Horton said, such as psycho-social, educational, religious, and hybrid programs, “which exist in every ADOC prison. They are not all reflected in the statistical reports.”\\nBennu agreed the statistics don’t provide the full picture of the options available to those inside Alabama prisons, but not in the same way Horton was suggesting. “Some of these numbers are skewed by the fact that some of these people bought their certificates,” Bennu said. “It’s very easy.”\\n“Let’s say I go to a prison, and they got a program,” he offered as a hypothetical example. “I go down there, I see one of the people who’s over there in the program. I’m gonna pull up on him and I’m gonna say, ‘Hey man, how’d you get into this program?’ Well you got to fill out these applications. I fill out the applications so I can go on the waiting list.”\\n“Or, I can pull back up on that guy and say, ‘Man, I got two bags of coffee, now go on and get me in the program.’ Boom, he’s getting me in the program and that’s that.”\\n“Once I get in the program, they got tutors and stuff looking over classes,” Bennu continued. “So I pull up on the tutor—he might be a heroin addict, he might be a weed head—and I say I’m not gonna come to class, you just mark me present every day for six weeks and then give me the certificate. And I can pay him $25-50, whatever the cost may be, and then I’ve bought my certificate.”\\nBennu argued the system works this way intentionally because the state has no incentive to rehabilitate prisoners. The cycle of recidivism that results from not helping prisoners get better is essential to maintaining the labor force.\\n“As long as we get back out and can force other people into a lifestyle of crime and to keep that culture alive that they’ve created through this rap music and through these movies and this Scarface—As long as they have us to keep this culture alive, it’s a self perpetuating process,” Bennu contended.\\nAn educated prisoner poses a threat to the system, he said, because they have the power to learn about and challenge their conditions of confinement. “I’ll just give you an example. I’m in a cell right now. The lights are out. The vents are full of filth. The cell is small. Well, if I can’t read or write, then I don’t know that there are health codes against this. I don’t know that I have human rights and some of these things.”\\n“When you have a fully educated and engaged population, you can’t get over on us the way that you can when we don’t know any better. It serves their interest for us not to know what the health department says about the way that they’re serving the food in the kitchen or the labor conditions that we have or how we were violated in court.”\\n“They don’t want us to get out and become competitive in the job market,” he continued. “They want to keep these jobs in prison where they don’t have to pay us anything so its cheaper for them. It’s just the cost of doing business. That’s what it boils down to for these people, it’s the cost of doing business.”\\nBennu said this practice parallels the time of chattel slavery in America, when it was illegal for a slave to learn to read and write.\\n“In prison today, I’m in solitary confinement. The rules say I cannot receive any books, I got people on this block with me that can’t read and write. They won’t let them even get a GED book back here, but they’re sitting in the cell all day doing nothing,” Bennu suggested. “No books. No newspapers. No magazines. No reading material. No education material. And we’re just sitting in here. So there’s no way, and when I asked them about it they say, ‘Well we don’t want to reward them for bad behavior. We want to make sure they’re punished.'”\\n“But show me scientifically where punishment has been proven to be an effective method because if punishment worked, we wouldn’t have recidivism. They’re punishing us beyond the pale. So it’s obvious that it doesn’t work. They know it doesn’t work, but it’s rhetoric that has been used so long that even they believe.”\\nBennu pushed back on the notion that punishing prisoners by restricting their participation in such programs is in the best interest of society. “It is not mandatory that I get anger management. It is not mandatory that I get treatment for my addictions. It’s not mandatory that I get a GED. It’s not mandatory that I get a trade.”\\n“It’s only mandatory that I go to work in the kitchen or go to work in the farm or wherever they tell me to. When I get back to society, I still can’t read and write. I still don’t have a skill or trade. I still got an anger problem. I still got a drug problem. How am I better for society?”\\n“On top of that, if I get a 15-year sentence, I can earn good time in the Alabama Department of Corrections. How can I earn good time and I can’t read or write and it’s not mandatory for me to go to GED school?”\\n“See, if they wanted to make that person better by the end of their sentence, they’ll say you’re eligible for good time but you can’t get it unless you enroll in school. And when you get your GED you have to go get a trade. But then they’ll be making that person better and they don’t have any incentive to make that person better.”\\n“It’s little things like that that shows that if the system was concerned about public safety, which person is better? This person earning good time, which means he’ll be out soon, is it making him better to make him get a GED in order to earn that good time? Make him get that trade to get that good time, make him get anger management, make him get drug treatment—Is that gonna be the better person when he gets out?\\n“Or is that person gonna be better ’cause you’re making him go to work in the kitchen every day and he’s gonna get back out with all of the problems that he had when he went to prison?”\\nThe post Free Alabama Movement Links Prison Slavery To Lack Of Access To Education, Rehabilitation appeared first on Shadowproof .\\n\""}, "time": 1742628531.019883}