{"duration": 0.17470955848693848, "input_args": {"text": "'  15, 2016 How To Measure Water pH At Home \\nI was raised in the country and we had well water. It tasted good but it turned the tub, our clothes, and even our hair red. That’s because it had iron in it, which is a sign that the water was acidic. \\nTo combat this, we used a water filtration system, which increased the pH in the water by removing the excess metals in the water. \\nBut is water pH important for any other reason that white tubs? Yes it is! \\nWe’ve discussed the importance of pH before, in articles such as how to make wine and vinegar . Obviously, those two food items are acidic, which means that the pH in each of them is less than 7. Pure water has a pH of 7; a pH less than 7 is considered acidic and a pH greater than 7 is considered basic, or alkaline. \\nThe Visual Effects of Acidic or Basic Water \\nAs I stated above, the contents of your water have an aesthetic effect on clothes, dishes, and pipes. The average pH for surface water is 6.5-8.5. Normal groundwater is 6-8.5. If you go too far in either direction, higher or lower, you’ll likely see some physical evidence of it. \\nWater with a pH of less than 6.5 or so is acidic and often contains heavy metals such as iron, manganese, copper, lead, and zinc. Obviously, you don’t want to drink too much of these because of the damage that these metals can do to your health. We’ll discuss that in a bit. \\nAcidic water is corrosive and can damage pipes, stain laundry and appliances with a blue-green tint, and leave a buildup on dishes. It may also taste metallic. You may remember what the water tasted like coming out of the water hose when you were a kid; that’s similar to what acidic water may taste like. \\nThe way that you balance it is by adding a neutralizer such as soda ash (sodium carbonate). \\nWater with a pH higher than 7 is considered basic or alkaline, though it’s not really outside the realm of “normal” until it’s higher than 8 or 8.5. \\nAlkaline water is often high in calcium and will leave whitish scaly deposits on your dishes, utensils, tubs, and appliances and can clog your pipes. It also tastes a bit bitter, especially when you make your morning Joe, and can make it hard to get a lather out of soaps. \\nHealth Risks Associated with Water pH \\nI’ve written content for the holistic health and medical fields for a long time, and though there’s a certain following that says that water pH can change the pH of your body, there’s simply not enough evidence to corroborate that. Your body does a dang good job of balancing itself and saying that water pH can alter your blood pH is a stretch. \\nAlso, pH levels, in and of themselves, do not indicate the safety of water. For instance, arsenic may be present but not significantly affect the pH. \\nHowever, pH can be a good indicator that there are toxic substances such as heavy metals in your water because “soft” water (water with a low pH), can leach metal ions out of soil and pipes. For example, lead is never a good thing, and a low pH is an indicator that your water may contain lead or other poisonous metals. \\nOn the flip side, calcium found in water with an alkaline pH can balance some of this out. It can make some heavy metals such as lead, copper, and zinc less toxic. \\nCalcium can strengthen pipes by lining them with a protective coating, but it can also clog them if it builds up too much. You’ve probably heard the term, “hard water.” That refers to water with a high pH, because of the build-ups. In limed soil, calcium can immobilize iron and cause a shortage even if there’s plenty of iron in the soil. \\nAs you can see, the primary health concern when it comes to the pH of drinking water is consuming heavy metals. The important thing to remember is that pH is only one measure of water safely. It doesn’t necessarily tell you what other toxins such as fertilizers, fungicides, and other chemicals are in there. \\nThe Effects of Water pH on Soil \\nThe pH of water plays a much bigger role in other ways, though. The two biggest areas may be in how it affects soil and aquatic life. As we’ve already discussed, the calcium that’s typically found in alkaline water can affect how your plants absorb essential minerals such as zinc and iron. \\nAgain, pH isn’t the only factor; some fish that can survive in water with a pH as low as 4.7 will die at a pH of 5.5 if the water contains just a tick too much iron. PH isn’t everything, but it’s a good indicator. \\nPH is important to soil because some plants prefer an acidic soil and some prefer an alkaline soil. Planting in the correct soil will increase plant health and growth, and therefore yield. If you’re going to plant it, you may as well get as much bang for your buck as possible! \\nPH affects everything from the levels and types of good and bad bacteria in the soil to the texture of the soil itself. For instance, clay that is in the optimal range or 5.5-7 is granular and easy to work with. If it’s overly acidic or alkaline, it becomes sticky and hard to work with. \\nMost plants thrive in neutral or almost-neutral soils, but there are some that love acidic soil. These include radishes, blueberries, cranberries, sweet potatoes, parsley, peppers of all sorts, and rhubarb. The majority of plants can tolerate a mildly-acidic soil, but they’re much less tolerant to alkaline conditions. \\nThis is because minerals dissolve better in acidic soil. This sounds like a good thing, but only to a certain degree. A pH of about 5.5 is about as low as any plant will tolerate because below that, the concentration of metal ions, especially aluminum, manganese, and iron, become so high that they can inhibit plant growth. Phosphorus, calcium, and magnesium may also be less available. \\nFollowing the pattern, you may guess that alkaline soils inhibit the release of minerals and nutrients, which is why plants can’t tolerate those conditions. \\nIt’s important to test your soil and know your plants. The goal isn’t so much to achieve a certain pH as it is to make sure that the soil acidity is such that there aren’t any toxic metals and the nutrient availability is maximized. In other words, no poison, plenty of nutrients! \\nIf your soil is too acidic, you can neutralize it a bit using lime. Alkaline soils, on the other hand, aren’t as easy to adjust. Sometimes you can add sulfur or acid-forming fertilizers, but it’s probably easier just to add nutrients via fertilizer and compost. \\nNote that pH isn’t everything. Many sands have a great pH for growth but contain practically zero nutrients. That’s OK – you can always add nutrients . \\nImportance of pH in Streams \\nNow THIS is where water pH makes a real difference. We’ve already discussed how acidic water induces the release of minerals and we know that many of those minerals are toxic in high levels. \\nWhen the pH of water becomes too acidic due to contamination by acid rain or run-off that contains fertilizers or other acidic chemicals, it can be catastrophic to aquatic life. \\nMany plants and aquatic creatures are adapted to survive in a specific pH and can’t tolerate more than just a minuscule change. \\nNot only does the acid affect the nutrients in the water, it can also cause the same physical problems to fish and plants that they cause to your drains and pipes. \\nHeavy metals can accumulate on gills and even cause deformities on young, growing fish. The same idea goes for plants that grow in the water, except they’re affected by the pH in the soil as well as the water. \\nThe biggest issue here isn’t that one fish or one plant can’t tolerate a change; everything that eats that fish or plant, or is eaten by that fish, is affected as well. Aquatic systems are delicate and even a small change can cause huge ripples. \\nAs you can see, pH is just a number; it’s the changes that accompany that number that can cause problems or bring joy and growth. Keep an eye on the pH of your soil because it can change! \\nHow to Measure pH \\nThere are simple pH strips that you can buy at a pool store which use color strips to tell you what the pH of the water or soil is. If you’d rather do it the natural way, which is the way we usually prefer to do things, you have a couple of choices. \\nThe first way is to gather 1 cup of soil (total) from a few different parts of your garden. Add a couple spoonfuls to 2 separate containers, then add 1/2 cup vinegar to the soil in one container. If it fizzes, your soil is alkaline, with a pH between 7 and 8. If it doesn’t, add 1/2 cup baking soda to the other cup. If it fizzes, you have acidic soil. It’s a good guess that the pH is somewhere between 5 and 6. If it doesn’t fizz either time, you have neutral soil – congrats! \\nThe second way to test pH – and this works for soil and water – is to use a red cabbage. Yep, that’s right. Simmer 1 cup of red cabbage in two cups of distilled water for 5 minutes. Remove from heat and let it steep for another 30 minutes or so. \\nTo test your soil, place a couple of spoonfuls of your soil to a couple of containers, like you did before. It would be good this time around if the containers are clear. Strain the cabbage, keeping the water. It will be a purply-blue color and has a pH of seven – completely neutral. \\nAdd 1/4 cup or so of cabbage water to each cup, stir it up, and let it sit for 30 minutes. If the water turns pink, your soil is acidic. If it’s blue/green, your soil is alkaline. Video first seen on Carl Nelson . \\nTo test your water, simply substitute water for the soil. The same colors apply. \\nNow that you know a bit more about how and why pH makes a difference with your water and soil, try the tests. If you have something to add about pH, please feel free to comment in the section below. \\nThis   29 total views, 29 views today'"}, "time": 1742561778.618809}