{"duration": 0.04732704162597656, "input_args": {"text": "'Nula exhibición balompédica sobre campo desierto RESUMEN DE LA JORNADA 12 DE LA LIGA SANTANDER 2016-2017 Resumen de la jornada Betis 0-0 Las Palmas \\nEncuentro que terminó en tablas después de que el viernes por la noche ambos equipos no tuvieran a bien acudir al estadio penibético para disputar el choque. Tampoco acudió el público. Es de esperar una sanción del Comité de Competición para ambos equipos. Deportivo 0-0 Sevilla \\nPartido que debería haberse celebrado el sábado a las 13 horas y que, sin embargo, fue ignoradamente tratado por todos los implicados en el magno evento. De nuevo, esperable sanción del Comité de Competición. Atlético 0-0 Real Madrid \\nPrimer choque de la temporada entre los ex finalistas de la Champions. Es el “derby” por antonomasia pero, sorprendentemente, ninguna televisión se encargó de emitir un partido de tantos morbos aplazados entre la turba de Simeone y el equipo albino. Tampoco lo siguió ninguna radio ni medio impreso. Barcelona 0-0 Málaga \\nPoco se puede decir de este partido aparte de mencionar la indignación del periodista que escribe estas líneas porque el equipo de seguridad del Barcelona le impidió el acceso de forma sistemática al campo. En cualquier caso, pobre entrada al Camp Nou más allá de medio centenar de turistas ataviados de orientales maneras. Athletic 0-0 Villarreal \\nTampoco acudieron los leones a la catedral del fútbol para defenderse porque no había nadie atacando su marco insidiosamente. Alavés 0-0 Espanyol \\nTampoco acudieron al campo. Valencia 0-0 Granada \\nNaranjianos y granaderos estuvieron al tanto del partido que jugó el sábado la Selección española, partido de clasificación al mundial frente a Macedonia. Por ese egregio motivo, la duodécima jornada de liga se aplazó al próximo fin de semana. Fenomenal. Bien. Estupendo. Muchas gracias por avisar. Sporting 0-0 Real Sociedad \\nTremenda falta de respeto a un profesional que lleva tantos años dedicándose a esto. Algunos, además de periodistas, somos personas. Tampoco costaba nada hacer una llamada. Existe una cosa que se llama teléfono. Ahora está el WhatsApp ese también. Bastaba con un: “Oye, soy el redactor jefe de Deportes, esta semana no te hagas el resumen de los partidos, que no hay liga porque juega la Selección”. Pero no, eso es mucha molestia. Leganés 0-0 Osasuna'"}, "time": 1742563042.9926605}