{"duration": 0.06795644760131836, "input_args": {"text": "\"Russian oil giant Rosneft to restore Romanov palace near St. Petersburg   The residence, which is in a state of disrepair, will be rented to the Russian oil corporation for 99 years and will be opened to tourists following restoration. Facebook rosneft , RBTH Daily , romanov dinasty , st. petersburg The Ropsha Palace was built by decree of Peter the Great. Source: Lori/Legion-Media \\nThe Ropsha Palace, an 18th-century residence near St. Petersburg built by order of Peter the Great, is to be rented to the state-owned Rosneft oil corporation for 99 years. \\nMaking the announcement on Oct. 25, Russian Culture Minister Vladimir Medinsky said that the company will restore the palace, which is in a state of disrepair, and will create access for tourists to the estate after restoration. What is the palace famous for? \\nThe Ropsha palace and park ensemble is an 18th-century architectural monument and a former residence of the Romanov imperial family. The estate was built by decree of Peter the Great and was intended to resemble Carlsbad (Karlovy Vary, Czech Republic). Later, during Empress Elizabeth's reign, Italian architect Bartolomeo Rastrelli designed a new two-story palace on the site. A large-scale park was cultivated around it. \\nAfter Catherine II (the Great) usurped her husband Emperor Peter III, she sent him to Ropsha where he died in mysterious circumstances. \\nThe Ropsha Palace before 1917 / Source: public domain \\nFollowing the October Revolution the palace was nationalized, and in 1944 it was burned by the retreating German troops. After the war the estate was restored and it was used for military purposes: First the summer unit was stationed there, then the chemical protection battalion from the Leningrad Military District. \\nIn various periods a fish hatchery was located at Ropsha, as well as a cattle-breeding farm, a poultry farm and other agricultural structures. \\nIn the 1960s the palace was placed under state protection and at the end of the 1970s it was mothballed. How much will it cost to restore the ruins? \\nDespite the fact that since 1990 the Ropsha palace and park ensemble has been on the UNESCO World Heritage list and is a monument of federal significance, most of the buildings on the estate are in ruins. \\nThe palace after the fire / Source: Kommersant \\nThe palace was severely damaged by several fires in the late 1980s and early 1990s. And in 2015 five columns in the palace's portico collapsed. Afterwards, the Russian Culture Ministry allotted 15 million rubles ($241,000) for urgent work to save the monument. \\nSt. Petersburg officials say that many monuments in Ropsha are heavily damaged and some, such as bridges and hydraulic structures, are completely destroyed. This means the overall cost of the restoration may exceed five billion rubles ($80 million). Why is the state looking for investors to restore the monuments? \\nSince the high costs and great difficulties in restoring cultural heritage objects do not always permit the state to carry out the work using budget resources, commercial enterprises and patrons are often invited to fund the restoration projects. \\nThe palace after the fire / Source: Kommersant \\nFor example, VTB Bank and the Gatchina Alcohol Factory financed most of the restoration of the Gatchina Palace near St. Petersburg, although the monument remained a government property. \\nThe state can decide to auction or rent cultural heritage objects and dictate the conditions for their renovation. Privatization of local, regional and even federal monuments has existed since Jan. 1, 2008. \\nThere are more than 100 examples of privatized monuments with conditions for their restoration. For example, the recently opened New Holland complex in St. Petersburg was reconstructed with the help of Roman Abramovich's New Holland Development.\""}, "time": 1742563495.3452375}