{"duration": 0.026368379592895508, "input_args": {"text": "'A prominent Italian rabbi has denounced what he sees as a growing Catholic undercurrent “of resentment, intolerance, and annoyance” toward Judaism, exacerbated by the Pope’s “careless” repetition of   stereotypes. [In an open letter, Rabbi Giuseppe Laras, the former chief rabbi of Milan, expressed his dismay that despite important advances in   relations, the Pope seems to repudiate them with his use of   rhetoric in his homilies.  “What a shame,” Rabbi Laras writes, that the official documents of the Catholic Church regarding the Jewish faith “should be contradicted on a daily basis by the homilies of the pontiff, who employs precisely the old, inveterate structure and its expressions, dissolving the contents of the aforementioned documents. ” As one example, the rabbi referenced the Pope’s preaching on the law of “an eye for an eye,” which, he said, the pontiff recently evoked “carelessly and mistakenly,” leading to a misrepresentation of the meaning of the law for Judaism. Rabbi Laras is not the first Jewish leader to voice his displeasure over the pope’s frequent references to the “hypocrisy” of the Jewish Pharisees and the “legalism” of the Jewish doctors of the law. Already in 2015, the chief rabbi of Rome, Riccardo di Segni, said that he had taken his complaints about the Pope’s preaching directly to the pontiff himself, explaining exactly what he found offensive about his homilies. In his letter, Rabbi Laras associates the Pope’s treatment of Judaism to what he sees as a broader problem with contemporary Catholic discourse involving the Jewish faith. Laras wrote that he was not alone in this impression, identifying a number of “disquieting facts,” which “many of us have felt in the air for quite some time. ” These “disquieting facts” include “a substantial distrust of the Bible and a subsequent minimization of the Jewish biblical roots of Christianity,” which, he said, seemed to indicate a new form of the ancient Christian heresy of Marcionism, which held that the God of the Old Testament was fundamentally different from the God worshiped by Christians. The biblical dichotomy between Old and New Testaments, Laras argues, signals “the resumption of the old polarization between the morality and theology of the Hebrew Bible and of Pharisaism, and Jesus of Nazareth and the Gospels. ” The rabbi also underscored the Church’s “embracing of Islam, which is all the stronger as the Christian side is more critical toward Judaism, now including even the Bible and biblical theology. ” He also identified an undercurrent “of resentment, intolerance, and annoyance on the Christian side toward Judaism. ” These and other troubling signs were made very apparent by a recently published event guide for the upcoming fall conference of the Italian Biblical Association (ABI) Rabbi Laras contended. “I observe with the highest displeasure and concern that this ABI program is substantially a defeat for the presuppositions and contents of   dialogue,” he wrote, “which for some time now has been reduced, sadly, to fluff and hot air. ” “I am, and this is a euphemism, very indignant and embittered!” he said. Some Vatican observers have suggested that the Pope’s remarks that have angered the Jewish community stem not so much from any   on the Pope’s part as from his “carelessness in speech” allied to his dislike of doctrinal precision. “He is possessed of so negative an attitude toward theology that he fails to frame his comments with the requisite precision,” wrote Father Peter Stravinskas, author of The Catholic Church and the Bible, in a recent essay. At the core of the issues that have so distressed Rabbi Laras, he contends, is the Pope’s deep dislike of doctrine, theology and Canon Law. “Francis consistently pits ‘the Law’ against ‘the Gospel,’” Stravinskas writes, and his “allergic reactions to law make him see stark differences where complementarity is more in order. ” “Francis rails against law because of his predisposition against canon law and canon lawyers  —   as well as moral theologians who represent the consistent trajectory of Catholic morality,” he wrote. As a result, the Pope’s “uninformed and tendentious statements risk setting   relations back decades, if not centuries,” Stravinskas claimed. Follow Thomas D. Williams on Twitter Follow @tdwilliamsrome'"}, "time": 1742628580.2200294}