{"duration": 0.14304351806640625, "input_args": {"text": "'\\nThis article was written by Michael Snyder and originally published at his Economic Collapse blog . \\nEditor’s Comment: The past many months have carried a lot of noise about the coming crash, about a tipping point that may be fast approaching. The economics are simply giving way, and they can’t hold the illusion forever. Now that Donald Trump will be calling the shots, the money powers can usher in collapse if they wish, and have ready their scapegoat. It won’t just be Trump the man or the president, but the people who elected him, who backed Brexit and who gave up on their system. They people who let loose the chaos that now consumes us. \\nTheir rage, their anger and their desperation is brewing unrest. The ascent of populism in the political arena has put the establishment in retreat, and revealed, at last, a most dangerous atmosphere, from which collapse can properly precipitate … one in which all regulatory steadiness on the part of the system has been thrown off balance and out of whack by popular revolt. By the time the hammer falls, and the markets fall to the ground, the people rioting in the streets and losing their civility when ATMs stop working and store shelves go empty – these people will become the face of the disaster. The banks have been planning the next rise and fall for sometime; the next phase is all digital, and tightly monitored and controlled. \\nWe Are Being Set Up For Higher Interest Rates, A Major Recession And A Giant Stock Market Crash \\nby Michael Snyder\\nSince Donald Trump’s victory on election night we have seen the worst bond crash in 15 years . Global bond investors have seen trillions of dollars of wealth wiped out since November 8th, and analysts are warning of another tough week ahead. The general consensus in the investing community is that a Trump administration will mean much higher inflation, and as a result investors are already starting to demand higher interest rates. Unfortunately for all of us, history has shown that higher interest rates always cause an economic slowdown. And this makes perfect sense, because economic activity naturally slows down when it becomes more expensive to borrow money. The Obama administration had already set up the next president for a major recession anyway, but now this bond crash threatens to bring it on sooner rather than later.\\nFor those that are not familiar with the bond market, when yields go up bond prices go down. And when bond prices go down, that is bad news for economic growth.\\nSo we generally don’t want yields to go up.\\nUnfortunately, yields have been absolutely soaring over the past couple of weeks, and the yield on 10 year Treasury notes has now jumped “one full percentage point since July” …\\nThe 10-year Treasury yield jumped to 2.36% in late trading on Friday, the highest since December 2015, up 66 basis point since the election, and up one full percentage point since July!\\nThe 10-year yield is at a critical juncture. In terms of reality, the first thing that might happen is a rate increase by the Fed in December, after a year of flip-flopping. A slew of post-election pronouncements by Fed heads – including Yellen’s “relatively soon” – have pushed the odds of a rate hike to 98%.\\nAs I noted the other day , so many things in our financial system are tied to yields on U.S. Treasury notes. Just look at what is happening to mortgages. As Wolf Richter has noted , the average rate on 30 year mortgages is shooting into the stratosphere…\\nThe carnage in bonds has consequences. The average interest rate of the a conforming 30-year fixed mortgage as of Friday was quoted at 4.125% for top credit scores. That’s up about 0.5 percentage point from just before the election, according to Mortgage News Daily . It put the month “on a short list of 4 worst months in more than a decade.” \\nIf mortgage rates continue to shoot higher, there will be another housing crash.\\nRates on auto loans, credit cards and student loans will also be affected. Throughout our economic system it will become much more costly to borrow money, and that will inevitably slow the overall economy down.\\nWhy bond investors are so on edge these days is because of statements such as this one from Steve Bannon …\\nIn a nascent administration that seems, at best, random in its beliefs, Bannon can seem to be not just a focused voice, but almost a messianic one:\\n“Like [Andrew] Jackson’s populism, we’re going to build an entirely new political movement,” he says. “It’s everything related to jobs. The conservatives are going to go crazy. I’m the guy pushing a trillion-dollar infrastructure plan. With negative interest rates throughout the world, it’s the greatest opportunity to rebuild everything. Ship yards, iron works, get them all jacked up. We’re just going to throw it up against the wall and see if it sticks. It will be as exciting as the 1930s, greater than the Reagan revolution — conservatives, plus populists, in an economic nationalist movement.”\\nSteve Bannon is going to be one of the most influential voices in the new Trump administration, and he is absolutely determined to get this “trillion dollar infrastructure plan” through Congress.\\nAnd that is going to mean a lot more borrowing and a lot more spending for a government that is already on pace to add 2.4 trillion dollars to the national debt this fiscal year.\\nSadly, all of this comes at a time when the U.S. economy is already starting to show significant signs of slowing down. It is being projected that we will see a sixth straight decline in year-over-year earnings for the S&P 500, and industrial production has now contracted for 14 months in a row .\\nThe truth is that the economy has been barely treading water for quite some time now, and it isn’t going to take much to push us over the edge. The following comes from Lance Roberts …\\nWith an economy running at below 2%, consumers already heavily indebted, wage growth weak for the bulk of American’s, there is not a lot of wiggle room for policy mistakes.\\nCombine weak economics with higher interest rates, which negatively impacts consumption, and a stronger dollar, which weighs on exports, and you have a real potential of a recession occurring sooner rather than later. \\nYes, the stock market soared immediately following Trump’s election, but it wasn’t because economic conditions actually improved.\\nIf you look at history, a stock market crash almost always follows a major bond crash. So if bond prices keep declining rapidly that is going to be a very ominous sign for stock traders.\\nAnd history has also shown us that no bull market can survive a major recession. If the economy suffers a major downturn early in the Trump administration, it is inevitable that stock prices will follow.\\nThe waning days of the Obama administration have set us up perfectly for higher interest rates, a major recession and a giant stock market crash.\\nOf course any problems that occur after January 20th, 2017 will be blamed on Trump, but the truth is that Obama will be far more responsible for what happens than Trump will be.\\nRight now so many people have been lulled into a sense of complacency because Donald Trump won the election.\\nThat is an enormous mistake.\\nA shaking has already begun in the financial world, and this shaking could easily become an avalanche.\\nNow is not a time to party. Rather, it is time to batten down the hatches and to prepare for very rough seas ahead.\\nAll of the things that so many experts warned were coming may have been delayed slightly, but without a doubt they are still on the way.\\nSo get prepared while you still can, because time is running out.\\nThis article was written by Michael Snyder and originally published at his Economic Collapse blog . \\nMichael T. Snyder is a graduate of the University of Florida law school and he worked as an attorney in the heart of Washington D.C. for a number of years. \\nToday, Michael is best known for his work as the publisher of The Economic Collapse Blog and The American Dream . \\nIf you want to know what is coming and what you can do to prepare, read his latest book Get Prepared Now!: Why A Great Crisis Is Coming . \\n'"}, "time": 1742628299.4923167}