{"duration": 0.07255148887634277, "input_args": {"text": "'Three days after the presidential election, an astute law professor tweeted a picture of three paragraphs, very slightly condensed, from Richard Rorty’s “Achieving Our Country,” published in 1998. It was retweeted thousands of times, generating a run on the book  —   its ranking soared on Amazon and by day’s end it was no longer available. (Harvard University Press is reprinting the book for the first time since 2010, a spokeswoman for the publisher said.) It’s worth rereading those tweeted paragraphs: Mr. Rorty, an American pragmatist philosopher, died in 2007. Were he still alive, he’d likely be deluged with phone calls from strangers, begging him to pick their stocks. When “Achieving Our Country” came out, it received a mixed critical reception. Writing for this newspaper, the critic Christopher   called the book “philosophically rigorous” but took umbrage at Mr. Rorty’s warnings about the country’s vulnerability to the charms of a strongman, calling this prophesy “a form of intellectual bullying. ” Donald J. Trump enthusiasts might dispute the word strongman. But the essence of Mr. Rorty’s argument holds up surprisingly well. Where others saw positive trends  —   say, a   dawn chorus praising the nation’s diversity  —   Mr. Rorty saw dead canaries in a coal mine. His basic contention is that the left once upon a time believed that our country, for all its flaws, was both perfectible and worth perfecting. Hope was part of its core philosophy. But during the 1960s, shame  —   over Vietnam, over the serial humiliation of    —   transformed a good portion of the left, at least the academic left, into a disaffected gang of spectators, rather than agitators for change. A formalized despair became its philosophy. The system was beyond reform. The best one could do was focus on its victims. The result was disastrous. The alliance between the unions and intellectuals, so vital to passing legislation in the Progressive Era, broke down. In universities, cultural and identity politics replaced the politics of change and economic justice. By 1997, when Mr. Rorty gave three lectures that make up the spine of “Achieving Our Country,” few of his academic colleagues, he insisted, were talking about reducing poverty at all. “Nobody is setting up a program in unemployed studies, homeless studies, or   studies,” he wrote, “because the unemployed, the homeless, and the residents of trailer parks are not ‘other’ in the relevant sense. ” Does this overlooked category sound familiar? Mr. Rorty did not deny that identity politics reduced the suffering of minorities. But it just so happened that at the very moment “socially accepted sadism”  —   good phrase, that  —   was diminishing, economic instability and inequality were increasing, thanks to globalization. “This world economy will soon be owned by a cosmopolitan upper class which has no more sense of community with any workers anywhere than the great American capitalists of the year 1900. ” Again: Ring any bells? This group included intellectuals, by the way, who, he wrote, are “ourselves quite well insulated, at least in the short run, from the effects of globalization. ” Which left the white   guy and gal up for grabs  —   open to   populists, maybe even strongmen. In Mr. Rorty’s view, no one within academia was thinking creatively about how to relieve white   anxiety. This was a problem. “Outside the academy,” he wrote, “Americans still want to feel patriotic. They still want to feel part of a nation which can take control of its destiny and make itself a better place. ” Sounds an awful lot like Make America Great Again. At the time, Mr. Rorty was staring at a slightly different political landscape. But it wasn’t that different, ultimately. Today’s just has more mature trees. In “Achieving Our Country,” he wrote about the perils of the North American Free Trade Agreement today, he’d probably have cautioned against the   Partnership. In “Achieving Our Country,” Mr. Rorty railed against the “scurrilous demagogue” Pat Buchanan, who in 1991 talked about building a fence at the Mexican border today Mr. Rorty would have railed against Mr. Trump and his proposed wall. “Why could not the left,” he asked, “channel the mounting rage of the newly dispossessed?” Is his analysis a bit oversimple? Yes. Even within universities, there have always been optimistic champions of America, those who   believe in the moral arc bending toward justice and work   on formulating concrete, actionable policies that would make the country more just. By focusing only on his own environment, academia, Mr. Rorty’s arguments also seem strangely parochial. During the 1960s, the academic left may have started to turn its back on poverty, but actual politicians on the left were still thinking a great deal about it: Robert F. Kennedy was visiting poor white families in Appalachia Lyndon B. Johnson was building the Great Society. Right through the ’90s and into the 2000s, we had    politicians singing the praises of hope, rather than the hopelessness that Mr. Rorty decries. Bill Clinton explicitly campaigned as the “man from Hope,” and Barack Obama would later campaign on a platform of “hope” and “change. ” In passing health care reform, Mr. Obama genuinely did something for the immiserated underclass, and both men, in their ways, rejected identity politics. (Remember Mr. Clinton dressing down Sister Souljah? Or Mr. Obama declaring on MTV that “brothers should pull up their pants”?) But it wasn’t enough, obviously. “Under Presidents Carter and Clinton,” Mr. Rorty wrote, “the Democratic Party has survived by distancing itself from the unions and from any mention of redistribution. ” Mr. Clinton was particularly guilty of this charge, passing Nafta, appointing Robert Rubin as his Treasury secretary and enthusiastically embracing financial deregulation. Mr. Obama pushed the   Partnership. And he was one of those fancy elites. Which brings us to Hillary Clinton. She may have had a plan to relieve the misery of the working class, but she didn’t speak about it much. (Bernie Sanders did. And lost.) She was in favor of the Partnership until she was against it. In a paid speech to a Brazilian bank, she spoke of a “hemispheric common market” for energy. And though her slogan was “Stronger Together,” her campaign was ultimately predicated on celebrating difference, in the hope that disparate voting blocs would come out and vote for her. Here, Mr. Rorty’s most inflammatory words are most relevant, and also most uncomfortable: “The cultural Left has a vision of an America in which the white patriarchs have stopped voting and have left all the voting to be done by members of previously victimized groups. ” Mrs. Clinton tried this strategy. It didn’t win her the Electoral College. “This Left wants to preserve otherness rather than ignore it,” he also wrote. That didn’t work either. People are furiously arguing about what played a key role in this election  —   whether it was white   despair, a racist backlash or terror about the pace of cultural change. It seems reasonable to think that all three played a part. What’s so striking about “Achieving Our Country” is that it blends these theories into a common argument: The left, both cultural and political, eventually abandoned economic justice in favor of identity politics, leaving too many people feeling freaked out or ignored. “It is as if the American Left could not handle more than one initiative at a time,” Mr. Rorty wrote. “As if it either had to ignore stigma in order to concentrate on money, or vice versa. ” You may quarrel with his argument you may say that he was projecting onto the larger world what was happening within his own cloistered, ivied walls. But Mr. Trump is now our  .'"}, "time": 1742628500.358001}