{"duration": 0.027571439743041992, "input_args": {"text": "'Well, that didn’t take long. [On Wednesday, we brought you the story of Under Armour CEO Kevin Plank who, in an interview with CNBC, referred to President Trump as “bold,” “decisive,” and “a real asset to the country. ”  Those comments did not sit well with the left. Several activists and enraged leftists took to twitter to voice their outrage at Plank, using the #BoycottUnderArmour hash tag: Hold on @UnderArmour, maybe I wasn’t clear. Businesses who stand up for this madness will be starved out one by one. #GrabYourWallet pic. twitter.   —   Patrick (@BamBamGavel) February 8, 2017,  Ew, @UnderArmour, you stink https:  .  #KevinPlank #BoycottUnderArmour #GrabYourWallet #resist,  —   Tara Obama Dublin❄️ (@taradublinrocks) February 8, 2017,  Setting here NOT wearing @UnderArmour on account the CEO supports Trump. #BoycottUnderArmour,  —   Your Gal Darlene (@bigbrotherdar) February 8, 2017,  I guess Kevin Plank didn’t learn from @Uber. Bummer, @UnderArmour I used to like you. Never again. #boycottUnderArmour,  —   Morgan M. (@MorgaNicol) February 8, 2017,  Those of you who buy @UnderArmour sports gear. STOP NOW. #BoycottUnderArmour #ResistTrump https:  .   —   Tom [PositiveLad] (@PositiveLad) February 7, 2017,  #boycottunderarmour Let’s get it trending! The CEO of under armour is a trump supporter!  —   jeremy️\\u200d (@adidasatwood) February 7, 2017,  Under Armour issued a statement on Wednesday, attempting to further explain Plank’s position: At Under Armour, our culture has always been about optimism, teamwork, and unity. We have engaged with both the prior and the current administrations in advocating on business issues that we believe are in the best interests of our consumers, teammates, and shareholders. Kevin Plank was recently invited at the request of the President of the United States, to join the American Manufacturing Council as part of a distinguished group of business leaders. He joined CEOs from companies such as Dow Chemical, Dell, Ford, GE and Tesla, among others to begin an important dialogue around creating jobs in America. We believe it is important for Under Armour to be a part of that discussion. We have always been committed to developing innovative ways to support and invest in American jobs and manufacturing. We have always been committed to developing innovative ways to support and invest in American jobs and manufacturing. For years, Under Armour has had a   strategy for domestic manufacturing and we recently launched our first women’s collection made in our hometown of Baltimore, MD. We are incredibly proud of this important first step in the evolution of creating more jobs at home. We engage in policy, not politics. We believe in advocating for fair trade, an inclusive immigration policy that welcomes the best and the brightest and those seeking opportunity in the great tradition of our country, and tax reform that drives hiring to help create new jobs globally, across America and in Baltimore. We have teammates from different religions, races, nationalities, genders, and sexual orientations different ages, life experiences, and opinions. This is the core of our company. At Under Armour, our diversity is our strength, and we will continue to advocate for policies that Protect Our House, our business, our team, and our community. Follow Dylan Gwinn on Twitter: @themightygwinn'"}, "time": 1742628608.5848706}