{"duration": 0.09701752662658691, "input_args": {"text": "'Getty - Chip Somodevilla The Wildfire is an opinion platform and any opinions or information put forth by contributors are exclusive to them and do not represent the views of IJR. \\nIn case you missed the political advertisement for Obamacare, it was touted as the “Affordable Care Act.” \\nHere are Democrats hyping the program, which the Obamacare architect described as a pathway to single-payer : \\nNot too long ago, another fan of single-payer healthcare was Donald Trump. But don\\'t take our word for it, look no further than the unofficial Trump campaign arm Breitbart.com for evidence . As Trump said in September 2015: \\nScott Pelley: Universal health care. \\nDonald Trump: I am going to take care of everybody. I don’t care if it costs me votes or not. Everybody’s going to be taken care of much better than they’re taken care of now. \\nIn 1999, Trump was perfectly clear , as reported by Newsmax: \\n“I said I’m conservative, generally speaking, I’m conservative, and even very conservative,” Trump told King in response to a question about a “patients\\' bill of rights,” reports BuzzFeed. \\n“But I’m quite liberal and getting much more liberal on healthcare and other things. I really say: What’s the purpose of a country if you’re not going to have defensive and healthcare?” he told King. \"If you can’t take care of your sick in the country, forget it, it’s all over. I mean, it’s no good. \\n“So I’m very liberal when it comes to healthcare. I believe in universal healthcare. I believe in whatever it takes to make people well and better.” \\nAfter Obamacare passed, Trump sat down for an interview on HLN. This is what he had to say, as noted by The Washington Examiner: \\n“Number one, as a human being, I like to see people — it\\'s inconceivable that, you know, people are sick, like you get sick, or I get sick, or the kids get sick, and you bring \\'em to a doctor, inconceivable that, you know, 31 or 33 million people can\\'t do that,” Trump told host Joy Behar. “So on one level, I think something had to be done.” \\nTrump continued, saying the law is “really going to cost a lot of money in terms of competitiveness with this country” and said it would cost a friend\\'s company “over $200 million a year.” \\nHere is what Trump recently tweeted: Obamacare is a disaster - as I\\'ve been saying from the beginning. Time to repeal & replace! #ObamacareFail pic.twitter.com/5CvoMbVceT — Donald J. Trump (@realDonaldTrump) October 25, 2016 \\nDid Trump say it was a “disaster from the beginning,” or “on one level, I think something had to be done”? \\nPerhaps, we turn to another tweet he had, drawing on the popular hashtag #ObamaCareInThreeWords: REPEAL AND REPLACE!!! #ObamaCareInThreeWords — Donald J. Trump (@realDonaldTrump) October 25, 2016 \\nIt turns out that Donald Trump is a fan of “repeal and replace,” but his political track record before he ran for president as a Republican shows that what he means by that is “single-payer”—the goal of the Obamacare architect all along. \\nWhen it comes to Trump\\'s solution for Obamacare—making it more competitive for insurance companies—this runs antithetical to the goal of single-payer, which is the government (i.e. taxpayers) paying for everyone. \\nOne can draw their own conclusions about what Trump actually means right now, because no one can be one hundred percent sure. Yet for a man who styled himself as an outsider and not at all like a “politician,” his statements on Obamacare show himself very much to be similar to one. '"}, "time": 1742562254.7937129}