{"duration": 0.06460738182067871, "input_args": {"text": "'Go read the previous post first , then add this for a bit of additional entertainment. \\nA Russian TV event (vid) covered a nation wide geographic competition for schools children. This is somewhat comparable to the national spelling bee contest in the U.S. and elsewhere. \\nThe guest star at the event was the Russian President Vladimir Putin. He was on stage with a nine year old participant who gave his specialties as \"borders, neighboring countries and capitals.\" Putin asked the candidate \"Where do Russia\\'s borders end\". The answer was \"In the Bering Strait at the border with the U.S.\" Putin replied: \"Russia\\'s border does not end anywhere.\" \\n(When the audience then laughed and Putin sensed that it did not immediately get the real meaning of what he said he added: \"That was a joke.\") \\nBut it was no joke. It was serious science. A whole lot of pundits, \"western\" reporters and anti-Putin haters now claim that Putin somehow did wrong, showed lust for new, unlimited Russian expansion or announced the fourth World War for the coming new Russian Empire. \\nSee for example the BBC , Newsweek , Daily Mail , Express and many others who felt the urgent need to comment on a Russian quiz for kids. From the Newsweek piece: A Kremlin spokesperson was not immediately available to explain if the joke referred to Russia’s military efforts to redraw the borders of Moldova, Georgia and most recently Ukraine, or if the president had a different, more figurative meaning in mind....Ukraine’s Ambassador to Finland, whose country has experienced firsthand Russia’s willingness to alter its borders, tweeted a photo of a ruined country log cabin with the ironic caption ‘Russia’s borders end nowhere.’ \\nALL THESE WRITERS, THEIR EDITORS, THE PUNDITS AND DIPLOMATS MUST HAVE SLEPT THROUGH BASIC MATH LECTURES, ESPECIALLY IN EUCLIDEAN GEOMETRY OF TWO DIMENSIONS. It is all Greek to them - literally. \\nThe basic definition of a border is: A part that forms the outer edge of something. \\nA country, any country, is defined by a limited area (or areas) with an area characterized by an outer edge and a circumferential line known as \"a border\". Does the circumferential line of, ideally, a circle have a limit? Does it have a beginning or an end? This is exactly what Putin asked the kid. \\nPutin asked a pupil: \"Where do Russia\\'s borders end?\" The answer \"nowhere\" is the (only) mathematically and geographically correct one. The geographic area characterized by a border is limited. The circumferential (border) line is, by mathematical definition, not \"limited\" in the sense that it has no beginning and no end (it has a length though). \\nThis is basic math which Putin sympathetically lectured to a child in a scientific school competition on public TV. It probably was too much for a tired evening audience. That is not an excuse for professional writers (not) doing their day job. I am sure that, over time, the kid will get it. The \"News\" journalists though ... \\nIndeed one can bet on the low level of \"western\" scientific education, especially of political pundits and news writers, to make an \"imperial intent\" mountain out of any scientifically correct description of a flyspeck. It is a new subcategory of \"fake news\" that they expose. It has its roots in basic stupidity.   08:59 AM | Permalink'"}, "time": 1742563424.365729}