{"duration": 0.06824660301208496, "input_args": {"text": "'DHAKA, Bangladesh  —   Bangladesh’s government is moving forward with a plan to relocate Rohingya refugees staying in camps near the country’s largest tourist resort towns to a remote island that is underwater for much of the year. A cabinet order on Thursday directed officials to have the refugees transferred to Thengar Char, an island in the Bay of Bengal that is lashed by high tides   and submerged during the monsoon season. The suggestion that they be moved to the largely uninhabitable marshland several hours by boat from the mainland drew criticism from around the world. The relocation plan was last proposed in 2015, but the government quietly suspended it after criticism from international aid groups and rights activists. Its reinstatement follows the arrival of about 65, 000 Rohingya from Myanmar in October and November, after a crackdown by Myanmar’s army and attacks on security forces by Islamic insurgents. The United Nations has called the Rohingya, a Muslim ethnic group denied citizenship in Myanmar, the world’s most persecuted minority. John McKissick, head of the Office of the United Nations High Commissioner for Refugees in the Bangladeshi city of Cox’s Bazar, near the Burmese border, said in November that Myanmar’s government was trying to achieve an “ultimate goal of ethnic cleansing of the Muslim minority. ” Since 1992, about 32, 000 registered Rohingya have been living in two United Nations camps near Cox’s Bazar, but estimates of unregistered refugees range from 200, 000 to 500, 000. Many of them live in two sprawling makeshift shelters close to the official camps, while others are scattered across southeast Bangladesh. Talk of forced relocation worries refugees who have lived in the Cox’s Bazar area for more than two decades. “We have been here for a long time,” one of them, Shafiul Mostafa, said in a telephone interview on Tuesday from one of the camps. “We have gotten to know our neighbors, and we can speak the local dialect, which is similar to our language. If we are taken to a new place, it will be very difficult for us. We won’t be able to communicate with anyone. ” The United Nations refugee agency, which runs the camps, criticized the relocation proposal in 2015, calling it “complex and controversial” and saying that departures would have to take place with the migrants’ consent. Now, the return of the plan has taken aid groups by surprise. “U. N. H. C. R. is concerned about this news and seeking details from the authorities,” Shinji Kubo, a representative of the United Nations refugee agency in Bangladesh, said by email. “Any move must be carried out through a consultative and voluntary process, and the feasibility of the proposed site must be assessed. ” Human Rights Watch and Amnesty International say a recent crackdown in Myanmar indiscriminately targeted the Rohingya, citing satellite imagery showing 1, 500 Rohingya homes burned down and widespread reports of mass killings and rapes. The cabinet in Bangladesh has directed officials to take steps to stop further “illegal entry of Myanmar nationals” and to prevent existing refugees from “mixing in with local populations. ” It also ordered officials to keep all illegal immigrants from Myanmar in designated areas, and to arrest them or push them back into those areas if they tried to leave. The order, which was posted on the cabinet’s website, said the arrival of Rohingya in recent months had raised tensions, created “physical risks” for local people, and caused social and economic problems in Cox’s Bazar. Critics of the relocation say the order has more to do with a desire to develop Cox’s Bazar, home to what the government promotes as the longest beach in the world, into a booming tourism destination to rival others in Asia. “Right now, people here are only building hotels and guesthouses,” said Hayat Khan, an executive at the Ocean Paradise Hotel in Cox’s Bazar. “You go to the beach for half an hour, and then there’s nothing more to do. You need cable cars, and theme parks like the Window of the World in Shenzhen,” he added, referring to a city in southern China. “For that, you will need a lot of investment, and a lot of land. ” Rohingya refugees and their leaders say that they were not consulted about the plan. “If the government wants something, we will have to obey them,” said Mr. Mostafa, the refugee. “At the end of the day, what we want or don’t want is not going to matter to anyone. ”'"}, "time": 1742562260.5564427}