{"duration": 0.08307218551635742, "input_args": {"text": "'Zapatistas solidarizam-se com a resistência yaqui 27.10.2016 | Fonte de informações: Pravda.ru No passado dia 21 de Outubro o povo yaqui de Loma de Bácum bloqueou uma via de acesso ao seu território em protesto pela construção de um gasoduto nas suas terras, as autoridades mexicanas reagiram com violência e do confronto resultaram um morto, oito feridos e 13 viaturas incendiadas. O Exército Zapatista de Libertação Nacional e o Congresso Nacional Indígena distribuíram no dia 25 um comunicado solidarizando-se com o povo yaqui, tribo ameríndia cujo território se encontra disperso entre vários Estados do México e dos Estados Unidos da América, o qual reproduzimos na integra. Flávio Gonçalves \"COMUNICADO CONJUNTO DO CNI E DO EZLN EM APOIO À DIGNA RESISTÊNCIA DA TRIBO YAQUI Outubro de 2016 À TRIBO YAQUI, AOS POVOS E GOVERNOS DO MUNDO, Nós, os povos originais que constituem o Congresso Nacional Indígena e as comunidades zapatistas, enviamos os nossos votos mais sinceros e solidários à Tribo Yaqui, ao seu governo tradicional e às suas tropas, expressando que estamos convosco nestes momentos difíceis, após os confrontos decorridos no passado dia 21 de Outubro em Loma de Bácum. Repudiamos os confrontos e a discórdia que os maus governos, e os seus capatazes das empresas nacionais e estrangeiras, promovem e semeiam nas comunidades, com a ambição de ficarem com o gás, a água e os minerais do território Yaqui, propósito para o qual os poderosos fomentam a divisão como ferramenta para impor a morte e a destruição sobre os nossos territórios, pois para eles nada significamos além de mais poder e de mais dinheiro. Como povos, nações e tribos do Congresso Nacional Indígena, bem como povos zapatistas, saudamos a defesa do território da tribo yaqui, apelamos à união perante um inimigo que é um só e que tenta retirar-nos tudo o que temos como povo, tudo o que torna possível a nossa organização colectiva, a nossa história, a nossa língua e a nossa vida. Nas várias geografias da resistência dos povos originais deste país, os maus governos utilizam o nosso próprio povo para disseminar a violência entre irmãos, a qual lhes garante a imposição de letais projectos de extracção, de reformas estruturais, da destruição da organização comunitária e o surgimento do terror entre os que lutam. Para aqueles que combatem, em contraste com os capitalistas, a vida e o futuro dos povos são tudo. Apelamos à sociedade civil nacional e internacional, aos povos originais, à Sexta nacional e internacional e aos órgãos de comunicação social independente, que estejam atentos e exijam o respeito que merecem os povos indígenas na sua organização autónoma e na sua livre determinação. Outubro de 2016 Pela Reconstituição Integral dos Nossos Povos Nunca Mais um México Sem Nós'"}, "time": 1742563839.849866}