{"duration": 0.01780104637145996, "input_args": {"text": "\"Behind the headlines - conspiracies, cover-ups, ancient mysteries and more. Real news and perspectives that you won't find in the mainstream media. Browse: Home / SU 35 Vs F 35 Unbiased Detailed Comparison: Top 5 Facts Essential Reading Have You Read the Talmud Lately? By wmw_admin on September 3, 2006 \\nThe Talmud expounds some of the most virulent racism, as these extracts plainly show. However, as a reader points out not all Jews are influenced by it, or even read it. Only the ultra religious study it, the rest haven’t a clue. We leave you to decide The Liberation of the Camps By wmw_admin on January 27, 2016 \\nIt is tantamount to virtual heresy to question the ‘Holocaust’ today. But did the extermination of 6 million really happen as we’ve been taught? The Lady, The Queen and what it really means By wmw_admin on December 28, 2009 \\nEvery picture tells a story and with some photos and a few words Paul Powers shows us what was hidden in the background when Queen Elizabeth II met pop sensation Lady Gaga The Man Who Would Be King By Rixon Stewart on April 15, 2008 \\nSome say that Prince Michael of Albany has a more legitimate claim to the throne of England than the Windsors. Are they right? And why are the Windsors and the mainstream media delberately ignoring him? Affidavit of Richard Tomlinson By wmw_admin on February 14, 2008 \\n“I firmly believe that there exist documents held by the British Secret Intelligence Service (MI6) that would yield important new evidence into the cause and circumstances leading to the death of the Princess of Wales.” General Ivashov: “International terrorism does not exist” By wmw_admin on February 24, 2007 \\nGen. Leonid Ivashov was Chief of Staff of Russian armed forces when the 9/11 attacks took place, but he says, they weren’t carried out by Osama or al-Qaeeda. The most likely culprits, says the General, were transnational mafias and international oligarchs Worlds Before Our Own 2 By Rixon Stewart on September 1, 2006 \\nHoused in a warehouse in Ica, Peru, is a collection of ancient stone tablets which carry pictures portraying advanced medical practice. They open a Pandora’s box of questions and challenge everything we have been taught about our past The “Six Million” Myth By wmw_admin on April 16, 2011 \\nLong before it became a crime in some countries to question the Holocaust, in fact before it is even supposed to have happened, Zionists were invoking the figure of “Six Million” and talking of a sacrifice for Israel Who Brought the Slaves to America? By wmw_admin on June 30, 2008 \\nContrary to what you have been told, it wasn’t White Anglo Saxon Protestants (WASP’s) who founded and monopolised the slave trade The true inside facts about the 7/7 London bombings By wmw_admin on January 21, 2008 \\nWhat this website has long suspected has been confirmed. James Casbolt, himself a former MI6 operative, gets the inside story from a disaffected member of British Intelligence on who was really behind the 7/7 bombings and why\""}, "time": 1742628460.675355}