{"duration": 0.15679216384887695, "input_args": {"text": "'The Fourth of July is my favorite holiday. I am from Philadelphia. And I write a column about media. What better way, then, to celebrate the Fourth in this space than to quote that great Philadelphian Benjamin Franklin, an editor and signer of the Declaration of Independence and a founding father of the independent American press? There’s one Franklin statement in particular that has a special resonance right now, something he wrote in his Pennsylvania Gazette: “It is a principle among printers that when truth has fair play, it will always prevail over falsehood. ” The operative phrase is “when truth has fair play. ” Now, think about the last year in global and American politics. Then ask yourself, “Does it?” I can make a pretty strong argument for “does not. ” Exhibit A comes by way of CNN, which waded into new territory a few days ago by hiring Corey Lewandowski, Donald J. Trump’s recently fired campaign manager, as an   commentator. Reporters and media critics have devoted a lot of ink and pixels to Mr. Lewandowski’s hiring. How could the network enlist someone who had been arrested for roughly pulling Michelle Fields, the former Breitbart News reporter, away from Mr. Trump as she tried to interview him at a public event? (Prosecutors in Florida dropped the charges, but they did not dispute the incident.) What kind of message was CNN sending by hiring a political operative associated with some of the most aggressive   behavior in modern political history, an enforcer of the Trump campaign’s media blacklist? But the true journalistic heart stopper was contained in the news that Mr. Lewandowski was bound by what even Mr. Lewandowski described as a “strict confidentiality agreement. ” Neither CNN nor Mr. Lewandowski has provided details about its stipulations (though they should). But The Associated Press unearthed a standard Trump nondisclosure form that prohibits staff from disclosing anything “of a private, proprietary or confidential nature. ” And who gets to decide what should be private and confidential? Mr. Trump, of course. The agreement also includes a   clause. And it applies during employment with Mr. Trump’s campaign and “at all times thereafter,” which is another way of saying “forever. ” It won’t smash the republic. Still, in a small but significant way, Mr. Lewandowski’s hiring represents a signal moment in political journalism’s evolving embrace of political operatives: A major mainstream news organization is using a commentator who is legally prohibited from sharing the unvarnished truth on the subject  —   Mr. Trump  —   he was hired to talk about. Some of the media criticism that followed Mr. Lewandowski’s hiring questioned the ruckus around it, given that television news already has its share of conflicted pundits tied to “super PACs” or clients with business at stake in the political debate. CNN’s thinking apparently holds that Mr. Lewandowski provides   balance for the network at a time when many of its regular Republican analysts are Trump detractors. In that case, they could ask, how does a nondisclosure agreement get in the way of Mr. Lewandowski’s role as a Trump booster? After all, as Paul Farhi of The Washington Post captured so comprehensively last month, all of the television news networks  —   hardly just CNN  —   hire commentators who play specific roles on their panels: “” “” Democrat, Republican centrist, rightist, leftist. In presidential election cycles, such   rates well in the Nielsen numbers. But, going back to my fellow Philadelphian, wise old Ben: What happens to the balance between truth and falsehood when an important portion of the national news media hands the political debate over to partisan operatives who, as a rule, skew the facts  —   or abandon them  —   in the service of their own political ends or business interests? There’s a glaring cautionary answer to be found across the pond, in Britain, where the media is avowedly more partisan, especially in the tabloid newspapers that continue to hold great sway. In the   to the startling vote there to leave the European Union, and for many years before, the larger and more conservative newspapers ran aggressive campaigns pushing for what became known as Brexit. One of the biggest proponents of the exit was former Mayor Boris Johnson of London, who was, after all, a onetime reporter for The Times of London and The Daily Telegraph, where he still writes a column. (He was fired from The Times for fabricating a quote.) As Martin Fletcher, a former associate editor of The Times of London, wrote last week in The New York Times, Mr. Johnson made his name as a journalist writing about the plans of bureaucrats in the European Union to “ban Britain’s favorite potato chips” and “standardize condom sizes. ” The articles, Mr. Fletcher wrote, “bore scant relation to the truth,” but they helped spawn an   Union movement in British journalism just the same. As the vote approached,   newspapers  —   including The Sun, The Daily Mail, The Express and The Telegraph  —   wrote stories that exaggerated how many immigrants were coming to Britain because of its E. U. membership and their effects on social services, reported that Queen Elizabeth II was secretly   and quoted claims from   politicians that Britain was sending 350 million pounds ($464 million) a week to the European Union that could be used instead to shore up the National Health Service. The Independent Press Standards Organization in Britain issued several rulings for inaccuracy  —   including one for the headline “Queen Backs Brexit,” which ran in The Sun. But the partisan press climate meant all facts were up for debate. Nothing could stand out as Platonic truth. After the vote passed, Nigel Farage, a leading Brexit campaigner, said the Vote Leave campaign had been mistaken in saying the savings from the £350 million that supposedly went to the E. U.  —   itself misleading  —   could be used for the health service. That was followed by various expressions of regret by some   voters who now believe they were misled. “The context for the referendum vote was a public which had been poorly” informed, “if not misinformed about the issue,” the former Guardian editor Alan Rusbridger told me. The media in the United States is not quite where Britain’s is in terms of partisanship, though it seems to inch closer every year. And cable news is not the sole driver of political knowledge. But it can be the center ring for political discourse, especially in prime time. What happens there can drive a major campaign theme for the following day or longer. In the case of Mr. Trump’s surrogates, they regularly go on television to push the point of the day from a candidate who, according to the   organization PolitiFact, has asserted more outright falsehoods than all the other candidates who ran for president this year combined. PolitiFact rated 60 percent of Mr. Trump’s statements as false, compared with 13 percent of Hillary Clinton’s. Jeffrey Lord, a Trump supporter and a commentator on CNN, told the CNN host Brian Stelter that such   analyses were an “elitist,   thing. ” But the amount of falsity on cable news nonetheless requires a lot of    declarations of “that’s nonsense” in a medium that doesn’t provide a lot of room for it. Mr. Lewandowski has frequently wandered past the bounds of truth, including when he said he never touched Ms. Fields. Videotape showed the opposite. To its credit, CNN does have a crew of aggressive anchors like Jake Tapper, Alisyn Camerota and Erin Burnett, all of whom have pushed Mr. Lewandowski for as unvarnished a view of Mr. Trump as he could offer. Mr. Lewandowski told Ms. Burnett he’d call “balls and strikes” in spite of his agreement with Mr. Trump. But when he weighed in on Mr. Trump’s big economic speech last Tuesday, all he saw was a home run (“Mr. Trump’s best speech of the presidential cycle,” he gushed). Mr. Franklin was all for providing a multitude of voices through his press. “When men differ in opinion, both sides ought to equally have the advantage of being heard by the publick,” he wrote in his “Apology for Printers. ” In a twist on the quote I used above, he added, “When truth and error have fair play, the former is always an overmatch for the latter. ” Let’s give it a try.'"}, "time": 1742562971.133616}