{"duration": 0.09766626358032227, "input_args": {"text": "'When Simone Manuel touched the wall of the pool in the women’s   freestyle race Thursday at the Rio Olympics, she turned around, her eyes searching for the clock. The moment  she registered her win is now a reaction for the history books. Manuel, a    swimmer from Sugar Land, Tex. became the first   woman to win an individual event in Olympic swimming. She also set an Olympic record, along with Penny Oleksiak of Canada: They tied for the win, clocking in at 52. 70 seconds. (Manuel also helped the American women’s team win silver in the   freestyle relay.) The swimming world has known about Manuel, a   N. C. A. A. swimming champion, for years, but her status as a newly minted gold medalist rocketed her to wider popularity overnight. Here’s a closer look at a swimmer who just made history. Manuel’s supporters have high hopes that she could affect diversity in the sport, encouraging more minorities to join. She addressed the issue after her win on Thursday: “I definitely think it raises some awareness and will get them inspired,” Manuel told reporters. “I mean, the gold medal wasn’t just for me it was for people that came before me and inspired me to stay in the sport. “For people who believe that they can’t do it, I hope I’m an inspiration to others to get out there and try swimming. You might be pretty good at it. ” Miriam Lynch of Diversity in Aquatics, a nonprofit organization focused on curbing high numbers of drowning deaths among   said Manuel’s victory could help reverse what she called a cultural fear of swimming in that group. The phenomenon has been traced to slavery and to Jim Crow laws, which segregated swimming pools. The hope is to encourage more young people to become lifeguards, coaches and swimmers. “When you see that the lifeguard is from the community, you think, ‘I can be a lifeguard I can be a coach,’ ” Ms. Lynch said. “Now, with Simone, it’s, ‘I can be an Olympian.’ ” Chuck Wielgus, the executive director of USA Swimming, said in an interview on Friday that Manuel’s achievements, compounded by the success of black gold medalists like Cullen Jones, who came before her, might spur a bump in minority memberships. Michael Phelps did something similar when he first started swimming: When Phelps made the Olympic team in 2000, membership in USA Swimming was about 37 percent male today, male membership of the   organization is around 44 percent. “I think we’ll see it now with Cullen and Simone,” Mr. Wielgus said. “The benefits of it will be seen 10 years from now. ”   membership grew by 55 percent from 2004 to 2015, he said. But that still amounts to only about 1 percent of USA Swimming. Manuel comes from a family of athletes  —   her two older brothers and her father played college basketball  —   but after her victory, she spoke to reporters about the pressure of being a black athlete in a sport that has historically lacked diversity. “It is something I’ve definitely struggled with a lot,” Manuel said. “Coming into the race, I tried to take weight of the black community off my shoulders. It’s something I carry with me. I want to be an inspiration, but I would like there to be a day when it is not ‘Simone the black swimmer.’ ” The network drew sharp criticism on social media from fans who said it should have prioritized Manuel’s medal ceremony as it happened instead of broadcasting the women’s gymnastics event. The sports site Deadspin linked to a BBC video, which has since been taken down, so that people could watch Manuel’s historic moment. A few people caught the footage and posted it to Twitter. Before Manuel won a gold medal, Lia Neal, who is of Chinese and African descent, made headlines in 2012 for winning a bronze medal in the   freestyle relay at the London Games. They follow in the wake of Maritza Correia, a Puerto   swimmer of Guyanese descent who was the first black woman to join the United States Olympic team, and was on the   freestyle relay group that won silver in Athens in 2004. Both freestyle sprinters, Manuel and Neal are friends and rivals, and they’re teammates at Stanford University. Greg Meehan, the university’s lead swimming coach, told ESPN last year that Manuel’s arrival to the team took some pressure off Neal, who is a year older. “She has a huge spotlight on her, and she’s managed it well,” Meehan said of Manuel. “And it’s given Lia some freedom to do what she needs to do. ” In the fall, Stanford will add even more Olympic firepower when Katie Ledecky, the team’s most dominant female swimmer, comes aboard. The tennis powerhouse Serena Williams, who has four gold medals of her own, shared a photo on Instagram that praised Manuel and another famous Simone  —   that would be Simone Biles, who is widely regarded as the best gymnast in the world. Biles is a friend of Manuel’s and, of course, a fellow Texan.'"}, "time": 1742562251.5878875}