{"duration": 0.20296716690063477, "input_args": {"text": "'Donald J. Trump wrested back control of the Republican presidential race on Tuesday with a commanding victory in the New York primary, while Hillary Clinton dealt a severe blow to Senator Bernie Sanders with an unexpectedly strong win that led her to declare that the Democratic nomination was “in sight. ” The     Mr. Trump was poised to take most of the 95 Republican delegates at stake, substantially adding to his current lead over Senator Ted Cruz of Texas and significantly improving his chances of winning the Republican nomination. Mr. Cruz came away with no delegates, a major setback, while Gov. John Kasich of Ohio had a shot at picking up some in Manhattan and the capital region. Mrs. Clinton’s decisive victory ended a string of wins by Mr. Sanders and gave her more delegates than her advisers expected. Her base of support was Long Island, the five boroughs, and upstate cities, with female and black and Hispanic voters turning out for her in especially strong numbers. The two hometown winners beamed throughout their victory speeches, but it was Mr. Trump who particularly seemed like a different candidate. As he spoke in the lobby of Trump Tower, there were no freewheeling presentations of steaks and bottled water, as in the past. There was no reference to “Lyin’ Ted” or “Crooked Hillary” he called his opponent “Senator Cruz” instead, and made no mention of Mrs. Clinton. He also took no questions from the news media. And his speech sounded more presidential than any other he has given on an election night  —   a focused, tightened message about trade and the economy as he prepares to campaign in states hit hard by manufacturing industry losses. The speech reflected the growing influence of Paul Manafort, whom Mr. Trump empowered to help him win the nomination and who has taken on a greater purview, including messaging. “Our jobs are being sucked out of our states,” Mr. Trump said. “One of the big problems is economy and jobs, and that is my wheelhouse. ” He said, twice, that he was going to get up and go back to work for the nomination on Wednesday morning, a clear message about the intensity he is bringing to the fight. In the Democratic race, Mrs. Clinton was set to win roughly 30 more delegates than Mr. Sanders, out of 247 at stake. She already had a lead of more than 200 delegates in the race. Smiling broadly throughout her victory speech, Mrs. Clinton drew cheers as she thanked her adopted home state and then boomed, “Today, you proved once again, there’s no place like home. ” “The race for the Democratic nomination is in the home stretch and victory is in sight,” Mrs. Clinton added, reflecting the overwhelming mathematical advantage she has in delegates. Sanders advisers had said that beating Mrs. Clinton in her adopted home state represented one of their campaign’s best opportunities to damage her candidacy and sow doubts about her strength as a   nominee. On Tuesday, however, Mrs. Clinton drew deep support among women and blacks  —   two groups that have been essential for her in many states  —   while Mr. Sanders was outpacing her among white men and people under 45, according to exit polls. “Bernie Sanders got very negative attacking Hillary Clinton and dividing the party in New York, and I think he now has to ask himself if he wants to keep going down that path,” said Jay Jacobs, a Clinton supporter who is the Democratic chairman in Nassau County on Long Island. “After New York, we’re moving into a phase of the campaign where we have to start uniting the party. ” Mr. Sanders and his team spent Tuesday looking past New York. Mr. Sanders held a rally at Pennsylvania State University in State College on Tuesday night, then flew home to Burlington, Vt. and spoke to reporters just after the race was called. “There are five primaries next week and we think we are going to do well and we think we have a path toward victory,” Mr. Sanders said. He also expressed concern about the closed primary system in New York and said he hoped it would change in the future. “Some three million New Yorkers were unable to vote today because they were registered as independents,” Mr. Sanders said. “That makes no sense to me. ” The Sanders campaign spent roughly $2 million more than the Clinton campaign on television ads in New York. The magnitude of the loss  —   both in the popular vote and in delegates  —   was steep for Mr. Sanders, who said he intended to get “recharged and take a day off. ” The senator’s advisers were optimistic that he would perform strongly in next Tuesday’s primaries in Pennsylvania as well as in Rhode Island and Connecticut. The other two states voting next week, Delaware and Maryland, are widely seen as Clinton strongholds. The Sanders campaign is already running television ads in those five states and Indiana, which votes May 3. “Bernie is in good shape going forward no matter who wins New York,” said Tad Devine, a senior adviser on the Sanders campaign. “We could win enough delegates in Pennsylvania and Indiana to catch up further to her, and we have good opportunities all the way through California,” which votes June 7. Still, Mr. Devine acknowledged, “we’re going to have to have some big wins at the end” of the primary and caucus season. Mrs. Clinton, a former senator from New York, received support from roughly six in 10 Democrats on Long Island, and she overwhelmed Mr. Sanders in Manhattan, Queens and the Bronx. Mr. Sanders won many upstate rural counties, where few votes were cast, and he also did well in the Hudson Valley, given the enclaves of liberals and college students. On a major issue in their campaign, nearly   of Democratic primary voters said that Wall Street does more to hurt the American economy than to help it, and a majority of those voters backed Mr. Sanders. But Mrs. Clinton received even stronger support from those who said Wall Street helps the economy. By a slim margin, Republican primary voters also said that Wall Street does more to hurt the economy than help it. Within the Trump campaign on Tuesday night, euphoria mixed with eagerness to move onto a number of states that are likely to be friendly to Mr. Trump. There have been other pivotal points in the Trump campaign, moments when he was described as becoming newly serious. It never stuck with the famously     candidate. But Mr. Manafort is someone whom Mr. Trump views as something of a peer. No matter the margin of victory, New York Republicans gave Mr. Trump a restorative psychic boost after weeks when Mr. Cruz scored a big victory in the Wisconsin primary and outmaneuvered the Trump campaign in Colorado, Wyoming and elsewhere in winning and electing delegates backing his candidacy. Mr. Trump now has clear momentum heading into the next week’s primaries  —   so much so that he evinced fresh optimism on Tuesday about ultimately getting to the 1, 237 delegates needed to capture the nomination. “I think I’ll get there,” Mr. Trump said in an interview before the polls closed. New York has not been home to leading presidential candidates in both parties since the 1944 campaigns of Franklin D. Roosevelt and Thomas E. Dewey, so the voting by Mrs. Clinton and Mr. Trump merited unusual news media coverage on Tuesday morning. As a light mist fell, Mrs. Clinton and former President Bill Clinton cast their votes at an elementary school in their adopted town of Chappaqua. As news photographers and cameramen kept encroaching on her while she tried to vote, Mrs. Clinton finally shooed them away. “Guys, it’s a private ballot,” she said. The Democratic vote was marred by major irregularities at polling places across Brooklyn. The city comptroller’s office announced that the Board of Elections had confirmed that more than 125, 000 Democratic voters in Brooklyn were dropped between November and this month, while about 63, 000 were added  —   a net loss that was not explained. Mayor Bill de Blasio described “the purging of entire buildings and blocks of voters,” while the comptroller, Scott Stringer, said his office would audit the Board of Elections. Mr. Trump voted for himself midmorning in New York City, which he called “a great honor” as he entered his apartment building. In the interview later, Mr. Trump described the experience of seeing his name on the ballot, saying he was moved by the enormity of what it means. “It does sort of hit you,” he said. Mr. Trump won majorities in all regions except for rural upstate areas. Some Republicans questioned why Mr. Cruz spent so little time in upstate New York, where Mr. Trump’s support two weeks ago was softer than it appeared. Instead, Mr. Cruz devoted his time mostly to the city and to fundraising. The primary was a seminal moment for Mr. Trump, both tactically in terms of delegates needed to clinch the nomination, and mentally, as he tries to right the ship after a rough couple of weeks that prompted him to reshuffle his small team of advisers, adding the seasoned campaign hand, Mr. Manafort. The coming weeks will test whether Mr. Trump can temper his message and his style for a new phase of the race, one where running a traditional campaign matters more than his ability to rally crowds. Indeed, Mr. Trump’s tone throughout the day was focused on what he repeatedly called, in interviews, a “corrupt” and “rigged” nominating process. Alfonse M. D’Amato, the former United States senator and a backer of Mr. Kasich, said the New York results would be critical for Mr. Trump to rebound in his fight with Mr. Cruz. “This will give him momentum that he needs after his setbacks,” Mr. D’Amato said.'"}, "time": 1742563095.3104305}