{"duration": 0.07675623893737793, "input_args": {"text": "'New York Mayor Bill de Blasio should be forced to share his mayoral home with   gang members instead of being allowed to impose a “sanctuary city” policy which releases gang members into New York neighborhoods, says independent mayoral candidate Bo Dietl. [“How dare this mayor says ‘We won’t allow ICE or the FBI to do their job,’” Dietl said, shortly after de Blasio upped his opposition to the enforcement of federal immigration laws. “If ‘Big Bird de Blasio’ wants them [ilegals]  in New York, I will tell you what I would do, send the   gang over to Gracie Mansion. ”   He continued: de Blasio has no idea what he is doing regarding this issue   …     We should not allow felons and criminal illegal gang members like   to be in this country. When they go to Rikers Island [jail] these criminals should be turned over to ICE. Public concern about   has risen amid a crime wave by illegal alien   members in New York’s Long Island. Dietl’s stinging criticism of de Blasio was accompanied by a promise to work with other politicians if he gets elected as mayor in November. “I really believe that I can work really well with the governor and stop the antagonistic attitude of this mayor to the governor and to the president,” Dietl said Thursday morning in a Press Conference outside Governor Cuomo’s New York office. “We got to realize one thing  —   whether you like Donald Trump or not, he’s our president for the next four years. There is a word called ‘compromise’ and [de Blasio] needs to compromise with the President and the governor of this great state. ”  Dietl stated as mayor, he would go to Washington to sit down with President Trump and work with the fellow New Yorker on issues such as immigration enforcement and obtaining federal funding for affordable housing and infrastructure.  “I’ll say to him, ‘Mr. President, you love this city. The Brooklyn Bridge is falling and what we need is federal funding from Washington. ’” Dietl said. “Wouldn’t it be good to get as much money as we can out of him instead of being antagonistic with him?” The press conference began with Dietl continuing his push to ask the Governor to open an independent investigation regarding the mayor’s campaign finance violations, despite de Blasio has been cleared by both New York’s federal U. S. Attorney and the Manhattan District Attorney’s office. “This is not over. Just because they didn’t have enough to indict him on criminal charges, there is enough evidence to take de Blasio down on civil charges and make him return that money he raised and fine him,” Dietl said, while reading a   letter he sent to the Governor.  “I want the Governor, who is against corruption to not let de Blasio get away with it. New York City is not a    city. Let keep it clean from corruption,” Dietl said. “New York City needs a mayor for all the people, not just people that will give him money like the big union backers,” Dietl said. “New York will not stand for a mayor as corrupt as him. He talks about the tale of two cities, well he is on the tale of the rich side. ” He added, “Why are we   him. Once he gets   de Blasio is going to become more lazy, he won’t even show up to work. What has this mayor done the past three and a half years to give him the credit to now be  . ” '"}, "time": 1742563071.8453548}