{"duration": 0.10284209251403809, "input_args": {"text": "'On Monday, thousands are remembering the lives lost during the deadliest mass shooting in United States history, the Pulse nightclub massacre, a jihadist attack by an Islamic State sympathizer targeting the Orlando club’s “Latin Night. ”[Omar Mateen opened fire on innocent patrons of the club, killing 49 people and injuring scores of others. Mateen pledged his allegiance to the Islamic State during the shooting before police shot him dead.  The media has made little to no mention of the fact that a jihadist, influenced by a radical Islamic ideology, was behind this crime. Instead, most of the stories in the press have painted the incident as a generic form of “hate. ” An article in the New Yorker about the graveyard caretaker who looks after the plots of the victims of the massacre does not mention Mateen. USA Today similarly makes no mention of Mateen’s radical motivations or his allegiance to a group hellbent on spreading an Islamic caliphate throughout the world. CNN ran an article highlighting five people who were either related to the victims of the Pulse massacre or survived the atrocity. CNN also failed to address the radical Islamic ideology behind the attacks. While they did mention the word “terror,” they chose quotes to highlight the views of those who believe in stricter gun laws, and one that blamed the incident squarely on “hate. ” The one person CNN quoted who believes in gun ownership as a form of protection as a result of what she survived said she does not believe in God. “It’s hard to say that I am here because of God because, I’m sorry, I don’t believe that God would take those people the way that they were taken,” Jeannette McCoy told CNN. “There’s nothing proud about being a survivor. Not for me. ” The Washington Post also failed to make any mention of Mateen’s radical influence. As the Washington Free Beacon pointed out, “Despite the Post‘s piece clocking in at over a thousand words, the words ‘terrorism,’ ‘terror,’ ‘ISIS,’ ‘Islam,’ ‘Muslim,’ and ‘ ’ never appeared once. The sole reference to ‘Islamic State’ occurs in a photo caption, and never in the body of the piece. ” Breitbart News previously reported that Mateen said, “I pledge allegiance to [Islamic State leader] Abu Bakr   may God protect him, on behalf of the Islamic State,” during a 911 call about his assault. In that same piece, Breitbart News detailed how the media worked to “portray Mr. Mateen as a scorned, mentally ill, repressed homosexual,” but the reports on the incident “reveal one crucial point: Omar Mateen ranted at the police about America’s fight against the Islamic State, mentioning the war and air strikes at least 20 times in total. ” Several other news outlets also failed to mention the keywords that the Washington Free Beacon mentioned their sole reference to Mateen pledging allegiance to the Islamic State. They include a Toronto,   news site, CP24 and the Associated Press. However, last year, the AP ran a headine with a quote from Mateen’s imam who said the Pulse massacre “Has Nothing To Do With ISIS” and instead blamed it on mental illness. On Monday, the City of Orlando participated in what they have called “Orlando United Day  —   A Day of Love and Kindness” to honor the lives lost one year ago today. In addition to a series of events taking place in the city and throughout other cities across North America, an event at Pulse nightclub called “Reflections and Remembrance” began at 11 a. m. At 7 p. m. a memorial event called “Orlando Love: Remembering Our Angels” will take place at Lake Eola Park. The park is located at  512 East Washington Street. Adelle Nazarian is a politics and national security reporter for Breitbart News. Follow her on Facebook and Twitter.'"}, "time": 1742562424.505215}