{"duration": 0.03783583641052246, "input_args": {"text": "'The governor of the small Russian region of Oryol is trying to convince people that Ivan the Terrible was not so bad. Legend has it that Ivan founded the region’s capital, also called Oryol, in 1566. Now Gov. Vadim Potomsky has commissioned a bronze statue of the former czar on horseback, wielding a sword and a cross, to be erected in front of the city’s children’s theater in honor of the city’s 450th birthday. The rehabilitation campaign builds on a move by Russia’s minister of culture back in 2014 to depict Ivan as the victim of Western disinformation. The minister suggested that the name in Russian, “Ivan Grozny,” would better be translated as “Ivan the Strict. ” Ivan’s more dubious deeds include founding the first version of Russia’s secret police and beating his own son to death. The death is the subject of one of the country’s most renowned historical paintings, by Ilya Repin, something Governor Potomsky dismissed as “a work of fiction. ” The governor told the newspaper Moskovsky Komsomolets that, for him, Ivan is part of a triumvirate of Russia’s “three great rulers,” along with Peter the Great and Joseph Stalin. “Each of them is a unique story,” he said, “but each made a great contribution to Russian sovereignty, its might. ” The public remains unconvinced. Even the anchor of the   television program “News of the Week” said recently that Russia seemed to be suffering from a “maniacal obsession” with new statues, noting that neither the Romanovs nor Stalin himself ever erected a monument to the Terrible. Critics horrified by the very idea of the statue abhor even more Governor Potomsky’s planned location. Aleksander Mikhailov, artistic director of Oryol’s children’s theater, imagined parents having to explain to young ones that the czar killed his son. “He is too controversial and tragic a figure in Russian history,” Mr. Mikhailov said. Governor Potomsky initially waved off the criticism, then said he would delay the installation a month to consult with the public. Some people in Oryol, he told the newspaper, “complain about everything. ”'"}, "time": 1742561838.2613132}