{"duration": 0.17830896377563477, "input_args": {"text": "'( Nicolas Nova / CC 2.0 ) \\nEditor’s Note: Tom Hayden, an activist, author and longtime Truthdig contributor , died Sunday at age 76. In his memory, Truthdig will share one of Hayden’s pieces each day this week. This story was originally posted on April 9, 2006. *** \\nAuthor and political activist Tom Hayden speaks at length about his politics, the war in Iraq, Cuba-U.S. relations and a range of other topics with Cuban journalists in an interview for Juventud Rebelde . The English translation of the interview is published here in full, courtesy of Hayden. \\nDuring the past five years, the American people have seen vivid pictures of American soldiers torturing prisoners. We now have evidence that the Bush administration is engaged in a massive domestic surveillance program, without judicial or congressional approval, that targets American citizens. President Bush ordered American soldiers to war over nonexistent weapons of mass destruction. The Bush administration and FEMA failed the people of New Orleans during the Hurricane Katrina disaster. Can you explain why the Bush administration seems immune from the political fallout that ordinarily results from such scandals? Why is there is no serious move to impeach the president for any or all of these scandals? \\nAdvertisement Square, Site wide \\nI do not wish to sound like an apologist, but the Bush administration is not immune. Legally, the cases against Libby and Abramoff and DeLay are slow-moving bad news for Bush. Politically, the Bush poll ratings are below the 40% range. Republican candidates for Congress are in trouble even though their congressional districts are designed to protect their power. As to impeachment, something like half of Americans favor impeachment or censure. If the Democrats win back the House this November, Rep. John Conyers will chair the Judiciary Committee and introduce impeachment. In general, American politics is still suffering from the stolen election of 2000, the chilling effects of 9/11, and the fabricated and unjustified invasion of iraq. Can you explain why the level of protests in the U.S. against the war in Iraq is not as notable as during the war in Vietnam? \\nThe difference is that during Vietnam there was a military draft and the number of casualties was far, far higher. Relatively speaking, therefore, the level of protests today is greater—200,000 in October 2002 in D.C.; 1 million in February 2003; 500,000 in New York in 2004; 300,000 in D.C. in 2005. The reformist presidential campaign of Howard Dean was larger than the antiwar Eugene McCarthy campaign of 1968. A majority of Americans, including a majority of U.S. soldiers, want a troop withdrawal within this year. The “notable” difference, I believe, is that there was a broader radical movement around the world, certainly in 1968, than there is today. That makes the antiwar movement, here and globally, a surprising development, it seems to me. Do you envision an exit strategy for the U.S. in Iraq in the foreseeable future? \\nThere is an exit strategy available, with some support even within the Pentagon, but it is unlikely that Bush will adopt it. The strategy would consist of a U.S. announcement of withdrawal, a cease-fire by the Iraqi resistance during the withdrawal, an international peacekeeping force composed of countries not involved in the occupation, a transitional coalition in Baghdad, new elections under international auspices, a peacetime reconstruction, and reparations from the U.S. And UK. \\nBush may, and I emphasize may, begin withdrawing tens of thousands of U.S. troops this year in order to pacify antiwar sentiment, neutralize Democrats and keep control of the House of Representatives. One faction in the Pentagon calls this the “Philippines option”—have your client government invite you to withdraw, so that it is perceived as a “victory.” Recent trends in Latin America make it appear that it is no longer an American backyard. Venezuela, Bolivia, Argentina, Uruguay are some of the countries that are taking an independent path to political and economic development. It would appear that with the expected election of Lopez Obrador, Mexico may soon join that list. What can we expect from the Bush administration with respect to Latin America in the coming months? \\nI have traveled extensively in Latin America since 2000, and it is a place of exciting and dramatic developments, as you know. I think progressives across our boundaries should propose a new U.S. Latin American policy “beyond the Monroe Doctrine.” We in the U.S. also must invigorate solidarity movements like those towards Central America and Cuba in past decades. It is a dangerous period because of the Bush administration. Towards Cuba, their malign intentions are well known. Towards Venezuela, they are defining a new security threat of “radical populism,” and seeking ways to destabilize the democratically elected government. Even assassination of Hugo Chavez is an option that some are considering. On the trade front, the Bush team will try to divide Latin American countries through bilateral trade agreements. In the Andes, they will continue to send U.S. troops under the cover of the war on drugs. We note that you have always been an enemy of the so-called Free Trade Agreement that was so soundly defeated at the presidential summit in Argentina. Is that agreement dead and buried? Can you comment on the Bolivarian Alternative for the Americas, known as ALBA? \\nLatin America, along with U.S. social movements, has defeated the so-called Free Trade Agreement of the Americas for the foreseeable future. The World Trade Organization [WTO] is far from defeated, partly because of internal differences among Latin American countries. I believe the Bolivarian Alternative is an extremely important counterforce against the U.S. imperial design. Mercosur also is a welcome development. A united front among the new nationalist governments of Latin America is to be hoped for. Venezuela has recently been supplying heating oil at low cost for lower-income people in certain U.S. cities, yet some Republican congressmen have been critical of this gesture. Please comment. \\nIn general, the response to the Venezuelan initiative has been positive or neutral. Objections by some members of Congress is to be expected, because they want to prevent any U.S. acceptance of the Chavez government. The man many call the Osama bin Laden of Latin America, Luis Posada Carriles, is in the United States. He is wanted in Venezuela for 73 counts of first-degree murder in the downing of a civilian passenger plane in 1976, yet the Bush administration refuses to send him to Venezuela. How does that square with President Bushs so-called war on terror? \\nOf course it is a contradiction. Unfortunately, there is little media attention to the issue up here. But the issue is a definite complication for the Bush administration’s efforts to improve its status in Latin America. \\nYou were one of the Chicago 7 that Leonard Weinglass defended in 1968. Now Mr. Weinglass is one of the lead lawyers in the case of the Cuban Five. Do you think that anyone sympathetic to the Cuban revolution can get a fair trial in Miami? \\nI have read the materials concerning the case, and believe it is a great untold story here. Of course, Leonard Weinglass is one of our greatest defense lawyers and is working constantly to generate political and media interest in the Cuban Five. No, a Cuban revolutionary cannot get a fair trial in Miami. But I believe the grip of the anti-Castro Cubans over Latin American policy has been weakened severely by events in Latin America and the recent growth of a vast Latino and immigrant movement in the United States. The Bush administration recently tightened travel restrictions for Americans wishing to travel to Cuba. Do Americans have a constitutional right to travel? \\nThey always have and always will. Bush is imposing a frustration on all of us, apparently to placate his Cuban allies in Miami. How will history judge the Bush administration? How does President Bush compare to other U.S. presidents in recent history? \\nWho knows, but I think Bush will be marked with illegitimacy for the stolen election of 2000, fabrication and failure in Iraq, corruption and unconstitutional spying at home. Perhaps he will face impeachment, perhaps not. Certainly he is going through his Watergate moment today. It is important to speak of the system, however, not simply Bush. Since the disappearance of the Soviet Union, the U.S. has attempted to be the sole superpower in a so-called unipolar world. But its efforts towards military and economic empire have faltered and will be, in a sense, re-negotiated. As Hugo Chavez and others have argued, the reality is that we live in a multipolar world. The combination of massive social movements and the multipolarity of power will prevail over any forces seeking to dominate. As they say, another world is not only possible but is already being created. \\nThe United States cannot succeed with superpower tactics even on the baseball field. \\nI know the horrors of U.S. imperialism in Latin America, but I hope that Latin American nationalists will welcome and reach out to the “American people,” especially those in social movements and independent media but also those in political and economic sectors who have no interest in blockades, subversion, assassination or economic dominance. We are here, and our numbers are growing, especially because of the immigrants who are the “harvest of empire” [in the words of Juan Gonzales]. Those who live in the imperial center cannot be expected to “come to power” any time soon, but can restrain and complicate aggression and forge new policies which have the support of a majority of the U.S. people—out of Iraq, support for energy alternatives, funding for Katrina victims instead of war, civil liberties instead of secret tribunals and policing, no intervention in Venezuela, lifting the blockade on Cuba, and so forth. Strong support for such measures not only makes imperialism more difficult to sustain, but lays the basis for a broad center-left alternative which actually can succeed in the U.S. in the years ahead. It has nearly happened here before, in the 1930s and ‘40s before the Cold War, and again in the 1960s. Such moments will come again. TAGS:'"}, "time": 1742562320.6392703}