{"duration": 0.11661410331726074, "input_args": {"text": "'The Russian Far East looks to the American West for inspiration RD Interview: Yaroslav Lissovolik, the Eurasian Development Bank’s chief economist, discusses the prospects for the development of Russia’s Far East into an important economic and technological hub in the region. RD Interview: Yaroslav Lissovolik, the Eurasian Development Bank’s chief economist, discusses the prospects for the development of Russia’s Far East into an important economic and technological hub in the region. \\n\\nThe missile destroyer USS John S. McCain is on visit to Vladivostok on the Russian Pacific coast, taking part in the May 9 Victory Day celebrations. T he American crew praying for the dead. Photo: RIA Novosti \\nBolstering the Far East region has now become one of the nation’s top priorities, as indicated by The Eastern Economic Forum, which took place last September in Vladivostok. In fact, it highlighted one of the most salient trends in Russia’s domestic and foreign policy: shifting priorities to the Asia-Pacific region and rein-vigorating the idea of neo-Eurasianism, which sees Russia as the center of a big and robust Eurasia, bridging the East and the West. However, will Russia\\'s Far East be able to become the economic hub that will link two dynamic parts of the world — Asia and Europe, taking into account the region\\'s numerous economic challenges. To answer the question, Russia Di-rect sat down with Yaroslav Lissovolik, the Eurasian Development Bank’s chief economist. \\nRussia Direct: The Russian Far East has become a buzzword for those who try to revive the ideas of Russian Eura-sianism and see the Far East as the link between the West and the East. Given Russia’s economic challenges and the fact that the first version of Eurasianism failed, to what extent are their attempts viable? Yaroslav Lissovolik: Geography is destiny. It is inevitable for us if we are located between the two dynamically developing regions of the West and the East . ;If there is economic cooperation between these two centers of the world economy, it is beneficial for us. We could and should bring them together. It is a matter of using the advantages of our geography to yield economic dividends. At any rate, this should be taken into account in conducting our foreign and economic poli-cy. \\nAfter all, Russia has a century’s worth of experience and the potential of cooperating with Europe, and we should take into account this historical and cultural factor, gain dividends from it and attempt to find new ways of integration [between the West and the East]. Un-til recently, we did have very ambitious projects on a free trade zone with Europe, but today we have to look for more flexible and realistic integration ones. \\nThat’s why, we should not be obsessed with this idea in the current situation, when the factor of distance no longer plays the same role that it did previously. The diversification of regional trade alliances is taking place throughout the world. If you look at coun-tries like South Korea or Chile, they have dozens of alliances not only in their re-gions, but also all over the world. So, in our attempts to build alliances in other re-gions, we should look and think globally. \\nIn this regard, the prob-lems of the BRICS group [which includes Brazil, Russia, India, China and South Africa] should attract more attention. Yet this integration group is scattered throughout the world and represented, in fact, across every world continent. It is the most representative group from the point of view of world geogra-phy. \\nAlso read: \" Fulfilling Eastern Economic Forum pledges: Easier said than done \" However, we are hardly likely to be able to create such projects like a full-fledged free trade zone with the BRICS countries. Nevertheless, we should not rule out the possibility of economic cooperation with the countries located in the continents, represented by the key BRICS members. Such a global approach hasn’t been actively discussed so far. Hopefully, it will get a boost in the future.  ; ; \\nRD: To what extent does the Trans-Pacific Partnership (TPP) pose a threat to Russia\\'s in-tegration projects or could Moscow gain from the TPP? If so, how could it do it? Y.L.: At the end of last year, Russian President Vladimir Putin announced key Rus-sian priorities: [establishing closer cooperation with] the Shanghai Cooperation Organization (SCO) and the Association of Southeast Asian Nations (ASEAN). This statement came shortly after the announcement about the conclusion of the TPP agreement on Oct. 5. So, it can be seen as a response to the creation of the TPP. \\nRemarkably, the Russian president mentions both the SCO and ASEAN, because the latter can be a sort of bridge for Russia to the Trans-Pacific Partnership, which also includes some of the ASEAN countries. Regarding the SCO, it is a more independent project in-tended to develop Eurasian continental integration. That’s why such a dual ap-proach means that Russia wants to keep its option opens. \\nOn the one head, there is a move [from Russia] to establish closer ties and intensify the cooperation with the TPP coun-tries. On the other hand, Russia focuses on the [SCO] continental project as a se-cure alternative. This is the very approach that Moscow will stick to. \\nRD: What are the odds of Russia’s Far East exten-sively cooperating with America’s West Coast? Y.L.: In my view, the most interesting and realistic approach would be the creation of an alliance in the scientific and technological spheres , given the fact that a great deal of the world’s powerful economic think tanks are primari-ly located in the Pacific region, be it California in the U.S. or Japan in Asia. And today we are witnessing the attempts to create such a center, a think tank in the Russian Far East. \\nThe integration of these efforts could be synergistic and bring certain results. In fact, this project is a more short-term and realistic project. In the mid- and long-term it would be rea-sonable to focus on investment and more standard tools of integration such as trade cooperation. At the same time, it would be good to be more selective and look for other spheres of potential cooperation. Again, it is a matter of long-term planning, but we need to start thinking about it now. \\nRD: How can Russia gain from the historic experience of the U.S. in developing its Western frontiers to bolster the Far East? Y.L.: Russia could learn from the experience of creating a leading devel-opment region in Silicon Valley — how it worked, why it succeeded and how it be-came a region of accelerated economic development and started playing the lead-ing role in the Asia-Pacific region. It would be useful for Russia to learn the experi-ence of how the U.S. has looked at their [Western] regional development historical-ly: It would give some hints why Russia’s regions on the Pacific Coast failed to do it and are losing human capital.  ; \\nRD: Historically, the American West Coast didn’t bring together a significant number of talented people until it became an economic hub and the center of new technologies. Y.L: Certainly, there are a lot of similarities [between the American West and the Russian East] and we need to look at the first steps of American pioneers undertaken to “saturate” this region with human and intellectual resources as well as with investment and trade flows. It was part of one systemic and integral process. All this was coming together. And one of Russia’s problems regarding its policy in the Far East is that we try to modernize it non-systemically, by fits and starts . Or we just focus too much one field — be it education or trade — without paying enough attention to other areas. The systemic approach is key.  ; ; ; ; ; ; ; \\nRD: In the late 19th – early 20th centuries, the Far East was seen as the Russian California . Do you think it has enough potential to become the Russian counterpart of Silicon Valley today, given the economic challenges and confrontation with the West ? Y.L.: Definitely, I see the Far East as one of the regions, which should be-come one of the world’s intellectual centers because of its proximity to other intel-lectual centers in Asia-Pacific and the American West Coast. So, the factor of geo-graphical proximity does matter in this situation. Vladivostok is a good candidate given the fact there is one of the leading universities here — the Far Eastern Fed-eral Universities, the venue of the annual Eastern Economic Fo-rum. \\nAlso read: \" The bold plan to turn Vladivostok into a Russian San Francis-co \" After all, the creation of intellectual centers should be located in a place with big companies and a great deal of demand for intellectual resources. The Far East and Russia’s other regions do have such demand. Although it is diffi-cult to create such centers, we have to diversify re-gional development and “saturate” them with human and economic resources. It is a matter of necessity.  ; ; ; ; ; ; ; ; \\nRD: In the 20th century Americans invest-ed in some Russian and Soviet infrastructure projects in the Far East, including the Trans-Siberian Highway, despite political differences and confrontation. Do you think it is possible today? Y.L.: We cannot rule this out and we should work in this direction together with other regional stakeholders such as Ja-pan and South Korea. On the one hand, they can be the self-reliant economic heav-yweights in the region; on the other hand, for Russia, they can be the bridges to the West, because they cooperate economically with both the ASEAN countries [with which Russia is cooperating] and the U.S. So, the can be seen as the linking points between the TPP and other countries within the concept of the Big Eurasia concept. So, we should foster different formats of cooperation in this re-gard. \\nThis interview was originally published in Russia Direct\\'s report \" Crossing the bridge to the Far East .\" ;To get access to the report, ; subscribe  ;to Russia Direct. '"}, "time": 1742628399.680957}