{"duration": 0.08896112442016602, "input_args": {"text": "'Leave a reply \\nSeth M – The seven Chakras of the body are energy hubs and they hold great influence over you and your personality. They are what receive, internalize and diffuse the life energy that flows through us, and each one needs to be balanced; not under-active or over-active. \\nActivating or obstructing our Chakras happens both consciously and subconsciously as a result of our thoughts and feelings and actions. Here are ways to heal your seven chakras: \\nCrown Chakra; Spirit Energy – This chakra is found at the crown of your head and is associated with your sense of higher purpose, your consciousness and your vision. An obsession with material things is what blocks this Chakra. \\nTo stimulate this Chakra, one can meditate , pray or participate in religious activity, or sing with passion. \\nThird-Eye Chakra; Integration Energy – The third-eye Chakra is found between your eyes and its energy manifests as intuition . It is also called Anja and is associated with the color indigo. This Chakra works with the left and right brain processes, bringing together the male and female sides of you. \\nA busy life that lacks self-reflection is a major blocker of this Chakra’s energy. To stimulate it, try being still often, take walks, practice a creative activity, or clear out the excess and clutter that fills your work and life. \\nThroat Chakra; Meaning Energy – The throat Chakra is called Visuddha, its color is blue and it can be found in your throat. As it is found in the throat, this Chakra is most closely associated with communication and expression . Beliefs, language and metaphors all stem from this Chakra. \\nDisorganized thoughts and lack of focus will block this Chakra’s energies; to stimulate it, say what you are afraid to say, write down inner thoughts and reflections, express your thoughts through art, charts, or diagrams to visualize what you want to say, and talk to other people. \\nHeart Chakra; Connection Energy – Anahata, or the Heart Chakra, is green and is found at the center of your chest. This Chakra is associated with kindness and love, and it is experienced as the connection one feels between others. \\nBeing alone or isolated will block this Chakra’s energy source . To stimulate it, spend more times with friends and family, connect with people, participate in discussion, and develop partnerships with others. \\nSolar Plexus Chakra; Control Energy – This Chakra is yellow and is called Manipura. It is found in the stomach area and its energy manifests in moments of clarity, and is often associated with our sense of power, confidence, and self-control. \\nBlockages of this Chakra are caused by lack of planning. To stimulate this Chakra, one must create order or structure, expose one’s self to more sunshine, and match our tasks to our energy levels . \\nNaval Chakra; Activity Energy – Also known as Svadisthana energy, the Naval Chakra is orange and can be found in your lower abdomen. This Chakra is tied to our feelings and sexuality, and is associated with movement, doing, achievement and our creative side . \\nStagnation due to self-doubt or procrastination is a major blocker of this energy. To stimulate it, connect emotionally with others, practice doing things in steps, do yoga. \\nRoot Chakra; Existence Energy – The Root Chakra is our Base Chakra, or Muladhara. It’s found in the tailbone and its color is red. the Root Chakra is concerned mainly with one’s sense of security, survival and self-preservation. \\nNegative self-talk and self-doubt are major barriers to this Chakra. This Chakra is highly important because if you are unable to deal with your self-doubts, your limit your access to all other six Chakras and their energies. \\nTo stimulate the Root Chakra, one must confront and overcome self-doubts, visualize tasks being completed and embrace the sense of achievement you will gain once you’ve accomplished them, and listen to what your body is saying when facing these challenges. \\nEach of the seven Chakras are connected to one another and they influence every characteristic of our being. SF Source Dreamcatcher Reality Oct. 2016 Share this:'"}, "time": 1742564190.3959453}