{"duration": 0.05682229995727539, "input_args": {"text": "'By wmw_admin on October 28, 2016 The Volgodonsk, a Buyan-m class Russian corvette. Click to enlarge Reuters — Oct 26, 2016 \\nRussia is sharply upgrading the firepower of its Baltic Fleet by adding warships armed with long-range cruise missiles to counter NATO’s build-up in the region, Russian media reported on Wednesday. \\nThere was no official confirmation from Moscow, but the reports will raise tensions in the Baltic, already heightened since Russia’s 2014 annexation of Crimea, and cause particular alarm in Poland and Lithuania which border Russia’s base there. \\nThe reported deployment comes as NATO is planning its biggest military build-up on Russia’s borders since the Cold War to deter possible Russian aggression. \\nRussia’s daily Izvestia newspaper cited a military source as saying that the first two of five ships, the Serpukhov and the Zeleny Dol, had already entered the Baltic Sea and would soon become part of a newly formed division in Kaliningrad, Russia’s European exclave sandwiched between Poland and Lithuania. \\nAnother source familiar with the situation told the Interfax news agency that the two warships would be joining the Baltic Fleet in the coming days. \\n“With the appearance of two small missile ships armed with the Kalibr cruise missiles the Fleet’s potential targeting range will be significantly expanded in the northern European military theater,” the source told Interfax. \\nRussia’s Defence Ministry, which said earlier this month the two ships were en route to the Mediterranean, did not respond to a request for comment, but NATO and the Swedish military confirmed the two warships had entered the Baltic. \\n“NATO navies are monitoring this activity near our borders,” said Dylan White, the alliance’s acting spokesman. \\nThe Buyan-M class corvettes are armed with nuclear-capable Kalibr cruise missiles, known by the NATO code name Sizzler, which the Russian military says have a range of at least 1,500 km (930 miles). \\nThough variants of the missile are capable of carrying nuclear warheads, the ships are believed to be carrying conventional warheads. \\n“The addition of Kalibr missiles would increase the strike range not just of the Baltic Fleet, but of Russian forces in the Baltic region, fivefold,” said Ben Nimmo, a defense analyst at the Atlantic Council’s Digital Forensic Research Lab, who has been tracking the ships’ progress. \\n“The two small corvettes, with their modern, nuclear-capable missiles, may yet have an impact out of proportion to their size in the Baltic.” SWEDEN, POLAND WORRIED Russian cruise missile launch from ships in the Caspian Sea to targets in Syria. Click to enlarge \\nIzvestia said Russia’s Baltic Fleet would probably receive a further three such small warships armed with the same missiles by the end of 2020. \\nIt said the Baltic Fleet’s coastal defenses would also be beefed up with the Bastion and Bal land-based missile systems. The Bastion is a mobile defense system armed with two anti-ship missiles with a range of up to 300 km (188 miles). The Bal anti-ship missile has a similar range. \\nSweden’s Defence Minister said his country was worried by the presence of the warships in the Baltic Sea, complaining the move was likely to keep tension in the region high. \\n“This is … worrying and is not something that helps to reduce tensions in our region,” Defence Minister Peter Hultqvist told Sweden’s national TT news agency. “This affects all the countries round the Baltic.” \\nSwedish media said the Kalibr missiles had the range to hit targets across the Nordic region. The Russian Defence Ministry said in August that the two corvettes had been used to fire cruise missiles at militants in Syria. \\nPolish Defence Minister Antoni Macierewicz, in Brussels for a NATO meeting, called the deployment “an obvious cause for concern,” the PAP news agency reported. “Moving such ships into the Baltic changes the balance of power,” he said. \\nEarlier this month, Russia moved nuclear-capable Iskander-M missiles into Kaliningrad leading to protests from Lithuania and Poland.'"}, "time": 1742561875.9867764}