{"duration": 0.05391073226928711, "input_args": {"text": "'terrorism , india , russia Opinion Indian Army soldiers leave the site of a gun battle in Pampore, on the outskirts of Srinagar, Kashmir. Source:AP \\nThe Indian experience in fighting against terrorism can be useful for Russia, while the Western experience is narrowly focused. Cooperation with New Delhi on this issue, therefore, is more important than such a dialogue with the West, said Yuri Nagernyak, General Director of “Humanism, Progress and the Rule of Law” Fund, an international foundation for the promotion of culture, science and education. \\n“I think that the Indian direction, in terms of fighting against terrorism in Russia, is extremely important, and I dare say, more important than trying to organize such cooperation with Western countries,” he said during a Moscow-Delhi video bridge, organized by the MIA Russia Today. \\nNagernyak said Russia and India were connected by “deep interests”, and a common vision of the future, which make them “close partners”. \\nKadakin: Russia with India. Terrorism is greatest human rights violation \\nThus, “relations between the two countries, regardless of how the political situation develops, always remain at the highest level,” he explained. \\n“In this sense, in cooperating with India, in terms of the fight against terrorism, we can, firstly, be sure that this cooperation will be real, and not merely declarative. Secondly, we can be confident in the stability of this cooperation. Third, and much more important, it seems to me, exchanges between our two countries will give us much more than cooperation in this sphere between Russia and the West,” believes Nagernyak. \\nThe reason for this, he said, is particularly because India is faced with different directions of terrorism. \\n“The Indian experience in counter-terrorism , and terrorism in many of its different forms, is really beneficial to Russia, while the experience of the West – is actually a very narrow experience,” said Nagernyak. \\nAndrey Kazantsev, Director of the Analytical Centre of the Institute of International Studies, MGIMO (University) MFA Russia, also noted that, “for Russia and India there exists a common interest in stabilizing the situation in such a wide region that includes Afghanistan, Pakistan and Central Asia”. He believes “different formats of Russian-Indian dialogue need to be developed on this aspect of cooperation.” \\nFirst published in Russian by RIA Novosti .'"}, "time": 1742561766.3320162}