{"duration": 0.04879570007324219, "input_args": {"text": "'Google has revealed a new jobs section for their search engine, which will allow users to find job listings in their area, along with commute times and employer ratings. [“At Google   this year, we announced Google for Jobs, a new   initiative focused on helping both job seekers and employers, through collaboration with the job matching industry,” declared Google in an official blog post on Tuesday. “One major part of this effort is launching an improved experience for job seekers on Google Search. We’re happy to announce this new experience is now open for all developers and site owners. ”  “For queries with clear intent like [head of catering jobs in nyc] or [entry level jobs in DC] we’ll show a job listings preview, and each job can expand to display comprehensive details about the listing,” they continued. “If you already publish your job openings on another site like LinkedIn, Monster, DirectEmployers, CareerBuilder, Glassdoor, and Facebook, they are eligible to appear in the feature as well. ” Employers will be able to list their available positions on the search engine, along with their company logo, job details, and reviews and ratings from current employees. Users looking for a job will be able to filter terms and positions in their determined location, allowing them to find more specific openings than other job listing sites. “For added convenience going forward with any job hunt, it will also be possible to turn on alerts for a particular job search, with Google sending a notification via email when relevant new positions are advertised online,” explained TechRadar. “We should hopefully see this functionality introduced in the UK (and other territories) before too long, but for now, as mentioned, this is a   proposition. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742561670.8721654}