{"duration": 0.0472865104675293, "input_args": {"text": "'Trump: \"I\\'m Afraid the Election is Going to be Rigged\" LewGD \\nI seriously doubt that disgusting “grieving” Paki father do rely grieves after his son. I would rather say POS is milking his “grievance” and his “sacrifice”. Sacrifice he is babbling about is not HIS sacrifice but the one from his son eventually. The son lost his life in the war staged by Bush & Co and supported by Hillary, and hypocrite bastard father never raised a word against these people. Instead motherfucker accuses Trump who was against the war that caused “his sacrifice”. \\nIn Iraq, American Soldiers and Marines have been dragged in an Imperial expeditionary war, where too many lost their lives unnecessarily, particularly those riding infamous Humwees, known as widow makers. In such war neither families nor war fighters sacrificed anything. Families have been robbed of their sons and sons have been robbed of their lives. \\nScumbag Paki layer also said how he would never be in the US if it would depend on Trump. He “forgot” to say that if he would never have immigrated to the US, his son would never go in that war and his son would be alive. It’s obvious that Paki Turd is making business from his “grieving”. He made deal with the (((Satanic))) Mafia, hence his soul is black, not Trump’s. \\nIf he would be sincere with this he would rather raise questions long time ago why Soldiers and Marines were sent in the war in Humvees to be blown off almost the same way as if they were riding bicycles. Mother of killed Seal in the Benghazi addressed Hillary directly as a prime culprit. \\nApart of this, RNC made bad decision having their convention prior of DNC. It was stupid move, or maybe intentionally “stupid”, if we take in consideration relations within GOP camp. \\nTrump should be very careful in his reactions now, he better find himself a gang of extra-cunning advisers to fend off rotten scoundrels from Hillary’s (((Mafia))). It is an imperative because too many ordinary voters are total political idiots. Until now, (((Democraps))) managed to fool recklessly naive and politically dumb UNDECIDED voters. \\nTrump should stop reacting as a Bull on a red flag on every provocation. His stormy temper would cost him his presidency. If Trump loses, America loses, Amurkistan wins and Europe becomes Eurabia. \\nAllahu Fuckbar rh2 \\nThe Muslim is a lying POS, so what else is new? All Muslims lie! Lie, Lie,Lie all the time to the dumb white people who don’t what they or Islam are all about. Hard to believe, but most Westerners even today haven’t got a f**king clue about Islam’s true nature: the hellish evil that it represents. After all the mayhem and murders committed by ‘devout’ Muslims, most whites are still in the dark about Islam’s objective of world domination – The Global Caliphate! Thomas Moloian \\nTHIS PAKISTANI FUCKING TERRORIST MUSLIM IS THE BIGGEST LIAR SINCE BAGHDAD BOB Subscribe'"}, "time": 1742628419.6419427}