{"duration": 0.02316141128540039, "input_args": {"text": "'The IMF reported last week that global debt hit a record $152 trillion. I’m old enough to remember when a million was a lot, and in the past two decades we have blown right through talking of millions and billions and are now throwing around trillions like its nothing… By Tim Taschler\\nMuch of this debt has been purchased by none other than the big central banks. Sunday, Bloomberg reported that central bank assets have grown at the fastest pace in five years, topping $21 trillion:\\n\\nThe world’s biggest central banks are bulking up their balance sheets this year at the fastest pace since 2011’s European debt crisis to boost lackluster economic recoveries with asset purchases that are supporting stock and bond prices. \\nThe 10 largest lenders now own assets totaling $21.4 trillion, a 10 percent increase from the end of last year, data collected by Bloomberg show. Their combined holdings grew by 3 percent or less in both 2015 and 2014. \\n\\nYou might think that with all this zero-rate and negative-rate money sloshing around that liquidity in the markets would not be an issue. But take a look at what happened in the forex markets last week. The British Pound (GBP), which is a major currency and heavily traded, took a 6% dive in less than two minutes. For reference, anyone watching the forex markets knows that a 1-2% move in the currency world is considered a big move, and 6% in two minutes is certainly not expected in something as liquid as the Pound.\\n\\nThe explanations for this move range from the standard “fat thumb” (i.e. someone inadvertently typed some extra zeros onto a sell ticket and swamped the market) to the easy-to-blame algo computers. Regardless of the reason, if there was one other than someone simply dumping a large number of Pounds onto the market, this type of thing shouldn’t really happen with so much liquidity sloshing around. People are certainly becoming complacent with ‘flash’ crashes, as if they are a normal occurrence and nothing to pay any attention to. I disagree. I think it could be a ‘tell’ and something to keep an eye on.\\nThink about where we are since 2008. The Fed keeps yapping about raising rates and normalization (though they do little other than talk), which has resulted in bond prices lower and interest rates higher. This is going to put enormous pressure on banks, pension funds and anyone else with a large amount of Sovereign bonds. A bond trader friend of mine told me that seeing all these bonds trading above par (i.e. over their face value) is going to lead to a massive problem. If you pay $1,100 for a $1,000 bond, you are only going to get $1,000 at maturity. At some point there will be losses as these bonds are marked back to par ahead of maturity.\\nMaybe the central bankers will be able to print and talk their way through to some successful outcome without actually raising rates. Or maybe they can have rates rise without causing some major dislocation in more asset classes, whether it be bonds, stocks, forex or commodities. But then again, maybe they can’t and that is why so many large, successful investors such as Soros, Druckenmiller and Buffett are sitting with large allocations of cash. With moves like we had in the Pound last week, it seems that the end game might be drawing near, and people might just want to be a little careful in the construction of their portfolios.\\nIf you have questions about this article, please contact the author, Tim Taschler at ttaschler@sprottglobal.com, or your Sprott financial advisor at 800-477-7853.\\nSource: Sprott’s Thought \\nVia: Silver Doctors \\n'"}, "time": 1742628566.25475}