{"duration": 0.11011600494384766, "input_args": {"text": "'“Sunrise, sunset, swiftly flow the days,” sing the weary residents of Anatevka in “Fiddler on the Roof. ” That will also be the melancholy tune on Broadway in the coming weeks, as several shows, including “Fiddler” and the megahit “Jersey Boys,” prepare to darken their marquees. Here’s a look at what happened during the long runs of five of them. During the run of the revival, the cast went through: 93 pairs of boots and shoes 972 challahs 234  or so haircuts and beard trims 1 onstage marriage proposal (after a show, by Ben Rappaport, who plays Perchik Megan Kane said yes). Other than a misplaced exit, Adrianna Hicks has had very few mishaps as a swing who has covered  —   or stepped in to play  —   seven characters in the   musical “The Color Purple. ” Unlike an understudy, who usually covers one lead role, a swing steps in “whenever someone is out sick or on vacation, or someone can’t make the train,” as Ms. Hicks put it. Like all swings, Ms. Hicks, 27, is at the theater even when she’s not scheduled to perform, in case something happens to an actor during the show. That’s what occurred at a performance in May when Cynthia Erivo, the show’s   star, left after the first act because of illness. “Somebody runs upstairs and was like, ‘Cynthia might be out, so just be prepared,’” Ms. Hicks recalled. “I was like, ‘Nobody talk to me, I just need to focus.’ They announced my name and said the performance would be continued by Adrianna. I remember walking out onstage and with the audience so responsive, loving that moment. ” Ms. Hicks said covering Ms. Erivo’s leading role, Celie, which she has done over 25 times, was the most daunting part of being in the show, her Broadway debut. (She goes next into the Encores! production of “Big River. ”) “In her voice there’s such freedom, because she has it in her body physically,” Ms. Hicks said of Ms. Erivo. “With me, I’m still learning to get it there. ” As for that missed departure, Ms. Hicks said, “Flaws have happened. ” “I have exited off the wrong side of the stage because I’m so set being another character for the entire week, and then, for one show, doing someone totally different,” she said with a laugh. “Thank God we just walk onstage and stand there at certain moments. ” The actor Gerry Vichi thinks “Something Rotten!” might be his last show. He’s 79. He’s developed a hernia that will require an operation, which he put off until after the show closes. He says his memory is fine, but keeping up the     energy is a challenge. So what’s next? “Maybe I’ll sit in my chair and drink Scotch and watch TV,” said Mr. Vichi, who made his Broadway debut in 1981 in the Kander and Ebb musical “Woman of the Year,” with Lauren Bacall. “Who knows? There’s always baseball season. ” Mr. Vichi has been with “Something Rotten!” for the show’s entire run  —   it opened in April 2015  —   playing a comedic version of Shylock. (“He speaks a little more modern and he does like to loan money, but he doesn’t look for a pound of flesh,” he explained.) Between shows on a recent Wednesday, he got on the phone to talk about what he called “probably the most fun of any show I’ve done. ” Following are edited excerpts from the conversation. “Something Rotten!” had a good run. Congratulations. We had a nice run. If it weren’t for Ben Brantley, maybe we would have run longer. Put him on the phone. I’ll tell him. Has performing gotten more difficult as you’ve gotten older?   that’s fine. Keeping up the energy is a challenge, but it’s fun. It’s a joy to come to work every day. How many people can say that? Do you have any   rituals? I will often take members of the cast out to dinner. One night I took a bunch of the girls out. When we fellows get together, we pick a steakhouse, like Quality Meats, and we have a good time. When you say you take members out for dinner, does that mean you pay? I like to pay. I’m a good tipper. Who wants to ask around  —   who had the borscht? Who had the Caesar salad? Give me a break. How do you feel about the show’s closing? There will be tears, but not from me. I don’t have any illusions about being a star or a big shot. I just like to have fun.  Anything else you wanted to say before we close? Tell Ben Brantley I called. When the show wraps up, it will have had: 19 girls featured in the role of Matilda 64 kids employed in the production 1 fresh copy of “Alice in Wonderland” torn up in every show 23, 880 balloons inflated (15 per show) 796 pounds of chocolate frosting shoveled into the face of Matilda’s classmate Bruce, who takes a slice of Miss Trunchbull’s chocolate cake and winds up forced to eat the whole thing. 51 actors have made their Broadway debuts in the show. THREE original Broadway cast members are still in it (Peter Gregus, Mark Lotito and Sara Schmidt). ONE actor has been in it since the   engagement at La Jolla Playhouse (Peter Gregus).  29. 8 pounds of gunpowder have been fired onstage. 31 babies were born to company members in the show (22 are girls). 120, 692 times “Oh What a Night” has been said or sung onstage (26 per performance). 157, 828   (34 per performance).'"}, "time": 1742562206.8486826}