{"duration": 0.04769706726074219, "input_args": {"text": "'Solidarity is “the most effective antidote to modern forms of populism,” Pope Francis told European Union leaders Friday, in a politically charged speech denouncing nationalism as a modern form of selfishness. [In his address to more than 20 European heads of state assembled in Rome for the celebration of the 60th anniversary of the signing of the Treaty of Rome that marked the beginning of the European Economic Community (EEC) the Pope advocated a stronger, consolidated Europe against the rising tide of populist movements.  The pontiff contrasted solidarity, which draw us “closer to our neighbors,” with populism, which is “the fruit of an egotism that hems people in and prevents them from overcoming and ‘looking beyond’ their own narrow vision. ” As a number of European countries prepare for important national elections pitting   leaders against mostly established,   parties, the Pope took an unusually overt stand in favor of a Eurocentric vision of the future of the region. “There is a need to start thinking once again as Europeans,” Francis said, “so as to avert the opposite dangers of a dreary uniformity or the triumph of particularisms. ” “Politics needs this kind of leadership, which avoids appealing to emotions to gain consent, but instead, in a spirit of solidarity and subsidiarity, devises policies that can make the Union as a whole develop harmoniously,” he added. This union will only be lasting and successful if the common will of Europe “proves more powerful than the will of individual nations,” Francis said, quoting the Prime Minister of Luxembourg. France will hold its first round of elections on April 23, followed by a second round on May 7. The latest polls show the Socialist candidate Emmanuel Macron just one percentage point behind the Eurosceptic   Marine   who presently stands to win 25 percent of the first round of voting. Meanwhile in its federal election slated for next September 24, Germany’s chancellor Angela Merkel of the   Christian Democratic Union (CDU) will face off against Martin Schulz of the Social Democratic party, as well as the small but growing Alternative für Deutschland (AfD) party. Merkel’s CDU is part of a strong coalition that includes the Christian Social Union (CSU) as well as the Social Democratic Party of Germany (SPD). Despite Merkel’s ebbing popularity, she is still the current favorite for the fall elections. In Italy, although a date for the next general elections has not yet been set, a new survey this week put the Eurosceptic   Movement at 32. 3 percent of the vote, five and a half points ahead of the ruling   Democratic Party (PD). The poll also put found that the right wing populist Northern League party would currently take 12. 8 percent of the vote, ahead of former Prime Minister Silvio Berlusconi’s Forza Italia at 12. 7 percent. In his address Friday, Pope Francis described Europe as strongest when it “refuses to yield to fear or close herself off in false forms of security,” asserting that “her history has been greatly determined by encounters with other peoples and cultures. ” Europe’s history, he insisted, “is, and always has been, a dynamic and multicultural identity. ” While recognizing that “one frequently has the sense that there is a growing ‘split’ between the citizenry and the European institutions, which are often perceived as distant and inattentive to the different sensibilities present in the Union,” Francis nonetheless continued to advocate for a strong European Union over a shift toward greater decision making at the national level. “Today the European Union needs to recover the sense of being primarily a ‘community’ of persons and peoples, to realize that ‘the whole is greater than the part, but it is also greater than the sum of its parts,’” he said. Follow Thomas D. Williams on Twitter Follow @tdwilliamsrome'"}, "time": 1742561999.7986348}