{"duration": 0.024952173233032227, "input_args": {"text": "'Topics: Donald Trump , rape , Sexual Assault , advertisement Friday, 4 November 2016 This is the full page anti-Trump ad the Central Park Five and Amal Fae Susy paid for in the Daily News this week. \\nIn a surprising twist the men who were coerced as teens into making a false confession of rape are now openly calling for the death penalty to punish Donald Trump. The Central Park Five have even taken out an ad in the Daily News, the same newspaper where Donald Trump placed a full page ad supporting the death penalty for them. \\nAmal Fae Susy, the unknown sixth member of the Central Park five spoke out against Trump at a community day festival in Brooklyn. \\n\"I for one am angry over the time I lost in prison after being wrongfully convicted when I should have been living my life. And meanwhile he [Trump] called for the death penalty for us while he was the one sexually assaulting women at the time. Well, fair being fair, Donald Trump should get a taste of his own medicine and be subject to the death penalty for sexually assaulting all of those ladies.\" \\nSusy\\'s attorney, Chabot Sanders of the international law firm Sanders and Cassandro spoke to the press after Susy\\'s remarks. \\n\"My client Mr. Susy is speaking to the inequalities inherent in the US justice system. Mr. Susy and the Central Park Five, all black men, were rounded up, tried and convicted, all on completely false charges--and we know this for certain because along with DNA evidence exonerating these men, the real rapist has confessed--any evidence used against my client and the Central Park Five has failed any kind of real scrutiny over time.\" \\n\"Meanwhile, a rich powerful white man like Donald Trump, an admitted serial sexual assaulter, he\\'s bragged about it, and even his victims have said that he assaulted them in exactly the same way he described when he was caught on tape. Meanwhile, Donald Trump is walking free? It defies logic.\" \\nDonald Trump for his part went ballistic after the ads came out and fired off tweets till five in the morning. He threatened to sue the six men and the Daily News, and he even launched a new conspiracy theory saying that Hillary Clinton had something to do with getting the men released. \\nAt five a.m. Trump tweeted these: \\nDonald J Trump @realDonaldTrump Wow, if crooked Hillary doesn\\'t have a time machine then she cooked this all up decades ago to make me look bad during the 2016 election. \\nDonald J Trump @realDonaldTrump These Central Park rapists are some bad playas, they confessed and got off when crooked Hillary paid someone else to confess to their crime. \\nThe Spoof\\'s own legal analysts have said it\\'s unlikely Donald Trump will ever face any jail time for sexually assaulting women because, you know, he\\'s a rich white man. Make XRhonda Speaks\\'s  '"}, "time": 1742628415.3418381}