{"duration": 0.12239599227905273, "input_args": {"text": "'Antidoping officials from at least 10 nations and 20 athlete groups are preparing the extraordinary step of requesting that the entire Russian delegation be barred from the Summer Olympics over allegations of a   doping program, according to email correspondence obtained by The New York Times. The antidoping officials and athletes were expected to pressure Olympic leaders on the matter as soon as Monday  —   less than three weeks before the opening ceremony in Rio. They were waiting for the results of an investigation into claims published in The Times of a   doping program conducted by Russian officials at the 2014 Sochi Olympics. Grigory Rodchenkov, Russia’s former antidoping lab director, told The Times in May that he followed government orders to cover up the widespread use of   drugs by dozens of Russian Olympians at the Sochi Games. At least 15 of them won medals, he said. Russian officials have dismissed allegations of a   doping program as a Western conspiracy intended to smear Russia. The country’s track and field team has already been barred from the Rio Games for doping violations calls for sanctions against Russian athletes in every sport would be unprecedented and would likely escalate the geopolitical debate. At least 10 national antidoping organizations  —   including those in the United States, Germany, Spain, Japan, Switzerland and Canada  —   and more than 20 athlete groups representing Olympians from around the world have banded together as they anticipate validation of Dr. Rodchenkov’s claims. The chief executive of the Institute of National   Organizations, a trade group to which dozens of nations’ antidoping agencies belong, urged all members to sign on to the request on Friday, according to an email reviewed by The Times. “It seems very likely that the Report will confirm what will be one of the biggest doping scandals in history, implicating the Russian Government in a massive conspiracy against the clean athletes of the world,” wrote Joseph de Pencier, the chief executive of the national antidoping trade association. “This will be a ‘watershed moment’ for clean sport. ” In an interview on Saturday, Travis Tygart, head of the United States   Agency, said: “We’re not asking for the worst, and obviously we hope there’s no doping going on by states. But if we’re not preparing for all potential outcomes, then we’re not fulfilling our promise to clean athletes. ” Reuters first reported on Saturday that United States and Canadian antidoping officials were planning to call for a wider ban of Russian athletes at the Rio Games. Mr. Tygart and other antidoping officials said they had not seen the report, which was commissioned by the World   Agency and prepared by a Canadian lawyer, Richard McLaren. It is expected to be released on Monday morning in Toronto. Mr. McLaren has indicated that his inquiry will prove true what Dr. Rodchenkov told The Times last spring. Last month, Mr. McLaren delivered a preliminary report to global track and field officials as they were scrutinizing Russia he called Dr. Rodchenkov’s detailed account of swapping out   urine at Sochi with the help of Russia’s intelligence service “credible and verifiable,” adding that he had evidence to confirm that “the ministry of sport was involved in instructing the laboratory to not report positive sample results. ” After that report, track and field’s governing body barred Russian athletes from the Games, leaving a “narrow crack in the door” for Russian athletes who had been subjected to rigorous   outside Russia to petition to compete in Rio, but under a neutral flag. So far, two Russian athletes have been given dispensation. One of them, Yuliya Stepanova, fled Russia in 2014 after alleging widespread doping. President Vladimir V. Putin has called her a “Judas” for betraying the country. “If McLaren produces clear, convincing, irrefutable evidence that there has been systemic   doping in Russian sport,” said Paul Melia, Canada’s top antidoping official, “the appropriate sanction would be for the I. O. C. to ban the Russian Olympic Committee from taking a team to Rio. ” Anticipating confirmation of Dr. Rodchenkov’s account, the group of dozens of antidoping officials are considering addressing Thomas Bach, president of the International Olympic Committee, and the organization’s executive board members. They are preparing to request that the ban applied to Russia’s track and field athletes be applied across sports, with opportunities for athletes to appeal and possibly be given permission to compete under a neutral flag. Since Dr. Rodchenkov outlined an elaborate doping scheme at the Sochi Games, the I. O. C. has repeatedly called for “the right balance between collective responsibility and individual justice. ” It is unclear if Mr. Bach would be persuaded by the antidoping organizations’ request to bar the entire Russian delegation. In May Mr. Bach said he would apply a “ ” policy and would not rule out bans against Russia across entire sports, like track and field. But last month he defended the Russian Olympic Committee, distancing the organization from the sports ministry. Dr. Rodchenkov, however, said he took direct orders from Russia’s deputy sports minister, Yuri Nagornykh, who is a member of Russia’s Olympic Committee. United States lawmakers from the House of Representatives and Senate have expressed concern about Dr. Rodhchenkov’s allegations. Last month, the Senate Committee on Commerce, Science and Transportation said the scandal called into question the “strength and credibility” of the antidoping system. The House Committee on Energy and Commerce echoed that this month, urging Mr. Bach to seize “crucial and timely opportunities” to clean up global sports. “The failure to do so is simply irresponsible, and we will not remain silent,” the lawmakers wrote. Both the Senate and House committees have United States government jurisdiction over international sports, and the United States has contributed tens of millions of dollars to the World   Agency since the early 2000s. Russia’s sports ministry has admitted to doping problems in recent months but denied government involvement. In an interview with The Times in Moscow this month, Vitaly Mutko, Russia’s sports minister, diminished the power of Mr. McLaren’s commission and WADA, which have the ability to make recommendations such as the ones the antidoping officials and athletes are prepared to do. The I. O. C. and sports federations have ultimate authority over who competes at the Games. “Recommendations?” Mr. Mutko said. “It’s about the decisions. With respect to the commission, they do not determine the fate of world sport. ”'"}, "time": 1742563234.5580602}