{"duration": 0.03723406791687012, "input_args": {"text": "'A poster campaign depicting naked children with genitalia of the opposite sex has hit cities across northern Spain thanks to an anonymous American donor. [The posters, which declare that some girls have penises and some boys have vulvas, have appeared at bus stops and metro stations across the Basque Country and Navarre.  Created by transgender advocacy group Chrysallis Euskal Herria, the images have appeared in major cities such as Pamplona, San Sebastián, Bilbao and Vitoria, with the backing of local government. They show four naked children holding hands, including one boy with female genitalia and one girl with male genitalia. Underneath, a slogan reads: “There are girls with penises and boys with vulvas. It’s as simple as that. ” Beatriz Sever, the group’s press officer, said they were designed to “raise social awareness about transgender children and for these children to feel represented”. “There is an evident gap in society’s ability to approach the issue of transgender children in a normal way,” she told El País. “The more we talk, the easier it will be for some parents to detect what is happening to their own children. Many of them deny their kids’ real identity simply out of ignorance. ” The poster campaign was made possible by a 28, 000 euro donation from an anonymous New York businessman. The organisation said he donated the money after reading about an earlier campaign where they handed out educational material in eight different languages. Ms. Sever defended the group’s depiction of naked children, saying: “It makes all the difference between children either being accepted or not. We need to make people understand that nature is not a photocopying machine. Those who deny their identity typically use genitals as an excuse. I myself, as a mother, once used that same argument, until I finally understood what was going on. ” The ongoing drive to push transgender ideology onto children is causing concern from some quarters. A report by two   psychiatrists last August found most children and teenagers who claim to be transgender change their minds as they grow up. It also warned parents and officials not to impose   surgery or treatment on children, saying: “There is no evidence that all children who express   thoughts or behavior should be encouraged to become transgender. ”'"}, "time": 1742561889.9046752}