{"duration": 0.1452345848083496, "input_args": {"text": "'Meet Hillary Clinton’s Secretary of State Send a $200 million check to Iran. October 31, 2016 Daniel Greenfield \\nDaniel Greenfield, a Shillman Journalism Fellow at the Freedom Center, is a New York writer focusing on radical Islam. \\nSeptember 11, 2001 has come and gone. Countless bodies lie scattered in fragments around where two of the country’s tallest skyscrapers once stood. Some have burned to ash. Others had their throats slashed by Islamic terrorists. Still others fought and died on a plane to prevent another Islamic terror attack from taking place. \\nBut Joe has an idea. Joe is a guy with lots of big ideas and this one is a real doozy. \\nThe Senator from Delaware has come a long way since his days as a sixties shyster drumming up business in Wilmington. His formerly bald head is covered in hair so shiny is gleams under neon lights. His teeth are capped and shine almost as brightly. After a generation holding down a squeaky seat in the Senate, seniority makes him a man to be reckoned with. And therefore a man to be listened to. \\nEven if you wish he would shut up. \\n“I’m groping here,” Joe says. For once he isn’t referring to his notorious habits with women that will go on to make him the star of countless viral photographs, massaging, squeezing, caressing. Instead he’s talking about foreign policy. The Chair of the Senate Foreign Relations Committee has no clue. \\nJoe is worried that the Muslims will think badly of us after they murdered thousands of us. And he has a plan to make them feel better. \\n“Seems to me this would be a good time to send, no strings attached, a check for $200 million to Iran,” Senator Joe Biden says. \\nThe remark isn’t quite as random as it seems. The Senator from Delaware, a state not known for its large Muslim or Iranian population, has a friendly relationship with the Iran Lobby. That relationship will only grow friendlier during the Bush era as he attacks America and appeases its enemies. \\nIranian-Americans who hate the Jihadist government that has taken over their country and oppressed the Persian people are outraged when he attends a fundraiser at a pro-Iranian lobbyist’s home in California while treasonously attacking his own government for naming Iran one of the members of the ‘Axis of Evil’. \\nJoe’s usual Amtrak obsession wouldn’t get him in the door in California, but treason, hair plugs and capped teeth make him a big hit outside Delaware. And Joe remains very fond of Iran. \\nHe informs Israeli officials that “Israel will have to reconcile itself with the nuclearization of Iran.\" And that’s all the way back in ’08 before the deal that puts Iran on the path to a Shiite bomb was a nuclear twinkle in Obama’s eye and a radioactive itch in Hillary’s socks. \\nThat was a big year for Biden. It was his first and biggest shot at the big chair in the White House. Joe had tried it in ’88 and was stomped by Dukakis, of all people, after being caught plagiarizing a speech by British politician Neil Kinnock. ’08 got him a useless position in the White House as a consolation prize. \\nThis time around Joe Biden is expected to get the same consolation prize from Hillary Clinton that she got from Barack Obama; the office of Secretary of State of the United States. \\nOf all the jobs that Joe Biden wants and is utterly unfit for, Amtrak train engineer, secret agent and the guy in charge of counting all the money at the bar, it’s hard to think of one that he’s less fit for. \\nJoe Biden blamed Darfur on the Gingrich Revolution. He fell in love with the Taliban. \\n\"The Taliban per se is not our enemy,\" Joe insisted. \"There is not a single statement that the president has ever made in any of our policy assertions that the Taliban is our enemy.\" \\nHe suggested that 95% of the Taliban were probably okay and only 5% were “incorrigible”. Most of the Taliban, he seemed to think, were, like Joe Biden, just in it for the money. \\nBut Joe Biden has a soft spot for Islamic terrorists whether they’re the Shiite Jihadists of Iran or the Sunni Jihadists of the Taliban. Joe loves all the terrorists of the world and the terrorists love him back. \\nIt wasn’t that long ago that we were being lectured to by the media on Bush’s ruination of relations with the rest of the world. If Biden were to become Secretary of State, he would become the third Democratic presidential campaign loser to get the job as a consolation prize for his failures as a politician. The last time a professional held down the job would have been the Bush administration. \\nAnd yet, perversely, each “loser” Secretary has been more incompetent than the last. Hillary’s disastrous time as Secretary of State could only be exceeded by John Kerry who gave away everything to the Russians and who was contradicted by the White House so many times it would have humiliated a lesser man. Or just any man. The only loser who could follow two class acts like that was Joe Biden. \\nJoe Biden’s amateur diplomacy has been one disaster after another. Even his visit to Israel, a friendly ally not known for fractious political visits by American politicians, became an international incident with Biden sulking in his room while Hillary yelled at Prime Minister Netanyahu for 45 minutes over the phone. But somehow Biden, with his gift for appeasing Iran and the Taliban, alienates allies. \\nJust this year, Joe Biden launched yet another attack on Israel. A cynic might almost think that Tehran Joe loves Islamic terrorists and hates those who resist them and fight against them. \\nBiden has claimed that terrorism is not an existential threat. He accused President Bush of being “short-sighted” for using the military to fight Islamic terrorists. He argued that the perception that we want to stay in Iraq helps Al Qaeda. Some years later, his administration’s decision to pull out led to the rise of ISIS. He called for closing Gitmo while insisting that it had “become the greatest propaganda tool that exists for recruiting of terrorists around the world.” \\nSenator Joe Biden was a voice for appeasement. Vice President Joe Biden was part of an administration that empowered and unleashed the malignant power of Islamic terror. Secretary of State Joe Biden would be able to act out his worst fantasies. He could even write that check to Iran. Though the Obama-Biden era has seen cash transfers to Iran that make Joe’s $200 million check seem like chump change. \\nHillary Clinton’s rise doesn’t just mean that she will be making big decisions. It will mean that Joe Biden will have gone from a Wilmington shyster to running the foreign policy of a country he has betrayed.'"}, "time": 1742563808.676036}