{"duration": 0.05724525451660156, "input_args": {"text": "'Today, they are the source of ‘all conspiracy theories’ they are the inspiration behind many fiction novels, movies.\\n\\nIlluminati is considered as the secret organization that is really controlling the world, pulling strings from behind ‘the scene’ and steering the world towards a New World Order. But this all started back in 1776, Ingolstadt, Germany by a man named Adam Weishaupt who was a respectable professor.\\n\\n\\nAdam Weishaupt’s idea was creating a better world. As a boy he was an avid reader, consuming books by the latest French Enlightenment philosophers in his uncle’s library. He was convinced that the monarchy and the church were repressing freedom of thought.\\nAdam Weishaupt was not, he said, against religion itself, but rather the way in which it was practiced and imposed.  His thinking, he wrote, offered freedom “from all religious prejudices; cultivates the social virtues; and animates them by a great, a feasible, and speedy prospect of universal happiness.” To achieve this, it was necessary to create “a state of liberty and moral equality, freed from the obstacles which subordination, rank, and riches, continually throw in our way.” In this period Freemasonry was steadily expanding throughout Europe. This secret group offered appealing alternatives to freethinkers. Adam Weishaupt wanted to join this lodge, however, he decided later to create his own.\\n\\nOn the night of May 1, 1776, the first Illuminati met to found the order in a forest near Ingolstadt. Bathed in torchlight, there were five men.\\n\\nThere they established the rules that were to govern the order.\\n\\nAll future candidates for admission required the members’ consent, a strong reputation with well-established familial and social connections, and wealth.\\n\\nAt the beginning the order had only 3 levels: ‘novices, minervals, and illuminated minervals…’ The name “Minerval” referred to the Roman goddess of wisdom, Minerva, reflecting the order’s aim to spread true knowledge, or illumination, about how society, and the state, might be reshaped.\\n\\nA novice preparing to pass to the higher level of minerval, for example, had to present a detailed report on the titles of the books he owned, the identity of his enemies, and the weak points of his character. All members had to pledge the needs of a society before their personal.\\n\\nTHE RISE OF THE ILLUMINATI: \\n\\n\\nOver the years the secret order grew considerably in size and diversity. By the end of 1784, the Illuminati had 2,000 to 3,000 members.\\n\\nAlthough, at first, the Illuminati were limited to Weishaupt’s students, the membership expanded to included noblemen, politicians, doctors, lawyers, and jurists, as well as intellectuals and some leading writers, including Johann Wolfgang von Goethe.\\n\\nThey included important people in Bavarian public life, such as Baron Adolph von Knigge and the banker Mayer Amschel Rothschild, who provided funding.\\n\\nBaron von Knigge played a very considerable role in the society’s organization and expansion. As a former Freemason, he was in favor of adopting rites similar to theirs.\\n\\nMembers were given ‘secret’ names from famous history characters. Weishaupt was Spartacus, for example, and Knigge was Philo.\\n\\nWith more members the number of levels in the Illuminati had to increase. There were 13 degrees of initiation, divided into three classes.\\n\\nHERE IS THE COMPLETE LIST OF ILLUMINATI CLASSES AND LEVELS: \\n\\n\\nFIRST CLASS \\nEach novice was initiated in humanitarian philosophy until he became a minerval. He then received the order’s statutes and could attend meetings.\\nInitiate Novice Minerval Illuminatus Minor \\nSECOND CLASS \\n\\nThe various degrees in this class were inspired by Freemasonry. The illuminatus major supervised recruitment, and the illuminatus dirigens presided over the minervals’ meetings.\\nApprentice Fellow Master Illuminatus Major Illuminatus Dirigens \\nTHIRD CLASS \\n\\nThe highest degree of philosophical illumination. Its members were priests who instructed lower-degree members. The lower orders of this class were themselves under the authority of a king.\\nPriest Prince Magus King \\nTHE PROHIBITION OF ILLUMINATI: \\n\\n\\nThe secret society stood for some controversial opinions. They considered that suicide was legitimate, that its enemies should be poisoned, and that religion was an absurdity. However, when the Duke-Elector of Bavaria found the secret society was planning to conspire against Bavaria on behalf of Austria, it was then when he issued an edict in June 1784 banning the creation of any kind of society not previously authorized by law.\\n\\nBavarian police found highly compromising documents, including a defense of suicide and atheism, a plan to create a female branch of the order, invisible ink recipes, and medical instructions for carrying out abortions.\\n\\nThe evidence was used as the basis for accusing the order of conspiring against religion and the state. In August 1787, the duke-elector issued a third edict in which he confirmed that the order was prohibited, and imposed the death penalty for membership.\\n\\nAdam Weishaupt lived the rest of his life in Gotha in Saxony where he taught philosophy at the University of Göttingen.\\n\\nThe Bavarian state considered the Illuminati dismantled.\\n\\nTHE ILLUMINATI WAS JUST GETTING STARTED: \\n\\n\\nAdam Weishaupt was accused of helping to plot the French Revolution.\\n\\nThis was the start of a war that will give birth to some of the greatest money machines that still exist today.\\n\\nThe secret society shifted its goals. They already had connections and knowledge. They didn’t need their society to be legal to exist.\\n\\nMembers chose to use the connections for making more money and profit because they realized with enough money you can control the world. You can control the laws. You can establish your agendas without being conflicted by ‘less’ enlightened people’s opinions.\\n\\n\\nThe Illuminati have been fingered in recent events, such as the assassination of John F. Kennedy. Weishaupt’s ideas have also influenced the realms of popular fiction, such as Dan Brown’s Angels & Demons and Foucault’s Pendulum by Italian novelist Umberto Eco.\\n\\nAlthough his group was allegedly disbanded, Weishaupt’s idea still exists, pulling the strings.\\nBut this article raises one really important question. Considering Adam Weishaupt’s first intent ‘a state of liberty and moral equality, freed from the obstacles which subordination, rank, and riches, continually throw in our way’ is it possible for this to be achieved and integrated into a society where people are not fully awaken?\\n\\nLife Coach Code \\nSOURCE '"}, "time": 1742628596.4277313}