{"duration": 0.12441182136535645, "input_args": {"text": "'Senior Vice President for Policy and Programs Fred Fleitz of the Center for Security Policy joined SiriusXM host Joel Pollak on Monday’s Breitbart News Daily to talk about the London Bridge terror attack. [Pollak began by asking if the London Bridge attack would finally provide the   call needed for those who underestimate or downplay the dangers of radical Islamic terrorism.  “A lot of people who were in denial almost say the right thing after these events. They sort of can’t help themselves,” Fleitz replied.  “But what really concerns me is that yes, it’s right we have to improve security  —   we need better outreach, we need better intelligence  —   but there’s something they’re not talking about in the U. K. that really needs to be focused on: the role that the failure to assimilate British Muslims has created the situation,” he said. “There are communities where British Muslims are deliberately not assimilating, are being taught to hate British society, and this is incubating radicalism. There’s actually a parallel system of sharia law courts in the U. K. that operate. ” “We may have generations of radical Islamists in the U. K. until the British government wakes up and stops the situation,” he warned. Pollak pointed out that the United States has unassimilated religious communities with their own internal systems of government that live peaceably alongside their neighbors, such as the Amish and Jewish communities in upstate New York. “It’s certainly true there are some communities in the United States that have not assimilated,” Fleitz agreed. “I’m not concerned about Amish or Jewish communities, but I will tell you that there are enclaves of Muslim communities in Michigan and Minnesota that concern me. We know that in Minnesota there’s a rising rate of measles because the community has not assimilated into the rest of the community, and is not vaccinating their children. This is wrong. This is a big problem. ”  “The problem with these Muslim communities is that it is making them susceptible to this radical worldview that wants to destroy modern society, create a global caliphate, and impose sharia law on everyone on Earth,” Fleitz contended. “These other communities aren’t trying to do that. They’re peaceful religious communities. ” “Also, when we have immigrants coming to a country from another country, I think they need to learn the practices and laws of the country where they’re coming to, the country that is accepting them and serving as a refuge for them. I think when people come to their new home country, they should understand and learn about the laws of this new country. That’s not happening in the U. K.,” he said. Pollak offered the converse observation that some of the worst terrorist murderers, such as the San Bernardino jihadis, appear to be fairly  .  “We can have homegrown radical Islamist terrorists  —   and I don’t really think they’re homegrown, I think they’re inspired or directed by foreign Islamist terrorist organizations  —   but it’s this ideology of hate that either is being communicated to them over the Internet, or is being passed on to members of separated communities in the U. K. It’s the ideology we have to confront, and I think this problem is worse in these separate communities,” Fleitz said. Fleitz argued that measures to hinder the ability of extremists to recruit and coordinate with the Internet should be explored, with due regard for civil liberties, but he is more concerned about “radical clerics and radical mosques who are promoting this type of hate and ideology firsthand. ” “I also want to stop these ISIS videos that we know homegrown radical Islamist terrorists are taking in, and it’s playing a role in radicalizing them,” he added. “I think   was a   call. You could just see how Republicans and Democrats in Washington were working together against the threat. Now we’re challenged by political correctness, and people who are in denial, and don’t want to the let the government take the steps it has to take to go after radical Islam,” Fleitz reflected. “Whenever there’s a radical Islamic terrorist attack, we get these lectures about Islamophobia from our leaders, leaders in the U. K. I think that is really hobbling the ability of our government to go after this threat, and that’s unfortunate. I hope what happened in London will be a   call, but I’m worried in a few weeks we’ll be lectured about Islamophobia again,” he said. “Anyone who raises concerns about radical Islam seems to be tarred and feathered as an Islamophobe in this country. I’ll let the people who peddle this term give a better explanation, but that’s my experience,” he replied when Pollak asked for a precise definition of “Islamophobia. ” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. '"}, "time": 1742564365.2155507}