{"duration": 0.06033134460449219, "input_args": {"text": "'Gun control proponent Shannon Watts, founder of the Michael   Moms Demand Action for Gun Sense in America, claims the “gun lobby” is using the term “suppressor” instead of “silencer” as a way to confuse members of her group. [Both the NRA and the National Shooting Sports Foundation (NSSF) recently held their own suppressor demonstration for media members with the goal of showing what suppressors will and will not do. For example, suppressors reduce the sound of a gunshot —  making it manageable and protecting hearing —  but they do not silence firearms. NSSF’s Larry Keane said, “We prefer to refer to them as ‘suppressors,’ because that more accurately describes what they do. ” He added:  They reduce the noise of gunfire, but they don’t block it. They are simply a muffler for your gun. You hear a car go by without a muffler and it’s loud, but you can still hear it with a muffler. Even former ATF agent David Chipman, a Gabby Giffords’ gun control supporter, believes “suppressor” is the better term for devices that reduce the decibel level of a gunshot. But according to the Hill, Shannon Watts thinks the word “suppressor” is the result of a “gun lobby” tactic to confuse her members and other gun control proponents: “It’s all semantics. Focusing on the name distracts people from the real conversation,” Watts said. “They did the same thing with the debate over whether to use the term ‘assault rifles’ or ‘semiautomatic rifles,’ and then the whole conversation shifted to ‘What are we going to call these things? ’” “They want to get into semantics about the language, so we don’t talk about how dangerous they are. ” Watts’s fellow gun controllers at the Brady Campaign to Prevent Gun Violence are also taking issue with the difference between silenced and suppressed, warning their members to be wary of “gun lobby” claims that suppressors do not silence guns: . @NRA  @NSSF say silencers rn’t dangerous   they don’t fully suppress sound of guns. We call that a gun lobby lie https:  .  pic. twitter.   —   Brady Campaign (@Bradybuzz) May 30, 2017,  AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742562403.5304825}