{"duration": 0.10953831672668457, "input_args": {"text": "'We Are Change \\nThe now known infamous hacker Guccifer 2.0 who hacked and handed 20,000 DNC documents to Wikileaks earlier in the summer updated his blog with a new post. This time Guccifer 2.0 asserts that he has info from inside the FEC’s systems that the Democrats may rig the election.\\n\\nAfter weeks of silence from Guccifer 2.0 with his last post about Trump’s taxes and the Clinton campaigns possible provocation on, October, 18th. Guccifer has ended his silence emerging from the shadows to claim that he is inside the FEC systems and is going to monitor the U.S. elections . That’s not all Guccifer 2.0 is urging fellow hackers to not hack the election to steal the vote but to hack to watch for suspicious activity and voting anomalies within the FEC’s systems.\\nGuccifer 2.0 writes, “I’d like to warn you that the Democrats may rig the elections on November 8. This may be possible because of the software installed in the FEC networks by the large IT companies.”He adds, “ As I’ve already said, their software is of poor quality, with many holes and vulnerabilities. ”\\nGuccifer 2.0 is referring to the speech he gave about the weakness of cyber security and how hackers aren’t to blame it’s the IT security to blame for breached systems.\\nGuccifer 2.0 then goes on to say “I have registered in the FEC electronic system as an independent election observer; so I will monitor that the elections are held honestly.” He ends his post calling for other hackers to join him, and monitor the elections from inside and inform the U.S. society about the facts of electoral fraud.”\\nWith an unprecedented amount of election fraud during the primary all in favor of Hillary Clinton against Bernie Sanders and Project Veritas videos exposing various methods of election fraud including busing in minority voters and intimidating voters with violence . As well as cases of election fraud already starting to emerge across the U.S . in various states. Guccifer 2.0 is probably right that Democrats are trying to rig the election but at this point it would have to be so blatantly obvious that they would need to answer to not one case but two cases of election fraud in one election cycle.\\nA recent video by Bev Harris of BlackBoxVoting provided a real-time demo of how the GEMS vote-fraud system, “fraction magic,” worked. There is more detail available on Bev Harris’s BlackBoxVoting website .\\nI will be doing my own election monitoring of early voting and compiling a list of all the fraud that may potentially take place on November 8th like I did for the primary if they are going to rig the election we will make it known. Guccifer 2.0’s full statement is below.\\nGUCCIFER 2.0’s Statement: \\nINFO FROM INSIDE THE FEC: THE DEMOCRATS MAY RIG THE ELECTIONS \\n \\nI’d like to warn you that the Democrats may rig the elections on November 8. This may be possible because of the software installed in the FEC networks by the large IT companies. \\n \\nAs I’ve already said, their software is of poor quality, with many holes and vulnerabilities. \\n \\nI have registered in the FEC electronic system as an independent election observer; so I will monitor that the elections are held honestly. \\n \\nI also call on other hackers to join me, monitor the elections from inside and inform the U.S. society about the facts of electoral fraud. \\nThe post Guccifer 2.0 Issues Alert For Hackers To Independently Monitor U.S. Elections appeared first on We Are Change .\\n'"}, "time": 1742563958.1895936}