{"duration": 0.04510998725891113, "input_args": {"text": "'Twitter announced a new video deal with the National Football League (NFL) but the platform won’t be streaming games anymore. [Tech Crunch reports that Twitter “lost the deal to stream the NFL’s Thursday Night Football games this year to Amazon. ” Instead, the social media site “will stream official NFL video and other content to fans   including a new   live digital show that will air on Twitter five nights per week, during football season. ”  “The show will be hosted by NFL Network talent and will focus on covering ‘breaking news, game highlights, key storylines, fantasy projections, team power rankings,   updates,’” they continued, adding, “In addition, the live   coverage will include Periscope broadcasts like play   and sideline interviews, designed to give football fans    access to teams on game days. ” In a statement, Twitter expressed excitement at the opportunity to work with the NFL. “We are very excited to offer football fans around the world even more content on Twitter from the NFL,” said Twitter COO Anthony Noto. “This new   collaboration will bring compelling live studio programs that discuss what’s happening in the NFL, unique    live broadcasts before games, and the best NFL highlights to Twitter, alongside the   NFL conversation. ” The NFL also added that they have “every expectation” that the partnership will become “some of the most popular programming on Twitter. ” “Twitter continues to be an important partner in accessing millions of highly engaged fans on digital media,” said the NFL’s chief media and business officer, Brian Rolapp. “We have every expectation that the new daily live show, produced by NFL Network and featuring some of our top analysts, will quickly become some of the most popular programming on Twitter. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742563147.1001437}