{"duration": 0.040595054626464844, "input_args": {"text": "'We’re about 600 to 3, 000 feet below the ocean’s surface. It’s cold, it’s dark and it’s slow down here. If you’re lucky, it’s blue in the daytime and black at night. And the deeper we go, the darker it gets. Welcome to the twilight zone, fishies. There’s not much to eat and no green plants growing either. Here, you eat what you can get, and find a way to eat it, or you starve. It’s weird down here, in the mesopelagic zone of the deep sea. Creatures can be sluggish, but they are well adapted. Some use big eyes to find prey. Others make their own flashlights. Big mouths help predators eat big prey. That may be why barbeled dragonfishes have special head joints that allow them to open up their mouths 120 degrees and swallow big prey whole. This flexible head joint, described for the first time in a study published on Wednesday in the journal PLOS One, is unlike any other known to science. Nalani Schnell, a zoologist at the French National Museum of Natural History, had already discovered that different groups of barbeled dragonfishes had an unusual gap between their heads and necks that other fishes don’t have. Some gaps were the result of a missing first vertebrae. Others resulted from the absence of a spine, filled in instead with an elongated notochord, a flexible rod made up of something similar to cartilage. To find out the function of these gaps, Dr. Schnell teamed up with Dave Johnson, a zoologist at the Smithsonian National Museum of Natural History. Together, they obtained five divergent groups of the species from museum collections, macerated the flesh from their bodies and stained the bones different colors. This allowed them to actually move the bones around, which led to the discovery that the gap was a functional joint that allows the fish’s head to move up and out. “In most other fishes, the head has a strong connection to the rest of the body, without much flexibility,” Dr. Schnell wrote in an email, which is a stabilizing force during swimming. But “the barbeled dragonfishes are    (ambush) predators, and prey items are scarce in the  . ” As the species diverged into different groups, the flexible gaps in the more primitive fish developed into “an actual folding apparatus that makes this a true joint,” Dr. Johnson said. “There are no other fishes that have that sort of a directional, complex articulation. ” A joint that allows them to open their mouths wide is advantageous because they can engulf large prey that can sustain them for long periods of no food. Like the moray eel, barbeled dragonfishes use a second set of teeth to pull the large prey into their bodies to digest it. “Imagine yourself out in the middle of the ocean, and you’re trying to make a living. You’re going to eat anything you can, if you think it isn’t going to kill you,” Dr. Johnson said. “You don’t bypass this thing because it’s too big to eat, because you don’t know when you’re going to see another meal. ”'"}, "time": 1742562232.6285493}