{"duration": 0.025832653045654297, "input_args": {"text": "'Un exorcista presentará la nueva temporada de “Hermano Mayor” EL PADRE CARRASCO LIDIARÁ CON ADOLESCENTES CONFLICTIVOS \"CON UNA BUENA HOSTIA A TIEMPO\" televisión \\nEl padre Carrasco, párroco en una iglesia de Ourense, sustituirá al exboxeador Jero García al frente del programa “Hermano Mayor”, en el que un experto lidia con adolescentes conflictivos. Así lo anunciaba Toribio Vallés, director de programación de Cuatro, en rueda de prensa. La cadena de Mediaset cree que Carrasco es la persona adecuada por su perfil “conciliador, sereno y acostumbrado al trato con criaturas diabólicas”. \\nEl cura confesó que la llamada de Cuatro le sorprendió más que la de Cristo. “El de exorcista es un trabajo con poca visibilidad”, ha admitido. “Que tu cliente te vomite y te insulte no es plato de buen gusto para nadie, pero también tiene cosas bonitas: conoces gente, ayudas a familias desesperadas y puedes practicar lenguas muertas, como el arameo, el latín o el bable”. Carrasco ha explicado el caso de “el demoniu cabreau”, en el que una señora fue poseída por un diablo asturiano y acabó siendo alcaldesa en su aldea por el Partido Popular. \\nLa temporada de “Hermano Mayor” ya está en proceso de grabación. Según adelanta Vallés, los casos son más espectaculares que otros años. “El padre Carrasco visita a una adolescente que no estudia, es muy respondona y gira la cabeza 350 grados”, ha explicado. “Técnicamente no es una posesión, le faltan diez grados para serlo, pero el procedimiento es similar: agua bendita y el cuerpo de Cristo”, precisa. El cura ha defendido que “lo mejor en estos casos es una buena hostia a tiempo”. \\nCarrasco se inició en el mundo del exorcismo viendo tutoriales de YouTube. “Las primeras expulsiones del demonio las realicé en vacas que hay en la granja de mis padres”, ha relatado. Poco a poco fue perfeccionando la técnica, primero con primates, luego con pelirrojos y finalmente con personas. \\nLos responsables del programa han aprovechado la cobertura mediática para hacer una llamada a la población: “Si tenéis un hijo rebelde, que usa expresiones como ‘coworking’, ‘CEO’ o ‘Voy a montar una startup’, poneos en contacto con nosotros. Quizá aún estemos a tiempo de salvar su alma”.'"}, "time": 1742628567.569076}