{"duration": 0.0598907470703125, "input_args": {"text": "'Protesters, Police Still Clashing Over Disputed North Dakota Pipeline 11/03/2016 \\nNPR \\nPolice used pepper spray and what they called nonlethal ammunition to remove Dakota Access Pipeline protesters from federal land Wednesday. Demonstrators say they were trying to occupy land just north of the Standing Rock Sioux Reservation where construction of the controversial pipeline is scheduled. \\nThis was the first significant clash between law enforcement and protesters since demonstrations turned violent last week and more than 100 people were arrested. \\nAccording to the Morton County, N.D., Sheriff’s Department, a group of people began building a wood pedestrian bridge across a creek north of the main protest camp early Wednesday morning. The U.S. Army Corps of Engineers owns the land and had asked law enforcement to remove any protesters who try to reach it. \\nOfficers in boats pulled the makeshift bridge apart and warned protesters they would be arrested if they continued to trespass. After a several-hour standoff with police, protesters dispersed and returned to their main camp. \\nDuring the standoff, a few protesters watched from across the nearby Cannonball River. They waded into the water — some chest-deep — to shout support for colleagues closer to officers. \\n“I decided to get into the river and just be a presence there,” says Stephanie Jasper of Tampa Bay, Fla. She watched as law enforcement pushed protesters back toward the main camp, and says she saw officers use pepper spray. She says it was a chaotic sight as a police helicopter hovered overhead. \\nSeveral protesters standing in the river held mirrors directed at law enforcement officers lined up on the other side and at police on the river in boats. \\n“Everybody was just sharing love to these officers and explaining why it is we’re here and questioning why they were,” says Jasper. \\nOne law enforcement official had a very different view of the protest. “In my 27 years in law enforcement, I have never seen such an absolute disregard for the law or other people’s rights because of someone else’s ideology,” said Cass County, N.D., Sheriff Paul Laney. \\nThe Standing Rock Sioux Tribe says the Dakota Access Pipeline construction route crosses land that is sacred to its members. And the tribe worries a pipeline spill could pollute local water. The tribe wants the federal government to stop work on the pipeline and conduct a full environmental impact study of the pipeline. \\nThe Morton County Sheriff’s Department says one person was arrested for “conspiracy to commit obstruction of a government function.” In a press release, the agency says the protester was buying canoes and kayaks for others to cross the creek.'"}, "time": 1742564393.8909998}