{"duration": 0.1833946704864502, "input_args": {"text": "'Humiliated Hillary Tries To Hide What Camera Caught 15 Mins Before Rally Posted on October 27, 2016 by Amanda Shea in Politics Share This Hillary Clinton outside rally (left), Fox News catching incident on live feed (right) \\nBoth presidential candidates stopped in the battleground state of Florida this week to campaign for votes to crowds at separate locations. However, things didn’t go so well for Hillary Clinton, who was humiliated when a camera caught what she immediately tried to hide to save her campaign — which backfired big time. \\nWhile Donald Trump’s 15,000-person army of “Deplorables” were holding down the fort in Stanford, Florida as they listened to this great leader explain how he plans to make America great again, Hillary was at a much smaller venue at Palm Beach State College. Although she was feeling pretty good about herself with having a higher turnout than she’s used to, the approximate 1,000 to 2,000 attendees paled in comparison to what Trump was looking at in the same state. However, Hillary’s anemic crowd was enough to be publicly mocked in front of. \\nPerhaps Hillary didn’t think anyone would notice, but Fox Business Network was watching — and commenting — live. With just fifteen minutes before the Democratic candidate was set to take the stage in one of her final and most important rallies, the small room should have been jam-packed with people. As the humored hosts noted on the news show, that was far from the case. \\n“Here it is nowhere near the size of the crowd we saw in Sanford, Florida yesterday for Mr. Trump, 15,000. There’s maybe a thousand to two thousand people here today,” one host pointed out much to Hillary’s embarrassment. “The Clinton rallies tend to be much smaller and you can see there’s empty space here and she’s supposed to speak in 15 minutes. And I can tell you that as the camera pans across that if we were at a Trump rally this would absolutely be packed,” the commentators added. \\nNo matter how far ahead in the polls Hillary and her lapdog media says she is, the attendance at her events speaks volumes. Nobody cares or is enthusiastic enough about this woman to bother showing up, and those who do have to be coached on how to chant and act excited. \\nOn the other hand, there are Trump’s rallies, where so many people turn up to venues four times the size as Hillary’s that these massive stadiums can’t contain everyone who is eager to come, and some are turned away. If the turnout at the rallies is any indicator of what’s expected at the polls, Hillary can’t win, and if she does, Americans should definitely question how that could even happen'"}, "time": 1742561620.8047836}