{"duration": 0.027518272399902344, "input_args": {"text": "'President Donald Trump accused former President Barack Obama of wiretapping his campaign headquarters during the election in a series of messages on Twitter. [“Terrible! Just found out that Obama had my ‘wires tapped’ in Trump Tower just before the victory,” he wrote on Twitter. “Nothing found. This is McCarthyism!”  Trump questioned whether it was legal for Obama to be wiretapping a presidential candidate while he was still in office. “How low has President Obama gone to tapp (sic) my phones during the very sacred election process,” he wrote. “This is  . Bad (or sick) guy! Is it legal for a sitting President to be ‘wire tapping’ a race for president prior to an election? Turned down by court earlier. A NEW LOW!” Trump is likely referring to calls from talk radio hosts Mark Levin and Rush Limbaugh to investigate the nature of the Obama administration’s investigations of his campaign aides for their communications with Russia, as Breitbart News editor Joel Pollak reported.  As former Heat Street editor Louise Mensch reported the day before the election, “sources with links to the   community” confirmed that a FISA court had granted a FISA court warrant in October to monitor activities in Trump tower. They were previously denied a request in June, according to the report as well as a report in the Guardian.  The New York Times reported on Wednesday that the Obama team classified the investigation at the lowest possible level, allowing the data gathered from the investigation to be shared and leaked widely within the administration. In January, The New York Times reported that intelligence reports based on some of the wiretapped communications had been provided to the Obama White House even though there was “no conclusive evidence of wrongdoing” between Russian officials and associates of Trump. On Twitter, Trump suggested that he might even have legal options against the former president. “I’d bet a good lawyer could make a great case out of the fact that President Obama was tapping my phones in October, just prior to Election!” he wrote.'"}, "time": 1742562262.6139548}