{"duration": 0.061721086502075195, "input_args": {"text": "'Man Finds Heartbreaking Note On Car, Last Line Teaches Him NASTY Lesson Posted on October 26, 2016 by Robert Rich in News Share This \\nAfter coming out to the parking lot, a motorist was puzzled to see that there was an unexpected note on his car. However, the situation would soon take a heartbreaking turn when he read what was inside – until he got to the last line, which taught him perhaps the nastiest lesson of his life. \\nAlthough details surrounding the note are unclear, the account was posted to Reddit , along with a corresponding image on Imgur , depicting quite a strange series of events. As it turns out, a man found a note on his car only to realize that it was a devastating story about a stranger’s cancer-stricken grandfather. Stock image of note on car \\nAs explained in the note, the writer was about 10-years-old at the time his grandmother desperately tried to get her husband to quit smoking. According to the stranger , his grandmother said to his grandfather, “If you ever want to see your grandchildren graduate, you need to stop immediately.” \\nThe seemingly harsh message apparently had a dramatic and instant effect on his grandfather as he recalls that his eye’s welled up with tears. Sure enough, the man quit that day – but unfortunately, it was too late. \\nIn a heartbreaking twist, the note details how the writer’s grandfather died just 3 years later of lung cancer, never seeing his grandkids graduate. As if that wasn’t gut-wrenching enough, the note went on as the stranger explained how his mother begged him never to smoke, saying “don’t put your family through what your grandfather put us through.” The note in full (Source: Mirror ) \\nOf course, he obliged. However, the note seemed to change in sentiment at that moment, and the writer taught the driver of the car a nasty lesson with the last line of the odd note. “I must say, I feel a slight sense of regret for never having done it because your parking job was so sh*tty that it gave me cancer anyways,” he wrote. “Jesus, f*ck, please learn how to park.” \\nYou have to admit, this dig was perhaps the most well thought out act of passive aggression that has been seen in quite some time. Although the message came across a bit rough, I think it’s safe to say that this guy won’t be parking outside the lines for quite some time.'"}, "time": 1742562108.2623243}