{"duration": 0.4395942687988281, "input_args": {"text": "'Páginas Libres\\n¡Demoledor amparo contra Salgado, Keiko y 72 congresistas más! Socios | 5 de noviembre de 2016 Caso 3 directores BCRP:\\nExp. N° Juzgado Constitucional de Turno de Lima Escrito N° 01\\nAmparo por sensible violación de los derechos constitucionales: 1.- a contar con funcionarios públicos elegidos legítimamente; 2.- al voto congresal válido, con apego a la Constitución Política, ley respectiva y al Reglamento del Congreso; y 3.- a la transparencia de los actos de los diversos órganos del Estado que garantice el acceso a la información pública.\\nSEÑOR JUEZ CONSTITUCIONAL DE TURNO:\\nGUILLERMO OLIVERA DÍAZ, DNI 08365472; con domicilio real y ad líttem en Avenida San Borja Sur 520-201, SAN BORJA, en la demanda que promuevo, por propia iniciativa y convicción, en defensa de la constitucionalidad y legalidad de los actos del Estado, así como la acrisolada moral y ética política que el país reclama, a su Despacho digo:\\nQue, siendo todo acto del Estado, y de personas particulares, pasibles de control constitucional, cuando se violan o amenazan derechos fundamentales, interpongo demanda de amparo contra: a.- la Presidenta del Congreso, Luz Salgado Rubianes; b.- la ciudadana Keiko Sofía Fujimori Higuchi; c.- y todos los congresistas, cuya relación adjunto en hoja oficial aparte, que, en la sesión del Pleno del Congreso, del 27-10-2016, votaron por la elección inconstitucional, ilegal, antirreglamentaria, con fraude procesal, de 1.- José Chlimper Ackerman; 2.- Rafael Rey Rey; y 3.- Elmer Rafael Cuba Bustinza, como miembros del Directorio del Banco Central de Reserva, según aparece en la Resolución Legislativa del Congreso N° 008-2016-2017-CR, del 27-10-2016, publicada en El Peruano al día siguiente, cuya nulidad debe ser declarada, porque se dictó en violación de los Artículos 86°, 94° y 102°, inciso 2, de la Constitución Política; del Artículo 11° de la Ley Orgánica del Banco Central de Reserva del Perú; y del Artículo 64°, 1ª. parte e inciso c del Reglamento del Congreso.\\nExtraña proponente, con fraude procesal.- A prima facie, la aludida elección fue hecha ante pedido, con claro dolo de fraude procesal, misterioso, nada transparente, sospechoso y asaz temerario, planteado por la ciudadana Keiko Sofía Fujimori Higuchi, quien es una persona particular, lideresa máxima del partido político Fuerza Popular y no ejerce función alguna en el Congreso. Que ella propuso a Chlimper y Cuba lo confesó el congresista fujimorista Miguel Ángel Torres Morales, al declarar sin ambages al periódico Perú 21, el 2 de noviembre del año en curso. ¡Keiko pidió ayer y tuvo efecto al día siguiente, por una suerte de arte congresal de birlibirloque, manumitido, porque así opera con eficacia y velocidad el fraude procesal (Art. 416, Código Penal) que ella sigilosamente puso en marcha!\\nNo dijo Torres Morales si tal proposición de Keiko Fujimori fue oralmente, por escrito, por fax o tuit, ni ante qué autoridad u órgano del Congreso lo hizo, aunque se sabe que fue puesta en conocimiento de la Junta de Portavoces del Congreso, que preside Luz Salgado, recién ese mismo día, 2-11-2016, a las 4 de la tarde, y la meteórica y espasmódica elección fue al día siguiente, 3-11-2016, en horas de la mañana, en menos de 24 horas, sin debate alguno en el Pleno, sin que los congresistas votantes tengan entre manos el Currículum Vitae, o siquiera algunos documentos, que permitieran apreciar o escudriñar sobre si los candidatos propuestos tenían o no los requisitos que la Ley Orgánica del Banco Central de Reserva exige, como son “reconocida solvencia moral” y una “amplia competencia y experiencia en economía y finanzas”, y que “no representen a entidad o interés particular alguno”. Obviamente, estos requisitos deben acreditarse con documentos, no deducirse, y no inferirse del aire, por tratarse de hechos macizos, sostenidos en el tiempo, tampoco supeditarse el voto a consignas partidarias, amén de la subida trascendencia del elegido.\\nPETITORIO\\nQue, en estricta aplicación del Artículo 40° del Código Procesal Constitucional que permite interponer demanda de amparo, a “cualquier persona”, por violaciones a los “derechos difusos que gocen de reconocimiento constitucional” (como al aire, al agua, al medio ambiente, al patrimonio cultural e histórico, al legítimo ejercicio de la función pública, a la institucionalidad con cabal asidero constitucional, legal y reglamentario, si acaso alguien los ha logrado contaminar o averiar), interpongo esta demanda de amparo por la afectación o lesión, que agravia al Estado o a la sociedad en general, de los siguientes derechos constitucionales:\\n1.- a contar con funcionarios públicos elegidos legítimamente; 2.- al voto congresal válido, con apego a Constitución Política, Ley Orgánica del Banco Central de Reserva y al Reglamento del Congreso; y 3.- a la transparencia de los actos del Estado que garantice el acceso a la información pública.\\nEn consecuencia, solicito que, reponiéndose las cosas al estado anterior a la violación de los derechos denunciada, se declare la NULIDAD (dejar sin efecto) de la Resolución Legislativa N° 008-2016-2017-CR, de 27-10-2016, publicada en El Peruano, el 28-10-2016 y del Procedimiento Especial Parlamentario que le sirve de antecedente, de la misma fecha, donde se ¡omitió adrede el debate! y se adoptó ¡acuerdos, vía votación ilegítima, sin previo debate!, que el Reglamento del Congreso exige (Artículo 64°), pasos procedimentales que son de obligatorio cumplimiento, por estar previstos en normas especiales, atinentes precisamente a la elección de los miembros del Directorio del Banco Central de Reserva que le compete al Congreso, tal como lo prevé el Artículo 86° de nuestra Carta Política.\\nFUNDAMENTOS DE HECHO y JURÍDICOS\\n1.- Derecho a contar con funcionarios públicos elegidos legítimamente\\nEl Artículo 86° de la Constitución Política se ocupa expresamente de la elección, por el Congreso, de tres (3) miembros del Directorio del Banco Central de Reserva. Por lo tanto, los ciudadanos tenemos el derecho que esta selección o elección sea minuciosa, ponderada, responsable y legítima, contando con los elementos de juicio del caso. No se elige a ciegas, por consignas inalámbricas, sin verle la cara al elegido, sin escucharlo y sin examinar quién es, como en realidad se hizo. ¡Se violó, pues, con suma torpeza esta norma constitucional!\\nComo quiera que la propia Constitución Política no consigna otros ingredientes de tal elección, ella misma se remite a que sea el Reglamento del Congreso el que la desarrolle. De eso se ocupa el Artículo 94° de la misma Carta Política, cuando establece: “El Congreso elabora y aprueba su Reglamento, que tiene fuerza de ley”. Con este Reglamento el Congreso opera, actúa o funciona y no a discreción de la presidenta, o pero aún de una persona particular como Keiko Fujimori.\\nCon tal sentido y propósito el aludido y vigente Reglamento del Congreso trata expresamente de la elección de esos tres directores, en un llamado “procedimiento parlamentario especial”, el mismo que ha sido burlado, transgredido o violado, pese a su asidero constitucional y su indiscutido rango legal. Veamos lo que establece su Artículo 64°, inciso c, del “procedimiento especial”, como uno de los 3 “procedimientos parlamentarios”:\\n“Los procedimientos parlamentarios son el conjunto de actos sucesivos e integrados que se realizan para promover el debate y los acuerdos del Congreso destinados a producir leyes y resoluciones legislativas, actos de control político y designaciones y nombramientos. Pueden ser:\\na.- Procedimiento Legislativo; que comprende el debate y aprobación de leyes ordinarias, leyes orgánicas, leyes autoritativas para ejercer la legislación delegada, leyes presupuestales y financieras, leyes de demarcación territorial, leyes de reforma de la Constitución Política, del Reglamento del Congreso y de resoluciones legislativas. b.- Procedimientos del Control Político; que comprende la investidura del Consejo de Ministros, la interpelación a los Ministros, la invitación a los Ministros para que informen, las preguntas a los Ministros, la solicitud de información a los Ministros y a la administración en general, la censura y la extensión de confianza a los Ministros, la investigación sobre cualquier asunto de interés público, la dación de cuenta y el antejuicio político.\\nc.- Procedimientos Especiales; que comprende la designación del Contralor, la elección del Defensor del Pueblo, de los miembros del Tribunal Constitucional y de 3 miembros del Directorio del Banco Central de Reserva, así como la ratificación del Presidente de dicho Banco y del Superintendente de Banca y Seguros”. (Artículo modificado aprobado por el Pleno del Congreso de fecha 6 de marzo de 1998).\\nEn consecuencia, el “procedimiento especial”, donde resultaron elegidos los 03 directores en cuestión, vulneró o violó lo que dispone la parte general e introductoria de este Artículo 64° del Reglamento del Congreso, aplicable a aquél, respecto de todo “procedimiento parlamentario”, que es definido como el “conjunto de actos sucesivos e integrados que se realizan para promover el debate y los acuerdos del Congreso destinados a producir...resoluciones legislativas, actos de control político y designaciones y nombramientos”.\\nLo real y apodíctico fue que en aquella sesión donde se produjo la elección ¡no hubo debate alguno!, por lo que no se examinó nada que permita colegir que se eligieron o escogieron a quienes tenían una “reconocida solvencia moral” o quizá “amplia competencia y experiencia en economía y finanzas”. ¡Todo fue un remedo!\\nComo se podrá fácilmente advertir la elección del jueves 27-10-2016 ¡no se hizo en un procedimiento especial reglamentario!, sino en uno trucado, ¡sin promover el debate!, y, además, ¡sin adoptar los acuerdos como producto de dicho debate!\\nPor lo tanto, no solo se transgredió el Artículo 86° de la Constitución Política, sino también la primera parte y además el inciso c del Artículo 64 del Reglamento del Congreso, de expreso fundamento constitucional, con lo cual la ciudadanía peruana toda, de la que formo parte, resultó agraviada en su derecho a contar con funcionarios del Banco Central de Reserva constitucional, legal y reglamentariamente elegidos.\\n¡Por ende, los 3 ciudadanos que de este modo vedado resultaron electos: José Chlimper Ackerman, Rafael Rey Rey y Elmer Rafael Cuba Bustinza, frente a una proposición de Keiko Fujimori con fraude procesal, son ilegítimos!\\n2.- Derecho al voto congresal válido, con apego a Constitución Política, Ley Orgánica del Banco Central de Reserva y Reglamento del Congreso\\nComo se sabe la elección de los 3 miembros del Directorio del Banco Central de Reserva fue por 84 votos, la de Elmer Cuba; por 72, la de José Chlimper; y por 71, la de Rafael Rey. Ningún guarismo de esa votación puede considerarse válido, legítimo, porque ninguno de los votantes tenía la información documental que oficialmente se debería haber presentado, distribuido a cada uno de los parlamentarios y examinada como fundamento de su voto. La propia misteriosa proposición de dos candidaturas por Keiko Fujimori sabemos que no apareja ningún documento de los candidatos, pese a que la Ley Orgánica del Banco Central de Reserva, en su Artículo 11°, exige como requisitos, de los que aspiren a ser miembros del Directorio del Banco, tener “reconocida solvencia moral” y una “amplia competencia y experiencia en economía y finanzas”. Se trata de elementos reales, de hechos que deben probarse con documentos indubitables que el votante tiene que tener ante sí, para analizar, contrastar, evaluar y decidir su voto con apego a derecho, sin falsear su decisión a través del voto no informado o por intereses vitandos que agreden al país. Reza el violado y desacatado, al votar inválidamente, Artículo 11° de la citada Ley Orgánica: “ Los Directores deben ser peruanos, tener reconocida solvencia moral y poseer amplia competencia y experiencia en economía y finanzas. No representan a entidad o interés particular alguno y su voto debe tener en cuenta únicamente el cumplimiento de la finalidad y las funciones del Banco”. Si todos los congresistas votantes nunca vieron, dentro del llevado a cabo “procedimiento especial parlamentario”, al que hemos antes glosado, ningún documento de los 3 propuestos, 2 por Keiko y otro dizque por el APRA, ni hubo debate alguno –el cual se obvió adrede- respecto de sus calidades personales y profesionales, el voto que emitieron fue ciego, inducido por el mentado fraude, sin deliberación mental alguna, al carecer de elementos de juicio objetivos reales sobre esa “reconocida solvencia moral”, la necesaria “amplia competencia” y además la “amplia experiencia” que deben favorecer a cada uno de los propuestos para un voto aprobatorio, válidamente emitido. ¡Si los hechos-requisitos y su prueba concomitante no están ante sí del congresista votante, su voto resulta viciado, por ende ilegítimo y nulo!\\n3.- Derecho a la transparencia de los actos del Estado que garantice el acceso a la información pública.\\nTodo indica que nada en este procedimiento parlamentario de elección de estos 3 directores del BCRP fue transparente; todo fue turbio, de principio a fin, con un clarísimo fraude procesal iniciado por la demandada Keiko Fujimori. Tanto la repentina proposición fraudulenta hecha por Keiko Fujimori, el día 26-10-2016, un día antes de la elección, sin que se sepa hasta hoy cómo fue, ante una Junta de Portavoces que no recibió ni vio los Currículum Vitae de los propuestos; así como la aluvional votación llevada a cabo el día siguiente, el jueves 27-10-2016, sin examinar ningún documento acerca de los requisitos que la ley exige a los candidatos y sin el debate que el Artículo 64° del Reglamento del Congreso requiere para esta elección específica, en un procedimiento parlamentario especial, en relación a las calidades personales y profesionales, de los 3 futuros miembros del Directorio del Banco Central de Reserva, no reviste la obligatoria transparencia que deben adornar a los actos del Estado, como éste del Congreso, que prevé y regula la Ley 27806, o Ley de Transparencia, a fin de garantizar el derecho fundamental del acceso a la información que consagra el numeral 5 del Artículo 2 de la Constitución Política.\\nCuando los actos estatales realizados en todo el procedimiento especializado parlamentario en cuestión no son transparentes, como en efecto no lo han sido, el derecho fundamental a la información pública resulta vulnerado, lo cual debe ser reparado.\\n¿Fue la bravura de una bravísima KEIKO, su audacia o un interés nefando que la llevó a proponer con fraude a miembros del BCRP? ¡Por lo menos, se sabe que fue Keiko Fujimori quien propuso, ¿oralmente o por escrito?, a su secretario general de su partido político, José Chlimper y a su ocasional asesor Elmer Cuba, como directores del BCRP, ambos activistas de su campaña electoral presidencial última, y ninguno de los 72 congresistas suyos chistó, rechistó, ni hizo amago de mueca alguna, todos doblegaron la cerviz y designaron, de un día a otro, mediante su voto, a los propuestos, sin trámite ni debate alguno, ciegamente, sin examen de requisitos legales y sin tener a la vista a semejantes candidatos, ni siquiera oírlos porque tenían una premura inusitada!\\n¿Tiene una persona particular, como Keiko Fujimori, lideresa de una agrupación partidaria, el derecho de proponer, con efectos legales e inmediatos, en un procedimiento especial parlamentario, sin ser congresista, a directores del citado Banco, nada menos que al Secretario General de su partido Fuerza Popular y a otro activista de su reciente campaña electoral presidencial?\\n¿Serán los propuestos, de contundente actuación político partidaria, las personas independientes que contribuyan a la autonomía que requiere el BCRP sin poner en riesgo la confidencialidad de una sana política bancaria y monetaria en particular?\\n¡Lo confiesa alegremente que ella fue la que propuso a estos 2 candidatos, su atento y comedido lugarteniente congresista Miguel Torres Morales, hijo de un antiguo fujimorista, ultramontano, Carlos Torres y Torres Lara, ya fallecido; pero que dejó a su heredero universal en el Congreso y precisamente al lado o detrás de Keiko. ¡Su padre estuvo detrás de don Alberto, hoy preso!\\nSi esta proposición fraudulenta, silenciosa y nada transparente fue suficiente para que 72 votaran por ella, significa que Keiko Fujimori ¡maneja a su antojo a los 72 congresistas de su partido Fuerza Popular, ora directamente o por interpósita persona, como lo hacía antes Vladimiro Montesinos Torres (hoy también preso), en los años 90!\\nAdemás, la proposición y decisión adoptada viola el texto expreso del Artículo 11° de la Ley Orgánica del Banco Central de Reserva del Perú.\\nINCONSTITUCIONAL, ILEGALIDAD, DELITO y PRODUCTO ILEGÍTIMO\\nLa conducta es la pluralidad de actos realizados que exteriorizan una voluntad; y el producto es el resultado conseguido con esa conducta.\\nLos congresistas, mayormente fujimoristas, que designaron a José Chlimper, Rafael Rey y Elmer Cuba, para integrar el directorio del Banco Central de Reserva del Perú (BCRP), violaron la Constitución Política, las leyes Orgánica de dicho Banco, de Transparencia y el Reglamento del Congreso de la República, en la forma antes anotada.\\nCuando tales parlamentarios producen actos administrativos, como es designar miembros del directorio del BCRP, o integrantes de otros organismos, están obligados a respetar las normas constitucionales y las legales de todo tipo y no zurrarse en ellas sin incurrir en responsabilidad. Su designio es respetar las normas preexistentes.\\nLa Ley Orgánica del Banco Central de Reserva del Perú, en su artículo 11°, obliga que se designe como miembros del directorio del Banco a quienes tienen \"reconocida solvencia moral\" y además \"amplia competencia y experiencia en economía y finanzas\", requisitos que son hechos macizos, que deben ser reales y acreditados con los documentos respectivos. El congresista que vota por alguien propuesto no puede crear estos hechos en su cabeza, deducirlos de meros dichos o inferirlos por consigna partidaria. Viola la ley si desoye este mandato legal; comete, pues, una ilegalidad, una arbitrariedad.\\nDel mismo modo, todo parlamentario debe \"velar por el respeto de la Constitución y de las leyes\", porque así lo establece el Artículo 102°, inciso 2, de la Constitución Política. Hasta podríamos aseverar que deben dar el ejemplo en acatar la Constitución y lo que dispone toda norma legal. Este precepto constitucional fue desacatado por todos aquellos congresistas que designaron con su voto a Chlimper, Rey y Cuba, como miembros del BCRP, sin que estén acreditadas las situaciones de hecho que la citada Ley Orgánica ha previsto. Violaron, por ende, esa norma constitucional que les obliga a respetar las leyes en general y la del BCRP en particular. ¡Produjeron una infracción constitucional!\\nEsta acción judicial (proceso de amparo) debe anular el ilegal acto administrativo que surgió sobre la base de dicha ilegalidad e inconstitucionalidad y el quehacer delictivo fraudulento antes reseñado y hacer efectiva la responsabilidad de los infractores si no está cubierta por la inviolabilidad de votos y opiniones.\\nEl delito de fraude procesal que se ha cometido está previsto en el Artículo 416° del Código Penal, que sanciona el uso de cualquier medio fraudulento para obtener resolución contraria a la ley. En efecto, se violó el Artículo 11° de la Ley Orgánica del Banco Central de Reserva, sin que se conozcan si los propuestos por Keiko reunían los requisitos exigidos.\\nMEDIOS PROBATORIOS\\nOfrezco como medio de prueba puntual, lo siguiente:\\na.- Copia de la Resolución Legislativa N° 008-2016-2017-CR; b.- Copia de la nota periodística de Perú 21, del 2 de noviembre del 2016. c.- 3 copias de la relación de congresistas demandados que votaron aquel 27-10-2016.\\nANEXOS\\na.- Copia del DNI del demandante, Anexo 1; b.- Copia de la Resolución Legislativa, Anexo 2; c.- Copia del periódico Perú 21 del 2-11-2016, Anexo 3; d.- 3 copias de la relación de los congresistas demandados y que votaron aquel 27-10-2016.\\nPOR TANTO:\\nSolicito, a vuestro juzgado constitucional, admitir la presente Demanda de Amparo contra Luz Salgado Rubianes, Presidenta del Congreso, Keiko Sofía Fujimori Higuchi y otros más, tramitarla conforme a ley y declararla FUNDADA, en su oportunidad.\\nOTROSÍ DIGO.- Pido al juzgado que se sirva requerir oficialmente la relación de los congresistas que votaron por la elección de los señores José Chlimper Ackerman, Rafael Rey Rey y Elmer Rafael Cuba Bustinza, a quienes también los estoy demandando y el juzgado los considerará como tales, al haber cumplido sumisamente con el sentido de la proposición fraudulenta que les formuló su codemandada Keiko Sofía Fujimori Higuchi.\\nLo hago de este modo ya que en la web del Congreso no aparece esta relación de los congresistas que votaron del modo cuestionado. Ni siquiera es posible agenciarse del acta de la indicada sesión del Pleno de aquel aciago 27-10-2016. Aunque unos colaboradores me han proporcionado el documento respectivo que acompaño.\\nLima, 04 de noviembre del 2016.\\nTomado de http://senaldealerta.pe/noticias/%C...'"}, "time": 1742561655.7274318}