{"duration": 0.08280420303344727, "input_args": {"text": "'This post was originally published on this site \\nST. PETERSBURG, November 8. /TASS/. Russian researchers plan to resume drilling works at the world’s deepest well of about four kilometers which leads to Lake Vostok, the biggest subglacial lake in Antarctica, chief of the Russian Antarctic expedition Valery Lukin told TASS on Monday. \\n“We plan to resume drilling works at Lake Vostok, despite the fact that funding of the entire program of the expedition has remained at the last year’s level, or slightly more than one billion rubles ($15.67 million),” he said, adding that last year saw a break in the works at Lake Vostok as the most money consuming in the entire expedition’s program. \\nAccording to Lukin, the plan for this Antarctic summer season is to expand the well’s lower section to prevent water rise in the well during the next, third, drilling attempt to reach the lake’s water, like it happened during the first two attempts. \\nIt is not yet decided whether the third attempt to reach the lake’s water will be made this year. “Most likely, we will not have enough time for that during this season but still there is a chance for that,” he said. \\nResearchers plan to arrive at the Vostok station located near the subglacial lake on December 6 and finish their mission in early February. \\nThis year, the Russian Antarctic expedition will use three ships to get to the destination. Thus, the Akademik Fedorov is scheduled to sail off on November 12, the Akademik Tereshnikov — on November 19, and the Akademik Karpinsky — in late November. The seasonal expedition, according to Lukin, will include 120 specialists. As many as 110 polar explorers will spend the next winter at five round-the-year Antarctic stations. \\nLake Vostok, measuring 250 by 50 kilometers, was discovered by the 33rd Russian Antarctic Expedition in 1987. It lies beneath some four kilometers of ice. Drilling was launched in 1989. In February 2012, researchers reached the watershed and took the first samples of water, which were found to contain traces of living organisms, hitherto unknown cold-resistant bacteria. However there was no 100% guarantee that these bacteria had originated from the subglacial lake, since water samples were polluted with priming water from the well. Months later, however, the water in the lake rose and froze at the level of 363 meters. The explorers had to drill a new well parallel to the old one from the depth of 3,406 meters. \\n{{item.group_date}} '"}, "time": 1742628383.586251}