{"duration": 0.05072212219238281, "input_args": {"text": "'Germany Clamping Down on Offshore Tax Havens November 03, 2016 Germany Clamping Down on Offshore Tax Havens \\nGerman Finance Minister Wolfgang Schaeuble wants to force Germans to disclose their dealings with offshore firms in tax havens and make banks liable for lost tax income if they conceal their clients\\' business with such firms, a draft law shows. Tax havens were thrown into the limelight in April when a huge leak of documents from the Panama-based law firm Mossack Fonseca showed how offshore firms are used to stash the wealth of the rich and powerful. Germany made closer international cooperation on tax evasion a priority during its presidency of the G7 economic powers in 2014/15 and in April Schaeuble announced a 10-point plan to combat tax havens. The German draft law seen by Reuters says that Germans will in future need to report to tax authorities any indirect or direct stake of at least 10 percent that they have in firms abroad. Citizens will also need to report relations with firms outside the European Union or the European Free Trade Association (EFTA) if they control them. That would prevent offshore firms from being secretly founded. \\nThose who do not disclose their foreign firms to the tax authorities might find that the start of the statute of limitations is blocked for 10 years, the draft law says. \\nUnder the draft law, taxes that are evaded could, in some cases, still be collected even 20 years later and violating an obligation to be transparent could lead to a fine of 25,000 euros ($27,675.00). \\nBanks would need to report relationships with foreign firms that they organize for clients if their share in an offshore firm reaches 30 percent. Otherwise the bank could face a fine of 50,000 euros. The bank would then also responsible for the lost tax income. \\nThe German banking industry committee said the draft law overshot the mark and effectively put all firms outside of the EU and EFTA under general suspicion. \"The bureaucratic burden bears no relation to the benefit achieved,\" it said in a statement. \\nSchaeuble wants to get rid of a paragraph in the fiscal code that is key to banking secrecy because it prevents auditors who accidentally stumble upon a list of possible offshore firms owned by bank customers from passing this information to tax authorities. \\nBut the draft law would not affect banking secrecy granted by civil law, which prevents banks from giving information to third parties such as other companies. \\nThe draft law says tax offices would in future be able to direct collective requests for information to banks, effectively meaning bank customers with offshore accounts can no longer hide behind their banks. \\nThe draft law would also put tax evasion in the list of very serious tax crimes so a longer statute of limitations of 10 years would apply. \\nIt needs to be approved by the Bundestag lower house of parliament and the Bundesrat upper house. The latter is likely to give the green light because Germany\\'s federal states, which are represented in that house, have already come up with some of their own proposals for how to deal with offshore firms. Article by Doc Burkhart , Vice-President, General Manager and co-host of TRUNEWS with Rick Wiles Got a news tip? Email us at Help support the ministry of TRUNEWS with your one-time or monthly gift of financial support. DONATE NOW ! DOWNLOAD THE TRUNEWS MOBILE APP! CLICK HERE! Donate Today! Support TRUNEWS to help build a global news network that provides a credible source for world news \\nWe believe Christians need and deserve their own global news network to keep the worldwide Church informed, and to offer Christians a positive alternative to the anti-Christian bigotry of the mainstream news media Top Stories'"}, "time": 1742562246.7812276}