{"duration": 0.027205467224121094, "input_args": {"text": "'Viswajith | November 16, 2016 | Trending | 4.7k SHARES \\nThis is how international media responded to india’s currency ban which shows the impact of this historic decision over world economy and how it is going to stop corruption and black money in india! IMF, European Union, World Bank and every reputed international organisations supported this move, World bank president even said, I am a big fan of Modi! \\nForbes: Five days after the decision, Forbes has published an article titled “India’s Great Bank Note Switch Appears To Be Working – $30 Billion In Rs Deposited In Banks.” The article notes that a move of this magnitude would result in “obvious chaos”, but points that “so far at least it looks as if it is working.” The article goes on to call the scheme “rather well done, a clever plan.” \\nNew York Times: A New York Times quoted an expert saying it was a wise move. “The plan, top secret until Mr. Modi’s announcement, was hailed by financial analysts as bold and potentially transformational for India. It is also a high-stakes experiment,” the article said. \\nWashington Post: It called PM Narendra Modi’s initiative as ‘ambitious’ and in keeping with his election time vow to initiate a crackdown against black money. The Post said black money in India ‘is estimated to total from $400 billion to more than $1 trillion’. \\nThe Independent: This Singapore-based paper published a glowing article on the move titled “Modi does a Lee Kuan Yew to stamp out corruption in India.” Lee Kuan Yew was the Singaporean Prime Minister for several decades and is considered the architect of modern Singapore. “Government leaders feel that the sudden move by the Indian Prime Minister has brought new respect for him. \\nBloomberg: In an article published in leading American financial journal Bloomberg, Swiss global financial services company UBS Group AG said that Australia should follow India’s lead and scrap its biggest bank notes. \\n“Removing large denomination notes in Australia would be good for the economy and good for the banks,” UBS analysts led by Jonathan Mott said in a note to clients on Monday. Benefits would include reduced crime and welfare fraud, increased tax revenue and a “spike” in bank deposits. \\nA senior Indian government official even equated Mr Modi to Singapore’s first Prime Minister Lee Kuan Yew. From making up his mind to rolling it out on 8 Nov, a new Lee Kuan Yew is born in India. It will be reflected in the legacy of this Prime Minister,”. \\nOUR HUMBLE REQUEST TO READERS- PLEASE SHARE THIS NEWS WITH OUR COUNTRY MEN, LET PEOPLE KNOW THE REALITY AND HOW WORLD SEES THIS DECISION! 4.7k '"}, "time": 1742628443.1733308}