{"duration": 0.12402582168579102, "input_args": {"text": "'\\nThere’s more than one way for the establishment to yield power from this election.\\nThe first path is obvious, direct and potentially deadly. A Hillary presidency will be surrounded by bitter people, and overt uses of power, along with war, increased taxes and thinly-veiled pay-for-play politics benefiting the billionaires who’ve bankrolled her rise to power.\\nThe other path is less predictable, but possible just the perfect “magic formula” they need to get things flowing again.\\nThe Brexit vote, a by-product of populist anger against economic stagnation and political angst, was secretly a win for those who wield power from the financial sector.\\nIn the end, the disquiet of the people has proven to be the secret ingredient to stirring something up in an economy otherwise stymied by quantitative easing and dismal economic returns.\\nAs Zero Hedge explains , it just may be, particularly in light of some of the statements that have been made by significant figures on Wall Street:\\nSo yes, inflation is possible, it just can’t coexist with political stability, which may explain why – according to some more conspiratorial elements – a “surprising” Trump victory on Tuesday may be assured : after all, what better way to unleash political instability than to inaugurate the candidate who promises a full break with the establishment as we know it. If in the process, it leads to a surge in much needed inflation, now that QE has tried and failed, it’s a price the establishment, reeling under the weight of record global debt, is willing to pay.\\nOne River Asset Management’s Eric Peters laying out his inflationary “revelation”:\\n“British spenders have entirely looked through post-Brexit uncertainty,” said Mark Carney [governor of the Bank of England]. … So the Bank of England forecast its biggest inflation overshoot since 1997; expecting 2018 price gains to peak at +2.8%.\\nWhat’s it tell us?\\nA populist uprising, compromised free trade, immigration restrictions, a 15% currency devaluation, 0.50% interest rates combined with aggressive QE is today’s magic formula for modestly exceeding a 2% inflation target 2yrs hence. \\n[…]we live in the 2010s, and inflationary expectations have succumbed to decades of independent central banking. Economic volatility is remarkably muted too. With it has come a long period of political stability. […] And we also know that a long period of political stability is drawing to a close. \\nBut we can’t be sure that political volatility will increase inflation volatility. Nor can we be sure that it won’t. It all depends on time and place. And today’s time and place is something new.\\nIs this proof that the elite are secretly planning to make lemonade from the lemons of American discontent and the wild card candidacy of Donald Trump?\\nThat is a difficult call to make, but it is worth noting that there is clearly an advantage to be held if this outcome does occur.\\nAs Tumelar notes, the fix is in either way:\\nIt’s either inflation by Trump’s victory or by WW3 started by Hillary Clinton. \\nA hard choice for the banksters. \\nOf course, the situation is much more complicated than just inflation, or any one factor. There is a great deal of speculation that the end of QE, known to be no longer effective at stimulating the economy has made a stock market collapse inevitable, subject to the Fed raises rates.\\nIt appears that Yellen has been waiting for the outcome of the election, and one way or another, will dump the next crisis on the next president. If that proves to be Trump, he will be blamed for the downfall… meanwhile, there will be those waiting in the shadows to profit from disaster.\\nFor his part, astute columnist Brandon Smith has consistently argued that the elite have chosen Trump and will allow him to take the presidency – only to use the unpredictability as a catalyst for order out of chaos, and the institution of great political and economic controls over the country:\\nThe vast majority of analysts in the mainstream and in the alternative media refused to acknowledge the possibility that a successful Brexit actually works in FAVOR of the globalists, because it provides them a perfect scapegoat for a financial crisis that has been broiling for years and is now ready to burst into flames.\\n[…]\\nI argue that the globalists want Trump in office, just as they wanted the passage of the Brexit. I argue that they need conservative movements to feel as though we have won, so that they can pull the rug out from under us in the near future. I argue that we are being set up. \\nAgain, the elites are openly telling us what is about to happen. They are telling us that if “populists” (conservatives) gain political power, the system will effectively collapse. To what extent is hard to say, but let’s assume that the situation will be ugly enough to influence the masses to reconsider the ideal of globalism as a possible solution. The elites are fond of the Hegelian dialectic and the philosophy of “order out of chaos,” after all.\\nAgain, the reasons parallel the reasons that Brexit was able to succeed in spite of fierce establishment opposition.\\nThe master manipulators are adaptive to any market conditions, and their influence runs deeper than the electorate of any given political season. Its agents and officers instruct the candidates and make demands, not the other way around.\\nIn a puppeteer’s world, must we always argue for the existence of puppets on every stage?\\nRead more: \\n“Trump Will Be ALLOWED To Win,” Only to Be Blamed For The Coming Financial Crash \\nThe Bubble Will Burst, But Fed Is Waiting For Politics “With Trump Lurking Around” \\nTrump Accuses Fed of Not Raising Rates Because Obama “Doesn’t Want a Bubble Burst” Until He Leaves \\nRon Paul: Unless the Fed is Stopped, America Will “Soon Experience Major Economic Crisis” \\n“Fed Risks Triggering Panic and Turmoil”: World Bank Warns Against Raising Rates \\n'"}, "time": 1742564498.5675807}