{"duration": 0.10040807723999023, "input_args": {"text": "'This presidential election is both historical and erratic leaving Americans to wonder if they are safe going to the polls. During a recent rally appearance, Donald Trump was rushed off stage fearing that a protestor was a threat. The fear of violence is understandable in lieu of the passion displayed from both sides throughout the campaign. Several states have sought increased law enforcement patrols near voting locations as they prepare to host thousands of voting hopefuls.\\nRecently, U.S. intelligence sources warned that Al-Qaeda might be preparing for potential terrorist attacks in states such as Virginia, Texas, and New York due to the Islamic State’s (ISIS) alleged call for the “slaughter” of U.S. voters on Election Day. The threat was accompanied by demands for Muslims not participate in the democratic process. A seven-page manifesto titled, “The Murtadd Vote,” from the organized militant group read:\\nMay Allah make this year’s U.S. presidential election a dreadful calamity like no other to have struck America throughout its pathetic history.\\nMurtadd is a renouncer who turned his back on Islam. The essay uses lengthy religious arguments in an attempt to justify the alleged attacks. Reportedly, the credibility of the threat has not been established; however, U.S. authorities are taking the threats seriously. Authorities are reviewing information about the potential interest by al-Qaeda to conduct attacks in the U.S. Supposedly, beyond the general locations, there was no specific information on the possible form or targets of attacks. In light of these threats, should Americans feel safe going to the polls? In a countering statement, the FBI said:\\nThe counterterrorism and homeland security communities remain vigilant and well-postured to defend against attacks here in the United States.\\nThe accuracy of the vote and safety of polling locations continues to be a focus of this political cycle. Despite the claims that some locations are beefing up security, some say they will follow the normal protocol already in place. Turnout is expected to be very high and “things” are being done to make sure voters and poll workers are safe. Amid the most contentious presidential election cycle in modern U.S. history, it appears that fears continue to revolve around the potential for violence at the polls. \\nMany voters remain baffled that the country has come to this point with the two primary candidates. Will they vote for the non-politician whose controversial actions have led to many leaders within his own party to refuse their support of him? Or will they opt for the Democratic insider who bears the weight of Benghazi and has battled a potential indictment over a huge email scandal? This is a massively disappointing circumstance and a definite concern for many Americans and onlookers around the world.\\nThe dislike of both candidates coupled with new threats surrounding the polls have voters questioning their safety. Many first-time voters struggle with the unusual nature of this election season. When questioned, although some were still undecided, they definitely planned to submit their ballot. One first year voter said:\\nTo not vote at all is a waste. It is a waste of the right to be a part of our democracy, and it is tantamount to saying you would rather hide and deal with the consequences of others’ decisions than to be actively involved yourself.\\nAre Americans safe going to the polls? With ongoing concerns about the safety of voters due to the heated election season, some polling places are taking extra measures to ensure safety while voting. There is always some concern about what could occur at a polling location, however, with this election, everyone is expecting record turnout with voters . Several states will respond to the fear of intimidation and alleged threats by increasing security and initiating an “all hands on deck” mentality. It is the hope of officials, that this will not hinder the voting process. Remember polls open at 7 a.m. and close at 8 p.m tomorrow.\\nBy Cherese Jackson (Virginia) \\nSources:\\nZero Hedge : ISIS Calls For “Slaughter Of Americans” On Election Day\\nNBC Universal: Are San Diego’s Polling Places Safe?\\n21 Harrisburg: Safety and security top priority at the polls\\nPhoto Credits:\\nTop Image Courtesy of Stephen Venkman – Flickr License\\nInline Image Courtesy of BU Interactive News – Flickr License\\nFeatured Image Courtesy of Maryland GovPics – Flickr License    isis , spot , Terrorism , vote , Voting'"}, "time": 1742561791.896263}