{"duration": 0.05106544494628906, "input_args": {"text": "'Pop star Katy Perry  —   one of Hillary Clinton’s top celebrity endorsers during the 2016 presidential campaign  —   says Donald Trump’s victory brought back painful childhood trauma. [“I was really disheartened for a while it just brought up a lot of trauma for me,” the    “Chained to the Rhythm” singer said in a cover story interview for this month’s Vogue magazine. “Misogyny and sexism were in my childhood: I have an issue with suppressive males and not being seen as equal. ”  “I felt like a little kid again being faced with a scary, controlling guy,” Perry added. “I wouldn’t really stand for it in my work life, because I have had so much of that in my personal life. ” Months after the election, Perry has established herself as a vocal member of the   “Resistance” movement. A month after Trump’s inauguration, Perry performed at the 2017 Brit Awards alongside giant skeletons meant to skewer Trump and U. K. Prime Minister Theresa May. Just ten days prior, Perry performed at the 2017 Grammy Awards while wearing an armband that read “PERSIST,” along with a Planned Parenthood button. The singer’s “purposeful” pop has introduced what the singer hopes will be a new era of political activism, a time that has coincided with an “awakening” of young people she says are now more politically engaged than ever before. “It’s an awakening that was necessary because I think we were in a false utopia, we can’t ever get that stagnant again,” Perry explained. “I am so grateful that young people know the names of senators. I think teenage girls are going to save the world! That age group just seems to be holding people accountable. They have a really strong voice  —   and a loud one. ” Just this week, Perry posted a picture of Clinton sporting a pair of pumps, called The Hillary, that the singer says were inspired by the former secretary of state. ⚡️POWER PUMP⚡️your way over to https:  .  for the last few hours of the spring 25% sale❗@HillaryClinton is wearing #TheHillary pic. twitter.   —   Katy Perry (@katyperry) April 11, 2017,  The $139 pumps, now for sale on Perry’s website, include a clear heel embedded with golden moon and stars meant to inspire those who wear them to “step in and reach for the stars. ”   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742564058.1296394}