{"duration": 0.22513318061828613, "input_args": {"text": "'By Catherine J. Frompovich\\nOne of the academic professionals in my vast network includes Anne Steinemann, Professor of Civil Engineering, Chair of Sustainable Cities, Melbourne School of Engineering, The University of Melbourne, Australia, who just published the research paper, “ Fragranced consumer products: exposures and effects from emissions ,” October 7, 2016. Dr Steinemann was kind enough to email a copy of her exciting work, which I’d like to bring to consumers’ attention since gas out fumes from fragranced products definitely have negative impacts upon human health.\\nBack in the 1970s, I tried bringing attention to gas out from formaldehyde fumes that were saturating everything from carpeting to fabric stores, with fragrances in almost anything from toilet tissue to you name it—scented candles being the most offensive. How employees worked in those stores that took away one’s breath, was totally incomprehensible to me. Didn’t they know those fumes were not friendly to their nasal sinuses, throat, bronchi and lungs?\\nProfessor Steinemann’s article needs to be studied seriously, especially by parents with young children who are more prone to developing respiratory problems and allergies. Probably two of the more offensive gas-off consumer products are cologne and perfume, which women over-use plus men’s after shave. Both affect young children who are carried close to their parents’ bodies and must breathe in those irritating fumes. Please consider that those scents can cause respiratory problems for baby.\\nThe above article Abstract states,\\nResults from this study provide strong evidence that fragranced products can trigger adverse health effects in the general population. The study also indicates that reducing exposure to fragranced products, such as through fragrance-free policies, can provide cost-effective and relatively simple ways to reduce risks and improve air quality and health.\\nFurthermore, I’d like to call readers’ attention to the statistics cited regarding HEALTH EFFECTS. Here’s what Professor Steinemann’s research confirmed:\\nOverall, 34.7 % of the population reported one or more types of adverse health effects from exposure to one or more types of fragranced products. The most common types of adverse effects were as follows: 18.6 % respiratory problems; 16.2 % mucosal symptoms; 15.7 % migraine headaches; 10.6 % skin problems; 8.0%asthma attacks; 7.2%neurological problems; 5.8 % cognitive problems; 5.5 % gastrointestinal problems; 4.4 % cardiovascular problems; 4.0 % immune system problems; 3.8 % musculoskeletal problems; and 1.7 % other.\\nPersonally, I think the above stats could meet the ‘criteria’ for those affected and who experience what’s called “Multiple Chemical Sensitivities” (MCS), a condition exacerbated by environmental pollutants, e.g., smog, chemtrails, odors, chemical gas out fumes, and fragrances, relieved only by total avoidance and undertaking a supervised detoxification program, in my opinion.\\nBecause of the “super-saturation aggregate” of chemicals in air, food, water and environment, the human immune system is being compromised constantly, whether we know it or not. Therefore, it ought to be incumbent upon everyone, I think, to avoid any chemical gas out fumes like scented candles, dryer sheets, cleaning products, automobile and room air fresheners, scented personal beauty products, e.g., soaps, lotions, perfumes, after shave, hair sprays, etc. Let’s not ignore “flame retardants.”\\nIn my opinion, one of the most irritating scents is found in room air freshener products, which are caustic to mucous membranes of the nose, mouth, throat and bronchi. Many public restrooms gas out deodorizing chemicals toxic fumes, which ought to be outlawed, in my opinion, as people are forced to breathe them in order to use public restrooms. Complain to managers in stores, theaters and other public places when you encounter such chemical assaults on your lungs.\\nLaundry products leave scents in bed linens that infants, toddlers and adults must sleep on seven or more hours a day, which is not conducive to a healthy respiratory system and weakens the immune system, in my opinion. Toxic chemical fume exposure is a stress on the body! Have pity on your poor liver, the main detoxifying organ in the body, and give it a chance to recoup as much as possible. Wearing perfumes and breathing in room air fresheners are constant chemical stresses to the body.\\nHowever, one of the most egregious out gassing of toxic scents is found in all new clothing. The odor smells like perfume, but contains many chemicals to keep the fabric ‘sized’. I can smell someone wearing new clothing several feet away from me. If I can smell it, I question whether it’s harming the person wearing it, as most people don’t realize what’s going on with new clothing. I heartily suggest laundering every new piece of clothing before wearing it or putting it on a baby or toddler—especially! If there’s something that can’t be laundered, place it in a clothes dryer on a high heat setting for as long as it takes to ‘cook off’ the fumes. I discuss a lot about chemical reactions in my 2009 book, Our Chemical Lives And The Hijacking Of Our DNA, A Probe Into What’s Probably Making Us Sick. \\nPersonally, I don’t buy anything that cannot be laundered before wearing! Sometimes I ‘cook’ new clothing in my dryer for several hours before it’s gassed out. Wetting two clean wash clothes that are wrung out as dry as possible and placed into the dryer with new clothing, I found, helps the gas out go faster and reduces dryer time.\\nWould you like to know what some of those sizing chemicals are? According to our friends at Organic Consumers Association,\\nChemicals often used for finishing include formaldehyde , caustic soda, sulfuric acid, bromines, urea resins, sulfonamides, halogens, and bromines. Some imported clothes are now impregnated with long-lasting disinfectants which are very hard to remove, and whose smell gives them away. [1]\\nProfessor Steinemann found that\\nFragranced product manufacturers are not required to disclose all ingredients in their formulations. This lack of disclosure can impede efforts to understand and reduce adverse effects associated with potentially harmful compounds, such as certain volatile organic compounds and semi-volatile organic compounds. Further, we lack knowledge on which specific chemicals or mixtures of chemicals are associated with the adverse effects, and this is an important area for research.\\nIn my opinion, there ought to be a law prohibiting any non-disclosure policies of all i ngredients used in business and industry manufacturing! Where are FDA, EPA and OSHA regulations regarding those loopholes in manufacturing and merchandising? I mention OSHA (Occupational Safety and Health Administration) because the workplace can be very problematic for many reasons: chemical gas out fumes from carpeting and other construction materials; perfumes, which can be compared to tobacco smoking fumes; and unrealized particulates given off from heat production by electronic equipment—often the source of eye irritation, I think. Indoor air pollution can originate from many sources.\\nThanks, Professor Steinemann, for your timely and exceptional study.\\nFragranced consumer products: exposures and effects from emissions \\nOpen Access This article is distributed under the terms of the Creative Commons Attribution 4.0 International License ( http:/ /creativecommons.org/licenses/by/4.0/ ), which permits unrestricted use, distribution, and reproduction in any medium, provided you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons license, and indicate if changes were made.\\nMedia Release \\nhttp://link.springer.com/article/10.1007/s11869-016-0442-z \\nReference: \\n[1] https://www.organicconsumers.org/news/do-you-know-what-toxic-chemicals-lurk-your-clothing \\nCatherine J Frompovich ( website ) is a retired natural nutritionist who earned advanced degrees in Nutrition and Holistic Health Sciences, Certification in Orthomolecular Theory and Practice plus Paralegal Studies. Her work has been published in national and airline magazines since the early 1980s. Catherine authored numerous books on health issues along with co-authoring papers and monographs with physicians, nurses, and holistic healthcare professionals. She has been a consumer healthcare researcher 35 years and counting. \\nCatherine’s latest book, published October 4, 2013, is Vaccination Voodoo, What YOU Don’t Know About Vaccines , available on Amazon.com. \\nHer 2012 book A Cancer Answer, Holistic BREAST Cancer Management, A Guide to Effective & Non-Toxic Treatments , is available on Amazon.com and as a Kindle eBook. \\nTwo of Catherine’s more recent books on Amazon.com are Our Chemical Lives And The Hijacking Of Our DNA, A Probe Into What’s Probably Making Us Sick (2009) and Lord, How Can I Make It Through Grieving My Loss, An Inspirational Guide Through the Grieving Process (2008) \\nCatherine’s NEW book: Eat To Beat Disease, Foods Medicinal Qualities ©2016 Catherine J Frompovich is now available\\n\\nImage Credit \\nSource: Activist Post \\n'"}, "time": 1742562596.1847281}