{"duration": 0.17188262939453125, "input_args": {"text": "'While Ellen Milz and her family were watching the Olympics last summer, their TV was watching them. Ms. Milz, 48, who lives with her husband and three children in Chicago, had agreed to be a panelist for a company called TVision Insights, which monitored her viewing habits  —   and whether her eyes flicked down to her phone during the commercials, whether she was smiling or frowning  —   through a device on top of her TV. “The marketing company said, ‘We’re going to ask you to put this device in your home, connect it to your TV and they’re going to watch you for the Olympics to see how you like it, what sports, your expression, who’s around,’” she said. “And I said, ‘Whatever, I have nothing to hide. ’” Ms. Milz acknowledged that she had initially found the idea odd, but that those qualms had quickly faded. “It’s out of sight, out of mind,” she said, comparing it to the Nest security cameras in her home. She said she had initially received $60 for participating and an additional $230 after four to six months. TVision  —   which has worked with the Weather Channel, NBC and the Disney ABC Television Group  —   is one of several companies that have entered living rooms in recent years, emerging with new, granular ways for marketers to understand how people are watching television and, in particular, commercials. The appeal of this information has soared as Americans rapidly change their viewing habits, streaming an increasing number of shows weeks or months after they first air, on devices as varied as smartphones, laptops and Roku boxes, not to mention TVs. Through the installation of a Microsoft Kinect device, normally used for Xbox video games, on top of participants’ TVs, TVision tracks the movement of people’s eyes in relation to the television. The device’s sensors can record minute shifts for all the people in the room. The company then matches those viewing patterns to shows and commercials using technology that listens to what is being broadcast on the TV. “The big thing for TV advertisers and the networks is: Are you actually looking at the screen or not?” said Dan Schiffman, the chief revenue officer of TVision (pronounced  ). “What you looked at is interesting, but the fact that you looked away is arguably the most interesting. ” Mr. Schiffman founded TVision, a     with a classmate from the Sloan School of Management at M. I. T. Companies spend around $69 billion a year on TV ads in the United States and are keen to find out how to best distribute that money in a fractured media landscape. Nielsen and its panel of 42, 500 households have long determined how money is spent on TV advertising in the United States. The higher a show’s ratings, the more networks can charge for advertising. But some industry executives have criticized Nielsen’s methods as outdated. Nielsen selects homes at random to represent the nation’s viewing audience, and measures who is watching what shows, mostly through meters connected to the sets, as well as diaries in select markets and digital tracking of certain   programs on tablets and phones. The company recently delayed the rollout of a new system that will count viewing across platforms and devices. The capability to do just that is a core selling point for upstarts like TVision, which promote their ability to measure how people are   shows on, say, Netflix and Amazon. “Nielsen will remain the currency for the time being because it is agreed upon as the thing everyone uses,” said Alan Wurtzel, an adviser at NBCUniversal and its former head of research. “But as the world becomes more complex, as it is, many more additional supplemental or complementary measures will come into play. ” Information gathered by companies like TVision can help advertisers steer marketing toward shows with the most engaged audiences, not just the largest ones. And for networks, it could make a show with a committed and loyal audience as valuable as one that attracts a larger but more casual set of viewers. TVision has recruited 2, 000 households, or roughly 7, 500 people, in the Boston, Chicago and   Worth areas. The company said the information was transmitted without storing images or video and collected anonymously. Mr. Schiffman said the data would show, for example, “Person No. 124 in Household 6 was paying attention this second and not paying attention the next to a certain program or advertisement. ” Symphony Advanced Media has built a panel of 17, 500 people in the United States who have installed its Media Insiders mobile app, mostly on Android phones. In exchange for about $5 to $12 a month, the app passively tracks how people use their phones, uses the device’s microphone to hear what they are watching and asks them to complete surveys. The app can tell if someone streamed a show using headphones while on a bus or saw a commercial at a sports bar. Symphony and TVision both use technology that can recognize shows and ads through the audio or digital tags the content contains. Consumers are most likely familiar with this type of technology through the   app Shazam. Another ratings company, RealityMine, has assembled a panel of 5, 000 people in the United States whom it said it paid less than $90 a year, who either have its app, a “home meter” plugged into their internet networks or both. In some instances, its meter may capture activity across 25 devices in a household, such as tablet, phone, Xbox, Wii, Apple TV and Google Chromecast. The aim is “understanding what is the media day and the life of the consumer today,” said Charlie Buchwalter, the chief executive of Symphony, which has worked with companies including NBCUniversal. Mr. Schiffman said that while some people were wary of TVision’s technology, they were often placated after learning that it was not storing images or videos. During the Olympics, Ms. Milz wore a Fitbit so that NBC could see how her heart rate changed while she watched certain events. “We’re just trying to understand where people really are and what they’re doing, what they’re watching, how are they interacting, and ideally after that, how is that changing their behavior or affecting their behavior,” said Jonathan Steuer, the chief research officer of Omnicom Media Group, which oversees media buying for advertisers. Still, privacy can be a concern. This month, Vizio, one of the biggest makers of   televisions, said it would pay $2. 2 million to settle charges that it had been collecting and selling viewing data from millions of smart TVs without the knowledge or consent of the sets’ owners. By measuring the level of attention a person is paying to a given show, TVision believes it can help bolster niche programs and smaller networks. For example, Mr. Schiffman said the company had found that the series “Lucifer,” on Fox, commanded better attention metrics from viewers than “The Big Bang Theory,” on CBS, even though “Big Bang” is one of the TV shows rated highest by Nielsen. “People don’t just tune into ‘Lucifer.’ They DVR it and watch it when they come home,” he said, adding that viewers tend to be focused on the show and stay in the room when it is on. The Weather Channel used TVision’s data in the fall to give it an edge over the news and lifestyle shows it is normally compared against by advertisers. It showed its audience for weather news as “lean forward,   viewers,” said Indira Venkat, who oversees research at the channel. “What is oftentimes missing is the quality of the audience,” Ms. Venkat said about Nielsen viewing data. “Yes, you’re getting audience, but what are they doing in today’s era of multitasking?”'"}, "time": 1742562289.0258853}