{"duration": 0.24217987060546875, "input_args": {"text": "'By John Bart Gerald Global Research, October 26, 2016 \\nOn his return from attempting to stop the terrible slaughter of Rwandans there was no official to welcome home Canada’s General Romeo Dallaire. In his recent memoir, Waiting For First Light: My Ongoing Battle with PTSD , (1) Dallaire reveals that his return also began a pattern of suicide attempts, blamed on ptsd, perhaps survivor’s guilt, but which these years later might be traced more accurately to his reluctance to understand that the people who sent him to Rwanda did not care for humanity. \\nDallaire, a protector, continues to affirm Canada’s adherence to a code of genocide prevention, on paper, and as a Senior Fellow contributes to the Montreal Institute for Genocide and Human Rights Studies. It is the major Genocide prevention NGO in Canada, but noted for coincidences of policy with those of the U.S. State Department and Canadian foreign service. Any MIGS project concerned with the genocide of U.S. or Canadian Aboriginal peoples, or of Palestinians is hard to find. Our society’s intransigence of not caring, hardens. \\nCurrently it’s not even helpful to discuss a relationship between the U.S. and the Convention on Genocide since U.S. foreign policies lack moral compass. Having withdrawn from the Rome Statute of the International Criminal Court, the U.S. avoids charges of genocide as long as it has the military power to do so. With less military power, Canada subscribing to the Court, needs moral and political power to maintain its borders. Of necessity, diplomacy has meaning. Canada ratified the Convention on Genocide in 1952, (2) a generation before the U.S. which waited until 1988. \\nSeveral current news items lead to the same point of focus: Canada’s evasion of its responsibility to honour and adhere to the Convention on Genocide. Its unfaithfulness encourages states of emergency to play out through Indigenous communities in Canada. It’s also evident in foreign policies against more distant peoples. As though the Convention on Genocide were not primary law, had no statute of limitations, has no affect beyond the good will and salaried hopes of NGO’s, and no application to first world countries. \\nCanadian Mining Companies \\nFrom Toronto the Justice and Accountability Project has just issued a report on the responsibility of Canadian Mining companies for one level of violence in Latin America. The “Canada Brand”: Violence and Canadian Mining Companies in Latin America, (3) documents 44 deaths and 403 injuries in the years 2000 to 2015, all involving Canadian Companies in Latin America, and declares this is the tip of an iceberg. It classifies the majority of the victims as “targeted.” \\nWhile the report includes cases of criminalization it doesn’t include reports of deaths and injuries which aren’t verified by two independent sources and it doesn’t include “death threats, deliberate burning of crops and property destruction, forced displacement, reported assassination attempts without reported injury, illness from environmental contamination, or psychological trauma from any of the violence…” (4) or countries in other regions such as in Canada or Africa. This is 15 years of violence against native protectors of the land without bringing to bear the effects of the mining companies on entire communities and their habitats: to put the two together places the mining companies within a perspective of the U.N . Convention on Genocide. The murder of activist protectors suggests the element of “intention” considered by U.S. interpretation necessary to prosecution of genocide charges. \\nIn Muskrat Falls Labrador, on October 23rd, 150 protesters entered the Crown corporation Nalcor’s construction site to protest the company’s reluctance to thoroughly clear vegetation and some topsoil from the land it’s about to flood. Uncut vegetation as well as topsoil are considered factors in the increase of methylmercury poisoning of the watershed. Nalcor workers are being evacuated from the camp, turning their quarters over to the protesters. The RCMP is blocking roads to discourage reinforcement to the protesters. Pam Palmater, a respected lawyer and Mi’kmaq teaching as an Associate Professor in Toronto, sees the company’s carelessness in risking the environment to poison as part of the ongoing industrial genocide of native peoples. (5) It’s a concern which increasingly covers settlers, immigrants, as both Indigenous and ‘settler’groups are equally deprived of power under law. Mayors of four nearby towns affected by the flooding say Nalcor consistently ignores them and they’ve been excluded from the talks between the company and Indigenous groups. \\nFirst Nations \\nIn northern Saskatchewan so far in October four indigenous children – girls of from ten to fourteen years of age, took their own lives. This is part of an ongoing suicide epidemic in first Nations communities of the north where the suicide rate is five times the norm for Canada. The government is responding by increasing the number of mental health care workers available. This misses the point of the children’s final acts. As a group they’re refusing life on the terms that Canada offers. Suicide rates among northern Indigenous people are a result of social engineering by Canada’s dominant culture, either through its lack of concern or by intention. It continues the colonial genocide of subjugation. What could stop the native society’s slide into hopelessness is honouring the society’s basic needs of housing, water, food. This is not beyond the power and convenience of Canadian and Provincial governments. It seems beyond the business game plans of resource corporations and a European mindset of superiority which permeates all areas of Canadian society. \\nA recent article in the Canadian Medical Association Journal reveals that the children of Nunavut have the highest respiratory infection rates in the world, and accuses the Nunavut government of covering up respiratory disease (respiratory syncytial virus / RSV) infections, which according to statistics from 2009 (why aren’t these statistics current?) hospitalized 40% of the children in Western Nunavut. The dosage of pharmaceuticals for treatment costs about $6500 / patient. (6) And children often have to be flown to hospital. Emergency funds go to pharmaceutical companies and airlines rather than the community and improving the living conditions and poor nutrition which cause the disease rate. The cycle of poverty and relief profits big business, as maintained by government budgeting. \\nAll of these areas converge in a consideration of genocide but to mention the word “genocide” is a snare. While university courses and human rights NGOs raise the issue of genocide again and again as a thorn in the side of Canada’s self-image – the nuts and bolts of legally applying the Convention under Canadian law are so carefully controlled that the term has no meaning except in the service of a European exploitative class. \\nApplication of the U.N.’s Convention on Genocide, which has teeth within Canadian law (7) requires permission of Canada’s Minister of Justice. (8) Canada’s Minister of Justice is a political appointment by the nation’s Prime Minister. Therefore practically, it isn’t likely the Prime Minister would ever be charged with genocide, nor will his political allies, nor the visiting leaders of allied countries, which gives all of them a certain amount of freedom from worry. And under the code of one dominant ruling elite, protection is assured subsequent government administrations and Ministers of Justice, as long as a group remains to subjugate. The same provision of requiring Ministerial approval applies to the prosecution of any crimes against humanity. (9) \\nWriting about this for some years, I’ve seen no challenge to this facet of Canadian law which obviously protects the establishment’s governance from prosecution for one of the worst crimes known to humankind. My belief is that Canada could survive honest and direct application of the Convention on Genocide to its policies, but won’t be able to if it delays in correcting root causes of disproportionate Aboriginal death and disease. \\nThis loophole protecting politicians who further genocide lends impunity to the policies of NATO countries in their assaults on the peoples of Afghanistan, Libya, the former Yugoslavia, Iraq, Syria, where militarily applied policies have involved what I think was/is genocide. The U.S., British, French policies find the democratically elected country heads guilty of crimes then bomb the peoples into subservience and fealty to NATO. It is clearly genocide against a national group, again and again. \\nThe media of our NATO countries have formed a reality for our peoples which doesn’t recognize the criminality of NATO country foreign policies. In North America the governments’ impunity in oppressing First Peoples, Blacks and all the poor, while claiming to save them, provides a third rail carrying the power to knock out any resistance to the terrible crimes of foreign policy necessary to corporate resource extraction with high profits. \\nThe impunity is acceded to by a professional class where the judicial system is so expensive, the lawyers so strictly controlled, the laws so favourable to capital, that there is no effective protest of obvious injustices. Where the mental health industry accepts as norm the murder of foreign civilian populations. Where the economic machinery empowered by security and surveillance would refuse existence to those who question, protest, and struggle effectively. Where the security industry believes in the fears created to further its expansion. Where education becomes naked training of skill sets for serving oppressive corporations. Where artists and writers are rewarded for saying nothing. \\nThe situation of all young people gradually becomes near that of a Saskatchewan Indigenous girl. First Peoples precede us. If government maintains its refusal to protect Indigenous peoples with the primary human rights laws, then peoples of settler stock will, when convenient to power, find themselves without as well. We have to affirm and apply the protections of the Genocide Convention, for others, or we lose that protection for ourselves. \\nNotes \\n1. “Inside Roméo Dallaire’s brutally revealing new memoir,” Brian Bethune, Oct. 21, 2016, Maclean’s . 2. “Treaties, States Parties and Commentaries: Canada, current, International Committee of the Red Cross ICRC . 3. The “Canada Brand”: Violence and Canadian Mining Companies in Latin America , Justice and Accountability Project, Oct. 24, 2016, Osgoode Hall Law School, York University, Toronto, Ontario. 4. Ibid. 5. ”Muskrat Falls a ‘modern day form of genocide’: lawyer,” Hans Rollmann, Oct. 21, 2016, the In dependent.ca (Newfoundland & Labrador). 6. « ’Horribly sick kids :’ Arctic regions have highest infant lung infection rates in the world, » The Canadian Press, Oct. 18, 2016, CBC News ; « ’We have not seen it stop’ : Canada’s public health agency review respiratory illness in Nunavut babies, » John Van Dusen, Oct. 25, 2016, CBC News . 7. Crimes Against Humanity and War Crimes Act – S.C.2000 , c.24 (Section 4),(Section 6), (SCHEDULE : Provisions of Rome Statute), and (Section 14). 8. Crimes Against Humanity and War Crimes Act – S.C.2000 , c.24,“Procedures and Defences” 9. (3, 4). 9. The Canadian law against torture which wasn’t applied to former U.S. President Bush at his most recent visit of May 12th, 2014. The original source of this article is Global Research Copyright © John Bart Gerald , Global Research, 2016 Share:'"}, "time": 1742563106.7270908}