{"duration": 0.07369065284729004, "input_args": {"text": "\"IMPLOSION: Trump Campaign Insiders Report–‘Think Of The Bunker Before Hitler Killed Himself’ By Andrew Bradford on October 30, 2016 Subscribe \\nFor months, Donald Trump has assuring his supporters that he is going to win on November 8. This is despite nearly every poll showing him behind by as much as 12 points. And now we have an inside look at the Trump campaign which would seem to indicate that the entire campaign apparatus is on the verge of collapsing on itself. \\nNew York magazine has just published an article by Gabriel Sherman in which one Trump staffer commented: “Think of the bunker right before Hitler killed himself. Donald’s in denial. They’re all in denial.” \\nOverall, the mood of the staff working out of Trump Tower goes from gloom, denial, rage, and glee on Friday when the FBI reported it would review new materials in the investigation of Hillary Clinton’s use of a private email server while she was still Secretary of State. \\nWhile the Trump camp should be able to make hay of the announcement from FBI Director James Comey, one problem remains: The candidate is so undisciplined that any progress made is quickly undone by Trump himself. As a top donor told Sherman : “Trump has the following personality: NIH-NFW, meaning ‘If it’s not invented here, not invented behind these eyes, then it’s no fucking way.'” \\nSherman’s report echoes another article from the New York Times in which an advisor to the GOP nominee commented: “In Trumpworld as Hitler’s Bunker terms (it’s) like when Goebbels thought FDR’s death would save the Nazi regime.” \\nAnd plans for what comes after the election–rumors of a new Trump TV network–also seem unlikely some inside the inner circle reveal. One prominent member of the GOP told Sherman: “It’s too expensive. Trump won’t put his own money in.” \\nDisgraced former Fox News CEO Roger Ailes has parted ways with Trump, reportedly because the candidate refused to stay on message and follow direction from campaign staff. Others are also positioning themselves for what happens after the election is over with. One former Mitt Romney staffer says the lifeboats are out early: “It’s a window into a campaign in a downward spiral when the positioning begins, but I’ve never seen it begin this early.” \\nSo was the entire Trump campaign nothing more than ego fulfillment and an attempt to gain endless media attention for the Donald? With nine days left, that explanation seems to be the most likely reason Trump embarked on this suicide mission in the first place. \\nFeatured Image Via Gage Skidmore for Flickr available under a Creative Commons Attribution-ShareAlike 2.0 Generic License About Andrew Bradford \\nAndrew Bradford is a single father who lives in Atlanta. A member of the Christian Left, he has worked in the fields of academia, journalism, and political consulting. His passions are art, music, food, and literature. He believes in equal rights and justice for all. To see what else he likes to write about, check out his blog at Deepleftfield.info. Connect\""}, "time": 1742563137.7791684}