{"duration": 0.06392097473144531, "input_args": {"text": "'For 15 months, even as Donald J. Trump vacillated on many other issues, he stuck to a simple,   position on immigration: If elected president, he would form a “deportation force,” round up people who are in the United States illegally and send them back where they came from. Yet even that promise, so central to his appeal to conservatives, now appears open to negotiation. Mr. Trump faced anger, confusion and disgust from across the political spectrum on Thursday after indicating that he was open to letting some undocumented immigrants remain in the country legally provided that they paid “back taxes. ” The comments, made at a    event broadcast the night before on Fox News, were strikingly similar to the views of former Gov. Jeb Bush and Senator Marco Rubio of Florida, fellow Republicans whom Mr. Trump vanquished in the primaries with slashing attacks that they were soft on immigration. His newest formulation also bore a close resemblance to President Obama’s approach to an immigration overhaul, which similarly calls for paying taxes as part of a program to live legally in the United States. For Mr. Trump, the new, more tempered talk on immigration could help convince some    voters, particularly whites, that he has more compassion for Hispanics and other minorities than his harsher earlier positions would suggest. “He finally figured out that you can’t win a national election with just white voters,” said Whit Ayres, a Republican pollster who worked for Mr. Rubio’s campaign. But whatever the possible gains, Mr. Trump risks offending millions of conservatives who were drawn to his   as an unwavering opponent of illegal immigration. He vowed to build a wall on the Mexican border, called Mexicans “rapists” in his kickoff speech and said every immigrant in the country illegally would be detained and forced out. “If Trump should pivot on immigration or try to redefine amnesty, he will begin to lose support from his original core base,” warned Representative Steve King, Republican of Iowa, one of the most conservative voices on immigration in the House. In the Fox News interview, Mr. Trump appeared to suggest that he would be open to some kind of path to legal status, if not citizenship, for undocumented immigrants. “No citizenship,” Mr. Trump said. “They’ll pay back taxes. They have to pay taxes,” he added. “There’s no amnesty, but we will work with them. ” Mr. Trump said that while his supporters wanted to “get the bad ones out,” he also had heard from   voters. “They’ve said, ‘Mr. Trump, I love you, but to take a person that has been here for 15 or 20 years and throw them and the family out, it’s so tough, Mr. Trump,’” he said. Several times, Mr. Trump turned to the audience in what he told his host, Sean Hannity, was “like a poll. ” “No. 1, we’ll say throw out. No. 2, we work with them,” Mr. Trump said. Liberals who support an overhaul of the nation’s immigration laws expressed horror at the spectacle of polling the audience for responses on deportations. “It’s not a small issue. It’s 11 million people,” said Angie Kelley, the executive director of the Center for American Progress Action Fund. “He’s reducing a serious policy discussion to a   vote and cheering the loudest for your team. It’s insulting. It’s dangerous. It’s unprecedented. ” Mr. Trump has frequently dangled vague phrases suggestive of policy shifts, only to accuse the news media of having wrongly interpreted them. His remarks in the Fox News town hall were no exception: Aides insisted afterward that there had been no change in his position. On Thursday, Mr. Trump reverted to his more severe language on the subject, departing from his prepared text at a rally in New Hampshire to again promise a border wall  —   a line he has said he uses when he senses his audience losing energy. And in an interview on CNN taped Thursday, Mr. Trump, pressed to clarify his intentions, only muddled them, insisting he was not endorsing a path for immigrants to live legally in the United States unless they left the country first. Republicans, regardless of their views on immigration, seized on Mr. Trump’s newest pronouncements on the subject as evidence of worrisome confusion or worse. Mr. Bush, in a radio interview, called Mr. Trump’s shifting speech “abhorrent” and baffling. “I don’t know what to believe about a guy who doesn’t believe in things,” Mr. Bush said on WABC. Among immigration   Ann Coulter, a conservative author  —   who is promoting a new book titled “In Trump We Trust”  —   seemed almost apoplectic during Mr. Trump’s    event on Fox News. In her book, Ms. Coulter writes that the only unforgivable sin Mr. Trump could commit would be to shift on immigration. Watching on Wednesday night as Mr. Trump appeared to do just that, Ms. Coulter erupted in a series of Twitter messages: “It’s not ‘amnesty.’ It’s ‘comprehensive immigration reform’! !!! Trump: ‘they have to pay taxes, there’s no amnesty,’” she wrote in one post. A Trump spokeswoman, Katrina Pierson, insisted on CNN that Mr. Trump was merely changing the “words” he was using, not the proposals themselves. Democrats and   advocates, in fact, made the same point. “Details matter, and we have seen no actual policy shift to date,” said Todd Schulte, the president of FWD. us, an immigration overhaul group backed by the Facebook founder Mark Zuckerberg that has been sharply critical of Mr. Trump. Several Republican strategists said Mr. Trump had waited too long to try to woo nonwhite voters, if that was his aim. But Mr. Ayres, the pollster, suggested that Mr. Trump could gain ground with white Republican moderates repelled by the idea of voting for someone who is often accused of running a racist campaign  —   or, given his statements questioning the impartiality of a federal judge who is   of being a racist himself. Still, some Republicans privately questioned why, instead of shifting the discussion of immigration to economic concerns, which polls show is a dominant issue in the election, Mr. Trump has continued to draw attention to his detractors’ claims that he is a bigot. “When Democratic policies fail, they are left with only this one tired argument: ‘You’re racist. You’re racist. You’re racist,’” Mr. Trump said in his New Hampshire speech on Thursday. “They keep saying it: ‘You’re racist.’ It’s a tired, disgusting argument, and it’s so totally predictable. ” Mr. Trump has struggled to hit on a successful message on immigration for the November election, in which he will face voters far less receptive to his uncompromising proposals than those in the primary season. A poll by the Pew Research Center, conducted Aug. 9 through 16, found that while 91 percent of strong Trump supporters advocate building the wall, 61 percent of Americans are against it. Mr. Trump’s aides have said he will give a speech on immigration next week in Arizona  —   an address originally set for this week but delayed as he grappled with precisely what he would say. Mr. Trump’s suggestion that he would deport only “the bad ones” while letting   undocumented immigrants stay is quite similar to the approach announced by Mr. Obama in November 2014, when he directed the Department of Homeland Security to prioritize its immigration enforcement on violent criminals and people who have crossed the border illegally multiple times. His statement about payment of “back taxes” is also very similar to the president’s “deferred action” proposals, which would have required millions of immigrants in the country illegally to pay taxes, among other things, in exchange for legal protections. At the White House, officials who have spent years trying to find ways to overhaul the nation’s immigration system declined to be drawn into an examination of Mr. Trump’s latest comments. Josh Earnest, the White House press secretary, said Thursday that the challenge for American voters as they considered the immigration positions of the two presidential candidates “is to listen carefully to the promises, agenda and priorities, as articulated by the two candidates. ” Mr. Earnest declined to say which of Mr. Trump’s immigration positions he believed voters should consider. “That’s what makes that question more difficult than it otherwise would be,” Mr. Earnest said.'"}, "time": 1742628561.337489}