{"duration": 0.12588262557983398, "input_args": {"text": "'Karina Vetrano liked to post photos online of her night life, and spend the morning afterward unpacking her pain and passion as a writer. But running was her release. Ms. Vetrano, 30, had undergone surgery on her legs and defied doctors’ conjecture that she might never run again, a friend, Jackie Hartstein, said. “It just hurts me that this evil person took the one thing that was hers,” said Ms. Hartstein, 28, who lives in Bayside, Queens. “When she was the happiest, that’s where he took her. ” Ms. Hartstein, speaking outside a vigil on Wednesday night for Ms. Vetrano, was referring to an attacker, still at large, who the police say sexually assaulted and strangled Ms. Vetrano as she took one of her daily runs on Tuesday afternoon in the tall weeds of a nature preserve near her home in Howard Beach, Queens. The attack shocked residents of the neighborhood, which is one of New York City’s safest. The police said they had few leads but believed her killing was random. “You feel safe here, because this is a community where nothing ever happens,” said Annette Nocero, who was working at Beach Bum Tanning on Cross Bay Boulevard when she met Ms. Vetrano, a customer. She called Ms. Vetrano a sweetheart. “Not like a runaround girl, nothing like that,” Ms. Nocero said. “A good girl. ” Ms. Vetrano’s many followers on social media were treated to glamorous shots of her partying lifestyle. Many were shocked by the attack in broad daylight in a public park, an episode that seemed to hark back to a more lawless time in the city. And in a safer New York where crime has been declining for decades, even elected and police officials seemed shaken. At a news conference on Thursday at Police Headquarters in Lower Manhattan, officials announced updates on what Robert K. Boyce, the chief of detectives, described as “an extraordinary case of murder. ” The conference was held to announce more reassuring news  —   declines in citywide statistics on murder and shootings  —   but details of the killing made for a gloomy departure, as Chief Boyce spoke of a lack of suspects or substantial leads in the attack. The chief noted Ms. Vetrano was attacked “at a recreational center, in daylight hours, and that’s extraordinarily unusual,” especially because rape by strangers has decreased in the city over all. Police officials announced a $10, 000 reward. “We really need the public’s help with this one,” Mayor Bill de Blasio said at the news conference. Chief Boyce said that detectives were still examining video from security cameras nearby, and that Ms. Vetrano’s phone would be tested for DNA matches. “We plan to chop down just about every weed in that area, until we are satisfied that we got all the evidence,” he said. On Thursday, investigators continued to hack through the tall reeds in the Gateway National Recreation Area on the edge of Jamaica Bay. The expanse lies south of the Belt Parkway, just to the west of Kennedy International Airport. Nearby, Councilman Eric A. Ulrich, who represents the area, described Ms. Vetrano as “the kind of daughter any parent would want. ” She was a graduate of St. John’s University and recently earned a master’s degree in speech pathology. She worked for years at Central, a lounge in Astoria, Queens, and also at Vetro Restaurant  Wine Bar on Cross Bay Boulevard, where her friends gathered on Wednesday night. Ms. Vetrano had several thousand followers on Instagram and enjoyed posting shots of herself clubbing and traveling, whether poolside on Long Island or in France or Monaco. But her alluring lifestyle had a flip side. As a writer, Ms. Vetrano also chronicled the pain and poignancy of her life. She published on her website, Karinavee. com, a variety of introspective and   writing she called “a collection of conversations, contradictions and poetic conflicts. ” “This is my life, through my eyes, and I invite you to take a peek into my world,” she wrote. “It’s chaotic, and unpredictable, but I do believe, that on some days, it’s quite beautiful, in all its poetic little tragedies. ” Ms. Vetrano often ran with her father, Philip Vetrano, 60, a retired firefighter, through the preserve, an expanse of undeveloped wetlands known locally as the Weeds or the Baja. As a shortcut to a path popular with joggers and cyclists, they would cut through the   fire roads. But Mr. Vetrano had recently injured his back. He urged his daughter to avoid the grassy lanes kept for firefighting access, which are remote and frequented by transients, local residents said. “He got very worried, but she said, ‘Don’t worry, Dad, I’ll be right back,’” Mr. Ulrich said. Ms. Vetrano left her house near the edge of the preserve and jogged past the    homes, exchanging chatty text messages with a friend. Near 79th Street, she ran into the refuge via one of the shortcuts. Some 40 yards in, she was attacked. After several calls to her phone went unanswered, Mr. Vetrano contacted a neighbor who is an assistant chief in the Police Department. Within several hours, officers found Ms. Vetrano’s body face down near a trail, with her clothing askew and her fists still clutching the reeds she was dragged into, Mr. Ulrich said. On Thursday, even hardened homeless people nearby expressed surprise that Ms. Vetrano would jog in the area. They described it as a remote place where screams could be drowned out by planes overhead. Mohamed Yasseen, who lives under the Cross Bay Bridge, spoke about an encampment where perhaps a dozen homeless men lived and often drank. He said he would not dare venture there, for fear of being attacked. “I don’t go back there,” he said. “I don’t know who is back there. ”'"}, "time": 1742564045.4829276}