{"duration": 0.12443161010742188, "input_args": {"text": "'Despite decades of fervent student protests that reached a peak last fall, the president of Yale announced on Wednesday that the university would keep the name of a residential college honoring the   politician and white supremacist John C. Calhoun. The president, Peter Salovey, also said the university would name its two new residential colleges for Anna Pauline Murray and Benjamin Franklin. The selection of Ms. Murray, a legal scholar and civil rights activist who graduated from Yale Law School in 1965, represents the first time the school has honored either an   or a woman with the naming of a college. Many students were perplexed by the selection of Franklin, who received an honorary degree from Yale. Franklin, like many other founding fathers, was once a slaveholder himself before he became involved in the abolitionist movement. Mr. Salovey explained that Franklin was a “personal hero and role model” of Charles B. Johnson, a businessman and Yale alumnus who donated $250 million to pay for the new buildings  —   the largest gift in the school’s history  —   and who suggested the honor. In a conference call with reporters on Wednesday, Mr. Salovey said that while Mr. Johnson’s gift was not contingent upon naming the college after Franklin, “I really want you to remember this is the largest single gift ever given to Yale. ” In addition, the faculty leaders of all Yale residential colleges will shed their   title of master they will now be called heads of college, acknowledging the discomfort many students and faculty members felt toward a title that conjures the country’s history of slavery. As part of the resolution, Yale will start a historical study examining the “  people, events and narratives behind the familiar facades seen on campus,” beginning with an appraisal of Mr. Calhoun’s legacy. The various decisions came in consultation with the Yale Corporation, the university’s governing body. On Wednesday night, the Black Student Alliance at Yale issued a statement calling the naming of Murray College and the abandonment of the master title “  first steps towards creating a better and more inclusive Yale. ” Retaining the name Calhoun, they said, “is a regression. ” Mr. Salovey defended the Calhoun decision as the best possible way for the university to confront its history. “Universities have to be the places where tough conversations happen,” he said. “I don’t think that is advanced by hiding our past. ” Similar heated discussions about historic ties between universities and their racist pasts have inflamed campuses across the country. Princeton’s board of trustees decided this month that the name Woodrow Wilson would remain on its buildings and school, despite vociferous student objections. Mr. Wilson was an admirer of the Ku Klux Klan and reinstated segregation in the federal government. Yale has long grappled with the legacy of Mr. Calhoun, who advocated slavery as “a positive good,” but the issue found footing last fall after an online petition demanding that the college’s name be changed garnered around 1, 500 supporting signatures. The dispute over Calhoun College, founded in 1933, that ensued soon revealed deeper discontent among students and professors over more substantive issues regarding race, in particular what many saw as the university’s lack of commitment to faculty diversity and the alienation experienced by many minority students. A group of student activists  —   operating under the name Next Yale  —   handed Mr. Salovey a list of demands last year that included increasing the number and tenure of diverse faculty members increasing the budgets for ethnic and racial cultural centers abolishing the title of master and naming the two new residential colleges after minorities. Those demands were met in part, but students have largely remained skeptical. In November, the university announced that it was committing $50 million to a   initiative, an effort to address the fact that less than 3 percent of its Faculty of Arts and Sciences is black. Among Yale’s roughly 5, 400 undergraduates, 11 percent identify themselves as black or  . Karléh Wilson, a senior from Louisiana who has helped organize the Next Yale protests, said she felt the university did not go far enough to meet student demands. “There are more than enough alumni of color who the naming committee could have drawn from,” Ms. Wilson, 22, said. Crystal Feimster, a professor of   studies, agreed, saying she was “deeply disappointed with the decision not to rename Calhoun” and found the selection of Franklin “a missed opportunity. ” Still, she lauded the choice of Ms. Murray, whom she called “a relentless advocate for racial equality and women’s rights. ” Jonathan Holloway, the college’s first black dean of students, called this year “a moment of reckoning” that he hoped would strengthen the university. “We’re trying to reconcile our current values and aspirations with these names,” he said. “We will have failed if we do not do that work going forward. ”'"}, "time": 1742562687.2515094}