{"duration": 0.07911920547485352, "input_args": {"text": "'Caitlyn Jenner has issued a warning to President Donald Trump and the Republican Party: treat the LGBT community unfairly, and you’ll have to deal with me. [The former Olympic gold    TV star, formerly known as Bruce Jenner, challenged the president in a   interview with Diane Sawyer set to air Friday night.  “Yes, I did vote for Trump, but here’s the deal breaker with the Republican party,” Jenner told Sawyer, according to a preview clip of the interview released Friday. “And the deal breaker is, you mess with my community, you do the wrong thing with our community, you don’t give us equality and a fair shot, I’m coming after you. ” Jenner told Sawyer that what the LGBT community needs from Republican legislators is “federal guidance,” including on transgender service in the military. “Just like the previous administration said that it was ok to serve as a trans person in the military,” Jenner said. “We have frontline people, ok? I’m talking Marines, trans guys, on the frontline, fighting for our country. I’m trying to get, especially the Republican party, to make a change. ” Friday night’s interview with Sawyer comes nearly two years to the day after Jenner first came out as a transgender woman in a 2015 interview with Sawyer. During that interview, Jenner said he had always leaned more conservative in his politics, identified as a Republican, and said he believed in the Constitution. Jenner spoke out in support of Trump during the 2016 presidential campaign, telling Stat magazine in June that the Republican candidate was better on LGBT issues than his Democratic opponent, Hillary Clinton. “Everybody looks at the Democrats as being better with these issues. But Trump seems to be very much for women,” Jenner said at the time. Jenner also attended Trump’s inauguration. But In February, the Keeping Up with the Kardashians and I Am Cait star criticized Trump for lifting federal guidelines concerning transgender bathroom use, calling the decision a “disaster. ” “You made a promise to protect the LGBTQ community. Call me,” Jenner said in a video posted to Twitter. Jenner is set to release a book of memoirs, Secrets of My Life, next month. In an excerpt from the book published earlier this month, the reality star claimed to have undergone successful gender reassignment surgery in January, nearly a year and a half after first coming out as transgender. Jenner’s interview with Sawyer airs Friday night at 10ET on ABC.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742562215.0319512}