{"duration": 0.16827106475830078, "input_args": {"text": "'Taming the corporate media beast The Crisis of the European Union Is Irreversible \\nThe political-economic block and its common currency cannot be salvaged Donate! The author is an Italian industrialist and honorary member of the Academy of Science of the Institut de France \\nAccording to a well-known Italian Research Centre, from 2003 to 2014 the European single currency cost an 11% GDP reduction throughout the Eurozone and 18 million additional unemployed people. Conversely, as a result of the Maastricht agreement only, throughout the Eurozone we have lost 8 million jobs and an additional 5% of Gross Domestic Product, owing to the obligation to eliminate deficit and cut investment. Furthermore, the report of said Research Centre shows that, again in late 2014, the average EU unemployment rate was approximately 11.6%. In a scenario of parity with the dollar, the EU unemployment in the Eurozone would have been 5.8%, more or less the same as the US rate in that phase. Hence a monetary policy characterized by an excessive overvaluation of the European currency blocked both exports and the internal market at the same time. Furthermore, it created the conditions for a deterioration of public budgets in terms of deficit and debt. In fact, again at the end of 2014, the Eurozone recorded a public deficit totalling 269 billions which, without the single currency, would even be turned into a surplus of 165 billion euro, with a difference equal to 445 billions. In terms of GDP percentage, the difference would be 4.1 points while, with specific reference to the Eurozone’s public debt, we would have had three trillion euro less. Only for Italy, as many as 400 billion public debt less. Working on this assumption, all current evils would have been avoided if there had not been the overvaluation of the euro against the dollar. There would have not been the massive impact of the financial crisis coming from the United States, at first with Lehman Brothers’ bankruptcy on September 15, 2008 and later with the recurrent banking crises in Europe, which put a strain on the public finances of major European governments. Considering that all EU governments were accustomed to borrow huge sums directly from the banking system, we can imagine the effects of the financial and credit crisis on the various European countries’ budgets. It is worth recalling that the United States have never liked the euro – quite the reverse they have always considered it \"imaginative and useless\", as former President George Bush I stated in recently-published public papers. Reading between the lines of its official documents, the EU itself maintains that the financial crisis came from the United States and that it made serious mistakes. Also according to the EU official documents, the mistakes were allegedly the following: 1) too much attention focused on the public budget deficit on an yearly basis, without being too much worried about the public debt as a whole. According to European standards, the EU government submitted reduced annual budgets for obtaining EU funding - later obviously the public debt increased anyway and real trouble came. Also thanks to the EU operating logic, the naive myth that the crisis was not structural and could be managed with some cosmetic measures has led to the current decline. Said decline has been triggered off by the rapid growth of interest rates on the EU Southern countries’ public debt. 2) Again according to the EU papers, there has also been a lack of surveillance over competitiveness and macroeconomic imbalances. This is not great news. However, there is always someone who benefits from the economic disharmonies – just to use the old terminology of the remarkable Italian philosopher Mario Calderoni - while others stand to lose as a result of them. There has never been a solidarity-based Europe during crises, but only in \"good times\". Therefore, in the losing countries, we recorded growing indebtedness of the private sector, not controlled owing to the myth of companies’ autonomy - and hence an increasing weakening of banks. The other EU \"winning\" countries took over the losers’ market shares. Again, instead of imposing draconian penalties which worsen the economic problems, we should have supported the weakest economies and the most unbalanced ones in terms of trade with the United States. The United States exported their mass of bad loans, disguised as new securities, to the European Union, the financial enemy that had dreamt of relegating the dollar to the rank of a Euro ancillary currency. There was also this geopolitical war within the crisis of the European currency. Moreover, the European Central Bank aimed at maintaining financial stability but, by statute, it could not buy public debt from other non-EU countries, as all issuing banks do. This is the main way in which central banks can nip in the bud speculative attempts against them. Furthermore, in Italy, as in other South Europe’s economies, foreign competition has kept wages at very low levels and, in dealing with competition for exports, our political and economic structure has only reduced the labour incomes almost to the level of the worst competitor. 3) Another EU public self-criticism is relating to the slow decision-making mechanism: the European establishment has interpreted the small shocks of the global crisis as isolated phenomena and not as a common geoeconomic problem. Hence the slow pace and often the ineffectiveness of the EU \"solutions\". And this faced with a \"market\" - if we may call it so - of investors who, as soon as they saw the crisis in the South, played a downward game or went away quickly. Good old days when the Treasury rightly bought the unsold debt securities at the Bank of Italy’s auctions. And, it is worth noting that, in so doing, it did not create inflation at all. Currently, however, markets are fast like jackals, which smell corpses, while States have been slow as marmots. This is the real problem of today’s politicians. States must increase their pace and be very quick and capable of understanding both adverse media and the political and military operations which are objectively dangerous for them. Moreover considering that, at the time, the public debt securities were held mostly by banks, their default was possible and easy to take place. Today there is a new crisis looming large on Europe, namely the crisis of non-performing loans: in Portugal, Italy and Spain, but also in some North European countries, the non-performing loans are worth over 540 billion euro. Hence shortly another European debt crisis will materialize. 4) Currently the European Union is basically a Gaullist-style \"Europe of States\"– even though it strongly denies so. Hence the idea of \\u200bcreating the \"United States of Europe\" is extraordinary nonsense: the EU Member States are so different from one another, and with such a diversified economy, that these \"United States of Europe\" would create more contrasts internally than externally, namely with the United States of America, Russia and China. Not to mention that, with a view to becoming today’s USA, America had to undergo a wide civil war, whose echoes are not completely over even today. 5) Moreover, the united Europe - and I am talking about the Euro zone - will be increasingly entangled in an area of \\u200b\\u200bstructural deflation which condemns \\'Italy, together with other less economically strong countries, to face an indefinite period of very low growth rates. On the contrary, the other North European countries will continue to grow and, above all, will not have to tackle the same problems we have, namely low wages and exports facing fierce competition, not protected by the Euro. 6) Hence what can be done? We must prepare for a slow but safe exit from the Euro, not waiting for the EU \"bureaucratic Caesarism\", as well as redefining and protecting our export area. Then we must use our credit instruments and debt securities as alternative currency, where possible – as well as use some well-disguised protectionism also vis-à-vis the EU itself. Finally, we must rethink our overall strategy, which we have never done. The economic crises are always geopolitical crises. Furthermore we must fund the companies’ technological upgrade projects with State funds, without waiting for the EU claims. Last but not least, we must put an end to young people’s \"brain drain\". It is true that, as some liberal-masochists maintain, the current professions’ market is global, but it is also true that the cost of their education and training has been borne by our State and our families. Did you enjoy this article? - Consider helping us! Russia Insider depends on your donations: the more you give, the more we can do. $1 $10 Other amount \\nIf you wish you make a tax-deductible contribution of $1,000 or more, please visit our Support page for instructions Click here for our commenting guidelines On fire'"}, "time": 1742561694.447964}