{"duration": 0.04772496223449707, "input_args": {"text": "'  SORE LOSER: George Soros Declares War On America As Violent MoveOn.Org Protests Fill The Streets Hillary Clinton supporters were filmed setting fire to the US flag while marching through the streets of Portland, Oregon. Footage also emerged of activists setting tyres and rubbish bins on fire, blocking main roads and lighting flares. People also burned an effigy of the President-elect, who will be officially sworn into office in January.   10, 2016 As Donald Trump totally destroyed the Hillary Clinton political machine, George Soros radical pro-amnesty liberals started riots in California. \\nEDITOR’S NOTE: Former teenage Nazi George Soros spent tens of millions of his ill-gotten gain to try and stop Donald Trump from winning, but to no avail. His handpicked puppet Crooked Hillary was roundly rejected by the American people. So naturally, if you’re George Soros, the only thing left to do is pay unemployed liberals and leftists to march in the streets, spouting filthy curses while burning the American flag. \\nCrowds of angry protesters have taken to streets across the United States chanting “ Not Our President ” while setting fires and smashing windows. Hundreds of people descended on California minutes after it was announced that Donald Trump had won the election . George Soros Leftists burn American flag: \\nGRAPHIC WARNING: As is usual with George Soros people, there is foul language in this video. \\nHillary Clinton supporters were filmed setting fire to the US flag while marching through the streets of Portland, Oregon, shouting “F*** Donald Trump”. Footage also emerged of activists setting tyres and rubbish bins on fire, blocking main roads and lighting flares. People also burned an effigy of the President-elect, who will be officially sworn into office in January. Hillary supporters burn US flag after Trump wins presidency: \\nGRAPHIC WARNING: As is usual with George Soros people, there is foul language in this video. MoveOn.org released the following press release Wednesday afternoon: \\nAmericans to Come Together in Hundreds Peaceful Gatherings of Solidarity, Resistance, and Resolve Following Election Results Hundreds of Americans, dozens of organizations to gather peacefully outside the White House and in cities and towns nationwide to take a continued stand against misogyny, racism, Islamophobia, and xenophobia. Tonight, thousands of Americans will come together at hundreds of peaceful gatherings in cities and towns across the nation, including outside the White House, following the results of Tuesday’s presidential election. The gatherings – organized by MoveOn.org and allies – will affirm a continued rejection of Donald Trump’s bigotry, xenophobia, Islamophobia, and misogyny and demonstrate our resolve to fight together for the America we still believe is possible. Within two hours of the call-to-action, MoveOn members had created more than 200 gatherings nationwide, with the number continuing to grow on Wednesday afternoon. WHAT: Hundreds of peaceful gatherings of solidarity, resistance, and resolve nationwide WHEN / WHERE: Find local gatherings here . Major gatherings include in New York City’s Columbus Circle and outside the White House in Washington, DC . RSVP: Please email press@moveon.org to confirm attendance. “This is a disaster. We fought our hearts out to avert this reality. But now it’s here,” MoveOn.org staff wrote to members on Wednesday. “The new president-elect and many of his most prominent supporters have targeted, demeaned, and threatened millions of us—and millions of our friends, family, and loved ones. Both chambers of Congress remain in Republican hands. We are entering an era of profound and unprecedented challenge, a time of danger for our communities and our country. In this moment, we have to take care of ourselves, our families, and our friends—especially those of us who are on the front lines facing hate, including Latinos, women, immigrants, refugees, Black people, Muslims, LGBT Americans, and so many others. And we need to make it clear that we will continue to stand together.” source  '"}, "time": 1742562349.2984316}