{"duration": 0.10850930213928223, "input_args": {"text": "'It will feel like a familiar affair at the 68th Primetime Emmy Awards, with “Game of Thrones,” “Modern Family” and Julia   once again landing nominations on Thursday. But the occasionally stodgy Emmys, which sometimes latch on to winners (like Ms.  ) and stay with them, was also infused with new blood. Popular shows like “The People v. O. J. Simpson,” “Roots’’ and “Fargo” drew attention to the limited series category, James Corden emerged as a force in the   competition, and there was recognition in the best drama category for the widely praised but previously overlooked “The Americans. ” “Game of Thrones,” HBO’s fantasy epic, will again be the leader of the pack heading into the awards. The drama, which just completed its sixth season, received 23 nominations, the highest total for any show. The show received 24 nominations last year and won its first best drama Emmy. [ List: Nominations for the 2016 Emmy Awards ] HBO, which is coming off its biggest Emmy haul ever last year, had a total of 94 nominations, the highest of any network for the 16th consecutive year. FX’s   limited series “The People v. O. J. Simpson: American Crime Story” and its anthology series “Fargo” were the   and   nominated shows. FX finished behind HBO in nominations with 56. The streaming services Netflix and Amazon continue to make significant inroads, with each scoring its highest Emmy nomination totals (54 for Netflix and 16 for Amazon). The Emmys reflect an infusion of talent into television at a time when movie stars are increasingly turning to TV, especially in limited series, and there are more scripted shows than ever before. Over the past few months, networks have been ferociously competing against one another in nomination campaigns. The broadcast networks are still experiencing a diminished presence at the Emmys, with three of the networks  —   ABC, Fox and CBS  —   notching fewer nominations than in 2015. NBC had the same total, with 41. And for the fifth consecutive year, the networks were shut out of nominations for best drama. In that category, “Game of Thrones” will compete against the final season of the PBS show “Downton Abbey,” USA’s “Mr. Robot,” AMC’s “Better Call Saul,” Netflix’s “House of Cards,” FX’s “The Americans” and Showtime’s “Homeland. ” “Mr. Robot,” which won the Golden Globe for best drama in January, is a new entrant in the category, along with “The Americans. ” They replace “Mad Men,” which ended last year, and Netflix’s “Orange Is the New Black. ” HBO’s “Veep,” which last year ended the   winning streak of ABC’s “Modern Family’’ in the best comedy category, was once again nominated for that award. It will go up against “Modern Family” again, along with Netflix’s “Unbreakable Kimmy Schmidt,” Amazon’s “Transparent,” HBO’s “Silicon Valley,” ABC’s “ ” and Netflix’s “Master of None. ” With Jon Hamm’s Don Draper from “Mad Men” out of the race, the best actor category for drama has no clear  . Two previous Emmy winners, Kyle Chandler (“Bloodline”) and Bob Odenkirk (“Better Call Saul”) will compete against Kevin Spacey (“House of Cards”) Liev Schreiber (“Ray Donovan”) Matthew Rhys (“The Americans”) and Rami Malek (“Mr. Robot”) all of whom are looking for their first Emmy. Viola Davis, who last year became the first   woman to win a best acting Emmy in the drama category, will try to repeat, for her performance in “How to Get Away With Murder. ” She is up against Robin Wright (“House of Cards”) Keri Russell (“The Americans”) Tatiana Maslany (“Orphan Black”) Claire Danes (“Homeland”) and Taraji P. Henson (“Empire”). Ms. Russell is the only new actress in the category, and this represents her first Emmy nomination. FX’s Emmy haul was propelled by “The People v. O. J. Simpson,” “Fargo” and “The Americans. ” “The People v. O. J. Simpson” received a whopping six nominations in the limited series acting categories, including one for Sarah Paulson, who was also nominated for her role in FX’s “American Horror Story: Hotel. ” Ms. Paulson, who portrayed the prosecutor Marcia Clark in “The People v. O. J. Simpson,” said in an interview that she shot both roles at the same time and that she was “running on fumes, just as Marcia was. ” She added, “I used all of my exhaustion to my benefit since no one was more tired during that trial than Marcia Clark. ” Another standout on Thursday was   Emmy winner Laurie Metcalf, who was nominated for three awards: for best actress in a comedy series for HBO’s “Getting On” and for guest appearances in “The Big Bang Theory” and “Horace and Pete. ” Netflix had a strong day, with nominations in both the lead drama and comedy categories and in several acting categories. With 54 nominations, Netflix has 20 more than it received last year, its previous record. “Making a Murderer,” the popular Netflix documentary, was nominated for six awards, including best documentary series. This is the first year that Netflix eclipsed each of the broadcast networks. Amazon was led by its comedy “Transparent,” which had 10 nominations. Last year, the show’s star, Jeffrey Tambor, won the best actor award, the first time a streaming service had won a lead acting Emmy. For the first time in 16 years, “The Daily Show” was not nominated in the best variety show category, a blow to its rookie host, Trevor Noah. Likewise, Stephen Colbert’s “The Late Show” was snubbed, while Mr. Corden’s “The Late Late Show” was honored instead. The nomination will add fuel to the discussion that Mr. Corden is outshining his more experienced CBS colleague. Rounding out the category were HBO’s John Oliver, ABC’s Jimmy Kimmel, HBO’s Bill Maher, NBC’s Jimmy Fallon and Crackle’s “Comedians in Cars Getting Coffee” with Jerry Seinfeld. Unlike the Academy Awards, which have overhauled the membership ranks following controversy over its   slate of acting nominees, the Emmys have a relatively diverse lineup, with a number of actors of color receiving nominations. Last year, the Emmys made changes to the voting process, opening up the best drama and comedy categories to all Television Academy voters, not just a committee. “Game of Thrones,” which has never been more popular, has probably been a beneficiary to the rules change. In the comedy acting categories, Ms.   is up again for her performance in “Veep. ” She has won the award four years in a row (and has seven Emmys over all). She will be competing against Ms. Metcalf, Amy Schumer (“Inside Amy Schumer”) Lily Tomlin (“Grace and Frankie”) Tracee Ellis Ross (“ ”) and Ellie Kemper (“Unbreakable Kimmy Schmidt”). Mr. Tambor will be up against Anthony Anderson (“ ”) Aziz Ansari (“Master of None”) Will Forte (“The Last Man on Earth”) William H. Macy (“Shameless”) and Thomas Middleditch (“Silcon Valley”). Though television has never been more celebrated as an art form, drawing a sizable audience for the Emmys remains something of a challenge: Last year’s show was its lowest rated ever.  The Emmys will be hosted this year by Mr. Kimmel and will be broadcast on Sept. 18 on ABC.'"}, "time": 1742564504.0917673}