{"duration": 0.11144566535949707, "input_args": {"text": "'  The National Interest \\nLast week, the New York Times ran a news story on inflatable jets and missile launchers being added to the Kremlin’s arsenal. Using balloons as weapons of war may sound strange and lead one to think Moscow has concocted a novel method of war. Upon deeper analysis, what the Russians are doing is nothing particularly new. The British and American military famously employed inflatable tanks in World War II in order to deceive the Germans. The Serbs more recently used decoys during the intervention in the Balkans to trick NATO bomber pilots. The method to this inflatable madness is based on well-established military thinking, going all the way back to ancient China. To get a better sense of what the Russians are doing and how they understand warfare, one only needs to pick up a copy of Sun Tzu’s Art of War . \\n“Warfare is the Way (Tao) of deception. Thus although [you are] capable, display incapability to them. When committing to employ your forces, feign inactivity. When [your objective] is nearby, make it appear to be distant; when far away, create the illusion of being nearby.” \\nThis line from Sun Tzu is especially important in Russian military thinking of recent years. The Kremlin’s use of misinformation in the media is a particularly obvious example of deception, but the actual movement of men and material is just as important—especially to nations sharing a border with Russia. Moscow is intent on ensuring the West that Russian troops can mass at a moments notice and be rapidly deployed to far-flung corners of the country. Russia could inject itself into numerous theaters on its periphery and beyond, including the Baltic states with the threat of little green men, to continued military drills with China in the South China Sea to the risk of rekindling war in Nagorno-Karabakh . All of these scenarios prove irksome for policy makers in Washington. Dealing with rapidly deployable troops, that have the ability to stoke conflicts thousands of miles apart, makes deciphering the Kremlin’s actions a frustrating ordeal. \\n“Probe them to know where they have excess, where an insufficiency.” \\nNATO pilots have been working overtime to deal with frequent Russian incursions into allied airspace. The most recent incident occurred only two weeks ago, in which Norway, the United Kingdom, France and Spain scrambled aircraft to confront Russian TU-160 bombers flying near their territory. Russia’s high-profile encounters, including a very close flyby of a U.S. Navy ship and barrel rolling over an American reconnaissance aircraft, clearly demonstrates that it is trying to determine how and in which ways NATO will respond. These actions aim to keep allied forces on their toes, judging reaction times and what assets are used to counter their forces. \\n“Thus one who excels at moving the enemy deploys in a configuration (hsing) to which the enemy must respond. He offers something that the enemy must seize. With profit he moves them, with the foundation he awaits them.” \\nThe Russians are very fond of this method, which is usually characterized by instigating incidents in order to execute their so-called reflexive control . This concept focuses on creating international incidents and forcing others to react them, in which the only plausible outcome is usually in favor of the Kremlin. The most notable case of this logic was applied in Russia’s entry into the Syrian civil war. Although Moscow’s intervention has had its pitfalls, largely driven by having to work with troublesome allies in Tehran and Damascus, it has made itself the primary external actor in the country. The slow American response to the Syrian war allowed Moscow to enter the fray and change the reality on the ground. In doing so, the momentum of the conflict swung in favor of the Russian-led coalition with President Assad’s grip on power secured. Whether the West likes it or not, the Russians will now be part of the peace process. Calls by France and the United States to investigate Russia’s bombing campaign as a war crime will not change this reality. The end result is that the Russian-led coalition is setting the pace in the conflict, with Washington and the West struggling to keep up. \\nThese selected passages from the Art of War help shed light on the Kremlin’s calculus. A strong case can be made that the Russian are employing these means in order to maximize the effectiveness of their armed forces in the face materially stronger opponents like the NATO alliance. Although these deceit-based tactics are signs of weakness, it does not make their use any less dangerous. If one is to believe Moscow is undermining the American-led world order, forcing NATO to continually be on alert is certainly resource draining and creates domestic pressure through the questioning of the alliance’s worth and purpose. While Putin may not be a grand strategist—given the hardships Russia faces through its own actions—he has been doing his homework on war. In order to avoid direct conflict with Moscow and better understand its methods, policy makers would be wise to read up on its approach to war and tactics they are likely to employ. \\nBlake Franko is an assistant editor at the National Interest.'"}, "time": 1742563829.1796947}