{"duration": 0.05691194534301758, "input_args": {"text": "'The Los Angeles Times  —   which did its best, it admits, to ensure that President Donald Trump would not be elected  —   has printed a strident, and nearly hysterical, editorial in which it calls the Trump presidency a “train wreck. ”[Among other things, the Times states:  It was no secret during the campaign that Donald Trump was a narcissist and a demagogue who used fear and dishonesty to appeal to the worst in American voters. The Times called him unprepared and unsuited for the job he was seeking, and said his election would be a “catastrophe. ” Still, nothing prepared us for the magnitude of this train wreck.   …     In a matter of weeks, President Trump has taken dozens of   steps that, if they are not reversed, will rip families apart, foul rivers and pollute the air, intensify the calamitous effects of climate change and profoundly weaken the system of American public education for all.   …     What is most worrisome about Trump is Trump himself. He is a man so unpredictable, so reckless, so petulant, so full of blind   so untethered to reality that it is impossible to know where his presidency will lead or how much damage he will do to our nation. His obsession with his own fame, wealth and success, his determination to vanquish enemies real and imagined, his craving for adulation  —   these traits were, of course, at the very heart of his   outsider campaign indeed, some of them helped get him elected. But in a real presidency in which he wields unimaginable power, they are nothing short of disastrous. The editorial comes just days after Trump’s “unimaginable power” proved unable to force through a bill to repeal and replace Obamacare. There were few, if any, Times editorials criticizing President Barack Obama’s narcissism and expansion of executive powers (after promising to curtail the same). Read the whole editorial here. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742561738.0077767}