{"duration": 0.15648674964904785, "input_args": {"text": "'  Palestinian UN Envoy Threatens Donald Trump If He Keeps Promise To Move Embassy To Jerusalem The Palestinian ambassador to the UN on Friday warned President-elect Donald Trump that if he dares to move the U.S. embassy to Jerusalem, the Palestinians would “make life miserable” for the United States at the United Nations.   14, 2016 The Palestinian ambassador to the UN on Friday warned President-elect Donald Trump that if he dares to move the U.S. embassy to Jerusalem, the Palestinians would “make life miserable” for the United States at the United Nations. \\n“Behold, I will make Jerusalem a cup of trembling unto all the people round about, when they shall be in the siege both against Judah and against Jerusalem.” Zechariah 12:2 (KJV) \\nEDITOR’S NOTE: Donald Trump’s campaign promise to move the US Embassy from Tel Aviv to Jerusalem is t he whole reason why I supported him in the first place. From a Bible prophecy perspective the implications and ramifications of such a move are off the charts. We warned from the very start that this move could easily trigger the Psalm 83 War. And right on cue, here comes the Palestinians protesting it already. Things are about to get very, very interesting…to say the least. \\n“If people attack us by moving the embassy to Jerusalem, which is a violation of Security Council resolutions, it is a violation of Resolution 181 of the UN general assembly that was drafted by the U.S. … it means they are showing belligerency towards us. … If they do that nobody should blame us for unleashing all of the weapons that we have in the UN to defend ourselves and we have a lot of weapons in the UN,” Riyad Mansour said . \\nMansour conceded that such a move could not be passed as a Security Council resolution because of the U.S. veto. Nevertheless, he warned Trump, “Maybe I can’t have resolutions in the Security Council but I can make their lives miserable everyday with precipitating a veto on my admission as a member state.” \\nMansour warned that he would “reopen the whole Pandora’s Box” of verdicts in the International Criminal Court of Justice on the issue of Israel’s security fence and the settlements. \\nHe added that “it is illegal to defy Security Council resolutions that the U.S. is party to that the unilateral action by Israel annexing East Jerusalem is illegal and it is null and void. If the U.S. administration wants to defy international law they are doing something illegal.”  '"}, "time": 1742628406.6773698}