{"duration": 0.07479476928710938, "input_args": {"text": "'Palestine The file photo shows a view of al-Aqsa Mosque in East Jerusalem al-Quds. \\nThe United Nations Educational, Scientific and Cultural Organization (UNESCO) has approved a motion that endorses the right of the Palestinians to the al-Aqsa Mosque compound and slams Israeli provocations around the holy site. \\nUNESCO\\'s 21-member World Heritage Committee adopted the resolution in Wednesday\\'s secret ballot at the agency’s headquarters in Paris. \\nTen countries voted for, two against, eight abstained and one was absent in the voting. \\nThe resolution expresses UNESCO’s deep concerns over Israeli construction works and archaeological excavations in the Old City of Jerusalem al-Quds. \\nSaeb Erekat, the secretary general of the Palestine Liberation Organization, welcomed the passage of the motion and accused the Tel Aviv regime of resorting to a campaign of distorting facts in a bid to legitimize its occupation of East Jerusalem al-Quds. \\n“Through an orchestrated campaign, Israel has been using archaeological claims and distortion of facts as a way to legitimize the annexation of occupied East Jerusalem,” Erekat said. \\nHe further noted that the UNESCO resolution urges “respecting the status quo of its religious sites, including the al-Aqsa Mosque compound that continues to be threatened by the systematic incitement and provocative actions of the Israeli government and extremist Jewish groups.” \\nEarlier this month, UNESCO’s 58-member Executive Board approved a similar resolution, prompting a furious reaction from Israel as the regime suspended its ties with the agency. \\nWednesday’s vote further infuriated Israel, with Prime Minister Benjamin Netanyahu announcing that the regime’s ambassador to UNESCO, Carmel Shama-Hacohen, had been recalled for consultations. \\n\"We will decide what the next steps will be,” Netanyahu said in a statement. \\nElias Sanbar, Palestine’s UNESCO envoy, fired back at those upset with the resolution and warned that Israelis were “politicizing religion and this is very dangerous.\" \\nMakram Mustafa Queisi, Jordan’s ambassador to UNESCO, also stressed that UNESCO tried to tackle the issue from a “technical point of view” while many parties were politicizing it. Palestinian Ambassador to UNESCO Elias Sanbar (L) and Jordanian envoy Makram Mustafa Queisi address the media after an anti-Israel resolution was passed by secret ballot at the agency’s headquarters in Paris, France, October 26, 2016. (Photo by AP) \\nPalestine became the 195th full member of UNESCO in October 2011, triggering a cut in Tel Aviv’s funding to the agency. \\nThe occupied territories have already been the scene of increased tensions ever since the Israeli regime imposed restrictions on the entry of Palestinian worshipers into the al-Aqsa Mosque compound in August 2015. \\nMore than 250 Palestinians have been killed by Israeli forces since the beginning of last October. Loading ...'"}, "time": 1742628549.747039}