{"duration": 0.11644101142883301, "input_args": {"text": "'\\nThere have been a wide array of reports suggesting that the U.S. government is preparing military and Homeland Security assets for widespread election fall out. Given the mainstream media’s inclination towards Hillary Clinton and recently presented evidence that Democrat operatives have been attempting to illegally influence the ballot box through falsifying votes and electronic tampering , it appears that concerns surrounding a rigged election are not necessarily unfounded, as President Obama would have us believe.\\nWith the election just days away, the fix appears to be in and some Americans are readying themselves for a confrontation should one be necessary.\\nAs the most divisive presidential election in recent memory nears its conclusion, some armed militia groups are preparing for the possibility of a stolen election on Nov. 8 and civil unrest in the days following a victory by Democrat Hillary Clinton.\\nThey say they won’t fire the first shot, but they’re not planning to leave their guns at home, either.\\n…\\nTrump has repeatedly warned that the election may be “rigged,” and has said he may not respect the results if he does not win. At least one paramilitary group, the Oath Keepers, has called on members to monitor voting sites for signs of fraud\\n…\\n \\nOver the past week, some prominent Trump supporters have hinted at violence.\\n“If Trump loses, I’m grabbing my musket,” former Illinois Representative Joe Walsh wrote on Twitter last week. Conservative commentator Wayne Root fantasized about Clinton’s death while speaking at a Trump rally in Las Vegas on Sunday.\\nBack in Georgia, the Three Percent Security Force wrapped up rifle practice in the midday sun. They then headed further into the trees to tackle an obstacle course with loaded pistols at their sides, ready for whatever may come.\\nSource: Zero Hedge via Raw Story \\nThe story comes from the mainstream media, of course, and ties in the Oklahoma City bombing, Waco and the Ruby Ridge incidents, all of which involved people with ties to militias.\\nThe way the report itself is framed appears to have the purpose of sowing seeds of “crazy conspiracy theorists” into the minds of the general public so that if push comes to shove government actions will be justified in the eyes of the American citizenry.\\nBut whatever the narrative, it is clear that the possibility of post-election chaos is becoming all the more probable . Whether the initial outcome shows a Trump win or a Hillary win, there are going to be tens of millions of very pissed off people in this country. And there’s a very good chance that some of them will take action, which according to Mike Adams could subsequently lead to open warfare on the streets of America:\\nAs I’ve publicly predicted numerous times over the last year, if Donald Trump wins, the radical extreme leftists go on a violent rampage that leads to the rest of us begging for martial law. After half a dozen cities burn with riots and looting, Trump invokes a national emergency, deploying National Guard troops across the most devastated urban areas, and the radical left finds itself in a shooting war with the government.\\nIf Hillary Clinton wins, all the Trump supporters who have been violently assaulted, spat upon and physically attacked by the radical left un-holster their concealed weapons and start shooting back. This quickly escalates into open warfare between lunatic leftist Hillary supporters and armed Trump “Second Amendment” people who basically figure they’ve got nothing left to lose anyway, so why not fight to save America? \\nFull Report: The Election Is A Ticking Time Bomb: “Chaos Will Erupt In Less Than 100 Days” \\nIt would only take a small group, perhaps even one that’s operating under a false flag, to light a wildfire that could spread from coast to coast. The assets, as Jeremiah Johnson warns , have already been put into place by the Obama administration:\\nIn summary, the U.S. is prepositioning its “enemy-assets” to blame – on what the administration does – for a collapsed election labeled as “rigged” or the suspension of the election for any number of reasons , real or illusory, such as a genuine attack the U.S. provokes or an attack the U.S. carries out on itself . Civil unrest and/or war are the escape hatches to bail out of the Constitution and to take control of the country…not letting either crisis go to waste. With civil rest or a world war, the administration will be handed the country on a platter – indefinitely – and the election will be a moot point, whether it happened or not.\\nFull report: The United States Is Pre-Positioning “Enemy Assets” In Preparation For A Rigged Election \\nAll of this may sound extreme, but this Presidential election has been nothing short of insane thus far.\\nWhatever the outcome, there will be calls of rigging from both sides, especially if it happens to be Hillary Clinton who , as evidence shows, has been rigging things all along.\\nIt only took one bullet in 1914 to lead to widespread global confrontation. In the end, no one really cared who fired it or who got shot. The assets had already been positioned ahead of time and were just waiting for someone to detonate the powder keg.\\nIf this is the case in America today, then this election will not end on November 8th, but could drag on for weeks or months as we saw with Bush vs. Gore in 2000.\\nShould tensions heat up and lead to confrontation, it is possible that President Obama will call for a national emergency and activate the Doomsday Executive Order to “restore order.” In this instance, the entire country could be on lock-down, so preparing for this outcome now in the event of curfews, rationing or any number of other potential scenarios is in order.\\nRelated: \\nThe Prepper’s Blueprint – A Step-By-Step Guide To Prepare For Any Disaster \\nThe Election Is A Ticking Time Bomb: “Chaos Will Erupt In Less Than 100 Days” \\nLeaked Military Drill Anticipates “No Rule of Law” After Election Results \\nUnited Nations Soldier Says They Will Soon Occupy America: “Going Door-to-Door Taking Guns Or Shooting To Kill” \\nAd Shows Army Prepping for Martial Law: “This Is Not Battle Training. This Is Riot Control” \\n'"}, "time": 1742563588.487282}