{"duration": 0.08972907066345215, "input_args": {"text": "'\\nSure, there are plenty of alternatives to fossil fuels: most people have heard of solar cells, wind and battery power, but there are other energy options as well. Some of them are a few years away from being viable in the US, but many of them could be excellent candidates if a little more research and funds are invested now. Here are three of the most familiar, yet underrated, energy options.\\nCooking Oil There are reports of cooking oil being used as a fuel source as far back as 1896, and peanut oil was used to power diesel engines throughout the turn of the century. But there hasn’t been much of a desire to move further into the realm of using cooking oil for fuel ; the issue that makes vegetable oil a less popular or likely choice is largely availability. Though the US alone produces more than 2.5 billion pounds of grease through restaurants and other industries, there are some regions where the byproduct is simply not available. Shipping drives up the cost and makes other resources more attractive. However, for those who DO have a readily available supply (such as farmers or restaurant owners), cooking oil can provide up to 25% of the energy needed to run these establishments. An investment in a special generator up front can allow these businesses to turn their used oils into energy and also cut down the cost of oil disposal (which can cost upwards of $75 a month) in the process. Best of all, cooking oil is completely renewable and burns cleaner than fossil fuels.\\nGarbage Incineration, or the burning of garbage, has been around for centuries; however, the process is not as simple as merely torching trash and being done with it. Incineration produces pollutants such as dioxin and releases them into the air. One way around this issue is to create special waste-to-energy plants that control the release of hazardous air pollutants.\\nEstonia has facilities that meet these requirements and they recently made headlines when they imported 62,000 tons of garbage from other European nations for use in their power plant in Iru. Sweden also produces more than 60% of their energy using renewable resources (primarily a combination of wind power and waste-to-energy). Currently, the United States has 87 waste-to-energy plants that generate approximately 2,720 megawatts, or about 0.4 percent of total US power generation. In European countries there are more government incentives and business benefits to utilizing alternative energy resources, but in the US we’re still much more reliant on our traditional sources. We don’t yet have the infrastructure to make the strides that Estonia or Sweden have, but as these and other European countries continue to develop these methods, they can serve as a model for future areas of exploration.\\nPoop! Yes, that’s right: human and animal feces can be used as a source of energy. When processed through bioreactors that are equipped at removing the natural gas from waste, this method is efficient and (after initial startup costs) affordable.\\nThe specialized bioreactors work by feeding solid human and animal waste into chambers full of bacteria. The bacteria eat any remaining nutrients in the waste and release natural gas that we can use as fuel. It’s also possible to convert solid waste into hydrogen and other gasses for various uses. Toyota’s Fukuoka plant in Japan has been experimenting with biogas-turned-hydrogen for fueling a new fleet of vehicles. Hydrogen vehicles are currently available in the United States as well, but they are expensive and the filling stations are rare at this point. Scientists at UCLA are hoping that “brown energy” continues to develop in the US because the benefits are so great and the source material is, ahem, endlessly available.\\n \\n( Sign up for our FREE newsletter to get the latest prepping advice, gardening secrets, homesteading tips and more delivered straight to your inbox!) Pamela Bofferding is a native Texan who now lives with her husband and sons in New York City. She enjoys hiking, traveling, and playing with her dogs.\\nThis information has been made available by Ready Nutrition \\nOriginally published November 5th, 2016 How to Build a Simple and Affordable Methane Digester New Altered Bacteria Can Convert Sunlight Into Liquid Fuel Dutch Harvest Electricity From Living Plants To Power… Coal: An Underrated Fuel Source that Preppers Should… Biomass Briquettes: An Alternative Fuel Source Made From… '"}, "time": 1742564196.190585}