{"duration": 0.05789637565612793, "input_args": {"text": "'  *Articles of the Bound* / Trump’s Amazing Victory Against a Stacked Deck Trump’s Amazing Victory Against a Stacked Deck November 18, 2016, 2:27 pm by Roger Aronoff Leave a Comment 0 \\nAccuracy in Media \\nWhile the media and the Democrats are in disarray over last week’s elections, it looks like President-elect Donald Trump’s honeymoon is over before it even began. While there may have been a few reports in the past week that were simply factual about Trump’s transition team and process, virtually all of the reports in the mainstream media have been negative and even hostile towards Trump, his transition team and his supporters. \\nThe media meltdown that accompanied Trump’s victory last week has been a sight to behold. How could they have completely missed this outcome?, they wondered. Most of the articles—such as those by The Washington Post (sampling, weighting and voter estimation), The New York Times (misunderstanding major swaths of our country), and Pew Research (underestimating Trump’s support and “non-response bias”)—attempted to explain away their acknowledged failure. Hillary Clinton and her campaign manager John Podesta are blaming the media, and FBI Director James Comey for his public comments on the ongoing investigation into Hillary’s mishandling of classified information. \\nBut this misses the larger point. In spite of a thoroughly biased and corrupt news media and popular culture that worked their collective hearts out to rid the country and the world of what they viewed as an uncouth, dangerous egotistical businessman and reality TV star, a significant majority, as measured through our Constitutional system of the Electoral College, chose Trump over Hillary. Yes, Hillary won the popular vote, but that’s not how we elect our president. \\nWhether Trump’s campaign was brilliant, or he was running against such a flawed candidate that he pulled off a win in spite of himself, will long be a subject of dispute. But he did just that. Along the way, he knocked off two political dynasties: Bush and Clinton. Through WikiLeaks, the FBI investigation, Project Veritas—which revealed ties between the Clinton campaign, the Democratic National Committee (DNC) and various left-wing activist groups that plotted to create violence and havoc at Trump rallies and pursue efforts at voter fraud—the public learned enough to understand how corrupt and manipulative the Democrat Party and its top leaders had become. \\nAnother explanation is that Trump was the beneficiary of billions of dollars of free publicity on TV that enabled his victory. But the truth is that at least 90 percent of that attention was negative, intended to make him look bad—and some of it deservedly so. Trump did have conservative talk-radio on his side, and several spokespeople who got considerable air time. He had Sean Hannity’s support, and otherwise fairly balanced coverage on Fox News. \\nBut for the most part, the media were apoplectic at the outcome of the election. In essence, their narrative was that Trump was beyond the pale, and that reports of Hillary’s actions were exaggerated and false, especially concerning her handling of classified material, and her actions as secretary of state that might have influenced payments to the Clinton Foundation, to Bill Clinton personally, and to allies of the Clintons, such as in Haiti. \\nBrian Stelter of CNN’s Reliable Sources said, “Donald Trump was tapping into something that already existed, which was distrust of the media, particularly on the right, but among many Americans who for various reasons distrust the media, partly because they’re told to by conservative talk radio hosts like Rush Limbaugh and Sean Hannity. But Trump exploited that mistrust and deepened it…Trump tapped into that anger at the media and made it much, much worse.” \\nOver at MSNBC, Lawrence O’Donnell called Trump a “tyrant,” and said that the Democrats in Congress must do all they can to block him. Rachel Maddow then referred to Trump as “vengeance minded.” Not much of a honeymoon. \\nI have heard very few complaints about Libertarian candidate Gary Johnson or Green Party candidate Jill Stein. Granted, we don’t really know how many of those who voted for them would have otherwise voted for Hillary, Trump, or stayed home. But, take Michigan, for example. That is the one state that, according to most websites keeping track, still hasn’t been officially called. Trump leads by less than 12,000 votes, while Johnson received 173,000 votes and Stein 50,000. In Wisconsin, Trump won by 27,000, while Johnson received 106,000, and Stein got 31,000. Regarding Florida, Trump won by 120,000, Johnson received 206,000 votes while Stein got 64,000. \\nTrump could have lost Wisconsin and Michigan and still have received enough electoral votes to win. But if he also had lost Florida, Hillary would have won. In Pennsylvania, Trump won by 64,000, while Johnson/Stein won 190,000 votes. Remember Ralph Nader in 2000? He earned the wrath of Democrats forever for supposedly preventing Al Gore from winning Florida. But that anger aimed at third-party candidates doesn’t seem to have caught on this year. Despite the many pleas from Bernie Sanders (I-VT), Hillary, and the Obamas to not vote for third party candidates, many did anyway. \\nAnd now, Republicans dominate the political landscape, with 33 governors, 68 of 99 legislative bodies across the country, the House, the Senate and the White House. The left-wing website Daily Kos has published the best graphics that I found on how dramatic the Republican dominance of the political landscape across the country actually is. Currently Republicans outnumber Democrats in the Senate by 52 to 48. But in 2018, Democrats must defend 25 seats (including the two Independent senators who caucus with the Democrats), while the GOP must defend only eight seats. The Democrats thought that bringing out some big guns—former Sen. Russ Feingold (WI), former Sen. Evan Bayh (IN) and former Gov. Ted Strickland (OH)—would give them control of the Senate. But all three lost. Hillary is being criticized for never having gone to Wisconsin to campaign, overconfident that she would win it. The Democrat blame game and finger-pointing is only beginning \\nHillary never held an open press conference throughout this entire year. It was always controlled situations whenever she met the press. \\nTrump struck a chord with many who haven’t been voting in recent elections through his relentless attacks on the bias and dishonesty of the media, and on the incompetence and corruption of the Obama/Clinton administration. Hillary wrapped herself in Obama’s supposed popularity—he and Michelle certainly worked hard for her victory, at least in the last month or so—but in the end, it was to no avail. His appeal to certain voters didn’t transfer to Hillary. \\nWhat is remarkable about Trump’s victory is what he had to overcome to win. Besides the media, two former Republican presidents, Google, Facebook, Pope Francis, pollsters, a money gap ( reports indicate that Hillary raised $380 million more than Trump), Trump’s inexperience, and the complete panoply of pop culture—from Lady Gaga to Katy Perry to Miley Cyrus; Bruce Springsteen, Bon Jovi, Jimmy Kimmel, Jimmy Fallon, Stephen Colbert, everyone on the Comedy Central Channel, many scripted shows such as “Madam Secretary,” and LeBron James—there was active voter fraud, some of which the Public Interest Legal Foundation has documented . And still Trump won. \\nThe name-calling, caterwauling, crying and disgust will continue on the left, as they figure out how to pick up the pieces and move forward. Roger Aronoff \\nRoger Aronoff is the Editor of Accuracy in Media, and a member of the Citizens’ Commission on Benghazi . He can be contacted at roger.aronoff@aim.org . View the complete archives from Roger Aronoff . 0'"}, "time": 1742628466.420636}