{"duration": 0.03177332878112793, "input_args": {"text": "'In a column for The Huffington Post, this week, a student at Villanova University argued that being polite does not excuse the “racism” of those who are against illegal immigration. [“You heard me saying “oops” as my pencil fell, and you then took a break from writing your notes to help me pick it up. I said “thank you” with a smile you smiled back and said “no problem,” Villanova student Valeria Alvarado began. “When I was absent from class because I was sick, you let me look at your notes so I could catch up. You have even held the door open for me when we both walked out of the building together. I really appreciate the times you have helped me out when I needed it. ”  Alvarado’s column, “To the Racist Guy Who Picked Up my Pencil,” builds up to the thesis that polite acts do not excuse an individual’s underlying racism, which she claims could be seen in Facebook posts that her peer had made such as those that read “building the wall,” “#AllLivesMatter,” and “we cannot tell which refugees are terrorists. ” “This open letter goes out to every racist person who has ever picked up my dropped pencil said “bless you” after I sneezed stopped to ask me how my Christmas break was, has written “happy birthday” on my Facebook wall, has said “good morning” to me as we walk past each other on campus, or has asked me where I got my “cute shirt” from,” she continues. “No smile, compliment, or favor will erase the fact that I know you do not actually want my family and me in this country. ” Comments on the column were quick to point out that those that are against illegal immigration oppose the illegal entry of persons of all ethnic backgrounds. “Leftist (sic) often get criticized for an alleged “If you don’t agree with my views, you’re just a bigot” attitude, and this piece functions as an interesting case study in that mentality,” one commenter said. Another argued that if the author’s attitude was applied to other laws, it would seem absurd: “If I call for harsh penalties for tax fraud, it’s not personal. Learning that you cheat on your taxes doesn’t change my opinion about tax law  —   it changes my opinion about YOU. I can still be your friend, but I’ll think a little less of you. ” Tom Ciccotta is a libertarian who writes about education and social justice for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com,  '"}, "time": 1742628539.746411}