{"duration": 0.04677844047546387, "input_args": {"text": "\"« Previous - Next » Jesus Christ’s ‘Burial Bed’ discovered In 'Chruch Of The Resurrection' \\nIt has long been debated whether Jesus Christ truly existed and walked the earth. The Bible states that God created a miracle that allowed the Virgin Mary first to be alerted by an angel that she would become pregnant without the assistance of her husband Joseph or any other man. The Truth Of Jesus Christ Revealed \\nDirectly after, she became pregnant, and after giving birth, it was a boy who the angel told to name Jesus Christ and he was given just that name. While on Earth, Jesus would walk the Earth and perform miracles for the non-believers while also spreading the gospel to those who would believe in him. He would preach to those who desired him and his teachings, while also healing those who believed he was the only one who could get them into heaven. \\nDespite these actions, debates between scholars of religious, scientists and atheists have long argued whether such events whether took place or whether there is a clear scientific reason for the human race being born such as evolution. The debate still continues today. One finding, however, may shut down the long-lived perceptions of scientists and atheists, due to a recent finding what was believed to be a burial slab. A team in Jerusalem found the slab . \\nIn the Bible, the story reads that after being crucified by the Jewish people he was put in a resting place covered by a rock where the dead were often placed. Upon this happening, three days later the rock was removed, and Jesus' body was no longer there, which correlated with Jesus' proclaiming he would be crucified but come back to life three days later. \\nResearchers are now hoping to study the tomb some more to better understand the history and why and how this tomb would suddenly be found. If enough information is gathered, this can completely reshape history, because the many theories that have been thrown out for hundreds or even thousands of years would be completely negated and Jesus Christ would become the official truth to all people. The belief in science theory would no longer hold any water to the truth of Jesus Christ existing. Evolution would be completely crushed, so this would be one of the grandest findings in the 21st century. \\nThis article (Jesus Christ’s ‘Burial Bed’ discovered In 'Chruch Of The Resurrection') is free and open source. You have permission to republish this article under a Creative Commons license with full attribution and a link to the original source on Disclose.tv Related Articles\""}, "time": 1742563930.935706}