{"duration": 1.5732612609863281, "input_args": {"text": "'Good morning.  We’re trying something new for our readers in Asia and Australia: a morning briefing to   your day.  What do you like? What do you want to see here? Email us with your feedback at asiabriefing@nytimes. com. Here’s what you need to know: • With Election Day looming Tuesday, Hillary Clinton is holding her polling lead and celebrating an announcement from the F. B. I. that its latest review of her State Department email shows nothing in her handling of classified information that would merit further action against her. Donald J. Trump is crisscrossing the country in a   rush. Mr. Trump received a scare at a rally in Reno, Nev. when a person in the crowd shouted  —   falsely, as it turned out  —   that someone had a gun. We’re offering unlimited access to NYTimes. com for the election, from now through Thursday morning. _____ • China’s National People’s Congress issued a rare interpretation of Hong Kong’s   aimed at disqualifying two young   lawmakers from taking office. The intervention could undermine the territory’s judicial system. On Sunday, in a confrontation that recalled the enormous   demonstrations of 2014, the police used batons and pepper spray to drive off thousands of protesters attempting to storm the Chinese government’s Hong Kong headquarters. _____ • American warplanes are flying bombing missions on the Islamic State’s “leadership, command and control and resources” in the group’s Syrian base of Raqqa, while a force of at least 30, 000 Kurdish and Arab fighters marches toward the city. _____ • Schools in New Delhi are closed, construction has been halted, and a   power plant has been shut as the city copes with choking smog for at least another day. Are you there? Let us know how you are coping. _____ • Some 190 countries are members of Interpol, the international police organization based in France. But some  —   notably Russia, Iran and Zimbabwe  —   have used the system’s international “wanted” notices to extend their reach against political foes. A major meeting of Interpol members opens in Bali today with heavy security, after Jakarta, the Indonesian capital, was roiled by enormous protests over a city official’s supposed insults to Islam. _____ • South Korean prosecutors are circling closer to President Park   in the scandal engulfing the Blue House. The country has reacted with fury and shame to revelations that indicate that top leaders have been in thrall to a family of religious charlatans for decades. • Volkswagen’s $15 billion emissions fraud case has reached the top of the company. The chairman of the automaker’s supervisory board, Hans Dieter Pötsch, is being investigated by German prosecutors on suspicion of failing to notify shareholders quickly enough of the financial risks of the diesel emissions cheating scandal. • Apple’s App Store has been infiltrated by hundreds of fake shopping apps that expose customers to potential fraud and identity theft. • Oracle, the software giant, said its acquisition of NetSuite, a cloud storage company, for $9. 3 billion will be completed Monday, ending weeks of negotiations over the price. • Investors will be watching the American election closely. Here’s a snapshot of global markets. • Europe, Iran and Pakistan are forcing hundreds of thousands of Afghan refugees to return to Afghanistan. [The New York Times] • The unexpectedly rapid approval of the Paris climate accord means that negotiators meeting this week in Morocco must speedily sort through a host of technical issues. [Reuters] •   attacks on Hindu sites in   Bangladesh worsened tensions set off by a Hindu youth’s Facebook post showing the god Shiva appearing in Mecca. [The New York Times] • Iranians, some eager to jeer at the “Great Satan,” tuned into live broadcasts of all three debates between Mrs. Clinton and Mr. Trump. [The New York Times] • China’s Guangdong Province has banned exams, homework and writing assignments in kindergartens and ordered schools to make sure students play outdoors for two hours a day. [Asia Times] • Britain’s prime minister, Theresa May, is digging in for a “Brexit” battle if her government loses its appeal of a ruling requiring Parliamentary approval for the move. [The New York Times] • A Philippine court  is expected to rule Tuesday on petitions to block President Rodrigo Duterte’s attempt to transfer the remains of Ferdinand E. Marcos, the country’s former dictator, to a heroes’ cemetery. [The New York Times] • The Philippine boxer Manny Pacquiao’s lopsided victory over Jesse Vargas for the WBO welterweight title was strong enough to revive talk of a rematch with his old foe Floyd Mayweather Jr. • The New York City Marathon was won by Mary Keitany of Kenya for a third consecutive year. A    Eritrean, Ghirmay Ghebreslassie, took the men’s division, becoming the youngest winner in the race’s history. • A   bus being tested in Finland holds promise for reducing city dwellers’ dependence on cars. • Hobart’s Museum of Old and New Art, MONA, opens a new exhibition, “On the Origin of Art,” examining whether art has helped humans survive. The musings of four guest curators  —   “   ”  —   are here. How about a ghost story to start the week? The Mary Celeste, an American merchant ship, set sail from New York on this day in 1872, bound for Italy. About a month later, the vessel was found adrift in the Atlantic, less than two weeks after the last dated entry in the boat’s log. The captain, his wife and young daughter, and the crew were gone. The discovery set off one of the world’s most enduring maritime mysteries. Pirates, mutiny, a waterspout, a seaquake and even a giant squid attack have all been posited. A short story by Arthur Conan Doyle fueled more speculation. Foul play was possible, according to an 1873 account in The Times, citing a bloody sword found on board. Also left behind were personal items and the Mary Celeste’s cargo of denatured alcohol. Missing were navigational tools and the ship’s lifeboat, lending support to a theory put forward in the 2007 documentary “The True Story of the Mary Celeste. ” Some machinery was inoperative, leaving the captain no way to check whether the ship had taken on water in a recent storm. He might have mistakenly thought the ship was sinking and ordered an evacuation. “There’s so much nonsense written about this legend,” the director said when her film was released, adding, “The research goes on. ” Des Shoe contributed reporting. _____ Photographs may appear out of order for some readers. Accessing this version of the briefing should help. Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742563777.4313574}