{"duration": 0.09217715263366699, "input_args": {"text": "'The tens of millions of Americans watching Super Bowl LI Sunday night were treated to a   from   company Airbnb, which launched its #WeAccept ad campaign with a   spot highlighting diversity and multiculturalism. [“No matter who you are, where you’re from, who you love, or who you worship, you deserve to belong,” Airbnb CEO Brian Chesky wrote on Sunday with a link to the #WeAccept campaign, which shows the faces of people of various ages, races, and religions along with the inspiring message.  Former U. S. attorney general Eric Holder  —   who was hired by Airbnb last July “to help craft a     policy”  —   also tweeted about the #WeAccept campaign. “This is who we truly are  —   We work together. We stand together. We are one nation. We are one people. @Airbnb @bchesky #weaccept together,” Holder wrote to his Twitter followers. This is who we truly are  —   We work together. We stand together. We are one nation. We are one people. @Airbnb @bchesky #weaccept together,  —   Eric Holder (@EricHolder) February 6, 2017,  Hollywood and Silicon Valley have heavily opposed President Donald Trump’s executive order temporarily suspending the U. S. Refugee Admissions Program. Super Bowl Sunday saw a series of politicized commercials meant to shine a spotlight on the administration’s immigration policies. But AirBnB’s #WeAccept effort is a longterm campaign, and it’s being spearheaded by Holder, who has already been hired by the California legislature to help lead the legal fight against Trump. In his role at the $30 billion   company, Holder is crafting the company’s   and housing policy, according to Chesky. Airbnb users received an email on Monday morning detailing the company’s intentions to provide housing for 100, 000 people over the next five years, including refugees. “Today we’re setting a goal to provide   housing over the next five years for 100, 000 people in need. We’ll start with refugees, disaster survivors, and relief workers, though we want to accommodate many more types of displaced people over time,” the company’s founders announced. “To help people around the world facing displacement, we’ll work with our community of hosts to find not just a place to stay, but also a place to feel connected, respected, and a part of a community again,” Airbnb says. “In addition, Airbnb will contribute $4 million over the course of four years to the International Rescue Committee to support the most critical needs of displaced populations globally. ” Last year, Airbnb launched a   investigation following charges of racism from black renters who took to social media and shared stories of being turned away by hosts once their race was disclosed. The hashtag “#AirbnbWhileBlack” trended online. Airbnb apologized for the   discrimination complaints and began to enact a series of   policies.   Follow Jerome Hudson on Twitter: @jeromeehudson'"}, "time": 1742564481.2856212}