{"duration": 0.11906909942626953, "input_args": {"text": "'Email \\nAmericans reportedly favor expanding Social Security, while key members of the Republican Party are accused of wanting to let it wither. \\nAn article published October 28 by the Huffington Post , citing data culled from Public Policy Polling survey, reports that 72 percent of Americans support expanding Social Security benefits. \\nAfter highlighting data that they claim prove that all Americans regardless of age and political persuasion favor increasing Social Security benefits, the article explains that this growth should be accomplished by forcing \"the wealthiest Americans to pay their fair share.\" \\nAs an attorney, I was trained to parse phrases, breaking them down into key terms and then defining those words in careful ways so as to reveal the principles and biases upon which the statutes in question reveal. \\nIn the case of the expansion of Social Security, the key word that jumps off the page is \"wealthiest.\" \\nTo me, the threshold question in the analysis of this recommendation is who is to decide what level of affluence would qualify an American as being among the \"wealthiest\" who are the target of the proposed revenue-raising scheme. \\nOf course, as is the case with most of these progressive plans to steal the fruits from the laborer and fence them to the \"needy\" (who, for generations, have been convinced that it is their right to receive such filched funds), there is no mention of the fairness of seizing the property of one group, which thought to prepare for their retirement, to compensate for another group\\'s failure to do so. \\nNext up on the list of terms to define is \"fair share.\" \\nAgain, it is critical to know who is deciding what is the \"fair\" amount \"owed\" by the objects of the fleecing. \\nNot surprisingly, the HuffPo article provides no answers to these key questions. It does, however, indicate how these questions would be answered by the two major party candidates for president. \\nFirst up, Hillary Clinton. HuffPo explains the Democratic nominee\\'s plan for taking more money from the \"wealthy\" to make up for the lack of retirement planning by the rest of us. \\n\"Consistent with the will of the people, Hillary Clinton has pledged to expand, never cut, Social Security,\" the article affirms. \"The Democratic Platform fully backs the same position espoused by Clinton and the American people.\" \\nThe GOP nominee, on the other hand, hasn\\'t signed on to steal the property of one group and give it to another, rewarding the latter\\'s lack of planning and preparation for a pension. Here\\'s the HuffPo portrayal of Donald Trump\\'s take on the purportedly popular plan to expand Social Security: In sharp contrast to Clinton and the Democrats, the Republican Party’s 2016 platform advocates cutting and dismantling, through privatization, our Social Security system. Donald Trump publically [sic] states that he won’t touch Social Security, but his choice of advisors and running mate — not to mention his own past statements and the Platform he controlled — make it clear that, once in office, he would fall in line with Vice President Mike Pence, Speaker Paul Ryan, and other leaders of the Republican Party who claim that they want to “save” Social Security but advocate cutting it. \\nHowever despite HuffPo\\'s claim to the contrary, over the course of the campaign for the White House, Trump has repeated many times that he would not touch Social Security -- much less privatize it -- revealing why the issue is called the \"third rail\" of American politics. \\nThe \"third rail\" analogy comes from railroad where the third rail is the middle rail that is electrified, deadly to the touch. \\nIn politics, then, any issue dubbed a third rail is one that is so controversial that any attempt to fiddle with it in any way would kill the politician making the ill-fated effort at change. \\nTrump, in his own words, has declared his plans for Social Security should he become president. \\n\"They want to cut your social security, I\\'m not cutting your social security,” Trump said in Racine, Wisconsin, on April 2. \\n\"We\\'re gonna save your Social Security without making any cuts. Mark my words,” explained Trump on a trip to Georgia in February. \\nIt appears, then, that neither major party candidate has any plan to eliminate this untouchable region of the soft socialism that is the economic policy of both partners in the duopoly that controls the United States. \\nWhence comes the authority of Congress (or any branch of the federal government) to forcibly seize the property of workers and set up a retirement savings account on their behalf? The quick answer is the Supreme Court. \\nIn the case of Helvering v. Davis (1937), the Supreme Court determined that Social Security deductions from a person\\'s wages was a constitutional exercise of the General Welfare Clause. \\nAs for whether that clause was meant to endow the central government with unlimited authority to tax and spend, in 1792 Congressman James Madison warned: If Congress can apply money indefinitely to the general welfare, and are the sole and supreme judges of the general welfare, they may take the care of religion into their own hands; they may establish teachers in every State, county, and parish, and pay them out of the public Treasury; they may take into their own hands the education of children, establishing in like manner schools throughout the Union; they may undertake the regulation of all roads other than post roads. In short, every thing, from the highest object of State legislation, down to the most minute object of police, would be thrown under the power of Congress; for every object I have mentioned would admit the application of money, and might be called, if Congress pleased, provisions for the general welfare. \\nAnd so they have and there are few brave enough to oppose the perpetuation of the plan. Certainly neither the Democratic candidate for president, nor her Republican counterpart. \\nHow did Americans get to a place where they will be left penniless in their old age? \\nThe socialists, the progressives, and the politicians who pander to them, the \"stagnation of wages\" is to blame for the failure of \"American families to save even for short-term emergencies.\" \\nWhat, though, of the fact that the average American carries over $15,000 in credit card debt. What if the money paid in interest on this debt was set aside for retirement, rather than spent paying interest rates on credit card-financed consumer purchases that, truth be told, have no long-term value and in fact rob the debtor of not only his current financial health, but make his future financial health on life-support, as well? \\nMoreover, consider all of the money that employess “contribute” to Social Security. This amount is actually twice the amount shown on pay-check stubs, since employers are required to match their employees’ “contributions” with their own “contributions” that are part of the cost of employing workers and (in the absence of Social Security) could be paid directly to the employees. Just imagine how big a nest egg workers could accumulate if all of the money now going into Social Security were available to them to save and invest! \\nThere is another proposal for how to restore the happy retirement of an increasingly elderly American population: privatization of Social Security. \\nHuffPo claims that this plan would harm the poorest among us and leave them unable to support themselves in their retirement. Others insist that the poorest pensioners would be the biggest beneficiaries of the privatization of Social Security. \\nHere is an analysis by the Cato Institute: By providing a much higher rate of return, privatization would raise the incomes of those elderly retirees who are most in need. Although the current Social Security system is ostensibly designed to be progressive, transferring wealth to the elderly poor, the system actually contains many inequities that leave the poor at a disadvantage. For instance, the low-income elderly are much more likely than their wealthy counterparts to be dependent on Social Security benefits for most or all of their retirement income. But despite a progressive benefit structure, Social Security benefits are inadequate for the elderly poor’s retirement needs. In addition, the progressivity of Social Security is undermined by differences in life expectancy. Because the wealthy generally live longer than the poor, they receive more total Social Security payments over the course of their lifetimes. In a privatized system, an individual’s benefits would not be dependent on life expectancy. Individuals would have a property right in their benefits. Any benefits remaining at their deaths would become part of their estates, inherited by their heirs. Finally, Social Security drains capital from the poorest areas of the country, leaving less money available for new investment and job creation. Privatization would increase national savings and provide a new pool of capital for investment that would be particularly beneficial to the poor. \\nFinancial sense of this sort would not be enough, of course, to convince the socialists to reconsider their plan to pilfer the wages of the \"wealthy\" and \"charitably\" give it to the elderly poor. \\nWhy? Simple. Their plan is not to take care of the poor, but rather they need to keep the poor poor in order to sell economic salvation to them every election cycle. \\nUltimately, for constitutionalists, the goal is to eliminate Social Security all together and divest the federal government of its role in retirement planning and any other activity over which the states did not grant it authority in the Constitution. Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742628294.1247346}