{"duration": 0.047976016998291016, "input_args": {"text": "\"Hancock speaks a truth that most politicians don't want to hear. Credit: Audio Burst \\nGraham Hancock, a British writer and journalist, has offered some amazing insight into the current election in the U.S. As some are baffled by the number of people Trump has garnered support from, others are more surprised at those willing to vote for someone as allegedly crooked as Hillary. \\nMost citizens are completely over this election and can’t believe that their choices are a racist and misogynistic man who has no knowledge of political policies and a woman who is in bed with foreign regimes and domestic bankers and arms dealers, to name a few. But that is what it has come down to. \\nThose in favor of Trump are increasing, and it’s not because they’re suddenly realizing that they hate people from Mexico or men with awful spray tans. As Hancock stated, \\n“What’s driving [Trump supporters] in America is a deep distrust of authority and a deep distrust of anything that’s connected to the status quo. I’m not sure if politicians really got the message yet, there’s absolute revulsion at them.” \\nWhat Hancock is essentially saying is that a vote for Trump is a vote against the politicians that have been manipulating the system for decades now. It’s an interesting view, and not something that many have considered as they hear the awful words that come of some Trump supporter’s mouths. This movement against the establishment was primarily led by Bernie Sanders, but since he is out of the race, the torch has been somewhat handed to Trump. Hancock went on to say: \\n“It’s a vote against the system that has failed Americans again and again and again…. It’s a global system of control. I think people are aware of that, I think they’re fed up, and I think they want change. Trump is getting support because he’s certainly not part of that. He looks different, he sounds different, he feels different. Bernie Sanders got a lot of support for the same reason. They were saying different things, but both of them were anti-establishment figures. That’s what’s going on here, the establishment itself is losing its grip. We are seeing a kind of crazy chaos resulting from that. We will sort it out; human beings are capable of sorting things out. We don’t need leaders to sort things out, we can sort things out themselves.” \\nDespite this chaos, Hancock views this disillusionment and serious shift as a positive thing and a sign of progress. Now that people are more aware of what is occurring within politics, hopefully the conditions can only improve with each election. \\nWatch Graham Hancock speak with London Real below: \\nWhat are your thoughts on Hancock’s comments?   Graham Hancock Explains Why So Many People Are Pro-Trump And Anti-Establishment  \""}, "time": 1742562949.331592}