{"duration": 0.40810418128967285, "input_args": {"text": "\". 'They Live' — Possibly the Most Powerful Message in a Movie ‘They Live’ is a science-fiction movie from the Eighties that features aliens, a WWF wrestler and a ... Print Email http://humansarefree.com/2016/11/they-live-possibly-most-powerful.html ‘They Live’ is a science-fiction movie from the Eighties that features aliens, a WWF wrestler and a whole lot of sunglasses. What’s not to like? While, at first glance, the movie appears to be a bunch of nonsense, ‘They Live’ actually communicates a powerful message about the elite and its use of mass media to control the masses. Is the movie describing the control of the Illuminati over our society? This article looks at the deeper meaning of John Carpenter’s strange but fascinating movie ‘ They Live ’. Warning: Major spoilers ahead (get over it, the movie is 24 years old). Watching They Live is a conflicting experience. It is an odd combination of eye-opening messages with lackluster acting, powerful social commentary with 1950’s B-movie special effects and gripping satire with odd punchlines. Constantly making viewers oscillate between “Wow, that was genius!” to “Wow, that was corny!”, it is difficult to properly evaluate the movie from a cinematographic point of view. However, from a “message” point of the view, They Live is gold. Based on Ray Nelson’s short story Eight O’Clock in the Morning, the movie is one of those rare subversive stories that forces viewers to question their world and their surroundings. Because, despite the fact that the movie is about ghoulish aliens, it communicates truths to the viewers that are only alluded to in mainstream movies. In fact, looking deeper into the storyline, one might realize that there’s probably more “science” than “fiction” in the story of They Live … especially when one has “truth-seeing sunglasses”.The hero of the movie, played by WWF wrestler Rowdy Roddy Pipper, is a drifter that is apparently nameless. In the short story and the movie’s credits, he is referred to as Nada, which means ‘nothing’ in Spanish. While this nameless nothing is broke and homeless, he still manages to expose the alien’s hidden rule of the world. How did he accomplish that? With the only thing he’d ever need: The Truth. Oh, and also guns. He used a lot of guns. Most importantly, despite the fact that Nada was tempted several times to shut up in exchange for “generous compensation”, he kept his integrity and never agreed to sell out to the aliens. Now, that’s a role model. To top it off, he says the best things ever. “I’m here to kick ass and chew bubble gum … and I’m all out of bubble gum.” Are the aliens in the movie an imaginative way to portray the world’s elite , those who secretly run the world, those we call the Illuminati? Let’s revisit this cult classic and see how it describes the hidden rule of the elite. The Premise Right from the beginning, as we see Nada walking around Los Angeles with his backpack, the movie sets a particular mood: Something is not quite right. While Nada appears to be a happy-go-lucky kind of guy, the city is not happy and it is not too kind to happy-go-lucky kind of guys.Quite the contrary, there is a sense of impending doom in the air: Poverty is rampant, helicopters fly around the city and street preachers speak of soulless beings ruling the world. “The venom of snakes is under their lips. Their mouths are full of bitterness and curses. And in their paths, nothing but ruin and misery. And the fear of God is not before their eyes! They have taken the hearts and minds of our leaders. “They have recruited the rich and powerful, and they have blinded us to the truth! And our human spirit is corrupted. Why do we worship greed? Because outside the limit of our sight, feeding off us, perched on top of us from birth to death are our owners. “Our owners — they have us. They control us. They are our masters. Wake up. They’re all about you, all around you!”. Is the preacher’s description of the “masters” applicable to the Illuminati? I believe so.As we follow Nada’s aimless drifting across the city, the camera often focuses on people gazing blankly at television screens, mindlessly absorbing the vapid messages it communicates. Regular Joes appear to truly enjoy their television shows … until an obscure organization hacks the airwaves to broadcast subversive messages about the hidden rulers of the world. “Our impulses are being redirected. We are living in an artificially induced state of consciousness that resembles sleep. (…) The poor and the underclass are growing. Racial justice and human rights are nonexistent. “They have created a repressive society, and we are their unwitting accomplices. Their intention to rule rests with the annihilation of consciousness. We have been lulled into a trance. They have made us indifferent to ourselves, to others. “We are focused only on our own gain. Please understand. They are safe as long as they are not discovered. That is their primary method of survival. Keep us asleep, keep us selfish, keep us sedated.” Can the above statement be applied to those in power? I believe so.The Average Joes who watch this pirated TV broadcast all get a massive headache – the raw truth is indeed too much for most people to bear. One such viewer switches the channel after telling the guy on TV: “Blow it out your ass”. Just like today, most people do not want to hear about this kind of stuff … they just want to go back to their mindless TV viewing.Nada realizes that the street preacher and the man on television are connected through a local church. When he sneaks into the church, he discovers that it is actually the headquarters of an underground organization.On a wall inside the church is written “They Live We Sleep”, a phrase that describes the fundamental difference between the elite and the masses. Those in power know the truth about the world and possess the means and the power to truly “live”.The rest of the population is sedated, dumbed-down and manipulated into a zombie-like status in order for it to be as easily manageable as possible by the masters. The masses’ ignorance equals a state of endless slumber.Nada learns that the rebellious organization is attempting to recruit people to take down the rulers. However, a few days later, Nada discovers what happens to those who plot against those in power.Helicopters, bulldozers and police in riot gear raid the place, destroy everything and violently arrest the members of the underground organization. That is how the elite responds to contrary views.After witnessing the violent police shakedown , Nada begins to realize that something is wrong in America. The happy-go-lucky guy who believed in working hard and following the rules is starting to believe that something is amiss here.Determined to learn more, Nada re-enters the church and finds a few interesting things.The police painted over “They Live We Sleep”. Obviously, “They” don’t want that message to be known .More importantly, Nada discovers a box full of sunglasses that allows his to see the world as it is. Added bonus: They also look pretty cool. Seeing the Truth While the sunglasses found by Nada appear on the surface to be worthless, they actually provide him with the greatest gift of all: The Truth. When Nada first puts on the sunglasses, the experience is shocking.When he has his sunglasses on, Nada sees through the smoke and mirrors projected by advertisement and mass media . He only sees the core of their message and the only reason why they exist.No matter which magazine Nada flips open, he sees the same subliminal messages, which tells a lot about the true function of “celebrity” and “fashion” magazines.Despite the fact that they are all different, they all ultimately serve the same purpose: To reinforce messages from the elite to the masses. Nada also quickly understands the truth about money . “In God We Trust”? Some people are not human . They are from another race that has infiltrated society. Nada realizes that they are everywhere and that they hold positions of power, like this politician giving a typical “politician” speech on television. Is this a way to portray the Illuminati, or something much-much deeper ?Upon discovering this truth, Nada became pissed off. REALLY pissed off. How did he react to the situation? He did not go home and write a poem about it. Nope, he grabbed a shotgun and started shooting aliens.When the aliens realize that Nada can see through their disguise, they immediately alert the authorities saying “I’ve got one that can see”. Being able to “see” is obviously frowned upon by the aliens – they do not like to be exposed. Nada quickly becomes a social pariah and aliens start closing in on him. Confronted with this situation, Nada says profound and timeless words: “I don’t like this ne bit”.Many aliens are part of the police force as its sole purpose is to ensure that the alien’s rule is not disturbed. Most policemen are however regular humans and just follow the orders because that’s their job … a little like actual policemen who do the Illuminati’s work.Nada and everyone in the city are constantly monitored by flying surveillance cameras that are oddly similar to the new unmanned drones that are currently appearing around the world.Flying surveillance cameras were considered science fiction in 1988. They are reality today.An actual, modern unmanned drone mounted with a video camera.The concept of truth-seeing sunglasses is an interesting way to illustrate the importance of knowledge in one’s world perception. Two people can be looking at the exact same thing yet perceive two very different realities, depending on the level of information and awareness possessed by each person. Nada’s sunglasses can therefore represent one’s knowledge of the truth, which allows a clear perception of reality. Looking for Others Who Know the Truth Upon learning the shocking truth about the world, Nada feels the need to share this vital information with his friend Frank Armitage. Nada however quickly realizes some people do not want to hear about it. In fact, many actually get angry and offended at the simple mention of something that alludes to it. When Nada asks Frank to put on his sunglasses so he can see what he sees, Frank firmly refuses and calls him a “crazy motha…”.Nada replies with another classic line “Either you put these sunglasses on or start eating that trash can”.Then ensues one of the longest one-on-one fight scene I ever seen (eight minutes of punching and kicking), a scene that is dragged out for so long that it becomes utterly absurd and even comical. While the scene maybe appear ridiculous, it says something about the difficulty of making regular, average people wake up from their blissful ignorance.Frank finally sees the truth. All it took is Nada beating the crap out of him, sticking the sunglasses on his face against his will and forcing him to look around. Yes, convincing other people of the truth can be a hard task.It takes a lot of effort on Nada’s part, but Frank finally sees the aliens controlling the world. The two pals are then invited to a secret meeting of the underground organization that is attempting to rid the earth from the aliens.During the meeting, Nada and Frank are given truth-seeing contact lenses. The sunglasses gave truth-seers a nasty headache, especially when they are taken off. When first exposed to the truth, adapting to the new reality can indeed be difficult, and even painful. However, after a while, it becomes seamless part of the person. A little like wearing contact lenses.During the meeting, Nada and Frank learn that humans are being recruited by the aliens in exchange for wealth and power. As the leader of the underground organization says: “Most of us just sell out right away”. It is rather easy to make a correlation between the movie and actual politicians and celebrities we’ve seen in previous articles on this site who readily sell out to the Illuminati in exchange for wealth, power and celebrity.The meeting doesn’t last long, however, as police barge in the place and start shooting everyone there. They are designated a “terrorist organization” by the elite. Nada and Frank manage to escape and accidentally find themselves behind enemy lines, in the alien’s underground base. Behind Enemy Lines While exploring the aliens’ underground base, Nada and Frank stumble upon a party thrown by the aliens for human collaborators to thank them for their “partnership”. Although humans will never be considered equals to the aliens, those who sell out to them get monetary benefits … much like those who are not part of today’s elite who nevertheless sell out to push the elite’s New World Order Agenda . “Our projections show that by the year 2025, not only America but the entire planet will be under the protection and the dominion of this power alliance. The gains have been substantial, both for ourselves and for you, the human power elite.” Frank and Nada then discover the source of the aliens’ brainwashing signals: A television studio. The aliens use the network to broadcast hypnotic and subliminal signals to humans, blinding them from the truth about their rulers and the world. The message that is communicated here: Mass media is the elite’s favorite tool indoctrinate the masses and to keep them in servitude. The TV station ‘Cable 54’ is used by the aliens to hypnotize humans. Is this science-fiction? Barely. Nada realizes that the only way to save humanity from the grips of the aliens is to go to the roof of the TV station’s building and to take down the emitter of the subliminal messages, disguised as a satellite dish. Indeed, without an elite-controlled mass media, indoctrinating the masses will be a lot more difficult. So Nada and Frank start shooting their way towards the roof, not an easy task. The Disinformation Agent While this lady appeared to be nice at first, she tried to mislead, deceive and even kill Nada during his quest. She ends up shooting his pal Frank in the head.Nada met Holly Thomspon, a Cable 54 network executive, at the beginning of his wild rampage. While Nada appears to be somewhat enamoured with her, she always somehow brings trouble. During the “terrorist organization” meeting, Holly infiltrated the group, posing as a sympathizer and claiming that Cable 54 “was clean” and was not the source of aliens’ signal, which was false and misleading. Today, disinformation is widely used by the elite to confuse and mislead those who attempt to discover the truth about the world.During Nada’s rush towards the roof of the network’s building, Holly appears again, claiming that she wants to help him. However, she is simply trying to kill him before the mission is accomplished. She is therefore another human that sold out to the aliens being used to disrupt non-corrupted humans attempting to liberate themselves and others. Taking Down the Aliens Here’s the biggest spoiler of them all: Nada manages to take down the aliens’ transmitter and saves humanity. This heroic move gets him killed, however, as a policeman inside a helicopter shoots him dead. Nada therefore becomes the quintessential hero, sacrificing his life for the good of humanity – a martyr for human freedom from soulless rulers .Even though it cost his life, Nada visibly does not regret exposing the aliens to the world. With his last once of strength, Nada gives the aliens a uniquely human parting gift: the finger.TV viewers around the world now realize that those giving the daily news were also those who controlled them. In Conclusion Although They Live is usually described as “a science-fiction movie that criticizes consumer culture”, the scope of its message actually goes way beyond the usual “consumerism is bad” lecture. They Live can indeed be interpreted as a treatise on the thorough and systematic conditioning of human experience in order for a hidden elite to covertly control, manipulate and exploit the masses. In the movie, the rulers are portrayed as a completely different race that perceives humans as inferior – something that can easily be correlated to the attitudes about the bloodlines of the Illuminati. The presence of these strong messages in the movie is one of the reasons They Live became somewhat of a cult-classic, despite the fact that it was panned by movie critics. As the years go by, the movie’s message is becoming increasingly relevant … and freakishly realistic.Many of those who seek the truth about the world realize that it’s reins are held by an un-elected elite, one that is essentially hidden from the public eye. As the movie’s promotional poster says: “You see them on the street. You watch them on TV. You might even vote for one this fall. You think they’re people just like you. You’re wrong. Dead wrong.” Working behind the scenes, this secretive elite constantly works towards the creation of a global system that would serve its interests: a New World Order , ruled by one world government. As a human collaborator says in the movie to justify his selling-out: “There ain’t no countries anymore. No more good guys. They’re running the whole show. They own everything. The whole goddamn planet!” To facilitate the rulers’ work, the masses are kept in the dark and are distracted with the fake puppet show that is politics and the “no independent thought” programming that is mass media . Apathy, ignorance and indifference are the elite’s best friends.Despite its unimpressive special effects and odd dialogue, They Live manages to describe the world elite’s motives and strategy in a way that can be understood by all. And that is no simple task. However, in order to fully understand the movie’s message, one must be wearing truth-seeing sunglasses. Do you have yours on? Reference: http://vigilantcitizen.com / They Live is available on Amazon. Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related\""}, "time": 1742562438.7286527}