{"duration": 0.058080196380615234, "input_args": {"text": "'Sunday on CNN’s “Reliable Sources,” the Hollywood Reporter’s Michael Wolff defended a recent Newsweek column of his in which he took aim at the media for it’s aggressive coverage of President Donald Trump, including a specific criticism aimed at show host Brian Stelter.  Partial transcript as follows: STELTER: Let me read from your Newsweek column. Let’s put part of it on screen here. You said, “The media strategy is to show Trump as an inept and craven sociopath. The Trump strategy is to show that the media people are hopeful prigs, out of touch with the nation. ” And you mentioned me. You said, “The media correspondent for CNN turns to the camera every Sunday morning and delivers a pious sermon about Trump’s perfidiousness. ” I hope I pronounced that right. Tell me about that particular issue. Do you feel that my style is wrong or my substance is wrong, trying to fact check the president? WOLFF: I think it’s  —   and I mean this with truly no disrespect, but I think you can border on being sort of quite a ridiculous figure. It’s not a good look to repeatedly and   defend your own  . The media should not be the story. Every week in this religious sense, you make it the story. We are not the story. STELTER: There’s room for one hour a week on CNN for this? WOLFF: Listen, I love your show. I just wish you wouldn’t turn to the camera and lecture America about the virtues of the media and every one trying to attack it. The media will be fine. STELTER: The media doesn’t need defending at this moment? WOLFF: The media does not need defending by the media certainly. You know, and so far, the media is  —   I mean, “The New York Times” front page looks like it’s 1938 in Germany every day. STELTER: No, it does not. Give me a break. WOLFF: “The New Yorker” as I say, has left all of its standards behind and now become, you know, an opinion vehicle constantly. Follow Breitbart. tv on Twitter @BreitbartVideo'"}, "time": 1742562230.3714046}