{"duration": 0.21541190147399902, "input_args": {"text": "'SANTA ANA, Calif.  —   Vicente Sarmiento remembers when the local Republican Party here posted uniformed guards at polling stations in a closely fought State Assembly race three decades ago and they hoisted signs in English and Spanish warning that noncitizens were prohibited from voting. The guards were removed after state elections officials threatened legal action. Such tactics would never take place today in this city 35 miles southeast of Los Angeles, where Mr. Sarmiento is now the mayor pro tem. All seven members of the City Council, including Mr. Sarmiento, are Latino, as are 78 percent of the 343, 000 people who live here. (Leer en español) » These days, Santa Ana stands as the face of a new California, a state where Latinos have more influence in everyday life  —   electorally, culturally and demographically  —   than almost anywhere else in the country. There are limits to the transformation here, both in economics, where Latinos still lag far behind the state as a whole, and in politics, where remarkable gains in Latino power have not yet translated to the most powerful statewide offices. But the Latino progress in this state offers a glimpse of how much of the country will probably look in coming decades. Immigrants living illegally in California are entitled to driver’s licenses. Their children can receive   health insurance. Local law enforcement officials generally do not provide information to federal immigration authorities, as they do in many other parts of the country. On a smaller, if no less symbolic, level, the first thing the Santa Ana City Council did when it went   in 2006 was pass a law requiring simultaneous translation of all of its meetings to Spanish. “There is now  —   unlike before  —   a comfort level with knowing there’s a lot of Latinos living here and Latino leadership here,” said Mr. Sarmiento, 52, sitting in the law office he keeps in his house. The signs of demographic and political change are everywhere in a city that is an easy   drive from Disneyland. The historic downtown is clustered around what the official city map calls “Fourth Street,” but everyone here knows as “Calle Cuatro. ” A twirl of the dial on a car radio reveals a choice of   stations. The sidewalks of Calle Cuatro are lined with stands selling churritos and tostilocos. “There’s no attempt to whitewash the city anymore,” said Aurelia Rivas, 26, a student working at her parents’ fruit and snack stand one afternoon. Referring to the annual Day of the Dead celebration, she added, “It’s like everyone knows that Día de los Muertos is going to be just as big and important of a celebration as the Fourth of July. ” The power and presence of Latinos in this community in Orange County  —   itself once a bastion of Republicanism  —   is echoed up and down the California coast. Latinos now make up just under 40 percent of the state’s population, projected to increase to 47 percent by 2050. The leaders of both houses of the Legislature are Latino, as is the secretary of state, the current mayor of Los Angeles and the previous mayor. More than 25 percent of Latino voters in the nation live in California, said Mark Hugo Lopez, the director of Hispanic research at the Pew Research Center. There are 1, 377 Latinos holding state, local and federal office in California, second only to Texas. But Hispanics in Texas are overwhelmingly Democrats in a state dominated by Republicans. In California, the Democrats are solidly in control, and Hispanics are a crucial and growing part of their base and help explain why Hillary Clinton has a huge advantage over Donald J. Trump. “Over the last 10 years, we have really solidified the power, especially in the Legislature,” said Lorena Gonzalez, a Democratic member of the State Assembly from San Diego. “People are more afraid of being seen as not supporting Latinos than supporting them. You see this most clearly with the rhetoric of Republicans here  —   they are falling all over themselves to support Latino candidates. ” The limits to the gains can be glaring, too. The Latino unemployment rate in California was at 6. 7 percent in August, compared to 5. 5 percent overall. More than 23 percent of Latinos in the state live below the poverty level, significantly higher than the 16 percent overall. The disparities are shown in education, as well: 8 percent of Latinos 25 years old or older have bachelor’s degrees, compared to 20 percent overall. And 42 percent of Latino households own their home, well below the statewide homeownership figure of 54 percent. “Latino political power is not the panacea nor does it equate to instant gains overall or lifting people out of poverty,” said Kevin de León, a Democrat and the leader of the State Senate. “The fact that we have political power, I think, means we’ve started that journey. ” Prominent Latinos say that even though the climate has changed markedly, they still encounter reminders of lingering prejudice: in the way some feel they are treated by the police or are scrutinized as they travel through wealthier and whiter parts of Orange County. Anthony Rendon, the Democratic Assembly speaker, said that prejudice can include dismissive stereotypes about Latinos in politics. “There’s a tendency to think that I am only going to focus on certain types of issues, that I am only going to focus on certain types of population,” Mr. Rendon said. “It’s sometimes a surprise that I am concerned about environmental issues. ” And the political successes have their limits. There have only been two Latinos elected to statewide office in California’s modern history, including the current secretary of state, Alex Padilla. Mr. Padilla said the absence of Latinos in statewide elected posts reflected the challenges of running in a state as large as California, rather than evidence of   sentiment. “We’re past that,” he said. “California is a big state. It’s a populous state. It’s difficult and expensive to run in. ” One lingering issue is voting rules. Although Santa Ana has an   City Council, there are no Latino Council members in neighboring Anaheim, even though the city is almost half Latino. Anaheim, like several other communities, elects its Council at large, rather than by district, which tends to put Latinos, who turn out smaller numbers than the general electorate, at a disadvantage. Still, job postings across California routinely require applicants to speak Spanish. Mayor Eric Garcetti of Los Angeles, who is fluent in Spanish, said he makes a point at news conferences of setting aside time to speak to   media. “We are well past the tipping point  —   everywhere,” Mr. Garcetti said. “The shift within 20 years from being the most   state to being the most embracing state for the integration of immigrants has been pretty breathtaking. ” When Cruz Bustamante, a former lieutenant governor, ran for governor in 2003, he came under fire because he would not renounce ties to a Chicano student group, Mecha, or Movimiento Estudiantil Chicano de Atzlan. “That would just not happen now,” Ms. Gonzalez of the State Assembly said. In Santa Ana, the change has stirred debate over what Latino lawmakers should do with their power, and the challenges of dealing with a new minority  —    . About 9 percent of residents here are white, 10 percent are Asian and 1 percent are  . “We also have to be sensitive to   voters,” said Miguel Pulido, the mayor, whose family immigrated from Mexico City in 1961. “We have a case now when the majority became the minority. ’’ But Michele Martinez, a Santa Ana councilwoman since 2007, said the City Council has not done enough to promote the city’s Latino identity. “A lot of my friends, my colleagues, they grew up here in a time when they weren’t allowed to speak Spanish,” she said. “Well, now we’re more than allowed, but we don’t throw it in your face. We’re a little reluctant to be seen as too Latino, and I don’t get that. ” She has tried without success to persuade her colleagues to funnel more money to a local Mexican cultural and art center and help fund the center’s annual Día de los Muertos celebration. This year, local activists pressed the Council to end a longstanding contract with federal immigration authorities to house immigrants who entered the country illegally in the city jail. While the Council voted to phase the contract out over years, Ms. Martinez was the only Council member who voted to end the contract immediately. Mr. Sarmiento argued that one sign of Latinos’ growing power is that elected officials are moving on to broader issues. “We as an   City Council are probably no different from an   Council in that sense that we both want good things for our communities,” he said. “We all want better schools. We all want improved public safety. ” Many date the beginnings of California’s political transformation to a 1994 initiative, pressed by the Republican governor at the time, Pete Wilson, to cut off benefits to immigrants here illegally. The tone of that campaign  —   which many Democrats and Republicans say has been echoed by the appeal of Mr. Trump in this year’s presidential race  —   had the effect of energizing Latino voters and placing this state decisively in the Democratic column. “California has come a long way since then,” Mr. Padilla said. “Political opinion has come a long way since then. Public policy has come a long way from there. I hope the rest of the country will follow that soon. ”'"}, "time": 1742561824.7987018}