{"duration": 0.03521013259887695, "input_args": {"text": "'http://humansarefree.com/2016/11/bombshell-obama-clinton-podesta-soros.html The following information is a new and chilling piece of the Podesta-Clinton email puzzle. It has even stronger connections to pedophilia and Satanism and connects some of the most influential people in the US, including: Barack Obama, George Soros , John Podesta , Tony Podesta, convicted billionaire pedophile Jeffrey Epstein and James Alefantis who is \"one of DC\\'s 50 most powerful people\". You will learn that George Soros donated $20k to \\'Comet Ping Pong\\' pizza restaurant, owned by James Alefantis and where Obama goes frequently and even held a fundraiser. According to one email, Barack \"Obama spent about $65,000 of the tax-payers money flying in pizza/dogs from Chicago for a private party.\" Lady Gaga (left) also attended Marina Abramovic\\'s (right) Spirit Cooking Satanic \"dinner\" (it involves a mixture of blood, semen and breast milk) Pizza and [hot-]dogs are alleged pedophile codes for \"young girls\" and \"young boys.\" You will see more references for yourself and, put into a wider perspective, the codes make sense. In the following infographic, by connecting the people in the \\'Podesta Emails\\' and their alleged \\'pedophilia codes\\' you will see strong references to: sex with children of both sexes and various ages ( pedophilia codes , such as: pizza = young girl, hotdog = young boy, etc.) images from the Satanic \\'Spirit Cooking\\' dinner hosted by \"artist\" Marina Abramovic and attended by John Podesta and his brother Tony, James Alefantis, Lady Gaga, etc. leaked picture of John Podesta making reference to \"elite\" god Osiris, which was murdered and chopped into 14 pieces: references to Moloch, the god of child sacrifice multiple references to murder and cannibalism shady images of children posted by James Alefantis with the already mentioned pedophilia hashtags business logos that are very similar to symbols used by pedophiles to identify sexual preferences pizza restaurants that are possibly connected to this alleged Satanic network of pedophiles and child killers pictures of a metallic coffin pictures of an empty underground room containing the hashtags #killroom and #murder And let\\'s not forget the \"Sacrificing a Chicken to Moloch\" email , where \"chicken\" is believed to be a code-word for \"child.\" You can study the infographic here . By HumansAreFree.com / Exposed: Satanic Pedophilia Network in Australia — It Starts at the TOP, Just Like in the USA and UK  '"}, "time": 1742562809.591308}