{"duration": 0.022048473358154297, "input_args": {"text": "'Former Secretary of State John Kerry defended the Iran nuclear deal on Monday evening at a gala dinner in San Francisco for the Ploughshares Fund, a George   group that was part of President Barack Obama’s “echo chamber” to sell the agreement to the public. [Kerry called the Iran deal’s monitoring processes a “system that’s working,” according to the San Francisco Chronicle, and criticized President Donald Trump and Republicans in Congress for pushing for new sanctions against the Iranian regime.  “It doesn’t make sense, folks, to risk a step that gets us nothing,” Kerry said of proposed new sanctions on Iran’s ballistic missile program, according to the Chronicle. Kerry also blasted the Trump administration for withdrawing from the Paris Climate Accords, the Obama administration’s other major foreign policy legacy. He reportedly defended his 2014 remark that climate change was a “weapon of mass destruction” and a threat to national security. “Scientists, people whose life is invested in this are telling you, ‘This is growing in instability, and the threat is that whole parts of the ice sheet will break off. ’,” Kerry said, according to the Chronicle. As Breitbart News’ Aaron Klein reported a year ago, the Ploughshares Fund has been sponsoring national security coverage at National Public Radio (NPR) since 2005, as well as several think tanks that supported the Iran deal. It is also, Klein reported, funded in turn by George Soros’s Open Society Foundations. NPR’s ombudsman found it had not disclosed Ploughshares funding in reporting on the group and interviewing its president and sponsored experts. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak. Photo: file'"}, "time": 1742562405.8327022}