{"duration": 0.10880279541015625, "input_args": {"text": "'  Gilad Atzmon \\nIt occurred to me in recent years that the act of being progressive is not a political position but rather a mental state. \\nThe incapacity of the entire American progressive and left establishment to foresee Trump’s landslide victory suggests that we are dealing with people who are institutionally detached \\nJust three days ahead of the presidential elections, the Huffington Post pathetically criticised star pollster Nate Silver of “Unskewing Polls in Trump’s direction,” for suggesting that a Trump victory was realistic. Ryan Grim wrote: “HuffPost Pollster is giving Clinton a 98 percent chance of winning, and The New York Times’ model at The Upshot puts her chances at 85 percent.” \\n“There is one outlier, however, that is causing waves of panic among Democrats around the country and injecting Trump backers with the hope that their guy might pull this thing off after all. Nate Silver’s 538 model gives Donald Trump a heart-stopping 35% chance of winning as of this weekend.” \\nThe Huffington Post went as far as accusing Silver of “making a mockery of the very forecasting industry that he popularized.” \\nIn perspectives, Nate Silver and his 538 were obviously spot on. The Huffington Post and The New York Times were totally off the mark. Is it a coincidence? \\nHow is it possible that the Democratic Party, the mainstream media and Wall Street have managed to totally miss the level of anger that unites the American masses. These questions go far beyond polling strategy or the science of statistics. We are dealing with a state of being aloof on the verge of total detachment. \\nLeft and progressive thinking is shaped like a dream. It tells us what the world ought to be. Progressives often seem to forget what the world really is and what its people are really like. Hillary Clinton and her campaign, just like the New York Times and The Huffington Post, were in a state of denial. Boasting in righteous hubris, they failed to read the map. \\nBut this shouldn’t take us by a complete surprise. Detachment wasn’t invented by Clinton and her team. Detachment and alienation are ingrained in progressive thought. To be a progressive is to believe that some of the ‘other’ people are simply a bunch of unaware ‘reactionaries.’ Progressive thought is the secular manifestation of ‘chosenness.’ It is inherently Jewish, a fact that explains why Hillary Clinton’s top five donors were Jewish billionaires . \\nSince being progressive is a form of supremacy. I would go as far as suggesting that progressives’ antagonism towards ‘white supremacy,’ is at large, a form of projection. The progressive attributes to ‘whiteness’ his own exceptionalist inclinations. \\nAmericans vs. Identitarians \\nOn election day, we learned that the Democratic Party was hanging on a thread, hoping to be saved by Florida’s ‘Hispanic vote.’ Clinton’s political future depended upon the hope that Trump had managed to upset enough Latinos. This peculiar development in which a national party is dependent on group politics shouldn’t take us by surprise anymore. \\nThe 2016 American presidential election divided America into two camps: The Americans on one side and the Identitarians on the other. The Americans are those who see themselves primarily as American patriots. They are driven by rootedness and heritage. For them, the promise to make ‘America great again’ confirms that Utopia is nostalgia and that the progressive reality is nothing short of dystopia. The Identitarians, on the other hand, are those who subscribe to progressive sectarian politics. They see themselves primarily as LGBTQ, Latino, Black, Jews, Women, and so on. Their bond with the American national or patriotic ethos is secondary and often non-existent. The future of the Democratic Party, in its current form, depends upon the hope that American subscriptions to sectarian ideologies will gradually increase and, as a result, will eventually strengthen the context of identity or group politics. The progressive agenda banks on the divestiture of the national and patriotic ethos. Needless to mention that half of America voted for Clinton. Hence, this political agenda is far from being farfetched or delusional. \\nBut the Identitarian agenda backfired. It was only a question of time before the so-called ‘whites’ or ‘rednecks’ grasped that their backs have been pressed to the wall. They also started to act and think as an identitarian political sector. Hillary Clinton calling Trump’s voters a “basket of deplorables” was a clear sign for white poor Americans that Hillary wasn’t exactly their ally. However, Hillary was far from being alone. Almost every Jewish writer within the American press didn’t miss the opportunity to attribute the “White Supremacist” label to Trump’s voters. For Cheryl Greenberg, Trump’s popularity was “the final gasping of white supremacy.” For T alking Points Memo’s Josh Marshall , Trump’s closing ad was packed with “anti-Semitic dog whistles, anti-Semitic tropes, and anti-Semitic vocabulary.” For Marshall and Goldberg, half of the American people were dogs obeying their master’s whistle. \\nIt shouldn’t take us by surprise that half of the American people would eventually react. They became weary of Jewish progressives like Marshall and Goldberg seeing them as dogs and white supremacists. The time was ripe for a revolution. \\nSo is the revolution here? I’m not holding my breath. The people who crowned Trump are certainly exhausted. They are ready for a change. Can Trump introduce such a change? No one knows. He is certainly going to keep us entertained. \\nGilad Atzmon is an Israeli jazz musician, author and political activist. His new book, “The Wandering Who,” may be ordered from amazon.com or amazon.co.uk .'"}, "time": 1742563263.9606278}