{"duration": 0.07194042205810547, "input_args": {"text": "'« Previous - Next » The Chronovisor - The Vatican Has A Secret Device To Look Into The Future And Past \\nSeveral paranormal writers and researchers have spoken out about the extraordinary technological capabilities of the Vatican. It has been sensationally alleged that there is an incredible device kept at the heart of the Catholic Church which allows senior members to see future events and events from the past. It has been said that this device is the secret to explaining the continued influence and power of the Church. The Vatican’s attempts to look into the future \\nIt has been said that the device was constructed in the 1950s by a team of twelve scientists led by Father Pellegrino Maria Ernetti. Father Ernetti had worked as a physicist before moving into the papacy. The team was also supported by a number of renowned scientists from outside of the Church including Enrico Fermi and the rocket scientist, Wernher von Braun. Related Articles Chronicles of the Future: The secret diary of someone who saw the future \\nThe machine, which is referred to as the Chronovisor, apparently looks like an oversized cupboard covered with antennas, cathode ray tubes, dials, and levers. While Father Ernetti has refused to reveal a great deal of information about the functioning of the machine he has admitted that it works by processing residual electromagnetic radiations. Using the machine, it has been said that Ernetti viewed one of Napoleon Bonaparte’s speeches, a Greek tragedy called Thyestes and even the crucifixion of Christ . \\nHowever, the Chronovisor has not only been used for historical investigation. In the 1970s, the Vatican decided to use the extraordinary technology to create a rudimentary form of time travel. In the 1970s, it is alleged that people from within the Vatican successfully traveled forward in time to 2013 and where they claim that they saw the Supreme Court building submerged underneath 100 feet of water and significant damage to Washington DC. When this event did not transpire, scientists from within the Vatican suggested that the Chronovisor was not an accurate instrument for predicting the future. It has been suggested that it is only capable of showing one potential outcome of current geopolitical events. Alternatively, it may show realities from alternate universes. \\nWhether this explanation is correct is now impossible to discern as officials within the Vatican have elected to destroy the device, fearing the potential consequences such advanced technology could have for the world. Now it appears that all traces of the machine have been purged from the Vatican archives. Even Father Ernetti made a deathbed recantation of his claims about the capabilities of the machines. However, according to François Brune, it seems likely that he was pressurized into making this retraction by powerful forces within the Catholic Church. \\nThis article (The Chronovisor - The Vatican Has A Secret Device To Look Into The Future And Past ) is free and open source. You have permission to republish this article under a Creative Commons license with full attribution and a link to the original source on Disclose.tv Related Articles'"}, "time": 1742564474.4549737}