{"duration": 0.033495426177978516, "input_args": {"text": "'LOS ANGELES  —   Whether because of Veterans Day school closings, a postelection need to escape into fantasy or an unusually wide range of multiplex offerings, Hollywood had a very good weekend at the box office: Ticket sales in North America were up 47 percent compared with the same weekend last year, according to comScore. The top two movies were holdovers. The superhero movie “Doctor Strange” (Walt Disney Studios) was again No. 1, taking in an estimated $43 million, for a   total of $153 million and nearly $500 million worldwide. The animated “Trolls” (20th Century Fox) sold about $35. 1 million in tickets, for a   domestic total of $94 million. Then came a pair of new films. Paramount Pictures, showing signs life after a dreary run, powered Denis Villeneuve’s understated “Arrival” to roughly $24 million in ticket sales, a strong total that easily surpassed what most analysts had predicted. “Arrival,” a   mystery about a linguist tasked with decoding alien signals, received exceptional reviews, which helped turn out an older audience 85 percent of ticket buyers were over the age of 25. Starring Amy Adams and produced by a team that included Shawn Levy (known for the “Night at the Museum” series) “Arrival” was independently financed by Lava Bear and FilmNation for about $47 million. Paramount paid $20 million for certain rights. “Almost Christmas” (Universal Pictures) arrived to a solid $15. 6 million in ticket sales. A comedic drama with a predominantly black cast, “Almost Christmas” cost about $17 million to make. Reviews leaned toward the negative, but audiences gave the film an   grade in CinemaScore exit polls. Also of note: “Shut In” (Europa) a $10 million thriller starring Naomi Watts that received a    0 percent positive score on the Rotten Tomatoes review aggregation site, arrived to a dismal $3. 7 million in ticket sales “Moonlight” (A24) continued to dominate the   marketplace, generating about $5 million at the box office ahead of its nationwide expansion next weekend.'"}, "time": 1742561930.4041646}