{"duration": 0.04765439033508301, "input_args": {"text": "'5 demonetisation WhatsApp fwds you cannot do without Posted on Tweet \\nChennai, Nov 23 : Regular mainstream media outlets and WhatsApp forwards are great sources of news that are totally unreliable. But WhatsApp forwards are — in ways that mainstream media can never be — more fun. And in the aftermath of the demonetisation, WhatsApp forwards have become absolute riots. \\nIn the spirit of this occasion, we in Crank’s News, who take our irresponsible journalism pretty seriously, have come up with five WhatsApp message that you should be forthwith forwarding to all the groups your are part of so that by tomorrow morning these will be actual news all the newspapers and channels. \\n1) Is demonetisation a monetisation for Adani? \\n“Friends, this is confirmed as fact by a colleague’s cousin who is working as a senior-level secretary in the Finance Ministry. He says the Adanis, who are very close to the Modigovernment, and are actually funding not just the BJP but also the entire government, have recently taken over a chocolate factory in Gujarat. The factory is into the manufacture of all kinds of toffees, candies. These are typically the eclairs-types chocolates that shopkeepers give in lieu of small change. \\nMy colleague’s cousin says that what we take to be the demonetisation move by the Modigovernment is a move to monetise the chocolates that Adanis are now manufacturing. Even in normal times, shopkeepers give these candies for change, and in these change-starved times, this is going to get even more pronounced. \\nSo let us realise what the government is really trying to do here through demonetisationand that rich businessman are the ones calling the shots and cheating poor gullible public. Those who think that demonetisation is a sweet news may not know the real fact. \\nThe above is a fwd from another group”. \\n2) India the first country to abolish rich and corrupt totally \\n“Forward this to all the other patriotic Indians: \\nAccording to a recent report in the US magazine Business Insider, India has now become the first country in the world to have abolished the rich people (sic) and officially every one in India is middle-class now. \\nThe report, quoting latest statistics from the IMF, has said that Modi’s masterstroke demonetisation has totally made all Indians, including the poor and the rich, truly middle-class, along with those who are already middle-class. The magazine has also quoted Frank X McNamara, the ‘inventor of credit cards’, as saying that India’s Prime Minister NarendraModi has pulled off what all economists of the world have been wanting to do for long. The use of credit cards will increase and there will be no difference between the rich and the poor as both will be in huge debts”. \\n3) How Modi brought Ratan Tata and Naval chief to fall in line \\n“Interesting True Story This: \\nA friend’s wife was standing in a long queue in front of an ATM in South Bandra, Mumbai. Standing next to her were two well-dressed gentlemen who quietly went about minding their own business. There were murmurs of discontent from some others in the line at having to stand in the queue for withdrawing their own money. \\nHearing this one of the two gentlemen, smiled quietly, and said that standing in a line is a good way to understand the value of hard-earned money. To this the other well-dressed person agreed wholeheartedly and said that there are also people out there on the high seas without any access to ATMs. We are actually lucky to have ATMs near where we live. \\nThe first gentleman, who nodded his headed in approval, said that is very true and introduced himself to the other. ‘I am Ratan Tata,’ he said. The other offered his hand in a firm handshake and said, ‘I am Sunil Lanba. I work in Indian Navy. I am its Chief Admiral’. \\nThe rest in the line went silent after this. \\nFriends, this is true simplicity. And thanks Modi for making the country understand this. \\nSend this to your near and dear to make them feel inspired”. \\n4) Trump to outsource management of US economy to Modi \\n“India’s contribution to the world economy is economy: \\nAfter years of Indians looking in awe of the Americans, now the tide has turned in favour of India. It is no secret that American President (sic) Donald Trump always likes to follow the footsteps of Prime Minister Narendra Modi. Trump had used the same technique in campaigning that Modi used to defeat Sonia to get the better of Hillary Clinton. Trump understood that both Sonia and Hillary Clinton were essentially both women and hence copied the same strategy. \\nAnd now comes the most interesting part. With India’s economy being the fastest growing one in the entire world and the US economy struggling, there are expectations that Trump may ask Modi’s help, and if need be demeonetise US currency, to help shore up his country’s economy. Both dollar and rupee, if Trump has his way, may start sharing the same symbol soon. \\nEconomy, which comes from the ancient Sanskrit word ‘eko’ which means ‘one’ and ‘nomy‘ that signifies ‘currency’, may soon have one single currency as predicted by our scholars who gave economy to the world. \\nMODI truly is Man Of Demonetised India” \\n5) Urjit Patel and Mukesh Ambani are twins FaceOff: Urjit Patel and Mukesh Ambani presenting different facial features to hide the fact that they are actually twins. \\n“What your mainstream media will not tell you? \\nHow many of you in the group know that RBI Governor Urjit Patel and Reliance Chief Mukesh Ambani are not only related but are actually twins? \\nWhat your mainstream media will also not report is that Rajdeep Sardesai’s wife Sagarika Ghose, who writes every anti-Modi story that you find in all newspapers, is actually the long-lost granddaughter of former Prime Minister Indra Gandhi. \\nHere is the proof. Check their hairstyles: \\nSend these to all Indians who truly believe they are Indians”.'"}, "time": 1742628493.7781062}