{"duration": 0.25373315811157227, "input_args": {"text": "'Matthew McConaughey has two movies out this month. In one, he gives voice to an animated koala who organizes a singing contest. In the other, he plays a schlubby dreamer turned jungle adventurer. The details are not important. The main thing is, the movies will keep him in the public eye  —   talk shows, awards ceremonies, magazine covers  —   continuing the    McConnaissance that went into effect when, in a   move, he gave up   for more challenging fare. But if you think of him as a mere movie star, you’re wrong. His work with the directors Martin Scorsese, Steven Spielberg, Christopher Nolan, Richard Linklater and Steven Soderbergh has served to provide him cover. Mr. McConaughey has really been a guru all along. Over a period of more than 20 years, almost unnoticed, he has been building a religion of sorts. Call it the Tao of Matthew McConaughey. He preaches to his flock largely through the media of men’s magazines and television commercials. Take the Lincoln campaign. Mr. McConaughey didn’t need a free car when he began pitching the Lincoln MKC in 2014. What he did need was a platform to get his message across. So while other   pitchmen (like Jon Hamm, George Clooney and Jeff Bridges) play the game with just enough enthusiasm to earn the huge paychecks, Mr. McConaughey goes deep. “Sometimes you gotta go back to actually move forward,” he says in an early Lincoln ad while cruising a dark empty freeway. “And I don’t mean going back to reminisce or chase ghosts. I mean go back to see where you came from, where you been, how you got here. ” Perhaps knowing we are weak of spirit and doubting his words, he adds reassuringly: “I know there are those that say you can’t go back. Yes, you can. You just have to look in the right place. ” His work with Lincoln made him a hot enough property in the advertising industry that Wild Turkey signed him not only as the face of its brand but also as the creative director for a new series of commercials. His first spot, “The Journey Begins,” is set, no surprise, in a bar. The lights are low. The mood is mellow. We hear Mr. McConaughey’s voice: “We’re not in a rush to be most popular. ” Pause. “Not in a rush not to be. ” We follow an elegant woman carrying a glass of Wild Turkey deeper into the space. Suddenly, there is an   blast of a tuba. A bar that was quiet only seconds earlier is now a wild roadhouse, filled with the sounds of the Hot 8 Brass Band, whose members mix freely with twirling dancers, and we are reminded that a tenet of the McConaughey worldview is to stay loose, to remain open to any sudden change. Once we have grown accustomed to the new surroundings, the woman leaves the bar behind for the outdoors. The sun is setting behind distant peaks. Mr. McConaughey has led us, in mere seconds, from the noisy pleasures of civilization to the tranquillity of nature. “Real bourbon, no apologies,” he says in the  . “If it’s for you, you’ll know. ” This would seem to be a natural ending. But Mr. McConaughey has one more twist in store: A bright moon appears in a night sky, we hear sweet music, and guess who is sitting at a grand piano situated, incongruously, on an expanse of grass? Mr. McConaughey himself, unshaven,   surrounded by revelers. Through his person, it seems, the untamed and the more refined have come together in a harmonious whole. “Ahhhhh,” he says. “Thank you!” The commercial is a distillation of McConaugheyism disguised as an enticement to drink. Listen to your own inner tune. Go where it takes you. The good things you discover along the way, you were meant to discover. Tomorrow’s hangover? You were meant to have that, too. Readers of men’s magazines are often seeking a guide, a mentor, a hip professor. And Mr. McConaughey comes through in one cover story after another. Not only does he have pectorals that look like “a pair of toasted dinner rolls,” as GQ once wrote, but also a questing mind that cannot be tamed. “Every time you think you’ve reached the end of that long   street, you slip around the edge, past that stopping point,” he said in Esquire in 2011. “And at the end of your life, all the things you thought were periods, they turn out to be commas. There was never a full stop to any of it. ” In a 2012 Men’s Journal interview, he tackled the eternal question of fate versus free will: “Everything we do in life is part of a plan. Sometimes you learn what that plan is today, sometimes you learn about it tomorrow and sometimes it takes you years to figure out. ” Lest he seem too New   he added a dollop of Ayn Rand to his philosophical brew in a 2013 GQ profile: “I’m a fan of the word ‘selfish,’” he said. “‘Selfish’ has always gotten a bad rap. You should do for you. ” He does not shy away from the charged subject of masculinity. “Man is never more masculine than after the birth of his first child,” he said in his most recent Esquire  . “I don’t mean in a macho way. I mean in terms of giving a man strength. ” It goes down easy because Mr. McConaughey remains something of a good ol’ boy who likes his Shiner Bock and comped tickets at the   line. A foundational part of his myth is the 1999 night when he was booked on a charge of suspected marijuana possession after he was arrested at his home in Austin, Tex. where he was dancing naked and playing the bongos at 3 a. m. (Who knew joy was against the law?) Years later, in an Esquire interview, he was calling himself “spiritual,” only to correct himself and say that the word spiritual was “a dodge. ” “I’m religious,” he said. “I like that word. You can use it. ” In his 2014 Oscar acceptance speech, he thanked God explicitly, saying, “He has shown me that it’s a scientific fact that gratitude reciprocates. ” That was before he said his hero is himself, Matthew McConaughey, but 10 years in the future, so that there is always “somebody to keep on chasing. ” His   the first book he says he read cover to cover, is “The Greatest Salesman in the World” by Og Mandino. It tells the tale of 10 ancient scrolls and a trader named Hafid, who reveals their wisdom. Like all sages, Mr. McConaughey can be hard to follow. Confronted with his words, you may feel like Woody Harrelson’s character in “True Detective,” trapped in a car as Mr. McConaughey’s Rust Cohle speaks in riddles. But for all its mystery, McConaugheyism is not a hair shirt religion. In fact, for a number of years now, as his fans and friends have noticed, it has decreed avoiding shirts whenever possible. “I worked hard to live in Malibu, California,” he told GQ in 2014. “I’m going to the beach! I’m gonna go surfing! No, I don’t want to wear a shirt. I want to get a tan and feel the sun on my bones. ” He’s not about abnegating life’s pleasures. He likes the Dolce  Gabbana suits, the Lincolns, the evening glass of bourbon. Trust the universe and it will provide. That seems fundamental to the McConaughey way. He has been saying it one way or another since he burst onto the scene in 1993 as Wooderson in “Dazed and Confused. ” It is said that he improvised Wooderson’s famous line, “Just keep livin’. ” He has since adopted it as a motto and even named his foundation after it. He was a guru from the  . A year before the film’s release, he wandered into the bar of the Hyatt Regency Austin, where he happened to meet a producer. The chance encounter helped win him the role in “Dazed and Confused,” which led to his breakout in “A Time to Kill. ” Soon enough, Vanity Fair was hailing him as the next Paul Newman. “Why did I go to the bar?” he asked a writer from The Austin Chronicle in 1995. “Why did I stay there late that night? Why did this bartender with the same name as me tell me there was a producer in the bar who was working on a movie?” Why did any of us go into that bar? In the McConaughey belief system, it was destiny. He went into that bar in 1992 so that, in 2015, he could sit on a stage inside the University of Houston’s football stadium and offer the graduating class (and all of us, via YouTube) this   utterance: “If there’s one thing that you can depend on people being, it’s people. ” Since he joined with Lincoln in 2014, Mr. McConaughey has dispensed many such nuggets of wisdom. But with the latest Lincoln commercial, which has no   he has gone deeper into the mystic. This is   messaging, and it presents us with a new figure: Silent McConaughey. Like certain Buddhist monks, like Thomas Merton and the Trappists, like Kramer on Season 9 of “Seinfeld,” Mr. McConaughey seems to be reaching for enlightenment through quietude. The ad, titled “Midnight” and directed by J. C. Chandor, opens at night, inside a modern home in the Hollywood Hills with glass walls and jetliner views. Mr. McConaughey, well groomed in a dark suit, looks as if he is back from a catered affair. He walks with purpose through the living room, toward a patio with an infinity pool. We see mountains. A sky full of glowing stars. A twinkling metropolis below. Mr. McConaughey gazes at the paradise he has won for himself. It seems he wants us, his followers, to have it, too. He stops at the edge of the pool. He turns around slowly. Then there is a cut to another McConaughey, who is driving alone at night through a long tunnel. Then we return to the pool. Back to the tunnel. And back to the pool. Is the tunnel scene a flashback to a McConaughey who existed at an earlier moment that same night? Is it perhaps a flash forward to a future McConaughey, similar to the one he chases but is never able to catch? Or do the two McConaugheys exist simultaneously, like Schrödinger’s cat? Tight shot of Mr. McConaughey, still fully clothed, at the pool’s edge. He smiles. What does it mean? He springs into a reverse back dive, and he breaks the water’s surface just as the McConaughey at the wheel of the Lincoln emerges from the tunnel and speeds toward the horizon. In this chaotic world, he seems to be telling us, find a moment to be still. Reflect. But don’t get so caught up in reflection that you cannot make a bold, blind leap of faith  —   into the water, toward the horizon. Mr. McConaughey has been speaking his message long enough. His followers know it by heart. Now he has gone beyond words.'"}, "time": 1742564430.4607112}