{"duration": 0.03166913986206055, "input_args": {"text": "\"Share on Facebook A recent video released by a LiveLeak source shows a staged car bomb explosion followed by what I call must-watch jaw-dropping crisis actor fakery. The video is said to be in Iraq. The video shows a man busy doing something by the car. He then walks away from the car, gets into another car where at least one person is waiting for him before they drive off. Seconds after driving off, the car is seen to explode violently. That's not the important part. What follows is however. Immediately following the explosion crisis actors are seen quickly running into position, finding well-spread-out spots on the ground to lie down and pretend to be injured from the explosion. The video gets better though as coaches are seen guiding the crisis actors into position and waving in the “suddenly appeared” emergency medical workers. The crisis actors are seen pretending to be in agony and unable to carry their own weight. The video leaves one wondering if you should laugh, cry or get angry. This is another reminder that fakery is now the norm. Propaganda is legal here in the United States and it's a tactic commonly used by essentially all nations. Shockingly, many Americans today STILL cannot reconcile that this degree of fakery is now the norm. Because of this unwillingness to accept the degree of fakery we are seeing all the time now they continue to believe that unless you have overwhelming proof that mainstream media stories are not true you must believe that the stories are legitimate. This is simply no longer true. Sadly, because of this profound and persistent unwillingness to accept the new paradigm we now live in (that of standard fakery) many continue to keep themselves in a state of extreme mental vulnerability to state lies and propaganda. Those who refuse to see the in-your-face fakery of today, as clearly seen in the below video, are thus helping the ruling elite stay in power longer and helping keep humanity dumbed down. For those who refuse to see the fakery this video may offer a cure.\""}, "time": 1742563404.957962}