{"duration": 0.6152939796447754, "input_args": {"text": "'The anxiety began well before the Cleveland convention, where the candidate of the “Forgotten Men,” the one who declared Americans “the greatest Race on the face of this old Earth,” seemed likely to clinch his party’s presidential nomination. Doremus Jessup, the protagonist of Sinclair Lewis’s 1935 novel “It Can’t Happen Here,” sees something dark and terrible brewing in American politics  —   the potential for “a real fascist dictatorship” led by the    populist candidate Berzelius Windrip. Friends scoff at this extravagant concern. “That couldn’t happen here in America, not possibly!” they assure him. But Jessup, a   Vermont newspaper editor and a “mild, rather indolent and somewhat sentimental liberal,” worries about the devastation ahead. “What can I do?” he agonizes night after night. “Oh  —   write another editorial    I suppose!” When Election Day comes to pass, Jessup learns that his editorials have not done the trick. The reality of the new situation feels unspeakably awful, “like the   passing of a friend. ” Jessup faces the presidential inauguration in a state of high distress, convinced that the nation is careering toward its doom, but that nobody  —   least of all his fellow liberals  —   can do much to stop it. “It Can’t Happen Here” is a work of dystopian fantasy, one man’s effort in the 1930s to imagine what it might look like if fascism came to America. At the time, the obvious specter was Adolf Hitler, whose rise to power in Germany provoked fears that men like the Louisiana senator Huey Long or the radio priest Charles Coughlin might accomplish a similar feat in the United States. Today, Lewis’s novel is making a comeback as an analogy for the Age of Trump. Within a week of the 2016 election, the book was reportedly sold out on Amazon. com. At a moment when instability seems to be the only constant in American politics, “It Can’t Happen Here” offers an alluring (if terrifying) certainty: It can happen here, and what comes next will be even ghastlier than you expect. Yet the graphic horrors of Lewis’s vision also limit the book’s usefulness as a guide to our own political moment. In 1935, Lewis was trying to prevent the unthinkable: the election of a   candidate to the presidency of the United States. Today’s readers, by contrast, are playing   scrambling to think through the implications of an electoral fait accompli. If Lewis’s postelection vision is what awaits us, there will be little cause for hope, or even civic engagement, in the months ahead. The only viable options will be to get out of the country  —   or to join an armed underground resistance. Lewis’s second wife, the journalist Dorothy Thompson, provided much of the inspiration for “It Can’t Happen Here. ” In 1931, she interviewed Hitler, scoffing at his “startling insignificance” when encountered   . Back in the United States, Thompson interviewed Huey Long, who had vowed to challenge Franklin Roosevelt for the presidency in 1936. She noted that Long’s populist message and swaggering style reminded her of Hitler, and according to Lewis’s biographer, Richard Lingeman, Lewis took the message to heart. A recent Nobel Prize winner, known for his superhuman productivity, Lewis churned out the entire manuscript of “It Can’t Happen Here” between May and August of 1935. The novel arrived in bookstores that October. By that point, some of the immediate threat had passed. (On Sept. 8, 1935, Long was assassinated at the Louisiana State Capitol, one of the great political traumas of the 1930s.) Lewis’s book nonetheless sold 320, 000 copies, becoming his most popular work to date. Reviewers agreed that the book’s success had little to do with its literary merits though “a vigorous   tract,” one critic noted, it was “not much of a novel. ” What propelled its popularity was a sense of urgency, the worry that the United States  —   like the nations of Western Europe  —   might contain dark forces yet to be unleashed. A slightly different sense of urgency seems to be fueling the book’s latest surge in popularity. We have already experienced some of what Lewis describes in the first third of the book: a blustery populist candidate rising, against all odds, to the presidency of the United States. Now the great question is whether or not we are moving into Lewis’s terrifying future. The novel’s Everyman candidate, Berzelius (Buzz) Windrip, is hardly a perfect   for Trump. A creature of the Great Depression and a Democrat, Windrip sweeps into office as a   promising $3, 000 to $5, 000 for every “real American family. ” His movement style evokes the   of Nazi Germany rather than the anonymous jabs of the Twitter mob. Still, there are enough points of resonance to cause palpitations in the heart of any anxious   liberal. Like Trump, Windrip sells himself as the champion of “Forgotten Men,” determined to bring dignity and prosperity back to America’s white working class. Windrip loves big, passionate rallies and rails against the “lies” of the mainstream press. His supporters embrace this message, lashing out against the “highbrow intellectuality” of editors and professors and policy elites. With Windrip’s encouragement, they also take out their frustrations on blacks and Jews. The architect of Windrip’s campaign is a savvy newsman named Lee Sarason, the novel’s closest approximation of Steve Bannon. It is Sarason, not Windrip, who actually writes “Zero Hour,” the candidate’s popular jeremiad on national decline. Sarason believes in propaganda, not information, openly arguing that “it is not fair to ordinary folks  —   it just confuses them  —   to try to make them swallow all the true facts that would be suitable to a higher class of people. ” This is where the novel comes to rest by Inauguration Day: Through a combination of deception and charisma, the feared Windrip ascends to the presidency while the nation’s liberals tremble. It is only after the inauguration, though, that “It Can’t Happen Here” takes a truly dark turn. Upon moving into the White House, Windrip immediately declares Congress an “advisory” body, stripped of all real power. When members of Congress resist, he locks them up without the slightest semblance of due process, the beginning of the end for American democracy. The rest of the book describes one long, disorienting nightmare, a national descent into labor camps and torture chambers and martial law. The novel gains its energy from Jessup’s internal struggle, his regret at having done so little to stop it all while he still could. “The tyranny of this dictatorship isn’t primarily the fault of Big Business, nor of the demagogues who do their dirty work,” he realizes. “It’s the fault of Doremus Jessup! Of all the conscientious, respectable,   Doremus Jessups, who have let the demagogues wriggle in, without fierce enough protest. ” With this heavy hand, Lewis seeks not only to satirize American liberals, but to induce them to pay attention before it’s too late. While the book skewers Jessup’s passivity, however, it does little to suggest viable modes of engagement under the Windrip regime, short of abandoning home and family and fleeing to Canada. Every time Jessup attempts some modest act of resistance, he is met with the ruthless repression of the state. When Jessup prints a righteous editorial, Windrip’s goons arrest him and murder his   . Jessup ends up as a   in a concentration camp, beaten down but determined to carry on. Six months into his sentence, he escapes and joins the underground movement percolating in Canada  —   where, the book implies, he should have gone in the first place. The one bright spot for the   forces is that things don’t work out particularly well for anyone else. Windrip never follows through on his pledge to restore prosperity and redistribute wealth, fueling conflict with his early supporters, who mostly end up dead or in jail. Even Windrip himself gets little of what he wants. As president, he insists on absolute obedience, “louder, more convincing Yeses from everybody about him. ” After two years of this treatment, his crafty aide Sarason maneuvers the president into exile, only to be deposed himself a month later in a military coup. By the book’s closing pages, Jessup has returned to the United States as a disciplined resistance fighter, organizing armed rebellions throughout the Midwest. His transformation illustrates Lewis’s most powerful message: When it happens here, everyone should be prepared to resist. But Jessup’s story also underscores how difficult it can be to sort out what to do at moments of swift political change and social confusion. In our brave imaginations, we undoubtedly do the right thing when fascism comes to America. In reality, we might not recognize it while it’s happening.'"}, "time": 1742628478.008976}