{"duration": 0.07721710205078125, "input_args": {"text": "'PR Newswire October 27, 2016 \\nTUCSON, Ariz. , Oct. 25, 2016 /PRNewswire-USNewswire/ — Concerns about Hillary Clinton’s health have been subdued after her three debate performances. She presented her ability to survive 4-and-a-half hours on a stage with Donald Trump as proof of sufficient stamina to serve as commander-in-chief. \\n“She evidently intended this as a joke, although I suspect our combat veterans would not be amused,” states AAPS executive director Jane Orient, M.D. \\nVideos are, however, circulating on the internet, from her rather brief and rare appearances in public, which are purported to show pathological eye movements. \\n“These are quick, episodic, and inconsistent,” states Dr. Orient, who is an internist. “So we decided to ask doctors on our email list to have a look at one of the videos . A helpful tool is to paste the URL into http://RowVid.com and watch it at half or quarter speed.” \\nNearly two-thirds of respondents said they saw abnormal movements. Only 15% did not, and 21% were unsure. There are long segments in which the eye movements appear normal. \\nAbout 60% of those who saw abnormal movements thought “the cause could be a potentially disabling neurological condition,” and none of them were willing to say that it isn’t. \\nSuch movements signify an abnormality in portions of the brain that coordinate the eye muscles. There is a long differential diagnosis. Possibilities the respondents suggested include increased intracranial pressure (she is at risk for that because of her history of head trauma and a transverse sinus clot); a drug effect; or a chronic degenerative neurological condition. Parkinson’s disease is mentioned—with drug treatment concealing most manifestations but causing the eye signs. \\nDoctors were asked which tests would be helpful, and 37 responded . The most common one was a full neurological examination by unbiased specialists, including a neuro-ophthalmologist. \\n“A neuro-ophthalmologist could do a structured examination, but it might be normal at a moment in time. The video clips need to be explained,” stated Dr. Orient. “A cardiologist might do an electrocardiogram that is perfectly normal—but he will also look at a 24-hour monitor that may show a transient life-threatening rhythm disturbance.” \\nA collection of additional clips in slow motion has been posted. \\n“As Hillary revealed to the public, perhaps illegally, the President may have only four minutes to respond to a nuclear threat,” said Dr. Orient. “The public needs to know whether she is concealing a serious, progressive illness that may impair memory, reasoning, alertness, or ability to think quickly at a critical time.” \\nThe Association of American Physicians and Surgeons (AAPS) is a national organization representing physicians in virtually all specialties and every state. Founded in 1943, AAPS has the motto “omnia pro aegroto,” which means “all for the patient.” \\nSOURCE Association of American Physicians and Surgeons (AAPS) Tags:'"}, "time": 1742563908.9987228}