{"duration": 1.4735081195831299, "input_args": {"text": "'CHAPEL HILL, N. C.  —   André Leon Talley is eating a biscuit. He shouldn’t be eating a biscuit because he is on a long, difficult sojourn here through the holidays at Duke Diet  Fitness Center to try to lose 100 pounds and stop associating food with love. And biscuits are his Proustian madeleines, evoking all the love he got from his grandmother growing up in humble circumstances in nearby Durham. But André has been going through a rough patch with his friends, and he needs a bit of carb comfort, as we listen to the morning medley soundtrack of Dean Martin and Frank Sinatra in the lobby of the genteel Siena Hotel before he heads off to Duke for a more spartan breakfast in a   cafeteria. It’s my fault, too, because I’m pressing him on a sore subject he is reluctant to discuss: Melania Trump. The       Monsieur Vogue, as he is known, cloaks his voluminous red puffer coat over his mountainous form, so that only his big brown eyes and navy Filson knit cap are showing. “First of all,” he says, well aware of my fashion ignorance, “this is a Norma Kamali sleeping bag coat. ” Then he offers his declaration: “You make the choice to be in Trumpland or you make the choice to eject yourself from the horror of Trumpland. I’ve made my choice not to be part of Trumpland. ” But, I point out, Donald Trump was bragging on the trail only the day before that he had just had a meeting with André’s Vogue compadre and fellow Hillary supporter Anna Wintour. At first, André has a hard time believing that Ms. Wintour would venture anywhere near the dreaded Trump Tower. I have to actually show him the story and get it confirmed with the Trump spokeswoman Hope Hicks. But finally he shrugs under his puffery. “As for Anna Wintour going to Mr. Trump, she’s a powerful woman, she’s running an empire, she’s the editorial director of Condé Nast,” he says. “We can’t judge her for going to a meeting. She’s a professional, powerful woman. That’s all I have to say. ” I have flown here to see if André can shed some light on Melania, the sultry enigma of Trumpworld, the only reserved member of what is shaping up to be the most bellicose takeover in modern times. As everyone else rushes in to blow up the capital, as Ivanka shops for houses in Georgetown and office space at the White House, as headlines cascade about how Ivanka will be the real first lady, Melania has virtually disappeared. We see more of her doppelgänger on “Saturday Night Live” than we do the real Slovenian Sphinx, who is hanging back in New York so her    son, Barron, can finish the school year. Melania’s absence from the stage has not stopped a raging battle in the fashion world about her  —   a sequel to the boycott during the campaign against Ivanka’s brand and a microcosm of the fight being replayed across the country about whether to “normalize” the Trumps or whether to keep shouting from the rooftops, “This is not normal! ,” as my colleague Charles Blow urged this week. André’s friend Tom Ford said he was not likely to dress the former fashion model and future first lady because “she’s not necessarily my image. ” (Ford once spent time after a Helmut Newton memorial trying to get Melania to do something about the Donald’s hair, but Melania merely murmured in her Gabor accent, “I like him the way he is. ”) Marc Jacobs told Women’s Wear Daily that he would rather put his energy “into helping out those who will be hurt by Trump and his supporters. ” The French designer Sophie Theallet, a favorite of Michelle Obama’s, published an open letter saying she would not dress Melania to protest Donald Trump’s “rhetoric of racism, sexism and xenophobia. ” Other designers, like Tommy Hilfiger and Carolina Herrera, have riposted that they would be proud to dress the Trump women. It is a particularly sensitive matter since Melania follows Michelle, beloved by the fashion world, as The New York Times’s Vanessa Friedman wrote recently, for elevating the industry “beyond the superficial to the substantive,” by framing clothing “as a collection of values: diversity, creativity, entrepreneurship. ” As David Yermack, a professor of finance at New York University, noted, Michelle was also a bonanza, generating $2. 7 billion in a single year for the companies she showcased. André has particular insight into Melania’s style since, while on Vogue assignment, he went to couture shows with her in Paris and helped her choose her Dior wedding gown, and later flew with her in   splendor on the Trump plane as Donald scarfed down Oreos and talked about how Jude Law was no Cary Grant. As André told me in the fall when I interviewed him, he came away impressed with the Trump women. He called Melania charming and private, “soignée and polished” with “impeccable” manners and legs that are “a long drink of water,” and said she had a gift for standing on      stiletto heels. “She’s very much like a high, super, superglamorous Stepford Wife,” he told me. He also said that she was the most fastidiously groomed and exquisitely moisturized person he’d ever met. (He now gives that honor to Kim Kardashian West.) At the    wedding, which he attended with Ms. Wintour, he noticed that “even then you could tell that Ivanka was going to be a very bright star. She had on a   dress. ” But André walked into a sartorial buzz saw when, amid buzz that he might be called on to give Melania advice about her Inaugural gown, he echoed some of those sentiments recently to a Daily Mail reporter, saying that Melania was “a wonderful person to be with” and that she “will be one of the great stars in the administration. ” He capped it off with optimism: “I hope there will be a great, great Trump presidency. ” It didn’t take long for the guillotine to fall. One friend emailed him, “Oh my God, you have gone to the Evil Empire! !!!!” He agonized about the “tragedy of ruptured friendships” to me in an email, saying about Melania: “She’s a nice person. I do not endorse Trumpism on any level. So why can’t one be positive and want her to shine? I mean, it’s good she cares about napkins, crystal, dinner plates with gilded edges to the point of over the top, and abundant flower arrangements. In the end, why pick on her when they should be picking on her husband’s billionaire cabinet and his seeming readiness to turn the country back towards oppression,     etc. ” As we sit in the hotel lobby, he muses: “I’m not a big person in the world. I’m maybe a big figure in the fashion world. I mean, sort of iconic. But I don’t want to get phone calls in the middle of the night, telling me I’ve gone over to Trumpland and I’m going to Darth Vader because I said nice things about Melania. I voted for Hillary Clinton. I registered in North Carolina because it mattered. I went through hoops of fire to get my absentee ballot. And, quite frankly, I thought she would have brought back the pantsuit. I thought the gray trouser suit designed by Ralph Lauren she wore with the purple satin shell and the lapels matching the blouse was brilliant. The elegant anthracite gray dry wool actually was slimming. “Melania, who opted at 3 a. m. for a palazzo jumpsuit, with one arm exposed and a flounce over the other  —   it seemed to me too    a huge,   jumpsuit. Trying too hard. And I am so tired of the long hair falling on both sides of her face. She has to upgrade her coiffure. ” But isn’t he worried that many of those on the left who complain about Trump as a dictator are acting dictatorial? Not one good word can ever be said about anything that happens for the next four or eight years? Is it fair to hold Melania and Ivanka responsible? Or are they putting a lovely gloss on some of Trump’s unsavory rhetoric and actions? “Listen, Melania made her choice,” he replies. “She married the man, so she’s got to go with the territory. She’s Mrs. Trump. ” I remind André that he told me that, at the 2005 wedding, it seemed as if “Donald Trump was a cool guy. ” “He became the master of darkness, the master of the dark empire, as he became more powerful, as he started with birtherism and in the campaign,” André says now. “Birtherism is terrible. It was a terrible thing he did to Obama. And he never let go. ‘Make America great again.’ A lot of people think that means make America white again. ” I say that a friend of mine, the writer David Israel, is now calling it the   House. “People are really afraid of these dark, dark institutions of bigotry and   that have come out from under the rocks like creepy snakes and come up to rear their heads up like cobras,” André agrees. “People seem to have put all their egregious things on the back burner. Melania plagiarized Michelle Obama’s speech. Let’s just wait and see what happens on Jan. 20. I don’t want Trump to fail, and I don’t want Melania Trump to fail. But I’m not going to sit here and say any more positive things, because I’d get crucified from personal friends. ” So the Trumps should never get a full measure of respect? “Did the Congress ever treat Obama as a president?” André snaps back. “Did they plot in a restaurant the night he was inaugurated to filibuster everything for eight years? This country has elected a president who is on audiotape saying I’m a star and I can do whatever I want with women, grab them in the vagina. Dignity has gone out the door. He’s causing me much ire. He just said, ‘My cabinet has the highest I. Q.’ His cabinet of mostly white men. That’s a dog whistle. ” Trump had come down to the bouquet of microphones the day before with Kanye West, whose wedding André had attended and praised as even more astonishing than the Trump wedding because the rehearsal dinner was at Versailles, not just a Florida ballroom gussied up to look like Versailles. But even Kanye’s visit did not impress André. “Listen to me,” he instructs. “There is a lot of marzipan here. Marzipan is the glaze you put on a cake, a superficial glazed layer. It’s all marzipan, it’s all optics. ” Speaking of optics, I tell André that the mother of a Times colleague I met at the White House Christmas party said she didn’t mind that Melania had been a model, noting that Betty Ford worked as a model. And she didn’t care if she had been an “adventuress” seeking a wealthy husband. But she did not like Melania’s photo shoot of racy pictures with another woman, and felt she could not accept her as first lady because of that. “You can’t judge a person by pictures,” André responds. “She was a model. She took pictures. ” I mention that it’s passing strange that Melania’s project is fighting cyberbullying when her husband is a cyberbully. André rolls his eyes. André’s favorite first ladies are Michelle Obama and Jackie Kennedy. Of Jackie he says, “I would have loved to give her advice, even about what to wear to the beach. ” The night before, we had a tasty   dinner of grilled salmon, broccoli and eggplant at the diet and fitness center’s cafeteria. This is André’s fifth time here. I asked him if it was true that Anna Wintour and Oscar de la Renta once had an intervention with him about his weight. “Absolutely,” he said. “Anna Wintour called an intervention in the conference room at Vogue one morning. And I was escorted downstairs by a fellow staff member to one of the executive dining rooms. And I said to this person, ‘Am I about to be fired for something?’ And I walked into the room, and there was an intervention going on. And Oscar and his wife and Anna Wintour and my minister, Reverend [Calvin O.] Butts, had been called into the room. They were ready to send me to the Duke Diet  Fitness Center the very next day, and they’d already made the reservation. But, of course, I angrily rejected it because I was emotionally not ready to come, so I got up and I quietly left the room. ” About a year later, he finally made the decision himself to come to Duke and left straight from the Trump wedding at    on a Sunday afternoon. When he was a child, his grandmother worked every day to support him, cooking, washing and ironing. But on Sunday mornings, she would make him a special pan of biscuits and “the best” chocolate cake. “So my weaknesses are anything I associate with childhood, which I associate with love,” he said. But he is weaning himself from bread and sugar and has already lost 28 pounds. I made one last attempt to press him for an idea of what Melania will be like compared to other first ladies. We know there will be opulence. We know that she loves Valentino and Chanel and Manolo and fur and diamonds and that she doesn’t like prints or going without makeup. When Melania did the Vogue cover, the writer Sally Singer said that the bride of Trump, compared in the piece to a Bond girl, had “a slightly   idea of femininity” because she refused to pose for Mario Testino without makeup or perfectly styled hair. “She has those impossibly high   towering stilettos,” André said. “Clearly, her clothes will cling in the right places, accentuate her figure and her   long tresses. Get ready for   waists, hourglass silhouettes and pencil skirts. She is already into   which Jackie Kennedy wore by Oleg Cassini. Melania likes monotone matching coats and beige dresses, but that hair will always be flying once she goes down the stairs of Air Force One. “She’s very private. She just wants to be a mother. It’s very similar to Jackie O, who also wanted to keep her kids out of the fray. When Barron was first born, she used to say: ‘I’m going off to play with Barron. I just want to spend time with Barron.’ So, in a way, I think that she’s maintaining her privacy with him and maintaining a kind of dignity because she’s not making statements. I don’t think that she would try to change the White House in any way. I don’t think that’s what she’s interested in. ” She never tried to modify the gaudy ’80s gilt in the   Trump Tower penthouse or the rushing fountain in the middle  —   a style of décor described by the Trump biographer Timothy O’Brien as Louis XIV on acid. As André has noted, Melania is not “a disrupter. ” But Trump is. “I wish them the best,” André said. “I want suddenly to see that she has incredible style, wake up and say, ‘Oh my God, look, isn’t that great?’ I really do think that there’s hope. We have to wait and see. As Sergei Diaghilev told Jean Cocteau, ‘Astonish me.’ ”'"}, "time": 1742563793.9590743}