{"duration": 0.07809209823608398, "input_args": {"text": "'WASHINGTON  —   Rafael Nadal, who has not played a match since withdrawing from the French Open in May because of a wrist injury, sounded a note of optimism that his recovery would allow him to compete in the Rio Olympics, after he missed the London Olympics four years ago with a different injury. “Although, as I always say, there is nothing certain in this life,” Nadal told reporters in Majorca on Wednesday. The uncertainty surrounding the Rio Olympics has become more pronounced in tennis, with four top players in the last five days having announced that they will skip the Games, now only two and a half weeks away. Two men,   Milos Raonic and   Tomas Berdych, and two women,   Simona Halep and   Karolina Pliskova, expressed concerns over Zika, which had been largely minimized by players who answered questions about the virus during the French Open and Wimbledon. “I concluded that the risks are too high for my career and for my health, especially as a woman,” Halep said in a statement on Facebook. “Family is much too important for me and I can’t risk not being able to have one of my own after my career in tennis is over. ” Berdych, who reached the Wimbledon semifinals, said previous tournaments had kept him too busy to think about the Olympics until recently. “Obviously, I’ve known about the virus a long time, since when it all started,” Berdych said Tuesday at the Citi Open in Washington. “But of course the season was going on” Berdych, who said he hoped to compete in the 2020 Olympics, said that he could not justify the risks that he saw to his life after tennis. “I’m going to play two, three, four years, and then the rest of my life will be another 60 years, something like that,” Berdych said. “If something happens that makes that not the way you want it, because of one week or one tournament, you might have a sad life. No, I don’t think so I don’t want to take that risk, even if the risks are possibly small or whatever. ” Although several male players removed themselves from Olympic consideration because of a desire to focus on ATP events  —   which Raonic also cited in an interview after his initial announcement  —   only one player had mentioned Zika before late last week as a reason for not traveling to Brazil. That was Alexandr Dolgopolov, who pulled out in June and cited Zika as a particular concern giving his existing medical concerns, which include Gilbert’s syndrome, a liver condition. Concerns over Zika had been discussed privately, however. Horia Tecau, who had planned to play mixed doubles with Halep, a fellow Romanian, before she announced her withdrawal, said that Halep had expressed concerns weeks ago about the virus. Tecau, who still hopes to qualify for the mixed doubles event with a   partner, said the withdrawals by Halep and other athletes had disappointed him, especially given what he sees as the relatively low risk posed by the virus. “When I keep hearing about this virus, if you sit down and think about all the stuff that we go through during the year, with everything that’s happening in the world now, there’s a lot of risk everywhere,” Tecau said. “I think this Zika virus is a very small percentage out of that risk. It’s not a solid enough reason. ” As an example of overblown concern, Tecau pointed to a report from the United States State Department about concerns regarding the Olympic Games that the ATP had distributed to players. While 20 of the 33 pages focused on crime and security, less than one page focused on Zika. Other players are also confident. Denis Kudla, an American, expressed faith in organizers’ preparedness and said, “It’s going to take a lot more than that to not go to the Olympics. ” Brazilians, such as Bruno Soares, a doubles champion at this year’s Australian Open, have been outspoken about assuaging the panic over the virus. “It’s not the end of the world or something like this,” Soares said. “I feel like it’s a little bit of my duty just to try to inform people. ” Soares has cited the   ATP event in Rio de Janeiro in February, when mosquitoes are in season, as reason for his fellow players to be at ease. “So many guys came to me in the last swing in Europe saying, ‘What’s the real situation over there? ’” Soares said. “International media is just making such a huge thing out of it. I’m saying: ‘Listen, guys: I’m from Brazil. We played the Rio event in the summer, when the mosquitoes are way worse  —   they don’t really grow during winter  —   and there was zero cases.’ If you go to Brazil, there’s no worry about that. People are just living normal lives. ” Others remain concerned over the mixed signals. Samantha Stosur, an Australian, said she was “absolutely, 100 percent going” but admitted that she had more questions about these Games than about the three previous Olympics she had attended. Eugenie Bouchard, a Canadian, remains undecided. “I don’t know if anyone knows enough about it to really give a good opinion on whether, as athletes, we should go or not,” Bouchard said. “I just don’t know if the health of my future babies is worth it. So that’s what I’m trying to decide in my head. ” Sloane Stephens of the United States said that she had received conflicting medical advice but that she planned to go  —   and to pack the mosquito nets she had already bought. “One doctor I talked to said, ‘You shouldn’t go, because we don’t know what’s going to happen,’ and yada, yada,” Stephens said. “And some other doctors are like, ‘You know, if this is your dream and you want to go play the Olympics? Go. ’’”'"}, "time": 1742564300.8644958}