{"duration": 0.01872110366821289, "input_args": {"text": "'Get short URL 0 9 0 0 Venezuela\\'s National Armed Forces Council, the principal body for consultations on defense issues, will be working on a regular basis amid the ongoing protests of the opposition, dissatisfied with the current leadership, Venezuelan President Nicolas Maduro said Wednesday. \\nMEXICO CITY (Sputnik) — On Tuesday, the opposition-led National Assembly voted to initiate impeachment proceedings against Maduro , claiming he had violated democracy, to which the president accused lawmakers of trying to stage a parliamentary coup . © AFP 2016/ Ronaldo SCHEMIDT Rival Factions to Rally Across Venezuela as Impeachment Crisis Escalates \\nEarlier on Wednesday, opposition leader Henrique Capriles initiated a large-scale peaceful protest across the country to defend the nation’s right to a referendum on Maduro\\'s recall. According to media reports, police in some Venezuelan cities started to use tear gas against the opposition protesters. \"I want us to start a continuous session, to take into account this issue [of political tension ]… with more wisdom and with the widest possible evaluation criterion,\" Maduro said at a Council meeting, as quoted by the AVN news agency. The leader did not specify how often the Council would be convened. © AP Photo/ Ariana Cubillos Venezuela On-Edge as Right Wing Attempts Soft Coup on Maduro \\nMaduro also expressed regret that the Council meeting was not attended by President of the National Assembly Henry Ramos. \"It is a pity that the president of the National Assembly continues to show lack of respect for the Constitution, and does not want dialogue. Here is his empty chair, I hope that he will start to act sensibly, because we need to strengthen democracy.\" \\nVenezuelan opposition has been seeking a referendum to remove Maduro from office. The process to collect signatures for a petition on his recall was halted last week on accusations that the signature gathering was rigged. ...'"}, "time": 1742628508.6878912}