{"duration": 0.06134676933288574, "input_args": {"text": "'UPDATE: Fox News has officially cut ties with Bill O’Reilly. Through the network’s parent company 21st Century Fox, the Murdochs issued a statement on Wednesday afternoon: “After a thorough and careful review of the allegations, the Company and Bill O’Reilly have agreed that Bill O’Reilly will not be returning to the Fox News Channel. ”[In another statement released on Wednesday, the network announced that the new primetime   will be Eric Bolling at 5pm Martha MacCallum at 7pm Tucker Carlson at O’Reilly’s old 8pm timeslot The Five with   Kimberly Guilfoyle, Dana Perino, Bob Beckel, Greg Gutfeld, Jesse Watter, and Juan Williams at 9pm and Sean Hannity will remain at 10pm.   FOX NEWS: TUCKER CARLSON TO MOVE TO 8PM SLOT, THE FIVE SHIFTS TO 9PM pic. twitter.   —   Oliver Darcy (@oliverdarcy) April 19, 2017,  *** The Murdoch family has reportedly decided to pull The O’Reilly Factor off air amid allegations of sexual harassment against   host Bill O’Reilly, and will soon be officially announcing his departure, according to sources close to Gabriel Sherman in New York magazine. According to Sherman, the decision was primarily driven by Rupert Murdoch’s sons, James and Lachlan, after The New York Times reported earlier this month that $13 million has been paid out from either Fox News or O’Reilly to five women to settle their sexual harassment claims against the host in lieu of litigation, despite O’Reilly’s denying the veracity of their claims. Fox News executives are reportedly meeting on Wednesday to discuss how to contain any damage from an O’Reilly dismissal. O’Reilly, who is currently on vacation, has hosted the network’s most popular show  —   The O’Reilly Factor  —   since the network’s inception in 1996 and remains the country’s   cable news host. Sherman reports that “the board of Fox News’ parent company, 21st Century Fox, is scheduled to meet on Thursday to discuss the matter. ” Decisions are now being made as to whether O’Reilly will be allowed a final show to bid farewell to his audience. They are also discussing the terms of his release, with O’Reilly recently having signed a new   $20 million a year contract. Executives within the company are also discussing who will fill O’Reilly’s primetime 8 pm slot, with hosts such as Eric Bolling, Dana Perino, and Tucker Carlson currently under consideration. Over 90 companies dropped advertising on The O’Reilly Factor over the allegations, while a small group of feminist protesters gathered outside the Fox News headquarters in New York calling on the network to fire O’Reilly. Last year, Fox News’ longtime chairman Roger Ailes resigned over claims of sexual harassment against several female staff members, including former hosts Gretchen Carlson and Megyn Kelly. You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com '"}, "time": 1742562450.0540586}