{"duration": 0.17815089225769043, "input_args": {"text": "'Friday during his “ ” segment on Fox News Channel’s “Hannity,” host Sean Hannity declared former FBI Director James Comey “humiliated” the media.  Hannity, referring to Comey as “J. Edgar Comey,” pointed to parts of Comey’s testimony debunking reports of Trump   collusion. Watch: Transcript as follows: So in a shocking turn of events, one of the biggest losers from yesterday’s   Comey testimony was the   propaganda media. We’re going to break down just how James Comey humiliated the mainstream press and why they are now facing a massive credibility crisis in tonight’s  . So yesterday, the former FBI director James Comey, J. Edgar Comey, told the Senate Intel Committee that many of the media’s Russian collusion stories are just dead wrong. Watch this. (BEGIN VIDEO CLIP) JAMES COMEY, FORMER FBI DIRECTOR: There have been many, many stories partly based on classified information about lots of stuff but especially about Russia that are just dead wrong. The challenge, and I am not picking on reporters, about writing stories about classified information is the people talking about it often don’t really know what’s going on. (END VIDEO CLIP) HANNITY: Now after that testimony, even Mr. Thrill up his left Chris Matthews, he himself came to this stunning conclusion. I was even shocked. Take a look. (BEGIN VIDEO CLIP) CHRIS MATTHEWS, MSNBC HOST: The assumption of the critics of the president, of his pursuers you might say, is that somewhere along the line in the last years the president had something to do with colluding with the Russians, something to do, a helping hand, encouraging them, feeding their desire to affect the election in some way, some role they played, some conversation he had with Michael Flynn or Paul Manafort or somewhere. And yet what came apart this morning was that theory. (END VIDEO CLIP) HANNITY: “Pursuers. ” Now, the black helicopter crowd, the tinfoil hat Russia conspiracy theories being pushed by the media, the   media, have now come apart at the seams. Now, it’s all been wrong. They have been lying to you, the American people. Of course, MSNBC was not the only outlet having to backtrack. “The Hill” is reporting that, quote, “CNN issues correction after Comey’s statement contradicts their reporting. ” And even ABC was also forced to update a story following Comey’s remarks. And then, of course, there is the paper of record,   paper record, The New York Times. They were singled out yesterday for being flat out wrong, I would argue again. Take a look. (BEGIN VIDEO CLIP) UNIDENTIFIED MALE: That report by The New York Times was not true. Is that a fair statement? COMEY: In the main, it was not true. UNIDENTIFIED MALE: On February 14, The New York Times published a story the headline of which was “Trump campaign aides had repeated contacts with Russian intelligence. ” You were asked earlier if that was an inaccurate story and you said: “in the main. ” Would it be fair to characterize that story is almost entirely wrong? COMEY: Yes. (END VIDEO CLIP) HANNITY: “The New York Times” are desperately trying to save face, fist issuing a tweet that reads, quote “We are looking into James Comey’s statements, and we will report back with more information as soon as we can. ” And then later, publishing a full article entitled “Comey disputes “New York Times” article about Russia investigation,” where they tepidly stood by their reporting and openly wondered why Comey rebuked their coverage. I guess we won’t be holding our breath for a full retraction or apology. So despite some widespread embarrassment for all these people in the   media following the Comey testimony, do think we can ever expect them to stop spreading their fake news? In other words, land the black helicopters and get back to reality? Or will the crisis and credibility continue to grow? Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742562719.4797719}