{"duration": 0.10707950592041016, "input_args": {"text": "'Le e-mail di Hillary Clinton e la Fratellanza di Thierry Meyssan L’indagine dell’FBI sulle e-mail private di Hillary Clinton non verte su una negligenza in merito alle norme di sicurezza, ma su un complotto mirante a distrarre ogni traccia delle sue corrispondenze che avrebbero dovuto essere memorizzate sui server dello Stato federale. Potrebbe includere scambi su finanziamenti illeciti o su casi di corruzione, e altro sui collegamenti dei coniugi Clinton con i Fratelli Musulmani e i jihadisti.\\nRete Voltaire | Damasco (Siria) | 2 novembre 2016 ελληνικά English Español français Türkçe русский Deutsch Português Hillary Clinton e il suo capo di gabinetto Huma Abedin. Il rilancio dell’inchiesta dell’FBI sulle e-mail private di Hillary Clinton non verte tanto su questioni di sicurezza, quanto su intrighi che potrebbero andare fino all’alto tradimento.\\nTecnicamente, anziché utilizzare un server sicuro del governo federale, il Segretario di Stato aveva installato nel suo domicilio un server privato, in modo da poter utilizzare Internet senza lasciare tracce su una macchina dello Stato federale. Il tecnico privato della signora Clinton aveva ripulito il suo server prima dell’arrivo del FBI, così che non era possibile sapere il motivo per cui lei avesse messo in opera questo dispositivo.\\nInizialmente, l’FBI ha osservato che il server privato non aveva subito la procedura di sicurezza del server del Dipartimento di Stato. La Clinton aveva quindi commesso solo un errore di sicurezza. In un secondo tempo, l’FBI ha sequestrato il computer dell’ex parlamentare Anthony Weiner. Costui è l’ex marito di Huma Abedin, capo dello staff di Hillary. Lì sono stati trovati messaggi di posta elettronica provenienti dalla Segretaria di Stato.\\nAnthony Weiner è un politico ebreo, molto vicino ai Clinton, che aspirava a diventare sindaco di New York. Fu costretto a dimettersi dopo uno scandalo assai puritano: aveva inviato SMS erotici a una giovane donna diversa da sua moglie. Huma Abedin si separò ufficialmente da lui nel corso di questa bufera, ma in realtà non lo lasciò.\\nHuma Abedin è una statunitense allevata in Arabia Saudita. Suo padre gestisce una rivista accademica – di cui è stata per anni la segretaria editoriale - che riproduce regolarmente il parere dei Fratelli Musulmani. Sua madre presiede l’associazione saudita delle donne che fanno parte della Fratellanza e ha lavorato con la moglie dell’ex presidente egiziano Mohamed Morsi. Suo fratello Hassan lavora per conto dello sceicco Yusuf al-Qaradawi, predicatore dei Fratelli Musulmani e consigliere spirituale di Al-Jazeera.\\nIn occasione di una visita ufficiale in Arabia Saudita, la segretaria di Stato visita il collegio Dar al-Hekma accompagnata da Saleha Abedin (madre del suo capo di gabinetto), presidente dell’Associazione delle Sorelle che fanno parte della Fratellanza. Huma Abedin è oggi una figura centrale nella campagna elettorale clintoniana, accanto al responsabile della campagna, John Podesta, ex segretario generale della Casa Bianca sotto la presidenza di Bill Clinton. Podesta è inoltre il lobbista ufficiale del Regno dell’Arabia Saudita al Congresso, per la modica cifra di 200 mila dollari mensili. Il 12 giugno 2016, Petra, l’agenzia di stampa ufficiale della Giordania, ha pubblicato un’intervista con il principe ereditario saudita, Mohamed bin Salman, nella quale affermava la modernità della sua famiglia che aveva illegalmente finanziato circa il 20% della campagna presidenziale di Hillary Clinton, anche se si tratta di una donna. Il giorno dopo questa pubblicazione, l’agenzia ha annullato questo servizio e ha assicurato che il suo sito web era stato violato.\\nSecondo l’agenzia di stampa giordana Petra (12 giugno 2016), la famiglia reale saudita ha illegalmente finanziato il 20% della campagna presidenziale di Hillary Clinton. La signora Abedin non è l’unica componente dell’amministrazione Obama ad aver legami con la Fratellanza. Il fratellastro del presidente, Abon’go Malik Obama, è il tesoriere dell’Opera missionaria dei Fratelli in Sudan e presidente della Fondazione Barack H. Obama. Lavora direttamente sotto il comando del presidente sudanese Omar al-Bashir. Un Fratello musulmano è membro del Consiglio di Sicurezza Nazionale, la più elevata istanza esecutiva negli Stati Uniti. Dal 2009 al 2012, è stato il caso di Mehdi K. Alhassani. Non si sa chi gli sia succeduto, ma la Casa Bianca aveva negato che un Fratello fosse membro del Consiglio fino a quando non emerse una prova. È inoltre un Fratello l’ambasciatore degli Stati Uniti alla Conferenza islamica, Rashad Hussain. Gli altri Fratelli identificati occupano funzioni meno importanti. Occorre tuttavia ricordare Louay M. Safi, attuale membro della Coalizione Nazionale siriana ed ex consigliere del Pentagono.\\nIl presidente Obama e il suo fratellastro Malik Obama Abon’go nello Studio Ovale. Abon’go Malik è il tesoriere del lavoro missionario dei Fratelli Musulmani in Sudan. Nell’aprile 2009, due mesi prima del suo discorso al Cairo, il presidente Obama aveva segretamente ricevuto una delegazione della Confraternita allo Studio Ovale. Aveva già invitato, in occasione del suo insediamento, Ingrid Mattson, la presidente dell’Associazione dei Fratelli e delle Sorelle Musulmani negli Stati Uniti.\\nDa parte sua, la Fondazione Clinton ha impiegato come responsabile del suo progetto \"Clima\" Gehad el-Haddad, uno dei dirigenti mondiali della Fratellanza che era stato fino ad allora responsabile di una trasmissione televisiva coranica. Suo padre era stato uno dei co-fondatori della Fratellanza nel 1951 in occasione della sua rifondazione da parte della CIA e dell’MI6. Gehad ha lasciato la fondazione nel 2012, quando al Cairo divenne il portavoce del candidato Mohamed Morsi, e in seguito quello ufficiale della Fratellanza Musulmana su scala mondiale.\\nSapendo che la totalità dei leader jihadisti nel mondo sono emersi sia dalla Fratellanza sia dall’Ordine sufi Naqshbandi - le due componenti della Lega islamica mondiale, l’organizzazione saudita anti-nazionalista araba - vorremmo saperne di più sulle relazioni della signora Clinton con l’Arabia Saudita e i Fratelli.\\nSi scopre che nella squadra del suo sfidante Donald Trump, ci trova il generale Michael T. Flynn, che ha cercato di opporsi alla creazione del Califfato da parte della Casa Bianca e si è dimesso dalla direzione della Defense Intelligence Agency (Agenzia d’intelligence militare) per rimarcare la sua disapprovazione. Gli si affianca Frank Gaffney, un \"reduce della guerra fredda\", ormai qualificato come \"cospirazionista\" per aver denunciato la presenza dei Fratelli nello Stato federale.\\nVa da sé che, dal punto di vista dell’FBI, tutto il sostegno alle organizzazioni jihadiste sia un reato, indipendentemente dalla politica della CIA. Nel 1991, la polizia – nonché il senatore John Kerry - avevano causato il fallimento della banca pakistana (benché registrata nelle Isole Cayman) BCCI, che la CIA utilizzava in ogni sorta di operazioni segrete con i Fratelli Musulmani e anche con i cartelli latini della droga.\\nThierry Meyssan Traduzione\\nMatzu Yagi\\nFonte\\nMegachip-Globalist (Italia)'"}, "time": 1742562661.7771275}