{"duration": 0.07886815071105957, "input_args": {"text": "'When I was a lieutenant colonel on active duty, I supervised an officer in the U.S. Air Force who was (and is) an Iraqi-American. He came to the US as a boy after President George H.W. Bush’s call to the Shia to revolt against Saddam in the aftermath of Desert Storm, which was ruthlessly suppressed by Saddam as Bush and company did nothing.\\nAs an Iraqi-American in uniform, he served as an interpreter attached to the 101st Airborne in Iraq in 2004, if memory serves–dangerous times indeed for US troops in Iraq.\\nHe wrote to me, rightly outraged, after Ben Carson made his anti-Muslim comments back in September of 2015 during the presidential primary season. It made him so sad, so angry, as a US Air Force veteran and as a Muslim-American to hear such ignorance, such bias, such Islamophobia. And it made me angry as well.\\n\\nSo many Muslim-Americans have served this country with distinction, troops like Navy veteran Nate Terani, who has written an eloquent article at TomDispatch.com on the prejudice he faced as an Iranian-American. Terani is doing his best to fight a new enemy, Islamophobia, the irrational fear of Islam fed by the unhinged rhetoric of candidates like Ben Carson and Donald Trump.\\nHere is how Terani puts it in his article :\\nIn Iran, theocratic fundamentalists sowed division and hatred of outsiders–of Westerners, Christians, and other religious minorities. Here in America, the right wing seems to have stolen passages directly from their playbook as it spreads hatred of immigrants, particularly Muslim ones. This form of nationalistic bigotry–Islamophobia–threatens the heart of our nation. When I chose to serve in the military, I did so to protect what I viewed as our sacred foundational values of liberty, equality, and democracy. Now, 20 years later, I’ve joined forces with fellow veterans to again fight for those sacred values, this time right here at home. \\nAs America builds walls and weapons and wages war all over the globe, as our leaders look outward for enemies, we’re forgetting the enemy within America, the enemy that is a much more serious threat to our national security. That enemy, which exists right here in America’s heartland, is ignorance, hatred, fear, aggression, compounded by a cowardly desire to “get even” and to “make America great again” by ostracizing other Americans who are considered “different” and “untrustworthy.”\\nBut spreading fear and bigotry is not a way to national security; it’s a way to national insanity. Islamophobia, like all other irrational fears, must be fought and defeated.\\nWilliam J. Astore is a retired lieutenant colonel (USAF). He taught history for fifteen years at military and civilian schools and blogs at Bracing Views . He can be reached at wastore@pct.edu . Reprinted from Bracing Views with the author’s permission. \\n'"}, "time": 1742564136.342922}