{"duration": 0.053109169006347656, "input_args": {"text": "'posted by Eddie Olive Oatman was born in Illinois in 1837. At the tender age of 14, Olive’s family were travelling alone to seek a better life in California. On the fourth day of their journey, family was attacked by a group of Native Americans. Only three of the Oatmans survived the attack. Olive’s parents and four of their children were killed, and Olive’s brother Lorenzo was clubbed and left for dead. Fortunately, he eventually reached a settlement and was able to carry on his journey, believing his entire family dead. Olive and her seven-year-old sister Mary Ann were captured by the Yavapai people, and were sent to their tribe to be used as slaves. For over 60 miles, the two girls were led through the Sonoran Desert to the tribe’s village. After a year, a group of Mohave Indians visited the village and traded two horses, vegetables, blankets, and other trinkets for the captive girls. Head over to the next page to find out the incredible story of what happened next. Both Oatman girls were tattooed on their chins and arms, in keeping with the tribal custom. During 1855, the tribe experienced a dire shortage of food supplies and ten-year-old Mary Ann died of starvation, along with many Mohaves. Because Olive did not know that her brother had survived the massacre, she believed she had no immediate family left, and the Mohave raised her as their own. She was given a clan name, Oach, and a nickname, Spantsa, a Mohave word having to do with unquenchable lust. Head over to the next page to discover how Olive finally managed to escape. After several years, rumours eventually began to surface of a white woman living with the Mohaves. Finally, after some intense negotiations with the Europeans, it was agreed she should be set free. When she arrived at what was to be her new home, Olive was dressed in traditional Mohave attire, which meant she wore nothing above the waist. Olive’s topless look is one echoed in the present day by women’s movement leader Inna Shevchenko. The following video, which was shot during a far right rally in Paris, four topless Ukrainian feminists occupied a rooftop holding a sign that read “Sextermination for Nazism”. The women were eventually brought down by firemen and shielded from the attacking demonstrators by police. Source:'"}, "time": 1742562808.8464894}