{"duration": 0.07477688789367676, "input_args": {"text": "'  comedian Kathy Griffin told a blogger President Donald Trump’s mockery of Megyn Kelly motivated her to take a   shock photo of her holding the president’s severed head.[  blogger Yashar Ali tweeted he had spoken to Griffin on Tuesday after the gruesome image sparked a nationwide uproar.   (  Shields) “She said they were putting together a Trump mask and that led her to think of Trump’s infamous statement early on in the primary,” Ali tweeted. “The ‘blood coming out of her eyes, blood coming out of her ears, blood coming out of her wherever’ statement. ” 1. Just spoke with @kathygriffin . She said, unapologetically, that the image of her that’s gone viral is an expression of art,  —   Yashar Ali (@yashar) May 30, 2017,  2. She believes Trump is doing tremendous damage to the country + the world and she wanted the art to reflect the seriousness of his impact,  —   Yashar Ali (@yashar) May 30, 2017,  3. She said they were putting together a Trump mask and that led her to think of Trump’s infamous statement early on in the primary.  —   Yashar Ali (@yashar) May 30, 2017,  4. The ”blood coming out of her eyes, blood coming out of her ears, blood coming out of her wherever” statement.  —   Yashar Ali (@yashar) May 30, 2017,  5. She also said she does not condone any violence, that provocative art should remain just that: art. She does not want life to imitate art,  —   Yashar Ali (@yashar) May 30, 2017,  After Kelly opened the first GOP debate by pouncing on Trump for “[calling] women you don’t like ‘fat pigs, dogs, slobs, and disgusting animals’ —  and Trump interrupting her   to say “Only Rosie O’Donnell” —  Trump dismissed her as a “lightweight. ” “I think she’s highly overrated,” Trump told CNN’s Don Lemon in August 2015 after the first Republican primary debate. “She gets out, and she starts asking me all sorts of ridiculous questions. And you know, you can see there was blood coming out of her eyes, blood coming out of her wherever, but she was, in my opinion, she was off base. ” Trump did not apologize and told CNN he did “nothing wrong whatsoever. ” TMZ originally obtained the image of Griffin holding up the president’s   severed head from a shoot with photographer Tyler Shields. “This is fake blood, just so you know. I won’t give away what we’re doing, but Tyler and I are not afraid to do images that make noise,” she said on a video about the shoot.'"}, "time": 1742563819.530686}