{"duration": 0.08662080764770508, "input_args": {"text": "'- Advertisement - What the heck was FBI Director James Comey thinking? Three emails found with the name \"Clinton\" in them on disgraced, serial genitals photographer, Anthony Weiner\\'s computer, amounts to an investigation tantamount to and obliquely suggestive of criminal behavior. Not satisfied to insert himself and the FBI into the political maelstrom of the 2106 presidential campaign, FBI Director, James B. Comey, a lifelong Republican, has now made himself and the agency a complete laughing stock in its dealings with Hillary Rodham Clinton. He should do the right thing and resign over this monumental fumble that reeks of political Republican bias. I find it very hard to see just how he\\'s going to continue effectively running the FBI when he\\'s done so much to undermine its legendary independency and penchant for secrecy that has made it one of the most feared and respected law enforcement agencies in the world. Now Comey\\'s action has rendered this proud and efficient agency as a dopey version of the Keystone Kops. A kind of Uncle Gadget-like approach to anything Clinton perhaps a reaction by political osmosis contaminated by his brethren in the Congress. The unprecedented FBI press conference before his congressional hearing led by his witch-hunting party, turned out to be an expensive joke as the so-called secret information gleaned from a private email server in Hillary Clinton\\'s basement could only yield a few lines of \"confidential\" classification. This forced Comey and his angry Republican kin in Congress to express outrage that he did not have HRC charged, well, for \"something.\" Never mind the EVIDENCE of deliberate criminal action was a scarce as a Dodo bird. Comey, perhaps smarting at the stinging rebuke from his cohorts in Congress who thought that he was letting her off the hook or that he was \"a sell out,\" might have wanted to get back in their good books by sending a letter so immature and, well, stupid, as to draw peals of uncontrolled fits of laughter if this was not the end of a unique presidential election. It is serious when the head of the FBI writes Congress and hints of something nefarious. Eleven days out and Comey springs his \"October Surprise\" perhaps trying to send a subtle dog whistle to Republican voters that HRC \"might, perhaps, could be\" dragged up on unnamed and unspecified criminal charged so, by default, vote for Donald Trump. How else is this to be interpreted? The timing, the vagueness, \"draw your own conclusioness\" of the letter, and the careful use of language that was not definitive or direct but with enough spin to suggest that there MIGHT BE SOMETHING AMISS THERE -- at last! But the Comey revelation and clumsy letter writing immediately backfired when it was revealed that the computer was NOT HRC\\'s own, and had all to do with the silly little twit named one Anthony Weiner, whose penchant for making himself an utter ass is without parallel. Poor HRC had NOTHING to do with this. Almost immediately the Republican amen chorus that was singing the demise of HRC and the praises of the Orange-haired One, gulped air like a fish stranded on dry land. The self-righteous, chest thumping, and the gleeful orgasmic teetering that welcomed this new HRC \"email revelation\" and fumble ended as immediately as it started. Nah, that was definitely not the political manna from heaven that these bozos were desperately praying for. That and a bolt of God-fearing, Bible-brimstone-and-fire lightening to strike the Demon HRC! - Advertisement - Within two hours the semi-hard doo-doo struck the proverbial fan scattering its stench on the faces of Comey, Trump, Paul Ryan and all of the mainstream media pundits and anchors who rushed so quickly to judgment and pulled out their lariats to hang HRC from the nearest tree. With stinky egg on their goofy faces and sheepish grins all around, HRC marched (the Rasta men would say \"trod\") to the microphones and demanded that Comey and the Keystone Kops release the emails. Show and tell the American people she demanded -- ladylike. That\\'s called \"calling your bluff.\" And, by crickey! She\\'s an old hand at that! Again she demonstrated and proved --once more (how many times does she have to freakin\\' prove it?) that she is as fit as a fiddle to be president of the United States. The bunch of childish, clownish clumsy boys that she\\'s had to fend off all of her life looked sullen and morose. Chest-fallen -- I like that word! I could hear them crying: Bummer! We sure thought that we had her this time! And just as immediately the calls came for Comey to explain and resign. He\\'s the fall guy, the patsy, the one who wrote the letter. Serves him right! The feisty, petite dynamo showed just how big her cajones are and just how tough she is by COMPLETELY IGNORING Donald Trump\\'s Twitter tantrums, Paul Ryan\\'s hot-and-cold silliness, Mitch McConnell\\'s growing senility, and the rest of the GOP\\'s sorry-brigade pouting and mammy bellowing and wailing. What a gal! She does not have to yell, scream, and get the FBI director to do something foolish to win this election. Madame, you have withstood this unnecessary, unfair, unjust, unprincipled and undemocratic attacks, targeted maligning and political obsession with you and then some. If you were a man subjected to the same level of attacks you would have certainly cracked already. You make these guys look as so many wimps and wusses. But you\\'re made of sterner stuff. We who have watched and followed your stellar and outstanding career know that only too well. Comey by his really, really poor lack of judgment and bad political calculations has just strengthened your position. The thing backfired and has now blown up in their collective faces. You should laugh out loud -- but not now. Wait until November 8 and then have a big, hearty Hillary Clinton laugh from you feet on up. For now it\\'s the home stretch and you\\'re almost there. - Advertisement -'"}, "time": 1742562173.1153364}