{"duration": 0.03680849075317383, "input_args": {"text": "'Tom Cahill | October 28, 2016 \\nNative Americans attempting to stop a pipeline from being built on their land and water just got assistance from a large herd of wild buffalo. \\nIndigenous culture honors American bison (known as Tatanka Oyate, or Buffalo Nation) as a symbol of sacrifice, as the bison give their lives to provide food, shelter, and clothing through the use of their meat and their hides. Native Americans maintain a spiritual tradition with bison , believing that as long as buffalo — a gift from the Great Spirit — roam free and as long as the herds are bountiful, the sovereignty of indigenous people would remain strong. \\nAnd in the midst of mass arrests, mace attacks, and beatings from batons, a stampede of bison suddenly appeared near the Standing Rock protest camp. A cry of joy reportedly erupted from the Standing Rock Sioux, as they had been praying for assistance from the Tatanka Oyate during their standoff with riot police and national guardsmen. \\nOkay here you go… it is a beautiful thing… WATCH. The Tatanka (Pte) Oyate Buffalo Nation stands with Standing Rock… \\nPosted by Walt Pourier on Thursday, October 27, 2016 \\nAs the police response to the Sioux’s ongoing nonviolent civil disobedience escalates, tribal leaders are calling on state and federal governments to respect the constitutional rights of water protectors and stop the mistreatment of the indigenous community. \\n“We call on the state of North Dakota to oversee the actions of local law enforcement to, first and foremost, ensure everyone’s safety. The Department of Justice must send overseers immediately to ensure the protection of First Amendment rights and the safety of thousands here at Standing Rock,” wrote David Archambault II , chairman of the Standing Rock Sioux tribe. “DOJ can no longer ignore our requests.” \\n\\nTom Cahill is a writer for US Uncut based in the Pacific Northwest. He specializes in coverage of political, economic, and environmental news. You can contact him via email at [email protected] '"}, "time": 1742563220.2222276}