{"duration": 0.0885014533996582, "input_args": {"text": "'He called NATO obsolete. He said Germany’s acceptance of refugees is “utterly catastrophic. ” The   One China policy embraced by the United States? That’s up for discussion. Just days before Donald J. Trump’s inauguration, world leaders on three continents are on edge after comments the   made in an interview on Friday with The Wall Street Journal and in a weekend interview with two European newspapers, Bild and The Times of London. “It’s obsolete, first because it was designed many, many years ago,” Mr. Trump said, according to the German newspaper Bild. The   alliance, born in 1949, three years after Mr. Trump, is viewed by many  —   including his nominee for defense secretary, Gen. James N. Mattis  —   as essential to American security. “Secondly, countries aren’t paying what they should” and NATO “didn’t deal with terrorism. ” Responding on Monday to Mr. Trump’s comments, Dalia Grybauskaite, the president of Lithuania, which gained its independence from the Soviet Union in 1991 and joined NATO in 2004, urged Mr. Trump to continue meeting the United States’ financial obligations toward the alliance. Mr. Trump also criticized the European Union, describing it as “basically a vehicle for Germany. ” He praised Britain for its vote to leave the bloc, known as Brexit, adding: “I believe others will leave. I do think keeping it together is not going to be as easy as a lot of people think. ” French leaders also bristled at Mr. Trump’s swipe against the bloc. Their response comes as they deal with growing domestic support for the   Union and   party National Front, led by Marine Le Pen, who was spotted on Thursday at Trump Tower in New York. “The best response,” said the French foreign minister,   Ayrault, “is European unity. ” In the interview with The Journal, Mr. Trump said the One China policy was up for negotiation. Beijing responded quickly and decisively. Its Foreign Ministry called the policy, which recognizes Beijing as the sole Chinese government, the foundation of   States ties, and it said it was nonnegotiable. People’s Daily, the mouthpiece of the governing Communist Party, said Mr. Trump “has been stunningly confident in his ostensible knowledge of the job, though he speaks like a rookie. ” An unusually strongly worded editorial in the   China Daily said on Monday that Mr. Trump was “playing with fire with his Taiwan game. ” “If Trump is determined to use this gambit on taking office, a period of fierce, damaging interactions will be unavoidable, as Beijing will have no choice but to take off the gloves,” the newspaper said. A spokeswoman for the Chinese Ministry of Foreign Affairs warned Mr. Trump on Monday that any effort to undermine the policy could backfire. Mr. Trump also took aim at German automakers, warning of a 35 percent tariff on any cars they build in Mexico and export to the United States. Shares of BMW, Volkswagen and Daimler fell on Monday after his comments, but BMW said the company would stick to its plans to open a plant in Mexico in 2019. “It’s very clear that we have to be prepared to immediately be able to neutralize the impact of a measure of that nature,” Ildefonso Guajardo Villarreal, Mexico’s economy minister, said on Friday on a Mexican news show. “It would be a problem for the entire world,” Mr. Guajardo Villarreal warned. Such a tariff “will have a wave of impacts that can take us into a global recession,” he said. Not surprisingly, Russian diplomats were unperturbed by Mr. Trump’s comments on NATO. They welcomed the “obsolete” label and were enthusiastic at his suggestion that he would consider reducing sanctions against Russia if the country agreed to reduce its nuclear arsenal. Dmitri S. Peskov, a spokesman for President Vladimir V. Putin of Russia, said on Monday that “NATO is indeed a vestige,” according to Radio Free Europe. “Let’s wait until he assumes office before we give assessment to any initiatives,” he said.'"}, "time": 1742563863.1559062}