{"duration": 0.04125785827636719, "input_args": {"text": "'Singer Chris Brown and rapper Lil Wayne have reportedly been named in a federal investigation for their alleged connection to an accused drug dealer. [Authorities revealed last week in Miami federal court an ongoing investigation into a possible $15, 000 drug deal between suspected drug dealer Harrison Garcia and Brown. Garcia, a    music producer, reportedly confessed last October to selling Lil Wayne  —   real name Dwayne Michael Carter  —   “a lot of narcotics,” the Miami Herald reports.  Garcia reportedly boasted on social media about selling marijuana, “lean,” (Promethazine mixed with Codeine cough syrup) and Xanax, to the   superstars. The Miami Herald reports: Then jurors got to see evidence of Lil Wayne  —   whose real name is Dwayne Michael Carter  —   and Brown’s involvement in the form of text messages seized from Garcia’s phones. The messages appeared to show Garcia directing his “ ” to deliver drugs to Lil Wayne and his crew. “I’ll shoot u some trees,” one message read, a reference to marijuana. “It’s for Wayne,” Garcia allegedly responded via text. The text message about Brown was more explicit. Garcia sent a bragging text message to a woman of a screen shot of the $15, 000 bank deposit from “Christopher Brown” into his account. “Look who put money my account,” Garcia wrote. The woman responded: “What that for LOL” Garcia replied with several smiley face emojis: “Drugs   …     lean and shit. ” Investigators presented the court with dozens of pieces of evidence, some seized from one of Garcia’s homes, as proof of his close connection to Brown and the material benefits of their lavish lifestyle. Federal lawyers showed photos from Garcia’s Instagram account  —   user name muhammad_a_lean  —   that show he and Brown   across the globe. Garcia’s lawyers, Gustavo Lage and Percy Martinez, argued that their client is not a drug dealer and that he simply leveraged his friendship with the Grammy   artists to boost his own industry profile. A jury verdict is expected Monday on the five federal charges Garcia is accused of. If convicted, he could receive up to life in prison.   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742561928.0488274}