{"duration": 0.20229840278625488, "input_args": {"text": "'in: Consciousness , Sleuth Journal , Society , Special Interests , US News With the long awaited controversial US presidential election day inching closer and as the Hillary ship threatens to sink with every passing day and every new revelation , here is a question all truth seekers should ponder. What if after all is said and done a frightening and shocking Hillary declared “victory” is the very thing required in this human consciousness journey we call life in order to truly trigger mass awakening above and beyond the awakening to political corruption we have now? This scenario is very plausible given the nature of our political system and the now normalized very intense propaganda that is being displayed today by the mainstream media , Hollywood and the many Soros funded non-profit political organizations involved in this presidential race like Moveon.org whose job it is to keep feeding their followers the lies, deceit and propaganda using celebrity voices (see shocking image below) equating a Hillary vote as a show of “love”. And since this scenario (of mass awakening and mass action) is now very plausible, perhaps everyone who cares about individual rights and America should pay attention to the events that are about to unfold. Bear with me as we imagine we are all standing in front of the large screen that offers all the answers to life. On this screen we have the privilege of seeing with our own eyes and ears the journey our species has been through. This presentation thus acts as an instructional manual for us (humanity, truth seekers) to use as an instructional guide. Imagine that on this movie screen we can easily look for patterns in previous human behaviors, analyze cause and effect and see how governments and the ruling elite do their tricks on the masses to ensure their control over us. Imagine how easy life would be if we had a screen to show us all the answers. Imagine being able to see these easily observed patterns on the video screen and their immediate effects on the species. This front row view into the journey of humanity would not only be instructional for those observing, it would be the primary instructional guide by which we would be able to make rather safe, high probability, minimal risk decisions on current political situations. Well guess what? We have that screen available to us. It’s called the documented account of history. Ancient history as well as modern history is available to us in today’s information age. We have now reached a point where very little is hidden. The occult ruling elite are now fully exposed for who they are, for their devious and deceitful tactics on the masses and their criminal plans for dominating humanity one overthrown nation state at a time with limitless eternal unchecked power. The official birth of this historic moment will be embodied in a Hillary Clinton “victory” selection which could very well take place very soon here in the US. The thing that everyone must recognize is that for every action there is an equal and opposite reaction. In fact, the ruling elite know this very well. This is why they have armed themselves to the teeth with military weaponry including 1.6 billion (yes billion!) rounds of hollow point bullets, militarized DHS and FEMA camps. This is the true reason for the police state, the race toward AI technology, the surveillance state, the deployment of the JADE AI based conventional asymmetric warfare software and the in-your-face criminality, lies and deceit of the Hillary-mainstream media-Hollywood team. They’re acting like bullies who can taste the new world order because they know it’s so close to them at this point. THIS is where we are today and all truth seekers, Bernie supporters, Trump supporters and anyone else who has felt the sting of this new world order operation known as the Hillary campaign needs to acknowledge this reality now. I could be wrong about this but I highly suspect that this point in history will prove to be the last stand or should I say the last meaningful opportunity for people to wake up at a mass scale to what is happening both globally and domestically. The movie screen I was talking about before is real. We have it playing before us. Again, it’s called history. Today more than ever any idiot can easily verify that the US has thousands of military bases around the world. You can easily verify that today the US empire rules the world, that the 9/11 operation was an activation of their PNAC plans and final global takeover. You can easily verify how the US and it’s CIA , economic terrorists and “special forces” has strong-armed almost every nation on earth to exert its domination on it and insert its own puppet president. You can easily look up at the screen of history and see how the enslavement of humanity was planned long ago with a process of mass propaganda, consumerism, mass medication, mass entertainment and brainwashing and mass indoctrination via the board of education. There are of course far too many moving parts to this new world order plan to list here but you get the picture, it was all planned out to lead us to where we are today. Understanding and seeing this easily available information we’ve considered so far then allows us to see the next phase of where we are heading. Frankly, this next phase I wholeheartedly believe will be exponentially accelerated with a Hillary Clinton declared “victory” on November 8th 2016. I say “victory” because I believe that without interference by the ruling elite (DNC, mainstream media, DHS etc) Donald Trump would win by a landslide. Hopefully I’m wrong but I suspect there is little chance if any of the TRUE results holding up. The ruling elite simply didn’t come this far to let the people actually have a say in who wins. With that said, I call on all truth seekers and everyone else who is hoping to see Hillary Clinton go away forever to hold still and realize that this upcoming moment in history may actually be the moment of truth for humanity. Realize that throughout history (the movie screen we talked about earlier) we see that all major events in human history are associated with major realizations and major emotional pivotal points of absolute conviction and purpose. This point of absolute conviction and purpose is here. We all see the blatant criminality being waved in all our faces. We know who they (the ruling elite) are. We are all salivating in some way to see them go down by being arrested, imprisoned, punished, exposed, embarrassed and cast from our society. Before you target a criminal you have to identify who they are. Today humanity can celebrate one of several major accomplishments. One of them being that we have come a long way at actually exposing and identifying who these criminals are. Today we know their names, we have entire databases and factual findings confirming the criminality of all of these people from the ones at the very top of the power structure all the way down to the scum bag crisis actors like the Sandy Hook criminals (Gene Rosen, Lenny Pozner etc) and others. The hard reality today is that a Hillary “victory” more than any other scenario will mobilize people to take action to take back their country. Naturally the criminal Left, the DNC and the Hillary-mainstream media complex would LOVE to stage some kind of violent act to blame on the possibly soon to be discontent Trump followers but at this stage there is nothing the liberal left can do that won’t be suspected of being staged. The Hillary crime team won’t have anyone to blame when they are busted staging violence since they are already on record discussing staging violence to be blamed on Trump supporters. Planning ahead So as we approach election day I invite all Americans who understand the level of criminality and evil that Hillary represents to think how they would channel their energy in case of a Hillary selection in the upcoming election. Will you continue to do what you are doing now? If not, then what will you do differently? Will you vote again? Will you stand by and watch Hillary support and re-arm a dying ISIS CIA army in Syria so that the US can finally overthrow president Assad? Will you stand by and watch Hillary cement the Agenda 2030 plans, the global climate taxes, the illegal TTIP and TTP agreements that undermine national sovereignty? Will you watch her trigger WW3 with Russia and cement the global police state? Will you stand by and watch her run the country knowing how much of a criminal she herself is? Will you stand by and watch the Clinton body count sky rocket and watch more journalist murdered left and right for exposing this criminal empire? A Hillary global regime will officially represent the arrival of the new world order (though in many ways that is what the Obama and Bush administration has done) and anyone seeing her criminality today knows this. There is a lot of blood waiting to be shed somewhere out there. Whether it’s the brutal Hillary led first official global regime or resistance to this regime locally or globally (WW3). There is however, also a narrow yet still realistic path by which minimal blood will be shed. It will likely be determined by how many people actually take action (especially those in uniforms- police and military). By action I’m referring to the American way of supporting true journalism, removing your consent, openly speaking your mind without fear of retribution, resisting tyranny, pursuing democracy, sharing information and self-sustaining solutions and being involved in peace activism based on conviction and strong belief in humanity, nature, justice and morality. Finally, humanity and all the values it believes in are all potentially in jeopardy. Everything is now threatened. Who will protect these values and how much sense of urgency there will be to do so will be determined this upcoming election day, for better or for worse. Help spread the word. One way or another paradigm shift is here. Submit your review'"}, "time": 1742563251.878253}