{"duration": 0.05120205879211426, "input_args": {"text": "'Share This \\nA Hillary Clinton presidency would devastate our nation, damaging an already unstable economy as she destroys our Constitution and taxes Americans until they bleed. Several businesses are aware of this frightening reality, and they have decided to prepare themselves and others for the worst case scenario — a Hillary presidency. \\nSmall businesses are often those affected the most by a Democrat’s economic policy, but many of America’s “mom and pop” shops are determined to overcome should this terrifying possibility become our reality. Surprisingly, there is a silver lining for some. Certain businesses actually realize that a vote for Hillary and her election as our next president will likely make them extremely wealthy — if only temporarily. Democrat presidential candidate, Hillary Clinton \\nGun stores everywhere plan to stock up on guns in preparation for the rigged election, in which most think Hillary has already been decided the winner. Although some are driven by the desire to protect their families, many gun owners are stocking up now before Hillary has a chance to try to take their rights away, which she has vowed to do. Those who have shopped in gun stores even tell the owners that they are gearing up for a Hillary presidency. \\nTwo things drive up sales like no ads on TV ever could. The first is election campaigns, which inevitably pit gun-rights advocates against those asking for stricter gun-control laws. And the second, are tragedies in the news, especially mass shootings. Jared Fulton and his son Dave at their gun store, Freedom Firearms \\n“If Hillary Clinton gets elected it’s going to be all hands on deck, and its going to be a crazy day,” says Jared Fulton, who founded Freedom Firearms with his brother, Joel, in 2002, shortly after Michigan passed a new “concealed-carry” law allowing any adult to carry weapons on their person as long as they’re out of sight. “It’s going to be several crazy days, in fact.” [via Independent ] \\nWhile Democrats cry and complain about guns, their antics actually push sales and drive the number of guns in civilian hands exponentially higher. This was seen the day after Barack Obama’s election and the day of his inauguration. Instead of watching him take the presidential oath, many Second Amendment supporters went out and purchased guns that they knew would offend the new president. And, it won’t be different if Hillary is elected. \\nMake no mistake that while Obama currently holds the record for “gun salesman of the year,” every year since he was elected, Hillary will surpass him. Having firepower to back your decision not to consent to her corrupt presidency may be key as she tries to start World War III. Not all Americans are going to willingly accept Hillary’s rigged and invalid authority. When tyrannical leaders try to take our country from We the People , it’s our duty to remind them why our Founding Fathers gave us the Second Amendment.'"}, "time": 1742563034.973256}