{"duration": 0.16043448448181152, "input_args": {"text": "'Wayne MADSEN | 11.11.2016 | WORLD The Clintons and Soros launch America’s Purple Revolution Defeated Democratic presidential candidate Hillary Rodham Clinton is not about to «go quietly into that good night». On the morning after her surprising and unanticipated defeat at the hands of Republican Party upstart Donald Trump, Mrs. Clinton and her husband, former President Bill Clinton, entered the ball room of the art-deco New Yorker hotel in midtown Manhattan and were both adorned in purple attire. The press immediately noticed the color and asked what it represented. Clinton spokespeople claimed it was to represent the coming together of Democratic «Blue America» and Republican «Red America» into a united purple blend. This statement was a complete ruse as is known by citizens of countries targeted in the past by the vile political operations of international hedge fund tycoon George Soros. The Clintons, who both have received millions of dollars in campaign contributions and Clinton Foundation donations from Soros, were, in fact, helping to launch Soros’s «Purple Revolution» in America. The Purple Revolution will resist all efforts by the Trump administration to push back against the globalist policies of the Clintons and soon-to-be ex-President Barack Obama. The Purple Revolution will also seek to make the Trump administration a short one through Soros-style street protests and political disruption. It is doubtful that President Trump’s aides will advise the new president to carry out a diversionary criminal investigation of Mrs. Clinton’s private email servers and other issues related to the activities of the Clinton Foundation, especially when the nation faces so many other pressing issues, including jobs, immigration, and health care. However, House Oversight and Government Reform Committee Chairman Jason Chaffetz said he will continue hearings in the Republican-controlled Congress on Hillary Clinton, the Clinton Foundation, and Mrs. Clinton’s aide Huma Abedin . President Trump should not allow himself to be distracted by these efforts. Chaffetz was not one of Trump’s most loyal supporters. America’s globalists and interventionists are already pushing the meme that because so many establishment and entrenched national security and military «experts» opposed Trump’s candidacy, Trump is «required» to call on them to join his administration because there are not enough such «experts» among Trump’s inner circle of advisers. Discredited neo-conservatives from George W. Bush’s White House, such as Iraq war co-conspirator Stephen Hadley, are being mentioned as someone Trump should have join his National Security Council and other senior positions. George H. W. Bush’s Secretary of State James Baker, a die-hard Bush loyalist, is also being proffered as a member of Trump’s White House team. There is absolutely no reason for Trump to seek the advice from old Republican fossils like Baker, Hadley, former Secretaries of State Rice and Powell, the lunatic former U.S. ambassador to the United Nations John Bolton, and others. There are plenty of Trump supporters who have a wealth of experience in foreign and national security matters, including those of African, Haitian, Hispanic, and Arab descent and who are not neocons, who can fill Trump’s senior- and middle-level positions. Trump must distance himself from sudden well-wishing neocons, adventurists, militarists, and interventionists and not permit them to infest his administration. If Mrs. Clinton had won the presidency, an article on the incoming administration would have read as follows: «Based on the militarism and foreign adventurism of her term as Secretary of State and her husband Bill Clinton’s two terms as president, the world is in store for major American military aggression on multiple fronts around the world. President-elect Hillary Clinton has made no secret of her desire to confront Russia militarily, diplomatically, and economically in the Middle East, on Russia’s very doorstep in eastern Europe, and even within the borders of the Russian Federation. Mrs. Clinton has dusted off the long-discredited ‘containment’ policy ushered into effect by Professor George F. Kennan in the aftermath of World War. Mrs. Clinton’s administration will likely promote the most strident neo-Cold Warriors of the Barack Obama administration, including Assistant Secretary of State for European and Eurasian Affairs Victoria Nuland, a personal favorite of Clinton». President-elect Trump cannot afford to permit those who are in the same web as Nuland, Hadley, Bolton, and others to join his administration where they would metastasize like an aggressive form of cancer. These individuals would not carry out Trump’s policies but seek to continue to damage America’s relations with Russia, China, Iran, Cuba, and other nations. Not only must Trump have to deal with Republican neocons trying to worm their way into his administration, but he must deal with the attempt by Soros to disrupt his presidency and the United States with a Purple Revolution No sooner had Trump been declared the 45 th president of the United States, Soros-funded political operations launched their activities to disrupt Trump during Obama’s lame-duck period and thereafter. The swiftness of the Purple Revolution is reminiscent of the speed at which protesters hit the streets of Kiev, the Ukrainian capital, in two Orange Revolutions sponsored by Soros, one in 2004 and the other, ten years later, in 2014. As the Clintons were embracing purple in New York, street demonstrations, some violent, all coordinated by the Soros-funded Moveon.org and «Black Lives Matter», broke out in New York, Los Angeles, Chicago, Oakland, Nashville, Cleveland, Washington, Austin, Seattle, Philadelphia, Richmond, St. Paul, Kansas City, Omaha, San Francisco, and some 200 other cities across the United States. The Soros-financed Russian singing group «Pussy Riot» released on YouTube an anti-Trump music video titled «Make America Great Again». The video went «viral» on the Internet. The video, which is profane and filled with violent acts, portrays a dystopian Trump presidency. Following the George Soros/Gene Sharp script to a tee, Pussy Riot member Nadya Tolokonnikova called for anti-Trump Americans to turn their anger into art, particularly music and visual art. The use of political graffiti is a popular Sharp tactic. The street protests and anti-Trump music and art were the first phase of Soros’s Purple Revolution in America. President-elect Trump is facing a two-pronged attack by his opponents. One, led by entrenched neo-con bureaucrats, including former Central Intelligence Agency and National Security Agency director Michael Hayden, former Homeland Security Secretary Michael Chertoff, and Bush family loyalists are seeking to call the shots on who Trump appoints to senior national security, intelligence, foreign policy, and defense positions in his administration. These neo-Cold Warriors are trying to convince Trump that he must maintain the Obama aggressiveness and militancy toward Russia, China, Iran, Venezuela, Cuba, and other countries. The second front arrayed against Trump is from Soros-funded political groups and media. This second line of attack is a propaganda war, utilizing hundreds of anti-Trump newspapers, web sites, and broadcasters, that will seek to undermine public confidence in the Trump administration from its outset. One of Trump’s political advertisements, released just prior to Election Day, stated that George Soros, Federal Reserve chair Janet Yellen, and Goldman Sachs chief executive officer Lloyd Blankfein, are all part of «a global power structure that is responsible for the economic decisions that have robbed our working class, stripped our country of its wealth and put that money into the pockets of a handful of large corporations and political entities». Soros and his minions immediately and ridiculously attacked the ad as «anti-Semitic». President Trump should be on guard against those who his campaign called out in the ad and their colleagues. Soros’s son, Alexander Soros, called on Trump’s daughter, Ivanka, and her husband Jared Kushner, to publicly disavow Trump. Soros’s tactics not only seek to split apart nations but also families. Trump must be on guard against the current and future machinations of George Soros, including his Purple Revolution.'"}, "time": 1742563557.6395192}