{"duration": 0.03146624565124512, "input_args": {"text": "'What began as a small protest over the Texas bathroom bill grew to a   “Queer Dance Freakout” on the street in front of the historic Texas Governor’s Mansion. The troupe protested a bill in the Texas Legislature that would require men and women to use bathrooms and dressing rooms designated to the sex on their birth certificate. [The protest surrounds Senate Bill 6, the “Texas Privacy Act,” filed by State Senator Lois Kolkhorst ( ). Breitbart Texas reported on the bill in January when the senator   the legislation. The law, if passed, would enhance the penalties for “a litany of crimes committed in a bathroom against any individual, regardless of their sex or gender identity,” Breitbart Texas’ Lana Shadwick wrote.  “The Texas Privacy Act is a thoughtful solution to a sensitive issue. It preserves an expected level of privacy for our public schools and buildings,” Kolkhorst said in a written statement. “At the same time, it also allows for schools and universities to make personal accommodations for those requesting an alternate setting. Senate Bill 6 also allows Texas businesses to determine their own policy without government interference. ” A Facebook event page invited protesters to the mansion, stating, “Everything is freakier in Tex@$$. Come move your body outside the governor’s mansion to show we are not going to take the transphobic and homophobic laws Greg Abbott and Dan Patrick and their adminstration [sic] have got in the pipeline. ” Social media lit up as the    geared up. AUSTIN  —   About 75 people are participating in a “queer dance freakout” in front of the governor’s mansion to protest bathroom bill. #txlegepic. twitter.   —   Brian M. Rosenthal (@brianmrosenthal) February 24, 2017, Twitter user @pzriddle did not attend but tweeted out his favorite protest sign: I didn’t make if to the Queer Dance Freakout at @GregAbbott_TX‘s Mansion, but I love the idea and this sign. pic. twitter.   —   Prentiss Riddle (@pzriddle) February 24, 2017,   This Twitter usern @forensicaudit12n was not happy with the protesters. They Tweeted: “OUTRAGE!! Left Holds A “Queer Dance Freakout” To Intimidate TX Governor. ” OUTRAGE!! Left Holds A “Queer Dance Freakout” To Intimidate TX Governor (VIDEO) https:  .  pic. twitter.   —   Forensic Auditing (@forensicaudit2) February 24, 2017,  Texas Agriculture Commissioner Sid Miller expressed his feelings about the protest on Facebook.  “The sad thing is that these folks think their activities will help kill the bathroom safety bill, Miller posted. “In reality, their actions demonstrate just why such a bill is needed and will only increase its chance of passage. ” As the afternoon protest continued into the night, the crowd grew to about 200 people. The Austin Chronicle posted live video from the “Feakout” dance.  Queer dance freakout 30 mins ago at the Texas governor’s mansion. #abbott #sb6 #lgbtqia #flushthebill pic. twitter.   —   Stu (@itstrulyreal) February 24, 2017,  Bob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX. '"}, "time": 1742628523.4870684}