{"duration": 0.04828596115112305, "input_args": {"text": "'posted by Eddie A concussion is a minor traumatic brain injury (TBI) caused by a blow to the head. A person can also suffer deleterious effects from sub-concussions, which are repeated minor assaults to the head. These assaults can lead to a TBI. Wouldn’t it be nice if there were a way to prevent damage from concussions before they occur? What about a way to speed up the healing process? Medical scientists point to cannabis as a potential solution. But, can the herb really heal a concussion? Cannabis has shown a wealth of potential in traumatic brain injury. Unique properties of the herb may help the brain repair itself after trauma, including trauma from a concussion. Overall, there are three main characteristics that make cannabis a promising treatment for concussions and other forms of head trauma. These include, 1. Reduced brain inflammation The cannabis plant contains neuroprotective antioxidants. These neuroprotectants have many functions, including preventing stress-related damage and reducing inflammation in the brain. One major impact of a concussion or any sort of head trauma is increased neural inflammation. A 2014 study from Tel Aviv University found that microdoses of psychoactive THC reduced brain swelling in rodent models. The researchers write, Our results suggest that an ultralow dose of THC that lacks any psychotrophic activity protects the brain from neuroinflammation-induced cognitive damage and might be used as an effective drug for the treatment of neuroinflammatory conditions, including neurodegenerative diseases. 2. Neuroprotection These same anti-inflammatory effects may prove very useful in treating a concussion. Surprisingly, the US government also thinks that cannabis is a promising treatment for head injury. The Feds currently hold a patent on nonpsychoactive CBD as a neuroprotective agent. In the patent application , they write, The cannabinoids [in cannabis] are found to have particular application as neuroprotectants, for example in limiting neurological damage following ischemic insults, such as stroke and trauma, or in the treatment of neurodegenerative diseases, such as Alzheimer’s disease, Parkinson’s disease and HIV dementia. So, even the US government admits that compounds in the cannabis plant may decrease the damage from head and brain trauma, as well as from strokes, oxygen deprivation, and neurodegenerative diseases. Further, research from 2013 found that the endocannabinoid system (ECS) plays a crucial role in the brain’s ability to repair itself. The ECS is the pathway in which cannabis engages with the body. The study articulates that therapeutic cannabinoids may provide protection against nerve cell damage after acute injury. 3. Pre-treatment with cannabis prevents damage \\nThere is some evidence that pre-treatment with cannabis can help protect against possible concussions associated with certain occupations. This includes professional athletics, horseback riding, and other lifestyle activities that make a person more susceptible to concussions. This doesn’t necessarily mean smoke some herb every day. Rather, this may be a case where having a little CBD oil on hand or using it as a dietary supplement may be beneficial. In an interview with Fox News, Dean Petkanas, CEO of KannaLife Sciences, explains , You have a repository of chemicals in the plant. But, more prominantly we’ve found in some preclinical research that cannabidiol (CBD) acts as a neuroprotectant. So, in the parlence of pharmacutical science, we could be using that as a prophilaxis against repetative concussive injury. Simply stated, pharmaceutical companies are hoping to make drugs that would prevent brain damage from concussions before they happen. While much of the research has focused on CBD, preclinical research shows that psychoactive THC may be helpful as well. A 2014 study found that patients with traumatic brain injury who had detectable levels of THC in their systems at the time of an accident were less likely to die from brain trauma. Post-concussion syndrome (PCS) is a complex condition that sometimes follows a concussion. The symptoms pf PCS can last for months after the initial brain injury. According to the Mayo Clinic , some of the symptoms include, Headaches'"}, "time": 1742628529.4247549}