{"duration": 0.12726593017578125, "input_args": {"text": "'There’s nothing like a   flight to get you over a fear of flying. At least that was the case for me after my first trip to South Africa to visit the family of the woman who eventually became my wife. At 28, I was still pretty new to flying, and spending the better part of an entire day trapped in an airborne steel tube was just what I needed to stop worrying and learn to love the miracle of air travel. O. K. the truth is, I still don’t love to fly. But after that first marathon ride from New York to Johannesburg, which is among the longest   flights in existence, my focus has at least shifted from how to survive to how to make the long haul as painless as possible. The simplest way to guarantee a decent meal and some legroom is to upgrade to first class, but if you don’t have the luxury of spending a few hundred extra for premium seats, all is not lost. “Most air carriers configure their   economy cabins with slightly more legroom and added amenities,” said  Patrick Smith, a pilot who is author of “Cockpit Confidential: Everything You Need to Know About Air Travel. ” These amenities typically include free access to entertainment consoles, meals and alcoholic beverages. In other words, airlines are not completely evil, and are less likely to    you during   flights. That also applies to legroom. I was pleasantly surprised by the amount of leg space available in economy class during my first long haul to South Africa. But this does vary by airline. South African Airways has roomier seats (by one to two inches) on its nonstop flight from New York to Johannesburg than any other airline that flies between those two cities, according to Routehappy. com, a useful site that allows you to compare amenities before booking. Consider Seatguru. com when trying to find the most comfortable seat. But these freebies and a little extra legroom will get you only so far. A smartly packed   bag is essential. “A big mistake is expecting the flight attendants to take care of everything for you,” said Kara Mulder, a flight attendant who chronicles her   experiences on her blog, The Flight Attendant Life.  Ms. Mulder recommends taking your own water, a sweatshirt and socks to keep you warm (I never fly without my hoodie) and some of your favorite healthy snacks. “Don’t just eat the free food the flight attendants serve because it’s there,” Ms. Mulder said. “Your body will respond differently to different foods when at altitude. ” Dry oatmeal and dried fruit are favorites of Ms. Mulder. I’ve found trail mix and protein and granola bars to be safe and sustainable options. I’ve also learned not to be shy. If you napped your way through mealtime or did not pack enough water, take a walk to where the flight attendants are and ask for what you need. You still have 13 hours to go. Nothing puts a damper on a vacation like a blood clot in the knee. Studies have found that   travel increases the risk of venous thromboembolism, and that height is an additional risk factor, according to the federal Centers for Disease Control and Prevention. It’s still a rare condition, but the C. D. C. recommends “ambulation,” which is a fancy word for walking and thigh exercises, and suggests aisle seats for those who are particularly tall. Even if you’re not concerned about a blood clot, walking and stretching will make you less miserable in general, and there is plenty you can do without even leaving your seat. How about a little yoga at 39, 000 feet? “When it comes to a physical release, the yoga exercises help right away,” said Kajuan Douglas, a yoga instructor in New York City. “ You feel the physical stretch, and it’s like you have just awakened from sleep. ” You do not have to be a yogi to benefit from these stretches. The simplest ones can bring instant satisfaction. For beginners, Mr. Douglas recommends the “Locust Bind” stretch, which involves interlacing your fingers behind your back and drawing your shoulder blades toward each other, and “seated twisting,” placing your hand on your opposite knee or thigh and twisting from the upper back. It may seem hard to do when the toddler behind you is kicking your seat or your neighbor is snoring. “To help overcome these difficulties, I bring more awareness to my breath or add a simple mantra,” Mr. Douglas said. “Simply recite ‘inhale let, exhale go’ ” mentally as you breathe. ” If there is a silver lining to having 16 hours to kill, it’s that you can at least get something accomplished like work or reading that novel you’ve yet to make a dent in. But it’s not as easy as it sounds, especially if you do not plan ahead. You may be distracted by turbulence or the drink cart rolling by, and that first gin and tonic leads to another. Before you know it, you’re poking at the entertainment console and pondering which Adam Sandler movie you haven’t already seen 10 times. “I’m an author and blogger who writes about air travel,” Mr. Smith said, “but I find it almost impossible to get anything done, even with my subject matter all around me. ” Compartmentalizing your time is the way to go, and can make the flight feel much shorter. “Devote blocks of time to certain tasks,” Mr. Smith said. “Pick out a couple of movies to watch that’s three or four hours right there. Spend a couple of hours reading, then a couple of hours napping if you can, and so on. ” If you are intent on getting work done, you could try something like the Pomodoro Technique, which divides work into   intervals and separates them by short breaks. “I can be on a   flight and not watch one movie from the plane’s   entertainment system sometimes, simply because I planned out my tasks and airplane relax time so well,” Ms. Mulder said. “Those are good flights. ” That still feels like an oxymoron to folks like me but less so these days.'"}, "time": 1742564198.4745815}