{"duration": 1.336106300354004, "input_args": {"text": "'West Virginia Democrat Sen. Joe Manchin III praised President Donald Trump’s reversal Tuesday of President Barack Obama’s “Clean Power Plan,” which created a regulatory regime that targeted the coal mining industry and   energy plants. [“Since I was governor, I have fought against unnecessary bureaucratic regulations that harm our way of life with no regard for the catastrophic economic impacts they have on West Virginians,” said the only Democrat to stand and applaud during the president’s joint address to Congress.  “We need to strike a balance between the environment and the economy. The Clean Power Plan never achieved that balance. Rolling back this regulation is a positive step towards preventing further job loss, increases to consumer energy bills, and more damage to our economy,” he said. “We must stop ignoring the damage these regulations caused our energy sector, our economy and our way of life in West Virginia,” the senator said. The president touched on the human side of what he called the War on Coal in his remarks Tuesday after signing the executive orders. I actually, in one case, I went to a group of miners in West Virginia  —   you remember, Shelly  —   and I said, how about this: Why don’t we get together, we’ll go to another place, and you’ll get another job you won’t mine anymore. Do you like that idea? They said, no, we don’t like that idea  —   we love to mine, that’s what we want to do. I said, if that’s what you want to do, that’s what you’re going to do. And I was very impressed. They love the job. That’s what their job is. I fully understand that. I grew up in a real estate family, and until this recent little excursion into the world of politics, I could never understand anybody who would not want to be in the world of real estate. (Laughter.) Believe me. So I understand it. And we’re with you 100 percent, and that’s what you’re going to do. Okay? The “Shelly” Trump was calling out was  Senator Shelly Moore Capito ( ) Manchin’s fellow senator from the Mountain State. Manchin said Trump gets it on coal and the effects of the last administration’s approach towards coal. “This step by the administration recognizes that the Clean Power Plan went beyond the bounds of EPA’s authority, instead of working against us and imposing   economic wounds like the last administration,” he said.'"}, "time": 1742564047.9570544}