{"duration": 0.12344551086425781, "input_args": {"text": "'Last week’s American airstrike on a Syrian base believed to house chemical weapons used to attack Syrian civilians has brought the issue of refugees once again to the forefront of the political debate. [Democrats, ranging from Hillary Clinton to Maxine Waters, have used the airstrike as an opportunity to call again for the importation of 100, 000 more Syrian refugees into the United States.  “Rep. Maxine Waters (D, Calif.) slammed President Donald Trump on Sunday for his temporary refugee ban and backed a MoveOn. org petition calling for the United States to take in 100, 000 Syrian refugees,” the Free Beacon reported earlier this week. “Former presidential candidate Hillary Clinton chided President Trump Friday for ordering airstrikes against the Syrian regime at the same time as he attempts to bar Syrian refugees from the U. S. urging the administration to recognize that we cannot in one breath speak of protecting Syrian babies and in the next close America’s doors to them,” CBS News reported last week. But for President Trump and many Republicans, the airstrike presents an opportunity to   a concept President Trump raised on the campaign trail: the establishment of refugee safe zones overseas. The summary of President Trump’s proposed budget for FY 2018 released by OMB in March suggests the administration may be including a funding request to establish such refugee zones. “The blueprint for the Trump administration’s FY 2018 budget released on Thursday ‘allows for significant funding of humanitarian assistance, including food aid, disaster, and refugee program funding’ in the State Department,” Breitbart News reported in March:   The language of the blueprint, however, could be interpreted to suggest that the Trump administration’s “significant funding of . . . [the] refugee program” defines the program broadly to include safe zones in other parts of the world in addition to the federal refugee resettlement program. As such, a further reduction of refugees resettled in the United States in FY 2018 could be entirely possible. President Trump supported the establishment of safe zones for refugees during the campaign. The Refugee Admissions Program authorized by the Refugee Act of 1980 has been surrounded by political and legal chaos for several years, and that controversy has heightened during the campaign of 2016 and the first months of the Trump administration. Trump campaigned on stopping the flow of Syrian refugees to the United States, while Hillary Clinton wanted to dramatically increase that flow. Trump won the Presidency in part based on his stance on refugees, but his efforts to honor his campaign pledge have been hampered by court decisions that have temporarily halted both Executive Order 13769 and Executive Order 13780. Overall, the flow of refugees into the United States has declined under the Trump administration, but a significant number of refugees from the six Middle Eastern countries “hostile to the United States” Trump attempted to impose a temporary travel ban on in Executive Order 13780  —   Somalia, Sudan, Syria, Iran, Libya, and Yemen —  has continued unabated. Paying for the resettlement of refugees is expensive. Breitbart News estimated that the annual cost to American taxpayers to fund the resettlement of refugees exceeds $4 billion. Several cost estimates indicate that safe zones overseas would cost less than ten percent, on a per refugee basis, what it costs to resettle a refugee in the United States. In addition to the financial cost of refugee resettlement, the cultural cost to the United States is very high as well, since refugees —  especially from Somalia, Sudan, Syria, Iran, Libya, and Yemen —  have a long track record of failing to assimilate into American culture. That failure manifests itself in several ways. These refugees have been involved in a number of terrorist incidents in the United States. Somalian refugees in particular have participated in a number of terrorist incidents in the United States and been arrested for attempting to join ISIS. Then there is the huge public health impact of refugees, again particularly from these six countries in the Middle East. Breitbart News has reported, for instance, that the number of cases of active TB from refugees during the four year period from 2012 to 2015 exceeded 1, 500: The increase in the number of refugees diagnosed with active TB from 358 in 2012 to 409 in 2015 was partially responsible for the increase in the total number of   cases of active TB increased from 6, 274 to 6, 350 during those four years. Other categories of   cases of TB that increased included those who arrived under regular immigrant visas, which increased from 1, 437 in 2012 to 1, 670 in 2015,  those who arrived in the “other” category, which includes illegal immigrants (called “undocumented immigrants” in the CDC reports) which increased from 1, 312 in 2012 to 1, 408 in 2015, and those who arrived under student visas, which increased from 158 in 2012 to 191 in 2015.   TB cases as a percentage of all TB cases diagnosed in the United States increased from 63. 1 percent in 2012 to 66. 4 percent in 2015. Finally, there is a huge problem of common crimes committed by refugees who do not assimilate into American culture, or actively reject it. “Three boys from Iraq and Sudan who were invited into the country via refugee programs pled guilty to charges of sexually brutalizing a    American child in Twin Falls, Idaho, last year,” Breitbart News reported earlier this month. In North Dakota recently a “Somali refugee in the U. S. was sentenced to 20 years in prison after being convicted of molesting a teenage girl at gunpoint,” Breitbart News reported. The list of crimes reported by refugees in the United States is much longer than this, as a brief scan of the daily headlines around the country confirms on a regular basis. In one recent key appointment, President Trump indicated that it may no longer be “business as usual” in the Refugee Admissions Program. “President Donald Trump has selected Scott Lloyd to serve as the new director of the Office of Refugee Resettlement (ORR) the office within the Department of Health and Human Services that administers the payments to the voluntary agencies (VOLAGs) that resettle refugees in the United States,” Breitbart News reported last month. Still, Obama holdovers who have historically been strong refugee advocates, most notably Jennifer Higgins, remain in positions of authority in the Department of Homeland Security’s program responsible for refugee vetting. The Trump administration will shortly reveal how serious it is about establishing refugee safe zones overseas as a preferable alternative to bringing thousands more Middle Eastern refugees into the United States. The Continuing Resolution that has funded the federal government’s operations for the first half of FY 2017 is about to expire later this month on April 28. Recent comments by Senate Majority Leader Mitch McConnell ( ) suggest refugee safe zones may be part of budget considerations. McConnell “wouldn’t comment on whether Trump should let refugees into the U. S. but said it would be beneficial to create some safe zone in Syria, “which would require some military action  …    so people don’t feel like they have to run for their lives,” Axios reported last week. Any proposal by the Trump administration to increase refugee funding to establish safe zones during the remainder of FY 2017 will be included in the budgets brought to a vote in Congress to fund the balance of the fiscal year later this month.'"}, "time": 1742563376.789796}