{"duration": 0.02959609031677246, "input_args": {"text": "'Documentary filmmaker and leftist activist Michael Moore used his Instagram account Wednesday to urge the Democratic Party to declare a “national emergency” until the FBI completes an investigation into alleged connections between President Trump and his campaign staff and the Russian government. [“The Democratic Party needs to declare a National Emergency,” Moore wrote in a post Wednesday, along with an image of the robot HAL 9000 from the film 2001: A Space Odyssey. “For the first time in our history, the President of the United States and his staff are under investigation for espionage. This announcement, by the head of the   FBI, is a shock to our democracy. ”   The Democratic Party  needs to declare a National Emergency. For the first time in our history, the President of the United States and his staff are under investigation for espionage. This announcement, by the head of the   FBI, is a shock to our democracy. The Democratic leadership in the House and Senate needs to bring a halt to all business being done in the name of this potential felony suspect, Donald J. Trump. No bill he supports, no Supreme Court nominee he has named, can be decided while he is under a criminal investigation. His presidency has no legitimacy until the FBI  —   and an independent investigative committee  —   discovers the truth. Fellow citizens, demand the Democrats cease all business. ”The American people have a right to know if their President is a crook.”  —   Richard Nixon, A post shared by Michael Moore (@michaelfmoore) on Mar 21, 2017 at 11:46pm PDT,  FBI director James Comey said Money that the agency was “investigating the nature of any links between individuals associated with the Trump campaign and the Russian government, and whether there was any coordination between the campaign and Russia’s efforts,” though he acknowledged that the agency had thus far found no evidence to support   “collusion” between the two. In his Instagram post, the    Where to Invade Next director called on Democrats to impose a “halt to all business” being conducted by Trump, whom he called a “potential felony suspect. ” “No bill he supports, no Supreme Court nominee he has named, can be decided while he is under a criminal investigation,” Moore wrote. “His presidency has no legitimacy until the FBI  —   and an independent investigative committee  —   discovers the truth. Fellow citizens, demand the Democrats cease all business. ” Moore has been one of Trump’s most outspoken celebrity detractors since the start of his campaign. The filmmaker released a surprise documentary, Michael Moore in TrumpLand, with the aim of persuading voters to vote for Democrat Hillary Clinton with just weeks to go in the 2016 race. In January, Moore vowed to lead a campaign of “100 days of resistance” against Trump’s presidency shortly before the inauguration, the filmmaker hosted a large protest rally outside Trump Tower in Manhattan, alongside other celebrity Trump critics Alec Baldwin, Robert de Niro and Mark Ruffalo. In February, Moore took to Twitter to lament that Trump’s Supreme Court pick, Judge Neil Gorsuch, was “Obama’s to make and it was stolen by Republicans. ” “Senate Dems, let’s be very clear,” he wrote. “You will filibuster  block this SC nom or we will find a true progressive and primary u in next election. ”   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742628436.0945907}