{"duration": 0.21170830726623535, "input_args": {"text": "'CHESTER, Vt.  —   The way A J Jackson tells it, he kept his head ducked down and pretended to fiddle with his cellphone as he walked into the boys’ bathroom and headed for a stall at Green Mountain Union High School here. But the way some of his classmates see it, A J was still Autumn Jackson, a girl in boys’ clothing, who had violated an intimate sanctum, while two boys were standing at a urinal, their private parts exposed. “It’s like me going into a girls’ bathroom wearing a wig,” Tanner Bischofberger, 15, a classmate of A J Jackson’s, who was not one of those in the bathroom, said this week. “It’s just weird. ” A complaint about Mr. Jackson’s using the boys’ bathroom set off a protest by students advocating the right of their transgender classmate to use the bathroom of his choice. On Thursday, the schools superintendent announced a new practice at the high school allowing transgender students to use the   bathroom of their choice, rather than being encouraged to use a   bathroom. The announcement came a day before the Obama  administration’s national directive was announced. But this week, there was a counterprotest by students like Mr. Bischofberger wearing   showing the male and female figures commonly used to label bathrooms, over the words “Straight Pride. ” Like much of the country, this rural school of 300 students in seventh through 12th grade, where everyone insists there were never any cliques, is divided over the bathroom issue, with the teenagers here carrying out a proxy culture war for their parents and the country. Still struggling to form opinions about what makes a civil society, they openly quote what they have heard their parents say about the merits or demerits of transgender bathrooms. And the dispute has driven apart young people who grew up together and were once friends. Some say the new rule opens the door to sexual predators disguised as someone they are not. Others say it just violates tradition. A society has rules for a reason, and this is one of those rules, that’s just the way it is, they say. But on a more basic level, students at Green Mountain are complaining that a small vocal minority of gay, lesbian and, as far as they know, one  —   or maybe two  —   transgender students among them are trampling on the rights of the majority to decide what the rules of conduct should be. That idea of a minority’s ruling unfairly is what motivated the father of one student to order the “Straight Pride”   online last week and send them to school with his daughter, who declined to be interviewed. The    students say gay people are being celebrated at the expense of straight people. “I just want to be clear: I accept everybody being proud,” said Daniel Baldwin, a    junior. Sitting at a table in the school hallway, a copy of “The Catcher in the Rye” open in front of him, he wore a “Straight Pride” shirt pulled over a shirt dedicated to Slayer, a   band. “Everybody has the right to be who they are. ” Mr. Baldwin said he thought people should use male or female bathrooms depending on what was written on their birth certificates. But he also said he would defend A J if someone tried to bully him for being transgender, or even for using the boys’ bathroom. “I would step up for A J,” he said. “We’re Americans. We’re supposed to be civil. ” Listening to him, Mr. Jackson said he was dismayed by how they had been torn apart. “Oh, my God, we used to talk for hours about music,” he said. More broadly, the issue here has pitted resident against resident, often along social and economic lines. This is a place where   transplants wearing Birkenstocks and artsy jewelry mingle with   people in   boots who know how to handle a shotgun and proudly inhabit the homes of their ancestors. Despite Vermont’s image as a place of bucolic egalitarianism, home of the avowedly socialist candidate for president, tensions over privilege and tradition simmer just under the surface, and the bathroom wars have brought them to the fore. “I go in and do my thing and leave, but I have a concern about child molesters and pedophiles,” Joe Kopacz, 48, who runs a   operation, said as he stopped into Lisai’s Chester Market. Society does not change on a dime, especially   society, said Deb Brown, a member of the Green Mountain Union High School board, speaking in MacLaomainn’s, a pub and popular gathering spot that she owns with her husband. For people like her daughter, who was on girls’ sports teams with A J when he was Autumn, this is intensely personal, not just philosophical. “As we move forward as a community, there has to be compassion on both sides,” Ms. Brown said. “He needs to understand that this has been 15 years that students have known him one way. It’s obviously his choice, but maybe he should have respect for his classmates right now. ” Mr. Jackson has gradually been making the transition from a vivacious girl with a big smile and long wavy locks to a husky boy with chopped hair dyed several shades of green, snakebite piercings in his lips and gauges embedded in his earlobes. His chest is visibly bound, and because he has not yet started taking male hormones  —   he plans to do that, and also to have “top surgery,” he says  —   his face is smooth and still has feminine contours. He once thought he was lesbian, and is still attracted to girls. His mother, Tracy, a case manager for children with developmental disabilities, and his father, Scott, a mechanical engineer, came to Vermont from Connecticut to try it out 20 years ago and stayed. They brought up A J and his older brother in a log cabin in the woods, where they raise chickens and ducks, including a duck named Bernie, for you know who. “A typical American family,” his mother said, smiling. He was in sixth grade when he realized he was meant to be a boy, he said, and came out to the school last year in ninth grade, sending emails to teachers. When he entered Green Mountain in seventh grade, “I was using the female bathroom because, I really don’t know, I was still kind of back and forth about my identity,” Mr. Jackson said. “This year is the year I started using the men’s bathroom, because I already felt like way more comfortable in who I was. ” There were practical issues. When he had his period, he wondered if he should revert to the girls’ bathroom, because there was no place to throw away his used tampons. But he had started feeling like an intruder in the girls’ bathroom, and the single bathrooms were so far out of the way it was hard to get to class on time. So he stuck with the boys’ bathroom. “I use a stall, and I wait till everybody’s gone to get up and leave,” Mr. Jackson said. “The guys, they look at me like I’m some kind of freak, or they’re concerned or scared. ” The only classmate who talks to him when he sees him in the bathroom is his childhood friend Connor Rose, a leader of the school’s   alliance. Mr. Jackson feels safe in the boys’ bathroom at school, he said, whereas in public places, like Dunkin’ Donuts, he is afraid to go to the men’s restroom for fear of being attacked by straight men. He said he understood the concerns of some of his classmates. “There probably are some transgender people that are bad people, just like there are probably a whole bunch of gay people or straight people that are bad,” he said. He had been using the boys’ bathrooms for less than a month  —   trying to go in during lunch or recess when he would not be noticed  —   when someone complained. No one knows for sure who complained, but a widespread rumor holds that it was a middle schooler. Hank Mauti, a school board member and retired sawmill worker from Andover, said he wondered why Mr. Jackson would feel compelled to use a boys’ bathroom when there were six     bathrooms in the school. “What about the little boy that reported it?” asked Mr. Mauti’s wife, Wanda, repeating the rumor, in an interview in their home, under a trophy of a moose that Mr. Mauti shot. “As far as I can tell, his discomfort hasn’t been addressed. ” Tom Ferenc, the principal, called Mr. Jackson’s mother the night of the complaint and told her that he was going to ask A J to use the   bathroom, she recalled. The next Monday, A J and about 30 supporters walked out of the school in protest. Three days later, the district announced the new policy. Mr. Ferenc was happy to get some “clarity” about the proper policy, as he put it, and proud of his school. “It reminded me of Rosa Parks, honestly,” he said. Besides the “Straight Pride”   counterprotest, the decision has set off a storm of discussion, sometimes nasty on both sides, on Facebook. Also, someone taped a sign to a trash can this week that said, “Reserved for Mariah and Tanner,” referring to Mariah Lique and Mr. Bischofberger, two student leaders of the counterprotest, who are dating. Ms. Lique said that she and Mr. Bischofberger were just saying what a lot of other students think but are afraid to say because if they did, “you’d get hated. ” “We’re considered more conservative,” she said. “Because we’re outspoken,” Mr. Bischofberger interjected, finishing her sentence. Two of their favorite teachers are openly gay, they said, and the students misunderstand where they are coming from. “They see us as   …    ” Mr. Bischofberger began, “hating their sexuality,” Ms. Lique finished. But that is not true, they said. Part of what troubles them is that Mr. Jackson is still anatomically female. “Autumn, A J, whatever you call them, hasn’t had any hormone or sex change yet,” Mr. Bischofberger said. “This opens up opportunities for other kids to do stuff they’re not supposed to. ” While everyone seems to sympathize with the gay students, they seem to have a license to make him feel ostracized and attacked, and it hurts, Mr. Bischofberger said: “They’re calling me a cisgendered, hypocritical homophobe. ”'"}, "time": 1742561661.7700827}