{"duration": 0.07174229621887207, "input_args": {"text": "'The sheriff of Oregon’s most populous sanctuary county said he cannot help federal immigration officials because of state law. His office released a Mexican criminal alien convicted of sexual assault despite a hold from Immigration and Customs Enforcement officers. [Multnomah County Sheriff Mike Reese told Full Measure with Sharyl Attkisson that Oregon law prohibits his providing assistance to enforcing federal law during an interview conducted by Lisa Fletcher that will air on Sunday morning. “The state law is a very clear guideline for local law enforcement and sheriff’s statewide,” Reese explained. “We can’t expend county resources or personnel towards immigration enforcement. ”  Fletcher countered that one state legislator is “furious about this. ” “He says you’re not abiding by the law by not detaining some of these illegal immigrants who are held on very, fairly serious charges or who have committed fairly serious crimes, are a risk to the community,” she stated. “How do you respond to him?” The sheriff danced around the question, stating they hold people in their jails who “are accused of crimes in our communities. ” He says he hold criminals until a judge says otherwise. Sheriff Reese said by not acting as immigration agents he believes the country is better off. “It simply worries me that we’ve spent so much time and energy building community trust and something outside of our control may damage that. ” Crime victims might feel otherwise. A report issued on Thursday by U. S. Immigration and Customs Enforcement officials revealed that Sheriff Reese’s jail released a Mexican national on February 15. Immigration officials issued an immigration detainer on March 21, 2016. The report indicates the Mexican criminal alien has a prior conviction for sexual assault. The Declined Detainer Outcome Report for the week of January   3 revealed the release by the sheriff’s office of another Mexican national convicted of assault and a Tongan national convicted of amphetamine possession. Full Measure also presented an interview with immigration fugitive Francisco Aguirre, calling him the “poster child” for the sanctuary city of Portland. Aguirre, a Salvadoran national who fled to the U. S. as a teen. Oregon convicted the Salvadoran in 2014 for driving under the influence. Fletcher said he managed to avoid spending any time in jail for the crime, but it put him on the radar of ICE Enforcement Removal Operations officers. “A month later ICE knock on my door  …     tried to take me in custody. I let them know clearly that they wasn’t [sic] welcome there, and they must leave the property because it was private property,” Aguirre said defiantly. After the ICE officers left, Aguirre fled to Augustana Lutheran Church where he held up in a sanctuary for 81 days. Aguirre believes that despite entering the country illegally and committing another crime, he has earned the right to remain in the U. S. “You’re here illegally you committed a crime, a crime that very well could have killed somebody,” Fletcher stated. “Why do you deserve to stay in this country?” “I understand that I commit a crime by getting a DUI.  But, we all, as a human being, make mistakes, and we always deserve a second chance,” Aguirre said, rationalizing his prior actions. “I been contribute [sic] to the economy of this country. I been paying my taxes, since I been living in this country. I’m willing to help my community whenever they need. ” Aguirre remains safe under Sheriff Reese’s and the other elected officials of Portland’s sanctuary city protections. Or, maybe not. Late in March, ICE ERO officers carried out a targeted enforcement operation in three Pacific Northwest states, including Oregon. During that operation. Officers arrested more than 80 criminals aliens  —   19 of those included aliens with DUI convictions. Bob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX and Facebook.  '"}, "time": 1742563207.8731139}