{"duration": 0.08588790893554688, "input_args": {"text": "'Bundy brothers, 5 other Malheur wildlife refuge occupiers not guilty of conspiracy,... Bundy brothers, 5 other Malheur wildlife refuge occupiers not guilty of conspiracy, firearm charges By 0 39 \\nSeven people involved in the anti-federal government occupation of the Malheur National Wildlife Refuge have been found not guilty of conspiring to impede federal workers from doing their jobs, including Ammon and Ryan Bundy. \\nA jury found all seven remaining occupiers not-guilty of all charges except for one charge that has yet to be disclosed, KBOI reported . \\nRyan and Ammon Bundy, leaders of the six-week-long standoff in Oregon, along with several other members were also found not guilty of possessing a firearm in a federal facility. Posted by John Lamb on Thursday, October 27, 2016 \\nA live video from the Bundy Ranch’s Facebook showed some supporters claiming that Ammon Bundy’s attorney Marcus Mumford was tased in court by federal marshals. KATU reported that Mumford was in US Marshal custody after being allegedly tackled for yelling that Bundy was free to go following the announcement of the verdict. \\nThe Bundy brothers have yet to be released due to a federal hold over their standoff in Bunkerville, Nevada. Mumford’s insistence that they were to be released in Oregon is what led to the fight between him and federal marshals, according to KATU. \\n“None of their conduct was directed at employees,” one defendant’s lawyer explained to KATU. He reiterated that there were no employees at the Malheur Reserve during the occupation and no threats were made towards employees. \\nDefendant Neil Wampler told KATU, “the verdict came back a clean sweep for all of us.” \\n“This shows the absolute folly that has been committed by the federal government,” he said and called the trial “political prosecution.” \\nWampler added that he had been worried about the results, but said “the government boys were so mismanaged and so incompetent” that the jury was offered no incriminating evidence. \\nWampler said his next steps would be to support the Bundy brothers in Nevada, but in the meantime he’d like to “go home, see my son, walk around my town, walk my dog.” BREAKING: Ammon and Ryan Bundy not guilty for conspiracy and firearms charge, per OPB. \\n— KATU News (@KATUNews) October 27, 2016 Jury finds 7 Malheur occupiers not guilty of conspiring to impede federal workers from doing their jobs at refuge. #OregonStandoff \\n— Hannah Button (@hbuttonnews) October 27, 2016 \\nVia RT . This piece was reprinted by RINF Alternative News with permission or license.'"}, "time": 1742563542.774119}