{"duration": 0.04576849937438965, "input_args": {"text": "'Posted on October 30, 2016 by Baxter Dmitry in News , US // 0 Comments \\nA new WikiLeaks email from John Podesta’s account reveals the Clinton campaign manager was worried about internal leaks and plotted to “ make an example of a suspected leaker ” by punishing them with “ beyond internal discipline ”– whether or not there was “ any real basis for it. “ \\nResponding to an email from John Benenson about a “ damaging ” leak, Podesta wrote, “ I generally agree with the point, but we need a strategy on this that goes beyond internal discipline. “ \\nAs well as exposing the Clinton camp as the kind of organization that punishes people based on suspicion alone, the question of what “ beyond internal discipline ” means is raised – and in light of recent events the answers may be grim. Recommended (2 weeks ago) WikiLeaks Dumps More Podesta Emails, Bringing Total To Over 11,000 \\nJoel Benenson said, “ I think we have to make examples now of people who have violated the trust of HRC and the rest of the team .” Later in the email chain Robbie Mook replied to Podesta’s message, saying “ I would love an example being made.” \\nThe revelation of Podesta’s plan to punish a suspected leaker with “ serious consequences ” takes on a chilling aspect considering the fate of Seth Rich, the Democratic National Committee employee widely suspected of blowing the whistle on his employers. Rich was murdered in July and the case remains unsolved. \\nSpeaking on Nieuwsuur, a Dutch news channel, Julian Assange said that Rich’s murder was a cause of concern for WikiLeaks’ whistleblowers. \\n“There is a 27 year old who worked for the DNC who was shot in the back – murdered – just a few weeks ago, for unknown reasons as he was walking down the street in Washington .” \\nAsked by the host if Seth Rich was a WikiLeaks source, Assange said, “ I am suggesting that our sources take risks and they become concerned to see things occurring like that .” \\nThey will be more concerned after learning the Clinton campaign is the kind of organization that “ makes examples ” of people they are suspicious about – with or without having “ any real basis for it .” \\nThe full email chain can be read here .'"}, "time": 1742563439.415325}