{"duration": 0.21774792671203613, "input_args": {"text": "'ARJUN WALIA OCTOBER 18, 2016 Tensions between the United States, their allies, and Russia continue to rise. It seems, as always, that we are on the brink of global war. The Western military industrial complex continues to take over the Middle East and arm ISIS and other terrorist groups, as well as establish and solidify their military presence throughout the world. The sheer number of United States military bases around the globe is astonishing. \\nFor more, unbiased information on the current state of affairs between the United States and Russia, I recommend visiting theantimedia.org. \\nMainstream media outlets continue to spread propaganda , and have been doing so for years, claiming that there are terrorists, that they threaten national security, and that we must go after them. At the same time, an inflated sense of patriotism is encouraged in American citizens, so they believe their soldiers are fighting for freedom, despite doing the precise opposite. \\nA great quote by Edward Bernays, who was known as the father of public relations, comes to mind here: \\nThe conscious and intelligent manipulation of the organized habits and opinions of the masses is an important element in democratic society . Those who manipulate this unseen mechanism of society constitute an invisible government which is the true ruling power of our country. We are governed, our minds are molded, our tastes formed, our ideas suggested, largely by men we have never heard of. ( source ) \\nA number of politicians and academics from around the world have been trying to create awareness on this issue for decades, and although we’ve come a long way, our relatively slow progress demonstrates the stranglehold mainstream media has on the minds of the masses. \\n“The statesmen will invent cheap lies, putting the blame upon the nation that is attacked, and every man will be glad of those conscience-soothing falsities, and will diligently study them, and refuse to examine any refutations of them; and thus he will by and by convince himself the war is just, and will thank God for the better sleep he enjoys after this process of grotesque self-deception.” \\n– Mark Twain ( source ) \\nBelow, you’ll find 15 quotes on false flag terrorism and the secret government. False flag terrorism refers to the idea that terrorist attacks are created, perpetuated, and/or funded by Western governments and their allies in order to justify the infiltration of other countries for ulterior motives. Quotes on False Flag Terrorism and the Secret Government \\n1. The Dalia Lama \\n“Of course, war and the large military establishments are the greatest sources of violence in the world. Whether their purpose is defensive or offensive, these vast powerful organizations exist solely to kill human beings. We should think carefully about the reality of war. Most of us have been conditioned to regard military combat as exciting and glamorous – an opportunity for men to prove their competence and courage. Since armies are legal, we feel that war is acceptable; in general, nobody feels that war is criminal or that accepting it is criminal attitude. In fact, we have been brainwashed. War is neither glamorous nor attractive. It is monstrous. Its very nature is one of tragedy and suffering.” \\n“Modern warfare waged primarily with different forms of fire, but we are so conditioned to see it as thrilling that we talk about this or that marvelous weapon as a remarkable piece of technology without remembering that, if it is actually used, it will burn living people. War also strongly resembles a fire in the way it spreads. If one area gets weak, the commanding officer sends in reinforcements. This is throwing live people onto a fire. But because we have been brainwashed to think this way, we do not consider the suffering of individual soldiers. No soldiers want to be wounded or die. None of his loved ones wants any harm to come to him. If one soldier is killed, or maimed for life, at least another five or ten people – his relatives and friends – suffer as well. We should all be horrified by the extent of this tragedy, but we are too confused.” \\n“But no matter how malevolent or evil are the many murderous dictators who can currently oppress their nations and cause international problems, it is obvious that they cannot harm others or destroy countless human lives if they don’t have a military organisation accepted and condoned by society.” ( source ) \\n2. Dr. Michel Chossudovsky, Canadian economist, the University of Ottawa’s Emeritus Professor of Economics \\n“We are dealing with a criminal undertaking at a global level . . . and there is an ongoing war, it is led by the United States, it may be carried out by a number of proxy countries, which are obeying orders from Washington . . . The global war on terrorism is a US undertaking, which is fake, it’s based on fake premises. It tells us that somehow America and the Western world are going after a fictitious enemy, the Islamic state, when in fact the Islamic state is fully supported and financed by the Western military alliance and America’s allies in the Persian Gulf. . . . They say Muslims are terrorists, but it just so happens that terrorists are Made in America. They’re not the product of Muslim society, and that should be abundantly clear to everyone on this floor. . . . The global war on terrorism is a fabrication, a big lie and a crime against humanity.” \\n“Al Qaeda and the Al Qaeda affiliated organizations, including the Islamic State, are not independent organizations, they are sponsored, and they are sponsored by the United States and its allies. It is documented that prior to 2011, there was a process of recruitment of mujahideen to fight in Syria, and this was coordinated by NATO and the Turkish high command. This report is confirmed by Israeli news sources and unequivocally, we are dealing with a state-sponsorship of terrorism, the recruitment of mercenaries, the training and the financing of terrorism.” ( source )( source ) \\n3. Paul Hellyer \\n“It is ironic that the U.S. would begin a devastating war, allegedly in search of weapons of mass destruction, when the most worrisome developments in this field are occurring in your own backyard. It is ironic that the U.S. should be fighting monstrously expensive wars in Iraq and Afghanistan, allegedly to bring democracy to those countries, when it itself can no longer claim to be called a democracy, when trillions, and I mean thousands of billions of dollars have been spent on projects about which both the Congress and the Commander in Chief have been kept deliberately in the dark.” ( source ) \\n4. John C. Calhoun, The 7th Vice President of the United States \\n“A power has risen up in the government greater than the people themselves, consisting of many, and various, and powerful interests, combined into one mass, and held together by the cohesive power of the vast surplus in the banks.” ( source ) \\n5. Robin Cook, Former British Foreign Secretary \\n“The truth is, there is no Islamic army or terrorist group called Al-Qaeda, and any informed intelligence officer knows this. But, there is a propaganda campaign to make the public believe in the presence of an intensified entity representing the ‘devil’ only in order to drive TV watchers to accept a unified international leadership for a war against terrorism. The country behind this propaganda is the United States.” ( source ) \\n6. John F. Hylan, Mayor of New York City from 1918-1925 \\n“The real menace of our Republic is the invisible government, which like a giant octopus sprawls its slimy legs over our cities, states and nation . . . The little coterie of powerful international bankers virtually run the United States government for their own selfish purposes. They practically control both parties . . . [and] control the majority of the newspapers and magazines in this country. They use the columns of these papers to club into submission or drive out of office public officials who refuse to do the bidding of the powerful corrupt cliques which compose the invisible government. It operates under cover of a self-created screen [and] seizes our executive officers, legislative bodies, schools, courts, newspapers and every agency created for the public protection.” ( source )( source ) \\n7. Senator Daniel K. Inouye, highest ranking Asian-American politician in United States history \\n“There exists a shadowy government with its own Air Force, its own Navy, its own fundraising mechanism, and the ability to pursue its own ideas of the national interest, free from all checks and balances, and free from the law itself.” ( source ) \\n8. David Steele, the second-highest ranking civilian in the U.S. Marine Corps Intelligence and a former CIA clandestine services officer \\n“Most terrorists are false flag terrorists, or are created by our own security services. In the United States, every single terrorist incident we have had has been a false flag, or has been an informant pushed on by the FBI. In fact, we now have citizens taking out restraining orders against FBI informants that are trying to incite terrorism. We’ve become a lunatic asylum.” ( source ) \\n9. Theodore Roosevelt. former President of the United States \\n“Political parties exist to secure responsible government and to execute the will of the people. \\nFrom these great tasks both of the old parties have turned aside. Instead of instruments to promote the general welfare, they have become the tools of corrupt interests which use them impartially to serve their selfish purposes. Behind the ostensible government sits enthroned an invisible government, owing no allegiance and acknowledging no responsibility to the people. \\nTo destroy this invisible government, to dissolve the unholy alliance between corrupt business and corrupt politics is the first task of the statesmanship of the day.” ( source ) \\n10. Benjamin Disraeli, First British MP \\n“The world is governed by very different personages to what is imagined by those who are not behind the scenes.” ( Coningsby, Book 4, Chap. 15 , Page 131) \\n11. Senator William Jenner \\n“Today the path to total dictatorship in the U.S. can be laid by strictly legal means … We have a well-organized political-action group in this country, determined to destroy our Constitution and establish a one-party state … It operates secretly, silently, continuously to transform our Government … This ruthless power-seeking elite is a disease of our century… This group … is answerable neither to the President, the Congress, nor the courts. It is practically irremovable.” ( source ) \\n12. Woodrow Wilson, former President of the United States \\n“Since I entered politics, I have chiefly had men’s views confided to me privately. Some of the biggest men in the United States, in the field of commerce and manufacture, are afraid of something. They know that there is a power somewhere so organized, so subtle, so watchful, so interlocked, so complete, so pervasive, that they better not speak above their breath when they speak in condemnation of it.” ( source ) \\n13. Eric H. May, a former U.S. Army military intelligence and public affairs officer \\n“The easiest way to carry out a false flag attack is by setting up a military exercise that simulates the very attack you want to carry out. As I’ll detail below, this is exactly how government perpetrators in the US and UK handled the 9/11 and 7/7 “terror” attacks, which were in reality government attacks blamed on ‘terrorists.’ ” ( source ) \\n14. Professor Lance deHaven-Smith, Professor Emeritus of Public Administration and Policy, Florida State University \\n“SCADs [which refers to State Crimes Against Democracy] involve high-level government officials, often in combination with private interests, that engage in covert activities for political advantages and power.” ( source )( source ) \\n15. President John F. Kennedy \\n“The very word ‘secrecy’ is repugnant in a free and open society; and we are as a people inherently and historically opposed to secret societies, to secret oaths and to secret proceedings. We decided long ago that the dangers of excessive and unwarranted concealment of pertinent facts far outweighed the dangers which are cited to justify it. Even today, there is little value in opposing the threat of a closed society by imitating its arbitrary restrictions. Even today, there is little value in insuring the survival of our nation if our traditions do not survive with it. And there is very grave danger that an announced need for increased security will be seized upon by those anxious to expand its meaning to the very limits of official censorship and concealment. That I do not intend to permit to the extent that it is in my control. . . . \\nFor we are opposed around the world by a monolithic and ruthless conspiracy that relies primarily on covert means for expanding its sphere of influence–on infiltration instead of invasion, on subversion instead of elections, on intimidation instead of free choice, on guerrillas by night instead of armies by day. It is a system which has conscripted vast human and material resources into the building of a tightly knit, highly efficient machine that combines military, diplomatic, intelligence, economic, scientific and political operations. \\nIts preparations are concealed, not published. Its mistakes are buried, not headlined. Its dissenters are silenced, not praised. No expenditure is questioned, no rumor is printed, no secret is revealed.” ( source ) Share:'"}, "time": 1742561998.9625568}