{"duration": 0.04658985137939453, "input_args": {"text": "'Reince Priebus, the chairman of the Republican National Committee, urged unity behind Donald J. Trump in a series of interviews on Sunday television shows and said that “people just don’t care” about recent negative reports about his tax returns and his treatment of women. During an appearance on “Fox News Sunday,” Mr. Priebus defended Mr. Trump after an article in The New York Times on Saturday in which dozens of women who encountered Mr. Trump over his career told of unsettling conduct. Asked by Chris Wallace, the host, if he was bothered by the accusations in the article, Mr. Priebus at first said that “Well, you know, a lot of things bother me, Chris, and obviously I’m the wrong person to be asking that particular question,” but when asked again, Mr. Priebus said that voters were focused on other things. “I don’t think Donald Trump in his personal life is something that people are looking at and saying, ‘Well, I’m surprised that he has had girlfriends in the past.’ That’s not what people look at Donald Trump for,” he said. When pressed by Mr. Wallace, Mr. Priebus said, “yes, everything bothers me, Chris, but I don’t know the truth of these things, I don’t know other than reading an article whether or not these things are true. I think it’s something that Donald Trump is going to have to answer questions in regard to. ” But, the Trump campaign, Mr. Priebus added, “represents something much different than the traditional analysis of individual candidates” and that while such concerns were “legitimate,” he did not think they were “going to affect people’s view of who and what Donald Trump represents to them, given this election and the electorate. ” On CBS’s “Face the Nation,” Mr. Priebus said that whatever concerns Republicans might have, the party should rally behind Mr. Trump and he called efforts to draft a conservative for a   campaign a “suicide mission. ” “You are not only changing and throwing out eight years of the White House, but you are also throwing out, potentially, generations on the Supreme Court,” Mr. Priebus said. He was responding to an article in The Washington Post that outlined efforts among some Republican leaders, dissatisfied with Mr. Trump as the party’s   to recruit a third candidate to wage an independent bid. “Look, we could have up to three justices change over in the next eight years, and this is a suicide mission,” Mr. Priebus said. “It is not right. ” He repeated the argument on his Fox News appearance: “It’s a suicide mission for our country, because what it means is that you’re throwing down not just eight years of the White House but potentially 100 years on the Supreme Court, and wrecking this country for many generations,” he said. Mr. Priebus, who also appeared on ABC’s “This Week,” defended Mr. Trump’s resistance to releasing his tax returns. Asked on “This Week” if Mr. Trump should release his tax returns  —   an issue that dogged Mitt Romney in 2012, even after he eventually released them  —   Mr. Priebus repeated his argument that Mr. Trump operated under different political norms. “I don’t think the traditional playbook applies,” he said. “We’ve been down this road for a year. And it doesn’t apply. He’s rewritten the playbook. ”'"}, "time": 1742628540.176467}