{"duration": 0.07471656799316406, "input_args": {"text": "'TEL AVIV  —   The recent wave of antisemitic acts in the U. S. is “disgusting” and “reprehensible,” New York Gov. Andrew Cuomo said at Yad Vashem Holocaust Memorial in Jerusalem on Sunday, adding that his state would take “extraordinary measures” to fight the trend. [Cuomo’s remarks came on the heels of what was originally believed to have been an act of vandalism in which headstones at a Jewish cemetery in Brooklyn were overturned.  Authorities later determined the graves were damaged as a result of environmental and other factors.  There have been over 120 bomb threats made to Jewish institutions all over the U. S. and desecrations of several Jewish cemeteries.  Cuomo, who visited Israel in a   act of solidarity, said the wave of antisemitism “violates every tenet of the New York State tradition. ” “New York State by its definition is a celebration of diversity, it accepts all who believe in the spirit of inclusion and who live by discrimination of none. New York’s principles are built on a rock, they will not change, and the political wind will not change them,” he said. His state, he said, has “put together a special unit of the state police” to deal with the issue, and has “reacted aggressively with extraordinary measures, more aggressively than any other state in the nation” to the attacks. New York has the largest Jewish population outside of Israel. “We have made it clear that there will be no tolerance for these acts of antisemitism,” Cuomo said. “My sadness is that now another generation of young people has had to experience this pain,” he said. “A pain that for many young people was only in the history books is now very much in their daily lives. These acts of antisemitism have also transpired on college campuses, so an entirely new generation has been exposed. ” Cuomo, who toured Yad Vashem with President Reuven Rivlin, said the   trip to Israel had two main goals: “Number one, while some would weaken the relationship between the people of the State of New York and our Jewish brothers and sisters, the purpose of this trip is to strengthen those relationships through cultural exchange [and] through economic development partnerships, and we’ll be working on them. ” Using the Hebrew word for “here I am,” he added, “The second purpose of this trip is ‘Hineini.’ I am here, I have been here before, and I will be here again. ” Rivlin praised Cuomo for his solidarity, saying that it is “an extremely important signal that the U. S. people and government will not let antisemitism win. ” Rivlin added that Israel was indebted to President Donald Trump for his condemnation of the attacks, in addition to the words and gestures of Vice President Mike Pence, who visited a vandalized Jewish cemetery in St. Louis. During the Holocaust, the president noted, the U. S. was a “rare island of safety” for the Jews. “We can never, ever, let that change,” he added. Cuomo will also meet with Prime Minister Benjamin Netanyahu and Jerusalem Mayor Nir Barkat, visit the Western Wall and attend a security briefing at Jerusalem’s Old City Police Headquarters before heading back to the U. S. on Monday.'"}, "time": 1742563423.3151257}