{"duration": 0.1669752597808838, "input_args": {"text": "'LOUISVILLE, Ky.  —   Muhammad Ali filled the middle of three screens in the small theater. In footage taken a few years after his 1960 Olympic gold medal performance, he was explaining his decision to sit out the Vietnam War to a group of white male college students. “You won’t even stand up for me in America for my religious beliefs,” said Ali, who had converted from Christianity to Islam, “and you want me to go somewhere and fight, but you won’t even stand up for me at home. ” From her seat in the darkened room at the Muhammad Ali Center on Saturday, Emma McElvaney Talbott heard Ali’s words and couldn’t hold back. “That’s right,” she exclaimed, not caring how far her voice carried. The hometown that McElvaney Talbott and Ali shared was staging a citywide   this weekend for its native son, who died late Friday after a   struggle with Parkinson’s disease. Outside the center, the flags had been lowered to  . Inside, McElvaney Talbott’s memories, triggered by the   film of Ali’s life, were going full tilt. All around her were people who had come to pay their respects, some bearing bouquets of flowers or boxing gloves, handmade signs or letters. Or, in some cases, just silent blessings. Kerry Borvan, who had been traveling with her nephews from Chicago to the Dollywood theme park in Pigeon Forge, Tenn. made an unplanned stop at the museum and cultural center after waking up to the news of Ali’s death. Dr. Saleem Seyal, a cardiologist who was born in Pakistan and is a longtime resident of the Louisville area, had once met Ali, and he produced photographs from his smartphone to prove it. He had come to say a Muslim prayer for the former heavyweight champion of the world. There were also those who were there from the start, who knew Ali as a kid in Louisville who raced school buses on foot and walked teenage girls home from school for the prospect of a kiss, who could testify to the sentiment that Mayor Greg Fischer of Louisville had expressed at a Saturday morning memorial service when he said, “Muhammad Ali belongs to the world, but he only has one hometown. ” That rang true for McElvaney Talbott, a retired educator and a writer, and her husband, Cecil Talbott, an engineer, who are   members of the center, which was   by Ali and his wife, Lonnie. On Saturday, the waiving of admission fees was hardly what motivated them to join the steady procession of visitors. On a day when the weather  —   gray and glum with scattered sunshine between downpours  —   reflected the city’s collective emotions, they said they had come because each room in the center was like a page from a scrapbook. Like Ali, Cecil Talbott learned to box at a local gym run by Fred Stone, who is credited with helping to teach Ali the footwork that enabled him to flit around the ring like a dancer. With prodding from his wife, Talbott recounted a   sparring session he had with the much bigger Ali, then known as Cassius Clay, when both were teenagers. Talbott said he was scrawny and stood just 5 feet 7 inches when he climbed into the ring with Ali, who was well on his way to his adult height,  . Ali seemed not to care that the objective of sparring was to practice technique, not inflict torment, “In the first round, Cassius threw a hard right, and Fred warned him not to hit hard,” Cecil Talbott said. “In the second round, Cassius threw another hard right, and Freddie had to warn him again not to do it. “In my mind, I said, ‘This is not going to work,’ so in the third round, he threw another hard right, and I saw it coming. I blocked it and I threw a hard right back. Cassius looked at me and said, ‘Good shot.’ ” Talbott gave up boxing soon thereafter, but Ali was hooked. McElvaney Talbott, who was in the same class at Central High as Ali’s younger brother, recalled Ali shadowboxing in the halls as he made his way from one class to the next. He was smart, she said, but didn’t apply himself in school. “He was a cutup,” she said. “I just remember he was a lot of fun. ” Some mornings, he entertained his schoolmates by racing a dozen blocks or more as he tried to outrun the bus that McElvaney Talbott rode to school. “We’d be screaming and hollering and laughing,” she said. “We’d be yelling: ‘Go Cassius!’ ” McElvaney Talbott recalled with a laugh: “He’d always stop for the young ladies. I called him a big ol’ teddy bear. ” One day, she said, he walked her home from a skating rink, shadowboxing on the sidewalk and jabbering away. “When we got to my door, he asked me for a kiss,” she said. “I regretfully said no, and he didn’t push it. ” In 1960, the year Ali graduated from high school, he won the   gold at the Summer Olympics in Rome. Upon his return home, he received a hero’s welcome, but the local adulation, like the gold in his medal, did not run deep. Instead, discrimination did. One had to be a fighter to rise above the daily humiliations of life in a segregated city, McElvaney Talbott said. Some leaned on books and learning and religion. Ali used his fists and his wit. As a child of the segregated South, she said she understood the forces that had carried Ali into the embrace of the Nation of Islam, an American Muslim sect that advocated racial separation. (He would later convert to orthodox Islam.) She said she was proud when he refused to be drafted to fight in the Vietnam War and requested   status, which caused him to be stripped of his heavyweight title by boxing commissions around the country and put his career on hiatus for more than three years during his athletic prime. “We lived with him through all the injustices,” McElvaney Talbott said. “I remember feeling that he was right to refuse to go and feeling really sad when they stripped him of his title. ” She added, “He was the man for that time. ” As his fame grew, his trips home diminished. But during his visits, “he was always the hometown boy,” McElvaney Talbott said. “If you saw him, he was approachable. ” During one of those visits, she said, Ali ran into her older brother, Woody. “Give me your address,” she said Ali told her brother. An hour later, Ali showed up on his doorstep. “I ran into him at the center four years ago,” she said, “and I told him I was Woody’s sister. He was struggling with his speech, but his face lit up. ” Ali’s younger brother, who was born Rudolph but later converted to Islam and took the name Rahman Ali, spent part of Saturday receiving visitors at a house on Grand Street. It was next door to the carnation pink clapboard structure where he and his brother were raised by their mother, Odessa, a cook and house cleaner, and their father, Cassius Marcellus Clay Sr. a sign painter and church muralist. The     home was restored and converted into a museum that opened last month. Visitors were greeted at the front door by Sonny Fishback, who was dressed in purple pants and a matching bowler’s shirt as if ready for the nightclub stages he once commanded. Fishback attended Central High with Ali and his brother and later became a singer and songwriter. Stories flowed freely from him as he controlled the tide of people streaming inside to buy an $8 admission ticket and pay their respects to Rahman Ali, who is as quiet as his brother was loquacious. In the bedroom the brothers shared, there are two paintings of Muhammad Ali by Rahman, who is an artist. Speaking softly, Rahman said that his brother’s physical suffering was over and that he had led a rich life. When it was suggested to him that Ali’s greatest currency was the love he gave away freely and, in his later years, was returned a thousandfold, Rah beckoned the visitor closer and kissed her on the cheek. Five miles from the house, at the Green Meadows Memorial Cemetery, which sits on the other side of the railroad tracks, a woman knelt in front of the granite gravestone shared by Ali’s parents, planting marigolds to spell out “Love. ” She identified herself as Diana Rupa but said she went by the surname Ali because the boxer embodied kindness and respect and dignity. As she was working the dirt around the flowers, she said she had never met Ali but felt a personal and spiritual connection to him. Earlier in the day, Rupa had added an elephant piñata to the makeshift shrine for Ali on the porch of his childhood home. She set another   elephant at his parents’ grave site. With their thick skins, their graceful way of moving on their toes and their ability to communicate to their herd without seeming to speak, elephants remind her of Ali. The boxer known for running his mouth became a humanitarian who did not have to say a word. Referring to his Parkinson’s disease, which so diminished Ali’s voice, Rupa said, “God had to shut him up,” she said, “so that we could hear his heart. ”'"}, "time": 1742564374.7937155}