{"duration": 0.0477290153503418, "input_args": {"text": "'Changing the Montenegrin leader does not change the ideology   Source: Submitted By Milko Pejovic The statement of the Prime Minister of Montenegro Milo Djukanovic concerning his resignation and the transfer of powers including the formation of a new parliament is actively discussed In Montenegro. Despite a positive outcome for the opposition forces the situation has not changed. Djukanovic explained his resignation by an anti-governmental conspiracy involving foreign intelligence services and the Serbian minority. Under the pretext of dealing with “conspirators” arrests of opposition leaders and activists are being continued in the country. The story about the arrest of “terrorists” who were planning to capture state institutions of Montenegro on the night of 17 October is still discussed in media. Special public prosecutor of Montenegro Milivoje Katnich declared the disclosure of this crime’s plan. However, after a few days weapons seized from the militants were not found in the stock where they were delivered. According to workers of the Prosecutor’s office the weapons were destroyed according to the order of Katnich. The elimination of the main evidence is at least a strange decision. A few days after the elections opposition activists Željko Šćepanović and Gordan Konatar were detained on suspicion of financial fraud. According to law enforcement they had a large amount of money with them. Šćepanović is s member of the party “Movement for Change” and is a relative of Nebojsa Medojevic who is one of the leaders of the DF. The persecution affected not only active participants in the political process but also Aron Shaviv who is the adviser of the DF. Pro-government media ganged up on him with “accusatory” articles. Representatives of law enforcement agencies staged a covert persecution. Anonymous letters are being sent via email and SMS to regular citizens who support the political initiatives of the “Key” and the “Democratic Front” and other parties. Montenegrins are forced to hide their political commitment to the opposition. Activists objectionable to Djukanovic’s regime are under strict ideological pressure from the authorities and law enforcement agencies. Montenegro has long been a police state where it is dangerous to tell the truth, where political changes in the management team does not improve the situation.  '"}, "time": 1742561648.7091594}