{"duration": 0.03156018257141113, "input_args": {"text": "'Videos Space Wars Likely In The Future As US, Russia Develop Satellite Weapons Mankind will have to decide whether to militarize space or not. There are very difficult negotiations in process. Moreover, the US wants to pass a bill to declare certain orbits exclusively American.\" | October 27, 2016 Be Sociable, Share! A United Launch Alliance Delta IV lifts off from Space Launch Complex-37 with the Air Force’s Global Positioning System (GPS) IIF-5 satellite. Recently, the Russian space agency Roscosmos kicked off tenders for three GLONASS satellites to be launched in 2017-2018. The company is expected to spend over one billion rubles ($16 million) on the program. \\nThe first launch is scheduled for December 25, 2017, the other two – for November 25, 2018. The satellite will be carried by a Soyuz-2.1b rocket from the Plesetsk Cosmodrome spaceport. \\nIn February and May 2016, two Glonass-M satellites were added to the GLONASS system. Currently, the system involves 27 satellites, 23 of which are in operation, two are put in orbital reserve, one is undergoing flight tests, and the last is undergoing maintenance. \\nIn the event of a military conflict, communication satellites would be an important target, military expert and observer Viktor Baranets said. “The current situation in space is that no satellites are protected, no matter at what orbits they are. The reason is that alongside with development of space systems, the US is running on all cylinders developing space weapons,” Baranets told Radio Sputnik. Moreover, China already joined the game, with an anti-satellite missile test in 2007. \\n“Russia has its own plans too. I think that if Washington keeps ignoring Russia’s calls for the demilitarization of space, the so-called ‘combat cosmonautics’ would become reality,” Baranets pointed out. \\nHis words were echoed by Russian defense expert Vasily Kashin. In an interview with Sputnik China , Kashin said that modern satellites are almost devoid of any opportunity to protect themselves from the impact of interceptor missiles. \\nIn 2008, the Russian and Chinese governments proposed an international agreement to prevent the deployment of weapons in outer space but the US government under Presidents George W. Bush and Barack Obama has consistently rejected launching negotiations to conclude such a treaty. \\nBefore Barack Obama became president, during his presidential campaign, he called for talks with Russia on anti-satellite weapons which started back in the 1970s but then was terminated by Washington. However, no progress has been made on the issue. \\nBaranets said it could not be ruled out that in the future space might be militarized which would pose a threat to the entire world. “Mankind will have to decide whether to militarize space or not. There are very difficult negotiations in process. Moreover, the US wants to pass a bill to declare certain orbits exclusively American,” Baranets said. \\nAccording to him, the defense industries of both Russia and the US are working to develope space combat systems. If the process is not stopped “space wars may be possible.” \\nThe expert stressed that the 1967 Outer Space Treaty between the US, the USSR and Britain should be revised. The document represents the legal framework of international space law, including prohibition of weapons of mass destruction in orbit. \\n“The treaty should be revised as soon as possible. This will prevent militarization of space. Now, space is becoming a place for effective strikes against the enemy,” the expert concluded. \\nIn turn, Kashin assumed that anti-satellite weaponry is a new reality that should be considered while planning a possible military operation. In this new reality, Russia, China, the US, as well as India and Iran will most likely possess domestically-made sophisticated anti-satellite weapons, according to him.'"}, "time": 1742628548.6236103}