{"duration": 0.15094542503356934, "input_args": {"text": "'Dr. Sebastian Gorka, deputy adviser to President Trump and former National Security editor for Breitbart News, addressed criticisms of the president’s revised immigration order on Tuesday’s Breitbart News Daily. [SiriusXM host Alex Marlow began with the charge that President Trump’s executive order is a disguised “Muslim ban” or the beginning of a “slippery slope” to block all Muslim immigration to the United States.  “Well, then I guess the Obama administration were Islamophobes, as well, because the list of seven nations  —   which we’ve actually reduced to six, excluding a very large country called Iraq  —   that list was inherited from the Obama administration’s analysis,” Gorka pointed out. “The fact is, we agree with the threat analysis from the Obama administration, which also had concurrence from Congress, as well, that these are the seven nations that are most problematic when it comes to national security vetting for immigration and for refugees,” he said.  “And again, I cannot make this point enough times: if there were any dread ulterior motive to this executive order with regards to Islam or Muslim nations, why is the largest Muslim nation in the world, Indonesia, not included? Why is the largest Arab Muslim nation in the world, Egypt, not included?” he asked. “This is about national security, very very simply. ” Marlow quoted an ACLU interview on National Public Radio that revealed that the crux of the argument against the new executive order will be President Trump’s campaign rhetoric, in which he referred to a “Muslim ban. ” “That’s incredibly telling,” said Gorka. “It really is part and parcel of what I call the fake news phenomena. You look at the media, and they always focus in on half a sentence, on a phrase, and believe they can generate stories out of that. That’s the same in this case. When you’re using shorthand for a very, very significant national security exercise, it’s the broader instrument that needs to be analyzed  —   especially if it goes to a court of law, where somebody wishes to use legal instruments to analyze it. ” “It’s good to hear they’ve tipped their hand, but yet again, if you look at the order, the text of what it predicates and why it was brought, there’s absolutely no way  —   in the courts or outside of the courts, using common sense  —   to imply anything other than this is a national security measure that is in the purview of the president,” he said. “Only the president has the prerogative, since the 1950s, to determine who comes into the United States and against what metrics they are measured. That’s not disputable. That cannot be parsed in a court of law. It is laid down in national statute. The ACLU may have an opinion, but the law remains the law. ” Marlow observed that some critics on the Right do not think the order went far enough, and he asked if it was meant as a negotiation or stalling tactic. “We start from simply a   determination of where the threats are. Again, the list can be shortened. You saw that it was shortened in the last month. It can be increased. There can be more nations added to it. It’s a temporary measure  —   very important. This is 90 days, so it’s something that is about the review of the system,” Gorka replied. “You look at those seven nations, and there’s one thing that links them,” he said. “You take Iran out of it. Iran is a special case because they’ve been a state sponsor of terrorism since 1979. Every other country is home to the new Caliphate, the Islamic State, ISIS, or is a hotbed for   activity. ”  “This isn’t randomly chosen nations picked out of a hat. This is the most clear and present danger from individuals in active war zones, that have groups who say  —   have said this in English in their propaganda product  —   ‘We will exploit the refugee streams and the migrant streams to insert our individuals, our operatives, into those flows.’ It’s just hard, cold analysis,” said Gorka. Marlow cited a report from Fox News that about 300 refugees are currently the subjects of FBI terrorism investigations. Gorka said this was just part of a broader picture of the terrorist threat. “There have been, since September the 11, just under 600 successful terrorist prosecutions in the United States, in the last 16 years,” he noted. “Approximately half of those put people in prison who were not born in the United States, about half of them. And of the number that were not U. S. nationals, about three dozen were actually refugees or had asylum status. ”  “So again, this isn’t hyperbole,” he stressed. “This isn’t fictional hypothesizing. It’s based on the facts of what’s happened in the last 16 years, and most importantly, Alex, it’s about preventing the next attack. Good   isn’t reactive. You don’t wait until 120 people have been massacred at a rock concert in Paris. You don’t wait until somebody steals a truck and mows down 80 people, as in Nice. What you want to do is to prevent the bad guys coming in, and that’s exactly why the president brought his order,” said Gorka. Marlow quoted a complaint from the Powerline blog that Trump’s executive order does not go far enough to consider the possibility that “sons and daughters of those who will still be admitted” could become terrorists. “That’s another front in the war against global jihadism or radical Islamic terrorism,” said Gorka. “The author of the article should be fully aware of the fact that this administration understands that not all terrorism is done by foreign nationals or refugees,” he said in response to the Powerline piece. “We’ve seen this. We’ve seen this with Nidal Hassan. We’ve seen this with other individuals here in the United States. Yes, there will be other measures taken that look at the issue of what you do with people who choose the life of jihad as a U. S. national or as somebody who grows to the age of maturity and then decides to go down that path of killing their fellow American or plotting to do so. ”  “Remember, this is just one executive order. Nobody in the administration is positing that we are solving all counterterrorism issues with this one executive order,” he promised. On the subject of detainees released from Guantanamo Bay and returning to terrorism, which President Trump addressed in a Tuesday morning tweet, Gorka said, “We’ve got to change the policies that we’ve seen occur over the last eight years. ” “We have an unbelievably high recidivism rate from Guantanamo Bay. The president has been clear that he understands the value of Guantanamo Bay,” Gorka said. “What needs to be understood about the facility is that it’s not just a detention facility. It’s also a very, very important intelligence asset if you look at the kinds of people that we’ve put in there and the kinds of intelligence we’ve gleaned from them. ” “There’s no ideology driving this administration that is about feeling good and releasing people when we feel that they’re no longer a threat. If these individuals have chosen the life of jihad and are committed to it, that means in perpetuity. Unless they distance themselves from it and reject it, they remain a threat to everything this nation stands for,” he declared. Gorka said President Trump’s next priority is “the finalization and deployment of the   plan. ” “It’s been drawn up by the generals, by Secretary Mattis, and now the final touches will be put to that plan. The intent is  —   and it will happen the president said so in his joint session, when he addressed the joint session of Congress  —   that we will obliterate the Islamic State and wipe this type of terrorism from the face of the earth. The next large muscle movement is going to be the   plan’s implementation,” he said. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742564350.1945856}