{"duration": 0.043589115142822266, "input_args": {"text": "'Blizzard will be pushing out a “20th Anniversary” patch to Diablo III this week that will add the original Diablo campaign to the game, and it’s already getting a lot of attention.[  With patch 2. 4. 3, the Diablo III team will open a portal through the town of Tristram to where the franchise began. For a limited time, players will be able to travel to a recreation of the first Diablo game. The nostalgic journey comes complete with a pixelated visual filter,   camera restrictions, and forced walking, all in an attempt to recall the look and feel of the original. Even the sound effects have been pared down, made purposely tinny and repetitive in the spirit of 90s gaming. The patch brings other changes and additions, as hotly contested as anything changed in an online game. Between the official announcement, YouTube, and Reddit, you’ll find opinions as varied as “the thing happening with wizard for such a long time is a heresy. They should all be fired. Change this dev team,” to “i thought this was already out. ” Character changes are overpowered or underpowered, practically cheating or absolutely worthless, depending on who you ask. Many players are disappointed that the event won’t be around for more than a month, and others are looking for new free content that is more meaningful to the endgame. There are lingering concerns about the Necromancer class being released later this year, mostly because it won’t be free. If you were a fan of Blizzard’s original action RPG  —   or if you never had the chance to play it  —   this could be a great time to jump in on the latest game in the franchise. If you’re a devoted player looking for meaningful new content or dramatic balance adjustments, you may be a little less impressed. Follow Nate Church @Get2Church on Twitter for the latest news in gaming and technology, and snarky opinions on both.'"}, "time": 1742562114.303451}