{"duration": 0.03972625732421875, "input_args": {"text": "'Nigerian authorities announced the release of an estimated 82 of the 276 girls kidnapped by the Islamic   terrorist group Boko Haram from a mostly Christian school in Chibok, Nigeria, in 2014 this weekend. The release appears to be part of a deal that may have gained freedom for jailed Boko Haram terrorists. [A Nigerian government official told Al Jazeera the government was keeping the girls in the town of Banki, close to the   border. Few details surfaced on the status of the girls following their release Saturday.  “According to sources, this may be a result of negotiations  —   but there have also been some military operations of recent around that area, as well as other parts of northeast Nigeria,” Al Jazeera’s Ahmed Idris reported from Nigeria’s capital. “We were told that Boko Haram was trying to negotiate for the release of some of their top commanders in custody of the Nigerian security services,” Idris reported. “There are also some reports suggesting that they want some ransom to be paid for some of these girls. ” Boko Haram, which roughly translates to “all Western education is forbidden,” seeks to impose Islamic Sharia law in Nigeria’s mainly Muslim north. In March, thousands of women in Nigeria took the streets of the northern capital Maiduguri to protest the government’s inability to eradicate Boko Haram, which continues to commit mass abductions, rapes, and murders since the government claimed it had defeated the group in 2015. The women who organized in Maiduguri, the capital of northeastern Borno state, wanted to attract the attention of representatives of the U. N. Security Council, who were visiting the city at that time. The protests also targeted President Muhammadu Buhari in Abuja, who won the nation’s presidency on a campaign promise to eliminate Boko Haram. Boko Haram jihadists also abuse boys by teaching them at an early age how to rape women while limiting the chances of them escaping. “They tell us to remember to hold the girl tight on both hands, pinned to the floor,” a    boy identified as “Ahmed” told reporters last year. “They said we shouldn’t let a woman overpower us. ” On April 14, 2014, the terrorists seized 276 pupils from the Government Girls Secondary School in the town of Chibok, with 57 of them managing to escape in the immediate aftermath of the abduction. Since then, some of the schoolgirls have been released, while others managed to escape. Even with Saturday’s release, that leaves about 100 girls still unaccounted for and the future of the girls is uncertain after years of trauma and many have borne children while in captivity.'"}, "time": 1742563875.9373279}