{"duration": 0.047380924224853516, "input_args": {"text": "'While President Donald Trump amasses praise from labor unions and   work advocates for his cracking down on abuse within the   visa program, the U. S. Chamber of Commerce is distressed by the executive order. [The U. S. Chamber of Commerce slammed Trump’s order, which mandates that the Departments of Justice, Labor, and Homeland Security conduct legal reviews of the   system and its impacts on American labor.  “Economic growth requires a skilled workforce, so it should be a priority to make sure American workers have the skills required to fill open jobs with American companies,” the Chamber wrote in a statement. “It would be a mistake to close the door on   workers from around the world who can contribute to American businesses’ growth and expansion and make the U. S. more competitive around the world. The   program plays an important role in addressing this need, but it can be improved. ” The U. S. Chamber of Commerce’s statement also claims the organization supports Trump’s ‘Buy American’ initiative, but said “expanding current ‘Buy American’ rules in U. S. law would make it more difficult to spur growth and jobs here at home. ” Rather than reforming or ending the   visa program, which gives at least 85, 000 U. S.  jobs to foreign workers every year, the Chamber said they would prefer an expansion. “If the goal is to grow the economy and create jobs, which the administration has indicated, it’s important to open more procurement markets for American companies and attract the best and brightest talent,” the statement read. “We look forward to working with the administration to accomplish those shared goals. ” The U. S. Chamber of Commerce touts their support for “a legal status” for illegal immigrants on their website, despite the harmful impacts it would have on American workers. As Breitbart News has reported, there are perhaps 1. 8 million foreign guest workers in the U. S. despite 4 million young Americans entering the workforce every year. If the   visa program had never been introduced and enacted, computer science job availability in the labor market would be up 11 percent and wages in the tech industry would have increased by five percent, Breitbart News reported. With American voters, the   visa remains incredibly unpopular, since only 30 percent of Americans said in a recent poll that the   visa is necessary, Breitbart Texas reported. John Binder is a contributor for Breitbart Texas. Follow him on Twitter at @JxhnBinder.'"}, "time": 1742562194.0563455}