{"duration": 0.12563252449035645, "input_args": {"text": "'Posted on November 7, 2016 by Lawrence Davidson \\nFor those who might wonder why foreign policy makers repeatedly make bad choices, some insight might be drawn from the following analysis. The action here plays out in the United States, but the lessons are probably universal. \\nBack in the early spring of 2003, George W. Bush initiated the invasion of Iraq. His public reason for doing so was the belief that the country’s dictator, Saddam Hussein, was on the verge of developing nuclear weapons. The real reason went beyond that charge and included a long-range plan for “regime change” in the Middle East. For our purposes we will concentrate on the belief that Iraq was about to become a hostile nuclear power. Why did President Bush and his close associates accept this scenario so readily? \\nThe short answer is Bush wanted, indeed needed, to believe it as a rationale for invading Iraq. At first he had tried to connect Saddam Hussein to the 11 September 2001 attacks on the U.S. Though he never gave up on that stratagem, the lack of evidence made it difficult to rally an American people, already fixated on Afghanistan, to support a war against Baghdad. However, the nuclear weapons gambit proved more fruitful, not because there was any hard evidence for the charge, but because supposedly reliable witnesses, in the persons of exiled anti-Saddam Iraqis, kept telling Bush and his advisers that the nuclear story was true. \\nWhat we had was a U.S. leadership cadre whose worldview literally demanded a mortally dangerous Iraq, and informants who, in order to precipitate the overthrow of Saddam, were willing to tell the tale of pending atomic weapons. The strong desire to believe the tale of a nuclear Iraq lowered the threshold for proof . Likewise, the repeated assertions by assumed dependable Iraqi sources underpinned a nationwide U.S. campaign generating both fear and war-fever. \\nSo the U.S. and its allies insisted that the United Nations send in weapons inspectors to scour Iraq for evidence of a nuclear weapons program. That the inspectors could find no convincing evidence only frustrated the Bush administration and soon forced its hand. On 19 March 2003 Bush launched the invasion of Iraq. The expectation was that, once in occupation of the country, they would surely find those nukes. They did not. Their Iraqi informants had systematically lied to them. \\nSocial and behavioral sciences to the rescue? \\nThe various U.S. intelligence agencies were thoroughly shaken by this affair, and today, thirteen years later, their directors and managers are still trying to sort it out—specifically, how to tell when they are getting “true” intelligence and when they are being lied to. Or, as one intelligence worker has put it, we need “ help to protect us against armies of snake oil salesmen. ” To that end the CIA et al. are in the market for academic assistance. \\nA “partnership” is being forged between the Office of the Director of National Intelligence( ODNI ), which serves as the coordinating center for the sixteen independent U.S. intelligence agencies, and the National Academies of Sciences, Engineering and Medicine . The result of this collaboration will be a “ permanent Intelligence Community Studies Board ” to coordinate programs in “social and behavioral science research [that] might strengthen national security.” \\nDespite this effort, it is almost certain that the “social and behavioral sciences” cannot give the spy agencies what they want—a way of detecting lies that is better than their present standard procedures of polygraph tests and interrogations. But even if they could, it might well make no difference, because the real problem is not to be found with the liars. It is to be found with the believers. \\nBelievers \\nIt is simply not true, as the ODNI leaders seem to assert, that U.S. intelligence agency personnel cannot tell, more often than not, that they are being lied to. This is the case because there are thousands of middle-echelon intelligence workers, desk officers, and specialists who know something closely approaching the truth—that is, they know pretty well what is going on in places like Afghanistan, Iraq, Syria, Libya, Israel, Palestine and elsewhere. Therefore, if someone feeds them “snake oil” they usually know it. However, having an accurate grasp of things is often to no avail because their superiors—those who got their appointments by accepting a pre-structured worldview—have different criterion for what is “true” than do the analysts. \\nListen to Charles Gaukel, of the National Intelligence Council—yet another organization that acts as a meeting ground for the 16 intelligence agencies. Referring to the search for a way to avoid getting taken in by lies, Mr. Gaukel has declared, “ We’re looking for truth. But we’re particularly looking for truth that works. ” Now what might that mean? \\nI can certainly tell you what it means historically. It means that for the power brokers, “truth” must match up, fit with, their worldview—their political and ideological precepts. If it does not fit, it does not “work.” So the intelligence specialists who send their usually accurate assessments up the line to the policy makers often hit a roadblock caused by groupthink, ideological blinkers, and a “we know better” attitude. \\nOn the other hand, as long as what you’re selling the leadership matches up with what they want to believe, you can peddle them anything: imaginary Iraqi nukes, Israel as a Western-style democracy, Saudi Arabia as an indispensable ally, Libya as a liberated country, Bashar al-Assad as the real roadblock to peace in Syria, the Strategic Defense Initiative (SDI) aka Star Wars, a world that is getting colder and not warmer, American exceptionalism in all its glory—the list is almost endless. \\nConclusion \\nWhat does this sad tale tell us? If you want to spend millions of dollars on social and behavioral science research to improve the assessment and use of intelligence, forget about the liars. What you want to look for is an antidote to the narrow-mindedness of the believers—the policymakers who seem not to be able raise above the ideological presumptions of their class—presumptions that underpin their self-confidence as they lead us all down slippery slopes. \\nIt has happened this way so often, and in so many places, that it is the source of Shakespeare’s determination that “what is past, is prelude.” Our elites play out our destines as if they have no free will—no capacity to break with structured ways of seeing. Yet the middle-echelon specialists keep sending their relatively accurate assessments up the ladder of power. Hope springs eternal. \\nThis work by MWC News is licensed under a Creative Commons Attribution-NonCommercial-NoDerivs 3.0 Unported License . \\nDr. Davidson has done extensive research and published in the areas of American perceptions of the Middle East, and Islamic Fundamentalism. His two latest publications are Islamic Fundamentalism (Greenwood Press, 1998) and America’s Palestine: Popular and Official Perceptions from Balfour to Israeli Statehood (University Press of Florida, 2001). He has published thirteen articles on various aspects of American perceptions of the Middle East. Dr. Davidson holds a BA from Rutgers, an MA from Georgetown University and a Ph.D. in history from the University of Alberta. This entry was posted in Analysis . Bookmark the permalink .'"}, "time": 1742563871.8942792}