{"duration": 0.080474853515625, "input_args": {"text": "'California Governor Jerry Brown told Adam Nagourney of the New York Times in an interview published on Tuesday that he does not use the word “resistance” to describe his opposition to President Donald Trump, and finds it inappropriate. [“I don’t use the term resistance   …     That was a term I associate with the French underground and people who risked their lives. So I don’t know that that’s a fair, apt metaphor for the latest contretemps over policy,” Brown told Nagourney.  Nagourney’s article explores the efforts of Democratic politicians in California  —   who dominate the state’s politics  —   to lead the nationwide opposition to the Trump administration. The question of how, exactly, to conduct that opposition is one that divides the state party, and which is already playing into the election to succeed Brown as governor in 2018. While some candidates, and the state legislature, are pushing for more aggressive confrontations, Nagourney notes, “a more pragmatic dynamic is emerging for Democrats who are more settled in office” and need Trump’s “cooperation. ” He mentions lobbying by state and local officials for a share of Trump’s proposed spending on infrastructure projects. An important example that escaped Nagourney’s attention is California’s reliance on the Trump administration to provide emergency relief. Already, the state has requested aid from the federal government four times since Trump took office, as it wrestles with the damage of heavy winter rains, snow and flooding. Each time, Trump has granted the aid. Democrats  —   not just in California  —   have embraced the term “resistance. ”   Jewish groups are even calling themselves the “Jewish resistance,” even though the original Jewish Resistance Movement was a   militia. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742563307.9499497}