{"duration": 0.04368114471435547, "input_args": {"text": "'Texas is one of a list of states looking to institute their own transgender bathroom restrictions, quite regardless of the guff North Carolina took for its own bill last year. Predictably, just as it did against North Carolina, the NCAA and the Big 12 Conference look to act against Texas over the law. [After North Carolina passed its 2016 House Bill 2, which restricted some bathrooms, the NCAA decided to pull all tournament games from the state in protest over what the organization labeled “discrimination. ”  At the time, the AP wrote that the state’s governor criticized the NCAA for the move. “Gov. Pat McCrory says the NCAA failed to show North Carolina respect when it moved championships and tournament games out of the state because of a law that governs which bathrooms transgender people must use,” the AP said. Now that Texas walks down the same legislative path that North Carolina blazed, the NCAA and Big 12 again look to punish a state. Announcing the effort in Texas, Lone Star State Lt. Governor Dan Patrick said of the new bill, “This issue is not about discrimination  —   it’s about public safety, protecting businesses and common sense,” according to USA Today. Since the announcement in Texas, the NCAA has put the state on notice that they are watching. While the NCAA itself didn’t have a statement at this time, the Big 12 did have something to say. “The Big 12 Conference is aware of the filing of Senate Bill 6 in the Texas State legislature,” said Big 12 spokesman Bob Burda. “We will track the bill’s progress through the legislature, and at an appropriate time discuss its impact with our member institutions. ” The NCAA acted quickly and with prejudice against North Carolina, but it’s unclear whether it will act in a similar, swift manner against Texas. With at least five other states across the country contemplating similar bills, it may come to diminishing returns for the leagues to act in boycott. The boycott of one state came easy for them, but if five or more pass bathroom laws similar to North Carolina’s the leagues may end up on the outside looking in. Along with Texas, other states now beginning the process of debating and enacting a bathroom bill include Alabama, Missouri, South Carolina, Virginia, and Washington. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742561634.5377061}