{"duration": 0.08422350883483887, "input_args": {"text": "'“Moonlight,” Barry Jenkins’s celebrated, intimate portrait of a gay youngster growing up in a   Miami neighborhood, rode into the awards season on a wave of momentum Monday night, scooping up four Gotham Awards, including best feature. “It’s a tough film, with a bit of hope in it,” Mr. Jenkins told the Bagger as celebrators and journalists swirled around him, offering hugs and congratulations after the show. “I love that people come out of it with a sense of hope. Whatever we did, it’s getting into people, and they see themselves in it. ” Held at Cipriani Wall Street in Lower Manhattan, the   Gothams  —   attendees included Amy Adams, Cate Blanchett, Natalie Portman, Janelle Monáe and a delightfully   Danny DeVito  —   signal the beginning of the movie awards season. The prizes for “Moonlight”  —   it also won best screenplay, best ensemble and the audience award  —   firm up early forecasts that it would be a strong player in the awards race this year. Though the Gothams are not necessarily predictive of the Oscars, its winners for best feature from the previous two years, “Birdman” and “Spotlight,” went on to receive the Academy Award for best picture. Other awardees included Ezra Edelman, who won best documentary for the multipart “O. J.: Made in America,” Casey Affleck, best actor for “Manchester by the Sea,” and Isabelle Huppert for “Elle. ” (On Tuesday, the competition between “Moonlight” and “Manchester by the Sea” was ratcheted up another notch by the National Board of Review. The board named Mr. Jenkins best director of the year, but named “Manchester by the Sea” the year’s best film, and Mr. Affleck best actor. Best actress went to Amy Adams, for her star turn in “Arrival. ” Mr. Edelman collected the best documentary award again, while Kenneth Lonergan, who wrote and directed “Manchester,” won for best original screenplay. The rather mysterious board  —   which describes itself as a “select group of film enthusiasts, filmmakers, professionals, academics and students of varying ages and backgrounds”  —   will hold its awards ceremony in Manhattan on Jan. 4.) At the Gothams on Monday night, Mr. Affleck, who is famously fame averse, said while clutching his award onstage, “It feels really good, I got to say. I didn’t think I’d care this much. ” A clearly shocked Ms. Huppert said, “I’m stunned I’m breathless,” as the room cheered. “They told me it’s a very American award. A very New Yorker award. And ‘You are French, so you probably won’t get it. ’” Not surprisingly, given the crowd and the host,   Key, the evening was heavily laced with references  —   overt, sly, heartfelt and arch  —   to   Donald J. Trump. “Here’s some silver lining: Thank God he isn’t going to live here,” Mr. Key said in his introduction. Oliver Stone, who collected a tribute award, urged    filmmakers to risk being critical of their government if they saw fit. “Don’t go easy on what you think is wrong,” Mr. Stone said. “The surveillance state, ‘1984,’ cyberwarfare, drone warfare, is with us. This is a major, major issue of our time. I hope you young people will address it. ” After Mr. Stone returned to his seat, Mr. Key jokingly pitched him film ideas from the stage. “How about ‘JFKKK’?” Mr. Key asked. “No? What about ‘Wall Tweet’?” Later, presenting the audience award, the actor Damian Lewis noted how the voting process worked. “This is the best part,” Mr. Lewis said. “The film that receives the most votes is the winner. It’s a brilliant idea. ”'"}, "time": 1742562550.0803635}