{"duration": 0.07986259460449219, "input_args": {"text": "'November 12, 2016 348 Ads on Craigslist reveal that paid anti-Trump protesters and Soros-sponsored staged demonstrations are continuing to fuel hate and division. Share on Facebook \\nIt was reported previously on The Duran that MoveOn – a George Soros controlled NGO, is behind the organization of anti-Trump protests across the country. As the protests continue, however, Craigslist has become an important recruitment tool for some of these organizers, and here is what it reveals: \\nFight the Trump Agenda! We’re hiring Full-Time Organizers 15/hr! – reads a Craigslist ad from Washington CAN in Seattle . Activists are promised Medical, Dental, Vision, 401(k), Paid Vacation, Paid Sick Days, Holidays, and Leave of Absence . \\nWashington CAN claims to be the state’s oldest and largest grassroots non-profit with over 35 years of organizational experience. It is unclear whether it has any direct ties to Soros’s MoveOn, but it certainly wouldn’t be a wild assumption to make under the circumstances. \\nIn another instance, a Craigslist ad exposed paid Anti-Trump protesters being recruited for a staged event in Los Angeles. And this time the Soros link is quite clear and in the open. TruthFeed reports: \\nIn this case, a Craigslist ad in Los Angeles shows that activists are wanted to block traffic in the heavy traffic intersection of Highlands and Hollywood. \\nHere’s an example of a Soros employee literally “posing” as a protester. Not all that “grass roots.” \\nObviously, no one is disputing the fact that there are millions of people unhappy with the election results. Neither is there any doubt that thousands across the the country are protesting genuinely out of emotion and desire to express their discontent. What’s important is that these people realize that they are playing right into the hands of an establishment agenda that doesn’t have America’s best interests in mind. \\nThe election is over and we have a clear winner. The losing side has conceded, admitting that the election was fair and calling for a peaceful transition of power. For all the smart folks out there this is a clear indication that it’s time to go home, back to school, back to work, back to your daily routine and stop trying to prolong the division and hate that has been eating away at this country for far too long. '"}, "time": 1742561725.2300506}