{"duration": 0.06482315063476562, "input_args": {"text": "\"\\nPosted by Martin Walsh | Nov 11, 2016 | Liberal Corruption Trump Delivering His FIRST Order \\nThis feeling of a President Trump is a breathe of fresh air. You can feel it in your communities all across the country and in your own life. You can feel yourself imagining things that you want to accomplish because Trump has already instilled a cultural change that breeds toughness and hard work. How To Make An Organic Super Food For Survial At Home - Watch Video Click Here \\nDemocrats and the lying media slammed Donald Trump for months when he argued that he may not accept the results of the election. Now that he has won, ironically, it has been the media and Hillary’s supporters that are refusing to accept the results of the election. \\nIn wake of Donald Trump winning the election in a landslide, thousands of whiny, entitled liberals are flooding the streets with their violence and tears because they just cannot deal with a President that has said mean things. Your burning and disrespect of the flag is why Trump won, kids #TrumpProtestors \\n— Katie Pavlich (@KatiePavlich) November 10, 2016 \\nThese ungrateful, entitled crybabies are burning the American flag, which is something that should never be tolerated. \\nIn September of 2015, Donald Trump was asked about his stance on the legality of burning our flag. \\n“Personally, I don’t think it should be legal,” the Republican presidential front-runner told the Daily Caller last year. Yet, now we have more examples than we need of this treason. Notice Hillary supporters burning the American flag. Trump supporters don't burn American flags. Vote Trump! pic.twitter.com/IdzCghzia1 \\n— Caesar Ramirez (@caesar_ramirez) June 4, 2016 \\nOr this act of treason… Students burn American flags at AU in protest of Donald Trump's presidential win. Video courtesy of Meh. https://t.co/u4y2xX2sxe #fox5dc pic.twitter.com/nkFUnY2pk8 \\n— FOX 5 DC (@fox5dc) November 9, 2016 \\nThe United States Supreme Court has ruled that flag burning is constitutionally protected freedom of speech. Now that Donald Trump will be appointing several Conservative Judges to serve on the Court, we can expect that ruling to change in the coming year or so. \\nOn top of Trump’s comments a year ago, senior members in his administration have indicated President Trump has now made this issue one of this top priorities. Sources argue that soon after President Trump assembles his cabinet and has a Supreme Court Judge nominated, they will move this issue forward immediately to prosecute anyone caught burning the American flag. \\nTrump officials argue, “you have the right to peacefully protest and voice your opinion. You do not have the right to burn our Nation’s strongest symbol.” \\nLiberals just cannot fathom why burning the American flag is bad. They cannot see beyond their own entitlement that millions of brave men and women have given their lives to fight for everything our flag represents. The only bigots I see are the ones burning American flags, attacking Trump supporters, and destroying cities. \\n— Martin Walsh (@mrwalsh8) November 10, 2016 \\nPresident Trump has indicated that he is more than willing to work with everyone in this great Nation so that we can all come together. If you still choose to incite violence, you will be charged with a crime and sent to jail. \\nIf you are threatening to leave this country, go ahead and leave. We no longer have time to console people who got their feelings hurt or need a nap. We are about to make this country great again by getting people back to work. We are going to instill the idea of being tough and working hard to achieve your goals instead of holding your hand out as if you are entitled to something. \\nIt’s truly amazing that we finally have a President that will love and respect our military. The American flag is bigger than any of us. It represent decades of sacrifice, bravery, and patriotism. Millions of men and women gave their life so that scumbag liberals have the freedom to cry in the streets and throw temper tantrums when their candidate doesn’t win the election. \\nUnder President Trump, if you are caught burning our flag, you will be charged with a crime. We are going to make America great again. Either you are with us, or you can leave. \""}, "time": 1742563014.272266}