{"duration": 0.13531064987182617, "input_args": {"text": "'WASHINGTON  —   The Office of Government Ethics has informed lawyers for   Donald J. Trump that only a divestiture of his financial stake in his sprawling real estate business will resolve ethical concerns about conflicts of interest as he assumes the office of the presidency. The revelation from the normally secretive federal agency came Wednesday in a bizarre series of oddly informal postings on its Twitter account after officials apparently concluded, erroneously, that Mr. Trump had committed on his own Twitter account to divesting his assets. “As we discussed with your counsel, divestiture is the way to resolve these conflicts,” the office wrote on Twitter, revealing legal advice that would normally be confidential and adding in a separate post: “Bravo! Only way to resolve these conflicts of interest is to divest. Good call!” In fact, Mr. Trump had made no such commitment, at least publicly. In a series of   posts on Twitter, Mr. Trump said he would separate himself from the operations of his vast global business empire. Mr. Trump provided few details in his posts and did not say whether he would divest his assets. But he promised to hold a “major news conference” with his adult children in two weeks to reveal legal documents that would remove him from what he called the “business operations” of his company. He vowed to leave the Trump Organization “in total” to focus on running the country. But his vague promise to “in no way have a conflict of interest with my various businesses” drew an immediate rebuke from legal and ethics experts in Washington, who said that a close reading of the actual words in the posts suggested that Mr. Trump was not planning to take sufficient steps to eliminate conflicts. The emphasis on “business operations,” not on ownership, hinted that Mr. Trump was not ruling out retaining a financial stake in the Trump Organization or putting his children in control. Ethics experts said such moves would leave Mr. Trump vulnerable to accusations that his official actions were motivated by personal financial interests. “Although it is of course important that he have no involvement in Trump business operations, in order to avoid conflicts he must also exit the ownership of his businesses through using a blind trust or equivalent,” Norman L. Eisen, who was a White House ethics lawyer in the Obama administration, and Richard W. Painter, an ethics lawyer in the Bush administration, said in a joint statement to The New York Times. Noah Bookbinder, executive director of Citizens for Responsibility and Ethics in Washington, a liberal nonprofit group that promotes ethics in government, said: “Unless his solution is to sell the business outside the family and put the proceeds in a blind trust, he’s not really doing anything to solve the problem. Just because you say something on Twitter doesn’t make it so. ” Every president in the past four decades, Mr. Eisen and Mr. Painter noted, has taken personal holdings he had before being elected and put them into a blind trust in which the assets were controlled by an independent party. If Mr. Trump were willing to sell his assets, one option would be to seek a certificate of divestiture from the Office of Government Ethics, which would allow him to sell his real estate holdings and other businesses with an enormous tax advantage. This system was set up to allow wealthy Americans to take jobs in the government and avoid conflicts of interest without a large financial impact. It allows incoming government officials to defer paying capital gains taxes on any earnings on the investment. This could generate an enormous windfall for Mr. Trump, given his vast real estate holdings. After Henry Paulson was nominated by President George W. Bush to serve as Treasury secretary, he left a job at Goldman Sachs and took advantage of this provision, avoiding conflicts of interest by selling an estimated $500 million in Goldman stock. Money generated from the liquidation of Mr. Trump’s assets would have to be invested in “permitted property,” which is limited to Treasury bonds or diversified mutual funds, ending the real estate ventures that are so tied to the Trump family’s identity. Still, that is what the Office of Government Ethics has said he should do. The office is normally a staid agency that rarely talks to reporters on the record, but Wednesday’s Twitter posts were oddly enthusiastic. The series of nine posts suggested that officials were celebrating what they thought was a decision by Mr. Trump to accept their legal advice. In their posts, officials at the ethics agency referred to a 1983 legal opinion in which the office urged presidents to “conduct themselves as if they were” bound by conflict of interest laws, even though such laws do not apply to occupants of the Oval Office. In a statement, Seth Jaffe, an agency spokesman, said that officials there were “excited” by Mr. Trump’s announcements on conflicts of interest and that the messages were not based on any information about the  ’s plans beyond what was shared on his Twitter feed. Asked later about the disclosure of the advice that the Office of Government Ethics had given to Mr. Trump’s lawyers, Mr. Jaffe said he could not provide additional comment. But the agency has left the posts on its official government account. Officials for Mr. Trump’s campaign and the Trump Organization did not respond to requests for comment about the disclosures from the agency. And Reince Priebus, who will be the White House chief of staff, said on the MSNBC program “Morning Joe” that he was not ready to provide any more information about the legal discussions. “You should know that he’s got the best people in the world working on it,” Mr. Priebus said. In fact, the  ’s plan to deal with conflicts remains unclear. Simply removing Mr. Trump from    control of business decisions could still allow him to benefit financially from payments made to his companies by foreign governments, which may be prohibited by the   emoluments clause of the Constitution, Mr. Eisen said. And Mr. Trump’s Twitter posts said nothing about whether his children, who serve as advisers on his presidential transition committee, would continue to have roles in his administration. If Mr. Trump’s business is run by his children, they must be entirely separated from government operations, Mr. Eisen and Mr. Painter said. That means they could not participate in meetings with world leaders, like the prime minister of Japan, as Ivanka Trump did last month. “Without an ethics firewall that is set up at once and continues into the administration, scandal is sure to follow,” Mr. Eisen and Mr. Painter said in their statement. Democrats on Capitol Hill immediately questioned on Wednesday whether Mr. Trump’s Twitter posts indicated a significant change in his plans, and called for a formal investigation by the House Judiciary Committee. A letter sent by Representative John Conyers Jr. of Michigan, the ranking Democrat on the Judiciary Committee, and signed by 15 other Democrats on the committee, said Mr. Trump’s posts raised “a number of questions,” including whether Mr. Trump intends to transfer ownership of his assets. On Wednesday, Mr. Trump emphasized the appearances he would need to maintain as president, saying he believed it was “visually important” to avoid conflicts between his government role and his businesses. Mr. Trump insisted, as he has before, that he is not legally required to take any steps to divest himself of his financial ties. In an interview with The Times last week, he said, “The law is totally on my side, meaning the president can’t have a conflict of interest. ” He also said in the interview, “I would like to try and formalize something, because I don’t care about my business. ” Divesting could be costly and complicated. “That’s a very hard thing to do, you know what, because I have real estate. I have real estate all over the world,” he said in the interview. “Selling real estate isn’t like selling stock. Selling real estate is much different. It’s in a much different world. ”'"}, "time": 1742564460.4205334}