{"duration": 0.1458902359008789, "input_args": {"text": "'Go to Article \\nThe Obama Department of Justice has been corruptly aiding and abetting the Democratic Party’s presidential nominee, Hillary Clinton, to escape legal accountability for her actions. From Attorney General Loretta Lynch on down through the Justice Department’s political ranks, the Department has blocked the FBI from searching for the truth and following the evidence of potential criminality to its logical conclusion. Whether it is Hillary’s use of a private e-mail server while serving as Secretary of State or her involvement in the pay-for-play Clinton enterprise known as the Clinton Foundation, the Obama administration is applying a banana republic-style double standard to pervert justice and the rule of law in order to shield her. \\nLynch and President Obama were reportedly furious with FBI Director James Comey for sending a letter to Congress on October 28 th indicating that new evidence potentially pertinent to the e-mail case had come to light, which required further investigation. This evidence consisted of a batch of e-mails FBI investigators had found on one or more computers belonging to Anthony Weiner, Clinton confidante Huma Abedin’s estranged husband, while they were searching for evidence in an unrelated case involving Weiner’s alleged sexting to an underage girl. Comey sent his letter after months of agonizing over his previous decision to let Hillary off the hook in the e-mail case last July. He was said by a source close to him to have been particularly disturbed by the mounting number of resignation letters from FBI agents who felt betrayed by that decision. \\nDepartment of Justice officials had leaned on Comey not to send the letter to Congress, claiming that it would violate Department protocols and procedures against taking any action that could be perceived as interfering with the upcoming presidential election. To his credit, Comey ignored the Department officials’ objections, claiming he had an obligation to keep the Congress and the public informed of any potentially significant new developments in the case. \\nDemocrats, who had lavished praise on Comey for his July decision, lashed out at Comey for sending his letter updating Congress. Senate Minority Leader Harry Reid went so far as to make the baseless charge that Comey may have violated the law by informing Congress, because, Reid argued, he appeared to be taking sides in an election. The disgraced former Attorney General Eric Holder, held in contempt of Congress for withholding information relating to the Fast and Furious scandal, said about Comey’s action, “I fear he has unintentionally and negatively affected public trust in both the Justice Department and the FBI. It is up to the director to correct his mistake — not for the sake of a political candidate or campaign but in order to protect our system of justice and best serve the American people.” \\nSince when has Holder been genuinely concerned about protecting our system of justice and best serving the American people? Holder had already contributed to the erosion of public trust, with his blatant politicization of the Obama Department of Justice. As evidenced by the Obama Department of Justice’s handling of the multiple FBI investigations involving Hillary Clinton, the Department has continued its slide into the muck of corruption. It interfered with both the normal course of criminal investigations and the election by stacking the deck in Hillary’s favor, ensuring that no indictment would occur to derail her path to succeed Obama and preserve his legacy. \\nFirst, the Department of Justice reportedly refused to empanel a grand jury in either the e-mail case or in connection with the FBI’s investigation of the Clinton Foundation pay-for-play allegations. “The problem here is this investigation was never a real investigation,” former assistant FBI director James Kallstrom said . “That’s the problem. They never had a grand jury empanelled, and the reason they never had a grand jury empanelled, I’m sure, is Loretta Lynch would not go along with that.” \\nKallstrom’s belief that Lynch acted to influence the results of the FBI probes in Hillary’s favor is buttressed by Lynch’s 30 minute private tarmac meeting with Bill Clinton shortly before FBI Director Comey faced the cameras on July 5 th with his exculpatory announcement. \\nSecond, at least five immunity agreements were handed out in the e-mail case, including to Hillary’s lawyer and confidante Cheryl Mills and to Platte River Networks’ Paul Combetta. It appears that Combetta had previously lied to government investigators – a crime in itself – while trying to cover up the fact that he had evidently Bleachbited e-mails to delete them, even though they had been subject to a previously issued Congressional subpoena. The immunity agreements garnered nothing in return, but had the effect of blocking access to the computer devices of the immunity beneficiaries in the FBI’s separate Clinton Foundation investigation. Apparently, the Department decided against the alternative option of subpoenaing the computer devices or seeking a search warrant, rather than granting useless immunities, in order to obtain any evidence relevant to the e-mail investigation that might have been contained in those devices. \\nThird, the Department and FBI did not conduct their last minute interview of Hillary Clinton under oath and allowed Cheryl Mills – herself a material witness – to sit in during Hillary’s interview. They did not ask pertinent follow-up questions. There was no verbatim transcript of the interview to use in checking the veracity of Hillary’s statements during the interview against her sworn Congressional testimony or her many public statements. \\nFourth, the Department of Justice reportedly refused to allow the FBI to issue subpoenas to gather more evidence in connection with its investigation of the Clinton Foundation pay-for-play allegations. In fact, senior Department officials reportedly would not authorize a more thorough FBI investigation because they claimed there was not sufficient evidence gathered thus far to justify going further. Such a circular argument was a mere cover to prevent seasoned career investigators from learning the full extent of foreign government donations while Hillary was Secretary of State, their true motivations and any favors extended by the State Department in return. \\nFinally, the cross-connections between the Clintons and some high level Department of Justice and FBI officials cry out for recusal. But not so in this administration. For example, the wife of the deputy FBI director who was involved in the laggard Clinton Foundation investigation, Andrew McCabe, just happened to have received a large donation from close Clinton ally Virginia Governor Terry McAuliffe to her 2015 run for the State Senate. \\nTo make matters worse, the Obama Department of Justice assigned Assistant Attorney General Peter J. Kadzik, a close friend of Hillary Clinton’s campaign manager John Podesta, to communicate with Congress about what Kadzik promised would be a “thorough” review of the newly discovered e-mails from Anthony Weiner’s online account. \\nPodesta praised Kadzik in an e-mail to an Obama campaign official back in 2008 as a “Fantastic lawyer,” and said about his pal, “Kept me out of jail.” Their history together goes further back than that. During the waning days of Bill Clinton’s presidency, it was Kadzik, then representing the infamous billionaire fugitive Marc Rich, who lobbied Podesta, then serving as Bill Clinton’s chief of staff, for a presidential pardon on his client’s behalf. Kadzik’s lobbying effort, no doubt helped along by contributions to Hillary Clinton’s Senate campaign and to Bill Clinton’s presidential library, paid off. Bill Clinton delivered the requested pardon on his last day in office. \\nKadzik joined the Department of Justice in April 2013, first as a Deputy Assistant Attorney General for Legislative Affairs, and then as the Principal Deputy. With the Podesta connection intact, Kadzik has served as a highly placed Clinton campaign mole in the Department. An e-mail dated May 19, 2015 from Kadzik to Podesta, released by WikiLeaks , proves the point. Bearing the subject heading “Heads Up,” Kadzik advised Podesta about upcoming Congressional testimony by the head of the Department’s Civil Division, and about another filing in the Freedom of Information case that would mean “it will be awhile (2016) before the State Department posts the emails.” Podesta forwarded Kadzik’s heads up e-mail to several senior Hillary Clinton campaign officials with the admonition: “Additional chances for mischief.” \\nExploiting his coordinating role in the re-opened e-mail investigation and contacts with FBI investigators, Kadzik will now be in a position to relay inside information to his pal Podesta and to provide inside information to the Clinton campaign’s supporters in Congress as well. \\nThe Clintons manage to turn virtually everything they touch into a cesspool of corruption. The Obama Department of Justice is no exception.  '"}, "time": 1742562590.2351644}