{"duration": 0.06445074081420898, "input_args": {"text": "'Egypt: No gain without pain By Linda S. Heard Posted on November 2, 2016 by Linda S. Heard \\nIn order to understand why Egypt’s economic temperature has cooled it should be understood that this once stable country, with a healthy investment climate, was rocked by a mass public uprising resulting in its overthrow that was met with prolonged Brotherhood violence and the emergence of a terrorist group in northern Sinai. \\nA tepid relationship with Western countries, which some perceive as having undermined the nation’s upward trajectory—or, at the very least, have done nothing to aid it—hasn’t helped. The Obama administration has been unsympathetic and the same could be said for many of America’s European allies, unlike Saudi Arabia and some Gulf states, which have given generously to keep Egypt’s economy afloat. \\nWhereas other states hit by serial terrorist attacks have received offers of help, the downing of a Russian passenger jet almost exactly a year ago elicited a halt in British and European flights to the once thriving Red Sea resort town of Sharm El Sheikh and, in the case of Russia, to all Egyptian airports. This is unprecedented and has been interpreted by many Egyptians as having a political component. \\nAdd to that media scaremongering, giving the impression that the most populated Arab country isn’t safe, and it’s no wonder that Egypt’s tourist industry has been decimated or that the inflow of foreign currency has been reduced to a trickle. I must admit my surprise to read a recent article in the Huffington Post headed: “I traveled to Egypt, and yes it was safe.” \\n“I realized that all of the people telling me that Egypt was unsafe hadn’t even been there,” writes Alyssa Ramos. She goes on to share what made her feel safe during her stay and why she believes people should go there. There is hope. Numerous countries have restored flights and most other are expected to do so very soon. \\nToday, Egypt needs its friends more than ever. The currency is at a record low while experts predict a further devaluation. Indeed, it is so volatile that some countries have stopped trading in Egyptian pounds. The price of imported goods has skyrocketed and inflation is rampant. Illegal hoarding of staples such as sugar and rice has caused market shortages. \\nThe government has pleaded with ordinary people to accept a tightening of belts to reap rewards down the road. Many I’ve spoken with have displayed understanding; others are more impatient. Unsurprisingly, the Muslim Brotherhood is attempting to capitalize by whipping up the emotions of the poorest sectors. \\nOn the whole, Egyptians are tired; they know that social unrest will only make things worse as it has all over the map of the so-called Arab Spring to varying degrees. \\nFor several years, Egypt has resisted seeking an IMF loan, which invariably is granted with strings, but the current situation has warranted a new strategy; one that would encourage foreign investments. \\nA $12 billion loan repayable in three years is currently on the table provided the country can secure $6 billion in bilateral financing, which it is well on the way to doing thanks to Saudi Arabia, China and the Group of 7 nations. IMF Director Christine Lagarde believes the board will approve Egypt’s request within weeks. \\nThe strings in this case will translate to greater austerity, higher fuel prices, and a flexible exchange rate. Not included are cuts to food subsidies, although those have long been mulled as they eat up 14 percent of the national budget and as things stand subsidized food items are accessible to all, including the Middle classes and the wealthy. If and when the subsidy system is dismantled for everyone, the government has given assurances that a safety net will be created for low-income families. \\nPresident Abdel-Fattah El-Sissi ce \\nThis entry was posted in Commentary . Bookmark the'"}, "time": 1742563573.280494}