{"duration": 0.016118526458740234, "input_args": {"text": "'Oct 26, 2016 5:20 PM 0 \\nSubmitted by Joseph Jankowski via PlanetFreeWill.com, \\nMassachusetts Institute of Technology Professor and architect of ObamaCare Jonathan Gruber told CNN’s Carol Costello on Wednesday that ObamaCare, which is set to see a sharp increase in premium prices next year, is going just as planned. \\nWhen asked what could be done to the Affordable Care Act in order to drive the prices of premiums down, Gruber responded by saying “the law is working as designed.” \\n“Look, once again, there is no sense of just what has to be fixed, the law is working as designed,” Gruber told CNN. “However, it could work better and I think the most important thing experts would agree on is that we need a larger mandate penalty.” \\nJohnathan Gruber made headlines in 2014 when video surfaced of him saying that the “lack of transparency” and the “stupidity of the American voter” helped ObamaCare become law. \\n“Lack of transparency is a huge political advantage,” Gruber said. “And basically, call it the stupidity of the American voter or whatever, but basically that was really, really critical for the thing to pass.” \\nGruber made the comments while discussing how law was “written in a tortured way” to avoid a negative score from the Congressional Budget Office. He suggested that that ObamaCare would have been rejected if the penalties for going without health insurance were interpreted as taxes. \\n“If CBO scored the (individual) mandate as taxes, the bill dies,” Gruber said. \\n\\n“If you had a law that made it explicit that healthy people are going to pay in and sick people are going to get subsidies, it would not have passed,” he added. \\nAs the AP reported yesterday, the Obama Administration has confirmed that premiums will sharply rise under the ObamaCare law, with many consumers left with only one insurer to choose from. \\nPremiums for a midlevel benchmark plan will increase on average 25% across 39 states served by the federally run online market, according to a report from the Department of Health and Human Services. \\n“Consumers will be faced this year with not only big premium increases but also with a declining number of insurers participating, and that will lead to a tumultuous open enrollment period,” Larry Levitt, who tracks the health care law for the nonpartisan Kaiser Family Foundation, told the Associated Press .'"}, "time": 1742628522.2057183}