{"duration": 0.05037426948547363, "input_args": {"text": "'Huge crowds have turned out to pay their respects to Police Constable Keith Palmer as he is laid to rest in Southwark Cathedral. [PC Palmer, a Royal Regiment of Artillery veteran who served for 15 years on the Parliamentary and Diplomatic Protection Command, was murdered by Westminster terrorist Khalid Masood while directing members of the public to safety.  Thousands turn out to pay their respects to PC Palmer as his hearse made its way to Southwark Cathedral, Police observed a   silence for their fallen colleague as his hearse made its way from the Palace of Westminster, the site of Masood’s deadly attack, to the cathedral, escorted by a “black guard” of mounted officers. Flowers and Union flags laid in tribute to PC Palmer, described as a “perfect policeman” by colleagues,   colleague PC Shaun Cartright told Sky News: “If you could paint a picture of a perfect policeman you’d be painting a picture of Keith Palmer. One of the kindest people you will ever find. Very giving, very loyal, a true friend and a fantastic policeman. ” Police line the path of PC Palmer’s funeral procession, “It’s hit all of us so hard, what’s happened to him and what his family have to go through now,” said PC Greg Rainey, who knew him for 13 years. “He took his job really seriously. The reason Keith came to work was for his family but he was so proud to be a police officer. ” Police and Fire boats line up on the River Thames, The new Metropolitan Police Commissioner, Cressida Dick, read W. H. Auden’s ‘Funeral Blues’ at the service. The poem was selected by PC Palmer’s family, who asked not to be filmed or photographed. Stop all the clocks, cut off the telephone, Prevent the dog from barking with a juicy bone, Silence the pianos and with muffled drumBring out the coffin, let the mourners come. Let aeroplanes circle moaning overheadScribbling on the sky the message He Is Dead, Put crepe bows round the white necks of the public doves, Let the traffic policemen wear black cotton gloves. He was my North, my South, my East and West, My working week and my Sunday rest, My noon, my midnight, my talk, my songI thought that love would last for ever: I was wrong. The stars are not wanted now: put out every onePack up the moon and dismantle the sunPour away the ocean and sweep up the wood. For nothing now can ever come to any good. '"}, "time": 1742564149.2206833}