{"duration": 0.08988404273986816, "input_args": {"text": "'You Are Here: Home » Diseases » Curcumin an Effective Natural Treatment for Alzheimer’s Disease Curcumin an Effective Natural Treatment for Alzheimer’s Disease Prev post Next post What is curcumin? \\nCurcumin, is an anti-inflammatory molecule in the turmeric root, a relative of ginger. Turmeric has been used for thousands of years as a medicinal preparation and a preservative and coloring agent in foods. Curcumin was isolated as the major yellow pigment in turmeric; chemically diferulomethane , and has a polyphenolic molecular structure similar to other plant pigments (eg. extracted from grapes in wine (resveratrol), or in green tea (catechins) or in certain fruit juices (blueberries, strawberries, pomegranates etc.) This polyphenols share in common anti-oxidant and anti-inflammatory properties with associated health benefits. Can eating turmeric-based curries, increase curcumin levels in the blood? India has a low incidence and prevalance of Alzheimer’s Disease, which may be related to genetics or a particular intake of specific foods. Some people attribute the low incidence of Alzheimer’s to a high intake of turmeric in Asia. As turmeric contains an average of 5-10% curcumin, the daily intake of curcumin is approximated in India is thought be about 125 mg. Importantly incooking curries, curcumin is often dissolved and extracted into fat, eg. ghee, which may increase its bioavailability. Animal studies have demonstrated that the way it is administered affects its distribution in the body. Unformulated curcumin, such as purified and dried curcumin in a capsule, is absorbed easily but the liver and GI tract tag it in a way that make it not very bioavailable to the brain. There is a lot of confusion about curcumin bioavailability versus absorption. Curcumin is absorbed, but not necessarily bioavailable. Further GI and liver glucuronidation or sulfation “tagged curcumin” which interfere with bioavailability it some tissues also leadds to its rapid removal by the kidneys. Unliked tagged curcumin, free curcumin readily crossed the blood brain barrier and is relatively stable. To increase free curcumin and its half life, one company Sabinsa has used the strategy to reduce curcumin’s clearance by inhibiting glucuronidation using piperine (Sabinsa C3 complex). Glucuronidation is a method to to rid the body of toxins and remove metabolized drugs. Therefore one should determine blood levels of currently used medications after taking this formulation for several days. Other proposed strategies are to increase its solubility (Meriva), or to encapsulate and protect it from hydrolysis and to control where in the intestine it is absorbed (Longvida). In summary curcumin is easily absorbed but not necessarily very bioavailable to the brain (such as dissolved in cooking oils or formulated). It is stable in fatty tissues such as the brain, but not in blood. If I decide to take curcumin in capsule form for Alzheimer’s Disease, should I choose pure curcumin or a formulation? There are many formulations on the market. If you decide to take curcumin for a disease peripheral to the brain such as arthritis, any formulation may suffice. There are two essential criteria to consider, first, is there evidence that the formulation will lead to adequate curcumin levels in the target tissue?, and second is the formulation manufactured by a company with Good Manufacturing Practice (GMP) . Since curcumin is a metal chelator it can chelate toxic metals like lead in the ground. Sometimes it is difficult to determine if the manufacturer is a GMP company, because your are purchasing the product from the distributor, not the manufacturer. Several manufacturers claim superior absorption, but it is important to view the data used to make these conclusions. Typically these data show detection of increased glucuronidated (tagged for removal by the kidneys are limited penetration to the brain) but do not assess untagged curcumin, which is permeable to the brain. In other words,data demonstrating superior absorption as measured by liver-tagged curcumin poorly predicts levels achieved in the brain. In contrast, untagged or free curcumin readily penetrates the brain and free curcumin levels in the blood correlate positively with levels in the brain in animal studies. Dr. Frautschy received a National Institute of Health drug development grant U01AG028583 a Drug Development grant to develop a formulation of curcumin that can be taken orally and penetrate the brain. This led to development of a solid lipid particle formulation of curcumin patented by UC Regents and Veteran’s Affairs and licensed to Verdure Sciences as Longvida . Each capsule is 500 mg ( 125 mg of curcumin). Verdure Sciences is certifed for Good Manufacturing Practice, ensuring the absence of toxic metals and using organically grown turmeric. DiSilvestro et.al. , at Ohio State University found that the Longvida curcumin formulation reduced plasma levels of beta-amyloid as well as cholesterol and markers of inflammation in plasma of 40-60 year old subjects. We are now conducting a clinical trial to determine Longvida’s effects in subjects at risk for Alzheimer’s. How much curcumin should I take to treat Alzheimers Disease? The short answer is ‘we do not know the dose needed’. The answer to this question will also depend on how you take it, if you take it on an empty stomach, whether you dissolve it or not and whether and how it is formulated. Unlike drugs, one cannot determine the dose needed for curcumin unless one knows the tissue levels achieved for that formulation. Clinical trials for each each disease and each stage and each formulation would need to be conducted to identify effective tissue levels and that information will be needed to be able to recommend required dosing. In animals levels of 0.6 micromolar are sufficient to reduce amyloid pathology. If effective for prevention and treatment of MCI and Alzheimer’s Disease, the dose required may depend on stage. Extrapolation from animals studies suggest that a range of 4-8 capsules of 500 mg Longvida ( 125 mg of curcumin) per day may be efficacious; however the dose for prevention may be much less, even 80 mg/day, as suggested in the Ohio State University study If effective for prevention, treatment of MCI, treatment of Alzheimer’s, the dose required may depend on stage. A published study from DiSilvestro et al. at Ohio State University, showed daily intake of 80 curcumin from Longvida reduced plasma levels of beta-amyloid as well as cholesterol and markers of inflammation plasma in subjects 40-60 years old. Extensive toxicology conducted by the National Toxicology Program demonstrated that turmeric oleoresin (80% curcumin) is safe. As described in Title 21, Section 182.20 turmeric oleoresin is listed as one of the oils or oleoresins in plants as generally recognized as safe (GRAS) FDA’s GRAS list . The European Food Safety Commission ( EU ), which has stricter requirements than the FDA for food safety, has also designated curcumin as safe. However formulations that increase the free form also need to be tested for safety. Longvida Toxicity studies on Longvida find similar safety as compared to unformulated curcumin. We are conducting a clinical trial to determine if Longvida is effective in Mild Cognitive Impairment on Brain Glucose Metabolism and Inflammatory Biomarkers. We have chosen s dose based on extrapolation from animal studies based on doses needed for neuroprotection and neuro anti-inflammatory properties testing whether 8 capsules daily may be sufficient. As with any drug, it is recommended to titer up to a dose slowly (1-2 capsules daily) then 2-4 capsules 2nd week and so on. Dose may depend on individual variabliity in absorption and formulation. Blood levels of free and metabolized curcumin are not typically measured, but are important to understand efficacious dose. Red blood cell or white blood cell (Buffy Coat) levels of free curcumin parallel brain levels, but not necessarily plasma levels, as plasma levels can be non-detectable when brain levels are high ( Begum et al ). It has a very short half life in plasma but a very long half life in brain because it is lipophilic (fat-loving) corresponding to its much higher concentrations in the fatty brain tissue than in blood. When in relation to a meal should I take curcumin to limit its metabolism? Fasting improves free curcumin absorption (eg. minimum of 3 hours after a meal). You make take it with a small drink (4-6 ounces; eg. cherry juice with a higher pH making it more soluble. Wait an hour before eating a meal. HOWEVER, ancectodal evidence suggests that some people may have sleep disturbances if taken before bedtime. How will I know if curcumin is working? Since there is no trial demonstrating effectiveness of curcumin in preventing Alzheimer’s Disease, we don’t know how to answer this question until the trials have been conducted and completed. Anecdotal evidence suggests that slowly titering up and conducting self-administered memory tests can be helfpul in determining if it is helpful and at what dose. Some people use solitaire to monitor improvements. There maybe also be online tests to document memory changes. Since it takes 10 days to build up levels of curcumin in tissues, it may be important to titer up or down at 10 day intervals. An immediate effect on memory has been describe anectdotally, but it would not necessarily be expected. In mouse studies spatial memory was measured after three months treatment. The most obvious initial effect would be a reduction in symptoms of joint pain or other inflammatory conditions. In one trial described here , only unformulated curcumin was used and free curcumin was relatively undetectable. Importantly, in extended results from the naproxen trial for Alzheimer’s Disease prevention, naproxen showed prevention of conversion to Alzheimer’s; however, during the first year subjects’ memory worsened. It has not yet been determined whether lowering the dose until symptoms subside might avoid these deteriorations. Considering that we know that in animals curcumin clears out toxic amyloid and tau aggregates, it could conceivably transiently worsen memory. Although transient worsening of memory has not been observed in animals, it has been anecdotally been reported by some patients. '"}, "time": 1742628552.8409686}