{"duration": 0.06292915344238281, "input_args": {"text": "'Many say it was the 2011 exhibition at the Palazzo Grassi museum in Venice that first ignited art buyers’ interest in a young Romanian artist named Adrian Ghenie, whose heavy   paintings are haunted by historical figures like Stalin, Hitler and the Nazi doctor Josef Mengele. Then, in 2015, Mr. Ghenie drew more attention when he commandeered the Romanian pavilion at the Venice Biennale. These days, this    artist’s work has sold for as much as $9 million at auction, with a waiting list of private buyers “spread out between four continents,” according to Marc Glimcher, the president of Pace gallery, which represents Mr. Ghenie in New York and is giving him a solo show opening in January. Mr. Glimcher added that “134 people think they’re first in line. ” Amid a decline in the market for young artists whose prices skyrocketed just a year ago, Mr. Ghenie is enjoying nosebleed prices at auction  —   but not everyone profiting from his success is entirely thrilled. “The market is overreacting,” said Thaddaeus Ropac, whose gallery represents Mr. Ghenie in Paris. “We would be happy if everything were strong but not crazy. ” Last month, Mr. Ghenie’s 2008   painting, “Nickelodeon”  —   depicting eight blurred figures in heavy overcoats  —   was the top lot at Christie’s in London after a bidding war pushed it to $9 million. That was more than four times its high estimate and a far cry from what the biggest Ghenies go for privately: about $650, 000. Just a few months before that, at Sotheby’s in London, Mr. Ghenie’s 2014 “Sunflowers in 1937,” which pictures van Gogh’s masterpiece with Nazi overtones, went for $4. 5 million  —   more than five times its high estimate. Why all the fuss? “He is an extremely talented painter  —   I don’t think anyone can deny that,” said Ali Subotnick, a curator at the Hammer Museum in Los Angeles, which in 2008 acquired two of Mr. Ghenie’s “Pie Fight” studies. “But it’s a little absurd. ” Several factors have contributed to what art experts describe as a perfect storm for the Ghenie market at auction: a demand for painting  —   as evidenced by the strong sales for artists like Francis Bacon, Gerhard Richter and Jenny Saville Mr. Ghenie’s limited output (10 to 15 paintings a year) the scarcity of masterpieces coming up for sale an affordable price point relative to the top of the market and an eager pool of wealthy Asian buyers. “Private buyers missed out on buying these works early on, and they’re playing ” said Brett Gorvy, Christie’s worldwide chairman for postwar and contemporary art. As they have with other artists of limited output  —   like Peter Doig and Mark Tansey  —   “buyers can flip” Mr. Ghenie’s works, Mr. Gorvy added, “quickly double or triple their value as soon as they take them out of the gallery. Only a few artists have that. ” At its postwar and contemporary auction on Nov. 15, Christie’s is selling Mr. Ghenie’s 2015 painting “The Bridge”  —   featuring the spectral figure of a man on a bridge that recalls the Impressionist Gustave Caillebotte’s “Le Pont de l’Europe” and the Expressionist Edvard Munch’s “The Scream”  —   for an estimated $1. 5 million to $2. 5 million. “‘The Bridge’ has a lot of commercial aspects  —   a sense of Impressionism, Munch, Bacon, Darwin,” Mr. Gorvy said, adding that it is one of several Ghenies owned by the undisclosed seller. “We said, ‘Sell one, keep five. ’” Mihai Nicodim said he sold “The Bridge” out of his Los Angeles gallery two years ago for about $400, 000. “I don’t like seeing it come up for sale again so quickly,” Mr. Nicodim said. “But when it gets to this level, you can’t blame the collectors. ” In response to several interview requests, Mr. Ghenie  —   who divides his time between Berlin and Cluj, Romania  —   said on Monday in an email, “Sorry for the silence, but I’m so immersed in work that I can’t think of anything else right now. ” But he is clearly aware of art market pressures. “The market is so crazy,” he told The New York Times at the 2015 Biennale. “It’s frustrating to see people make so much money so quickly. I feel I’m being speculated. It’s not me. It’s the new art world. ” Born in Baia Mare, Romania, in 1977, Mr. Ghenie graduated from the University of Art and Design in Cluj in 2001. After trying to make it as an artist in Vienna and Sicily, he returned to Cluj and started the Plan B gallery with Mihai Pop in 2005. Having grown up in Nicolae Ceausescu’s repressive Romania, Mr. Ghenie in his work wrestles with chapters of   European history. His “Pie Fight” paintings, for example, draw on Hollywood slapstick even as they depict menacing Nazi figures the smeared faces might have begun to deteriorate or simply been covered in layers of cream. “You will see Ceausescu, Stalin, Hitler, Mengele,” said Alex Branczik, Sotheby’s head of contemporary art, Europe, who said he was the first to put a Ghenie work in an evening sale, in 2013. That piece, “Dr. Mengele 2” (2011) sold in London for $190, 000 after an estimate of $47, 000 to $63, 000. “It’s not easy to sell a portrait of Mengele,” Mr. Branczik said. “In a way, we were testing the water. ” Mr. Ghenie’s galleries  —   which include Galerie Judin in Berlin and Plan B  —   contend they are trying to avoid the speculative fervor that has surrounded other young artists, like Lucien Smith and Oscar Murillo, whose rapidly rising values have declined precipitously because of oversupply and high prices. “We’re working on major museum shows,” Mr. Ropac said, “because this is what he needs now, not another auction record. ” Still, the frenzy has had an impact on private sales. Since Mr. Ghenie came to Pace five years ago, his prices have increased about 40 to 50 percent, according to Mr. Glimcher. Dealers say auction houses offer tempting guarantees: undisclosed amounts promised to sellers regardless of a sale’s outcome. At the same time, some skeptics in the art world say the Ghenie craze is largely hype. “Every gallerist will tell you there’s a waiting list,” said one art adviser, who spoke on condition of anonymity so as not to alienate clients. Galleries, for their part, say they are making sure that Mr. Ghenie attains institutional bona fides. In addition to the Hammer, Mr. Ghenie’s work is so far held by the Museum of Contemporary Art, Los Angeles the San Francisco Museum of Modern Art and the Tate. “For me, he’s still at a relatively early point in his career, but he’s made some extraordinarily strong, powerful paintings,” said Gary Garrels, the senior curator of painting and sculpture at the San Francisco museum, which acquired Mr. Ghenie’s painting “The Trial” and a “Pie Fight” study. “I don’t think every painting is successful, but he is an artist for the long haul that I intend to follow. ” Mr. Ghenie has had solo exhibitions at the Museum of Contemporary Art Denver Stedelijk Museum voor Actuele Kuns, in Belgium and the National Museum of Contemporary Art in Bucharest. “He’s almost like a parallel to Neo Rauch 10 years ago,” Ms. Subotnick, of the Hammer Museum, said, referring to a German artist. “Ghenie has had a similar influence on a school of artists from Bucharest. ” Whether Mr. Ghenie proves to have staying power remains to be seen. “Fashions change quickly  —   there’s always going to be a backlash,” Mr. Gorvy said. “Then the question is, how long does it take for that artist to get back on top?”'"}, "time": 1742628608.5355697}