{"duration": 0.12164640426635742, "input_args": {"text": "\"Truth about Mosul to emerge at mass funerals 08.11.2016 AP Photo Abu Bakr al-Baghdadi, leader of the IS terror group, has fled from Mosul, as the Iraqi army reported. Intelligence sources have also confirmed information about escape of the head of terrorists, who was allegedly leaving the city among its residents to cover himself against airstrikes. The data was confirmed by the Western intelligence services as well. However, before that al-Baghdadi published an audio where he called to stay in the city and fight, opposing with all the possible means without regard to own lives. Beside that, the warlord threatened Turkey, calling this country to be a new field for ISIS. Anatoliy Tsyganok, head of the Centre for Military Prognosis , commented Pravda.Ru on the events. Can this information be trusted? I have serious doubts. First of all, because there is a so-called terror military leadership, 24 people were deliberately chosen for this purpose. Seven of them had been imprisoned in Guantanamo, others - in the Iranian prisons. This situation is a fake. Print version Font Size Mosul is really being bombed now. If the situation is compared with that in Aleppo, it should be noted that there are just some 200-250 civilians in Aleppo and humanitarian corridors operate there. While in Mosul the number of civilians reaches a million and a half, and there are no humanitarian corridors at all. In Aleppo there are journalists, and there are none of them in Mosul. Information which comes from the Americans is quite negative. And one will be able to check it only after mass funeral in Mosul. How will events in Mosul be developing? What will Turkey face? The Americans always compare today military acts with those when they were fighting in Iraq before, when six out of eight Iraqi corps just surrendered, because generals were bribed. And creating ISIS, they decided that they knew its military authorities. I doubt that they will manage to bribe them. And the idea itself to take Mosul by 8 November is crazy. One should understand clearly that fighters prepared defence in a very clever way . Moreover, they built 2-3km long catacombs. We've evidenced may times when they were attacking at one place, and exited at another. The Islamic State fighters will oppose, I have no doubts. And it will be a long-lasting process. And what about Turkey? It's very interesting. Note that three years ago they wanted to dethrone Bashar al-Assad, then after reconciliation with Moscow they changed their stance. Motivation is very simple. First of all, some power should be present in Syria. And the opposition cannot decide who will be the president. While for the president it's also quite hard to rely on the opposition. What is more, if speaking about the Turkish authorities. What are they doing? Certainly they may be trying to make use of the situation to take some lands from the Syrian government. But it's an old story. Second, they want to take territory which is defended by Kurds. And in this case the Turkish government gets into a conflict with the Americans, who said 15 years ago that they would create a Kurdish state. In fact, they have created it in the territory of Iraq. Thus, given it, the Turks will fight, but not for Mosul . Beside that, when Americans say that they are allegedly legitimate and backed by countries, its is also an insanity. That is only Russia which is at request of Damascus in Syria, and the Americans have been deployed here illegally. I believe countries which fight in Aleppo have their own goals, which do nor correspond with those of Bashar al Assad's government, the Kremlin or Turkey's government. What is going on in Syria may create a certain configuration of military and diplomatic forces in two or three years. The war in Syria has been on for almost 15 years, but talks about it were started just 5 years ago. Norwegian experts found oil fields in Syria, which according to their estimations surpass all the fields of Qatar . That is, war is going on for oil. Six years ago the US president said an interesting thing: he would interfere in situation in the Middle East to bring order under the US scenario, and so that there's no possibility to deliver oil reserves. Namely this is the main task of the US in the region. Pravda.Ru Read article on the Russian version of Pravda.Ru\""}, "time": 1742563670.3943596}