{"duration": 0.07146263122558594, "input_args": {"text": "'Gary Johnson, the Libertarian Party presidential nominee, drew a parallel on Wednesday between the Syrian government’s targeting of noncombatants in that nation’s civil war and the accidental bombing of civilians by United   forces. Attacking Hillary Clinton over what he criticized as her overly interventionist instincts, Mr. Johnson pointed to the hundreds of thousands of Syrian civilians killed by forces loyal to President Bashar   as well as civilian deaths caused by the   coalition, and said Mrs. Clinton, the former secretary of state, bore at least partial responsibility. But when pressed four times on whether he saw a moral equivalence between deaths caused by the United States, directly or indirectly, and mass killings of civilians by Mr. Assad and his allies, Mr. Johnson made clear that he did. “Well no, of course not  —   we’re so much better than all that,” Mr. Johnson, a former New Mexico governor, said sarcastically. “We’re so much better when in Afghanistan, we bomb the hospital and 60 people are killed in the hospital. ” The remarks by Mr. Johnson came in an interview with The New York Times after a string of damaging stumbles when he has fielded questions about foreign affairs. After failing to recognize the   Syrian city of Aleppo during a television interview Sept. 8, Mr. Johnson had another difficult moment on Sept. 28, when he vainly tried to name a foreign leader whom he admired. In the Times interview on Wednesday, Mr. Johnson conspicuously sought to avoid another misstep. Asked if he knew the name of North Korea’s leader, Mr. Johnson replied, “I do. ” “You want me to name” the person, he said, then paused, before adding dryly, “Really. ” But he declined to supply the name. Mr. Johnson complained that Mrs. Clinton was being judged on her base of knowledge rather than her interventionist instincts. “Because Hillary Clinton can dot the i’s and cross the t’s on geographic leaders, of the names of foreign leaders,” he said, “the underlying fact that hundreds of thousands of people have died in Syria goes by the wayside. ” He charged that Mrs. Clinton “bears responsibility for what’s happened, shared responsibility for what’s happened in Syria. I would not have put us in that situation from the  . ” More than 400, 000 people have been killed in the Syrian civil war, according to the United Nations. But Mr. Johnson complained that presidential candidates were expected to talk tough about dealing with dictators like Mr. Assad or risk losing support. “This is what happens in this country right now  —   unless you’re willing to say that you’re going to get tough on this stuff, on these atrocities  —   and these atrocities are horrible  —   but unless you as a politician are willing to do something about these atrocities then we’re not going to elect you,” Mr. Johnson said. Mr. Johnson speculated about the deals or promises that the Obama administration may have dangled before   forces, but then said at other points that he was at a disadvantage discussing world events because he has not received the classified briefings that the Democratic and Republican nominees for president have been given. Mr. Johnson also declined to say whether his running mate, former Gov. William F. Weld of Massachusetts, had warned him of his intention to change course and spend the remainder of the presidential campaign attacking Donald J. Trump, the Republican nominee, as unqualified. Mr. Weld revealed those plans in an interview with The Boston Globe on Tuesday. “That may be his primary mission,” Mr. Johnson said of Mr. Weld’s plans. “We’re not scripted at all. And so I guess my role will be Hillary and his role will be Donald Trump. ” But he insisted that Mr. Weld would not drop out at any point and endorse Mrs. Clinton. “Absolutely,” Mr. Johnson said when asked if Mr. Weld would fight on until Nov. 8. Mr. Johnson said that the idea of hunkering down and trying to make an aggressive play to win his home state of New Mexico, where polls show him in contention, had crossed his mind. But he conceded that his chances of winning outright were all but gone. “Right now it’s a Hail Mary, not being in the presidential debates,” he said.'"}, "time": 1742561706.5885081}