{"duration": 0.12968087196350098, "input_args": {"text": "' US Will Never Separate its Fighters from \\x91Islamists\\x92 Because it Depends on Them By Dan Glazebrook\\nNovember 08, 2016 \" Information Clearing House \" - \" RT \" - It was the big idea that was supposed to herald a new era of US-Russian co-operation in Syria: the separation of Western-backed \\x91moderate rebels\\x92 from groups such as ISIS and Al Qaeda, in order that the former could be brought into political negotiations whilst the latter were targeted by combined US and Russian military operations. Russia and Syria managed to get the UN Security Council to agree to a ban on the funding, training and arming of foreign fighters joining such groups back in September 2014, whilst the US-Russia ceasefire agreement this September reiterated that \\x93separating moderate opposition forces from Nusra [Al Qaeda\\x92s Syria affiliate, now rebranded as Jabhat Fatah Al-Sham]\\x94 was \\x93a key priority\\x94. As Russian foreign minister Sergei Lavrov recalled at a press conference last week, \\x93our agreements with the Americans linked this separation to a seven-day period of quiet. At the end of the period, the Americans undertook to show us on the map exactly where they believed there were terrorists and where there were none. On this basis, we should have jointly coordinated targets for effective engagement. To reiterate, they requested seven days for that, insisting that a seven-day pause should be a precondition. We announced this pause but it was violated with a strike against Syrian Army detachments three days later\\x94 \\x96 when, lest we forget, British and US bomber jets carried out a sustained attack on Syrian army troops fighting ISIS in Deir al-Zour, killing 62 and wounding over 100, effectively burying the ceasefire. Nevertheless, in response to Western demands, Syrian and Russian planes again suspended airstrikes on Aleppo two weeks ago, giving the US another chance to make good on its promises to \\x91separate\\x92 its favoured rebel factions from the Al Qaeda affiliate, the Nusra Front. A fortnight later, however \\x96 and fully ten months after his initial public call (at an International Syria Support Group meeting in February) for so-called \\x91moderates\\x92 to separate themselves from Al Qaeda and co \\x96 Kerry was still pleading for them to have more time to do so.\\nEvents on the ground, meanwhile, have been moving entirely in the other direction. More and more of the groups supposedly fighting under the West\\x92s \\x91Free Syrian Army\\x92 banner (never much more than a fiction to which militias could pledge mythical allegiance in exchange for Western finance and weaponry) have been fighting with the Al Nusra-led Jaysh Al-Fateh (Army of Conquest) alliance since it was launched in March last year. Indeed, so successful has this formation been \\x96 both in terms of capturing territory, mainly in Idlib province, and in establishing Nusra\\x92s hegemony over the various insurgent factions \\x96 that its leader, Abu Mohammed al-Julani, apparently believes the \\x91grand merger\\x92 of rebel groups he has long dreamed of, fully integrated under a Nusra chain of command, is now a realistic possibility.\\nIt is no surprise, then, that it is precisely this Nusra-led formation that has been leading the \\x91rebel\\x92 onslaught against government-held Western Aleppo launched last Friday, complete with car bombs, rockets and mortars directed against residential areas. These are thought to have killed at least 41 civilians, including 16 children, in \\x93relentless and indiscriminate\\x94 raids that have \\x93shocked and appalled\\x94 the UN Special Envoy to Syria Steffan de Mistura. The Independent\\x92s Robert Fisk, reporting from the area following a rebel rocket attack, described \\x93a younger boy [lying] on a hospital trolley, a doctor picking metal out of his face, all his limbs heavily bandaged. He was writhing in agony, moving his legs wildly, comforted by the director of the school\\x94.\\nWill attacks like these, then, increase the urgency with which the US pursues its supposed desire to separate the groups in receipt of its largesse from their \\x91Al Qaeda lite\\x92 allies?\\nThis is highly unlikely: Syrian foreign minister Walid Muallem was probably correct when he stated last week that the US is unwilling to separate the factions its backs from Al Nusra, despite its repeated commitments to do so, for two main reasons.\\nFirstly, rebel groups have openly targeted civilians since 2011, often on the basis of ethnicity, religion or political beliefs, and this has never bothered their Western backers before. Indeed, the rebels \\x96 then operating under the banner of the pro-Western Free Syrian Army \\x96 heralded their entry in Aleppo in 2012 with two massive car bombs in the city centre and the burning down of the city\\x92s centuries-old souks. This was followed up with a bomb attack on Aleppo University on January 15 th 2013, killing 80, as part of the rebels\\x92 \\x91morale bombing\\x92 campaign against those supporters of the government. Two months later, one Syrian soldier and 19 civilians were killed in the village of Khan Al-Assal near Aleppo in a gas attack suspected by the UN Mission investigating it to have been carried out by the opposition. And as early as December 2012, Channel 4 News were reporting on suspected massacres of Alawite civilians by \\x91Free Syrian Army\\x92 fighters, massacres which have been a mainstay of rebel activities. Far from dampening Western enthusiasm for the rebel cause, this particular report was followed up with calls by David Cameron to step up its assistance to the insurgency, who promised a doubling of British aid to the rebels within months. The targeting of civilians has never damaged Western support in the past, and is unlikely to do so now.\\nSecondly, aside from ISIS and the Syrian army, Jabhat Fateh Al-Sham and Ahrar Al Sham are clearly the most effective fighting groups on the ground, and the other rebel factions and its Western backers clearly understand this. And again, this is nothing new; sectarian Salafist groups have been the leading force in the insurgency since the start, as the West has always been fully aware. The now notorious US Defence Intelligence Agency memo of 12 th August 2012, for example \\x96 which was circulated to, amongst others, the State Department, the CIA, the FBI and Central Command \\x96 noted that\\x93the Salafist [sic], the Muslim Brotherhood, and AQI [al-Qaeda in Iraq] are the major forces driving the insurgency in Syria.\\x94 And to prevent any ambiguity, DIA chief at the time, Michael Flynn, then confirmed in an interview with Al Jazeera\\x92s Mehdi Hassan, that the US government\\x92s backing of such forces was not based on ignorance, nor a mistake, but was rather a \\x93willful decision\\x94. Such groups have always been the \\x91driving force\\x92 of the West\\x92s anti-Syria operation, and the US government understands well that its insurgency would soon fizzle out without them. As the US\\x92s primary aim remains regime change rather than the defeat of terrorism, therefore, they are unlikely to make any serious attempt to divide their proxies from the fighting forces of Al Qaeda. We can, instead, expect more pleas for time from the likes of John Kerry, and more spurious rhetoric about the US commitment to fighting terrorism, combined with continued material support for the very groups now openly allied to Al Qaeda. In other words: more of the sordid same.'"}, "time": 1742562106.0477617}