{"duration": 0.0661168098449707, "input_args": {"text": "'It was a mystery that captivated Australia for years, inspired a Meryl Streep movie and tormented a couple for more than three decades. Now, one of the central figures in the case  —   in which a dingo, a type of wild dog found in Australia, was found to have killed the couple’s    baby girl  —   has died. Michael Chamberlain, a former pastor who fought for decades to prove to the world that the animal was responsible for his daughter’s disappearance, died on Monday, his former wife, Lindy Chamberlain, told The Associated Press. He was 72. The cause was complications of acute leukemia, according to The Sydney Morning Herald. The couple’s ordeal began in 1980, when their daughter, Azaria, disappeared from the family tent while on a trip to the Australian outback. Despite a lack of evidence  —   a body was never found  —   blame for the disappearance soon fell on the couple. Ms. Chamberlain, who said that she had seen a dingo slip out of the tent, was convicted of murder in 1982 and was sentenced to life in prison. Mr. Chamberlain was found guilty of being an accessory to murder after the fact. Three years later, new evidence absolved them both. But the Chamberlains still struggled for years to win over public opinion. They were helped by the book “Evil Angels,” by John Bryson, published in 1985, which offered a scathing review of the prosecution botching forensic evidence, and by the 1988 film “A Cry in the Dark,” which was based on that book and starred Ms. Streep and Sam Neill as the couple. But the movie also turned their misfortunes into a joke in the United States, inspiring material for shows such as “Seinfeld” and “The Simpsons. ” The strain on the family was ultimately too strong. In 1990, Ms. Chamberlain published a book, “Through My Eyes,” which portrayed her husband unkindly, according to The Sydney Morning Herald. A year later, the couple divorced. Michael Leigh Chamberlain was born on Feb. 27, 1944, in Christchurch, New Zealand, to Ivan and Greta Chamberlain, according to the newspaper, and met Lindy in 1968 while studying theology at college in Australia. A year later, he graduated and they married. They had two sons before Azaria was born, and another daughter after. A complete list of survivors was not immediately available. In 1994, Mr. Chamberlain married Ingrid Bergner. Within a few years, he had a daughter with Ms. Bergner, wrote his first book and began working toward the doctorate he earned in 2002 from the University of Newcastle. In 2011, Ms. Bergner had a stroke and Mr. Chamberlain became her   caretaker. The next year, a tearful coroner, Elizabeth Morris, apologized to Michael and Lindy Chamberlain as she brought their   fight to an end: Azaria, she concluded in a fourth inquest, died as a result of being taken by a dingo. “I am here to tell you that you can get justice even when you think that all is lost,’’ Mr. Chamberlain said after the ruling. “But truth must be on your side. ”'"}, "time": 1742563192.8737793}