{"duration": 0.1109321117401123, "input_args": {"text": "'Friday on CNN’s “Situation Room,” CNN political director David Chalian said President Donald Trump’s recent foreign policy maneuvers mean he is “going mainstream” and Washington “establishment. ”  Chalian said, “I don’t know if we’re seeing a Trump doctrine take shape. Certainly, Donald Trump is not portraying it as such. It’s a little bit more of these disparate and discrete incidents that have happened, whether the Syria attack or this bomb. In fact, you just said it was a tactical move that the theater commander was able to make, not necessarily the large —  part of a strategic framework here, and I think —  the only thing that I could sort of ascertain in observing what Donald Trump is doing right now is that he’s going mainstream —  a little establishment, which is totally against the brand that he ran on. ” “But he —  I think it shows the power —  and when I say establishment, I don’t mean just Republican establishment —  Democrat —  the Washington establishment —  and it shows the power and the stranglehold that the establishment has,” he continued. “I know he tried to bust it up during the campaign and saying that he was going to be the irritant and destroy it, but when you don’t have ideological moorings —  you’re not moored, that’s guided, then I think you’re susceptible to the power of the establishment and I think that’s what we see playing out right now with Donald Trump. ” CNN chief political correspondent Dana Bash added, “He said the world has changed, and it hasn’t. I mean, things change every day in the world, but the —  but the overall sort of zeitgeist of where these hot spots are is where they were when he took office, so it wasn’t that. It was him, and it is him, and —  and to your point, David, it’s that he’s not a dogmatic guy. He never was. If he was a dogmatic guy, then he would have run for the Democratic nomination because he would still be   and for   health care system but he’s not. He switched, you know, did a complete 180 on those issues and so it’s not surprising that he is willing to —  to use his words, be flexible when it comes to a whole host of issues, as he’s learning a really, really hard, really new job that people who are even ideological and get the job tend to realize, you know, I need to switch a little bit. ” Follow Pam Key on Twitter @pamkeyNEN'"}, "time": 1742562889.9839947}