{"duration": 0.14206981658935547, "input_args": {"text": "'By Becky Akers October 31, 2016 \\nThe Civil Rights Act of 1964 is one of the most pernicious in American history. It destroys freedom of association, subjects our private relationships to bureaucratic judgment and meddling, and substitutes the totalitarian credo of “civil rights” for the freedom from government Americans previously espoused. \\nNo wonder the left loves it. This legislation is Progressives’ Bible and Psalter in one convenient package, the inspiration for much of their mischief. \\nSo I was staggered to read that the radical left—not your average Marxist on Medicaid but the sexual deviants, feminists, “social activists” and “advocates,” Congressional Dimocrats, and other misfits with too much time on their hands—has excoriated the Civil Rights Act. Damned it, in fact. \\nWhat inspired this astounding about-face? The “Russell Amendment” to the NDAA. \\nThe National Defense Authorization Act is as monstrous as the civil-rights one, which doubtless explains its gliding through Congress the last 54 years. This baby annually finances “our” troops—you know, the gullible, unemployed and unemployable, barely literate cannon fodder the government’s schools spew that the government’s “armed forces” then prey on—sorry, “recruit.” I haven’t surveyed all 54 Congresses that have overwhelmingly passed the NDAA, but I bet few criminals there ever dare vote “Nay” lest the parents, friends and neighbors of said cannon-fodder accuse them of not “supporting” “our” hired killers. \\nSince politicians consider the NDAA a “must-pass” bit of chicanery, they are fond of attaching amendments to it, just as drivers stuck in traffic fall in line behind an ambulance with screaming sirens. Often, said amendments merely pertain to the usual corruption, i.e., pork . But lately they’ve also codified terror. For example, the NDAA of 2012 legalized the “indefinite mlitary detention” of American citizens . And yes, 2016’s NDAA still includes that Stalinesque decree. \\nThis year, Rep. Steve Russell [R-OK] sponsored an amendment that’s benign, relatively speaking. To wit, “ Any branch or agency of the Federal Government shall , with respect to any religious corporation, religious association, religious educational institution, or religious society that is a recipient of or offeror [ sic ; don’t you love it when existing jargon doesn’t adequately cover politicians’ sins, so they invent more?] for a Federal Government contract, subcontract, grant, purchase order, or cooperative agreement, provide protections and exemptions consistent with sections 702(a) and 703(e)(2) of the Civil Rights Act of 1964 (42 U.S.C. 2000e-1(a) and 42 U.S.C. 2000e-2(e)(2)) and section 103(d) of the Americans with Disabilities Act of 1990 (42 USC 12113(d)).” \\nCorrect me if I’m wrong, but isn’t Ol’ Steve simply upholding the Civil Rights Act and its wretched daughter, the ADA? \\nWhich infuriates the aforementioned crackpots and deviants. “ If passed, the Russell Amendment could put the livelihood of millions of Americans at risk, according to Sejal Singh, of the Center for American Progress.” \\nHuh? But—but, Sejal, the Civil Rights Act forced employers to hire millions of Americans, even if they lacked skills and qualifications— \\n“‘ This would jeopardize protections for over 28 million people — or one in five employees — who are under federal contract,’ Singh [said]… She believes the amendment was introduced as a way to counteract President Obama’s executive orders prohibiting workplace discrimination on the basis of sexual orientation and gender expression.” \\nWha—? But—but Sejal, the Civil Rights Act, you can’t be serious — \\n“ ’We believe that this is part of a wave of backlash against progress in LGBT and women’s rights,’ Singh added.” \\nYep, this nutjob actually insists that the Civil Rights Act inhibits rather than promotes “progress in LGBT and women’s rights.” As if we would even talk with, let alone take orders, from her and her fellow deviants without the Act’s aiming federal guns at us. \\nNor is Sejal alone in her hysteria: whole battalions of Marxists have joined her in bewailing the Civil Rights Act. There’s “ David Stacy, the government affairs director for the Human Rights Campaign ,” who “pointed out the explicit danger this amendment could pose for LGBTQ employees.” And good that he did, because anyone normal certainly won’t see it: “’This amendment would give legal grounds for an employer to prevent a gay man from having their [ sic ] husband [ sic ] added to their [ sic ] health insurance. Trans people could be fired from their job [ sic ] upon announcing their intent to transition,’ Stacy explained.” \\nEither Dave didn’t read Russell’s amendment or he’s as deranged as he is effeminate and ungrammatical. (And let us here lament the degeneration of the language these degenerates favor, the nonsense and irrationality. Men do not have “husbands”; singular nouns require singular pronouns; and unless all “trans people” malinger in a single job, they would be fired from their job s, plural. What absurd gyrations, and all to avoid those helpful terms, “his” and “hers”!) \\nBut for manic hyperbole, it’s hard to beat the ACLU, tireless cheerleader for tyranny in general and civil rights in particular: “ ’The Russell Amendment is one of the most significant threats to LGBT people and women we have seen in Congress in years. It must be removed from the defense bill — freedom, equality and fairness are at stake,’ said ACLU deputy legal director Louise Melling.” Good gracious, who ever suspected the Civil Rights Act of such wickedness? \\nNaturally, “ Senate Democrats and the White House are … signaling strong opposition to a provision they say would allow for discrimination based on sexual orientation and gender identity.” I shan’t ask whether these dimwits are insane: we all know they are. Still, do any of them realize the amendment reinforces their hallowed Civil Rights Act? Have any of them read Russell’s wording? \\nNo surprise if they haven’t. First, Congressional goldbrickers vote on legislation without even glancing at the text . Second, Russell’s amendment is suspiciously absent from all the reports but one that I’ve seen on this silliness. Could it be that the agitators know the amendment’s innocuous, and their cronies in the corporate media have agreed not to reprint it? And third, this confirms that Progressives can’t think for themselves (or at all, truth be told). If they could, surely someone would protest, “Hey, what are we doing , trashing the Civil Rights Act?” \\nAt any rate, the Dimocrats have vented their dudgeon “in a letter to the leaders of the House and Senate Armed Services Committees.” The whole screed is risible, but my nominee for “Most Absurd Claim” is this line: “ This discrimination erodes the freedoms that our military has fought for generations to protect. ” \\nWhat the Dimocrats actually mean by “discrimination” is “failing to roll over and play dead for all varieties of pervert in all situations at all times.” And “our military” most certainly has not “fought for generations” for such “freedoms.” If you’d told the guys starving at Valley Forge that they were dying so Daniel and Stephan can sodomize one another, they’d have deserted to the Redcoats. Indeed, I’m reminded of John Adams’ cry: “Posterity! You will never know how much it cost the present Generation to preserve your Freedom! I hope you will make good use of it. If you do not, I shall repent in Heaven, that I ever took half the Pains to preserve it.” I doubt John would define men sashaying into the women’s loo as “making good use of your Freedom.” \\nMeanwhile, recall what fomented this outsized fury against the Civil Rights Act: the fear that a Christian might contract with the Feds to supply overpriced toilet seats and—horrors!—refuse to hire Bruce/Caitlyn as s/he convalesces from castration. For that , the LGPMNOQZ-whatever—in short, the Debauched Community throws the Civil Rights Act under the bus. \\nIf the DC—hmmm. What a happy coincidence that this abbreviation once again connotes a dictatorial sewer!—if the DC succeeds in stripping this amendment from the NDAA, so what? Christians ought never deal with the satanic State in any way, except to undermine and overthrow it while comforting its victims. Let’s hope believers so dead to conscience that they connive with Uncle Sam’s evil reconsider when they hear that the DC will once again force them to hire deviants. \\n“ Religious freedom is essential to America ,” opines one of the DC, “but it is not a right to discriminate, and not with taxpayer dollars. You should never be disqualified for a job because you think or believe differently from your employer.” Get it? “Religious freedom” is all right in its place, but Caesar’s deviant demands are far more legitimate than any serf’s convictions. \\nIn their letter, the Dimocrats allege that Russell’s emphasis on the Civil Rights Act will “ harm hardworking Americans who deserve to be protected from workplace discrimination based on sexual orientation, gender identity, religious identity, or reproductive and other health care decisions.” Hey, if that’s the case, repeal the Civil Rights Act, and quick! The Best of Becky Akers Tags: Becky Akers [ ] has published two novels of the American Revolution, Halestorm and Abducting Arnold . They advocate sedition and liberty, among other joys, so the wise reader will buy them now, before they’re banned.'"}, "time": 1742563276.168756}