{"duration": 0.0625145435333252, "input_args": {"text": "'Keywords: complimentary medicine , holistic health , homeopathy , nhs \\nThe Department for Health is currently reviewing whether or not homeopathy in the NHS should continue to be available through doctor referrals. Against a backdrop of funding cuts and increasing pressure to reduce costs, the Government and health managers are looking at whether to add homeopathy to the NHS’s “schedule 1” blacklist, a selection of products that NHS doctors are banned from prescribing. \\nHowever despite consistent claims that there is a lack of quality evidence into the positive health benefits of homeopathy, the NHS has spent more than £1.75m on homeopathic treatments over the last 10 years, and any proposed ban is likely to have its fair share of detractors. \\nAlmost six million Brits seek the help complementary and alternative medicine (of which homeopathy is a part) with one in four wanting access to be universally available through the NHS. \\nThe lead argument for the exclusion of homeopathic treatment is lack of evidence that supports its effectiveness, with research often being labeled as “inconclusive”. However proponents for the inclusion of homeopathy argue that this doesn’t necessarily mean that there is no evidence. \\nDr Helen Beaumont, a GP and the president of the Faculty of Homeopathy, has recently stated that homeopathic treatment has a “profound effect” on patients. \\n“It’s disappointing that at a time when the NHS is facing a funding crisis the Department of Health is embarking on a costly consultation that could prevent highly skilled clinicians prescribing a course of treatment that benefits thousands of patients each year. If the department were serious about saving money surely it should be looking at SSRIs (Selective Serotonin Reuptake Inhibitors) prescribed for mild to moderate depression in vast quantities at considerable cost to the NHS, but which studies have found to be ineffective for those conditions.” \\nGeorge Freeman, the minister for life sciences, has stated that in a time of rising demand, the government has a duty to ensure NHS funds are spent only on the most effective treatments. However an article in the British Medical Journal (BMJ) that examined the scientific evidence behind NHS treatments, found that 46% of 2,500 commonly used NHS treatments are of unknown effectiveness, and only 13% are known to be beneficial. The argument is being made that the principals being applied to homeopathy, are consistent for all forms of treatments throughout the NHS. \\nCollating research itself has also proved to be difficult, with the positive effects of homeopathy often a challenge to fully quantify. The NHS is driven by targets and trial evidence using hard data (like death and disease) to determine the effectiveness of a particular treatment. Researching and recording a patients quality of life, happiness and emotional satisfaction has always been much more difficult to quantify, but a wealth of anecdotal evidence and studies from other European countries continue to support the use of homeopathic treatment. \\nFor example, in 2008, over a hundred homeopathic GP practices in Germany and Switzerland took up the challenge (1) of demonstrating the health of “chronically ill patients after eight years of homeopathic treatment”. It concluded that homeopathy is clinically effective, cost-effective and safe – with the results playing an important role in the inclusion of homeopathy as part of their national healthcare scheme. \\nSimilarly the largest study at Bristol Homeopathic Hospital (2) followed the effectiveness of homeopathy on 6,500 consecutive patients over a six-year period. 70% of follow-up patients reported improved health with 50% reporting major improvement. \\nThe debate whether homeopathy in the NHS will no doubt continue. The homeopathic profession has had to face increasing criticism and hostility over recent years, but with an average annual spend of £152,000 on homeopathic treatment (the equivalent of 0.0013% of the total NHS drug budget) it should be remembered that if these patients were not treated with homeopathic medicines, they would have to be treated by other NHS departments with potentially more expensive, conventional drugs. (1) – BMC Public Health BMC Series, 2008, 8: 413; doi: 10.1186/1471-2458-8-413 \\n(2) http://www.ncbi.nlm.nih.gov/pubmed/16296912 \\nThis post was written by The Elysian Centre, a multi-disciplinary practice for holistic healing and homeopathy in Rye, East Sussex.'"}, "time": 1742564502.7336617}