{"duration": 0.07693243026733398, "input_args": {"text": "'‘Conspiracy Vs. Government’ Is Part of an Elite Wave of Propaganda Justifying Violent Repression By - October 31, 2016 \\nThe rise of paranoid politics could make America ungovernable – and the FBI is fuelling the fire … Nothing can disprove the fears of a paranoiac. Indeed, everything confirms them … It takes away politicians’ incentive to understand one another and get things done. It says that if you scream loud enough, established norms will buckle under the pressure. And while those norms might be annoying and flawed, we’ll all miss them if they go. –UK Telegraph \\nWith US belief in “conspiracy theory” over 50 percent (see our previous article here ) elites are showing increasing concern that they have lost control of their narrative. \\nThis article again illustrates elite push back. The article explains that if people grow paranoid about government, then the “norms” of government will collapse. \\nConspiracy theory is called “paranoid politics” in this article but it amounts to the same thing. \\nThe article also has parallels to an article we analyzed recently here by Cass Sunstein. His Bloomberg editorial suggested that nothing was more important from a political standpoint than returning “civility” to Congress and politics generally. \\nThis article runs along the same lines: Negative perceptions of the US government can make the process of “governing” dysfunctional \\nMore: \\nTake the “chemtrails” conspiracy theory: the idea that the white trails left behind in the sky by aeroplanes are sinister chemicals dispersed to sterilise or control voters. \\nIf a government declares there is “no evidence” of such chemicals, that itself must be clear evidence that there’s something “they” don’t want us to know. But if that government were to open up an investigation, that too would be incontrovertible proof: “they” must have found something. \\nLet’s reverse this reasoning. Apparently, one can’t question much that government does because skepticism puts government in a no-win situation. \\nBetter to accept official pronouncements, then. The only trouble is that almost anything modern Western governments say are lies. \\nGovernments aren’t even important these days. The world from what we can tell is run by a small banking elite that controls the awesome power of central banks and the money they print. \\nThe trillions available to this small group has allowed it to change the nature of society around the world. \\nThe goal is global government and every kind of violence and corruption is employed to achieve it. \\nSecrecy is still employed by those creating “one world.” Thus the world is bent on the task of creating global governance while never admitting it. \\nBut in the past several decades, the Internet has credibly exposed plans for world government. As a result, people have lost faith in mainstream media, politicians and capitalism itself. \\nThis is the reason for the rise in “conspiracy theory” and “paranoid politics.” \\nThis is also the reason elites would like to shut down the Internet, or at least control it more thoroughly. \\nPart of the push for control involves making a case that the Internet needs to be better regulated and appropriately censored. \\nTo this end, elite propaganda has been aimed at justifying various anti-‘Net actions. \\nOne justification involves the “populism versus globalism” meme we’ve covered extensively. (Just use a search engine for the phrase and “Daily Bell.”) \\nAnother justification – another emergent meme – is that government itself is jeopardized by pervasive distrust. \\nOne would think the answer would be to lie less, but this is not the conclusion we’re being furnished. \\nBoth Sunstein in his article, and now the argument in this article, show us clearly that the solution to pervasive electoral cyncism and worse is to better control one’s attitude. \\nIn other words, paranoia and conspiratorial cynicism need to be damped for government to survive and perform its proper function. \\nHere: \\nWhy, then, did a seasoned operator like Mr Comey, whose judiciousness was praised by the Clinton campaign through the summer, feel the need to divulge this half-baked and potentially insignificant development before assessing it? There is one answer: fear of the mob. \\nThe director of the FBI – those tough guys who smash in doors and shoot people – was scared that if he didn’t talk now and the news leaked out, it would confirm every conspiracy theory going about how the agency was in the Clintons’ pocket. In other words, we’ve reached a point in the politics of the world’s most powerful democracy where the appearance of probity matters more than the reality. \\nThis is a key point in the article. It is one that fully reveals the cognitive dissonance at the heart of this particular argument. The idea is that government is too delicate to sustain itself in the face of the “mob.” The mob must therefore be silenced or “probity will matter more than reality.” \\nBut who is to determine what constitutes a “mob”? And who is determine that the mob’s “reality” is false? \\nBoth the Sunstein article and now this one are erecting very specific kinds of arguments. Government, we are told, is fragile and must be protected from forces that will undermine its credibility. \\nBut this conclusion is merely assumed. It is never proven. \\nThis argument begins and ends with government. Yet the Internet and its recovered history shows us clearly that Western governments mostly provide concealment for the world’s real powers that prefer to operate behind the scenes. \\nThis is the reason for so much cynicism. Many have realized that the society constructed around them is lie. They have reacted by distrusting almost anything associated with modern society. \\nBut in these articles, we can see the forces being marshaled against this state of mind. The preferred antidote is simply to assert that people’s distrust is corrosive to government authority and democracy generally. \\nNo logic bolsters this argument. That’s why it is an emergent elite meme. \\nThe goal of an elite meme is to be convincing not truthful. \\nAnd if it is not convincing – and increasingly elite memes are not – then its function is, anyway, to provide a justification for what we call directed history. These are the authoritarian strategies that elites wish to inflict on the rest of us. \\nThis latter meme is an outgrowth of “populism versus globalism.” Populists, as we’ve pointed out, are being cast as ignorant, violent and intolerant. The current meme – let’s call it “conspiracy versus government”– lumps in conspiracy with populism. \\nPopulists, we learn, are apt to adopt an irrational distrust of government. And what is government? It must comprise all that is good and virtuous in an uncivil world. \\nBoth populists and conspiracy theory are to be vanquished, eventually, by wise globalists who understand that the absence of government will lead to violent “anarchy.” \\nWould that it were true. It is not. Government is merely in this day-and-age a curtain hiding the world’s real controllers who use endless violence, monetary debasement and economic depression to get their way. \\nConclusion: We are watching the emergence of a new, dangerous memes. Increasingly and forcefully, it is being argued that “government” is good and that the truths people have discovered about their lives and society are destabilizing to government, and therefore “bad.” The idea will be to use these memes to make a case for increased censorship and even, eventually, violent repression – and worse.'"}, "time": 1742628538.7011175}