{"duration": 0.10638570785522461, "input_args": {"text": "'WASHINGTON  —     mayors and housing experts are nervous about the idea of a billionaire real estate developer in the White House. Now   Donald J. Trump has picked Ben Carson, a retired neurosurgeon with no housing experience, as his nominee for secretary of Housing and Urban Development  —   and high anxiety has set in. As The Times’s   bureau chief, I have spent a lot of time in Baltimore, Cleveland and Philadelphia, which are all run by Democrats. In those cities, and many others across the country, housing concerns are deeply intertwined with other   issues, including racial tensions with the police. To explore how a   housing agenda might play out, I reached out to two Philadelphia mayors  —   Jim Kenney, the incumbent, and Michael Nutter, his predecessor  —   and two housing experts, one in Philadelphia and one here in Washington. Here are some of their thoughts: Broadly speaking, HUD devotes itself to ensuring that families of   and modest means have access to safe homes and neighborhoods. It runs the Federal Housing Administration, which helps people get home loans. It distributes money through the Community Development Block Grant program, a flexible source of funding used by cities for redevelopment and for rebuilding communities after natural disasters like floods and hurricanes. HUD runs the Section 8 housing choice voucher program, which cities rely on to help house the poor. And it enforces the Fair Housing Act, part of the Civil Rights Act of 1968, which makes housing discrimination illegal. Even in a time of economic expansion, dealing with poverty will be the biggest challenge the next HUD secretary faces, conservative and liberal housing experts agree. The American Enterprise Institute, a conservative research organization, cited housing assistance programs as among those “ripe for reform’’ under Mr. Trump. Since 2000, the number of   neighborhoods in America has doubled, rising faster in the suburbs, like Ferguson, Mo. than in cities, said Amy Liu, the director of the Metropolitan Policy Program at the   Brookings Institution in Washington. “There’s a lot of anxiety now, because this election was about the heartland versus the coastal elites we’re going to need a HUD secretary who governs both,” Ms. Liu said. “When I think about what HUD is going to have to deal with next, it’s going to be the future of   neighborhoods, and how to deal with that not only in Baltimore but also Ferguson. ” Mr. Carson grew up poor in Detroit and became a celebrated neurosurgeon by the time he was in his 30s  —   a path that he attributes to his     philosophy. His admirers praise his    success story. But his critics say a career in medicine is not the right training for someone running a vast federal housing bureaucracy. “He has a powerful personal story that could connect him to a lot of families that rely on HUD assistance,” Ms. Liu said. “He just needs to use that personal story to listen and empathize  —   and really learn about the latest innovations in the field. ’’ Most HUD secretaries have had government experience. George Romney, who served under Richard M. Nixon, was a governor. Jack Kemp, who served under George Bush, was a congressman. Henry Cisneros, who served under Bill Clinton, was a mayor so was Julian Castro, the current secretary. Ira Goldstein, who worked at HUD under the first President Bush and Mr. Clinton, admired Mr. Kemp. “He had a way of relating to people at every economic level he could walk into housing developments and be perceived as an ally,” said Mr. Goldstein, who now supervises research at Reinvestment Fund, a nonprofit devoted to redevelopment in Philadelphia and Baltimore. But Mr. Kemp, a conservative, also had the “business discipline,” Mr. Goldstein said, to run HUD programs “with a businesslike tenor. ” Mr. Nutter, who now teaches urban affairs at Columbia University and is a commentator for CNN, says he does not know if Mr. Carson has what it takes. “As brilliant as folks have said that Dr. Carson is from a neurosurgery standpoint, creating fair housing, promoting economic development and having people living in prospering communities is a little different than operating on somebody’s brain,” Mr. Nutter said. “I do not know how that translates into being HUD secretary. ’’ Mr. Trump got rich building luxury properties most mayors are concerned with housing the poor. In the 1970s, before Mr. Trump got into the luxury business, the federal government sued his family’s company, accusing it of routinely refusing to rent to    —   the very discrimination that HUD, through the Fair Housing Act, seeks to prevent. (Mr. Trump’s firm settled without admitting wrongdoing.) Under President Obama, HUD expanded its civil rights reach with the Affirmatively Furthering Fair Housing Rule, which says that cities must not only respond to bias, but also take steps to prevent it. Philadelphia “was proud to become the first city” to adopt the rule, said Mayor Kenney, whose administration has just submitted an extensive plan to put the rule into effect. Some conservatives see that rule as federal intrusion into local sovereignty  —   the mayor of Castle Rock, Colo. population 55, 000, has refused to accept HUD funding to avoid having to comply  —   and Mr. Trump is likely to roll it back. Mr. Kenney, in a carefully worded statement, make clear that he would push back against any changes. “We will continue with our efforts to overcome patterns of segregation, promote fair housing choice and foster inclusive communities,” the statement said. Mr. Goldstein, who was the   director of Fair Housing and Equal Opportunity when he was at HUD, worries about something else: If Congress complied, Mr. Trump could use federal budget policy to deprive the agency of funds to enforce   laws. “You’ve got to say that, given the tenor of the rhetoric, that would be a part of HUD that would not be favored in the new administration,” Mr. Goldstein said. Words matter in politics and policy, and both Mr. Trump and Mr. Carson have made comments that make mayors and housing experts uneasy. Mr. Carson once told a television interviewer that he had risen above his circumstances by realizing that “poverty is really more of a choice than anything else,” by which he apparently meant that people escape poverty through hard work. That comment, spotlighted in a video   on the Salon website, has dogged the neurosurgeon. So has an opinion piece he wrote in which he described fair housing policy as “social engineering. ” This plays into Mr. Trump’s sweeping declarations about black people living in “inner cities” rife with crime. “I give Trump credit for talking explicitly about the importance of the inner city,” Ms. Liu said, “but we need to make sure that the policies really do address what is needed there. What we don’t need is just    tactics. ” Mr. Nutter, who is   is far more pointed he calls Mr. Trump’s characterizations of cities “a general insult. ” Philadelphia built hundreds of affordable housing units using flexible Community Development Block Grant funds while Mr. Nutter was mayor. Most of the money, he said, was spent in   communities. “I’m proud that I had seven years with President Barack Obama, who actually knew about community development because he was a community organizer,” Mr. Nutter said. “To the Philadelphia city government: Good luck dealing with the Trump administration. ”'"}, "time": 1742562102.534391}