{"duration": 0.03183698654174805, "input_args": {"text": "'  Umfrage: CETA würde enorm an Zustimmung gewinnen, wenn EU kanadische Cannabis-Standards übernehmen müsste Brüssel (dpo) - Das könnte die Wende im Streit um CETA bedeuten: Einer neuen Umfrage zufolge würde die Zustimmung der EU-Bevölkerung für das Freihandelsabkommen mit einem Schlag auf bisher unerreichte Werte steigen, wenn der Vertrag die Europäische Union dazu zwingen würde, beim Umgang mit Cannabis kanadische Standards zu übernehmen. Denn was viele CETA-Kritiker hierzulande nicht bedenken: Die kanadische Regierung unter Premierminister Justin Trudeau bereitet zurzeit eine vollkommene Freigabe von Marihuana und anderen berauschenden Hanfprodukten vor . Schon jetzt wird der Besitz und Konsum dieser Rauschmittel in der Praxis nicht verfolgt. Kommt das \"Gebt das Hanf frei!\"-Handelsabkommen? Sollte CETA zur Folge haben, dass auch die EU Cannabis legalisieren müsste, wäre plötzlich ein Großteil der europäischen Bevölkerung für das Zustandekommen des Abkommens. \"Rund 78 Prozent aller Europäer würden dann dafür plädieren, CETA unter dieser Voraussetzung so schnell wie möglich zu unterzeichnen\", sagte Dr. Martin Heumann von der Universität Wien, der die Umfrage unter mehr als 12.000 EU-Bürgern koordinierte. \"Und zwar am besten noch diese Woche, bevor die letzten Brösel aufgebraucht sind und sie sich um völlig überteuerten Nachschub auf dem Schwarzmarkt kümmern müssen.\" Einzige Ausnahme: Während die Zustimmung für CETA unter dieser Voraussetzung überall sonst sprunghaft anstieg, ließ sich bei Umfrageteilnehmern aus den Niederlanden kein messbarer Unterschied feststellen. Ersten Schätzungen zufolge dürfte das Handelsvolumen an Cannabisprodukten zwischen der EU und Kanada innerhalb kürzester Zeit um etwa 21.000.000.000 Prozent steigen (aktuell: 50 Euro monatlich, weil Sandro Keller aus Dörmagen sein Haschisch aus unerfindlichen Gründen aus Quebec bezieht) belaufen. Derzeit werde geprüft, wieviel Gramm Marihuana auf ein Containerschiff dieser Klasse passen: Letztlich hätte eine Legalisierung wohl auch für Brüssel entscheidende Vorteile. Heumann: \"Sobald die neue Drogenpolitik greift, werden die Bürger auch die negativen Folgen von CETA zufrieden grinsend ertragen. Das kann jedem EU-Politiker nur genehm sein!\" pfg, ssi, dan; Foto [M]: Shutterstock Artikel teilen:'"}, "time": 1742628502.2283375}