{"duration": 1.7245008945465088, "input_args": {"text": "'WASHINGTON  —   The C. I. A. the F. B. I. and the White House may all agree that Russia was behind the hacking that interfered with the election. But that was of no import to the website Breitbart News, which dismissed reports on the intelligence assessment as “  fake news. ” Rush Limbaugh has diagnosed a more fundamental problem. “The fake news is the everyday news” in the mainstream media, he said on his radio show recently. “They just make it up. ” Some supporters of   Donald J. Trump have also taken up the call. As reporters were walking out of a Trump rally this month in Orlando, Fla. a man heckled them with shouts of “Fake news!” Until now, that term had been widely understood to refer to fabricated news accounts that are meant to spread virally online. But conservative cable and radio personalities, top Republicans and even Mr. Trump himself, incredulous about suggestions that fake stories may have helped swing the election, have appropriated the term and turned it against any news they see as hostile to their agenda. In defining “fake news” so broadly and seeking to dilute its meaning, they are capitalizing on the declining credibility of all purveyors of information, one product of the country’s increasing political polarization. And conservatives, seeing an opening to undermine the mainstream media, a longtime foe, are more than happy to dig the hole deeper. “Over the years, we’ve effectively brainwashed the core of our audience to distrust anything that they disagree with. And now it’s gone too far,” said John Ziegler, a conservative radio host, who has been critical of what he sees as excessive partisanship by pundits. “Because the gatekeepers have lost all credibility in the minds of consumers, I don’t see how you reverse it. ” Journalists who work to separate fact from fiction see a dangerous conflation of stories that turn out to be wrong because of a legitimate misunderstanding with those whose clear intention is to deceive. A report, shared more than a million times on social media, that the pope had endorsed Mr. Trump was undeniably false. But was it “fake news” to report on data models that showed Hillary Clinton with overwhelming odds of winning the presidency? Are opinion articles fake if they   facts to draw disputable conclusions? “Fake news was a term specifically about people who purposely fabricated stories for clicks and revenue,” said David Mikkelson, the founder of Snopes, the   website. “Now it includes bad reporting, slanted journalism and outright propaganda. And I think we’re doing a disservice to lump all those things together. ” The right’s labeling of “fake news” evokes one of the most successful efforts by conservatives to reorient how Americans think about news media objectivity: the move by Fox News to brand its   coverage as “fair and balanced. ” Traditionally, mainstream media outlets had thought of their own approach in those terms, viewing their coverage as strictly down the middle. Republicans often found that laughable. As with Fox’s ubiquitous promotion of its slogan, conservatives’ appropriation of the “fake news” label is an effort to further erode the mainstream media’s claim to be a reliable and accurate source. “What I think is so unsettling about the fake news cries now is that their audience has already sort of bought into this idea that journalism has no credibility or legitimacy,” said Angelo Carusone, the president of Media Matters, a liberal group that polices the news media for bias. “Therefore, by applying that term to credible outlets, it becomes much more believable. ” Conservative news media are now awash in the “fake news” condemnations. When coverage of Mr. Trump’s choice for labor secretary, Andrew F. Puzder, highlighted his opposition to minimum wage increases, the writer and radio host Erick Erickson wrote that Mr. Puzder should have been getting more credit for pointing out that such increases lead to higher unemployment. “To say otherwise is to push fake news,” he wrote. (The effects actually have been found to vary from city to city.) Infowars, the website run by the conservative provocateur and conspiracy theorist Alex Jones, labeled as “fake news” a CNN report that Ivanka Trump would move into the office in the White House normally reserved for the first lady. Mr. Trump has used the term to deny news reports, as he did on Twitter recently after various outlets said he would stay on as the executive producer of “The New Celebrity Apprentice” after taking office in January. “Ridiculous  untrue  —   FAKE NEWS!” he wrote. (He will be credited as executive producer, a spokesman for the show’s creator, Mark Burnett, has said. But it is unclear what work, if any, he will do on the show.) Many conservatives are pushing back at the outrage over fake news because they believe that liberals, unwilling to accept Mr. Trump’s victory, are attributing his triumph to nefarious external factors. “The left refuses to admit that the fundamental problem isn’t the Russians or Jim Comey or ‘fake news’ or the Electoral College,” said Laura Ingraham, the author and radio host. “‘Fake news’ is just another fake excuse for their failed agenda. ” Others see a larger effort to slander the basic journalistic function of  . Nonpartisan websites like Snopes and Factcheck. org have found themselves maligned when they have disproved stories that had been flattering to conservatives. When Snopes wrote about a State Farm insurance agent in Louisiana who had posted a sign outside his office that likened taxpayers who voted for President Obama to chickens supporting Colonel Sanders, Mr. Mikkelson, the site’s founder, was smeared as a partisan Democrat who had never bothered to reach out to the agent for comment. Neither is true. “They’re trying to float anything they can find out there to discredit ” he said. There are already efforts by highly partisan conservatives to claim that their   efforts are the same as those of independent outlets like Snopes, which employ research teams to dig into seemingly dubious claims. Sean Hannity, the Fox News host, has aired “ ” segments on his program. Michelle Malkin, the conservative columnist, has a web program, “Michelle Malkin Investigates,” in which she conducts her own investigative reporting. The market in these divided times is undeniably ripe. “We now live in this fragmented media world where you can block people you disagree with. You can only be exposed to stories that make you feel good about what you want to believe,” Mr. Ziegler, the radio host, said. “Unfortunately, the truth is unpopular a lot. And a good fairy tale beats a harsh truth every time. ”'"}, "time": 1742563755.848673}