{"duration": 0.10748744010925293, "input_args": {"text": "'President Donald Trump fired back at Stephen Colbert in an interview this week following the Late Show host’s   attacks on him during a segment on his show this month. [In an interview with Time magazine published Thursday, the    took on Colbert, who told a series of crude jokes about Trump during last week’s Monday broadcast that culminated in the host calling Trump’s mouth a “c*ck holster” for Russian President Vladimir Putin.  “You see a   guy like Colbert. There’s nothing funny about what he says,” Trump told Time. “And what he says is filthy. And you have kids watching. ” In his opening monologue last Monday, the CBS funnyman said, “The only thing [Trump’s] mouth is good for is being Vladimir Putin’s c*ck holster. ” The joke was panned as homophobic and drew outrage from fans, who quickly made the hashtag #FireColbert a trending topic on Twitter. Colbert addressed the controversy surrounding the joke on his show two days later and said he didn’t regret attacking the president. In his remarks to media Thursday, Trump said Colbert’s crude comments “only builds up my base. ” “It only helps me, people like him. The guy was dying. By the way they were going to take him off television, then he started attacking me and he started doing better,” Trump added. “But his show was dying. I’ve done his show.   …     But when I did his show, which by the way was very highly rated  …     The highest rating he’s ever had. ” Indeed, Colbert’s   show has seen a ratings resurgence since Trump took office. The president also took aim at a number of mainstream media personalities. Trump told Time that CNN host Chris Cuomo looks like a “chained lunatic” on TV and said CNN’s Don Lemon is “perhaps the dumbest person in broadcasting. ” “Chris Cuomo, he’s sitting there like a chained lunatic. He’s like a boiler ready to explode, the level of hatred. And the entire, you know the entire CNN platform is that way,” Trump said. “This Don Lemon who’s perhaps the dumbest person in broadcasting, Don Lemon at night it’s like  —   sometimes they’ll have a guest who by mistake will say something good. And they’ll start screaming, we’re going to commercial. They cut him off. Remember?” “Washington Post, New York Times, they’re really, really dishonest,” Trump continued before lashing out at Time reporters. “You people are quite dishonest in all fairness. ” Trump also said he said he no longer tunes in to watch MSNBC’s Joe Scarborough, who has repeatedly ripped the president and his administration. The president called Fox News the “most accurate” news network and says he tunes in to watch the morning programming. “I do watch Fox in the morning, and their ratings have gone through the roof because everyone knows I’m watching Fox. But they’re pleasant. And if I do something wrong they report on it,” he said. “I don’t mean they  —   if I do something wrong. But it’s really, honestly it’s the most accurate. ” Read Trump’s full remarks to Time here.   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742628448.924338}