{"duration": 0.05529522895812988, "input_args": {"text": "'Former President Barack Obama and his wife Michelle grabbed brunch with Bono in the Big Apple Friday and were greeted with cheers and applause from a crowd of onlookers. [As the Obamas and the U2 frontman exited the restaurant, People reports, “the whole restaurant stood up and applauded and cheered for them. Barack Obama waved at everyone upon leaving. ”  Video of the Obamas exiting Upland Restaurant in Manhattan, flanked by Secret Service, flooded social media. “Obama, we love you” one person is heard screaming as the crowded eatery erupts with applause.  #powerlunch   @karanilanraymond  @lindseybono  @michelleobama  #presidentobama #nyc #upland, A post shared by Emma Wiedner (@ewiedner) on Mar 10, 2017 at 11:32am PST,  “I’m dying. I’m dead. PRESIDENT OBAMA is at lunch w us. We all clapped and cried,” one Instagram user captions.  I’m dying. I’m dead. PRESIDENT OBAMA is at lunch w us. We all clapped and cried. A post shared by Mackenzi (@mackenzi) on Mar 10, 2017 at 11:19am PST,  The bromance between President Obama and Bono dates back years. In 2010, the   crooner met with Obama and his national security team to “discuss the administration’s development strategy heading into the upcoming   and   meetings in Canada and September’s U. N. Summit on the Millenium Development Goals. ” And Friday’s was not the first brunch the Obamas and Bono have shared together. In June 2013, Michelle Obama and her two daughters dined with Bono, his wife, and their two sons at Finnegan’s Irish Pub in Dalkey, Co Dublin. Bono, of course, has been an outspoken opponent of President Donald Trump. Two months before the presidential election, Bono called Trump “potentially the worst idea that ever happened to America. ” Just last month, Bono condemned the idea of a “national border” as the best way to protect one’s country from Islamic terror. “I don’t see a body of water wide enough or a wall high enough to keep these problems from our doors,” the Irish rocker said before world leaders at the Munich Security Conference in Germany. Follow Jerome Hudson on Twitter @jeromeehudson.'"}, "time": 1742563670.6406627}