{"duration": 0.06488847732543945, "input_args": {"text": "'Emily Blunt’s metamorphosis into Rachel Watson, the physically ravaged, emotionally shattered alcoholic in “The Girl on the Train” (out Oct. 7) burrowed deeper than a mere Hollywood  . “I don’t have an addictive personality whatsoever, so it was like wearing somebody else’s skin,” Ms. Blunt said of portraying the New York City suburbanite obsessed with a seemingly perfect couple she glimpses each day on her soused commute  —   just two doors down from where her   lives with his new wife and baby. And when her fantasy woman goes missing in this feverishly anticipated adaptation of the Paula Hawkins literary sensation, Rachel, her memory failing, fears she is responsible. “As alien as this person is to who I truly am, I had to understand her and empathize and get into that ” Ms. Blunt added. “The thing I found most helpful was watching ‘Intervention’ on a loop until I had seen every type of addiction in action. ” Since   her fingers into stardom as Miranda Priestly’s senior assistant in “The Devil Wears Prada,” Ms. Blunt has revealed an impressive range, veering from an   warrior in “Edge of Tomorrow” to the barren Baker’s Wife in the screen musical “Into the Woods” to an F. B. I. agent stalking a Mexican drug cartel in “Sicario. ” Offscreen, she’s the mother of    Hazel and    Violet, her daughters with her husband, John Krasinski. In a phone interview from their Brooklyn home, the   crisply funny Ms. Blunt, 33, talked about filming while pregnant and life with another actor. These are edited excerpts from the conversation. Were you a fan of the book before you took on the role? I was determined not to read the book initially because I saw everyone else and their auntie reading it. Then the producer called me and said, “We’re really interested in you for it, and do you want to have a read and see what you think?” I could quickly see why it became the phenomenon that it did. These domestic thrillers are quite tantalizing for readers. You can see yourself in these people. And that idea of danger being close to home is exciting. What appealed about Rachel? I don’t think I’ve ever played somebody who is living in such a dark place, who is truly in the depths of despair. And it was such an unusual element for your female protagonist, your heroine, to be a blackout drunk. In these movies that are expected to be blockbusters, women are usually held in some sort of feminine ideal, so that they’re appealing and likable and pretty. And I just thought, How fantastic that she looks like this and that she is your eyes and ears, the most unreliable witness, the most unreliable narrator in the world. It was a very easy yes. Your Rachel is not the very overweight Rachel of the book. Tate [Taylor, the director, whose credits include “The Help”] wanted it being less that she physically had let herself go and more a state of mind. She is not just an addict. She is compulsive and voyeuristic and damaged and  . Considers herself dangerous. I thought, What a thrill to play somebody who spends the entirety of the film living in fear of their own abilities and their own downfalls. What are the hallmarks of her addiction? Oh, huge guilt and huge regret  —   and regret is one of the most horrific emotions. She’s been spun a whole web of lies that she so readily believes about herself. She is certainly not somebody who walks into every room with great hope. She walks into every room with the idea that nobody wants to breathe the same air as her. How far did Tate allow you to go in finding the character? He gives you free rein, and I found that very helpful, to not feel straitjacketed or to conform to somebody else’s vision. She really needed to be my own, because it was such a stretch for me. The more I do this job, the more I realize that so much about performance is creating happy environments for people and making sure that they know that they can mess up and it doesn’t matter. You can always go again. Did it bother you that the setting was moved from London to Ardsley, N. Y.? In a way you can transplant this movie and put it anywhere, because that suburban commute is universal. Did you actually shoot on a train? We shot all of the interior stuff on this incredible rig that they made with green screen and plate shots. It was incredibly technical and complicated, and everyone just felt really seasick, because the train was jiggling around and moving but going nowhere. So it was like being in some weird twilight zone. And it was suffocatingly hot, and the poor extras were barely being offered a thimble of water. And you were pregnant on top of it. The only person who knew was Justin Theroux, because he’s my   friend. And he guessed, because I was being a bit of a wuss about some of the stunts. He was like, “You did ‘Edge of Tomorrow.’ What is wrong with you? Are you pregnant?” And I was like: “Yes, but shut up! Don’t tell anybody!” Then I had to tell Tate a little further along, because there was that scene in the bathtub, and I was like: “Here’s the deal. You have to shoot it from behind. ” And he was like, “Why?” And I was like, “No. 1, because I don’t want to show everything, but No. 2, because of this. ” I was like 20 weeks when we finished. You’ve spoken out about the need for pay equity in Hollywood. Do you feel you’ve made a difference? It is up to people like me, in my very fortunate position, to fight for equal pay, because that means that people who have less of a voice may receive the same. But I honestly don’t know if speaking out is the thing that makes the difference. I think it’s more in how I react when I’m making a deal. You’ve been cast as Mary Poppins in a coming remake, and Julie Andrews has given you her stamp of approval. Well, thank God! Can you imagine if she was like, “Oh God, not her”? I’d be devastated. But I’m very excited. My heart races about it, actually. And what a gift as a mom to have that for my daughters. What’s it like being a working mother in a   family? [Laughs sharply] Sometimes actresses talk about being a working mother as if they’re the only working mothers in the world. My sister, for example, is a literary agent who literally wakes up to 800 emails in her inbox, and she has a   . I don’t know how she does it. I actually get long chunks of time off that I take very seriously, because my kids are at very tender ages where they need me. And I’m very fortunate, because there are so many mothers who don’t get to be picky about when they work. The   family thing has always been something wonderful for John and I, because we deeply understand what each other do and have a shared love of it. Actresses say to me, “Oh I could never be with an actor. ” But I think it depends on the actor. You know, I just happen to be with a very secure, wonderful one. With great abs, according to People magazine. With great abs. Exactly.'"}, "time": 1742628464.9807436}