{"duration": 0.0778651237487793, "input_args": {"text": "'2 Police Officers Turn In Badges In Support Of Standing Rock Water Protectors Nov 3, 2016 162 0 \\nEarlier today it was reported by Redhawk at Standing Rock in North Dakota that two police officers have turned in their badges in support of the water protectors. \\n“There have been at least 2 reports of police officers turning in their badges acknowledging that this battle is not what they signed up for. You can see it in some of them, that they do not support the police actions. We must keep reminding them they are welcome to put down their weapons and badge and take a stand against this pipeline as well. Some are waking up.” -Redhawk Hearts are opening. \\nWith actions from militarized police continuing to be seen as extremely violent and dangerous, this news is a big win for the water protectors and for humanity as a whole. While the actions of some police officers are not appropriate, we all must continue to visualize and intend/pray that the hearts of all involved in this situation continue to open. Police must be held accountable for their actions, though we must continue to welcome them over to the side of the water protectors. \\nHaving the police lay down their weapons and join the people is the goal. It is also a win-win solution, which is the best case scenario. So what is it that opened the hearts of these two officers? \\nAt the time of this writing, the answer is not known but we can speculate on a few different items. Word is spreading quickly that there are 17 multi-national banks funding this pipeline and that the propaganda being spread about this deal “creating American jobs” or “helping America’s economy” is being seen as just that, propaganda. The American people, as well as people of the world, know that the big banks and U.S. Government does not care for the people, but only themselves. These banks and the government showed their hand in 2008 when they were bailed out after the stock market crash, leaving the public to bear the economic and social burdens. Even the police are becoming aware of this fact that the government and banks do not care for them and see the police only as pawns in a bigger game the government wishes to control. Water is life is not just a meaningless slogan in many people’s minds. It is becoming understood by more and more that water IS indeed life. If water becomes toxic, all life that depends on that water becomes toxic…including the families of these same police officers who are currently protecting the construction sites. They too would be affected by toxic water. It is innately traumatizing for humans to hurt other humans. While we have been seeing this for some time now with this situation, police officers are realizing the harm they do when they assault an unarmed, peaceful water protector. In essence, peace is wanting and needing to be established. \\nTake a look at what happened in Frankfurt, Germany in May of 2012. The police removed their helmets and began marching with the people who were protesting the big banks, while also safely escorting them down the streets. The world continues to awaken. \\nLet us all use this latest news as a big step forward towards peace and resolution of this pipeline issue. The pipeline construction needs to and must stop. With the announcement from Barack Obama yesterday that the White House is considering “re-routing” the pipeline, we must continue to demand that it’s construction cease entirely. We can also view that statement as a buckling of the Establishment. Continue on, water protectors. Truth and love is spreading . \\nLance Schuttler graduated from the University of Iowa with a degree in Health Science and practices health coaching through his website Orgonlight Health . You can follow the Orgonlight Health facebook page or visit the website for more information on how to receive health coaching for yourself, a family member or a friend as well as view other inspiring articles. '"}, "time": 1742563713.4670637}