{"duration": 0.1952071189880371, "input_args": {"text": "'Waking Times \\nNormal is coming unhinged. For the last eight years it has been possible for most people (at least in the relatively privileged classes) to believe that society is sound, that the system, though creaky, basically works, and that the progressive deterioration of everything from ecology to economy is a temporary deviation from the evolutionary imperative of progress. \\nA Clinton Presidency would have offered four more years of that pretense. A woman President following a black President would have meant to many that things are getting better. It would have obscured the reality of continued neoliberal economics, imperial wars, and resource extraction behind a veil of faux-progressive feminism. Now that we have, in the words of my friend Kelly Brogan , rejected a wolf in sheep’s clothing in favor of a wolf in wolf’s clothing, that illusion will be impossible to maintain. \\nThe wolf, Donald Trump (and I’m not sure he’d be offended by that moniker) will not provide the usual sugarcoating on the poison pills the policy elites have foisted on us for the last forty years. The prison-industrial complex, the endless wars, the surveillance state, the pipelines, the nuclear weapons expansion were easier for liberals to swallow when they came with a dose, albeit grudging, of LGBTQ rights under an African-American President. \\nI am willing to suspend my judgement of Trump and (very skeptically) hold the possibility that he will disrupt the elite policy consensus of free trade and military confrontation – major themes of his campaign. One might always hope for miracles. However, because he apparently lacks any robust political ideology of his own, it is more likely that he will fill his cabinet with neocon war hawks, Wall Street insiders, and corporate reavers, trampling the wellbeing of the working class whites who elected him while providing them their own sugar-coating of social conservatism. \\nThe social and environmental horrors likely to be committed under President Trump are likely to incite massive civil disobedience and possibly disorder. For Clinton supporters, many of whom were halfhearted to begin with, the Trump administration could mark the end of their loyalty to our present institutions of government. For Trump supporters, the initial celebration will collide with gritty reality when Trump proves as unable or unwilling as his predecessors to challenge the entrenched systems that continually degrade their lives: global finance capital, the deep state, and their programming ideologies. Add to this the likelihood of a major economic crisis, and the public’s frayed loyalty to the existing system could snap. \\nWe are entering a time of great uncertainty. Institutions so enduring as to seem identical to reality itself may lose their legitimacy and dissolve. It may seem that the world is falling apart. For many, that process started on election night, when Trump’s victory provoked incredulity, shock, even vertigo. “I can’t believe this is happening!” \\nAt such moments, it is a normal response to find someone to blame, as if identifying fault could restore the lost normality, and to lash out in anger. Hate and blame are convenient ways of making meaning out of a bewildering situation. Anyone who disputes the blame narrative may receive more hostility than the opponents themselves, as in wartime when pacifists are more reviled than the enemy. \\nRacism and misogyny are devastatingly real in this country, but to blame bigotry and sexism for voters’ repudiation of the Establishment is to deny the validity of their deep sense of betrayal and alienation. The vast majority of Trump voters were expressing extreme dissatisfaction with the system in the way most readily available to them. (See here , here , here , here ) Millions of Obama voters voted for Trump (six states who went for Obama twice switched to Trump). Did they suddenly become racists in the last four years? The blame-the-racists (the fools, the yokels…) narrative generates a clear demarcation between good (us) and evil (them), but it does violence to the truth. It also obscures an important root of racism – anger displaced away from an oppressive system and its elites and onto other victims of that system. Finally, it employs the same dehumanization of the other that is the essence of racism and the precondition for war. Such is the cost of preserving a dying story. That is one reason why paroxysms of violence so often accompany a culture-defining story’s demise. \\nThe dissolution of the old order that is now officially in progress is going to intensify. That presents a tremendous opportunity and danger, because when normal falls apart the ensuing vacuum draws in formerly unthinkable ideas from the margins. Unthinkable ideas range from rounding up the Muslims in concentration camps, to dismantling the military-industrial complex and closing down overseas military bases. They range from nationwide stop-and-frisk to replacing criminal punishment with restorative justice. Anything becomes possible with the collapse of dominant institutions. When the animating force behind these new ideas is hate or fear, all manner of fascistic and totalitarian nightmares can ensue, whether enacted by existing powers or those that arise in revolution against them. \\nThat is why, as we enter a period of intensifying disorder, it is important to introduce a different kind of force to animate the structures that might appear after the old ones crumble. I would call it love if it weren’t for the risk of triggering your New Age bullshit detector, and besides, how does one practically bring love into the world in the realm of politics? So let’s start with empathy. Politically, empathy is akin to solidarity, born of the understanding that we are all in this together. In what together? For starters, we are in the uncertainty together. \\nWe are exiting an old story that explained to us the way of the world and our place in it. Some may cling to it all the more desperately as it dissolves, looking perhaps to Donald Trump to restore it, but their savior has not the power to bring back the dead. Neither would Clinton have been able to preserve America as we’d known it for too much longer. We as a society are entering a space between stories, in which everything that had seemed so real, true, right, and permanent comes into doubt. For a while, segments of society have remained insulated from this breakdown (whether by fortune, talent, or privilege), living in a bubble as the containing economic and ecological systems deteriorate. But not for much longer. Not even the elites are immune to this doubt. They grasp at straws of past glories and obsolete strategies; they create perfunctory and unconvincing shibboleths (Putin!), wandering aimlessly from “doctrine” to “doctrine” – and they have no idea what to do. Their haplessness and half-heartedness was plain to see in this election, their disbelief in their own propaganda, their cynicism. When even the custodians of the story no longer believe the story, you know its days are numbered. It is a shell with no engine, running on habit and momentum. \\nWe are entering a space between stories. After various retrograde versions of a new story rise and fall and we enter a period of true unknowing, an authentic next story will emerge. What would it take for it to embody love, compassion, and interbeing? I see its lineaments in those marginal structures and practices that we call holistic, alternative, regenerative, and restorative. All of them source from empathy, the result of the compassionate inquiry: What is it like to be you? \\nIt is time now to bring this question and the empathy it arouses into our political discourse as a new animating force. If you are appalled at the election outcome and feel the call of hate, perhaps try asking yourself, “What is it like to be a Trump supporter?” Ask it not with a patronizing condescension, but for real, looking underneath the caricature of misogynist and bigot to find the real person. \\nEven if the person you face IS a misogynist or bigot, ask, “Is this who they are, really?” Ask what confluence of circumstances, social, economic, and biographical, may have brought them there. You may still not know how to engage them, but at least you will not be on the warpath automatically. We hate what we fear, and we fear what we do not know. So let’s stop making our opponents invisible behind a caricature of evil. \\nWe’ve got to stop acting out hate. I see no less of it in the liberal media than I do in the right-wing. It is just better disguised, hiding beneath pseudo-psychological epithets and dehumanizing ideological labels. Exercising it, we create more of it. What is beneath the hate? My acupuncturist Sarah Fields wrote to me, “Hate is just a bodyguard for grief. When people lose the hate, they are forced to deal with the pain beneath.” \\nI think the pain beneath is fundamentally the same pain that animates misogyny and racism – hate in a different form. Please stop thinking you are better than these people! We are all victims of the same world-dominating machine, suffering different mutations of the same wound of separation. Something hurts in there. We live in a civilization that has robbed nearly all of us of deep community, intimate connection with nature, unconditional love, freedom to explore the kingdom of childhood, and so much more. The acute trauma endured by the incarcerated, the abused, the raped, the trafficked, the starved, the murdered, and the dispossessed does not exempt the perpetrators. They feel it in mirror image, adding damage to their souls atop the damage that compels them to violence. Thus it is that suicide is the leading cause of death in the U.S. military. Thus it is that addiction is rampant among the police. Thus it is that depression is epidemic in the upper middle class. We are all in this together. \\nSomething hurts in there. Can you feel it? We are all in this together. One earth, one tribe, one people. \\nWe have entertained teachings like these long enough in our spiritual retreats, meditations, and prayers. Can we take them now into the political world and create an eye of compassion inside the political hate vortex? It is time to do it, time to up our game. It is time to stop feeding hate. Next time you post on line, check your words to see if they smuggle in some form of hate: dehumanization, snark, belittling, derision.., some invitation to us versus them. Notice how it feels kind of good to do that, like getting a fix. And notice what hurts underneath, and how it doesn’t feel good, not really. Maybe it is time to stop. \\nThis does not mean to withdraw from political conversation, but to rewrite its vocabulary. It is to speak hard truths with love. It is to offer acute political analysis that doesn’t carry the implicit message of “Aren’t those people horrible?” Such analysis is rare. Usually, those evangelizing compassion do not write about politics, and sometimes they veer into passivity. We need to confront an unjust, ecocidal system. Each time we do we will receive an invitation to give in to the dark side and hate “the deplorables.” We must not shy away from those confrontations. Instead, we can engage them empowered by the inner mantra that my friend Pancho Ramos-Stierle uses in confrontations with his jailers: “Brother, your soul is too beautiful to be doing this work.” If we can stare hate in the face and never waver from that knowledge, we will access inexhaustible tools of creative engagement, and hold a compelling invitation to the haters to fulfill their beauty. About the Author'"}, "time": 1742561700.7444625}