{"duration": 0.0501704216003418, "input_args": {"text": "'Características de la nueva Nintendo Switch EL PRINCIPAL ENTRETENIMIENTO QUE OFRECE ES MONTAR SUS 357 COMPONENTES \\nNintendo presentó hace pocas semanas su nueva Nintendo Switch, una consola mezcla en un mismo aparato las características de una sobremesa con una portátil. En los últimos días, se han ido desgranando nuevas características y prestaciones. \\n· Se puede acoplar a un aparato de televisión o a un hijo. \\n· Sirve como consolador asegurando diversión para toda la familia. \\n· Sale un montón de mierda de dentro. \\n· Puedes quitarle piezas y usarla de botón para la camisa. \\n· Si se le acoplan todos los periféricos, el jugador puede construirse un pequeño refugio e introducirse en el interior de la consola. \\n· Según cómo se monte, parece una Super Nintendo. \\n· Suena una alarma si la consola detecta que el usuario está haciendo el ridículo en público. \\n· Puedes llevarla a las fiestas y seguir jugando a solas tu partida mientras los demás se divierten. \\n· Los cartuchos desmontables son compatibles con los rifles AK- 47. \\n· Se puede acoplar a la Play 4 para jugar a juegos buenos. \\n· Es posible jugar 24 horas al día con ella, en cualquier sitio y sin hacer absolutamente nada más hasta fenecer de inanición o agotamiento. \\n· Incluye una ranura en la que depositar donaciones para que Nintendo salga adelante. \\n· Pueden jugar mujeres. \\n· Existe la posibilidad de pagarla a plazos o por componentes, lo que permite hacerse con una consola en 632 meses. \\n· Cuando ya se tienen todas las piezas, la consola es un Transformer que cobra vida e intenta destruir el planeta. \\n· Permite formar gobierno con la abstención del PSOE. \\n· Le falta una pieza que viene de Alemania.'"}, "time": 1742562040.7857852}