{"duration": 0.07853221893310547, "input_args": {"text": "'President Donald Trump hosted a listening session at the White House to highlight the problems with Obamacare, as Americans continue to suffer from higher insurance premiums, higher deductibles and less coverage. [The president met nine American citizens Monday who were suffering the financial effects of what he described as the “very, very, failed and failing Obamacare law. ”  Trump told the group that he would put into place a better plan that “lowers cost, expands choice, and ensures access for everyone” and promised “more competition and less regulation” in the market place. “You’ll see rates go down, down, down, and you’ll see plans go up, up, up, you’ll have a lot of choices,” he said. Trump admitted that it would take a few years to fully fix the insurance marketplace, but promised that it would be “a thing of beauty” when completed. He was critical of the media for reporting that Obamacare was doing well. “It’s a little bit like President Obama, when he left people like him, when he was here, people didn’t like him so much. That’s the way life goes, that’s human nature. ” Trump said that Republicans were in bad position politically by trying to repeal Obamacare, when it would be easier to let it collapse entirely. “The press is making Obamacare look so good all of a sudden,” he said, predicting disastrous results for the law in 2017. Carrie Couey, a cattle rancher from Colorado explained that her rates under Obamacare were three times the rates and that multiple insurers had dropped their coverage. “Millions of people had great health care that they loved,” Trump said. Brittany Ivey of George said her private insurance rates went up 110 percent, and that even though she was paying $1300 a month for a plan, her doctors wouldn’t take the insurance. “We’re so happy to be seeing it going,” she said. “It’s almost put our family in financial ruin. ” Elias Seife, Florida, an attorney from Florida, said that their insurance had changed every year since Obamacare was put into place, noting that they had a daughter with a disability. “I think the real scenario was that this law was supposed to implode   …     my parents came from communist Cuba, they know what socialism is all about, so I know what socialism is and that’s pretty much what this whole system was meant to have one single provider,” Seife said. Kim Sertich from Arizona told the president that the 116 percent increases reported in her state were very real, explaining that she lost her plan three times before opting out of getting health care all together. A nurse from Wisconsin, Gina Sell, said that she was forced to take a full time job and more time away from her family after, One man, Greg Knox of Ohio, gave the president a cutout card of his face with a note that was created by his    son. Greg Knox of Ohio brings @realDonaldTrump a card that his    son made for him pic. twitter.   —   Charlie Spiering (@charliespiering) March 13, 2017,  “I wish I looked that good,” Trump said, showing the card to the rest of the group.'"}, "time": 1742561856.585648}