{"duration": 0.031710147857666016, "input_args": {"text": "'MAKING frozen vegetables hip is a daunting task, but BG Foods thinks it has just the guy to do it. The company is bringing back the Jolly Green Giant after a long hiatus to introduce new recipes. But his comeback comes with a twist. The campaign will initially seek to create a sense of mystery by not showing the giant. BG, which bought the more than    Green Giant brand from General Mills for $765 million last year, is betting that the way to appeal to finicky children and picky parents is with new dishes, an old mascot and a dash of suspense. In a   trailer released in September titled “The Giant Awakens,” people look to the sky, mouths agape. Cars screech to a halt, raucous children in a swimming pool fall silent and grocery bags fall to the ground. Yet the giant is visible only indirectly: through footprints in fields and shadows that fall across skyscrapers. “It’s well done,” said David R. Just, professor and   of the Cornell Center for Behavioral Economics in Child Nutrition Programs. “By the end of it, it leaves you wondering, ‘So what’s going to happen?’ I think they’ve hit the right note there. ” Dan Kelleher, the chief creative officer of the New York office of Deutsch, which BG chose as its marketing and advertising agency for the Green Giant brand, said the “cinematic” element of suspense in the trailer, which mimics a fantasy or superhero movie, provided flexibility about where the ad could be shown. “We were able to air this in movie theaters as a teaser,” said Jordan Greenberg, vice president and general manager of the Green Giant brand at BG. “It didn’t look like a regular commercial. ” Mr. Just added, “Kids are going to love this because it looks like an ad or a preview for a movie. ” The slowly unfolding narrative is a good way to reintroduce the giant to audiences that remember him and to introduce him to others, especially younger viewers, Mr. Just said. “The goal with the two teams together was to figure out how to build this brand back in a very large way,” Bob Cantwell, the president and chief executive of BG Foods, said about the Green Giant   group and Deutsch. “It’s a very powerful teaser commercial. We’ll probably continue to use it in some format” as the campaign continues, he said. The giant has also received some updates to keep up with the times, acquiring a selfie stick and a Spotify playlist, for instance. There is a Green Giant Instagram account, which purports to chronicle a   road trip taken by the giant and his elfin buddy, Sprout. There are dozens of “snapshots” of landmarks and sight gags, like the giant doing triceps dips on the St. Louis Gateway Arch, but viewers won’t see his face in a commercial until the campaign’s reveal moment in television ads next month. Mr. Cantwell said the $30 million BG was spending on the campaign was just the beginning. “We’re going to continue that level of spend, if not more, as we go through 2017, 2018 and 2019  —   we’re going to continue to support this,” he said. While the bulk of the money is expected to be for TV ads, the campaign includes elements like mobile   stands at concerts and other events where people can sample new dishes. Next year, print ads will appear in magazines like People and Real Simple. “He was always the good giant in the distance,” Mr. Greenberg said. “We’re going to make him more relevant, more socially active with the consumer, and bring him into today’s world. ” Tying a new campaign to a   character could be a good way to do this, industry experts say. “This whole concept of what’s old is new again is something the resonates across the consumer landscape,” said David Portalatin, chief food analyst at the NPD Group, a market research firm. “The giant is kind of this returning superhero,” Mr. Greenberg said, a story line on which future ad material will build. Parents, of course, might view true heroics as getting their children to willingly gobble up vegetables, and BG has something for them as well. “The next step is the reason why the giant’s back,” Mr. Kelleher said, “to introduce new food products and frozen vegetables. ” BG is introducing 15 new products, including roasted vegetables, mashed cauliflower and vegetable tots, which substitute ingredients like broccoli and cauliflower for the usual potatoes. “It speaks to the way consumers are eating today and what they’re feeding their children,” Mr. Greenberg said.'"}, "time": 1742628573.2208545}