{"duration": 0.29698729515075684, "input_args": {"text": "'President Barack Obama has less than 70 days to achieve one of the key goals that will define his legacy: close the Guantanamo Bay military prison. \\nThere are 60 prisoners at Guantanamo. Twenty of them were cleared by the Obama administration and could be freed. \\nOf course, the specter of a Donald Trump presidency has those who pushed for the closure of Guantanamo frightened because Trump said he would bring new prisoners to the facility. What if Obama had closed the facility years ago? Would this even be a possibility? \\nJoining me on the “Unauthorized Disclosure” podcast, journalist Andy Worthington talks to me about the final push to close Guantanamo. He is the co-founder of the “ Close Guantanamo ” campaign. He also is a musician, who wrote a song for his band, Four Fathers, about closing the military prison. His work can be found here .\\nThe interview starts at the 30:00 mark. Later in the interview, we go on a bit of a tangent and spend a few minutes addressing the rise of far-right elements in the United States and the United Kingdom, particularly because Worthington is based in the U.K. \\nBelow is a partial transcript of the interview: \\nGOSZTOLA: What do you plan to do during final days of President Obama’s presidency to push for the closure of Guantanamo, especially now that Donald Trump is president and open to torture and possibly even bringing more prisoners to Guantanamo? \\nWORTHINGTON: I’ve been working on the Guantanamo issue for over ten years, and it’s always been my intention to try and get it closed. So, back in January 2012, when it was the tenth anniversary of the opening of the prison, I setup a campaign and website called “Close Guantanamo” with the attorney Tom Wilner, who represented the Guantanamo prisoners in their Supreme Court cases in 2004 and 2008. \\nWhat we did this year, 2016, is we setup a countdown to close Guantanamo. So we counted down the last year of the presidency, and every 50 days we have these posters that they could print off that they could stand with, they could send in to us, and we put them on to the website and on social media. We’ve had over 500 celebrities and people across the U.S. and around the world sending in photos every 50 days. \\nOf course, we’re now into the very last ten weeks of Obama’s presidency so what I am trying to do is just to keep the pressure on as we’ve been doing all year just to try and keep President Obama aware that people are watching. Obviously, he doesn’t need any telling. After the election result, it’s more urgent than ever. If he really does want to close the prison, he needs to do everything that he can in his power to do it before he leaves office because, as you say, Donald Trump has said on the campaign trail that he wants to keep it open. He wants to send Americans there to be prosecuted. He wants to reintroduce torture. \\nNow, we also know that Donald Trump, to be generous, is a colossal windbag, and that it’s not necessarily true that the things he says he means. But he is now the president. The Republican Party that he nominally is the president of is in control of the Senate and the House, and there are some very unpleasant characters in the Republican Party, who love Guantanamo and who would love to reinstitute torture. \\nI think it’s fair enough at this point for people to be genuinely worried that any progress that has been made toward the closure of Guantanamo is going to hit a very sticky patch with the inauguration of Donald Trump. \\nGOSZTOLA: I get the real sense that we shouldn’t take any chances here, that perhaps the human rights community could get to Donald Trump and convince him that Guantanamo needs to be closed. We already see figures surrounding him like Rudy Giuliani and also, a quite goonish character, Tom Cotton, who is a senator, and former veteran, who has incredible bloodlust. \\nWORTHINGTON: He’s a dreadful individual. It’s so out of control that kind of massive enthusiasm for Guantanamo and the hysteria and the exaggeration about the people who were held there. Any rational analysis of Guantanamo has always has always accepted there are a handful of significant people there, but the majority of people there never were. It’s awful the things he’s been saying. \\nBut you know, I’m really worried about the kind of people we’re hearing that are gathering around Donald Trump. I thought we’d seen the last of Rudy Giuliani and people like that. I’m hearing people mention John Bolton. Surely not. Surely, we’re not going to put up with him again. But who knows? \\nGOSZTOLA: The neoconservatives, as they call them, ran away from Donald Trump, but it seems they may be coming back, as it’s their only way to have access to power. So let’s talk about the critical issue of the human beings, who still remain captive at Guantanamo. I know you’ve done some recent work on Abu Zubaydah. Just so people can have a case within our interview to think about, and to think about the critical importance of closing Guantanamo and what’s at stake, talk about how he was denied release and what we know about how he was treated. \\nWORTHINGTON: I suppose I should really start out by breaking down who is at Guantanamo, these 60 men. Twenty of them have been approved for release by two review boards, one back in 2009. There are still a handful of men approved for release then, who haven’t actually been freed. The rest of them were approved by a review board that’s been taking place over the last few years, the Periodic Review Board, which is like a parole board. People have to demonstrate they show contrition for what they did, and they want to have constructive peaceful lives if they’re released. \\nThat process has been involving at Guantanamo, who isn’t already approved for release or facing trial. And just ten men are facing trials. So, at present, of those people held, there are 30 men, who have had these reviews, that have said on balance we’ve reviewed their cases and we’re still going to carry on holding them but we’re not putting them on trial. \\nAbu Zubaydah is one of those people. He was the person that the Bush administration’s CIA torture program was created for. He was the first victim of that. He was someone who was outrageously hyped up by the Bush administration as somebody close to Osama bin laden, involved in 9/11 attacks. Number three in al Qaida was what they were saying at the beginning, even though there were people in the intelligence community who knew from the beginning that this simply was true about him\\nBut they tortured him abominably, waterboarded him on 83 occasions, destroyed him in some ways. He has fits, is in a pretty terrible way. All of this was for somebody that was who they said he was. The U.S. government eventually backed down and said they didn’t think he knew about the 9/11 attacks. He wasn’t a member of al Qaida. They’re still trying to suggest that he was part of some kind of militia that would enable to say he was an enemy of the United States. \\nThe thing about Zubaydah is obviously, as with everybody held, the terrible things that happened should not have happened. Skilled interrogators would have been able to sit down with these guys without laying a finger on them and get information from them. Then we would have been able to have trials that would have been acceptable. But this is a kind of revisionism of history that didn’t happen—Terrible things happened instead.\\nThis man was a facilitators for an independent training camp that had some involvement in militarily training and some people that were trained there it seems went away and became involved in plots. So it’s not that there isn’t a case against him on some level, but whether he actually constituted an enemy of the United States, I couldn’t really say. \\nBut there he is in Guantanamo, and like all these to moral or other degrees were mistreated and who may or may not have done things in some way against the United States, he’s had this review process, and they’ve said, well, no, we’re not going to approve him for release. He’s now eligible for further reviews, as are all the other men who had their ongoing imprisonment upheld. \\nNow, these reviews were initiated several years ago by an executive order that President Obama. They involve the Defense Department, the intelligence agencies, all the major government departments. So it’s an ongoing process unless, of course, a new government decided they were not interested in them, and we don’t know where President-To-Be Donald Trump stands on the periodic review boards or where the people gathering around him stand on them. But I think it would be fair to say there will be a certain amount of hostility toward them. What I don’t know is how much within these departments of the kind of unchanging people who do the work, regardless of who the government is, how much there will be feedback within these various departments and agencies about what they think is the usefulness or not of reviewing people. \\nI think it’s fair to say that we’re fortunate—those of us who want to see Guantanamo closed—that President Obama has done so much in recent years to reduce the population. \\nGOSZTOLA: There’s been a lot of promising developments, especially in the last year, but at the last time, you see a real failure because now with the election of Donald Trump the Obama administration has left the door open for the military to keep using it as a facility. Right now, as I understand it, some of the camps are being transformed into mental health or hospital facilities. Still, easily, you could put the brakes on that. Donald Trump could use that again for what we already have read about in your reporting and other books. \\nWORTHINGTON: I have to say, although the worst case scenario could happen in anything we think of, when we look at Donald Trump and these figures within the Republican Party who want power and influence—There are very strong arguments I suspect will be made by career bureaucrats, by lawyers, and certainly of course by NGOs. I would not expect silence from the liberal media. I would think there would be a lot of voices discussing very loudly how inappropriate it would be, for example, to send anyone new to Guantanamo. \\nPresident Obama, to his credit, he always treated it as a legacy issue. He never sent anybody there. Every time that some terrorist suspect was apprehended, pretty much wherever it was, these Republicans, the kind of people now jockeying for power, would have been saying send this person to Guantanamo. Give him the works. Torture them. All of this stuff, and ridiculous, and he never did. \\nThis isn’t just some kind of humanitarianism that can be easily dismissed. The truth is if you apprehend a terrorism suspect and what to give them a trial then do it in federal courts. Because federal courts have a long and capable history of doing it. What everybody needs to remember and what even the great cheerleaders for Guantanamo actually know when you put them on the spot is that when Guantanamo was setup there were still federal court trials taking place successfully for people accused of terrorism. The same happened throughout the Obama administration. \\nReally when you step back and look at it and strip away the hysteria, Guantanamo is an aberration. It’s a broken place that doesn’t work. It would be very hard to make a case. We’re not thankfully in the middle of a national emergency like we were in the wake of 9/11. \\nThere is no clear and present danger to the nation that would justify people saying, I know what the rules are that normally reply, but the thing that’s happening to us is so awful that we must throw away all those ways of behaving and do this terrible thing. There isn’t actually any pressure for doing that that is justifiable. I think that it would be difficult for them to justify it, and there would be a lot of resistance institutionally. But you know, who am I to know? If people take over with an aggression and craziness, it’s possible they can steamroll everything before them. \\nGOSZTOLA: You also are a singer, and you have a band. I wanted to have you share the work you’ve been doing. It’s called the Four Fathers. You recorded a song particularly for the campaign to close Guantanamo.\\nWORTHINGTON: I’ve kind of revisited something I’ve done before, which is to sing about something of importance to me. You actually made a “Protest Song of The Week” awhile back, the song I wrote for Shaker Aamer who was the last British resident in Guantanamo who I was campaigning to release. I came up with another song fairly recently. Earlier this year was when I came up with it, about Guantanamo. \\nThat kind of fell into place that here’s this sunny, bouncy tune, which I think is probably appropriate for what this corner of the Caribbean should be, and then I basically just sang about what’s happened at Guantanamo since the prison was setup. I kind of distilled into verse what I’ve always understood about it—how the Bush administration chose it to be beyond the law, said they could torture and abuse people, when they tortured and abused people they told lies, they had the nerve to then present these lies that people told under torture and abuse as though they were the truth. \\nAnd then the last verse of the song, which I’ve used in the campaign video for the “Close Guantanamo” campaign is about President Obama’s struggles to close Guantanamo and what seems to be his failure to be able to do so. I hope people will like the song. I think it tells the story well and in a good manner. It would be lovely if you could play it to your listeners. \\nListen to “Close Guantanamo”: \\n\\nThe post Interview: Andy Worthington On Final Push To Close Guantanamo appeared first on Shadowproof .\\n'"}, "time": 1742564095.1625807}