{"duration": 1.5963456630706787, "input_args": {"text": "'The Velocity Of Money In The U.S. Falls To An All-Time Record Low By Michael Snyder, on June 1st, 2014 \\nWhen an economy is healthy, there is lots of buying and selling and money tends to move around quite rapidly. Unfortunately, the U.S. economy is the exact opposite of that right now. In fact, as I will document below, the velocity of M2 has fallen to an all-time record low. This is a very powerful indicator that we have entered a deflationary era, and the Federal Reserve has been attempting to combat this by absolutely flooding the financial system with more money. This has created some absolutely massive financial bubbles, but it has not fixed what is fundamentally wrong with our economy. On a very basic level, the amount of economic activity that we are witnessing is not anywhere near where it should be and the flow of money through our economy is very stagnant. They can try to mask our problems with happy talk for as long as they want, but in the end it will be clearly evident that none of the long-term trends that are destroying our economy have been addressed. \\nDiscussions about the money supply can get very complicated, and that can cause people to tune out, but it doesn’t have to be that way. \\nTo put it very basically, when there is lots of economic activity, there is lots of money changing hands. \\nWhen there is not very much economic activity, the pace at which money circulates through our system slows down. \\nThat is why what is happening in the U.S. right now is so troubling. \\nFirst, let’s look at M1, which is a fairly narrow definition of the money supply. The following is how Investopedia defines M1… \\nA measure of the money supply that includes all physical money, such as coins and currency, as well as demand deposits, checking accounts and Negotiable Order of Withdrawal (NOW) accounts. M1 measures the most liquid components of the money supply, as it contains cash and assets that can quickly be converted to currency. It does not contain “near money” or “near, near money” as M2 and M3 do. \\nAs you can see from the chart posted below, the velocity of M1 normally declines during a recession. Just look at the shaded areas in the chart. But a funny thing has happened since the end of the last recession. The velocity of M1 has just kept falling and it is now at a nearly 20 year low… \\nNext, let’s take a look at M2. It includes more things in the money supply. The following is how Investopedia defines M2… \\nA measure of money supply that includes cash and checking deposits (M1) as well as near money. “Near money” in M2 includes savings deposits, money market mutual funds and other time deposits, which are less liquid and not as suitable as exchange mediums but can be quickly converted into cash or checking deposits. \\nIn the chart posted below, we can once again see that the velocity of M2 normally slows down during a recession. And we can also see that the velocity of M2 has continued to slow down in the “post-recession era” and has now dropped to the lowest level ever recorded … \\nThis is a highly deflationary chart. \\nIt clearly indicates that economic activity in the U.S. has been steadily slowing down. \\nAnd if we are honest, we have to admit that we are seeing signs of this all around us. Major retailers are closing down stores at the fastest pace since the collapse of Lehman Brothers, consumer confidence is down , trading revenues at the big Wall Street banks are way down , and the steady decline in home sales is more than just a little bit alarming . \\nIn addition, the employment situation in this country is much less promising than we have been led to believe. According to a report put out by the Republicans on the Senate Budget Committee, an all-time record one out of every eight men in their prime working years are not in the labor force … \\n“There are currently 61.1 million American men in their prime working years, age 25–54. A staggering 1 in 8 such men are not in the labor force at all, meaning they are neither working nor looking for work. This is an all-time high dating back to when records were first kept in 1955. An additional 2.9 million men are in the labor force but not employed (i.e., they would work if they could find a job). A total of 10.2 million individuals in this cohort, therefore, are not holding jobs in the U.S. economy today. There are also nearly 3 million more men in this age group not working today than there were before the recession began.” \\nNever before has such a high percentage of men in their prime years been so idle. \\nBut since they are not counted as part of “the labor force”, the government bureaucrats can keep the “unemployment rate” looking nice and pretty. \\nOf course if we were actually using honest numbers, the unemployment rate would be in the double digits , our economy would be considered to have been in a recession since about 2005 , and everyone would be crying out for an end to “the depression”. \\nAnd now we are rapidly approaching another downturn. In my recent articles entitled “ Has The Next Recession Already Begun For America’s Middle Class? ” and “ 27 Huge Red Flags For The U.S. Economy “, I detailed much of the evidence for why this is true. \\nAnd those that run the Federal Reserve know all of this. \\nThat is one of the reasons for all of the “quantitative easing” that they have been doing. The folks at the Fed know that the U.S. economy would probably drift into a deflationary depression if they just sat back and did nothing. So they flooded the system with money in a desperate attempt to revive economic activity. But instead, most of the new money just ended up in the pockets of the very wealthy and further increased the divide between those at the top and those at the bottom in this country. \\nAnd now Fed officials are slowly scaling back quantitative easing because they apparently believe that the economy is getting “back to normal”. \\nWe shall see. \\nMany are not quite so optimistic. \\nFor example, the chief market analyst at the Lindsey Group, Peter Boockvar, believes that the S&P 500 could plummet 15 to 20 percent when quantitative easing finally ends. \\nOthers believe that it will be much worse than that. \\nSince 2008, the size of the Fed balance sheet has grown from less than a trillion dollars to more than four trillion dollars . This unprecedented intervention was able to successfully delay the coming deflationary depression, but it has also made our long-term problems far worse. \\nSo when the inevitable crash does arrive, it will be much, much worse than it could have been. \\nSadly, most Americans do not understand these things. Most Americans simply trust that our “leaders” know what they are doing. And so in the end, most Americans will be completely blindsided by what is coming. \\nhey gary, break out the kyj Rodster \\nWell the Fed essentially paid Banks not to loan out money. Banks NOW have a higher requirement to lend out money so that is part of the problem which doesn’t circulate to the consumer. \\nBut don’t worry Federal Reserve because all those cashed out Treasuries from Russia and China are coming back to the US. Yikes, what a mess. JailBanksters \\nThe US has been Pumped, now it’s time to be Dumped. Ouch Baby, very Ouch Guest \\n“Since 2008, the size of the Fed balance sheet has grown from less than a trillion dollars to more than four trillion dollars.” \\nWe hear the MSM talk about the Federal Reserve’s “Exit Plan” or its plans to “unwind” its balance sheet. That is utter nonsense. Who or what is going to buy all the Treasury bonds the Fed has monetized over the past 6 years, let alone the nearly worthless mortgage-back securities the Fed has bought? Maybe they’ll just print more dollars, give them to some foreign nation and have that foreign nation take those Treasuries off the Fed’s balance sheet? At this point nothing would surprise me. Bob Porter \\nLike Belgium? quercus454 \\nSimply put you can’t have any kind of a healthy stable economy with massive unemployment. People need to work and be able to support themselves. If that happens everything else sorts itself out. FDominicus \\nWon’t happen. It’s way to fine for the bureaucrats to hinder someone going for work. Because it’s their job that would be in danger tacoma \\nCan a country of 330 million people, whose economy is 70% service-based, and 80% consumer-consumption based, create or sustain a first-world standard of living? \\nNo. Hell NO! \\nIt’s a wonder it’s even happening to begin with. Demonocracy \\nMy question would be, where the heck are all of these so-called service jobs? How did offshoring jobs create them? I don’t recall when NAFTA and other free trade treaties where being negotiated that it was mentioned at all by these planners, “Well since we’re taking this many jobs out of America, we have this plan ? to replace them with service jobs, so that way there is not a resultant shortage.” \\nDoes anyone recall such a plan implemented? T C \\nRoss Perot gave warnings and even had flip charts showing exactly what would happen. Of course, everyone laughed and thought he was crazy. Semiore Butts \\nHave you noticed our rotting,pot hole infested roadways in the US? The interstate was once a national treasure. Houtex77 \\nI remember when I-10 opened in my old neck of the woods, Lake Charles, Louisiana. It was impressive. I have to give the highway department credit because much of it has been widened between Houston and L.C. recently. Bridges have even been repaired. John \\nInfrastructure and other domestic needs have been neglected, while trillions have been spent on wars and defending an empire that has become increasingly expensive to defend. The USA needs to re-focus on what it made it a world power in the first place. Priszilla \\nThere’s more profit in selling ammo and bombs to the taxpayer. \\nJust tell them there is a bogeyman, toothfairy, communist around the corner, and they will sell their last shirt to fill the pockets of the Industrial Military Complex.. Gay Veteran \\nindeed, too bad we spent $TRILLIONS in Iraq Hammerstrike \\nAt least it will make the governement control over a whole continent much more difficult. \\nWhen all the roads, railways and bridges to Washington are shia, going to be hard for Homeland Security and the IRS to properly loot the populations. \\nOh yeah, Homeland Security SWAT teams have hugh, heavy armored vehicules that are able to withstand mines but are not at all that great at crossing a river or dealing with thousands and thousands of pot holes. Mondobeyondo \\nThis…. this is Scary. Hammerstrike \\nThis loss of velocity is happening in spite of all the billions being printed every single day by the federal reserve to its network of cronies. Mondobeyondo \\nWell… \\nNo. The overall answer, is no. Sure, prices for goods and services and stuff will be cheaper. What about the overall cost? Don’t forget, deflation affects all aspects of the economy. Which means that the price of pork bellies on the Chicago Mercantile Exchange (oh, my poor aching pork belly) will affect the price of bacon at your supermarket. steve \\nYes I do have it. $15k in small bills on my property plus 6 mo. of food. Got to plan for deflation and inflation. Rick Green \\nAfter the SHTF don’t come to me with FRNs looking to buy anything. Plus, most modern change will be accepted at intrinsic value. You’d be better of with $15k in nickels. death \\nThe thorn in the rose that is QE…Diminishing Returns. The Fed has set us up Weimar Republic style, preparing to either raise interest rates or go negative with them (in-your-face confiscation of your bank account). Why do you think they’re holding all these meetings? They have to accelerate plans on all fronts; people are waking up too quickly. Prepare for all that Michael warns of…only worse, sooner, and faster than we can imagine. Hammerstrike \\nThe Weimar republic at least had people who were able to fix the financial system, even if only temporary, like Gustav Stressman. \\nNo Gustav or Hjalmar Schacht, only Janet Yellen. Mondobeyondo \\nIn an irrational society, the statistics mentioned in the above article would be best described as “rational”. \\nYikes! \\nBest thing to do…. ummm…some V-8 juice? Dawes \\nI sometimes wonder how much economic activity goes on “under the table.” If workers are doing cash only jobs without tax withholding or reporting, then does that sort of thing get measured by these M1 and M2 reports? Whenever an economy is over-regulated then the activity tends to go underground. I think that we’ll see this happen more and more in the US as time goes by. It might actually be a good thing, except for the fact that it’s illegal… K2 \\nGood point about the under the table economy. \\nBut even in lightly regulated countries, it happens a lot. For eg: Developing countries. K2 \\nInfact it is even bigger in those countries. JulietteofOhio \\nMy husband and I are expecting the economy to collapse, in the true meaning of the word “collapse”, and I just wish it would hurry up and get it over with. We’re getting older by the second and I’d rather deal with this while we still have jobs, some energy, fairly good health and aren’t so old that the government will try to kill us to get us out of the way. I don’t know how long social security or pensions will be available, so we can’t count on them. Yes, I do think the government will take everything left in bank accounts so I want to have the house paid for (then see what taxes do to us) and supplies stored. Old age is going to be a bitch, but so is every age. What a crying shame the U.S. has come to this end! K2 \\nYou’d deal with this, but waht about otehr people? JulietteofOhio \\nWell, first I’d learn to type. Nobody is going to take care of you which is the point. If you’re not married, find a good group of friends and lean on each other. We’re entering a hostile world and we have no guarantees. Neither will you. Do the best you can to prepare for collapse, work with other people and plan to make it through. Collapse doesn’t last forever, either, and if you come out on the other side alive and healthy, you’re going to be better off than most. It will be a different world, so you need to learn how to do some useful things. Think 1870s-80s pioneers and learn how to do what they did. That’s what I do and that’s how we prepare. You sound young and if you’re spending your days texting, listening to music and just hanging out with friends, your chances are very low. Take these friends out camping, without any technology, and see what you need to learn and what you need to get. Go from there. Good luck. Mondobeyondo \\nLearning to type is almost essential in today’s society. And I’m not saying that because I was a former typesetter (ahem). \\nWe are entering a brave, um, strange new world. A world addicted to technology of every kind. Nearly all of it runs on electricity. The only thing a terrorist has to do is attack and disable the electrical grid, and this country will be brought to its knees. I’m not saying something they don’t already know. JulietteofOhio \\nI agree. I read (somewhere) that if the U.S. suffered an EMP, that up to 90 million people would die which I found incredible at first. ??? How? Food poisoning? Heat stroke? Hypothermia? Teens offing themselves because they couldn’t text, or what? I’m sure that sitting under a shade tree in summer and reading a book could become tedious, but I doubt it would kill us. There are definite benefits to being born in the late 1940s. TheRequimen \\nDepends on the scale of the EMP. It really won’t matter if truck’s and trains make it. Anyway, no electricity means no refrigeration, no communication ( ham radios and satellite phones might work, but they won’t do anyone but the military and government much good) and no running water. 90 million dead is really conservative. Try 1 in 10 surviving a year, unless your in the farm belt. Our whole economy runs on last minute deliveries, so expect mass starvation, anarchy, and epidemics within the first month. How much food is in your pantry? How much is in your refrigerator? How long would Walmart shelves last your city? Think about how much would rot. How far is your nearest source of fresh water? Do you have the firewood to boil it? How much wood would it take for a city? Lots of interesting questions, and it only takes 5 nukes, and the missiles to carry them to wipe out us and all of our major allies… North Korea, Iran, and Pakistan don’t seem so insignificant anymore…. JulietteofOhio \\nHave to admit I hadn’t factored in the nuke plants. Ohio’s plant in the northwest part of the state already glows in the dark. We live in the farm belt, have our own hand-pumped well and raise most of our own food. On purpose, but also because that’s the way we were raised. SE Okla-homa didn’t have electricity until I was ten and my spouse was fourteen and our families weren’t poor. It’s just the way it was. It wasn’t fun, it wasn’t pretty and it didn’t always smell good, but you can live through it, ASSUMING you aren’t besieged by morons or gangs or grifters or filth/disease, our dreadful government or nuclear waste. That’s why we prepare so steadily. bob cratchette \\nFORGOT to mention nuclear plants melting down Priszilla \\nFertilizers are made in plants, controlled by electronics. \\nHospitals rely on electronics. \\nAll cars and trucks and harvesters now run on electronics. K2 \\nYou are a mean old arent you? K2 \\nOr a sarcastic old . Whichever makes sense. English isnt my first langauge. K2 \\nYou wish for a collapse and when somebody asks what about other people? you say that they should lean on friends and plan and prepare? \\nThats your response. What are you smoking? Or drinking? \\nThis is not a movie. This is the real world with seven billion people in it. A ‘collapse’ will be catastrophic for a lot of people in reality. Livelihoods will be lost, lives will be lost, people will be scarred for life. Families and generations of people will be affected. No amount of planning and preparing will be enough for a lot of people. \\nSo wishing for a collapse, just because you want to get it over with it, is absurd. You are old, but not wise. \\nAnd..that was a typo. I hope you know what that means. Hammerstrike \\nYou are the one being absurd and get it butt-backward (unless you want as few survivors as possible). \\nWhat you forget is that every day the collapse is delayed is going to make that collapse worst when it does happen. \\nMost people are not winning time for preparations, they are becoming more vulnerable and less able to prepare due to the growing lack of jobs and inflation. Prepping is going to become more and more difficult. Circa 10 000 reach age 65 in the US alone every single, so there is sort of a major health factor too. The *** are they going to do, dweeb? \\nSooner it gets over, the more people can hope to survive, especially as far as the +50 are concerned. K2 \\nCollapse is delayed because if a collapse happens it is not reversible (remember we are not talking about recessions like the 2008 one. Collapse means the 1930s great depression kind of event). And it will be even worse this time because the global economy has to support 7 billion as opposed to 1or 2 billion at that time. So if it happens there is no coming out of it, for the majority. Extra jobs wont magically appear after the collapse. But most of the existing jobs will disappear for ever. \\ndweeb! Hammerstrike \\nOh it is reversible, once the root causes, which you are unaware of, of it has been removed. \\nThat part may look difficult now but certainly won´t be impossible after the collapse. When New York, Chicago and Los Angeles are like Detroit today, a police state will become unaffordable. \\nIt ain´t the collapse of the world, it is the collapse of what was once the west. \\nNo more FR dollar as an international trade currency. World economy won´t have to support the current living standards of the US and the european union anymore. K2 \\nWhy dont you enlighten me what the root causes are then? Hammerstrike \\nHave you ever asked yourself who benefits from inflation? \\nyoutube. co m /watch?v=tGk5ioEXlIM K2 \\nInflation is not the only thing that is causing the collapse. Hammerstrike \\nThe Collapse have already started. \\nOnly way to stop another 2008 before 2016 is raising quantitative easing even further, which would increase an inflation rate in the 8-10% range. \\nPrices of everything increase, pensions and social security does not keep up, fewer jobs available and % of jobs that are well-paying and full-time will StefanaRapsondeu \\nmy Aunty Allison recently got a nice 6 month old Jaguar by working from a macbook.this website C\\xada\\xads\\xadh\\xadd\\xadu\\xadt\\xadi\\xade\\xads\\xad.\\xadC\\xadO\\xadM\\xad DhannaReaderaci \\nPeyton . true that Jessica `s blurb is shocking, last monday I got a gorgeous Peugeot 205 GTi after having earned $6860 this past 4 weeks an would you believe ten-k this past-month . with-out a doubt this is the easiest-job I’ve ever had . I actually started six months/ago and pretty much immediately started to bring in minimum $84… p/h . Read More Here F\\xadi\\xads\\xadc\\xada\\xadl\\xadp\\xado\\xads\\xadt\\xad.\\xadC\\xadO\\xadM\\xad Kent Harris \\nDo not be surprise if the government knocks on your door and says we need collateral and we need to confiscate your home. That is next phase we will get if the economy goes south. JulietteofOhio \\nI’m afraid you’re right, and we worry about that more than anything else. Justin \\nWhat would the government do with all the confiscated homes? I cant’ think of a logical thing they could do with it. Tear it apart? Scrap the copper and raw materials? Mondobeyondo \\nThey won’t knock. They’ll just come in and take it. \\n“But isn’t that unconstitutional??” \\nHeh heh. Heh. Hahahaha!! Elaine Perkins \\nThere is a Plan for that already. It is in the “Agenda 21″ UN PLan. Below is two Quotes from that Plan. \\n“Current lifestyles and consumption patterns of the affluent middle class – involving high meat intake, use of fossil fuels, appliances, home and work air conditioning, and suburban housing are not sustainable.” Maurice Strong, Secretary General of the UN’s Earth Summit, 1992. – \\n“We must make this place an insecure and inhospitable place for Capitalists and their projects – we must reclaim the roads and plowed lands, halt dam construction, tear down existing dams, free shackled rivers and return to wilderness millions of tens of millions of acres or presently settled land.” Dave Foreman, Earth First. \\nHide Agenda 21’s UN roots from the people “Participating in a UN advocated planning process would very likely bring out many of the conspiracy- fixated groups and individuals in our society… This segment of our society who fear ‘one-world government’ and a UN invasion of the United States through which our individual freedom would be stripped away would actively work to defeat any elected official who joined ‘the conspiracy’ by undertaking LA21. So we call our process something else, such as comprehensive planning, growth management or smart growth.” J. Gary Lawrence, advisor to President Clinton’s Council on Sustainable Development. laura m. \\nAgree Ohio, we are ten years into retirement in Ala. and know if executive orders are declared anything can happen to incl money stolen by gov. from banks. Here is what someone wrote on Dave Hodge’s site. If you have money in CD’s when they expire, move them into a money mkt checking and withdraw it over time, paying off debt if you have any and buy needed preps. Stocks and bonds bring income, so keep up with these and maybe cash out at the high’s. One lady bought her child a car and helped with a down payment on grandchild’s house, etc. Trade cars more often, etc. America has been derailed over a cliff into the abyss and the hammer could drop at any time. I have studied globalism and ag. 21 (called land use in the 70’s ) for almost forty yrs. We chose not to have kids knowing our gov was hijacked since appr. 1913. An older couple gave me books and tapes- full of info. yrs ago. I learned all 20th century wars were for corp. profit, the Fed Res. hoax, central banks, 501c3 agendas etc. We have a small group in my area but feel they’re few patriots to stand up when we go under martial law. We got rid of useless stuff and passed on all our books dvd’s to younger folks. No one cares or wants to learn. Only a handful of 30 to 50 yr olds are tuned in. Time is running out. kbed \\nI’m 25 and tuned in, have been ever since I learned about money creation when I was 19. There are exceptions to your rule. I would say about 5% of people in my age bracket are awake to the coming collapse. Guest \\nI’m glad to hear that, kbed. laura m. \\nIf younger people know the basics they have computers to forward info out to friends, relatives. This is the best way to get out info. anyone can do further research online for free. The internet is spreading info, unlike before it was mail, giving out books, tapes and speakers mtgs. which produced very little results. You will get rejections from some who prefer to stay in denial, as any age group incl mine. If community leaders and church leaders took a stand en masse, decades ago, things would be different. Many are intimidated by the 501c3 IRS control freaks and only care about running churches as a business- social club. Business/community leaders are only interested in their image and making money and greed for gov. grants and higher taxes pushing ag. 21.. The Creator and Destroyer \\nLately I find almost every “shooting the breeze” conversation with friends and family can easily be directed to observable symptoms of the evolving collapse under way. I recommend finding opportunities to challenge their thoughts on a face-to-face is ALWAYS better than virtual. \\n(BUT make sure to never go into a patriarchal or “sky is falling” diatribe”, rather just use socratic method of questioning in order to reason) TAG \\nStudy Stefan Molynieux and the Non-Aggression Principle… Murray Rothbard’s good reading… Make your own reality I’ve got two your age and a Grandson. Life is for living while you make your way. kbed \\nOh I’m deep down the rabbit hole my friend. Stefan is a good listen. Freedom talk radio, x-22 report, drudge, trends journal….I like to keep my options open but the more I’ve learned the more pessimistic I have become. Sometimes I just need to tune it all out and find a good looking girl to distract me for a while 😉 That or take the rod down to the fishing hole. Thanks guys. xman \\nplease don’t associate the gifted Murray Rothbard with the hypocritical Molyneux Kristen Marie Embler \\nI’m almost 21 and I most certainly agree, kbed. Almost no one my age has a clue what’s going on other than knowing who got eliminated on “America’s Next Top Model.” kbed \\nI’m still a kid at heart. I don’t watch that kinda crap TV but I will occasionally go to the bar and drown my soul to watch my Red Sox lose. Most of my friends think I’m nuts but damn if I haven’t changed a few of their minds…and they most certainly have changed mine as well, to enjoy this paradigm while we have it because its not going to last forever. Killervirus \\nI’m 38 and many in my age group have no clue. It isn’t an age issue, it’s just most Americans walk around with their head stuck up where the sun don’t shine. Skully69er \\nIm 45 and no one my age group has a clue. Sometimes they ask me what I think of the economy and are in disbelief at the answers I provide…even after I explain the Austrian business cycle to them their eyes just glaze over. Austrian economics has become my passion ever since I first read Mises and am still amazed at how he, and other Austrians, have been so accurate about everything! Carlos Casten \\nYour post is hilarious…. Sheeple will get what they deserve, eventually. ArkJean \\nI’m 29 and also know we cant keep this false for much longer. jsmith \\nGood for you! I wish I had learned when I was in my thirties. Slowly but surely the public is first wondering why things are getting so bad for us peasants in the middle class, while the elite are getting richer. Just try to enlighten as many of your peers as possible. It’s a start! Mondobeyondo \\nUnfortunately, 95% of those people are in for a very rude awakening. Fannie \\nMy son is 37. His friends, along with him, have no kids. In this economy, the struggle to care for them properly is difficult. I was surprised to see that all of them have no children. I do believe that they know what is coming. Priszilla \\nUsually families with kids have families with kids as friends. \\nAnd singles have singles as friends. Hammerstrike \\nIt is simple, if there is ever to be a retirement system following the collapse and overthrow/collapse of the current system, it will only be for people who contribute to the post-collapse society with children… farmerfloyd \\nDont rely on anybody taking care of you. Get your OWN nest egg and save and buy gold or silver. I have 13 house rentals , all paid for because my day taught me to do your own lively hood and don’t plan on ANY retirement ! Plus gold and silver and it will come to that with no records . Hammerstrike \\nWhat are the retired folks who never had children going to do when the gubbermint seizes everything? \\nWhat will be the policies of a sustainable post-collapse society? Those who have children gets priority over those that does not, simple common sense. TAG \\nStay strong! We feel the same way here in Tennessee but I’m going to be a personal example of mean old man! ~Peace~ JulietteofOhio \\nGood for you! My post, four above this one, was meant as a response to your post, and I don’t know what happened that it appeared above. Any ideas you may have are welcome and most appreciated! squashpants \\nJuliette, you sound a lot like us (my wife and me). I retired a couple of years ago and we moved to a small college town in Minnesota. We now own our residence outright (no mortgage), our car, and have no debts. We have been prepping for over a year, storing food, household items, and toiletries. I have a short list of items yet to get to be ready (including a shotgun). Our income is a combination of pensions and social security, and we can live quite comfortably on that, and actually save money. However, we are planning for the loss of those things, and are working to become as self-sufficient as possible (accumulating and filtering our own water, growing vegetables in the garden, etc.), so that money is a low necessity. And specific to that need, we are buying physical gold and silver. The only thing that really concerns me regarding readying for a collapse is sanitary — when the electricity goes off globally, running water, and sewer service will fail. Think about your bathroom habits in such a situation. BIG challenge, folks, and something that pioneering preppers need to put their brains to and share with the rest of us non-engineering types. \\nBottom line: use the dwindling time, and prepare as hard and fast as you can. The rest of problems can be solved after the fall. JulietteofOhio \\nThanks for your input. It’s nice to know we’re not alone. I’ve been studying everything I can find on elementary sanitation. We have ten acres, three of which are wooded, and there was an old out house about 200 feet away from our house and 400 feet away from the well. My husband and our youngest son are digging it out this summer and we’re putting up a new privacy building. Of course in winter or in case of looters, or the EPA, it won’t be safe and never pleasant to make that trip. I’ve been making our laundry soap out of borax, Fels Naptha bar soap, washing soda and well water. It does a good job on everything but a human. We have a five gallon cast iron pot and a winch to move it over a small fire so I’ll have hot water. We have a well to make this feasible and I bought a washing plunger from Lehman’s in Kidron, Ohio. I’ve practiced, and while my Maytag is superior, this does a passable job. The sun drying the clothes should make the laundry sweet and clean. Thus my desire that if it’s going to collapse (and I think it’s going to…) get it over while I can still do all of this high-energy work. I can do it at 62, but probably not at 82. Same with gardening, canning, animal husbandry, etc. For personal cleanliness, I bought fifty bars of hand-milled French soap (not as expensive as it sounds) and dried them in the sun. The bars shrink and become hard as a rock which makes them last a lot longer. We have about five years worth of toliet paper in the attic and twenty cases of “Baby Wipes”. I have no idea how long those will last, so let’s get it on! Martin R. \\nAs long as the U.S. Dollar retains its world reserve currency status, and executive order 11615 remains unchanged (hint: “Nixon Shock”), they can literally print as many U.S. dollars as they want / need, including enough to cover all bank deposits. It’s irrelevant how many dollars people have in the bank, under their mattress, etc. since there is metaphorically nothing backing it. SonyAD \\nIt’s not the government robbing you blind, simpleton. \\nIt’s who you’ve handed it over to. The capitalists. DJohn1 \\nThe trouble is the very foundations of our economic system are being trashed in front of our eyes. The money system has been systematically disabled over a long period of time. Mr. Clinton signed international trade agreements that betrayed the American Worker. Mr. Bush has destroyed the labor board by stuffing it with rich people over about ten years. There is no justice at the labor board. Why does anyone think that senior discrimination and layoffs will be punished by anyone in government? How it used to be . . . a savings account increased by getting interest on the money. No more. We have seen a vast migration of our jobs being sent to countries that do not pay income taxes here. So who pays the freight to run government? Inflation or counterfeit money pays the bills. It is only a matter of time before this change in systems will destroy the entire money system and I think the people in government are well aware of this. So arm all the lazy people against the workers. That is what arming bureaucrats is. They live well in these bureaucracies. There will come a time when that is all gone. Right now we are seeing the dismantling of the American FInancial Empire. It is only a matter of time. Nothing you or I can do will change any of this. But be warned. When America is not there then you will have to fight your own battles. When America is not there, the dictators will swoop down and get the rest of you. When Europe stands alone, they will die alone because the nations of Asia will have succeeded in bringing the entire circus down. Then in steps the Chinese and Russians to divide the spoils. Then we are looking at another kind of world where there is no hope of advancing yourself. Where politics dictate how you are treated for sickness. Where euphanising people is the norm, not the exception. Just don’t get sick. The alternative is to change things back to what actually worked. No entangling foreign affairs. Tariffs protecting our jobs from those people overseas. Encouraging christian values and marriage instead of illegitimate children in one parent homes. Clean up the mess that our court rooms have become and change the way we do things. About 99% of the congress are lawyers. What does that tell you about our leadership? It is impossible to get disability or workman’s comp in this country without a lawyer. They want a third of the first check which is usually a back payment. I think the first thing that needs to change is the thievery in our courts favoring lawyers over ordinary citizens. The second thing that needs to change is to put all the laws in plain English. I think the people in charge have a lot to answer for. But that too will come with time and change. Jack Harper \\nThe single reason Americans have enjoyed the lifestyle over the past 40 years is they have been raking the pot at the poker table. Americans are the dealer at the table and get a cut of every purchase made and settled with U.S. funds. This is rapidly ending. Many non-NATO members are switching to a basket of currency’s in settling trade deals including oil purchases. XSANDIEGOCA \\nThe wily Putin is swapping his gas for Yuan, which will be backed by gold within ten years. Mondobeyondo \\nChina and Russia are already discussing using their currencies in place of the U.S. dollar for international transactions. Many other countries are contemplating the same. \\nThey’re not stupid. They see our fiscal situation. What do you expect them to do? Folks, this is serious, and we are in serious trouble. \\n“We love America! We will throw another $20 billion down the rat hole because we love your country”?? Nuh-un. Doesn’t work that way. FirstGarden \\n“Dear God, make me a bird. So I could fly far. Far far away from here.” Mike \\nI think there will be a collapse; I thought it would have already happened by now. We need to get it done so we can start all over again. peace angel \\nMicheal check this out. \\nAt Before It’s News “THE Theft of Your Retirement Accounts Will Accompany the Seizure of Bank Accounts” \\nTHIS is very telling. Andy Sloan \\nIt is deflationary; but when the US$ collapses that is inflationary; when the debt default contagion takes hold, the money supply will shrink and with the productive capacity of the US economy greatly reduced and substantively held in the hands of giant corporations, you have a recipe for an inflationary depression. Andy Sloan \\n“I see in the near future a crisis approaching that unnerves me and causes me to tremble for the safety of my country. Corporations have been enthroned, an era of corruption will follow, and the money power of the country will endeavor to prolong its reign by working upon the prejudices of the people, until the wealth is aggregated in a few hands, and the republic destroyed.” Abraham Lincoln, 16th President of the United States XSANDIEGOCA Andy Sloan \\nJohn 10:10 \\nThe thief cometh not, but for to steal, and to kill, and to destroy. I am come that they may have life, and may have it more abundantly. XSANDIEGOCA \\nSpot on, Andy. Elaine Perkins \\nThis is the Last Days. All Prophecy is merging together getting the world ready for Jesus Christ to return. America is gone. The only “Hope” we have is in Jesus. Those who are denying Him are in for a sad time; seven years of pure Hell on Earth and then…ETERNITY and TOTAL Separation from GOD forever and forever. What’s FINAL is FINAL. Andy Sloan \\n“The purpose of this financial crisis is to take down the U.S. dollar as the stable datum of planetary finance and, in the midst of the resulting confusion, put in its place a Global Monetary Authority [GMA – run directly by international bankers freed of any government control] -a planetary financial control organization”- Bruce Wiseman XSANDIEGOCA \\nHard, bitter times ahead. Andy Sloan \\nThe sorry truth is everyone, that the coming collapse is the terminal phase of a long-term plan to destroy the US economy, so it may be merged into the New World Order XSANDIEGOCA \\nThe posts here clearly show that people here understand what is going on. I would only add this. QE is the greatest bank robbery of all time. The wealthy are reaping huge but the lower orders are going to be stuck with the inflationary bill. If gas costs 15$/gallon the well to do would be very happy to see less traffic congestion. The rest of us will sleep in our cars at work. You already see it in the grocery store as one witnesses the incredibly shrinking containers of favorite foods. An oz here and oz there… The Obama Administration has declared war on coal! The price of electricity will soar. Someone told me that 70% of all electric power is devoted to moving one item, water. Our traditional way of life will rapidly become even more unaffordable than it is now. Can you hear the Bell Tolling? Johnny Palestine \\nSir, your website is always worth reading and memorizing. \\nThe ” federal reserve”; not federal nor a reserve of anything but ink, toilet paper, fleet of printing press and steel plates. the FR is printing rough toilet paper with numbers and masonic images. brimp \\nI’m out of debt, no mortgage, have some gold and silver, have a gun with ammo, have 2 months of food that I cycle through, but still have significant funds in US banks. I’m not sure where to put those funds. Are the bank “safe”? Is the dollar safe? Putting all of it into metal seems risky. Speculating in real estate seems risky. The stock market looks risky. Any suggestions? John Doe \\n40% gold 40% silver 10% cash 10% bitcoin Guest \\nThe way I see it is that gold and silver are money, have intrinsic value and will always be worth something . Don’t look at precious metals as an investment. I know, I know, most people who buy gold and silver want them to go up in fiat terms. I certainly do. But I have tried to stop looking at them that way and instead consider them a hedge against inflation and insurance in the event of a collapse of the dollar. Will the dollar eventually become worthless? I don’t know. It’s certainly possible. I don’t know of any fiat currency in history that didn’t eventually fail. But, as you know, the advantage that the dollar has over other fiat currencies is that the dollar is the world reserve currency. The foreign demand for the dollar is what is keeping this game going. But foreign nations are moving away from using the dollar for trade purposes. How long will it be before that starts to affect the value of the dollar? Again, I don’t know. For me, the hardest part about all of this is the uncertainty. MstrJames \\nmaybe not a complete solution. But I might suggest stocks in wholesale foods companies. Their system is fairly genius. No matter what food cost, they just add some profit and deliver it to convenience stores etc. For instance SYSCO foods once had profits for over 30 quarters straight. Literally profited through two or more recessions. During deflation they still profit. Inflation they just profit a bit more. No matter what the economy does everyone will still eat. They just buy whatever food beer cigarettes that is available and distribute it. For a hefty profit. Also Obama, Pelosi and every repub and dem. are buying natural gas royalties. America will always need some energy and the liberal dems are pretty much outlawing energy sources that compete with their Nat. gas. With royalties you don’t have to own the land and are not responsible for any expenses. You just get a percent of actual sales for owning the rights. Its how Obama makes 72,000k per month without any headaches or expense. Its why Pelosi is hell bent on taking out coal and limiting other energy sources. This no expense. profit system has been around for about 100 years. NoFoolHere \\nExcellent article of what has been happening for the past 14 years. Meanwhile your fiat doolar buys less and your taxes and regulations are higher and your standard of living is shrinking all under survellance with the police state. All working perfectly according to plan. Keep it up NWO guys the sheepeople are toatlly hoodwinked. Bigger bonuses are ontheir way. Congrats!!! docbooks1 \\nhas never been a “free lunch” since the dawn of man thousands of years ago until the United States came along and created the most wealth ever know to man through FREE ENTERPRISE conducted by FREE MEN. Then came along the bleeding hearts and so began the “War on Poverty”. That war not only has been lost, the GOVERNMENT'"}, "time": 1742564018.8741062}