{"duration": 0.08489584922790527, "input_args": {"text": "'The Philippines has threatened to protest the launch of a building project on the Scarborough Shoal, a land formation within the Philippines’ sovereign territory that also falls within China’s “  line,” a territorial claim struck down by an international tribunal. [In a bizarre twist, however, the Chinese government denied any projects planned for the Scarborough Shoal and distanced itself from the   Hainan Daily newspaper report claiming otherwise.  That regional newspaper reported that Sansha City mayor Xiao Jie had announced new development projects in the Scarborough Shoal, including a new monitoring station. The Philippine Star notes that “Sansha” is a name typically used for a number of islands and shoals within Philippine and Vietnamese sovereign territory, including the Spratly Islands and the Scarborough Shoal. The newspaper adds that China has controlled the Scarborough Shoal since 2012 and not handed it over after the Permanent Court of Arbitration at the Hague issued a ruling in the Philippines’ favor on the territorial dispute. While the Star identifies the Hainan Daily as a state newspaper, the Chinese government has denied the report. “We have checked with relevant authorities that the recent reports about building an environmental monitoring station on Huangyan Dao are false. There is no such a thing,” Chinese Foreign Ministry spokeswoman Hua Chunying told reporters on Wednesday. “China places great importance on its relationship with the Philippines and cherishes the sound momentum   relations are enjoying now. ” The loudest protests to the Hainan Daily report came from Philippine legal authorities. Justice Minister Vitaliano Aguirre said Tuesday that the government was planning to lodge a formal protest against China for any construction in the region, a case that Aguirre predicted would be “fairly strong. ” Aguirre added that his country was “strengthening the relationship with the United States” in response to China’s reported move. Supreme Court Associate Justice Antonio Carpio also weighed in, stating that, if the report is true, “the least the President should do” was file an official complaint. Carpio has previously threatened to impeach Duterte if he did not adequately defend the territorial integrity of the Philippines against China’s expansionist moves in the region. Presidential spokesman Ernesto Abella took a more conciliatory tone, merely stating that President Rodrigo Duterte “has repeatedly asserted that the Philippines is not giving up its claims and our entitlements over the area. ” Acting Foreign Affairs Secretary Enrique Manalo told reporters that the Philippines was waiting for an official government statement before deciding how to respond. “We’ll be awaiting a reply from China before we consider what to do next  …     All we can really do is wait for China’s clarification,” he said. Manalo added that the Philippines was “maintaining a regular and close watch” over the area. President Duterte himself issued a statement on Thursday local time (Wednesday in the United States) acknowledging Hua’s denial. “I was informed that they are not going to do anything at Panatag [Scarborough Shoal] out of respect for our friendship,” he told reporters. “‘We will build nothing there’  —   that was the assurance given by the Chinese government. ” China, he added “has a word of honour. ” Duterte’s conciliatory attitude towards the report comes after a weekend in which the Philippine president announced his desire to work with the Trump administration in America, promising to “give all, whatever it is” to the United States except for a military alliance against China. A recent poll of Philippine nationals found that Duterte’s hesitance to confront China on the nation’s territorial integrity was wildly unpopular, as 84 percent of respondents said they wanted the government to “uphold its rights in the disputed waters” in the South China Sea.'"}, "time": 1742563165.371489}