{"duration": 0.05823254585266113, "input_args": {"text": "'By Gordon Duff, Senior Editor on November 2, 2016 Understanding Lebanon and the political realignment there critical to US understanding of the region...and to our future with Israel \\nLebanon has a new president. The political development puts an end to over two years of power vacuum in the country. On Monday, lawmakers voted to pick General Michel Aoun as Lebanon’s 13th president. The election is seen as a victory for the resistance movement Hezbollah, especially after Saad Hariri, the leader of the March 14 Alliance and a close ally of Saudi Arabia, voiced his support for Aoun. On this edition of ‘The Debate,’ Press TV has asked two analysts why they believe Hariri threw his weight behind Aoun. \\nNabil Mikhail, a professor at The George Washington University, praised Hariri’s measure, adding that with this decision, he actually wanted to bring stability back to Lebanon and thus avoid Syria’s spillover effects. \\nHariri is a shrewd politician who represents an important segment of the Lebanese society, Mikhail said, adding that by his vote for General Aoun, he aimed to take the country out of the current political deadlock and, ultimately, save it from the repercussions of the Syrian war. \\nMikhail believes that the United States’ shrinking power in the Middle East has forced Hariri to face away from Washington. \\n“I believe that Saad Hariri could have been motivated, along with others, about a vision that America’s role in the Middle East is receding. So, perhaps Russia is the new reality in the Middle East, is a new power. So, anything that is somehow close to Russia will be better for Lebanon,” Mikhail argued. \\nMikhail said that “so many things have transpired inside Lebanon and inside the Arab region within this year. I would assume that the Syrian civil war and its severity and brutality has convinced him that he can maintain good ties with the [Persian] Gulf states but at the same time study the strategic realities.” \\n“He (Hariri) sees that Syria has to be stable in order for Lebanon to be stable. So, he is making calculations. I hope none of them is a miscalculation because the area cannot afford any other catastrophe. So, he displayed again very well maintaining some sort of balance between his Syrian interests and [Persian] Gulf interests and perhaps he can formulate some equilibrium about this.” The image grab shows Gordon Duff (L), a senior editor of Veterans Today based in Ohio, and Nabil Mikhail, a professor at The George Washington University, at Press TV’s ‘The Debate’ show on Monday night. \\nMeanwhile, the other guest on the show, Gordon Duff, the editor of Veterans Today , noted that, in his view, the reason behind Hezbollah’s victory in Michel Aoun’s election is the movement’s victories in Syria, especially in Aleppo, which has made it more powerful than ever and has paved the way for domestic victories. \\n“If Aleppo falls, and Aleppo will fall, it’s only a matter of how long, a victorious and highly-disciplined, highly-trained Hezbollah force, [which is] heavily trained by Russia and by Iran, is going to return to Lebanon. It’s a very different force and I believe Hariri is looking at this. Reaching out for what should be a very different Hezbollah could lead to stabilization of the political process in Lebanon that has been out of control,” Duff reiterated. Related Posts:'"}, "time": 1742561627.8767347}