{"duration": 0.10316824913024902, "input_args": {"text": "'  Government Corruption / How A Disgraced Congressman Sexting a Child Led to the FBI Reopening Investigation into Clinton How A Disgraced Congressman Sexting a Child Led to the FBI Reopening Investigation into Clinton Jack Burns October 29, 2016 2 Comments \\nIn case you’ve been locked in a port-a-potty for the last 24 hours, the once closed criminal investigation against Hillary Clinton’s handling of classified information, on an unauthorized non-government private server, has been reopened. And now that the nation is within 10 days of electing or rejecting her as the next president of the United States, the announcement has proven to be a true October surprise. \\nPerhaps millions of Americans were holding their breath as FBI Director James Comey, on July 5th, 2016 , made the following statement to the American people. “From the group of 30,000 e-mails returned to the State Department, 110 e-mails in 52 e-mail chains have been determined … to contain classified information at the time they were sent or received. Eight of those chains contained information that was Top Secret at the time they were sent; 36 chains contained Secret information at the time; and eight contained Confidential information, which is the lowest level of classification. Separate from those, about 2,000 additional e-mails were “up-classified” to make them Confidential; the information in those had not been classified at the time the e-mails were sent.” \\nThe admission that former Secretary of State Clinton had, indeed, sent and received classified information on her now infamous server was contrary to her repeated claims she’d done no such thing. Nonetheless, Comey chose not to recommend an indictment be issued for her arrest, leaving many scratching their heads in disbelief. \\nEven Comey’s former boss, former mayor of NYC Riudi Giuliani said Comey got it wrong. And Trey Gowdy (R-SC), chair of the Select Committee on Benghazi, hauled Comey’s behind back in front of Congress to explain why Comey insisted because Clinton didn’t intend to commit a crime, she shouldn’t be prosecuted. Over and over again, Comey has had to explain his decision not to indict the then Democratic nominee for president. And Rep. Darrell Issa (R-CA) stated in September Comey had created a double standard by doling out immunity deals to several of Clinton’s staffers, amid ongoing investigations in the Clinton email scandal. \\nNow enter the disgraced former House member Anthony Weiner, and Comey’s letter to several members of Congress. The director of the FBI informed various committee members, in no uncertain terms, that he is reopening the Clinton email case as he was made aware of the “existence of emails that appear to be pertinent to the investigation.” \\nAccording to Comey’s letter, the new emails were discovered while the FBI was investigating an, “unrelated case.” So what does Weiner have to do with anything? \\nAs Fox News reported, “An FBI source … confirmed to Fox News that the new emails were discovered after the bureau seized devices belonging to disgraced ex-Rep. Weiner and his wife Huma Abedin, a top Clinton aide who recently announced she was separating from the former congressman.” That “unrelated case,” as Comey described it to congressional members, supposedly involves Weiner sexting photos of his wanker to a 15-year-old female from North Carolina, as reported by The Atlantic. \\nBut that’s all we know at this point, which leads to speculation. It’s no secret that Abedin and Weiner are in Splitsville , with Abedin filing for divorce over Weiner’s insatiable sexting habits. But what’s more important to consider is that Weiner now has motivation to tell all that he knows. Let’s face it, his derriere is facing some serious punishment in jail, and he may be willing to cut a deal with federal prosecutors to minimize any potential sentencing. \\nThere’s no question Weiner had access, over the years, to the kind of pillow talk which could implicate Clinton. Let’s face it! He was sleeping with Clinton’s closest confidante . And what this email scandal case has needed and hasn’t gotten until this point, is someone willing to talk, AKA a “rat”. If Weiner turns out to be the rat investigators are looking for, he may be willing to tell all he knows. And who knows where that will lead? Since Abedin has been working for Clinton since 1996, if anyone has any new incriminating evidence on Clinton, it’s almost certain to be Abedin. And now Abedin’s estranged husband (Weiner) may be spilling the beans, and getting a bit of sweet revenge in the process. Share Google + Phil Freeman \\nAn investigation is NOT an indictment, which is a grand jury function not an information function of the executive branch. A true bill is required here folks!!! It’s Bravo Sierra politics. GaryL \\n“Comey has had to explain his decision not to indict the then Democratic nominee for president.”– Neither Comey nor FBI “indicts.” That decision is made by DOJ Criminal Division. \\n“Comey had created a double standard by doling out immunity deals to several of Clinton’s staffers.” Comey nor FBI grants “immunity deals.” Those are “doled out” by DOJ Criminal Division. \\n“[H]e may be willing to cut a deal with federal prosecutors to minimize any potential sentencing.” Or, he may receive an “immunity deal,” or he may have an “accident.” \\nObviously, we’ll see what the DOJ Criminal Division decides to do, but if the above is any indication, the answer is probably already clear. Social'"}, "time": 1742562716.928389}