{"duration": 0.08107805252075195, "input_args": {"text": "'Jimmy John\\'s owner spent $350k to \\'trophy hunt\\' extremely endangered female Black Rhino \\nTuesday, November 01, 2016 by: Ethan A. Huff, staff writer Tags: Jimmy Johns , endangered species , trophy hunting (NaturalNews) The owner of the American fast food chain Jimmy John\\'s is under fire after photos emerged of him smiling and giving a \"thumbs up\" beside numerous endangered species that he\\'s hunted and killed throughout Africa over the years, for seemingly no other purpose than simply to invoke death for pleasure.Reports indicate that Jimmy John Liautaud has been spending hundreds of thousands of dollars per hunting trip to gain access to these precious species, including one particular \"trophy\" hunt in which he spent a whopping $350,000 just to kill an extremely endangered female Black Rhino. Graphic photos of Liautaud with this rhino and other animals are available here , but be warned: these images are horrifyingly upsetting.Liautaud\\'s trophy hunts are apparently a routine pastime of his, just as they are for the many other bored millionaires out there with too much time and money on their hands who seem to get a kick out of taking out the rarest animals on our planet – beautiful creatures like leopards, rhinos, lions, and even elephants, which have the largest brains of any land animals. It\\'s the type of thing that, if more people knew about it, they\\'d likely stop eating at Jimmy John\\'s altogether.Mr. Jimmy John\\'s poaching fetish has been making the media rounds, and many are now calling on a national boycott of the sandwich chain, which has already been exposed for underpaying its employees and treating them like slave workers. The Wall Street Journal (WSJ) reported that social media users had attempted to launch a boycott of Jimmy John\\'s using the \"#boycottjimmyjohns\" hashtag on Twitter, though the company didn\\'t seem all that phased.Still, the issue hasn\\'t gone away, and many in the public remain outraged over what they say is reckless and reprehensible behavior. Not only is Liautaud killing these rare and exotic animals in cold blood, but he\\'s doing so in such an utterly cruel way that even the most avid hunters would be hard-pressed not to cringe or perhaps shed a few tears.\"[U]sually the animals are lured from a national park on to private property,\" Lara Starr, investigative writer and co-founder of The Earth Child writes, noting that this is not the method Liautaud uses to kill his prey. \"Trophy hunters will leave out bait, play the sounds of other animals to lure them in, or a few other tactics to find their animal victims.\"\"Canned hunting is even worse,\" she adds. \"It is the \\'shooting fish in a barrel\\' version of trophy hunting . The animals are often hand raised so they are tame and don\\'t run away. They leave food out for them one day, then some coward creeps up and shoots them with a high powered bow or rifle. Sometimes they don\\'t even have to creep. Sometimes they just shoot them from the back of a truck, then go back to drinking their gin & tonic like it was just a bit of harmless fun.\" Trophy hunting costs do NOT help repopulate endangered animal species One of the excuses often used as justification for expensive trophy hunting escapades is that all that cash ends up getting donated to conservation programs that help repopulate the prairies, plains, and jungles with endangered species. But this isn\\'t actually true, as only about two percent of the proceeds from these hunts ends up being used for conservation purposes.Non-trophy hunting tourism, on the other hand, is responsible for the bulk of conservation donations -- up to 15 times than what trophy hunting contributes -- according to Heather Callaghan, editor of Natural Blaze . Likewise, the claim that animals killed on trophy hunts are used to provide food for locals is also bunk, as most of the carcasses end up getting left behind for scavengers. Sources:'"}, "time": 1742562335.7690556}