{"duration": 0.07951736450195312, "input_args": {"text": "'\\nAs of this writing, a very disturbing piece (of garbage) surfaced on the Internet. Many of you may have already seen it. Here’s an excerpt from it, because it is an “article” that is completely false, written by Andy Borowitz for The New Yorker and it appeared November 5th as The Borowitz Report .\\nTHIS EXCERPT IS FROM A FALSE ARTICLE, LABELED AS “COMEDY” \\n“The Russian President seemed to relish the warm response he got at his first Trump rally, in Tampa, Florida, where he led the crowd in a raucous chant of “Lock her up.” While some in the media criticized the Trump campaign for allowing Putin to influence the outcome of a U.S. election, the Republican nominee’s campaign manager, Kellyanne Conway, pushed back in an appearance on CNN. \\n“This is just another case of media bias against Donald Trump,” she said. “Jay Z and Beyoncé, who have no experience in government at all, are allowed to campaign for Hillary Clinton, but Vladimir Putin, who actually runs an entire country, can’t appear with Donald Trump? Come on.” \\nONCE AGAIN: THIS EXCERPT IS NOT TRUE AND IS NOT NEWS. \\nThis article (as further evidenced by its e-mail address) is listed as “humor,” and The Borowitz Report is supposed to be comedic. Andy Borowitz is a New York Times bestselling author who was the creator of “The Fresh Prince of Bel-Air,” and has written for the New Yorker since 1998. In 2001, apparently, he created the Borowitz Report that is listed in Wikipedia as being “a satirical news column that has millions of readers around the world.”\\nI personally do not find one thing funny about it, but there’s plenty that is “funny” about it in another meaning. \\nAndy Borowitz is a Harvard graduate who just happened to have worked for the Democratic National Convention in 2004. His work is picked up by the Mainstream Media Marxist Monopoly (MMMM, my own term) by such notable Pravda-like publications such as the LA Times, Seattle Times, Philadelphia Enquirer, and the Huffington Post. Borowitz also appears periodically as an NPR Commentator.\\nThe excerpted article is a deliberate attempt at disinformation, “covering” itself as “comedy.” There is absolutely nothing funny or entertaining about that article. As his column is described as having “millions of readers around the world,” Borowitz and his handlers and editors know exactly what they’re doing .\\nThis deliberate piece of disinformation, masquerading as “comedy/satire” and presented in a “news-style” fashion in large circulation is meant to confuse and sway voters. \\nA substantial percentage of the American public believe the crafted script of the government is preparation of a false flag operation to rig the election and blame it on the Russians. They have set it up to convince people that the Russians are hacking into and manipulating our electoral process. “Humor,” it is labeled as? What is humorous about it? Absolutely nothing .\\nAbout a dozen websites listed the title of Borowitz’s disinformation either whole or in part. Never having heard of Borowitz or his “column,” I looked at it in horrified disbelief, then found on www.abovetopsecret.com on a commenting thread that “The Borowitz Report” was not true news. I’m glad the report is false, because it would be picked up and immediately pointed at to “prove” a “Russian connection” between Trump and Putin, and be used for further “justification” for the U.S. government to pin the coming theft of the election/sabotage on Russia.\\nAs it stands, though, Borowitz put out this garbage and really made it appear “newsworthy” to skew an already dumbed-down voting public into believing in the theatrics of its presentation, along with the “connection” to further substantiate claims of a rigged election by Trump with the aid of Putin, the President of Russia. This is a pure Alinsky tactic of disinformation , as pure as you can find, and Borowitz can smile and say that it is just comedy, just satire.\\nJust Borowitz’s “funny” way of trying to influence an election using his “comedic column” as a shield to protect him from any wrongdoing. \\nThe Trump rally in Reno, Nevada was “disturbed” the other day on November 5, 2016. The disrupter was a man named Austyn Crites, a 33-year-old Republican who supports Clinton, an oxymoron in itself unless you consider George H.W. Bush and Colin Powell, Republicans who are voting for Clinton. Crites vociferated his displeasure at Trump and the Secret Service agents assigned to protect him removed the man from the audience . Authorities stated that no weapon was found upon him.\\nCrites is listed in the e-mails of John Podesta in Wikileaks as being a Clinton supporter. \\nIt is quite obvious this man deliberately disturbed the rally in Reno. It remains to be seen whether or not he is a paid operative of the Clinton campaign. Whether or not he is being paid, he was in the service of Hillary Clinton and performed his duties. He followed an Alinsky tactic of disrupting and attacking (either violently or nonviolently) a function or organization of an opponent to color it in a negative light and cause confusion and disruption .\\nFinally, we come to some information listed on www.thegatewaypundit.com , with a video courtesy of Fox Business News from Cavuto coast to coast . In this video clip of about 1 minute, Obama is being interviewed regarding whether or not illegal aliens will be able to vote in this election. Obama (made of Teflon through and through) did not directly “bite,” but still managed to hint at if an illegal alien should vote in the U.S. election? It probably would stand, as he said this on camera:\\n“The sanctity of the vote is strictly confidential.” \\nPresident Barack Hussein Obama II \\nWhen you see the video there can be no doubt that the question was meant to lead him into his nebulous answer to exonerate him from any potential “guilt,” because nothing will come of it yet his point has been made. A sitting president of the U.S. has given assurances that illegal aliens will be able to vote in the upcoming presidential election.\\nThe Democrats and the “invisibles,” the controllers from behind the scenes will be pulling out all of the stops. A false flag event is just around the corner, and these Marxists are all setting it up…facilitators of whatever is planned, be it a “fabricated” cyberattack blamed on Russia, a Trump victory that will be “nullified due to Russian influence,” or even a theft that can be detected.\\nThis last item? Susan Duclos of All News Pipeline wrote an excellent article recently regarding such matters. Susan’s piece detailed with great precision Obama’s ability to suspend the elections as authorized under the John Warner Defense Act of 2006. She explained how he could declare martial law in accordance with National Security Presidential Directive 51 after classifying “civil unrest” and disruption of elections and the government as a “catastrophic emergency.”\\nA Hillary Clinton “victory” and confirmation of election theft by Trump supporters will lead to a revolt , and civil unrest is the preferred emergency that Obama would use to declare martial law and suspend/nullify the election . No matter who wins, there will certainly be unrest, and that will probably be coupled with other actions undoubtedly being set up by Obama and the Democrats as we speak. Alinsky may be deceased, but his tactics are being employed by the Democrats in increasing frequency as we draw nearer to election day.\\nJeremiah Johnson is the Nom de plume of a retired Green Beret of the United States Army Special Forces (Airborne). Mr. Johnson is also a Gunsmith, a Certified Master Herbalist, a Montana Master Food Preserver, and a graduate of the U.S. Army’s SERE school (Survival Evasion Resistance Escape). He lives in a cabin in the mountains of Western Montana with his wife and three cats. You can follow Jeremiah’s regular writings at SHTFplan.com or contact him here . \\nThis article may be republished or excerpted with proper attribution to the author and a link to www.SHTFplan.com . \\nRelated: \\nThe Prepper’s Blueprint: A Step-By-Step Guide To Prepare For Any Disaster \\nTop Tier Gear: The Most Advanced Tactical Gas Mask In The World \\nThe United States Is Pre-Positioning “Enemy Assets” In Preparation For A Rigged Election \\nA Foreshadowing Of Things To Come: “This Cyberattack Was Initiated By The U.S. Government… A Beta Test Done In Preparation For A False Flag” \\nUnrest and Martial Law? Leaked Military Drill Anticipates “No Rule of Law” After Election Results \\nHow To Survive Occupied America: “Red Dawn Just Started… And You’re In It” \\n'"}, "time": 1742628498.2898147}