{"duration": 0.04288530349731445, "input_args": {"text": "\"Email \\nThere are times that we need to gain clarity before there is a problem. We see something that might make for a situation later, and we decide to deal with it now. This is both wise and prudent. It can also allow us to work with confidence, knowing that we have avoided possible conflict in the future. \\nThis seems to be the case in a recent lawsuit. As I reported, the Human Rights Commission of Iowa had worded the exemption of its new regulation on gender restroom availability very vaguely. \\nThis led to an inquiry by several organizations and churches. These inquiries were met with vague and almost hostile responses from the Commission. Out of fear of persecution, one church had filed suit to place an injunction on the law. \\nThis case has now been dropped. \\nChristian News reports : \\nA legal challenge that had been filed against the Iowa Human Rights Commission over its interpretation of local laws pertaining to gender identity has been dropped after a federal judge noted that churches are not generally considered places of public accommodation by the courts. \\nU.S. District Judge Stephanie Rose responded to motions from both sides of the case on Oct. 14, denying the Commission’s motion to dismiss the suit, while also denying the Fort Des Moines Church of Christ’s (FDMCC) request for an injunction. \\n“[S]tate and federal courts have held that churches and programs they host are not places of public accommodation,” Rose wrote. \\nIt seems that this was a waste of time. Nothing has changed, and the church still seems to be getting its right to exist from the state. I understand the desire to protect oneself, but we have to remember that if they cannot make a concerning religion, this was superfluous. \\nArticle reposted with permission from Constitution.com Don't forget to Like Freedom Outpost on Facebook , Google Plus , & Twitter . You can also get Freedom Outpost delivered to your Amazon Kindle device here .\""}, "time": 1742562073.418023}