{"duration": 0.047374725341796875, "input_args": {"text": "'When Parisians learned last week that President François Hollande paid his hairdresser more than $10, 000 a month to cut his hair, a howl was heard from Montmartre to the Marais. Not since President Bill Clinton shut down two runways in 1993 for a $200 trim aboard Air Force One have the tresses of a head of state been so widely discussed. But as men’s upkeep has gone the way of female grooming  —   Botox, facials and waxing, you know, down there  —   so, too, has the high price of a haircut. Ask Tim Rogers, a stylist at Sally Hershberger’s downtown New York studio, who charges a minimum of $400, and as much as $800, for a men’s haircut these days. He regularly flies to the Hamptons by helicopter to attend to a coterie of hedge fund managers and investment bankers. He has visited a celebrity’s home at 10 p. m. He, too, has an array of clients who go to the salon, among them the tennis champion Roger Federer and John Kennedy Schlossberg, the grandson of the president. “I maintain that men’s prices should be the same as women’s,” Mr. Rogers said last week in an interview from his home in Connecticut. Men, he said, are often more demanding than women. “The requirement is consistency,” he said. “You have to be available anytime, anywhere. ” Even if that means being on call 24 hours a day. “There is never a bad time for them,” he said of his clients. “And everything has a price. ” The star stylist Frédéric Fekkai raised eyebrows in the late 1990s when he started charging women $300 for a cut. By the   he was supplanted by Ms. Hershberger, famous for the $600 shaggy mop that defined Meg Ryan’s carefree style at the time. But it is only in recent years that the cost for a man’s haircut has rivaled its feminine counterpart. Now, in New York, it’s not uncommon for a haircut at a top salon to cost $300. And that doesn’t include highlights, straightening or silken glosses. Martial Vivot, a former Parisian who founded Salon Pour Hommes in 2008, charges $320 for one of his signature cuts. Recently, he said, he saw a client bagging groceries at the Whole Foods in Columbus Circle. “I felt like, ‘Oh, wow,’” he said. “I wondered if he could afford it. ” Lakshman Achuthan, the chief operations officer of the Economic Cycle Research Institute, has his short hair groomed by April Barton, famous for the choppy locks of downtown rock ’n’ rollers. He pays slightly less than her regular $300 rate, he said, because he visits every four weeks or so. “I’m as far away from Hollande as can be,” he said. “I don’t consider myself a flashy spender. ” He has been a client since the 1990s and said he seeks Ms. Barton’s advice as much as the snip of her scissors. “Ten years ago she said, ‘You are losing your hair,’” he explained one recent afternoon, noting that there is much less now to cut. “She said, ‘As long as you keep it clean and don’t gain any weight, you’ll be fine. ’” Mr. Achuthan is a frequent guest on television, which means he must always be  . “I think it would be easy for someone who has short hair to do a buzz cut,” he said. “But like every New Yorker, we are jammed up and don’t want to have something go wrong. ” Ms. Barton said that, while there is a boom in   barbershops, men with longer or unruly hair often fare better with more instruction. “Most barbers don’t seem to be artful stylists,” she said. She has schooled investment bankers in how to use root concealer to cover gray. Last week, she had a client who paid $670 for a cut, straightening and toning to replenish color. And that didn’t include products and a hefty tip. “The type of guys who pay this are technology entrepreneurs,” she said. Mr. Rogers, of Sally Hershberger, said that Mr. Federer, who sees a number of stylists worldwide, has a relaxed attitude compared with other clients. “It’s much more about what Mirka wants,” he said, referring to Mr. Federer’s wife. “He doesn’t want his hair to fall in his eyes. ” Mr. Federer, he said, “loves his hair. And I love him. ” But isn’t $10, 000 a month for a hairdresser, to put it bluntly, a little ridiculous? For decades, scores of Goldman Sachs bankers have had their hair cut by Salvatore Anzalone, an Italian barber with a salon in the lobby of the nearby Conrad Hotel. He charges $30 for a dry cut. (A shampoo is $7 extra.) Not so, Mr. Vivot said. “France is the capital of fashion, and he is the president of the country,” he said of Mr. Hollande. The hairdresser is on call, like a doctor. “Maybe if he was in Korea, he’d get a flattop,” he said. Robin Capili, a stylist at Sally Hershberger who trained at a barbershop (and who charges a relatively more affordable $200) said he’d never spend $10, 000 a month. “I’d invest in property,” he said. “A condo maybe. ” One of his clients, Drew O’Connell, who lives in Dallas, said that $800 would be a reach, too. But after he tallied up the flight to New York every six weeks (about $400) and other costs, he laughed. “I don’t know,” he said. “I just don’t want to think about it. ” At one point, Ms. Barton said that she would have liked to style the Republican presidential nominee, Donald J. Trump. But now, she said, “I don’t want to see him. ” Mr. Trump devoted a section of his book “Trump: How to Get Rich” to “The Art of the Hair,” where he laid out his   philosophy. If he goes bald, he wrote, he would get a toupee. “I’ve never said my hair is my strongest point,” he said. It is unlikely he’ll be visiting Ms. Barton anytime soon.'"}, "time": 1742628515.3192983}