{"duration": 0.10756230354309082, "input_args": {"text": "'California & Massachusetts Just Legalized Recreational Marijuana Nov 8, 2016 5 0 \\nIn a major win for cannabis proponents, the state of California has just voted to legalize recreational marijuana. California just turned green. \\nThe Proposition 64 was approved by California voters on Tuesday evening, which now makes California as the biggest state for legalizing the recreational use of marijuana. \\nAs it is often said, “As California goes, so goes the nation.” This will certainly bring a massive push from the rest of the nation to legalize marijuana for recreational use. \\nWith the proposition now passed, people living in California who are 21 or older can now legally possess, transport and buy up to an ounce of marijuana as well as allowing up to 6 plants to be grown by an individual. \\nNate Bradley , executive director of the California Cannabis Industry Association is happy with the results: \\n“We are very excited that citizens of California voted to end the failed policy of marijuana prohibition. Proposition 64 will allow California to take its rightful place as the center of cannabis innovation, research and development.” \\nProposition 64 was opposed by most major law enforcement groups, including the California Assn. of Highway Patrolmen, the Peace Officers Research Assn. of California and the California Police Chiefs Assn. \\nInterestingly and perhaps somewhat controversially, the initiative to vote in favor of the proposition was supported and funded by Facebook’s President Sean Park as well as billionaire George Soros. They raised nearly $16 million which is about 10 times the amount the opposition campaign raised. \\nMassachusetts has also joins California in passing recreational marijuana with Florida approving medical marijuana. \\nAs of this writing , the vote for recreational marijuana is currently being approved in Maine, has officially been approved in Nevada and is being opposed in Arizona. Votes are also pending for medical marijuana in North Dakota, Arkansas and Montana. \\nWe could very well wake up in the morning with 4 new states approving recreational marijuana and at least 1 state (Florida) approving medical marijuana. \\nWith California, Massachusetts and Nevada passing the legalization of recreational marijuana, they now join Colorado, Alaska, Washington and Oregon. \\nRegardless of the presidential election outcome, we are surely to wake up to a different and more green friendly world tomorrow. Spread the good news! \\nLance Schuttler graduated from the University of Iowa with a degree in Health Science-Health Coaching and offers health coaching services through his website Orgonlight Health. You can follow the Orgonlight Health Facebook page or visit the website for more information on how to receive health coaching for yourself, your friend or family member as well as view other inspiring articles.'"}, "time": 1742562125.9566588}