{"duration": 0.015856266021728516, "input_args": {"text": "'Culture writer for MTV News Ira Madison III attacked Alabama Republican Sen. Jeff Sessions and his   granddaughter as a “prop” to distract from his “racism. ”[“Sessions, sir, kindly return this Asian baby to the Toys “R” Us you stole her from,” Madison tweeted.  Sessions, sir, kindly return this Asian baby to the Toys ”R” Us you stole her from pic. twitter.   —   Ira Madison III (@ira) January 10, 2017,  The girl on Sessions’ lap is not adopted, it’s his granddaughter. Which is not surprising.  —   Ira Madison III (@ira) January 10, 2017,  Why is she a prop? Sessions argued for policy that in the 1880s was used to discriminate against Asian Americans https:  .   —   Ira Madison III (@ira) January 10, 2017,  There is no reason for that child to be in his lap in a hearing other than to send an ”I’m not racist message”  —   Ira Madison III (@ira) January 10, 2017,  After receiving a deluge of criticism, Madison deleted his initial tweet. Session Hive is out in force today,  —   Ira Madison III (@ira) January 10, 2017,  I often tell jokes, but seeing as bringing up Sessions’ history of racial hatred of Asians is seen as an attack on his grandchild, I deleted,  —   Ira Madison III (@ira) January 10, 2017,  Sad that many don’t see Sessions’ legitimate history of racism as a cause for concern today, but he can deeply affect our country,  —   Ira Madison III (@ira) January 10, 2017,  Madison was not alone though he received the biggest backlash for his joke, a number of   pundits and authors made similar cracks  —   presumably to demonstrate how   they are. lol loving jeff sessions’ ”how can i possibly be a racist when i’m holding this nonwhite baby” moment,  —   sara david (@SaraQDavid) January 10, 2017,  Oh, I get it. Jeff Sessions has   grandbabies. CONFIRMED. Pack it up, guys. https:  .   —   Donovan X. Ramsey (@iDXR) January 10, 2017,  Notice how Sessions made a big show of kissing a baby before being sworn in  …    .  —   JoeMyGod (@JoeMyGod) January 10, 2017,  Jeff Sessions turns up to committee hearing into whether he’s racist with a babyhttps:  .  pic. twitter.   —   Independent US (@IndyUSA) January 10, 2017,  ”Senator Sessions, what about that time you prosecuted activists who were trying to register black voters  …    ”Sessions: ”Look! A Baby!” https:  .   —   Kashana (@kashanacauley) January 10, 2017,  Amazing optics. Sessions sitting with a child on his lap as opponents try to paint him as cold pic. twitter.   —   Domenico Montanaro (@DomenicoNPR) January 10, 2017,  Sessions has a super cute baby in his lap  —   hoping we’ll forget that he’s accused of being a racist? #SenateHearings,  —   Mythili Sampathkumar (@MythiliSk) January 10, 2017,  Oh, not just children as props, @SenatorSessions, but also Asian people. Very strategic. Guess what? You’re still a LIFELONG RACIST.  —   Stefanie Iris Weiss (@EcoSexuality) January 10, 2017, '"}, "time": 1742628428.465972}