{"duration": 0.1281123161315918, "input_args": {"text": "'11 very depressing economic realities that Donald Trump will inherit There will be tremendous pressure to maintain the status quo By Michael Snyder - Friday, November 18, 2016 9:16 AM EST \\nIt would be a grave mistake to understate the amount of damage that has been done to the U.S. economy over the past eight years. In this article, I am going to share some economic numbers with you that are extremely sobering. Anyone that takes a cold, hard, honest look at the numbers should be able to see that our economy is in terrible shape. Unfortunately, the way that we see things is often clouded by our political views. Up until the election, Democrats were far more likely then Republicans to believe that the economy was improving, but now that is in the process of completely reversing. According to Gallup , only 16 percent of Republicans believed that the economy was getting better before the election, but that number has suddenly jumped to 49 percent after Trump’s election victory. And the percentage of Democrats that believe that the economy is getting better fell from 61 percent to 46 percent after the election. Here are some additional details from Gallup … After Trump won last week’s election, Republicans and Republican-leaning independents now have a much more optimistic view of the U.S. economy’s outlook than they did before the election. Just 16% of Republicans said the economy was getting better in the week before the election, while 81% said it was getting worse. Since the election, 49% say it is getting better and 44% worse. Conversely, Democrats and Democratic-leaning independents’ confidence in the economy plummeted after the election. Before the election, 61% of Democrats said the economy was getting better and 35% worse. Now, Democrats are evenly divided, with 46% saying it is getting better and 47% saying it is getting worse. \\nThe truth, of course, is that the result of the election did not somehow magically alter the outlook for the U.S. economy. \\nWe still have a giant mess on our hands, and the following are 11 very depressing economic realities that Donald Trump will inherit from Barack Obama… \\n#1 Nearly 7 out of every 10 Americans have less than $1,000 in savings . That means that about two-thirds of the country is essentially living paycheck to paycheck at this moment. \\n#2 Reuters is reporting that U.S. mall investors are poised to lose “billions” of dollars as the “ retail apocalypse ” in this nation deepens. \\n#3 Credit card delinquencies have hit the highest level that we have seen since 2012 . \\n#4 Approximately 35 percent of all Americans have a debt that is at least 180 days past due. \\n#5 The rate of homeownership has fallen for eight years in a row and is now hovering near a 50 year low . \\n#6 The total number of government employees now outnumbers the total number of manufacturing employees in this country by almost 10 million . \\n#7 The number of homeless people in New York City (where Donald Trump is from) has hit a brand new record high . \\n#8 About 20 percent of all young adults are currently living with their parents . \\n#9 Total household debt in the United States has now reached a grand total of 12.3 trillion dollars . \\n#10 The total amount of corporate debt in the U.S. has nearly doubled since the end of 2007. \\n#11 When Barack Obama entered the White House, the U.S. government was 10.6 trillion dollars in debt. Today, the U.S. national debt is currently sitting at a staggering total of $19,842,173,949,869.58 . \\nDespite nearly doubling the national debt during his eight years in the White House, Barack Obama is going to be the only president in United States history to never have a single year when U.S. GDP grew by at least three percent. \\nSo will Donald Trump waltz in and suddenly turn everything around? \\nJust like when George W. Bush was elected, there is a lot of optimism about the future right now among Republicans. \\nAnd in 2017, Republicans are going to have control of the Senate and the House in addition to being in control of the White House. \\nBut does that mean that they will actually get anything done? \\nFor a moment, let’s review what didn’t happen the last time the Republicans were in this position. The following is an extended excerpt from an article by author Devvy Kidd … —– The Republicans had control of both houses of Congress part of the time during Bush, Jr.’s two terms. Did they lock down our borders? NO. Did they pass legislation to stop ALL funding for illegals which would self-deport millions of liars, cheats and thieves? NO. (READ, please: How to Self-Deport Millions of Illegals ) Did they stop trillions in unconstitutional spending? NO. Did they get rid of any of Clinton’s unconstitutional Executive Orders? One or two but otherwise let Comrade Bill Clinton crap in our faces. Did they get rid of one unconstitutional cabinet like HHS, Department of Education and EPA? NO. Did they stop the unconstitutional foreign aid? NO. Did they stop unconstitutional spending for Planned Parenthood? NO. Congress just continues to use borrowed money to spend more debt. Did they stop unconstitutional spending for the gigantic hoax called global warming or climate change? NO. Trump: The Left Just Lost The War On Climate Change Did Bush, Jr., get us out of all the destructive trade treaties killing American jobs? NO. Did they crack down on visas bringing in tens of thousands of foreign workers when American workers who want to work are left in the unemployment line? NO. Did they stop more and more federal regulations strangling America’s businesses? NO. Did they impeach one single activist judge destroying our freedom and liberty? NO. A Republican controlled Congress with a Republican in the White House and they did virtually NOTHING to restore America to a constitutional republic and constitutional spending. —– \\nSo will things be any different under a Trump administration? \\nWe shall see. \\nThere will be tremendous pressure to maintain the status quo in many instances, because the process of fixing things would undoubtedly make conditions worse in the short-term. \\nA great example of this is the national debt. As I discussed yesterday , the only reason why we are able to enjoy such a massively inflated standard of living in this country is because we have been able to borrow trillions upon trillions of dollars from the rest of the world at ultra-low interest rates. \\nIf the federal government started spending only the money that it brought in through taxes, our ridiculous debt-fueled standard of living would begin collapsing immediately. \\nWe consume far more wealth than we produce, and the only way that we are able to do this is by borrowing insane amounts of money. \\nEither Donald Trump will continue to borrow money recklessly, or we will go into a major league economic downturn. \\nIt really is that simple. \\nBut when our politicians borrow money, they are literally destroying the future of this country. So the choice is pain in the short-term or greater pain in the long-term. \\nThere is a way out, and that would involve shutting down the Federal Reserve and going to a completely debt-free form of money, but that is a topic for another article. \\nAnd unfortunately that is not something that is even on Donald Trump’s radar at this point. \\nNo matter who won the election, the next president was going to be faced with some very harsh economic realities. \\nThere are many out there that have faith that Donald Trump can pull off an unprecedented economic miracle, but there are others that are deeply skeptical. \\nLet us hope for the best, but let us also keep preparing for the worst.'"}, "time": 1742628350.2142293}