{"duration": 0.07122087478637695, "input_args": {"text": "'As we reported one week ago, the latest Treasury International Capital report revealed something disturbing : not only had foreign central banks sold a record amount of US Treasurys in the past 12 months, some $346 billion worth…\\n\\n… but America’s largest foreign creditor, China, sold a record $34 billion in US paper in the latest month, and bringing its total holdings to the lowest since 2012.\\n\\nThis led to an obvious question: is China dumping all of its foreign reserve holdings proportionately, or is Beijing strategically offloading its US paper, for financial, political reasons or otherwise, as it buys other foreign government bonds. The answer, at least according to the Nikkei, is the latter.\\nAs the Japanese owner of the Financial Times reports , China is on a shopping spree, and has been “gobbling” up Japanese government bonds, adding that Beijing bought close to a net 9 trillion yen ($86.6 billion) worth of JGBs in the January-August period, more than tripling the amount from the same period last year. Incidentally that’s almost equivalent to the number of US Treasurys sold by China.\\nA simple explanation for the shift is that the People’s Bank of China has been reducing its holdings of U.S. Treasurys in anticipation of higher U.S. interest rates and shifting some of its money to JGBs, where higher rates – courtesy of 250% in debt/GDP – are largely guaranteed to never arrive.\\nBut more importantly, and this could explain the perplexing recent strength in the Yuan, this trend may be a reason behind the yen’s appreciation in foreign exchange markets in recent months .\\nAccording to Japan’s Ministry of Finance, China invested 8.9 trillion yen in Japanese securities in net terms between January and August. Buying started to exceed selling more often on a monthly basis in the second half of 2015. In April, net buying surpassed 3 trillion yen. Curiously, China is not buying the Japanese bonds for the “yield”, but rather for liquidity: most of the securities purchased by the PBOC are bonds with maturities of one year or less.\\nJudging by the latest TIC data, China’s selling of US paper is accelerating, which also suggests that just as China has been a factor pushing the Yuan higher, the dollar has been pressured lower by the ongoing Chinese liquidation. One wonders how much higher the USD will jump if and when China decides to halt its selling of US paper, and how much lower the Yuan will then tumble in response, leading to even faster capital outflows from China.\\nSource: Zero Hedge \\n'"}, "time": 1742564283.0583093}