{"duration": 0.028137683868408203, "input_args": {"text": "'By wmw_admin on November 2, 2016 Introduction — Oct 31, 2016 The following report only serves to underline how the U.S. political system is no longer fit for purpose. It is totally corrupt and serves ‘special interest groups’ that put their own aims over and above those of the American people. What follows is nearly two months old but it is also a timely reminder that Trump, like Clinton, is more than ready to lead America into war. Although unlike Clinton, Trump prefers a less direct route. So instead of directly challenging Russia Trump has saved his belligerence for Iran. Threatening that Iranian military speed boats would be “shot out of the water” if they made moves “that they shouldn’t be allowed to make” near U.S. warships. Given the growing military ties between Russia and Iran, this could easily result in the U.S. facing what the WSJ refers to as the Moscow-Tehran-Damascus axis: a rebranded “axis of evil”. Trouble is neither U.S. presidential candidate is offering a valid alternative to this confrontational scenario. Both are advocating two entirely different approaches on foreign policy that would ultimately lead to the same end — military confrontation with Russia. The only difference is that Americans would be more likely to follow Trump into conflict than the increasingly discredited Clinton. Ed. Trump on Iran ship behavior: ‘They will be shot out of the water’ Daniella Diaz and Johhny Diamond — CNN Sept 10, 2016 \\nDonald Trump vowed Friday that if Iran inappropriately approached US ships, they would be “shot out of the water.” \\n“And by the way, with Iran, when they circle our beautiful destroyers with their little boats and they make gestures that our people — that they shouldn’t be allowed to make, they will be shot out of the water,” he said at a rally here. \\nTaking such action would have tremendous ramifications and would likely be considered an act of war. The comments, even given Trump’s penchant for tough language, are unusual for a presidential candidate. \\nTrump appeared to be referring to a series of close encounters between the US and Iran in international waters in the Persian Gulf. \\nAn Iranian ship came within 100 yards of a US Navy patrol ship earlier this week in what the US Navy described as an “unsafe and unprofessional” action involving “harassing maneuvering.” \\nAnd late last month , a US Navy patrol craft fired three warning shots at an Iranian Revolutionary Guard Corps boat after US officials said it had harassed two US ships. Another US patrol craft and a Kuwaiti Navy ship were also harassed in the northern end of the Persian Gulf. \\nIran has also flown drones over US ships and in one of the most intense confrontations between the US and Iran, Iranian troops took US sailors into custody in January after the US naval ship accidentally strayed into Iranian territorial waters. \\nThe US has condemned Iran’s actions but hasn’t responded militarily to the provocations.'"}, "time": 1742628598.6728704}