{"duration": 0.06333541870117188, "input_args": {"text": "'posted by Eddie You’ve heard of “Schindler’s List,” but have you heard of Sugihara’s visas? Oskar Schindler, the subject of the film “Schindler’s List,” is credited with saving around 1,200 Jews during World War II. But have you ever heard of this humble diplomat-turned-lightbulb-salesman who was a hero to an estimated 6,000?! His name was Chiune Sugihara. It was 1939. The brink of World War II. Germany had annexed Czechoslovakia and invaded Poland. Jewish refugees from Poland were flooding the surrounding countries. At that time, a third of Lithuania’s urban population were Jews. In 1940, Sugihara was the vice consul of the Japanese consulate in Lithuania. Hundreds were coming into Sugihara’s office begging for visas that would give them passage to Japan and away from encroaching war, persecution, and almost certain capture … and death. He knew a way to help. Visas. The rules to get a visa were strict. And Sugihara’s bosses back in Tokyo told him to follow the strict rules they’d made. But if he followed the rules, the chances of getting visas to those in need went down. Too far down. Actually, it’s more accurate to say that if Sugihara wasn’t issuing the visas, the people’s chances of getting the visas virtually disappeared . The Japanese embassy in Lithuania was ordered to close, all while Sugihara sought permission to approve the visas (as many as three times) and was denied permission from the foreign ministry in Japan. So, after consulting with his family, Sugihara decided to ignore the rules and issue visas without permission: “People in Tokyo were not united. I felt it silly to deal with them. … I knew that somebody would surely complain about me in the future. But, I myself thought this would be the right thing to do. There is nothing wrong in saving many people’s lives.” by Nick Shepley So, he set to writing. Back then, that was how visas — especially these very special and more or less “illegal” visas — got made. By hand. A copy of one of Sugihara’s handwritten exit visas. Image via Huddyhuddy/Wikimedia Commons. Pen stroke by pen stroke, he saved lives by giving thousands passage across the Soviet Union, through Japan, and onward. These refugees weren’t headed specifically to Japan but to Curaçao and Dutch Guiana (now Suriname) and had to pass through the Soviet Union and Japan to get there. From the end of July to the end of August, until his consulate in Lithuania was scheduled to close in early September (about a month!), Sugihara issued visas, completely ignoring the rules. 45 years after he signed the visas, Sugihara was asked why he did it. He liked to give two reasons: “They were human beings, and they needed help,” he said. “I’m glad I found the strength to make the decision to give it to them.” He didn’t stay involved in government after the war ended. To support his family, he became an interpreter and translator and even did a stint as a door-to-door lightbulb salesman. He wound up managing an export company for the last 20 years of his life. He was just an average working man … with a huge, dramatic, bittersweet, and wonderful secret. On a memorial built for Sugihara in Los Angeles’ Little Tokyo, Sugihara is seated on a bench holding a visa. The quote that accompanies his statue is from the Talmud: “He who saves one life, saves the entire world.” He doesn’t have a movie, but wow. What a story. Score one for humanity! Source:'"}, "time": 1742562687.8715727}