{"duration": 1.388927698135376, "input_args": {"text": "'Billie Joe Armstrong may be punk rock’s biggest triple threat: the frontman of Green Day, which was recently inducted into the Rock and Roll Hall of Fame the   and sometime star of “American Idiot,” the Broadway musical on its way to becoming an HBO movie and the lead of “Ordinary World,” an indie film out Friday, Oct. 14. What he is not, though, by his own admission, is a social media maven. “I’ll try to catch up,” he said. “I get into Instagram, and the next thing I know, someone will say, it’s all about Snapchat now! It’s like, oh God, leave me in the Stone Age  —   I got one foot in the Stone Age and the millennium right now. ” Mr. Armstrong’s straddled take on culture is laid out on “Revolution Radio,” the new Green Day album, and the first since 2000 that the band  —   including the bassist Mike Dirnt and the drummer Tré Cool  —     with an engineer. “It feels more independent than we’ve ever been,” Mr. Armstrong said in a phone interview. He’s also branching out  —   sort of  —   with “Ordinary World,” in which he plays a    dad who throws himself a   40th birthday party. “My thing was keeping my stubble on for the movie,” he said. “I had to make sure I shaved it in the right way, once every three days. And I wanted to show my gray that I have growing in. ” A still boyish 44, Mr. Armstrong  —   who went through rehab for substance abuse in 2012 after an onstage outburst at a pop festival  —   is grappling with his shifting generation. The cover for “Revolution Radio” is a boombox on fire. “It’s like that feeling of what’s obsolete,” he said, “like we’re turning into a   graveyard. ” He paused. “Ooh, that was good  —     graveyard! I’m going to say that so many times in the next few days. ” He hopes to reprise the role of St. Jimmy, the   bad influence, in HBO’s “American Idiot,” a rock opera based on the 2004 Green Day album. He credits the ambition of “Idiot” with the new heights of success in his career. But, he added: “I’m not royalty. I’m the king of nothing. I’m in the same high school rock ’n’ roll band I’ve been in since I was 16. ” Here are edited excerpts from the conversation. This is your first leading film role. Did you do any actorly things to prepare? Not like anything weird  —   I wasn’t exactly doing any, like, mime. Me and Lee Kirk, the director, we spent a lot of time together fleshing the character out, putting it more in my language. I just went from experiences on my own, and I just tried to be as honest as I could. Acting for the stage, you project to the back of the room, especially a character like St. Jimmy. This is all about the subtleties of acting to the camera, which is difficult for me, because I’m anything but subtle. And you were playing opposite some very seasoned improvisers, like Fred Armisen and Judy Greer. Did that throw you? It felt pretty intimidating, just because I have so much respect for those people. They’re brilliant people they’re not like   at what they do, they’re all the way good at what they do. Everybody wanted to make things really relaxed and fun. A couple of the guys that played dads in the movie came in, and we just acted out some of the scenes, which is super awkward at first, doing something you’ve never done, but eventually I got comfortable with it. We’re seeing more and more of that nontraditional father onscreen. Can you relate? It’s a different take on parenting, especially people that were maybe Generation X kind of people and are raising kids now. We’re not our dads. I think there’s more sensitivity training that’s involved in being a parent nowadays. My kids are 21 and 18  —   that was a trip. I was a very young dad. And your sons are both musicians. Do you jam with them? A little bit. Mostly they show me music that they’re into, they do a lot of demos and things like that on their own. My youngest son, Jakob, he’s becoming a really good songwriter. He writes songs that are straight from the heart. Joey’s band, they’re really good, and they’re different. It’s not about being, like, a rock star. If there’s anything I share with them, it’s the joy and the love of music. You started in the punk scene as a teenager, when it’s a lot about youthful anger. What does it mean to you to be part of a punk scene now? I think punk is a lot more than just anger, and rage. It’s like the weirdo that gets to find their voice for the first time. It could be someone that wants to have their own fanzine, and write about things they believe in, and despite the odds, do it anyway. Green Day records in general are about feeling kind of lost, and a bit stupid, in the midst of chaos and media and everything that’s changed. And the bottom line for this album is to find something that’s attainable, some kind of peace or serenity inside that chaos. The song “Ordinary World” is basically what that’s about. “Say Goodbye” is about watching how Ferguson is this military state, and you see all these tanks and tear gas. “Revolution Radio” mentions that, too. It’s just reflecting what I see, and maybe coming up with a caricature of it. You touch on difficult topics on the album  —   “Bang Bang” is a song from the perspective of a mass shooter. Is that fun to play? Yeah, and hard  —   it’s fast. It’s a release for everyone that’s singing it in the crowd. When you grow up in an era of social media and manifestoes and mass shootings and narcissism and that sort of evil side of American life, what do you say about something like that? You’re just left speechless. The best way I’m able to talk about it is when I do it in a song, and that’s sort of my release, and that’s what ends up coming along in our crowds these last few years. Has your songwriting process changed in sobriety? I’ve just become more focused I’ve learned to stop when I’m blocked. Either you go and make the bigger mess right now, or that song doesn’t want to be written right now, your brain’s not ready for it. Sometimes I just gotta know when to back off something. The fact that I’m clearheaded  —   I just love making stuff. A song like “Revolution Radio,” it’s so subtle and it’s so nerdy. The song’s got the intro, and it’s got a   that goes into the chorus, and I decided to not do that   going into the chorus in the second verse. It makes the song unpredictable. For me, that’s like the greatest song I’ve ever done. It’s super nerdy, but that’s what I love about writing. Why do you think “American Idiot” has had such a long life, in so many forms? Because people are able to interpret it anyway they want any time there’s any kind of injustice that’s going along, in America, you can adapt it somehow, go listen to that record, and it makes sense. There’s a lot more transparency now. In Pennsylvania, there was a small theater group with an   cast that did “American Idiot” for Black Lives Matter. When I saw that, I was like: “Yeah, this is why I do this stuff!” Because people take it and make something of their own out of it.'"}, "time": 1742563021.7167983}