{"duration": 1.2591769695281982, "input_args": {"text": "'Email \\nAs the spotlight begins to focus on Hillary Clinton\\'s deputy adviser Huma Abedin amid Wikileaks\\' email releases, we\\'ve exposed her ties to the Muslim Brotherhood a long time ago . Now a new documentary is elaborating on her ties to the Muslim Brotherhood and the Saudis. \\nTrevor Loudon, who helped in the publication of The Betrayal Papers (which you can read here , here , here , here , here , and here ), is now behind a new documentary titled The Enemies Within . \\nLoudon began work on the film two years ago. \\nTerresa Monroe-Hamilton, in calling on support for the making of the film wrote, \"Trevor and I both know how hard the last six years has been on Americans. We are all struggling just to survive. Many of us have done this at a cost to our livelihoods, our families and our own well-being. Trevor has never given it a second thought. He is a warrior and a patriot in every sense of the word and there is not a soul on this earth that I trust more to have my back when the fighting comes. So, it is no small thing that we come to you now and ask that you donate to the movie that Trevor has in production currently which exposes The Enemies Within – Communists, Socialists & Progressives in the U.S. Congress.\" \\n\"This is no minor feat we are attempting. We need to raise $100,000 to help with production and distribution,\" she added. \"We face many of the same hurdles that Dinesh D\\'Souza has faced in his battles to expose the truth about Barack Obama and those who surround him.\" \\nWND reports: \\nIn a six-minute trailer of the documentary made available to WND (see below), former intelligence officers express their concern about Abedin\\'s background , including her position in her family\\'s institute, which was established by the Saudi government and supported by a prominent financial contributor to Osama bin Laden and al-Qaida. \\nAbedin has been in headlines since FBI Director James Comey announced Friday that the bureau reopened its investigation of Hillary Clinton\\'s handling of classified information after discovering 650,000 of Abedin\\'s State Department emails on a computer owned by her estranged husband, Anthony Weiner, who is under investigation for allegedly sexting a minor. \\n… \\nLoudon interviews former CIA operations officer Clare Lopez, who recounts how the Saudi government established the Institute for Muslim Minority Affairs, the IMMA, and put Huma Abedin\\'s father, Syed Zainul Abedin, in charge. \\nHuma Abedin served for several years as an assistant editor for the institute\\'s journal, while her father was editor and her mother a co-editor. \\nAlongside Huma Abedin on the editorial board also was Abdullah Omar Naseef, the founder of the Rabita Trust , a financial institution founded prior to 9/11 for the explicit purpose of funding Osama bin Laden and al-Qaida. \\n\"Now, this was   we might recall that U.S. foreign policy flipped on its head, from going after jihad and jihadist like al-Qaida to, in Libya, for example, aiding and abetting known al-Qaida jihadist militias to overthrow a sitting, sovereign government led by Moammar Gadhafi, no choir boy, to be sure, but our ally at the time,\" said Lopez. \\n\"All of this happened during the period of time when Clinton was secretary of state and Huma Abedin was at her side, whispering in her ear,\" she added.'"}, "time": 1742563831.822963}