{"duration": 0.11054301261901855, "input_args": {"text": "'Bill Cunningham, who turned fashion photography into his own branch of cultural anthropology on the streets of New York, chronicling an era’s   social scene for The New York Times by training his busily observant lens on what people wore  —   stylishly, flamboyantly or just plain sensibly  —   died on Saturday in Manhattan. He was 87. His death was confirmed by The Times. He had been hospitalized recently after having a stroke. Mr. Cunningham was such a singular presence in the city that, in 2009, he was designated a living landmark. And he was an easy one to spot, riding his bicycle through Midtown, where he did most of his field work: his   frame draped in his utilitarian blue French worker’s jacket, khaki pants and black sneakers (he himself was no one’s idea of a fashion plate) with his   camera slung around his neck, ever at the ready for the next fashion statement to come around the corner. Nothing escaped his notice: not the fanny packs, not the Birkin bags, not the gingham shirts, not the fluorescent biker shorts. In his nearly 40 years working for The Times, Mr. Cunningham snapped away at changing dress habits to chart the broader shift away from formality and toward something more diffuse and individualistic. At the Pierre hotel on the East Side of Manhattan, he pointed his camera at     New Yorkers with names like Rockefeller and Vanderbilt. Downtown, by the piers, he clicked away at    Voguers. Up in Harlem, he jumped off his bicycle  —   he rode more than 30 over the years, replacing one after another as they were wrecked or stolen  —   for   in   jeans. In the process, he turned into something of a celebrity himself. In 2008, Mr. Cunningham went to Paris, where the French government bestowed the Legion of Honor on him. In New York, he was celebrated at Bergdorf Goodman, where a   mannequin of him was installed in the window. It was the New York Landmarks Conservancy that made him a living landmark in 2009, the same year The New Yorker, in a profile, described his On the Street and Evening Hours columns as the city’s unofficial yearbook: “an exuberant, sometimes retroactively embarrassing chronicle of the way we looked. ” In 2010, a documentary, “Bill Cunningham New York,” premiered at the Museum of Modern Art to glowing reviews. Yet Mr. Cunningham told nearly anyone who asked about it that the attendant publicity was a total hassle, a reason for strangers to approach and bother him. He wanted to find subjects, not be the subject. He wanted to observe, rather than be observed. Asceticism was a hallmark of his brand. He didn’t go to the movies. He didn’t own a television. He ate breakfast nearly every day at the Stage Star Deli on West 55th Street, where a cup of coffee and a sausage, egg and cheese could be had, until very recently, for under $3. He lived until 2010 in a studio above Carnegie Hall amid rows and rows of file cabinets, where he kept all of his negatives. He slept on a   cot, showered in a shared bathroom and, when he was asked why he spent years ripping up checks from magazines like Details (which he helped Annie Flanders launch in 1982) he said: “Money’s the cheapest thing. Liberty and freedom is the most expensive. ” Although he sometimes photographed upward of 20 gala events a week, he never sat down for dinner at any of them and would wave away people who walked up to him to inquire whether he would at least like a glass of water. Instead, he stood off to the side photographing women like Annette de la Renta and Mercedes Bass in their beaded gowns and tweed suits. As Anna Wintour put it in the documentary about Mr. Cunningham, “I’ve said many times, ‘We all get dressed for Bill. ’” Mr. Cunningham’s position as a perennial outsider among a set of consummate insiders was part of what made him uniquely well suited to The Times. “His company was sought after by the fashion world’s rich and powerful, yet he remained one of the kindest, most gentle and humble people I have ever met,” said Arthur Ochs Sulzberger Jr. The Times’s publisher and chairman. “We have lost a legend, and I am personally heartbroken to have lost a friend. ” Dean Baquet, The Times’s executive editor, said: “He was a hugely ethical journalist. And he was incredibly   about fashion. To see a Bill Cunningham street spread was to see all of New York. Young people. Brown people. People who spent fortunes on fashion and people who just had a strut and knew how to put an outfit together out of what they had and what they found. ” Michele McNally, The Times’s director of photography, said: “Bill was an extraordinary man, his commitment and passion unparalleled, his gentleness and humility inspirational. Even though his talents were very well known, he preferred to be anonymous, something unachievable for such a superstar. I will miss him every day. ” Mr. Cunningham particularly loved eccentrics, whom he collected like precious seashells. One was Shail Upadhya, whose work as a Nepalese diplomat is perhaps less memorable than his penchant for polka dots, Pucci prints and other assorted peculiarities, like a     coat made from his retired sofa. Another was Iris Apfel, a Palm Beach socialite who became the subject of Albert Maysles’s last documentary film only after Mr. Cunningham took pictures of her on the street in her shiny black saucerlike glasses and chunky costume jewelry. “Bill photographed me before anyone knew who I was,” Ms. Apfel said. “At 94, I’ve become a cover girl, and he was very largely responsible for my ultimate success. ” Mr. Cunningham’s most frequent observation spot during the day was Fifth Avenue and 57th Street, where he became as much a part of the scenery as Tiffany  Company. His camera clicked constantly as he spotted fashions and moved with   speed to record his subjects at just the right angle. “Everyone knew to leave him alone when he saw a sneaker he liked or a dress that caught his eye,” said Harold Koda, the former curator in charge at the Metropolitan Museum of Art’s Costume Institute. “Because if you were in the way of someone he wanted to photograph,” said Kim Hastreiter, the editor of Paper magazine and a friend of Mr. Cunningham’s, “he would climb over you to get it. He was like a war photographer that way, except that what he was photographing were clothes. ” Mr. Cunningham himself once said: “When I’m photographing, I look for the personal style with which something is worn  —   sometimes even how an umbrella is carried or how a coat is held closed. At parties, it’s important to be almost invisible, to catch people when they’re oblivious to the camera  —   to get the intensity of their speech, the gestures of their hands. I’m interested in capturing a moment with animation and spirit. ” His survivors include several nieces and nephews. William John Cunningham Jr. was born on March 13, 1929, in Boston, the second of four children in an Irish Catholic family. In middle school, he used bits of material he got from a dime store to put together hats, one of which he gave to his mother to wear to the New York World’s Fair in 1939. “She never wore it,” Mr. Cunningham once said. “My family all thought I was a little nuts. ” As a teenager, he got a   job at the department store Bonwit Teller, then received a scholarship to Harvard, only to drop out after two months. “They thought I was an illiterate,” he said. “I was hopeless, but I was a visual person. ” With nothing to do in Boston and his parents pressuring him to find some direction, he moved to New York, where he took a room with an uncle, Tom Harrington, who had an ownership stake in an advertising agency. “My family thought they could indoctrinate me in that business, that living with my uncle it would brush off,” Mr. Cunningham said. “But it didn’t work. I had always been interested in fashion. ” So when Mr. Harrington issued his nephew an ultimatum  —   “Quit making hats or get out of my apartment”  —   Mr. Cunningham chose the latter, relocating to a   apartment on East 52nd Street that doubled as a showroom for his   fedoras and   toques. To make extra money, Mr. Cunningham began freelancing for Women’s Wear Daily, then quit sometime in the early 1960s after getting into a feud with its publisher, John Fairchild, over who was a better designer: André Courrèges or Yves Saint Laurent. “John killed my story,” Mr. Cunningham later recalled. “He said, ‘No, no, Saint Laurent is the one.’ And that was it for me. When they wouldn’t publish the Courrèges article the way I saw it, I left. ” By then, feminism was on the ascent, and   paired with flouncy tops were replacing pink suits and pillbox hats. To Mr. Cunningham, it was becoming clear that his days as a milliner were numbered. Around 1967, he got his first camera and used it to take pictures of the “Summer of Love,” when he realized the action was out on the street. He started taking assignments for The Daily News and The Chicago Tribune, and he became a regular contributor to The Times in the late 1970s. Over the next two decades, he declined repeated efforts by his editors to get him to take a staff position. “Once people own you,” he would say, “they can tell you what to do. So don’t let ’em. ” That changed in 1994, after Mr. Cunningham was hit by a truck while riding his bicycle. Explaining why he had finally accepted The Times’s offer, he said, “It was a matter of health insurance. ” Occasionally, Mr. Cunningham allowed people to celebrate him in one way or another. For example, in 1993, he was honored by the Council of Fashion Designers of America and biked onto the stage to accept his award. But that was largely out of character. Later on, Mr. Koda approached him to see if he would be interested in curating a retrospective of his pictures at the Met. Mr. Cunningham turned him down. “He said to me, ‘I have a job I love,’” Mr. Koda recalled. “He thought it would be a diversion. He did what he loved, and what he loved is documenting this very ephemeral world. ” Perhaps unsurprisingly, Mr. Cunningham was a reluctant participant in his own documentary. According to its director, Richard Press, Mr. Cunningham would agree to be interviewed, then spend months canceling or postponing shoots. Mr. Cunningham said until his death that he had not seen the film. “We tried to get him to go to the opening,” Mr. Press said. “He just said: ‘Oh, kids, you made a movie. I’m too busy.’ He came to our   party and he photographed it. He put the directors from the festival in his column, but he didn’t even say why they were there or what they were celebrating. ” Mr. Cunningham also resisted the trends of celebrity dressing. He had seen actresses in their fishtail dresses preening and posing before the phalanxes of photographers at ceremonies like the Golden Globes and the Oscars. They were poised. They looked pretty. Yet he could not muster enthusiasm for them. It wasn’t simply that he was nostalgic for another time, back when famous women like Lauren Bacall and Brooke Astor actually dressed themselves. That era may have held a certain appeal for him, but even when he was in his 70s and 80s, he still had plenty of subjects he loved to shoot. One was Louise Doktor, an administrative assistant at a New York holding company who had a coat with four sleeves and a handbag made from a soccer ball. Another was Andre J. a bearded man with a taste for    ’  dresses. “He had people who recurred in his columns,” Mr. Koda said. “Most of them were not famous. They were working people he was interested in. His thing was personal style. ” Mr. Cunningham put it this way in an essay he wrote for The Times in 2002: “Fashion is as vital and as interesting today as ever. I know what people with a more formal attitude mean when they say they’re horrified by what they see on the street. But fashion is doing its job. It’s mirroring exactly our times. ”'"}, "time": 1742628604.144085}