{"duration": 1.3167660236358643, "input_args": {"text": "'Print \\nIt’s funny how Clinton scandals always seem to get covered up by a loss of emails. Hillary’s current email scandal is not the first time this has happened to her or her hubby. During Bill Clinton’s tenure in the White House, a “glitch” (or person) turned off an automatic email archiving system causing the loss of around one million emails . The emails that just “happened” to disappear were the same ones Kenneth Starr was subpoenaing for the Monica Lewinsky scandal and that Congress was asking for in its investigation of “Filegate.” \\nAlso coincidentally, the lost emails were from the server that controlled the email accounts of President Clinton and other potential witnesses in the above scandal. The people who discovered the emails were missing were threatened with jail if they spoke about the loss. \\nAccording to the House Oversight Committee report released in December 2000: \\nThe White House installed an Automated Records Management System (ARMS) to store all email correspondence in one central place, and make it easier to respond to document subpoenas. Due to a misconfiguration in the system, e-mail to about 500 White House officials was never recorded. E-mail was first discovered missing in January 1998, but the extent of the problem was not realized until later that year. \\nTop White House officials were notified in June. Despite the fact that e-mail was being subpoenaed in a number of civil and criminal cases, including the Lewinsky affair and the Filegate scandal, the White House did not notify investigators that some of it was missing. In mid-February 2000, the ex-chief of White House computer operations, Sheryl Hall who had moved to the Treasury Dept. came forward with allegations that Clinton administration officials were involved in an e-mail cover-up. Betty Lambuth, working for a private employer under contract to the White House, charged that White House technicians had been threatened with loss of job, arrest, and jail if they revealed the problem. \\nThe White House later said the problem was resulted from an“unintentional ‘glitch’ and blamed it on ‘human error,’ attributing the problem to a ‘disconnect’ between technicians and lawyers who, apparently, did not realize that the computer mistake might have an effect on the pending subpoena requests.” \\nBetty Lambuth, who worked for CEXEC, a subcontractor for Northrop-Grumman that ran and maintained the White House computer system, heard about the missing emails from one of her subordinates, Robert Haas. Hass audited the White House system in June 1998 because he and other technicians discovered that automated archiving system wasn’t scanning and storing Internet email sent to the server used by the Executive Office of the President. Lambuth testified under oath, that when she informed the White House, Office of Administration counsel Mark Lindsay told her, ”If I or any of my team who knew about the email problem told anyone else about it we would lose our jobs, be arrested and put in jail.” \\nShe said Lindsay specified that she was not to tell even her private-sector boss, Steve Hawkins, who she said eventually removed her from her White House assignment when she refused to tell him about the e-mail problem. Lambuth said she and her co-workers dubbed the e-mail problem ”Project X,” [as a joking reference to the TV show “The X Files”] and because of the threats, she and her staff took to meeting in a park close to the New Executive Office Building and in a nearby Starbucks when discussing the matter. \\nLambuth also told the court , a subordinate told her some of the emails deal with “Vice President Al Gore’s involvement in campaign fund-raising controversies” and “the sale of Clinton Commerce Department trade mission seats in exchange for campaign contributions.” The subordinate also told her the emails also contained “information on the White House’s improper gathering of FBI background files of long-ago Republican appointees and the Monica S. Lewinsky scandal” \\nA Northrop Grumman official, Joseph Vasta, testified that the Clinton-Gore White House intimidated the email contractor, into participating in the e-mail cover-up. “Vasta testified that it was made apparent that Northrop Grumman could lose its $50 million contract if it didn’t play ball with the Clinton-Gore White House.” \\nNot all of the White House emails were lost– just the ones on the Mail2 server. The officials served by the Mail2 server included Doris Matsui, Marsha Scott, Sidney Blumenthal, Cheryl Mills, Bruce Lindsey, Erskine Bowles, Rahm Emanuel, Nancy Hernreich, John Podesta, Ira Magaziner, Ann Lewis, Charles Ruff, Lanny Breuer, Paul Begala, and President Clinton. \\nIf some of those names sound familiar, they should. People such as Sid Blumenthal and Cheryl Mills have been questioned as part of the present Clinton email scandal, and John Podesta is running Hillary Clinton’s 2016 presidential campaign. \\nBruce Lindsey, now the Chairman of the Board of the Clinton Foundation, was the foundation’s CEO from 2003 to 2013 during Hillary Clinton’s term as secretary of state which, according to Peter Schweizer’s best-selling book “Clinton Cash,” was a time when the foundation and the State Department were involved in cronyism. \\nAs far as the historic documents and reports remaining on the web, news about “Project X” began to fade in October 2000 as the country approached the presidential election – perhaps, because liberal media were trying to protect then-Vice President Al Gore as he campaigned for a promotion (which sounds like the current Clinton email case, where the lefty media are doing their best to cover up the scandal). Betty Lambuth even testified that some of the missing emails involved possible Gore campaign fund-raising controversies. \\nAdditionally neither the documents examined nor a subsequent internet search, turned up any mention that the Project X emails dealing with the possible Bill Clinton White House scandals have have ever been recovered and turned over to the national archives. \\nFrom Bill Clinton’s Project X to Hillary Clinton’s private server scandal, losing large volumes of important emails seems to run in the family.'"}, "time": 1742564483.2329013}