{"duration": 0.06113910675048828, "input_args": {"text": "'Demonstrators Protest Outside Blue Cat Cafe, Say Graffiti Didn’t Come from Them Katie Hall, Statesman, October 21, 2016 \\nMore than a dozen people participated in a heated protest against gentrification outside an East Austin cafe Friday evening, but organizers denied being involved in the vandalism discovered at the business earlier today . \\nThe protest was organized by Defend Our Hoodz , which pointed at Blue Cat Cafe, located at East Cesar Chavez and Navasota streets, as one of many examples of gentrification in the area. \\n{snip} \\nThe protest was heated at times. At one point, a few of the protesters surrounded and yelled at the cafe’s owner, who argued with them while standing outside the cafe. \\n{snip} \\nBlue Cat Cafe opened its doors a year ago on Oct. 17. It replaced the family-run piñata store Jumpolin, which was demolished in February 2015. Jumpolin’s owners said the eight-year-old business had been torn down with no notification, and the demolition sparked protests as people argued that the event symbolized how Austinites and Austin landowners are pushing out minority residents and business owners as the city grows. \\n{snip} \\nOn Friday morning, the owner of Blue Cat Cafe discovered graffiti on the business’ walls that read “you gentrified scum.” The doors had also been glued shut, temporarily trapping the cafe’s cats inside. \\n{snip} \\nThe cafe’s owner asked the Statesman not to use her name because of multiple death threats that she said she’s gotten from protesters who opposed the demolition of Jumpolin. \\n“The vandalism and the mental anguish they’ve caused me and the cyber-bullying they do–it’s really out of control,” the owner said. “They show up with megaphones and they yell profanity; they send me emails with pictures of dead cats and pigs.” \\n[Editor’s Note: There is footage of the protest at the original article link below.]'"}, "time": 1742563318.6158726}