{"duration": 0.04796791076660156, "input_args": {"text": "'BARCELONA (AFP)  —   The leader of Spain’s Catalonia region, where a separatist movement is in full swing, on Friday announced an independence referendum for October 1 in defiance of Madrid. [People will be asked to vote on the question: “Do you want Catalonia to be an independent state in the form of a republic,” Carles Puigdemont said in Barcelona.  If Catalonia’s   authorities win, they have said they will immediately start proceedings to separate from Spain. But the central government in Madrid insists the procedure is not valid and the Catalan authorities face significant challenges to even hold the referendum. Catalonia, a wealthy, 7.   region with its own language and customs, has long demanded greater autonomy. For years separatist politicians in the northeastern region have tried to win approval from Spain’s central government to hold a vote similar to Scotland’s 2014 independence referendum from Britain, which resulted in a “no” vote. And while Catalans are divided on the issue, with 48. 5 percent against independence and 44. 3 percent in favour according to the latest poll by the regional government, close to   support holding a referendum.  —   ‘I don’t want it’  —   Catalan authorities have repeatedly been thwarted in their attempts to hold such a vote by the central government, which argues it goes against the constitution and would threaten the unity of Spain. In 2014, Catalonia held a   vote under then president Artur Mas, in which more than 80 percent of those who cast a ballot chose independence, although just 2. 3 million out of 6. 3 million eligible voters took part. But in holding the symbolic referendum, Mas went against Spain’s Constitutional Court, which had outlawed the vote  —   even if it was  . He was later put on trial and banned from holding office for two years. Puigdemont, though, still wants to go ahead, and he wants his referendum to be binding this time  —   even though Madrid has pledged to be just as tough this time round. “I don’t want it, I don’t believe in it, and as long as I am prime minister, it won’t happen,” Spain’s Prime Minister Mariano Rajoy said in May. In February, the Constitutional Court ruled against the referendum and warned Catalan leaders they faced repercussions if they continued with their project. Catalonia’s officials have had little luck pushing their project abroad either.  —   Challenges to organise vote  —   Regional authorities also face a host of challenges just to hold the referendum without Madrid’s consent. Civil servants such as the police or the heads of schools where polling stations could be set up, for instance, will be   for the organisation of such a vote. But they are stuck between a rock and a hard place. Regardless of what they support, they would have to choose between obeying their immediate superiors and facing possible sanctions for disobeying Spanish law, or sticking by the Constitution. Aside from that, none of the usual, necessary accessories of an election would be available, such as an official campaign or an independent authority to oversee the vote. And the central government has ways to stop the referendum from going ahead. It can ask the Constitutional Court to suspend Puigdemont for disobedience, or it could take temporary control of key Catalan functions such as the police.'"}, "time": 1742564014.8952153}