{"duration": 0.05006670951843262, "input_args": {"text": "'Tom Hayden on the Vietnam War and America’s Collective Memory Posted on Oct 26, 2016 \\nTom Hayden was a crucial figure in the student activist movements of the 1960s and 1970s, known for participating in anti-war protests and demonstrating for civil rights. Notably, he demonstrated against the Vietnam War and was even arrested for his anti-war efforts. Hayden died on Sunday at the age of 76, but even in the last few years he continued to remind America of the importance of activism. \\nIn a speech given last year at “Vietnam: The Power of Protest,” a conference in Washington, D.C., Hayden cited his activist history and urged Americans not to forget the powerful political movements of earlier decades. “[T]he struggle for memory and for history is a living thing,” he told the audience. “Each generation has to wrestle with the history of what came before, and ask: Whose interest does this history serve? How does it advance a legacy of social movements? How does it deny that legacy?” \\nHayden then began to explain the importance of remembering the widespread political activism of the ’60s and ’70s. “We gather here to remember the power that we had at one point, the power of the peace movement, and to challenge the Pentagon now on the battlefield of memory,” he said. He continued: \\nThere came a generation of career politicians who were afraid of association with the peace movement, who were afraid of being seen as soft, who saw that the inside track was the track of war. Our national forgetting is basically pathological. Our systems—politics, media, culture—are totally out of balance today because of our collective refusal to admit that the Vietnam War was wrong and that the peace movement was right. In the absence—in the absence of an established voice for peace in all the institutions, the neoconservatives will fill the foreign policy vacuum. Am I right? Will it not? Will it not advise both parties? I think, though, that American public opinion has shifted to a much more skeptical state of mind than earlier generations, but the spectrum of American politics and media has not. \\nIn order to fully unify, Hayden concluded, America must remember its past. Although he noted the many successes of the anti-war and pro-civil rights movements, he argues that activists must accept that they “all walked away” when the Vietnam War ended. “We might have been united,” Hayden said, “but instead, we were relegated to wondering what might have been.” \\nAdvertisement \\nWatch Hayden’s full speech in the video below: \\n</p><p>'"}, "time": 1742561995.4263573}