{"duration": 0.19750571250915527, "input_args": {"text": "'Email \\nDonald Trump has done what many said could not be done. In the wee hours of Wednesday morning, he exceeded the necessary 270 electoral votes and was announced the winner of the presidential election. To call his victory a political upset would be an understatement; the establishment media spent the evening watching the votes come in in a state of frenzied disbelief. \\nTrump campaigned on an anti-establishment platform that both distanced himself from the leadership of the GOP and drew attacks from both GOP leaders and Democrats. Trump came out against so-called free trade agreements such as TPP, promised to defend the border, promised to work to build the American economy, and — worst of all to the establishment — put America first. Whether he will do those things remains to be seen, but the point is that the establishment seems to have pulled out all stops in an effort to keep Trump from ever seeing the inside of the White House as anything other than an invited guest. \\nWhat the establishment appears to have overlooked — indeed appears to always overlook — is the American mindset. That mindset is as mysterious to the insiders as theirs is to patriotic Americans. \\nAs Patrick Caddell wrote for Fox News : Unfortunately, the analysts, the pollsters and most importantly the commentariat of the political class have never understood, and in fact are psychologically incapable of understanding what is happening. And for the entire cycle of this presidential campaign they have failed to grasp what was happening before their eyes — for it runs counter to everything they believe about themselves. In truth, they are suffering from cognitive dissonance believing in their righteous superiority and are not capable of realizing that it is they who have become the adversary of the American people. And therefore they have been wrong, in this entire election cycle, every step of the way. \\nCaddell goes on to note that the “uprising” — of which Trump was the Right Guard and Bernie Sanders was the Left Guard — was not created by either Trump or Sanders; it was the other way around. And that — because of their “cognitive dissonance” — the “leaders” within the establishment (both Left and Right) missed that point: For them, American politics only began yesterday. They know little history and have no appreciation of the collective consciousness of the American people. Whether it is the campaign of Bernie Sanders, who came within a hair’s breadth of knocking out the coronated nominee of the Democratic establishment or on the other side, the emergence of the total outsider Donald Trump, the most improbable candidate of all. In truth, Bernie Sanders and Donald Trump, sucked from the same trough even if it was from opposite ends. But the critical point that is missed, by almost everyone, was that neither Sanders nor Trump created this uprising. They were chosen vehicles — they did not create these movements, these movements created them. \\nBy giving the American people a choice between Hillary Clinton (who WikiLeaks disclosures show wanted Trump to win the GOP nomination) and Donald Trump, the establishment put Americans in a position to come out swinging. While a great many voters would have preferred a more constitutionally minded option, the GOP played the same tired, old game it has been playing for the past several election cycles. By filling the roster with one establishment Republican after another, the GOP put voters in a position to nominate and then elect Trump. \\nNeither the talking heads of the mainstream media nor the leadership of the GOP ever thought that Trump could actually win. Republicans and Democrats alike said time and again that Trump could not win . More than that, though, it appears that even many in the leadership of the GOP did not want Trump to win. As The New American ’s William F. Jasper wrote in August: Hedge fund billionaires, Wall Street mega-bankers, Hollywood movie moguls, RINOs (Republicans In Name Only), ultra-Left “Progressive” Democrats, and Big Media journalistas have all ganged up on one man. Together with an AstroTurf army of neocon pundits, radical academics, student activists, and street agitators funded by the Big Foundations and Big Government, they have united to stop that one man: Donald J. Trump. George Soros, David Rockefeller, Bill Gates, Warren Buffett, Michael Bloomberg, Steven Spielberg, Jeff Bezos, and a bevy of other uber-rich titans have teamed up with National Review , the Weekly Standard , the New York Times , the Washington Post , CNN, MSNBC, CBS, ABC, NPR, et al., to ensure that “The Donald” never makes it into the White House. Some of these plutocrats — Soros, Buffett, and Spielberg — have taken the full “I’m With Her” Hillary Rodham Clinton loyalty pledge. Many of the anti-Trump “Republican” and “conservative” poseurs, on the other hand, have not formally taken the Hillary plunge, but their implacable “Never Trump” stance amounts to the same thing. \\nOf course, there were many who could have been classified as being firmly in the “Never Trump” camp who were there for reasons of principle, wanting to send a message of no compromise by voting for a third-party candidate with a stronger understanding of constitutional issues. Considering the strong showing of third-party votes Tuesday night, it appears that while many did reject Trump, many more rejected Clinton. The third-party vote did not prevent a Trump victory, but there is little doubt that had Clinton secured more of the votes that went to Johnson (who — on issues such as abortion, the environment, and guns — is not very far removed from Clinton) and other third-party candidates, she could have closed the gap to a large degree. In the end, those who pulled the lever for Trump (whether in outright support of the man and his policies or as a “protest vote” against Clinton and her policies) carried the day. \\nFrom the beginning, Trump maintained a lead in both the popular vote (ranging anywhere from 750,000 to almost 2,000,000 throughout the night) and the electoral vote. (As of this writing, the count shows that Clinton did eventually edge out Trump for the popular vote, but only by a couple hundred thousand votes.) Even as that was happening, the mainstream media was in denial. The New York Times was still predicting an 85-percent chance of a Clinton win at least as late as 10:20 p.m., even as Trump was already leading by a growing margin. \\nBy 1:30 a.m. Wednesday, the Times was predicting a 95-percent chance of a Trump victory. But even at that, the graph shown on the Times website shows that by 10:20 p.m. — while still claiming an 85-percent chance of a Clinton win, the Times had already faced the music and realized that the candidates stood an even chance of winning. \\nOf course, by 1:30 a.m., it was all over except the crying, and a Trump victory was a foregone conclusion. But how — and why — did Trump win? \\nThere are a number of factors that came into play. The first (as pointed out above) is that the American people are simply tired of the status quo and are ready and willing to make choices (for good or bad) that they would never have previously made. The second is that Hillary Clinton’s campaign — dogged by one scandal and legal battle after another, from beginning to end — can be said to have died of exposure. That exposure came from a variety of sources, including WikiLeaks, Judicial Watch, and others. Even having twice dodged indictment at the hands of the authorities for her crimes, she was denied the White House by the people who voted. The “ rigged system ” of which Trump spoke may have given her a pass; the people did not. The “ Shadow Government ” may have protected her — at least so far — from the consequences of her actions, but it could not get her elected. \\nThe biggest factor, though, is that — while often sounding a bit like a caricature of a patriot — Trump said many things that resonated with Americans who have lived under eight years of Obama’s policies. While many have said that they are not sure Trump will do what he has said he will do, they were sure that Clinton would do what she said she would do. Given the choice between a man they may not be able to trust while he promises to “Make America Great Again” and a woman they are certain is telling the truth when she says she is going to sell America out all over again, the choice — for many — was clear. \\nOf course, it now becomes the responsibility of those people to hold Trump to his word. Republicans now control the White House, the House of Representatives, and the Senate. Trump will nominate Supreme Court justices who could tip the balance of the court. If that happens, Trump could enjoy the same balance of power enjoyed by George W. Bush for the middle four years of his presidency. Bush failed to use that power to reduce the debt (in fact, he grew the debt), to shrink the size and scope of the federal government (again, he expanded the federal government — especially the surveillance state), or to end or even reduce the scourge of abortion (he did nothing), though he ran on a platform including all of these issues and more. \\nTrump has some big promises to keep. He has promised — among other things — to reduce the size and scope of government, to pay off the debt, to reduce our dependency on foreign oil, to kill so-called free trade agreements that threaten both our sovereignty and economic stability, to overturn Roe v. Wade , and to launch an investigation into Clinton’s crimes and put her “in jail.” \\nTrump has also promoted some ideas that are very unlikely to “Make America Great Again.” In February, as the FBI v. Apple case was brewing, he called for a boycott of Apple unless the company would undermine the encryption of the iOS platform used by millions to protect their personal data . Last November, he said that if elected he \"would absolutely bring back interrogation and strong interrogation,\" including waterboarding , ignoring (or perhaps being ignorant of) the fact that torture is both immoral and ineffective . What the American people do not need is another surveillance hawk and torturer in the White House. Those ideas were rejected by reasonable Americans the last time we had a Republican president. Trump needs to reject them, as well. \\nIf Trump — who rode to victory on a populist wave — will abide by the Constitution and surround himself with advisors who do the same, while maintaining a strong moral compass and abiding the moral will of the people who elected him, he may yet prove the “Never Trump” camp wrong. If he does not, he will prove them right. \\nEither way, President Trump has to prove that the anti-establishment candidate will be an anti-establishment president. And it is up to the American people to hold him to that. Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742561951.9337933}