{"duration": 0.05754256248474121, "input_args": {"text": "'The Chicago   editorial board is now asking that every college and university in the state be transformed into ‘sanctuary campuses’ for shielding illegal immigrants from federal law. [In a piece, “Make colleges a sanctuary from deportation threat,” asks that every college and university in Illinois risk losing federal funding for the cause:  Universities have an obligation to stand up for their students  —   all of them. Almost all of these young people on college campuses who fear deportation were brought to this country as babies or small children. They are Americans in every way except for that official citizenship paper. They are the   Dreamers. This is their home, the only one they have ever known. To our thinking, all Illinois universities and colleges, public and private, should declare themselves places of sanctuary, just as cities such as Chicago and New York and counties such as Cook have done. They would send a signal to Trump, who campaigned on an indiscriminate promise to get tough on undocumented immigrants, that Americans are better than that  —   at least when it comes to Dreamers. The Times cited “  on immigration” who have been   Donald Trump’s leading advisors on the issue  —   Sen. Jeff Sessions ( ) Kansas Secretary of State Kris Kobach, and former Breitbart Executive Chairman Steve Bannon  —   that could become a detriment to individuals living in the country illegally. The Times’ editors also go on to make a   accusation against the forthcoming Trump administration, claiming that international students are also under threat: And it’s not just undocumented immigrants who are afraid. International students from the Middle East worry Trump’s administration will make it more difficult for them to continue studying in the U. S. They, too, want to know universities’ administrations will advocate for them. Schools should spell out policies and protections, stating them clearly to students, campus police, faculty and staff. It’s not asking too much. Trump’s longtime solution for the illegal immigration issue has been to deport criminal illegal aliens first, then focus on enforcing   so that remaining migrants must return through the country’s naturalization process. The Times thinks otherwise, requesting that illegal immigrants be allowed to not only stay in the country, but they should be given ‘sanctuary’ on every university campus in the state: Whether or not administrators label a university a “sanctuary” campus is not the central issue here. The word is largely symbolic. The American Council on Education points out that it has no clear meaning. Policy is what counts. “Sanctuary” has become an incendiary term that riles some conservatives. Sanctuary cities and counties across America have incurred the wrath of Republicans in Congress. Part of Trump’s   action plan is to eliminate all federal funding to sanctuary cities. Chicago Mayor Rahm Emanuel has vowed that Chicago will continue to be a sanctuary city despite Trump’s promise. Other cities also are refusing to back down. Universities and colleges implementing sanctuary campus policies do so at the risk of being stripped of federal funds once Trump’s administration takes control of the matter. Most recently, students at Southern Illinois University (SIU) have demanded that all illegal immigrants residing in the region be given “sanctuary” status on the campus, as Breitbart Texas reported. Students with the Graduate and Professional Student Council and the Undergraduate Student Government are demanding that university officials “begin immediately” crafting a campus policy that would offer comprehensive sanctuary to the Illinois illegal immigrant population from federal immigration laws. John Binder is a contributor for Breitbart Texas. Follow him on Twitter at @JxhnBinder.'"}, "time": 1742562001.4767194}