{"duration": 0.1579427719116211, "input_args": {"text": "'CASETTA, Italy  —   Romano Camassi, a seismologist, picked up a   speck as he surveyed the damage from this week’s earthquake on the green mountain crest where the village of Casetta, now ruins, once perched. “This is just ground, soil,” he said, sadly. “In so many buildings in this area, that was the material used to keep together the irregular stones found in the surroundings which people used to build their homes. ” Experts like Mr. Camassi, who was part of the first team from Italy’s Institute of Geophysics and Volcanology to arrive at the quake zone in central Italy, say the destruction was amplified by vulnerable buildings whose upgrades to   codes were deemed too costly for many Italians to carry out, too complicated to finance and too cumbersome to get approved. Italy is beloved for its rich architectural history. But that beauty comes at a steep price: both the lives lost when nature reminds its borrowers who is boss, and the money required in the attempt to even the scales. The country has spent an average of 3. 5 billion euros a year, or $3. 9 billion, for the past 50 years to fix earthquake damage, according to the Italian Association of Builders. And, in the aftermath of Wednesday’s quake, Prime Minister Matteo Renzi announced yet another plan to rebuild and buttress Italy’s ancient infrastructure. Many experts maintain that Italy has among the world’s best   standards already  —   at least on paper. But the problems in executing them are legion: money, corruption, tangled bureaucracy, shoddy construction and a lack of enforcement of national regulations at the local level. This quake, like many in the past, already seems likely to expose corners that were cut, contributing to the 280 or more deaths in about 80 villages in the area along the Apennines, Italy’s fragile spinal cord, where the 6.  quake struck. Prosecutors quickly announced an investigation into why a school in Amatrice, the town of about 2, 600 where the most deaths occurred, and the bell tower in nearby Accumoli collapsed. The bell tower, which had recently been refurbished, killed an entire family when it fell. The school, built in the 1930s and renovated in 2012, was supposedly built to new   standards. “You can have the best rules, but if the weak link is the human factor then it’s all over,” said Gianpaolo Rosati, a professor of structural engineering at the Polytechnic University of Milan. “Unfortunately, we find ourselves always protesting about the same things. ” Perhaps the most central, and inescapable, problem is that Italy is old. About 60 percent of its buildings are estimated to be more than 100 years old. That means that most of the country’s architectural heritage was built before any of the modern   standards were instituted. “You can’t ask that an ancient structure adhere to norms designed for modern structures, but you can try to improve them, that’s the path to take with the objective to save human lives,” said Donatella Guzzoni, an engineer and an expert in the preservation of historic buildings. “Italy has the best technologies to do this,” she added. “But it does come down to money. ” Casetta, a hamlet of about two dozen homes, sat on the hill north of Amatrice on the east side of the Tronto River that cuts this valley between two mountain chains. The area was among the most devastated by the quake for a combination of historical, economic and cultural reasons, Mr. Camassi said. “In many cases, they used rounded river stones, put next to one another by someone who ignored even the most ancient best construction practices,” he said. He pointed to a long cement beam hanging perilously from the debris of a   house. “When residents decided to reinforce the buildings, they often substituted the light wooden roofs with cement beams and bricks like that, which only worsened the impact of the quake because they burdened the otherwise frail structure,” he said. Mr. Camassi and other experts pointed out that certifying an existing building to   standards was difficult and often too expensive for most people. Just having a technical expert determine a building’s vulnerability has a price, Mr. Rosati said, estimating it would cost around 10, 000 euros to evaluate a small house. “The cost of reinforcing a building to meet   standards can be around 300 euro per square meter, which means the owner of a largish apartment faces a cost of some 300, 000 euro,” he said, sometimes more than the apartment is worth. And it is not enough for just one homeowner to want to sleep a little easier. “The entire apartment building has to agree to do the same,” he added, and if the palazzos or apartment buildings are connected, the whole neighborhood must agree. Villages like Amatrice and Accumoli are loved for the charm of their narrow streets and spaces, where houses were built cheek to cheek over the centuries to use prime land, often atop narrow peaks. In those tightly packed places, the entire block must be reinforced or the buildings “interact” in an earthquake and can topple like dominoes, Mr. Rosati said. That is precisely the dynamic Mr. Camassi found in Casetta. “Neighbors built in different periods, different buildings with different materials, but adjacent,” he said. “So even those that would have resisted the quake were damaged or even taken down by the others. ” Farther up the mountain is Cossito, an idyllic village of little houses with red geraniums on the terraces. One narrow street divides a recently restored building from the town square, where almost all homes collapsed, killing at least three people. The village had only four families, Mr. Camassi said, and they all lost a member or a close friend. “We thought we did all we needed, but now we simply need to erase this house,” said Roberto Paganelli, a former police officer in the Carabinieri, who was retrieving items from his    mother’s home. The building dates to 1864, he said, and was reinforced in the 1960s. The costs of evaluating and retrofitting old structures are prohibitive for many in this corner of Italy, an easy drive from Rome. Many of these homes were used only in the summer and were not primary residences worth a huge investment. In many cases, the residents are old, living on a pension and barely getting by. The state cannot oblige homeowners to upgrade their buildings unless there are obvious reasons to intervene. “We have    norms, but they only apply to new buildings or important restorations,” said Luca Ferrari, the president of Italy’s Association of Seismic Engineers. “For the vast majority of buildings, we don’t have an   classification, so no one knows whether they are dangerous or not during a quake. ” With a   group of experts, Mr. Ferrari drafted guidelines to classify buildings, with parameters similar to the energy efficiency of a building. This work finished in April 2015, but the government campaign  —   and its fiscal incentives  —   to reinforce existing buildings were still lacking, he said. “This area is at very high seismic danger, and we know that in these small towns of the Apennine Mountains, there are vulnerable buildings,” said Filippo Bernardini, a geologist who worked on Mr. Camassi’s team. “Unless we build better, we offer no hope for the future. ” The alternative  —   razing ancient buildings to construct modern,    palazzos  —   is hardly an option. “In other countries there is greater renewal of the architectural patrimony. They don’t think much about knocking something down to rebuild to different standards,” said Sergio Lagomarsino, an engineering professor at the University of Genoa. But, as Mr. Lagomarsino pointed out, Italy has a more conservative approach and is aware that preserving its heritage has value for the country. “In the face of an important building you can’t demolish a historic center and rebuild it with fake stones,” he said. “It would ‘denaturalize’ Italy. ”'"}, "time": 1742561957.0709696}