{"duration": 0.05274152755737305, "input_args": {"text": "'November 21, 2016 - Fort Russ News - \\n- Ronald ZONCA , in Boulevard Voltaire, translated by Tom Winter -   \\n\\nIt has to be said: the International Criminal Court is just another means of repression and oppression of sovereign peoples. \\nRussia has just signified its withdrawal from the International Criminal Court (ICC) in view of its inefficiency and its partiality in choosing what to investigate. A reading of the \"Report on Preliminary Examination Activities in 2016\" proves that it\\'s a matter of justice by fiat. \\n\\nThe case of Ukraine is particularly revealing. This country is not a signatory to the Rome Statute and therefore does not recognize the ICC. But it intervenes on complaints filed by the current government, even though the current government came out of a coup d\\'etat. \\n\\nThe investigations concern only the snipers of the Maïdan, the Donbass, and the Crimea. There were no investigations into the Odessa fire, where 50 people were burnt alive, nor on the cut-off of water and electricity in the Crimea, which could be described as a crime against humanity. \\n\\nThe case of Ukraine\\'s winter power cut deserves our attention. \\n\\nThis has done serious injury to the inhabitants of Crimea because it means an end to water distribution, the pumps being inoperative, and to heating, as the boilers can not function. Responsibility for this cut is claimed by Tatar activists. The leaders of these activists are not only not prosecuted but are heard on allegations of abuse of the Crimean Tatars. \\n\\nLet us recall that Crimean Tatars also live in the Crimea and have suffered the consequences of cuts in electricity and water. \\n\\nAmong the few convictions, the Milošević case is exemplary. He is a man who suffered eleven years of pre-trial detention, died in suspicious prison conditions, and who has just been cleared this year by the same court that sentenced him. \\n\\nThough the ICC aspires to world jurisdiction, given that major states such as China, India, and Russia are not or are no longer signatories to the Rome Statute that founded the ICC, the legitimacy of this body is therefore only Western. African states such as South Africa, Guinea and Burundi have left the institution, tired of seeing Africa hosting all the ICC field offices. The New York office acts in a liaison role, not to say a directory, nor an investigative role. \\n\\nThe ICC, the UN, the IMF and other institutions of coercion fulfill their missions. These institutions were created by the US, for the US, and they support them in their attempt to dominate the world. \\n\\nThe peoples are no longer able to turn away from the values of humanism, justice, the right to self-determination, and they see multipolarity as a prerequisite for existence and independence. A free world is first and foremost a multipolar world. \\n\\nThe United States is a great nation. Paraphrasing Churchill, we can say that i f other nations are ready to learn from this great and respectable people, they do not intend to be taught every day. \\n\\nAfter 14 years of operation, it is clear that the ICC is just one more organ for the repression and oppression of sovereign peoples. \\n\\n\\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742628386.7209368}