{"duration": 0.09973406791687012, "input_args": {"text": "\"Native American Project Urges Political Involvement, Representation Beyond Standing Rock Posted on Oct 26, 2016 ( Vox Efx / CC 2.0 ) \\nFighting back against decades of exclusion from the voting process and underrepresentation in government, Native Americans across the United States are struggling to have their voices heard beyond the Dakota Access pipeline protest—within local, state and federal elections. \\nAccording to a report released Tuesday by Advance Native Political Leadership (ANPL), Native Americans suffer from injustice in voting rights, intimidation tactics, unequal access to polls and “gross underrepresentation … at every level of government,” which prevent people from “[seeing] themselves in these elections.” \\nBut, the report argues, Native American representation in elected offices is necessary to secure a democracy that reflects the increasingly diverse American population. \\n“If we want to see race equity in the United States, we can’t get there without Native Americans being represented in political office,” the report’s lead author, Chrissie Castro, director of the ANPL and a citizen of the Navajo Nation, told Truthdig. “The issues and concerns that Native Americans have are what everyone cares about. … We say that we want more Native American elected officials in political office because this is about everyone—this inclusive picture of democracy is about all of us.” \\nAdvertisement Square, Site wide \\nOf 41,000 elected officials in the United States, 90 percent are white and 0.03 percent are Native American, the lowest percentage of any minority group, according to the Reflective Democracy Campaign , a project of the Women Donors Network . Native Americans have held few positions on the federal level—“one vice president, eight House representatives and two Senators,” according to the report. \\n“We’re the first ones here, and we’re the last ones to have the opportunity to vote,” Brian Cladoosby, president of the National Congress of American Indians, said of Native American communities. Native Americans across the country face barriers that systematically prevent them from voting , such as out-of-the-way polling booths, mail-in ballots sent only to those who have mailing addresses, refusal of state citizenship and bans from voting in state elections in states such as Arizona and New Mexico, which have significant Native populations. \\n“We were the first peoples of this country, and yet we are not part of the governance of this country, and we think that’s a real miss,” Castro said. “In order for us to get ourselves into elected office, we need people to elect us. What we’ve seen time and time again is that there are structural barriers that really dilute the Native vote or make it very difficult [to get] into elected office.” \\n“We are having to deal with a colonial legacy that was intended to exclude us,” Chase Iron Eyes of the Standing Rock Sioux Tribe, who is running for the House of Representatives in North Dakota, told BBC News . \\nSome Native American communities don’t see themselves as a significant part of the electorate. But while they make up less than 2 percent of the total U.S. population, they can make a difference in an election. \\n“We are really working to change our cultural norms around our relationship with voting. … We’re doing the hard work of culture shift to say that it is important that we participate,” Castro said. “The Native vote does matter.” \\nThe Native vote has made a difference, the report says, in swing or battleground states with significant Native American populations that overwhelmingly lean Democratic. In 2012, Colorlines reports, Democratic candidates’ victories in some of the tightest Senate races in New Mexico, Montana and North Dakota are attributed to the Native vote . \\nPresidential hopefuls Dr. Jill Stein and Sen. Bernie Sanders understood the power of the Native vote, Castro said. Sanders brought on a Native American adviser, Tara Houska, and Stein joined the Standing Rock Sioux tribe’s protests . During the primaries, Secretary Clinton met with tribal leaders in Iowa, Washington, Arizona and California, according to BBC News. \\nAccording to the report, the Democratic Party has a formal infrastructure that is inclusive of Native Americans, including several Democratic Native American caucuses on the West Coast and a national director of Native American outreach. However, various Republican representatives told Castro that there is no comparable infrastructure in the GOP. \\nThe Dakota Access pipeline protest has helped bring Native American issues to the forefront, Castro said. \\n“I think the Dakota Access pipeline has really galvanized the Native American community across the country and even internationally,” she said. “At Standing Rock, there’s been a lot of work to do canvassing and [engaging] voters as part of a strategy to make sure people that are in elected office understand the issues and the experiences of Native American people.” \\nThough the numbers this year are promising, with a record of eight Native American candidates running for Congress and more than 90 running for state legislatures, there needs to be “pathways” in place for future Native American politicians to make their way on to the ballot, the report argues. One way Native politicians can have equal access to government offices is for accurate data on Native Americans to be available so they could use the information to design voter turnout strategies. Currently, in California, there is data on numerous minority groups, but not Native American voters. \\nThere has been some recent success in bringing out the Native vote. Since its launch three months ago, Native Vote has registered 1,000 Native American voters in California, Castro said, calling this a necessary and robust Native American voter engagement campaign. Your #NativeVote makes a difference, and together, Indian Country's voices count! #RestoreTheVRA — Native Vote (@nativevote) Oct. 20, 2016 \\nIn 2017, ANPL will launch pilot projects in Montana and New Mexico that will “build a pathway for Native American elected officials” by teaching children the importance of civic engagement and providing training for potential campaign managers and team members. Portland and Los Angeles will also host pilot projects on a local level, since more than 70 percent of Native Americans live away from reservations, in cities and suburbs. \\n“We thought it was important to start looking at municipal races, to look at school boards, water boards, looking at city planning commissions, and really building infrastructure in municipals for elected and appointed positions to make sure our voices are heard at the local level,” Castro said. \\n“I think as Native Americans we are taking our rightful place as part of the fabric of leadership in this country. I think that we’re going to see good things if we’re able to see a more reflective democracy that’s inclusive of Native American peoples [and] of all of the diversity that exists in this country that we don’t see in these positions of power and decision-making.” \\nCastro is hopeful that Sen. Jon Tester’s (D-MT) proposed bill, the 2015 Native American Voting Rights Act , will pass next year and “right the wrongs” to protect Native American access to the polls. \\n“We have a lot of work to do to make sure that people see themselves in these elections,” she said. TAGS:\""}, "time": 1742628373.5062268}