{"duration": 0.09301567077636719, "input_args": {"text": "'Pinterest \\nGentleman, do you like it? Are you considering putting a ring on it? Well, I think I’ve found a jeweler you may want to consider for your darling’s bling-bling. \\nA jeweler in Lubbock, Texas is offering a free firearm with the purchase of a ring. That’s right, if you get married, you can get some protection as well! (Pun intended). \\nEverythingLubbock.com reported on this awesome offer: \\nThacker Jewelry is hosting their annual Shotgun Wedding Sale next week where customers who buy a ring will get a gun for free. \\n“We started this tradition I believe it was, it’ll be three years now,” Thacker Jewelry Owner Joe Thacker Said. “The idea, of course, is the word play and the old shotgun wedding. Not going back to the negative connotation playing off of that and it’s been a lot of fun. We had a lot of people participate and this year we’ve even gotten into it more,” \\nThacker said the entire store will be on sale, with engagement rings on special. Anyone who purchases a ring will also get a gift certificate for a shotgun or a rifle with LSG Tactical. \\n“Any time any of their customers go over there and purchase something that meets their qualifications, they get a gift certificate for either a Remington 870 shotgun or a savage bolt action rifle,” LSG Tactical Steve Burns said. \\nFor Texas, this does not come as any big surprise. Texans love their guns. \\n“It’s something that’s very natural for most Texans,” Burns said. “Most guys grew up hunting or at least exposed to hunting if not by their family, but by their friends, or social groups. So it’s something that’s pretty natural for all of us.” \\n“Farming, hunting, ranching its all intertwined,” Thacker said. “So it’s just a natural fit for Texas.” \\nWhile the free gun may be the most enticing aspect of a ring purchase for a lot of men, make sure you teach your to-be finance how to shoot as well! The ladies especially need to know how to use that gun, arguably more than we do. \\nSince men are typically stronger physically than women (sorry feminists, I didn’t create the human anatomy), we might be able to fend off an attacker if we don’t have a gun on us (though you should!). \\nBut our ladies may have a more difficult time of it, since they have smaller frames and typically less muscle mass. What better way to even the playing field with thugs than to teach her how to shoot? \\nA ring and a gun, that’s a deal that’s hard to beat, in my mind! So what are you waiting for, gentlemen?'"}, "time": 1742563811.6035874}