{"duration": 0.04850268363952637, "input_args": {"text": "'posted by Eddie Recently, a New York VA hospital denied a 76-year-old veteran of the United States Navy health care when he needed it most. He was in so much pain, he committed suicide in the parking lot after they threw him out because he knew that the system had failed him. He sat in his car and ended his life. Now the hospital is denying that he even showed up… After serving in the Navy from 1958 to 1962, Peter A. Kaisen shot and killed himself in the parking lot outside the Northport Veterans Affairs Medical Center on August 21. His reason? The hospital had allegedly denied him care even though he was a recurring patient who always paid his bills on time. Now his family and friends are outraged that the VA failed their beloved Peter. They pray that his death could help make the system better. Scroll down to learn more about how the VA failed this man… “He went there for help with depression,” Thomas Farley, a friend of Kaisen’s for 40 years, told Fox News. “That was his last hope, and he didn’t get any help.” After Kaisen served in the Navy, he joined the police force as an officer in the Long Beach Police Department. But in the 1960s, he got involved in a car crash. Injuries from the accident left him permanently disabled. And for the rest of his life he required constant medication and care. Sources told The New York Times that Kaisen was upset with the VA hospital. They had not allowed him to see an emergency room physician for a mental health condition – so he ended his life. “He went to the E.R. and was denied service,” one person who currently works at the hospital, told the paper. “And then he went to his car and shot himself.” “Someone dropped the ball,” the source said. “They should not have turned him away.” Kaisen’s family prays that his death will make VA services better. “Maybe he can be used as an example to make things better,” Farley, speaking on behalf of the family, said. “Maybe we can save someone else’s life.” “That way, he would not have died in vain,” he said. Meanwhile, the VA hospital denies that Kaisen came to their hospital before killing himself. Over the last two years, reports about issues with VA hospitals have surfaced. These included rejected medical claims, delays in treatments, numerous deaths of veterans when treatment is delayed, and fraudulent bookkeeping to hide the VA’s shortcomings so the executive can still qualify for their bonuses. A recent investigation by Republican Senator Tom Coburn of Oklahoma found that more than 1,000 veterans over the last decade have died while waiting for medical treatment. Farley, Kaisen’s long-time friend, is heartbroken by the man’s suicide. “I’m a Vietnam vet — disabled from Agent Orange — and he was always looking out for me. He was such a faithful guy,” he said. “He was such a big advocate for veterans and that’s what makes it’s so sad.” Do you think the VA needs to offer better services to veterans? Source:'"}, "time": 1742562225.1369615}