{"duration": 0.12284684181213379, "input_args": {"text": "'WASHINGTON  —     Donald J. Trump has selected Scott Pruitt, the Oklahoma attorney general and a close ally of the fossil fuel industry, to run the Environmental Protection Agency, signaling Mr. Trump’s determination to dismantle President Obama’s efforts to counter climate change  —   and much of the E. P. A. itself. Mr. Pruitt, a Republican, has been a key architect of the legal battle against Mr. Obama’s climate change policies, actions that fit with the  ’s comments during the campaign. Mr. Trump has criticized the established science of   global warming as a hoax, vowed to “cancel” the Paris accord committing nearly every nation to taking action to fight climate change, and attacked Mr. Obama’s signature global warming policy, the Clean Power Plan, as a “war on coal. ” Mr. Pruitt has been in lock step with those views. “Scientists continue to disagree about the degree and extent of global warming and its connection to the actions of mankind,” he wrote in  National Review earlier this year. “That debate should be encouraged  —   in classrooms, public forums, and the halls of Congress. It should not be silenced with threats of prosecution. Dissent is not a crime. ” A meeting on Monday between the   and former Vice President Al Gore may have given environmental activists a glimmer of hope that Mr. Trump was moderating his campaign stance. Mr. Trump told New York Times editors and reporters that he does “think there is some connectivity” between human activity and a warming planet. With the choice of Mr. Pruitt, that hope will have faded. “During the campaign, Mr. Trump regularly threatened to dismantle the E. P. A. and roll back many of the gains made to reduce Americans’ exposures to industrial pollution, and with Pruitt, the   would make good on those threats,” said Ken Cook, head of the Environmental Working Group, a Washington research and advocacy organization. “It’s a safe assumption that Pruitt could be the most hostile E. P. A. administrator toward clean air and safe drinking water in history,” he added. Mr. Pruitt, 48, is a hero to conservative activists, one of a group of Republican attorneys general who formed an alliance with some of the nation’s top energy producers to push back against the Obama regulatory agenda. Fossil fuel interests greeted Mr. Trump’s selection with elation. “Attorney General Scott Pruitt has long been a defender of states’ rights and a vocal opponent of the current administration’s overreaching E. P. A. ,” said Laura Sheehan, a spokeswoman for the American Coalition for Clean Coal Electricity, which works on behalf of the coal industry. “Mr. Pruitt will be a significant voice of reason when it comes to energy and environmental regulations. ” At the heart of Mr. Obama’s efforts to tackle climate change are a collection of E. P. A. regulations aimed at forcing power plants to significantly reduce their emissions of   carbon dioxide pollution. Mr. Trump cannot unilaterally cancel the rules, which were released under the 1970 Clean Air Act. But a legally experienced E. P. A. chief could substantially weaken, delay or slowly take them apart. Beyond climate change, the E. P. A. itself may be endangered. Mr. Trump campaigned on a pledge to greatly shrink  —   or even dismantle  —   it. “We are going to get rid of it in almost every form,” he once pledged. Mr. Pruitt may be the right man to do that. As attorney general, Mr. Pruitt created a “federalism unit” in his office, explicitly designed to fight President Obama’s health care law and environmental regulations. “You could see from him an increasing effort to delegate environmental regulations away from the federal government and towards the states,” said Ronald Keith Gaddie, a professor of political science at the University of Oklahoma. Although Mr. Obama’s climate rules were not completed until 2015, Mr. Pruitt and a handful of other attorneys general began planning as early as 2014 for a coordinated legal effort to fight them. That resulted in a   lawsuit against the administration’s rules. A decision on the case is pending in a federal court, but it is widely expected to advance to the Supreme Court. As Mr. Pruitt has sought to use legal tools to fight environmental regulations on the oil and gas companies that are a major part of his state’s economy, he has also worked with those companies. A 2014 investigation by The Times found that energy lobbyists drafted letters for Mr. Pruitt to send, on state stationery, to the E. P. A. the Interior Department, the Office of Management and Budget and even President Obama, outlining the economic hardship of the environmental rules. The close ties have paid off for Mr. Pruitt politically: Harold G. Hamm, the chief executive of Continental Energy, an Oklahoma oil and gas company, was a   of Mr. Pruitt’s 2013   campaign. Mr. Pruitt, who grew up in Kentucky, moved to Oklahoma to go to law school. An avid baseball fan, for eight years he   and managed the Oklahoma City Redhawks, a minor league team. He won a seat in the Oklahoma Legislature and opened a small legal office, which he called Christian Legal Services, to challenge government actions that he saw as compromising individual rights. As he ran for attorney general of Oklahoma in 2010, he made clear that he intended to use his power as the state’s top law enforcement official to attempt to force the E. P. A. to back down, convinced that it was wrongly stepping on state government powers. “There’s a mentality emanating from Washington today that says, ‘We know best.’ It’s a     strategy, a    kind of approach, and we’ve got to make sure we know how to respond to that,” Mr. Pruitt was quoted as saying during his election campaign in 2010. But that campaign, once Mr. Pruitt was sworn in, quickly became an opportunity to work secretly with some of the largest oil and gas companies, and the state’s   electric utility, to try to overturn a large part of the Obama administration’s regulations on air emissions, water pollution and endangered animals, documents obtained by The Times show. As attorney general, Mr. Pruitt took the unusual step of jointly filing an antiregulatory lawsuit with industry players, such as Oklahoma Gas and Electric, the   electric utility, and the Domestic Energy Producers Alliance, a nonprofit group backed by major oil and gas executives, including Mr. Hamm. Behind the scenes, he was taking campaign contributions from many of the industry players on his team, or helping deliver even larger sums of money to the Republican Attorneys General Association, which he became the chairman of. Mr. Pruitt’s office also began to send letters to federal regulators  —   including the E. P. A. and even President Obama  —   that documents obtained through open records requests show were written by energy industry lobbyists from companies including Devon Energy. Mr. Pruitt’s staff put these ghostwritten letters on state government stationery and then sent them to Washington, moves that the companies often then praised in their own news releases, without noting that they had actually drafted the letters in the first place. Mr. Pruitt understood that he was being painted as a tool of industry, but in interviews and his own writing, he rejected that analysis, saying that he at times formed alliances with private sector players that shared his views  —   and was determined to help the energy industry and individual citizens in his home state. “It is the job of the attorney general to defend the interests and   of the citizens and state of Oklahoma,” Mr. Pruitt’s office said in a statement in 2014 to The Times. “This includes protecting Oklahoma’s economy from the perilous effects of federal overreach by agencies like the E. P. A. The energy sector is a major driver of the Oklahoma economy. ” Mr. Pruitt repeatedly explained that he thought states themselves were in the best position to regulate local industries, be it oil and gas companies, or other players that might affect the local environment, such as Devon Energy, which has been a contributor to his political causes, and which he has helped push back against federal regulations. With so much at stake, Mr. Pruitt’s confirmation hearings promise to be heated. “At a time when climate change is the great environmental threat to the entire planet, it is sad and dangerous that Mr. Trump has nominated Scott Pruitt to lead the E. P. A. ,” said Senator Bernie Sanders, independent of Vermont, who sits on the committee that must confirm him. “The American people must demand leaders who are willing to transform our energy system away from fossil fuels. I will vigorously oppose this nomination. ”'"}, "time": 1742562565.1224623}