{"duration": 0.1377115249633789, "input_args": {"text": "'WASHINGTON  —   It was midafternoon on Saturday, and Larry Wilmore was doing a sound check in the empty International Ballroom of the Washington Hilton, where he was to be the featured comedian of that night’s annual White House Correspondents’ Association dinner. The ballroom, a forbiddingly cavernous space, can be a comedy slaughterhouse. Bombing there means hearing a sad symphony of the HVAC system and clinking silverware, or maybe seeing Henry Kissinger nodding off at Table 27. (I saw it happen during Rich Little’s set in 2007, in the middle of Mr. Little’s Nixon impersonation no less.) But the   gig can also give a topical comedian like Mr. Wilmore a chance to stitch his name into the   fabric of America, before an audience that includes the president and some 2, 700 powerful people in government, media, politics and show business. “Stephen’s was the bravest,” Mr. Wilmore told me as he looked out from the stage at the ballroom. He was referring to the seminal performance that Stephen Colbert gave in 2006. Playing his   Comedy Central character, an egotistic conservative talk show host, Mr. Colbert mockingly defended the Iraq war and the Washington press corps’ coverage of it. The act, typical of his show, wilted inside the hall. But it was a hit out in the world because it tapped the growing perception that a   relationship between journalists and government officials produced credulous reporting that helped start a war under false pretenses. It was the perfect pairing of a comedian and the moment. Mr. Wilmore, whose “Nightly Show” occupies Mr. Colbert’s old 11:30 time slot on Comedy Central, knew he was part of a similar pairing, “one of those accidents of timing,” he said. Yes, he was a leading black comedian performing at the last correspondents’ dinner for the nation’s first black president. But his appearance was also coming during a national conversation about race and law enforcement race and the news media  —   including at The New York Times  —   and race and economic injustice. Mr. Wilmore has branded this year’s political campaign “The  ” of the White House. And now here he was, getting ready to address an overwhelmingly white crowd of reporters  —   a sign of how far journalism has to go in achieving meaningful diversity  —   in the middle of a party weekend that can give official Washington the same sense of remove that the decadent capital city has in the “Hunger Games” movies. I asked him if there would be any “White House Correspondents’ Dinner So White” jokes. No, he said. He hinted at an inner tension between going for a big political statement and going for laughs. “That’s why I say Stephen did the bravest thing I’ve ever seen, you know?” he told me. “Because you want to go and have a good time, get laughs and have everybody say, ‘Yeah, you killed. ’” Before the dinner, Mr. Wilmore’s hotel suite was a show business version of a groom’s room before a wedding. Pacing around the living area were his manager his agent his publicist one of his writers, Robin Thede friends like Kenya Barris, who created the TV sitcom “ ” and his parents, Betty and Larry Wilmore. The whole group was to meet the president and first lady before heading into the hall. Mr. Wilmore was in his tuxedo  —   he is a necktie man, not a bow tie man  —   and staying quiet, getting into the zone. “I’ve always been proud of him,” Betty Wilmore told me as we all headed to the elevator. Mr. Wilmore seemed to cringe a little  —   as a son would  —   when she remembered showing up as the sole cheering section for his high school basketball team in California. “Why do I have to remember this?” Mr. Wilmore said. Mr. Wilmore said he was ready, but he and his producer had one fear: that President Obama, who would go first, would step on Mr. Wilmore’s act. That’s what he did to Seth Meyers at the 2011 dinner, by releasing his birth certificate that afternoon (“Thanks for the timing on that,” Mr. Meyers had said then, holding up pages of birth certificate jokes.) But Mr. Obama’s typically commanding performance on Saturday left Mr. Wilmore’s jokes more or less unscathed. And Mr. Wilmore came forward with a routine that gave his audience some uncomfortable moments that clearly came through on   (which is how I watched it because The New York Times stopped going to the dinner starting in 2008). Calling the dinner “Negro night,” Mr. Wilmore said Fox News would cover the speech from him and Mr. Obama as “Two thugs disrupt elegant dinner in D. C. ” He joked that MSNBC now stood for “Missing a Significant Number of Black Correspondents,” a reference to its cancellation of a show hosted by Melissa  . “Some of our finest black journalists are here tonight,” he said, and then added, “Don Lemon is here too,” a reference to the black journalist on CNN. (Mr. Lemon responded with a   salute.) His high notes included telling the president to butt out of comedy, seeing as how Mr. Wilmore doesn’t go around “signing executive orders, pardoning turkeys, not closing Guantánamo. ” But sometimes the crowd groaned or fell silent, prompting him at one point to say, “You guys are tough, man. ” But at the end he got serious, speaking about how proud he was that Mr. Obama had proved “a black man can lead the entire free world,” and ended by saying “Yo, Barry, you did it,” and referring to Mr. Obama with an affectionate twist on the  . They embraced. As Mr. Wilmore made his way through a light rain to the Vanity Fair and Bloomberg News   at the French ambassador’s residence  —   where Vice President Joseph R. Biden Jr. mingled with stars like the actresses Helen Mirren and Rachel McAdams  —   the reviews started trickling in. Brian Lowry’s synopsis on CNN Money carried the headline “Larry Wilmore gets groans and grimaces. ” “Wilmore Underwhelms,” The Hollywood Reporter reported. But then the counternarrative emerged, suggesting that his routine played better outside the bubble. A Daily Beast review likened his act to Mr. Colbert’s, and The Drudge Report gave him a screaming headline: “Comedian Eats the Press!” Leaning against a doorjamb at the party, Mr. Wilmore told me the whole experience was “surreal. ” The motto of his show is “Keep it 100,” as in keep it real, and, he said, “If I’m going to keep it 100, I gotta do the jokes. ” Reality can be in short supply every year during this weekend. The Correspondents’ Association deserves credit for having a comic like Mr. Wilmore at its dinner. And regardless of whether you liked Mr. Wilmore’s act, you can’t say he didn’t keep it 100. Bad things happen in Washington when people don’t.'"}, "time": 1742561883.228704}