{"duration": 0.14564061164855957, "input_args": {"text": "'LONDON  —   Importing Jesse Eisenberg’s “The Spoils” to this city was not exactly a  . Written by and starring Mr. Eisenberg, this lacerating comedy of humiliation  —   about a whiny, rich,   and terminally narcissistic young New Yorker who impulsively sabotages his own life and that of his Nepalese roommate  —   appeared destined to be lost in translation. Yet since opening in June at Trafalgar Studios, “The Spoils,” staged in New York by the New Group last year, has become the   production in that theater’s history. Scott Elliott, the show’s director and the New Group’s artistic director, now plans to help bring over more productions, starting with “Buried Child” with Ed Harris, seen earlier this year in New York. Part of the   success of “The Spoils” is a matter of star appeal: Mr. Eisenberg, an Oscar nominee for “The Social Network,” is in “Batman v Superman: Dawn of Justice” and portrays Woody Allen’s   in “Café Society. ” But celebrity doesn’t explain the hard laughter and, more surprising, the tears that “The Spoils” elicits. As the run neared its Aug. 13 end, Mr. Eisenberg and Mr. Elliott sat down in the theater’s lobby to discuss why their production has grown, changed and flourished on British soil. These are edited excerpts from the conversation. SCOTT ELLIOTT They told me early on, “We don’t want you to get your hopes up about audience reactions. ” The sarcasm and the humor in the show is so American. So I was worried thinking, “Oh, maybe they’re not going to get it. ” Shockingly, the response was completely opposite, from the first preview. I came to the conclusion that people just listen better here. There is an English tradition of   characters in comedy. JESSE EISENBERG That was my feeling. In terms of modern English entertainment, I really liked Ricky Gervais’s character in [the original British version of] “The Office,” and when Americans remade that show [with Steve Carrell] it was a lot lighter, and so I just assumed that my play would be O. K. here. Did you have to translate some of the cultural references for the new British cast members? ELLIOTT There’s a lot of bragging in the play. So it was interesting to teach them about that, and it took a while. EISENBERG I as a writer assume it’s totally   that when people brag, they do it with this kind of facade of humility to subtly apologize for what they’re saying. And Scott picked up right away that’s not how it’s done here. People don’t freely talk about their problems here, don’t freely brag. Maybe it’s like a tall poppy syndrome. Jesse, you do create unusually   characters, including the writer in your earlier work “The Revisionist” [in which he starred with Vanessa Redgrave in 2013]. EISENBERG I wish I could say he’s more   than I am. The way I see the world  —   this is probably so pretentious and    —   I don’t see why people aren’t reacting the way my character reacts to bad news. Which is he falls apart, he weeps and shouts, he screams at strangers. That’s how I think the world should always be, but of course it’s inappropriate to do that when you get a coffee and don’t have the right change. ELLIOTT I’ve come to the conclusion that our job is to make people feel something. I think what you do, especially in this environment, is to let people feel through you. EISENBERG Yes, I was being glib. I think that’s the real thing. I feel like out of every kind of performance I’m involved in, theater is still the best way to communicate a story to a group of people. I think there is so much value in putting myself through the very difficult experiences of the character eight times a week because I think it communicates  —   on a   the human condition, and on a     malaise,   the fear of immigrants usurping positions of power from hegemonic cultures like mine. Boy, did that turn out to be relevant this summer. EISENBERG Yes,   nationalist, nativist sentiment has been so present, and the play culminates with my character screaming at an immigrant to get the hell back home. But I think it’s important that we’re humanizing the bigot, that you realize that Ben is someone who’s   who’s struggling through his inaction, struggling though his own feeling that the world is passing him by. And if we can understand that that’s where it comes from, that it doesn’t come from some kind of   assessment of the damage that immigrants are doing to the country, then you realize that it’s something that can be overcome. Unlike most actors who write parts for themselves, you don’t seem to feel the need to make the audience like you. EISENBERG The way I think about it is, if I’m writing the part and I’m playing the part, I can make the part as distasteful on the page as possible, and then every other ounce of me will try to humanize it. If I wasn’t playing the part, I’d worry more about the character being likable. Do the laughs come in different places than they did in New York? EISENBERG Yeah, there’s two jokes that never get a laugh here. I make fun of Jews. And Michael Moore, who’s a friend of mine, saw the play last week, and he was like, “You realize everyone in the audience is cringing when you make that Jewish joke,” and I was like, “Oh, is that what they’re doing, because they’re certainly not laughing. ” And I realized two things: One is that there is a history of   that’s closer to the surface in Europe than it is in America  —   people are uncomfortable with hearing that stuff  —   and I think they don’t have Jewish stereotypes here to make fun of. The play is much more affecting here than it was New York, especially its ending. Was that song  —   Billy Joel’s “Summer Highland Falls,” played in the background  —   there before? ELLIOTT No, I changed the tone. I knew that in New York people were struggling with the ending. It was: “Am I supposed to cry? Am I supposed to hate him?” For me, there’s always this fear that redemption is going to be sentimental. But then I said to Jesse, “Look, you have written a redemptive ending, and we resisted going there in New York. But that’s what you wrote, and we have to embrace it. ” EISENBERG It’s not a play about this guy who’s mean and gets his comeuppance. It’s about this broken person, and if you’re not tracking that throughout the show, you’re not watching the show.'"}, "time": 1742563180.6416233}