{"duration": 0.031831979751586914, "input_args": {"text": "'Regnery Publishing has released the cover art for How Trump Won, the forthcoming book   by Breitbart News Senior    Joel Pollak and New York Times bestselling author and historian Larry Schweikart. [How Trump Won tells the thrilling story of Donald Trump’s improbable victory in the 2016 presidential election from two different perspectives.  Pollak relates the drama of the closing weeks of the campaign firsthand, as a reporter in the traveling press corps following Trump on his grueling   sprint to the finish. Schweikart narrates the broader history of the campaign, using unique data that a secret research group  —   the “Renegade Deplorables”  —   were feeding into the Trump campaign.  The book interlaces the two perspectives throughout, switching from the historian to the journalist and back again. There is also a tension between the outlook of the two authors: Schweikart expected Trump to win, while Pollak  —   until the last few days  —   did not, although both had predicted in 2015 that Trump would win the Republican Party’s presidential primary. How Trump Won will be published on Jan. 17  —   three days before Trump’s inauguration  —   as an   and will be released in print on Feb. 27. The cover art features Trump’s signature font above an image of a cheering crowd at one of his rallies, with fans holding signs such as “the silent majority stands with Trump. ” Both Pollak and Schweikart have other titles in the Regnery catalog. Pollak’s See No Evil: 19 Hard Truths the Left Can’t Handle was released last year, while Schweikart’s Politically Incorrect Guide to the Presidents, Part 1 will be released next week. Pollak also serves as editor of Breitbart California and   counsel at Breitbart News. Schweiker’s A Patriot’s History of the United States: From Columbus’s Great Discovery to the War on Terror,   with Michael Allen, was a #1 New York Times bestseller, and captured the interest of the nascent Tea Party movement, which would soon come to fruition at the end of George W. Bush’s presidency and the beginning of Barack Obama’s. How Trump Won similarly captures the mood of the populist insurgency that propelled Trump to power in one of the most unlikely, and most exciting, elections in the history of the United States. How Trump Won is available for   at Amazon, Barnes and Noble, and   .'"}, "time": 1742628490.3590274}