{"duration": 0.16101956367492676, "input_args": {"text": "\"[Photo: Syria is a hornet’s nest not a pinata. Credit: Daryl Cagle .] =By= John Feffer Editor's Note Was there an end game in mind when the U.S. decided to fuel a rural conflict rooted in almost five years of drought into a “civil war” and then an outright attempt at regime change? Was there a plan for the (effectively) mercenary force the U.S. created who after training found that ISIS paid much better, so the U.S. rebooked al Nusra and al Qaeda from terrorist groups to “moderate”“rebels. Of course there is the off shore oil and Israel’s interest in the territory and region. But who gave a thought for the people of Syria? They were all mostly “civilians,” just like in almost any country – until they were forced to pick a side or be shot. Where is the peace to be found if the goal is still to remove the recognized government (for better or worse) of Syria? Yet another blood red “color” revolution. T he war in Syria is a nightmare. It’s a nightmare for all the civilians who suffer from constant aerial bombardment, who are trapped without food and medical assistance inside crumbling cities, who experience the retribution of either the Islamic State or the regime in Damascus. It’s a nightmare for those who try to escape and face the prospect of death in transit or limbo in refugee camps. Syria is a nightmare for individuals, millions of them. But it’s not just that. If states could dream, then Syria would be their nightmare as well. Syria was once a sovereign state like any other. It had a central government and fixed boundaries. The Syrian state enjoyed a monopoly on violence and, on several occasions, deployed that violence against its citizenry to devastating effect. The economy functioned, more or less, with considerable revenue coming from the oil sector. In 2009, tourism accounted for 12 percent of the economy. Not that long ago and despite its many problems, Syria attracted a large number of eager travelers. In perhaps the most ironic twist, the Syrian state once had delusions of grandeur. It wanted to abolish the old colonial boundaries and unify the entire Arab world. Under Hafez al-Assad, its authoritarian ruler from 1970 until 2000, Syria attempted to absorb Lebanon, unite with Egypt and Libya in a short-lived Federation of Arab Republics, displace Iraq as the undisputed ideological leader in the region, and even take charge of the Palestinian cause.\\nHow quickly dreams can segue into nightmares. Syria has fallen in upon itself, fracturing into four distinct pieces. The government in Damascus controls a gerrymandered slice of territory around the capital and the coast. The Kurds have carved out an autonomous region along the Turkish border in the northeast. The Islamic State still claims a large expanse in the heart of the country. And various rebel factions have secured a patchwork of land in all four corners of what had once been a unified Syria. \\nThe government in Damascus, needless to say, no longer enjoys its monopoly on violence. It can’t control the borders of the country. The economy shrank by 19 percent in 2015 and will probably contract another 8 percent this year. Hundreds of thousands of Syrians have died in the current conflict. Out of a pre-war population of 23 million, nearly half have fled their homes—4.8 million leaving the country and 6.6 million displaced internally. The war, according to one estimate, has cost over $250 billion. \\nMuch like the Balkans before it, Syria is emerging as a metaphor for the fragmentation and chaos that the modern world barely contains. Many states are held together by little more than surface tension, like the meniscus of liquid that rises above the sides of a glass. Nationalism has reached a boiling point in many places, as has religious extremism. Armaments are everywhere, militias are proliferating, and violence has become pervasive. After scoring a number of impressive victories—in Northern Ireland, in East Timor, most recently in Colombia—international diplomats are stymied by the breakdown of order in places like Syria, Libya, Sudan, and Somalia. The countries jockeying for influence in Syria today face many of the same divisive forces that have torn apart that benighted country. The dream of these intervening powers: to turn the current war to their advantage. Their nightmare: that whatever is tearing apart Syria is contagious. The Illusion of Totalitarianism \\nThere is no such thing as a totalitarian state. Some dictators, of course, imagine that they can create just such a state, in which the government is a mere extension of the leader’s will and no significant opposition challenges this central authority. Such a society is a pyramid with one person at the top, every block serving to support that uppermost platform. Mere authoritarian societies tolerate potential rival sources of power, such as an intelligentsia or a business sector. In the ideal totalitarian system, all is for one and one is for all. \\nEven North Korea under the Kim dynasty—Kim Il Sung, Kim Jong Il, Kim Jong Eun—fails to achieve this kind of totalitarian control. True, the government has managed to suppress virtually every sign of political dissent, indigenous NGOs are practically non-existent, and all culture is subordinate to the state. However, private markets have sprung up beyond the state’s compete control (though, as a sign of grudging acceptance, the state taxes the sellers). Citizens watch contraband movies and listen to taboo music thanks to flash drives smuggled in from China. There have even been signs of disagreement at the highest levels of governance (or so the execution of Kim Jong Eun’s uncle Jang Song Thaek suggests). \\nOnce upon a time, the leader of Syria also hoped to create a totalitarian dynasty in the heart of the Middle East. Hafez al-Assad embraced a version of Baathism, the anti-colonial, nationalist, pan-Arabist, and nominally socialist hybrid that emerged from the ideological tumult of the 1940s. As in North Korea, Assad created a one-party state with an extensive secret police, the Mukhabarat. He ruthlessly eliminated opposition, as in 1982 when the state brutally suppressed an uprising by the Muslim Brotherhood. After a brief excursion into reform, the designated successor, Assad’s son Bashar, followed in his father’s footsteps. He attempted to extinguish the Arab Spring uprising just as his father had dealt with the Islamists. The current war is the result of Bashar al-Assad’s failure to perceive the declining power of his unitary state. \\nAs much as the younger Assad would have liked to maintain a firm grip on power, Syria 2012 was a much different place from Syria 1982. During those 30 years, the bonds that had kept the country together had weakened. Popular organizations had begun to demand democracy. Groups defined by their ethnicity saw the potential for greater autonomy. Religious organizations sensed an opportunity to dislodge what had once been a distinctly secular regime. Other centers of power had appeared in Syrian society, and the Baathist regime was ill equipped to deal with this kind of pluralism. \\nThis scenario might seem unique. It isn’t. Disharmonious pluralism has become the new global standard. Other countries—Turkey, Iran, Russia, Saudi Arabia, the EU, even the United States—gaze upon the Syrian example and tremble. It Can Happen Here \\nStripped of its magic sovereignty, Syria has been turned into a piñata whose hidden treasures are now available for all to see and seize. Even as they continue to wield their bats, the intervening powers can’t help but perceive how quickly sovereignty can disappear and how little prevents them from becoming piñatas in turn. \\nTurkish leaders, for instance, must be quite aware of the structural features their country shares with Syria. The glue that has traditionally held together modern Turkey—Kemalism, named for the father of Turkey, Kemal Ataturk—has a somewhat Baathist flavor. It, too, is anti-colonial, nationalist, and secular. Kemalism, like Baathism, has unified an extraordinarily diverse country. Where ideology has proven insufficient, the central government, as in Syria, has used considerable firepower to suppress any movement—but particularly the Kurds in the Kurdistan Workers’ Party (PKK)—that challenges the territorial integrity of the country. Turkey’s current leader, Recep Tayyip Erdogan, wants to consolidate power internally and project Turkish influence throughout the Middle East (and beyond). Syria has long been integral to this dual project. The two countries mended fences in the early 2000s when Syria figured prominently in Turkey’s “zero problems with neighbors” policy. Once Assad’s position became tenuous during the Arab Spring, however, Erdogan saw an opportunity to switch horses. As the conflict deepened, and no horse emerged as a clear winner, Erdogan decided to use the cover of war to bomb the PKK and their supporters over the border. He hoped to identify a “responsible” Kurdish faction with which to do business—as Ankara has done with Kurdistan in Iraq. More recently, by creating a “safe zone” in northern Syria, Turkey plans to resettle Syrian refugees now in Turkish camps and use that as a base of operations for promoting Turkish business in post-war reconstruction. The Nightmare \\nThat’s the dream, anyway. The nightmare is not far away. The failed coup in July was a rather inept demonstration of the latent anxiety in certain sectors about Erdogan’s consolidation of domestic power. The rekindled war with the Kurds in the southeast reveals the continued ethnic divide in the country. So far, Erdogan has cleverly combined the secularist Kemalism and the soft-pedaled Islamism of his Justice and Development Party into a Turkey-first nationalism. But blowback from Syria—from Kurds, from Islamic State supporters, from a disgruntled Turkish army—could open up a rift in Erdogan’s coalition, and Turkey would then be on the verge of turning into a Syria. \\nEven though it follows a very different operating system, Iran, too, looks on Syria as a cautionary example. The government in Tehran is currently split between reformers under President Hassan Rouhani and the religious hardliners who constantly fret over theological deviations. The Green Movement that emerged around the 2009 elections revealed strong opposition to the theocrats within the urban middle class. If Rouhani and his cohort are not able to take full advantage of the nuclear deal and Iran’s reentry into the global economy, Iran could slide backward economically—and then, after the next elections, politically—to the days of Mahmoud Ahmadine- jad. Disenchanted with formal politics, the next iteration of the Green Movement might give up on peaceful demonstrations and plunge Iran into its own civil war. Saudi Arabia seems like a solid enough entity at the moment. But it too faces a religious challenge from its Wahhabist fringes and a potential territorial challenge from minority Shia in the Eastern Province. The House of Saud rules with an iron fist, and its Committee for the Protection of Virtue and Prevention of Vice intrudes into the private lives of the citizens. The collapse of oil prices has put a squeeze on the kingdom’s finances, which will inevitably open up cleavages within Saudi society. In the absence of a strong national identity, Saudi Arabia could fracture along tribal lines, much like Somalia. \\nThese challenges are not limited to the Middle East. The European Union faces multiple centrifugal forces —Brexit, defaulting economies, a restive Russia. Euroskeptics decry the undemocratic power wielded by political institutions in Brussels. The crisis in Syria is by no means abstract for European countries. The influx of Syrian refugees has driven a huge wedge between countries that want nothing to do with them (particularly Eastern Europe) and countries that want to share the burden equally. The disintegration of Syria is now integrally linked to the disintegration of Europe, which might seem fitting to those who believe in the vengeful ghosts of colonialism. \\nThe United States is far away from the Syrian conflict, and so far the Obama administration has limited the number of incoming refugees to 10,000 (compared to more than a million that Europe has accepted). The issue of immigrants has certainly divided the two major presidential candidates, and there is no consensus at the top on Syria policy—the recent ceasefire agreement exposed a serious fault line between the State Department (let’s work with the Russians) and the Pentagon (really, the Russians?). But Syria won’t set Americans against Americans as it has pitted Europeans against themselves. Moreover, despite considerable disagreement in the highest reaches of American power on a range of other issues—between Congress and the president, within the Supreme Court, between states and the federal authority—these conflicts have been paralyzing rather than fissiparous. \\nThe more serious concern is the sheer number of guns in the United States—over 300 million—and their greater public visibility. You can now carry around your gun openly in 45 states, and more than 14 million people have permits to do so. The number of anti-government militia groups has been rising steadily since the election of Barack Obama in 2008. Trust in the federal government has fallen to record lows. Approximately one in four Americans want their states to secede from the union. Divisions between rich and poor, white and black, native born and immigrants have widened. Ordinarily, all this roiling discontent could be contained by a well-functioning economy or by a set of foreign enemies to focus American enmity. But the election of a much-disliked president next year—take your pick—may well prove to be a tipping point. It doesn’t take much to turn a well-armed population into a mob. \\nAnd that, of course, is the ultimate nightmare for Turkey and Iran and Saudi Arabia and the United States—when Syria ceases to be a gloomy metaphor for what is happening outside its borders and becomes instead a grim reality.\""}, "time": 1742628395.5652843}