{"duration": 0.13058733940124512, "input_args": {"text": "'WASHINGTON  —   Former Secretary of State Colin L. Powell has long been one of the high priests of the Washington establishment, staying quiet in this year’s raucous presidential campaign while tending to his reputation as a thoughtful officer and diplomat. But a hack of Mr. Powell’s email this week has ripped away the diplomatic jargon and political niceties to reveal his unvarnished disdain of Donald J. Trump as a “national disgrace,” his personal peeves with Hillary Clinton and his lingering, but still very raw, anger with the Republican colleagues with whom he so often clashed a decade ago. There has been an expectation that Mr. Powell, who waited until the final weeks to endorse Barack Obama in 2008 and 2012, would do the same for Mrs. Clinton this year. But in one 2014 email released online, Mr. Powell lamented that while he respected Mrs. Clinton, he would “rather not have to vote for her,” describing the Democratic presidential nominee as having “a long track record, unbridled ambition, greedy, not transformational. ” The emails make clear that if Mr. Powell endorses Mrs. Clinton, he will be motivated by intense feelings about Mr. Trump, whom he also called an “international pariah. ” In the email messages, which an aide to Mr. Powell confirmed were authentic, the retired   general who served as President George W. Bush’s top diplomat also accuses Mr. Trump, the Republican nominee for president, of having embraced what Mr. Powell called a “racist” movement when he aggressively questioned the validity of Mr. Obama’s birth certificate and his legitimacy to serve as the country’s top elected official. But the emails, many of which were sent in recent weeks, also reveal Mr. Powell’s disapproval of Mrs. Clinton’s handling of her email scandal and expose his sometimes unflattering observations of the Democratic presidential nominee and her husband. In a series of exchanges, Mr. Powell lamented efforts by Mrs. Clinton’s “minions” to drag him into the controversy surrounding her use of a private email server by claiming he had advised her on the issue. “H. R. C. could have killed this two years ago by merely telling everyone honestly what she had done and not tie me into it,” Mr. Powell wrote late last month, referring to Mrs. Clinton by her initials. “I told her staff three times not to try that gambit. I had to throw a   at a Hamptons party to get their attention. She keeps tripping into these ‘character’ minefields. ” In the 2014 email, Mr. Powell, though offering no independent knowledge, alluded in graphic language to coverage in The New York Post suggesting that Bill Clinton had continued to cheat on his wife. The emails, some of which were first reported by BuzzFeed News, also show Mr. Powell venting about some members of Mr. Bush’s administration. In one reference to Donald H. Rumsfeld, the former defense secretary, he accuses “the idiot Rummy” of being disloyal to both President Bushes. In another email, Mr. Powell calls Dick Cheney, the former vice president, and his daughter Liz Cheney “idiots and a spent force peddling a book that ain’t going nowhere. ” Mr. Powell appeared to be angry that NBC proposed that he appear on “Meet the Press” with Mr. Cheney and his daughter, who were promoting a book they wrote together. In the email, Mr. Powell said the network agreed to invite the Cheneys at a later date. Mr. Powell’s emails appeared on a website called DCLeaks. com, which had previously posted documents that the site had obtained after hacks into the accounts of prominent Democrats and some Republicans, including Gen. Philip M. Breedlove, the former commander of NATO forces in Europe, and George Soros, a wealthy backer of liberal causes. It is unclear who operates DCLeaks. com. Peggy Cifrino, an aide to Mr. Powell, responded Wednesday morning to an inquiry about the emails: “We are confirming that General Powell has been hacked and that they are his emails. We have no further comment at this time. ” Mr. Powell did not respond to an email sent directly to his personal account. In several emails, Mr. Powell suggested that speaking out against Mr. Trump would only add to the attention the Republican nominee was getting from the news media. Responding to a reporter asking for comment, Mr. Powell wrote last month that Mr. Trump is “his own best enemy” and added: “I will speak out when I feel it appropriate and not after every idiot thing he says. ” But the emails make clear that Mr. Powell, who also served as the chairman of the Joint Chiefs of Staff, has no intention of supporting Mr. Trump. In one    with a former aide, Mr. Powell insisted that Mr. Trump should not be elected president. “No need to debate it with you now, but Trump is a national disgrace and an international pariah,” Mr. Powell wrote in June, noting the criticism of Mr. Trump by several prominent conservatives. “He is in the process of destroying himself, no need for Dems to attack him. ” Mr. Powell also made clear in a series of exchanges how much he was offended by Mr. Trump’s attacks on the issue of Mr. Obama’s birth. “Yup, the whole birther movement was racist,” Mr. Powell wrote. “That’s what the 99% believe. When Trump couldn’t keep that up he said he also wanted to see if the certificate noted that he was a Muslim. As I have said before, ‘What if he was?’ Muslims are born as Americans everyday. ” Mr. Powell dismissed as completely ineffective Mr. Trump’s recent attempts to reach out to black voters, saying that the Republican nominee “takes us for idiots. ” Mr. Powell said that nothing Mr. Trump could say to black voters would improve his standing, in part because of the things he said about Mr. Obama. “He can never overcome what he tried to do to Obama with his search for the birth certificate hoping to force Obama out of the presidency,” Mr. Powell wrote, saying to his aide, “You don’t fall for his false sincerity, I hope. ” In the emails, Mr. Powell blamed the news media for helping fuel Mr. Trump’s candidacy. In December 2015, he turned down a request from CNN’s Fareed Zakaria to discuss Mr. Trump. “It is time to start ignoring him. You guys are playing his game, you are his oxygen,” Mr. Powell responded. In August 2015, Mr. Powell predicted that Mr. Trump would “take it to the convention” in part because news networks were chasing ratings. “He appeals to the worst angels of the G. O. P. nature and poor white folks,” Mr. Powell said in the email.’ ”In that email, Mr. Powell in part defended Mrs. Clinton’s actions in the attack on the American diplomatic compound in Benghazi, Libya, in 2012.” ’In December 2015, he told Condoleezza Rice, his successor at the State Department, that the Republican political attacks on Benghazi were “a stupid witch hunt” and wrote that “basic fault falls on a courageous ambassador who thought Libyans now love me and I am O. K. in this very vulnerable place. ” He added that “blame also rests on his leaders and supporters back here,” including Mrs. Clinton. A few months later, in a discussion about Mrs. Clinton’s email scandal, Mr. Powell lamented that “everything H. R. C. touches she kind of screws up with hubris. ” He then related a story about “the gig I lost at a university” when the institution said it could no longer afford his speaking fees after paying Mrs. Clinton. “I should send her a bill. ”'"}, "time": 1742562382.0878446}