{"duration": 0.06975460052490234, "input_args": {"text": "'Les voix des femmes musulmanes ont été quasiment noyées par le débat agité sur l’interdiction de se baigner en burkini sur les plages de plus de 30 municipalités françaises femmes pour qui ces maillots couvrant complètement le corps ont été conçus. Le New York Times a sollicité leurs avis, et les réponses  —   plus de 1000 messages de Belgique, de France et d’ailleurs  —   vont bien   de la question des tenues de plage. Le résultat brosse le portrait de la vie de la femme musulmane, voilée ou pas, dans les parties d’Europe où le terrorisme a le plus tendu les sociétés. Le mot “combat” a été utilisé des dizaines de fois. Beaucoup de celles qui sont nées en France parlent de confusion quand on les enjoint de rentrer là d’où elles viennent. Les tribunaux ont suspendu plusieurs interdictions suite à une décision du Conseil d’État la semaine dernière  —   l’interdiction à Nice, où s’est déroulé un horrible attentat terroriste le 14 juillet dernier, a été suspendue ce jeudi  —   mais le débat est loin d’être terminé. “Depuis des années, nous supportons les regards et les propos menaçants,” écrit Taslima Amar, 30 ans, enseignante en banlieue parisienne. “On m’a demandé de rentrer chez moi (alors que je suis chez moi). ” Désormais, Mme Amar a ajouté, elle espère quitter la France avec son époux. Laurie Abouzeir, 32 ans, écrit qu’elle envisage de se mettre à son compte et de s’occuper d’enfants à son domicile toulousain. Cela lui permettrait de porter le voile, qui est vu d’un mauvais il et parfois même interdit sur certains lieux de travail. Beaucoup de femmes écrivent que les préjugés   se sont intensifiés ces derniers mois et années, citant les attaques terroristes de Paris en 2015, ainsi que celles de Bruxelles et de Nice cette année. Halima Djalab Bouguerra, étudiante de 21 ans à    évoque une date antérieure, estimant que les choses avaient déjà commencé à changer en 2012, avec les meurtres de Mohammed Merah dans le   du pays. “Il y a surtout eu des regards qui ont changé” écrit Mme Bouguerra. “Les langues se sont déliées, plus personne n’a peur de dire à un musulman : “Rentre chez toi. ” Voici quelques extraits des commentaires que nous avons reçus, parfois condensés et modifiés pour plus de clarté, et traduits en français lorsqu’ils nous ont été envoyés en anglais. _____ _____ _____ _____ _____ _____ _____ _____ _____ _____ _____ _____ _____ _____ _____ _____'"}, "time": 1742562439.6187108}