{"duration": 0.1149284839630127, "input_args": {"text": "'Monday was in many ways typical for the   comedy shows, with network hosts like CBS’s Stephen Colbert and NBC’s Seth Meyers performing pointed satirical monologues about Donald J. Trump, the Republican presidential nominee, and his many years spent propagating lies about President Obama’s birthplace. But Samantha Bee, on her TBS cable series, “Full Frontal,” took aim at a different target, condemning the NBC network and its   host Jimmy Fallon for putting Mr. Trump on “The Tonight Show. ” She faulted Mr. Fallon for conducting a genial,   interview on Thursday, even as Mr. Trump had refused that day in other interviews to acknowledge that Mr. Obama was born in the United States. “Network execs, and a lot of their audience, can ignore how very dangerous Trump is because to them, he isn’t,” Ms. Bee said on her show. “They’re not going to be deported. They’re not going to live under a president who thinks of them as a collection of sex toys. “They’re not racist. They just don’t mind if other people are, which is just as bad. ” It’s one thing to make fun of Mr. Trump, who said  on Friday that Mr. Obama “was born in the United States, period. ” It’s another to criticize a network or Mr. Fallon, who is typically not held up to such scrutiny, partly because of his amiable   personality and the perception that his “Tonight Show” (which draws more than three million viewers a night, the most in its category) is a place for nonpartisan diversions. He and rival hosts like Mr. Colbert and Jimmy Kimmel try to avoid criticizing one another in public. NBC declined to comment on Tuesday, and Mr. Fallon has not spoken publicly on his conversation with Mr. Trump, except in a short TMZ. com interview, in which Mr. Fallon says on camera: “Have you seen my show? I’m never too hard on anyone. ” But Mr. Fallon took plenty of criticism for the Thursday interview, and Ms. Bee’s monologue was perhaps the bluntest denunciation of it so far. On a day in which Mr. Trump continued to give ambiguous answers on whether he still supported his false birtherist theory, Mr. Fallon asked him mostly uncontroversial questions and playfully ran his fingers through Mr. Trump’s hair. Playing off that image, Ms. Bee said sarcastically, “Aw, Trump can be a total sweetheart with someone who has no reason to be terrified of him. ” Jo Miller, an executive producer of “Full Frontal,” said in an interview on Tuesday that seeing the cozy behavior between Mr. Fallon and Mr. Trump “was a punch in the gut. ” Ms. Miller said that she and her “Full Frontal” colleagues “love Jimmy. ” She added, “Who doesn’t love Jimmy?” But, she said, Mr. Fallon’s ingratiating treatment of Mr. Trump is “a problem because we love him. ” “If he thinks that a   demagogue is O. K. that gives permission to millions of Americans to also think that,” she continued. Ms. Miller, who came with Ms. Bee from Comedy Central’s news satire “The Daily Show,” said she has no problem “showing candidates and public servants as human beings, and I think there needs to be more of that. ” “That said,” Ms. Miller added, “this is not a race between Democrat and Republican  —   this is a race between Democrat and demagogue. You don’t normalize someone who’s inciting violence. ” The “Full Frontal” segment about Mr. Fallon and NBC had been touched off when Ms. Miller received a text early Friday morning from Travon Free, a former writer for “The Daily Show” who now works on HBO’s “Any Given Wednesday With Bill Simmons. ” The text from Mr. Free included a picture of Mr. Fallon caressing Mr. Trump’s coiffure, and an urgent, slightly vulgar message exhorting Ms. Miller and Ms. Bee to address the subject on their show. “That was the first I heard of it,” Ms. Miller said. “I was like, What? This didn’t happen. ” Mr. Free said on Tuesday in a phone interview that, other than Ms. Bee, “I knew no one would do it, because it’s just this buddy culture among the hosts in that category. ” Mr. Free added: “If Jimmy Fallon was my friend, we would have had a real conversation. Not being cool with what he did on his show doesn’t make you his enemy. ” Echoing Ms. Bee’s monologue, Ms. Miller said that Mr. Fallon did not deserve all the blame, and that NBC was more culpable for providing Mr. Trump a platform as the star of its reality shows “The Apprentice” and “The Celebrity Apprentice. ” Even after NBC said in June 2015 that it was firing Mr. Trump for “derogatory statements” at his presidential announcement, in which he referred to Mexican immigrants as “rapists” and “murderers,” the network continued to feature him on “The Tonight Show” and “Saturday Night Live. ” Ms. Miller pointed out that there is still an awkward relationship between Mr. Trump and NBC, where the “Today” show host Matt Lauer was criticized for going too easy on him in a   presidential forum, and Mr. Trump has expressed   skepticism of the NBC “Nightly News” anchor Lester Holt, who will moderate the first presidential debate. She drew a distinction between the broader categories of political satire programs like “Full Frontal” and   talk shows that can only engage their guests in harmless banter. “It’s not their job to be political satirists and to shake people by their shoulders and say, ‘Look at this thing  —   do you think it’s O. K.?’” Ms. Miller said. “That’s our job. ” Ms. Miller said it would be helpful to hear her message reinforced by white men in her field. Otherwise, she said, “It becomes, ‘Oh, you see everything through the lens of sexism,’ or, ‘Not everything has to be about race. ’” “To me, this is just about decency,” she said. On Monday night, meanwhile, Mr. Fallon’s “Tonight Show” guests included Hillary Clinton, the Democratic presidential nominee. Going through items that they said belonged to Mr. Trump, Ms. Clinton offered Mr. Fallon something that she said Mr. Trump had left behind for him: a bag of softballs. Mr. Fallon responded, “That was my gift to him. ”'"}, "time": 1742563417.5518363}