{"duration": 0.05050158500671387, "input_args": {"text": "'Brent Musburger is calling it a career at ESPN after being the    man in the booth at sporting events enjoyed by millions of Americans, most prominently when he was the lead voice for CBS Sports in the 1980s. Musburger, who is 77, said he was leaving active sportscasting to help his family get a sports handicapping business started and to use some of the millions of airline miles he has earned for recreational travel. His last game will be the   men’s basketball game Tuesday night. That takes him back to Rupp Arena, where he called Villanova’s upset over Georgetown in the final of the N. C. A. A. tournament in 1985. Musburger and ESPN said his comments about the Oklahoma football player Joe Mixon that were criticized as insensitive during the Sugar Bowl this month had nothing to do with his exit. On the broadcast, Musburger said that he hoped Mixon, who had been suspended for a year after punching a woman and breaking her jaw, would make the most of his second chance. He did not initially talk about Mixon’s victim. A former sportswriter, Musburger’s broadcast fame took off through his work on “N. F. L. Today,” the pro football pregame show. He broadcast the N. B. A. college basketball, the Masters golf tournament and tennis  —   most of CBS’s marquee events. He was behind the mike for one of college football’s most memorable plays, Doug Flutie’s “Hail Mary” pass that beat Miami for Boston College in 1984. He confessed to Flutie later that it took him awhile to identify Gerard Phelan, Flutie’s roommate, as the receiver of that pass  —   and Flutie told him he didn’t know, either, until he had run off the field. Musburger was abruptly dropped by CBS in 1990 in what was perceived as a salary dump, then went to work for ABC and ESPN. “Brent made every event feel larger,” said Stephanie Druley, ESPN senior vice president for events and studio production. “To me, there is probably not a greater storyteller as a    person. He can spin a yarn like nobody else, and it made games definitely more enjoyable to watch. ” Musburger’s opportunities for national exposure grew more limited in recent years when ESPN assigned him to its SEC Network for college football. But he still called college basketball regularly, and even though ESPN has been trying to save money lately by cutting   talent, Druley said the network had no interest in seeing him leave. Sportscasting today “has become more and more numbers driven, advanced statistics and everything,” Musburger said. “That’s fine. I was never going to change because I’m a people guy. I like pulling up a chair in a saloon with a cold beer and telling stories. ” Musburger took heat in 2013 when he extolled the attractiveness of an Alabama quarterback’s girlfriend, a controversy he found silly. “I called a beauty queen beautiful,” he said. “Are you kidding me?” He said he hoped people felt comfortable listening to him. “Not everyone approved of everything I said,” he said. “I understand that. I come from a sportswriting background, and I’m not afraid to take a position on certain things from time to time. But for the most part, I thought people should be coming to a game to escape for three hours and forget about what their individual problems are. ” He said he was not ready to fully retire (“I don’t do shuffleboard well,” he said) but his decision lets ESPN escape from an uncomfortable decision. Having a broadcaster of college games publicly identified with a sports handicapping business wouldn’t fly. That accounts for the odd timing of his departure in the middle of the college basketball season his family wants the site fully operational by the N. C. A. A. men’s basketball tournament. If anything, the move will force Musburger to change a pat answer when he is approached by fans. “They always ask me my favorite game, and I always say, ‘The next one,’ ” he said. After Tuesday, that will no longer be applicable.'"}, "time": 1742628531.5845745}