{"duration": 0.19835615158081055, "input_args": {"text": "'In clandestine corners of the world, the elite come together in secrecy. Some of them don’t mind that we know of these society meetings, while others maintain that they do not organize at all.\\n\\n\\nYet doormen speak to their friends, initiation rites are leaked, people peek in windows, chanting in far underground lairs can be heard by a passerby. Conspiracy theorists have long held that someone, and not the Fates, is manipulating our world, and perhaps in these secret societies the strings are being pulled.\\n\\nHere is a list of seven groups so secret some members will never admit to their involvement, and their meeting places hiding in plain sight.\\n\\nNEW HAVEN, CONNECTICUT \\nIvy league Yale University is considered to be one of the most selective higher educational institutions in the United States, if not the world. Its motto lux et veritas translates to “light and truth.” On the historic campus in New Haven, Connecticut, there is a building where “light and truth” are reserved for carefully selected members and alumni.\\n\\nWhat is known about the Skull and Bones secret society is minimal. The organization started in 1832. An official roster of its members was published up until 1971. Bonesmen, as members are called, have been heads of corporations, senior government officials, Supreme Court justices, and even presidents. Theories about what the Skull and Bones actually do range from its members controlling the Central Intelligence Agency, being a part of a global network aimed at world domination, to being a branch of the Illuminati.\\n\\nIt’s also unknown exactly what happens in The Tomb, the group’s headquarters, but there are strange rumors of what is contained in the windowless sandstone building. The Egypto-Doric style of the structure makes it appear as an immense sepulcher. The tomb is thought to hold secret documents containing the roster of all members, ritual details, as well as multiple stolen relics. Some of the bones rumored to be in The Tomb include the skulls of Geronimo, Pancho Villa, Martin Van Buren, and the gravestone of Elihu Yale, the school’s founder. Bonesmen are also known to take other societies’ belongings in a show of thievery and cunning known as crooking.\\n\\nOOSTERBEEK, NETHERLANDS \\nHotel de Bilderberg. (Photo: Michiel1972/CC BY-SA 4.0 )  \\nIn November of 1954, 50 delegates from 11 countries in Western Europe and 11 Americans spent three days in Oosterbeek, Netherlands, at the Hotel de Bilderberg . The purpose of the meeting was said to foster conversations between Europe and North America. Those in attendance included a prince, a prime minster, and the head of the CIA. Since that meeting, each year a group of international leaders in the fields of politics, business, media, and communications have met to discuss… we’re not exactly sure.\\n\\nThere is no agenda, no resolutions are proposed, no voting of any kind is executed, and no positions or policy statements are issued. The meetings are held in a different location each year and each year the topics of the meeting are up for the general public to theorize over. The roster of attendees is never officially made public, but there have been leaks over the years. Conspiracy theories abound, especially because of the group’s intense level of secrecy. Many believe the group is conspiring to impose capital domination, a world government, or a planned economy. What is certain is that the more prominent you are, the more likely you’ll be to get an invitation to next year’s Bilderberg conference.\\n\\nTREMENTINA, NEW MEXICO \\nTrementina Base, New Mexico. (Photo: Google Earth ) \\nScientology is most visible today because of celebrity members like Tom Cruise and John Travolta, yet the organization has been aggressive over the years in tackling critics and maintaining its secrets. One of the most controversial religious groups, some characterize the movement as a cult.\\n\\nBasic Scientology belief holds that humans are immortal beings who have reincarnated and have lived on other planets before finding themselves now on Earth. One of the things that makes the religion controversial is its assertive nature, often turning to character assassination or litigation in dealing with skeptics and critics who question their practices. The church is also extremely secretive, holding many of its teachings from members until they have made it through multiple levels.\\n\\nScientology operates several churches called Celebrity Centres that are opened to the public, but are primarily meant for “anyone with the power and vision to create a better world.” The Church of the Spiritual Technology, or CST, is reserved for the most trusted of members. Many of these members manage elaborate bases including the Trementina Base . The official word from the church is that the base is a location used to preserve Scientology founder L. Ron Hubbard’s writings, which are said to be engraved on steel sheets and encased in titanium cases. It’s thought that Trementina is more than just a location to archive Hubbard’s works, however.\\n\\nTrementina contains underground dwellings and tunnels, but what’s most interesting about the base is what you see from the outside. Aerial photographs above the base show huge images dug into the Earth. The images are that of the church’s logo. Former members have claimed that the symbols are to mark the return point for members when they travel into the future. Other members have stated that this is the place where Hubbard is supposed to go when he returns.\\n\\nThe Illuminati: Domus Sanctae Marthae \\nVATICAN CITY, VATICAN Pope Francis entering Domus Sanctae Marthae (Photo: Pufui Pc Pifpef I/CC BY-SA 3.0 )  \\nEstablished in 1776 in Bavaria, Germany, this group of freethinkers, humanists, and academics opposed superstition, prejudice, religion, and its influence over the public, and they supported the advancement of women.\\n\\nThe Illuminati were a shadowy group, believed capable of influencing movements in government and the arts. The group was infiltrated and shut down a decade after its founding, or so the official record goes. Conspiracy theorists have long been obsessed that the world has been controlled by the Illuminati for generations. There are many modern groups that claim to be the descendants of the original Bavarian Illuminati; they go so far as to use the name “Illuminati” in their title, but there is no evidence that these recent organizations are tied to the original.\\n\\nBesides its actions, what is a major mystery of this group is the location of its headquarters. Theorists have claimed many prominent locations are the headquarters of the Illuminati from Disney World in Orlando, Florida, the Mormon Temple in Salt Lake City, Utah, the Statue of Liberty in New York City, Big Ben in London, the Eiffel Tower in Paris, the Pentagon in Washington, D.C., and, among many others, the Vatican.\\n\\nThe theory that the Illuminati headquarters is located at the Vatican is especially interesting due to the group’s opposition to the church. It’s believed by conspiracy theorists that the church was long ago infiltrated by the society and so that would make its leader, the pope, one of the Illuminati’s highest ranking members. Today, the pope resides in a simple room at Domus Sanctae Marthae , a guest house adjacent to St. Peter’s Basilica. The five-story building containing 106 suites and 22 single rooms is for clergy who are in town on official Holy See business, or perhaps for an Illuminati meeting or two.\\n\\n\\nOrdo Templi Orientis: Bay Area Thelemic Temple \\n\\nOAKLAND, CALIFORNIA Mural of Aleister Crowley at the Abode of Chaos . (Photo: Thierry Ehrmann/CC BY 2.0 ) \\nThe Order of the Temple of the East was founded between 1895 and 1906 in either Austria or Germany. It is believed wealthy industrialist, Carl Kellner, began the religious movement, but it was famed occultist Aleister Crowley whose name and additions to the group shrouded it in curiosity and mystery.\\n\\nOTO was modeled somewhat after another secret society, Freemasonry. But Crowley added a layer, his own self-created belief system called Thelema. Thelema’s practices and beliefs are written out in a book titled The Book of Law and its core belief is: “Do what thou wilt shall be the whole of the Law.” Ideas from occultism, and Eastern and Western mysticism, found their way into Thelema and thus OTO. The religion is highly secretive and members move through the order in a series of rites and rituals, moving up levels in the forms of initiations. Levels have curious names such as Minerval, Master Magician, Illustrious Knight, Grandmaster of Light, and so on.\\n\\nThere are two components at the core of OTO: magical rituals, which have been rumored to include tantric sex, the summoning of angels and demons, and astral projection. Then there is the gnostic mass, reminiscent of a Catholic mass only because it contains a host and wine toward the end. The gnostic mass includes elaborate costumes, and at the climax of the mass it’s believed that the host turns into the Body of God and the wine the Blood of God.\\n\\nThere are multiple locations of worship called camps, oases, or lodges. The majority of them keep their locations secretive to the greater public. The relatively small location in Oakland is an oasis . They hold a weekly gnostic mass in a temple decorated in candles and Egyptian imagery. It’s unknown exactly what takes place during initiation ceremonies and what knowledge is shared during these events. According to Crowley’s autobiography, The Confessions of Aleister Crowley : “the OTO is in possession of one supreme secret. The whole of its system [is] directed towards communicating to its members, by progressively plain hints, this all-important instruction.”\\n\\nPriory of Sion: Bibliothèque Nationale de France \\nPARIS, FRANCE National Library of France Reading Room. (Photo: Vincent Desjardins/CC BY 2.0 ) \\nThe secret of this secret society is that many people believe in its existence, but scholarly claims have repetitively stated the group is a complete myth, constructed by the imagination of a madman.\\n\\nThe myth begins that the Priory of Sion was a group charged with protecting the descendants of Jesus of Nazareth and Mary Magdalene who eventually went on to settle in France. It was leaked in the 1970s that the Bibliothèque Nationale de France in Paris, the French National Library, was in possession of a file calledDossiers Secrets d’Henri Lobineau that pointed to the Priory of Sion being located in France. The file contained an introduction, maps of France, genealogies, newspaper clippings, letters and a list of grand masters of the Priory of Sion that included Sir Isaac Newton, Victor Hugo, and Leonardo Da Vinci.\\n\\nThe authenticity of these files has been questioned ever since they were left at the library. Eventually, they were traced to Pierre Plantard. It is believed Plantard planted the document at the library in order to perpetuate an elaborate hoax. He himself claimed to be a descendant of Jesus’ bloodline. Academics went on to agree that the Priory of Sion was a hoax constructed by Plantard. Yet, books, articles, and movies continue to be made about this group. Whether or not there is a secret society dedicated to protecting a family descendant from biblical times we may never know.\\n\\nRosicrucianism: Rosicrucian Park \\nSAN JOSE, CALIFORNIA Rosicrucian Egyptian Museum grounds. (Photo: Ginabovara/Public Domain ) \\nSeveral manifestos were anonymously published in the early 17th century that told of legends, mysticism, alchemy, and the Order of the Temple of the Rosy Cross. One of these documents was the Fama Fraternitatis which was published in Cassel, Germany.\\n\\nThe Fama spoke of the 15th century German doctor and mystical philosopher Christian Rosenkreuz who traveled through parts of the Middle East where he learned esoteric wisdom, studying in places such as Turkey and Egypt. There, he claimed to learn extensive knowledge regarding nature and the universe. When he returned, he attempted to share what he learned but he was dismissed. He then formed a like-minded group called the Fraternity of the Rose Cross.\\n\\nThe year of his birth and death remain shadowy, but some documents claim he lived over 106 years. The group upheld Christian beliefs, but strongly opposed Roman Catholicism, and was also said to have influenced Freemasonry along with hundreds of other groups, many of which have adopted titles with similar names throughout modern times. At its simplest form, the group aimed to promote a “Universal Reformation of Mankind.” Some reports claim that the requirement for membership was that one must have been capable of using more than the average amount of brain power.\\n\\nDuring Rosenkreuz’s life, the group was thought to have only consisted of a handful of members, each of whom was a doctor. All members took an oath to remain bachelors, and also to treat the sick without payment and to find a replacement for themselves before they died. Interest in the group peaked between 1607 and 1616 with the appearances of the anonymous works that included the Fama Fraternitatis which ranged with content that included mysticism and apocalyptic warnings.\\n\\nWhether Rosenkreuz’s original idea continued is unknown. One of the hundreds of groups claiming to be tied to the original is the Ancient Mystical Order Rosea Crucis that has some connection to occultist Aleister Crowley. AMORC claims to be devoted to the “study of elusive mysteries of life and the universe.” They utilize ideas from major philosophers, including Thales and Pythagoras, healing techniques, alchemy, symbolism, and mysticism. The group claims its history can be traced to pharaoh Thutmose III in 1477. The AMORC headquarters is located at Rosicrucian Park in San Jose, California, which spans a city block and includes several structures. The park is home to elaborate gardens, a research library, a planetarium, a temple, and it houses the ashes of Harvey Spencer Lewis, founder of the secret society.\\n\\nBy Cynthia Pelayo, Atlas Subscura SOURCE '"}, "time": 1742564337.4853947}