{"duration": 0.07007431983947754, "input_args": {"text": "'Sioux Indians Wish Dakota Pipeline Protesters Would Go Home October 30, 2016 Daniel Greenfield \\nThe ecoloons protesting the Dakota pipeline have the support of the media and the White House. But many of the local Sioux don\\'t see them as defenders. They just wish they would go home . \\nAsk around and you\\'ll hear stories of pipeline protesters who\\'ve traveled great distances. They\\'ve come from Japan, Russia and Germany. Australia, Israel and Serbia. And, of course, there are the allies, not exclusively Native American or indigenous, who\\'ve flocked here from all corners of the US. \\nDemonstrating is their proud daily work. \\nThe obnoxious leftists of the world have united. And they want no pipelines or showers. \\nNo one makes this clearer than Robert Fool Bear Sr., 54, district chairman of Cannon Ball. The town he runs, estimated population of 840, is just a few miles from the action. It\\'s so close that, given the faceoffs with law enforcement, you have to pass through a police checkpoint to reach it. \\nIt\\'s about time people heard from folks like him, he says. \\nFool Bear has had it with the protesters. He says that more than two years ago, when members of the Standing Rock Sioux Tribe could have attended hearings to make their concerns known, they didn\\'t care. Now, suddenly, the crowds are out of control, and he fears it\\'s just a matter of time before someone gets seriously hurt. \\nGo down to the camps, he says, and you won\\'t see many Standing Rock Sioux. \\n\"It irks me. People are here from all over the world,\" he says. \"If they could come from other planets, I think they would.\" \\nAnd the Sioux are stuck helping leftist idiot protesters. \\nNot long ago, he found three teenage girls from Ontario, Canada, camped out inside his storage shed. A white woman from Spokane, Washington, came to see him for help, saying she\\'d come here with nothing and her car had broken down. When he was at the casino recently, someone approached him about two young kids who were on their own because their parents had been arrested. \\nEven though Fool Bear is against the protests, that doesn\\'t mean he\\'s not preparing to help people out, too. He anticipates opening the community gymnasium for people without beds come winter, and a growing pile of sleeping bags and blankets sits in his office. \\nThose protesters from Arizona, Georgia and California won\\'t know what hit them when the cold rushes in, he says. \\nInstead of helping the Sioux, privileged leftists have become a burden for them to take care of.'"}, "time": 1742563188.7841334}