{"duration": 0.07033348083496094, "input_args": {"text": "'Oakland Mayor Libby Schaaf wants to fund a $32 million budget deficit by grabbing millions in revenue from November’s   soda tax initiative  —   and critics are accusing her of a “  . ”[According to the East Bay Times, three of the nine members of the City Council are blasting Mayor Libby Schaaf’s plan to repurpose the soda tax revenue away from health spending to plug the city’s   budget that she plans to present on May 5.  The mayor’s spokesperson, Erica Derryck, issue a statement on May 1 claiming that Schaaf’s plan’s use of the revenues is “consistent with the goals of the measure. ” City of Oakland voters approved Measure HH on the November ballot by an over 61 percent majority. The initiative assessed a tax of     on the distribution of   beverage products including sodas, sports drinks, sweetened teas, energy drinks and fruit products that were not 100 percent pure juice. The City Council’s big selling point to voters for the tax increase was the Oakland City Auditor’s “Impartial Analysis of Measure HH’”that promised soda tax revenues would be managed by a   ‘Community Advisory Board comprised of medical, dental and School District parents to determine “how and to what extent the City Council should establish and fund programs to prevent or reduce the health consequences of consuming   beverages in Oakland. ” The big reason that the City of Oakland is willing to anger voters is that the union wage and pension costs from the city council’s July 2014 passage of a $15 minimum wage are jumping. With the latest spike to $12. 86 an hour on January 1, the mayor and her 5 council allies are desperate to find new cash. The Oakland City Council’s own December 2014 minimum wage staff report highlighted that that there was no “legislative solution” to address the annual   impact from thousands of unionized city recreational aides, senior aides and   student trainees jumping in cost by 35 percent from $18, 155 to $24, 500 per year. The city’s SEIU contract also requires equivalent higher contributions for sick leave and pension benefits. The California Policy Center reported that the Oakland’s Human Resources Management Department also expected a $15 minimum wage to have a contractual ripple effect from the “compaction” of city wage comparisons. SEIU labor contracts mandate that   public employees must also receive compaction wage and pension increases. Councilman Noel Gallo told the San Francisco CBS TV affiliate that there is no problem with how the soda tax will now be spent because “It will be used to support children and family activities. ” Gallo says the soda tax will support libraries, parks, fix potholes, and build affordable housing. Critics point out that the burden of the soda tax falls disproportionately on the poor. The first hearing of the mayor’s budget will be on May 5. The final City of Oakland budget must be adopted by June 30.'"}, "time": 1742562492.0284822}