{"duration": 0.20348715782165527, "input_args": {"text": "\"November 3, 2016 - Fort Russ -  Yurasumy, PolitRussia - translated by J. Arnoldski -  \\n\\n\\nOn October 27th, 2016, the heads of the Verkhovna Rada committee on culture and freedom of speech, Ruslan Knyazhnitsky and Viktoriya Syumar, put forth a bill which, besides guaranteeing new preferences for the Ukrainian language, proposes to ban Russian-language print products. It’s not difficult to understand this Russophobia. For 25 years, they have been struggling to oust the Russian language from official usage in the country, but the last decade has shown the futility of their attempts. The Russian language is becoming the language of communication among the youth of Ukrainian cities, even those who earlier spoke Ukrainian. \\nLanguage is the beginning of everything  \\nWhen in the middle of the 19th century the construction of Ukrainian self-identity began, its foundation was largely based on the language principle. It was then that scholars of the Russian Empire began to create a map of the Russian language with its division into dialects. For theorists, the geographical distribution of the Malorossiyan dialect (in the terminology of the late 19th-early 20th centuries)  was the first wave of the construction of the Ukrainian ‘nation’, the place where experiments in creating the “Ukraine is not Russia” theory began.  \\nIt was in this time that a literary language and grammar were created. Literature and community began to take shape around them. This process coincided with another process: the mass exodus of villagers to the city.  \\nFrom the village to the city \\nIn this article, we will not consider the economic causes of this displacement, but note that it was this relocation that allowed the Ukrainian intelligentsia to very quickly find followers and consistently maintain their number. The mass exodus of Ukrainian-speaking masses of people to the cities allowed for the formation of an interlayer very easily subjected to “Ukrainianization.”  \\nThis was largely a poor mass of people, only recently serfs, who saw in Russian-speaking city-dwellers some kind of other, alien group of people. Naturally, they felt a kind of alienation towards this group. Language became their main criterion of “us vs. the other.” Circles and communities appeared, the ultimate result of which was the emergence of the idea “Ukraine is not Russia.” \\nThe first to systematize this in a globally historic work was Mikhail Grushevsky, who before 1917 started to write his History of Ukraine-Rus . No one should be deceived by the title of this book. Its main leitmotif was that Ukraine is not Russia and that the two have always been antagonistic ever since the time of princely quarrels.  \\nThe city wins \\nDuring the second half of the 19th century, masses of peasants poured into the cities. Their children went to schools and colleges, became workers and civil servants, and many even rose higher up the social ladder of the empire. But the vast majority of them in their first and at least second generations became Russian-speaking.  \\nNew and new masses of peasants came to replace them.  The melting pot of the empire worked fine until the empire itself ceased to exist. 1917 destroyed many of the state’s institutions, including integration ones. The resulting ideological gap was quickly filled with doctrines telling yesterday’s and today's Ukrainian peasants why they live so badly and who is to blame. Seventy years later, the supporters of the new theory “quickly found answers” to all the current issues of society and brought the country to ruin. The outbreak of bloody civil strife and more of the same ruin in the West did not allow the problem to drag on for decades, and was quickly resolved… \\nEven taking into account the early USSR’s acceleration of the process of Ukrainianization, strong resistance to this process in the cities was evident. The youth gradually Russified and the ongoing process of industrialization contributed to the rapid movement of the labor force and its linguistic unification, which was possible only on the basis of the Russian language. Nevertheless, in the 1950’s-1960’s, the problem of reteaching “Ukrainian” students in Soviet universities still existed. This was uncomfortable, so in the 1970’s the Ukrainian language was finally put on the back burner in the schools of the Ukrainian Soviet Socialist Republic.  \\nAt the time, it was normal in Ukrainian city families, in which the parents had left for the city from the countryside, to speak in Ukrainian or Surzhyk (in Eastern Ukraine). But at work and in schools, children grew up and communicated in Russian. Usually, the children of parents who moved to the city gradually moved on to communicating in Russian and it turned out that the melting pot of the USSR worked exactly like the Russian Empire did 100 years before, when Malorossiyan villagers were quickly made into Russians in the cities.  \\nBut history went down another roundabout... \\nAttempt #2 \\nThe collapse of the USSR, like the collapse of the Russian Empire, offered a second chance to the apologists of the idea of “Ukraine is not Russia.” They long and carefully planned “pedagogical” plans and, as soon as the iron curtain fell, the first wave of “teachers” came to Ukraine from the West. There is no point in dwelling in detail on the technicalities of the work of this and all other “reformer” groups, but their successes by the mid-2010’s were impressive.  \\nPreschool, school, and higher education in Ukraine became almost entirely held in the Ukrainian language. Russian culture and language were driven off of TV and the radio. Russian speaking print was not only discouraged, but often persecuted. It would seem like this was the last nail in the coffin, but this time the Ukrainian “patriotic” intelligentsia began to all the more strongly demand that authorities fight for the purity of the Ukrainian logic because “all was lost.”  \\nSo what’s the deal? What do these “fighters” for the Ukrainian language lack today? \\nThe 21st century against Ukrainianization \\nThe point is that what has repeatedly happened in the history of Ukraine happened again. With each passing year, its territory began to feel the work of the empire’s melting pot. But where did this come from without an existing empire? Every child in Ukraine received their first mobile phone in elementary school and then their smartphone. Today, it is easy to imagine a student in school without textbooks or notebooks, but they never forget their smartphone.  \\nThe mobile phone was a window to a larger world, the world of social networking. And it just so happened that there were no popular Ukrainian-language social networks, but there were Russian-language ones. Just like there were English-language ones. The age-old affinity between the peoples of Ukraine and Russia played its role here. A child in elementary school doesn’t know foreign languages, but Russian is habitual and almost native for him. \\nAround 80% of Ukrainian children are on VKontakte, which is by and large in Russian. Thus, it turns out that in many provincial Ukrainian cities which logically should have long since been finally Ukrainianized, children spoke Ukrainian in elementary school only to speak Surzhyk in middle school, and then, in upper classes to a significant degree outside of their families, became Russians-speakers.  \\nI studied this phenomenon in my own children and their friends and relatives….There are exceptions, but relatively few.  \\nChildren’s interests take their toll, and this is why the advocates of total Ukrainianization are in panic today. They see that they are losing and and cannot offer anything in return. They demand and demand, bringing the situation to insanity, and then still lose…. \\nConsequences \\nThus, the information revolution has struck the bottom of the ship of “Ukraine is not Russia.” Youth are very quickly Russifying and there is no chance of stopping this process. Even people moving from the village, the eternal saviors of “patriots,” are drying up. Moreover, children from the cities have stopped going back to the villages and absorb the customs and culture of their ancestors, of whom there are none left alive. They have no one to go to. \\n\\nThe internet is teaching Ukrainian children, making them largely stupid, but also Russians. Hence why today such ugly formations as Azov, the Azov Civil Corpus, and its latest incarnation in the National Corpus have been born out of the bosom of the Maidan. The vast majority of people in them are Russians trying to find a basis for how to become Ukrainian nationalists. It is clear that confrontation can no longer be built on the basis of language. They have to find new reasons to be non-Russians or, rather, Russians who want to build on the territory of the former USSR and beyond its borders a new integration project - Greater Eurasia… \\n\\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n\""}, "time": 1742563009.8600237}