{"duration": 0.06396317481994629, "input_args": {"text": "\"Here's something interesting from The Unz Review... Recipient Name Recipient Email => \\nDear Mexican: I found your column about Mexican men and spousal abuse, and my question is: Is there any help for this ever ending? I’ve been with a Mexican man, who is also an abuser of alcohol, although it has slimmed down some. He gets angry out of the blue and starts hitting on me and later realizes what he has done and cries. I had to leave him for my protection, but the feelings between us remain, and I don’t know what to do with the situation. Can you provide any comments or help? \\nAbusada \\nDear Abused: Get out of that relationship—now. But before you leave, coat that pendejo ’s toilet paper with habanero powder, so he gets the burn in the culo he deserves. \\nHow do Mexicans feel about environmental issues? Specifically, a population explosion that will cause eventual food shortages? I am told that procreation is a very macho thing for the Mexican male. You have even mentioned in the past that men do not perform oral sex on women because it’s not important when having children. How does that way of thinking weigh in with regard to the future of the planet? \\nEl Blanco Pedro \\nDear Pedro Gabacho:Malthus called—he wants his crackpot theory back. Besides, the gabacho love of suburbia proved far more toxic to the environment than any 12-child Mexican mom ever did, so vete a la chingada con your faux environmental concern. \\nOPEN LETTER TO OUR NEW PRESIDENT: Gentle cabrones: as I write this, the Mexican still doesn’t have a feel for whether Hillary Clinton or Donald Trump (or neither?) will be the next president of the United States (The Mexican has to file his columna a week before actual publication— viva dead-tree journalism). In the interest of not looking more pendejo than usual, I will write three open letters to ensure I get the results right. Enjoy! \\nTO PRESIDENT HILLARY CLINTON: Congrats on beating that pendejo Trump—you’re now the greatest female savior of Mexicans since the original Santa Sabina, the legendary curandera for which the goth-Mex band was named. But that’s not enough. Do not inherit the title of Deporter-in-Chief from Obama. Realize that the only reason you won is because raza overwhelmingly voted for you—and we want results besides appointments of token vendidos (although do give a cool gig to Congressman Xavier Becerra, a truly down Chicano). Don’t pay attention to all the Know Nothings who insist on enforcement before amnesty. There’s millions of Mexicans who have lived their entire lives in limbo, and it’s your job to save them. And if you do that? We’ll create a new altar to you at Tepeyac. \\nTO PRESIDENT DONALD TRUMP: Congrats on beating that pendeja Killary—you’re now the greatest unifier of Mexicans since Porfirio Diaz. Don’t even try to deport 12 million people, or build that nasty, small-handed wall. Back in the day, raza mostly stood meekly as everyone from Presidents Hoover to Roosevelt to Eisenhower to Obama enacted mass deportations—but those were honorable men. You’re not. We will protest, we will resist, we will struggle, we will take over elected offices the way Irish took over Boston. You hear me, President Pendejo ? We ain’t no sleeping giant—we woke, and we’re ready to make your one-term more pitiful than Enrique Peña Nieto. Oh, and #fucktrump. \\nTO NO RESULTS YET : No mames, America. \\nAsk the Mexican at themexican@askamexican.net, be his fan on Facebook, follow him on Twitter @gustavoarellano or follow him on Instagram @gustavo_arellano!\""}, "time": 1742561738.8824067}