{"duration": 0.05131983757019043, "input_args": {"text": "'Young America’s Foundation (YAF) has pulled out of Ann Coulter’s Thursday event at UC Berkeley, blaming the college for allowing   extremists to terrorize conservatives on campus. [“When Young America’s Foundation confirmed Ann Coulter would speak at   as part of YAF’s nationwide campus lecture program on April 27, we assumed UC Berkeley would take all steps necessary to ensure the safety of students attending the educational event,” the group declared in a blog post on Tuesday. “In the meantime we discovered that the University of California Police Department at Berkeley has an official ‘ ’ policy for any situation that develops on campus as long as the situation doesn’t involve the imminent loss of life, allowing the leftist thugs who have terrorized Berkeley’s campus to do so without consequence. ”  “As of 4:00 p. m. today, Young America’s Foundation will not be moving forward with an event at Berkeley on April 27 due to the lack of assurances for protections from foreseeable violence from unrestrained leftist agitators,” they continued. “Berkeley should be ashamed for creating this hostile atmosphere. ” YAF added that they are still pushing forward with their lawsuit against the college, and that the group “looks forward to the day when First Amendment freedoms are enjoyed by conservative students. ” “Ms. Coulter may still choose to speak in some form on campus, but Young America’s Foundation will not jeopardize the safety of its staff or students,” they concluded. “For information on Ms. Coulter’s plans, please contact her directly. ” Ron Robinson, the president of Young America’s Foundation, also attacked the college in a quote, describing the campus as a “circus. ” “As a parent and a taxpayer, I want the next generation to learn in an educational environment, not a circus,” said Robinson. “I had the misfortune of being in a leftist riot as a student, and I wouldn’t want to put my children or anyone else’s children into that situation without assurances that law enforcement would protect them. ” The Berkeley College Republicans and YAF are currently in the process of suing UC Berkeley over the Ann Coulter event, which they claim has faced numerous unfair and biased restrictions. The groups, and their attorney Harmeet Dhillon, referenced previous events featuring conservative speakers at the college, which also faced similar scrutiny restrictions, including former Breitbart Senior Editor Milo Yiannopoulos and conservative commentator David Horowitz. During a press conference about the lawsuit on Monday, Dhillon branded UC Berkeley’s policies on “acceptable speech” as “infinitely malleable,” before criticizing the Mayor of Berkeley, Jesse Arreguin, for appearing to sympathize with, be friendly to, and act softly on the   rioters who shut down Yiannopoulos’ event earlier this year. “If the Mayor of Berkeley cannot maintain control of his city, the Governor should call the National Guard, because that’s a serious public health issue,” Dhillon proclaimed. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742562264.7898765}