{"duration": 0.11969685554504395, "input_args": {"text": "'syrien , irak , isis In Mossul verbleiben viele Zivilisten. Quelle:AFP / East News \\nDer irakische Ministerpräsident Haider al-Abadi hat am 17. Oktober den Beginn der Rückeroberung Mossuls verkündet. Die Großstadt im Norden des Irak ist seit Juni 2014 in den Händen des IS. Je nach Schätzung befinden sich derzeit bis zu 1,5 Millionen Zivilisten und 10 000 IS-Kämpfer in der Stadt. Bis zu 60 000 Mann zogen in den Kampf, um Mossul zu befreien: Kräfte der irakischen Armee, sunnitische und schiitische Einheiten und kurdische Peschmerga-Kämpfer. Die internationale Anti-Terror-Koalition unter US-Führung sorgt für Luftunterstützung. \\n„Der Augenblick des großen Sieges ist nah“, erklärte al-Abadi zu Beginn der Offensive. Mehr als eine Woche nach der Verkündung wird jedoch deutlich, dass der Vormarsch der Anti-IS-Kräfte ins Stocken gerät. Gleich nach Beginn der Befreiungsoperation kam es zu Verwerfungen zwischen Bagdad und Ankara. Derweil geht der IS in bereits befreiten Siedlungen zu Gegenoffensiven über. Der republikanische Präsidentschaftskandidat Donald Trump wertete die Operation bereits als ein „totales Desaster“. Wer wird kämpfen? Kampf gegen IS: Russland liefert Waffen an irakische Kurden Der Militärexperte Wladimir Jewsejew, stellvertretender Direktor des Instituts der GUS-Länder, betont, dass die Zahl aufgestellter Truppen an sich nicht aussagekräftig sei: „Die Kurden haben gar nicht vor, Mossul zu befreien“, sagt er. „Sie haben kurdische Gebiete im Stadtumland eingenommen und gehen keinen Schritt weiter. Die Schiiten wird al-Abadi nicht nach Mossul lassen, um Massaker zu verhindern. Und die Türken – die schlagkräftigste Einheit von allen – werden die Stadt nicht stürmen, um eigene Opfer zu vermeiden“, erklärt der Experte. Es bleibe also nur die irakische Regierungsarmee. Dort blühe aber die Korruption und die Zahl der Deserteure sei hoch. „Von den angekündigten 60 000 Mann werden für die Eroberung Mossuls höchstens 30 000 bereitstehen“, sagt Jewsejew. „In einer vom IS stark befestigten urbanen Umgebung reichen diese Kräfte nicht aus.“ Zumal Mossul in westlicher Richtung offen sei, weswegen die IS-Kämpfer ständigen Nachschub bekommen könnten. „Bis zu den US-Präsidentschaftswahlen am 8. November ist die Stadt, anders als die USA es geplant haben, sicherlich nicht einzunehmen.“\\nDer Nahost-Experte und Politologe Leonid Issajew von der Higher School of Economics ist ebenfalls der Ansicht, dass ein langanhaltender Kampf bevorstehe. „Erst wird man um die Provinz, dann um die Stadt Mossul und dann um jeden einzelnen Stadtteil kämpfen müssen“, sagt er. Die Schlacht werde sich über Monate hinziehen und viele Opfer fordern. Sunniten gegen Schiiten Syrien-Frieden in der Krise: Wie geht es nun weiter? Doch auch wenn der IS in Mossul bezwungen werden sollte, werde das den Irak nicht befrieden, so die Experten. Mit großer Wahrscheinlichkeit würde vor Ort ein neuer – konfessioneller oder ethnischer – Konflikt ausbrechen. Die schiitischen Einheiten hätten in den letzten zwei Jahren die sunnitische Bevölkerung nach der Befreiung vom IS massakriert – wegen der Kooperation mit dem Feind. Die Kurden verfolgten ihre eigenen Interessen: Sie expandierten territorial, wenn sie irakische Städte und Dörfer befreiten. Die arabische Bevölkerung werde verdrängt und kurdische Siedler nähmen ihren Platz ein.\\nWie die Nachkriegsordnung in Mossul aussehen könnte, ohne dass es zu ethnischen und religiösen Säuberungen kommt, sei eine nicht weniger wichtige Frage als der Kampf gegen den IS. Wenn viele Religions- und Stammesgruppen nicht der Regierung in Bagdad unterstünden, sei eine solche Ordnung nicht ohne weiteres zu erreichen. Angst vor irakischem Aleppo Machtspielchen auf höchster Ebene: Der Syrien-Konflikt im UN-Sicherheitsrat Ein weiteres Problem: In Mossul verbleiben viele Zivilisten. Seit Beginn der Offensive wurden infolge von Luftschlägen der Koalition bereits Todesopfer unter der Zivilbevölkerung gemeldet.\\nJewsejew betont, dass zivile Opfer beim Bombardement von Städten praktisch nicht zu vermeiden seien. Washington verstehe das und versuche eine ähnliche Situation wie in Aleppo zu vermeiden. Dort beschuldigt der Westen Russland und Syrien, Luftschläge gegen die Zivilbevölkerung zu fliegen. \\n„Die Amerikaner erklären bereits, sie wollten nicht, dass sich Mossul in ein zweites Aleppo verwandele. Deshalb werden sie die Luftschläge auf ein Minimum zurückschrauben“, sagt Issajew. Zugleich stünden die Vereinigten Staaten vor einem Dilemma: „Das Bombardement führt zu mehr Toten unter den Zivilisten. Bleiben die Luftschläge aber aus, erleiden jene Kräfte Verluste, die die Stadt am Boden stürmen: Washingtons irakische Verbündete. Das erschwere die Einnahme Mossuls und die Koordination der Bodentruppen, so der Experte. RBTH-Check 37 bis 38 Millionen Menschen leben derzeit im Irak. Der Großteil – 75 bis 80 Prozent – sind Araber. Die Kurden sind mit 15 bis 20 Prozent die größte ethnische Minderheit. Sie leben in der Region Irakisches Kurdistan im Norden des Iraks, die seit Kriegsausbruch de facto von Bagdad unabhängig ist. Die Schiiten sind die größte Religionsgemeinschaft des Iraks – sie machen 60 bis 70 Prozent der Bevölkerung aus. Die Sunniten sind eine große Minderheit – 30 bis 40 Prozent. Der Islamische Staat bekennt sich zum sunnitischen Islam und betrachtet Schiiten als Häretiker. Der Norden des Iraks, insbesondere Mossul, wird überwiegend von Sunniten bewohnt. Alle Rechte vorbehalten'"}, "time": 1742562193.2594273}