{"duration": 0.035845279693603516, "input_args": {"text": "'It has been reported for several months that Jon Ossoff, the Democratic candidate seeking to win the special election in Georgia’s Sixth Congressional District on Tuesday, does not live in the district. [Last month, an Ossoff campaign worker told volunteer canvassers that if asked about their candidate’s residence, they should say that “he lives three blocks from the district. ”  (Beginning at the 55 second mark in this YouTube video, the Ossoff campaign worker says, “This falls into the category of if you don’t know, you can say I don’t know. But, yeah, I mean, he lives three blocks away from the district. ”) Brent Scher, an intrepid reporter for the Washington Free Beacon, put that Ossoff campaign claim to the test on Monday, and discovered that the actual distance from Ossoff’s residence to the Sixth Congressional District is three miles rather than three blocks: I set out to walk from Ossoff’s current residence in the northwest corner of Emory University to a section of the sixth district (outlined in green in the below screenshot) that juts down into the fifth district on Buford Highway. It would have been a shorter trip, by the way, to Georgia’s Fourth Congressional District, but that’s not where Ossoff is running. I drew myself my own little map, knowing that my phone would be taxed by my attempt to put the entire quest on Facebook Live, and set out at 10:32 a. m. for the International Cafe, which I determined to be the closest landmark inside the sixth district. I documented the early parts of my journey in the above video, but eventually the treacherous conditions of the long walk were too much for my Motorola Droid Turbo to handle. Shortly after my attempts to Facebook Live crashed and burned, my entire phone followed suit. Scher says he arrived at the International Cafe, “the closest landmark inside the sixth district,” after walking for about two hours. He took an Uber back to where he had parked his car to begin his walk. “My Uber from the International Cafe back to my car, which was parked by Ossoff’s place, was 6. 55 miles and took 18 minutes and 45 seconds. My walk was about 3. 2 miles,” Scher wrote. “A lot longer than 3 blocks,” Scher concluded. The outcome of Tuesday’s election between Ossoff and Karen Handel, the Republican candidate, remains too close to call.'"}, "time": 1742628342.2696722}