{"duration": 0.11489272117614746, "input_args": {"text": "'The fiction podcast is having a moment. But modern audio dramatists have been turning out intriguing scripted podcasts for several years, and they’re showing no signs of slowing down. Take a guided tour through the past, present and future of audio drama with these fictional standouts. “The Truth” bills itself as “movies for your ears. ” This anthology series, which tells stories through subtle sound effects and naturalistic acting, was ahead of its time at its 2012 debut. Typically, each episode places new characters into short capsule tales. But recently “The Truth” introduced an   series, “Songonauts,” about musicians in a struggling band who are unexpectedly transported into their own songs. Listen here. “Welcome to Night Vale,” which also began in 2012, takes the form of a darkly funny radio show, broadcast from a town where every conspiracy theory is true. Its   vibe  —   just a narrator, a script and some music  —   is matched by its bizarre storytelling form. At first, listening to “Welcome to Night Vale” feels like tuning into a disoriented beat poetry session, but with every episode, listeners get drawn closer into this community, its characters and their strange dealings. Listen here. “Limetown” is a 2015 podcast that follows the story of a radio reporter with American Public Radio, who sets out to solve the sudden and mysterious disappearance of 300 people in a Tennessee town. Though it’s one of several fictional podcasts released last year to borrow the aesthetics of the   podcast “Serial,” this one is still an exciting debut from   Productions, an upstart fiction podcast studio that’s poised to expand with a slate of scripted series next year. Listen here. “The Message” is the first fiction series to come out of a partnership between the   podcast network Panoply and the sponsor, General Electric. The collaboration is branded G. E. Podcast Theater, harking back to the old, Ronald   radio and television anthology series General Electric Theater. “The Message” felt more moneyed than many of early fiction podcasts, boasting cinematic sound design and a tense plot that felt borrowed from peak TV, and it was rewarded with a No. 1 slot on the iTunes charts last year. Listen here. “Alice Isn’t Dead,” a haunting new tale from the creators of “Welcome to Night Vale,” was released earlier this year under their new podcast imprint, Night Vale Presents. “Alice Isn’t Dead” follows a woman as she sets out on a frightening and fantastical road trip in an effort to track down her missing wife. Listen here. “The Orbiting Human Circus (of the Air),” the latest offering from Night Vale Presents, is a surreal series set in the world of an absurdist   variety show. Created by Julian Koster of the band Neutral Milk Hotel, the series features John Cameron Mitchell alongside guest stars like Tim Robbins (who voices a cricket) and Mandy Patinkin (who sings). Listen here. “A Night Called Tomorrow” stars James Urbaniak, the actor and host of the beloved monthly podcast “Getting On. ” This noirish scripted series, which also features comedy luminaries like Andy Richter and “Weird Al” Yankovic, is being released exclusively through Howl, an audio subscription service that offers up dozens of nonfiction podcasts, original fiction pieces and comedy albums for $4. 99 a month. Listen here. “Fruit” comes from the mind of Issa Rae  —   the creative force behind the YouTube series “The Misadventures of Awkward Black Girl” and the new HBO comedy “Insecure. ” It tells the intimate story of an athlete, known only as “X,” who grapples with issues of sexuality in the hypermasculine world of pro football. This is another Howl subscription offering Season 2 had its debut last month. Listen here. “LifeAfter,” the second scripted series from Panoply and GE Podcast Theater, is a   piece that plays with ideas of life, death and artificial intelligence. Its vibe recalls the grounded technodystopias of “Black Mirror” and “Her. ” It has its premiere on Sunday, Nov. 13. Subscribe here. “Homecoming” is the first scripted podcast from Gimlet Media, home to series like “Reply All” and “StartUp,” and is billed as a “psychological thriller” and cast with   actors. Oscar Isaac and Catherine Keener play an army vet and his therapist who come together as part of a strange and   new government program. David Schwimmer, David Cross and Amy Sedaris also appear. Subscribe here in advance of the premiere on Wednesday, Nov. 16. “Serendipity” is a preview of audio drama’s future. Every month the hosts, Anne Heppermann and Martin Johnson, celebrate innovative audio fiction from around the world. Listen here.'"}, "time": 1742561632.611136}