{"duration": 0.06111955642700195, "input_args": {"text": "'Cable industry analysts have debated the fall of ESPN for months, especially after its recent shedding of over 100 jobs. There has been much speculation that the network’s liberal tilt has alienated viewers, even as liberals scoff at the notion. But, statistics now show that ESPN really has lost viewers over its constant infusion of   politics into its sports coverage. [For several years,   news outlets, including Breitbart Sports, have said that ESPN’s   politics is driving viewers away, but many of these claims have been made on anecdotal evidence as millions of sports fans take to social media and the press to complain that ESPN won’t “stick to sports. ”  Recently, a poll emerged showing that Republicans have begun to turn away from ESPN, but now we have some of the first hard data to prove that, yes, ESPN has lost viewers over the last few years, a time coinciding with the network’s growing amount of liberal content. According to TV data service Deep Root, viewers that identify as Republican really have quit watching the cable sports network. Deep Root focused on a swing election state to gather its viewership data over a   period. “We analyzed viewership data in a large media market in a swing state (Cincinnati, OH) for the entirety of 2015 and 2016,” Deep Root reported this week. “Also, to control for any changes in partisan identification between 2015 and 2016, Deep Root Analytics analyzed viewership among the same audiences across both years. ” Its data shows that at least in the Cincinnati market, ESPN’s audience has become far less Republican. Specifically, in 2015, the ESPN audience on average skewed Republican across all dayparts, ranging from 12% more Republican (Early News, Late Fringe, Overnight) to 21% more Republican than Democratic (Early Morning). In 2016, every daypart on ESPN became less conservative, with Daytime being only 2% more Republican than Democratic, while Late Fringe and Overnight programming became 10% and 12% more Democratic than Republican  —   a 22 and 28 point shift, respectively. The same is true across other ESPN properties. ESPN2 skewed Republican across most dayparts in 2015 in 2016 all dayparts skewed Democratic. Every daypart also switched on ESPN News from 2015 to 2016. ESPNU was the only network that retained its mostly Republican audience. ESPN Deportes  —   the network’s   channel  —   became even more Democratic in 2016 than it already was in 2015. The Cincinnati market is likely indicative of many TV markets across the country. Deep Root does acknowledge that ESPN faces far more troubles with its business model than just losing viewers over politics. But, this data is the first evidence that ESPN’s liberalism has hurt its bottom line, at least with some viewers. The accusation now has a long lineage. Along with several years of complaints among conservative media outlets, the accusation that ESPN has become too political was at least strong enough to cause the network’s own ombudsman to address the network’s leftward tilt. Last year, ESPN ombudsman Jim Brady published a long piece exploring the the network’s liberalism. In the end, Brady decided his network had no problem with liberalism. However, even in his piece, Brady quoted ESPN President John Skipper, a former employee at   Rolling Stone magazine, as insisting that the network had little intention of putting the brakes on its liberalism. “It is accurate that the Walt Disney Company and ESPN are committed to diversity and inclusion,” Skipper said. “These are   values that drive fundamental fairness while providing us with the widest possible pool of talent to create the smartest and most creative staff. We do not view this as a political stance but as a human stance. We do not think tolerance is the domain of a particular political philosophy. ” So, even if more data emerges showing that its liberal content is hurting its bottom line, Skipper’s comments can be taken as an indication that ESPN has not yet learned its lesson that fans are sick and tired of politics ladled over the top of their sports coverage. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742628462.4765537}