{"duration": 0.04091382026672363, "input_args": {"text": "'You are here: Home / political cartoon / The FBI and DOJ Summed Up By One BRUTAL Cartoon The FBI and DOJ Summed Up By One BRUTAL Cartoon October 27, 2016 Pinterest \\nC.E. Dyer reports that FBI Director James Comey proclaimed in a congressional hearing last week that he didn’t want to be called a weasel and has vociferously defended the “integrity” of the FBI’s investigation into former Secretary of State Hillary Clinton for mishandling classified information and subsequently destroying evidence. \\nIt appears that many in the FBI aren’t too happy with their leader, with some even coming forward to vent their anger after Comey, who apparently doesn’t know that the buck stops with him, threw his career agents under the bus during the hearing when he said, “so if I blew it, they blew it, too.” \\nUnless those career FBI agents made deals with the Clinton mafia too (allegedly, I guess…), they didn’t “blow it” like Comey did. \\nRetired agent Dennis V. Hughes, who was the first chief of the FBI’s computer investigations unit, told the New York Post : “In my 25 years with the bureau, I never had any ground rules in my interviews.” \\nHughes’ comment echoed the reports that have trickled out that FBI agents were extremely frustrated by the way the investigation was conducted, or better yet, not conducted and the way agents had their hand tied behind their backs as they attempted to investigate. \\n“The FBI has politicized itself, and its reputation will suffer for a long time,” Hughes said. “I hold Director Comey responsible.” \\nRetired FBI agent Michael M. Biasello told the Post: “Comey has single handedly ruined the reputation of the organization.” \\nBiasello pointed out that, had he and other agents done what Clinton did with classified information, the outcome would have been very different: \\nEach month for 27 years, I received oral and computer admonishments concerning the proper protocol for handling top secret and other classified material, and was informed of the harsh penalties, to include prosecution and incarceration. \\nHad myself or my colleagues engaged in behavior of the magnitude of Hillary Clinton, as described by Comey, we would be serving time in Leavenworth. \\nComey, who has shouted from the rooftops that the investigation was on the up and up, made the 25 agents who investigated the case sign non-disclosure agreements. \\nFrom top to bottom, this investigations was conducted in a way that was meant to be extremely Clinton-friendly. There was never any intention of prosecuting Clinton for her crimes and the way the investigation was handled reeks of a cover-up. \\nThe “investigation” was plagued by five immunity deals that weren’t revoked when the grantees were less than truthful and open, the FBI conspiring to destroy evidence, Clinton getting a cozy witness interview on a holiday, onerous ground rules for interviews, limiting the scope of the investigation to certain dates so as not to reveal critical evidence, and more. \\nWhile Martha Stewart was sentenced to prison thanks to then-federal prosecutor James Comey, Clinton has faced no consequences for her crimes. \\nGee, what changed Comey? He was awfully aggressive in Stewart’s case, but with Clinton he rolled over. Some may say he didn’t want to be another Clinton casualty, but that’s not the impression I get from Comey, who doth protest too much. \\nIt seems like a massive cover-up for political reasons that may have required Clinton to dip into the family slush fund, or make another such deal, for the whiny weasel. \\nAs more and more FBI agents speak out in addition to further information about the cover-up trickling out, it will be interesting to see how Comey explains it away or if he steps down — which he should absolutely do.'"}, "time": 1742628508.9504302}