{"duration": 0.1112067699432373, "input_args": {"text": "'In a Tony Awards night shadowed by the tragedy in Orlando, Fla. prizewinners and other performers worked hard to strike a balance between joy and reflection. Here are some moments to remember: Soon after delivering a tremulous speech addressed to the TV audience (“Hate will never win”) the Tonys host, James Corden, dove into a breathless   of 20 Broadway hits, concluding with some elegant hoofing to “We’re in the Money” from “42nd Street. ” “Think of tonight as the Oscars, but with diversity,” Mr. Corden joked in his opening monologue. And the show delivered: In a first for Broadway, Tony voters gave the four musical performance awards to black actors: Cynthia Erivo of “The Color Purple” and Leslie Odom Jr. Renée Elise Goldsberry and Daveed Diggs of “Hamilton. ” In his acceptance speech for best score for “Hamilton,”   Miranda provided the broadcast’s emotional high point, reading a sonnet he had written that cited “senseless acts of tragedy” and included the repeated “and love is love, is love, is love, is love” that brought down the house. Asked later why he decided to address the situation this way, he said: “We live in this world where beautiful and horrible things exist at the same time. You can’t let that go by, particularly when theater doesn’t exist without the L. G. B. T. community. ” Not only did a pregnant Audra McDonald tap her heart out in the “Shuffle Along” production number, she later presented the prize for best actress in a musical  —   a category in which she was overlooked. With six Tonys already, it’s easier to take things in stride. In winning best leading actor in a play for “The Father,” Frank Langella tied Boyd Gaines for the most Tonys won by a male actor. He used his acceptance speech to movingly remember the victims of the massacre in Orlando, Fla. “I’m now a    man, and I react to things a lot more profoundly than I did when I was 60, when I was 50 or 40,” Mr. Langella said. “This constant violence and sense of madness that seems to be pervading this country is terrifying. ” He continued: “I urge you, Orlando, to be strong. I’m standing in a room full of the most generous human beings on earth, and we will be with you every step of the way. ” Mr. Langella’s other Tonys were for his roles in “Seascape” (1975) “Fortune’s Fool” (2002) and “ ” (2007). The costume designer William Ivey Long said he scrambled to make some 3, 000 commemorative ribbons in the basement of the Beacon Theater, where the ceremony was held. In an interview on the red carpet, Mr. Long said the ribbons were a small way for Broadway to show its support for the victims and their families in Orlando. ”You’re helpless because you’re here,” he said. “We wanted to open our arms and show love, that we understand. ” Mr. Diggs almost upstaged his own acceptance speech by wearing a jacket with gaudy patchwork sleeves that you almost couldn’t take your eyes off. Meanwhile, Barbra Streisand’s   look seemed almost a spoiler, giving the nod to “Hamilton” as best musical before she’d even opened the envelope. She joked, “Thank God I picked the right outfit. ” As the camera panned to show nominees for best director of a musical, it focused on the actor Christopher Fitzgerald, not Michael Arden, the director of “Spring Awakening. ” Mr. Arden later tweeted: “If you know anything about me I’ve spent the last 10 years of my life  —   what some would consider the lifeblood of a woman’s career  —   just trying to have children. And I get to testify in front of all of you that the Lord gave me Benjamin and Brielle and then he still gave me this. Thank you. ”  —   Ms. Goldsberry accepting her Tony. From the show’s opening number, in which Mr. Corden glanced back fondly on his formative years as a bespectacled kid with big dreams, parents were paid tribute throughout the night for the encouragement they offered and sacrifices they made for their   sons and daughters. In his acceptance speech, Mr. Diggs thanked his father for joining him in a preschool gymnastics performance in which they both wore “matching rainbow tights,” and his mother for “permission to do something that everyone else wasn’t doing. ” Later in the program, Mr. Corden found his father in the audience and asked him how he thought the show was going. “It’s great, mate,” he replied, “but it’s going on a bit, isn’t it?” Compiled by Mike Hale, Scott Heller, Charles Isherwood, Dave Itzkoff and Erik Piepenburg.'"}, "time": 1742564168.4797287}