{"duration": 0.21124792098999023, "input_args": {"text": "'Home » Headlines » Finance News » Investment Strategist Forecasts Collapse Timeline: ‘The Last Gasp Will Come In 2018’ \\nYou have about a year to get ready for the next leg of the collapse… \\n\\nFrom Mac Slavo, SHTFPlan : \\nIt is no longer a question of whether or not financial markets and the U.S. economy will collapse. That, according to a host of experts, both mainstream and alternative, is a given. \\nThe only question now is “when” that moment will come. \\nAccording to Christine Hughes, chief investment strategist at Otterwood Capital, it will be very soon. Basing her assessment on historically dead-on yield curve analysis, Hughes says in her latest update to clients that we’re looking at a maximum breaking point of 2020, but that some time in the next 12 – 15 months is the more likely scenario, which pegs the next crisis right at the beginning of 2018 . \\nFirst, the chart, which has been near perfect in its accuracy thus far and shows just how rapidly the yield curve has collapsed in the last 12 months: \\nHughes explains what it means for you and why you can expect 2018 to be the year of reckoning: \\nAs the bond market sees a recession slower growth means lower interest rates and it [the yield curve] collapses. So let’s assume we’re like every other time in history and that happens. Then it moves forward to 2018… \\nSo, 2018, according to the yield curve, is pretty much the last gasp we have for this economic cycle. We’re closing in on 2016 now… we basically have a year… maybe a year to 15 months before we have the next crisis on our hands. \\nSo if you are levered personally or corporately… if a lot of your assets are in illiquid stuff… the Canadian housing market comes to mind… You might want to think about existing and liquefying yourself. \\nWatch the video report: \\nWolf Richter of Wolf Street explains why the Treasury Yield Curve is so important: \\nSince early July, the 30-year US Treasury Bond Price Index has plunged 8.3%. It’s now called “the rout” in longer-dated government bonds. One of the specters is rising inflation at a time of ultra-low yields. \\nWhat has become the number one predictor of a bear market in stocks over the past many decades? The US Treasury yield curve. It drives bank lending – which can strangle the economy. But this time, the risks are much higher, and the potential economic consequences steeper. \\nWe know it is only a matter of time at this point. \\nGreg Mannarino of Traders Choice has made similar warnings, noting that the bond markets are signaling a massive crash ahead. And when that crash finally takes place the fall out after the debt bubble bursts, according to Mannarino, could lead to extremely serious consequences: \\nSo, when the debt bubble bursts we’re going to get a correction in population. It’s a mathematical certainty. \\nMillions upon millions of people are going to die on a world-wide scale when the debt bubble bursts. And I’m saying when not if… \\n… \\nWhen resources become more and more scarce we’re going to see countries at war with each other. People will be scrambling… in a worst case scenario… doing everything that they can to survive… to provide for their family and for themselves. \\nThere’s no way out of it. \\nSource: Analyst: “Millions Upon Millions of People Are Going to Die on a World-Wide Scale When the Debt Bubble Bursts” \\nIf Mannarino and Hughes are right, you have about a year to get ready for the next leg of the collapse . \\nBuy 2017 Gold Pandas and Buy 2017 Silver Panda Coins On Pre-Sale Now! Secure Your 2017 Panda Coins Today at SD Bullion!'"}, "time": 1742564371.143758}