{"duration": 0.189971923828125, "input_args": {"text": "'Leave a reply “ Every gun that is made, every warship launched, every rocket fired signifies in the final sense, a theft from those who hunger and are not fed, those who are cold and are not clothed. This world in arms is not spending money alone. It is spending the sweat of its laborers, the genius of its scientists, the hopes of its children. This is not a way of life at all in any true sense. Under the clouds of war, it is humanity hanging on a cross of iron. ” ~ President Dwight D. Eisenhower \\nCatherine Austin Fitts – We are experiencing an unprecedented disgorgement of documentation on the Clintons and various aspects of their enterprises – from the Clinton Foundation to Hillary Clinton’s campaign for the Presidency. \\nIt is worth noting that there appears to be a method to the madness. A variety of parties, including Project Veritas, Anonymous, and Wikileaks are systematically targeting Clinton’s key lieutenants. This is the equivalent of taking out the pawns before going in to capture the queen. \\nFirst we see DNC Chairman Debbie Wasserman Schultz taken out by leaks from Wikileaks. It remains to be seen as to whether this info hit cost a DNC staffer his life with a real “hit.” \\nWasserman is replaced by CNN political analyst Donna Brazile as Interim Chair who has now been outed for sharing debate questions with Clinton. While CNN has disavowed Brazile, cheating on the debates does not appear to warrant a resignation as Interim Chair. Yet again, the week is young. Needless to say, the present value of Brazile’s future income is nosediving badly as I write this. \\nWasserman and Brazile desperately need Clinton to win – otherwise they’re toast. \\nProject Veritas has outed significant Democratic covert operations – including related PACs overstepping what are supposed to be their legal authorities (marketing influence) and arranging for violent protesters at Trump rallies. By tying the lead covert operator directly to Obama and the White House (45 visits by Robert Creamer to Obama at the White House since 2008), there is no doubt a chill between the campaigns covert operations and the leadership, tying a lot of hands during the last two weeks of campaigning \\nThere there is Huma Abedin – since 1996, Clinton closest aide and assistant. Abedin like numerous other Clinton allies now has a world of legal problems and liabilities from divorce court to criminal investigations of herself and Clinton. The press reports she is now being left behind by the campaign. It is going to be very hard for Huma to be entirely focused on the campaign. Instead she is going to be wondering about the 650,000 e-mails on Anthony Weiner’s laptop, what’s in them and how they got there. \\nThen there is Campaign Chairman John Podesta who has been barraged daily by Wikileaks leaking of years of e-mail. It is now likely that no one wants to e-mail with him, not to mention the hard feelings created and his own potential legal problems, particularly if Clinton loses. \\nThen there is attorney Cheryl Mills who has real reason to be concerned with her own legal position now that the e-mail investigation has been re-opened by the FBI. Just when she thought she had the team in the clear! \\nDNC Chair, Campaign Chair, personal attorney, covert operations capacity, personal assistant – all are compromised with six more days to go. \\nNow come leaks that Clinton loyalist and campaign chief financial office Gary Gensler is being sidelined for the upper echelons of the Cabinet – Larry Fink is in the lead for Secretary of Treasury. Given the risks that Gensler is taking with his personal fortune and reputation to manage the campaign finances, this is quite a kick. To be replaced by one of Wall Street’s worst because he is too tough on Wall Street. Why should Gensler take any risk under the circumstances? \\nIt is a bad sign when insiders start competing for Cabinet posts before the campaign is won. \\nThen there is the potential First Gentlemen – Bill Clinton. Numerous reports are now spending lots of time digging into Clinton’s relationship with convicted pedophile Jeffrey Epstein. Now that the Democrats have made allegations of sexual harassment an approved tactic, Clinton is fair game. It is only a matter of time and effort before more dishes out on Clinton at a time when most men are thinking about their legacy. \\nDaughter Chelsea has been pulled in as well with e-mails about the Foundation’s operations designed to create bad feelings between Chelsea and the staff. Given the millions spent on Chelsea’s wedding while the Haitian people were staving and dying as the proceeds of the Foundation fundraising for Haiti went someplace other than Haiti, Chelsea is likely not to command much sympathy. \\nAdd to this list long time political operative Doug Band who has to be scrambing to cover his overhead now that his memos and questions about his involvement in “pay to play” are smeared across the Internet. Other operatives have been targeted as well, including Neara Tanden. \\nFinally, there is the equivalent of the campaign “king” protecting the queen – President Obama himself. He has been warned, with one of the most damaging Wikileaks providing evidence that he was e-mailing Clinton on her private server from his private e-mail account. His statement that he did not know she had a private e-mail server was proven false. This leaves him compromised before Comey’s announcement of the reopening of the investigation. It was a clever tactic, because now Obama has to be careful. Given Attorney General’s compromise of the first investigation by a meeting with Bill Clinton that likely represents an obstruction of justice violation, among other violations, the Administration is exposed. \\nClinton’s greatest ally at this point is the corporate media who appears for the most part to have doubled down for Clinton. This is likely because they take their orders from their owners and until Mr. Global (or Ms. Global) pull the plug, the corporate establishment is all in for Clinton. It does not matter what extraordinary documentation of obstruction of justice, compromise of national security and classified intelligence, pay to play or violations of RICO statutes (to name a few) have come to light. They do not care. They do what they are told. What they are told is to get Clinton elected. Make a Clinton presidency appear inevitable, no matter what. \\nMeantime, on the other side of this effort is amassing on line media and Internet activists who have decided to convert the Clinton into the poster children of US government and establishment corruption. For some, such as Julian Assange, this is a fight to the death. Clinton has made it clear that she would like to “drone” Assange. There are more than a few indications that there is support from the intelligence and enforcement community. \\nThere efforts so far has made clear that they run into serious opposition when they leak evidence about Clinton’s role in operations that compromise the integrity of the Administration – such as Benghazi and support to ISIS. This may explain why increasingly what we are watching is leaks related to criminal shenanigans that can be scripted to Clinton team more narrowly. \\nAnother group that is doubling down for Clinton as this occurs are a segment of women voters. We are hearing an outcry of women saying that this is happening to Hillary Clinton because she is a woman. In short, what is happening is sexist. They seem not to care about what happened to the women in Libya or Haiti or the mothers whose children were rounded up and put in slave labor camps during the Clinton Administration. The mind control around this seems to be a serious last ditch effort to avoid facing the reality of our situation in America. It would be appalling if it were not so frightening. \\nAs compromised as Team Clinton is, as long as they maintain their establishment backing, their only choice is to do everything they possibly can to win the election. While the investigations will not stop if they are elected, they will be in a better position to deal with them if they have government resources to affirm and maintain their ongoing criminal enterprise. \\nSo this raises the question as to what the attacking team has that constitutes a “kill shot” to take out the queen. Wikileaks and the assembled swarm as six more days – five really, to engineer their best shot. If you watch Campaign Whack-O-Mole to date, these folks are clearly building up to a kill shot. The question is what is it and will they be able to get it out and about on the Internet. \\nWhich leads us to the last question – one that is being asked a lot these days. To what extent can the Democratic party and their allies rig the election through compromised voting systems? According to George Soros in a recent interview with Bloomberg, the fix appears to be in though the Electoral College. \\nThis leaves us with two possible endings to Campaign Whack-O-Mole: Trump Wins: In this case Trump appoints a special prosecutor and we can look forward to years of illumination regarding the Clinton interests. Clinton likely will do jail time, unless the establishment can persuade Trump to let her off the hook. Hopefully, we will have a chance to cleanse Washington of the Neocons for good. Clinton Wins: In this case there is only one thing that the Republican Congress can do to redeem themselves in the electorates eyes – particularly if the Republicans won the popular vote in the presidential election – move for investigation and impeachment. What happens depends on the national security bureaucracy at the intelligence and enforcement agencies. If they support Clinton, the Republicans will likely be marginalized. This will be a dangerous situation. Traditionally, the way the Clintons and related allies win in these situations is to kill people or to target them with legal and financial torture and physical harassment. If the national security bureaucracy supports the House Republicans, Clinton will likely be impeached. However, this will come with a disgorgement of dirt the likes of which America has never seen. The way that Clinton can consolidate her power and command bureaucracy loyalty – including the banks and defense contractor who increasingly control the nuts and bolds of federal operations – is to have a war with Russia. \\nI am waiting for the women who support Clinton because she is a woman explain to me why WW III is good for women. \\nSo let’s see what the next six days bring. In the great game of campaign whack-o-mole, the situation is very fluid. SF Source Solari Report Nov. 2016 Share this:'"}, "time": 1742563714.5524998}