{"duration": 0.12331366539001465, "input_args": {"text": "'Leave a reply \\nGreg Rosenthal – I’ve been watching ridiculous stories on the “hacked” emails of Hillary, John Podesta, et al, and I think it’s time to insert a bit of reality to the discussion. So, if you have any interest in this, here are some points to consider: 1. Anyone could have hacked Hillary. \\nPeople ask me, “Do you think it was the Russians who hacked Hillary?” I tell them that I have no idea who did it, but, “Yeah, sure, it could have been the Russians. Given the lack of security on her server, however, it could also have been the teenager down the street.” \\nHillary’s server was more or less wide open. Given enough motivation and a bit of time, any reasonably technical person could have stolen those emails. In the words of one specialist, Hillary’s server was “ total amateur hour .” How that happens for a Secretary of State (or a President) is a rather serious question. \\nBear in mind that this would be the right setup for purposely leaking information while still being able to claim ignorance, or at least incompetence. I have no idea whether that’s true or not, but I do have to wonder. 2. No one broke into Podesta’s computer. \\nJohn Podesta, by all available information, wasn’t hacked, as most people envision hacking. Instead, he fell for a phishing scheme . Someone pretending to be Google suckered him into giving them his password. (You didn’t really think the elite were smarter than the rest of us, did you?) \\nOnce the phishers had Podesta’s password, the rest was simply a vacuuming operation. Then came some kind of handoff to Wikileaks, and the rest was history. And there will be fallout from this for a long time, whether or not media sellouts allow it to be reported. Lots of people are insulted and exposed in those emails. 3. Google has plenty of it. \\nJohn Podesta, if you’ve noticed, used a gmail address, meaning that Google sucked his messages up as they were being written – all of them. They also had a ton of Hillary’s “lost” emails. Google literally owned every email from these addresses and dozens of others involved: \\njohn.podesta@gmail.com, cheryl.mills@gmail.com, brianefallon@gmail.com, lauren.elena.smith@gmail.com \\nAnd perhaps more importantly, they have everything from bigcampaign@googlegroups.com. \\nPlease understand that Google processed those messages for profitable information immediately. If you have any doubt on this point, consider this: How long does it take them to show you ads for ski resorts after you search for ski boots? \\nPlease don’t imagine that they don’t look at political things; those are far more valuable than your skiing habits, and Google survives by mining information. (In other words, they grab everything they can… which you agreed to in their terms of service.) Google doesn’t charge for your searches, do they? And yet they bring in billions of dollars per month. \\nThis is a useful question: What might you do with tens of thousands of emails to and from insiders and acres of computers to sort them all? Well, that’s about what Google’s doing. 4. NSA has it all. \\nThe NSA has almost everything. We’ve known for a decade or more that they were simply copying everything that went through AT&T facilities . Their data center in Utah was built to store and search all those communications. \\nWilliam Binney , formerly a senior official at NSA, says that it was probably an intelligence worker behind the DNC leaks, and he might be right – they have it all. \\nThe NSA, put simply, is the largest hacker collective on the planet. They can take over more or less what they want, when they want. 5. Other people have the emails. \\nAll those “lost” emails had recipients, didn’t they? Sure they did, and all those people – and their email servers – have or had copies of everything. And yet I’m not aware of any effort to gather them all up. \\nThis guy says hackers used his servers and that he has records… and that no one from the FBI has bothered to call him. 6. Julian Assange is a front man. \\nAnother good thing to understand is that Julian Assange is the face of Wikileaks, but he doesn’t do all the work himself, and he’s not manning the switches. Lots of other people are doing the daily work. Julian just volunteered to stand in front. And given what’s been happening to him over the past six years or so, you have to say that he’s one seriously brave and tough guy. \\nOne thing Julian gets solo credit for is exposing the Google-State Department connection. (Or perhaps partnership is a better term.) If you’d like the details, see this book by Assange . It’s pretty damning. \\nAnd, by the way, Google’s bosses have visited the Obama White House literally hundreds of times . And Eric Schmidt (Google’s big boss) is very close to the Hillary campaign . \\nSerious data protection requires a professional provider, not amateurs or hucksters. If you’re ready to be serious, Cryptohippie will let you try their service for free. One week, no credit card, no BS. Try it, then either buy or don’t. Use this link . \\nGreg Rosenthal is a Contributing Writer for Shift Frequency SF Source Freeman’s Perspective Oct. 2016 Share this:'"}, "time": 1742561995.3316448}