{"duration": 0.14412593841552734, "input_args": {"text": "'Bill White November 20, 2016 8 Things To Keep Under The Radar During A Blackout \\nMajor blackouts are becoming more and more common, according to data from the National Energy Administration. \\nOur aging power grid, along with ever-increasing demands for electric power are taking their toll on the electrical industry’s ability to keep us all supplied with power. \\nCurrently, the number of major blackouts per year doubles every five years. At that rate, we will soon find ourselves catching up with some third-world countries. We have an answer to help you out with this challenge. \\nWhile the major reason for this is our aging power grid, the problem is much more complex than that. Replacement of aging equipment is extremely expensive and the process filled with red tape. Energy companies find themselves bogged down for years in the quagmire of conflicting government requirements, on both a state and national level. \\nThis problem is becoming worse, with the massive amount of regulations that the Obama Administration has promulgated through his presidency. \\nThe EPA especially, has attacked the energy sector ruthlessly, especially the coal industry and coal power plants. \\nBut even this isn’t really our biggest issue with the grid, although it is an important issue. The biggest issue is that the grid is highly vulnerable. \\nAs a large, decentralized network, spanning the country, it is virtually impossible to protect. Even the minimal protections that are in place, have been proven to be ineffective. \\nThe fact is, our electrical grid is highly susceptible to damage, and it’s common knowledge that it is. \\nAny number of enemies could take out the grid, or larger portions of it, either through direct, kinetic terrorist attacks, cyber-warfare or a high-altitude EMP. Even the sun could take it out, with a Coronal Mass Ejection. We had a near miss on that as recently as last year. \\nWith so much risk to our aging power grid, it’s not a matter of if we’re going to be faced by a major blackout or even a semi-permanent one, but when we will be faced with it. Odds are catching up with us, bringing us to a place where we can all count on that happening to us sometime in our lives. \\nClearly, preparing for such an event, regardless of how it happens, has to be part and parcel of our disaster preparation. \\nAnyone who chooses to ignore this possibility is merely putting themselves and their families in the massive group of people who don’t prepare, because they expect the government to take care of them. In other words, they are planning on becoming victims of the blackout, rather than becoming ones who overcome the blackout. \\nBlackouts instill fear in people, as we all have a little bit of natural fear of the dark. Mankind was created to live and function in the daylight, not the night. \\nWhile we have learned and adapted to doing many things in the dark, a lot of that has been by overcoming the dark with artificial light. We simply function best, when we can see what we are doing. \\nBut what if you’re the only one in your neighborhood who can see what you’re doing? What if the lights go out, in a major blackout, and they stay out long enough that batteries in your neighbors’ flashlights go dead? \\nWhen they are sitting in the dark, cold and hungry, how are you going to protect yourself? \\nWhen the lights go out, so does everything else too. We depend on electricity for so many different things, that without it, society comes grinding to a standstill. \\nNot only do we lose the ability to do things at night, but we also lose our entire supply chain, because it depends on electricity for the flow of information, control, and even pumping the gas into the trucks and airplanes that make the deliveries. \\nSo losing power means losing pretty much everything we depend on in our modern, technology-based lives. \\nWe must always keep in the back of our minds that desperate people do desperate things. When the lights go out and the heat goes off, that feeling of desperation will begin to take root in their hearts. Bit by bit it will grow, fed by each and every thing that they find missing from their lives. \\nWhen they can’t get gas for their car, the desperation will grow a bit more. When they can’t buy food, because the grocery store shelves are empty, the desperation will increase. And when they turn on the faucet and nothing comes out, because there isn’t any electricity for the pumps, their cups of desperation may very well overflow. \\nThe best thing that any of us can do in such a situation is ensure that we don’t let anyone around us know that we’re better off than they are. \\nOPSEC will have to become our byword, as we quietly try to survive in the midst of them. Specifically, there are a number of things we will want to hide from those around us. \\n1. The Means to Create Light \\nThe first thing that people will notice is also one of the hardest to hide… light. That’s the first thing that anyone is going to turn on, when the power goes out. Whether it is flashlights, candles or oil-burning lamps, they’re all going to turn on some light. \\nThe problem is, their light will go out after a short time, perhaps a day or two. After that, any light you have will be extremely conspicuous. \\nIf the windows of every house on your street are dark and even a little light is coming out of yours, your house will seem like a lighthouse to those around. Their lack of light will make yours seem even greater. \\nExtreme light discipline will have to be the order of the day. You’re going to have to hide your light, and avoid using it in places where they can see. One key component of this will have to be blackout curtains on over all your windows. \\nRegular curtains won’t be enough, because they will look like they are lit up to people on the outside. You need curtains that are dark enough and heavy enough to block the light, so that your windows appear dark, like theirs. \\n2. Power Generation \\nMany of us have invested in either solar power or wind power, both to augment the electrical power we buy from our local utility company and as a means of producing power in a blackout. \\nBut a roof full of solar panels or a wind turbine sticking 30 feet up in the air in your backyard are easy to see, letting everyone know that you have power, when they don’t. \\nThat’s going to attract people like moths to an open flame. About the only thing that could be worse is a gas powered generator. \\nEven those who aren’t looking for your solar panels will hear that, especially considering how quiet it will be without cars running down the roads and entertainment systems blaring out music. \\nWhile I wouldn’t want to dissuade you from investing in solar or wind power, in the midst of a blackout you’ll actually be better off with something stealthy. A portable system, with the solar panels at ground level would fit that bill, as a fenced backyard would hide it pretty well. \\nYou can quietly provide power and keep your family safe during an outage   Hurry up and grab this offer right now to pay in monthly installments! \\n3. Solar Powered Anything \\nSpeaking of solar power, pretty much anything that is solar powered is going to be in high demand. Even if all you have is a solar charger for your phone, you can count on everyone around you wanting to use it. More major solar powered devices, such as a solar oven, will become very high on the list of things that people will want to steal. \\nOf course, the longer the blackout lasts, the more people there will be who will be willing to turn to stealing. So the threat for your solar oven being stolen will actually increase as time goes on, requiring more and more diligence to protect it. \\n4. Food and the Ability to Cook that Food \\nAs I already mentioned, the supermarket shelves will be bare, which will force people to use up whatever food they have stored within their homes. But what will they do when they’ve eaten the last of the popcorn and scraped the peanut butter jar dry? \\nMost preppers believe that people will turn to attacking one another and raiding other’s homes in search of food at this time. Small gangs will form, either neighbors working together or people who are friends who decide they can help one another. \\nIn either case, these gangs will be looking for food, more than anything else, and they won’t be reluctant to break into homes and hit the residents over the head to get it. \\nNot only will they be searching for food, but for the ability to cook that food. A large portion of the things we eat need to be cooked in order to be edible. \\nBut cooking in modern times is done with electricity or natural gas, both of which will be conspicuous by their absence. Barbecue grills will become the number one means of cooking… at least until people run out of propane or charcoal. \\nThat’s when the solar oven is going to become popular. Even without knowing how to use one, people will be quick to steal an unattended solar oven, thinking that they can figure it out. \\nOne of the problems with hiding your food is that cooking creates odors which will attract attention. \\nYou’ll need to be careful about this, avoiding cooking in ways that create odors. Meats are the worst for this, as they produce the most odor when cooking. But by cooking them in soups, you reduce the odor that passes through the air. \\n5. Water and the Means to Pump it Out of the Ground \\nWe really can’t talk about food, without talking about water as well. Water is a higher survival priority than food is, so people will be desperate for it much quicker. \\nIf you’ve got a river, lake or canal near enough to draw water out of, you’ll probably be safe. But if not, and people find out you have a well, they’ll be knocking on your door. \\nAt that time, you’ll have to make a decision. Will you provide water to your neighbors or not. A lot of that will depend on how good your well is and how effective a pump you have. \\nSharing water might be great for public relations, but there’s a danger there too. Some will thank you, while others might see it as an opportunity to take over your well. \\n6. Heat for Your Home \\nOne of the worst times to have the lights go out is in the wintertime. Then, light isn’t people’s biggest concern, heat is. \\nEvery year people die during the cold northern winters, either because there is no power to heat their homes or because they can’t afford to pay for heat. Sadly, this mostly happens to the elderly, who are the most vulnerable people in society. \\nWhen the power is out and people get cold, there’s a natural tendency to gather together, seeking to share whatever heat they have, even if it’s only body heat. That means that they’ll come knocking on your door, if they think you have heat. \\nDepending on how you are heating your home, doing so might be difficult to hide. \\nBurning wood, which is what most of us are planning to do, produces smoke, as well as the smell of burning wood. Just like the steak cooking on the barbecue grill, that smell will attract attention. \\nOne thing you can do to help alleviate this is to buy firewood that produces little smoke and odor. Different woods burn differently, producing different amounts of heat, as well as smelling differently. \\nYou’ll need to experiment a bit, but if you can find a low-odor wood, it will help. \\n7. Fuel for Your Car \\nAs the blackout progresses, one thing you can be sure of is that people will begin to migrate. The lack of news about what is happening elsewhere will cause people to wonder if things would be better, if they could just get out of the area where the blackout is. So, some will leave, trying to find a better place. \\nOf course, that means leaving in their cars and trucks. But without the gas pumps working, that’s going to be hard to do. Even so, they’ll try… mostly by stealing gas from others. \\nSome will siphon it out of gas tanks and others will try to pump it out of the gas station’s tanks with a manual pump. \\nThe best thing you can do to keep from losing your gas and even your car is to hide them. If you don’t have room in your garage, then put them in the backyard. \\nIf you can’t do that, then drain out the gas yourself and disable the car. Removing a tire and the battery, as well as allowing the car to get covered with a layer of dust, will go a long way towards making it look unusable. \\n8. Guns & Ammo \\nFinally, it would be a good idea to keep your guns and ammo out of sight. Some might think that being obviously armed would be a deterrent to attack. \\nWhile that might be true for the more timid in society, it would be just as likely to make others think that you must have something in your home worth protecting. For those people, your guns would be an advertisement, not a deterrent. \\nThat doesn’t mean that you should be unarmed, merely that you shouldn’t advertise the fact. Those will be dangerous times and you may very well need your guns to protect yourself. So, keep them close at hand, but keep them hidden at the same time. \\nMost people who carry concealed are actually against open carry of firearms. That’s not because they don’t agree with the implied right under the Second Amendment, but rather that they want the element of surprise. \\nIf someone doesn’t know what you’re carrying, they can’t prepare effectively to counter it. That gives you a huge tactical advantage, when the time comes and you bring your guns out of hiding. \\n\\n  Bill White for Survivopedia. 664 total views, 664 views today'"}, "time": 1742628554.694068}