{"duration": 0.07903504371643066, "input_args": {"text": "'Posted 10/31/2016 3:10 pm by PatriotRising with 0 comments The flood of illegal aliens pouring across the southern border has become a “crisis situation” and is even worse than the record 2014 border surge, says an Immigration and Customs Enforcement (ICE) officer from El Paso, Texas with more than ten years of service to the agency. \\n\\nThe ICE agency has no room to house the arriving surge, so many illegals are being released into American communities where they disappear “into the wind never to be seen by us again,” the agent said. \\n\\nThe agent—who spoke to Breitbart News exclusively on the condition of anonymity for fear of retaliation by the administration—detailed how his overrun agency has been forced to pull agents from their mission of removing criminal aliens from the nation’s interior, so that they can help process the cross-border influx of illegal aliens. \\n\\nThe illegal aliens, mostly from Central America, are using President Barack Obama’s policies to request asylum, work permits and green cards. Whereas unlawful aliens traditionally sought to evade border agents in hopes of reaching U.S. cities where they could illegally fill American jobs, reports document how many of these new migrants are now turning themselves in to border patrol agents believing they’ll be allowed to stay permanently. This 2016 influx of migrants from Central America had exceeded 117,000 by Oct. 1, marking a new record, Breitbart News reported . \\n\\nMany additional thousands of illegal aliens continue to pour across the border via smuggling routes that try to bypass the border patrol. In the 12 months up to October 2016, 271,000 illegal immigrants were caught trying to sneak across the border—but many others escaped arrest and made their way to U.S. workplaces and cities. \\n\\nICE is the agency responsible for enforcing federal immigration law by identifying and removing illegal aliens within the interior of the nation, as well as removing aliens apprehended at the border by border patrol. After an alien is apprehended by border patrol, the alien is then turned over to ICE, which processes and detains the alien. \\nAlthough the surge has been largely ignored by corporate media and unacknowledged by the administration, “the public’s safe is in jeopardy,” the agent warned. Migrants with histories of prior criminal offenses, plus “would-be perpetrators or terrorists whose intent is to harm Americans or our country as a whole” could be among those being released from ICE’s custody, the agent said. \\n\\nThe officer said he believes the reason corporate media refuse to cover the crisis is because “it’s an election year and [the media] have a politically-driven agenda. I don’t know why else it wouldn’t be covered—this is the worst we’ve ever seen it,” the agent said: \\n\\nThis is a crisis situation that is not being acknowledged by the administration or the media. I know we had a crisis situation in 2014, but this has this by far surpassed that. Our officers are overworked and overrun. We have had to move several officers from our interior enforcement programs in order to address and assist the officers who have to process all of the illegal border crossers and who are getting hammered by the crisis we’re facing down here. \\n\\n“The safety of the American public is at risk,” the officer warned. \\n\\nWould-be perpetrators have much more of a chance to make it through the system and into our communities. That’s a huge concern for us. I don’t understand why the administration and the media are not recognizing this as a crisis because that’s what it is. By removing officers from enforcement programs, the threat to the American public has increased exponentially… However many officers we move from enforcement programs to help address this crisis means that there are that many fewer people trying to find criminal aliens, and that poses a threat to public safety. It’s infringing upon our efforts to keep the American public safe. \\n\\n“In my book, if we miss one criminal alien who goes not to victimize one American citizen, that’s one too many,” the agent said. “But with the scale we’re talking about here, it’s likely lots of criminal aliens will to be able to slip through the system. So many Americans could potentially be affected by this.” \\n\\nHowever, the agent’s view does not seem to be shared by many lawmakers. For instance, both Tim Kaine and Hillary Clinton have shunned the American victims of illegal alien crime. Similarly, Republican House Speaker Paul Ryan, who last year voted to grant federal funding to Sanctuary Cities, literally fled from grieving mothers, who were forced to bury their children as a result of open borders, as they sought to give him a letter begging him to enforce the nation’s immigration laws. \\n\\n“There are lots of aliens we should be removing, but we can’t do it because we’re handcuffed by policies,” the agent explained. “The surge is worse than it was in 2014. Our southern border is not secure. It’s so porous. We have people working seven days a week just meet the demand and workload that’s being created by this administration’s policies.” \\n\\n“The administration’s policies have created the influx and the crisis situation because people overrun our border knowing they have a chance to stay,” the officer said. “The workload, the number of people, we’ve had to deal with has by far surpassed any amount we’ve ever had to handle before. \\n\\n“The Office of Refugee Resettlement is at capacity. The continued influx is going to put us way over capacity,” the officer explained. “Once they’re processed, we have to either find placement for them or release them, and right now we don’t have any place to put them… If we have nowhere to house them, they’re going to be released into the public—hundreds of bodies will be released.” \\n\\nThe officer continued: \\n\\nIn just the past two days alone we’re talking in the neighborhood of 200 bodies or more that we need to either find placement for or that will be released from our custody. This figure doesn’t include all of the other people that we have yet to process—at ports of entry they have close to 500 aliens to process who have yet to come into our custody. I’m hearing that they’re even pulling border patrol agents to assist them because they don’t have enough to keep up with processing all of the aliens. \\n\\n“And mind you,” the officer added, “that figure is just the number of people that come over as a family unit—this doesn’t include the unaccompanied children or illegal adults who cross the border.” \\n\\nThis is significant because Hillary Clinton has pledged to “end family detention and close private immigrant detention centers.” \\n\\n“Hillary believes we should end family detention for parents and children who arrive at our border in desperate situations. We have alternatives to detention for those who pose no flight or public safety risk, such as supervised release,” reads Clinton’s campaign website. \\n\\nThe agent described such a proposal as “ridiculous” and dangerous—as her plan could enable criminal aliens to enter the country and victimize innocent Americans. “If we think we have a mass migration problem now, and she’s trying to propose something like that, it’s only going to further overrun our borders and our officers,” the agent said. \\n\\n“Does she propose we just release them?” the agent asked. “It sounds like she wants to create just another avenue for criminal aliens to re-enter the country and commit more crimes, and victimize more people while they’re here… Her proposal seems pretty far-fetched and seems to lack any knowledge of what the real issues are… There have been many instances where the men that we’re processing, who arrive with their family unit, have some criminal offenses in their history—is she proposing that we not investigate that?” \\n\\nIn September, the National ICE Council, which represents the nation’s roughly 5,000 frontline ICE officers, agents, and personnel endorsed Donald Trump over Clinton and “urged all Americans, especially the millions of lawful immigrants living within our country, to support Donald J. Trump, and to protect American jobs, wages and lives.” The endorsement marked the ICE Council’s first-ever endorsement of any candidate for any elected office. \\n\\nIn a statement announcing the endorsement, the council’s president warned against Clinton’s “radical plan” of “total amnesty plus open borders” that “would result in the loss of innocent American lives, mass victimization and death for many attempting to immigrate to the United States, the total gutting of interior enforcement, the handcuffing of ICE officers, and uncontrollable flood of illegal immigrants across U.S. borders.” The ICE Council president warned that the agenda of non-enforcement, favored by Clinton, “results in the daily loss of life.”'"}, "time": 1742628559.8355405}