{"duration": 0.12094545364379883, "input_args": {"text": "'By wmw_admin on October 27, 2016 John Derbyshire — The Unz Review Oct 22, 2016 Democratic operative (and ex-convict) Robert Creamer Watergate , anyone? What brought it to mind was this news story from CNN: Dem[Ocrat] Operative “Stepping Back” After Video Suggests Group Incited Violence At Trump Rallies . [October 18, 2016] Relevant quote from the story: “Democracy Partners called O’Keefe’s video a ‘well-funded, systematic spy operation that is the modern day equivalent of the Watergate burglars.’” What’s this all about? Let me take it a piece at a time. Democracy Partners is a progressive consultancy group. Their website says they offer “cutting edge strategies for progressive values … We tell stories, create narratives, use powerful symbols.” The word “progressive” here of course means Cultural-Marxist : Hostile to everything customary and traditional, hostile to law enforcement and national sovereignty, globalist, open borders, anti-white, radical feminist, the whole CultMarx package. One of the partners in Democracy Partners, and instrumental in founding the outfit, is a chap named Robert Creamer . He’s married to Jan Schakowsky, who represent s Illinois’ 9th District in Congress —that’s the northern districts of Chicago . Robert Creamer is an ex-con: Back in 2005 he served five months in federal prison for check kiting and tax evasion. [ Congresswoman’s husband pleads guilty to two felonies , USA Today, August 31, 2005] Creamer is the guy in the headline, who is “stepping back.” What he’s stepping back from: involvement in work that Democracy Partners is doing for Mrs. Clinton’s election campaign, paid for by the DNC, the Democratic National Committee. They’ve been advising and helping Mrs. Clinton. So why is he stepping back? Well, conservative activist James O’Keefe—the one who exposed the ACORN community-organizer group back in 2009 —had sent people to Democracy Partners posing as potential donors and wearing hidden video cameras. O’Keefe got footage of Creamer explaining his dirty tricks to O’Keefe’s people under the illusion they were sympathetic listeners. Creamer explains, for example, how he gets around voter ID laws t o register illegal aliens as voters. Along with Democracy Partners, and I think reporting to them as a subcontractor, is a different outfit, the Foval Group. This group doesn’t have a website, and in fact seems to be a one-man operation with a business card. The one man is Scott Foval, who has also been working on the Clinton campaign. I’m not totally clear about the chain of command here, but Foval was employed by, or contracted to, Americans United for Change , another CultMarx outfit of the ACORN type. O’Keefe ran the same sting operation against Foval, and recorded some juicy quotes about his methods for advancing the Clinton cause: fomenting violence at Trump rallies, for example, and even hiring mentally ill people to get the violence started. Americans United for Change fired Foval this week after O’Keefe’s videos went online. Below, Donald Trump speaks out against the violence–violence he witnessed at his rallies, and threatens legal action. Mrs. Clinton and the DNC are feigning indignation over all this, and the Main Stream Media is of course covering for them. It’s hard to argue with the video-recorded evidence, though. The best they can come up with is that the video has been “ selectively edited ” —as if all video isn’t selectively edited . Now back to the quote from CNN that I started with: “ Democracy Partners called O’Keefe’s video a ‘well-funded, systematic spy operation that is the modern day equivalent of the Watergate burglars.’ ” So the crime here, equivalent to the Watergate burglary, was to sting these DNC contractors into revealing their methods. The crime, please note, is not the methods themselves—paying homeless people to start violence at Trump rallies, registering illegal aliens to vote—that’s not the crime. The crime, according to Democracy Partners, is deceiving people into talking about those methods on-camera . Got it? Now here’s the punchline. Robert Creamer—the guy who’s stepping back from assisting the Clinton campaign, the guy who did time for a federal felony conviction, the guy boasting about registering illegal aliens—this Robert Creamer has been a frequent visitor to the White House. How frequent? Very, very frequent. From November 2009 to June this year, Creamer visited the White House 340 times.[ Robert Creamer Visited Obama’s White House 340 Times , by Jen Lawrence, Breitbart, October 19, 2016]That’s an average of once a week, every week for six and a half years. Forty-five of those visits were for meetings with Obama, average seven times a year. I bet there are cabinet officers who don’t get that much time with Obama. I am now going to say the obvious thing: If we were in a Republican administration, and a Black Ops guy like Creamer was making weekly visits to the White House for six years, and then was caught on tape bragging about his illegalities, that would be front page news for months . Like … Watergate . Instead, while the Main Stream Media have dutifully reported the story (NYT: Videos Put Democrats on Defensive About Dirty Tricks ) I shall be very surprised if we hear any more about it from them after, oh, I’ll guess, this weekend. And don’t look for any law enforcement agencies wanting to know “what did John Podesta know and when did he know it?”—much less what Barack Obama or Hillary Clinton knew. In last week’s Radio Derb I reported on a survey out of Chapman Universit y about what Americans fear. Way up at the top of the list, with 61 percent of respondents declaring themselves afraid or very afraid of it, was government corruption. I’m with that 61 percent. So is Mark Steyn. On Wednesday this week, before that evening’s debate, Mark posted a column titled “ Laws are for the Little People .” [SteynOnLine, October 19, 2016] It’s an absolute tour de force , Mark Steyn at his polemical best. If I could make every adult in the country read it, I would. Mark declares up front that, quote, “for me the overriding issue in American politics is the corruption,” end quote. He then runs through the recent shenanigans at the FBI, including the latest news about the bureau and the State Department trading favors. He goes from there to the rise of Donald Trump. The energy behind that rise, says Mark, was widespread public outrage at how the political class, as exemplified by Mrs. Clinton, sets itself above the laws that we humbler folk have to obey. It’s all in their interests, says Mark; it’s all for them: Consider illegal immigration, for example, which pre-Trump was entirely discussed in terms of the interests of the lawbreakers —how to “bring them out of the shadows ,” how to give them “a path to citizenship ,” celebrate their “ family values ” and “work ethic”—and never in terms of the law-abiding, whose wages they depress, whose communities they transform, and, in too many criminal cases, whose lives they wreck.[Links added] Mark then excoriates the feebleness, stupidity, and occasional treachery of the Republican Establishment. The indifference from influential conservatives towards both naked corruption of our political class and the despair of the rest of us is, he says, deeply disturbing. It’s a brilliant piece, and I strongly recommend it to your attention. For a 2,000-word summary of what’s wrong with our Republic, and the prospects for doing anything about it, I don’t see how it could be improved on. Equality under the law, for the mighty and the humble alike, used to be a bedrock principle in our system. As Mrs. Clinton might put it: That’s Who We Were. It’s not Who We Are any longer, as her career illustrates all too plainly. Just a footnote to that. Going back to last week’s segment about what we fear, a listener reminds me of a classic line on that from one of Burt Reynolds’ movies. So what are you scared of, Burt? Clip : Burt: “Only two things in the world I’m scared of.” Ned Beatty: “You’re only scared of two things? What’s that?” Burt: “Women and the po-lice.” That was back in 1973, when the Watergate break-in—which didn’t even make any money for anyone!—was considered an outrageous blight on our political system. Even with that in the news, I doubt you could have got 61 percent of people to declare themselves afraid of government corruption. Of women and the po-lice , I don’t know …'"}, "time": 1742561962.0177746}