{"duration": 0.08677530288696289, "input_args": {"text": "\"Home › MEDIA | POLITICS › CLINTON CAMPAIGN COOPERATED WITH POLITICO ON ‘DEMYSTIFYING’ HUMA ABEDIN CLINTON CAMPAIGN COOPERATED WITH POLITICO ON ‘DEMYSTIFYING’ HUMA ABEDIN 0 SHARES \\n[11/1/16] Asked to provide a quotation for a Politico profile of Huma Abedin in July 2015, Clinton Campaign manager John Podesta wanted to use the phrase “wicked smart” instead of “bright,” and he emphasized Abedin’s “strategic sense.” \\nPodesta also agreed with a campaign staffer’s suggestion to describe Abedin as “an integral part of the team.” \\nThe Wikileaks email exchange , dated July 2, 2015 and released on Tuesday, begins with Clinton’s press secretary Nicholas Merrill telling Milia Fisher, Podesta’s aide, that “Politico has been working on a profile on Huma that we are being what I’d call partially cooperative with.” \\nMerrill said after consulting with Communications Director Jennifer Palmieri and Huma herself, the campaign decided to have the reporter sit down with Huma “off the record.” \\n“We think there is some value in demystifying her a bit in general, and Politico isn’t a bad place to do it,” Merrill wrote to Fisher. \\nMerrill asked Fisher to see if Podesta “would be willing to weigh in, which I think would be good in the spirit of showing team unity.” \\n“The piece will be about Huma’s evolution from body person to senior staffer, so if he’s up for it, maybe John could say something about her being a multi-faceted team player,” Merrill wrote. Then he offered a suggested quotation: \\n“Like: I was there at the White House when Huma was a young intern, and now she’s an integral part of the team. She’s as multi-faceted as she is bright, and when you combine that with her humility, you couldn’t ask for a better colleague.” \\nMerrill tells Fisher, “Feel free to tweak that, put it in John’s voice, or blow it up.” \\nFisher forwarded Merrill’s email to Podesta, asking him if he’d be willing to provide a quote. “Comms (communications) thinks it might lend an air of community to the piece,” she wrote to Podesta. \\nPodesta’s reply: “Change bright to ‘wicked smart’ and after humilty add ‘and strategic sense.'” \\nThe complete email exchange, as provided by WikiLeaks, can be seen here : \\nThe July 2, 2015 Politico profile of Abedin described her as “Clinton’s longest-serving aide.” It said that “like a mother monitoring her child on the playground, she never let Clinton drift out of her line of sight, ever vigilant and poised to act.” Post navigation\""}, "time": 1742562929.2976797}