{"duration": 0.09977293014526367, "input_args": {"text": "'By Andre Vltchek WHY DID THEY VOTE FOR THIS MAN? \\n“If we don’t understand why that choice was made, we will all get fucked, soon, and not only in North America, but also all over the world!” — Andre Vltchek \\nSince the results of the latest Presidential elections were announced, I am longing for silence, while the overwhelming cacophony of deafening noises is assaulting my ears, and in fact all my senses. \\nSuddenly everyone around me wants to speak, to shout, and to declare. Lately, people who are surrounding me, as well as those who are far away from me are frantically watching the news, reading newspapers and browsing through countless political websites. \\nMy friends and comrades all over the world are poking jokes at the US political establishment, or trembling in anticipation of something terrible, even apocalyptic. \\nMany are just having fun. Even some thoughtful and educated individuals are behaving like obsessive football fans: analyzing, passing judgments, and spending countless hours on the couch, in front of their television screens. \\nOf course there are also many gigantic protests in countless American cities against the President-elect, Donald Trump, the 45th leader of the mightiest nation on Earth. There are some massive protests, desperate protests, and hopeless protests. There are also personal protests, resigned shrugs of shoulders and downcast glances. \\nOverall there is a lot of noise. Everyone is speaking from the top of his or her lungs. Actually, people are shouting over each other. They want to be heard, desperately. While very few are listening. Very few also appear to be reflecting on what is being said by the others, on what is truly happening, on what has happened. \\nDespite millions of words and images assaulting our brains from all directions, I know that something is definitely missing, something important, and even something essential. It is not just my analytical mind that comprehends this; it is also my intuition. \\nAs a result, I want to smash those television sets in my vicinity, I want to throw newspapers into the garbage bin, and I want to go away, far away, from all my politicizing friends and comrades. \\nBut what is it that is being omitted in the official and even in the alternative narrative? What is it that I want to hear, longing to hear so much … longing with such force, even with such desperation? \\nAm I desperate for some precise analyses, for exact numbers, for revealing facts? Am I yearning for one brilliant study, for a report? Do I want to hear from someone why on earth did the American people elect someone like him, like Donald Trump? Or is it all actually much more simple and selfish: do I expect those wise words to come from my own brain, typed into my computer with my own fingers? \\nHow did it all really come to this? And why? What will happen now? What will happen to them (to the voters), what will happen to America, the country, which despite everything used to be my home for many years? What will happen to America which took so much, but which also gave me plenty? I kept asking, above all, what will happen to the world, to the entire world, which is now my true home, and which is also their true home (home of the American voters), although perhaps they do not fully comprehend it yet. \\nNo, I did not want to hear the facts! I couldn’t care less about the numbers. I was not longing for analyses, and I felt absolutely no desire to speak! \\nSuddenly, there was only one longing left in me: to listen, to hear, to absorb the millions of voices of those who just recently went to the polls and stuck those pieces of paper into boxes, most likely changing the destiny of the world. And since I knew I wouldn’t be able to absorb millions of testimonies, I wanted to listen to at least a few hundred or even thousands of them if possible. \\nI wanted to hear the stories of those men and women from the Rustbelt states, from the Deep South, from isolated farms and exhausted mining towns. I wanted to put my glass of beer next to theirs, in some god-forsaken bar, and just nod and whisper what so many storytellers before me, have done for millennia, and what they will be saying for many centuries to come: “Please tell me your story…” \\nI want to hear their stories so I can collect them, arrange them, and pass them onto the world. \\nI want the people who voted for Donald Trump to speak to me, to explain, to let me into their thoughts and emotions. I want to understand what occurred through their stories. \\nI don’t want to judge. I am usually very judgmental, very political, and very ideological. This time I have no desire to be … This is too serious; too damn serious! \\nI owe America that much. That is the least I can do. To return there, to fly there all the way from Asia, to rent a car, and drive from coast to coast, for long weeks, and to finally listen to people, trying to understand who they are, what they did, and why? \\n“I am what I am because I am a passionate listener,” I was once told by one of the greatest Latin American writers, Eduardo Galeano. “People always know what goes on. All we have to do is to listen to them. And we have to lead them only when they ask us, when they order us to do so.” \\nThere is no doubt in my mind that now is the time to attentively listen to the American people; to fill newspapers and websites with their words. But almost no one seems to be doing that. \\nAll we hear is ‘why they voted as they did’. How they voted: women, minorities, particular classes or states … We read about numbers. But we don’t hear people speaking! We don’t hear them formulating the words. \\nAnd that is what I am longing for: to shut up, to be silent, and to listen. And I want other intellectuals to shut up and to humbly listen too, finally! \\nNot because I agree with what they, the voters, have done. Not because I want Donald Trump to lead the country and the Empire. Not because I suddenly ‘fell in love with the small people’. \\nIt is simply because the people of the most powerful country on Earth have spoken, because they made their choice. And because, if we don’t understand why that choice was made, we will all get fucked, soon, and not only in North America, but also all over the world! \\nI want to listen and to understand so the course of action can be determined, so that we know where all this will lead … because this is not the end, just the beginning… of something… Because not only people in the United States, but also in Europe want something, and listening to the analysts from both parts of the world, and by just ‘reading facts and numbers’, I have absolutely no clue what it is! \\nDo voters want some new form of participatory democracy? Do they want neo-fascism? Are they thoroughly selfish or is there at least some internationalist essence in their souls? \\nWe can only find out if we let them speak. And that is why I am longing for silence, and then for their voices to resonate, so we know, we know now, before the thunder and flames swallow our Planet, and before it is too late.'"}, "time": 1742562835.0950234}