{"duration": 0.12501168251037598, "input_args": {"text": "'Can there be light below the surface of the Earth, without any exposure to the Sun? Surprisingly, the answer is YES. By Robert Sepehr\\nBioluminescent organisms have the ability to glow almost like magic. Many organisms use their natural ability to produce light to trick predators, to attract mates and even to communicate.\\nThe word for this seemingly magical ability is called “bioluminescence,” which comes from “bio,” meaning life, and “lumin,” meaning light.\\nMost of these organisms, such as plankton, glow blue, but a few glow red, green, or orange. Some tiny animal plankton (zooplankton) are big enough to see with the unaided eye.\\n\\nMost bioluminescent zooplankton don’t glow in the dark themselves, but instead squirt globs of glowing chemicals into the water.\\nSome zooplankton use bioluminescence to attract a mate, or to form reproductive swarms. Not only is nature’s biochemistry fascinating, it can also be extremely beautiful, especially given the backdrop of a dark, misty cave.\\nGlow worm is the common name for various groups of insect larvae and adult larviform females that glow through bioluminescence. They may sometimes resemble worms, but are actually insects.\\nThe glow they produce, through by a chemical reaction, is incredibly efficient; nearly 100% of the energy input is turned into light (Compare this to the best light-emitting diodes at just 24%).\\nAustralia and New Zealand have some of the most spectacular caves, where one can go on guided tours to witness this natural phenomenon up close. (see video below)\\nWhy do some mushrooms emit light? Making light isn’t common in fungi; scientists have described about 100,000 fungal species, and only 75 glow. Lab work has shown that the glow did not happen randomly or by accident.\\nScientists found that these mushrooms made light mostly at night, so experiments were conducted to determine why.\\nAccording to studies ( referenced in the book ), in dark environments, bioluminescent fruit bodies may be at an advantage by attracting insects and other arthropods that could help disperse their spores.\\nConditions that affect the growth of fungi, such as pH, light and temperature, have been found to influence bioluminescence, suggesting a link between metabolic activity and fungal bioluminescence.\\n\\nThe diversity of creatures with this ability is equally astonishing, from algae and the common firefly to deep-sea dwellers that are rarely seen by humans.\\nWhat’s also fascinating is that many of these creatures are not closely related, and bioluminescent traits have seemingly evolved separately at least 30 times.\\nWith countless well lit subterranean caves and glowing caverns, it makes one wonder what could be dwelling in vast unexplored areas under the crust.\\nThe idea that our planet consists of a hollow, or honeycombed, interior is not new. Some of the oldest cultures speak of civilizations inside of vast cavern-cities, within the bowels of the earth.\\nAccording to certain Buddhist and Hindu traditions, secret tunnels connect Tibet with a subterranean paradise, and they call this legendary underworld Agartha.\\nIn India, this underground oasis is best known by its Sanskrit name, Shambhala, thought to mean ‘place of tranquility.’\\nMythologies throughout the world, from North and South America to Europe and the Arctic, describe numerous entrances to these fabled inner kingdoms.\\nMany occult organizations, esoteric authors, and secret societies concur with these myths and legends of subterranean inhabitants, who are the remnants of antediluvian civilizations, which sought refuge in hollow caverns inside the earth.\\nAssuming that the myths are true, and the Earth is partially hollow, how could life survive underground? How would organisms receive the ventilation required to breathe miles below the surface?\\nSurface trees and rainforests are responsible for less than one-third of the Earth’s oxygen, while marine plants, such as phytoplankton, are responsible for between 70 to 80 percent of the oxygen in the Earth’s atmosphere. The vast majority of our oxygen comes from aquatic organisms.\\nPhytoplankton, kelp, and algae produce oxygen as a byproduct of photosynthesis, a process which converts carbon dioxide and light into sugars which are then used for energy.\\nPhytoplankton is responsible for HALF of Earth’s oxygen\\nWhile the process of photosynthesis usually implies the presence of sunlight, the Sun is not the only available light or energy source able to power photosynthesis.\\nBefore the discovery of hydrothermal vents, and their ecosystems, scientists believed that only small animals lived at the ocean bottom, in seafloor sediments.\\nThey theorized that these animals received their food from above, because the established model of the marine food chain depended on sunlight and photosynthesis, just as the food chain on land does.\\nMainstream academia taught that this was the only way life could survive in the darkness of the deep seafloor. The discovery of hydrothermal vents changed all that.\\nIt became clear that vast communities of animals grew quickly and to larger than expected sizes in the depths without the aid of the Sun.\\nInstead of using light to create organic material (photosynthesis), microorganisms at the bottom of the food chain at hydrothermal vents used chemicals such as hydrogen sulfide (chemosynthesis).\\nAt the seafloor, there are thriving ecosystems that receive energy not from the sun, but from the heat and chemicals provided by the planet itself.\\nFor many thousands of species dwelling in the deep, the energy to sustain life does not flow down from above, but comes up from the interior of the earth.\\nEven in the unlikely scenario where every single tree were chopped down, we would still be able to breathe thanks to aquatic plant-life (ex. algae).\\nThe Earth has a tremendous amount of water, and these oceans, rivers, and lakes are teeming with numerous species of biologically active, oxygen-producing organisms.\\nAre there any known sources of sustenance available that could provide for a large human population?\\nWhat evidence is there that a sustainable biosphere could exist miles below the surface, totally isolated from the nourishment and the established life cycle provided by the sun?\\nWhere are the entrances to inner earth, and which races live inside?\\nAuthor and anthropologist, Robert Sepehr , explores these questions and attempts to unlock their riddles, which have eluded any consideration in mainstream academia.\\nNumerous endeavors have been undertaken to access the interior of the earth.\\nPolar expeditions and battles, such as Operation Highjump, still remain largely classified, and have been shrouded in secrecy for decades, but scientific revelations validating the rumors surrounding these covert events, and their implications, are finally being exposed to daylight.\\nWhat are the mysteries of inner Earth?\\nRobert Sepehr’s book, Gods with Amnesia: Subterranean Worlds of Inner Earth , is available on Amazon and all good bookstores. \\n\\nSource: Atlantean Gardens \\nVia: Humans Are Free \\nMore from Robert Sepehr : Bioluminescent Glowing Organisms of Inner Earth Subterranean Worlds of Inner Earth New Swabia (Neuschwabenland) and Base 211 Hopi Indians claim that their ancestors emerged from the underworld '"}, "time": 1742563106.8521025}