{"duration": 0.13036465644836426, "input_args": {"text": "'A Never Trump movement leader who once blamed   Donald Trump for violent riots in Chicago has miraculously infiltrated President Trump’s White House, Breitbart News has learned. [Helen Aguirre Ferre, now the White House’s Director of Media Relations, previously very publicly —  as an adviser to former Florida Gov. Jeb Bush’s failed 2016 presidential campaign and as a GOP consultant after Bush dropped out of the race —  bashed Trump repeatedly on the campaign trail, leading the Never Trump movement.  Aguirre Ferre’s perhaps most egregious Never Trump comments came via Twitter on March 11, 2016, in a   Tweet in which she said now President Trump “bears responsibility” for violent riots in Chicago that forced him to shut down a campaign event there ahead of the Illinois primary —  which he handily won on March 15, sweeping out many of the other states that day. Then Trump rivals Sens. Ted Cruz ( ) and Marco Rubio ( ) inaccurately suggested that Trump was responsible for the violence in Chicago that caused him to cancel his planned March 11, 2016, campaign rally downtown at the University of Illinois at Chicago. “I think a campaign bears responsibility for creating an environment, when the candidate urges supporters to engage in physical violence —  to punch people in the face. The predictable consequence of that is that it escalates and today is unlikely to be the last such instance,” Cruz said at the time, for instance. But Aguirre Ferre took it a step further on her Twitter account, saying that Cruz and Rubio “agree that” Trump “bears responsibility for violence in Chicago today” on March 11, 2016. White House press secretary Sean Spicer has not answered whether Aguirre Ferre still believes that, or why she deleted that Tweet and many others —  and has not answered a detailed set of questions from Breitbart News on Aguirre Ferre’s history of   and who is responsible for hiring her at the White House in the first place. But Spicer asked a deputy in the White House to ask Breitbart News to delay publication of this article. Breitbart News accommodated the White House, giving Spicer and his team several extra hours to answer the questions sent to them —  including who was responsible for hiring Aguirre Ferre, whether that person who hired her informed the president of these comments she made about him before giving her a senior position in the White House communications office, and whether Aguirre Ferre still believes all these criticisms she made about Trump but has never publicly retracted other than deleting Tweets. Spicer, Breitbart News was told hours after the original scheduled publication of this investigation —   which was delayed at his request —  was supposed to call Breitbart News to answer these questions and others about Aguirre Ferre. But he never called. White House spokeswoman Sarah Huckabee Sanders, appearing on Breitbart News Daily on Tuesday morning, defended Aguirre Ferre when asked about her demonstrably   positions before joining the administration. Huckabee Sanders said: I think it’s sad that any individual reporter or outlet would try to attack a member of the president’s staff and diminish them maybe based on some of their previous jobs and try to disqualify or discredit them because of that. We’ve got an incredible team here working really hard to carry out the president’s agenda that he laid out during the campaign, that he continues to lay out day in day out here in the White House. And we are all committed to helping move that agenda forward and we are working day and night to do that, and again we’ve got a great team doing that all focused on helping support the president and his agenda.  Aguirre Ferre made many more   comments on Twitter and television, including promoting a Politifact article in late 2015 that accused Donald Trump’s campaign of making “misstatements” that amounted to that publication’s “2015 Lie of the Year. ” She has also questioned whether now Attorney General Jeff Sessions, then a U. S. Senator from Alabama, and New Jersey Gov. Chris Christie “regret supporting Trump” or whether “the means justify the end. ” The answer to such a question, she said in a now deleted Tweet, was “telling either way. ” In February 2016, she said her   Jeb Bush was “clearly  …     in Trump’s head” and accused the   of the United States of “babbling more than usual. ” In September 2015, she praised Jeb Bush for standing up for Carly Fiorina —  another Trump rival —  from Trump’s “insults,” arguing that Fiorina, all women, and the whole country “deserve better” than Donald Trump as president. Aguirre Ferre also once said that President Trump’s campaign style is “not flattering” and that his aggressivness on the campaign trail was “all he’ll ever be. ” Perhaps most damning is the fact that Aguirre Ferre deleted most of these comments from her Twitter account, an action for which she, Spicer, and other White House staff have provided no explanation —  or that it was the   Clinton, George   and David   Media Matters for America (MMfA) organization that took screen shots of them and published them online months ago during the campaign. But those Tweets are not the only places she has made   comments. In April 2016, according to a translation offered by Politico, Aguirre Ferre appeared on Univision’s Al Punto program to bash Donald Trump. That was long after her preferred candidate, Jeb Bush, dropped out of the race. Aguirre Ferre said in Spanish, according to Politico’s translation: There’s a side of Donald Trump that is  . I’m not going to tell you he’s a misogynist   …     but I do think there’s something that bothers him about strong and independent women. In the case of abortion, Donald Trump held every viewpoint possible   …     including supporting   abortion, something even many who are   oppose   …     Donald Trump is trying so hard to win the nomination from conservative voters that he’s trying to say what he thinks the conservative voter wants to hear. And that’s why he ends up messing up, constantly. While Aguirre Ferre did go on to work for   National Committee (RNC) chairman Reince Priebus —  now the White House chief of staff —  at the RNC later in the general election cycle, she even made disparaging comments about President Trump during the time after which he became the presumptive GOP presidential nominee. One Tweet was a link to a Washington Examiner story detailing how Trump had issues with winning over Hispanic Republicans, and she commented that Hispanic GOP members were “caught in 2016 meat grinder” with Trump as the   GOP nominee. That Tweet, which was sent on May 10, 2016, came seven days after Trump won the primaries once and for all in Indiana on May 3, 2016. Another Tweet she sent out that day —  a week after Trump became the nominee —  was pushing a poll that argued Trump would “drive Miami Cuban Americans from GOP. A couple days earlier, she Tweeted that the GOP was “neither” Donald Trump’s nor House Speaker Paul Ryan’s party, but that Ryan “represents and lives the values of the Republican Party,” implying that Trump does not. Many people close to the president are shocked someone as   could make it into a senior position in the White House like this. “The sheer contempt for the president shown by staffers like Helen Aguirre Ferre is utterly reprehensible but unsurprising given that the RNC and establishment hacks running the administration have decided to staff this administration as if it were Bush’s third term,” one said. “It is completely and utterly demoralizing to know that Donald Trump didn’t actually beat Jeb Bush after all. ” It is worth noting that most of the   things Aguirre Ferre said appear on her Wikipedia page.'"}, "time": 1742564375.038343}