{"duration": 0.050009727478027344, "input_args": {"text": "'Homeland star Mandy Patinkin says this season of the acclaimed Showtime television drama shows that it is perhaps “the white men in government and the military establishment that are the bad guys,” rather than the Muslim community. [In an interview with MSNBC’s Chuck Todd this week, Patinkin said that society had “chosen the Muslim community” as a threat, despite the community making “contributions to the world of a monumental nature. ”  Patinkin also said the show, which has been criticized by the left as “Islamophobic” for linking Islam with terrorism, has taken responsibility for this portrayal and has changed its content so they become “part of the cure rather than part of the problem. ” “[Homeland has introduced] a storyline that shows in this case, in this era, in this season, that maybe it is the white men in government and the military establishment that are the bad guys, not the Muslim community,” he continued.  Patinkin, who plays the role of CIA operative Saul Berenson, has previously discussed the need for America to open up its doors to refugees from the Islamic world, as well as Homeland needing to take responsibility for its negative depictions of Muslims. “In all kinds of entertainment  —   movies, television  —   there are always the bad guys the cowboys and Indians, then the Russians were the bad guys, the Nazis were the bad guys. Now it seems like Muslim ‘terrorists’ are the bad guys,” he told the Associated Press in an interview this month. “So, inadvertently, because it’s an action show, it’s an       political drama that Homeland is, unintentionally we were not helping the Muslim community and we take responsibility for it. And I know I can speak for the writers when they want to right that error that happened because of storytelling. ” In a 2015 interview with Variety, the actor advised people to take in refugees and “bring them to your home for dinner,” adding that he simply wants “other people to know the kind of joy that I have in my life. ” Homeland, which aired its sixth season finale last Sunday, has been renewed by Showtime for a seventh and final eighth season.   You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742563888.7084892}