{"duration": 0.13112902641296387, "input_args": {"text": "'Hillary BUSTED Holding Closed Door Meeting with Florida Elections Director in Possible Voter Fraud Scheme Hillary BUSTED Holding Closed Door Meeting with Florida Elections Director in Possible Voter Fraud Scheme Breaking News By TruthFeedNews October 27, 2016 \\nMore proof of a RIGGED SYSTEM and likely voter fraud taking place right before our eyes in the critical state of Florida. There have been several reports that Broward County Election Director Brenda Snipes has met with Hillary Clinton behind closed doors and several sources of claim to be coming forward with pictures soon. \\nThe Conservative Treehouse reports this may be part of a bigger voter fraud scheme. \\nAnyone with any political knowledge is aware the best chances for Hillary Clinton in Florida come from two specific counties, Broward and Dade. It is not coincidental that both counties continue to be the historic nucleus of multiple voting irregularities. \\nThis year is no different. In a recent series of events Broward County is at the epicenter of another voting malfunction. However, this one might not be a mistake, it might be by design. The essential outline of the current year concern surrounds a scheme to present double voting to benefit Hillary Clinton: \\nBroward County officials intentionally screw up sending out mail-in ballots to a key demographic constituency. The correction therein then allows the same official to send a second set of ballots to the same constituency thus providing two possibly counted ballots for each voter. \\nSounds incredible. Maybe. But as incredulous as it sounds that’s exactly what’s taking place. \\nThe issue stems around the second page of the ballot for a ballot initiative, a specifically democrat ballot initiative, an amendment to Florida’s constitution, Amendment #2, whereby legalized marijuana is up for a vote. \\nThe Amendment #2 ballot initiative is the long-standing objective of John Morgan an Orlando lawyer who is the name and face behind the Morgan and Morgan law firm. \\nJohn Morgan, lives in Orlando and is a big donor and benefactor of the Democrat party. You might remember it was John Morgan who hired former governor Charlie Crist ( Republican, then Independent, then Democrat ) after his failed Senate bid. John Morgan is also attached to the Multi-billion Pigford settlements via a partner in his law firm Greg Francis. \\nJohn Morgan is also a key donor , financial bundler, and contributor to President Obama and Hillary Clinton. Morgan has hosted numerous high-dollar ( $30k+ per plate ) events for Obama and this year f or Hillary Clinton . \\nLegalized marijuana sales in Florida, under the auspices and ruse of “medical marijuana”, has been a goal of Morgan for several years. Politically, Morgan also wants to be FL Attorney General and/or U.S Attorney General. \\nBy structuring a flawed ballot distribution in Broward County both Hillary Clinton and John Morgan can achieve both their objectives. A rather brilliant Win/Win. \\nThe scheme works by “accidentally” failing to print one of the pages in a strategic regional area guaranteed to be dominated by Clinton/Morgan supporters. It takes only a modicum of ‘ plausible deniability ‘ to provide the arms-length distance from a scheme. \\nSending out “some” or “a few” ballots with a blank page, a “flaw” per se’, then resending an entire second set of ballots (173,000) to the full area, provides multiple opportunities. \\nSee if you can spot how it plays out. Beginning with the small flaw: \\n( Miami Herald October 20th ) The Broward County elections office, already under scrutiny for two blunders in the past few weeks, played defense once more Friday as its supervisor came under fire after mail-in ballots turned up that skipped a constitutional amendment question on medical marijuana. \\nOne of the organizations supporting the amendment, NORML of Florida, has asked for an emergency hearing after filing a lawsuit on what it called an error that could be “catastrophic and cataclysmic.” A Broward judge has scheduled a hearing for 10 a.m. Tuesday. \\n“In reviewing and reviewing and going back looking through our ballots we found Amendment 2 on all 92 of those styles so it’s still not totally clear why this voter did not have Amendment 2,” Snipes said. She added that she believes that the faulty ballots were test samples for Oakland Park. After a city candidate dropped out, she said, her office recoded the Oakland Park ballot, leading to a creation of a new test ballot. Her office did not notice the missing marijuana question on the test ballots, which are not supposed to be sent to voters but somehow were. \\nAt a maximum, Snipes said, only seven of those test ballots were printed. She allowed reporters, as well as a representative from United for Care, the political committee backing the amendment, to review the 92 ballot styles Friday. \\nBut amendment backers were skeptical of Snipes’ explanation after it became clear that she didn’t know precisely what went wrong or exactly how many ballots lack the closely watched amendment. Broward is the most left-leaning county in the state, and amendment backers are counting on its voters for a large share of support. \\n“What continues to concern me is it does not seem that the supervisor knows for certain the extent of the problem,” said Ben Pollara, campaign manager for United for Care. “They have a strongly held belief it is this very isolated incident [Snipes] described this afternoon but they don’t know for sure. Until they do I remain incredibly concerned.” ( read more including video and press conference) \\nOK, so that’s the ground work for the “small flaw” in Broward County ballots . Note in the video Ms. Brenda Snipes positioning 173,000 ballots as the full distribution to be concerned with. \\nNow lets look at what they finally claimed was the origin of the problem , and the solution they came up with : \\n( Via Sun Sentinel october 24th ) Broward elections workers checking mail-in ballots from Oakland Park found none without the statewide medical marijuana question that had been missing from at least two ballots. \\nBut an early voter at the Fort Lauderdale Regional Library/Art Serv said her ballot was missing Amendment 2. \\nThe Broward Supervisor of Elections Office said there was no evidence of a incorrect ballot. The pages were stuck together because of humidity in the machine, said spokeswoman Tonya Edwards. \\n“There was an issue with the humidity so it printed twice on one side instead of on the other,” Edwards said. “On one page it was blank and on the other page was the actual amendments.” \\nDebbi Ballard, 57, of Fort Lauderdale, said she filled out her ballot and realized the amendment wasn’t there. “I checked once, twice, three times,” she said. \\n“This is an irregularity and needs to be addressed,” Ballard said. She said she pointed out the error to voting staff and received a new ballot. \\nBallard said she was not satisfied with the “pages stuck together” theory and has lost confidence in Broward’s Supervisor of Elections Office. “That doesn’t explain it,” she said. “Because the layouts were completely different.” \\nBroward Supervisor of Elections Brenda Snipes said there wasn’t an amendment issue. “It’s a moisture issue,” she said. “So I can understand why the voter, you know, became concerned or upset, because there’s been so much about it out there in the air. It’s a moisture issue, it’s a moisture issue.” \\nLast week, two voters in Oakland Park reported that the amendment had been left off their mail-in ballots. \\n[…] Snipes said that voters who are missing the amendment, all of whom should be in Oakland Park, will get new ballots . Edwards said later that Snipes was aware of the early voter’s issue. ( read more ) \\nRemember the concept behind the “ bathtub principle “, and how small chaos is used to cloud, mask, hide and deceive much bigger solutions (intentions)? \\nAnd where was Hillary Clinton yesterday? Breaking: Hillary in private meeting with Brenda Snipes, Election Director of Broward County Florida. Collusion, fraud or both? #MAGA \\n— Marshall Buffins (@PoliticalTropes) October 26, 2016 \\nSupport the Trump Movement and help us fight Liberal Media Bias. Please LIKE and SHARE this story on Facebook or Twitter. '"}, "time": 1742562648.9910917}