{"duration": 0.06838822364807129, "input_args": {"text": "'Email \\nIf this doesn’t prove what’s beautiful about America, we don’t know what does. \\nPolitically, Sarah Goodwin and Colleen Cassidy agree on almost nothing. They vehemently oppose the other’s candidate of choice and couldn’t differ more on the direction our country should be heading in. Yet, as this heatedly divisive election cycle comes to a head, these two demonstrated just how powerful a united American people can be when we put our differences aside and work together: Sarah, a Trump supporter, and Colleen, a Clinton supporter, held each other’s hair back while vomiting out of intense election anxiety. \\nIn a campaign season as contentious as this one, you really have to stop and appreciate moments like this. \\nThough Sarah and Colleen come from opposite ends of the political spectrum, you wouldn’t know it when looking into the stall at their polling station in Cranford, NJ, where they both lowered their heads into the same trash can and took turns holding each other’s hair back as they retched over the psychological toll this long, strenuous election’s taken on them. No arguing, no finger-pointing, no name-calling: just dual streams of stress-induced upchuck crescendoing in a duet of dry-heaving. The sight of two people, who have been bombarded for months with messages that the other candidate will completely ruin the country as they know it, patting one another on the back and encouraging each other to get it all out, is all too welcome in an otherwise toxic and polarizing campaign season. \\nNeed more proof that it’s possible for Trump and Clinton supporters to overcome their shared animosity during this historical moment of anxiety? Colleen even offered Sarah an Altoid once they’d both stopped throwing up and cleaned the barf from their shirts. Further, Sarah graciously let Colleen borrow her eyeliner, which had been smudged due to the tears summoned by a panic attack she experienced while in line to vote. After checking in to make sure the other was feeling all right one last time, each went their separate ways, having found rare common ground with their political opposites in the form of sickening anxiety stoked by the intense fear politics and extremist partisan rhetoric deployed in the 2016 election. \\nYup, the spirit of Abraham Lincoln is alive, knitting a torn nation back together. \\nLook at the media and you’ll see interactions between Trump and Clinton supporters portrayed as vitriolic and irreconcilably at odds. But in reality, you’ll find two human beings offering each other their sleeves to wipe the sick from their mouths before they head back out there to get this goddamn fucking thing over with, and that’s worth celebrating.'"}, "time": 1742561944.5694802}