{"duration": 0.07002472877502441, "input_args": {"text": "'Attorney General Jeff Sessions joined syndicated Boston radio host Howie Carr on his broadcast Thursday, laying out the new path his Department of Justice is charting in the Trump era. [New measures to crack down at the border were of particular focus in light of Sessions’s sweeping announcements in Nogales, Arizona Tuesday. Talk also turned to Sessions’ efforts to rebuild a Justice Department still largely staffed with holdover   appointees and career civil service employees, most of whom worked under the previous administration. Sessions’ continued crusade against   “sanctuary cities” made up the final portion of their conversation.  “I’ve been excited about progress at the border   …     March was the lowest level of illegal entrants to the country in 17 years. It was 72% below the last month of the Obama Administration,” Sessions relayed to Carr. Building on his statements on Fox News’s Hannity, he added: I thought if we had clear leadership by the President, by our officers, and tell people please don’t come illegally, if you want to come to America wait your turn. If we do that we’d see a decline, and so far it’s exceeded my expectation. Carr expressed his disbelief at the controversy that has arisen over Sessions’ directives. “You’re enforcing the law! There’s nothing new here. You’re just taking the federal criminal code and enforcing it,” he said. Sessions was equally incredulous: It is just beyond my comprehension how we drifted so far away from the common sense notion that sovereign nations have borders and those borders should be honored   …     Any country that has common sense, and almost all do, has laws that if you commit a crime while you’re in the country, lawfully or unlawfully, you are to be deported. Carr moved conversation to the pace of confirmations and appointments in the Sessions DOJ. Slowed by Democratic political maneuvering like the   protracted Senate battle over   Supreme Court Justice Neil Gorsuch, Sessions’ efforts to assemble a team of his choosing around him has been painfully slow. Only his choices for the number two and three spots at DOJ, Deputy Attorney General and Associate Attorney General have been received a hearing and been passed for a vote of the full Senate by the Senate Judiciary Committee. Only one other DOJ nomination has been officially taken up by the Committee, Antitrust Assistant AG nominee Makan Delrahim. Sessions told Carr that he expects his Deputy pick, Rod Rosenstein of Maryland, and his nominee for Associate AG, Rachel Brand of Iowa, to be confirmed soon, but expressed dismay over the whole process: It does appear, however, that we are further behind than normal with appointments. It looks like it will be two weeks before I get the first of my fifteen or so Senate confirmed deputies approved. Can you imagine that? The first. And he may be the first one in the entire government that’s been confirmed as a deputy  …    it’s not good. Carr pressed Sessions on “Obama holdovers” throughout his department, especially those in the Civil Rights Division who implemented   Assistant Attorney General Vanity Gupta’s response to the Ferguson, Missouri, and Baltimore riots that has drawn considerable criticism on the political right. “Are you trying to weed out these   people?” he asked. Sessions acknowledged that career employees have always and will continue to make up of the majority of the Justice Department, but had a stern message to those who might resist the new direction at DOJ. “The President, the Attorney General set the policy, and I expect those policies to be followed. If people can’t comply with the policies of this administration, they should look elsewhere. ” The Attorney General was hopeful at the prospects for the career   he oversees. “We’re getting pretty good cooperation,” he said, citing the example of career prosecutor and acting U. S. Attorney for the District of Rhode Island Stephen Dambruch, who did not shy away from revealing the immigration status of those caught in a   heroin roundup Thursday. Carr finally turned attention to a cornerstone of Sessions’ nascent tenure at DOJ:   “sanctuary” jurisdictions that refuse to cooperate with federal authorities on immigration enforcement. “We going to, um, urge, these people involved in sanctuary cities,” was Sessions’s suggestive reply. “The law says if somebody commits a crime in Boston or New Hampshire, they’re to be deported if they’re here unlawfully   …     why cities would block that and keep criminals in their cities is beyond me. ”'"}, "time": 1742562394.4221117}