{"duration": 0.23532915115356445, "input_args": {"text": "'25 Views November 10, 2016 GOLD , KWN King World News \\nFor people who are worried about Druckenmiller selling his gold… \\nBefore we get to Druckenmiller selling his gold, look at the collapse in the 30-year bond market as interest rates continue to surge! A picture is worth a thousand words… 30-Year U.S. Treasuries Continue To Plunge Today, Hitting New Lows! \\nBy Bill Fleckenstein President Of Fleckenstein Capital November 10 ( King World News ) – I am going to stick with yesterday’s format and try to make sense of the market motion, then turn to the action lower in the column, and I’m doing this in response to all the questions I’ve been getting about how various markets can possibly do what they’re doing, i.e., why are they behaving as they are… IMPORTANT: To find out which company Doug Casey, Rick Rule and Sprott Asset Management are pounding the table on that already has a staggering 18.1 million ounces of gold that just added another massive deposit and is quickly being recognized as one of the greatest gold opportunities in the world – CLICK HERE OR BELOW: Sponsored \\nGreat Again: Well, That Didn’t Take Long In the first place, let’s be clear, this is all guesswork, and a lot of the motion is noise and the overlapping of extremely short-term time horizons with longer ones. Be that as it may, I will give it my best shot. What we have seen over the last 48 to 72 hours is a massive psychological sea-change — albeit, almost certainly temporary — from overwhelming pessimism to overwhelming optimism regarding the prospects for the U.S. economy and all things American. That has collided with fumes from QE here, and actual QE from other counties. Said differently, a massive change in psychology has collided with free money to spark euphoria, something that can generally only last a short time. \\nAs that begins to take place people begin to factor in all the things that can go right and very few of the things that can go wrong, though they don’t handicap the amount of time it takes to accomplish said things, nor the degree of difficulty in accomplishing them. For instance, if Congress magically passed a $1 trillion infrastructure project, it would take quite a good deal of time to get the permits and design what needs to happen before the first shovels hit the dirt, so to speak. Not to say that the consequences of doing the project wouldn’t be economically positive, but there is quite a long lag between planning to do it and actually starting it. \\nThat matters because, at the moment, the multiple on the stock market is very high (north of 20), and it is where it is because of zero-percent rates (and the ridiculous TINA rationale). As rates rise, that tends to put pressure on valuations while it potentially causes some TINA-driven buyers to think twice, especially if they start to lose money. Given my belief that the bond bull market is finished, and that a Trump administration would likely be very unfriendly to bonds, interest rates are headed higher, something that could really be exacerbated if people’s perceptions about inflation change. \\nBuy and Hold On? The bottom line is, given the valuation of the stock market and the likely decline in bonds, it will be rather difficult for the stock market to trade on the potential for good news long enough for the good news to hit. Therefore, it is quite likely this could be the final equity market blow-off, however far it may go, sort of matching the bond blow-off of last summer. \\nThere is some precedent for just this sort of stock market action, as something similar occurred right after Ronald Reagan was elected. I touched on this yesterday (and please don’t send me any emails telling me Trump is not Reagan, I totally understand that), i.e., that we have a potential sea-change in psychology from a very negative macro outlook for the U.S. economy to one that is expected to be better. Again, that doesn’t necessarily translate to higher equity prices, due to the impact of rising rates on the current level of valuations to consider. Nonetheless, after Reagan was elected there was about a two-week 10% rally in the S&P, which then reversed and a substantial decline ensued. \\nI believe if and when the stock market rally finally is perceived to have ended we could see a lot of destruction very fast, given the brittle structure that I have talked about ad nauseam. And of course a reversal in the stock market would probably impact the dollar (and metals) and we might even get a kneejerk reaction in bonds. \\nTaking Some “You” Time Nearly all markets are currently in motion, so it is best to step back, try to figure out what is really going on, think about what you are looking for that would cause you to change any positions you have, but avoid taking any action unless you are fairly certain about what is happening and why. \\nBeneath the surface of the stock market one can see that tech is being sold (that sector, especially FANG, has the highest multiples and therefore is the most vulnerable to a change in the bond market, plus a strong dollar hurts them), while “Trump plays” are being purchased. I don’t see how the market can readjust itself and really hold together because I don’t think there will be enough buyers of tech to accommodate the sellers, and thus the market overall could easily come under pressure fairly soon, but we will just have to see how that plays out. \\nWallStreet.com Basically, while we’re in this period of quasi euphoria, the market for the moment is a concept stock, like biotech, and concept stocks don’t generally bother having fundamentals, nor do people worry about them until they do, and then they decline drastically as a consequence of basically being binary. \\nWith all of that out of the way I will turn to the action. Overnight the SPOOs were about 0.75% higher and the market itself was higher in the early going. We then got a quick reversal both lower then back higher, at least for the Dow (the S&P was up fractionally). The Nasdaq, however, kept leaking. By day’s end the former added over 1% while the latter lost 0.75%. \\nAway from stocks, the euphoria playbook was in use and all the outside markets were very volatile, with green paper quite strong, while oil lost 1% and bonds were initially strong, then were beat up again. The 10-year lost another 8 basis points, as yields have now risen from 1.50% to 2.12% in five weeks. \\nPrecious metals gave up an overnight rally and were lower. Part of that was exacerbated by Stan Druckenmiller, who said he’d sold his gold into the election-night rally (I have covered that all in Ask Fleck). After going negative silver climbed back into positive territory, gaining 0.3%, while gold lost 1.5%. Included below are six questions and answers from the Q&A’s with Bill Fleckenstein. Bonus Q&A Question: Hi Fleck – Hope all is well and you are enjoying the interesting times we live in now. Forget Trump … let’s talk about the Indian PM who has overnight banned large currency notes and is forcing people to deposit them in lieu of newer notes. I feel that this will help to thwart black money (nearly $2 Trillion) and terrorist activities (fake notes etc.) and will also curb real estate prices. But this could change how people view Gold even more. I suspect many Indians now are conducting transactions in Gold (or Crypto currencies such as Bitcoin) which could elevate Gold demand. Import of gold in the form of coins and medallions is prohibited. Ah well, another interesting bit of info in the ever changing times we live in. Narendra Modi Bans India’s Largest Currency Bills in Bid to Cut Corruption Enjoy Answer from Fleck: “ I suspect this will boost gold demand, after the initial shakeout in a scramble for cash by real estate guys. How can anyone trust the government at all after this?” Question: Fleck, I find it odd that SLV has not broken it’s Tuesday low, 11-8-16, while GLD has. Makes me believe that the down move in GLD is just “noise” unless, or until, SLV closes below the Nov. 8th low. Is this how you “analyze” price movement in the precious metal’s complex; that is, waiting for all assets to show a confirmation in movement? Thanks Answer from Fleck: “ Silver is benefitting from being an “industrial” metal, too. That is part of the concept that is working right now.” Question: Hey Bill, \\n1. In theory Trump should be good for ‘main street’ and I am wondering if this will cause inflation to tick higher? My inclination is that it will. \\n2. In the overnight Gold futures market it seems to be trading strong and then loses that strength when the U.S. opens. My guess is that more spec. longs are unwinding and this should bring open interest down to a more normal level. I know you don’t regard the COT data as too meaningful but if Gold holds above $1,200 while spec. long open interest declines, would this be a good set up for the next leg higher? \\nThanks! Answer from Fleck: “ 1. Yes, plus psychology is changing. 2. There are many scenarios that could be positive, not just yours.” Druckenmiller Sells His Gold Question: As far as I know Soros does trade his positions whereas Druckenmiller keeps his positions for some time. What do you make of Stan selling all his gold? \\n[Speaking to CNBC this morning, fund manager Stanley Druckenmiller – who had been pessimistic about the U.S. economy, said that he is now “quite, quite optimistic” on the U.S. economy following the election of President-elect Donald Trump. “It’s as hopeful as I’ve been in a long time.” \\n“I sold all my gold on the night of the election.” Why? “All the reasons I owned it for the last couple of years seem to be ending”, namely, expectations that inflation is now set to spike, forcing money out of safe assets – like gold and Treasurys – and into the dollar.] Answer from Fleck: “ Druck is a trader and investor. Please see the other post on this topic.” Question: In India the gold prices have doubled in few cities due to the currency note issue. Wall Street and the moron Drunkenmiller does not have a clue. Chinese demand will also accelerate due to yuan fall. Gold demand is spiking up in Asia all over. Out of touch Wall Street can control the gold prices only for few days. If this continues I will load up gold bars here in America to sell in India and rest of the Asia. There are enough rich people in India who want gold. Maybe “Stan” should sell any coins left over to me. Answer from Fleck: “ You make worthwhile points about demand, but in the short run they can be “trumped” by the herd for a little while.” Question: Interesting….I don’t recall gold miners caring a hoot when Druckenmiller declared that he was long gold. Now that he says he’s out (of gold), they obediently pay attention??? Answer from Fleck: “ LOL, for this five minutes.” *** To subscribe to Bill Fleckenstein’s fascinating Daily Thoughts CLICK HERE. \\n***KWN has now released the extraordinary audio interview with Egon von Greyerz, where he gives KWN listeners a look what is really happening behind the scenes globally and in the gold market, and you can listen to it by CLICKING HERE OR ON THE IMAGE BELOW. \\n***ALSO JUST RELEASED: If You Are Worried About The Action In The Gold Market, Just Read This… CLICK HERE. \\n© 2015 by King World News®. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. However, linking directly to the articles is permitted and encouraged. About author'"}, "time": 1742562450.8092012}