{"duration": 1.760232925415039, "input_args": {"text": "'DISPATCHES FROM DANIEL ESPINOSA working to defeat the Big Lie in all its forms A s the Shipibo community living in Lima loses the very little they have to fire, Luis Castañeda, self-appointed “Best Mayor in Lima’s History”, breaks his typical silence only briefly, to improvise some of the usual lies. His silence has worked well in the past. Despite having participated in the infamous “Comunicore” case in his first term as mayor of Lima, back in 2006 -where millions of Peruvian Soles, intended to pay the cities’ debts with a contractor, were diverted to a mysterious company with ties to cocaine trafficking- his popularity has always been around a fairly decent 60% percent. ( http://gestion.pe/politica/pese-denuncias-crece-popularidad-castaneda-2173916 ) ABOVE: LIMA—Shipiba community in CantaGallo. It’s been about a year that the authorities offered to relocate them, but so far the government ha snot made good on its promises. (Photo credit: Alessandro Currarino / El Comercio) This is probably his best accomplishment: having been able not only to avoid jail but to earn a second term as Mayor. But Peruvians are short-sighted when it comes to our politicians’ obvious venality (we also elected Alan García Pérez for President twice), and as the popular slogan goes, as long as he develops some visible infrastructure, some public works, for the city, he can very well steal money with impunity. (“ Roba pero hace obras ”) The superfluous Shipibos Luis Castañeda (l), and Jose Pinheiro (El Comercio) The community arrived at Lima by the turn of this century, some of them invited by ex-president Toledo to participate in the popular marches to oust Fujimori from the presidency (2001), others to support their children, some of them studying in Lima, or just looking for better opportunities. Having no means to go back to the Peruvian rainforest in Ucayali, many Shipibo families established themselves near the Rímac River, in the island of Cantagallo, right in the center of Lima’s most traditional district, where they built precarious housing and started to earn a living by selling the products of their craftsmanship, without asking for anything but basic services. After more than a decade getting used to the extreme differences of living in an overcrowded and polluted city like Lima, and standing in the way of municipal construction works, (Castañeda´s favorite projects involve hundreds if not thousands of tons of concrete) they finally asked for relocation when they got fed-up with the noise and started to get sick from the clouds of dust coming from the construction sites. In a stroke of luck, this happened when Castañeda was leaving office to make an attempt at becoming President of Peru. The new Mayor, Susana Villarán, was more open to the communities’ plight. She decided to dedicate a sum of money from the ongoing project affecting the community, ‘Río Verde’ (‘Green River’), to relocate them to a different district, and in agreement with the leaders of the community, closed a deal that, only a couple years later, Castañeda decided not to honor. During the first year of Castañeda’s second term as Mayor, his deputies assured the community that everything was still going as planned, this was in April 2015. Right after that, the commune went “mute”, as Limeños have nicknamed their mayor for his reluctance to respond for the many scandals he has been involved in, or establishing open channels to communicate his decisions. Receiving the silence treatment by the authority responsible for their relocation, which, as law demands, also promised to share with them the documents regarding the advancement of the project, they approach the judiciary to start a long and Kafkaesque set of procedures, stating also that: “…some officials show a paternalistic and disrespectful attitude toward us and the people protecting our rights. We are not going to accept this behavior in the next meetings, as we believe in dialogue and respect among peers as a necessity for arriving to a solution. We are being patient despite the terrible toll, both physical and psychological, we are suffering because of the construction works…” ( https://www.facebook.com/limashipibo/posts/895889667140366 ) T his is the kind of treatment native communities suffer in Peru, as they not only contribute very little to the capitalist agenda driving our society, but often stand against the wholesale extractive policies in their ancestral lands. In recent years more than a hundred activists have been murdered, most of them in Honduras, Brazil and Peru. In the scheme where all resources must be exploited, native communities are regarded as “superfluous” —a nagging anachronism—in the way to economic progress and material profit by corporations and politicians. Some Peruvian journalists protect this kind of politician with the usual hypocritical rhetoric about public moneys being used to fund social projects, something outrageous (yet normal) for mainstream journalists who have forgotten any sense of duty towards the voiceless, but remain fierce defenders of the rights of capital. As anyone with an idea of what propaganda is, or how it works would clearly see, these journalists are chosen because they can incorporate the principles of capitalism and the right of “second class citizens” to participate in our democracies as cheap labor force, or not at all. Most of these journalists have no other talent than an outstanding tolerance for institutionalized inequality and racism, the kind of character trait some mainstream media seem to look for in their employees: “…you were not born in Lima, ¿isn´t it? You came from somewhere else, ¿what for? It’s as if people from Lima went to Ucayali. I can´t go there and just grab public precincts,” mumbled the renowned homophobe and radio host Phillip Butters, living in a city of almost ten million people, most of them migrants from Peruvian provinces (and being himself one!) who came with very little and “grabbed” public premises to build their homes. ( http://larepublica.pe/sociedad/819211-phillip-butters-genera-polemica-en-las-redes-sociales-por-su-comentario-sobre-shipibos-de-cantagallo ) Shipibo traditional garments. The Shipibo community is poor, they lack representation in Peruvian politics and “The Best Mayor in Lima’s History” have very little to gain by relocating them or even listening to their plight. As other communities from the Amazon rainforest, they survive through their own talent. Most houses in the Cantagallo shantytown are also independent workshops where the Shipibos make all sorts of traditional handicrafts to sell in their own market. They value their culture above everything else, which among many other principles, leans toward self-sufficiency, creating all the things they need by themselves, and aren’t very adept at finding corporate jobs or asking for bank loans, as most people in Lima are. Also in ashes now, they built a bilingual school for their children. Nothing to gain here I t might be useful to understand the logic behind some of Peru’s officials, in this case, the only benefit Castañeda could attempt to win would be publicity, as a mean to strengthening his already fair popularity. But now that ship has sailed. Even more, some argue that the Shipibos were standing in the way of big profits, as the value of the land where they were being relocated adds up to almost five millions dollars. We are talking about a Mayor who overprices public works, urbanization, and city infrastructure, and who has had shady associations with local and foreign contractors, a fact recently uncovered in another case of corruption involving Brazilian construction companies and Peruvian politicians. (The ‘OAS’ Case: https://idl-reporteros.pe/el-correo-delator-1/ ) So it is that the site destined for the relocation by former Mayor Villarán, was covertly sold by the commune without sharing this detail with the community, as journalist Daniel Yovera revealed a day before the fire ( http://rosamariapalacios.pe/2016/11/05/castenada-vendio-terreno-de-los-shipibos/ ). The money, originally earmarked for them and their children’s well-being, went back to the original construction project, instead of to the fund put aside in first place, specifically for the Shipibo’s new home, taking them back to where they started. As the OAS case revealed (IDL Reporteros, 10/19/16) one of Castañeda’s representatives was already planning to cancel the project “Río Verde” even before he started his second term as Mayor. The President of OAS, Jose A. Pinheiro, was arrested two days after the telephone conversation regarding the cancelation of the project, for crimes in Brazil related to fraudulent concessions in construction works, which means the law applies, somewhere. In the ashes of Cantagallo As the fire is extinguished in Cantagallo, four hundred Shipibo families have lost everything, and Castañeda keeps talking through deputies and press aides, only coming out of his “muteness” to blame the former Mayor, although everything indicates this time he won´t be able to dodge his responsibility for his crimes of negligence by giving Lima the silent treatment. As Limeños gather food, water and other supplies for the Shipibos, the outrage against Castañeda grows, while marches are being organized in protest. The Shipibos are not leaving Cantagallo, despite the fact that now it represents no more than the ashes of their past, and the memories of loss and indifference. They are afraid they will lose this patch of land near the Rímac River if they leave, and dislike the idea of moving to the cluster of tents pitched for them by a commune they distrust. ABOUT THE AUTHOR Associate Editor Daniel Espinosa Winder (34) lives in Caraz, a small city in the Andes of Peru. He graduated in Communication Sciences in Lima and started researching mainstream media and more specifically, propaganda. His writings are a often a critique of the role of mass media in our society. Daniel also serves as Editorial Director for TGP’s Spanish Language edition. =SUBSCRIBE TODAY! NOTHING TO LOSE, EVERYTHING TO GAIN.= free • safe • invaluable If you appreciate our articles, do the right thing and let us know by subscribing. It’s free and it implies no obligation to you— ever. We just want to have a way to reach our most loyal readers on important occasions when their input is necessary. In return you get our email newsletter compiling the best of The Greanville Post several times a week.'"}, "time": 1742563580.6560717}