{"duration": 0.06317353248596191, "input_args": {"text": "'\\nby Matt Agorist\\n“It is enough that the people know there was an election. The people who cast the votes decide nothing. The people who count the votes decide everything.” – Joseph Stalin (allegedly)\\nOne thing in US history is consistent throughout every single election cycle — allegations of voter fraud. These allegations, however, are not the ramblings of a kook with tinfoil wrapped around his head, they are substantiated and reach as high as the Supreme Court. Don’t believe it? Ask Al Gore and George W. Bush .\\nIf you think that the ruling class would leave it up to the voters to decide who gets elected, you should think again. Every single candidate who actually challenges the status quo becomes a target.\\nThis year is one of the worst years ever for voter fraud, as it’s been captured on video — multiple times.\\nLast Month, Hillary Clinton declared herself the winner of the Democratic Party in the much-anticipated Iowa caucuses. Immediately after the ‘victory,’ Clinton went on CNN to bask in her counterfeit fame.\\n“I am so thrilled,” Clinton told Wolf Blitzer in an interview Tuesday afternoon. “My luck was not that good last time around, and it was wonderful to win the caucus, to have that experience.”\\nHowever, fraud was so rampant that a C-SPAN video caught it. Clinton’s ‘victory’ would have nothing to do with ‘luck,’ and her premature declaration of the “razor thin” tie, was no mistake.\\nWhen campaign minions aren’t fudging the physical vote count, computers, tasked with tallying the vote, are susceptible to hacking.\\nIn 2006, the documentary Hacking Democracy , exposed Diebold and their role in rigging elections with their electronic voting machines.\\nClinton Eugene “Clint” Curtis is an American attorney, computer programmer and ex-employee of NASA and ExxonMobil, who also exposed election hacking.\\nHe is notable chiefly for making a series of whistleblower allegations about his former employer and about Republican Congressman Tom Feeney, including an allegation that in 2000, Feeney and Yang Enterprises requested Curtis’s assistance in a scheme to steal votes by inserting fraudulent code into touch screen voting systems.\\nCurtis is seen in the video below testifying under oath in front of the U.S. House Judiciary Members in Ohio.\\nHe tells the members how he was hired by Congressman Tom Feeney in 2000 to build a prototype software package that would secretly rig an election to sway the result 51/49 to a specified side.\\nAfter watching the video, you’ll know why true change is hard to come by.\\n\\nDelivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by The Free Thought Project of thefreethoughtproject.com . \\nThe Free Thought Project is dedicated to holding those who claim authority over our lives accountable. '"}, "time": 1742563404.110677}