{"duration": 0.06378698348999023, "input_args": {"text": "'A Berkeley student argues that free speech puts student safety at risk in an   for the Daily Californian this week. [Juniperangelica Xiomara   a   transgender transfer student at UC Berkeley, argues in an   for the Daily Californian this week that she will “not put down [her] lighter fuel” as long as speakers like Milo Yiannopoulos and Ann Coulter are permitted to speak on campus.  “The concepts that America is great because of our ability to share perspectives and differing opinions, that UC Berkeley is beautiful because we can discuss and organize with opposite sides of the political spectrum   …     are bullshit,”   argues, claiming instead that free speech sustains institutional structures of oppression. “This has done nothing more than maintain the white supremacist, capitalistic and patriarchal nature that allowed colonizers to protect their power centuries ago and that has allowed their descendants to elect an openly racist, queerphobic,   and   administration. ” View post on imgur. com,  “Free speech has always been a tactic used by the state to grant the illusion that all voices in this nation are valued, yet there is a reason why Black female senators are discredited and why there is a white supremacist in the Oval Office,”   argues. The column argues that free speech directly conflicts with the aims of those who seek to protect the freedoms of marginalized students, students that   believes Yiannopoulos and Coulter want dead. “I’m not here for free speech. I’m here for Black lives. I’m here for undocumented lives, queer and trans lives, femme lives, incarcerated lives and poor lives. I am here for the lives Milo Yiannopoulos and Ann Coulter want dead. I am here for the lives Donald Trump wants to ban. I am here for the lives BCR cannot fit in their “socially moderate, fiscally conservative” fantasy,”   argues.   claims that free speech principles must be dismantled if marginalized individuals are to “confront [their] oppressors. ” ” “Are we committed to our peer’s survival, or are we keeping our heads down and continuing the pursuit of a degree? Are we willing to confront our oppressors head on, or do we want to play respectability politics and support university actions that disregard communities?” Comments on the article were overwhelmingly negative, with most expressing concern over  ’s unwillingness to “put down [her] lighter fuel,” which many considered to be a direct endorsement of violence in response to political speech. “Words are words and violence are violence, and the two are not the same. In fact, the freedom to say as we think is a vital component to preventing violence, for if someone is not allowed to support their cause through speech, violence is the only option left to them,” one commenter wrote. “You endorse the suppression of dissenting opinions through violence. Lets (sic) not sugar coat your views with doublespeak about “protecting” minorities. The only things you protect are your own snowflake feelings,” another added. Tom Ciccotta is a libertarian who writes about economics and higher education for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com'"}, "time": 1742564462.8868093}