{"duration": 0.05960965156555176, "input_args": {"text": "'When “The Good Wife” had its premiere, there was a clear line from Hillary Clinton to Alicia Florrick (Julianna Margulies) the ambitious lawyer who came into her own after her politician husband’s sex scandal. But the show had another Clinton figure all along: Diane Lockhart (Christine Baranski) who hired, befriended and ultimately fell out with Alicia. A leonine liberal not allergic to money or a highball of fine Scotch, she rose in a boy’s club through alliances, compromise and knowing how much of herself to conceal. Diane begins “The Good Fight” ready for a change. Like certain other people of her political persuasion recently, she meets a less happy kind of change than she was expecting. But for her  —   and for this improbable but promising spinoff  —   it ends up being an invigorating new start. The series opens a year after the end of “The Good Wife,” in which Diane hauled off and smacked Alicia for revealing, in order to win a court case, that Diane’s husband, Kurt McVeigh (Gary Cole) had had an affair. Now, Diane is leaving her Chicago law firm and shopping  —   alone  —   for a retirement vineyard in Provence. That sounds like the premise of a typical TV spinoff (Frasier moving to Seattle, Rhoda to New York). But “The Good Fight” does not find Diane struggling to grow a decent carignan or getting to know her quirky Provençal neighbors. Her nest egg was invested with two of her oldest friends, Henry and Lenore Rindell (Paul Guilfoyle and Bernadette Peters) who plowed it into a Ponzi scheme. Effectively broke and jobless, she’s forced to start over. She ends up across town, at a mainly   firm run by Adrian Boseman (Delroy Lindo) reunited with Lucca Quinn (Cush Jumbo) Alicia’s old comrade. Other familiar faces include Marissa Gold (Sarah Steele) who returns as Diane’s assistant the viperous law partner David Lee (Zach Grenier) and Charles Abernathy (Denis O’Hare) one of the quirky judges on the original show’s packed bench. By the end of its run, “The Good Wife” grew so sprawling that it played like several shows sharing the same hour. “The Good Fight,” also run by Robert and Michelle King, doesn’t reinvent the franchise so much as pare off a manageable chunk. It’s still distinctive, though, for a new drama to star an actress in her 60s. The upgrade plays to Ms. Baranski’s range, as she conveys both Diane’s desperation and the will it takes to master and move past it. “The Good Fight” pairs her comeback story with that of the newly minted lawyer Maia Rindell (Rose Leslie, “Game of Thrones”) who is dogged by her parents’ scandal much as Alicia was by her husband’s. She’s the good daughter, guarded, shellshocked and a bit of an enigma. Lucca, meanwhile, often plays the sounding board for Diane, as if she and Maia were going halfsies on Alicia’s role. Alicia herself is a sort of absent presence here. When Diane tells Maia why she’s willing to take seemingly unsavory clients, she seems to allude to their falling out: “People I thought with all my heart were guilty turned out to be innocent,” she says. “People I thought were saints  —   they weren’t. ” Basically, Diane is doing the same job in a different location, and so is “The Good Fight,” which will stream online on the CBS All Access subscription service. The first two episodes go online Sunday night, with additional episodes every Sunday. The pilot will show on regular CBS Sunday (edited for time and broadcast standards) after which CBS will have to pray that its traditional TV audience can find the internet. I can sum up how the move from network to streaming changes the show in one word. Unfortunately, it’s a word I can’t repeat here. Diane utters it about 20 minutes into the pilot it appears copiously thereafter. It’s not as jarring as you might think. “The Good Wife” had an unusual maturity and moral ambiguity for a broadcast drama now “The Good Fight” has the expletives to match. (The episodes also run slightly longer.) The Kings often argued that “The Good Wife” deserved credit for churning out 22 episodes a year for CBS, implying that the show might have been different if given the shorter season of a cable or streaming series. But “The Good Fight,” despite having 10 episodes, so far plays much the same  —   the snappy dialogue, the technology obsession, the     structure. It contrasts with, say, AMC’s “Better Call Saul,” which established a different voice for a different protagonist. Consistency is no crime, but it will be interesting to see if the show evolves. The   firm setting, for instance, might shake up the often very white legal world of “The Good Wife. ” Also, with Alicia gone, “The Good Fight” has a less direct connection to politics, with one early exception  —   the universal exception, Donald J. Trump. The first episode, “Inauguration,” opens with a scene (added well into shooting) of Diane watching Mr. Trump’s swearing in, stunned. The surprise election result turns the series’ premise into an unintended metaphor. Diane stands in for a certain breed of liberal who expected to be able to take a breather, the glass ceiling shattered, the gains consolidated. Instead, her financial ruin  —   the scam, we learn, wiped out “many of the nation’s liberal elites”  —   leaves her to claw her way back. Oddly, this makes the series feel more    than if it had aired as planned, during a triumphalist Clinton administration. Diane Lockhart would never admit this, but Mr. Trump may have done her a favor.'"}, "time": 1742628533.8394015}