{"duration": 0.13651776313781738, "input_args": {"text": "'by Yves Smith \\nBy Jeffrey Butler, Assistant Professor, Louisiana State University; Paola Giuliano, Associate Professor of Economics at the UCLA-Anderson School of Management; and Luigi Guiso Axa Professor of Household Finance, Einaudi Institute for Economics and Finance. Originally published at VoxEU \\nAssessing the trustworthiness of others is a ubiquitous and fundamental process. If these trustworthiness assessments translate into trusting behaviour , understanding how ‘trust beliefs’ are formed is consequential. The current US presidential election may hinge on voter assessments of the trustworthiness of candidates. The victims of the US investment fraudster Bernie Madoff are reminders of the potentially severe financial consequences of misallocated trust. \\nKenneth Arrow (1972) famously asserted that trust is a prerequisite for most economic activity. A large and lively body of research in economics focuses on trust and its aggregate economic consequences, documenting strong relationships between general levels of trust between nations and everything from GDP growth to cross-country trade patterns (Knack and Zak 2001, Knack and Keefer 1996, Guiso et al. 2004, Tabellini 2008, Algan and Cahuc 2010, Guiso et al. 2009). \\nDespite the economic importance of trust, surprisingly little is known about what causes us to trust others. Although previous research suggests that both pecuniary and non-pecuniary factors (‘betrayal’ or ‘control’) play a role, it is not clear which non-pecuniary factors are particularly important or persistent, or precisely how these factors affect trust (Bohnet and Zeckhauser 2004, Cox 2004, Ashraf et al. 2006, Bohnet et al. 2008, Butler and Miller 2015, Bolton et al. 2016). \\nFurthermore, while common sense dictates one determinant of trust must be trust beliefs, even less is known about what shapes these beliefs or their relationship, if any, with trusting behaviour. \\nMoral Determinants of Trust and Trust Beliefs \\nOur research is beginning to fill this gap. We use experimental evidence from the so-called ‘trust game’ to shed light on the determinants of trust and trust beliefs. In this game, one person (the ‘sender’) sends money to another person (the ‘receiver’). The amount is increased when the receiver gets it. In turn, the receiver can return all, some or none to the sender. Because receivers are unconstrained in their decisions, senders’ choices can plausibly be interpreted as trusting behaviour. \\nOur results shed light on how, and to what extent, moral concerns drive trust. Building on previous research that found scope for non-pecuniary concerns, in Butler et al. (2016a) we elicit participants’ subjective, individual notions of what constitutes ‘cheating’ in the context of a trust game experiment, and relate this to their behaviour in the same game. \\nWe find a large direct impact of moral concerns. While expected monetary returns play a large role in senders’ decisions to trust, we estimate that the likelihood of ending up feeling cheated also significantly influences trusting behaviour. Surprisingly, the influence of moral concerns on how much individuals trust is comparable in magnitude to risk aversion, a more widely acknowledged determinant of this trust/investment decision. \\nNotions of Cheating \\nHaving documented that moral considerations are an important direct determinant of trust, we also found indirect channels through which moral concerns may affect trusting behaviour. One such channel operates through senders’ trust beliefs. We found that receivers try to not leave their (anonymous) co-players feeling cheated. Since there is no consensus on what cheating entails – we find wide variation in definitions of cheating, the patterns of which are interesting in their own right – this requires receivers to guess what senders would consider to be ‘cheating’. \\nHow do they guess? Our evidence suggests that receivers’ belief in what the senders would consider as cheating is strongly correlated with how receivers themselves define cheating. This is a pattern consistent with the psychological phenomenon of ‘false consensus’ (Ross et al. 1977) in which we tend to think that others are like us. \\nAstoundingly, we find that senders apparently anticipate this thought process. We uncover a strong positive relationship between senders’ own cheating definitions and how much money senders believe receivers will return to them. \\nSince moral considerations, as manifested by subjective cheating definitions, play a strong direct and indirect role in trusting behaviour, the obvious question arises: where do these definitions come from? Our study suggests that cheating notions are affected by values instilled by parents. We surveyed participants about the values their parents taught them during their upbringing, and classified the list into two categories: Pro-social values, such as altruism and cooperation Pro-competitive values, such as striving to be better than others \\nWe find that pro-competitive values are strongly associated with higher cheating definitions – that is, needing higher monetary returns in order to not feel cheated – while pro-social values substantially relax, or lower, cheating definitions. \\nReal-World Implications of Experimental Findings \\nAre there any real-world implications for these experimental findings about trust? If trust beliefs drive trust behaviour, trust behaviour is important for economic success. Moreover, if some individuals hold persistently mistaken trust beliefs, then these mistaken beliefs may create substantial economic losses. \\nThe relationship between parentally instilled values and, ultimately, trust beliefs may be one source of persistently mistaken beliefs. A reduced-form channel may be false consensus. For instance, trustworthy individuals may believe that others are more trustworthy than they actually are – and, to the extent that false consensus operates on a subconscious level, its distorting effect on beliefs may not be eradicated by evidence. \\nConsistent with either of these channels, in related research we document substantial economic losses at the individual level associated with mistaken trust beliefs in large-scale survey data (Butler et al. 2016b). The income losses we can attribute to mistaken trust beliefs are in the same order of magnitude as those associated with not going to college. We replicate this relationship between mistaken trust beliefs and earnings losses in an experimental trust game, where we also find a substantial role for parentally instilled values, and false consensus in shaping trust beliefs (Butler et al. 2015). \\nEconomists have singled out trust as an important phenomenon at the individual level, and for society as a whole. This raises natural questions about the determinants of trust. We knew already that decisions about whom and how much to trust are partly based on pecuniary considerations, but that there is a substantial and varied role for moral considerations. The interplay between trust, trust beliefs, instilled values, and automatic psychological process such as false consensus may be a particularly fruitful area for more research. \\nSee original post for references 0 0 0 0 0 0'"}, "time": 1742563104.3520563}