{"duration": 1.2830841541290283, "input_args": {"text": "'President Donald Trump has instructed the State Department to slash its $10 billion budget for funding United Nations programs by as much as 50 percent, Foreign Policy is reporting. [The article said the move is “signaling an unprecedented retreat by [the] administration from international operations that keep the peace, provide vaccines for children, monitor rogue nuclear weapons programs, and promote peace talks from Syria to Yemen. ”  FP used three unnamed sources for its report, which also called Trump’s directive “draconian measures” taken ahead of the planned release on Thursday of his 2018 federal budget proposal. The budget “is expected to include cuts of up to 37 percent for spending on the State Department, the U. S. Agency for International Development (USAID) and other foreign assistance programs, including the U. N. in next year’s budget,” according to the report, which went on: It remains unclear whether the full extent of the steeper U. N. cuts will be reflected in the 2018 budget, which will be prepared by the White House Office of Management and Budget, or whether, as Secretary of State Rex Tillerson has proposed, the cuts would be phased in over the coming three years. One official close to the Trump administration said Tillerson has been given flexibility to decide how the cuts would be distributed. Richard Gowan, a U. N. expert at the European Council on Foreign Relations, told FP these budget cuts would create “chaos. ” The U. N. refugee agency (UNHCR) for example, received nearly 40 percent of its budget from the United States in 2016. Cutting the U. S. contribution would “leave a gaping hole that other big donors would struggle to fill,” according to Gowan. The   FP cites Trump’s intention to cut diplomacy and foreign assistance programs will help him increase the funding for the U. S. military by $54 billion, a “shift” from the Obama administration’s approach to the federal budget. “State Department officials, for instance, were told that they should try to identify up to $1 billion in cuts in the U. N. peacekeeping budget, according to one source,” FP reported. “The United States provides about $2. 5 billion per year to fund peacekeepers. ” Nikki Haley, the U. S. ambassador to the United Nations, cautioned against “   cuts” during her Senate confirmation hearing but is said to be reviewing the U. N.’s 16 peacekeeping missions for possible cuts. The United States pays over 22 percent of the U. N.’s $2. 5 billion yearly administrative budget, including money “to battle climate change. ” FP reported that “U. N. diplomats and foreign dignitaries say they expect the United States to seek to eliminate funding for some agencies unpopular with conservatives  —   including the U. N. Population Fund, which receives about $35 million a year from the United States for family planning programs, and the U. N. Framework Convention on Climate Change. ” Also, “the U. N. Relief and Works Agency (UNRWA) which provides aid to Palestinian refugees, has long been the target of Israeli and congressional criticism on the grounds that it has a   bias. According to the FP report: But one diplomat said UNRWA might be spared because it relieves Israel of the obligation to care for some Palestinians and because Israel sees the program as ultimately promoting stability. The United States has broad discretion to cut voluntary funds to humanitarian agencies, including the World Food Programme and UNICEF. But those programs are popular among Democrats and Republicans, and any move to slash funding could undermine Washington’s case for leading those agencies. In the early days of his administration, Trump reinstated the “Mexico City Policy,” a policy first instituted by President Ronald Reagan and continued by Republican presidents since. The policy prohibits funding international NGOs and other entities that provide or promote abortion around the globe. “Anticipating cuts to family planning programs, Dutch Development Minister Lilianne Ploumen recently established a fund to solicit contributions to institutions that have faced a cutoff of U. S. assistance because they perform abortions,” FP reported. FP also reported that if the U. S. “fails to honor its funding commitments to the U. N.’s regular budget, which is obligatory, it could lose its voting rights in the General Assembly. ”'"}, "time": 1742562399.5881252}