{"duration": 1.731456995010376, "input_args": {"text": "'PARIS  —   Last November, immediately after the Bataclan terror attacks here, France’s national anthem took on a global significance that few would have predicted. “La Marseillaise” was sung at rallies across the country, in English soccer stadiums and American concert halls. But it was actually a song transformed  —   throwing off its appropriation by the far right to become an anthem of unity and hope. That change had begun to occur after the earlier Charlie Hebdo attack  —   something noted by President François Hollande, who named 2016 the Year of the “Marseillaise. ” This month, about 100 academics, government officials and military personnel gathered at a daylong conference at the French Defense Ministry to help mark an end to that commemoration. They debated the song’s meaning, especially its climax that calls on people to “water the fields with impure blood” (the debate was over whose blood it was). They discussed how its melody had inspired revolutionaries from Russia to Chile. And they listened to countless versions of it, a feminist “Marseillaise” going down particularly well (its chorus  —   “Tremble, tremble, jealous husbands”  —   was met with laughter).   Todeschini, who is responsible for veteran affairs at the Defense Ministry, said that the Year of the Marseillaise was declared precisely so that the French, especially the young, could   the republican values of the song, which was written by Claude Joseph Rouget de Lisle in 1792 during the French Revolution. “I am thinking in particular of freedom, resistance and fraternity,” he said. “It belongs to all the French, not to one political party or sectarian ideology. It’s important in the current context of terrorism and risk to our social cohesion to unite all French people around our hymn. ” At the same time that the government has been promoting its reappropriation, others in France have been debating the value of the song  —   and its ability to unite  —   in less formal settings. “I didn’t grow up with the mentality of singing it,” said Philippe Fragione, better known as Akhenaton, one of France’s most popular rappers. “I’m from Marseilles and there’s always been a feeling there that we have to rebel against the state. My view changed a bit after the attacks when people in other countries were singing it  —   that showed solidarity  —   but sometimes politicians and fake philosophers use it to point out differences, and that’s a problem. ” Magyd Cherfi, a   writer and frontman of the band Zebda, said that in his view, “things have evolved in France” over the past year, changing people’s relationship to the country and the anthem. “Fear lives on every street now and people lose confidence in the nation. They take refuge in extremes. ” Mr. Cherfi has a long, complicated history with the “Marseillaise. ” In the late 1990s, he made an album of covers of revolutionary songs, but chose not to include the anthem, saying at the time, “France, in some ways, does not want us,” referring to   immigrants like himself. However, after the Paris attacks, he wrote in a widely republished Facebook post: “There are days like this when we love France, when we want to sing the ‘Marseillaise.’ ” He went on: “It was carnage and it’s my day of baptism. I become solemnly French. ” He feels the same connection today, he said, but seems less certain about the anthem. “The Marseillaise is lost in modernity,” he said. “It addresses the French of more than two centuries ago. I think it is good to change the text to make it more universal, because now France’s children are black, Asian, North African. They must find themselves in it. ” There are no surveys to reveal how common such views are, but it is just as easy to find people who celebrate the song. Georges Salines of the victim association 13onze15: Fraternité et Vérité lost his daughter, Lola, in the attack at the Bataclan concert hall and soon afterward heard the “Marseillaise” at a national remembrance ceremony. “I’m not really a fan of the tune, but it was the version by Berlioz, and it was most beautiful I’d ever heard,” he said. He buried his daughter on the same day. “I can’t separate it from those memories now. It’s taken a different meaning to me, beyond an anthem. ” He said the “Marseillaise” has probably helped unite the country since the attacks thanks to its lyrics “against tyranny, absolutism and intolerance. ” He said he understood why some disliked it, since he used to share many of their reservations. But he disagrees with calls to change the words. “I don’t like this idea of correcting pieces of art for political correctness purposes,” he said. “There are racist phrases in ‘Tom Sawyer,’ but you will not change ‘Tom Sawyer.’ ” The Year of the Marseillaise has not put questions of national identity at its forefront, preferring initiatives focused on educating children about the anthem’s origins. Not all have been successful. A competition for musicians to cover the anthem, for instance, largely received joke entries. One simply involved Google Translate reading out the lyrics. Even the winner turned the anthem into a stark soul song. (The singer behind it, Student Kay, said this was because he found its call for sacrifice “quite tragic. ”) Speakers at the conference this month agreed that the anthem was playing perhaps its largest role since World War II, when it helped motivate people against German invaders and the collaborationist Vichy government. “In recent years, the Front National were the only party to use these republican symbols,” said Hervé Drévillon, a professor of modern history at Paris 1 university, referring to the   party. “The attacks gave legitimacy to the other parties to   it. ” All the candidates for next year’s French presidential election have been singing it at rallies, he added. But several speakers noted that some in France were still uncomfortable with the anthem. They either find its lyrics calling citizens “to arms” outdated and violent, or find the line about “impure blood” inflammatory given France’s colonial history.   and Corsicans booed the anthem at football matches in the 2000s. Mathieu Schwartz, a documentary maker who spoke at the conference, said such objections were not about “La Marseillaise” itself. “I don’t think it’s any different from other national hymns,” he said. “If you have a problem with the nation, you have a problem with it. If you changed the music or words, you’d still have a problem. ” Ismael El Iraki, a Moroccan filmmaker who has been living in Paris for 15 years and escaped the Bataclan during the attacks, said the lyrics did not need to be changed. “That infamous line about impure blood is my favorite,” he said, sharing an unusual interpretation from his high school history teacher: Rouget de Lisle was calling on people to shed their own impure blood in defense of the French Revolution  —   purity having been something previously associated with the aristocracy. “That’s why I love the ‘Marseillaise,’ ” he said. “In a moment in history where purity is used as a horrible goal by jihadists and   fear mongers alike, I think it’s a cool line to keep in mind, reminding us that impurity is our own, and our strength. ”'"}, "time": 1742563904.0034468}