{"duration": 0.1995086669921875, "input_args": {"text": "'Selecting a quality film to watch these days often feels like an exhausting enterprise, particularly for conservatives or those trying to find something suitable for a family movie night. [These days, Hollywood seemingly revels in putting out films that bask in their own celebration of immorality and “progressive” ideology and even when a film seems appropriate, or even features positive messaging, there’s a good chance that many of the actors in it have used their elevated visibility to rail against many of the values and beliefs that conservatives hold dear.  A brief glance at the recent Academy Awards confirms that the Hollywood “industry” is a mess even when the Oscars get the Best Picture winner right, many of the stars in attendance literally wear their support for   organizations like Planned Parenthood and the American Civil Liberties Union on their sleeves. Thankfully, the modern miracle of the VHS tape, the DVD, and later, the   disc, have mitigated the need for a trip to the theater but even now, it can be difficult to decide which films best align with our conservative values. With that said, here are seven timeless film classics that resonate with positive messages that affirm the virtues that made America great  —   and can be watched any time to avoid   of Girls. (Note: Not all of these films are suitable for children. Also, the films are listed in no particular order.)   1.   (1959) William Wyler’s 1959 masterpiece won a staggering 11 Academy Awards including Best Picture, Best Director, Best Cinematography, Best Special Effects and Best Actor for leading man Charlton Heston. Don’t let the      runtime discourage you Heston is masterful as Judah   the Jewish prince who is sold into slavery and seeks revenge in this adaptation of Lew Wallace’s 1880 novel  : A Tale of the Christ. With a $15 million budget,   was the most expensive film ever made at the time of its production, and to this day features one of the most stunningly shot and elaborately choreographed race sequences in the history of cinema. The film was remade for a third time (Cecil B. DeMille’s 1925 silent film was the first) in 2016 with Jack Huston and Toby Kebbell in the leading roles, but fared poorly at the box office. Simply put, this story will never be put to film as spectacularly as it was in 1959. Wyler’s   makes our list not only because it is a deeply moving religious masterpiece based on a famous Christian novel, but also because this 1959 film was a subtle affirmation of the newly created state of Israel. Among the film’s powerful themes was Judah  ’s belief in a sovereign nation for the Jewish people. He famously tells his nemesis Messala, “I believe in the past of my people, and in their future. ” Messala taunts him by calling the Jews a “conquered people,” saying, “The glory of Solomon is gone! Do you think it will return? Joshua will not rise again to save you, nor David!” But Judah’s response confidently predicts the ultimate victory of his   people: “You may conquer the land. You may slaughter the people. But that is not the end. We will rise again!” Later, during the film’s famous chariot race, Judah proudly wears a Star of David medal pinned to his chest and wraps himself in a blue cloak like the color of the Israeli flag. The film’s sympathetic treatment of Jewish history reminds modern audiences that Israel has been the rightful home of the Jewish people since ancient times. And today   is also a poignant reminder that once upon a time, Hollywood was unabashedly  .  —   D. N. 2. Braveheart (1995) Mel Gibson pulled double duty in his 1995 magnum opus Braveheart, both directing and starring in the     war epic, for which he earned a Best Director Oscar and Best Picture. Gibson plays 13th century Scottish freedom fighter William Wallace, who leads an army against England’s King Edward I in the Scottish War of Independence. The film was criticized for being historically inaccurate, but that’s almost beside the point it features both some of the most intense war sequences ever filmed, and some of the best meditations on freedom ever uttered by a movie character. “Fight and you may die run, and you’ll live  …     at least a while. And dying in your beds many years from now, would you be willing to trade all the days, from this day to that, for one chance  —   just one chance  —   to come back here and tell our enemies that they may take our lives, but they’ll never take our freedom!” Good stuff. But keep the kids away from this one.  —   D. N. 3. Rocky (1976) Sylvester Stallone wrote the script and starred in this 1976 classic that captured the imagination of a generation and snagged three Academy awards, including Best Picture. Stallone is   boxer Rocky Balboa, a   southpaw who bobs and weaves his way through the grime and grit of his native Philadelphia. While the film’s plot is loosely based on boxer Chuck Wepner’s grueling bout with Muhammad Ali  the character of Rocky is inspired by boxing legend Rocky Marciano. Called up to play the patsy punching bag in an exhibition bout with heavyweight champion Apollo Creed, Balboa seizes the opportunity of a lifetime. In the process, he also finds the love of his life  —   a shy woman who, like Balboa, is a diamond in the rough. The film is a timeless character study on what it means to be a man and to “go the distance” against seemingly impossible odds and despite one’s fears. Ironically, “Rocky”   its weight class at the box office. The John G.   film was made on a budget of about $1 million, but went on to become the   movie of the year, grossing an astounding $117 million. That is thanks, in part, to an incredible cast of actors, including Talia Shire, Burt Young, Carl Weathers, and Burgess Meredith.  —   J. H. 4. Glory (1989) This 1989 American Civil War epic tells the true story of the 54th Massachusetts Volunteer Infantry Regiment, one of the first official black fighting units in the Union Army. The film follows the regiment’s formation under the leadership of Union Colonel Robert Gould Shaw, the son of prominent Boston abolitionists, and ends with the 54th’s valiant charge at the Second Battle of Fort Wagner. Directed by Ed Zwick, the film depicts the struggles and indignities faced by the black regiment as they fight for the right to wear the blue uniform into battle for their own freedom. In the process, Glory explores what it means to be a free man and to carry oneself with dignity and courage. Kevin Jarre’s intensely emotional screenplay, based on Lincoln Kirstein’s Lay This Laurel and Peter Burchard’s One Gallant Rush, as well as Colonel Shaw’s letters, is commanded by a colorful cast of   talent, including Cary Elwes, Morgan Freeman, and Matthew Broderick as Colonel Shaw. The film saw Denzel Washington win his first Academy Award for Best Supporting Actor. Rooted in the characters’ commitment to overcome the brutality of battle and their own personal demons, Glory was one of the first films to bravely and honestly portray the horrors and heroes of the Civil War.  —   J. H. 5. Rudy (1993) Sean Astin shines in this 1993   film  —   based on a true story  —   about a small man with an outsized desire to achieve his goal of playing football at the University of Notre Dame. Rudy follows Daniel “Rudy” Ruettiger’s journey from his small steel mill town to sports legend. Born far from brilliant, Rudy attends a junior college close to Notre Dame, takes a minimum wage job, and undergoes extensive tutoring to overcome his dyslexia. A true tribute to the power of an unbreakable will, Rudy stops at nothing to make the Notre Dame football team. And when he finally gets his chance, he doesn’t waste it. Rudy is ranked 54th on the American Film Institute’s “Most Inspiring Films of All Time” list. The film is perhaps the quintessential underdog story that reinforces the virtues of hard work and determination in achieving one’s goals.  —   J. H. 6. Juno (2007) This small independent film starring Ellen Page, Michael Cera and Jennifer Garner caught Hollywood by surprise in 2007, turning a $7. 5 million production budget into $231 million in global box office receipts and four Oscar nominations, including for Best Picture (it won one, Best Original Screenplay for Diablo Cody). Page plays Juno MacGuff, a    high school sophomore forced to make a tough decision when she discovers she’s pregnant after a seemingly harmless sexual encounter with a friend. The film could have ended very quickly (and tragically) with a trip to Planned Parenthood but Cody’s script deftly balances Juno’s internal emotional conflicts with the gentle humor of life’s most challenging and often unplanned surprises the result is one of the only mainstream,   hit films ever made.  —   D. N. 7. Groundhog Day (1993) Harold Ramis and Bill Murray’s 1993 comedy masterpiece may not seem like a “conservative” movie at first glance. But Phil Connors’s unending nightmare in the town of Punxsutawney, Pennsylvania  —   in which he is forced to   the same day, February 2, over and over and over again  —   is actually a profound story about the things that matter most to us as human beings. As a sort of karmic morality tale, Murray’s arrogant and shallow character is forced to relive the same day until he finally becomes a better man  —   and even wins the affections of his     played by Andie MacDowell. In an excellent column at National Review, Jonah Goldberg calls the film “the best cinematic moral allegory popular culture has produced in decades  —   perhaps ever. ” It’s also uproariously funny: “This is one time where television really fails to capture the true excitement of a large squirrel predicting the weather. ” Well, maybe you have to see it. Danny Rubin and Ramis won a BAFTA Award for their screenplay, and Groundhog Day was selected for preservation in the National Film Registry in 2007.  —   D. N.     Follow Daniel Nussbaum on Twitter: @dznussbaum, Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742562209.0958624}