{"duration": 0.16703224182128906, "input_args": {"text": "\"The Muslim Bloc may have won the battle, but did Israel win the war? October 28, 2016 Ari Lieberman \\nBy now it should be clear to all but the blindest (or rabidly disingenuous) that the United Nations is an organization that has been co-opted by the nefarious interests of Muslim nations and their despotic third world allies. It is an organization rife with prejudice and hypocrisy. An organization that can undeniably and without equivocation be described as today's greatest purveyor of Judeophobia, historical revisionism and conspiracy theories. This fact is best illustrated by three resolutions passed this year by United Nations Educational, Scientific, and Cultural Organization (UNESCO) that deny the indisputable Jewish nexus to the holy city. \\nOn April 12, the 58-member body voted in favor of an asinine and wholly one-sided resolution that referred to Jewish holy sites in Jerusalem exclusively by their Muslim names and designated the Temple Mount, Judaism’s holiest site, as a “Muslim holy site of worship.” To add insult to injury, the resolution also adopted wild conspiracy theories including a claim that Israel was “planting Jewish fake graves in other spaces of the Muslim cemeteries.” \\nUnsurprisingly, the resolution, which was submitted by seven Muslim nations, passed by a wide margin with 33 votes in favor, six against and 17 abstentions. Two nations were absent for the vote. France, Sweden, Slovenia and Spain shamefully supported the vile resolution. \\nThat the resolution would pass was never in doubt given the large number of Muslim and despotic third world nations that constitute the makeup of UNESCO but it was hoped that the resolution would fail to garner European support and Israel could thus claim a moral victory. France with its collaborationist past and proclivity to kowtow to the world’s despots did not disappoint and predictably voted with the rabble. \\nBut following the vote, a crack appeared in the façade of anti-Israel invective so prevalent at the U.N. It appeared that France was having a case of buyer’s remorse. In an address to the French parliament, Prime Minister Manuel Valls termed the resolution “clumsy” and “unfortunate.” He then added in rather sharp and pointed terms that “France will never deny the Jewish presence and Jewish history in Jerusalem. It would make no sense; it is absurd to deny this history.” \\nFrance is one of Europe’s strongest advocates for the Palestinians. The Palestinian Authority and their Muslim allies at UNESCO should have understood from Valls’ statement that future resolutions with similar toxic content would no longer enjoy automatic European support. Instead of declaring victory and moving on, they pressed their luck by introducing another vile resolution in October. \\nThe October 13 resolution , sponsored by the usual suspects contained nearly identical language as the April resolution. It condemned Israel for various contrived transgressions and again severed the Jewish (and Christian) nexus to the city. This time however, the Muslim bloc was in for a rude awakening. While the resolution passed, the Muslim bloc was unable to garner a majority in the 58-member body. \\nOf the 24 nations that voted in favor of the resolution (Mexico later withdrew support lowering the final tally to 23), 14 were composed of states with Muslim majorities while a fifteenth, Nigeria, is 50 percent Muslim, making passage of the resolution a forgone conclusion. What was notable was the fact that this time around, the resolution failed to garner a single western European concurrence. Other developing nations, like India, which had hitherto supported Arab-sponsored drafts also abstained. Israel’s behind-the-scenes political offensive aimed at exposing the lunacy of the Muslim initiative was paying dividends. \\nFollowing the resolution’s passage, the Palestinians and their Muslim allies suffered additional political reversals. Mexico , asked for a revote because it wished to withdraw support for the motion. Mexico's Secretariat of Foreign Affairs said in a statement that his government’s changed position “reiterates the recognition that the Government of Mexico gives the undeniable link of the Jewish people to the cultural heritage of East Jerusalem.” \\nBrazil soon followed suit echoing Mexico’s position. In a statement, the Brazilian government noted that it would no longer support such one-sided resolutions. Italy, which had abstained, went one step further and announced that it would actively oppose such resolutions in the future. Prime Minister Matteo Renzi told an Italian radio station that these resolutions were “incomprehensible, unacceptable and wrong.” He added that “to say that the Jews have no links to Jerusalem is like saying the sun creates darkness.” \\nEven UNESCO’s director-general, Irina Bokova voiced disapproval by stating that “the heritage of Jerusalem is indivisible, and each of its communities has a right to the explicit recognition of their history and relationship with the city.” She later received death threats for voicing objection to the motion. \\nOn Wednesday, the Palestinian Authority and Jordan introduced a third draft resolution to UNESCO’s World Heritage Committee seeking to generate further political terrorism. The proposed resolution once again attempted to sever the Jewish nexus to the city and its holy sites. The 21-member WHC body was expected to pass the resolution by consensus but in a surprise move, Croatia and Tanzania asked for a secret ballot which infuriated the Muslim bloc. Instead of the motion passing by consensus, the vote was 10 in favor, two opposed, eight abstentions and one nation absent. \\nThe two nations opposing were Tanzania and the Philippines. Of the 10 ayes, seven were Muslim. It was a pyrrhic victory at best. \\nGiven the large number of Muslim countries represented at the U.N. and the hostility that most of these nations harbor against Israel, it is a virtual certainty that toxic resolutions of this nature will continue to be sponsored and passed. But as evidenced by recent Arab political reversals, gone are the days that the Palestinians can rely on automatic European and non-aligned support. \\nIsrael has been effectively reaching out to the so-called non-aligned nations and it is having a significant positive impact. Part of the Israeli success lies in the fact that the Jewish state has much to offer these nations in the fields of water technology, agriculture, energy, counter-terrorism, cyber warfare and arms. This outreach has translated to political dividends at the U.N. \\nNevertheless, the UNESCO resolutions serve to highlight the noxious nature and malevolence of many U.N. member states. It also underscores the need for the United States to maintain its commitment and assurance to Israel that it will never allow the U.N. to impose terms and dictates on Israel. \\nThere have been rumors circulating that Barack Obama in his twilight months would seek to impose a deleterious settlement on Israel utilizing the UN Security Council. The White House has remained uncharacteristically mute on the subject raising fears that there may be some merit to the speculation. \\nThe administration’s objective would be accomplished by actively supporting a proposed anti-Israel resolution, likely introduced by France, or by choosing to abstain rather than exercising a veto. In addition to betraying long-standing commitments to Israel and running counter to strong bipartisan opposition, the notion that the United States would throw Israel under the bus and allow those who engage in despotism and blatant anti-Semitism to have a say on Israel’s fate, is beyond asinine. Hopefully, the outrageous conduct exhibited at UNESCO steers the administration in the right direction.\""}, "time": 1742561639.3475456}