{"duration": 0.12096428871154785, "input_args": {"text": "'It’s easy to talk about how giants existed and how ancient mankind created myths around alleged beings of incredible proportions. But apparently, not everything is pure myth. In this article, we take a look at three fascinating MASSIVE footprints that according to many prove ancient Giants did exist. \\n\\n\\nInterestingly, in nearly all ancient writings we find that in the distant past, giants walked among ordinary humans.\\n\\nIf we look at ancient writings from South America, North America, Europe and Asia, we will find that ancient cultures mentioned giants in their ancient writings. However, some ancient texts not only mention giants but suggest they were real.\\n\\nOk so, if giants did exist, then… show me the evidence! \\n\\nWell, the evidence may well be all around us.\\n\\nIt doesn’t matter where we look, Asia, North America, Africa, we will see that there are ‘footprints’ embedded into a rock which are indicative of SUPERSIZED beings.\\n\\nWe can find stories in many mythologies of the ancient world: Greek, Norse, Germanic, Indian, Indo-European, and also in the new world as in the traditions of the Mayans, Aztecs and Incas; but most importantly in almost all major sacred books of antiquity: the Lebhar Gabhale, the Hindu Ramayana and even in the Bible.\\n\\nHowever, in addition to the massive footprints found around the globe, there is written evidence which also suggests these beings were real.\\n\\nA 2,000-year-old book called ‘The Book of Giants’ is what many are referring to as the ultimate proof of the existence of giants.\\n\\nOver 50 years ago, scholars came across this fascinating book which details the Nephilim and how these beings were destroyed. Please note that the word ‘Nephilim’ is still not fully understood. Throughout the years, scholars have proposed some etymologies, among them: ‘The Fallen, ‘Apostates,’ and even ‘those that cause others to fall.’ But regardless of their name and the meaning, the enigmatic Nephilim have long been considered the giant beings that inhabited our planet in the distant past.\\n\\nThe ‘Book of Giants’ was found nearly half a century ago in the Qumran Caves where experts recovered thousands of ancient scrolls that offer invaluable details of mankind’s past.\\n\\nBut Giants are also mentioned in the Bible. \\n“There were giants in the earth in those days; and also after that, when the sons of God came in unto the daughters of men, and they bare children to them, the same became mighty men which were of old, men of renown.” -Genesis 6:4 So in addition to ‘footprints,’ we have ancient texts that speak of Giants and how these beings existed on Earth.\\n\\nBut not everyone is convinced that these ancient texts are proof of giants. As a matter of a fact, many believe that these are just myths created by our ancients.\\n\\nBut if giants are just a myth… how come we have MASSIVE footprints in different parts of the world?\\n\\nRecently, photographers exploring an area near a Chinese village came across a sensational finding. They discovered (and photographed) a footprint left behind by a massive being. In the image –se below— you can clearly see the footprint embedded into rock. Compared to an ordinary foot of a human being, the footprint embedded into rock is at least twice as big.\\n\\n\\nFurthermore, in South Africa near the Swaziland border in the Mpumalanga province, another massive footprint was found embedded into rock.\\n\\nThere a massive 1.2-meter long footprint stands firmly embedded into granite. Locals call it Goliath’s Footprint or ‘The Footprint of God’. Its big. Really big.\\n\\nLocals consider the region where the footprint is located as a place of love, peace, and healing and that the Mpuluzi footprint is there to serve the power of good. How the gigantic footprint was imprinted into granite is another mystery, local shamans tell the story that this particular footprint was left by a being which was running across the ground covered with warm lava ash and that this is how the footprint came to be imprinted in granite.\\n\\n\\nHowever, many remain skeptical. Dr. Jay Wile, a nuclear chemist, asserted that “it is almost certainly not a footprint.”\\n\\nHowever, as we can read on other websites , more controversial footprints have been found around the world.\\n\\nA news article published in the Strand Magazine, December of 1895, reprinted in “Traces of the Elder Faiths of Ireland” by W.G. Wood-Martin mentions this fossilized giant discovered during mining operations in County Antrim, Ireland: “Pre-eminent among the most extraordinary articles ever held by a railway company is the fossilized Irish giant, which is at this moment lying at the London and North-Western Railway Company’s Broad Street goods depot, and a photograph of which is reproduced here… This monstrous figure is reputed to have been dug up by a Mr. Dyer whilst prospecting for iron ore in County Antrim. The principal measurements are: entire length, 12ft. 2in.; girth of chest, 6ft. 6in.; and length of arms, 4ft. 6in. There are six toes on the right foot. The gross weight is 2 tons 15cwt.; so that it took half a dozen men and a powerful crane to place this article of lost property in position for the Strand, magazine artist. Dyer, after showing the giant in Dublin, came to England with his queer find and exhibited it in Liverpool and Manchester at sixpence, sixpence a head, attracting scientific men as well as gaping sightseers”.\\n\\nThe idea that Giants walked on Earth —and that there is even possibly evidence to support claims of their existence— is something fascinating. So, while looking for more massive footprints, we’ve stumbled across the image posted below which seems to depict another GIANT footprint embedded into rock.\\n\\nWhile we have no information as to where the image was taken, we can provide the source where we found the image.\\n\\n\\nFurthermore, another massive footprint embedded into solid rock can be found at Bheemana Hejje near Bangalore. It is referred to as the Giant Footprint of Bheema.\\n\\n\\nAncient-Code \\nSOURCE '"}, "time": 1742562020.718268}