{"duration": 0.36661434173583984, "input_args": {"text": "\"Home / Badge Abuse / Genius Child Arrested, Interrogated, and Thrown in Juvi by Hero Cops for Making a Homemade Clock Genius Child Arrested, Interrogated, and Thrown in Juvi by Hero Cops for Making a Homemade Clock John Vibes September 16, 2015 326 Comments \\nIrving, TX – An intelligent and talented 9th grader was arrested this week for bringing a homemade clock into school. 14-year-old Ahmed Mohamed is interested in electronics and has taught himself how to make his own radios and other devices. He can even repair his own go-kart. \\nRecently, he made a clock that he was proud of so he decided to take it into school and show his classmates and teachers. Sadly, instead of celebrating his achievement, one of his teachers called the police on him because they thought that it might be a bomb. \\nWhen the police arrived, they took the threat seriously and believed that it could be a bomb as well, even though it obviously wasn’t. Eventually, the police charged him with making a clock and misrepresenting it as a bomb, even though he consistently told everyone that it was a clock, and denied that it was a bomb when the teachers or the police suggested it. \\nThe young man was then handcuffed and taken to a juvenile detention center, and his clock was taken and put in an evidence room. He was also suspended from school and was unable to attend a student council meeting that he was scheduled to be a part of. \\n“Here in high school, none of the teachers know what I can do,” Ahmed told Dallas News after the incident. \\nHe then explained that when he showed his engineering teacher what he created, he was warned not to show it to the other teachers. \\n“He was like, ‘That’s really nice, I would advise you not to show any other teachers’,” Ahmed said. \\nHe then kept the clock in his bag until his English class when the alarm went off and disturbed his teacher. After the class, Ahmed showed his teacher what was making the noise, and she accused him of bringing a bomb to school. \\n“She was like, it looks like a bomb,” he said. \\n“I told her, ‘It doesn’t look like a bomb to me,’” he explained. \\nThe teacher took the clock from him and he had expected that was the end of it. However, towards the end of the day, Ahmed was pulled out of class and taken to a room filled with police officers. \\nHe said that the officers then attempted to get him to admit that he tried to make a bomb. \\n“They were like, ‘So you tried to make a bomb? ’” Ahmed said. \\n“I told them no, I was trying to make a clock.” \\nThe officer then told him, “ ‘It looks like a movie bomb to me.’” \\nThe police even admit that Ahmed never once said the device was a bomb, and they never had any reason to believe that it actually was one, but the police still seemed to think he was lying about something, even though they didn’t have any proof. \\n“We have no information that he claimed it was a bomb. He kept maintaining it was a clock, but there was no broader explanation,” police spokesman James McLellan said. \\n“It could reasonably be mistaken as a device if left in a bathroom or under a car. The concern was, what was this thing built for? Do we take him into custody?” he added. \\nThey couldn’t possibly imagine that a young man would want to teach himself a valuable skill and share his achievement with his teachers. \\n“They thought, ‘How could someone like this build something like this unless it’s a threat?’,” Ahmed said. \\nAhmed’s father, Mohamed Elhassan Mohamed believes that his family is being discriminated against. \\n“He just wants to invent good things for mankind, but because his name is Mohamed and because of Sept. 11, I think my son got mistreated,” he said. \\nThere has since been an outpour of support on social media since Ahmed’s story went public. He has even gotten support from Mark Z and President Obama. Cool clock, Ahmed. Want to bring it to the White House? We should inspire more kids like you to like science. It's what makes America great. \\n— President Obama (@POTUS) September 16, 2015 \\nJohn Vibes is an author, researcher and investigative journalist who takes a special interest in the counter-culture and the drug war. In addition to his writing and activist work , he organizes a number of large events including the Free Your Mind Conference , which features top caliber speakers and whistle-blowers from all over the world. You can contact him and stay connected to his work at his Facebook page. You can find his 65 chapter Book entitled “Alchemy of the Timeless Renaissance” at bookpatch.com. Share John Lloyd Scharf \\nI did that. As a Vietnam Vet who spent a great deal of time in the Philippines when they were under martial law, life, liberty, and public safety are too precious to let slip. Every time a citizen is persecuted, the Terrorists win. That is the point of terrorism. Destruction alone is not the object. Having us turn on each other is. A draconian law enforcement suits the political purposes by creating innocent martyrs. When they violate the laws they are paid to enforce and threaten the public safety they are sworn to protect, we lose our liberty and the TERRORISTS win. John Lloyd Scharf \\nI did that. As a Vietnam Vet who spent a great deal of time in the Philippines when they were under martial law, life, liberty, and public safety are too precious to let slip. Every time a citizen is persecuted, the Terrorists win. That is the point of terrorism. Destruction alone is not the object. Having us turn on each other is. A draconian law enforcement suits the political purposes by creating innocent martyrs. When they violate the laws they are paid to enforce and threaten the public safety they are sworn to protect, we lose our liberty and the TERRORISTS win. Dania Chaviano \\neverything happens for a reason… now he has a direct invite from the president of the united states to visit the white house and a message from Mark to visit facebook head quarters and now a nation behind him in support of his brilliant mind and talent… i know it still doesnt change the shitty stuff that happened due to peoples sheer ignorance and discrimination but the positive i think out ways the negative now! Dania Chaviano \\neverything happens for a reason… now he has a direct invite from the president of the united states to visit the white house and a message from Mark to visit facebook head quarters and now a nation behind him in support of his brilliant mind and talent… i know it still doesnt change the shitty stuff that happened due to peoples sheer ignorance and discrimination but the positive i think out ways the negative now! Miguel Angel Coria \\nIt’s not the kid’s fault or the cops, I believe it’s hollywood and the media creating a string of stereotypical “racism” in our minds, we see muslim we think terrorism, the cop only acted on basic instinct I believe it would be smart to start a project putting an end to stereotypes. There exists a possibility it might work. Just thinking away Miguel Angel Coria \\nI’m assuming your african american because i actually went into your page, took time to form an idea before I got offended, but just from your comments i’m realizing your just as ignorant as rednecks. People who realize they can’t win in an intellectual debate do they directly start offending their opponent, you might as well start wearing a Donald Trump shirt and watching duck dynasty. Because the problem is that Government separates people by race, religion, or beliefs. They way they can’t stand together against them. Try researching information before going and thinking your right about everything you say. I’m Douglas Brigham \\nCops fuck up its not the cops fault. \\nI guess it’s also not Dylan Roof fault that he killed 9 people. Because of the media. \\nSMH Beth Pucku \\nI’m Canadian and love all you. Obama is obviously trying to switch over the American people brain washing from hating Muslim to loving them cos Obama knows he’s killing all thses people over seas to get the oil to feed the industrial military war machine. \\nI’m reading an article, generating my own thought about it and creating an idea that might help solve the issue ? And what are you doing about it? Small minded people discuss other people. Average minded people discuss events, Critical thinkers discuss ideas. Aimee Hernandez \\nMiguel your initial comment is very basic n ambiguous. You appear to contradict yourself to say the least. What “idea” are you creating to solve the issue? Perhaps you should take a couple steps back, not just one, but a couple sir. I can construe an opinion based on the few comments you have posted. FYI you can’t be part of the solution when your basic mentality is part of the issue. With all due respect read some more….a lot more then pretend to have some sort of “intellictual” debate. Just saying … Miguel Angel Coria \\nI’ll leave it plain and simple so you and your friend can understand, I stated my opinion, and an idea (Not the exact blue print). I never stated any of those as a fact. I try and help by spreading thought process but it’s people like you and your friend who go around acting like overseers deciding what is wrong and what is right. I read, I watch, I think. I don’t offend people directly or insult people who try and improve and give opinion. So re-read the post and all it’s comments think about it for a second and just like in elementary school if you have nothing nice to say, don’t say anything. Go to your hompage and on will find a tab that say’s “what’s on your mind today” go ahead click and go crazy. Have a great day ma’am Miguel Angel Coria \\nIt’s not the kid’s fault or the cops, I believe it’s hollywood and the media creating a string of stereotypical “racism” in our minds, we see muslim we think terrorism, the cop only acted on basic instinct I believe it would be smart to start a project putting an end to stereotypes. There exists a possibility it might work. Just thinking away Miguel Angel Coria \\nI’m assuming your african american because i actually went into your page, took time to form an idea before I got offended, but just from your comments i’m realizing your just as ignorant as rednecks. People who realize they can’t win in an intellectual debate do they directly start offending their opponent, you might as well start wearing a Donald Trump shirt and watching duck dynasty. Because the problem is that Government separates people by race, religion, or beliefs. They way they can’t stand together against them. Try researching information before going and thinking your right about everything you say. I’m Douglas Brigham \\nCops fuck up its not the cops fault. \\nI guess it’s also not Dylan Roof fault that he killed 9 people. Because of the media. \\nSMH Beth Pucku \\nI’m Canadian and love all you. Obama is obviously trying to switch over the American people brain washing from hating Muslim to loving them cos Obama knows he’s killing all thses people over seas to get the oil to feed the industrial military war machine. \\nI’m reading an article, generating my own thought about it and creating an idea that might help solve the issue ? And what are you doing about it? Small minded people discuss other people. Average minded people discuss events, Critical thinkers discuss ideas. Aimee Hernandez \\nMiguel your initial comment is very basic n ambiguous. You appear to contradict yourself to say the least. What “idea” are you creating to solve the issue? Perhaps you should take a couple steps back, not just one, but a couple sir. I can construe an opinion based on the few comments you have posted. FYI you can’t be part of the solution when your basic mentality is part of the issue. With all due respect read some more….a lot more then pretend to have some sort of “intellictual” debate. Just saying … Miguel Angel Coria \\nI’ll leave it plain and simple so you and your friend can understand, I stated my opinion, and an idea (Not the exact blue print). I never stated any of those as a fact. I try and help by spreading thought process but it’s people like you and your friend who go around acting like overseers deciding what is wrong and what is right. I read, I watch, I think. I don’t offend people directly or insult people who try and improve and give opinion. So re-read the post and all it’s comments think about it for a second and just like in elementary school if you have nothing nice to say, don’t say anything. Go to your hompage and on will find a tab that say’s “what’s on your mind today” go ahead click and go crazy. Have a great day ma’am \\nYea and my penis looks like it can make it in the Porn Industry! Lmao Police IQ at an all time LOW! \\nYea and my penis looks like it can make it in the Porn Industry! Lmao Police IQ at an all time LOW! Keith Buck \\nOf course not. How could I? I only spent 18 years in the public school system. I completed an apprenticeship and proceeded to teach up to five people at a time during the work week. As for police. Again how could I? I’ve only spent 31 years being surrounded by them and having them in my family. Lady, before you accuse someone of not knowing what they’re talking about. Make sure that you actually do. Keith Buck \\nOf course not. How could I? I only spent 18 years in the public school system. I completed an apprenticeship and proceeded to teach up to five people at a time during the work week. As for police. Again how could I? I’ve only spent 31 years being surrounded by them and having them in my family. Lady, before you accuse someone of not knowing what they’re talking about. Make sure that you actually do. \\n“Looks like a movie bomb to me.” \\nHe should stop watching movies and start actually do his job properly… \\nHollywood obviously messed up his rational thinking… \\n“Looks like a movie bomb to me.” \\nHe should stop watching movies and start actually do his job properly… \\nHollywood obviously messed up his rational thinking… \\nI DO NOT agree with arresting him, taking him to juvi., etc \\nBut SERIOUSLY…..he had to know how that looks to people. \\nI DO NOT agree with arresting him, taking him to juvi., etc \\nBut SERIOUSLY…..he had to know how that looks to people. Louis Edward Francis Mills \\nGet’s to the station and after 1 day it’s like: “Hey seargeant, you were meant to take your medicine”. “Thanks Ahmed”. “Hey inspector, 7.30, time to call your wife.”“Hey, you’re right Ahmed, thanks buddy.”“Excuse me chief, didn’t that squad say they would be back at 9.15? It’s 9.17 exactly, sir.”“Right you are Ahmed”. IT’S OBVIOUS THEY SIMPLY WANTED A WORKING CLOCK AND SOMEONE WHO KNEW HOW TO READ IT! Louis Edward Francis Mills \\nGet’s to the station and after 1 day it’s like: “Hey seargeant, you were meant to take your medicine”. “Thanks Ahmed”. “Hey inspector, 7.30, time to call your wife.”“Hey, you’re right Ahmed, thanks buddy.”“Excuse me chief, didn’t that squad say they would be back at 9.15? It’s 9.17 exactly, sir.”“Right you are Ahmed”. IT’S OBVIOUS THEY SIMPLY WANTED A WORKING CLOCK AND SOMEONE WHO KNEW HOW TO READ IT! \\n…so a high school asked me to come in and do a presentation on what I do. I was going to bring in a bunch of circuit boards… \\nGuess I better rethink that? oh wait! My name is not Mohammed… I should be good. \\n…so a high school asked me to come in and do a presentation on what I do. I was going to bring in a bunch of circuit boards… \\nGuess I better rethink that? oh wait! My name is not Mohammed… I should be good. \\nOUTRAGEOUS! IT IS TIME EVERYONE IS HELD ACCOUNTABLE ABOLISH QUALIFIED IMMUNITY FOR COPS ! ** Arrest, charge, indict and convict cops for the crimes they commit under the color of law! CHARGE THEIR COMMANDERS AS ACCESSORIES TO THE CRIMES that their subordinates commit and police will STOP victimizing the public.*** NO MORE SPECIAL GRAND JURIES FOR COPS!**** HOLD JUDGES ACCOUNTABLE for light sentencing handed down to criminal cops.*** CHARGE JUDGES AND DISTRICT ATTORNEYS WITH OBSTRUCTION OF JUSTICE when they refuse to prosecute cops for criminal misconduct. Police who SHOOT PETS should be held accountable and charged with animal abuse! THEY SHOULD GET MANDATORY JAIL TIME FOR KILLING PETS! \\nOUTRAGEOUS! IT IS TIME EVERYONE IS HELD ACCOUNTABLE ABOLISH QUALIFIED IMMUNITY FOR COPS ! ** Arrest, charge, indict and convict cops for the crimes they commit under the color of law! CHARGE THEIR COMMANDERS AS ACCESSORIES TO THE CRIMES that their subordinates commit and police will STOP victimizing the public.*** NO MORE SPECIAL GRAND JURIES FOR COPS!**** HOLD JUDGES ACCOUNTABLE for light sentencing handed down to criminal cops.*** CHARGE JUDGES AND DISTRICT ATTORNEYS WITH OBSTRUCTION OF JUSTICE when they refuse to prosecute cops for criminal misconduct. Police who SHOOT PETS should be held accountable and charged with animal abuse! THEY SHOULD GET MANDATORY JAIL TIME FOR KILLING PETS! Edward Johnson \\nBack when I was growing up science fair and art fair projects were encouraged. In high school I had students left and right along with some teachers ask me to fix their Walkman or boombox radio. It was a big boost to my self esteem in the work force.More came with experience. The teachers who had this boy arrested or in no way teachers anymore after the trauma they put him through. Edward Johnson \\nBack when I was growing up science fair and art fair projects were encouraged. In high school I had students left and right along with some teachers ask me to fix their Walkman or boombox radio. It was a big boost to my self esteem in the work force.More came with experience. The teachers who had this boy arrested or in no way teachers anymore after the trauma they put him through. \\nIt’s not rocket science. Denounce Islam. The Shoe Bomber was a Muslim The Beltway Snipers were Muslims The Fort Hood Shooter was a Muslim The underwear Bomber was a Muslim The U-S.S. Cole Bombers were Muslims The Madrid Train Bombers were Muslims The Bafi Nightclub Bombers were Muslims The London Subway Bombers were Muslims The Moscow Theatre Attackers were Muslims The Boston Marathon Bombers were Muslims The Pan-Am flight #93 Bombers were Muslims The Air France Entebbe Hijackers were Muslims The Iranian Embassy Takeover, was by Muslims The Beirut U.S. Embassy bombers were Muslims The Libyan U.S. Embassy Attack was by Musiims The Buenos Aires Suicide Bombers were Muslims The Israeli Olympic Team Attackers were Muslims The Kenyan U.S, Embassy Bombers were Muslims The Saudi, Khobar Towers Bombers were Muslims The Beirut Marine Barracks bombers were Muslims The Besian Russian School Attackers were Muslims The first World Trade Center Bombers were Muslims The Bombay & Mumbai India Attackers were Muslims The Achille Lauro Cruise Ship Hijackers were Muslims The September 11th 2001 Airline Hijackers were Muslims’ \\nThink of it: \\nBuddhists living with Hindus = No Problem Hindus living with Christians = No Problem Hindus living with Jews = No Problem Christians living with Shintos = No Problem Shintos living with Confucians = No Problem Confusians living with Baha’is = No Problem Baha’is living with Jews = No Problem Jews living with Atheists = No Problem Atheists living with Buddhists = No Problem Buddhists living with Sikhs = No Problem Sikhs living with Hindus = No Problem Hindus living with Baha’is = No Problem Baha’is living with Christians = No Problem Christians living with Jews = No Problem Jews living with Buddhists = No Problem Buddhists living with Shintos = No Problem Shintos living with Atheists = No Problem Atheists living with Confucians = No Problem Confusians living with Hindus = No Problem \\nMuslims living with Hindus = Problem Muslims living with Buddhists = Problem Muslims living with Christians = Problem Muslims living with Jews = Problem Muslims living with Sikhs = Problem Muslims living with Baha’is = Problem Muslims living with Shintos = Problem Muslims living with Atheists = Problem MUSLIMS LIVING WITH MUSLIMS = BIG PROBLEM \\nSO THIS LEAD TO They’re not happy in Gaza They’re not happy in Egypt They’re not happy in Libya They’re not happy in Morocco They’re not happy in Iran They’re not happy in Iraq They’re not happy in Yemen They’re not happy in Afghanistan They’re not happy in Pakistan They’re not happy in Syria They’re not happy in Lebanon They’re not happy in Nigeria They’re not happy in Kenya They’re not happy in Sudan \\nSo, where are they happy? They’re happy in Australia They’re happy in England They’re happy in Belgium They’re happy in France They’re happy in Italy They’re happy in Germany They’re happy in Sweden They’re happy in the USA & Canada They’re happy in Norway & India They’re happy in almost every country that is not Islamic! And who do they blame? Not Islam… Not their leadership… Not themselves… THEY BLAME THE COUNTRIES THEY ARE HAPPY IN!! And they want to change the countries they’re happy in, to be like the countries they came from where they were unhappy and finally they will be get hammered !!!! \\nIslamic Jihad: AN ISLAMIC TERROR ORGANIZATION ISIS: AN ISLAMIC TERROR ORGANIZATION Al-Qaeda: AN ISLAMIC TERROR ORGANIZATION Taliban: AN ISLAMIC TERROR ORGANIZATION Hamas: AN ISLAMIC TERROR ORGANIZATION Hezbollah: AN ISLAMIC TERROR ORGANIZATION Boko Haram: AN ISLAMIC TERROR ORGANIZATION Al-Nusra: AN ISLAMIC TERROR ORGANIZATION Abu Sayyaf: AN ISLAMIC TERROR ORGANIZATION Al-Badr: AN ISLAMIC TERROR ORGANIZATION Muslim Brotherhood: AN ISLAMIC TERROR ORGANIZATION Lashkar-e-Taiba: AN ISLAMIC TERROR ORGANIZATION Palestine Liberation Front: AN ISLAMIC TERROR ORGANIZATION Ansaru: AN ISLAMIC TERROR ORGANIZATION Jemaah Islamiyah: AN ISLAMIC TERROR ORGANIZATION Abdullah Azzam Brigades: AN ISLAMIC TERROR ORGANIZATION AND A LOT MORE \\nIt’s not rocket science. Denounce Islam. The Shoe Bomber was a Muslim The Beltway Snipers were Muslims The Fort Hood Shooter was a Muslim The underwear Bomber was a Muslim The U-S.S. Cole Bombers were Muslims The Madrid Train Bombers were Muslims The Bafi Nightclub Bombers were Muslims The London Subway Bombers were Muslims The Moscow Theatre Attackers were Muslims The Boston Marathon Bombers were Muslims The Pan-Am flight #93 Bombers were Muslims The Air France Entebbe Hijackers were Muslims The Iranian Embassy Takeover, was by Muslims The Beirut U.S. Embassy bombers were Muslims The Libyan U.S. Embassy Attack was by Musiims The Buenos Aires Suicide Bombers were Muslims The Israeli Olympic Team Attackers were Muslims The Kenyan U.S, Embassy Bombers were Muslims The Saudi, Khobar Towers Bombers were Muslims The Beirut Marine Barracks bombers were Muslims The Besian Russian School Attackers were Muslims The first World Trade Center Bombers were Muslims The Bombay & Mumbai India Attackers were Muslims The Achille Lauro Cruise Ship Hijackers were Muslims The September 11th 2001 Airline Hijackers were Muslims’ \\nThink of it: \\nBuddhists living with Hindus = No Problem Hindus living with Christians = No Problem Hindus living with Jews = No Problem Christians living with Shintos = No Problem Shintos living with Confucians = No Problem Confusians living with Baha’is = No Problem Baha’is living with Jews = No Problem Jews living with Atheists = No Problem Atheists living with Buddhists = No Problem Buddhists living with Sikhs = No Problem Sikhs living with Hindus = No Problem Hindus living with Baha’is = No Problem Baha’is living with Christians = No Problem Christians living with Jews = No Problem Jews living with Buddhists = No Problem Buddhists living with Shintos = No Problem Shintos living with Atheists = No Problem Atheists living with Confucians = No Problem Confusians living with Hindus = No Problem \\nMuslims living with Hindus = Problem Muslims living with Buddhists = Problem Muslims living with Christians = Problem Muslims living with Jews = Problem Muslims living with Sikhs = Problem Muslims living with Baha’is = Problem Muslims living with Shintos = Problem Muslims living with Atheists = Problem MUSLIMS LIVING WITH MUSLIMS = BIG PROBLEM \\nSO THIS LEAD TO They’re not happy in Gaza They’re not happy in Egypt They’re not happy in Libya They’re not happy in Morocco They’re not happy in Iran They’re not happy in Iraq They’re not happy in Yemen They’re not happy in Afghanistan They’re not happy in Pakistan They’re not happy in Syria They’re not happy in Lebanon They’re not happy in Nigeria They’re not happy in Kenya They’re not happy in Sudan \\nSo, where are they happy?\""}, "time": 1742562970.4642143}