{"duration": 0.033304691314697266, "input_args": {"text": "\"Email \\nIf there’s one thing that the rise of Donald Trump and Britain’s Brexit has proven, it’s that the people have had it with the establishment. No matter what side of the aisle you’re on, you are likely sick and tired of the outright corruption prevalent in every aspect of the system. \\nOver the last decade we have seen several movements try to take the initiative to create real, lasting change by upending the business-as-usual behavior of entrenched politicians, corporate lobbyists and mainstream media. All have thus far failed and were eventually absorbed by the power structure. \\nThe Tea Party was co-opted by the establishment right. The 99% Protesters were co-opted by the establishment left. And according to recent Wikileaks releases, the Black Lives Matter movement has been sucked up by the Clinton camp and Soros-funded globalists. \\nJoe Joseph of The Daily Sheeple explains how politicians, including Hillary Clinton, have used these grass roots movements for their own nefarious purposes and to push forth their own agendas: \\nIf you remember back in 2006-2007 there was something called the Ron Paul Revolution that took off… at one point in time there was a million man march that took place and there was close to a million people that marched on Washington… it was a tremendous grass roots effort and uprising that took place… and after that you had the Tea Party take off… and then it got co-opted. The-Powers-That-Shouldn’t-Be put their operatives in there.. they got in there and totally took it over… and now the Tea Party today is nothing but your mainstream Republican operation that advances the Republican Party platform… certainly not what Ron Paul was doing… certainly doesn’t have the Constitution in mind… \\nArticle reposted with permission from SHTF Plan Don't forget to Like Freedom Outpost on Facebook , Google Plus , & Twitter . You can also get Freedom Outpost delivered to your Amazon Kindle device here .\""}, "time": 1742564283.4342506}