{"duration": 0.10342621803283691, "input_args": {"text": "'Putin Foes Caught in Malicious Fabrications about Kremlin Insider Lesin\\'s Death \\nCoroner\\'s final decision reveals all. Print \\nA US Senator and a Russian opposition figure are among those who have tripped themselves up with their fabrications about Mikhail Lesin\\'s 2015 death. Lesin was a former Russian media advertising tycoon, state media minister, and later head of the Gazprom-Media holding company. He died in Washington DC amid circumstances that went unexplained fully until October 28 of this year.What did Putin\\'s foes first have to say about Lesin\\'s death?Russian opposition figure and Putin foe Alexei Nevalny had a lot to say. On March 13, 2016 the Independent ran the headline: \"Mikhail Lesin death: Vladimir Putin\\'s propaganda chief reportedly flew out of LA 40 days after his death. The story claims Alexei Navalny, a Putin opposition leader, said the incident \\'smells of a witness protection programme.\\'\" The Daily Mail reported that that Navalny claimed to have proof.Was Lesin\\'s reported demise just a coverup?But a month later, Navalny seemed to have backed away from that allegation. According to the Voice of America \"Navalny said he had no \\'proof\\' or definitive evidence, but indicated that Lesin may have died because, \\'as they say in detective stories, he knew too much.\\'\"So Navalny had come to believe that Lesin was indeed dead after all. But now Navalny intimated that perhaps Putin was to blame.While making a case to VOA that Putin is corrupt, Navalny said he was convinced \"that Lesin knew a lot. Not just about corruption in the highest echelons of power, but [he] was one of the organizers of a corruption scheme in which Putin himself was personally complicit. And against the backdrop of his death, against the backdrop of the strange things that were happening around him, it\\'s a more than reasonable assumption that, in any contacts he may have had with the federal authorities in the United States, Lesin may have been asked about it.\"Other theories in the news claimed:--Lesin\\'s death was connected with his alleged role as a CIA informer.--His demise was related to a secret romantic tryst gone wrong.--Lesin\\'s body was cremated to destroy evidence of what really happened.Many of the news reports mentioned Mississippi Senator Roger Wicker who considered Lesin to be a very suspicious character. He very well may have been. Once while having lunch with Ivan Laptev, Lesin\\'s ministerial predecessor, I joked about when I saw Lesin at a New York meeting in the early 2000s. I first mistook him for some kind of Russian mafia guy, just based on how he was dressed and the gorgeous gun-moll looking young lady that accompanied him.In July 2014 Wicker seemed to have more serious concerns. He was moved to tip off the US Attorney General. It wasn\\'t based on Lesin\\'s appearance. Wicker had become aware that Lesin owned expensive residential property in California. He believed that meant something sinister was afoot. Wicker said about Lesin, \"He acquired multiple residences at a cost of over $28 million.\"\"That a Russian public servant could have amassed the considerable funds required to acquire and maintain these assets in ... the United States raises serious questions,\" Wicker told ABC News.Wicker wasn\\'t fond of Putin either. In March 2014 he had written an article for the Washington Examiner titled, \"Hillary Clinton was right about Vladimir Putin and Adolf Hitler the first time.\" Clinton has been quoted many times likening Putin to Hitler.Wicker was and is a member of the Senate Armed Forces Committee. I find it very disturbing that a member of that influential committee could be espousing ideas so distant from reality as these. A simple google search could have told him that Lesin was no simple government service worker pulling down a measly salary. Lesin\\'s Video International business had a near-monopoly grip on the media advertising business in Russia years ago. In fact when he was Putin\\'s media minister, many critics mused that he was the \"minister\" of his own business sector.Was Wicker\\'s research so lame that he knew nothing of Lesin other than his role in the Russian bureaucracy? Was he that stupid? Or is there something sinister about Wicker\\'s interest in Lesin? I don\\'t know whether there is or isn\\'t. But the incongruity of his factless demonization of Putin, and his seemingly malicious letter to the Attorney General about Lesin, throw up a red flag. Maybe the Attorney General should look into Wicker\\'s business dealings to see if something fishy is going on there.So what\\'s the truth about Lesin\\'s death?The final coroner\\'s verdict is that he was dead drunk in his hotel room, fell multiple times, injuring his lower and upper torso, and inflicted a fatal blow to his head.I don\\'t know whether that is the honest truth or not. But if we are to believe people like Navalny and Wicker it would seem that the Washington coroner is in the bag for Putin. Wow, what an accusation.'"}, "time": 1742563573.3854854}