{"duration": 0.04554128646850586, "input_args": {"text": "'Donald J. Trump said on Thursday that the pastor who interrupted his remarks at an   church in Flint, Mich. was “a nervous mess” when she introduced him and that he thought “something was up” with her. During his visit to Bethel United Methodist Church on Wednesday, Mr. Trump, the Republican presidential nominee, started to assail his Democratic opponent, Hillary Clinton, for being a failure. As he spoke, the Rev. Faith Green Timmons came over to him and said, “Mr. Trump, I invited you here to thank us,” and added, “not make a political speech. ” Mr. Trump addressed the awkward exchange in an interview on Fox News on Thursday, suggesting that Pastor Timmons had a political agenda. “Everyone plays their games, it doesn’t bother me,” Mr. Trump said, claiming Pastor Timmons was shaking when she came up to him. He added: “She was so nervous, she was like a nervous mess. I figured something was up. ” Some conservatives defended Mr. Trump on Thursday, pointing to a Facebook post in which she wrote that the visit was an opportunity to educate Republican candidate as evidence that she was planning to embarrass him. While that post does not appear on her Facebook page, Pastor Timmons did address the controversy there on Wednesday night. “Had he stuck to what his camp claimed he came to do, we would not have had a problem!” she wrote. Mr. Trump has shown more discipline on the campaign trail in recent weeks, but his criticism of the pastor demonstrated that he is still willing to push back against perceived slights. Mr. Trump also allowed himself to belittle Mrs. Clinton’s recent illness at a rally on Wednesday night, suggesting that she could not stand for such an event and that she was probably “lying in bed. ” After the interruption at the church, Mr. Trump went on to discuss the economic situation in Flint. He said on Thursday that most of the people who attended the event at the church welcomed him warmly. “The audience was saying ‘let him speak, let him speak,’ ” Mr. Trump said. “The audience was so great. ” But a pool reporter who was traveling Mr. Trump disputed his account, describing a scene where several members of the audience actually heckled Mr. Trump and questioned him about reports that he had discriminated against black people as a landlord. According to the pool report, Pastor Timmons defended Mr. Trump and told the crowd that he was “a guest of my church and you will defend him. ” Mrs. Clinton, in North Carolina on Thursday, lamented Mr. Trump’s attack on Pastor Timmons, saying it was unwarranted. “He called her a nervous mess,” Mrs. Clinton said at a news conference. “That’s not only insulting, it’s dead wrong. ” She added: “She’s a rock for her community in trying times. She deserves better, and Flint deserves better  —   in fact, so does America. ”'"}, "time": 1742561895.3246222}