{"duration": 0.8016335964202881, "input_args": {"text": "'On Monday, Jan. 9, less than two weeks before President Trump’s inauguration, the House speaker, Paul Ryan, hosted a dinner at his office in the Capitol with members of Trump’s inner circle. The guests included the  ’s chief White House strategist, Stephen K. Bannon his    and family consigliere, Jared Kushner his chief of staff, Reince Priebus his economic adviser, Gary Cohn his nominee for Treasury secretary, Steven Mnuchin his incoming deputy chief of staff, Rick Dearborn and his   director, Marc Short. The ostensible purpose of the dinner was to discuss the details of Trump’s legislative agenda  —   in particular, the prospects for a sweeping   measure that Republicans, and especially Ryan, have been coveting for the past decade. It was hoped that the dinner could also establish some sort of common ground between Ryan and Bannon, the two figures who would arguably wield the greatest influence over how Trump’s campaign promises became law  —   or didn’t. Ryan was a fixture among establishment Republicans even before joining Mitt Romney’s presidential ticket in 2012, his previous labors on the House Budget Committee cementing his reputation as the    wizard of fiscal conservatism. Bannon, by contrast, was a renegade autodidact who read Plato and had seemingly materialized from nowhere to become the intellectual architect of Trump’s campaign and, later, administration. Up to this point, Ryan had epitomized to Bannon everything that was wrong with the Republican Party. Discussing the two parties’ shortcomings, Bannon later told me, “What’s that Dostoyevsky line: Happy families are all the same, but unhappy families are unhappy in their own unique ways?” (He meant Tolstoy.) “I think the Democrats are fundamentally afflicted with the inability to discuss and have an adult conversation about economics and jobs, because they’re too consumed by identity politics. And then the Republicans, it’s all this theoretical Cato Institute, Austrian economics, limited government  —   which just doesn’t have any depth to it. They’re not living in the real world. ” Breitbart News, the   media outlet Bannon ran before becoming the chief executive of the Trump campaign in August, had described Ryan, referring to his position on immigration, as “arguably the most   G. O. P. lawmaker in Congress”  —   an apostasy of nearly impeachable proportions from Bannon’s perspective. Worst of all, Ryan all but abandoned Trump during the 2016 campaign. After the leak in October of the damaging “Access Hollywood” tape, Ryan told fellow Republican House members on a conference call, “I am not going to defend Donald Trump  —   not now, not in the future. ” A Republican lawmaker on the call told Trump what Ryan had said, yet another reason for Bannon to regard himself as Ryan’s worst enemy. But as the dinner progressed, it became clear that Bannon and Ryan actually had some ideas in common. Over memorably bad chicken Parmesan, Ryan described his vision for a “  tax,” which would levy taxes on imports while offering exemptions for exports. His tax package would include “immediate expensing,” he explained, in which capital expenditures would be written off against profits in the first year rather than over time. It also would abolish the alternative minimum tax and the estate tax. These were ideas Ryan had been pushing since 2008. Now they had Bannon’s attention. Taken together with a drastic reduction in corporate taxes, Bannon believed, Ryan’s scheme would spur a renaissance of a   export economy, producing   labor in keeping with Trump’s populism. “I would actually say,” Bannon remembers observing admiringly, “that this tax reform comes as close to a first step of economic nationalism as there is. ” “I would call it ‘responsible nationalism,’’u2009” Ryan said, according to Bannon. Bannon laughed. “You’re going to have a lot of folks in the Senate say this is breathtakingly radical. ” He meant it as a compliment. To Bannon, the entire world order  —   from the two political parties to the Wall Street reliance on leveraging to multiculturalism  —   was undergoing an extraordinary realignment, one made manifest in the 2016 election. According to Bannon’s vision, economic nationalism would reorient priorities to the working class’s benefit. Trade deals, jobs programs, tax incentives, immigration restrictions, environmental deregulation and even foreign policy would ultimately serve to restore the primacy of those Trump called “the forgotten Americans. ” In March, when I spoke to Trump by phone, I asked him what the term “economic nationalism” meant to him. Compared with Bannon’s revolutionary fervor, his reply was surprisingly cautious. “Well, ‘nationalism’  —   I define it as people who love the country and want it to do good,” he said. “I don’t see ‘nationalism’ as a bad word. I see it as a very positive word. It doesn’t mean we won’t trade with other countries. ” Trump’s tone was genial but also a touch defensive. His postelection honeymoon had been short, if it existed at all. There were the administrative intrigues and   Twitter drama, along with the questions about his campaign’s contacts with Russia, which had already forced the resignation of his national security adviser, Michael Flynn. Still, Trump’s legislative liaisons and their counterparts on Capitol Hill were doggedly negotiating a rollout of the Trump Era, one that would fulfill his most significant campaign promises  —   those that could not be done with just a stroke of Trump’s own pen but required acts of Congress. First, Obamacare would be repealed and replaced. Next, an austere budget would be passed, with emergency funds allotted for the construction of a wall along the Southern border. Then would come a   plan, presumably of the type Ryan and Bannon discussed. And finally, a bipartisan coalition would deliver a   infrastructure plan to Trump’s desk. If all this came to pass by the end of 2017, it would lend some credence to Trump’s pledge that this would be “the busiest Congress we’ve had in decades. ” But by March, this timetable was looking like a formidable “if. ” Trump himself seemed prone to distraction as he spoke to me from the Oval Office. Though I was asking about his policy aims, his musings swerved off to other vexations. More than once he denounced as “fake news” reports about his administration’s supposed disharmony. He brought up his speech before the joint session of Congress in February, “which I hope you liked, but I certainly have gotten great reviews  —   even the people who hate me gave me the highest review. ” During the call, I could hear Priebus nearby, occasionally murmuring encouragement. Trump sounded more clipped and less jaunty on the call than he did during the discursive chats I had with him last year on the campaign trail. The business of governing had little to do with any trade he had previously practiced. In Congress, he was grappling with an arcane and famously inefficient ecosystem over which he had little if any control  —   and people he incessantly derided on the campaign trail as being “all talk and no action. ” I asked him if he still felt that way. “It’s like any other industry,” he replied, somewhat morosely. “I’ve met some great politicians and some, to be honest, who aren’t so hot. ” Trump wanted to make sure that he was given adequate credit for his achievements, even in his administration’s infancy. “We’ve only been here for a tiny speck of time,” he said, “and what I’ve done with regulations, moving jobs back into the country, what I’ve done with airplane pricing and buying is amazing. We’ve done a lot. I think we’ve done more than anybody for this short period of time. ” Abraham Lincoln, Franklin Roosevelt and Lyndon Johnson would take exception to this claim. And Trump’s significant actions to date have consisted entirely of executive orders. What he has not yet demonstrated is his ability to actually shepherd a bill into law. The only major legislation that congressional committees have even seen thus far is a bill to repeal and replace Obamacare, which met with a stunning rebuke from Trump’s own party, forcing Ryan to withdraw the measure on the afternoon of March 24. At this stage of his presidency, Barack Obama had already signed into law his $787 billion   package and had moved on to holding White House meetings on health care. It’s conceivable that Trump could hit Day 100 with only minor symbolic legislative achievements to his name. For him to avoid this ignominy, the 45th president will have to develop a rapport with Washington’s 535 federal deal makers, including the ones who “aren’t so hot. ” Whether Trump’s agenda succeeds will also depend in no small measure on the ability of Bannon to expand his game beyond 1600 Pennsylvania Ave. At 63, and with a fortune reported to be in the tens of millions of dollars  —   partly through his investment in the company that owns the syndication rights to “Seinfeld”  —   Bannon is regarded by Trump as a peer in the way that, say, the    lifelong politico Priebus is not. He is also approvingly seen as a fellow workaholic by the president (whose only known hobbies are golf and   CNN). And he is a deft operator who has learned from the successes and failures of other Trump advisers. He has carefully not claimed credit that the president would wish for himself and avoids giving expansive interviews on his own controversial views that might detract from his boss’s celebrity. Like the former campaign manager Corey Lewandowski, Bannon understands that power in Trump World derives mainly from close and sustained physical proximity to the boss. Unlike Lewandowski, Bannon immediately grasped the importance of maintaining close relations with Jared Kushner, who factored heavily in Lewandowski’s dismissal from the Trump campaign last summer. But like Kushner, Bannon has never worked in government or at a   institute and has no meaningful experience when it comes to getting legislation passed. On the Hill, he has a few random associations  —   Senator Rand Paul of Kentucky and Representative John Culberson of Texas among them. Otherwise, he remains a looming but indistinct presence to the lawmakers who will be needed to pass most of Trump’s agenda. Bannon’s interest in this agenda predated his association with Trump. One evening in January 2013, two guests showed up for dinner at the Capitol Hill townhouse that Bannon liked to call the Breitbart Embassy. One was the man Bannon would later describe to me as his “mentor”: Senator Jeff Sessions of Alabama. The other was Sessions’s top aide and protégé, a jittery    named Stephen Miller. Two months earlier, Obama decisively defeated Mitt Romney in the presidential election, prompting Priebus, then the chairman of the Republican National Committee, to commission an analysis of the state of the party and its future, known colloquially in Washington as the “autopsy,” which would be delivered that spring. The only certainty was that the report would urge Republicans to court the growing Latino electorate  —   which had voted for Obama by a   margin that November  —   by championing comprehensive immigration reform. The three men at the dinner table that night were among the few Republicans in town who thoroughly rejected that conclusion. Bannon wanted to talk to Sessions and Miller about a different report: an article written by Sean Trende, the senior elections analyst for the website RealClearPolitics, titled “The Case of the Missing White Voters. ” Trende observed that Obama’s victory was less a function of increased minority turnout than of the fact that 6. 6 million white voters who participated in the 2008 election stayed home in 2012. The reason for this drop, Trende argued, was that white   voters who did not approve of Obama but were alienated by Romney’s perceived elitism had not voted. These votes were gettable, Bannon believed. As he would later tell me: “The working class, and in particular the lower middle class, understands something that’s so obvious  —   which is that they’ve basically underwritten the rise of China. Their jobs, their raises, their retirement accounts have all fueled the private equity and venture capital that built China. Because China’s really built on investments and exports, right? People are smart enough to know that they’re getting played by both political parties. The two may be different on social issues, but when it comes to fundamental economics, they’re both the same. That’s why the American working class is interested in trade. It’s linked to their lives. ” Sessions shared Bannon’s belief that the Republican Party needed to emphasize immigration reduction, border security and the preservation of   jobs through trade policy rather than courting Latino voters with a bill he regarded as “amnesty. ” As Sessions would write in a memorandum to his Republican colleagues six months later, “This humble and honest populism  —   in contrast to the administration’s cheap demagoguery  —   would open the ears of millions who have turned away from our party. ” At some point during the   dinner, Bannon recalls blurting out to Sessions, “We have to run you for president. ” Just two years earlier, in 2011, he made a similar pitch to Sarah Palin, after completing a documentary about her called “The Undefeated. ” Palin demurred. She was enjoying her life of celebrity and wealth, she had done little to immerse herself in policy minutiae and she was no doubt unsettled by Bannon’s warning that she stood little chance of defeating Obama. Now he delivered a similar message to Sessions. “Look, you’re not going to win,” he recalls saying. “But you can get the Republican nomination. And once you control the apparatus, you can make fundamental changes. Trade is No. 100 on the party’s list. You can make it No. 1. Immigration is No. 10. We can make it No. 2. ” Acknowledging that the drawling Alabama senator lacked Palin’s charisma, Bannon said, “You’ll be the  . ” But Sessions told Bannon he did not see himself running for president. “It was pretty obvious by the end of the night,” Bannon recalled, “that another candidate would have to do it. ” Two months later, on March 15, 2013, Bannon happened to be attending the Conservative Political Action Conference in Washington when Trump took the stage. Trump had been a marginal figure at most in politics up to that point, entertaining a Reform Party run in the 2000 election  —   when he speculated that he would probably take more votes from the Democratic candidate than the Republican one  —   and leading a conspiratorial crusade in 2011 to force Obama to release his birth certificate. The possibility that he might be a suitable host body for Bannon’s worldview had not occurred to Bannon before Trump spoke. But Trump’s grousing references to China’s economic superiority, to 11 million “illegals” and to the erosion of America’s manufacturing sector were right out of Bannon’s playbook. From his desk in the Russell Senate Office Building, Stephen Miller, too, watched Trump’s speech. By 2014, Miller was sending emails to friends expressing the hope that Trump would run for president. By the time Trump announced his candidacy, in June 2015, Sessions was officially uncommitted but privately of the view that Trump was best suited to tap into the movement that he, Miller and Bannon discussed over dinner more than two years earlier. Bannon’s early support for Trump was manifest in Breitbart’s breathless coverage of his candidacy. In an email he sent on Aug. 30, 2015, to his former filmmaking partner Julia Jones, Bannon explained that while Republican candidates like Ted Cruz, Bobby Jindal, Ben Carson and Carly Fiorina were “all great,” Trump represented a superior choice, because he “is a nationalist who embraces Senator Sessions’s plan” on immigration. Still, recalls Sam Nunberg, Trump’s first campaign strategist, “Steve kept all of his cards. ” He added: “He was respectful to some of the other ones who were running, like Walker and Cruz and Carson. He didn’t want to be seen as  . ” When Trump publicly disparaged John McCain’s   credentials, Bannon  —   himself a Navy veteran  —   called Nunberg and demanded that Trump issue an apology. (Trump did not.) Bannon was well positioned as a supportive but not sycophantic observer by Aug. 13, 2016, when the Trump donor Rebekah Mercer read with alarm a New York Times account of the Trump campaign’s inability to handle its mercurial candidate. At Mercer’s behest, Bannon (whose website Mercer’s family helped underwrite) and Kellyanne Conway (who at that point was receiving money from both a Mercer family political action committee and the Trump campaign) flew out that day to East Hampton, N. Y. where Trump was attending a dinner   at the home of the New York Jets’ owner, Woody Johnson. After the dinner, Bannon and Conway huddled with the candidate. Bannon remembers telling Trump, who at the time was trailing Hillary Clinton by double digits in the polls, “As long as you stick to the message”  —   by which he meant economic nationalism  —   “you have a 100 percent probability of winning. ” A week after the election, in an interview with the journalist Michael Wolff, Bannon offered a bold, sweeping sketch of what the vision might mean in policy terms: “Like [Andrew] Jackson’s populism, we’re going to build an entirely new political movement. It’s everything related to jobs. The conservatives are going to go crazy. ” Of course, some of the conservatives Bannon intended to drive crazy possessed the congressional votes Bannon and Trump would need to advance this agenda. Representative Jim Jordan of Ohio, a leading conservative in the House, told me in March, “I would argue that populism, as long as it’s rooted in conservative principle, is a darn good thing. ” Jordan was smiling as he said it, but the note of warning was hard to mistake. The last time the Republican Party controlled all branches of government in Washington was from 2003 to 2007. During that period, the United States military toppled Saddam Hussein, Congress delivered tax cuts for the wealthy and President George W. Bush appointed the reliably conservative jurist Samuel A. Alito Jr. to the Supreme Court. But in the collective view of conservatives, these years of the Bush presidency were mostly characterized by betrayal and disappointment. Goaded by Bush, congressional Republicans passed into law a new federal entitlement (prescription drugs for senior citizens, also known as Medicare Part D) ran up the deficit, promoted democratic ideals overseas in the feckless manner of Woodrow Wilson, considered a pathway to citizenship for undocumented immigrants and confirmed a Supreme Court chief justice, John G. Roberts Jr. whose swing vote would later save Obamacare from judicial evisceration. “My   line when I first ran in 2008 was, ‘Republicans had the House, the Senate and the White House  —   and they blew it,’’u2009” Representative Jason Chaffetz of Utah, the chairman of the House Oversight and Government Reform Committee, told me. “Now we’ve got all three again, and I’m the guy who’s in Congress, not running for it. I don’t want to be in a position where we’re going to blow it one more time. ” Chaffetz and other House conservatives freely acknowledge that Trump is not cut from their cloth, but they say they could not care less as long as he gives them what they want. Selecting Judge Neil Gorsuch to fill the Supreme Court seat once held by Justice Antonin Scalia was “the best thing the president did in his first 50 days,” Chaffetz told me. He and his conservative colleagues have been cheered by Trump’s recruitment of former House colleagues and conservative stalwarts like Vice President Mike Pence Tom Price, the health and human services secretary and Mick Mulvaney, the Office of Management and Budget director. When Chaffetz and I spoke in March, he had met with the president twice so far  —   access he considered “such a huge sea change” from the stony silence Republicans say they encountered from the Obama White House. Most important, the Trump agenda’s first three projected legislative moves  —   the Obamacare repeal and replacement, an austere budget and tax reform  —   were intended to keep conservatives happily in Trump’s camp. In turn, when the agenda moved on to less conservative items like infrastructure and trade agreements, Trump and Bannon would fully expect Republicans, including Ryan, to remember whose message resonated most with   voters last year. Representative Kevin McCarthy, the House majority leader, is Trump’s chief point of contact on the Hill. When McCarthy was a college student and budding entrepreneur in Bakersfield, Calif. in the late 1980s, his girlfriend at the time, now his wife, Judy, gave him an autographed copy of Trump’s “The Art of the Deal. ” “I thought it was great,” he told me. In McCarthy’s view, Trump is a master of today’s media, much as Lincoln and Kennedy were in their own times. “He’s mastered instantaneous Twitter,” he said. “It’s like owning newspapers. ” Trump has found a kindred spirit in McCarthy, a coastal extrovert of ambiguous ideological portfolio who (unlike Ryan) would far rather talk about personalities than the tax code. And as the former minority leader in the California Legislature during the governorship of Arnold Schwarzenegger, McCarthy is experienced in the care and feeding of celebrity egos. Since Trump’s nomination, the two have spoken frequently by phone  —   to date, Trump has never been known to directly email or text anyone  —   about the cast of 535 characters with whom the president must now deal. But in the end, what Trump needs from the majority leader is not gossip but votes  —   216 of them, to be exact, in the House. And McCarthy’s recent track record in obtaining majorities has not been the greatest. In his previous capacity as House whip, he was thwarted by members of his own party when it came to subjects as diverse as reauthorizing a Patriot Act they deemed too intrusive, a farm bill they considered too expensive and a   bill they regarded as too lenient. His most reliable obstacles have been the three dozen or so House conservatives known as the Freedom Caucus, a    group of fiscal  . Early this year, McCarthy predicted to me that the new president would quickly subjugate the Freedom Caucus. “Trump is strong in their districts,” McCarthy told me. “There’s not a place for them to survive in this world. ” When we spoke on the morning of March 7, Trump assured me that he would not bully the   bill’s loudest Republican critics, like the Freedom Caucus chairman, Representative Mark Meadows, on Twitter: “No, I don’t think I’ll have to,” he said. “Mark Meadows is a great guy and a friend of mine. I don’t think he’d ever disappoint me, or the party. I think he’s great. No, I would never call him out on Twitter. Some of the others, too. I don’t think we’ll need to. Now, they’re fighting for their turf, but I don’t think they’re going to be obstructionists. I spoke to Mark. He’s got some ideas. I think they’re very positive. ” But on March 21, in a meeting with the Freedom Caucus about the bill, Trump called out Meadows by name, saying, “I’m going to come after you, but I know I won’t have to, because I know you’ll vote ‘yes. ’’u2009” Meadows remained a “no” on the bill, and among conservatives, he was far from alone. One of the Freedom Caucus’s most outspoken members, Representative Raúl Labrador of Idaho, believes that the Trump White House was led astray by Ryan’s confidence that he knew what conservatives wanted when drafting the bill. “The legislation has to go through the body, not the top,” Labrador told me. “And if our leadership thinks now that we’re a unified body, that they can do things while ignoring us, that’s not going to happen. ” Labrador is an affable but decidedly stubborn    Mormon and former immigration lawyer who moved as a child with his single mother from Puerto Rico to Las Vegas. He was interviewed by the   for the post of interior secretary at Trump Tower last December  —   though Trump selected Labrador’s House colleague Ryan Zinke for the post a few days later. For now, Labrador and other Freedom Caucus members have been willing to blame House leaders like Ryan and McCarthy for drafting a health care bill that was not to conservatives’ liking. They aspire to remain philosophical whenever Trump’s daughter Ivanka persuades her father to propose initiatives like paid family leave, as he did during his   speech. “I didn’t stand up when he said that,” Labrador said. “That’s the only part of the speech where I thought, That’s not even close to what my party stands for. ” To House conservatives like Labrador, the Republican Party stands for limited government. To Trump and Bannon,   items like a border wall and infrastructure take priority over shrinking America’s debt. As Chaffetz admitted to me, “On the spending front, things could slip away really quickly. ” Trump’s budget blueprint is regarded by deficit hawks as fundamentally unserious, because it does not touch entitlements. Instead, it ravages perennial (and already  ) conservative piñatas like foreign aid, public broadcasting and the National Endowment for the Arts, in addition to downsizing the Environmental Protection Agency and the Interior Department  —   cuts that focus on the 27 percent of the federal budget that is not mandatory spending or devoted to defense. And for all the Republicans’ chesty rhetoric on cuts like these over the years, as a top House Republican staff member told me, “even the cabinet secretaries at the E. P. A. and Interior are saying these cuts aren’t going to happen. They’re going to protect their grant programs, their payments to states, their Superfunds. So how do you cut 31 percent of the E. P. A. out of the 5 percent that isn’t protected? And a bill that cuts all money for the N. E. A. will not pass. For Republicans in the West”  —   states whose vast rural areas benefit disproportionately from N. E. A. grants  —   “that’s a   killer. The campaign commercials write themselves. ” Labrador says he would defend Trump’s cuts but doubts that many of his colleagues would. “What he’s going to learn is that members of Congress are unwilling to take the tough votes,” he told me. “When he learns that, what’s going to be the next step?” In Labrador’s view, Trump’s only sane recourse will be to accept the need for entitlement reform. “At some point, the reality of the budget is going to have to hit him,” he said. “You can have this economic nationalism  —   Bannon is very smart, he clearly helped him with his messaging, it was so successful  —   but at some point, that theory is going to hit reality. ” When I spoke with Trump, I ventured that, based on available evidence, it seemed as though conservatives probably shouldn’t hold their breath for the next four years expecting entitlement reform. Trump’s reply was immediate. “I think you’re right,” he said. In fact, Trump seemed much less animated by the subject of budget cuts than the subject of spending increases. “We’re also going to prime the pump,” he said. “You know what I mean by ‘prime the pump’? In order to get this”  —   the economy  —   “going, and going big league, and having the jobs coming in and the taxes that will be cut very substantially and the regulations that’ll be going, we’re going to have to prime the pump to some extent. In other words: Spend money to make a lot more money in the future. And that’ll happen. ” A clearer elucidation of Keynesian liberalism could not have been delivered by Obama. The one clear point of agreement between the Trump economic nationalists and the House conservatives is the one Ryan and Bannon identified over dinner in January: tax reform. But in so doing, they will be picking a fight that may prove perilous to Republicans. The    proposal that Ryan floated to Bannon has never been able to get past K Street lobbyists and wealthy Republican donors like the Koch brothers. When I asked Trump if he was a fan of the   tax, he replied: “I am. I’m the king of that. ” Almost no other country grafts an import tax onto a corporate tax, and it’s possible that enacting a   tax might well be in violation of the World Trade Organization’s agreements. Of course, Bannon has openly advocated abandoning the W. T. O. anyway, because of China’s membership in it. Still, the specter of new taxes on American corporations, higher prices for consumers and a jump in the dollar’s value may compel an unusual confederacy against the   plan. Labrador predicts that the   tax “will have very little political legs” in the conservative House, while Senator Lindsey Graham said in February that even in the   Senate, Ryan’s tax plan “won’t get 10 votes. ” Senator Heidi Heitkamp, a North Dakota Democrat who has been outspoken in her willingness to work with Trump in spite of the broader stance of her party, says, “Let me tell you, I represent farmers, and anyone who tells me that farm country benefits from a high dollar needs to have a discussion with me. ” Perhaps the Republican faction most alarmed by Bannon’s economic nationalism is Washington’s military hawks. John McCain is among those not mollified by Trump’s pledge of enacting “one of the largest increases in   spending in American history. ” McCain scoffed when I brought this up to him. “Of course that’s simply not true,” he said. “When you look at 1981 and Reagan’s commitment to rebuilding the military, there’s no comparison to this 3 percent increase. It’s a shell game, my friend. ” Despite his obvious differences with Trump, McCain was willing to work with him  —   but Bannon’s presence seemed to confound such prospects. “It’s kind of interesting,” McCain said, “because I have decades of experience with Kelly, with Mattis, with Dan Coats, McMaster,” referring to Homeland Security Secretary John Kelly Defense Secretary James Mattis Dan Coats, the director of national intelligence and H. R. McMaster, the national security adviser. “We discuss issues all the time. I think this is probably the finest   team that I’ve ever observed. It’s almost schizophrenic, in that I obviously don’t have conversations with Steve Bannon, but I do with Reince Priebus  —   he was my Republican chair in Wisconsin in my 2008 presidential campaign. So it’s almost a schizophrenic  —   that’s not the right word. A very divided kind of relationship. Paradoxical. ” McCain acknowledged to me that economic nationalism was a global movement and therefore not entirely “the making of some members of the Trump entourage. ” He then said: “But it is an articulation that I believe is strongly reminiscent of the 1930s. It certainly has unsettled our allies and friends around the world, there’s no doubt about that. ” Already, the senator asserted, the new administration’s bellicosity toward Mexico has increased the likelihood that its citizens will elect “a very     president. ” As for an import tax of the sort favored by Bannon and Ryan, “talk about harkening back to the 1930s,” he said. “It’s unbelievable to me that they somehow think if we start taxing goods coming across the border, that that’s somehow not going to be responded to by the Mexicans. Please. History shows this sort of action gets you into a trade war. ” Listening to McCain’s tirade, I found it evident that the Bannon Effect might well cost the Trump White House at least one Republican Senate vote on a number of central issues  —   this at a time when Republicans are clinging to a slender majority in the upper chamber. In such cases, Trump could find himself asking for something Obama was never able to count on: votes from the opposition. Early in the afternoon of Feb. 9, several Democratic senators met with Trump in the Roosevelt Room of the White House to discuss the Gorsuch nomination and other matters. Among them were Heidi Heitkamp, Joe Donnelly of Indiana, Joe Manchin of West Virginia and Jon Tester of Montana. All four are moderates who are up for   in 2018 in states Trump carried in 2016 by titanic margins  —   the least of which, in Donnelly’s state, was nearly 20 points. If Democrats are to nurture any hopes of retaking the Senate majority, they will need to hold these four seats. But if Donnelly, Heitkamp, Manchin and Tester need to be seen back home as willing to work with Trump, the president needs them as well. Republicans enjoy a precarious    advantage in the Senate. On matters like the Supreme Court, Trump can count on all 52. On votes requiring a simple majority, any two of those Republicans could fall away, and Pence could preserve the win with a tiebreaking vote. But a trio of fiscal   (like Ted Cruz, Rand Paul and Mike Lee) military hawks (John McCain, Lindsey Graham and Marco Rubio) or social moderates (Susan Collins, Lisa Murkowski and Shelley Moore Capito) could deny Trump a majority, unless he could swing at least one Democrat to his side. That February afternoon in the Roosevelt Room, Donnelly thanked Trump for negotiating with Carrier, the manufacturing company based in Indiana that had threatened to move jobs to Mexico before Trump   it into keeping many of them in Indiana. But Donnelly urged him not to view that episode as a “ . ” He requested the president’s support for his End Outsourcing Act, which would give preferential treatment in awarding federal contracts to businesses that kept jobs in America. The words were scarcely out of Donnelly’s mouth before Trump said, “I’m 100 percent for that, and I’ll do everything I can to help get it passed. ” He then asked Pence, who was in the room, “What do you think, Mike?” Trump was apparently unaware that Pence, as the governor of Donnelly’s state, had refused to back the senator’s initiative, claiming instead that burdensome federal regulations were to blame for outsourcing. According to Donnelly, Pence gamely replied, “If it’s like what Joe describes, I’ll do everything I can to help. ” Donnelly, a   Irish Catholic with a barroom guffaw, had met Trump once before. In January 2011, he was among the   Blue Dog Coalition, composed of conservative House Democrats  —   what remained of them, anyway, after the previous November’s disastrous midterms  —   who traveled to New York for their annual retreat. At a hotel conference room in Midtown Manhattan, the 20 or so Blue Dogs received a procession of guests, including Mayor Michael Bloomberg and former President Bill Clinton. Only one of their scheduled appointments required that they go to their guest  —   and so they did, by bus, to Trump Tower. Trump greeted them in his boardroom, with its commanding view of Central Park. He was charming but also brash. “Remember, at that point he wasn’t really talking about running for office,” recalls one attendee, former Representative Dan Boren of Oklahoma. “But what strikes me was how he talked about the same issues  —   the wall, China  —   that became his stump speech years later. ” It was evident to the Blue Dogs that Trump was no Clinton or Bloomberg when it came to the issues. Says former Representative Ben Chandler of Kentucky, who was also in attendance: “The difference in terms of detailed knowledge of policy was stark. Trump just made bald assertions, really. ” Particularly memorable to Chandler was Trump’s insistence “that one of the best things the country could do was slap a massive tariff on the Chinese. ” Chandler continued: “He seemed not to understand that this would probably cause the entire world economy to melt down by causing a huge trade war. What I remember more than anything else was our general reaction afterward. And it was one of disbelief. ” Today Donnelly remains offended by what he calls Trump’s “crazy stuff,” as well as the alternative to Obamacare that Trump supported. But he does not begrudge Trump his showmanship. “He came to the Carrier plant,” Donnelly said. “I’ve been working on that issue since Day 1. I was begging people in the Obama administration to come out and talk to our workers. Donald Trump came out there. And Donald Trump talked to our workers. You can tell people you care. But it matters if you show up. ” The Senate Democrat who, to outward appearances, seems closest to Trump is Joe Manchin, who met face to face with the   in Trump Tower in December. Before the meeting, Bannon took the West Virginia senator aside. “The thing you need to know about Trump,” Bannon said, “is he doesn’t care about the Republican Party and he doesn’t care about the Democratic Party. He just wants to put some wins on the board for the country. ” In the meeting, Trump asked Manchin what could be done for coal miners. Manchin replied that he should support his Miners Protection Act, which would secure health benefits and pension funds for retired miners. According to Manchin, Trump replied that he would thoroughly support such a measure. Later that month, Manchin went on “Morning Joe”  —   the one show on MSNBC that Trump has been known to watch  —   to discuss, on the occasion of the fourth anniversary of the Newtown school massacre, the need to expand background checks on gun purchases. Within an hour after Manchin was offscreen, his cellphone rang. It was Trump. Manchin was not completely forthcoming about the conversation, but he did tell me that he envisioned “a complete opportunity” for new   legislation. Unlike with Obama, he said, “no one thinks President Trump would do anything that would take away your gun rights. ” In his conversations with Manchin and Donnelly, Trump was essentially throwing his support behind a Democratic initiative without first checking with the Republican Senate majority leader, Mitch McConnell, to ask what he thought of those proposals. Had he done so, the answer in each case would have been: not much. (Though on the coal miners’ legislation, Manchin said: “We’re seeing Mitch McConnell go from a ‘No, no and hell no’ to now dropping his own bill. Which is fine, so long as we get it. ”) Still, Trump may have little choice but to indulge Democrats on some of their pet issues, given that he will need their votes on two of the most critical pieces of his agenda: infrastructure and trade deals. Until now, Trump has divulged few details about this   infrastructure venture. On the campaign trail, he frequently cited America’s crumbling roads and bridges. He bemoaned the potholes defiling the runways at La Guardia Airport, where he parked his two planes. During Donnelly’s visit with Trump in the Roosevelt Room, the president “talked about the   Tunnel with the tiles falling off, which he would see on his way to La Guardia,” Donnelly recalled. (The Metropolitan Transportation Authority denies that tiles are falling off the tunnel.) When I asked Trump for more specifics, he gingerly offered a few morsels: “This is something that’s going to be a real infrastructure bill, where real work is going to be done on bridges and roads and airports and things that we’re supposed to be doing. So it’s not just a political piece of paper. We’re going to do infrastructure, and it’s going to be a very big thing. ” Trump’s description struck me as uncharacteristically modest. Bannon had evoked a more gleaming vision when he told me: “Look, economic nationalism is predicated on a     infrastructure for the country, right? Broadband as good as Korea. Airports as good as China. Roads as good as Germany. A rail system as good as France. If you’re going to be a   power, you’ve got to have a   infrastructure. ” When I asked the president if his initiative might include such features, he replied: “Yes. It could, it could. You look at Japan and China, where they have the fast trains, and we don’t have any. You look at other countries where we used to be the leader, and now we’re the laggard. It’s not going to happen anymore. ” What also may not happen is House Republicans’ supporting a   bill that is at least somewhat reminiscent of the stimulus bill they unanimously opposed eight years ago. It’s also possible that even moderate Democrats in swing states may face pressure not to come to Trump’s rescue. After all, the president remains intensely unpopular among Democrats, who continue to nurture hopes that Trump is one Russia connection away from impeachment. As a senior White House official told me of Gorsuch’s nomination to the Supreme Court: “The comment we often get from Democrats is, ‘That’s a great nominee.’ Oh, so you’re voting for him? ‘I can’t.’ Why not? ‘My base would go crazy, and I’d be primaried.’ That environment has to change before we can have any of these conversations. ” On the morning of Feb. 2, two Democratic leaders on trade issues, Senator Ron Wyden of Oregon and Representative Richard Neal of Massachusetts  —   the ranking members of the Senate Finance and House Ways and Means Committees  —   met with Trump, along with a few of his advisers and Republican lawmakers. Trump had already greeted the day by threatening to yank federal funding from the University of California at Berkeley after acts of violence had forced the cancellation of the Breitbart editor Milo Yiannopoulos’s speech on campus, and by taunting Arnold Schwarzenegger’s poor ratings on “The Apprentice” during the National Prayer Breakfast. Disquiet lingered from Trump’s travel ban on refugees and his surly phone conversation with the Australian prime minister the previous week. Amid this chaos  —   entirely to Bannon’s liking and grating to nearly everyone else in Washington  —   actual legislative activity was slowly unfolding. Trump began the meeting by condemning the trade deals negotiated by his predecessors. The press pool was then ushered out before the Democrats could say anything in front of the cameras. When Neal was given a chance to speak, he informed Trump, Pence, Bannon, Kushner and Commerce Secretary Wilbur Ross that America had in fact prospered as a result of past trade deals. Neal emphasized the crucial role that the Panama Canal played in the economic vitality of the Eastern Seaboard. Other than Ross, no one on Trump’s team seemed aware of this. “They were a bit surprised,” Neal later told me. He was also struck by the White House’s abhorrence of multilateral pacts, which seemed to him to be naïve. “The idea that you’re going to negotiate 148 bilateral agreements with W. T. O. members does not seem realistic,” Neal said. “The idea that we’re all of a sudden going to have a   agreement with Great Britain, that’s going to take years to do. ” Later, Neal said, Ross privately assured him that the Trump administration “would not give up on multilateral deals. ” Neal’s lecture signified the start of what is likely to be a long and at times contentious reckoning on the part of Trump and Bannon with the limits of their nationalist rhetoric. Of all the legislative lifts, none will be heavier than renegotiating trade agreements, which require a simple majority approval by both the Senate and the House. Scrounging up 15 Democratic senators who are willing to vote along with 52 Republicans would be a formidable enough task on any issue. But just as Democrats like Neal in the Northeast would fight for a trade deal that benefits their region, so will Republican lawmakers along the Southern border rebel at an effort to repeal Nafta. As McCain told me, “If you negated Nafta, it would send my state into a severe recession. ” He assured me that Trump’s nationalist posture would not provoke only regional opposition. He conjured up another Republican era  —   not Reagan’s, not Bush’s, but instead that of Herbert Hoover, when two Republican lawmakers joined with a Republican president to design a protectionist initiative that ultimately caused American exports to plummet during the Great Depression. “Somewhere,” McCain said with a dark chuckle, “Mr. Smoot and Mr. Hawley are smiling. ” On Thursday, March 23, Trump hosted a morning meeting of Freedom Caucus holdouts in the Cabinet Room. Jeff Duncan, a congressman from South Carolina who was present, told me that Trump told them: “I need you guys. We need to put up a win. It’s not just about needing to repeal Obamacare  —   though we do. It’s also that a win here sets up a win for tax reform and gives us momentum going into infrastructure. And if the bill fails, it could derail all of that. ” With customary bravado, Trump told the conservative members that he didn’t want to squeak by with just a   victory. “I want all 237 of you,” he said, according to Duncan, referring to the entire House Republican conference. That included the more moderate members, who had told Trump they felt that the White House wasn’t paying sufficient attention to their concerns. Later in the day, Trump hosted another meeting with the moderates, where Representative Charlie Dent of Pennsylvania informed Trump that he remained a “no. ” According to an attendee, Trump angrily informed Dent that he was “destroying the Republican Party” and “was going to take down tax reform  —   and I’m going to blame you. ” Until that day, Duncan had been an unyielding “no” on the bill. The previous week, he delivered an impassioned speech to the vice president and other Republicans, insisting that this vote constituted “our generation’s rendezvous with destiny  —   a real chance to roll back the size and scope of the federal government, returning some liberty back to the people through our actions to repeal Obamacare. ” In a text to me, Duncan pointed to history: “39 men in a hot room in 1787 had the courage to break from the norm and empower a nation. ” But now the   congressman was, for the first time in his life, sitting across the table from a president who was personally appealing for his support. The White House was offering concessions and agreeing to them in writing. Duncan left the meeting and spent a few hours pondering, as he would later put it, “the greater opportunity we as Republicans have. ” By that evening, Trump had won Jeff Duncan’s vote. It wasn’t enough. The next afternoon, Ryan pulled the House health care bill, conceding that neither he nor the White House could muster enough votes. “You get about nine months to do the big things,” Kevin McCarthy, the House majority leader, told me at the beginning of the year. Nine months seemed like a long time then, the calendar spacious and the legislative   possibilities plentiful. But more than two of those months are gone already  —   and the path to future wins, as Trump foresaw in his meeting with the Freedom Caucus, is now more complicated. When he took office, Trump relished the prospect of becoming a new kind of deal maker in the White House. By the time I spoke with him in early March, however, he already seemed to be taking stock of the limits to his powers. He still saw himself as the closer in chief  —   but then that was “typical, I would think, of a president,” he mused. “Some more than others. ”'"}, "time": 1742564576.7151518}