{"duration": 0.04818534851074219, "input_args": {"text": "'The junior senator from Nebraska told Breitbart News he was pleased with Judge Neil McGill Gorsuch, President Donald J. Trump’s nominee to replace Justice Antonin G. Scalia on the Supreme Court, who died Feb. 13, creating the current vacancy. [“It is obviously a great pick by the president,” said Sen. Benjamin E. “Ben” Sasse (R. .) who sits on the Senate Judiciary Committee and was one of the guests invited to the White House for the announcement.  “I think it’s going to be really hard for people, who are serious about the Constitution to oppose this guy,” he said. “If you read Judge Gorsuch’s opinions, what you are going to find his policy preferences,” he said. Gorsuch believes in the courts protecting rights and not in courts trying to remake society, said the senator. “He says the constitutional system allows the Congress to write the laws, not the courts and the judges, who think about they are  . ” In a statement released by his office, the senator said that when Gorsuch was confirmed to his current bench at the Tenth Circuit of the U. S. Court of Appeals in Colorado, the vote was unanimous from Republicans and Democrats, including Minority Leader Charles E. “Chuck” SChumer (D. . Y.). “Senator Schumer is about to tell Americans that Judge Gorsuch kicks puppies and heckles piano recitals,” he said. “That’s hogwash. Democrats are working overtime to cast Judge Gorsuch as a reflexive partisan but, as I said when Justice Scalia died, there are no Republican or Democratic seats on the Supreme Court. ” Sasse said the confirmation of Gorsuch is a teachable moment. “This shouldn’t be a partisan debate but an opportunity to teach our kids civics,” he said. “In the coming weeks, everyone who loves the Constitution should celebrate the uniquely American idea that government power must be limited and that those in power must be checked and balanced. ” Sasse told Breitbart News that he, along with other members of the Judiciary Committee, participated in the selection process with Trump’s staff. “They had been reaching out to us in the course of the past two weeks —  honoring the ‘advice and consent’ clause of the Constitution. ” The Nebraskan said the Trump team did a good job seeking out suggestions from others as well as they put together the nomination for the president. Sasse’s praise for the president’s pick for the Supreme Court and for Trump’s process stands in sharp contrast to the senator’s posture during the 2016 campaign cycle. Then, the senator was one of the Republican Party’s most adamant critics of Trump and the poster boy for the #NeverTrump movement. In a May 4 open letter Sasse posted on Facebook, he said he was voting for neither Trump nor his Democratic rival Hillary R. Clinton: “If you are one of those rare souls who genuinely believe Hillary Clinton and Donald Trump are honorable people  —   if they are the role models you want for your kids  —   then this letter is not for you. Instead, this letter is for the majority of Americans who wonder why the nation that put a man on the moon can’t find a healthy leader who can take us forward together. ” Although the senator resisted calls for him to run as an independent, he was critical of his party’s nominee for president throughout the campaign, so much so that Clinton used tape of Sasse talking about Trump in one of her attack ads against the New York City developer. “I have never met him before, but the president went through a very transparent process,” Sasse said. “All through the campaign, he had 21 names that he talked about and he said he would try his best to pick the best jurist,” he said. “Our Founders envisioned people serving on the Supreme Court with a lifetime appointment, not a term. The American people want to hire and fire the people, who write policies, when you read the judge’s opinion —  he is the kind of judge the Founders envisioned,” he said. “”He is a super guy and this is a tremendous pick by the president. ” Gorsuch did not waste any time visiting Capitol Hill for courtesy calls with senators Wednesday morning. No confirmation hearings are yet scheduled.'"}, "time": 1742628537.2971513}