{"duration": 0.2633249759674072, "input_args": {"text": "'Michiko Kakutani, the chief book critic for The New York Times, interviewed President Obama about literature on Friday at the White House. Here are excerpts from the conversation, which have been edited and condensed.  These books that you gave to your daughter Malia on the Kindle, what were they? Some of your favorites? I think some of them were sort of the usual suspects, so “The Naked and the Dead” or “One Hundred Years of Solitude,” I think she hadn’t read yet. Then there were some books I think that are not on everybody’s reading list these days, but I remembered as being interesting, like “The Golden Notebook” by Doris Lessing, for example. Or “The Woman Warrior,” by Maxine [Hong Kingston]. Part of what was interesting was me pulling back books that I thought were really powerful, but that might not surface when she goes to college. Have you had a chance to discuss them with her? I’ve had the chance to discuss some. And she’s interested in being a filmmaker, so storytelling is of great interest to her. She had just read “A Moveable Feast. ” I hadn’t included that, and she was just captivated by the idea that Hemingway described his goal of writing one true thing every day. What made you want to become a writer? I loved reading when I was a kid, partly because I was traveling so much, and there were times where I’d be displaced, I’d be the outsider. When I first moved to Indonesia, I’m this big,   kid that kind of stood out. And then when I moved back from Indonesia to Hawaii, I had the manners and habits probably of an Indonesian kid. And so the idea of having these worlds that were portable, that were yours, that you could enter into, was appealing to me. And then I became a teenager and wasn’t reading that much other than what was assigned in school, and playing basketball and chasing girls, and imbibing things that weren’t very healthy. I think all of us did. Yeah. And then I think rediscovered writing and reading and thinking in my first or second year of college and used that as a way to rebuild myself, a process I write about in “Dreams From My Father. ” That  period in New York, where you were intensely reading. I was hermetic  —   it really is true. I had one plate, one towel, and I’d buy clothes from thrift shops. And I was very intense, and sort of humorless. But it reintroduced me to the power of words as a way to figure out who you are and what you think, and what you believe, and what’s important, and to sort through and interpret this swirl of events that is happening around you every minute. And so even though by the time I graduated I knew I wanted to be involved in public policy, or I had these vague notions of organizing, the idea of continuing to write and tell stories as part of that was valuable to me. And so I would come home from work, and I would write in my journal or write a story or two. The great thing was that it was useful in my organizing work. Because when I got there, the guy who had hired me said that the thing that brings people together to have the courage to take action on behalf of their lives is not just that they care about the same issue, it’s that they have shared stories. And he told me that if you learn how to listen to people’s stories and can find what’s sacred in other people’s stories, then you’ll be able to forge a relationship that lasts. But my interest in public service and politics then merged with the idea of storytelling. What were your short stories like? It’s interesting, when I read them, a lot of them had to do with older people. I think part of the reason was because I was working in communities with people who were significantly older than me. We were going into churches, and probably the average age of these folks was 55, 60. A lot of them had scratched and clawed their way into the middle class, but just barely. They were seeing the communities in which they had invested their hopes and dreams and raised their kids starting to decay  —   steel mills had closed, and there had been a lot of racial turnover in these communities. And so there was also this sense of loss and disappointment. And so a bunch of the short stories I wrote had to do with that sense, that atmosphere. One story is about an old black pastor who seems to be about to lose his church, his lease is running out and he’s got this loyal woman deacon who is trying to buck him up. Another is about an elderly couple  —   a white couple in L. A.  —   and he’s like in advertising, wrote jingles. And he’s just retired and has gotten cranky. And his wife is trying to convince him that his life is not over. So when I think back on what’s interesting to me, there is not a lot of Jack Kerouac,   young kid on the make discovering stuff. It’s more melancholy and reflective. Was writing partly a way to figure out your identity? Yes, I think so. For me, particularly at that time, writing was the way I sorted through a lot of crosscurrents in my life  —   race, class, family. And I genuinely believe that it was part of the way in which I was able to integrate all these pieces of myself into something relatively whole. People now remark on this notion of me being very cool, or composed. And what is true is that I generally have a pretty good sense of place and who I am, and what’s important to me. And I trace a lot of that back to that process of writing. Has that continued to be so in the presidency? Not as much as I would have liked. I just didn’t have time. But you keep some form of a journal? I’ve kept some, but not with the sort of discipline that I would have hoped for. The main writing that I’ve done during the presidency has been my speeches, the ones at least that were important to me. How has the speechwriting and  being at the center of history and dealing with crises affected you as a writer? I’m not sure yet. I’ll have to see when I start writing the next book. Some of the craft of writing a good speech is identical to any other good writing: Is that word necessary? Is it the right word? Is there a rhythm to it that feels good? How does it sound aloud? I actually think that one of the useful things about speechwriting is reminding yourself that the original words are spoken, and that there is a sound, a feel to words that, even if you’re reading silently, transmits itself. So in that sense, I think there will be some consistency. But this is part of why it was important to pick up the occasional novel during the presidency, because most of my reading every day was briefing books and memos and proposals. And so working that very analytical side of the brain all the time sometimes meant you lost track of not just the poetry of fiction, but also the depth of fiction. Fiction was useful as a reminder of the truths under the surface of what we argue about every day and was a way of seeing and hearing the voices, the multitudes of this country. Are there examples of specific novels or writers? Well, the last novel I read was Colson Whitehead’s “The Underground Railroad. ” And the reminder of the ways in which the pain of slavery transmits itself across generations, not just in overt ways, but how it changes minds and hearts. It’s what you said in your farewell address about Atticus Finch, where you said people are so isolated in their little bubbles. Fiction can leap  —   It bridges them. I struck up a friendship with [the novelist] Marilynne Robinson, who has become a good friend. And we’ve become sort of pen pals. I started reading her in Iowa, where “Gilead” and some of her best novels are set. And I loved her writing in part because I saw those people every day. And the interior life she was describing that connected them  —   the people I was shaking hands with and making speeches to  —   it connected them with my grandparents, who were from Kansas and ended up journeying all the way to Hawaii, but whose foundation had been set in a very similar setting. And so I think that I found myself better able to imagine what’s going on in the lives of people throughout my presidency because of not just a specific novel but the act of reading fiction. It exercises those muscles, and I think that has been helpful. And then there’s been the occasion where I just want to get out of my own head. [Laughter] Sometimes you read fiction just because you want to be someplace else. What are some of those books? It’s interesting, the stuff I read just to escape ends up being a mix of things  —   some science fiction. For a while, there was a     novel, the “  Problem” series  —   Oh, Liu Cixin, who won the Hugo Award.  —   which was just wildly imaginative, really interesting. It wasn’t so much sort of character studies as it was just this sweeping  —   It’s really about the fate of the universe. Exactly. The scope of it was immense. So that was fun to read, partly because my    problems with Congress seem fairly petty  —   not something to worry about. Aliens are about to invade. [Laughter] There were books that would blend, I think, really good writing with thriller genres. I mean, I thought “Gone Girl” was a     book. I loved that structure. Yeah, and it was really well executed. And a similar structure, that I thought was a really powerful novel: “Fates and Furies,” by Lauren Groff. I like those structures  where you actually see different points of view. Which I have to do for this job, too. [Laughter] Have there been certain books that have been touchstones for you in these eight years? I would say Shakespeare continues to be a touchstone. Like most teenagers in high school, when we were assigned, I don’t know, “The Tempest” or something, I thought, ‘My God, this is boring.’ And I took this wonderful Shakespeare class in college where I just started to read the tragedies and dig into them. And that, I think, is foundational for me in understanding how certain patterns repeat themselves and play themselves out between human beings. Is that sort of comforting? It gives me a sense of perspective. I think Toni Morrison’s writings  —   particularly “Song of Solomon” is a book I think of when I imagine people going through hardship. That it’s not just pain, but there’s joy and glory and mystery. I think that there are writers who I don’t necessarily agree with in terms of their politics, but whose writings are sort of a baseline for how to think about certain things  —   V. S. Naipaul, for example. His “A Bend in the River,” which starts with the line, “The world is what it is men who are nothing, who allow themselves to become nothing, have no place in it. ” And I always think about that line, and I think about his novels when I’m thinking about the hardness of the world sometimes, particularly in foreign policy, and I resist and fight against sometimes that very cynical, more realistic view of the world. And yet, there are times where it feels as if that may be true. So in that sense, I’m using writing like that as a foil or something to debate against. I’ve read that Lincoln  loved Shakespeare his whole life, but  when he was dealing with the Civil War,  reading the  history plays helped give him solace and perspective. Lincoln’s own writings do that. He is a very fine writer. I’d put the Second Inaugural up against any piece of American writing  —   as good as anything. One of the great treats of being president is, in the Lincoln Bedroom, there’s a copy of the Gettysburg Address handwritten by him, one of five copies he did for charity. And there have been times in the evening when I’d just walk over, because it’s right next to my office, my home office, and I just read it. And perspective is exactly what is wanted. At a time when events move so quickly and so much information is transmitted, the ability to slow down and get perspective, along with the ability to get in somebody else’s shoes  —   those two things have been invaluable to me. Whether they’ve made me a better president, I can’t say. But what I can say is that they have allowed me to sort of maintain my balance during the course of eight years, because this is a place that comes at you hard and fast and doesn’t let up. Is there some poem or any  writing or author that you would turn to, say,  after the mass killings in Newtown, Conn. or during the financial crisis? I think that during those periods, Lincoln’s writings, King’s writings, Gandhi’s writings, Mandela’s writings  —   I found those particularly helpful, because what you wanted was a sense of solidarity. During very difficult moments, this job can be very isolating. So sometimes you have to hop across history to find folks who have been similarly feeling isolated. Churchill’s a good writer. And I loved reading Teddy Roosevelt’s writing. He’s this big, outsize character. Have you read a lot of presidential biographies?  The biographies have been useful, because I do think that there’s a tendency, understandable, to think that whatever’s going on right now is uniquely disastrous or amazing or difficult. And it just serves you well to think about Roosevelt trying to navigate World War II or Lincoln trying to figure out whether he’s going to fire [George B.] McClellan when Rebel troops are 20, 30, 40 miles away. I watched some of the    documentary   “Eyes on the Prize” after the election.  It was useful. You do see how far we’ve come, and in the space of my lifetime. And that’s why seeing my daughters now picking up books that I read 30 years ago or 40 years ago is gratifying, because I want them to have perspective  —   not for purposes of complacency, but rather to give them confidence that people with a sense of determination and courage and pluck can reshape things. It’s empowering for them. What books would you recommend at this moment in time, that  captures this sense of turmoil? I should probably ask you or some people who have had time to catch up on reading. I’ll confess that since the election, I’ve been busier than I expected. So one of the things I’m really looking forward to is to dig into a whole bunch of literature. But one of the things I’m confident about is that, out of this moment, there are a whole bunch of writers, a lot of them young, who are probably writing the book I need to read. [Laughter] They’re ahead of me right now. And so in my   in addition to training the next generation of leaders to work on issues like climate change or gun violence or criminal justice reform, my hope is to link them up with their peers who see fiction or nonfiction as an important part of that process. When so much of our politics is trying to manage this clash of cultures brought about by globalization and technology and migration, the role of stories to unify  —   as opposed to divide, to engage rather than to marginalize  —   is more important than ever. There’s something particular about quieting yourself and having a sustained stretch of time that is different from music or television or even the greatest movies. And part of what we’re all having to deal with right now is just a lot of information overload and a lack of time to process things. So we make quick judgments and assign stereotypes to things, block certain things out, because our brain is just trying to get through the day. We’re bombarded with information. Technology is moving so rapidly. Look, I don’t worry about the survival of the novel. We’re a storytelling species. I think that what one of the jobs of political leaders going forward is, is to tell a better story about what binds us together as a people. And America is unique in having to stitch together all these disparate elements  —   we’re not one race, we’re not one tribe, folks didn’t all arrive here at the same time. What holds us together is an idea, and it’s a story about who we are and what’s important to us. And I want to make sure that we continue that. I know you like Junot Díaz’s and Jhumpa Lahiri’s books, and they speak to immigration or the American Dream. I think Lahiri’s books, I think Díaz’s books, do speak to a very particular contemporary immigration experience. But also this combination of  —   that I think is universal  —   longing for this better place, but also feeling displaced and looking backwards at the same time. I think in that sense, their novels are directly connected to a lot of American literature. Some of the great books by Jewish authors like Philip Roth or Saul Bellow, they are steeped with this sense of being an outsider, longing to get in, not sure what you’re giving up  —   what you’re willing to give up and what you’re not willing to give up. So that particular aspect of American fiction I think is still of great relevance today.'"}, "time": 1742563547.7961051}