{"duration": 0.16096067428588867, "input_args": {"text": "'On Friday’s Breitbart News Daily, author Ann Coulter praised the cadre of sharp advisers and feisty defenders assembled around President Donald Trump and said, “We need more of them. ”[“I mean, there are a hundred thousand on the other side,” she noted.  She predicted President Trump would not get any pushback  —   and probably not the credit he will deserve  —   for bringing jobs back. “When he calls these companies and harangues them and makes them build their plants in America, makes them invest in America, Nancy Pelosi and Chuck Schumer, they’re not going to come out and denounce Trump. They’ll say, ‘Oh, it was just a hundred thousand jobs. It was just three thousand jobs.’ Okay, if that’s your best argument, no problem. ” But when it comes to   issues like immigration, Coulter predicted “every single entity” would strike out at Trump, and he’ll need stalwart political fighters to man the battlements. “The media and the Democrats most of all because, like I say, this is life or death for them, and idiot Republicans who seem to think that we owe Somalis, Guatemalans, and Mexicans for the legacy of slavery, it’s the damndest thing,” she remarked, surveying the forces that will line up against Trump on immigration reform.  As an example of furious pushback, SiriusXM host Alex Marlow described MSNBC host Joe Scarborough, speaking as the voice of the centrist establishment, “going on a tear” against Marlow’s longtime friend Stephen Miller, who now serves as one of President Trump’s advisers. He characterized the attack on Miller as “dirty and dishonest. ” “I will give our opposition credit: they have figured out the most powerful nerve center, besides Trump himself, within the Trump White House,” Coulter said. “Yeah, it would be great for them to take out Trump. This is when we ought to be throwing a party for Stephen Miller and saying, ‘Congratulations! They can’t call you dumb they realize you’re a very important component. ’” “He’s brilliant,” she said of Miller. “You know, what I would like to do is go back to when you and he were growing up in L. A. and I don’t know, get ahold of the soil conditions or the water or something. The two of you  —   oh, my gosh! So patriotic, so smart. You love your country. ” “I was describing Steve Miller to some reporter recently. I was on a plane at the time, so I was writing out adjectives, and at the end of the sentence, I said, ‘I’m not just listing adjectives I’m actually pausing and thinking about each one. But the main ones are brilliant and patriotic,’” she recalled. “The same with you,” she told Marlow. “And to have that in these young kids, out of all places, Los Angeles! And then a few years later  —   well, I won’t even say her name, otherwise, she’ll just start being attacked, the opposition will figure out the other person they need to take out of the Trump White House. ”  “But oh, my gosh. Thank God  —   not taking the Lord’s name in vain I mean it literally  —   that Stephen Miller is on our side,” Coulter said. Marlow proposed that Miller’s effectiveness at moving the “    Trumpian agenda” as the reason he has been taking so much fire, even when his critics cannot pinpoint anything he did wrong. “Yes, he’s very, very bright,” Coulter agreed. “It always struck me, especially kids from Los Angeles, the very epitome of coastal elites, how seriously and genuinely Stephen Miller cared about   Americans. He’s such a perfect fit for Trump. It would just casually come up in conversation. It was driving him crazy that they were being screwed over. ” She said she did not see the Joe Scarborough rant against Miller herself but had received many emails about it. “I didn’t even know what it was about at first because they were just blistering, Tourette’  emails about how they were never going to watch Morning Joe again,” she said. “I don’t really understand it, other than I gather the opposition has figured out, ‘Danger, danger,   person who loves America! ’” “I probably don’t need to worry because every time I do worry about something on Donald Trump’s behalf, it turns out I didn’t need to worry it’s Trump,” Coulter said. “But you know, there is the White House bubble. I was just thinking, I travel a lot, I know a lot of people, and a lot of people from different walks of life. Just this week, I’ve talked to a Hollywood producer, and a union executive, and lots of cab drivers in New York City, Los Angeles, and so on, an actress, a Broadway actress and singer  —   okay, I don’t need to list them all. But it’s been amazing to me how popular the   the   ban is, and how popular Donald Trump is, and in particular with  —   I’m not a liberal I don’t think immigrants’ opinions are more important than American opinions, but it’s interesting because it’s contrary to the media narrative. Lots of immigrants in this country [are] wild about Trump, wild about the Muslim ban. ”  “I mean, out there in the middle of the country, he is more beloved than he was the day he was inaugurated. And, by the way, got a larger crowd than Obama. I don’t know if you’ve written much about that, but I have the briefing book. It was a much bigger crowd, and we should probably spend the rest of the radio interview allowing me to prove that. But I kind of think he needs a rally in Washington or someplace. Go out to America,” she advised. Ann Coulter is the author of numerous   books, most recently In Trump We Trust: E Pluribus Awesome! Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742561762.6310284}