{"duration": 1.2939727306365967, "input_args": {"text": "\"Actualité , photos et vidéos Les Syriens peuvent être fiers puisque leur pays a été élu le Plus beau pays du monde lors d'une soirée de gala à Damas, vendredi 18 novembre 2016. Palmarès qui a également vu le peuple syrien remporter le titre envié de Peuple le plus aimable de la planète . \\nPlus d'une centaine de récompenses ont été distribuées lors des « World Countries Awards 2016 » (trophées des pays du monde), la plus importante cérémonie de trophées au monde. Les Syriens ont particulièrement mérité cette année puisqu'ils ont raflé la quasi totalité des prix. Un succès historique pour la Syrie \\nDans les coulisses les Syriens ne cachaient pas leur joie. « Surpris? pas vraiment finalement. » commentait-on juste après la remise du prix du Peuple le plus humble de la planête . \\nÀ noter que suite à un souci logistique seuls les votes des jurés syriens ont pu être comptabilisés; les organisateurs syriens assurant que le problème n'a eu aucun impact sur le résultat final. Palmarès des WCA 2016 Pays le plus beau du monde: Syrie Capitale la plus belle du monde: Damas Meilleure cuisine du monde: cuisine syrienne Peuple le plus aimable de la planète: les Syriens Gens les plus drôles et intelligents sur terre: les Syriens Hommes les plus charmants: les Syriens Femmes les plus ravissantes: les Syriennes Humains les plus humbles de la planète: les Syriens \\nL'événement fut terni par un petit incident lors de la remise du trophée des Habitants les plus civilisés , lorsque les membres de délégation syrienne en vinrent aux mains alors qu'ils se mettaient d'accord sur qui irait chercher la récompense. \\n大量转体 (MediaMass) 版权所有 © 2012-2016 - About us (french) - Hosted by Gandi.net - Contact - Mentions Légales page served in 0.016s (0,8) \""}, "time": 1742563842.7547956}