{"duration": 0.037911415100097656, "input_args": {"text": "\"Share on Facebook Russia is hoping for a “new understanding” and “restored Russian-American relations” according to Kremlin sources, with President Putin said to be “encouraged” by the American people voting to back themselves and reject the prospect of a New World Order totalitarian world government. Via Yournewswire : According to sources, Putin believes that the result of the U.S. election proves the globalists' destructive agenda is deeply unpopular with real people, and when given a chance they will instinctively reject it out of hand. “The American people stood up against the media, the banks, the establishment, everything was against them, but they said enough. They want change.” Putin vowed to destroy the New World Order in 2016, and it appears people all over the world have started to wake up and resonate with his goal. The President is “ deeply encouraged ” that his determination to destroy the invasive organisation’s agenda is shared by people all over the world, and gaining momentum all the time. This election result represents the biggest uprising by the American people against the elite who run the country since the Boston Tea Party in 1771, and the New World Order controlled puppets in Washington are reeling. All of the elite – politicians, bankers, economists, celebrities – told the people to vote for the NWO selected candidate, Hillary Clinton . But the people are waking up. The people said no. The Rothschild NWO cabal will be pacing nervously in their mansions, wondering how to deal with this massive, unexpected blow to their globalist agenda. Their roadmap to arriving at a one world government – so close, yet so far away – has been thrown off course by this uprising of the people. In an annual press conference with his countrymen last April, Putin expressed skepticism about the American electoral process, which he believes is corrupt – elite family clans taking turns occupying the White House. He also hinted at how he personally saw Hillary Clinton. “First there was Bush senior in power, then Bush junior. [Bill] Clinton was[U.S. President] two times in a row, now his wife has ambitions. Again, the family might stay in power. As they say in Russia, a husband and a wife are the same Satan.” Neither side of the political establishment wanted Trump anywhere near the White House. The mainstream media were vilifying him. In short, the sock puppets of the New World Order were united against him. They have a lot to lose if somebody who isn't playing by their rules takes control – and their nightmare has come true. Do not be surprised if the mainstream media attempt to convince you of something deeply disturbing in the near future. Never in history has the NWO had such a firm grip on mainstream media operations. The New World Order controlled elites in Washington did not expect this blow and they will be a scrambling to take back control. Triggered by a massive popular uprising, stoked by wholly rational fears, and fired up by hard facts, America has regained its status as a powerful, sovereign nation. The people chose to make the United States powerful again, to take control of their economy, and make themselves respected in the eyes of the world. They have taken the bull by the horns and backed themselves as American. They have voted for advance over stagnation. It is the answer for our times. Related:\""}, "time": 1742564171.2552252}