{"duration": 0.047142982482910156, "input_args": {"text": "'October 29, 2016 - Ruslan Ostashko, PolitRussia - translated by J. Arnoldski -  \\n\\n\\nEvery speech of the Russian president at international forums is a landmark event. I say so not because I am a Russian journalist and support the president, but because Vladimir Putin is on the very short list of global politicians who can speak inconvenient and politically incorrect truths from the podium even if someone is shocked or hurt. \\nFor example, Barack Obama’s speeches can be listened to learn a new flat joke about the Russian economy, which he tore to shreds. But Putin, Trump, and Xi Jinping’s speeches are worth listening to for the sake of those moments when they tear off the veils of unnecessary political correctness and call things by their names. Who else among world leaders, and not marginal oppositionists, can tell us about supranational oligarchical and bureaucratic elites?  \\nOf course, as Putin himself said, he cannot allow himself to make sharp epithets, but for anyone who speaks Russian, it is not difficult to understand who he had in mind and what he thinks about them. I often doubt the psychological health of the American political elite, but Putin prefers to say that Western elites are “acting irrationally” and “stepping on the same rake.” One can only envy the restraint of our president. \\nPutin used his speech at Valdai to pointedly and very wittily respond to the claims that the collective West has made against Russia lately. \\nI especially liked the rhetorical “fork” with which he poked the Americans accusing Russia of meddling in the American elections. Putin said that this is impossible since the US is a great power, not a banana republic, and thereby humiliated his opponents. If they will continue to insist that Russia is interfering, then they will humiliate the US by admitting that the US is now at the level of a banana republic. If Putin is to be agreed with on the greatness of the US, then it turns out that all the accusations of Russian intervention look silly. \\nPutin also expressed a thesis which will be used by all anti-systemic European politicians. He said that the European Parliament now has more influence on the lives of ordinary Europeans and controls more spheres of life than the Supreme Soviet in the USSR. Putin stressed that Brexit was a surprise for the European elite, systemic media, and politicians who suddenly discovered that a significant part of society is discontent with the current situation in which ordinary citizens have no say.  \\nIn this spirit, he explained the popularity of Donald Trump, who has become the spokesman of the desires of ordinary Americans who are tired of irresponsible politicians and elites. \\nOverall, Putin painted with broad strokes for the audience a revolutionary situation, one in which “those at the top can’t go on and those at the bottom don\\'t want to” [a reference to Lenin’s famous description of a \"revolutionary situation\" in his  Left-Wing Communism: An Infantile Disorder - JA]. \\nIn this case, the top is the supranational oligarchy and bureaucracy mentioned by Putin which, feeling dizzy with success after victory in the Cold War, made mistakes, and is now faced with a situation in which it has to acknowledge that globalization and multiculturalism are not working.  \\nThe bottom is the world’s citizens, including those of the West and those political leaders who are called “marginal” by systemic elites. Putin even formulated a mini-program that the peoples of Russia, China, and France can all get behind. Putin said that the ordinary inhabitants of the planet want to be ensured preservation of cultural identity, freedom, and independence. \\nThe problem is that the existing supranational bureaucracy and oligarchy can’t give them this. After all, the preservation of cultural identity means the end of globalization and independence means the end of the hegemony of one civilizational project. Freedom is like an acid eating away at formal and informal structures dictating countries how to live, what currency to use, what history to remember, and who to call terrorists and who freedom fighters.  \\nI am very pleased that Russia has strong media working towards Western audiences, and I am sure that many ordinary Westerners will recognize themselves in this description of frustrated and angry citizens who no longer want to live the old way and want to smash the existing system. It is as if Putin is holding out his hand to them and assuring them that we are the same, that we have one big, serious, and common problem: the very same supranational oligarchy and bureaucracy which is pulling the strings of some American and European leaders. Psychologists say that the joint resolution of complex problems is the best way to tie a long and enduring friendship.  \\n\\nWe can’t be friends with today’s Western elites. Putin is not going to retire, and in the future disgruntled citizens will be able to change the Western elites.  \\n\\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742628465.574793}