{"duration": 0.11109232902526855, "input_args": {"text": "'ISTANBUL  —   Turkey’s quarrel with Europe worsened over the weekend after the Turkish president accused the Dutch government of Nazism, and Turkish politicians were barred or disinvited from events in two European countries, amid tensions ahead of a tight referendum on a new Turkish Constitution. Having criticized German officials for barring their Turkish counterparts from campaign events this month, President Recep Tayyip Erdogan turned his ire on the Netherlands after the Dutch stopped the Turkish foreign minister from landing there for a rally on Saturday, and then escorted the Turkish family minister out of the country early on Sunday, citing risks to public order and security. It was an unusually strong reaction from the Dutch, who have generally taken an open stance toward diverse points of view, but who are in the midst of an election campaign in which immigration and integration are major topics. “When those incidents began, I said those are fascistic measures,” Mr. Erdogan said in a speech on Sunday afternoon. “I said Nazism had risen from the dead. And then I added: I thought Nazism was over, but I was wrong. ” The   remarks from Turkey inflamed tensions among the Turkish community in the Netherlands, who protested in Rotterdam until the early hours of Sunday, when they were dispersed by police officers wielding batons and water cannons. The police arrested 12 people, and seven were injured, including a policeman, whose hand was broken. Though Turkish law technically bars the practice, Turkish ministers are touring Europe to persuade the Continent’s sizable Turkish diaspora to vote yes to an expansion of Mr. Erdogan’s powers, amid fears that the “no” campaign may hold the edge in the April referendum. But this campaign has collided with closely fought local elections in the Netherlands and France, where   politicians have sought political capital from stoking tensions with the Turks. The push for votes also comes at a time of increased European alarm over Turkey’s democratic backslide and rising concerns over immigration and integration. The Dutch government said it refused to allow the Turkish foreign minister’s plane to land after the Turkish government publicly called on “Dutch nationals of Turkish origin to turn out in great numbers. ” The two countries were negotiating over finding a smaller venue like the Turkish Consulate to hold the meeting, but “before these talks had been concluded,” Turkey “publicly threatened the Netherlands with sanctions” making a “reasonable compromise” impossible, the Dutch Foreign Ministry said. Elsewhere in Europe, the Danish prime minister, Lars Lokke Rasmussen, canceled a meeting with his Turkish counterpart, Binali Yildirim, in protest of Turkey’s “rhetorical attacks. ” In Sweden, a lawmaker from Mr. Erdogan’s party, Mehdi Eker, rearranged a campaign event after the meeting’s initial hosts backed out for safety reasons. In France, two   candidates, François Fillon and Marine Le Pen, criticized the decision to allow the Turkish foreign minister, Mevlut Cavusoglu, to proceed with a rally in France. Switzerland and Austria have previously made it clear that Mr. Erdogan’s campaign is unwelcome there. In the Netherlands, both the conservative prime minister, Mark Rutte, and his   opponent, Geert Wilders, hoped to benefit from the dispute, though it was not immediately clear if either would see appreciable gains. The election is on Wednesday, and while it was Mr. Wilders who first elevated the issue publicly, Mr. Rutte could get credit for barring the Turkish ministers. “Rutte now has premier bonus,” said Bianca Pander, a political strategist at BKB, which works on campaign strategy, referring to his status as prime minister. “He can now show what leadership means. ” He is also benefiting from nearly constant news media coverage on the issue. “Rutte is in the picture now: He’s on every TV show, and on every newspaper,” Ms. Pander said. Mr. Rutte said the pejoratives leveled at the Dutch were “bizarre” and that the “Turkish republic is moving in the wrong direction for a democracy. ” In response, Mr. Erdogan accused the   Dutch government of playing to a domestic audience by blocking his ministers. “Holland, if you are sacrificing   relations because of the election on Wednesday, you will pay the price,” Mr. Erdogan said Sunday. Inside Turkey, Mr. Erdogan, too, was accused of trying to curry favor with the country’s voters. With the referendum result in doubt, some of the president’s critics argued that he was manufacturing fights with Europe to win the support of nationalists in Turkey who were undecided about whether to back the expansion of his mandate. “Turkish foreign policy today  —   whatever it is, wherever it is, from Syria all the way to the Netherlands and Germany  —   is related to the domestic political agenda,” said Cengiz Candar, a veteran Turkish columnist and academic. “There is no Turkish foreign policy now,” Mr. Candar added in a telephone interview. “Turkish foreign policy is related to Mr. Erdogan’s referendum campaign. ” But others supported Mr. Erdogan’s stance. The leader of the main Turkish opposition party, Kemal Kilicdaroglu, who is against the proposed Constitution, called on Mr. Erdogan to suspend relations with the Netherlands. A small crowd of   protesters gathered outside the Dutch Consulate in Istanbul, while an unknown intruder briefly managed to replace the consulate’s Dutch flag with a Turkish one. In a province west of the city, another crowd of protesters squeezed a series of oranges, in a theatrical gesture apparently intended to insult the Dutch, whose national color is orange. Arriving back in Turkey after her deportation, the Turkish family minister, Fatma Betul Sayan Kaya, accused the Netherlands of hypocrisy for claiming to stand up for human rights while restricting her own. “We faced a very inhumane, unethical treatment,” she said at Istanbul’s main airport, according to Anadolu Agency, a   news wire. “We had a really very painful night in Holland, which talks about democracy, freedoms, freedom of speech. ” In addition to targeting wavering members of Mr. Erdogan’s own party, some analysts said the Turkish government’s movements in Europe were particularly aimed at supporters of the country’s largest nationalist movement, the Nationalist Movement Party, which is known in Turkey as the M. H. P. The M. H. P. has traditionally been wary of Mr. Erdogan, but its leadership now supports giving him more power, in the private expectation that its own cadres will subsequently be rewarded with more influence. While an estimated three million German residents are of Turkish origin, as well as about 400, 000 Dutch residents, the number of people in Germany and the Netherlands who are eligible to vote in the Turkish elections is far lower, said Alexander Clarkson, a specialist on the Turkish diaspora at King’s College London. Mr. Erdogan’s recent gestures were therefore primarily targeted at the M. H. P. ’s rank and file in Turkey, many of whom are skeptical of their leadership’s alliance with Mr. Erdogan, Mr. Clarkson said. “The audience isn’t really the diaspora the audience is at home,” Mr. Clarkson said of the government’s stance toward the Netherlands and Germany. The heated language helps achieve this goal, Mr. Clarkson said, since “it enables Erdogan and the A. K. P. to say: We are out there protecting the rights of Turks abroad. ” The A. K. P. is an acronym for Mr. Erdogan’s group, the Justice and Development Party. Mr. Erdogan was accused of hypocrisy for criticizing Europe’s perceived authoritarianism while overseeing a sweeping crackdown on dissent in his country. Since a failed coup in July, Mr. Erdogan’s government has ruled mostly by decree, allowing it to suspend or fire more than 120, 000 government employees, and arrest an estimated 45, 000 people suspected of being dissidents or rebels. The detainees come from a broad section of public life and include soldiers, police officers, teachers, judges, academics, journalists and lawmakers. “He is the president of a country,” Mr. Candar said of Mr. Erdogan, “where more than 150 journalists,   writers, columnists, opinion makers are in prison. And the leaders of the   caucus in the Turkish Parliament”  —   as well as 12 other members of Parliament who belong to it  —   “are also in prison. ” Turkey, Mr. Candar argued, “has transformed into a republic of fear. ”'"}, "time": 1742561701.8714185}