{"duration": 0.010391950607299805, "input_args": {"text": "'Hafiz Saeed and Geelani to dress up as mime artists on Ravish Kumar’s show in solidarity with NDTV Posted on Tweet \\nNotwithstanding the I&B ministry’s decision to stay its decision to black out NDTV for a day for revealing sensitive information during counter-terror operations in Pathankot (and Kargil and 26/11), fans of NDTV continue to emerge in support of the channel. \\nFollowing journalist Ravish Kumar creative show featuring mime artists, presumably representing a silent protest against the government’s decision, NDTV found two unlikely but perhaps not so unlikely allies in Syed Ali Shah Geelani and Hafiz Saeed. The separatist and the terrorist have announced their decision to participate in Ravish Kumar’s show as mime artists. \\n“Nobody has done more for the Kashmir freedom struggle than Barkha Dutt ji,” raved Geelani to our correspondent. “I know that I am recognized as the leader of Kashmiri freedom, but truth be told, my commitment to the cause pales in comparison to Barkha ji’s. She used her brilliance and blamed terrorism in the valley on the rise of hindutva in India! She has highlighted a plan of blaming the burning of schools on Diwali crackers. She is a true Kashmiri patriot. Just as Jinnah is the Father of the Nation in Pakistan, we hope to make Barkha ji the Mother of the Nation when we’ll get our freedom. The least I can do is show solidarity with NDTV. I will dress as a mime artist on Ravish’s next show,” said Geelani before excusing himself to practice miming for the show. \\nHafiz Saeed was harder to track down. But our stringers in Pakistan reported that the 26/11 mastermind had been inconsolable ever since the government announced its decision to ban NDTV for a day and had spent an entire day binge watching ‘The Buck Stops Here’ with teary eyes. When the tears dried up, he sprang to his feet, yelled “Yeh sab RAW ne kiya hai!” and decided to join the battle for Freedom Of Expression by joining Ravish’s show as a mime artist. \\nIn other news, Arun Jaitley was spotted creating several Bot accounts on Twitter and retweeting Barkha Dutt’s tweets. \\n(Reported by Citizen Satirist Natasha )'"}, "time": 1742628561.369222}