{"duration": 0.09873104095458984, "input_args": {"text": "'Wed, 26 Oct 2016 18:02 UTC © nsnbc international Serena Shim, American journalist October 19 marks two years since the very sudden and suspicious death of American journalist Serena Shim near Suruç, Turkey, close to the Syrian border. Although all signs point to foul play, indeed murder, by Turkish intelligence, until now the US government has neither conducted nor demanded an inquiry into the events of the alleged car accident which Turkish officials say was the cause of Shim\\'s death, let alone offer condolences to the family. Serena Shim was at the time reporting on Ayn al-Arab (Kobani), from the Turkish side. She was, in her own words, one of the first, if not the first, on the ground to report on ,\"Takfiri militants going in through the Turkish border\". These include not only ISIS but also terrorists from the so-called Free Syrian Army (FSA). As Shim\\'s sister Fatmeh Shim stated in 2015 , \"She caught them bringing in ISIS high-ranked members into Syria from Turkey into camps, which are supposed to be Syrian refugee camps.\" Serena Shim\\'s January 2013 expose , Turkey\\'s Pivotal Role in Syria\\'s Insurgency: PressTV Report from Inside Turkey, showed footage of what she estimated to be 300 semi-trucks \"awaiting militants to empty them out\"; included testimony explaining how Turkey enables the crossing of foreign terrorists \"freely\" into Syria; spoke of the funneling of arms via the Incirlik US Air Base in Turkey to terrorists in refugee camps or on through to Syria; and highlighted the issue of terrorist training camps portrayed as refugee camps, guarded by the Turkish military. Shim named the World Food Organization as one of the NGOs whose trucks were being used to funnel terrorists\\' arms into Syria, and stated this in her last interview, just one day before being killed. Notably, in that interview she also explicitly stated that she feared for her life because Turkish intelligence had accused her of being a spy. She told Press TV: \"Turkey has been labeled by Reporters Without Borders as the largest prison for journalists, so I am a bit frightened about what they might use against me... I\\'m hoping that nothing is going to happen, that it\\'s going to blow over. I would assume that they are going to take me in for questioning, and the next hope is that my lawyer is good enough to get me out as soon as possible.\" Two days later, Press TV announced her death , stating: \"Serena was killed in a reported car accident when she was returning from a report scene in the city of Suruch in Turkey\\'s Urfa province. She was going back to her hotel in Urfa when their car collided with a heavy vehicle.\" This was the official version of her death, although in subsequent versions the story changed. In a report one month later, Russia Today (RT) spoke with Shim\\'s sister, who said: \"There\\'s so many different stories. The first was that Serena\\'s car was hit by a heavy vehicle, who proceeded to keep on driving. They could not find the vehicle nor could they find the driver. Two days later, surprisingly, they had found the vehicle and the driver, and had pictures of the heavy vehicle hitting my sister\\'s car. Every day coming out with new pictures of different degrees of damages that have happened to the car.\" \"Serena and my cousin who was the driver of the car were taken to two different hospitals. She was reported first dead at the scene. Then coming out with later reports that she passed away at the hospital 30 minutes later from heart failure?! \" POLITICAL BLACKOUT, MEDIA BLACKOUT When on November 20, 2014, at a Daily Press Briefing, RT journalist Gayane Chichakyan twice pressed Director of Press Office, Jeff Rathke, for updates on Shim\\'s death, he unsurprisingly gave none: Chichakyan: \"It\\'s about the journalist Serena Shim, who died in Turkey under very suspicious circumstances. Did her death raise suspicions here at the State Department?\" Rathke: \"Well, I think we\\'ve spoken to this in the briefing room several weeks ago, after it happened. I don\\'t have anything to add to what the spokesperson said at the time, though.\" Chichakyan: \"But then she died several days after she claimed she had been threatened by the Turkish intelligence. Have you inquired about this? Have you asked questions? Is there really nothing new about this?\" Rathke: \"Well, I just don\\'t have any update to share with you. Again, this was raised shortly after her death. The spokesperson addressed it. I don\\'t have an update to share with you at this time.\" Chichakyan: \"I just want to go back to Serena Shim. You rightly said the State Department commented on her death several weeks ago, and you say there is no update. Why is there no update? A U.S. citizen dies days after she said she\\'d been threatened by the Turkish intelligence.\" Rathke: \"Well, I simply don\\'t have any information to share at this time. I\\'m happy to check and see if there\\'s anything additional. We spoke out about it, as I said, at the very start several weeks ago after her death, so I - but I don\\'t have anything with me right now to offer. I\\'m happy to check and see if there\\'s more that we can share.\" Of course, neither he nor any US government official has followed up . Last year, Shim\\'s mother, Judy Poe, replied to me in a message: \"There is no doubt in my mind that my daughter did not die in a car accident. There was not one single scratch on her there was no blood absolutely anywhere. I have tried to contact the American Embassy in Turkey with the cell phone numbers they gave me originally when I was going to get my daughter. Absolutely no response from the American Embassy in Turkey, including via personal cell phones.\" Shim\\'s sister in her RT interview stated, \"We\\'ve got no support whatsoever, nor have we got condolences.\" None of the major journalist organizations have pursued a just investigation into Shim\\'s murder, much less lamented it. The Committee to Protect Journalists (CPJ) turns up zero results when Shim\\'s name is searched on their website . Yet, the CPJ does have a list of journalists killed in Turkey since 1992, and as recent as Feb 2016, obviously minus Shim\\'s name. Likewise, a search on the Reporters Without Borders website turns up zero results . A December 19, 2014 article at the Greanville Post does have a CPJ spokesperson stating: \"The Committee to Protect Journalists has investigated the events surrounding Serena Shim\\'s death in Turkey and at this time has found no evidence to indicate that her death was anything other than a tragic accident. Unless her death is confirmed to be in direct relation to her work as a journalist, it will not appear on our database. In the event that new evidence comes to light, CPJ would review her case.\" The article Greanville Post notes, \"As of February 2016, the CPJ has not changed its position.\" The International Federation of Journalists does have a short entry on Shim: \"Serena Shim, the female correspondent for Press TV in Turkey was killed in a car accident on the Turkish-Syrian border. She was returning from an assignment in Suruç, a rural district of Şanlıurfa Province of Turkey when her car collided with a truck.\" But no call for inquiry and no questioning of official narrative. In a November 21, 2014 article at Shim\\'s death, RT noted that, \"the office of the Representative on Freedom of the Media at the OSCE told RT that Turkey is carrying out an investigation.\" It cited OSCE Representative on Freedom of the Media, Gunnar Vrang, as saying: \"The representative has been following the case since the first reports appeared about the car accident that claimed the life of journalist Serena Shim. According to information available to her office, the Turkish authorities have started investigation into the details of the car accident.\" Searching the OSCE for Serena Shim\\'s name also results in zero hits. On February 5, 2016, Judy Poe tweeted: Clearly the representative went with the Turkish rendition of events. Few in corporate media have looked into Shim\\'s suspicious death. In one surprising exception, Fox News reported on Shim\\'s death, citing a US State Department spokesperson as saying the State Department \"does not conduct investigations into deaths overseas.\" Given that Turkish intelligence threatened Shim, according to her testimony, and that Turkey is notorious world-wide for its imprisonment and murder of journalists, the US State Department\\'s lack of concern is incriminating in itself. In stark contrast to the silence around Shim\\'s death, John Kerry at least twice publicly mourned the death of James Foley, lauding as a hero the journalist who snuck into Syria via Turkey to report embedded with al-Qaeda and other terrorists, and giving sincere condolences to his family. Without a trace of irony, in August 2014, Kerry said of Foley , and never of Shim, \"We honor the courage and pray for the safety of all those who risk their lives to discover the truth where it is needed most.\" In September, 2014, Kerry directly contradicted the above-mentioned words of the State Department spokesperson, saying: \"When terrorists anywhere around the world have murdered our citizens, the United States held them accountable, no matter how long it took. And those who have murdered James Foley and Steven Sotloff in Syria should know that the United States will hold them accountable too, no matter how long it takes.\" On the media and political blackout around Serena Shim\\'s suspicious death, Shim\\'s former colleague, Afshin Rattansi, host of RT\\'s Going Underground posited: \"There were a few press reports, but nothing like the kind of reporting about a brave young journalist that one would expect. Was this because the story she was covering was so dangerous that a NATO ally like Turkey should be cooperating with ISIS... was that the reason that this story has not been more widely broadcast? We don\\'t know.\" Indeed, this would not be the first time the US administration has not pursued justice for the murder of one of its citizens by an ally. Rachie Corrie\\'s March 16, 2013 murder by an Israeli soldier driving a bulldozer was not only witnessed by numerous rights activists with Corrie in Rafah, occupied Palestine, but was filmed. There is no denial that the Israeli soldier saw Corrie, drove his dozer over her and then reversed back, crushing her twice. Yet, in spite of the efforts of her family and supporters, the US has never pursued justice for this American citizen either. Judy Poe said that Serena\\'s favourite motto was: \"I\\'d rather die on my feet than live on my knees.\" Shim lived the motto. She was 29, with two children, when killed. Eva Bartlett is an independent writer and rights activist with extensive experience in Syria and in the Gaza Strip, where she lived a cumulative three years (from late 2008 to early 2013). She documented the 2008/9 and 2012 Israeli war crimes and attacks on Gaza while riding in ambulances and reporting from hospitals. From June-August 2016, she visited Syria for her fifth time. Her writings can be found on her blog, In Gaza (www.ingaza.wordpress.com) Comment: It seems evident Shim was too close to revealing the true situation and the players involved. It is a tragedy that the price was her life.'"}, "time": 1742628598.1971157}