{"duration": 0.14063405990600586, "input_args": {"text": "'Dr. Sebastian Gorka, deputy adviser to President Trump and former Breitbart News national security editor, echoed President Trump’s denunciation of the “witch hunt” against Attorney General Jeff Sessions on Friday’s Breitbart News Daily. [“The Democrats have lost touch with reality,” he said. “It’s not just fake news. It’s very fake news. The whole Russia story is a   the Democrats cannot cope with, and their facilitators in the mainstream media, simply, psychologically, cannot cope with the reality that the American people didn’t choose Hillary Clinton. ”   Gorka said they were using this “  of ties to Russia” as a “coping mechanism. ” “The fact that it’s the last administration that had the most disturbing ties to Russia  —   that’s what the newspapers should be reporting,” he said. SiriusXM host Alex Marlow noted that Gorka produced an extensive body of work for Breitbart News that was very far from “ . ” He worried that fake news stories about Russia controlling the Trump administration could interfere with the war against global jihadism, in which Russia is clearly a significant player, no matter what one thinks of the Putin regime. “I think that there are probably people, constituencies, forces that would like that to happen, but I can assure you, it will never happen,” Gorka replied. “I have to go back to the man who is the   . There was, if you recall, I think it was his last press conference from Trump Tower when he turned the ground floor into a giant press conference facility. In the QA, they asked him bluntly, one of the reporters said, ‘So what about your links to Vladimir Putin? What about relations in the future with Moscow?’ And the president was unequivocal. He said, ‘Look, I’d like to be able to have good relations with Putin and the Kremlin. It doesn’t really look very likely, and if that’s the case, so be it. ’”  “We are pragmatists. We’re not ideologues,” he declared. “My friend Monica Crowley said something very, very important: Our president must be understood as not an ideological candidate, our future president is an attitudinal one. That’s the important thing to understand. That attitude is about making America great again. That’s all we care about: national security and returning America to a place of leadership. The fake news will not be allowed to distort our understanding of the U. S. national interest and how we’re going to realize that for all Americans, whatever newspapers they read, Alex. ” Marlow asked which top priorities the White House feels are not receiving the coverage they deserve because the media is so busy with fake news attacks. “I think that the biggest ones remain the two versions of the Caliphate,” Gorka replied. “I love to quote the line that Bibi Netanyahu used in front of Congress where he said, ‘If you want to understand the Middle East, the chaos in the world today, it’s basically a Game of Thrones for who’s going to control and have the crown of the Caliphate. ’” “We focus on ISIS. We will obliterate ISIS, as the president said in his joint address. But there’s another version of the Caliphate, and that’s the Iranian version that they’ve been exporting, their theocratic version of the Caliphate that they’ve been exporting since 1979. That’s a very, very serious threat  —   especially if you look at how the last administration empowered Iran through billions of dollars, through the JCPOA, the Iran deal, and the threat of a nuclear Iran,” he said. “On top of that, there’s a subtler one, and that’s what has happened to the armed forces of America under the last eight years  —   the underfunding, the being thinly stretched, the operational tempo especially of our Tier 1 units,” he continued. “We are going to rebuild the military because if you don’t have strength, you can’t have peace. ” Marlow asked about reports that Iran is preparing for a weapons “shopping spree” after existing U. N. resolutions expires. “This is just another example of the ticking deadlines expiring on certain limits to what Iran can do,” Gorka said. “Here we have not quite a sanction, but it is a moratorium that will expire and allow the mullahs to access the technologies that they haven’t been able to do before. If you compare this to how they responded to the lifting of U. S. sanctions recently, or sanction measures  —   unfortunately, these things are all done in the expectation that there will be better behavior afterwards from Tehran, and in every single case, we’ve seen exactly the opposite. ”  “We release the billions. We pay the ransoms. The pallets of cash are shipped over to Iran. What happens? Our naval vessels are harassed. There’s a ballistic missile test. Our friends are fired upon,” he said.  “So again, the most important thing to understand here is not the idealistic attitudes of the multilateral institutions it’s that there are nations out there  —   Iran included  —   that are fundamentally    powers, who do not share the same interests of America and her allies, who need to start toeing the line, and that’s why they were put on notice. We need to see better behavior out of Tehran before any similar measures are implemented, either multilaterally or unilaterally,” he declared. Marlow cited another recent report that suggested the Obama administration moved data from the investigation of alleged ties between the Trump campaign and Russian government to a lower level of classification, to facilitate “easier sharing. ” He called this revelation “troubling and strange. ” “Well, it looks quite transparent,” Gorka said. “Just a matter of days before the Trump administration took control, there was a decision made inside the White House that certain special types of intelligence, certain types of signals intelligence, certain types of intelligence related to Russia could be promulgated, could be shared across the whole intelligence community in ways that had never been possible before. The reasoning for that is very, very hard to determine, unless there was some kind of political motivation. ” “Why, days before we come into office, after dozens and dozens of fake news reports about potential connections to Russia, would we wish to downgrade this information and make it more shareable across the intelligence community  —   unless you’re hoping that somehow it will leak and be used for political purposes?” he asked.  “If you want to have an investigation on Russia, don’t look at AG Sessions look at the Obama administration’s decisions to do things like this,” he suggested, “because it smacks of a very, very dangerous thing: the politicization of intelligence. ” Marlow applauded the Trump White House’s firm stand with the United Nations, most recently with a   demand for the Human Rights Council to end its “obsession with Israel. ” “We try to keep our promises,” Gorka said. “I think you’ll agree that the last six weeks have produced what in other administrations would have taken six months. ” He counted “dealing with the attitude of multilateral organizations like the U. N. ” as one of those rapid accomplishments. “We want to cooperate if it’s in the interests of the United States, but the constant bashing and the ideologically driven actions of individual states and states coming together in various committees of organizations like the United Nations to hammer again and again and again our closest ally in the Middle East is just unacceptable. It’s simply unacceptable,” Gorka stressed. “We have, as the president has said, an unbreakable bond with Israel, and the idea that they are in the crosshairs of the U. N. repeatedly, when around them you see true human rights abuses happening on a massive scale that the U. N. somehow forgets or doesn’t see  —   if you wish to see American leadership in the world again, assisting the United Nations to do the good that it was originally meant to do, then these kinds of, again, politically motivated attacks must decrease and hopefully stop,” he insisted. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742563404.3361046}