{"duration": 0.903292179107666, "input_args": {"text": "'The List Of Establishment Republicans That Say They Are Voting For Hillary Clinton Is Staggering By Michael Snyder, on August 1st, 2016 \\nWho would have ever believed that so many big names in the Republican Party would publicly pledge to vote for Hillary Clinton in the 2016 election? All throughout the primaries and the caucuses, the Republican establishment expressed tremendous disdain for Donald Trump, but they were unable to derail his march to the nomination. Now that we have reached the general election, some of the biggest names in the GOP are actually taking the unprecedented step of crossing over to the other side and are publicly announcing their support for Hillary Clinton. This shows that many of these individuals were only “Republicans in name only” to begin with, and it also demonstrates the lengths that the elite are willing to go to in order to keep Donald Trump out of the White House. \\nOne of the latest big Republican names to publicly support Hillary Clinton is Sally Bradshaw. CNN is describing her as “Jeb Bush’s top adviser”, and she has gone so far as to completely remove herself from the Republican Party because of Donald Trump… \\nJeb Bush’s top adviser, Sally Bradshaw, has left the Republican Party to become an independent, and says if the presidential race in Florida is close, she’ll vote for Hillary Clinton. \\nBradshaw, who’s been close to the former Florida governor for decades and was senior adviser to his 2016 campaign, officially switched her registration to unaffiliated. She told CNN’s Jamie Gangel in an email interview that the GOP is “at a crossroads and have nominated a total narcissist — a misogynist — a bigot.” \\n“This is a time when country has to take priority over political parties. Donald Trump cannot be elected president,” Bradshaw said. \\nBradshaw has been working for the Bushes ever since the 1988 presidential campaign, and she never would have made such a bold move without the approval of the Bushes. \\nNeedless to say, the Bushes absolutely hate Trump, and they have a vested interest in seeing him lose the election. There are some that believe that Jeb Bush is already lining up for another run in 2020, and Donald Trump has to lose in order for that to be possible. \\nIn addition to Sally Bradshaw, another prominent friend of the Bush family has also recently announced that he is going to be voting for Hillary Clinton. Former U.S. Treasury Secretary Henry Paulson was at the center of the storm during the financial crisis of 2008, and not too long ago he announced his intentions in the Washington Post … \\n“ When it comes to the presidency, I will not vote for Donald Trump ,” Paulson wrote in The Washington Post last week . “I will not cast a write-in vote. I’ll be voting for Hillary Clinton , with the hope that she can bring Americans together to do the things necessary to strengthen our economy, our environment and our place in the world. To my Republican friends: I know I’m not alone.” \\nDoes Henry Paulson actually believe that Hillary Clinton can “bring Americans together to do the things necessary to strengthen our economy, our environment and our place in the world”? \\nI find that difficult to believe. \\nBut apparently he intends to try to persuade as many of his fellow Republicans as possible to vote for Hillary Clinton, and a whole bunch of other establishment Republicans have already lined up behind her. \\nThese are just some of the big Republican names that the Washington Post says have already committed to voting for Hillary Clinton… \\nRichard Armitage , deputy secretary of state and adviser to Ronald Reagan and George H.W. Bush \\nBrent Scowcroft , chairman of the President’s Intelligence Advisory Board and adviser to three previous GOP presidents \\nAlan Steinberg , regional EPA administrator \\nKori Schake , National Security Council and State Department aide \\nDoug Elmets , former Reagan spokesman \\nJim Cicconi , former Reagan and George H.W. Bush aide \\nCharles Fried , former U.S. solicitor general under Reagan \\nRobert Kagan , a senior fellow at the Brookings Institution, former Reagan State Department aide and adviser to the presidential campaigns of John McCain and Mitt Romney \\nMax Boot , senior fellow at the Council on Foreign Relations and adviser to GOP presidential candidates \\nPeter Mansoor , retired Army colonel and former aide to David Petraeus \\nLarry Pressler , former three-term Republican senator from South Dakota \\nArne Carlson , a former two-term Republican governor of Minnesota \\nRobert Smith , former judge on New York’s highest court, the Court of Appeals \\nMark Salter , former top adviser to John McCain \\nMike Treiser , former Mitt Romney aide \\nBen Howe , editor at RedState.com \\nAs I have said all along, the establishment will do whatever it has to do to keep Donald Trump out of the White House. \\nIf that means voting for Hillary Clinton and encouraging others to do the same, that is precisely what they are going to do. \\nAnd if more insidious means are necessary, the establishment definitely has plenty of tricks up their sleeves. Politics in America is a very, very dirty game, and if you have ever been deep inside a national campaign you know exactly what I am talking about. \\nAt this point, even Donald Trump is raising concerns about the integrity of the upcoming election. On Monday, he told a rally in Ohio that he is “afraid the election is going to be rigged” … \\nDonald Trump said he’s afraid the general election in November will be rigged, but didn’t elaborate on the comment at a rally in Ohio Monday afternoon. \\n“ I’m afraid the election is going to be rigged, I have to be honest ,” the Republican nominee for president said, in remarks that did not mention the controversy generated by his comments about the parents of a slain U.S. soldier. \\nIn my opinion, Donald Trump has legitimate reasons to be concerned. We have already seen the elite spend millions upon millions of dollars to try to defeat him, and virtually all of the big money on Wall Street is lining up behind his opponent. Many patriotic, conservative and faith-oriented Americans are really hoping that Trump can win and move this nation in a positive direction, but the truth is that he is facing overwhelming odds. \\nUltimately, it is probably not going to matter too much who wins this election, because America is on the verge of a time of chaos unlike anything we have ever seen before. No matter who the next president is, we are going to see civil unrest, rising crime, political scandals, governmental shaking, major economic and financial problems, and geopolitical events will continue to spiral out of control. \\nAnd the establishment is going to do everything it possibly can to make sure that the next president is not Donald Trump. If you go to just about any major news website on the Internet these days, there will be a negative story about Donald Trump featured very prominently, and it is usually accompanied by some sort of positive story about Hillary Clinton. \\nIn the end, one of the biggest stories that will come out of the 2016 election will be the fact that the American people got to see how far the elite are willing to go to keep someone that is not “in the club” from becoming president. \\nThe establishment absolutely loathes Trump, and they are willing to move heaven and earth to try to stop him. \\nHold on tight, because the next three months are going to be very, very interesting. \\nIt is nice to see people are standing behind the candidate that won. Not! \\nI am not surprised. Liars, Liars, Pants on fire. \\nEveryone of them probably pledged to support the candidate that got the nomination. Now they are going against him because he is so crude? You renege on your word and you are nothing. Because your word is like a contract. No one wants to deal with liars. Hilliary also has a reputation and it isn’t good about lying. I suggest that is what will make or break the candidate going for election. Whether or not they are publicly lying or not. Tatiana Covington \\nThey’re scared to death! greanfinisher . \\nI really don’t blame them as he gives me the creeps too. P>Hopkins \\nWhy? greanfinisher . \\nThe man is unstable, unpredictable and impresses me as being an immature delinquent inside a man’s body. Imagine imploring the Russians to divulge whatever information that they gathered concerning the Clinton e-mails. Even before that, there was the episode in which his campaign manager man- handled a female reporter, and left gouge marks in her arm. Even during his rants and raves, he succeeded in not only alienating the women, but the minorities as well. It’s no small wonder then why the GOP is simply tossing the man overboard, and throwing their weight behind the ol’ bag. P>Hopkins \\nSo you are a shrill for the drive-by media and willfully regurgitate their talking points with no regard for facts. Got it. If my brain worked like yours, I’d be anti-Trump too. Thankfully, it doesn’t greanfinisher . \\nI’m not sure that I would trust Donald Trump with the nation’s nuclear codes, and that’s partly what would give me the shivers. P>Hopkins \\nNo patriot could vote for an anti-American candidate like Hillary. But whatever dude. greanfinisher . \\nI didn’t imply that I would vote for the gun confiscatin’ hag. Do you think that I’m that stupid? Janet Hall \\nyou want more war then vote for Hillary Mad Dawgg \\nBut you would trust Hillary who couldn’t even save our representatives in Benghazi? I would vote for Mickey Mouse before her. greanfinisher . \\nI wouldn’t that gun confiscatin’ racketeer for nothing. GV \\nif you want more war then vote for Hillary Guest’s the Name \\nIf anyone has regard for facts, then they simply cannot vote pro-Trump. Clinton is no prize by any stretch of the imagination, but she’s light years ahead of Donald when it comes to honesty… and YES, I realize that she’s seen as the ultimate liar. But Donald has consistently lied so, so very much more. And he’s made a name in politics solely by taunting and bullying. \\nI tried so hard to stay with him, to vote party line rather than personality, but the whole juvenile “Little Marco” garbage was just unacceptable, and he’s only become more and more childish and bratty since then. You don’t reward bratty, childish, talentless hacks by voting for them, even IF they claim to be the party you’ve supported your whole life. P>Hopkins \\nParty is irrelevant. You are seriously comfortable with Hillary putting up to 5 people on the SCOTUS? And if you honestly believe that Hillary is more honest than Trump, then you need an intervention to stop your addiction to the crack sold by the media and the left. Because you are obviously smoking it. All of that being said, you are one of those people that will believe what you want to believe regardless of any facts that could be presented. Its a shame that Americans have become so brain dead. GV \\nhow many people has Trump murdered? \\nhow many people has Hillary the war criminal murdered? Janet Hall \\nWell, your reply to Mr groanfisher was far more polite than mine. We’ll stick with yours. Well said. loadnup \\nYou won’t accept this but the gop is tossing him because he will disrupt their gravy train and the truth is his “rants and raves” are pointing out what the hitlery has done, is capable of and will do if elected. I love the article I read where President Trump said she even lies when she lies… pray, prep and protect. greanfinisher . \\nThey’re tossing him primarily because the man simply will not work with anyone, and certainly not with Congress. iris \\nThere are so few in Congress who have enough spine to merit being worked with at all. Maybe he would shake them away from their country clubs for an afternoon or two. iris \\nWhat’s outrageously funny, is that the crud the establishment GOP has been pulling for decades, while systematically selling out their constituency and what Republicans are supposed to stand for, is, that’s what drove folks to Trump in the first place, and now, they think people are that gullible to buy more of the same, with their MSM smear tactics. Every time they pay (heck, maybe they don’t pay a dime) for some tabloid-looking ad against Trump, it confirms what has been going on for far too long, and strengthens the resolve of his supporters. Guest’s the Name \\nThe veterans are also abandoning him. \\nHe blatantly lied about donating huge sums of $$ to them, he has repeatedly insulted the service of many veterans (including John McCain, who is too kind and good to even denounce that awful Trump). \\nThere is only one demographic in favor of Donald, the angry, uneducated white man. greanfinisher . \\nThose in the oligarchy typically donate nothing destined for the public good. Rather, virtually all of them have set up the so-called ‘foundations’ which are used primarily for money laundering and tax avoidance purposes. The Clinton Foundation is a prime example of such. Yes, all of these foundations are required by law to donate a certain percentage to charity, but it’s paltry compared to the disproportionate monetary gains involved. Even worse, the donations are mostly directed towards .operas, art museums, symphonies, and theaters – where they spend their leisure time fraternizing with other wealthy benefactors. In addition, some donations are routed towards elite prep schools and Ivy League universities (such as Yale, Princeton, Harvard) which do not have a reputation for educating poor young people. Whatever amount of sugar coating that may be applied, those are obviously not charities as most people understand the term. iris \\nI disagree. He wouldn’t be my first choice, but I’m fairly educated and know plenty of other educated people, who don’t want another blatantly liberal politician in the office. At least there’s a possibility that Trump won’t further what’s been destroying our country for decades, literally. 58 million innocent citizens, is one good example. iris \\nWell, they have a much better chance at fair treatment from him than her. Dems are most often the party which gets us into war, and the party which strengthens, respects and provides for the military, has been the Republicans. Tobby99 \\nYou are right. Bush was a Democrat. Muhahahahahahahaha. P>Hopkins \\nMcCain is an establishment RINO. THAT’S why he is opposed to Trump. The veterans and active duty people are not abandoning him at all. Don’t use McCain as the standard-bearer for veterans. And I find it real funny when people like you parrot what the left wing media and eRINOs say about Trump supporters. I have news for you…education doesn’t mean a damn thing when its indoctrination GV \\ninsane McCain GV \\n“…Imagine imploring the Russians to divulge whatever information that they presumably gathered from the Clinton e-mails….” \\nyou mean the 30,000 emails Hillary deleted because they were evidence of her crimes? \\ndon’t worry, LOTS of countries have copies of the emails of the unindicted criminal UncleMike Davis \\nAnd Donald J Trump has driven them all out of their dens, their lairs, caves, holes, from under rocks, and exposed the corrupt establishment to all Americans, all the world; those with eyes wide open. It seems their end is near, as both corrupt establishment parties self-destruct, dragging down the New World Order, Babylon the Great of Revelation 18, the Rothschilds with all their demons, into their well deserved end. \\nThank you Donald J Trump. May Almighty GOD, the Lord JESUS Christ, bless you and your family, and bless your intentions to Make America Great Again. greanfinisher . \\nI figured some time ago that the Republican hierarchy was going to desert Trump while supporting Clinton. Heck, some prominent Republican figures are even actively campaigning for the gun confiscatin’ witch. I’ll have to readily admit that Trump scares me too as he seems to be a loose cannon. loadnup \\nNot to even mention her promise to significantly increase taxes… yep, it’s gonna be an interesting time we worthless eaters are heading into… pray, prep and protect. winrob \\nOriental “blessing” (?): May you live in interesting times. greanfinisher . \\nDon’t you think I know that? With the reign of terror that the gun confiscatin’ witch is almost certainly going to brew up, it’ll even make the Obama tyranny look good. stop Hitlery \\nHere’s how the gun confiscation will probably go: People keep expecting the gun confiscation to be an above board program where police go door to door removing guns from homes. They think martial law will be announced on the evening news with troops rolling into town and setting up on street corners. Those days are long gone and they just don’t work that way anymore. When it happens (as in NOW) it will be low profile, subtle and in stages to avoid the backlash (which everyone is waiting to see overt evidence before they fight back). Martial law won’t be declared but will be activated, most likely under an innocent sounding name. Evacuating people to “shelters” will be the ruse to imprisoning the masses. Gun confiscation will be silent and also under the guise of something else but the unstated purpose will be gun confiscation. That’s how they operate which is why they can say things like “Nobody said they want to round up ALL the guns (sure they will leave us with a few .22 cal rifles)”. Mass vaccinations would be a good one or an outbreak where large numbers of people will have to be quarantined. They definitely will not be doing things like this in a way that would trigger a mass response so you can forget waiting for them to signal the roundup is about to begin. greanfinisher . \\nObviously the gun confiscatin’ cronies are beginning the ruse now. At the moment, those on the ‘proposed’ ineligibility list for firearms are those with troubled dating, family problems, those on any prescription, veterans, Social Security recipients, those on the so-called ‘terror list’ (that should cover a cool 100 million people—-or more), those suffering depression (and whatever else they can dream up), etc.etc.etc. Guest’s the Name \\nHey, this site doesn’t believe in psychic visions. Unless you have any intelligence to back up your scary little predictions, go peddle it on the astrology websites. GV \\nsays the Hillary troll AmberRheum \\nThey’ll condition obtaining healthcare coverage on the handover of weapons, because, y’see, gun possession is a health “risk factor” for you and your family. Besides, it’s an indicator of mental-health issues, isn’t it? And healthcare coverage is now mandatory! Instead of resistance, many gun owners will hurry to the buyback centers. UncleMike Davis \\nTrump has not alienated one single intelligent patriotic woman that I am aware of; certainly not in my family. Those women “alienated”are feminist progressive communists already in the Hillary camp, and would never switch from evil for any reason. \\nThere are a lot of women posting on the Trump pages that see right through the propaganda; actually a lot on the Hillary pages too. greanfinisher . \\nI think that he may have alienated some women today at a campaign rally in Virginia when he told one woman to take her crying baby out. Guest’s the Name \\nNo, he has indeed alienated many such women. The Republican party used to BE the party of family, home, and peacefulness — i.e., a woman’s ideal political party. \\nBut the Alt-Right has taken over it, and popularized Donald, the vile, foulmouthed, anti-woman, pervert who fondles his daughter in a way I would throw some guy out my window if he touched MY daughter in such a way. He’s a class A moron (without any class). HE has voted Democrat more times than anyone on this site! HE is still a Democrat, whereas Clinton’s biggest Dem detractors are caller HER a NeoConservative because of her seemingly right-leaning agendas for the last couple decades. GV \\nhow many immoral wars has Hillary advocated for? \\nIraq, Libya, Syria, Ukraine, etc. K \\nNo surprise here. I have been saying for a long time, no real difference between the parties. These people are corrupt individuals, and always prefer the status quo. They have become rich off the schemes, and manipulations. So no question the corruption will continue under Hillary. Thus their support. People like this would support Hitler, as long as the pay was good. Oh, forgot Prescott Bush, did actually support Hitler. Money is all that matters to them. jaxon64 \\nHillary is the ultimate wall street/ military industrial complex, establishment candidate. You really can’t get more establishment than Hillary. As a side note–ANY and EVERY Sanders supporter who supports Hillary is the ultimate hypocrite–no excuses accepted. Guest’s the Name \\nNo, all Sanders’ supporters from the start lived and breathed the platform of “Anyone But Trump”, so it’s no wonder that nearly 90% of his supporters have publicly pledged all support to HRC. \\nAll that they care about now is keeping the lying, cheating, orange buffoon OUT of the White House. Heck, when even ESTABLISHMENT GOPers are publicly denouncing the GOP candidate, you gotta know your GOP candidate blows. GV \\n“…so it’s no wonder that nearly 90% of his supporters have publicly pledged all support to HRC…..” \\nr ght krinks \\nWith every passing day I come more and more to the conclusion that the Republican Party is and always has been the party of the rich. I always thought this notion was FDR propaganda, until now. Only the Rich are upset at Donald who will deport their cheap labor and tax their cheap products made with third world slaves. \\nDon’t worry though. In order for The Donald to win it will take a public not susceptible to the avalanche of Donald Hate sure to come his way. Fat chance of that. The Public are by and large gullible, illiterate morons. One point that proves this. All of the polls point to Hillary with a slight lead. How can this be? The Donald has a much higher percentage of Republican vote than Hillary has of Democrat votes (The hard core Bernites won’t vote for her. Did you see the half empty arena last week and the ads for paid seat fillers to go with the White Noise Machines to drown out the boos?). The Donald leads with Independents nearly 2 to 1. How do these numbers add up? Of course they don’t and yet the public is too stupid to figure the polling scam out and be outraged. jaxon64 \\nAgreed–especially about fear of losing their cheap labor from illegals here and cheap labor for their corporations by off-shoring jobs. The Donald hate is so prevalent it is ridiculous. Just this morning before 8 AM I saw revolving hate ads against Trump when I turned on Roku/Pandora for some morning music–one pop-up ad despicably talking about old, nude photos of Ivana Trump. Then I check my yahoo email account and the entire background of the sign-in screen is an anti-Trump “I’m with Her” ad. It’s going to take a strong and knowledgable mind to withstand the billion dollar Hillary/Wall Street assault on Trump-and I don’t think the average American is that aware of the manipulation and propaganda they are being assailed with. krinks \\nHe could circumvent all of this by keeping illegal immigration and Off Shoring on the menu every time he speaks. This issue is one that majority agrees with even about 1/3 of Democrats. What the hell happened to the party of Big Labor that having more labor is a bad thing? krinks \\nHe could circumvent all of this by keeping illegal immigration and Off Shoring on the menu every time he speaks. This issue is one that majority agrees with even about 1/3 of Democrats. What the hell happened to the party of Big Labor that having more labor is a bad thing? iris \\nYes, our tax dollars are probably paying for at least some, if not many, of the anti Trump ads. However, even if they aren’t, the Bilderberg meeting probably included a vote for vast amounts of money to be poured into a smear campaign against him and for Hillary, by way of various world banks. That issue and Brexit, probably took up most of the meeting. They will do everything in their power to make sure the DonkiPhant stays in power, because that suits their plans for now. We are moving inexorably toward a one world economic, political and religious system, in fulfillment of prophecy, and this planned chaos may be the perfect scenario for a possibly very charismatic figure to take center stage under the promise of “world peace and safety”. I will vote, but regardless of what happens, (and I believe it’s rigged), God will still be in control. He is just and true. This world’s system is a shell game. \\nI trust Trump more than Hillary, but even if he won, it’s probably too late for the U.S. to continue, with our semblance of sovereignty and freedom. The football games will continue, the fast food joints will supersize for an extra dollar, etc., but we’re going downhill too fast to stop, imo. Heaven is home for Christians, and this is all very temporary, however. loadnup \\nYep and just look at the turn out for their convention and the folks who show up for her “rallies.” Pray, prep and protect ’cause whosoever wins this race will end up facing what could well be the second not-so-civil war. pray, prep and protect. Bob Knight \\nBoth parties are and have always been parties for the rich. The only difference is how they packaged their deals. Even that has now been blurred so you can’t tell the difference anymore. horse777res \\nStop calling these treasonous RINOs “Republicans.” They are sleeper cell Democrats who have infiltrated the leadership of the Republican Party. John Pallyswine \\nAdd Hank Paulson & Paul Ryan to the list \\nSupport for Crooked Hillary support for the GOP! PILGRIM SOCIETY!! Brian \\nI love how Henry Paulson states “he will be voting for Hillary Clinton with the hope that she can bring Americans together.” Yea, we’ll all be together in fema camps!!! iris \\nWouldn’t be surprised. Wouldn’t be surprised if O suspends elections and instills martial law because of a planned crisis and we end up in one somewhere, regardless. It will be a privilege and an honor to be sent to one for standing for God and His truths, though. Hugh Everett \\nThat list of 16 names is staggering! \\nBy the way, who are they? Mike \\nDuh, the article says who they are right after their names. Guest’s the Name \\nJust today, at least that many more GOP big wigs have publicly announced their support for anyone-but-Donald. \\nI suspect we’ll be seeing more and more people with consciences pledge to keep that monstrosity out of the White House. I just WISH they would pull something out of *somewhere* to replace his name on the ballot before November. It will be the only chance the Right has to see a Republican elected. Hugh Everett \\n“I just WISH they would pull something out of *somewhere* to replace his name on the ballot before November.” \\nWith Trump, everything has a price tag. He can certainly be bought off by the RNC, but the price tag will be high. They will develop a story line about how he is bowing out for the good of the GOP, and the good of the country, and the Trump brand will increase in value. \\nRepublicans can pull the same tag-team Torricelli-to-Lautenberg, Mel Carnahan-to-Jean Carnahan election strategy that democrats frequently employ. Bring in Romney or Rubio as the well-known compromise candidate, and throw a monkey wrench into the Clinton strategy. GV \\nthat would be the neo-conservative war-mongering psychopath Hillary Hugh Everett VigilanteCaregiver \\nThe old regime is broken. In practice, there’s actually 6 major parties now. \\nRepublicans split three ways: Establishment with the right-wing progressives, the Populists-Nationalists under Trump, and the Constitutionalists headed by Cruz and Lee. \\nDemocrats split into three: Liberals, now being pushed out of the party, and has no discernible leader (best thought leader for this new paradigm is Sargon of Akkad, a blogger that occasionally posts here), the Statist’s and porgressives under Hilary Clinton, and the Usurpers (insurrectionists, radicals, SJW’s, Gaystopo, etc) under Obama. \\nThen there’s the smaller parties that still wait for good leadership to move them up in the ranks: Libertarians, Soylent Green’s, etc. \\nAnd finally, there’s folks who don’t want to get involved with anyone’s $#%&. They want to live a good life, provide for their own, defend their homes, and not bother with the extremes. I want to be counted with these guys and am working on it. \\nSo, there really isn’t any shock that Establishment Republicans would go with Clinton – they’re close to the same ideology. kfilly \\nYou called Cruz a Constitutionalist. Epic fail. He is a globalist. Just look at his wife. She works for the vampire Goldman Sachs and was a member of the Council of Foreign Relations. VigilanteCaregiver \\nThat’s what the Cruz and Lee folks claim: don’t really care. If you have a problem with the Cruz folks – take it up with them. You don’t take it up with me. \\nLike I said in the original post: “And finally, there’s folks who don’t want to get involved with anyone’s $#%&. They want to live a good life, provide for their own, defend their homes, and not bother with the extremes. I want to be counted with these guys and am working on it.” \\nI’m not on Cruz’s side. I’m not on Trump’s side. I’m not on Hilary’s side. Nor Obama’s. Not Sanders. No ones but Christ’s; I’m bowing out. Election day comes I’m gonna do my chores and duties. If there’s any quiet time, I’ll fire up the foundry furnace and make some ingots. \\nTo repeat yet again: this is the opening forays of a multi-faceted civil war and I will not participate. No one in any party cared what happened to us: none of their candidates and officials even listened – they still don’t. And yet; each side is fervently determined that I must join their side or else face consequences. That’s carnal politics. \\nWhat happens if Trump loses? What will you do then? Escalation and eventually the Leftist usurpers will attack: your lot will counterattack. My family shall be caught in the middle – do you see my position? \\nI don’t care for identity politics or who works for what. I care that my family will struggle worse when you all are violently fighting over words and carnal egos; whilst all sides demanding I support their views! \\nI chose Christ. He’s the only one who cared when it counted and still does. GV \\nhey Einstein, YOU are the one who said Constitutionalists headed by Cruz UncleMike Davis \\nLying Ted is a pretend Constitutionalist, Conservative, Christian. Cruz is actually a globalist, New World Order anti-American. Jill Stein is a globalist. \\nAnd Donald J Trump is single-handedly, by all appearances, defeating every one of them. Even Obama, preparing his martial law backup plan, will be thwarted and defeated. VigilanteCaregiver \\nI just told the other guy: that’s what the Cruz and Lee folks claim: don’t really care. If you have a problem with the Cruz folks – take it up with them. You don’t take it up with me. \\nLike I said in the original post: “And finally, there’s folks who don’t want to get involved with anyone’s $#%&. They want to live a good life, provide for their own, defend their homes, and not bother with the extremes. I want to be counted with these guys and am working on it.” \\nI’m not on Cruz’s side. I’m not on Trump’s side. I’m not on Hilary’s side. Nor Obama’s. Not Sanders. No ones but Christ’s; I’m bowing out. Election day comes I’m gonna do my chores and duties. If there’s any quiet time, I’ll fire up the foundry furnace and make some ingots. \\nTo repeat yet again: this is the opening forays of a multi-faceted civil war and I will not participate. No one in any party cared what happened to us: none of their candidates and officials even listened – they still don’t. And yet; each side is fervently determined that I must join their side or else face consequences. That’s carnal politics. \\nWhat happens if Trump loses? What will you do then? Escalation and eventually the Leftist usurpers will attack: your lot will counterattack. My family shall be caught in the middle – do you see my position? \\nI don’t care for identity politics or who works for what. I care that my family will struggle worse when you all are violently fighting over words and carnal egos; whilst all sides demanding I support their views! \\nI chose Christ. He’s the only one who cared when it counted and still does. GV \\nchose Christ? you’re a mormon! GV \\nhey Einstein, YOU are the one who said Constitutionalists headed by Cruz! GV \\nare your magic mormon underpants too tight? Hillbilly Willy \\nI’ve heard of Richard Armitage and Arne Carlson (I’m from Minnesota and Carlson is as close to Dem as “Republicans” get), but they’re the only ones. Maybe these people are important to the author but to me they are just a bunch of names. Anyway, I know enough people voting for Trump to cancel all of their votes, I just hope more traitors come clean with their preferences. UncleMike Davis \\nMostly warmongering NeoCons, and former Trotskyites. loadnup \\nWell, me and my house are voting for him and that’s more than the total of these war mongers… Bob Knight \\nI hate Trump, I didn’t support Trump, Trump is a fake conservative, but no way, no how can Shillary Clinton be allowed to be president. Why anyone would vote for Billy and Shillary is beyond the pale of reason. \\nUnless you love sin so deeply that there is no where else for you to go. \\n“And this is the condemnation, that light is come into the world, and men loved darkness rather than light, because their deeds were evil (john 3:19)”. Perplexed \\nsHARE THE COMPLETE LIST AND WE THE PEOPLE WILL MAKE SURE THEY NEVER WORK IN POLITICS AGAIN. Guest’s the Name \\nThere are new Republicans every day denouncing him and throwing the support for the only name who can stop him. Sadly, the few people who do still somehow manage to blindly support Donald really have no power, so when you say “we’ll make sure those Republican turncoats never work in politics again”, it’s kind of lame. Because those Republican turncoats are simply following their constituencies’ desires, i.e., they are listening to the voters, and we voters are telling them that if they support Donald, they will never work in politics again. \\nAnd they know the anti-Donald Republicans are more numerous than the pro-Donald Republicans. Bret McCoy \\nThis is the best campaign tool Trump could get! UncleMike Davis \\nAnd Donald J Trump will survive, and Donald J Trump has already singlehandedly defeated all these corrupt political hacks and NeoCons and RINOs in the Republican Party. Donald J Trump snatched the nomination right out of their hands, defeating sixteen corrupt establishment political hacks, and they are still screaming. \\nNow Donald J Trump is singlehandedly defeating the corrupt establishment progressive communist Democrat Party. Typhoid Hillary is the most hated woman, most distrusted politician in the world, and she is self-destructing before our eyes. Slick Willie looks like he is ready to drop dead any second now, and Hillary is likely to blow a brain aneurysm from one of her many screeching fits. \\nWhy is this? How can one man stand against the combined forces of satanic evil? Obviously, a greater power, perhaps Almighty GOD has heard us Americans, asking that our nation be healed, and preserved for our children and grandchildren. Is there some other answer? How is Donald J Trump surviving the combined attack of both political parties, and the entire establishment mainstream newsmedia? GV \\noh my, you sound just like an Obama supporter Bill Peddie \\nThe establishment Republicans, I guess those referred to as Rinos, are about to destroy the United States intentionally and because they are on a ego trip because they don’t like Trump. \\nSimply stated, if the Republicans continue this ego trip against Trump, what is going to be left \\nThis is what the democrats marvel in. Yankeegator \\nThere you have it… It’s a big deception… There is only one party in Washington… The Oligarchs!!! jesus freak \\nPray for Trump and for his protection . God is still in control, as always RO \\nThe New World Order is a big club. And you ain’t in it. Neither is Trump as you can tell. Fred Zarfloon \\nEx Democrat NeoCons who shanghaied the Republican PaleoCons will now re-join with Democrat war hawks. Bill Peddie \\nThey might as well not have an election. Just give it to Hillary. If there are this many turncoat republicans, then just let the democrats control the United States. It would take Republicans decades to cleans up the mess that will occur if Hillary is elected. I guess these that would rather vote for Hillary would be just as happy to give the Supreme Court to the democrats. \\nI never thought the Republicans would give up without a fight!!! greanfinisher . \\nWhat fight? They’re even bankrolling and campaigning for the wicked witch. Mistanick \\nEven with chaos in our midst (when have we not had it, ask the baby butchered in the womb about chaos and murder 3000 times per day in the USA alone), it matters very much who is elected. God meant it so. He commanded us to stand fast in this world and occupy it as our home until He returns. We must care passionately who wins this election and those other offices up for the vote. \\nGod raises up imperfect men to do that which seems not possible. Those who do not “like” Mr. Trump do need to first look at themselves and how imperfect we are. Mr. Trump is certainly no different. Each of us has a checkered life and past to some degree. Mr. Trump doesn’t need this and must ask himself, along with his family, if the danger, stress,and fatigue is worth it. \\nPerhaps the single most important thing the next President will do is to nominate several Supreme Court Justices. One seat is open now and 5 could be opening in the next 4 years. Think of what that might mean to Roe v. Wade, 2nd Amendment and other issues. \\nThose RINO’s who shout they will vote for Mrs. Clinton are insiders who want to continue to be so. They are one reason for the sin sick problems in our Federal government. Those who say they will vote for Mrs. Clinton are also raising their hand to be voted out of office if they hold one or distanced in any way possible otherwise. When it comes down to it though, many will probably privately vote for Mr. Trump, but just not say they did so. Guest’s the Name \\n“All throughout the primaries and the caucuses, the Republican establishment expressed tremendous disdain for Donald Trump” \\n^^^The identical thing is true of 85% of the nation as a whole. \\n“[…]many of these individuals were only “Republicans in name only” to begin with” \\n^^^False. This shows that only the most ghastly and abominable gas bag this era has ever created caused good people to obey their consciences by doing what MOST good Americans are doing, and that is making certain Donald-the-RINO never gets into the White House. \\n“Does Henry Paulson actually believe that Hillary Clinton can “bring Americans together to do the things necessary to strengthen our economy, our environment and our place in the world”?” \\n^^^Anything that a principled American can do to prevent the DeviI from being sworn in is A-OK with all other good Americans. Donald is a buffoon whose Presidency would cripple the country today… und übermorgen die Welte! \\n“the establishment will do whatever it has to do to keep Donald Trump out of the White House.” \\n^^^So will anyone with principles and/or a measurable conscience. It is NOT the votes of politicians alone who will crush The Deluded Orange One; he will be voted down by decent, pro-America individuals who work for a living. \\n““I’m afraid the election is going to be rigged, I have to be honest,” the [orange buffoon] said.” \\n^^^THAT is precisely the juvenile excuse that we could expect from the mental midget. He knows by absolutely, positively EVERY metric and by EVERY source that he will NOT be good enough to win sufficient idiots’ votes, so he is planting the lie in advance that if he loses, it was a a rig-job. The Wednesday after he loses, he’ll follow up with, “Yeah, I didn’t wanna win anyway”. The man is beyond transparent. \\n“No matter who the next president is, we are going to see civil unrest, rising crime[…] “ \\n^^^True, and he has already commanded his band of zwastika-armbanded flying monkeys flunkies to riot and destroy on his behalf if he doesn’t get his way. That “man” is too much of a child to have made it this far. \\n“[T]he establishment is going to do everything it possibly can to make sure that the next president is not Donald Trump.” \\n^^^Let us all pray that they can do enough then. Individual voters can only do so much, and we individual voters are revving up for a November win for America. Clinton is no prize, but unless or until the GOP comes to its senses and allows an electable candidate, we’re stuck with HRC as the only viable anti-Donald. \\n“If you go to just about any major news website on the Internet these days, there will be a negative story about Donald Trump featured very prominently, and it is usually accompanied by some sort of positive story about Hillary Clinton.” \\nnotice how the negative news story is about Donald’s own FACTUAL incompetence?? He spits upon veterans, he spits upon everyone who doesn’t support his delusions of grandeur. The “negative stories” about Donald are unfortunately just Donald’s own failings, they aren’t journalistic hit pieces, they are just his own actions coming back to bite him… I say GOOD. Donald is his own worst enemy. As for“positive” stories about Clinton, well, those filled with the most bigotry will see an article penned about her being cleared by the FBI and consider that a positive press… well, no, again it’s just factual press stories about her, and point of fact it is hard to find *truly* positive press about her. She simply $uxx a lot less than Donald. \\n“The establishment absolutely loathes Trump” ^^^Well, the Establishment hates him a lot less than individual voters do. He’s even polling poorly in The Rust Belt states. He’s approaching a double-digit deficit in post-DNC polls. Besides, Donald has financially contributed to the biggest names on the Left Establishment, not the least of whom being the Clintons. \\nDonald is objectively not successful in even ONE category to make him a decent President. And daily, more and more American voters are realizing this. GV \\nvote for Hillary if you want more war. she is a neo-conservative war-mongering psychopath GoldenGirl \\nBest description yet of HRC. Fred Zarfloon \\nTrump reputedly has a short attention span. He needs to focus on the big issues that won him the nomination and stop chasing after sideshow debates. Georgiaboy61 \\nThe list of defectors reads like a “Who’s Who” of the neo-con/CFR foreign policy establishment – Armitage, Scowcroft, Kagan, Boot, Mansoor, et. al. Since these guys have always been neo-Wilsonian Democrats deep-down, they ought to just register as Democrats and make it official. Nobody anymore is buying the snake oil they’re selling. The Dems can have ’em! iris \\nThanks. And as if there’s actually been more than one party on the playing field since the 80’s. Leopold B. Scotch \\nEveryone should do themselves a favor and learn some of these names if you don’t know them already. Take Robert Kagan, for example: a Big Government interventionist neoconservative married to Obama’s appointee to European and Eurasian affairs, Victoria Nuland, of “F the Eu” Fame, the once State Department liar for U.S. meddling and Spin regarding the Ukraine, a resume equally dubious – a loose-cannon, Ivory Tower War Hawk who is in line for Hillary Goldman Clinton’s state department. . Leopold B. Scotch \\n“Robert’s brother, Fred, is with the hawkish American Enterprise Institute, and his sister-in-law, Kimberly, is the head of the Institute for the Study of War, which is largely funded by defense contractors. The Kagans work to encourage military action, both through their positions in government and by influencing the public debate through think-tank reports and op-eds. It is a family enterprise that mirrors the military-industrial complex as a whole, with think tanks coming up with reasons to increase military spending and providing “expert” support for the government officials who actually promote and implement the policies. Defense contractors, meanwhile, benefit from the largess and kick back some money to the think tanks, which then develop new reasons to spend still more on military procurement.” \\nHmmm, good to know, thanks. GV \\nno war profits without war winrob \\nIt says a lot about the character of these people that they would recommend a multiple felon and pathological liar to be POTUS. Just how shallow a character do you need for this? FVS \\nOn the other side of the scale I’m sure Wikileaks is loaded and ready to go. Assange has openly said he dislikes the Clintons. If anybody thinks that the DNC emails is the worst they have store for Hillary they are naive and stupid. There are more leaks coming and I’d bet both the frequency and the potential for damaging Hillary will increase the closer we get to the election. \\nEqually naïve would be to think Trump won’t turn the debates I to an indictment of MSM bias. I can hear it now: MSM Clinton shill: Blah, blah, blah in naked accusatory tone… Trump: Instead of asking that stupid biased question why haven’t you asked Mrs. Clinton about … (insert any one of Hillary’s documented lies). Trump then stops and starts directly at the phony moderator as the silence turns to indictment. FVS \\nThese idiots still don’t grasp that the ground swell of Trump’s support came because he exposed that these ash wipes have been in bed with the Democrats all along. Neither do they grasp that their opinions no lo ger carry any weight. If it did Jeb would have been the nominee. But he isn’t is he? iris \\nAmen! SantosGarcia \\nOur ONLY Hope is in the LORD Jesus Christ- and in His answer to our genuine prayers with fasting according to 2 Chronicles 7:14! https://zionsgate.wordpress.com/2007/07/04/praying-for-the-healing-of-america/ Danna \\nLet everyone know when you get more republicans’ names who are wolves in sheep’s clothing. This identifies them as definitely on the side of the NWO. All of them are traitors and should be put on trial. I’m sure they are involved in the Clinton Foundation money scandal and are afraid if Trump gets in they will all be found out for the traitors that they are. greanfinisher . \\nWhat are you talking about? This is the same exact spin that the GOP establishment has used lately. RageHard84 \\nWhat’s with these so-called Republicans? I get they dont’ like Trump, but you can’t support that compulsive liar Clinton just because she’s not Trump! \\nVote third party.'"}, "time": 1742561765.507777}