{"duration": 0.09997797012329102, "input_args": {"text": "'News, information and analysis from the black left. Black Agenda Radio for Week of Nov 14, 2016 Submitted by Nellie Bailey a... on Mon, 11/14/2016 - 21:23 2016 elections Cornel West: Class Becoming “Much More Central” \\n“We are witnessing the end of the neoliberal era,” said Dr. Cornel West , the nation’s most prominent Black public intellectual, assessing the import of last week’s election. West backed Bernie Sanders in the Democratic primaries, then endorsed the Green Party’s presidential ticket. The election “did not go left-populist, following Bernie Sanders and Jill Stein,” he said. Instead, “it went rightwing-fascist. But the neoliberal era is coming to a close and the neoliberal establishment is being exposed. The issues of class now are becoming much more central.” Trump Supporters Mounted an “Insurrection” \\nDuboisian scholar Dr. Anthony Monteiro was among the few observers on the Left that thought Donald Trump would win at the polls. But, even he was startled at the scope of Trump’s sweep. “I felt that the insurgency would grow and deepen, but I never thought that it would become an insurrection,” said Monteiro. “In a certain sense, white working and poor people in these small, rust belt towns have a sense of achievement in having brought the Clintons down that Black people had in 2008 when Barack Obama was elected with a huge Black turnout,” he said. Monteiro is one of the organizers of a Conference on Political Science for Radical Times, set for December 9-10, in Philadelphia. TPP “On Its Death Bed” \\nWith Donald Trump’s victory, President Obama’s Trans Pacific Partnership corporate rights trade deal is “looking like it’s on its death bed,” said Kevin Zeese , of Popular Resistance. “We’ve worked for five years to make TPP stand for Toxic Political Poison, and that seems to have happened,” said Zeese. Trump won in “the rust belt that was destroyed by NAFTA” -- Bill Clinton’s jobs-exporting bill of a generation ago -- “and was going to be threatened again by TPP.” Zeese said Obama may make a last bid to pass TPP in the lame duck session of Congress that begins this week. Finally, a Practical Guide to Black Self-Determination \\nThe Black is Back Coalition for Social Justice, Peace and Reparations adopted a 19-point Black Political Agenda for Self-Determination, at a conference in Washington. The document applies the principle of self-determination to the broadest range of issues, from Black Community Control of the Police, to Mass Black Incarceration, to Nationalization of the Banks. “Everybody wants self-determination,” said Coalition chairman Omali Yeshitela , “but what does it mean, practically?” The 19 points give direction to the struggle. “This isn’t something you work on every four years,” said Yeshitela. “This is something you work on every day. This is our program.” \\nMargaret Kimberley , an editor and senior columnist for Black Agenda Report, told the conference: “When we meet together, today, we are showing the world what self-determination looks like.” Voting for “your enemies” is not self-determination, and “thinking that electoral politics is the only road to liberation is not self-determination,” said Kimberley. Black Agenda Radio on the Progressive Radio Network is hosted by Glen Ford and Nellie Bailey. A new edition of the program airs every Monday at 11:00am ET on PRN. Length: one hour.'"}, "time": 1742628367.158737}