{"duration": 0.0476527214050293, "input_args": {"text": "'The Green Party’s Radical Common Sense Posted on Oct 28, 2016 \\nBy Scott McLarty D. Ross Cameron / AP \\nGermany and other European countries have a thriving multiparty political culture. The U.S. used to have one too. In 1916, five parties were seated in Congress. \\nIn his Washington Post article “In Europe, the Green Party is a force. In the U.S., it’s irrelevant. Here’s why,” Per Urlaub, associate professor of German studies at the University of Texas, contends that “the American electoral system is heavily weighted against small political parties.” \\nHe’s right. Alternative parties must wrestle with ballot-access laws, enacted since 1916 by Democratic and Republican legislators in many states, that privilege major-party candidates and hinder others. In some states, alternative parties are effectively banned from participation. \\nWhen alternative parties do get on the ballot, their candidates often face the “spoiler” accusation. The supposed spoiler effect can be eliminated by replacing the prevailing “first past the post” system with “ranked choice,” which allows people to rank their preferences. \\nAdvertisement Square, Site wide \\nReforms like ranked choice voting (RCV) and proportional representation—which gave Germany and other European countries their multiparty legislatures—are considered radical here, even though they grant voters greater power and more options. \\nGreens have urged such reforms for years, but Democrats and Republicans prefer to maintain their exclusive hold. A chance for RCV in California died in early October with Democratic Gov. Jerry Brown’s veto. \\nThe major parties solidified their grip in 1988, when the Commission on Presidential Debates (CPD) seized control of the debates from the League of Women Voters. Contrary to its “nonpartisan” label, the CPD is run by Democratic and Republican representatives for the benefit of their own candidates. The League has called the CPD debates a “fraud on the American voter.” \\nThe CPD adopted its poll-based criteria to determine participation in the debates after the 1998 gubernatorial election in Minnesota. Independent candidate Jesse Ventura was dismissed as “not viable,” with a tiny percentage in the polls until he was allowed to participate in a debate. His poll numbers shot up and he went on to win. \\nWhen the CPD witnessed what happened in Minnesota, it raised the requirement to 15 percent in the polls in 2000 to spare Al Gore and George W. Bush from facing Ralph Nader and Pat Buchanan in the debates. \\nThe CPD’s rules aren’t meant to bar “unviable” candidates, they’re designed to keep alternative-party candidates from becoming viable. \\nThere’s nothing inevitable about having only two parties. We don’t have a two-party system, we have a two-party racket. \\nVoters are aware they’ve been cheated. Their frustration is evident in polls showing they favor more options than two on Election Day, and the high disapproval ratings for Donald Trump and Hillary Clinton. \\nRadical? Only in the U.S. \\nPer Urlaub’s main complaint about the U.S. Green Party is its “radicalism.” In fact, the U.S. has a long history of radical alternative-party ideas. \\nAbolition of slavery, women’s suffrage, the eight-hour workday, worker benefits, public schools, unemployment compensation, the minimum wage, child labor laws, direct election of senators, Social Security, civil rights for blacks and other disenfranchised peoples—all were first represented in the electoral forum by alternative parties. \\nMarginalization of minor parties in the late 20th century is an unmentioned reason for the shift to the right in both major parties and the disappearance of big progressive ideas. \\nObamacare isn’t a big progressive idea. It’s a repackaging of the conservative Heritage Foundation’s individual mandate proposal and RomneyCare, implemented by then-governor Mitt Romney, a Republican, from Massachusetts. It was drafted by Democrats with the participation of insurance-industry representatives. \\nGreens support a single-payer health care program, so that Americans can have the guaranteed medical care enjoyed by citizens of every other democratic developed nation. Only in the U.S. is universal health care dismissed as radical and unrealistic. \\nUrlaub never mentions what makes the U.S. Green Party radical. He does, however, cite projects for conversion to clean, renewable energy that are implemented in Europe and advocated by presidential nominee Jill Stein and other Green candidates in the “ Green New Deal ,” which aims for freedom from fossil fuels by 2030. \\nGlobal warming was nearly absent from the three Clinton-Trump debates, even after Hurricane Matthew pounded Haiti and the Southern states. \\nYoung people will live with the consequences of rule by two parties awash in corporate money and influence. Millennials face an era of deteriorating quality of life, increasing personal debt, exported jobs, eroded rights and freedoms, lawless militarism, and social breakdown as the planet heats up.'"}, "time": 1742628495.6251287}