{"duration": 0.011684656143188477, "input_args": {"text": "'NBC News chairman Andy Lack said Tuesday that President Donald Trump “has us a bit more focused on temperament than we expected,” but he derided Trump’s complaints about “fake news” and the role the media has played in covering the campaign and now the administration. [“We’re not the opposition party, and we’re not in a popularity contest with this administration or any administration,” Lack said at a panel discussion at New York’s IESE Business School, according to The Hollywood Reporter.  That referred to remarks made by White House chief strategist Steve Bannon in an interview in February, in which he said, “I want you to quote this. The media here is the opposition party. They don’t understand this country. They still do not understand why Donald Trump is the president of the United States. ” This sentiment was later back by President Trump when he told an interviewer, “I think the media’s the opposition party in many ways. ” Lack said an adversarial relationship between the press and the president is “fundamental to our democracy. We go through periods where we’re in the crosshairs, we’re targeted. ” “Here we are again,” he asserted. “We’re not going to be intimidated by that. I think it’s a distraction from what we’d like to focus on, which is policy. ” But NBC News has not always met that mark. According to the New York Post, the Wikileaks dump of Democratic National Committee emails included one from CNBC anchor John Harwood to Clinton campaign manager John Podesta saying, “Let’s be honest, is this a   version of a presidential campaign?” Another email to Podesta said, “I imagine   …     that Obama feels some (sad) vindication at this demonstration of his   point about the opposition party veering off the rails. ” On election night, Rachel Maddow said on MSNBC, “I mean, to have the first   president succeeded by a guy who was endorsed by the KKK   …     it’s a big deal. ” Earlier in the fall, Lawrence O’Donnell, also of MSNBC, called Trump “an imbecile candidate. ” And before that, Maddow said, “I’ve been reading a lot about what it was like when Hitler first became chancellor. I think that’s possibly where we are” if Trump is elected.'"}, "time": 1742628471.476951}