{"duration": 0.04892301559448242, "input_args": {"text": "'Loading Posted on October 26, 2016 Justice Department Faces Uphill Battle Should Officer Daniel Pantaleo Be Charged in Eric Garner Case, Experts Say John Marzulli, NY Daily News, October 25, 2016 \\nAs the Justice Department looks to indict NYPD Office Daniel Pantaleo by year’s end in the civil rights probe of the Eric Garner police chokehold case, experts said Tuesday that bitter in-fighting between prosecutors has made a potential trial a defense lawyer’s dream. \\nThe probe is now firmly in the hands of the Department of Justice in Washington, D.C., which appears to have overruled recommendations from Brooklyn prosecutors and FBI investigators not to indict the NYPD cop, sources said. \\nThe New York-based feds determined they could not bring a criminal civil rights case against Officer Pantaleo for Garner’s death–leading the Department of Justice to take control of the case. \\nDefense lawyers and former prosecutors said the unusual split opens a trove of evidence that could potentially help Pantaleo if he’s indicted. \\nWhen U.S. Attorney General Loretta Lynch gives the department’s civil rights division the green light to charge Pantaleo with violating Garner’s civil rights, it could reveal the deep division between the branches of the Justice Department. \\nThe key, however, is the defense getting its hands on the information and being allowed by a judge to quiz witnesses about it, the sources said. \\n{snip} \\nThe federal civil rights criminal case would hinge on proving that Pantaleo “intended” to violate Garner’s civil rights, which is a high threshold because it aims to get inside the cop’s head when he brought Garner to the ground. \\n{snip} \\nDefense lawyer Eric Franz said he would seek any prosecutorial memos regarding justification of a federal civil rights charge to examine the factual reasons behind the Brooklyn office’s recommendation, but agreed it remains a longshot. \\nA greater problem is the damage this dispute is doing to the Justice Department’s credibility, Franz said. \\n“I have enormous respect for Mr. Capers (Robert Capers, Brooklyn U.S. attorney) and his office, and they were in the best position to determine whether charges are warranted,” he said. \\n{snip}'"}, "time": 1742561972.9357197}