{"duration": 0.18049001693725586, "input_args": {"text": "'Six weeks before the Summer Olympics open in Rio de Janeiro, the laboratory that was set to handle drug testing at the Games has been suspended by the World   Agency in a new escalation of the doping crisis in international sports. WADA  —   the global regulator of doping in sports that oversees three dozen testing labs around the world  —   confirmed the suspension Friday, citing the Rio lab’s “nonconformity” with international standards. The lab has a prior disciplinary record and is one of a handful of labs that have had their certification to conduct drug testing revoked in WADA’s   history. Among those is Moscow’s antidoping lab, which was disciplined last fall following accusations of a   doping program in Russia. Those allegations have prompted global sports officials to bar Russian track and field competitors from the Rio Games. At the urging of Olympic officials, 27 other Summer Olympics sports organizations are scrutinizing athletes from Russia and Kenya, another country facing accusations of widespread doping, ahead of the Games. The Rio suspension not only presents new logistical hurdles to testing at the Games but also highlights growing concern over an antidoping system in disarray that extends to how WADA itself operates. WADA has come under scrutiny for taking years to act on   tips about doping in Russia and for approving Russia’s antidoping lab to lead testing at the Sochi Olympics in 2014 even amid questions about that lab’s integrity. On Friday, WADA did not specify the issues with the Rio facility that had prompted the suspension. A person familiar with the lab’s operations, who was not authorized to speak publicly, said the investigation centered on a specific case. The Rio lab was previously suspended in 2013  —   the year before Brazil hosted soccer’s World Cup  —   and was reinstated by WADA last year. To win back its certification, the lab had spent roughly 200 million Brazilian reais ($60 million) to train more than 90 technicians and retrofit three floors of facilities at a federal university in Rio. That project necessitated a substantial commitment of government money in the face of a serious recession. In an interview last spring, Francisco Radler de Aquino Neto, a chemical scientist and the director of the Rio facility, credited firm support from the federal government for improvements. Dilma Rousseff, who was removed as Brazil’s president this year amid a sweeping graft scandal, signed a measure in March to ensure that the lab’s policies were changed to conform with global standards so that its certification to run Olympic testing was not revoked. The new suspension took effect on Wednesday, according to WADA. The lab has the option of filing an appeal to the Court of Arbitration for Sport in Switzerland within 21 days. While under suspension, the lab is barred from conducting any antidoping analysis on urine and blood samples. It was unclear Friday if the issue would be resolved  —   and the suspension lifted  —   in time for the Olympics, though officials expressed skepticism that such a reversal could happen so quickly. In the meantime, WADA said that it would transfer any samples at the lab to a facility outside Brazil for testing. “WADA will work closely with the Rio laboratory to resolve the identified issue,” Olivier Niggli, WADA’s incoming director general, said in the organization’s statement. “Athletes can have confidence that the suspension will only be lifted by WADA when the laboratory is operating optimally. ” The lab’s previous suspension coincided with the 2014 World Cup, forcing organizers to send athletes’ doping samples to Switzerland for testing. FIFA, the governing body of international soccer, bore the cost. If the Rio lab is not recertified in time for the Olympics, the International Olympic Committee would be responsible for arranging to have doping samples taken to another   lab. Earlier this month, WADA’s president, Craig Reedie, stressed the necessity of a local testing lab at the Olympics. Compared to the World Cup, he said, the pace of Olympic testing and competition is far more intense. “You’re in the first round of the 100 meters at 10 o’clock in the morning and the second round at 2 o’clock in the afternoon,” Mr. Reedie said. “We need a laboratory on site at the Olympic Games. ” Just two years ago, facing enormous pressure to have an   laboratory at Sochi, Mr. Reedie permitted the Russian lab to conduct testing for the Games despite suspicious test results that had prompted a WADA investigation. The longtime director of Russia’s lab, Grigory Rodchenkov, told The New York Times that after he was cleared to run the Sochi lab, he had tampered with roughly 100 of the 1, 917 urine samples the facility tested. He said he had substituted out the   urine of dozens of Russian athletes, at least 15 of whom won medals at Sochi  —   where Russia placed first in the overall medal count. Mr. Reedie, who signed a certificate in January 2014 that allowed Dr. Rodchenkov to direct testing at Sochi, has defended that decision. “The suspension was suspended provided they met certain tests over a short period, which they did,” Mr. Reedie said in an interview in Switzerland this month. “Hindsight is an exact science. ” In 2014, WADA’s independent observation team called the Sochi lab “a milestone in the evolution of the Olympic Games antidoping program. ” But in recent months  —   as attention has focused on the global regulator, and after new rules took effect in 2015  —   WADA has announced an unusual flurry of new disciplinary actions. About a quarter of the lab suspensions published on WADA’s website have taken place in 2016. In the last three months alone, WADA announced more suspensions than it had in the preceding three years combined. Those suspensions  —   of antidoping labs in Beijing Lisbon Madrid Bloemfontein, South Africa and now Rio  —   affect more than 10 percent of WADA’s testing facilities. The agency, which oversees individual countries’ antidoping programs as well, has also disciplined national antidoping agencies at significantly higher rates since last fall. “We’re seeing a whole lot more scrutiny now,” said Joseph de Pencier, the founding chief executive of the Institute of National   Organizations, a trade group that has been funded by WADA. “WADA is realizing it should function like a financial regulator. ” At a November meeting in Colorado  —   days after WADA had published an explosive report on Russia  —   WADA’s board resolved to be stricter, and Mr. Reedie said in a statement that the organization would have a “greater focus” on ensuring countries played by the rules. Since then, the antidoping agencies of countries including Kenya and Russia have been sanctioned, either because the countries’ policies were out of line with global standards or because the agencies made technical mistakes such as sending doping samples to an unapproved lab. For a national antidoping agency to be disciplined by WADA means little in itself, but depriving a country of WADA’s endorsement is a powerful signal. Still, in an interview in Los Angeles last month, Dr. Rodchenkov minimized the rigor of WADA’s scientific vetting process during the 10 years he headed Russia’s lab. “WADA is a kindergarten,” Dr. Rodchenkov said. But he called WADA’s seal of approval crucial to delivering on the cheating scheme he said he had carried out on orders from the Russian government. “You cannot do   doping without access to   accredited laboratory,” he said. Though WADA revoked the accreditation of Russia’s lab in the wake of the accusations, the agency cleared the facility last month to resume testing on blood samples. Mr. de Pencier, the head of the consortium of antidoping agencies, said the antidoping authorities had begun to appreciate the need for more robust regulation. “The antidoping community as a whole is still a work in progress,” he said. “We’re still developing. ”'"}, "time": 1742562625.69742}