{"duration": 0.08414363861083984, "input_args": {"text": "'Leonard B. Sand, a federal judge in New York who presided over a   landmark case in which he found that city officials in Yonkers had intentionally segregated public housing and schools along racial lines, died on Saturday at his home in Sleepy Hollow, N. Y. He was 88. His death was confirmed by his son David. The Yonkers case, which received national attention, was hardly the only lawsuit in which local governments in the Northeast had been charged with racial discrimination, but it was one of the most bitterly contested. The charges against Yonkers were brought in a lawsuit that the Justice Department filed in 1980 in Federal District Court in Manhattan. The case was assigned to Judge Sand, who had joined the court two years earlier. Though Judge Sand presided over other prominent cases in his long judicial tenure, including terrorism and financial fraud cases, the marathon Yonkers litigation loomed largest in defining his public image. Or images. Some applauded him as rightly following precedents when, in 1986, he ordered that the city remedy the housing portion of its violations by adopting a plan for building up to 1, 000 units of   and   housing in predominantly white neighborhoods. They praised him again when he imposed potentially bankrupting fines on Yonkers to overcome its City Council’s repeated defiance of his mandated remedy. One coalition of civil rights and religious groups cited “his courageous effort to enforce the rule of law in Yonkers. ” Critics, however, viewed him as engaging in “social engineering,” and some called him a “judicial tyrant. ” Yonkers officials, who denied they were responsible for the segregation, denounced the judge, as did many white residents, some of whom picketed his weekend home in northern Westchester County. The clash of wills was dramatized last year in the HBO   “Show Me a Hero,” based on the book of the same title by Lisa Belkin, a former reporter for The New York Times. Bob Balaban portrayed Judge Sand. Judge Sand, who had a reputation as   and patient on the bench, said in an interview with The Times in 1988: “I like to think I have a reasonable perspective on what a judge’s role is in our society. I don’t let it get under my skin. I have a job to do. I think I know what that job is. I find my work satisfying. ” He had been in private law practice in New York City for nearly 20 years when President Jimmy Carter nominated him for the federal court in Manhattan in 1978. After the Justice Department filed its lawsuit against Yonkers  —   the N. A. A. C. P. joined as a plaintiff later  —   the judge tried over the next three and a half years to get the parties to reach a settlement, but the effort failed. After conducting a trial, he ruled in 1985 that “the extreme concentration of subsidized housing that exists in southwest Yonkers today is the result of a pattern and practice of racial discrimination by city officials, pursued in response to constituent pressures to select or support only sites that would preserve existing patterns of racial segregation. ” That pattern, he said, had contributed over three decades to the 1980 census finding that 80 percent of the city’s   population lived in southwest Yonkers. And, he said, it contributed to a segregated school system in which minority students attended “generally inferior facilities” that provided a lesser “quality of educational opportunity. ” The school desegregation program he ordered, including academically enriched magnet schools and busing, was quickly put into effect. But his housing order was fought for two years by what he called “obstructive and dilatory tactics,” and in August 1988 he imposed the fines: $100 the first day, doubling each subsequent day. Within a month they would total more than the city’s annual budget, $337 million. An appeals court capped the fines at $1 million a day, but they would still be crippling, and in September the City Council voted to accept the order when two of the defiant Council members reversed their previous votes. But with further litigation over financing and sites, the last of the required housing was not completed  —   and the case not concluded  —   until 2007. Other widely noted decisions by Judge Sand included a 1990 ruling that overturned a ban on panhandling in the New York City subway system. It was the first time a federal court found that panhandling was a   right protected by the First Amendment. “A true test of one’s commitment to constitutional principles is the extent to which recognition is given to the rights of those in our midst who are the least affluent, least powerful and least welcome,” Judge Sand wrote. Though Judge Sand said the begging could be restricted by keeping it out of the subway cars, an appeals court reversed his ruling and kept the systemwide ban intact. Judge Sand was one of the authors of “Modern Federal Jury Instructions,” which since its publication three decades ago has become a leading treatise in federal courts on what judges should tell juries about the law before they begin to deliberate. Leonard Burke Solomon was born in the Bronx on May 24, 1928. His father, Frank Solomon, was a textile manufacturer, and his mother, the former Dora Sado, was involved in the business. He changed his name to Sand as a young man. He graduated from New York University and, in 1951, from Harvard Law School. In 1952 he was a clerk to Judge Irving R. Kaufman, who gained national attention a year earlier when he sentenced Julius and Ethel Rosenberg to the electric chair. In the 1950s Mr. Sand was an assistant United States attorney in Manhattan and an assistant to the United States solicitor general. In 1955, he married Ann Sulzberger, a first cousin of Arthur Ochs Sulzberger, the former publisher of The Times. Besides his son David, his immediate survivors include his wife another son, Robert a daughter, Peggy Sand and six grandchildren. Perhaps Judge Sand’s most prominent criminal trial was that in 2001 of four terrorists who were convicted of conspiring in the 1998 bombings of two American embassies in East Africa, which killed 224 people. Two defendants then faced a death penalty hearing, which resulted in life sentences after the jury could not agree on imposing a death sentence. Daniel L. Stein, a former law clerk to Judge Sand, said the judge recalled years later that in a special verdict form, some jurors noted that the terrorists “were suicide bombers, so why give them what they want?” Mr. Stein said Judge Sand told him: “Juries get it right. There’s a lot of wisdom in a   jury. ”'"}, "time": 1742564375.8005924}