{"duration": 0.0782322883605957, "input_args": {"text": "'Nearly   of white evangelical voters plan to cast their ballots for Donald J. Trump despite his multiple marriages, lack of piety and inconsistency on the issues they care about most, a new poll has found. Support for Mr. Trump among white evangelicals is even stronger than it was four years ago for Mitt Romney, the previous Republican nominee for president, according to the poll of religious voters, released on Tuesday by the Pew Research Center. White evangelicals make up about   of all registered voters and are a coveted bloc who, when energized, can turn out the vote through their churches and social networks. It has been unclear to what extent Mr. Trump will be able to capture this core Republican constituency, because some leading evangelicals have spoken of being disturbed by his penchant for boasting about himself and belittling others, his pledges to deport Mexican immigrants and bar Muslims from entering the country, and his past support for abortion rights and gay rights. Some influential evangelical leaders have joined the “Never Trump” camp, while others have pledged support for Mr. Trump. More came on board after he wooed about 1, 000 of them in a   meeting in New York. “Trump is not a true believer in any sense, both religiously and on the issues, but he’s speaking to them,” said J. Tobin Grant, a professor of political science at Southern Illinois   and a columnist at the Religion News Service. “He’s actively courting them, and that’s what the activists want. They want to have a seat at the table, and they felt they didn’t have that with Romney. ” The poll also found that Roman Catholics favored Hillary Clinton, the presumptive Democratic nominee, over Mr. Trump by 17 percentage points  —   a significant shift from the 2012 presidential race, when Election Day exit polls showed Catholics split almost evenly between Mr. Romney and the Democratic incumbent, President Obama. The change is largely because of the support of Hispanic Catholics, who make up about   of Roman Catholics in the United States and favor Mrs. Clinton over Mr. Trump by an overwhelming 77 percent to 16 percent. White Catholics narrowly favor Mr. Trump over Mrs. Clinton, 50 to 46 percent, but Mrs. Clinton has a   advantage among all Catholics who say they attend Mass weekly. Black Protestants are firmly in Mrs. Clinton’s camp, and white mainline Protestants favored Mr. Trump over Mrs. Clinton, 50 to 39 percent. The survey did not show results for members of minority religious groups, like Buddhists, Hindus, Jews and Muslims, because there were not enough of them in the poll. The survey found Mrs. Clinton leading Mr. Trump decisively in a   contest, 51 to 42 percent. Mrs. Clinton has solid support from voters who claim no religion  —   a cohort known as the “nones,” according to the poll. This group has grown rapidly in recent years, and now makes up about   of registered voters  —   about the same share of the electorate as white evangelicals. Religiously unaffiliated voters back Mrs. Clinton by 68 percent to 26 percent, but their support is softer than evangelicals’ support for Mr. Trump. The poll found that 36 percent of white evangelicals said they strongly supported Mr. Trump, while in June 2012, just 26 percent said they strongly supported Mr. Romney. Mr. Romney faced resistance from some evangelicals because of his Mormon faith. Mr. Trump is a member of the Presbyterian Church U. S. A. a liberal mainline Protestant denomination, has demonstrated little fluency in the Bible or Christianity, and has said that he has never asked God for forgiveness. But the poll showed that voters in general, including evangelicals, were dissatisfied with their options this year.   percent of white evangelical voters said it would be difficult to choose between Mr. Trump and Mrs. Clinton because “neither one” would make a good president. In fact, the survey found that the desire to defeat Mrs. Clinton was the prime reason evangelicals supported Mr. Trump. Of the 78 percent of white evangelicals who said they would vote for Mr. Trump, 45 percent said their decision was “mainly a vote against Clinton,” while only 30 percent said it was “mainly a vote for Trump. ”'"}, "time": 1742563404.910444}