{"duration": 0.11929082870483398, "input_args": {"text": "'Planet Nine’s days of lurking unseen in the dark depths of the outer solar system may be numbered. By Mike Wall\\nThe hypothetical giant planet, which is thought to be about 10 times more massive than Earth, will be discovered within 16 months or so, astronomer Mike Brown predicted.\\n“I’m pretty sure, I think, that by the end of next winter — not this winter, next winter — I think that there’ll be enough people looking for it that … somebody’s actually going to track this down,” Brown said during a news conference Wednesday (Oct. 19) at a joint meeting of the American Astronomical Society’s Division for Planetary Sciences (DPS) and the European Planetary Science Congress (EPSC) in Pasadena, California. Brown said that eight to 10 groups are currently looking for the planet.\\nAt the “next one of these [DPS-EPSC meetings], we’ll be talking about finding Planet Nine instead of just looking for it,” added Brown, who’s based at the California Institute of Technology (Caltech) in Pasadena.\\nThat would be a pretty quick path from hypothetical planet to confirmed world. The existence of Planet Nine was seriously proposed for the first time just in 2014, by astronomers Scott Sheppard and Chadwick Trujillo, of the Carnegie Institution for Science in Washington, D.C., and the Gemini Observatory in Hawaii, respectively.\\nSheppard and Trujillo noted that the dwarf planet Sedna, the newfound object 2012 VP113 and several other bodies far beyond Pluto share certain odd orbital characteristics, a coincidence that would make sense if their paths through space had been shaped by an unseen, giant “perturber” in the region.\\nResearchers say an anomaly in the orbits of distant Kuiper Belt objects points to the existence of an unknown planet orbiting the sun. Here’s what we know of this potential “Planet Nine.”\\nCredit: by Karl Tate, Infographics artist\\nThe researchers suggested that this putative planet is perhaps two to 15 times more massive than Earth and lies hundreds of astronomical units (AU) from the sun. (One AU is the Earth-sun distance, about 93 million miles, or 150 million kilometers.)\\nThis interpretation was bolstered in January of this year by Brown and fellow Caltech astronomer Konstantin Batygin, who found evidence of a perturber’s influence in the orbits of a handful of additional distant objects. This “Planet Nine,” as Batygin and Brown dubbed the putative world, likely contains about 10 Earth masses and orbits on a highly elliptical path whose aphelion (farthest distance from the sun) is about 1,000 AU, the researchers said. (For perspective, Pluto gets just 49.3 AU from the sun at aphelion.)\\nThe evidence for Planet Nine’s existence has continued to grow over the past nine months, as several different research teams have determined that the orbits of other small, distant objects appear to have been sculpted as well.\\nOne team, led by Renu Malhotra of the University of Arizona, discussed four such objects at the DPS/EPSC meeting Wednesday. And Brown’s team, led by Elizabeth Bailey of Caltech, announced at the meeting on Tuesday (Oct. 18) that Planet Nine appears to have tilted the orbits of all eight “official” planets by 6 degrees relative to the sun.\\n\\nThe ongoing Planet Nine research also includes efforts to pin down where the world might be in the sky these days. This is a key part of the discovery effort, since a blind search for an object so far away, and with such a huge and elliptical orbit, has little chance of success in the near term, Brown has said.\\nIt’s likely that Planet Nine is currently at or near aphelion, located perhaps 1,000 AU from the sun, in a patch of sky measuring about 400 square degrees, Brown said. (For comparison, the full moon viewed from Earth covers about 0.5 degrees of sky.)\\nAstronomers have said Planet Nine is perhaps four times wider than Earth, and such an object would be easily visible with professional-grade equipment if it were relatively close to Earth, Brown explained. In addition, planets on highly elliptical orbits spend most of their time near aphelion, since they’re traveling most slowly on this part of their path, he said.\\n\\nAn object four times bigger than Earth that’s located at 1,000 AU would have a magnitude of about +25 on astronomers’ brightness scale, Brown added.\\n“This is well within reach of the giant telescopes,” he said. “The Subaru telescope, I think, on Mauna Kea, [in Hawaii]— the Japanese national telescope — is the prime instrument for doing the search. But there are a lot of other people who have clever ideas on how to find it, too, that are trying with their own telescopes.”\\nSo which research team will ultimately find Planet Nine? Brown said he isn’t sure, and he stressed that getting credit for the historic discovery should be a secondary concern for astronomers.\\n“There are a lot of people looking, and we are trying as hard as we can to tell people where to look,” he said. “We want it to be found.”\\nFollow Mike Wall on Twitter @michaeldwall and Google+ . Follow us @Spacedotcom , Facebook or Google+ . Originally published on Space.com . \\nSource: Space.com \\n'"}, "time": 1742563317.2430143}