{"duration": 0.05668783187866211, "input_args": {"text": "'MECHANICSBURG, Pa.  —   Donald J. Trump unabashedly trumpeted his support for warmer relations with Russia at a campaign rally here on Monday night, acidly mocking opponents who say he is too friendly to Vladimir V. Putin, the country’s strongman president. Mr. Trump, who has been under fire from Democrats and some conservative national security leaders for his accommodating stance toward Mr. Putin, cast his supportive remarks as a matter of practical necessity. By aligning itself with Russia, he said, the United States could more easily take on the Islamic State and other terrorist groups. “If we could get Russia to help us get rid of ISIS  —   if we could actually be friendly with Russia  —   wouldn’t that be a good thing?” Mr. Trump, the Republican presidential nominee, said. Repeating the question moments later, he won loud applause from the crowd: “If we could get along with Russia, wouldn’t that be a good thing, instead of a bad thing?” Noting that Mr. Putin had made laudatory comments about him, Mr. Trump teased political rivals, including Hillary Clinton, the Democratic presidential nominee, who have criticized his friendliness with the Russian leader. “They say, ‘Putin likes Trump,’” Mr. Trump began. He continued the mimicry: “How dare he like Putin? How dare he?” Mr. Trump also reiterated his view that NATO, the security alliance formed as a bulwark against the Soviet Union, was “obsolete. ” Both Mrs. Clinton and her running mate, Senator Tim Kaine of Virginia, have chastised Mr. Trump for praising Mr. Putin, and Mr. Trump has raised concerns among defense experts for repeated comments that appear to signal tolerance of Russia’s aggression in Eastern Europe. In an appearance on “This Week” on ABC News over the weekend, Mr. Trump declined to express disapproval of Russia for its annexation of the Ukrainian territory of Crimea in 2014. On the contrary, Mr. Trump suggested that the people there might be happier under Russian rule. And the Republican nominee said in an interview with The New York Times in July that he would not necessarily come to the defense of NATO states in the event of invasion, and would decide based on whether the country in question had paid its dues to the alliance. Mr. Trump also touched off an uproar during the Democratic National Convention last week when he said in a news conference that he hoped Russian hackers would infiltrate Mrs. Clinton’s email. He later said he was being sarcastic. With his appearance in Pennsylvania on Monday, Mr. Trump showed no intention of abandoning his embrace of Mr. Putin and his country. He professed disbelief that political opponents have said he should swear off Mr. Putin. “He said nice things about me,” Mr. Trump said. “Why would I disavow it? Why?” He derided Mrs. Clinton at length and accused her Democratic primary opponent, Senator Bernie Sanders of Vermont, of having made a “deal with the devil” to support her in the general election. “She’s the devil,” Mr. Trump said of Mrs. Clinton.'"}, "time": 1742562422.9512634}