{"duration": 0.03161048889160156, "input_args": {"text": "'More than a century after Georgetown University used some of the profits from the sale of 272 enslaved   to help ensure its survival, John J. DeGioia, the university’s president, took a first step on Monday toward making amends to their descendants. He walked into the public library in Spokane, Wash. for a private meeting with Patricia   a     of Nace and Biby Butler, two of the slaves who were sold in 1838 to help keep the college afloat. The   meeting, which was followed by a lunch at the nearby Davenport Hotel, may well have been a historic one. More than a dozen universities have recognized their ties to slavery and the slave trade. But historians say they believe this is the first time that the president of an elite university has met with the descendants of slaves who had labored on a college campus or were sold to benefit one. “I came to listen and to learn,” Mr. DeGioia said in an interview, describing the discussion as “moving and inspiring. ” Ms.   an amateur genealogist and retired teacher, said she believed Mr. DeGioia was willing to take necessary steps “to honor the sacrifice and legacy” of her ancestors. “He asked what could he do and how could he help,” she said in an interview. “It was a very good beginning. ” The meeting comes as officials at Georgetown continue to grapple with how to address the college’s complicity in the slave sale. The slaves, who were owned by the Jesuit priests who founded and ran the college, were sold for about $3. 3 million in today’s dollars. A portion of the profit  —   about $500, 000  —   was used to help pay off Georgetown’s debts at a time when the college was struggling financially. The slaves, who had lived on Jesuit estates in Maryland that had helped to finance the college’s operations, were uprooted and shipped to plantations in Louisiana. A working group assembled by Mr. DeGioia in September has been considering whether the university should apologize for profiting from slave labor, create a memorial to those enslaved, or provide scholarships for their descendants, among other possibilities. The report is expected to be released this summer, Mr. DeGioia said. Craig Steven Wilder, a historian at the Massachusetts Institute of Technology who has studied the roots of elite universities in slavery, said he did not know of another instance in which a university president had reached out to descendants. “Georgetown has made a decision to recognize the humanity of the problem they’re dealing with, to treat it as more than a public relations problem,” Mr. Wilder said. The search for descendants of the men, women and children sold in 1838 intensified in the fall after Georgetown students called on the university to remove the names of the Rev. Thomas F. Mulledy and the Rev. William McSherry from two campus buildings. The priests were two of Georgetown’s early presidents. Both were involved in the slave sale. Mr. DeGioia, who had already called for a campuswide discussion about the college’s roots in slavery, agreed to change the names of the buildings. The student protests inspired a Georgetown alumnus, Richard J. Cellini, to found a nonprofit, the Georgetown Memory Project, to help identify and support the descendants of the people who were sold. Mr. Cellini hired eight genealogists, including Ms.   and several researchers who are working with her. University officials are also identifying descendants of the slaves. Ms.   said that she made a point of telling Mr. DeGioia what she knew about her ancestors and emphasizing the importance of the university’s archival records. This year, Georgetown created an online archive that includes records that describe the slave sale and the Jesuit and Louisiana plantations. “These were real people,” Ms.   said of her enslaved forebears, “and I wanted to put faces on them for him. ”'"}, "time": 1742628511.0973575}