{"duration": 0.1158292293548584, "input_args": {"text": "'. She Drank a Gallon of Water/Day for a Month and Now She Looks 10 Years Younger Sufficient daily water intake is vital for virtually every function within our bodies yet fewer than... Print Email http://humansarefree.com/2016/11/she-drank-gallon-of-waterday-for-month.html Sufficient daily water intake is vital for virtually every function within our bodies yet fewer than one in five of us drinks enough. Read on to see the results of this experiment. Sarah Smith is a 42 year old mother of two young kids in the UK. She, like many others, openly admitted to not drinking the recommended 2 to 3 liters of water daily. She suffered from poor and sluggish indigestion and regular headaches. Following consultations with medical professionals for both issues she decided to take heed of the advice given – in both cases she had been told that she needed to up her intake of water . She decided to document and photograph what happened in a self imposed experiment whereby she would drink 3 liters, just over 5 pints, of water per day, every day for an entire month and see if she could feel any benefits.At the outset Sarah took a long hard look at her face noting that: “I am 42, but have to admit I look more like 52 in this picture, which is shocking. There are dark shadows under and around my eyes, which make me look exhausted, a profusion of wrinkles and strange reddish blotches, and my skin lacks any lustre. It looks dead… even my lips look shrivelled.” She spread the water out during the day aiming to drink a big jug of water in the morning, another in the afternoon with a third in the evening.At the end of the FIRST WEEK she had already noticed that her bowel function was improved and her urine was virtually clear as the water was flushing out her previously dehydrated poorly functioning kidneys. She noticed sudden skin breakouts, which were a result of the toxins being eliminated from throughout her body. However, her headaches were already gone and her previous joint stiffness first thing in the morning was vastly improved. Water is vital for lubricating the joints. WEEK TWO saw an improvement in her skin tone and general complexion although she noted that her eyes were still wrinkled but said “they look less crepey and shadowy than before”. She also had a visibly flatter stomach and her smart husband paid her the ultimate compliment by noting that her cellulite had vanished! Significantly she had another week headache free.On to WEEK THREE when Sarah was happy to find that her eye wrinkles and dark circles had all but disappeared and her skin was plumper and healthier looking.She noted that she was actually eating less by this stage as she had fallen into the common trap of reading signals from her stomach as being hunger pangs whereas they were actually thirst pangs. Research has shown that 37 per cent of people actually mistake thirst signals for hunger signals. The plentiful water had now stopped her from continually falling into that unhealthy trap.So what about the end of WEEK FOUR ? Sarah said: “I genuinely can’t believe the difference in my face. I look like a different woman. The dark shadows around my eyes have all but disappeared and the blotches have gone. My skin is almost as dewy as it was when I was a child. The transformation is nothing short of remarkable.” She was leaner, fitter and nobody can deny the astonishing change to her appearance. She changed nothing else in her daily routine apart from the water intake. To those already of you already converted to drinking enough water these results will merely confirm what you already know, but to anyone who is guilty of not doing so, will this persuade you to try this for yourself? Alexander : Since we have addressed the miraculous rejuvenating power of water, here is one more mind-blowing fact. According to Gregg Prescott of In5D.com , he was able to restore his hair\\'s original color after only six months of drinking distilled water . In his own words: \"In August of 2010, I was 2 months away from turning 50 and my hair was predominantly gray, with pronounced lines around my eyes. This is when I began to be conscientious about my eating habits and started eating more organic food, although I was still eating processed food as well. I began drinking distilled water in February 2012. By August of 2012, my hair had turned from gray back to its original color and the facial lines were not as pronounced.\" And the results are fantastic! Here\\'s a before and after comparison: You can buy a good quality water distiller from Amazon for about $200, which is not that much considering the benefits. Source and references: worldtruth.tv ; dailymail.co.uk ; humansarefree.com  '"}, "time": 1742564523.5873518}