{"duration": 0.05536198616027832, "input_args": {"text": "'A short investigation was launched after a Travis County judge wore a pink, knitted “pussy hat” in her courtroom late in January causing, some to doubt her impartiality from the bench. [Travis County Judge Sarah Eckhardt started her session on January 24 by putting on the pink knitted hat that has become associated with the Women’s March protests  held the day after Donald J. Trump took the oath of office to become the 45th president of the United States.  The judge’s shocking partisanship was first noted by Reddit users and soon caused residents to quiz Texas authorities as to whether or not a sitting judge is allowed to wear partisan political paraphernalia on the bench. Travis County Judge Wears ”Pussy Hat” During Court Hearings. could you expect to have a fair trial especially as a man if you saw this? pic. twitter.   —   Joe Biggs (@Rambobiggs) January 30, 2017,  Local Austin TV station KVUE claimed that several county officials told them that Eckhardt didn’t break any rules other than that of propriety.  Eckhardt has been known as a liberal, activist judge in the past. In June of last year, Eckhardt used a naturalization ceremony to attack Donald Trump, the Second Amendment of the U. S. Constitution, and the death penalty. At one point during the ceremony, the judge urged the newly sworn citizens to register to vote so they could vote against Donald Trump. Her bald attempt to politicize the ceremony rankled some participants. In October of 2015, Eckhardt met with activists for illegal aliens who were seeking help to quash a lawsuit filed by the state of Texas against the Obama administration over its executive amnesty program that would allow up to five million illegal aliens to remain in the United States without fear of deportation. Also in October, Eckhardt insisted that the state’s lawsuit was only being waged by “those who wish to play politics with peoples’ lives” and that Travis County’s economy was a success only because it is “built on immigration. ” Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742562236.8252287}