{"duration": 0.0636906623840332, "input_args": {"text": "'\\nFox News reported : \\nFive police officers and yellow caution tape surround Donald Trump’s Hollywood Walk of Fame star — or what’s left of it. \\nThe Los Angeles police say they are investigating the smashing of Trump’s star following footage that showed the sidewalk tribute was destroyed with a pickax. \\nDet. Meghan Aguilar says investigators were called to the scene before dawn Wednesday. \\nBy mid-morning, an LAPD spokesperson at the scene told FOX411 the Chamber of Commerce was sending out a crew in the hopes of getting the star repaired as soon as possible. \\n“Investigators are looking at [a] felony vandalism [charge] because of the value which the Chamber of Commerce has placed [on the star] at $2,500…” the spokesperson told us. “As soon as investigators can positively identify the suspect, which they are very sure they can do… they will go ahead and make a decision whether they want to arrest that suspect or seek a warrant.” \\nFox411 spoke with a worker from Top End Construction who told them that the damage done to Trump’s star was “probably the worst I have seen.” \\nA man named Jamie Otis has taken responsibility for the destruction, according to Deadline Hollywood, which posted a video of the man taking a pickax to Trump’s star. \\nAccording to Deadline, Otis planned to auction off the star and give the money to the 11 women who have come forward with groping allegations against Trump just weeks before the presidential election. \\nTrump has denied the groping allegations and it’s painfully obvious that they are almost assuredly politically motivated . As far as what the women get out of it, some may be politically motivated themselves and others have had their ulterior motives — money , fame, payback because Trump didn’t go to their restaurant, etc. — exposed. \\nHollywood Chamber of Commerce President and CEO Leron Gubler made it clear that his organization “intends to prosecute to the full extent of the law,” whoever is found to be responsible for the damage.” \\n“The Hollywood Walk of Fame is an institution celebrating the positive contributions of the inductees,” Gubler stated. “When people are unhappy with one of our honorees, we would hope that they would project their anger in more positive ways than to vandalize a California State landmark.” '"}, "time": 1742562158.5482373}