{"duration": 0.15374088287353516, "input_args": {"text": "'by Colaborama \\nWe have been very, very suspicious of Donald Trump since he began his political run. \\nMany believed he was an outsider who was our “only hope” to tame the US federal government beast. But it has become very clear he is not. \\nFirst, Wikileaks showed that Killary herself actually approved Trump to be her competitor. According to an email sent from an assistant at the Clinton campaign, Hillary was aware that Trump was going to run before the political process was fully underway. \\nClinton advised the mainstream media to push his legitimacy as a “pied piper” candidate because she realized, after looking at the poll numbers, that she wouldn’t stand a chance at winning the presidency against any of the establishment republicans without making them “pied pipers” – it just so happened that Donald was the easiest to play the role considering his long history of friendship with the Clintons. \\nIn addition, the mainstream media was more than complicit in creating a narrative that the 2016 presidential elections were about Hillary Clinton vs Donald Trump from the get go. \\nBut, barely reported in the media, was that after the 3rd presidential debate, Clinton and Trump went out for a night on the town together… and where they went is of great interest. \\nThey went to an annual Jesuit function which is usually full of New World Order types. \\nTHE JESUITS \\nOne of the more interesting things that occurred right at the end of the Jubilee year in early October, was that the Jesuits installed a new Superior General, with the date to commence being actually at midnight on the end of Jubilee. \\nWe found this interesting because there is plenty of evidence that the Jesuits are at least one major arm of what you can call the illuminati. \\nIn fact, the Jesuits were founded in Spain by what various reports call “crypto Jews” – those who are Jewish but pretending to be Catholic. Certainly at that time in Spain it was safer not to be a Jew. \\nEven Wikipedia, which wouldn’t recognize a conspiracy if it were directly presented by its participants has this to say about the Jesuits: \\n… In the first 30 years of the existence of the Society of Jesus there were many Jesuit conversos (Catholic-convert Jews) including the second Father General Diego Lainez … The original founder Ignatius … said that he, “would take it as a special grace from our Lord to come from Jewish lineage.” \\nAt the beginning of the Al Smith dinner party after Cardinal Dolan was introduced, a joke was even made by a speaker that “everyone in attendance is doing their part in supporting their charitable efforts and that it couldn’t be done without the support of many of the other devoted “Catholics” on stage like Henry Kissinger, Howard Rubenstein, and Mort Zuckerman” – all of whom are obviously Jewish so this remark was naturally met with a lot of laughter… \\nIn fact, an extraordinary amount of controversy swirls around Jesuits. They are said to constitute the “Black Church” and thus adhere to the same Satanic religion as the world’s elite bankers supposedly hold. \\nThe leader of the Jesuit order is commonly recognized in conspiratorial circles as the “Black Pope” whose signature staff is a crooked cross. Historically, the Jesuit Order has been seen as one that shirks no crime in expanding the power of the Church. \\nLest this sound entirely outrageous, one must note that the Jesuits are, for instance, the inventors of concentration camps, which they established in Paraguay in order to incarcerate and then torture the native indians of the area. \\nBut the litany of attributed Jesuit evil is even darker than that according to those who believe in the order’s continued malicious pursuit. The supposed founder of the Bavarian-based Illuminati, Adam Weishaupt, was a Jesuit. \\nIn fact, the order is reputed to have been deeply involved in the Illuminati’s initial expansion, and chances are it is still deeply involved. \\nOne more thing that highlights the evil of the Jesuits is their extreme oath of induction which all superiors must take in order to be elevated to the higher rungs of the organization. This is taken from the book Subterranean Rome by Carlos Didier, translated from the French, and published in New York in 1843 and reads in part, \\n“…promise and declare that I will, when opportunity present, make and wage relentless war, secretly or openly, against all heretics, Protestants and Liberals, as I am directed to do, to extirpate and exterminate them from the face of the whole earth; and that I will spare neither age, sex or condition; and that I will hang, waste, boil, flay, strangle and bury alive these infamous heretics, rip up the stomachs and wombs of their women and crush their infants’ heads against the walls, in order to annihilate forever their execrable race. That when the same cannot be done openly, I will secretly use the poisoned cup, the strangulating cord, the steel of the poniard or the leaden bullet, regardless of the honor, rank, dignity, or authority of the person or persons, whatever may be their condition in life, either public or private, as I at any time may be directed so to do by any agent of the Pope or Superior of the Brotherhood of the Holy Faith, of the Society of Jesus…” \\nOne of the most poignant quotes regarding the malevolence of the Jesuits comes from Marquis de LaFayette 1757-1834; who was a French statesman and general who served in the American Continental Army under the command of General George Washington during the American Revolutionary War. \\nHis quote is as follows: \\n“It is my opinion that if the liberties of this country – the United States of America – are destroyed, it will be by the subtlety of the Roman Catholic Jesuit priests, for they are the most crafty, dangerous enemies to civil and religious liberty. They have instigated MOST of the wars of Europe.” \\nTHE BIG BASH \\nWhen evaluating Jesuit behavior and influence, please keep in mind that both Donald Trump and Hillary’s VP, Tim Kaine, are Jesuit educated. And it should be of GREAT interest, therefore, that practically on the eve of the US election, Donald Trump and Hillary Clinton partied the night away at a Jesuit function that included such prominent Jesuit-trained attendees as Henry Kissinger. \\nNot only did the two not look like sworn enemies… they looked like two star crossed lovers going to their first prom. \\nWe have long held to our stance that Killary will be the next President of the US. The amount of vote rigging, murders and shenanigans to even get her to where she is so far has been tremendous… and it won’t stop. \\nThat said, if by some fluke, and the Diebold machines malfunction or people in the US wake up slightly and Donald Trump gets elected… it is pretty clear they are on the same team and, as we’ve said previously, nothing major will change. \\nSo, if you were hoping that this election could change things in the US… get over that hope right now. It might change things, but only for the much, much worse. \\nThis charade is being played right in front of everyone’s eyes and most do not understand what is happening or why jokes like the “Catholic” joke is actually funny to these elite people. \\nThey are laughing at the peasants stupidity and lack of understanding, not because the men mentioned are Jews… anyone with half a brain knows that. \\nBut while they laugh, we’ll be laughing all the way to the bank ourselves. Just because these sick people are formulating diabolical plans to enslave humanity doesn’t mean we can’t profit from their planned chaos. It’s better than sitting back in ignorance and making nothing. \\nOur analysis of these elite’s occult timelines which began with the Shemitah and culminated with the Jubilee, have helped us to accumulate around a 200% collective return on our portfolio in the last year. \\nSubscribe to The Dollar Vigilante newsletter HERE to continue to receive the best insights into the inner workings of groups like the Jesuits and other arms and actions of the world’s financial elite and how to protect yourself and profit from it. \\nThe groundwork for global governance has been laid, don’t let them blindside you as they attempt to carry out their nefarious plot. Donald Trump even stated at the dinner, “We’ve got to come together, not only as a nation, but as a world community.” \\nPromotion of the globalist new world order. \\nThey want to keep you ignorant and powerless because after all, knowledge is power. \\nEducate yourself by joining the worldwide group of dollar vigilantes who can help you expatriate and offer advice on how to protect yourself by purchasing precious metals, bitcoin and other hard assets here. Above image – the chief staff of EU paying homage to their emperor, the Jesuit pope. \\nHere are some earlier related articles with information about the Jesuits from PFC \\nPartial Disclosure Is NOT an Option'"}, "time": 1742563576.5762203}