{"duration": 0.04617738723754883, "input_args": {"text": "'\\nThis article was written by Paul Joseph Watson and originally published at Infowars.com . \\nEditor’s Comment: Violence and retribution for the election of Trump has proven to be the result of a media-driven attack on his character. For months now, the pundits and columnists have done nothing but tell the population that Trump supporters are racists, etc. and now racially-motivated beatings are taking place in the street without any other pretext or provocation. \\nAre they proud of themselves yet? And how far will this violence spread? \\nShock Video: Black Mob Viciously Beats White Trump Voter \\nby Paul Joseph Watson\\nShocking video out of Chicago shows a mob of young black men viciously beating an older white man because he voted for Donald Trump, dragging him through the streets as he hangs out of the back of his car.\\n\\nThe clip shows the thugs repeatedly screaming, “you voted Donald Trump” as they assault the victim from every angle while others steal his belongings.\\n“You voted Trump,” the mob screams, “You gonna pay for that sh*t.”\\nAnother woman shouts “beat his ass,” while another man is heard laughing before remarking, “Don’t vote Trump.”\\nA second video of the incident which is dubbed with the “F**k Donald Trump” song, a phrase now being chanted by “protesters” across the country, shows one of the attackers driving away in the man’s vehicle while his hand is still stuck in the window as the car drags him down the street.\\n\\n“The scene is frankly reminiscent of a lynching,” remarks Chris Menahan .\\nIt is not even clear if the victim was a Trump supporter. Presumably, the mob used that as an excuse to beat and rob him.\\nYouTube quickly deleted the video, but it has been mirrored on numerous different websites.\\nIf the roles had been reversed, and Trump supporters had been caught on tape viciously beating a black Hillary voter, this would be a national news story right now.\\nAs it is, you won’t see this on CNN any time soon.\\n——\\nThis article was written by Paul Joseph Watson and originally published at Infowars.com . \\nPaul Joseph Watson is the editor at large of Infowars.com and Prison Planet.com .'"}, "time": 1742564111.8554742}