{"duration": 0.04762840270996094, "input_args": {"text": "'Those who dislike partisan politics at   awards show have been warned in advance of Sunday night’s Grammy Awards, as producer Ken Ehrlich has made it clear that music’s biggest night will encourage   artists to express themselves in any way they choose. [“One of the tenets of our show is artistic freedom, and over the years we’ve shown we do believe in it,” Grammys producer Ken Ehrlich said this weekend in an interview with Variety. “How many more times do we need to hear ‘I’d like to thank my publicist, my agent, my wife and kids.’ The great acceptance speeches are ones that have a point of view and are more personal. ”  Sunday night’s 59th annual Grammy Awards has been billed as a showdown between Beyoncé and Adele, both up for Album of the Year, but plenty of music’s biggest stars will be on hand in what could become a   ceremony. Beyoncé leads all artists with nine nominations this year for her Black Lives   album Lemonade, while Drake, Rihanna, and Kanye West each earned eight nods. The Grammys have featured plenty of politics in recent years in 2014, 33 gay and straight couples were married during the ceremony as Macklemore and Ryan Lewis sang their hit LGBT anthem “Same Love,” while 2015 saw President Obama appear in a     PSA and last year saw rapper Kendrick Lamar delivering a   rendition of his hit song “The Blacker the Berry” from an elaborate prison set. If Ehrlich’s show follows a similar path this year, Grammy viewers could be in for another night of fiery acceptance speeches and defiant performances, especially in the show’s first broadcast since Donald Trump became president. “One of the things I’ve learned from working with artists for 40 years is that they are   vital individuals who have interests that cover a broad spectrum of subjects and passions,” Ehrich told Variety. “We should certainly allow for it on the broadcast. ” The Grammys are hardly the only awards show to heavily feature politics just last month, numerous actors used the podium at the Screen Actors Guild Awards to criticize President Trump’s executive order on immigration. And in the first awards show of the year, Meryl Streep drew thunderous applause for an impassioned   speech while accepting a lifetime achievement award at the Golden Globes. The 59th annual Grammy Awards air Sunday night at 8 p. m. Eastern on CBS.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742562606.3334994}