{"duration": 0.09235048294067383, "input_args": {"text": "'Pamela Geller, president of the American Freedom Defense Initiative, joined SiriusXM host Raheem Kassam on Friday’s Breitbart News Daily. The conversation began with her thoughts on the previous night’s airstrike against Syria. [“I’m deeply concerned. I don’t understand it,” Geller said. “It seems like a   reaction. It doesn’t speak to a coherent policy. It seems to me that Trump has switched sides. ”  LISTEN: “It does seem that way,” Kassam agreed. “This is what I’ve been saying for now the last 48 hours: there seems to be a malign influence on him. He’s saying things like, hey, we can get you really good coverage. CNN will stop writing ‘Trump’ on its chyron, they’ll start writing ‘President Trump’ on its chyron. Time magazine will put you on the front, and this time it won’t be scary or a joke. We’ll make you look like a leading statesman around the world. All you have to do is compromise on every single thing you said during the campaign. ” “Yeah,” Geller said with a rueful laugh. “I mean, I’m laughing, but I’m laughing with blood. It’s not funny. ” “I don’t know when he began to care. I mean, that was the beauty of Trump. For those of us that have been in the trenches, you have to become inured to this kind of withering criticism. You have to develop a crocodile skin. He seemed to have it. He seemed to have come to the party with it. It was really sort of the most fantastic thing about him,” she said. “On the one hand, I always console myself with, ‘It’s not Hillary.’ That’s always my mantra. It’s my religion,” she said. “But this really, I think, is a terrible mistake. Back in 2012, my organization American Freedom Defense Initiative, issued a call to President Obama and to the United Nations warning of an impending genocide in Syria. I’ve been acutely aware of what’s going on in Syria. They did nothing, and millions of Christians and religious minorities were slaughtered. I don’t understand this visceral response. And what is the objective? Who are we partnering with? What   ‘rebel gang’  —   is it  ? Which   satellite are we partnering with?” She shared Kassam’s skepticism about the size of the truly “moderate” rebel force in Syria, and whether Western intelligence services could identify real moderates and work with them effectively. Kassam noted ISIS,   and the other “real, real enemies” of the United States were celebrating the attack, and asked what conclusions should be drawn from it. “It tells us that we don’t know what we’re doing there,” Geller replied. “I don’t know what we’re doing there. I understand the   ‘humanitarian,’ but I’m always first and foremost concerned about national interest. What is the national interest of this for us?” “Look, Obama gave Syria to Russia. He did. He gave it to Russia, and so this could very well escalate into something truly unforeseen,” she warned. “I just think the United States should have taken action in a comprehensive, and logical, and strategic way years ago. Right now, it’s just a huge catastrophe, and what’s he doing? Is he putting a finger in the dam? I don’t think so. I don’t even think it’s that. Is it just this action?” Geller stressed that it was President Barack Obama’s policies that led to this moment.  “He turned Syria over to Russia, and so this could escalate to World War III, and for what? For Syria? Seriously?” she said. “My concern is that like President Bush, President Trump has two factions warring with each other. In the case of President Bush, it was    Bolton, the hawks as it were, versus the trimmers, versus the RINOs like Colin Powell, Condi Rice, Hadley Burns,” she judged. “And the trimmers always win, because it seems like the safe bet. It seems like the   ‘extremists’ are taking it a step too far. ” “But the fact of the matter is, it’s the trimmers that get you into trouble, because you can’t have a bold policy, you can’t go after a bold policy ” Geller warned.  “I’m concerned about McMaster, who is just another one who denies the motivating ideology of the terrorists,” she said of President Trump’s National Security Adviser. “He says jihad terror is not Islamic. This hampers our ability to respond to terrorism effectively. You can’t defeat an enemy that you don’t understand. ” Geller and Kassam found this a contradiction of Trump’s campaign promise to speak forthrightly about the dangers of radical Islamic terrorism. “He promised to deal effectively with the terrorism problem and call it Islamic,” Geller recalled. “This is exactly what Obama and Hillary refused to do. McMaster represents a defeat for the Trump promise to drain the swamp. It’s a retreat from his stated goals. Believe me, it pains me to say this. It gives me no pleasure. ” “And Mattis, that ‘terrorism defames Islam’  —   what book are they reading?” she added. “Are they not reading the Koran? I mean listen, just because you talk about it this way doesn’t mean that all Muslims are terrorists. But we don’t have to pat on the back every Muslim that doesn’t want to kill us. ” “Do you think Jared Kushner or Dina Powell has ever read the Koran   ? Do they understand the enemy?” Kassam asked, referring to President Trump’s    and deputy national security adviser for strategy, respectively. “No, I think Kushner’s a Manhattan liberal. That’s what I think,” Geller replied. “And I think that he may be a very smart kid, but that’s got nothing to do with the price of eggs in China. I think that he has undue influence. I think that’s why you’re seeing these moves with the settlements in Israel, the   ‘  solution,’ inviting these Palestinian terrorists into this country  …    ” Kassam interjected to suggest adding Ivanka Trump’s reported meetings with Planned Parenthood to the list. “Yes, this is Kushner. I don’t know how much we’re going to have to lose before Trump gets back on track. He’ll have to get back on track, because we’ve suffered under these failed policies, for the past really 15 years,” Geller said, quoting Albert Einstein’s famed admonition that “doing the same thing over and over again and expecting a different result” is the definition of insanity. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. Listen to the full audio of the interview above.'"}, "time": 1742563808.5277722}