{"duration": 0.0843498706817627, "input_args": {"text": "\"Iraq Iraqi forces gather near the village of Sin al-Dhuban, south of Mosul, on October 27, 2016, during an operation to retake the city from Takfiri Daesh militants. (Photos by AFP) \\nIraq’s Joint Operations Command (JOC) has announced that more than 700 Takfiri militants have been killed and nearly two dozen others arrested ever since government forces and allied fighters launched a massive operation to dislodge the terrorists from the northern city of Mosul. \\nA total of 772 Daesh terrorists have been killed and 23 others arrested since the offensive to liberate Mosul, located some 400 kilometers north of the capital Baghdad, was kicked off on October 17, the JOC said in a statement released on Thursday. \\nThe statement added that 127 car bombs, 27 makeshift mortar launchers, seven explosive belts and a large weapons cache were also destroyed during the mentioned period. \\nFurthermore, four booby-trapped houses, 397 explosive devices and five motorcycle bombs were blown up, while three tunnels, a command center for terrorists, 40 defensive fighting positions, seven airstrike-resistant bunkers and three Dushka heavy machine guns were destroyed. \\nThe JOC statement added that 1.5 tons of ammonium nitrate, nine 120mm mortar rounds, 380 mortar shells, 61 Katyusha rockets, 31 missile launchers, three PK machine guns and four anti-tank rocket-propelled grenade launchers were also confiscated. Iraqi pro-government forces hold a position near the village of Sin al-Dhuban, south of Mosul, on October 27, 2016, during an operation to retake the city from Takfiri Daesh terrorists. \\nThe Iraqi forces also destroyed four cannons, seized a caravan and four heavy machine guns and discovered two bomb-making workshops. \\nAlso on Thursday morning, Iraqi security forces managed to retake the village of Wadi al-Qasab in al-Shoura district and al-Hamza village in Hammam al-Alil district, both south of Daesh-held Mosul. \\nSeparately, the Iraqi Defense Ministry announced that 12 Daesh extremists were killed when fighter jets from the so-called US-led military coalition struck Mosul's al-Arabi neighborhood. \\nFifteen Daesh terrorist were also killed and two others injured when US-led military aircraft targeted a gathering of the militants in Suwayrah village of al-Shoura district, the ministry added. \\nMishraq sulphur factory extinguished \\nIn another development on Thursday, the Iraqi forces put out a fire at the Mishraq sulphur factory, located about 30 kilometers south of Mosul. This file photo taken on October 22, 2016 shows Iraqi forces attempting to extinguish flames after Daesh militants torched the Mishraq sulphur plant, near the Qayyarah base and about 30 kilometers south of Mosul. \\nLast week, Daesh militants set the factory on fire in a bid to prevent army and security units from making advances. \\nThere are reports that about 50,000 Iraqi ground troops are involved in the Mosul offensive, including 30,000 army troops, 10,000 Kurdish Peshmerga fighters and the remaining 10,000 from police and Popular Mobilization Units. \\nInternational aid agencies have warned that the military operation to retake Mosul has displaced about 10,600 people from their homes. \\n“Assessments have recorded a significant number of female-headed households, raising concerns around the detention or capture of men and boys,” said Lise Grande, the UN humanitarian coordinator for Iraq, on Tuesday. \\nShe noted that a huge exodus of people from Mosul could occur within the next few days, warning that Daesh terrorists could resort to “rudimentary chemical weapons” as part of efforts to hold up government forces. Loading ...\""}, "time": 1742561810.542306}