{"duration": 0.2349858283996582, "input_args": {"text": "'Os Estados Unidos vão reformar-se, ou dilacerar-se? Thierry Meyssan Ao observar a campanha eleitoral presidencial norte-americana, Thierry Meyssan analisa a ressurgência de um velho e grande conflito civilizacional. Hillary Clinton acaba de declarar que esta eleição não versava sobre programas, mas sobre a questão de saber «Quem são os Americanos?». Não é baseados em questões políticas que os tenores republicanos acabam de retirar o seu apoio ao seu candidato, Donald Trump, mas antes a propósito do seu comportamento pessoal. Segundo o nosso autor, até à data presente, os Norte-americanos eram emigrantes vindos de horizontes diferentes e aceitando submeter-se à ideologia de uma comunidade especial. É este modelo que está em vias de se desfazer, com o risco de estilhaçar o próprio país.\\nRede Voltaire | Damasco (Síria) | 26 de Outubro de 2016 français Español italiano русский English Deutsch ελληνικά Türkçe عربي No decurso do ano de campanha eleitoral norte-americana que estamos a acabar de atravessar, a retórica mudou profundamente e uma clivagem inesperada surgiu entre os dois campos. Se, à partida, os candidatos falavam de assuntos basicamente políticos (tais como a repartição de riqueza ou a segurança nacional), agora eles tratam principalmente de sexo e dinheiro.\\nFoi este discurso, e não as questões políticas, o que fez explodir o Partido Republicano –-cujos principais líderes retiraram o apoio ao seu candidato–- e que reformula o tabuleiro político, fazendo ressurgir uma clivagem civilizacional muito velha. De um lado, a senhora Clinton pretende ser politicamente correcta, enquanto do outro «O Donald» fez voar em estilhaços a hipocrisia da antiga «primeira Dama».\\nDe um lado, Hillary Clinton promove a igualdade homens/mulheres, muito embora ela jamais tenha hesitado em atacar e emporcalhar as mulheres que revelavam ter-se deitado com o seu marido; que se apresenta não pelas suas qualidades pessoais, mas enquanto esposa de um anterior presidente, e que ela acusa Donald Trump de misoginia porque ele não esconde o seu gosto pela espécie feminina. Do outro lado, Donald Trump denuncia a privatização do Estado, e a extorsão de personalidades estrangeiras pela Fundação Clinton, sempre que queriam obter acesso ao Departamento de Estado; a criação do ObamaCare, não no interesse dos cidadãos mas para benefício dos Seguros médicos; e vai até ao ponto de pôr em causa a idoneidade do sistema eleitoral.\\nEstou perfeitamente ciente que a maneira como Donald Trump se exprime encoraja de facto o racismo, mas não acho de todo que isto esteja no centro do debate eleitoral apesar do martelar que os média(mídia) pró-Clinton fazem a propósito.\\nNão é indiferente que, aquando do escândalo Lewinsky, o presidente Bill Clinton tenha apresentado as suas desculpas à Nação e tenha reunido Pastores para rezar pela sua salvação. Enquanto ao ser posto em causa por factos parecidos, numa gravação áudio, Donald Trump se tenha contentado a apresentar as suas desculpas às pessoas atingidas, sem fazer apelo a membros do clero.\\nA clivagem actual retoma a revolta de valores dos Católicos, de Ortodoxos, e de Luteranos, contra os dos Calvinistas, representados nos Estados Unidos principalmente pelos Presbiterianos, Baptistas e os Metodistas.\\nMesmo se os dois candidatos foram educados na tradição puritana (Clinton como Metodista e Trump como Presbiteriano), H.Clinton retornou à religião pela morte do seu pai e participa hoje em dia no grupo de oração dos chefes do estado-maior das forças armadas, The Family («A Família»- ndT), enquanto Trump segue uma espiritualidade mais interiorizada e não frequenta habitualmente os templos.\\nÉ claro, ninguém fica fechado nos padrões em que foi criado. Mas, quando se age sem reflexão, podemos reproduzi-los de forma inconsciente. A questão do ambiente religioso de cada um pode portanto ser importante.\\nPara entender o que está em jogo, é preciso voltar à Inglaterra do século XVII. Oliver Cromwell derruba, com um golpe de Estado militar, o rei Carlos Iº. Ele pretendeu instaurar uma República, purificar a alma do país, e assim fez decapitar o antigo soberano. Criou um regime sectário inspirado nas ideias de Calvino, massacrou os Irlandeses papistas em massa, e impôs um modo de vida puritano. Concebeu também o sionismo: ele chamou à atenção para os judeus em Inglaterra e foi o primeiro chefe de Estado, no mundo, a reivindicar a criação de um Estado judeu na Palestina. Este episódio sangrento é conhecido com o nome de «Primeira Guerra civil britânica».\\nApós a restauração da monarquia, os Puritanos de Cromwell fugiram da Inglaterra. Eles instalaram-se nos Países Baixos, de onde alguns de entre eles partiram a bordo do Mayflower para as Américas (os chamados “Pais Peregrinos\"), enquanto outros fundaram a comunidade Afrikaner na África Austral. Aquando da guerra de independência dos Estados Unidos, no século XVIII, reviu-se o confronto dos Calvinistas contra a Monarquia britânica, de tal modo que nos manuais actuais de História Britânica, designam-na como a «Segunda Guerra civil».\\nNo século XIX, a Guerra de Secessão opôs os Estados do Sul (sobretudo habitados por colonos católicos) aos do Norte (principalmente habitados por colonos protestantes). A História dos vencedores apresenta este confronto como uma luta pela Liberdade face à Escravatura, o que é pura propaganda (os Estados do Sul aboliram a escravatura durante a guerra, quando fecharam uma aliança com a monarquia britânica). Com efeito, regressa-se ao enfrentamento dos Puritanos contra o Trono inglês, razão pela qual certos historiadores falam aqui de uma «Terceira Guerra civil britânica».\\nDurante o século XX, este enfrentamento interno da civilização britânica parecia ultrapassado, fora o ressurgimento dos Puritanos ao Reino Unido com «os cristãos não-conformistas» do primeiro-ministro David Lloyd George. Estes últimos dividiram a Irlanda e dedicaram-se a criar o «Lar nacional judaico» na Palestina.\\nSeja como fôr, um dos conselheiros de Richard Nixon, Kevin Phillips, consagrou uma volumosa tese a estas guerras civis, constatando que nenhum dos problemas estava resolvido e anunciou uma quarta volta [ 1 ].\\nOs adeptos das Igrejas calvinistas, que desde há 40 anos votavam maciçamente pelos Republicanos, apoiam agora os Democratas.\\nEu não duvido que H. Clinton será a próxima Presidente dos Estados Unidos, ou que se Trump fosse eleito, ele seria rapidamente eliminado. Mas, em alguns meses, assiste-se a uma ampla redistribuição eleitoral sobre o fundo de uma evolução demográfica irreversível. As Igrejas vindas dos Puritanos não somam mais que um quarto da população e basculam para o campo Democrata. O seu modelo aparece como um acidente histórico. Ele já desapareceu na África do Sul e não poderá sobreviver ainda por muito mais tempo, nem nos Estados Unidos, nem em Israel.\\nPara além da eleição presidencial, a sociedade dos EUA deve evoluir rapidamente ou irá dilacerar-se novamente. Num país onde o juventude rejeita maciçamente a influência dos pregadores puritanos, não é mais possível mover a questão da igualdade. Os puritanos idealizam uma sociedade onde os homens são todos iguais, mas não equivalentes. Lorde Cromwell queria uma República para o Ingleses, mas só depois de ter massacrado os papistas Irlandeses. É assim que actualmente nos Estados Unidos, todos os cidadãos são iguais perante a lei mas, em nome dos mesmos textos, os tribunais condenam sistematicamente negros enquanto encontram circunstâncias atenuantes no caso de brancos tendo cometido crimes ou delitos equivalentes. E, na maioria dos Estados, uma condenação penal, mesmo por um excesso de velocidade, basta para retirar o direito de voto. Por conseguinte, brancos e negros são iguais, mas em alguns Estados, a maioria dos negros tem legalmente sido privada do seu direito de voto. O paradigma deste pensamento, em política externa, é a «solução de dois Estados» na Palestina: iguais, mas acima de tudo não equivalentes.\\nFoi o pensamento puritano que orientou as administrações do Pastor Carter, de Reagan, de Bush (o Sr. e o Jr. são dois descendentes directos dos “Pais Peregrinos”), de Clinton e de Obama a apoiar o wahabismo, em contradição com os ideais propagados pelo seu país, e hoje em dia a apoiar o Daesh(E.I.).\\nNo passado, os “Pais Peregrinos” fundaram comunidades em Plymouth e Boston, que foram mitificadas na memória colectiva americana. Contudo os historiadores são rigorosos. Eles afirmavam construir o «Novo Israel» e escolheram a «Lei de Moisés». Eles não colocaram a Cruz nos seus templos, mas, sim as Tábuas da Lei. Muito embora cristãos, atribuíam mais importância às Escrituras Judaicas que aos Evangelhos. Eles obrigaram as suas mulheres a tapar a cabeça com véu e restabeleceram os castigos corporais.\\nThierry Meyssan Tradução\\nAlva'"}, "time": 1742562381.8892708}