{"duration": 0.07014966011047363, "input_args": {"text": "\"We Are about to Witness the Biggest Supermoon Since 1948 Nov 10, 2016 0 0 \\nWe are to witness something amazing on the eve of November 14 . On that day, the distance between our planet and the moon will be the shortest in almost 70 years! The last time it happened was in January 1948. \\nEarth’s natural satellite will appear about 14% bigger and 30% brighter in comparison with an average full moon. It is estimated that the next supermoon of this size will take place on 25 November 2034 , so make sure you don’t miss this beautiful celestial event (if the weather conditions in your region are favorable for skywatching, of course)! \\nAs NASA reports: \\n“The full moon of November 14 is not only the closest full moon of 2016 but also the closest full moon to date in the 21 st century. The full moon won’t come this close to Earth again until 25 November 2034.” What Is a Supermoon \\nAlmost all celestial bodies have elliptical orbits; that’s why the distance between our planet and the moon is not always the same. The further side of the moon’s orbit is called apogee and the closer one is called perigee. In short, when a full moon occurs on the perigee, then we get a supermoon phenomenon , which causes our natural satellite to appear closer and brighter in the night sky. \\nWhile supermoons are quite frequent (this year, we will have three of those), the full moon of November 14 will be within approximately 2 hours of perigee , which makes it a truly rare phenomenon. How to Watch a Supermoon \\nA perfect location to enjoy the coming supermoon (as well as any other astronomical phenomenon) is somewhere away from the city so that the urban lights don’t interfere with skywatching. \\nDon’t forget that the difference between a regular full moon and a supermoon is best seen to the human eye when the moon is close to the horizon. \\nAccording to NASA, “ When the moon is near the horizon, it can look unnaturally large when viewed through trees, buildings, or other foreground objects.” \\nThe moon will be at the peak of its full phase and, therefore, will appear the biggest at 8:52am EST. For those of you living in Australia, the moon will reach its full phase at 12:52 a.m. AEST on November 15. Vote Up Anna LeMind Anna is the owner and lead editor of the websites Learning-mind.com and Lifeadvancer.com , and staff writer for The Mind Unleashed . She is passionate about learning new things and reflecting on thought-provoking ideas. She writes about technology, science, psychology and other related topics. She is particularly interested in topics regarding introversion, consciousness and subconscious, perception, human mind's potential, as well as the nature of reality and the universe.\""}, "time": 1742563165.283727}