{"duration": 1.651456594467163, "input_args": {"text": "'By Jameson Parker Election 2016 , Politics November 2, 2016 Trump Says His Favorite Book Is No Longer The Bible – His NEW Favorite Book Proves He’s A Narcissist   \\nIn August of 2015, while trying desperately to convince Evangelical Christians that he would be a better choice for president than the laundry list of other potential Republican candidates, Donald Trump made the outrageous claim that his favorite book was the Bible . He even placed his own book just behind it. “[The Art of the Deal] is my second favorite book of all time,” said Trump. “Do you know what my first is? The Bible! Nothing beats the Bible,” he added to applause. \\nThe feigned adoration for the Christian holy book was undone by the fact that Trump had quite literally never shown an interest in religion prior to that moment, couldn’t name a single New Testament passage when pressed, and years earlier once remarked that he didn’t believe adultery – one of the Ten Commandments – was a sin. \\nNow that Trump is the nominee and Christian conservatives have stood by him despite his disgusting hate campaign and torrent of sexual assault allegations, he’s apparently feeling a bit more confident. He doesn’t need to fake it anymore. It was fun while it lasted! \\nWhen asked by Extra ‘s A.J. Calloway what his favorite books were, Trump seemingly forgot that “nothing beats the Bible.” He put his own books back on top. When given a “rapid fire” quiz about his two favorite books, without hesitation Trump went with “The Art of the Deal” and “Surviving at the Top,” both of which were written by ghostwriters but with Trump getting a byline. \\nIt’s particularly interesting that Trump with “The Art of the Deal,” considering the man responsible for writing it has since disavowed Trump and now acts as his biggest critic . \\n“I put lipstick on a pig,” he said. “I feel a deep sense of remorse that I contributed to presenting Trump in a way that brought him wider attention and made him more appealing than he is.” He went on, “I genuinely believe that if Trump wins and gets the nuclear codes there is an excellent possibility it will lead to the end of civilization.” \\nAs with every answer Trump gives off-the-cuff, this one is very revealing. Here is a man so caught up in worshiping himself that when asked what his favorite book is he can only think of the ones with his own name on the covers. It really does say everything about his personality. \\nWatch Trump bumble his answer below: \\nFeatured image via Extra'"}, "time": 1742563721.273991}