{"duration": 0.06577420234680176, "input_args": {"text": "'November 18, 2016 \\nPrime Minister David Cameron has hailed the success of his Big Society programme, citing the example of South Oxhey Community Choir, which has been appointed to take control of all policing and crime issues in the area. \\nMr Cameron says: ‘The Big Society is about giving control of public services back to community groups and charities. What these local activists lack in experience, funding, training and competence they more than make up for with enthusiasm and their own gardening tools.’ \\nRobert Fette, the Musical Director of the Choir says, ‘We were actually bidding to run an after-schools music project for 8-16 year olds. But beggars can’t be choosers, so we’re going to combine our challenging programme of Tippet, Purcell and Britten with upholding law and order, detecting the perpetrators of serious crime and the random kettling of student protestors.’ \\nDuring one busy evening last week, a desperate 999 call redirected to the choir saw the tenors despatched to a local warehouse, where an abortive burglary had resulted in a security guard being held hostage by a desperate drug-addicted gunman. After the choristers used old police loud hailers to sing a couple of verses of ‘Stand By Me’, the gunman gave himself up. He has been promised that he can sing ‘Smack My Bitch Up’ in next month’s hugely anticipated community concert. \\n‘Our busy rehearsal schedule means that we cannot spend as much time as we would like preparing statements when cases come to trial, but at least our evidence is presented with a vibrant and ever-changing accompaniment of pop, gospel, classical and world music that certainly brightens up court proceedings.’ \\nElsewhere in the district, South Oxhey Cat Rescue has won control of the Meals on Wheels service previously provided by the council. Ms Moira Finnegan, who heads up South Oxhey Cat Rescue, says: ‘This is very exciting. Obviously it means the elderly will have to eat tinned cat food, but the way the cuts were shaping up, that was bound to happen anyway.’ \\nHowever, it is not all good news for Mr Cameron. The case against the gunman in the Oxhey warehouse siege collapsed after the judge in the case suspended the trial and went home to watch television. Judge Shanika Thompson, aged 9, said she was bored of volunteering to be a judge and asked if she could go back to being school library monitor instead. Share this story... \\nPosted: Nov 18th, 2016 by Fin Robertson Click for more article by Fin Robertson .. More Stories about: From The Archives 1'"}, "time": 1742563933.1548073}