{"duration": 0.07798933982849121, "input_args": {"text": "'10 Ways to Resist Right Wing Populism Stop Analysing and Act! By Paul Mason / medium.com I’m just one journalist covering the meltdown of the neoliberal world and the rapid slide to xenophobia and nationalism, in the UK the USA and parts of Europe. I’ll probably write one more big analysis of Trump and Brexit, but I’m aready sick of reading analysis articles by people who didn’t see this coming. They all boil down to the same thing: neoliberalism is fucked and the elite has no idea what to do faced with right-wing populism because they can’t imagine capitalism without inequality. This is my personal suggestion on what we, the global left, should do. 1. Protest. Young Americans, especially high school students, are on the streets right now. They didnt need to be told what slogans, or to ask permission, or wait for a statement from their leaders. They just went, scrawling placards saying #NotMyPresident. Let’s take that global. 2. Strike. Yes, strike. Trump’s inauguration day is Friday 20 January — a work day. Take it off and block the streets of your town. If you can get to Washington DC get there and block the streets. All across the world people are planning to mark #J20 with street protests and vigils — but we should do more. We should stop work in the first global mass strike against bigotry. 3. Boycott the companies actively supporting Trump. This means pressuring the companies who do business with them. Who takes ads on Fox, or in the British Sun or the New York Post? Boycott them until they stop. The Knights of Labor did this in the 1880s and it worked. 4. Build a new political alliance. The elite’s ideology is fucked. Their party systems are proved useless. Clinton outspent Trump — it didn’t matter. The left needs to up its game to either take control and renovate the progressive and socialist parties, or to rapidly replace them. Liberal centrist politicians need to stop attacking the left and make a strategic alliance with the left — understanding that xenophobic nationalism is the main enemy. 5. Kill neoliberalism. Every think tanker, investment analyst and policy adviser who comes out with bullshit about how the market-led system is best must be told: this is where it leads: to Trump, Brexit and Le Pen. Millions of people are sick of seeing wealth flow upwards and good jobs disappear and they will vote to end globalisation if that’s the only way to end the pain. To save globalisation we need to kill neoliberalism. 6. Design an alternative. Right now the neoliberal elite is in meltdown, because globalisation is on the edge of collapse. We have to plead now with the economists, the expert voices, even the central bankers to help radically reform capitalism in a way that delivers high wages, cheap public services, greater equality and greener growth. 7. Get a different media. Trump won because social media weaponised post-factual content made by the alt-right, and because billionaire owned news channels promoted him — and promoted the ignorance he feeds off. Well there are billions of dollars in Hollywood and Silicon Valley too — and the liberal elite, if they don’t want to see Western democracies ruled by Trump, Farage and Le Pen should put their money where their principles are and start funding a progressive mass media. In the meantime the theatre, literature, internet video channels, and progressive music artists: it’s up to you. Throw open your spaces and turn them into an alternative face-to-face media. 8. Reclaim the term “working class”. No compromise with racism, sexism and xenophobia. The working class is not “white”— it is multicoloured and more than half of it are women. Stop thinking “if only we, the left, could connect with what is positive in the prejudice of the white poor”. Nothing’s positive. If you’re black, Hispanic, gay, trans or female; if you’re an immigrant in what now feels like a hostile territory… you can’t duck the fight that’s coming. The rest of us should stand alongside the victims of Trump’s America, not behind them. 9. Choose one fight and become expert in it. Trump, the British Tories, the far right in Europe — will attack on all fronts. You are just one person so you need to assess your skills and resources and (my suggestion) operate like this: concentrate on one point of resistance chosen by you — but at critical moments, and through consensus, drop everything for the one big thing that matters. Not three points of resistance, and not ten big things that matter. One and one. 10. Take the political battle outside politics. Trump and Brexit have politicised everyday life: the person serving your coffee is a migrant? Trump and Farage politicised it. Don’t duck away from it. Say something to them. Do something every day, every hour that resists racism, proto fascism and misogyny. Don’t tolerate the ideological bullshit spread by the ultra-right in your life. \\nPaul Mason - Author: Postcapitalism — A Guide to Our Future | Producer: #ThisIsACoup documentary | Writer & Broadcaster 4.0 ·'"}, "time": 1742564444.629915}