{"duration": 0.04972505569458008, "input_args": {"text": "'Aide lays out how the former president raked in tens of millions of dollars through a series of deals while Hillary was Secretary of State in a memo unearthed by Wikileaks By Khaleda Rahman Daily Mail October 28, 2016 The latest hacked email released by WikiLeaks details how one of Bill Clinton’s closest aides helped rake in tens of millions for the former president while his wife was serving as Secretary of State. The 12-page memo was sent by Clinton’s former aide Doug Band in 2011 to him, his daughter Chelsea, several board members of the Clinton Foundation and its lawyers as well as it’s then special advisor John Podesta. Published on Wednesday by Wikileaks, after a hack of thousands of emails from Podesta’s account, it details how Band helped run what he called ‘Bill Clinton Inc.’ Band and another aide helped secure $66million from ventures, including speaking fees, according to the memo. \\nHe wrote that using his role as the president of his own consulting firm Teneo, Band worked to raise funds for the Foundation and Clinton personally. Band also wrote that he helped obtain ‘in-kind services for the President and his family – for personal, travel, hospital, vacation and the like.’ ‘Throughout the past almost 11 years since President Clinton left office, I have sought to leverage my activities, including my partner role at Teneo to support and raise funds for the Foundation,’ Band wrote. ‘This memorandum strives to set forth how I have endeavored to support the Clinton Foundation and President Clinton personally.’ Under a section called ‘For-Profit Activity of President Clinton (i.e. Bill Clinton, Inc)’ Brand said he and another aide, Justin Cooper brought Clinton all four of his advisory arrangements at the time. These yielded more than $30million in personal income – with a further $66million to be paid out over the next nine years should he continue with them. One of these roles was serving as honorary Chairman of Laureate International Universities, a chain of for-profit colleges, which paid Clinton $3.5million a year from 2010 until 2015 when the contract ended and his wife started her run for president. Band also mentioned that neither he nor Cooper was compensated for the work. They were not paid a fee or percentage of the income, but only received their Foundation salaries. Band also said that Teneo was responsible for negotiating a number of speaking fees for Clinton, including $1.15million from Ericson and $900,000 from UBS.'"}, "time": 1742561768.2963421}