{"duration": 0.0594019889831543, "input_args": {"text": "'A retired member of the   Rockettes dance troupe is encouraging its members to set aside their political differences and proudly perform at the inauguration of   Donald Trump. [“The only thing the Rockettes should be focused on is performing for our nation and helping unite us all with the joy, love, beauty and strength for which they are famous,” says Patty DeCarlo Grantham, a veteran member of the renowned troupe.  Grantham, who’s president of the   Rockette Alumnae Association, says she was appalled by backlash and calls encouraging Rockettes to boycott the inaugural event. “To perform for someone that represents everything that we, as women, have ever had to overcome is contrary to everything we know to be right and true,” former Rockette Autumn Withers wrote last week, The Wrap reported. “On a national level, the optics of this alone normalize the atrocious remarks Mr. Trump has openly made towards women,” Withers continued. “The idea that if you simply ask their bosses or perhaps pay their bosses enough money, a line of beautiful women will oblige anyone in any way is exploitation. ” Grantham, responding to Withers, wrote to the Madison Square Garden Co. which owns Radio City Music Hall. “We are all aware how contentious this election has been for our country,” Grantham wrote, assuring MSG owner James Dolan “that in no way does Ms. Withers’ opinions reflect the opinion of the Rockette Alumnae Association. ” Madison Square Garden Company released a statement last week confirming that the   dancers are not obligated to perform and that each Rockette “must voluntarily sign up. ” . @MSG says ”it is always their choice” in new statement on #Rockettes performing at Trump inauguration https:  .  pic. twitter.   —   Jackie Strause (@jackiedstrause) December 23, 2016,  “Like the millions of people who are true Rockette fans, we cannot wait to see the Rockettes proudly ‘strut their stuff’ for the upcoming inauguration of the President of the United States of America,” wrote Grantham, who performed as a Rockette from 1959 through 1970. The Rockettes last performed at President George W. Bush’s presidential inauguration in 2005. The iconic dance troupe will join previously announced performers the Mormon Tabernacle Choir and teenage opera singer Jackie Evancho at the event on January 20.   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742564164.797188}