{"duration": 0.08134651184082031, "input_args": {"text": "'Soundgarden singer Chris Cornell committed suicide Wednesday night in his Detroit hotel room by hanging himself, a medical examiner has confirmed. [“The cause of death has been determined as hanging by suicide. A full autopsy report has not yet been completed. There is no additional information at this time,” the Wayne County Medical Examiner’s Office announced Thursday afternoon.  Cornell’s representative Brian Bumbery told the Associated Press that the singer was found in his hotel room at the MGM Grand Detroit hours after his performance Wednesday at the city’s Fox Theatre. Cornell had been touring with the reunited Soundgarden, the band he fronted for 30 years. Rock legends including Elton John, Steven Tyler, Neil Roger, Billy Idol, and more mourned the late singer on social media Wednesday. Shocked and saddened by the sudden death of @chriscornell. A great singer, songwriter and the loveliest man. pic. twitter.   —   Elton John (@eltonofficial) May 18, 2017,  THERE’S A NEW STAR IN THE HEAVENS TONIGHT  …    THAT WILL SHINE FOREVER FROM THE MEMORY OF YOUR  …     https:  .   —   Steven Tyler (@IamStevenT) May 18, 2017,  A mutual friend called me and tells me my bro passed away. #RIPChrisCornell You are a great artist Love to Vicki and fam @nilerodgers pic. twitter.   —   Nile Rodgers (@nilerodgers) May 18, 2017,  x https:  .   —   Coldplay (@coldplay) May 18, 2017,  Very sad news about Chris Cornell today. A sad loss of a great talent to the world, his friends and family. Rest In Peace. pic. twitter.   —   Joe Perry (@JoePerry) May 18, 2017,  SO SO stunned to hear about Chris Cornell! Such a terrible and sad loss! Thinking of his family tonight! RIP,  —   Dave Navarro (@DaveNavarro) May 18, 2017,  RIP Chris CornellIncredibly TalentedIncredibly YoungIncredibly Missed. pic. twitter.   —   Jimmy Page (@JimmyPage) May 18, 2017,  Sad 2 hear of Chris Cornell passing. .great singer and artist  …               another blow  …    RIP,  —   Billy Idol (@BillyIdol) May 18, 2017,  Cornell also put out four solo studio records and a live record and went viral with a cover of Prince’s Nothing Compares 2 U, that has been played nearly 8 million times.  Footage of the singer’s final gig surfaced on Youtube on Thursday morning, amid news of his passing.    Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742564476.0185425}