{"duration": 0.07881617546081543, "input_args": {"text": "'Robert Iger, CEO of the Walt Disney Company, said Wednesday that ABC News has been “extremely fair” in its coverage of the 2016 election and the Trump administration and that complaints of   political bias on ESPN are “completely exaggerated. ”[Disney, which owns both ABC News and ESPN, held its annual shareholder meeting on Wednesday, where Iger responded to a question about the leftwing political bias at the networks by Justin Danhof of the National Center for Public Policy Research.   Iger insisted that ABC News has been entirely on the level in its coverage of the 2016 campaign and President Trump. He said: ABC News has reported to me, directly or indirectly, for almost 25 years. I’m an expert on ABC News, and I can stand here today, look you in the face, and say I’m proud of the efforts of ABC News. I respect ABC News, and I believe they work very, very hard to present news in an extremely fair way. There are always going to be people  —   yourself included and perhaps the president  —   who are going to believe that it is not being presented in a manner that’s consistent with their own beliefs. There’s an indictment made about the press simply because some of the press do not necessarily tow the line with positions being taken by others. Danhof, whose organization buys stocks in firms so it can attend shareholder meetings and ask tough questions, pointed out that Iger sidestepped the toughest parts of his query on Wednesday. The CEO simply ignored the part of his question that dealt with George Stephanopoulos, the former Clinton White House aide and now ABC News personality. Stephanopoulos was found in the Wikileaks hacks of the Democratic National Committee to have colluded with the Clinton campaign on story ideas, editing questions and lines of attack on Peter Schweizer, who wrote the book Clinton Cash a New York Times bestseller that detailed conflicts of interest and other misdealings by Bill and Hillary Clinton. Danhof said of Iger: How he lined up his response was telling. He wouldn’t address the question. He was sticking his head in the sand. His response was that I was making this up. But this has reached a nexus. Will his network continue to ignore or mock the millions of Americans in flyover country, or will we work to make his networks more inviting to other points of view? Right now, he’s saying he doesn’t want us as customers. Iger was even more determined when it came to ESPN, the sports giant that has announced in recent days it plans another round of layoffs because of massive financial losses that some attribute to its sharp leftward ideological turn. In his questioning, Danhof mentioned an exchange between two   personalities for the network about how, if they said, “Coming up, why Donald Trump is awesome,” they would “not last until the first commercial. ” Iger insisted the network exhibited no bias. “The charge that ESPN is exhibiting significant political bias in its programming is just completely exaggerated,” Iger said. “One small communication and blowing it up into something that sounds a lot larger than it is. Watch ESPN and you’re not going to see political bias at ESPN. ” Critics say there is, in fact, a lot of bias at ESPN. They point to Caitlyn Jenner winning the Arthur Ashe Courage Award, the network’s endorsement of Black Lives Matter at the ESPY Awards,  ’s aggressive coverage of the Women’s March on Washington in January, and the firing of Doug Adler  —   a tennis commentator  —   after he referred to the “guerrilla effect” of Venus Williams moving closer to the net on second serves at the Australian Open. There is also daily bias from commentators such as Michael Wilbon and Tony Kellerman. And then there is Kevin Blackstone, an   sportswriter who appears on ESPN talk programs and once referred to the Star Spangled Banner as a “war anthem. ” Curt Schilling, the former big league pitcher who was fired in April 2016 after he tweeted out support for the North Carolina law that required people to use the bathroom of their anatomical sex, scoffed at the notion ESPN is unbiased. “We recognize Abby Wambach and her stance on the gay lifestyle in the sports world, but not Milo Yiannopoulos and his gay perspective as a victim of molestation,” Schilling said in an email to Breitbart News. “We recognize that every issue Stephen A. Smith has in sports is based on black and white, not talent. But we don’t recognize Ben Carson, a conservative man from the worst of the worst backgrounds who never allowed color to taint his world perspective. ”'"}, "time": 1742562080.836675}