{"duration": 0.06897878646850586, "input_args": {"text": "\"Behind the headlines - conspiracies, cover-ups, ancient mysteries and more. Real news and perspectives that you won't find in the mainstream media. Browse: Home / October Boomerang The 9/11 Solution: The Big Clue Everyone Missed By wmw_admin on July 21, 2008 \\nGoogle removed this video but a reader sent in a copy. Watch how the media carefully manipulates coverage of the events of 9/11, as they interview ‘experts’ who provide the cover story that has gone to make up the standard govt/media version of 9/11 The Lady, The Queen and what it really means By wmw_admin on December 28, 2009 \\nEvery picture tells a story and with some photos and a few words Paul Powers shows us what was hidden in the background when Queen Elizabeth II met pop sensation Lady Gaga Dov Zakheim and the 9/11 Conspiracy By wmw_admin on April 23, 2010 \\nOur web hosts were threatened with legal action after lawyers representing none other than Dov Zakheim himself claimed this article was “defamatory.” Due to an oversight the article was not fully removed so read it before Zakheim gets us shut down Letter from James Abourezk, former US Senator from South Dakota to Jeff Blankfort on the Israel Lobby By wmw_admin on December 8, 2006 \\nMore than being an insider’s confirmation of the power of the pro-Israel lobby over Congress, the former US Senator’s letter also calls into question Noam Chomsky’s increasingly suspect looking motives Bilderberg Meeting – Media Should Be Ashamed By wmw_admin on July 12, 2003 \\nWhy do the Bilderberg meetings receive so little coverage. Victor Thorn examines why, and how, real news is suppressed by the mainstream media “WIPED OFF THE MAP”– The Rumor of the Century By wmw_admin on January 21, 2008 \\nHow President Ahmadinejad’s words were mistranslated and deliberately distorted. So that the term “wiped off the map” has now become synonymous with the Iranian leader’s attitude to Israel – even though he never uttered those words The Advent of the Anti-Christ By Rixon Stewart on August 2, 2010 \\nA few words on the market meltdown and how it may assist the debut of a truly sinister figure The Marijuana Trick By wmw_admin on November 17, 2005 \\nDoug Yurchey looks at the history of Hemp and the real reason why it is now illegal. As with so many other things, we’ve been sold a lie to maximise the profits of a few Have You Read the Talmud Lately? By wmw_admin on September 3, 2006 \\nThe Talmud expounds some of the most virulent racism, as these extracts plainly show. However, as a reader points out not all Jews are influenced by it, or even read it. Only the ultra religious study it, the rest haven’t a clue. We leave you to decide\""}, "time": 1742564152.326846}