{"duration": 0.12970352172851562, "input_args": {"text": "'Naming Trump, Nigel Farage in Britain and Marine Le Pen in France, the UN accused them of employing “fear” tactics similar to those of the Islamic State group. Note: U.N. High Commissioner for Human Rights Zeid Ra’ad Al Hussein has really hit the nail on the head here. Not only has he correctly pointed out that Trump, Nigel Farage, Marine LePen, Geert Wilders and the rest of the far-right leaders employ the tactics of fear and bigotry but he also correctly identifies their agenda as being the promotion of hatred with the eventual result that ‘colossal violence’ will ensue.\\nHowever, he does not go far enough in exposing these scumbags, most likely because he knows he would be placing himself in the crosshairs of the Zionists who stand behind these puppets.\\nWhat went unsaid is that all of these people are stooges for the Zionists and Israel, they are tasked with creating horrible divisions in our societies, turning white against brown and black, Christian against Muslim, indigenous against migrant.\\nThis is the Zionist agenda to weaken and enslave via the strategy of divide and conquer, as laid out in the Protocols of Zion. They want to destroy our nations by promoting inter-racial hatred and violence; they want to see the nation states of the west burn down in a wave of racially motivated violence; that is why Trump spouts such hateful and disgusting rhetoric against Mexicans, blacks and Muslims, it is to promote a race war that would devastate America. — Ian Greenhalgh, Veterans Today \\n\\nTrump and Europe’s Far-Right Fanning Flames of Hate: UN The United Nations human rights chief on Monday accused U.S. Republican presidential candidate Donald Trump of spreading “humiliating racial and religious prejudice” and warned of a rise of populist politics that could turn violent.\\nIn comments at a security and justice conference, U.N. High Commissioner for Human Rights Zeid Ra’ad Al Hussein said he was addressing Dutch far-right leader Geert Wilders and other “populists, demagogues and political fantasists.”\\nNaming Trump, Nigel Farage in Britain and Marine Le Pen in France, among others, he accused them of using “fear” tactics similar to those of the Islamic State group, also known by its Arabic acronym, Daesh.\\n“Make no mistake, I certainly do not equate the actions of nationalist demagogues with those of Daesh,” he said. “But in its mode of communication, its use of half-truths and oversimplification, the propaganda of Daesh uses tactics similar to those of the populists.”\\nIn a tweet, Wilders called Zeid “an idiot.”\\nZeid labelled Wilders’ March 2017 election platform, which calls for no Muslim immigrants, the closing of mosques and the banning of the Quran, as “grotesque.”\\n“The U.N. is grotesque,” Wilders responded. “Let’s get rid of these bureaucrats.”\\nBut Zeid said Wilders’ rhetoric could have terrible consequences.\\n“History has perhaps taught Mr. Wilders and his ilk how effectively xenophobia and bigotry can be weaponized,” he said.\\n“The atmosphere will become thick with hate; at this point it can descend rapidly into colossal violence,” he warned.\\nSource: Telesur \\nVia: Veterans Today \\nMore from Political Insider… Just 11 Days Before the Election, Israel Sends Incredible Message to Donald Trump! WHOA \\nAmerica is supporting Donald Trump, and his message to clean up the corrupt federal government is winning over millions of voters.\\nIt’s a refreshing message, and Trump’s conservative vision is why he earned more votes than any Republican primary candidate in history!\\nIn fact, Trump is so popular, his support is world-wide.\\nHere’s what’s going on in Jerusalem now. There is a clear message here that Hillary Clinton can’t be happy about.\\nAs Yahoo News reports :\\nOn a rooftop overlooking the walls of Jerusalem’s Old City, around 200 American-Israeli fans of Donald Trump gathered to proclaim their support for the Republican candidate, convinced he will be Israel’s best friend if elected.\\nWearing “Make America Great Again” baseball caps, the small crowd, ranging from Holocaust survivors in their 80s to grinning teenagers in Trump t-shirts, said they didn’t care about the sexual assault allegations against the candidate or the online anti-Semitism of some of his supporters.\\n“Trump will let Israel be itself and make its own decisions, that’s what I like,” David Weissman, a 35-year-old from Queens, New York, who moved to Israel three years ago, said at the event late on Wednesday.\\n“He’s not a saint, but look at his achievements. He’s not afraid to identify the enemy as radical Islam, and he’s not going to support the two-state solution,” he said, referring to long-standing efforts to forge peace with the Palestinians.\\nClearly, the people of Israel have seen the mess caused in the Middle East by 8 years of weakness from President Barack Obama’s White House.\\n\\nAfter Obama’s devastating and illegal pay-off to the Iranian regime, the Israeli people have a lot riding on the 2016 presidential election. They can’t continue to protect their citizens from harm if liberals in America keep funding their enemies.\\nThis is why Trump is popular in Israel:\\n\\nOn day 1, Trump will have a better relationship with Israel than Obama ever had. Israel is our ally, and they deserve our support.\\nSource: Political Insider \\n'"}, "time": 1742562127.021592}