{"duration": 0.015960216522216797, "input_args": {"text": "'Tweet Home » Headlines » World News » Watch This Incredible Video And Decide For Yourself: Did Hillary Cheat At The Last Debate By Using An Embedded Tablet Device In Her Podium? \\nNew Wikileaks documents show that Hillary Clinton, in association with the mainstream media, was given debate questions ahead of time. What’s more, as you’ll see below, Hillary, who claims she was merely taking notes, was actually reading directly off of the podium , almost as if someone was feeding her answers and bullet points… \\n\\nFrom Mac Slavo, SHTFPlan : \\nNew Wikileaks documents show that Hillary Clinton, in association with the mainstream media, was given debate questions ahead of time. It’s also been rumored that the former First Lady may have used an ear piece at one of the debates, giving her a significant advantage. \\nLast week footage of the final Presidential debate begain circling the internet and showed that Clinton may have been using some sort of screen at her podium. While many dismissed this as a lighting effect, an investigation by Piper McGowin at The Daily Sheeple suggests thatHillary may have actually been using some sort of tablet device. \\nThe following video will leave little doubt that something just wasn’t right at the last debate. As you’ll see, Hillary, who claims she was merely taking notes, was actually reading directly off of the podium, almost as if someone was feeding her answers and bullet points. \\nMoreover, and quite damning, the notes Hillary was supposedly taking were were being written down with a pen that didn’t have a tip on it . So, either she wasn’t taking notes, or, she was using a stylus on an electronic device. \\nWatch this incredible video and decide for yourself: \\n( Watch directly at Youtube ) \\nFor an extensive breakdown of the Wikileaks notes that add further legitimacy to the claims that Hillary’s podium is loaded with cheat-tech, we encourage you read Leaked Emails Reveal Hillary Can’t Speak for Very Long Without a Podium'"}, "time": 1742628554.0169382}