{"duration": 0.11367940902709961, "input_args": {"text": "'WASHINGTON  —   In the middle of her dynamic show at the Verizon Center here on Friday, Amy Schumer swigged from a bottle of wine like a movie pirate and asked, “Can I just tell you guys all my secrets?” Giving an arena show the intimate feel of a sleepover requires the presence of a star, and Ms. Schumer doesn’t pretend she isn’t one. “It’s been an insane year,” she said early on. “I’ve gotten very rich, famous and humble. ” When she soberly brings up her “passion project,” she’s referring to her appearance in those ubiquitous Bud Light ads. “People say you sold out for money,” she said midstride, before stopping and flashing a look that announced: Duh. Ms. Schumer was a gleefully raunchy comic who found a pointed feminist voice on her Comedy Central sketch show “Inside Amy Schumer. ” But in her new global tour, which comes to Madison Square Garden next month, she has slyly found an arena   language to match her evolving reputation. Ms. Schumer smuggles social commentary about gender into broad   bits. At one point on Friday, she lay down onstage, took off her high heels and invited a guy in the audience to try them on. After she flirted with him onstage, he stepped into the shoes and teetered awkwardly. Then she ordered him to walk around like she had, which he tried to do, uneasily. A man stumbling in woman’s shoes is an easy joke, but this bit of crowd work evoked the old line about Ginger Rogers doing everything Fred Astaire did, except backward and in heels. It got a huge response, but around me, the women laughed louder. The most significant shift in her   is one of perspective. Her early work used the voice of a blinkered, entitled party girl who often said dumb and offensive things, many of which were   false. And yet there were moments when a different voice interrupted for a punch line that broke the fourth wall, like the  : “My best friend is black   …     in this story. ” The early criticism of Ms. Schumer’s work came from comedy snobs who dismissed her jokes as character comedy, shorthand for material rooted in a fake persona, an approach deemed by some to be inferior to   in your own personal voice. This distinction between character and personal comedy is rooted in naïve notions about the authenticity of certain kinds of   a belief as simplistic as the one that indie   are more real than pop stars. But there is some truth (and usefulness) in these aesthetic categories, particularly when it comes to describing Ms. Schumer’s evolution. In her new   when Ms. Schumer says something happened to her, she wants you to believe it. She also doesn’t play dumb. She speaks in a confident, savvy voice that doesn’t sound that different than the one you might read in interviews with her. This dovetails with the politics of her comedy, which offers a sustained critique of how the media and culture make women feel insecure and apologetic. You might say Ms. Schumer has merely changed rude personas, replacing the ditsy girl with that of the arrogant celebrity. If so, she’s still keeping a firm eye on her audience’s sympathies. Her harshest gibes are for famous people (Gwyneth Paltrow, the Kardashians) who market fantasies of perfection masked as something more down to earth. Ms. Schumer positions herself as a star so relatable she’s not going to try to trick you into thinking she’s relatable. While she delivered some topical jokes (a funny   about gun laws, a scene about meeting Hillary Clinton, for whom she appeared at a   before the show) the content of her material  —   much of it new, some repurposed  —   could still be described by the title of her first special: “Mostly Sex Stuff. ” She still favors a jaunty    style of joke that depends on pinpoint pauses. “I’m going to make him wait,” she says about sex on a first date, waiting a beat. “All through dinner. ” Pivot, deepening voice: “We didn’t go to dinner. ” Most of her laughs, however, are earned not from concise jokes but detailed stories, punched up by an animated performance style. Ms. Schumer has long cut sour material with a sweet glance, but now she uses a more theatrical vocabulary for such incongruities. When she describes telling her boyfriend that she is finished performing oral sex, she employs the cheery voice of a game show host. And when she gets really dirty, Ms. Schumer pairs jokes with pantomimes of tap dancing or a tip of a cap accompanied by a  . Ms. Schumer, who made the leap to movies last year with “Trainwreck,” makes a point of saying   is her favorite thing, but her comedy, like that of Louis C. K. increasingly leans on acting chops. She moves from prim scold to maniac princess to   aggression with alacrity  —   and without ever seeming as if she’s working too hard. She makes hustle look effortless. Yet after a breakthrough 2015, Ms. Schumer’s stardom has shifted into a slightly precarious position. She remains at the center of pop culture  —   her book, “The Girl With the Lower Back Tattoo,” is on the   lists  —   but often for reasons peripheral to her work. She’s become a fixture on the online controversy circuit, garnering headlines not for the last season of her sketch show, but for accusations that she stole jokes (which she denies) and for criticism of comments about rape from one of her TV show’s writers. Such   are part of being a famous and provocative comic today. And she has proved herself canny at negotiating the digital world, creating her own viral moments by releasing a clip of her handling a heckler or posting a photo on Instagram skewering double standards in publishing. Still, Ms. Schumer repeatedly called herself an awful famous person onstage here. “I say what I mean,” she said, “so I probably won’t be able to do this much longer. ” It’s unclear exactly what she meant, but it’s the kind of intriguing aside that makes you sit forward in your chair. In comedy, meaning what you say doesn’t beat saying it in a meaningful way.'"}, "time": 1742562651.3613842}