{"duration": 0.059807777404785156, "input_args": {"text": "'WASHINGTON  —   House Republican leaders signaled on Monday that they would not support   Donald J. Trump’s threat to impose a heavy tax on companies that move jobs overseas, the first significant confrontation over the conservative economic orthodoxy that Mr. Trump relishes trampling. “I don’t want to get into some kind of trade war,” Representative Kevin McCarthy, Republican of California and majority leader, told reporters in response to Mr. Trump’s threats over the weekend to seek a 35 percent import tariff on goods sold by United States companies that move jobs overseas and displace American workers. Speaker Paul D. Ryan also pushed back against Mr. Trump on Monday in an interview with a Wisconsin reporter, saying an overhaul of the corporate tax code would more effectively keep companies in the United States than tax penalties. “I think we can get at the goal here,” he said, “which is to keep American businesses American, build things in America and sell them overseas  —   that can be properly addressed with comprehensive tax reform. ” Mr. Trump’s economic positions clashed with traditional conservatives during the campaign, but now these differences  —   on trade, government spending on infrastructure, and tax policies  —   have set the incoming president on a perilous course with the lawmakers whose support he needs to keep his agenda on track. “There will be a tax on our soon to be strong border of 35 percent for these companies wanting to sell their product, cars, A. C. units etc. back across the border,” Mr. Trump said in a series of Twitter messages over the weekend. The response from Republican leaders underscored the limits of legislating 140 characters at a time on Twitter, and gave Democrats cause to believe they can work with Mr. Trump to outmaneuver congressional Republicans next year. “The   won in part by campaigning against the Republican establishment on many economic issues,” said Senator Chuck Schumer of New York, the incoming Democratic leader. “If he wants to get something done for working families in this country, he’ll have to stand up to them when it comes time to govern, too. ” Mr. Trump first startled Republicans during the campaign when he attacked trade deals, putting himself more in line with Senator Bernie Sanders of Vermont than Mr. Ryan. He repeatedly insisted that trade deals had displaced American workers and harmed the economy, upending two centuries of American economic policies that held trade up as a good thing, a position that Republicans have pushed in recent decades. His positions helped imperil President Obama’s trade pact with Asian nations, the   Partnership, and abruptly stop further trade negotiations, which many experts in both parties believe limits the United States in its economic position against China, especially when paired with tariff threats. “I respect   Trump for fulfilling his campaign promise to withdraw from T. P. P. ,” Representative Kevin Brady, Republican of Texas and chairman of the powerful House Ways and Means Committee, said shortly after the election. “We can’t abandon these markets to China and other competitors, because American businesses and customers will lose out,” he added. Mr. Trump made Republicans bend to his will  —   and against their   opposition to picking “winners and losers” in the economy  —   even before his inauguration when he announced last month that the     manufacturer Carrier would keep roughly 1, 000 jobs in the state rather than moving them to Mexico, thanks to $7 million in tax incentives negotiated by Vice   Mike Pence, the current governor of Indiana. This is the sort of package Republicans have traditionally loathed. The once intensely conservative Mr. Pence channeled the views of Mr. Sanders when he explained the Carrier deal by saying, “The free market has been sorting it out, and America’s been losing. ” Mr. Ryan and many other fiscal conservatives appeared to agree. “Everyone here knows what it means to lose jobs in their districts,” said Representative Tom Cole, Republican of Oklahoma. “If Trump can keep a thousand families from going through such an ordeal, then good for him. And if it makes other companies think twice about the human consequences of their business decisions, so much the better. ” But big tariffs appear too much to abide. Both Mr. Ryan and Senator Mitch McConnell, Republican of Kentucky and the majority leader, supported a bill that gave Mr. Obama and his successor special “fast track” authority to negotiate trade agreements, and are proponents of reducing tariff barriers. “Tax cuts and deregulation will make the American economy great again, but tariffs and trade wars will make it tank again,” David McIntosh, president of the conservative group Club for Growth, said in a statement, adding, “The majority leader is right to caution against protectionism and to urge a robust debate on free markets and trade. ” House leaders want to tackle the problem of companies’ moving operations overseas with a broad rewriting of the corporate tax code, which they say will make American manufacturing more competitive without resorting to punitive measures on individual companies. “Tough talk plays well with his base and is arguably even long overdue,” said Brian Walsh, a Republican consultant and former official at the National Republican Senatorial Committee. “But ultimately, the legislative focus will be on tax reform and deregulation versus tariffs and trade wars. I don’t believe Republicans will let a golden opportunity to finally pass comprehensive tax reform fall victim to intraparty squabbling. ” Republicans also fought mightily this week to remove a provision from a water bill favored by Democrats  —   and aligned with Mr. Trump’s campaign promises  —   that would require the use of   iron and steel for domestic water infrastructure projects. They said they feared the measure would direct federal funding to some domestic companies but not others. Mr. Trump has long been a proponent of propping up the American steel industry, even though he has used imported steel for some of his building projects. Next on the horizon could be a Medicare fight. Mr. Trump said during his campaign that threats to change the program caused his party to lose its bid for the White House in 2012,   Mr. Ryan in his swipe. Mr. Trump and Mr. Ryan are in   mode at present, but how much that holds up remains to be seen. Mr. Ryan has a proposal to transform the Medicaid program into a block grant and change the Medicare program so that Americans now under 55 would get a specified amount of money from the federal government toward the premium for private health coverage. Mr. Trump has been inconsistent on the Medicare issue, and his choice for secretary of health and human services, Representative Tom Price, shares Mr. Ryan’s views.'"}, "time": 1742628534.032751}