{"duration": 0.1428670883178711, "input_args": {"text": "\"Syrian War Report – October 31, 2016: Al-Nusra-led Forces Failed to Break Aleppo Siege ‹ › GPD is our General Posting Department whereby we share posts from other sources along with general information with our readers. It is managed by our Editorial Board Pressure on Taliban leaders, makes Afghan Issue more Complex By GPD on November 1, 2016 \\nNazar Mohammad Mutmaeen for Veterans Today \\nAfghan writer and political Analyst based in Kabul \\nTwo years ago, I had heard from the important Afghan officials and politicians that if the former leaders (old generation) of the Taliban were eliminated, their new (young) generation would become split, the Taliban would become weakened and eventually, they would become ready to have talks and even join with the Afghan government. \\nIn past two years, the leaders of the Taliban became targeted on the other side of the Durand Line in various occasions; the leader of the Taliban, Mullah Akhtar Mohammad Mansour came under attack and became killed; meanwhile, Mullah Mohammad Hassan Rahmani, member of the Taliban Leading Council and Mullah Said Mohammad Haqqani, the deputy head of Taliban’s Information and Culture Commission died as a result of illness. Earlier, Mullah Obaidullah Akhud, former Defense Minister of the Taliban and Ustad Mohammad Yasir, head of Taliban’s Information and Culture Commission passed away due to torture in Pakistan’s prisons. \\nMullah Ahmadullah Nanai, member of the Taliban Leading Council became arrested by Pakistan, and thus, some other leaders of the Taliban moved up to an uncertain location and have endured the security threats there. \\nSaid Mohammad Tayyib Agha, former head of the Qatar Office [Taliban’s Political Office based in Qatar], Mawlawi Neik Mohammad, member of the Taliban Leading Council and the Qatar Office and Hafiz Azizurrahman, member of the Qatar Office resigned and became retired as well. \\nDiscussions on the jurisdiction of the Taliban’s Political Office based in Qatar are going on; besides that, there is not any specific policy of the jurisdiction of the representatives of the Taliban that are in touch with Central Asian, Arabic and some European, regional and neighboring countries. \\nWhat if the two years old plan of the U.S., Pakistan and the Afghan government is right; the plan which was about targeting and eliminating the Taliban’s leaders in order for the power to become transferred to the new generation of the Taliban; and, then the efforts on dividing the Taliban would have made in order for the Taliban, when they are in weaker position, to become ready to have peace and then join with the Afghan government. \\nThe Afghan people have positive thoughts about the recent reports on peace which were broadcasted by domestic and international media. The Afghan nation is tired of war and it becomes content with effort on peace. However, there are signs observed that there are still some circles that try to implement the former plan in order for way to be paved for the division of the Taliban. \\nI am inclined that if the leaders of the Taliban who have almost 20-year experience of Afghan politics and situation in the country are eliminated, we would remain at war and then, we would never see the dawn of the peace; the best example in this regard is presence of various parities during Jihad (holy war) against the Soviet Union, which later caused the Afghan nation to taste the civil war. \\nConsidering the current situation, it seems that the international policy is in change regarding the parties involved in the Afghan matter. On a hand, the Taliban are under pressure from different sides and ways and from the other hand, the situation in the National Unity Government of Afghanistan (NUG) is so deteriorated. Moreover, the incidents similar to Ghor’s tragedy that caused more than 30 civilians to be killed by gunmen on 25/26 October are probable to be repeated in the areas where different races or proponents of Jamiat e Islami and Jonbesh parties or Hazaras along with other ethnicities live together. \\nDisputes Over Power Among NUG’s Leaders \\nDisputes between President Ghani, Chief Executive, Abdullah and First Vice President, Dostum are on peak; the disputes leaked to media; the Chief Executive mentioned the wounded situation of Dostum in the Afghan cabinet; however, Dostum made rigorous remarks against Abdullah; recently, President Ghani and Chief Executive, Abdullah became accused of nationalism and monopoly by Dostum. \\nThe remarks of Dostum carried out reactions from the Presidential Palace, the members of the Parliament, Afghan politicians and civil societies. \\nRasheed Dotum put allegations on the National Directorate of Security (NDS) and National Security Council (NSC) and consider that they have hidden hand in the incident where the convey of Dostum came under the attack by the Taliban in Faryab province which caused a lot of causalities to Dostum’s fighters. \\nAfter the Brussels Conference, President Ghani wanted to bring changes in the Afghan cabinet and important governmental bodies, to remove some cabinet ministers and replace them with others, because the Afghan government had promised the international donors that it will bring positive reforms in the government; however, President Ghani faced opposition from the Chief Executive because Abdullah wants 50% of share in these new changes as well. The Chief Executive had threatened that if Ghani hired Nader Naderi as the head of Afghanistan Independent Administrative Reform and Civil Service Commission (IARCSC), then, the Chief Executive would introduce the head of the Independent Directorate of Local Governance (IDLG) which propose and suggest provincial governors. \\nPerhaps, President Ghani might have promised the international community regarding the removal or displacement of Dostum; that’s why Dostum publicly criticizes President Ghani, head of NSC, Haneef Atmar and head of NDS, Masoum Stanekzai. \\nWhenever Dostum was attending the north of Afghanistan in the past, he was directly supported by NSC and Americans, and it was tried to oppress the people of a specific race there in order for them to become obligated to take weapon, and a result, for the war to become severed in the north under the banner of Daesh (ISIS). \\nSome Turkish sources indicates that the failed coup of Turkey was planned by two Turk generals with the cooperation of America and NATO in Afghanistan; Turkish sources claim that two billion dollars were given to two Turk generals; this amount was first transferred to an African country and then to Turkey in order for it to be distributed among Turk generals for the successful army coup. The coup became failed by Turkish leader, Recep Tayyip Erdogan and his friends and this caused the relations between Turkey and the U.S. to become deteriorated. The impact of Turkey on Dostum cannot be neglected; a visit to Turkey became planned for Dostum and he went there; after his return, Dostum was not so enthusiastic, as he was in the past, to cooperate with the U.S. to carry out the project of making new armed groups in the north of Afghanistan. Thus, the U.S. Air Forces (USAF) did not cooperate with Dostum in Faryab at the level they were doing it in the past, and as a result, Dostum, as in the past, returned back to Kabul disappointed and failed. Even more, the Afghan government has said that it has considered the complaints regarding people’s oppression by Dostum and his militia in the area. \\nBefore the failed military coup of Turkey, relations between this country and Russia were deteriorated and the reason were: Annexation of Ukraine’s Crimea, where a lot of Turks live; interference of Russia in Syria and Russia’s skepticism on Turkish role alongside the U.S. in supporting ISIS. \\nRussia had doubts that Turkey might help Islamist warriors in Central Asia’s Caucasia, Chechen and Crimea, and perhaps, Dostum would also help Turks in this process. On the other side, Turks were skeptic that Russians might support PKK in order for a barrier in front of Turkey to be created. \\nAfter the failed military coup in Turkey, Turks hold America and Fethullah Gulen, the opponent of Turkish government living in the U.S. responsible for the coup, which made Turkey to rebuild its ties with Russia. However, as Turkey has close and powerful immemorial ties with Dostum; therefore, the ties between Turkey and Russia would be the reason that caused First Vice President, Dostum to step back from the U.S. project on making new armed group in the north of Afghanistan. \\nIt is said that a secret deal had been made with President Ghani and Dostum in the latest days of the second round of the 2014 Presidential Elections; some unconfirmed reports indicates that Dostum asked President Ghani in the latest days of the second round of the 2014 Presidential Elections to provide him with 10 million USD; Many negotiations were made between Ghani and Dostum in this regard; eventually, Ghani had to give 9 million USD to Dostum. When Ghani wanted to share the issue of 9 million dollars of his support with Dostum to his proponents in Jawzjan, Dostum grabbed the microphone and did not let Ghani to complete his word in order for the secret deal not to become disclosed. For that reason, disputes raised between Ghani and Dostum in Jawzjan, and other leaders of the campaign mediated between them. \\nIt is thought that Ghani gets revenge of those 9 million dollars and that dispute, that’s why the President might not provide the First Vice President with his authorities. \\nThe problem is that it is not the first time that the U.S. and Afghan politicians trust, regarding achieving their goals, in someone who does not have fame on domestic, regional and even international level; this game is repeated in Kabul from the era of Dr. Najeebullah to the Ghani’s Administration; whenever, the war criminals are trusted, it is indispensable that the government and the Afghan people are faced tragedies and problems. \\nBriefly, the rumors on that President Ghani monopolizes power, decreases the power and authority of his team, vice presidents, ministers, advisors and governors are increasing; moreover, it is also heard that he personally appoints the directors and deputy directors in the ministries. \\nJohns Nocholson’s Remarks on ISIS \\nThe remarks of top US and NATO Commander in Afghanistan, General John Nicholson on that the main reason behind weakness of Afghan army is incorrect and weak management and that ISIS is strengthening in Afghanistan and that this country would be turned in to a powerful station of ISIS in the region, raise concerns. \\nJohn Nicholson said that the Islamic Movement of Uzbekistan is attempting to Khorasan Caliphate in the north of Afghanistan under the leadership of ISIS and added that warriors from the other side of the Durand Line (Pakistan) are willing to join fighter with them, also. \\nEach time the U.S. officials met Pakistani authorities, they made remarks on ISIS in Afghanistan; and Russian are concerned about the involvement of Pakistan, U.K and U.S. in the phenomenon of ISIS/Daesh. \\nThe people of Afghanistan are concerned about the appearance of some unidentified gunmen in the country’s northern provinces, and probably, Badakhshan and Kunduz would have the position of today’s northern and southern Waziristan; these areas would be intentionally turned into main centers of insecurities. \\nThe remarks of John Nicholson are considerable; the U.S., on international level, announce that the fighters of ISIS are eliminated and this group is about to lapse; on the other hand, the general commander of NATO and U.S. forces in Afghanistan, surprisingly, makes remarks on strengthening of ISIS in Afghanistan. \\nA few months ago, President Ghani, during his remarks in Nangrahar, province the people of Nangrahar with good news that ISIS is defeated and it is about destroy; however, after some numbered days, ISIS showed its activities and even made group assaults on Pachiragam district of Nangarhar. \\nEfforts on Peace \\nReliable sources indicate that there would not be any improvement in the Afghan peace process from the Obama Administration, and making new policies regarding the Afghan peace and war are responsibility of the new administration. In addition, Obama does not have the authority to make major decisions anymore, according to the U.S. law. \\nThe Obama Administration has promised the Afghan government that it would support this weak government and would not let it to fall. \\nDomestic and international reports on recent talks between the Taliban and the U.S. need be thought about. The involved parties in the Afghan matter are required to have a clear strategy and framework regarding the negotiations. Taliban has made some major political mistakes in last five years; they had not got any written agreement with involved parties during the inauguration of the Qatar Office, the Taliban could not get the needed use of the Karzai’s opposition against the bases of American forces in Afghanistan, and also, the Taliban had not got the official or written guarantee from Dr. Ashraf Ghani in their meeting with him before the second round of the 2014 Presidential Elections. \\nAfghan people needs real peace, not if, this time, the U.S. and other involved parties initiated a new game under the banner of peace negotiations. In the case, the U.S. policy for now is that it cannot have a clear position regarding the Afghan peace process until its new government takes power in 2017. \\nThe Afghan sides are required not to trust a lot in neighboring and other foreign counties; however, it is needed to have face-to-face talks with the U.S., as an important party of the war; their [Americans] concerns should be answered, too; nonetheless, the best and the easiest way to peace is inter-Afghan understanding and dialogue; and besides that, having neighboring countries as bail and attracting international support in improvement of the peace process is mandatory. Related Posts: No Related Posts The views expressed herein are the views of the author exclusively and not necessarily the views of VT, VT authors, affiliates, advertisers, sponsors, partners, technicians, or the Veterans Today Network and its assigns. LEGAL NOTICE - COMMENT POLICY Posted by GPD on November 1, 2016, With 95 Reads Filed under World . You can follow any responses to this entry through the RSS 2.0 . You can skip to the end and leave a response. Pinging is currently not allowed. FaceBook Comments \\nYou must be logged in to post a comment Login WHAT'S HOT\""}, "time": 1742628468.1796594}