{"duration": 0.016125917434692383, "input_args": {"text": "'BERLIN  —   A Moroccan woman who took a piece of her dead husband’s intestine on a flight to their home in Austria was carrying the sample because she suspected that he had been poisoned and she wanted European doctors to examine it, her lawyer said on Tuesday. The woman, 35, who has not been publicly identified, packed the   piece in her checked baggage on a flight to the southern Austrian city of Graz, where she and her husband, 40, had been living for eight years, said the lawyer, Anton Karner. Mr. Karner said his client had been acting on the advice of a doctor in Marrakesh who shared her suspicion that her husband had been poisoned at a meal the couple ate while visiting his relatives. The Moroccan doctor extracted the piece of intestine, Mr. Karner said, and apparently helped pack it in formaldehyde and in thick plastic containers. Gerald Höfler, who leads the pathology institute in Graz where the intestine is being examined, described the packaging as very professional. “I would imagine that it was done by a pathologist,” he said. “It was absolutely secure, triple wrapped, according to European Union norms. ” Dr. Höfler said the results of the examination would probably not be known until next week. The unusual cargo was found by customs officials on Sept. 8 after they searched the woman’s bag as part of standard random checks when she landed in Graz, said Johannes Pasquali, a spokesman for the Austrian Finance Ministry, which oversees the country’s customs operations. The story was first reported over the weekend by Kleine Zeitung, the main local newspaper in Graz. Leo Josefus, a spokesman for the police in the state of Styria, of which Graz is the capital, said customs officials had first turned to the police for guidance. Officers determined that the woman had violated no Austrian laws by bringing the sample into the country, and the intestine was then sent to Dr. Höfler’s clinic. Mr. Karner, who declined to name his client, said she suspected poisoning after the family meal because some members of her husband’s family had opposed their marriage.'"}, "time": 1742628454.5416777}