{"duration": 0.07650327682495117, "input_args": {"text": "'Shadow Home Secretary Diane Abbott has immediately declared an apparently deliberate attack on pedestrians outside Finsbury Park Mosque terrorism  —   unlike the Westminster Bridge, Manchester Arena, and London Bridge attacks, which she called “incidents”. [Taking to Twitter after news broke that a    man had crashed a van into a crowd of people leaving a Mosque in Finsbury the Labour was quick to label it a “shocking terror attack”.  Shocking terror attack outside Finsbury Park mosque. Thoughts  prayers with friends  families of the victims #FinsburyPark,  —   Diane Abbott (@HackneyAbbott) June 19, 2017,  Abbott reiterated her description of the attack as terrorism, calling on police to “urgently review security for all mosques” minutes later, and retweeted a message from Shomrim   London which also referred to the crash as a “horrific terrorist attack”. Terror attack outside #FinsburyPark mosque. Police must urgently review security for all mosques #StandTogether,  —   Diane Abbott (@HackneyAbbott) June 19, 2017,  Abbott’s rush to judgement on this occasion stands in sharp contrast to her pronouncements following the Islamist terror attacks at Westminster Bridge, Manchester Arena, and London Bridge. The Westminster Bridge attack, in which Muslim convert Khalid Masood ran down several pedestrians before leaping from his car and stabbing a police constable to death on March 22nd, was not acknowledged as a terror attack until the following day in a tweet which pointed followers in the direction of a Guardian article emphasising the fact that the   migrant was “ ”. The following day, she released a statement in which she claimed it was “too early now to debate the cause or motivation for this attack”. She warned against “wild assertions about this attack by people claiming to know what the police can’t yet know, why this happened and who precisely was involved”. She added: “We should reject any false or lazy assertions and wait for the police to do their work. ” Westminster terror attack triggers   rhetoric. But the attacker was actually British born https:  .   —   Diane Abbott (@HackneyAbbott) March 23, 2017,  Following the Manchester Arena suicide bombing on May 22nd, in which the son an Islamist refugee murdered and maimed dozens of men, women, and children at a concert, Abbott would only go as far describing the attack as a “horrific incident”. My thoughts go out to all those affected by the horrific incident in Manchester. Our emergency services have acted swiftly and bravely.  —   Diane Abbott (@HackneyAbbott) May 23, 2017,  Abbott used similar language following the terror attack on London Bridge and Borough Market on June 3rd, in which   former child refugee Khuram Butt, bogus asylum seeker Rachid Redouane, and EU national Youssef Zaghba ran down and stabbed dozens of people in London. The Jeremy Corbyn ally was careful to refer to the terror attacks as “incidents” in two separate tweets. My thoughts are with all those affected by the incidents in London tonight,  —   Diane Abbott (@HackneyAbbott) June 3, 2017,  Emerging news of frightening incidents tonight: London Bridge, Borough Market  Vauxhall. Once again we owe so much to emergency services pic. twitter.   —   Diane Abbott (@HackneyAbbott) June 3, 2017,  Breitbart London has described all the attacks, including last night’s outside Finsbury Park Mosque, as terrorist attacks.'"}, "time": 1742562259.4916444}