{"duration": 0.16440343856811523, "input_args": {"text": "\"Donate Deconstructing an Example of Establishment Media Reportage: the Boston Globe Publishes Not-So Subtle Hit Piece on Sanders and Warren Couched in establishment lingo and perspective, relying upon shallow but credible-seeming misinformation, the Boston Globe reveals itself to be no ally of the people or the revolution. Sanders and Warren By Liam Miller / filmsforaction.org \\nWhy, at such an uncertain time, would the Boston Globe’s Michael Levenson (mlevenson@globe.com) and Annie Linskey (annie.linskey@globe.com) sow disinformation and discord? That might seem like an exaggerated statement. But it only requires a slightly critical eye to see they tip their hand quite clearly: They serve the establishment's interests. \\nThe piece, inoccuously titled Elizabeth Warren, Bernie Sanders duo will lead liberals in the Senate , begins with the wholly unsubstantiated statement, “Bernie Sanders did not like to open the phone lines to political critics when he hosted his Friday radio show on WDEV…” It is an assertion that rings true in a general way; who likes to open communication with detractors? From the gate, this characterization paints Bernie as someone who doesn’t like to listen to people who disagree with him; but anyone who has observed him knows this characterization isn't on point. \\nTo see this, simply watch Bernie’s regular, Friday Brunch with Bernie appearances on Thom Hartmann’s radio show. The phones were open to any and all, throughout the country. Bernie is always patient, respectful, and compassionate. If this were the only point upon which the authors were off-base, one could excuse it. This is far from the only example, however. \\nTheir next paragraph is thick with establishment perspective, as they discuss Warren and Sanders’ potential ability to “tap into the populist anger Trump channeled”. Here, the first and only means of understanding why people would listen to Warren and Sanders is anger; not the reasonableness of their positions, the compassion of their views, or their integrity and honesty. This argument is straight out of the establishment media’s playbook against Sanders from the primary; in speaking only of his supporters’ anger, they blurred the distinction between Sanders and Trump. This was convenient when establishment water-bearers in the media were attacking Sanders on Clinton’s behalf, and ultimately successful in handing her the primary (with disastrous consequences). But their utter lack of understanding, exemplified by this limited, tone deaf perspective is the real problem. It’s not that people are angry (although some are); it’s that they feel, quite distinctly and strongly, that they can trust Sanders and Warren to both understand and advocate for their perspectives. When understood in this way, this piece’s failure is not just an oversight; it is a deliberate marginalization, that lays groundwork for future dismissal. \\nA few paragraphs later, they say “Their [Warren and Sanders’] history is more fraught and their future more uncertain than their ideological alliances might suggest”, before going on to quoting Charles Chamberlain of Democracy for America’s view that they would be leading the party and the movement. Then they continue: “Still, tensions may lie ahead,” before going on to claim that Warren is more of an insider while Sanders (“an independent and self-professed socialist”) is more of an outsider. Setting aside the obvious dog-whistle “socialist”, when Sanders in fact terms himself a “democratic-socialist”, the presumption of friction between them is simple unsupported speculative gossip. Oh, sorry – it’s supported by a University political scientist, who is cited as saying there “can really be only one custodian of the heart of the Democratic base,” and so Warren and Sanders interests must collide. This of course presumes that either of them covets such a role; in fact, as we saw throughout the primary by Sanders’ repeatedly demurring on his own individual importance, and Warren’s consistent, ongoing rebuff of any and all attempts to get her to evince even the slightest aspiration to power. Simply put, the authors don’t understand Warren and Sanders, because they (like so many in the media) can only comprehend those in political life as, at heart, self-interested sociopaths. They must hunger for power; and so they must, eventually, be at odds. \\nThe piece goes on to discuss Sanders and Warren’s ongoing conversations on his radio show, and their tendency to agree; then, in a seemingly pointless non-sequitur, makes an isolated quote of the station owner, who says he “can’t say” that it was “wonderful radio”. This point, entirely irrelevant to the purported point at hand (that Warren and Sanders would lead the Democratic party in the Senate), reflects poorly on them both; and is, indeed, a most indicative morsel of information. With it, we see that the authors are not sympathetic to Warren or Sanders. And, in the tradition established by the New York Times with their documented bias against Sanders (Matt Taibbi of Rolling Stone’s account of this is a chilling), subtly malign under the guise of reportage. They write in support of the political establishment; and with that understanding, their intent is revealed. \\nThe authors’ most egregious assertion is that “Warren refused Sanders’ repeated entreaties to endorse his run for the presidency.” This is a plausible-seeming, but entirely unsubstantiated bit of gossip. It’s true, Sanders’ supporters longed for Warren to endorse him, and many of them doubtless pled on his behalf; but there is absolutely nothing to support the claim that Sanders himself made such entreaties. This version of events does, however, play neatly into the narrative of friction that the authors want to present. \\nI could be criticized for making too much of such seeming small details; but in fact, the point I am making here is that ‘reporters’ such as these two are not reporting about events, or even real people; they are reporting about the establishment’s views, seemingly congratulating each other on the subtlety of their understanding, while whole-heartedly missing the point and ignoring reality. Everything they say is in line with the same, lazy narrative espoused by establishment media througout the election. They don’t, and don't want to understand Warren or Sanders; they don’t comprehend why anyone would prefer them to Clinton; and the piece reveals their ongoing failure to self-reflect, to see how their own narrowness of perspective – which only reinforces itself, and those who agree with it – created the media echo-chamber that ultimately facilitated the rise of Trump. \\nNot that we need it further confirmation of the intent to discredit, but the authors of this not-so-subtle hit piece gave the last word on Warren and Sanders to former Republican Senator Jud Gregg of New Hampshire: “They’re carrying the mantle of socialism, and it’s on the rise in the Democratic Party”. More red-baiting (which establishment Democrats employed against Sanders throughout the primary); no mention of the absolutely dominant support Warren and Sanders’ positions enjoy among the American people (Juan Cole wrote an eye-popping piece about this in May of last year). So what, in fact, did the authors have in mind? It’s hard to say specifically, but their establishment bias, in style and intent, is clear. Maybe at this point it’s just habit. Or maybe they’re still trying to pretend that they’ve been right all along, and that we still ought to listen to them. \\nTo which I say: President Trump. \\nNowhere in the piece do they substantiate their own title: that Warren and Sanders would lead in the Senate. They quote a leader of Democracy for America, who makes the case that they’d be leading “the movement”; but they quote literally no one else in the Senate, and there is no mention of what specific form their leadership of the Senate might take. The title is pure, trojan clickbait; dangled to entice folks interested in Sanders and Warren (especially those who, rightly disenchanted with the establishement, might be investigating Warren and Sanders for the first time). Any who are informing themselves about Warren and Sanders for the first time would, based on this piece, start off with the view that they are extreme, petty, and their history is fraught with squabbling. No leaders to be found here; best to continue to trust the political establishment, and those who (like the authors) are here to tell you all about it. \\nWe need to hold such examples of failed journalism up to scrutiny; those of us who have followed the election closely know this kind of smear piece, in support of establishment ideals and efforts, put us in this position. They don’t serve the public good; they don’t report accurately on events; and they certainly will be of no help in stopping the oligarchs’ agenda. You can’t stop the oligarchy if you are carrying water for its creatures, and making baseless attacks upon those who oppose it – however sublte, or couched in orthodoxy. In fact, mindless allegiance to that orthodoxy is the heart of the problem. \\nWe can’t afford it any more. There must be no place for such blind, pro-establishment partisanship, in governance or reportage. Any news source that misrepresents information to serve the establishment must be revealed and rebuked. \\nThere’s just no more time. \\nThis work is licensed under an Attribution-NonCommercial-ShareAlike 4.0 International License 3.5 ·\""}, "time": 1742562254.2688642}