{"duration": 0.07409906387329102, "input_args": {"text": "'Musicians do not usually respond with patience when listeners refer to their music as “filth. ” So the tweets that Vince Staples sent early Wednesday morning in response to a viral video of a mother criticizing his work were surprising, particularly to those unfamiliar with Mr. Staples’s worldview. In a video posted to YouTube last month, a mother of four girls, who does not identify herself by name, says that she was driving her daughter to school when she heard “Norf Norf,” a song from Mr. Staples’s 2015 album “Summertime ’06. ” “This rap song comes on. Guys, I could not believe what I was hearing,” she says, adding that she usually tunes her car radio to Christian music but put on a “top hits” station at her   ’s request. “This is on our local radio station? This crap is being played?” She continues, “I couldn’t even believe the words I was listening to. As a mom, it infuriated me. ” The      video has received more than 800, 000 views. The lyrics of “Norf Norf” are explicit, painting a violent picture of Mr. Staples’ adolescent years in Long Beach, Calif. In her reaction video, the mother reads the words aloud, bursting into tears several times. She seems particularly taken aback by the repetitive line of the chorus: “I ain’t never ran from nothin’ but the police. ” “Let’s just encourage kids to run from the police because that’s O. K. right? ,” she says. “We wonder why this society is so messed up  —   just listen to the music. ” But responding to the video on Wednesday, Mr. Staples said that the woman seemed confused and frightened, and went on to defend her. “No person needs to be attacked for their opinion on what they see to be appropriate for their children,” Mr. Staples tweeted. “They have a right to it. ” He continued, “This misunderstanding of our community leads to miscommunication which we should convert into a progressive dialogue. ” He then declared that he was done speaking about the issue. Mr. Staples’s tweets, which were meant  to clarify earlier comments in The Independent, were a contrast to the mother’s disgust and to those who had mocked her ignorance about rap by responding to the video with laughing emojis or syncing the audio from the YouTube video with the beat of “Norf Norf. ” Others blasted her comments as racist and ignorant. David Dennis Jr. a journalism professor at Morehouse College who has covered   online for close to a decade, said that Mr. Staples’s thoughtful reaction was “extremely unusual. ” “Twitter is 140 characters of quick reactions and not a lot of nuance whatsoever,” Mr. Dennis said. “There are brilliant people who, when they get on Twitter, they sort of become the lowest common denominators of themselves. ” He said that the rapper’s experience as a public figure with a vast online following may have helped him empathize with the mother. “As a famous rapper, he sort of knows how Twitter mob mentality works,” Mr. Dennis said. “Through the lens of somebody who goes viral a lot, I think that empathy is something he learned. ” In an interview in The Fader soon after “Summertime ‘06” was released, Mr. Staples talked about people he knew who were trapped in a cycle of gang violence. His attitude toward them mirrored his comments about the mother. “I just want to help people understand that we don’t get to pick, bro,” he said. “We don’t get to pick where we was from. That ain’t how it works. ”'"}, "time": 1742562307.3167884}