{"duration": 0.15000414848327637, "input_args": {"text": "'One night nearly 140 years ago, Samuel Clemens told his young daughters Clara and Susie a bedtime story about a poor boy who eats a magic flower that gives him the ability to talk to animals. Storytelling was a nightly ritual in the Clemens home. But something about this particular tale must have stuck with Clemens, better known as Mark Twain, because he decided to jot down some notes about it. The story might have ended there, lost to history. But decades later, the scholar John Bird was searching the Twain archives at the University of California, Berkeley, when he came across the notes for the story, which Twain titled “Oleomargarine. ” Mr. Bird was astonished to find a richly imagined fable, in Twain’s inimitable voice. He and other scholars believe it may be the only written remnant of a children’s fairy tale from Twain, though he told his daughters stories constantly. It’s impossible to know why Twain did not finish the tale, or if he ever intended it for a wider audience. Now, more than a century after Twain dreamed it up, “Oleomargarine” has taken on a strange new afterlife. After consulting a few other scholars, Mr. Bird brought the text to the attention of the Mark Twain House and Museum in Hartford, which sold it to Doubleday Books for Young Readers. This fall, Doubleday will release “The Purloining of Prince Oleomargarine,” an expanded version of the story that was fleshed out and reimagined by the children’s book    team of Philip and Erin Stead. From Twain’s spare   the Steads created a   illustrated story featuring talking animals, giants, dragons, a kidnapped prince and a wicked king. While the original work has a timeless quality, the Steads added a postmodern twist: Twain himself makes an appearance in the book, to argue with the author, Philip Stead, about the direction the story takes. Finishing a partial manuscript by one of the country’s most revered writers was terrifying at times, the Steads said. “We said yes before our brains could tell us it was a terrible idea and we would never be able to do it,” Mr. Stead said in a telephone interview from the couple’s home studio in Northern Michigan. Erin Stead, who did the illustrations, said they were very aware of the creative risks involved in taking on the work of such a towering literary figure. “We both just tried to approach the text respectfully and with as much reverence as possible,” she said. “No one’s qualified to write for Mark Twain. ” “Oleomargarine” is the latest abandoned children’s tale to resurface decades after a revered writer’s death. In recent years, publishers and estates have dug deep into the archives of beloved children’s book authors in search of partial manuscripts and castoff gems, and have released previously unpublished works by Dr. Seuss, Beatrix Potter and Margaret Wise Brown. Twain’s story may hold even greater literary significance for scholars and fans, because it represents a new genre for him. While he wrote fiction, essays, journalism, travelogues, short stories and satire, he never published fiction for very young children, apart from his translation of a German fable. It certainly wasn’t for a lack of ideas. As Twain describes in his journals, his daughters constantly demanded he make up stories on the spot. They often gave him an image from a magazine or another visual prompt to use as inspiration. Sometimes they would insist that his stories mention every knickknack on their living room mantel, beginning with a painting of a cat and ending with a portrait of a young girl. “They were a difficult and exacting audience  —   those little creatures,” he wrote of his daughters in his journal. “The stories had to be absolutely original and fresh. ” Like an artifact from a lost civilization, “Oleomargarine” gives a tantalizing glimpse of the wild, ephemeral tales that Twain spontaneously created for his daughters each night, in the period when he was working on “Adventures of Huckleberry Finn. ” Scholars haven’t found any written remnants of those stories, apart from “Oleomargarine,” which suggests Twain thought it might hold lasting appeal for a wider audience. “He had at least some inkling that it might be publishable,” said Robert Hirst, the editor of “Who Is Mark Twain?” and the curator of Twain’s papers at Berkeley, a vast archive of more than 500 manuscripts. Mr. Bird stumbled on the manuscript in 2011, when he was searching the Twain archives for food references, for a Mark Twain cookbook. The word “oleomargarine” sounded as if it could be part of a recipe. “What I found is what seems to be the only remaining record of these bedtime stories that he told his kids,” Mr. Bird said. The manuscript was just 16 handwritten pages long, and unfinished. It opens as a poor starving boy named Johnny is given a magic seed, which grows into a flower. He eats it and discovers he can understand animals. Johnny and the animals go on a quest to rescue Prince Oleomargarine, who has been kidnapped by giants and taken to a cave guarded by dragons. At one point, Twain scribbled down a suggestion that his daughter Susie made, when she asked if the kangaroo was the hostess. After finding references to bedtime stories about a boy named Johnny in Twain’s journals, Mr. Bird theorized that Twain had probably told this story to his daughters while the family was in Paris in 1879. Johnny was a recurring character in the nightly tales for the Clemens girls, at least for a while. In a diary that Twain kept about his daughters, he described how they lost interest in Johnny after the character told a lie. “Johnny’s days of usefulness were over he was up a stump,  I had to leave him there,” Twain wrote. At first, Mr. Bird was unsure what to do with the fragmentary text. After talking to Mr. Hirst and a few other scholars, he decided that the story offered a significant new perspective on Twain’s domestic life and work, and that it should be published. “It’s a testament to his incredible powers of invention,” said Mr. Bird, a professor of English at Winthrop University in South Carolina. He wrote his own version, which closely followed Twain’s blueprint and incorporated his language, and took the idea of publishing it to Cindy Lovell, who was then the executive director of the Mark Twain House and Museum. But Mr. Bird’s version, which hewed to the original, was never published. Doubleday, which acquired rights to the story from the Twain House, decided to hire the Steads, who are stars in children’s publishing, to finish the story. “What we ended up with is this wonderful story inspired by Twain’s unfinished manuscript, which makes any Twain purist uneasy,” Ms. Lovell said. Mr. Stead secluded himself in a cabin on Beaver Island, in the middle of Lake Michigan, and wrote the first draft of the   story in a feverish nine days. He often found himself arguing with Twain about the changes he wanted to make and found the imagined conversations so compelling that he put them in the book. To capture a rhythm that mirrored Twain’s natural speaking voice, Mr. Stead read the first and second volume of Twain’s autobiography, which Twain had dictated. “I tried to approach the project as a piece of oral history,” Mr. Stead said. “This was a story that Twain told his daughters, and now he’s going to tell it to me, and now I’m going to tell it. ”'"}, "time": 1742563660.6807556}