{"duration": 1.395251750946045, "input_args": {"text": "'Source: Global Research \\nUS State Dept. Dismisses Question from RT, Says Won’t Treat it Like Other Media \\nRT has asked the US State Department for specific information concerning allegations that Russia is targeting hospitals in Syria. The response was a reiteration of those allegations and a refusal to treat RT in the same way as other media outlets. \\nDuring Wednesday’s State Department briefing, spokesman John Kirby accused Russia and the Syrian regime of the bombing of ”five hospitals and at least one mobile clinic in Syria.” RT’s reporter Gayane Chichakyan asked Kirby to specify the details of the alleged incidents, including their location . \\nKirby said that he doesn’t know the exact locations. \\n“I’m not making those accusations, I’m telling you that we’ve seen reports from credible aid organizations,” Kirby said, refusing to clarify any details on the alleged attacks or even give the list of the ”many Syrian relief agencies” on which the State Department relied. \\nHe went on with his criticism of the reporter. \\n“Here’s a good question: Why don’t you ask your Defense Ministry what they are doing? You work for Russia Today [RT], and so why shouldn’t you ask your government the same kind of questions that you are asking me?” Kirby told RT on Wednesday. While Chichakyan pointed out she needed specific details so that RT could inquire about the allegations, Kirby refused to elaborate. \\nThe US official’s response prompted Matt Lee, a correspondent from the AP news agency, to intervene. \\n“Please be careful about saying ‘your Defense Ministry’ and things like that – she’s a journalist, she’s just like the rest of us are,” he pointed out. \\n“From a state-owned outlet!” Kirby interrupted, adding, ”I’m not going to put Russia Today on the same level with the rest of you who are representing independent media outlets.” \\nA State Department official later apologized to Chichakyan and emailed the reporter a detailed statement with the locations of the allegedly bombed hospitals originally sent by “HEALTH CLUSTER TURKEY HUB / Health Cluster partners & NPM.” \\nThe statement said three hospitals were hit by airstrikes in Atarib, outside Aleppo, while two hospitals and a mobile clinic were hit in the Idlib province, resulting in several reported deaths and injuries and rendering the medical facilities out of service. \\nIt did not, however, lay blame on any party for the alleged strikes. \\nEarlier on Tuesday, State Department spokesperson Elizabeth Trudeau accused Russia of striking “five hospitals and one mobile clinic in Syria,” without specifying the source of information. Russia’s Defense Ministry has strongly denied these allegations. \\n“We do not know where Elizabeth Trudeau gets information about what is happening in Syria. Her repeating rumors about some ‘five hospitals’ and ‘one mobile clinic’ which were ‘bombed’ only confirms the fact that all the State Department’s public rhetoric on the situation in Syria is based on blatant lies,” Defense Ministry spokesman Major General Igor Konashenkov said at a Tuesday briefing. \\nAs of Wednesday, Russia has not launched any airstrikes in Aleppo for 29 days, according to the Defense Ministry. Russian jets are currently flying sorties in Idlib and Homs provinces, striking only verified terrorist infrastructure , namely factories and arms depots. ‘Unprofessional, borders on incompetence’ \\nLarry Johnson, a retired CIA and State Department official, criticized Kirby’s behavior during the briefing, saying that his treatment of RT’s correspondent was “so unprofessional” that it “borders on incompetence.” \\nJohnson says that the proper way for Kirby, who “relays the assentation of an unnamed group” to handle the situation, would be to calmly explain that he was not able to name the locations at the moment. \\nWhile the accusations thrown at Russia stem from “highly suspect” sources of information, they fit the narrative of Russia’s demonization in the US media, Johnson said. \\n“I have never seen this kind of hysteria against Russia in the United States, ever… the extreme statements, the insults directed at President Putin and at Russia in general, the notion that the United States can conduct military operation at the Russian border at will,” Johnson said, adding that it should not come as a surprise that such rhetoric causes serious concerns in Russia. \\n“It’s emotional, it’s not rational, it’s nothing that can be explained by reason,” he added, voicing hopes that President-elect Donald Trump will review this approach and opt for cooperation with Russia instead. \\nIn contrast, constant rebel shelling in Syria causing mass civilians casualties continues to go largely unnoticed in Washington, Johnson argues, saying that it appears that for the US government “the other side doesn’t matter.” \\nSpeaking about Kirby’s attempt to justify his conduct toward RT’s correspondent by pointing out that RT is funded by the Russian state, Johnson regarded it as an odd argument, as the same is true for many major media outlets, for instance, BBC. At the same time, Johnson believes that US mainstream media is failing to do its job properly and seems to be “in the pocket of this [Obama] administration.” \\n“They are not even asking basic critical fundamental questions, they accepting assertions by the administration at face value, not challenging, not questioning,” he said. The original source of this article is RT News Leave a Reply Your email address will not be published. Required fields are marked * Name * Website Comment You may use these HTML tags and attributes: <a href=\"\" title=\"\"><abbr title=\"\"><acronym title=\"\"><b><blockquote cite=\"\"><cite><code><del datetime=\"\"><em><i><q cite=\"\"><strike><strong> VISITORS'"}, "time": 1742564226.2560596}