{"duration": 0.10538673400878906, "input_args": {"text": "'Texas Governor Greg Abbott moved quickly against the Travis County Sheriff who announced late last week that she would be changing her department’s policy on cooperating with federal immigration officials. [“As Sheriff your primary duty is to ensure the safety of the residents of Travis County,” Abbott wrote in a letter to Sheriff Sally Hernandez. “However, your recent policy directive forbidding Travis County Sherriff’s Office (TCSO) employees from cooperating with U. S. Immigration and Customs Enforcement (ICE) (except in the most limited of circumstances) betrays your oath and the residents of Travis County. I strongly urge you to reverse that policy before its effective date of February 1, 2017. ”  Abbott called the decision by Texas’ capital county sheriff “dangerous” and “shortsighted. ” In referring to her announcement, the Texas governor said it was “not a pronouncement of sound public policy it is a dangerous game of political Russian roulette —  with the lives of Texans at stake. ” Moreover, the governor’s letter stated: “Your shortsighted policy ignores those astounding figures and would permit TCSO employees to comply with an ICE detainer request in only the most limited of circumstances. Under your reckless policy, for example, dangerous criminal aliens convicted of felonies like murder aggravated assault human trafficking, including child sex trafficking aggravated kidnapping inducing sexual performance by a child or indecency with a child dangerous gang activities and the manufacture or delivery of deadly substances such as heroin, methamphetamine, cocaine, GHB, PCP, and ketamine will be turned loose into Travis County without permitting ICE the opportunity to collect them. ” The Texas Legislature is already in the process of dealing with sanctuary cities and counties. Texas State Senator Charles Perry   a bill requiring local law enforcement agencies in the state to uphold current immigration law. The filing of SB 4 by Senator Charles Perry ( ) on Tuesday follows the announcement by Texas Lt. Governor Dan Patrick that ending sanctuary cities in Texas would be a priority for the 85th Legislative Session which begins in January 2017. “By electing a Republican president and Republican majorities in Congress, the American people made it clear that solving our illegal immigration crisis must be a priority,” Senator Charles Perry said in a statement obtained by Breitbart Texas. “That starts by eliminating sanctuary cities, securing our border, and enforcing the immigration laws we currently have on the books. We cannot sit idly by and allow local policies to undercut efforts made at the federal and state level. ” Lt.  Governor Patrick said, “No city in Texas should be allowed to ignore the law.  We will end this practice once and for all this session. ” Governor Abbott addressed the legislative session stating: “During the pending legislative session, I will be working with the Texas legislature to do more to protect our citizens from misguided and dangerous sanctuary policies like yours. Your reckless actions endangering the safety of Texans will provide powerful testimony for the need to strengthen Texas law. It will make clear that conditioning state funding on compliance with federal immigration laws is not enough. Rather, Texas must enact tough penalties that punish those who would put themselves above the law —  and even above the community they purportedly serve. ” This is not the first Texas county sheriff to be confronted by Abbott over sanctuary policies. Stating that such policies will “no longer be tolerated in Texas,” Abbott told Dallas County Sheriff Lupe Valdez to change her position or face losing state law enforcement grants. Valdez announced in October 2015 that she would be considering immigration detainer requests only on a    basis. “Your refusal to fully participate in a federal law enforcement program intended to keep dangerous criminals off the streets leaves the State no choice but to take whatever actions are necessary to protect our fellow Texans,” Abbott said at the time. “Now more than ever, it is essential that state, federal, and local law enforcement work collaboratively to protect our fellow Texans and to ensure that our laws are upheld, not disregarded. ” The move by the two Texas sheriffs could also put their counties in danger of losing federal law enforcement grants, Breitbart Texas previously reported. “99 percent is not good enough,” Congressman John Culberson told Breitbart Texas. “These jurisdictions must cooperate 100 percent in order to qualify for these DOJ grants. They must choose between protecting illegal aliens and receiving federal funds. ” Breitbart Texas reached out to Sheriff Hernandez for a response to the governor’s letter and threat of stopping state funds to her office. No response was available by publish time. Bob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @. BobPriceBBTX. Governor Greg Abbott’s Letter to Sheriff Sally Hernandez Over Sanctuary Policies by Bob Price on Scribd, '"}, "time": 1742563228.6938639}