{"duration": 0.12534570693969727, "input_args": {"text": "'Kremlin: NATO was Created for Agression 11/07/2016 \\nRUSSIA TODAY Reports of the new reinforcement of NATO troops close to Russia’s borders show “the aggressive character of the organization,” the Kremlin has said, commenting on recently announced preparations to deter an alleged Russian threat. \\nThe Western military alliance was established “ not for peace-building, but exactly for aggressive actions ,” Kremlin spokesman Dmitry Peskov said on Monday. Despite the fact that blocs which opposed NATO no longer exist, it’s impossible to change the alliance’s “ aggressive nature ” due to its ideological and political bases. \\nEarlier on Monday, the Times published a report suggesting that “ hundreds of thousands of NATO troops will be put on a higher state of alert amid growing tensions with Russia .” According to the British daily – which cites the alliance’s secretary-general, Jens Stoltenberg, and the UK’s outgoing permanent representative to the bloc, Adam Thomson – NATO aims to largely speed up the time its troops can be deployed. \\nIt reportedly aims to have up to 300,000 military personnel from nations across the alliance at the ready, having shortened their response time to about two months, compared to the current 180 days. \\n“ We are responding with the biggest reinforcement of our collective defense since the end of the Cold War ,” Stoltenberg told the Times . The bloc is looking into how more of its 3 million personnel “ can be ready on a shorter notice ,” he added, saying that NATO defense ministers have already had discussions on the issue. \\nHaving accused Moscow of “ assertive ” behavior, the NATO chief said Russia had increased its defense spending and was “ developing new military capabilities .” \\n“ In regard to its national security, Russia acts within its national borders, undoubtedly posing no threat to anyone ,” Peskov said, commenting on Stoltenberg’s statements. The way the military bloc has reacted “ once again shows the organization’s aggressive nature ,” he added.'"}, "time": 1742562858.1779711}