{"duration": 0.019783973693847656, "input_args": {"text": "'Neon AK-47: How young Russian guns celebrate Halloween (PHOTOS) Published time: 26 Oct, 2016 20:40 Get short URL © artemiypanarin / Instagram While it’s common for athletes to post pictures on social media of themselves dressed in their Halloween costumes, young Russian National Hockey League players surely add a taste of their homeland to their outfits. \\nChicago Blackhawks’ youngster Artemi Panarin posed with a neon AK-47, alongside his teammate and fellow Russian Artem Anisimov, who is wearing a skull painted on his face. Фото опубликовано @artemiypanarin Окт 26 2016 в 11:16 PDT \\nArguably the biggest NHL star, Alex Ovechkin of the Washington Capitals was dressed as a prisoner, with Russian gangster-style slicked back hair, while his wife, model Nastya Shubskaya, was his guardian cop. Фото опубликовано Nastasiya Ovechkina (@nastyashubskaya) Окт 23 2016 в 6:51 PDT \\nAnother of the Capitals’ Russian stars, Evgeny Kuznetsov, was spotted in teammate Nate Schmidt’s Instagram post, wearing an Air Force flight suit. Schmidt was also clad in a flight suit, but no telling who was Maverick and who was Goose in the ‘Top Gun’-style get-ups. Фото опубликовано Nate Schmidt (@nateschmidt88) Окт 23 2016 в 8:33 PDT \\nAnother “prisoner and cop” couple was found in Edmonton, with the Oilers’ Anton Slepyshev and his wife Julia. Фото опубликовано ANTON SLEPYSHEV (@anton.slepyshev) Окт 24 2016 в 9:35 PDT \\nThe New York Rangers’ young forward Pavel Buchnevich dressed as Jack the Sparrow of popular film series ‘Pirates of the Caribbean’.'"}, "time": 1742562757.9045959}