{"duration": 0.038158416748046875, "input_args": {"text": "'At least a   NAACP members, including the organization’s national president Cornell William Brooks, were arrested Tuesday night during a   demonstration in protest of Republican senator Jeff Sessions,   Donald Trump’s Attorney General nominee. [“We are asking the senator to withdraw his name for consideration as attorney general or for the   Donald Trump, to withdraw the nomination,” Brooks said, CNN reports.  Brooks and the other protesters occupied Sessions’s Alabama office for more than six hours before police removed and arrested them. The @NAACP  @AlabamaNAACP are occupying the Mobile office of @jeffsessions —  untill he withdraws as a AG nominee or we’re arrested. @tvonetv pic. twitter.   —   Cornell Wm. Brooks (@CornellWBrooks) January 3, 2017,  “We were clear today: We want others to participate in acts of civil disobedience,” Brooks told ABC News. “This is a matter of ongoing opposition to someone with a clear,   rights record in Senator Session. ” The six protesters were taken to jail. A court date has been set for January 30. Civil disobedience is 1 way for citizens to honor the rule of law. We were arrested to support a @TheJusticeDept for everyone. #stopsessions pic. twitter.   —   Cornell Wm. Brooks (@CornellWBrooks) January 4, 2017,  Brooks said Senator Sessions’s “disregard for voter suppression” and his support of “the myth of voter fraud” are among the reasons the civil rights organization publicly opposes his nomination as attorney general. A Selma,   Army veteran, Sessions was the first senator to endorse Trump’s candidacy. The   tapped the former U. S. attorney to serve as attorney general in November. The NAACP   Tuesday coincided with the publication of an open letter signed by a group of 1, 226 law professors opposing Sessions’s nomination. “In 1986, the   Senate Judiciary Committee, in a bipartisan vote, rejected President Ronald Reagan’s nomination of  . S. Attorney Sessions for a federal judgeship, due to statements Sessions had made that reflected prejudice against African Americans,” the letter says. “Nothing in Senator Sessions’ public life since 1986 has convinced us that he is a different man than the    attorney who was deemed too racially insensitive to be a federal district court judge. ” Senator Sessions has vehemently denied the allegations, as Breitbart News investigative reporter Julia Hahn notes, citing his record of supporting civil rights initiatives in Alabama and his efforts to bankrupt and dismantle the the Ku Klux Klan in the state through civil litigation. Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742561989.0987084}