{"duration": 0.07645392417907715, "input_args": {"text": "'Waking Times \\nResearch reveals that cannabis may, in fact, serve as an effective exit drug for persons suffering from alcoholism or addiction to illicit or prescription drugs. A survey conducted by researchers at the University of British Columbia (UBC) found that addicts may benefit from using cannabis as a substitute to more dangerous and health-destroying substances, especially alcohol and prescription drugs. Cannabis may be a step towards fighting addiction. \\n“Research suggests that people may be using cannabis as an exit drug to reduce use of substances that are potentially more harmful, such as opioid pain medication.” ~ Zach Walsh, Researcher and UBC Associate Professor of Psychology \\nThe UBC study was conducted using a 414-question survey that was offered to medical cannabis patients. The survey gathered information about medical conditions and symptoms, patterns of medical cannabis use , cannabis substitution and barriers to access to medical cannabis. \\nCollecting surveys from 472 adults, all of whom used cannabis for therapeutic purposes, the researchers found that: \\n“Substituting cannabis for one or more of alcohol, illicit drugs or prescription drugs was reported by 87% of respondents, with 80.3% reporting substitution for prescription drugs, 51.7% for alcohol, and 32.6% for illicit substances.” \\nThe research also revealed that the use of medical cannabis may be able to help with depression, PTSD and anxiety in some sufferers. The researchers felt that it was not effective in treating symptoms of bipolar disorder and psychosis. The findings were published in the academic journal Clinical Psychology Review. \\nThe study also found that, according to evidence, “cannabis use does not appear to increase risk of harm to self or others.” ( Source ) \\nFull study can be found here: http://onlinelibrary.wiley.com/doi/10.1111/dar.12323/abstract About the Author \\nAnna Hunt is co-owner of OffgridOutpost.com , an online store offering GMO-free healthy storable food and emergency kits . She is also the staff writer for WakingTimes.com . Anna is a certified Hatha yoga instructor and founder of Atenas Yoga Center. She enjoys raising her children and being a voice for optimal human health and wellness. Visit her essential oils store here . Visit Offgrid Outpost on Facebook . \\nSources:'"}, "time": 1742561768.8517048}