{"duration": 0.04767203330993652, "input_args": {"text": "'U. S. Education Secretary Betsy DeVos said Monday during an interview on Fox News’ America’s Newsroom that “there really isn’t any Common Core anymore” in the country’s schools. [“The Every Student Succeeds Act [ESSA] which is in the process of being implemented now, essentially does away with the whole argument about Common Core,” DeVos said, adding:  Each state can set the standards for their state. They may elect to adopt very high standards for their students to aspire to and work toward. That will be up to each state to be able to ascertain what is right for that state. We hope that all of them will have very high expectations. ” The secretary’s comments come in sharp contrast with President Donald Trump’s statement at a CEO Business Town Hall several weeks ago. During that meeting, Trump returned to his campaign promise to end the Common Core standards and once again make education policy the domain of state and local governments. “Common Core, I mean, we have to bring education more local,” Trump said at the White House. “We can’t be managing education from Washington. ” The president continued: When I go out to Iowa, when I go out to the different states and I talk, they want to run their school programs locally and they’ll do a much better job  …     And I like the fact of getting rid of Common Core. You know, Common Core, to me, we have to end it. We have to bring education local, to me. I’ve always said it, I’ve been saying it during the campaign, and we’re doing it. DeVos’s statement is similar to that of other establishment Republicans in Congress. In December of 2015, Sen. Lamar Alexander ( ) chairman of the Senate Health, Education, Labor, and Pensions Committee, touted that he and Democrat Sen. Patty Murray (WA) had facilitated the “bipartisan” passage of the ESSA measure that would replace the George W.   No Child Left Behind (NCLB). President Barack Obama signed the bill into law almost immediately, referring to it as a “Christmas miracle. ” “We have reversed the trend toward a national school board, repealed the federal Common Core mandate, and enacted what the Wall Street Journal called ‘the largest devolution of federal control to states in a quarter century,” Alexander said. A statement on Sen. Richard Burr’s ( ) website following the signing of ESSA into law also said the measure had succeeded in “repealing the common core mandate. ” “This is a big deal,” Burr said about the new law. “It will bring an additional $24 million per year in funding to poorest children in North Carolina and put a stop to the Common Core mandate. ” Establishment Republicans based their pronouncements on the portion of ESSA that states, “The federal government is prohibited from   …     Mandating, directing, controlling, coercing, or exercising any direction or supervision over academic standards that states develop or adopt, including Common Core State Standards. ” Parent activists and education scholars who have studied the law, however, assert ESSA neither repeals the Common Core mandate, nor prohibits the education secretary from coercing states into adopting the standards. In fact, those who have been battling against Common Core in the states say ESSA actually does the opposite: it keeps states anchored to the controversial education reform. “Within the other 1, 060 pages of ESSA lurk the provisions that will keep states in Common Core, or something that looks very much like Common Core,” American Principles Project (APP) education fellow Jane Robbins and Indiana parent activist Erin Tuttle wrote at The Pulse 2016. “The Secretary won’t have to mandate anything, because the other parts of the bill contain the requirements for   …     ‘high standards,’” a phrase that has come to refer to Common Core. ESSA also requires every state to submit its education plan for approval to the U. S. Department of Education. Robbins and Tuttle assert: That plan must be “coordinated” with 11 federal statutes, including the   Workforce Innovation and Opportunity Act passed a year ago the Education Sciences Reform Act, which is all about collecting student data for research the Child Care and Development Block Grant Act, which adds to the Head Start requirements on preschool standards and the National Assessment of Educational Progress (NAEP) Authorization Act, which governs the NAEP test that will almost certainly be aligned to Common Core to hide the fact that Common   students perform poorly on NAEP. Requiring state plans and therefore state standards to coordinate with all these federal statutes means, as a practical matter, states will keep Common Core. The ESSA law also says, “Each State shall demonstrate that the challenging academic standards are aligned with entrance requirements for   coursework in the system of public higher education in the State and relevant State career and technical education standards. ” “This is simply another way of saying states must have ‘  and  ’ standards,” say Robbins and Tuttle. “And as made clear by the U. S. Department of Education’s own materials, ‘  and  ’ means Common Core. ” Upon Trump’s comments earlier this month that “we have to end Common Core,” American Principles Project senior fellow Emmett McGroarty said, “Today’s comments show that President Trump has not forgotten his promise to end Common Core and return to local control of education. ” McGroarty added that Trump’s leadership on the elimination of Common Core in the states is vital from this point forward. “Every Swamp creature will unite to fight against the president on this, so his leadership will be critical,” he explained. “We look forward to seeing what steps the Trump Administration will take in the coming months to take power away from Washington D. C. and return it to parents. ”'"}, "time": 1742628567.5412352}