{"duration": 0.34862279891967773, "input_args": {"text": "'Why are CDC Employees “Crying in the Hallways” After Donald Trump’s Election? Will years of alleged fraud at the CDC get more attention in the Trump administration? 7 reasons CDC employees should be “crying in the hallways” PORTLAND, Oregon\\u200a—\\u200a Question : The day after Donald Trump’s unexpected win in the presidential election last week, how many government agencies had reports in the media of their employees “crying in the hallways”? Answer : Exactly one. The Centers for Disease Control and Prevention , which is based in Atlanta, GA. As a long-time critic of the CDC, I was pretty shocked to see this headline last week, courtesy of Atlanta’s NPR radio station, 90.1 WABE: Atlanta CDC Employees Express Anxiety Over Trump’s Win The story detailed the climate at CDC the day after the election: \\n“At the General Muir deli across the street from the CDC, a few employees talked to WABE, asking that their names not be used. One microbiologist said her colleagues were crying in the hallways.” “It’s really sad,” she said. “It’s depressing. I’m eating a bagel to try and be happy.” \\nSee: http://news.wabe.org/post/atlanta-cdc-employees-express-anxiety-over-trumps-win \\nThe average voter\\u200a—\\u200aeven a Trump supporter\\u200a—\\u200aprobably has no idea why CDC employees might be “crying in the hallways,” while the average autism parent (meaning those of us who have children with autism) like me understands it perfectly. Frankly, it’s pretty hard for me to write about the CDC without shaking with at least a little bit of rage. On the off chance this is your first time considering this topic, I’ll steady my hands and explain it to you: Source: learntherisk.org The CDC is in charge of recommending the vaccination schedule for U.S. children, which has grown from 5 total doses in the 1960s to more than 70 today. The CDC is ALSO in charge of monitoring vaccine safety for those more than 70 doses. In an ironic twist (at least for parents like me), the CDC is ALSO in charge of tracking the number of children with Autism in the U.S., a number that has grown from 1 in 10,000 in the 1980s to 1 in 68 today. For many autism parents, the CDC being in charge of both implementing the vaccine schedule and monitoring the safety of vaccines has always felt like an extreme conflict of interest. And, we were never alone in that feeling. 10 years ago, two members of Congress, Representatives Dave Weldon and Carolyn Maloney, tried to pass a bill to separate vaccine safety from the CDC: \\nFrom the press release for the bill: Congresswoman Carolyn Maloney \\nAt a press conference Wednesday morning, U.S. Reps. Dave Weldon, M.D. (R-FL) and Carolyn Maloney (D-NY) introduced a bill that would give responsibility for the nation’s vaccine safety to an independent agency within the Department of Health and Human Services, removing most vaccine safety research from the Centers for Disease Control (CDC). Currently, the CDC has responsibility for both vaccine safety and promotion, which is an inherent conflict of interest increasingly garnering public criticism. Congressman Dave Weldon, M.D. “There’s an enormous inherent conflict of interest within the CDC and if we fail to move vaccine safety to a separate independent office, safety issues will remain a low priority and public confidence in vaccines will continue to erode,” said Weldon, noting that across the federal government similar conflicts of interests have been remedied, but with regard to mandatory childhood vaccines the conflict continues to persist unchecked. “This bill will provide the independence necessary to ensure that vaccine safety research is robust, unbiased, and broadly accepted by the public at large.” “Vaccines do wonders for public health, but when the government requires them, it must also ensure that they’re safe,” said Maloney. “We need adequate, unbiased research on vaccines, and this legislation would deliver that. I applaud Dr. Weldon for his tremendous commitment to and leadership on this issue. He is truly dedicated to protecting our children and the public at large.” See: https://maloney.house.gov/media-center/press-releases/weldon-maloney-introduce-vaccine-safety-bill Alas, like every bill intended to reduce the power and influence of the CDC, the bill never passed. Robert F. Kennedy, Jr., a well-known environmental activist and progeny of one of the most famous political families in the world, has spoken with force about the conflict problems at CDC: Robert F. Kennedy, Jr. “The CDC is a captive agency. The vaccine agency has become a subsidiary of big pharma. Vaccines are a $30 billion industry, an increasing profit center. They have been able to compromise all checks and balances that once protected children.” – Robert F. Kennedy, Jr. For parents uncertain as to where CDC’s loyalties lie, the departure of the previous head of CDC\\u200a—\\u200aJulie Gerberding\\u200a—\\u200ato a well-paying job as President of the vaccine division of Merck , the largest vaccine maker in the world, made many of us permanently cynical: “Dr. Julie Gerberding, former director of the Centers for Disease Control and Prevention, was named president of Merck & Co Inc’s vaccine division, the company said on Monday. Gerberding, who led the CDC from 2002 to 2009, stepped down when President Barack Obama took office.” \\nSee: http://www.reuters.com/article/us-merck-gerberding-idUSTRE5BK2K520091221 7 Reasons Back to the employees “crying in the hallways” and eating bagels to feel better. In my opinion, it’s going to get far worse before it gets better for the CDC, and here’s 7 reasons why: Reason #1: The CDC just got outed last month by its own scientists complaining that CDC’s “mission is being influenced and shaped by outside parties and rogue interests.” From the Huffington Post on October 17, 2016: Concerns about the inner workings of the U.S. Centers for Disease Control and Prevention (CDC) have been mounting in recent months amid disclosures of cozy corporate alliances. Now a group of more than a dozen senior scientists have reportedly lodged an ethics complaint alleging the federal agency is being influenced by corporate and political interests in ways that short-change taxpayers… “It appears that our mission is being influenced and shaped by outside parties and rogue interests… and Congressional intent for our agency is being circumvented by some of our leaders. What concerns us most, is that it is becoming the norm and not the rare exception,” the letter states. “These questionable and unethical practices threaten to undermine our credibility and reputation as a trusted leader in public health.” See: http://www.huffingtonpost.com/carey-gillam/spider-bites-cdc-ethics-c_b_12525012.html The scientists\\u200a—\\u200awho chose to remain anonymous for fear of retribution (never a good reflection on an agency’s culture)\\u200a—\\u200apublished a complete letter with their complaints that you can read here : “We are often directed to do things we know are not right.” — CDC Scientists Preserving Integrity, Diligence and Ethics in Research (CDC SPIDER) Reason #2: CDC has a whistleblower scientist— Dr. William Thompson\\u200a—\\u200aalleging that CDC scientists destroyed data that showed a link between the MMR vaccine and autism This is a serious allegation, especially because Dr. Thompson is the principal author of a number of the studies used to “prove” vaccines “don’t cause autism” released by CDC. From former CBS journalist Sharyl Attkisson: A current Centers for Disease Control (CDC) senior scientist has made an unprecedented admission: he and his colleagues–he says– committed scientific misconduct to cover up a meaningful link between vaccines and autism in black boys. Just as startling, the CDC scientist, Dr. William Thompson, says the study co-authors “scheduled a meeting to destroy documents related to the study. The remaining four co-authors all met and brought a big garbage can into the meeting room, and reviewed and went through all the hardcopy documents that we had thought we should discard, and put them into a huge garbage can.” The…co-authors…brought a big garbage can into the meeting room… [and put the documents]…into a huge garbage can. – CDC Senior Scientist Dr. William Thompson \\nSee: https://sharylattkisson.com/cdc-scientist-we-scheduled-meeting-to-destroy-vaccine-autism-study-documents/ “A huge garbage can”? Did he really say that? Yes, he really did, and one of our Congressmen\\u200a—\\u200aRepresentative Bill Posey of Florida\\u200a—\\u200arepeated Dr. Thompson’s words in Congressional testimony: Reason #3: CDC has another whistleblower alleging that CDC’s gathering of autism prevalence numbers has been fraudulent From the The Alliance for Human Research Protection website: On April 4, 2016, Dr. Judith Pinborough-Zimmerman, the former Principal Investigator for the CDC’s Autism and Developmental Disabilities Monitoring Network (ADDM) in Utah, filed a whistleblower lawsuit in the U.S. District Court. Dr. Zimmerman charged University of Utah researchers for CDC’s Network with “publishing data under people’s names who had not done the work and that the data contained uncorrected errors.” “Depositions from Zimmerman and her former colleagues suggest that the alleged data errors were serious and have the potential to produce major differences in reported Utah autism rates. In the 2008 ADDM Network Report, Utah autism rates were the highest in the country at 1 in 47. In the 2012 report released today, Utah rates plummeted nearly 20% to 1 in 58 as most other ADDM Network sites reported either rising or stable autism rates.” See: http://ahrp.org/lawsuit-by-principal-investigator-for-cdc-utah-autism-data-filed-whistleblower-lawsuit/ Health Choice, an advocacy organization, explains why Ms. Zimmerman’s allegations are so serious: “The CDC has been misrepresenting the alarming rise in autism rates since the late 1980s,” says Health Choice Executive Leadership Team Chairman Mark Blaxill. His Health Choice analysis, “The Autism Emergency Continues”, released today outlines a number of criticisms of the CDC’s surveillance program. “They have selected a partial and unrepresentative sample of states to track, changed the sample in a biased fashion over the years, and then take too long to report out the data. Today’s 2012 report is over a decade behind the problem, giving us autism rates for children born twelve years ago.” “If the sharp increases in autism rates began in the late 1980s,” asks Blaxill, “why would CDC design a tracking survey beginning with the 1992 birth year? Elsewhere, they’ve published data with very low rates from the late 1980s in New Jersey and Georgia but don’t connect the dots in the ADDM publications from today’s 1 in 68 rate back to these earlier numbers.” “Health Choice is very worried that the CDC’s ADDM Network reporting is not accurately representing the seriousness of the autism epidemic. For most affected individuals, autism is a lifelong disability, a condition that frequently wreaks havoc on families, school systems, and state resources.” Mr. Blaxill went on to say, “since 1990, autism rates have exploded: something new and terrible is happening to a generation of children. It’s time to for the CDC stop sugar coating the inconvenient facts and confess that we have a national emergency so we can finally get to the bottom of this tragic problem.” Reason #3A: One of the authors of the “Danish Studies” exonerating thimerosal’s (a mercury preservative) role in Autism is wanted by the CDC for embezzlement (Author’s note: the failure to mention Poul Thorsen was brought up to me by an attentive reader. It’s hard to keep track of so much malfeasance!) I’m just glad I can prove this one with other articles, it’s almost too much to believe: Researcher who dispelled vaccine-autism link: “Most-wanted fugitive” This is on the HHS website, right now! “A former Centers for Disease Control (CDC) researcher, best known for his frequently-cited studies dispelling a link between vaccines and autism, is still considered on the lam after allegedly using CDC grants of tax dollars to buy a house and cars for himself. “Most wanted fugitive” CDC researcher Poul Thorsen published studies dispelling a link between vaccines and autism Poul Thorsen, listed as a most-wanted fugitive by the Department of Health and Human Services Office of Inspector General, was discredited in April 2011 when he was indicted on 13 counts of wire fraud and nine counts of money laundering. Some have argued that his alleged fraudulent behavior calls into question the validity of his studies. There is no indication the studies have been retracted to date.” See: https://sharylattkisson.com/researcher-who-dispelled-vaccine-autism-link-most-wanted-fugitive/ I can’t make this stuff up! Here’s another article about Poul Thorsen from Robert F. Kennedy, Jr: Central Figure in CDC Vaccine Cover-Up Absconds With $2M \\nSee: http://www.huffingtonpost.com/robert-f-kennedy-jr/central-figure-in-cdc-vac_b_494303.html Reason #4: Two Merck whistleblowers are alleging that the Mumps vaccine doesn’t work very well, and that Merck knew that and fudged the data Remember the former CDC head (Julie Gerberding) who went to go work at the Merck vaccine division? Yup, it really is that ugly… See: http://philadelphia.legalexaminer.com/fda-prescription-drugs/massive-fraud-in-merck-mmr-vaccine-testing/ “A U.S. judge rejected Merck’s attempt at a dismissal after determining there was plausible grounds for the claims. Therefore the medical giant is being forced to defend themselves and their vaccine in at least two federal cases. Merck could also be forced to defend itself in Congress. Representative Bill Posey (R-FL)\\u200a—\\u200aa known critic of the CDC whom is investigating the link between autism and vaccines\\u200a—\\u200ais reviewing hundreds of documents turned over by the CDC whistleblower.” According to the whistleblowers’ court documents, Merck’s misconduct was far-ranging: It “failed to disclose that its mumps vaccine was not as effective as Merck represented, (ii) used improper testing techniques, (iii) manipulated testing methodology, (iv) abandoned undesirable test results, (v) falsified test data, (vi) failed to adequately investigate and report the diminished efficacy of its mumps vaccine, (vii) falsely verified that each manufacturing lot of mumps vaccine would be as effective as identified in the labeling, (viii) falsely certified the accuracy of applications filed with the FDA, (ix) falsely certified compliance with the terms of the CDC purchase contract, (x) engaged in the fraud and concealment describe herein for the purpose of illegally monopolizing the U.S. market for mumps vaccine, (xi) mislabeled, misbranded, and falsely certified its mumps vaccine, and (xii) engaged in the other acts described herein to conceal the diminished efficacy of the vaccine the government was purchasing.” “The fraudulent activities, say the whistleblowers, were designed to produce test results that would meet the FDA’s requirement that the mumps vaccine was 95 percent effective.” Reason #5: Just yesterday, a local Atlanta TV station explained to the world what the vaccine court is and that it’s not working Definitive book on the vaccine court. Never heard of the Vaccine Court? You’re not alone. This is the first news story I’ve ever seen mentioning and criticizing the court, and it’s from an Atlanta TV station! From WSB-TV: “A federal program designed to help victims suffering from life-altering reactions to vaccines is falling short on promises made when it started. It’s called the Vaccine Injury Compensation Program, a $3.6 billion fund created to take care of victims with catastrophic reactions to vaccines. But a Channel 2 Action News investigation found it also protects vaccine-makers from being subject to lawsuits. And they don’t pay for the program\\u200a—\\u200ayou do.” \\nSee: http://www.actionnewsjax.com/news/investigates/3b-program-to-help-vaccine-victims-falls-short-on-promises/467245775 Reason #6: A published study shows that 83 cases from vaccine court (see above) compensated children with autism for vaccine injury So, let me get this straight: A senior scientist from the CDC who authored many of the studies “proving” vaccines don’t cause autism says they threw away data in a big garbage can that showed a connection between vaccines and autism… A group of lawyers then reviewed records from the vaccine court and found children with autism are being compensated by the court for vaccine injury causing their autism… …Are we sure vaccines can’t cause autism? \\nRead: Pace Environmental Law Review \\n“For over 20 years, the federal government has publicly denied a vaccine-autism link, while at the same time its Vaccine Injury Compensation Program (VICP) has been awarding damages for vaccine injury to children with brain damage, seizures and autism. A new investigation, based on verifiable government data, breaks ground in the controversial vaccine-autism debate. The investigation found that a substantial number of children compensated for vaccine injury also have autism and that such cases have existed since 1989, the year after the VICP was formed.” \\nSafeMinds’ Executive Director, Lyn Redwood, RN, MSN comments, “This study dramatically shifts the debate on autism and vaccines. The question is no longer, Can vaccines cause autism? The answer is clear. Now, we have to ask, How many cases of autism have vaccines caused and how do we prevent new injuries from occurring?” The government has asserted that it “does not track” autism among the vaccine-injured. SafeMinds responds that not looking is the easiest way not to find something. SafeMinds is calling for immediate federal research into the mechanisms of injury in these children in an effort to protect other children from harm and Congressional action to reform the VICP. Reason #7: President-Elect Trump appears to know the truth about vaccines and autism, and he’s not afraid to say it! Yes, I saved the best for last. If you’re an autism parent, you already knew this one. But, Donald Trump has been speaking the truth about what happened to our kids for years. The first I heard of President-elect Trump’s understanding of this issue was back in December 2007: TRUMP SPEAKS: “I THINK IT’S THE VACCINATIONS” \\nSee: http://www.ageofautism.com/2007/12/trump-speaks–1.html What if you were a large national autism charity and you held a fundraiser at a billionaire’s house and the billionaire told reporters he thought autism was caused by vaccines? What if your large national autism charity was wildly dismissive of vaccines as a cause for autism, had scientists on staff who had worked to produce faulty research exonerating vaccines alongside the CDC, and had no research dollars allocated to exploring the vaccine-autism relationship? Well, then you would be Autism Speaks holding a fundraiser at Donald Trump’s Palm Beach mansion. As THIS article from the South Florida Sun-Sentinel reports: “At a news conference Thursday in a gold-trimmed Mar-A-Lago ballroom, Trump’s wife, Melania, noted her 22-month-old son, Baron, and said: “I cannot imagine what the mothers [with autistic children] and mothers all around the world go through. … Let’s get rid of autism.” In an interview, Donald Trump said he thinks the rising prevalence of autism is related to vaccinations of babies and toddlers. One in 150 children is now diagnosed with autism, with the prevalence higher among boys. “When I was growing up, autism wasn’t really a factor,” he [Trump] said. “And now all of a sudden, it’s an epidemic. Everybody has their theory, and my theory is the shots. They’re getting these massive injections at one time. I think it’s the vaccinations .” As you may know, President-elect Trump’s statements have only gotten bolder since then. Or how about his words during this appearance on Fox News? Thank you for your honesty, President-elect Trump. Crying through the hallways at CDC? I think the crying has just begun. \\nAbout the Author \\nJ.B. Handley is the father of a child with Autism. He and his wife co-founded Generation Rescue, Jenny McCarthy’s autism charity. He spent his career in the private equity industry and received his undergraduate degree with honors from Stanford University. He is also the author of “ The Only Vaccine Guide a New Parent Will Ever Need” and “ An Angry Father’s Guide to Vaccine-Autism Science ” \\nRepublished by permission. Original article published here   VaccineImpact.com. Leaving a lucrative career as a nephrologist (kidney doctor), Dr. Suzanne Humphries is now free to actually help cure people. In this autobiography she explains why good doctors are constrained within the current corrupt medical system from practicing real, ethical medicine. FREE Shipping Available! Order here . Medical Doctors Opposed to Forced Vaccinations – Should Their Views be Silenced? eBook – Available for immediate download. \\nOne of the biggest myths being propagated in the compliant mainstream media today is that doctors are either pro-vaccine or anti-vaccine, and that the anti-vaccine doctors are all “quacks.” \\nHowever, nothing could be further from the truth in the vaccine debate. Doctors are not unified at all on their positions regarding “the science” of vaccines, nor are they unified in the position of removing informed consent to a medical procedure like vaccines. \\nThe two most extreme positions are those doctors who are 100% against vaccines and do not administer them at all, and those doctors that believe that ALL vaccines are safe and effective for ALL people, ALL the time, by force if necessary. \\nVery few doctors fall into either of these two extremist positions, and yet it is the extreme pro-vaccine position that is presented by the U.S. Government and mainstream media as being the dominant position of the medical field. \\nIn between these two extreme views, however, is where the vast majority of doctors practicing today would probably categorize their position. Many doctors who consider themselves “pro-vaccine,” for example, do not believe that every single vaccine is appropriate for every single individual. \\nMany doctors recommend a “delayed” vaccine schedule for some patients, and not always the recommended one-size-fits-all CDC childhood schedule. Other doctors choose to recommend vaccines based on the actual science and merit of each vaccine, recommending some, while determining that others are not worth the risk for children, such as the suspect seasonal flu shot. \\nThese doctors who do not hold extreme positions would be opposed to government-mandated vaccinations and the removal of all parental exemptions. \\nIn this eBook, I am going to summarize the many doctors today who do not take the most extremist pro-vaccine position, which is probably not held by very many doctors at all, in spite of what the pharmaceutical industry, the federal government, and the mainstream media would like the public to believe. Read : Medical Doctors Opposed to Forced Vaccinations – Should Their Views be Silenced? on your mobile device!'"}, "time": 1742562097.6991642}