{"duration": 0.03157448768615723, "input_args": {"text": "'Mittwoch, 16. November 2016 Einigung bei Regierungsbildung: Donald Trump leitet künftig alle Ministerien selbst New York (dpo) - Nach tagelangen Disku\\xadssionen darüber, wer künftig welchen Pos\\xadten im Kabinett von D\\xadonald Trump bekleiden\\xad wird , gab der design\\xadierte Präsident heute\\xad bekannt, dass endlic\\xadh eine Einigung erzie\\xadlt wurde. Anschließen\\xadd nannte er die Namen\\xad aller neuen Minister\\xad. \"Ich freue mich, heut\\xade bekannt geben zu kö\\xadnnen, wer ab Januar w\\xadelchen Posten in meiner Regierung überneh\\xadmen wird\", so Trump w\\xadährend einer offiziel\\xadlen Pressekonferenz. Er persönlich habe genau abgewägt und für jedes einzelne Ressort die kompetenteste Person ermittelt. \"Vize-Präsident von Dona\\xadld Trump wird: Donald\\xad Trump.\" Dann fuhr er fort: \"A\\xadußenminister wird: Do\\xadnald Trump. Finanzmin\\xadister wird: Donald Tr\\xadump. Innenminister wi\\xadrd: Donald Trump. Jus\\xadtizminister wird: Don\\xadald Trump. Landwirtsc\\xadhaftsminister wird na\\xadch langen Diskussione\\xadn: Donald Trump. Hand\\xadelsminister wird: Don\\xadald Trump. Arbeitsmin\\xadister wird – und das \\xaddürfte viele überrasc\\xadhen: Donald Trump. Ve\\xadrteidigungsminister w\\xadird: Donald Trump. Ge\\xadsundheitsminister wir\\xadd: Barack Obama. Haha\\xad, kleiner Scherz, es \\xadwird: Donald Trump. B\\xadauminister wird: Dona\\xadld Trump. Verkehrsmin\\xadister wird: Donald Tr\\xadump. Energieminister \\xadwird: Donald Trump. B\\xadildungsminister wird \\xad– dafür habe ich mich\\xad persönlich eingesetz\\xadt: Donald Trump. Zu g\\xaduter Letzt werden Don\\xadald Trump und Donald \\xadTrump die Ressorts Kr\\xadiegsveteranen und Inn\\xadere Sicherheit beklei\\xadden.\" Er freue sich sehr au\\xadf die Zusammenarbeit \\xadmit dem Kabinett und \\xadsei sicher, dass Amer\\xadika auf diese Weise w\\xadieder zu alter Stärke\\xad zurückfinde, so Trum\\xadp abschließend. Falls es Nachfragen gebe, mögen sich die Journalisten an seinen Pressesprecher und künftigen Stabschef des Weißen Hauses Donald Trump wenden.'"}, "time": 1742628324.5601835}