{"duration": 0.07189011573791504, "input_args": {"text": "'By Sarah Jones on Fri, Oct 28th, 2016 at 8:02 pm Secretary Clinton put pressure on Comey to explain himself saying, \"We\\'ve heard these rumors, we don\\'t know what to believe. That is why it is incumbent on the FBI to tell us what they are talking about.\" Asked if she thought this could sink her campaign, Clinton laughed. Share on Twitter Print This Post \\nHillary Clinton did a quick presser in Iowa to respond to questions about the FBI Director James Comey’s decision to appear to violate the Hatch Act 11 by participating in political activities 11 days before an election. \\nSecretary Clinton put pressure on Comey to explain himself saying, “We’ve heard these rumors, we don’t know what to believe. That is why it is incumbent on the FBI to tell us what they are talking about.” \\nWatch here: Video: Hillary Clinton calls on FBI to release all of the info it has & explain the issue in question without delay https://t.co/rg57U1RqPf \\n— Bradd Jaffy (@BraddJaffy) October 28, 2016 \\n“The American people deserve to get the full and complete facts immediately. The director himself has said he doesn’t know if the emails referenced in his letter are significant or not,” the Democratic nominee said. \\n“That’s why it’s incumbent on the FBI to tell us what they’re talking about,” Clinton said. \\nClinton pushed for more information to be released “without delay.” She said she found about the investigation from reports and that she wasn’t given advance notice. Clinton said she had not been contacted by Comey on this issue. \\nWhen asked what she would tell voters about her emails, Clinton responded, “I think people made up their minds a while ago about the emails.” \\nThis might be the right place to mention the 22 million emails the Bush administration “lost” and the private RNC servers they used, as context for how important this issue really is to Republicans as a value. \\nKristen Welker asked if Clinton was afraid that this could sink her campaign, to which Secretary Clinton responded with a big laugh: \"Are you worried this could sink your campaign, Secretary Clinton,\" a reporter shouts as HRC walks out. Clinton only lets out a big laugh. \\n— Ruby Cramer (@rubycramer) October 28, 2016 \\nThe Republican FBI Director James Comey wrote the House on Friday to inform hopeful Republicans that they had found new emails relating to Clinton’s private email that begged further investigation. \\nIt turns out the emails didn’t come from Clinton’s server and there doesn’t seem to be any there there, except for giving Republicans a reason their base needs to get out to vote. \\nFederal employees are forbidden from participating in political activities under the Hatch Act, and this is why a complaint has already been lodged against Comey . \\nHillary Clinton laughed because what else is she supposed to do at this point. How many years on is this? Republicans have mined this hopeful scandal for so long it’s DOA. The press has followed Republicans’ lead with the absurd email story- a story as ridiculous as it is common, and a story that was never a story until Clinton did it. \\nRepublicans and some in the press think this might sink the Clinton campaign. So they think America would rather put Putin’s puppet who laughs about sexually assaulting women in the White House than someone whose emails we’ve all read now and found nothing much but gossip. \\nYeah, I don’t think so. \\nDead story was dead before it started, but that won’t stop it from being spun into blood match.'"}, "time": 1742563697.0506325}