{"duration": 0.07129836082458496, "input_args": {"text": "'Desarticulan una red criminal que ofrecía a Arturo Pérez-Reverte para dar palizas CHANTAJEABAN A EMPRESARIOS DICIÉNDOLES QUE EL ESCRITOR LOS ATRAVESARÍA CON LA ESPADA DEL CAPITÁN ALATRISTE violencia \\nLa Guardia Civil ha desmantelado esta mañana en Madrid una red de criminales que extorsionaba a empresarios y se ofrecía a dar palizas a deudores utilizando como reclamo al escritor Arturo Pérez-Reverte. “Me decían que, si no pagaba, el académico me partiría las piernas y me atravesaría con la espada del capitán Alatriste”, declara uno de los extorsionados. \\nAunque el escritor niega cualquier relación con la trama delictiva, los chantajistas utilizaban fotografías suyas que mandaban por correo electrónico o postal a sus víctimas. A veces, incluso, dejaban ejemplares de novelas del académico en los buzones a modo de advertencia. \\n“Este tío estuvo en Sarajevo. No se anda con hostias. Me dijeron que si iba a la Policía me las tendría que ver con él y, francamente, tengo familia y no me quise arriesgar”, explica otro empresario que llegó a pagar los 20 mil euros que le solicitaba la red de extorsionadores. \\nComo relata el capitán José Antonio Orfidal, jefe de operaciones del departamento de Delincuencia Organizada de la Unidad Central Operativa (UCO) de la Guardia Civil, “los criminales ofrecían los servicios del literato y cobraban por horas, talmente como si fueran sus representantes. En ningún caso fue necesario que Pérez-Reverte actuara porque la gente pagaba enseguida, por eso el escritor no llegó a tener constancia de todo el entramado”. \\nEn otros casos, los delincuentes amenazaban con “discursos de más de cinco horas de Javier Marías quejándose de cosas o conferencias enteras sobre el estado de la lengua española. La cuestión era amedrentar utilizando el ala dura de la Real Academia”, aclara Orfidal.'"}, "time": 1742563221.180485}