{"duration": 0.04941105842590332, "input_args": {"text": "'A leading Egyptian cleric irked his Christian compatriots when he said on television that the Islamic figure Muhammed would marry the Virgin Mary in heaven. [Dr Salem Abdel Galil, a theologian at Cairo’s prestigious Al Azhar academy and a former   of the Ministry of Religions, said on his television program that “Allah, hallowed be his name, chose Mary of all the women, alongside Asiya, Pharaoh’s wife, Aisha and Khadijea, Prophet Muhammed’s wives, and Fatima, the Prophet’s daughter. There are verses in the Quran that suggest that in heaven Muhammed will marry the Virgin Mary, the mother of Jesus peace be upon him, as well as Asiya, Pharaoh’s wife and Kultum, the sister of Moses peace be upon him. ”  “The Quran said: ‘Allah will give [the Prophet] women preferable to his wives, Muslim, pious, pure women. ’” One, he said, referred to Asiya and the other to Mary. Egypt’s Christian community was enraged by Galil’s remarks. The community’s youth movement issued a statement demanding an apology. The movement’s chairman, Nader Soubhi, said: “We Christians don’t recognize any aspect of the Virgin Mary except her sanctity, her purity and her virginity. The Virgin Mary will never lose any of these. ” In 2010, an Al Azhar cleric caused controversy with a similar ruling, which also raised the church’s ire. Then too, church representatives said they rejected the ruling “which contradicts our religion and holy book. It’s offensive to the Virgin Mary. ” Reverend Abdel Masih Basit said that “the Virgin became pregnant while a virgin, and will forever remain so. And according to Jesus, in heaven you don’t marry but become angels. ” “The Christian faith relies on the belief that a man’s soul turns into a spirit after his death and his body turns into light, and therefore there’s no need for partnership or sexual intercourse,” he said.'"}, "time": 1742563481.2981796}