{"duration": 0.17141962051391602, "input_args": {"text": "'Leon Russell, the longhaired,   pianist, guitarist, songwriter and bandleader who moved from playing countless recording sessions to making hits on his own, died on Sunday in Nashville. He was 74. His website said he had died in his sleep but gave no specific cause. Mr. Russell’s health had incurred significant setbacks in recent years. In 2010, he underwent surgery for a brain fluid leak and was treated for heart failure. In July he had a heart attack and was scheduled for further surgery, according to a news release from the historical society of Oklahoma, his home state. With his trademark top hat, hair well past his shoulders, a long, lush beard, an Oklahoma drawl and his fingers splashing   barrelhouse piano chords, Mr. Russell cut a flamboyant figure in the early 1970s. He led Joe Cocker’s band Mad Dogs  Englishmen, appeared at George Harrison’s 1971 Concert for Bangladesh in New York City and had numerous hits of his own, including “Tight Rope. ” Many of his songs became hits for others, among them “Superstar” (written with Bonnie Bramlett) for the Carpenters, “Delta Lady” for Mr. Cocker and “This Masquerade” for George Benson. More than 100 acts have recorded “A Song for You,” which Mr. Russell said he wrote in 10 minutes. By the time he released his first solo album, in 1970, he had already played on hundreds of songs as one of the top studio musicians in Los Angeles. He was in Phil Spector’s Wall of Sound Orchestra, and he played sessions for Frank Sinatra, Sam Cooke, Aretha Franklin, the Ventures and the Monkees, among many others. His piano playing is heard on “Mr. Tambourine Man” by the Byrds, “A Taste of Honey” by Herb Alpert, “Live With Me” by the Rolling Stones and all of the Beach Boys’ early albums, including “Pet Sounds. ” The music Mr. Russell made on his own put a scruffy, casual surface on rich musical hybrids, interweaving soul, country, blues, jazz, gospel, pop and classical music. Like Willie Nelson, who collaborated with him, and Ray Charles, whose 1993 recording of “A Song for You” won a Grammy Award, Mr. Russell made a broad, sophisticated palette of American music sound   and natural. After his popularity had peaked in the 1970s, he shied away from   and largely set aside rock, though he kept performing. But he was prized as a musicians’ musician, collaborating with Elvis Costello and Elton John, among others. In 2011, after making a duet album with Mr. John, “The Union,” he was inducted into the Rock and Roll Hall of Fame. At the ceremony, Mr. John called him “the master of space and time” and added, “He sang, he wrote and he played just how I wanted to do it. ” Leon Russell was born Claude Russell Bridges in Lawton, Okla. on April 2, 1942. An injury to his upper vertebrae at birth caused a slight paralysis on his right side that would shape his music: A resulting delayed reaction time in his right hand forced him to think ahead about what it would play. “It gave me a very strong sense of duality,” he said last year in a Public Radio International interview. He started classical piano lessons when he was 4, played baritone horn in his high school marching band and also learned trumpet. At 14 he started gigging in Oklahoma since it was a dry state at the time, he could play clubs without being old enough to drink. Soon after he graduated from high school, Jerry Lee Lewis hired him and his band to back him on tour for two months. He moved to Los Angeles in the late 1950s and found club work and then studio work he learned to play guitar, and he began calling himself Leon Russell, taking the name Leon from a friend who had lent him an ID so he could play California club dates while underage. His   drew on both his classical training and his Southern roots, and he played everything from standards to   from   to pop throwaways. He was glimpsed on television as a member of the Shindogs, the house band for the   rock show “Shindig!” in the   and was in the house band for the 1964 concert film, “The T. A. M. I. Show. ” In 1967, he built a home studio and began working with the guitarist Marc Benno as the Asylum Choir, which released its debut album in 1968. He also started a record label, Shelter, in 1969 with the producer Denny Cordell. Mr. Russell drew more recognition as a   arranger and musician on Mr. Cocker’s second album, “Joe Cocker! ,” which included Mr. Russell’s song “Delta Lady. ” When Mr. Cocker’s Grease Band fell apart days before an American tour, Mr. Russell assembled Mad Dogs  Englishmen, a big, boisterous band that included three drummers and a   choir. Its 1970 double live album and a tour film became a showcase for Mr. Russell as well as for Mr. Cocker the album reached No. 2 on the Billboard album chart. Mr. Russell also released his first solo album in 1970 it included “A Song for You” and had studio appearances from Mr. Cocker, Eric Clapton, two members of the Beatles and three from the Rolling Stones. But Mr. Russell’s second album, “Leon Russell and the Shelter People,” fared better commercially: It reached No. 17 on the Billboard chart. Mr. Russell had his widest visibility as the 1970s began. He played the Concert for Bangladesh at Madison Square Garden with Mr. Harrison, Bob Dylan and Mr. Clapton he produced and played on Mr. Dylan’s songs “When I Paint My Masterpiece” and “Watching the River Flow. ” He toured with the Rolling Stones and with his own band. His third album, “Carney,” went to No. 2 with the hit “Tight Rope” it also featured his own version of “This Masquerade. ” In 1973, his “Leon Live” album reached the Top 10, and he recorded his first album of country songs under the pseudonym Hank Wilson. The fledgling Gap Band, also from Oklahoma, backed Mr. Russell in 1974 on his album “Stop All That Jazz. ” His 1975 album “Will o’ the Wisp” included what would be his last Top 20 pop hit, “Lady Blue. ” But he continued to work. He made duet albums with his wife at the time, Mary Russell (formerly Mary McCreary). And he collaborated with Mr. Nelson in 1979 on “One for the Road,” a double LP of pop and country standards. It sold half a million copies. That same year he married Janet Lee Constantine, who survives him, as do six children: Blue, Teddy Jack, Tina Rose, Sugaree, Honey and Coco. Mr. Russell delved into various idioms over the next decades, mostly recording for independent labels. He toured and recorded with the New Grass Revival, adding his piano and voice to their   lineup. He made more country albums as Hank Wilson. He recorded blues, Christmas songs, gospel songs and instrumentals. In 1992, the songwriter and pianist Bruce Hornsby, who had long cited Mr. Russell’s influence, sought to rejuvenate Mr. Russell’s rock career by producing the album “Anything Can Happen,” but it drew little notice. Mr. Russell continued to tour for   fans, who called themselves Leon Lifers. A call in 2009 from Mr. John, whom Mr. Russell had supported in the early 1970s, led to the making of “The Union”  —   which also had guest appearances by Neil Young and Brian Wilson  —   and a   tour together in 2010. Mr. Russell also sat in on Mr. Costello’s 2010 album, “National Ransom. ” Then he bought a new bus and returned to the road, on his own.'"}, "time": 1742562131.1874695}