{"duration": 0.07877635955810547, "input_args": {"text": "'Kansas Secretary of State Kris Kobach discussed his gubernatorial campaign with SiriusXM host Matt Boyle on Friday’s Breitbart News Daily. [Kobach said taxation would be a core issue in his campaign.  LISTEN: “Some people may know Kansas. We did cut our income taxes quite a bit and reduced to zero the taxes on LLCs and S corporations a few years ago,” he said. “But a coalition of Democrats and liberal Republicans in the legislature just raised those taxes back up, doing so on the theory that they had to, to balance the budget. ” “I think that Kansas doesn’t have a revenue problem. It has a spending problem. We should have been cutting the budget,” he contended. On immigration, Kobach said Kansas is “a fairly conservative state, but our legislature hasn’t been conservative, and we’ve kind of become the sanctuary state of the Midwest. ” “We’re not formally a sanctuary state, but we do nothing to discourage illegal immigration,” he elaborated. “We give aliens   tuition. I want to stop that. ” Kobach noted Kansas is “one of the very few states west of the Mississippi that does not have term limits,” which he saw as vital to fighting corruption. “As a result, our legislators, some of them form entire careers in the state legislature. I’d like to see us have term limits for the legislature, as well as for the entire list of statewide offices,” he said. Kobach wryly conceded, “The left is not excited that I’m running” when Boyle noted the panoply of   groups denouncing his candidacy for governor. Boyle noted the left was fearful that Kobach really would put a stop to “unbelievable” policies like giving discounted   tuition rates to illegal immigrants. “It’s insane,” Kobach agreed. “I mean, think about it: You’ve got someone who lives in a neighboring state, say Missouri. A kid grows up there, wants to go to Kansas University or Kansas State, pays three times as much in tuition as an illegal alien. It makes no sense whatsoever. It’s against federal law. Congress was trying to stop this way back in the nineties they passed a law saying no state could do it, but several states did anyway. ” “We’re going to try to stop that. I think you just need a governor who will come in and say, ‘Look, I’m not budging. We’re going to do it, and we’re going to do it now, or we’re going to do it later, but we’re going to do it while I’m governor,’” he said, promising to “draw some lines in the sand and not let anyone cross them. ” Kobach laid out three major points in his   agenda. “One I already mentioned was term limits. Try to push term limits through. Now, that’s going to be a heavy lift since we don’t have the popular initiative. We’re going to have to push it through the legislature, and you know most politicians don’t like limiting their own terms in legislatures,” he said. “Second is pass a statute stopping the revolving door,” he continued. “Right now in Kansas, you can retire from the legislature, and then the next day, you can start lobbying your former colleagues. We’ll put time limits on how soon you can become a lobbyist in Kansas. You can become a lobbyist somewhere else if you want, but not in Kansas. ” Kobach said his third goal would be to achieve political transparency by replacing “Republicans in Name Only” who tend to side with Democrats. “We really have this problem very badly in Kansas,” he explained. “If you look at the numbers, our legislature in the Senate is 32 to 8  —   32 Republicans to 8 Democrats. Similar lopsided numbers in the House, over a   majority Republican. But many of those Republicans are truly RINOs  —   Republicans in Name Only. They vote with the Democrats all the time. When they go home, they talk like Republicans. They might even use the word ‘conservative’ to describe themselves. But then, they come in and become a completely different person when they are in the state legislature. ” “One of the things the governor has to do is actually call people out by name and say, ‘Look, I need this person’s vote’ and try to get the public aware of who these people are who are breaching the public trust,” said Kobach.  “If their district wants to elect someone who is liberal and votes with the Democrats, so be it. But there is a real deception going on. You see it in states like Kansas, where there are districts across the western part of our state which will not elect a Democrat, period. So what the Democrats do is, they just run as Republicans,” he said. Kobach agreed with Boyle that voters are tired of politicians who say one thing and do another. “I think they’re also tired of the politician who talks like everything he says is carefully polished and has gone through three focus groups,” Kobach added. “The thing that people loved about Trump is that he’s speaking from the gut. They could tell that this is what the guy really thinks. His speech wasn’t prepared and screened and reviewed by others, a bunch of     baloney, but is actually a guy telling us what he thinks. I think that’s important. ” “Nobody can do it like President Trump does it, but that’s kind of the way I have spoken to my constituents as secretary of state: ‘Here, this is what I’m going to do. I’m not going to beat around the bush. If you don’t like it, don’t vote for me,’” he said. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. Listen to the full audio of the interview above. '"}, "time": 1742564329.195958}