{"duration": 0.05124807357788086, "input_args": {"text": "'SEATTLE  —   Howard Schultz, the visionary leader of Starbucks, said on Thursday he would step down as chief executive next year, handing over to his personally selected successor the management of the company he built into the world’s largest coffee business, with over 25, 000 stores in 75 countries. Mr. Schultz, one of the most visible chief executives in the country, has made Starbucks a vocal part of the national conversation on issues like gun violence, gay rights, race relations, veterans rights and student debt. The succession will take place on April 3, and he will remain at the company as executive chairman, focusing on the company’s involvement in social causes and on growing Starbucks Reserve, the company’s new superpremium brand and chain of   stores. Mr. Schultz, 63, will be succeeded by his close friend Kevin Johnson, the company’s current president and a longtime Starbucks board member. “This is a big day for me,” Mr. Schultz said in an interview. “I love the company as much as I love my family. ” But he said it was the right time to hand the keys to Mr. Johnson, whom he described as being “better equipped” to “run the company than I am,” ticking off a list of Mr. Johnson’s operational talents, and saying that he wanted to “relinquish the role and responsibility to the right person. ” Mr. Schultz, who could be considered the Steve Jobs of coffee, grew up poor in the Canarsie section of Brooklyn. He had a coffee epiphany while paying a client call on a coffee bean store in Seattle in 1981, and then went to work at the company the next year. In 1983, he visited Italy and was impressed not only by the ubiquity of coffee bars, but also their central role as community gathering spots  —   a role he refers to as “the third place” in society. Today, Starbucks is adding about 2, 000 new stores a year worldwide. And its legacy under Mr. Schultz’s leadership includes many pioneering social and philanthropic programs: In 1988, the company introduced full health benefits for   and   employees and their domestic partners in 1991 it was the first privately owned American company to include   workers in its   program and so on, with efforts that have included the “ethical sourcing” of ingredients, a college degree program for baristas, and cups that use recycled materials. “I wanted to build the company my father never got to work for,” he said. At an   employee meeting at the company’s headquarters on Thursday, Mr. Schultz was greeted with tears and a standing ovation. “For me, perhaps there are other things that are part of my destiny,” he told them. The move is likely to ignite renewed speculation about whether Mr. Schultz is paving the way to leave the company entirely to enter politics. An outspoken Democrat, Mr. Schultz has spent an increasing amount of time traveling around the country speaking publicly about the need to fix the “dysfunction in Washington. ” He has a close relationship with President Obama and had been a supporter of Hillary Clinton. The company’s political positions have sometimes created a backlash. During the presidential campaign, Donald J. Trump and his supporters waged war against Starbucks: In 2015, after the company redesigned its holiday cups to remove Christmas imagery, Mr. Trump suggested a boycott. This year, his supporters staged a protest called #TrumpCup in which they went to Starbucks and ordered drinks under the name Trump to get the baristas to call the name out loud. Still, Mr. Schultz said he intends for Starbucks to “maintain our moral courage. ” And he defended efforts like the company’s “Race Together” campaign to spur a conversation about race relations, saying that it “was not a failure. I’d do it again. ” He said such campaigns are deeply embedded in the company’s brand of “challenging the status quo about the role of a public company. ” He is excited by the question, “Since we have stores in every community in America, how can we use our scale for good?” Although the change may come as a surprise to the public and to some Starbucks employees, the company has been sending signals to Wall Street for the last year about its intentions to carry out a succession plan, announcing a reorganization in the summer that gave Mr. Johnson oversight of the    operations. Mr. Johnson, 56, spent his career in technology as a lieutenant of Steven A. Ballmer, former chief of Microsoft, and later as chief executive of Juniper Networks, before being recruited out of retirement by Mr. Schultz in 2015 to become president and chief operating officer of Starbucks. Mr. Johnson, a   operator known for his focus on building Starbucks’ mobile payments systems and executing the company’s global strategy, has been on a listening tour with employees over the last year. Conversations with store managers who told intimate stories about their passion and relationship with the company have been known to bring Mr. Johnson to tears. The succession plan is the second time Mr. Schultz has sought to step back from overseeing the company. He became the company’s chairman in 2000 but returned as chief executive in 2008 after firing the installed chief, James Donald, as sales faltered. Upon returning to Starbucks as chief executive, Mr. Schultz increased the company’s market value to $84 billion from $15 billion. In an interview on Thursday in a tasting room at Starbucks flagship Reserve Roastery in downtown Seattle, a Willy      premium coffee emporium that the company hopes to open in large cities around the world, Mr. Schultz was animated and emotional about his decision. Referring to his previous effort to step back, Mr. Schultz said: “I was not as emotionally prepared for the moment as I am now. I don’t think I had the conviction  —   I was still meddling. ” “I got succession wrong the first time,” he added. Of Mr. Johnson, he said, “I’m not going to be hovering and shadowing him. ” Still, Mr. Schultz says he intends to remain a visible and active presence at the company  —   his office is connected to Mr. Johnson’s  —   as he works to introduce the company’s premium coffee brand with a small team that he described as the equivalent of a  . The project calls for the opening of several large emporium stores  —   one is being built in Manhattan and another in Shanghai  —   each year for the next several years, as well more than 1, 000 smaller premium stores and premium “bars” in thousands of current Starbucks stores. “Building a new brand is not unlike what Ralph Lauren did with Purple label,” Mr. Schultz said. Asked about speculation that he might be laying the groundwork to run for president, Mr. Schultz said, “I’m all in on all things Starbucks and have no plans to run for public office. ” Might he change his mind in the future? “That’s the way I feel today,” he said. Mr. Johnson said that his decision to work at Starbucks came after he had rethought his career, disclosing for the first time that he had a brush with skin cancer that had led him to retire from Juniper. “It made me think,” he said. “I only want to spend time on things on which I am able to give something to people I love. ” He called his job at Starbucks a “gift” and acknowledged that he was somewhat nervous about his new role. “Can I do this?” he said he asked himself. “I’m not going to try to be Howard. We are two different people. ”'"}, "time": 1742628516.2691123}