{"duration": 0.07828474044799805, "input_args": {"text": "'By Brianna Acuesta\\nAlthough the Federal Drug Administration is thought to serve American consumers by keeping them safe and well-informed, they are doing just the opposite by controlling the media and science press in order to create misleading and one-sided articles.\\nAn investigation into documents released through the Freedom of Information Act by Scientific American revealed that the FDA uses a variety of tactics to prevent the full truth from being revealed about a certain product. The biggest tactic is the “close-hold embargo,” where they invite a select few news sites to a briefing about the to-be released information with conditions. They stipulate that the journalists have to surrender their reportorial independence by agreeing to only speak with sources approved by their agency.\\nWhen NPR reporter Rob Stein was extended one of these loaded invitations, he responded by saying, “My editors are uncomfortable with the condition that we cannot seek reaction,” and asked that they be given a bit more wiggle room to speak with others. When Stein was met with a resounding no, he decided to agree to the terms and attend the briefing.\\nStein wasn’t the only reporter to attend this particular briefing, as other sites such as The Wall Street Journal, The Washington Post, and The New York Times were all present. Despite agreeing to the terms, not everyone is actually comfortable with these conditions. The New York Times former Public Editor, Margaret Sullivan, said: \\n“I think embargoes that attempt to control sourcing are dangerous because they limit the role of the reporter whose job is to do a full look at a subject. It’s really inappropriate for a source to be telling a journalist whom he or she can and can’t talk to.”\\nOther tactics used by the FDA include denying major media outlets any access to the briefing prior to the public release of information, and the deliverance of half-truths when asked questions directly to hinder an investigation. Those who intend to speak with unapproved sources or announce these embargoes are met with threats.\\nThese embargoes are often used within the science community, but none as strict as the FDA’s rules on whom reporters can confer with. The usual restrictions only focus on the date and time that a news story can be published about a particular study, which is why the stories tend to break at the same time across media outlets.\\nThe Association of Health Care Journalists said that the close-hold embargo is “a serious obstacle to good journalism. Reporters who want to be competitive on a story will essentially have to agree to write only what the FDA wants to tell the world, without analysis or outside commentary.”\\nIf the FDA was truly concerned about the well-being of American citizens, it wouldn’t be so shrouded in secrecy and insistent on the way news stories are covered. Instead, they put up their list of demands in an effort to protect the medical industry and pharmaceutical companies whose interests and profits matter more than having a well-informed public.\\nSource: True Activist \\n'"}, "time": 1742562026.7606218}