{"duration": 0.1543900966644287, "input_args": {"text": "'Google has long stressed that Android, its popular mobile software, is open for anyone to use, including its rivals. But the company’s claims are now under threat after Europe’s antitrust authorities on Wednesday charged the company with unfairly using Android to promote its own services  —   like mobile search  —   over those of its rivals. In doing so, regulators brought particular scrutiny to Google’s relationships with some of the world’s biggest cellphone makers, which have helped expand the reach of Android. Margrethe Vestager, the European Union’s antitrust chief, said Google had required some of the cellphone manufacturers to preinstall the company’s services, including its Google Play smartphone application store, and had given them unfair financial incentives to favor Google’s services on their mobile devices. Those practices undermined competition and consumer choice, she said. “Google has abused its dominant position,” Ms. Vestager said on Wednesday. The company’s “behavior has harmed consumers by restricting innovation in the wider mobile space. ” The company denies it has broken European competition rules, and the charges may not lead to financial or other penalties against Google, which now has three months to respond to the accusations. “We take these concerns seriously,” Kent Walker, Google’s general counsel, said in a blog post. “But we also believe that our business model keeps manufacturers’ costs low and their flexibility high, while giving consumers unprecedented control of their mobile devices. ” By taking aim at Android  —   the mobile software that holds more than 80 percent of the worldwide market share for smartphone operating systems  —   Europe has opened the latest chapter in its continuing battle with American technology companies. These players, including Amazon and Facebook, dominate how Europe’s 500 million people use digital services, including social media, online movies and  . Google is facing separate charges, filed last year, in Europe over whether it unfairly favored some of its search services over those of rivals. Europe’s antitrust claims highlight Google’s increasingly thorny relationships with smartphone manufacturers such as HTC and Samsung, among others. Ms. Vestager said Android’s prominent role in the mobile market was not in question but that she was concerned the contracts the company signed with smartphone manufacturers had made it difficult, if not impossible, for rival search engines and smartphone app stores to compete in the European Union. “If a company is dominant, that’s fine,” Ms. Vestager told reporters. “But if that dominance is abused, then we have an issue. ” She declined to name which cellphone manufacturers might be affected, citing their right to privacy. The device makers, already struggling against cutthroat competition, have become reliant on Google’s digital services available on Android, even as they have tried to persuade consumers to try their own mobile services or those of Google’s competitors. Some, including Samsung, have backed rival operating systems to loosen Android’s grip, but such efforts have so far proved unsuccessful. And while global cellphone manufacturers once profited from using Android to expand rapidly, particularly in emerging markets, their growth has since slowed. Analysts say these cellphone makers’ inability to wean consumers off Google’s popular mobile mapping, email and other services has potentially shut them out of billions of dollars in extra revenue as people’s digital habits  —   including online search and   purchases  —   shift to mobile devices. “Their attempts at beating Google’s services haven’t worked,” said Neil Mawston, a mobile analyst at the technology research group Strategy Analytics. “For most companies that want to operate in the smartphone market, there isn’t another option but to use Google. ” Representatives from the leading smartphone manufacturers declined to comment on their relationship with Google. The dominance of Android, at least in Europe and the United States, is almost absolute. The basic Android software can be downloaded for free and modified by device makers and telecom operators. But they must sign contracts that place a selection of Google’s services in prime spots on smartphone screens and link to the company’s app store, from which Google takes a cut of each application sold. The search giant also generates income from advertising from mobile search queries, though manufacturers are free to include their own applications as part of the mobile software. In total, Google’s version of Android powers more than 98 percent of the   smartphones in Europe and the United States, according to Ian Fogg, a senior director at IHS, a technology consultancy in London. Only in China, where Google is banned, and Russia, where the local search engine Yandex holds a significant market share, does Google not dominate in mobile. “If someone buys an Android device in Europe or the U. S. it’s almost certainly Google’s version,” said David McQueen, research director at ABI Research in London. Google says its relationships with cellphone manufacturers are voluntary and that rival mobile services, including those from the likes of Amazon and Facebook, are readily available on its Android software, which does not restrict people from downloading competitors’ applications. The search giant has also pointed to smartphones from Amazon and Nokia that are based on the free version of Android and that do not come packaged with Google’s mobile services as signs of healthy competition. Those devices, particularly Amazon’s Fire smartphone, have not proved popular with consumers. Kirt McMaster, the chief executive of Cyanogen, an American   that makes a mobile operating system based on Android, said he was cautiously optimistic that the regulatory intervention could improve innovation on the operating system. “There are ways to enable   services on top of Android today, even within the confines of the existing relationships,” he said. “But there are scenarios that will be beneficial for the ecosystem if Android was even more open. ” If Google is found to have broken European rules, the company may face fines of as much as 10 percent of its annual revenue. Given the company’s recent annual revenue, that could be roughly $7 billion. Such a high financial penalty is unlikely, however, according to legal experts. The company could also be forced to alter its Android software to give competitors a greater position in its mobile software or to change its existing contracts with cellphone makers. That would potentially provide Europeans with a wider choice of mobile services than would be available to their American counterparts. Most people in the 28 member states of the European Union, though, still rely primarily on Google services for many daily activities. Such remedies, if eventually imposed on Google, would be reminiscent of similar steps taken by Microsoft, which in 2009 agreed to offer consumers a choice of rival web browsers to end a European antitrust investigation into its dominance of Internet browsers at that time. Paulo Trezentos, chief executive of Aptoide, a rival Portuguese Android app store that is one of the complainants in the European competition case against Google, said his company would welcome greater access to Android users. “Google makes it difficult for people to install applications from rivals,” Mr. Trezentos said. “It’s actively making it harder to compete. ” In the United States, some lawmakers on Wednesday called on the Federal Trade Commission to more closely scrutinize Google after Europe’s charges. In 2013, the F. T. C. closed a   antitrust investigation into Google’s search business, citing a lack of evidence for pursuing a case. The F. T. C. said it did not comment on or confirm investigations. Senator Richard Blumenthal, Democrat of Connecticut, who is a member of the Judiciary Committee, said regulations and laws differed in Europe and the United States but “the spirit and goal of our laws is very similar. ” “There is now clearly a need for exacting and penetrating scrutiny,” Mr. Blumenthal said in an interview. “Perhaps it is overdue. But it is now clearly necessary. ”'"}, "time": 1742563400.3575761}