{"duration": 0.17005419731140137, "input_args": {"text": "'NEWARK  —   Prosecutors opened the case against two former aides to Gov. Chris Christie of New Jersey with a stunning assertion: The governor himself knew during the lane closings at the George Washington Bridge that they were meant to punish a mayor for declining to endorse him. Over the past six weeks in federal court, prosecutors have portrayed Mr. Christie and his top aides as relentlessly and crassly political. Orders to freeze out enemies came “directly from gov,” as his campaign manager relayed in one text message. “Gov!” Lee Cortes, a prosecutor, said in his closing argument. “The governor!” But to borrow an old legal term, having rung that bell loudly and repeatedly, prosecutors now want jurors to pretend they did not hear it. The jury began deliberations on Monday about the two aides: Bridget Anne Kelly and Bill Baroni. To decide their fate, the jury has to confront two apparent contradictions in the prosecution’s case. One is the fact that Mr. Christie, a Republican, is not on trial, even though prosecution witnesses have described it as practically Christie administration policy to use government resources to promote his ambitions. The other is the government’s star witness, David Wildstein, who has pleaded guilty to orchestrating the   scheme. Prosecutors admit he is a serial liar and inveterate prankster who, as lawyers repeatedly reminded the jury, once stole the jacket of a   United States senator to embarrass him in a debate. “The guy who stole Frank Lautenberg’s coat? That’s who you relied on?” Mr. Cortes challenged Mr. Baroni in his  . That is also whom the government is relying on, as Mr. Baroni’s lawyer happily noted in his summation. If prosecutors so trusted Mr. Wildstein as a witness, the jury might wonder, why did they not bring charges against Mr. Christie, who, Mr. Wildstein testified, was told about the plot midway through the week of the lane closings in September 2013, when he had the power to reverse them? Judge Susan D. Wigenton instructed the jury not to pay attention to Mr. Christie or the other names prosecutors have mentioned over and over. “The fact that these persons are not on trial here must play no part in your deliberations,” she told jurors. “Their absence should not influence your verdict with respect to the defendants on trial at this time. You are not called upon to return a verdict as to the guilt or innocence of any other person or persons. ” But will jurors decide, in the memorable words of Ms. Kelly’s lawyer, Michael Critchley, that prosecutors went after a whale and ended up with a minnow? When Paul J. Fishman, the United States attorney for New Jersey, announced the indictments in May 2015, he said that he was bringing charges against only the people prosecutors believed a jury would convict. There is not as much documentary evidence that others in the administration were involved in the lane closings and the   Ms. Kelly alone sent the notorious email proclaiming “time for some traffic problems in Fort Lee. ” But given everything the jury has heard about Mr. Christie and his other aides punishing local officials, and scrambling to cover up the lane closings, will jurors decide that Mr. Baroni and Ms. Kelly are more guilty? Or were they simply less discreet in doing what everyone else was doing, too? And if the jury believes that others were involved, what would be more unfair: that it convicted two for the sins of many, or that it acquitted them, and no one paid for the catastrophic traffic jams that paralyzed Fort Lee? The prosecution did not call many potential witnesses who could have told more about what was really happening in the governor’s office. The judge, in a conference with lawyers, said she could think of “about five” potential witnesses for the jury, suggesting as a start Kevin O’Dowd, the governor’s former chief of staff, and Bill Stepien, his   campaign manager. Mr. Critchley seized the point in his closing argument on Monday, cupping his hands to his mouth and hollering: “Chris Christie, where are you? Kevin O’Dowd, where are you?” And, referring to another Christie confidante, he said, “Michele Brown, where are you?” “You know what that’s called?” Mr. Critchley told the jury. “Cowards. They want the mother of four to take the fall for them. ” The best example of the fine line the government is walking is an episode that prosecutors portrayed as kind of a preview of the main event: the Christie administration’s retribution against Mayor Steven Fulop of Jersey City. Like Mayor Mark Sokolich of Fort Lee, he was a Democrat who had declined to endorse Mr. Christie after a long courtship. Three weeks before Ms. Kelly’s infamous email, Mr. Stepien, then the campaign manager, wrote in an email to her that Mr. O’Dowd, then the chief of staff, would be calling her to cancel a special day’s worth of meetings set up between Mr. Fulop and administration officials. Ms. Kelly told Mr. Stepien to tell the mayor that the meetings had been canceled. “Boom,” Mr. Stepien wrote. “Thanks. ” Ms. Kelly, then in her new job as deputy chief of staff for about three months, expressed regret about having to cancel the meetings. Mr. Stepien, whom prosecutors characterize as her mentor, reassured her: “No, this is perfect. It will send a good message to this guy. ” Mr. Baroni asked whether one of Mr. Christie’s closest confidants, the chairman of the Port Authority of New York and New Jersey, was allowed to reschedule a meeting with the mayor. “Per Stepien, no meetings with Fulop,” Mr. Wildstein responded in a text message. “Order that Fulop be frozen out comes directly from gov. ” Will the jury accept that in the scheme to freeze out Mr. Sokolich just three weeks later, Mr. Wildstein, Ms. Kelly and Mr. Baroni acted on their own? Prosecutors also savaged Mr. Baroni, once Mr. Christie’s top appointed official at the Port Authority, for his trust in Mr. Wildstein. The defendants said they believed that the lane closings were a legitimate traffic study because Mr. Wildstein told them so. “Noted traffic expert David Wildstein?” Mr. Cortes asked Mr. Baroni. Mr. Baroni’s lawyer, Michael Baldassare, told the jury it was “insulting” for prosecutors to make fun of his client for relying on Mr. Wildstein. “It’s O. K. for them to trust him,” Mr. Baldassare said. “It’s O. K. for them to ask you to trust him. But when Bill trusts the guy, suddenly, apparently, it’s a crime. ” In their closing arguments, prosecutors accused defense lawyers of trying to divert attention from the defendants’ actions. The case, they argued, did not hinge solely on Mr. Wildstein. It is backed up by emails, in which Mr. Baroni and Ms. Kelly seem to know about the attempt to punish Mr. Sokolich and delight in it. “Is it wrong that I am smiling?” Ms. Kelly wrote, hearing of Mr. Sokolich’s complaint that schoolchildren were stuck in the traffic jams. The defendants spoke of “radio silence” as their strategy to ignore his panicked calls for help. “That’s not the language of victimization,” a prosecutor, Vikas Khanna, said in a final rebuttal on Monday. “Those emails, those text messages, those actions, those are the actions of the defendants, that no one did to them,” he said. “They chose exactly what they were doing. ”'"}, "time": 1742562469.0952115}