{"duration": 0.11084961891174316, "input_args": {"text": "'by Yves Smith \\nWith all the big and small grifting that goes on in private equity, we haven’t bothered calling out a practice that is pervasive and well known in the private equity community and authorized by the agreements that the limited partners sign with the general partners. Yet it will likely stick in the craw of most public pension fund beneficiaries, the taxpayers who support the payments to those plans, as well as donor to foundations and endowments that also invest in private equity even more than the widespread use of private jets, which is authorized not just for firm employees but at some general partners, even their family members. \\nAnother routine form of private equity rent extraction is how they get the fund investors, who are fiduciaries, to pay for lavish annual conferences which for the biggest funds includes big ticket entertainment like Elton John: #EltonJohn — TPG CEO Conference Phoenix AZ pic.twitter.com/gQWqkpPEwO \\n— Doug Curling (@shakadoug) October 19, 2016 \\nAnd for the still skeptical, another source has confirmed that Elton John performed at the TPG conference. And as is typical in limited partnership agreements, investors are on the hook for the costs of “meetings” and this show, as part of a limited partner event, was on their nickel. \\nThe only TPG limited partnership agreement we have is for a credit fund, and debt investors (unless they obtain control of a company via Chapter 11 or an out of court restructuring) do not have direct control over portfolio companies. That makes it harder for them to keep various charges opaque to limited partners by laundering them through portfolio companies. Nevertheless, the TPG Opportunities Partners II (A) puts the cost of meetings squarely on the investors. From numbered page 42, section 6.01(b): \\nExcept as specifically set forth in Section 3.01 ofthe Management Agreement, the Partnership shall pay for (or shall reimburse the Management Company for its payment of) all fees, costs and expenses relating to the Partnership’s activities, operations, meetings (including Advisory Committee meetings)… \\nAnd TPG’s current Form ADV is even clearer on this point : \\n…each Fund also generally bears all of the expenses relating to its activities, operations, meetings and eventual liquidation (other than expenses resulting from the fraud, gross negligence or willful misconduct of us or its general partner), \\nAnd the ADV also specifies that TPG can charge entertainment to portfolio companies, which means limited partners have no idea how large the charges are in total: \\n…reimbursements from portfolio companies for expenses (including travel expenses, which include expenses for business or first class travel, “black car” transportation and meals (including late night meals consumed at times when not traveling), entertainment-related expenses) we incur in connection with our performance of services for such portfolio company; \\nConsider what this means. Private jet use supposedly OK not because it is an egregious perk for Masters of the Universe, but because their time is oh-so-valuable, and sometimes those mere commercial flights don’t get from Awkward Point A to Awkward Point B all that efficiently. The other justification is the need for secrecy and the ability to work on a private jet. The latter claim is pretty dodgy in light of the widespread industry practice of offering empty seats to supposed competitors if they happen to need a lift. So private jet use is an occasionally-justifible practice that has become a bad norm. \\nBy contrast, it’s hard to see lavish entertainment at supposed informational gatherings as anything other than a kickback to private equity investors. As someone who is in the business of consuming and analyzing information, it is vastly more efficient to process written information than speeches or presentations. Lambert and I both greatly prefer transcripts and can barely stand the time cost of listening to Web presentations. Conferences are an even bigger time sink. \\nIn other words, if the objective were to inform investors, these events are clearly not necessary. The limited partners are flattering themselves if they think they can learn anything more by seeing general partner execs or the team from their showcased portfolio companies in the flesh. These are all highly skilled performers and these events are very carefully staged in advance. \\nSo what are the limited partners getting? Aside from getting an excuse to visit New York, London, Phoenix, or other major destination, and getting wined and dined, the general partners are marketing to them. This is an extended sales pitch to help groom them to invest in the next fund. And secondarily, it’s an opportunity to mix socially with other limited partners…which is questionable as a use of the funds entrusted to them. They can do that just as well at educational conferences, which are also neutral territory. \\nIndeed, a former private equity fund executive pointed out that keeping private equity staff at pension funds and foundations busy with the nominally important work of running around to general partner meet and greets seriously eroded the time they could spend doing what ought to be their real work, of reading the financial information and other reports provided by the general partners as well as their SEC Form ADVs, which it appears virtually no one in the industry bothers scrutinizing. \\nOne academic told me that he’d only encountered one investor who regularly read the IPOs of companies sold out of funds they’d invested in to see if there was anything they hadn’t anticipated so as to help them better evaluate future fund investments. Consistent with the thesis that general partner conferences were either by accident or design busywork to keep limited partners from digging into documents and data, this investor was in a remote part of Europe and didn’t often go to investor confabs because the travel time was apparently too costly relative to the information yield. \\nOne has to wonder how popular these general partner conferences would be if they instead featured rubber-chicken dinners and focused on information conveyance. The INET conferences, which by contrast are primarily networking events, featured long days (8 AM to 10 PM, with the lunch and dinner speakers covering substantive topics) for years until the participants cried uncle and asked for a less exhausting schedule. And these are people who don’t have billions of dollars of funds at risk. \\nIt’s not hard to imagine that if the general partners were dispensing information, as opposed to using investor monies to curry favor with them, you’d see them using tried and true forms, like public company quarterly earnings calls. But as people trained in making presentations know, conventions like a darkened room, the use of visuals on screens, having speakers on daises, all give the speakers a power advantage over the audience and deter questions. A conference call would be a dangerous leveler. Can’t have that, now can we? \\nSo expect this offensive form of grifting to continue. The old saying at CalPERS more than a decade ago was that the price of a $100 million commitment was a steak dinner. Imagine what seeing Elton John perform live buys. 0 0 0 0 0 2'"}, "time": 1742564611.5577912}