{"duration": 0.049865007400512695, "input_args": {"text": "'College Reform October 27, 2016 \\nGrinnell College is promoting a guide to help students avoid “cultural appropriation” this Halloween, warning that some costumes could be considered “deplorable and problematic.” \\nThe guide provides several examples of costumes that might fit the definition of “cultural appropriation,” defining the term as “the act of displaying people’s cultures in a disrespectful or condescending manner.” \\nThe guide, called “My Identity, Not Your Costume,” goes on to list several examples of “offensive” Halloween costumes, featuring pictures of Grinnell students holding photos of costumes that would be considered disrespectful towards their culture. \\nIn one instance, the guide shows a picture of a burly white man dressed in lingerie with a sash proclaiming “Call me Caitlyn,” referring to Caitlyn Jenner. The photo is held by a Grinnell student wearing a “National Coming Out Day” pin, and includes a caption stating, “the misrepresentation of my identity bothers me because people categorize me by my looks and may not understand my culture.” \\nAnother example of culturally appropriated Halloween costumes, according to the guide, is “using other cultures as accessories to appear more hip/interesting without adequate understanding or permission,” one example of which is a picture of someone dressed as a Hindu deity being held by an Indian student and the message that such costumes are “deplorable and problematic.” \\nIt then warns students that if their costumes take “defining characteristics of another culture” without “permission, or understanding of the historical background behind the said culture,” then these costumes might be too offensive to wear. \\nThe guide then concludes with two questions the school thinks students should consider before selecting a Halloween costume, asking, “Does your costume perpetuate stereotypes or inaccurately portray my culture as a joke?” as well as “Why would I find your ‘Halloween costume’ to be offensive?” \\nCampus Reform reached out to Grinnell for a comment on the matter but did not receive a response in time for publication. This article was posted: Thursday, October 27, 2016 at 5:53 am Share this article'"}, "time": 1742563750.572059}