{"duration": 0.047306060791015625, "input_args": {"text": "'By Nick Kollerstrom on November 4, 2016 Terror on the Tube — Nov 3, 2016 This just keeps getting better and better. Are we are ready for IMPACT on 9/11? It will be unforgettable. Yes this is a 9/11 date – 9 th November, when the results come out. The world will change. November: NYPD BLOWS WHISTLE ON HILLARY EMAILS: CHILD SEX CRIMES & EXPLOITATION https://www.youtube.com/watch?v=WLAe3UeddUI The FBI is investigating a huge Clinton DC sex network, according to insider claims. The NYPD may have evidence ‘to put Hillary Clinton and her crew away for life.’ Clinton herself and associates are linked to money laundering, sex crimes with minors including children, obstruction of justice & perjury – for a start! The Clinton Foundation has now been connected to a massive child-trafficing and sex ring operating within Washington DC. Having it all come out six days before the election, does that not look like Divine Providence? Top NYPD officer: what’s in the emails is staggering and it turned my stomach. There is not going to be any Houdini-like escape. New York police are so angry and fed up about this, that there is no possibility of the FBI backing down on either of the TWO ONGOING INVESTIGATIONS they now have on Hillary Clinton. More here: http://www.abeldanger.net/2016/11/nypd-hillary-clinton-child-sex-scandal.html#more NYPD sources say, files on Weiner’s newly found laptop which he shared with his wife Huma Abedin, show evidence of a political pedophile ring operating within Washington, involving members of Congress as well as numerous top Clinton aides and insiders. According to reports , a folder on Weiner’s laptop named “life insurance” contains explicit evidence that both Hillary Clinton and Huma Abedin helped run and cover-up a Washington pedophile sex ring. And this is coming out on Fox News! – This case is ‘not going to go away any time soon’ and will likely lead to ‘an indightment.’ Media hacks in all the Western media have been supporting Hillary, and how do they feel now? ONLY ONE US newspaper has supported Trump, and how do all the others feel now? Media hacks see Trump getting tens of thousands of people turning out to hear him, while Hillary whom they support can barely get a hundred, indeed she can’t even show up now because of the angry voices – do they realise how wrong they’s been? The Clinton crime family seem to be making plans to flee the country and may have transferred 1.8 billion dollars from the Clinton Foundation to Quater Central Bank https://www.youtube.com/watch?v=rNdaFFcnpfY – Quatar does not have an extradition treaty with the US so they’d be ‘safe from Trump’ therere. Governor of South Carolina says she has changed her mind, will support Trump https://www.youtube.com/watch?v=rNdaFFcnpfY All five of Hillary’s closest people are currently under investigation. http://www.dailymail.co.uk/news/article-3889994/Influence-peddling-acting-Putin-s-ally-hiding-classified-secrets-sexting-FIVE-separate-FBI-cases-probing-virtually-one-Clinton-s-inner-circle-families.html Hillary cancels public appearance due to a large crown chanting ‘Lock her up!’ (Pompano Beach Ampitheatre, November 1st.) To remind ourselves, this is has been a campaign of one man, scoffed, vilified and ridiculed by the entire Western media, against the establishment. If you need reminding of how any positive coverage of his campaign has been forbidden, watch this. During a visit to Detroit, he was blessed and given a prayer shawl by a black Bishop. Listen to how, during this wonderful ceremony, Reuters orders to cut the filming!'"}, "time": 1742562681.4886134}