{"duration": 0.04459810256958008, "input_args": {"text": "'Primates are unquestionably clever: Monkeys can learn how to use money, and chimpanzees have a knack for game theory. But no one has ever taught a nonhuman primate to say “hello. ” Scientists have long been intrigued by the failure of primates to talk like us. Understanding the reasons may offer clues to how our own ancestors evolved   speech, one of our most powerful adaptations. On Friday, a team of researchers reported that monkeys have a vocal tract capable of human speech. They argue that other primates can’t talk because they lack the right wiring in their brains. “A monkey’s vocal tract would be perfectly adequate to produce hundreds, thousands of words,” said W. Tecumseh Fitch, a cognitive scientist at the University of Vienna and a   of the new study. Human speech results from a complicated choreography of flowing air and contracting muscles. To make a particular sound, we have to give the vocal tract a particular shape. The vocal tracts of other primates contain the same elements as ours  —   from vocal cords to tongues to lips  —   but their geometry is different. That difference long ago set scientists to debating whether primates could make speechlike sounds. In the 1960s, Philip H. Lieberman, now a professor emeritus of Brown University, and his colleagues went so far as to pack a dead monkey’s vocal tract with plaster to get a   rendering. They used acoustic formulas to determine what sort of sound the tract would produce. Then they tested out variations on that shape, based on how living monkeys open their jaws and move other parts of their vocal tracts. In 1969, the researchers concluded that the range of vowel sounds that monkeys could make was “quite restricted,” compared with those produced by humans. Dr. Lieberman would go on to study chimpanzee vocal tracts and look for clues to speech in the fossils of ancient humans and Neanderthals. He argued that a crucial part of the evolution of speech was a gradual anatomical change to the vocal tract in humans. Crucial to this transition was the human tongue’s descent back into the throat. “It’s not until about 75, 000 years ago that you find fossils of fully modern humans with a vocal tract like that,” Dr. Lieberman said in an interview. Dr. Fitch, a former student of Dr. Lieberman, and his colleagues came to a much different conclusion after reviewing   videos of macaques. The terse title of their new paper in Science Advances nicely sums up the findings: “Monkey Vocal Tracts Are  . ” In collaboration with Asif A. Ghazanfar, a neuroscientist at Princeton, Dr. Fitch filmed three rhesus macaque monkeys with a portable   scanner. The goal was to survey the range of sounds monkeys will make on their own. “We only wanted them to do their natural capabilities,” said Dr. Ghazanfar. When the scientists brought another monkey into the room, for example, the animals would smack their lips. The scientists could get the monkeys to coo and grunt when presented with fruit. As they ate the fruit, the videos showed, the monkeys moved their mouths and throats into alternate positions. The scientists selected 99 stills from their   videos to study in more detail. They mapped the outline of the vocal tract in each picture, and then generated a   computer rendering of it, which they then used to model the sounds that a monkey could make by pushing air through that space. In theory, the researchers concluded, monkeys can make a fairly wide range of sounds. Looking at the most distinct vocal tract shapes, Dr. Fitch and Dr. Ghazanfar identified five separate vowels among the possibilities. “What you get are the vowels in ‘bit,’ ‘bet,’ ‘bat,’ ‘but’ and ‘bought,’” Dr. Fitch said. When the researchers played these sounds to people, they were able to correctly distinguish them most of the time. The scientists could even assemble the sounds into recognizable sentences. So what prevents these monkeys from gabbing all day long by the watering hole? The two researchers argue that the key to the acquisition of speech lies somewhere in the brain. “If they had the brain, they could produce intelligible speech,” Dr. Ghazanfar said. Our ancestors may have evolved special brain circuits that allowed them to learn new sounds as babies. Humans also developed a special set of nerves for the fine motor control of their vocal tracts. Dr. Lieberman isn’t convinced: His view is still that the evolution of human speech had to involve changes in both the brain and the vocal tract. Monkeys in the new study, he noted, failed to make the most distinct sounds in human speech, such as a long e. Without such a full repertoire of distinct sounds, he argues, it’s not possible to speak clearly as we do. “It’s the difference between having a very saturated color and a very pastel color,” he said. The acoustic version of saturated colors would have been important for   human speech, he said. But Anna Barney, a speech scientist at the University of Southampton in England, found the research of Dr. Fitch and his colleagues more persuasive. While monkeys may not have the full range of human vowels, Dr. Barney said, their repertoire is a very good starting place for speech. Still, she cautioned that the new study left important questions about speech unresolved. Vowels are important to speech, for example, but so are consonants. “What they’ve shown is that monkeys are   not ” Dr. Barney said.'"}, "time": 1742628475.6088452}