{"duration": 0.0838782787322998, "input_args": {"text": "'LIMA, Peru  —   A former Peruvian president is a fugitive, charged with taking bribes. In Colombia, prosecutors say its president’s   campaign accepted dirty money. And intelligence agents in Venezuela arrested journalists and researchers looking into scandals there. Latin America’s biggest corruption scandal is shaking the continent’s political establishment. It can all be traced back to Odebrecht, the Brazilian construction company, which has built major projects throughout the region and late last year settled with the United States, Brazil and Switzerland for up to $4. 5 billion under the Foreign Corrupt Practices Act for an elaborate bribe scheme involving $800 million in payoffs in exchange for lucrative contracts. It was the largest anticorruption settlement in history. Prosecutors said the company paid bribes on 100 projects in more than a dozen countries, from Mexico to Angola, in one case buying a local bank branch to hide the transactions, and even opening a division specifically dedicated to payoffs. Throughout Latin America, the company built bridges, dams, power plants, roads and stretches of a highway to link Brazil and Peru that went more than four times over budget. Nearly three years of investigations have resulted in 77 Brazilian Odebrecht executives signing plea deals, and the company’s former chief executive, Marcelo Odebrecht, is in prison. Now the charges are cascading across the region. “Once you start opening these cases, it’s a Pandora’s box  —   it could go on for years,” said Shannon K. O’Neil, an analyst at the Council on Foreign Relations. Yet she called it a positive development for the region, showing “the anticorruption movement in Latin America is gaining ground. ” Perhaps the most spectacular case so far involves Alejandro Toledo, the president of Peru from 2001 to 2006, and a wanted man since a judge issued an arrest warrant last week on charges that he had accepted up to $35 million in bribes. Mr. Toledo’s whereabouts was unknown, and Peruvians have been captivated. On Sunday night, he surfaced on Twitter, where he posted a statement attesting to his innocence and denied that he was hiding out. “I never fled from anything. When I left Peru, there were no Odebrecht charges against me, but they call me a ‘fugitive,’ ” he wrote, saying nothing of his location. The current Peruvian president, Pedro Pablo Kuczynski, has asked President Trump to extradite Mr. Toledo should he be found in the United States. In Lima, the capital, the legacy of Odebrecht is hard to miss. A statue of Christ with arms outspread that overlooks the city’s coast was donated by the company. But Odebrecht has also reaped the benefits of its connections to the country. The Interoceanic Highway, for example, begun under Mr. Toledo’s administration, cost $4. 5 billion, four times over budget. The overruns were approved by an official who is also under investigation by prosecutors. Under Ollanta Humala, Mr. Kuczynski’s predecessor, Odebrecht began a   $7 billion natural gas pipeline to connect the Amazon to the coast by cutting through the Andes Mountains. Another former president, Alan García, oversaw the bidding for a subway line in Lima, which Odebrecht won and constructed. If Mr. Toledo is apprehended and convicted, he would be the second Peruvian president behind bars, after Alberto K. Fujimori, the country’s former dictator, who was convicted of human rights abuses. “For Peru, like any other country, even the possibility of having two presidents as prisoners is an embarrassment,” Marisol Pérez Tello, the country’s justice minister, said in an interview. But she added, “I think this is an important moment to think about our ability to institutionalize the fight against corruption. ” Farther north, in Colombia, leaders were on the defensive as prosecutors said they had evidence that Odebrecht had donated $1 million to President Juan Manuel Santos’s   campaign in 2014. Speaking to reporters last week, the country’s attorney general said a former lawmaker, Otto Bula, had funneled Odebrecht money through an intermediary to the campaign. Mr. Bula is currently under arrest on charges of having paid about $4. 6 million in bribes for various projects in Colombia, including a road linking the country’s interior to the Magdalena River and Caribbean highway known as the Ruta del Sol. Mr. Santos had said he did not do anything wrong and is interested in a full investigation of the case. Roberto Prieto, Mr. Santos’s campaign manager, said in a statement last week he had not met Mr. Bula, “not even for a coffee. ” Investigators are also looking into dealings involving other politicians’ campaigns, including Oscar Iván Zuluaga, a   candidate for president in the 2014 election. Ivan Garzón, a political scientist at Colombia’s University of La Sabana, said Odebrecht had shown how easy it was to hijack the country’s elections for its own gain. “It shows that the problems of exorbitant campaign costs, ones so high the candidates are ready to make a pact with the devil,” he said. In Venezuela, the authorities seem to be taking a different tack toward the revelations: cracking down on outsiders trying to investigate them. Hugo Chávez, the former president of Venezuela, was one of Odebrecht’s principal patrons, steering $11 billion toward Odebrecht for infrastructure projects, including public housing, that undergirded his   revolution. But many of the projects, from bridges to agricultural buildings, were never finished. On Saturday, two researchers from Transparency International and two Brazilian journalists were arrested by Venezuelan intelligence agents while looking into an unfinished bridge Odebrecht was meant to construct over Lake Maracaibo, one of the company’s biggest projects. Jesús Urbina, one of the researchers, said they were questioned but not harmed. The Brazilian journalists were later deported. Juan Guaidó, an opposition lawmaker involved in investigating bribes, said the country’s secret police, controlled by President Nicolás Maduro, fears any attempts to document the unfinished projects. “I think the images of the projects as they look now with nothing done would leave them looking naked,” he said of the government.'"}, "time": 1742562260.4427023}