{"duration": 0.08072948455810547, "input_args": {"text": "'0 comments If you are one of the Americans DISGUSTED with Obama’s Pentagon demanding 10,000 war Veterans pay back enlistment bonuses handed out a decade ago, get ready to be FURIOUS! \\nMany of these Veterans served multiple combat tours and the bonuses were used to entice them to fight in Iraq and Afghanistan! Many have lost limbs and have suffered! \\nI would imagine that some are deceased and their spouses or family are having to deal with this! \\nBut the headlines read: U.S. Defense Secretary orders Pentagon to stop asking veterans to repay reenlistment bonuses \\nHe is only suspending until he is “satisfied that our process is working effectively.”. In other words, until this dies down so that they can go back to stealing from our fine Veterans! Secretary Carter and the Pentagon are NOT stopping this insanity! ABSOLUTELY NOT Ash Carter. This CHANGES NOTHING! \\nYou are still going about taking that money, just later after the anger dies down! I ain’t falling for it! \\nIf you are hurting for money, why don’t you ask the Iranians for some of those BILLIONS Obama just handed them back! Don’t you DARE do this to our hardworking Veterans! \\nYou need to be giving the monies already collected back! The Pentagon needs to be saying, we are STOPPING this entirely! SHAME ON YOU! You are even CHARGING INTEREST on this “debt”. I have never been so ashamed of the Pentagon and it’s leadership in MY LIFE! Secretary Carter, you are a MORON ! \\nWe already pay our servicemen and women way too little for the sacrifices they make! Their healthcare is abominable and their benefits are abominable! And I KNOW what kind of standard of living you live Carter!! \\nEVERYONE involved in this decision to to walk down this insane road with our war veterans need to be publicly spanked. YES!! EXACTLY what I mean. They need to be…in public…bare butt spanked. Pull them trousers down, lay them over a lap, and blister red those butts attached to those morons who are behind this scheme with a big Texas belt!. Seriously! \\nMaybe if they faced that humiliation they might think twice again before making such an obnoxious decision against our veterans. \\nHouse Majority Leader Kevin McCarthy pledged a House investigation of the problem, calling the Pentagon demands for repayment of bonuses from combat veterans “disgraceful.” \\nCongress best stop this insanity before it goes any further. Secretary Carter… DON”T YOU DARE try to deceive the American people and punt this down the road. \\nRed Skelton famously said, “From the people to the leaders, not the leaders to the people!” YOU Sir, are a public SERVANT..not a Master. The “public servants” are the SLAVES and We the People are the masters because that is how this country was set up. \\nYou said today you have a responsibility to the American taxpayer! YES you do! You have a responsibility to STOP this MADNESS. We the People are not going away! You just set your legacy in stone! You might want to fix it!'"}, "time": 1742561707.7261689}