{"duration": 0.0709376335144043, "input_args": {"text": "'As millions of Americans head to the polls to cast their ballots, reports of voting machine ‘irregularities’ and other various issues have already begun to surface across the country.\\nPlease note we will continue to update as this story as new reports surface. \\nAccording to FOX2 Michigan, voters in the cities of Detroit, Sterling Heights, Novi, Holly and Roseville have reported machines being unable to accept their ballots, forcing many to leave their them in the hands of polling location volunteers.\\nVia Fox2 \\nFOX 2 has received dozens of calls and emails from voters saying the machine at their polling place isn’t working correctly.\\nAn overwhelming number of voters from several cities report the machine isn’t able to accept the ballot… Many voters are concerned, though, that their vote may not be counted since they won’t be there to physically see it go through the machine.\\nFOX 2 has also spoken with some election volunteers who are frustrated because they’re not sure who to contact for help getting a new machine.\\nOne voter in Pennsylvania took to Twitter to voice his frustrations, posting footage of a voting machine swapping a vote for GOP candidate Donald Trump to Democrat Hillary Clinton.\\nH/T GatewayPundit \\nthis is what I was talking about, they fixed it but it was on some nut shit at first. pic.twitter.com/GO5Y9FCnYN \\n— ædonis | hotep (@lordaedonis) November 8, 2016 \\n\\nCBS2 KDKA in reported other voters experiencing the same issue in Pennsylvania:\\n\\nThe Philadelphia Republican Party has posted video of voter fraud witness Brittany Foreman recounting her experience at a 52nd ward polling location.\\n“My name is Brittany Foreman… and today I witnessed Voter Fraud.” #VoterFraud ILLEGAL. Please SHARE pic.twitter.com/5Plk8FszuT \\n— Philly GOP (@PhillyGOP) November 8, 2016 \\n\\nA Twitter user in New Jersey alleges a possible case of identity theft in their state:\\n@nj1015 hearing about a case of voter fraud in mount laurel. Name was already signed for when person showed up to cast vote #voterfraud \\n— Cara Flodmand (@MsHistory08) November 8, 2016 \\n\\nTwitter user Bonco states he received the following voter guide at a Greensboro, North Carolina polling location.\\n@realDonaldTrump #VoterFraud in NC at the polling place in Greensboro @ Rankin Elementary School, This is being handed en-route to the door pic.twitter.com/LOoP486lRx \\n— Bonoc (@DievasLives) November 8, 2016 \\n\\n—-\\nProblems at the poll such as suspected voter fraud or intimidation? Report it!\\n-Department of Justice 800-253-3931\\n-Donald Trump Campaign voter hotline 844-332-2016 or submit a report online here \\n-Contact us to share your story here \\n'"}, "time": 1742564433.091909}