{"duration": 0.04757356643676758, "input_args": {"text": "'Home › POLITICS | US NEWS › TRIGGERED: JOURNALIST SNOWFLAKES SCARED TRUMP SUPPORTERS ARE ‘TURNING ON THE MEDIA’ TRIGGERED: JOURNALIST SNOWFLAKES SCARED TRUMP SUPPORTERS ARE ‘TURNING ON THE MEDIA’ 0 SHARES \\n[10/28/16] Triggered journalists from across the nation are bemoaning the treatment members of the press are receiving at Trump campaign rallies from the Trump supporters the media routinely misrepresents as ignorant racists, fascist Nazis, or disenchanted working whites. \\nWith increasing regularity, these journalist snowflakes are “reporting” their victimization at the hands Trump supporters who chant mean things like, “CNN sucks” and call them names like “presstitutes.” \\nFor members of the media elite, the occasional taunts and jeers signal a dangerous threat to the free press. During an interview with Kellyanne Conway on Tuesday, CNN’s Wolf Blitzer breathlessly asked Trump’s campaign manager to ask Trump to stop calling out the press at his rallies because he is scared “there could be an ugly incident” between Trump supporters and the “hardworking young journalists” who cover his rallies. \\nA quick review of media stories over the last two weeks reveals more than a dozen articles in major publications with the same “journalists victimized by Trump supporters at rallies” narrative. Trump supporters endure long waits, messy parking, and often obstructed view seating to rally for their candidate. The press, on the other hand, is given their own entrance, sectioned off seating, and protection from event security and the Secret Service. \\nAfter an exhaustive search, this Breitbart reporter could find exactly zero incidences of members of the media being physically attacked or assaulted at Trump rallies. None of this has stopped the misleading characterization of Trump supporters creating a “menacing” and “dangerous” environment for these special snowflakes. \\nThe narrative sprung up briefly in August when NBC ‘s Katy Tur wrote a long piece in Marie Claire in which she gives her account of her confrontational relationship with Trump and the backlash his “insults” on her reporting created with his supporters. Here is a small piece from her “no-holds-barred” account: \\nI was six months into covering the Trump campaign for MSNBC and NBC News, and there I was, in the belly of a World War II battleship, in a press pen made out of bicycle racks, surrounded by thousands of whipped-up Trump supporters. \\n… \\nTrump decided to go further in Mount Pleasant, pointing his finger squarely at me and launching a personal attack as millions of Americans watched at home. \\n“What a lie it was,” Trump said, referring to the claim that he had left the stage abruptly. “What a lie. Katy Tur. What a lie it was. Third. Rate. Reporter. Remember that.” The crowd’s boos ricocheted off the iron hull of the USS Yorktown. \\nJust a few days after the Tur piece was published, two other NBC press employees — Frank Thorp and Ali Vitali — tweeted out pictures and videos of Trump supporters showing insufficient deference to the press. It was so very traumatic that it inspired several stories, including this one in Real Clear Politics . Post navigation'"}, "time": 1742561836.066737}