{"duration": 0.1842207908630371, "input_args": {"text": "'Carmela Tyrell November 6, 2016 Surviving Off-grid: 5 Ways to Manage Chimney Creosote \\nThe government is doing everything it can to deter people from burning wood , it still remains popular with home owners that don’t want to use oil or other more expensive fuels. Wood is also very popular with off gridders, preppers, and homesteaders because it can be harvested from natural resources or grown for this purpose. \\nMany people that burn wood are plagued by creosote that builds up in chimneys. As dangerous as this problem can become, preventing or reducing creosote buildup is not as hard as it seems to be. \\nHere are five ways you can reduce or prevent creosote buildup in your chimneys. \\nDo not forget to inspect your chimneys on a regular basis and clean them even if the creosote only looks like it is in the early stages of buildup. \\nHow Does Creosote Form? \\nHave you ever blown on a mirror or piece of glass so that some of the water vapor from your lungs condenses on the glass? If so, then you may also know that condensation occurs because the glass is cooler than the air exiting your mouth. \\nIn a similar way, when hot gas and smoke enter the chimney, they are hotter than the stove pipe. If the pipe is not hot enough, then creosote will condense out of the smoke and be deposited in the chimney. Video first seen on Corey Binford . \\nThe Three Degrees of Creosote Buildup \\nAs with many other situations in life, creosote build up may not be especially dangerous at first. However, if it is left unchecked, or not taken care of soon enough, it can become a very expensive problem. As you review the three degrees of creosote buildup, bear in mind that simply cleaning up the mess is only part of the problem. You will still need to take active steps to prevent or at least slow down further creosote buildup. \\n1st Degree \\nJust about every chimney will build up layers of soft black material known as soot. If you can easily brush the black layer of material out of the chimney, chances are there is actually very little creosote in it. \\nMany people consider this a good sign because it means the fire is burning hot enough to reduce the amount of temperature difference between the smoke and the chimney. While this stage isn’t especially dangerous, you will still need to clean out the chimney on a routine basis in order to keep good air flow. \\n2nd Degree \\nAt this level, you will start to see more creosote in the soot. There will be quite a few shiny black flakes of material that can still be removed if you put some effort into it. If you see this kind of soot, it is very important to increase the air flow in the burning area. \\n3rd Degree \\nThis type of creosote buildup forms layers of a tar like coating on inner surfaces of the chimney. If you think about how cholesterol builds up in arteries, then you have a pretty good picture of what I mean. \\n3 rd Degree creosote also contains a good bit of unburned fuel . As a result, when it does catch fire, it can be quite dangerous. The third degree of creosote buildup is caused by cool burning fires with inadequate ventilation, or by a flue that is too large. \\nHere are five ways to resolve this type of buildup. You may need a combination of answers in order to reduce the level of creosote buildup as much as possible. \\n1. Keep a Robust Airflow \\nHave you ever lit a candle, and then put it in a glass cup? If so, then you have also probably seen soot build up on the sides of the glass. \\nWhen a fire burns under any kind of restricted air flow, the soot from the fire will also concentrate and condense into smaller areas. Typically, fireplaces that have glass doors, or are otherwise closed off will have the most problems with airflow. \\nHere’s what you can do to remedy this problem: Keep the ash bin and grate area as clean as possible. Open the damper so that more air gets into the fireplace. If you cannot get enough air moving in the fireplace, try using a fan or blower to push more air in through the damper. Make sure that the fan is made of metal or some other non-flammable material. Aside from purchasing a new model, you may also find some old, or vintage blowers at a flea market for a much lower price. Never underestimate the power or durability of these old, but incredibly durable blowers and fans! In some cases, downdrafts from the outside can also cause poor air circulation inside the stove. You can try adding a partial cover to the top of outer pipe. Alternatively, add an insert with an inward curve that will also reduce the amount of downdraft that can get down the chimney. \\n2. Keep the Fire Hot \\nEven though you may think of a piece of wood as a single object, it is actually made up of all kinds of molecules. This, in turn, means that some molecules will have a higher kindling point than others. \\nIf the fire is not hot enough, some of the molecules that require a hotter temperature will escape into the chimney and form a layer of creosote if the conditions are right. Later on, if the temperature inside the chimney gets hot enough, these particles will catch fire and burn. \\nThe hotter the fire is, the better chance there is of these molecules being reduced to heat and ash in the fireplace. In addition, the hotter the fire is, the hotter the chimney will be. When the chimney is hot enough, all the gunk that forms creosote cannot collect. \\nHere are some ways to increase the heat output from a wood fire: add a few handfuls of coal to the wood fire. Coal burns at a higher temperature and will also last longer. Without a question, anyone that has used a coal fire on a freezing winter night can tell you just how delightful they are! install heat retaining bricks in the fireplace. This will increase the temperature inside the burn area and help keep the temperature steadier. insulate the chimney pipe with bricks. This is especially important if you are using a metal chimney, as they will always be cooler on the inner surface. The insulation will help, however it will not entirely solve the problem if it is caused by using a metal chimney. \\n3. Check the Size of the Flue \\nConsider a situation where you want to heat up a cup of coffee over a campfire. Chances are it will only take a few minutes to achieve this goal. Now let’s say you want to heat up a gallon of water over the exact same campfire. \\nHeating up a gallon of water will take longer than a cup because there are more atoms to deal with. In a similar way, when the flue is too large, there is simply too much material for the fire to contend with. A wood stove should not have a flue larger than six inches. \\nWhen you reduce the size of the flue, it allows less heat to escape. Some people have noticed a 20% or better increase in heat produced by fireplaces that have an optimally sized flue. Therefore, you will be reducing creosote problems and get more heat at the same time. \\nDepending on the construction of the stove and chimney system, you may not be able to simply rip the whole thing out and start over again. Your best option will be to insert a sleeve into the chimney so that it has a smaller internal diameter. Even though these sleeves are usually made of metal, the surrounding brick in the chimney should keep it warm enough to reduce the risk of creosote build up. If you still get too much creosote, focus on increasing the heat produced by the fire and the amount of air flow going up into the chimney. Remember, the more air flow you have going up the chimney, the harder it will be for particles to stay still long enough to attach to inner surfaces. You may also want to let the wood season longer than a few months, and choose some type of wood other than pine. Look for wood that has less resin or sap in it. It is also very important to stay away from pellets or other types of pre-manufactured wood because they may be designed to burn at lower temperatures than what you will need to heat up an over sized chimney. \\n4. Make Sure the Wood is Fully Seasoned and Dry \\nHave you ever tried to start a fire during or after it rains? If you are camping, chances are you use a number of methods to dry the wood out as much as possible so that it produces more heat than smoke. \\nIn a similar way, when wood is not fully seasoned and dried out, it will produce more creosote. Fires that produce a lot of smoke also have the following problems: there is less airflow, which reduces the amount of oxygen available to the fire the fire will burn cooler because water impedes combustion smoke is also a sign that more fuel is escaping into the air than you would get from a cleaner burning fire. \\nThere is no substitute for time when it comes to seasoning wood. You can try keeping logs closer to the fire place for a few days before you actually burn them. Just remember to rotate them often so that the log dries out more evenly. \\nChopping the log into smaller pieces might help too. This will increase surface area, which in turn will speed up water evaporation. You will still need to rotate the wood around to ensure the fastest possible drying. \\nWhen it comes to seasoning wood , many people make the mistake of covering the wood with a waterproof, air tight tarp. The wood will release water vapor, however it will fall right back onto the wood and be absorbed all over again. \\nYou will be better served by keeping the wood loosely covered and in a warm, sunny spot while it is drying. As with drying the wood out indoors, do not forget to rotate the woodpile every few days so that the pieces dry out as much and as evenly as possible. \\nIf the weather is especially damp, humid, or rainy, it may be of some help to cut the wood into smaller pieces. No matter how you look at it, increasing surface area always speeds up evaporation. It may seem like a lot of extra work, however it will pay off when you have hotter fires   and fewer problems with creosote. \\n5. Do Not Overload the Stove With Wood \\nWhen you have had a long, hard day, it is tempting to load the stove with as much wood as possible so you won’t have to add more through the night. On the other side of the equation, when you put too much wood in the stove, it reduces air flow. \\nAside from this, when fires burn, they also release some water vapor. When there is too much wood in the stove, some of that vapor may just land on the wood and increase its moisture level. No matter how well seasoned the wood is, that increased moisture will cause the fire to burn poorly. \\nHere are some ways to resolve this problem: start off by adding just one piece at a time to the fire. If the fire burns well, try adding a second piece. Keep adding more pieces as long as the fire burns cleanly. Do not forget that you may not be able to add as many pieces at one time on rainy days or ones where it is impossible to prevent a downdraft from the chimney. install an automatic wood feeder. Even thought a wood feeder can take up a good bit of space, it may be a better solution than trying to manually feed the stove. Use coal and other materials that might burn longer during times when you won’t be available to feed the stove more wood. \\nWherever you live in (an apartment or a house), chances are the building will have a chimney, and there will also be a stove available for burning wood . Getting started with wood burning is not especially difficult, but avoiding creosote buildup in the chimney can be challenge. \\nBe careful about the condition of the fire, the wood, and ventilation issues that may lead to creosote buildup. Once you find a way to reduce the speed of creosote buildup, do not forget to inspect the chimney on a regular basis. \\nA clean chimney is not just a safe one, it is a valuable asset that will help you burn wood efficiently and get the most from it. \\n  Carmela Tyrell for Survivopedia. 464 total views, 463 views today'"}, "time": 1742563054.6249216}