{"duration": 0.1554276943206787, "input_args": {"text": "'Waking Times \\n“In the middle of all the brain-research going on, from one end of the planet to the other, there is the assumption that the individual doesn’t really exist. He’s a fiction. There is only the motion of particles in the brain. Therefore, nothing is inviolate, nothing is protected. Make the brain do A, make it do B; it doesn’t matter. What matters is harmonizing these tiny particles, in order to build a collective consensus, in order to force a science of behavior.” ~The Underground, Jon Rappoport \\nIndividual power. Your power. \\nIt stands as the essence of what the founding documents of the American Republic are all about, once you scratch below the surface a millimeter or so. \\nTherefore, it stands to reason that colleges and universities would be teaching courses in INDIVIDUAL POWER. \\nAs soon as I write that, though, we all fall down laughing, because we understand the absurdity of such a proposition. Can you imagine Harvard endowing a chair in Individual Power? \\nStudents would tear down the building in which such courses were taught. They’ve been carefully instructed that the individual is the greatest living threat to the planet. \\nIf you can’t see that as mind control, visit your local optometrist and get a prescription for glasses. \\nSo we have this astonishing situation: the very basis of freedom has no reflection in the educational system. \\nYou can say “individual” within certain limited contexts. You can say “power,” if you’re talking about nuclear plants, or if you’re accusing someone of a crime, but if you put “individual” and “power” together and attribute a positive quality to the combination, you’re way, way outside the consensus. You’re crazy. You’re committing some kind of treason. \\nIn order to spot the deepest versions of educational brainwashing, YOU HAVE TO HAVE SOME STANDARD AGAINST WHICH YOU CAN COMPARE WHAT IS COMING DOWN THE PIPELINE INTO THE MINDS OF STUDENTS. \\nIf you lack that standard, you miss most of the action. \\nIf you lack that standard, you have already been worked over by the system. \\nAnd in this case, the standard is INDIVIDUAL POWER. \\nClean it off, hose off the dirt, polish it, look at it, think about it, remember it. \\nThen you’ll see some Grade-A prime mind control. Everywhere. Because schools either don’t mention it, or they discredit it. \\nBack in the days when I was writing on assignment for newspapers and magazines, I pitched a story about individual power to an editor. I wanted to trace its history as an idea over the past ten years. \\nHe looked at me for a few seconds. He looked at me as if I’d just dropped some cow flop on his desk. He knew I wasn’t kidding and I had something I could write and turn in to him, but that made it worse. He began to squirm in his chair. \\nHe laughed nervously. \\nHe said, “This isn’t what we do.” \\nFor him, I was suddenly radioactive. \\nI had a similar experience with a high-school history teacher in California. We were having lunch in a cafe in Santa Monica, and I said, “You should teach a course in individual power. The positive aspects. No group stuff. Just the individual.” \\nHe frowned a deep intellectual frown, as if I’d just opened my jacket and exposed a few sticks of dynamite strapped to my chest. As if he was thinking about which agency of the government to report me to. \\nNow, for the schizoid part. The movies. Television. Video games. Comics. Graphic novels. They are filled to the brim, they are overflowing with individual heroes who have considerable power. These entertainment businesses bank billions of dollars, because people want to immerse themselves in that universe where the individual is supreme. They want it badly. \\nBut when it comes to “real” life, power stops at the front door and no one answers the bell. \\nSuddenly, the hero, the person with power is anathema. He’s left holding the bag. So he adjusts. He waits. He wonders. He settles for less, far less. He stifles his hopes. He shrinks. He forgets. He develops “problems” and tries to solve them within an impossibly narrow context. He redefines success and victory down to meet limited expectations. He strives for the normal and the average. For his efforts, he receives tidbits, like a dog looking up at his master. \\nIf that isn’t mind control, nothing is. \\nOnce we enter a world where the individual no longer has credibility, a world where “greatest good for the greatest number” is the overriding principle, and where that principle is defined by the elite few, the term “mind control” will have a positive connotation. It will be accepted as the obvious strategy for achieving “peace in our time.” \\nAt a job interview, a candidate will say, “Yes, I received my PhD in Mind Control at Yale, and then I did three years of post-doc work in Cooperative Learning Studies at MIT. My PhD thesis? It was titled, ‘Coordination Strategies in the Classroom for Eliminating the Concept of the Individual.’” \\nFrom Wikipedia, “Cooperative Learning”: \\n“Students must work in groups to complete tasks collectively toward academic goals. Unlike individual learning, which can be competitive in nature, students learning cooperatively can capitalize on one another’s resources and skills…Furthermore, the teacher’s role changes from giving information to facilitating students’ learning. Everyone succeeds when the group succeeds.” \\nThat is a towering assemblage of bullshit. \\n“Everyone succeeds when the group succeeds.” You could use that quote on the back cover of Orwell’s 1984 or Huxley’s Brave New World . Everyone does not succeed—because the individual never finds out what he can do on his own. That avenue is cut off. He only knows what he can achieve in combination with others. He only knows what he can understand when he borrows from others. He may never glimpse what he truly wants to do in life. \\nThis is a tragic situation, but the tragedy is concealed, because the memory of shifting from individual independence to group dependence is gone. There is no such memory. A child is brought up without independence. Therefore, how can he recall losing it? \\nHe only knows the group and the team and the participation and the praise. He only knows the organizing of his life within a synthetically produced context. \\nHe is taught that this is good and necessary. \\nSo, one day, when a bolt comes out of the blue and he recognizes he is himself, what will he use to grasp that revelation and build on it? \\nYes, there are productive groups and teams, and one is always working with others, to some degree. But the core and the starting point is one’s self. That is where the insight and the magic begin. That is where the great decisions and commitments are made. That is where the world is born, every day. \\nI see no end of writing about this magic, because civilization has been turned upside down by treacherous people who have been fabricating a counter-tradition that will sink the ship. About the Author \\nJon Rappoport is the author of three explosive collections, THE MATRIX REVEALED , EXIT FROM THE MATRIX , and POWER OUTSIDE THE MATRIX , Jon was a candidate for a US Congressional seat in the 29 th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free emails at NoMoreFakeNews.com or OutsideTheRealityMachine . \\n(To read about Jon’s mega-collection, Exit From The Matrix , click here .) \\nThis article ( Collective Consciousness – The Individual is Gone ) was originally created and published by Jon Rappaport’s Blog and is re-posted here with permission. \\n~~ Help Waking Times to raise the vibration by sharing this article with friends and family…'"}, "time": 1742561994.7525673}