{"duration": 0.12613201141357422, "input_args": {"text": "'Why You Should Consume Cranberries Beyond the Holiday Season \\nby Paul Fassa Health Impact News \\nIt’s traditionally common to include some form of cranberry offering as a side dish with Thanksgiving dinners, along with turkey or turkey substitutes and stuffing. Ironically, it just might prove to be the healthiest part of the meal. Its health benefits are unknown, ignored, or underrated. \\nIts somewhat tart taste isn’t an attractive feature for many of us, including this reporter. My understanding is the tart taste would be worse if some sort of healthy sweetener wasn’t added to any type of cranberry offering. \\nBut cranberries modified minimally do offer the most health benefits, while the excessively sucrose sweetened commercial juices negatively impact those benefits. \\nThis reporter is eating crow to let you know that eating cranberry is very healthy in many ways. Some of the health benefits may surprise you as much as they surprised me. A Mostly Known Health Benefit \\nIt’s mostly known that cranberry juice is a great solution for urinary tract infections (UTIs), both preventative and curative. Anyone can incur a UTI, which makes urination painful. But middle aged women are known for having recurring urinary tract infections. Cranberry consumption would serve them well. \\nCranberry does not kill off UTI causing bacteria, such as E.coli. Its polyphenol (plant antioxidant compounds) proanthocyanidin (PAC) A-type linkages make it very difficult for pathogenic bacteria to adhere to the urinary tract, thus making it too difficult for pathogenic bacteria to colonize and create inflammation or infection. \\nMainstream allopathic medical practitioners consider cranberry as a UTI deterrent, but not a cure. They advocate prescribing antibiotics while admitting heavy antibiotic use can cause urinary tract infections . But I know of one person who reversed a persistent nagging UTI by consuming lots of cranberry juice for around 10 days. \\nCranberry’s PAC may also be effective against a type of bacteria, Helicobacter pylori, which colonizes in the stomach lining to cause ulcers according to one source. UTI’s can become dangerous if they spread into the bladder or kidneys. Here are some symptoms of urinary tract infections: Strong and frequent urge to urinate, sometimes with little or no urination occurring Cloudy, bloody or noticeably foul smelling urine Pain or burning sensation when urinating Nausea and vomiting, sometimes with low level fever Muscle aches and abdominal pains A UTI can lead to interstitial cystitis or “painful bladder” and cause pelvic pain \\nSo urinary tract infections should be avoided, and cranberry is a solution. However, it’s important to use organically grown cranberry sources. Cranberry juice should be mostly without the added refined sugar that’s used to popularize it. Perhaps mixing it with a naturally sweeter juice, such as organic grape juice from pressed grapes would work to ameliorate that tart taste from unmodified cranberry sources. Lesser Known Important Health Benefits \\nLately there’s been a stir over the discovery of biofilms. Biofilms are structures formed by bacteria linking together to form a survival network for the survival enhancement. Though the bacteria in these biofilm networks “communicate” among themselves, the end result is an independent bacterial matrix forming an independent entity that adheres to epithelial surfaces of internal organs and outer skin. \\nThis evolutionary biological strategy is an effort to survive antibiotics and defend against our innate immune systems. Fully developed biofilms may release individual floating or swimming bacteria cells, similar to an alien mother ship releasing compact craft for further exploration or trouble making. \\nThose pathogens can be killed by immune systems or antibiotics. Pharmaceutical antibiotics are dangerous even beyond creating resistant bacteria and eliminating probiotic flora. Natural antimicrobial colloidal silver is proven a safe and effective alternative. \\nBut a biofilm can stubbornly survive and threaten whatever organ it’s attached to. There are several varieties of bacteria that are capable of forming into persistent biofilms. Some inhabit lung tissue adding to problems with fibromyalgia, a disorder characterized by widespread musculoskeletal pain accompanied by fatigue, sleep, memory and mood issues. \\nCan cranberry PACs (proanthocyanidins) have an effect on these biofilms? Both in vitro (lab cultures) and in vivo (animal) studies have determined that these biofilm “mother ship” formations can be released from their adherence to organ tissues affected while reducing their capacity to release independent pathogenic cells. (Source) \\nAnother study demonstrated cranberry PACs efficacy on fungal Candida albicans to prevent or reverse candida overgrowth, a fungal biofilm. The researchers concluded: \\nThese findings indicate that cranberry PACs have excellent in vitro activity against C. albicans biofilm formation in artificial urine. We present preliminary evidence that cranberry PAC activity against C. albicans biofilm formation is due to anti-adherence properties and/or iron chelation. (Source) Conclusion: Cranberries are a Superfood \\nA key word in either study, preliminary, suggests their intent is follow up with pharmaceutical industry funded studies that would extract cranberry PACs and determine how to synthesize them for patent purposes. \\nOne of the studies proposed using cranberry PAC extracts as adjuncts to antibiotic treatments. In other words, these are not cranberry industry sponsored studies. They are simply researching for the sake of scientific inquiry. Whatever pharmaceutical company’s interest is piqued can sponsor those researchers and keep them busy with their scientific inquiry. \\nCranberry grower and provider associations usually do not have the financial wherewithal to fund studies proving the efficacy of cranberries, and supplement or nutraceutical companies creating concentrated cranberry extracts are not blessed by the FDA enough to permit them to claim curative or preventative properties even if proven in human trials. \\nBut that’s no reason to discourage pursuing cranberries as a superfood. Here’s an easy recipe for creating your own cranberry spread, courtesy of foodrenegade.com, that can give you a daily dose of cranberry benefits: \\nIngredients: 2 cups organic frozen or fresh cranberries (highly seasonal – fall) 2 tablespoons coconut oil (which can be purchased from this site ) 1/4 cup water 6 tablespoons rapadura (*Note below) 1/2 teaspoon non-irradiated cinnamon 1/2 teaspoon vanilla dash real sea salt (optional) \\n* Note: Rapadura is also known as Panela, Raspadura, Chancaca, and Piloncillo. Piloncillo (pee-loan-see-yo) can be purchased inexpensively at Mexican food shops common in the Southwest USA or other urban areas with significant Mexican populations. \\nThese sweeteners are from pure cold pressed organic sugar cane juice. The water is cooked off at low heat, then ground to produce a grainy sugar. It has not been cooked at super high heats and does not contain chemicals or anti-caking agents. Thus the high mineral molasses content is retained. Common table sugar, sucrose, is a highly refined high calorie non-nutrient that spikes blood sugar levels. \\nAnother sweetener similar to those in the first paragraph, Sucanat , is available at some health food stores. Any of these can be ordered online if local purchasing is prohibitive. Honey is healthy but loses some of the health benefits when heated. High mineral pure maple syrup is okay heated. You can get it here . \\nDirections: Place the cranberries, water, rapadura, salt, and coconut oil in a pot and cook over medium heat for fifteen minutes. Add in the cinnamon and cook another ten minutes or until the water has evaporated completely and the cranberries have “popped” open and start to thicken. Turn off the heat and mix in the vanilla. Place in a mason jar and allow to cool completely on the counter. Cover tightly with the lid and store in the fridge. Should be good for a week. \\nThis could provide you with a tasty daily dose of cranberries. \\nSources:'"}, "time": 1742628488.4388316}