{"duration": 0.1006011962890625, "input_args": {"text": "'Russia, Cina e Arabia Saudita domano l’egemonia del dollaro di Ariel Noyola Rodríguez \\nGli Stati Uniti aumentano gli ostacoli tentando di mantenere l’egemonia del dollaro come valuta di riserva mondiale. Negli ultimi mesi, i Paesi emergenti hanno venduto un molti buoni del tesoro degli USA, principalmente Russia e Cina, ma anche Arabia Saudita. Inoltre, per proteggersi dalle violente fluttuazioni del dollaro, le banche centrali di diversi Paesi acquistano enormi quantità di oro per diversificare le riserve valutarie. In breve, l’offensiva globale nei confronti del dollaro è esplosa attraverso la vendita massiccia di debito degli Stati Uniti e, in parallelo, l’acquisto colossale di metalli preziosi. Rete Voltaire | Città del Messico (Messico) | 5 novembre 2016 français Español \\nLa supremazia di Washington nel sistema finanziario globale ha subito un colpo tremendo ad agosto: Russia, Cina e Arabia Saudita vendevamo titoli del Tesoro degli Stati Uniti per 37,9 miliardi di dollari, secondo l’ultimo aggiornamento dei dati ufficiali pubblicato da pochi giorni [ 1 ]. Dal punto di vista generale, gli investimenti globali nel debito pubblico degli Stati Uniti sono al livello minimo dal luglio 2012. Chiaramente, il ruolo del dollaro a valuta di riserva mondiale è ancora messo in discussione. \\nNel 2010, l’ammiraglio Michael Mullen, presidente del Joint Chiefs of Staff statunitense, avvertì che il debito era la principale minaccia alla sicurezza nazionale [ 2 ]. A mio avviso, non è tanto l’alto debito pubblico (oltre i 19 000 miliardi [ 3 ]) ad ostacolare l’economia degli Stati Uniti, ma per Washington è di fondamentale importanza garantirsi un enorme flusso di risorse estere ogni giorno, per coprire i deficit gemelli (commercio e bilancio); cioè per il dipartimento del Tesoro è questione di vita o di morte vendere titoli di debito nel mondo e così finanziare le spese degli USA. \\nSi ricordi che dal fallimento di Lehman Brothers nel settembre 2008, Bank of China ha subito forti pressioni da Ben Bernanke, allora presidente della Federal Reserve (FED), a non vendere i titoli del debito degli Stati Uniti. In un primo momento, i cinesi decisero di mantenere il dollaro. Tuttavia, da allora, per due volte, la PBoC evitava di acquistare altri titoli degli Stati Uniti e, allo stesso tempo, avviava un piano per diversificare le riserve valutarie. \\nPechino acquista oro in maniera massiccia negli ultimi anni, e lo stesso fa la banca centrale della Russia. Nel secondo trimestre del 2016, le riserve auree della Banca di Cina hanno raggiunto le 1 823 tonnellate contro le 1 762 tonnellate registrate nell’ultimo trimestre del 2015. La Federazione Russa ha aumentato le riserve auree di circa 290 tonnellate tra dicembre 2014 e giugno 2016, chiudendo il secondo trimestre di quest’anno con un totale di 1 500 tonnellate. \\nDi fronte ai brutali scossoni del dollaro è fondamentale acquistare asset più sicuri come l’oro che, in tempi di grave instabilità finanziaria, agisce da rifugio sicuro. Quindi la strategia di Mosca e Pechino nel vendere titoli del Tesoro degli USA e comprare oro, viene seguita da molti Paesi. Come stimato dal Fondo monetario internazionale (FMI), le riserve auree delle banche centrali nel mondo hanno già raggiunto il massimo degli ultimi 15 anni, registrando ai primi di ottobre un volume di circa 33 000 tonnellate [ 4 ]. \\nLa geopolitica fa la sua parte nel plasmare il nuovo ordine finanziario mondiale. Dopo l’imposizione delle sanzioni economiche al Cremlino, a partire dal 2014, il rapporto con la Cina ha avuto grande rilevanza per i russi. Da allora, le due potenze hanno approfondito i legami in tutti i settori, dall’economia e finanza alla cooperazione militare. Inoltre, assicurando la fornitura di gas alla Cina per i prossimi tre decenni, il Presidente Vladimir Putin ha costruito con l’omologo Xi Jinping una potente alleanza finanziaria che cerca di porre fine una volta per tutte al dominio della moneta statunitense. \\nAttualmente, gli idrocarburi che Mosca vende a Pechino sono pagati in yuan, non dollari. Così, la “moneta del popolo” (‘renminbi’ in cinese) emerge gradualmente nel mercato mondiale degli idrocarburi con il commercio tra Russia e Cina, Paesi che, a mio parere, guidano la costruzione del sistema monetario multipolare. \\nLa grande novità è che alla corsa per la dedollarizzazione dell’economia globale si è unita l’Arabia Saudita, Paese per decenni fedele alleato della politica estera di Washington. Sorprendentemente, negli ultimi 12 mesi Riad s’è sbarazzata di più di 19 miliardi di dollari investiti in titoli del Tesoro degli Stati Uniti, divenendo insieme alla Cina uno dei principali venditori di debito degli Stati Uniti [ 5 ]. A peggiorare le cose, il regno saudita si accanisce sempre più con la Casa Bianca. \\nA fine settembre, il Congresso degli Stati Uniti approvava l’eliminazione del veto del presidente Barack Obama ad una legge che impediva negli USA di denunciare l’Arabia Saudita in tribunale per il presunto coinvolgimento negli attentati dell’11 settembre 2001 [ 6 ]. Insieme, l’Organizzazione dei Paesi Esportatori del Petrolio (OPEC) ha raggiunto un accordo storico con la Russia per ridurre la produzione di petrolio e quindi promuovere l’aumento dei prezzi [ 7 ]. \\nE’ anche sorprendente che giusto oggi Pechino abbia aperto allo scambio diretto tra yuan e riyal saudita attraverso il Trading System Foreign Exchange della Cina (CFETS, nell’acronimo inglese) per le transazioni tra le due valute senza passare dal dollaro. Di conseguenza, è molto probabile che, più prima che poi, la compagnia petrolifera Saudi Aramco accetti pagamenti in yuan invece che dollari [ 8 ]. Se si accadesse, la Casa dei Saud punterebbe tutto sul petroyuan [ 9 ]. Il mondo cambia davanti ai nostri occhi…'"}, "time": 1742561691.9910815}