{"duration": 0.07148528099060059, "input_args": {"text": "'in: Science & Technology October 28, 2016 marks the official launch of Zerocash (“Zcash,” “ZEC”), a new cryptocurrency that has received tremendous attention from the Bitcoin community. The technology is named for its zero-identity function of shielding transactions on its blockchain, or digital ledger. “Zerocash is a new protocol that provides a privacy-preserving version of Bitcoin (or a similar currency),” its developers explain . “[I]n Zerocash, users may pay one another directly, via payment transactions that reveal neither the origin, destination, or amount of the payment.” The enthusiasm surrounding the coin is demonstrated in the recent price for Zerocash futures contracts, representing one unit and valued against the price of one Bitcoin (BTC). Between September 15th and October 26th the price surged almost 1,300%—from a low of $18 (0.027 BTC) to a high of $261 (0.379 BTC). Upon its October 28 debut the price of one Zcash actually exceeded $100,000,000 (one million) on some exchanges , with an average of about around $15,000. The high valuation and scarcity is at least partly influenced by the novel way Zcash is being introduced. The cryptocurrency will not be initially available to investors for over-the-counter purchases and can only be obtained in gradually increasing increments over a month-long period through “ mining, ” or digital production by those with the necessary computer equipment and technological expertise. An additional reason for the building excitement around Zcash is that its development team consists of notable computer scientists at University of California at Berkeley, Johns Hopkins University, Tel Aviv University, and the Massachusetts Institute of Technology state actors, including Amazon, the US Defense Advanced Research Projects Agency, the Office of Naval Research, and the Israeli Ministry of Science and Technology. The entire list of funders is as follows: *Amazon.com *Tel Aviv University Authentication Initiative *Center for Science of Information (CSoI), an NSF Science and Technology Center *Check Point Institute for Information Security *U.S. Defense Advanced Research Projects Agency (DARPA) *Air Force Research Laboratory *European Community’s Seventh Framework Programme *Israeli Centers of Research Excellence I-CORE program *Israeli Ministry of Science and Technology *The Leona M. and Harry B. Helmsley Charitable Trust *Office of Naval Research *Simons Foundation *Skolkovo Foundation Libertarians especially, with their philosophical antipathy toward state monopoly that central banking epitomizes have been among the most vigorous supporters of cryptocurrency development and use. This is accentuated by the fact that traditional markets for “hard money” investment such as precious metals are likewise subject to heavy manipulation by the same or allied central banking outlets. Yet one would be hard-pressed to come up with a greater illustration of centralized state power than the array of interests listed above. Indeed, the involvement of such actors in developing the “next Bitcoin” should be recognized vis-a-vis the Western financial community’s continued advocacy for the drastic reduction of conventional central bank-issued currency from circulation (i.e. here , here , here , here and here ). In theory Zerocash differs from Bitcion in that it represents a bolstered technology for anonymous transactions veiled from third party scrutiny. According to the mechanics such transactions may be viewed and recorded by the specific parties who obtains proper authorization. What if a Trojan Horse capability could be engineered into the currency that might later be utilized by lettered agencies? This is the greatest fear of those who rightly question the loss of tangible exchange. Further, such a development would defeat ZeroCash’s desirability and purpose. By dismissing the possibility of such a feature Zcash users implicitly rely on the integrity of the developers themselves, most of whom are junior faculty or graduate students whose research, as noted, is at least partly funded by such deep state actors. Many Bitcoin enthusiasts regard cryptocurrencies as a sort of deus ex machina against the state. Along these lines, Zerocash’s institutional and scholarly veneer cloaks the more complex grant-generating interests lurking in the shadows. Recently even strong advocates of Bitcoin have pondered if the financial medium may have been developed with direct or indirect participation of the intelligence community. In the case of Zcash there can be no doubt of such deep state interest and involvement, which is of no small concern as the world moves toward a seemingly inevitable “cashless society.” Submit your review'"}, "time": 1742563524.7132957}