{"duration": 0.16402029991149902, "input_args": {"text": "'Email \\nThis has been a debate garnering some attention in the UK for several years, mainly under the auspices of a contrast between “Red Tory” and “Blue Labour”. \\nThis debate, which has about the need for a mutualism countering the bureaucratic state and providing collective resources for private individuals abandoned to laissez faire, has not however been significant in the US. \\nIn the US, the function of the state is very much to aid and abet the oligarchy by blurring the line between the government and the private sector to the advantage of the latter, as opposed to being a check on it. US governments have therefore all but abandoned their role as the indispensable and major provider of essential welfare services. \\nEven “Tricky Dicky” Nixon, knave that he was, went along with such relatively ample provision by the state. \\nToday, however, American politicians, unless they are super-rich, can’t campaign effectively without monetary heft from a plutocratic private sector, to which they are then utterly beholden. Hillary Clinton anyone? \\nAmerican politicians who mount the slightest challenge to this rapaciously dysfunctional political system—George McGovern in days of yore, Denis Kucinich a few years ago, and now Sanders– are sent packing by its upholders. \\nIn the UK the Tories and New Labour have advanced on a similar neoliberal path since Thatcher, but encountered more resistance from voters, largely because its Celtic fringe adheres resolutely to the welfare state, and because there is still in the UK a solid bloc of voters to the left of the main parliamentary parties on several major issues (war, environmental protection, ringfencing the NHS, a commitment to public education, and the need for a fairer electoral system, being the most prominent). \\nThe postwar settlements after 1945 in the countries of the west depended on a broadly Keynesian concordat, mediated by the state, between labour and capital. \\nIn the 1970s this concordat fell into a crisis, and was dissolved by the governments of Reagan and Thatcher, whose names are often given to the succeeding neoliberal politico-economic paradigm. \\nHowever, neoliberalism, with its emphasis on supposed market forces, has failed to deliver a general prosperity while exacerbating economic inequality, as well as promoting unstable bubble economies as the sole alternative to a widespread stagnation. \\nIn response to these failures of the social-welfare state (on the one hand) and a no-holds-barred neoliberal economic individualism (on the other), there has been a growth of interest in the UK in “mutualist” paradigms emphasizing cooperation, in self-governing and voluntary associations, on a scale smaller than the state but larger and more collective than that acceptable to a market-bedazzled or market-entrapped homo oeconomicus. \\nThese voluntary and self-governing associations will be non-profit making and funded out of the public purse. \\nIn the UK, the Blue Labour “tendency” (for it is no more than that in effective political terms) ratifies a form of mutualism, and in the US Bernie Sanders expressed interest in participatory political forms stressing mutualism, at least when he was still contending with Hillary Clinton for their party’s nomination to be a candidate for the 2016 presidential election. \\nHowever, a state-driven social democracy of the kind prevailing until the 1970s will be difficult to revive because the state favoured by neoliberalism is a Market-State in root and branch, with market-imperatives– or rather those of quasi-markets, because neoliberal markets are rigged and rent-seeking (as Michael Hudson , Guy Standing , and others have pointed out) — dominating the State’s core. \\nThis neoliberal Market-State is more about entrenching the parasitic rentier-based oligarchy than promoting the fabled competitive markets extolled by classical liberalism. \\nSo, the key question for us is whether new forms of cooperation and mutualism, socialist in nature, can emerge in an innovative kind of post-neoliberal state, forms which can then exist in concert with crucially-important local and regional formations. \\nBlue Labour’s proponents have identified a panoply of measures and steps as the way to inaugurate a full-blown associationism: co-operative ventures of all kinds, community banks and credit unions, community-sponsored daycare and eldercare, youth clubs, greatly augmented municipal government, proper apprenticeship schemes (as opposed to largely inconsequential “work your way in the hope you get a job” workfare arrangements), and so on. \\nHowever, if neoliberalism remains, there will be no real move to a sufficient mutualism. So, decisive steps must be taken to push neoliberalism to the side. Blue Labour purports to be an alternative to neoliberalism, but does not endorse (at least not explicitly) the revolutionary means needed to supplant the neoliberal order. \\nA mutualism which does not tackle the overridingly important issue of the ownership of assets, and fails to advance their common ownership, is going to be a paper tiger (to resort to the nomenclature of the Great Helmsman). \\nOther interim measures will include an overturning of regnant macroeconomic policy, to encompass the greater taxation of wealth; the abolition of opportunities to extract rentier-based incomes (neoliberalism’s modus operandi); the repatriation of capital that has migrated to Wall Street and the City of London; the introduction of capital controls; the reduction of military spending; greater provision of resources on infrastructure, health, and education; converting banks into public utilities whose sole role is the intermediation between buyers and sellers (as opposed to the emphasis on gratuitously unproductive forms of speculation and arbitrage so prevalent today); supporting trade unions; placing important services conducing to our overall good in the public domain, which need not necessarily be statist, since the public domain will perforce now include a variety of formations that are associationist. \\nAnother significant step would be the disruption of the monetary symbiosis now existing between the corporate and political élites. \\nAlso important will be the reduction, and ultimately the elimination, of the for-profit sector when this does not operate for the public good. \\nAn example of how a project undertaken by a private company can easily be placed in the hands of a publicly-owned organization is the upcoming construction of London’s “super sewer” system. Balfour Beatty, the controversial giant construction company , has been awarded a £416m contract to build a section of this “super sewer” (and we can count on the almost inevitable cost overruns doubling and even tripling the sum stipulated in the original deal). \\nBB is a private company with shareholders and private investors. A project on this scale could easily have been undertaken by a publicly-owned and controlled body, which would return earnings to the public purse, as opposed to feathering the nests of a small group of private citizens. \\nToday colossally lucrative enterprises, making their originators some of the wealthiest people on earth, exist in a realm that can best be described as virtual. \\nUber owns no taxis, Airbnb owns no rental properties, EBay/Alibaba possess no inventory, Facebook generates no content of its own, TaskRabbit and Amazon’s Mechanical Turk (the latter’s motto being “giving you access to a scalable workforce”) create no sustainable jobs but use the internet to “match” individuals with substantial incomes needing someone to undertake menial tasks or run small errands, with a hapless “gig” clientele more or less willing to do this for chickenfeed. \\nIn addition, high-speed stock traders sit at desks transmuting algorithms into computer pixels to generate obscene rental returns (“profit” generally being used in classical economics only to characterize gains accruing from actual productive investment) in a few clicks of the keyboard. \\nDispensing with the stock-market racket will only require political will, admittedly not an easy undertaking since the political élites have also been allowed to feed at its trough. \\nAt the same time, the other virtual enterprises can be put to social uses: Uber can become a communal car-sharing service, Airbnb can serve the homeless, and TaskRabbit and Mechanical Turk can service the needs of a market providing substantial employment beyond the level of “gig” jobs. \\nAll citizens should have access to common basic entitlements, and associations will be publicly funded only if they are open to all and willing to provide services on the basis of public entitlements. \\nThe removal of neoliberalism, and ultimately capitalism itself, is going to be the surest way to bring about an extended and long-lasting mutualism and associationism. \\nIf neoliberalism and capitalism continue exist, we will be mired in an ethos based on the absurd proposition that we must first “create wealth”, then somehow find ways to prise the loot generated by this process out of the fingers of a fortunate few to “improve the quality of life” for the rest of us. \\nIs there any greater idiocy, apart from the possible notion that the interests of the generality of the US and the world will be adequately served by a Trump or Clinton presidency? \\nKenneth Surin is Professor of Literature and Professor of Religion and Critical Theory Program in Literature and Critical Theory at Duke University.'"}, "time": 1742563787.9857686}