{"duration": 0.01595783233642578, "input_args": {"text": "'A group of feminist performing artists ‘galloped’ seven kilometres through Stockholm past a number of the city’s statues on Saturday to protest “patriarchal” statues of men on horseback. [“When you look at the sculptures we have in the park and city in Stockholm, you see men on horses and other men,” choreographer Anna Källblad told SVT. “Statues of women tend to be naked, and quite small. ”  The group ‘galloped’ past the Royal Palace, Humlegården, Royal Garden, and Gustav Adolf’s Square, pausing at statues, where participants “snorted” kicked, and flicked their hair in an attempt to mimic equine behaviour. Hoping that ‘City Horses’ could start a debate about men and women in public space, artist Helena Byström said the “feminist dance gallop” acted as a necessary “counterweight to the great hordes of men who take up room in the city in different ways”. Statues of men from Swedish history on horseback are outdated, and their presence overpowers Stockholm with “the male gaze and the idea of male power” according to Källblad. “Our performance is a fun way to confront it,” the choreographer told Svenska Dagbladet, describing the group as “living sculptures”. “Horses are a symbol of power, but at the same time they represent equestrianism and dance   —   both female activities which are often marginalised. “And just like the female body, horses can symbolise both the restrained and the wild,” said Källblad, remarking that “‘City Horses’ poses viewers the question of how women can occupy the public domain without being objectified. ” The idea that men occupy public spaces at the expense of women is a key theme of feminism in Sweden. Its environment minister announced in March that the country should reduce the number of cars on the road because male drivers outnumber women. “Cars are driven largely by men so by giving a lot of space to cars we’re giving a lot of space to men  —   at the expense of women,” she explained.'"}, "time": 1742628507.7887337}