{"duration": 0.09971857070922852, "input_args": {"text": "'By Joe Clark Videos October 28, 2016 Trump Calls Black Man At Rally A ‘Thug,’ Kicks Him Out – Except There’s One BIG Problem (VIDEO)   \\nOn Wednesday night during a rally in Kinston, North Carolina, Republican presidential candidate Donald Trump once again focused on his fabled “minority outreach” initiative by kicking another black man out from his “inclusive” rally. \\nTrump accused the man of being a protester, however, like most of his supporters, Trump’s perception of a person of color was way off base. \\nDuring the exchange, Trump points to an older black man in a red shirt who made his way about 30 feet from the stage while yelling out “Donald!” to get the nominee’s attention. Trump immediately pounces on the opportunity to show how tough he is to his rabid supporters. \\n“We have a protester!” he said . Trump then said this to Cary: “By the way, were you paid $1,500 to be a thug?” \\nAs the man was escorted out by Trump’s security team, the crowd erupted into chants of “Trump! Trump! Trump,” as the candidate bellowed “You can get him out. Get him out.” \\nC.J. Cary is a 63-year old former Marine who has been a Trump supporter ever since the billionaire replied to a 1992 letter Cary sent during Trump’s first divorce. \\nCary made his way to the rally on Wednesday to see his hero and deliver a personal message via note to the GOP candidate. The note contained a bit of advice for the nominee, basically telling him to stop saying offensive things about women, minorities, and people with disabilities on the campaign trail, otherwise “lying Hillary” will beat him in November. \\nHowever, the former Marine never had an opportunity to make it more than 30 feet from his favorite candidate before being stopped and unceremoniously thrown out of the venue by the candidate himself. \\nCary said he tried to explain his intentions to the security personnel. \\n“I said, ‘I was trying to get this doc to Mr. Donald … will you get this to Donald?’ ” Cary told the paper. “He said, ‘Well dude, we’d be happy to give it to him.’ ” Trump calls black supporter a \"thug,\" has him kicked out of a rally in North Carolina. https://t.co/b4gkI6qx9v pic.twitter.com/eJKuu0CLRi \\n— Jason Sparks (@sparksjls) October 28, 2016 \\nBut it seems that this incident hasn’t deterred Cary’s support for “Mr. Donald” who he described as “an honest person.” \\n“I support Trump because he’s honest,” Cary said . “You can work with an honest person and convince them their vision isn’t in the best interest of everyone. You can’t work with dishonest people. That’s why I don’t like Obama—the worst president in American history.” \\nSome people never learn. \\nFeatured image via YouTube and Twitter Share this Article!'"}, "time": 1742562965.8572323}