{"duration": 0.12955498695373535, "input_args": {"text": "'LONDON  —   A partial list of the onstage casualties amassed during a mere three days of theatergoing here: attempted suicides: four successful suicides: five accidental death by reckless use of a firearm: one death by natural causes, hastened by the cruelty of a spouse: one loss of trust in others: immense and incalculable happy endings: one, and that one highly suspect. Usually, when the skies are gray and this city’s mood is bleak  —   that’s status quo in 2016  —   a classic   (or  ) can be relied on to provide sentimental escapism for West End audiences. Not so in this summer of anxiety, when it feels as if every love story has a body count. The statistics cited above do not even include the latest version of the eternal            tale. “Romeo and Juliet” has been staged by the Kenneth Branagh Company with a paparazzo’s eye for “La Dolce Vita”  glamour and rue among the rich and famous. (That would raise the number of suicides to seven never mind the collateral murders.) Or Rufus Norris and Simon Stephens’s gleefully scurrilous reimagining of Brecht and Weill’s “The Threepenny Opera” at the National Theater, in which the crime lord Macheath (Rory Kinnear) is led straight to the gallows by his wayward, willful sexuality. (Murders and acts of torture: too many to itemize assault by rectal insertion of knife: one.) These grim numbers are instead gleaned entirely from five productions that I saw more or less   . They are Terence Rattigan’s “The Deep Blue Sea” at the National Theater, in which the wondrous Helen McCrory adds yet another memorable portrait to her gallery of devastatingly devastated women a     engrossing marathon of early Chekhov works (also at the National) an especially bruising “Midsummer Night’s Dream” at Shakespeare’s Globe and Simon Stone’s merciless and mesmerizing updating of Federico García Lorca’s “Yerma,” starring a fabulous Billie Piper. For audiences who like their sex on the silly side, a longstanding and popular preference in British theater, there are jauntier accounts of erotic mayhem. They include “The Truth,” by the French dramatist du jour, Florian Zeller (“The Father”) a precisely drawn and equally predictable romantic quadrangle at Wyndham’s Theater and around the block, at the Duke of York’s Theater, a spiffing revival of “How the Other Half Loves” (1969) Alan Ayckbourn’s ingenious,    bending portrait of overlapping marriages. Both these plays qualify as farces, albeit of a literate ilk. But it’s important to note their frantic plots are propelled by the increasingly improbable lies characters perpetrate in the name of adultery, forever contaminating their closest relationships. (The truth of Mr. Zeller’s title is what people do their best to conceal.) The laughter elicited here has a sting in its tail. If you believe that love is both comic and tragic, as do most sensible people who have lost their senses in its name, there’s no better place to start than the canon of Chekhov. The National’s     omnibus “Young Chekhov,” which originated at the Chichester Festival Theater, assesses the shifting   dichotomy in three early works by this greatest of modern playwrights: “Platonov,” “Ivanov” and “The Seagull. ” Directed by Jonathan Kent, from   translations by the British dramatist David Hare, these productions show how slapstick and   angst breathe the same romantic oxygen in Chekhov’s universe. It’s fascinating to watch that balance being further adjusted with each successive play and to see the multicast ensemble embody both sides of the tragicomic equation. (My favorite transformation is that of James McArdle from the hapless homme fatale Platonov into the puritanical doctor of “Ivanov. ”) Mr. Kent’s staging of the party scenes, with their clashes of classes and egos, is masterly. So is his sense of Chekhov as a social satirist, whose characters are closer to the quirky grotesques of Charles Dickens than we usually realize. Yet while I was always absorbed by “Young Chekhov,” I was seldom moved, partly because of the broadness of so much of the acting, especially in “The Seagull. ” There is one deeply affecting moment, though, that captures perfectly the pathos of a failing marriage. It comes in the first act of “Ivanov,” when Anna Petrovna (the exquisite Nina Sosanya) the ailing wife of the title character, tightly embraces her husband (Geoffrey Streatfeild) from behind. The sudden look of raw panic in Mr. Streatfeild’s eyes, and the desperate hope in Ms. Sosanya’s, say everything you need to know about why this relationship is doomed. The disjunction of love and reason is the frantic animator of “A Midsummer Night’s Dream” at Shakespeare’s Globe. This spirited but effortful interpretation is the inaugural offering of the Globe’s new artistic director, Emma Rice, best known for her blissful stage version of Noël Coward’s “Brief Encounter” (on Broadway in 2010). Ms. Rice has said that a large part of her mandate for the Globe is to make its productions more accessible and inclusive, in terms of gender and ethnicity. So this “Dream” features a mostly female (and delightful) troupe of amateur thespians for the play within the play a punkish epicene Puck (the Welsh actress Katy Owen) and a gay relationship among the central quartet of young lovers. (Helena is now Helenus, appealingly played by Ankur Bahl.) The production is replete with sight gags, slapstick, topical references (including winking nods to Ms. Rice’s nontraditional approach)   music and witty burlesque turns by the Australian cabaret performer Meow Meow as Titania. The goofy pageantry and high concepts can weigh down the humor, though, and you wish Ms. Rice had trusted more in the transporting buoyancy of the language. You can also sense this production’s distaste for the coercive erotic encounters brought about by fairy chemistry. (In an interview in the program, Ms. Rice says Titania’s infatuation with the   Bottom is the result of “a date rape drug. ”) In the double role of the mortal and fairy monarchs, Theseus and Oberon, Zubin Varla is polymorphously perverse and a bit of a brute. No wonder Theseus’s bride, Hippolyta (also Meow Meow) is seen chugging whiskey to get her through her wedding night. Love turns not just sour but deeply rancid in the blistering “Yerma” at the Young Vic, the hottest incubator of revitalized classics in London. Mr. Stone, an Australian director and dramatist, has transplanted Lorca’s poetic folk tale of a provincial Spanish woman’s yearning to have a child into the London of today. The central character is   Her, a successful journalist (Ms. Piper, of “Doctor Who” fame) who decides it’s time for her and her husband (the excellent Brendan Cowell) to have a baby. Their inability to conceive drives the woman into an escalating frenzy of despair that destroys her marriage. She chronicles this erosion in a blog. As befits a story of the 21st century, the lines between private grief and public exposure have blurred dizzyingly, a notion ingeniously underscored by Lizzie Clachan’s   box of a set, which intersects the audience. Those walls, by the way, are of little help in keeping us at an emotional remove. How could they be, given the extraordinary, painful transparency of Ms. Piper’s performance? In “The Deep Blue Sea,” Rattigan’s 1952 play about an eminent barrister’s wife who has left her husband for a young pilot, Ms. McCrory goes out on nearly as   a limb as Ms. Piper does. In Carrie Cracknell’s haunting production, Ms. McCrory conveys the ravening, cancerous feelings beneath the socially smooth, reflexively gracious surface of her character, Hester Collyer. Tom Scutt’s evocation of the shabby boardinghouse in which Hester now lives has   walls, so we’re always aware of the impinging lives of the other residents. As in the Young Vic’s “Yerma,” this “Deep Blue Sea” suggests how tortured,    relationships can become the stuff of voyeuristic speculation and gossip. That was true for the last character Ms. McCrory embodied at the National, Euripides’ Medea. And a simple dialogue Hester has with her estranged but still adoring husband (Peter Sullivan) captures the essence of romantic tragedies from the ancient Greeks onward. “What happened to you, Hester?” he asks. Her answer is prompt and abject: “Love, Bill, that’s all. ”'"}, "time": 1742563445.968453}