{"duration": 0.1126708984375, "input_args": {"text": "\"Syrian War Report – October 28, 2016: Militants Make Do-Or-Die Attempt to Break Aleppo Siege ‹ › South Front Analysis & Intelligence is a public analytical project maintained by an independent team of experts from the four corners of the Earth focusing on international relations issues and crises. They focus on analysis and intelligence of the ongoing crises and the biggest stories from around the world: Ukraine, the war in Middle East, Central Asia issues, protest movements in the Balkans, migration crises, and others. In addition, they provide military operations analysis, the military posture of major world powers, and other important data influencing the growth of tensions between countries and nations. We try to dig out the truth on issues which are barely covered by governments and mainstream media. What Does Washington ‘Plan B’ in Syria Really Mean? By South Front on October 29, 2016 …from SouthFront \\nIn October a series of reports appeared in The Washington Post and other US media about expected supplies of various modern weapon systems to the so-called ‘moderate opposition’ in Syria. The reports argued that Washington was considering the new plan for Syria that included massive supplies of weapons that had to allow the oppositioneers to defend themselves from the Russian and Syrian air power and artillery. This fact was described as an indication of Washnigton’s skepticism about the prospects of so-called ‘peaceful solution’ in the country. Nonetheless, it was neither approved nor denied, according to the media. \\nThe secret CIA program of training and arming ‘moderate terrorists’ has been the core of American strategy, aiming to overthrow Assad and set a puppet government in Syria, since the start of the war. Nonetheless, the Obama administration is likely set to postponed the resumption and expansion of this program and to pass the need to make a decision to next president. The US leadership is not ready to make the decision now because the recent military developments have shown that despite all money spending, supplies and CIA efforts, Washington still cannot rely on the moderate terrorists as a clearly pro-US force on the ground. Every US attempt to separate secular militant groups from jihadi factions, at least for PR needs, have failed. And the recently created New Syrian Army (NSyA) has shown an impotence in clashes with ISIS. The US propaganda campaign to discredit Russian-Syrian-Iranian operations to liberate Aleppo faced a significant problem – massive civilian casualties during the Mosul offensive, supported by the US-led coalition. \\nIn this case, open and massive supplies of arms and munitions to the terrorist groups in Syria could lead to significant loses for Washington in political and PR terms and will hardly lead to strengthening of the US influence on the Syrian conflict. If the US administration avoids to do this, Moscow, Damascus and Tehran will fully take the initiative in the war that would also lead to negative effects to the US influence in the Middle East. \\nSo, most likely, Washington will make a compromise decision to allow its regional allies – Saudi Arabia or Qatar – to supply limited numbers of man-portable air-defense systems to the so-called ‘opposition’, even if this opposition is al-Nusra Front. At the same time, the US-controlled media and diplomats will continue to put pressure on Syria, Russia and Iran over alleged civilian casualties in Aleppo city and ignore the humanitarian situation in Iraq. It will not allow the terrorists to re-take the initiative in the war but will buy time until the new US president comes into the office and start to impellent own strategy in the region. Related Posts: No Related Posts The views expressed herein are the views of the author exclusively and not necessarily the views of VT, VT authors, affiliates, advertisers, sponsors, partners, technicians, or the Veterans Today Network and its assigns. LEGAL NOTICE - COMMENT POLICY Posted by South Front on October 29, 2016, With 248 Reads Filed under World . You can follow any responses to this entry through the RSS 2.0 . You can skip to the end and leave a response. Pinging is currently not allowed. FaceBook Comments \\nYou must be logged in to post a comment Login WHAT'S HOT\""}, "time": 1742561683.5100298}