{"duration": 0.08371567726135254, "input_args": {"text": "'7 Ways To Relieve Post-Election Stress Disorder Nov 9, 2016 0 0 \\nWith the 2016 U.S. Presidential Election now at an end and with emotions running rampant throughout social media and throughout the world, post-election stress disorder is becoming a serious issue that many will need to address in the coming days and weeks. \\nTo begin, post-election stress disorder is an actual medically-established disorder, which Dr. Asim Shah is not well known, but is a serious issue. Dr. Shah is the vice chair for community psychiatry at the Baylor College of Medicine in Houston, Texas and says that symptoms of the disorder include sweaty palms, shortness of breath, heart palpitations, loss of appetite and trouble sleeping. Post-election stress disorder can cause a great deal of stress. \\nHow We Can Deal With The Stress \\nWhether you feel you actually suffer from post-election stress disorder or are just in general stressed out over the election period, there are some simple ways to deal with the stress in a healthy way. Go for a walk : Spiritual teacher Thich Nhat Hanh says that the best way to deal with strong emotions is to go for a walk and to walk until you are physically tired and you are emotionally calm again. Getting fresh air, sunlight and oxygen flowing through your veins and into your brain is an excellent way to help you regain control over your emotions and to relieve pent up stress. Use essential oils: When we smell essential oils, the molecules of the oil travel to the limbic system of our brain through the olfactory senses. The limbic system is the part of the brain that controls emotions, memory, blood pressure and stress hormone release. If you are stressed, cope with your stress in this healthy way by smelling and or applying essential oils. Good oils for relaxing are lavender, rose and geranium. Take Media Breaks: Take some time away from all forms of media, including social media. Reflect on the things that are important to you and refocus your energy on your dreams and wishes for you life. Essential oils can dramatically help improve emotional states of mind. Keep things in perspective: We live on a tiny blue planet traveling throughout the universe at incredible speeds with a neighboring star (the Sun) who gives us the opportunity for life each and every day. For the most part, things are okay. Reclaim personal sovereignty: We each have the choice as to how we react to situations in our life. One situation that might be viewed as troubling for one person can be viewed as peace for another. How can you shift your thoughts around situations to see the positive in it? Will this election not motivate even more people to be better people? Will it not catalyze more action from people around the world to create changes they wish to see? Deep breathing: Though it is simple, it is profound in helping to release emotions and deal with stress in a healthy and effective way. Breath slowly in for a couple seconds and breath out for a couple seconds. Oxygenating the brain helps to shift our emotions in a positive direction. Herbs: Instead of using alcohol or mind-numbing pharmaceuticals, look into the benefits of herbs like Passionflower, California Poppy, Lemon Balm, Rhodiola, Kava Kava and Chamomile. \\nWe are all learning and processing a lot of information right now as the election period has come to an end. Take care of yourself and deal with any stress in healthy ways. What are other healthy ways you are dealing with election stress or stress in general? \\nLance Schuttler graduated from the University of Iowa with a degree in Health Science and practices health coaching through his website Orgonlight Health . You can follow the Orgonlight Health facebook page or visit the website for more information on how to receive health coaching for yourself, a family member or a friend as well as view other inspiring articles.'"}, "time": 1742563149.0407124}