{"duration": 0.09364199638366699, "input_args": {"text": "'Home | Sci/Tech | When They Switch the Chip On You Won’t Know Who You Are Anymore When They Switch the Chip On You Won’t Know Who You Are Anymore By Dr. Kane Targonen 15/11/2016 18:20:20 \\nLOS ALAMOS – USA – The immersive qualities of Virtual Reality are only just being rolled out right now, but in a few years every household will have multiple head sets, eventually progressing to mind chips. \\n\\nPeople who have these VR sets are already completely addicted to the sensation of total immersion within another world, and this is the clincher, soon they will not be able to live without their VR headsets. \\nThe natural progression from an external device, like a pair of goggles is to have a chip implanted into the brain directly which will link up with the synapses and billions of dendrites. These chips are already in use for the severely disabled, however their development is accelerating daily. \\nMapping out every channel and synapse in the human brain is a feat in itself, and they have already mapped out the brains of rodents and smaller creatures. \\n“We can upload any scenario directly into your brain, you will feel as if you are there, you will see, smell, and feel every nuance the programmers introduce into the world, you will taste food, you will feel the wind on your cheek, every sensation you feel in the real world can be replicated in the brain directly through the zones activated by the neural implants. \\n“This technology will be sold through the premise of perfect memory and data recall. Imagine going to a dinner party and knowing who the head honchos are to schmooze with immediate data downloaded into your brain, imagine being able to speak in any language at the drop of a hat, or recall any text ever written by man at the blink of an eye,” a scientist on the project revealed. \\nThe next step will no doubt be a jump from the intrusive machinery strapped on to our bodies to the discreet internal implants, and of course with every leap forwards there is always a leap backwards in freedom. You will essentially allow an external force into your own mind. \\nBehaviour modification \\n“We have apps now for everything, and in the future, you want to fly that Huey, just download the app in thirty seconds and you will be an expert pilot. Yes, it sounds very Matrix, but consider the fact that every six months, the power of computers doubles. We are getting very close now to a point of no return, and the processing power in chips is getting more powerful, yet shrinking in size. We will be able to alter every facet of someone’s behaviour. After the chipping process, you will not be recognisable. \\n“This is not one way traffic, and advertisers will be able to beam adverts directly into your brain. If you do not comply with whichever regime or government is in charge, they can not only shut you down, but implant nightmares into your own brain to torture you for your crimes. We can see prisoners in jail, who will be put into states of mind torture lasting thousands of years , this is accomplished by speeding their mind clock to the desired level. Prisoners could therefore spend thousands of years breaking rocks with no end in sight, all in their own minds,” the scientist added. \\nOnce they’re in your head, that’s it. \\nThe future will certainly be an interesting place but with the introduction of artificial intelligent systems, sentient machinery and brainchipping, there may be no place for humans to go other than the augmented fashion. Employers will require their staff to be chipped, and all transactions will require biometric approval. Therefore, if you wish to be employed, and eat, you need the chip. Share on :'"}, "time": 1742561723.2775452}