{"duration": 0.2044978141784668, "input_args": {"text": "'Read Friday’s Storm Watch for the latest updates on Hurricane Matthew. Taking aim at Central Florida’s Atlantic coast, Hurricane Matthew intensified Thursday into a Category 4 storm with winds of at least 140 miles per hour and strengthening. The storm was blamed for the deaths of more than 280 people in Haiti. “Extremely dangerous,   weather conditions are forecast in the next 24 hours,” the National Weather Service warned Thursday afternoon. “Airborne debris lofted by extreme winds will be capable of breaching structures, unprotected windows and vehicles. ” Residents were streaming away from coastal regions, jamming highways, after Gov. Rick Scott of Florida told 1. 5 million people living in evacuation zones: “You need to leave. Evacuate, evacuate, evacuate. ” Developments dispatches from our reporters in Florida, Georgia and South Carolina a live storm tracker map and answers to reader questions will be updated below. ■ Some forecast models suggested late Thursday that the storm had moved slightly eastward, raising hopes that Florida would be spared a direct strike. ■ The eye of the hurricane was about 125 miles southeast of Cape Canaveral, Fla. as of 11 p. m. on Thursday, moving northwest at 13 m. p. h. as it churned away from the Bahamas. The eye was projected to pass near Cape Canaveral at about 8 a. m. Friday, and to pass close to Jacksonville about 12 hours later. ■ President Obama declared a state of emergency in Florida and South Carolina on Thursday, allowing the Department of Homeland Security and the Federal Emergency Management Agency to coordinate relief efforts. ■ Mr. Scott activated 3, 500 National Guard troops to help with evacuations and prepare for    operations. ■The Miami Herald published a series of storm preparation checklists. • To cover the storm and its aftermath, The New York Times has deployed journalists in Miami Orlando, Fla. Port St. Lucie, Fla. Titusville, Fla. Jacksonville, Fla. Atlanta and Charleston, S. C. Follow our correspondents on Twitter. Florida’s governor pleaded with people on Thursday to evacuate from the state’s east coast as Hurricane Matthew threatened to roar past as a Category 4 storm. “There are no excuses,” Mr. Scott said in Tallahassee, the state capital. “You need to leave. Evacuate, evacuate, evacuate. ” Mr. Scott, who has spent days warning that the storm could be catastrophic in a state that has not had a major hurricane make landfall since 2005, added: “This storm will kill you. Time is running out. ” Evacuations were underway all along the state’s eastern coast.   wind was expected to arrive by Thursday night, the National Hurricane Center said. The governor’s office said that more than 1. 5 million people were in evacuation zones, and that tolls had been suspended on the Florida Turnpike and other crucial routes. The Coast Guard closed major ports, including facilities in Fort Pierce, Miami and Palm Beach.  —   LIZETTE ALVAREZ in Miami and ALAN BLINDER in Atlanta Lizette Alvarez, a Times reporter, recalled her night in Florida City, Fla. in 1992 when Hurricane Andrew destroyed most of the motel she was staying in. Read more» NASA is preparing for what could be a disaster for the Kennedy Space Center. The last hurricanes to strike the facility where most of the nation’s spacecraft are assembled and launched hit in 2004, and were much weaker. Hurricane Matthew is expected to hit the space center on Friday, with sustained wind of 125 m. p. h. with gusts up to 150, and so it could cause far greater damage to the facilities than occurred in 2004. NASA closed the space center on Wednesday, and “essential personnel” prepared for the storm by checking the space center for loose debris. There’s a very valuable satellite that’s waiting for launch in a month: the   a   weather satellite for the National Oceanic and Atmospheric Administration that was designed to improve, among other things, our tracking and intensity measurement of hurricanes. A NOAA posting on Reddit by the system program director for   satellites, said that it was being held in a building in Titusville that can withstand a Category 4 hurricane. The space center, whose launchpads sit less than a mile from the beach, has been dealing with the threat of climate change for a number of years, and has had to fight beach erosion caused in part by Hurricane Sandy in 2012. Why, then, put vital space infrastructure in such a vulnerable place? Much of the reason has to do with physics: launching rockets from a site relatively close to the Equator gives a speed boost into orbit.  —   JOHN SCHWARTZ in New York The Haitian government on Thursday said more than 280 people were now dead from the effects of Hurricane Matthew, drastically revising earlier estimates as more of the affected areas are reached by aid personnel, according to local reports. Now that transportation and at least some communication to the areas have been restored, the death toll appears to be rising drastically, according to a news conference held by the Ministry of Interior on Thursday morning. The deaths come amid a broad tableau of devastation: houses pummeled into timber, crops destroyed and large parts of towns and villages under several feet of water.  —   AZAM AHMED in Miami If they tell you to get out  —   get out. Water rises swiftly and is more powerful than most people could imagine. And put your valuables in the fridge. What one New York Times editor learned four years ago during Hurricane Sandy. Read more» People who live near the coast or in mobile homes or who just did not want to test their luck at home lugged suitcases, cases of water and clutched their favorite pillows as their minds drifted to what they left behind. Lois Paul, 78, was one of 130 people at an elementary school in Brevard County, Fla. that was being used as a shelter on Thursday. “My house is blue I call it ‘my blue heaven,’” Mrs. Paul said. “This one can blow your house away. ” Mrs. Paul brought patio cushions to sleep on, sheets, pillows, an extra set of clothes and a windbreaker. She has done this three times before, during Charley, Frances and Jeanne in 2004. “I’m afraid for my home,” she said. “The worst part is not knowing what’s going on there while you’re away. You just don’t know what you’re going to find when you get home. ”  —   FRANCES ROBLES in Titusville, Fla. They were boarding up the windows of the graceful   city hall in Charleston on Thursday. Boarding up the Confederate Museum. Boarding up luxury hotels and graceful antebellum homes and businesses from the high end to the low. On Queen Street, a few blocks from the waterfront, Lese Corrigan, 59, was busy boarding up her art gallery. With red paint and a fat brush, she painted a paean to the hurricane aesthetic that has transformed the Charleston peninsula for now: “NATURE ART MAKES,” she wrote over the plywood. The adjacent storefront, also an art gallery, had just been boarded up by Nelson and Mary Ohl. Ms. Ohl, 52, a Charleston native, marveled that so many thousands of people had already evacuated. There were a few stragglers, but mostly the city was quiet and still. Ms. Corrigan had a theory. This country, she said, has been overcome lately by all kinds of   events that people cannot control: attacks by terrorist sympathizers, a rash of controversial police shootings, a turbulent political season. Leaving town, she said, was a way for people to take charge of something. “This is an anxiety you can do something about,” she said.  —   RICHARD FAUSSET in Charleston, S. C. The effect of the storm is being felt on the presidential campaign, too. A joint appearance by Hillary Clinton and President Obama planned for Wednesday in Miami Gardens, Fla. was postponed. The Trump campaign was also affected: The Miami Herald reported that Ivanka Trump scrapped a   Wednesday night at Trump National Doral golf resort. The hurricane could steal attention away from the campaign if it causes extensive damage. The Clinton campaign was preparing for that possibility, investing in advertising on the Weather Channel in markets across Florida, according to Politico.  —   ALAN RAPPEPORT in Washington John Schwartz, a New York Times reporter who covers climate change and the environment, is answering reader questions about the storm. He rode out his first hurricane, Carla, in his hometown, Galveston, Tex. at age 4. He has covered the aftermath of Hurricane Katrina, as well as other storms for The Times.  Ask your hurricane questions here. What is the relationship between Hurricane Matthew and climate change? How important is it for the news media to depict and discuss this?  —   Cynthia Young Cynthia, this is one of the great questions of our age  —   not just establishing the role of climate change on extreme weather events, but also in stating clearly what we know and do not know. Short answer: It is difficult to attribute a particular storm to climate change, especially in the middle of the action. But climate scientists are working at quick attribution, and that science is developing. After interviewing Gabriel A. Vecchi, a climate researcher, I put it this way in an article a few weeks ago: Kerry A. Emanuel, a climate scientist at the Massachusetts Institute of Technology, said the evidence suggested climate change would cause the strongest storms to grow even stronger, and to be more frequent. Unresolved questions surround the effect of warming on the weaker storms, but even those will dump more rain, leading over time to increased damage from flooding. Read more» Two veteran journalists discuss the challenges inherent in covering hurricanes. Read more»'"}, "time": 1742563204.6636894}