{"duration": 0.10567855834960938, "input_args": {"text": "'To Donald Trump, everything is negotiable, even getting old. At 70  —   about 16 months older than Hillary Clinton  —   he would be the oldest person ever to step into the presidency, a fact he’s determined to talk his way around. “Here’s a woman  —   she’s supposed to fight all of these different things, and she can’t make it 15 feet to her car,” he told supporters at a recent rally in Pennsylvania. “She’s home resting right now. ” He slackened his jaw and feigned stumbling across the stage, a dramatic   of the video that showed Clinton nearly collapsing from pneumonia in September. “Folks,” Trump announced, “we need stamina. ” Vim and vigor have always featured prominently in Trump’s  . In his 2009 book “Think Like a Champion,” he called “positive stamina” a “necessary ingredient for success. ” His Twitter feed is, accordingly, a constant   zone: He has rated the vitality not only of Clinton (“zero imagination and even less stamina”) but also of Joan Rivers (“truly amazing stamina”) the world’s “many losers and haters” (“never have the brains or stamina to become truly successful”) and, of course, himself (“one of my greatest assets”). During the first presidential debate, he attacked Clinton’s stamina in four consecutive sentences: “She doesn’t have the stamina. I said she doesn’t have the stamina. And I don’t believe she does have the stamina. To be president of this country, you need tremendous stamina. ” Over the course of his career, Trump has amassed a vast verbal arsenal to wield against women  —   pig, dog, slob, bimbo, disgusting, neurotic, ugly  —   but when it comes to Clinton, it’s all stamina, stamina, stamina. The word implies everything Trump has been told he’s no longer allowed to say outright. It strikes a glancing blow at Clinton’s sex without his ever having to call her an old lady. Growing older, Susan Sontag wrote, in a 1972 essay called “The Double Standard of Aging,” is “much more a social judgment than a biological eventuality”  —   an “ordeal of the imagination” that “afflicts women much more than men. ” This is precisely what “stamina” pokes at: an American subconscious that stereotypes older women as sick, weak, unattractive and useless. It’s a nominally civil version of the sexist internet memes that cast Clinton as “America’s nasty  ” and a   nod to   conspiracy theories that place her on the precipice of death. For his own part, Trump presents himself as ageless  —   a bit older than Clinton, but only in man years, which don’t really count. He told the TV doctor Mehmet Oz that he looks in the mirror and sees “a person who is 35 years old,” like a   villain with a charmed looking glass. He gets his exercise, he said, by gesticulating at rallies. The bizarre doctor’s note he released concluded that he’d be the “healthiest individual ever elected to the presidency,” then added, “His physical strength and stamina are extraordinary. ” His wives get younger with every marriage  —   the third, Melania, is 24 years his junior  —   and their youth, Trump says, only makes him more powerful. “You know,” he told Esquire in 1991, “it doesn’t really matter what they write as long as you’ve got a young and beautiful piece of ass. ” Stamina is a guy thing, and guys know it. In September, when   polled likely voters on which candidate “has the stamina to be president,” it was responses from men that put Trump on top. Stamina is a sex thing too. (Just ask the adult film actor Simon Stamina.) The word shares a Latin root with “stamen,” the long,   organ that protrudes from a flower. On some deep, etymological level, Trump seems to be accusing Hillary of not having a penis. “Stamina” may have a masculine sheen, but its underlying claim  —   superior mental and physical endurance  —   has long been associated with women. As the   poet Giovanni Boccaccio wrote: “Right so can women suffer   And all wrongs womanly endure. ” In Christian theology, women aren’t typically seen as leaders, but they appear frequently as martyrs. In sports, they’re dismissed as physically inferior  —   except in extreme endurance contests, where they’re catching up to and sometimes beating men. (Think of Diana Nyad, who became the first person to swim from Cuba to Florida, at 64.) Childbirth is a saga. And in the ultimate endurance contest  —   life  —   women survive longer than men. Despite all the stigmas applied to aging women, the transition of menopause imparts its own strange cultural power. In 2006, Sharon Stone shared a theory about presidential politics: “A woman should be past her sexuality when she runs,” she said. “Hillary still has sexual power, and I don’t think people will accept that. ” Last year, in Time magazine, Dr. Julie Holland, the author of a guide to emotional wellness called “Moody Bitches,” argued that Clinton’s body was newly primed to reach its full political potential. During perimenopause, she wrote, estrogen levels go through spikes and crashes, “but afterward, there is a hormonal ebbing that creates a moment of great possibility,” meaning that “postmenopausal women are ideal candidates for leadership. ” If the double standard of aging is, as Sontag had it, a work of cultural “imagination,” then this   approach to menopause offers an alternative fantasy, one in which women gain strength with age. Clinton stoked all of these associations when she swiped back at Trump during the first presidential debate: “As soon as he travels to 112 countries and negotiates a peace deal, a   a release of dissidents, an opening of new opportunities in nations around the world, or even spends 11 hours testifying in front of a congressional committee, he can talk to me about stamina,” she said. To many observers, it was Trump who couldn’t seem to get through a   debate without losing steam  —   and it’s no coincidence that he has intensified his attack on Clinton’s stamina as his own has come into question. Men have always had complicated feelings about women’s capacity for suffering, a mix of admiration at the fulfillment of the feminine role and anxiousness at the special power it affords. Men have made women suffer, then envied how well they’ve managed it. So even as women have been valorized for their endurance, structures have emerged to rein it in. In 1852, Ohio passed a law limiting the work day to 10 hours  —   but only for women and children. By 1917, all but nine states passed similar laws. “Women are fundamentally weaker than men in all that makes for endurance: in muscular strength, in nervous energy, in the powers of persistent attention and application,” Louis Brandeis argued in front of the Supreme Court in 1908. He framed women as not only physically but somehow metaphysically incapable of working like men: Their “special physical organization,” he claimed, meant excessive work could engender a “laxity of moral fibre. ” All this paternalistic concern helped alleviate a deeper fear: If women were barred from working long hours like men, they couldn’t take men’s jobs. The laws, predictably, did not apply to domestic service. Women who compete in male territory have always had to prove themselves to be twice as good. In the face of these hypercompetent, superqualified women, who have surmounted every barrier set before them, the sexist backlash has been forced to retreat, regroup and adapt. Sure, women can perform like men, this critique says now. But maybe they can keep up the act for only so long. Maybe they can rise to a certain level, and no further. The House? Sure. The Senate? O. K. Secretary of State? I guess. But the presidency?'"}, "time": 1742628408.8504455}