{"duration": 0.0930178165435791, "input_args": {"text": "'Recently, I went a whole month without seeing a play. Five weeks, actually. For most people, this is a profound nonevent. For me, it was a marvel. And also sort of a problem. I was a   adolescent who became a college actress who became a theater critic. I don’t really know what to do with myself if I’m not spending a lot of my week sitting in a creaking plush seat, staring up at a stage. You could call this a vocation. You could also call it an addiction. You’d be right. Why the hiatus? My son was born in late June it seemed wise to take some time off. Still, I jokingly told an editor that I’d tried to schedule my delivery for a slow point in the season. This may not have been a joke. I likewise sent an email to a publicist, teasingly proposing theater matinees for nursing mothers. Also not entirely a joke. My leave has baffled my toddler daughter, who’s used to waving me away an hour or two before her bedtime. “Mama, don’t you go to shows anymore?” she asked. Even my husband seems a little surprised to see me sitting across from him at dinner. It feels strange to me, too. Luckily, it’s never been easier to enjoy theater without actually going to the theater. I can stream David Tennant’s “Hamlet” online while I nurse, or play the “Hamilton” cast album while I rock the baby to sleep. I can download audiobooks of plays to hear while I’m pumping, or listen to radio drama podcasts like “The Message” or “Welcome to Night Vale” while pushing the stroller. I can go to the library and take out stacks of scripts, including the   “Harry Potter and the Cursed Child,” which I read   cuddling the baby with the other. He and I might even slip into a movie theater for an encore presentation of a broadcast of “The Audience” or “A View From the Bridge. ” (In truth, I’ve done all of these things, except for sneaking the baby into the cinema, though that day may come. And yes, I’m aware that this is a weird and possibly even mildly pathological way to spend a maternity leave, but once I’d caught up on “UnReal” and read “The Girls” and a bunch of Lew Archer mysteries, I started to feel a little restless.) These are good options. For one thing, they’re democratizing. Theater is inherently local. It is also often expensive. DVDs and live streams make an experience that was once available to only a few accessible to many, a phenomenon that would have made my preteen self, who used to obsessively play cassettes of original cast recordings of shows I would never see, weep for joy. And they’re a mental workout. Scripts and podcasts excite the imagination even more than live theater, forcing us to picture the characters, the settings, the actions and the gestures. (Which is salutary for those experiencing the synaptic haze of “mommy brain. ”) But as grateful as I am for PBS’s “Great Performances,” Methuen collections of Caryl Churchill, YouTube clips of “Chess” (which I can sing, enthusiastically and off key, overture to finale) none of it feels really, properly like theater. What’s missing, of course, is the sense of liveness, the thrill of the present tense. Theater is the art form most like life. Sure, the dialogue is snazzier, and the clothes fit better, but it’s performed by real people, in real space, in real time. A video, however   can’t substitute for that. Theater presents a laboratory for human life that obliges me think about my own  —   my marriage, my family, my ways of moving through the world. It’s why a good play feels meditative, even therapeutic. (I’ll confess that after a breakup, I once wept my way through a Broadway production of “Private Lives” and felt a lot better afterward.) I learn about my life by slipping, mimetically, into others’ as they walk and chat in front of me. And I don’t have to meditate alone. Plays ask us to come together to engage with people and relationships presented just a few feet away  —   farther, if you have a balcony seat  —   while still allowing us the privacy that darkness confers. It offers community and anonymity at once. Additionally, a script or a streaming site won’t provide theater’s ephemerality, the sensation that each performance will never recur in exactly the same way. Perhaps this isn’t always meaningfully true. Plenty of productions alter little from one night to the next. But every show depends on the audience assembled. By simply bunching together in the dark, each of us contributes to the event each of us creates it. My    daughter wouldn’t articulate it that way, but I’ve seen her experience it. She loves moments when she’s asked to clap or shout along. My husband and I took her to her first show, Soho Rep’s antic,   kiddie play, “Washeteria,” when she was a year and a half, and she still remembers how the performers reached into the crowd and gave high fives. It’s that scene that’s stuck with her, even as she’s forgotten everything else about the play. As a relatively   adult, I obviously have a somewhat more fraught relationship with audience participation, but on the right night, I can still feel some of her wonder. The opportunity for reflection, the evanescence, the liveness  —   they go a long way toward explaining why, even though I’m usually at the theater four or five nights a week for work, I still sometimes see plays for fun. It’s why I’ve tried to find a performance of some sort on almost every vacation my husband and I have taken. It’s why three or four weeks after my son was born, I started looking up outdoor Shakespeare offerings, searching for something we could see together, with exits all around in case he fussed. It’s why, a few nights ago, my mother and I settled him into an infant car seat, and we all rode through Brooklyn, from Park Slope to a park in Bushwick, which was hosting an evening performance of Dave Malloy’s theatrical song cycle “Ghost Quartet. ” The park didn’t feel much like a theater. It was breezy there and still warm, with flocks of pigeons wheeling overhead, and hot dog and ice cream carts lining the paths. I was relieved to see that other parents had taken babies. I counted a handful of older children, too. (“Ghost Quartet” is wonderfully creepy I hope they didn’t have nightmares.) When the lights turned on, and the show began, I rocked my son from side to side in time to the music. He shut his eyes and nestled against my chest, while I looked up at the makeshift stage, home in the world again.'"}, "time": 1742562340.363848}