{"duration": 0.06349730491638184, "input_args": {"text": "'\\n\\nWe have compiled a huge list of voter fraud incidents which were caught in the early voting process, all of it done by Hillary Clinton’s supporters against Republican candidate Donald Trump.\\nSo far there hasn’t been a single case where Republicans were caught doing voter fraud for Donald Trump.\\nRemember the following list is a compilation of CAUGHT cases. Imagine how many more there might be out there uncaught.\\nNEVADA \\n– CAUGHT ON VIDEO Hillary Supporters Commit Voter Fraud in Las Vegas — Again!\\nINDIANA \\n– More Crooked Democrats : Police Raid Offices of Indiana Voter Registration Project in Voter Fraud Case\\nNORTH CAROLINA \\n-North Carolina Hillary Supporter Brags on Facebook About Voting Multiple Times\\nPENNSYLVANIA \\n– BREAKING: PA STATE POLICE RAID Democrat Group For Evidence Of Voter Fraud\\nFLORIDA \\n– GOP Alleges VOTER FRAUD in Broward County – Democrats Opened TENS OF THOUSANDS of Ballots\\nTEXAS \\n-Texas Woman – Who Is Not a US Citizen – BUSTED for Voting 5 Times in Texas \\nCALIFORNIA \\n– Voter Fraud: 83 Ballots , With 83 Different Names, Sent to One Address in LA County\\nNATIONWIDE \\n– Election “results” have already been shown in advance, in error, on multiple major news outlets such as CBS, CNN, FOX, NBC, ABC.\\n– Third-party Voters Are “Trading Votes” With Clinton Voters To Defeat Trump\\n– Democrats are suing Roger Stone on bogus charges of “voter intimidation” for only wanting to conduct AFTER -voting exit polling! Exit polling is not only legal but its something done in all civilized countries in the world. Democrats want to steal and prevent anyone from exposing their thievery. Exit polling provides perfectly accurate results and if in some state GOP gets for example 55% in exit polls and then 40% or whatever in final results, then we know there was fraud involved in that state. The usual accepted error between actual final results and exit polling can’t be bigger than 2%.\\n'"}, "time": 1742628355.6291122}