{"duration": 0.08885931968688965, "input_args": {"text": "'By Sarah Jones on Fri, Oct 28th, 2016 at 11:05 pm Matthew Miller, self described \"Recovering flack from DOJ, DSCC\", schooled Republican FBI Director James Comey for violating his power and lambasted him for commenting on a case within 60 days of an election. Share on Twitter Print This Post \\nFormer DOJ spokesman for Eric Holder Matthew Miller, a self described “recovering flack from DOJ, DSCC”, schooled Republican FBI Director James Comey for violating his power and lambasted him for commenting on a case within 60 days of an election. \\n“The department and the FBI have very strict rules about when they can comment on ongoing cases and Director Comey has violated those rules going back to his original press conference when he closed the case,” Miller said on CNN. “But this latest example violates a long standing practice which is that the department goes out of its way not to do anything that can be seen as trying to influence an election in the closing days of an election, and usually they interpret the closing days to be seen as the last 60 days let alone the last 11 days.” \\nWatch here: \\nMiller also held school on Twitter about Comey’s abuse of power, which has led to Hillary Clinton having to defend against a negative: I wrote a piece in July on why Comey\\'s public comments about Clinton were such an inappropriate abuse of power. 1/ https://t.co/G8croz4qWZ \\n— Matthew Miller (@matthewamiller) October 28, 2016 He flagrantly violated DOJ rules with his press conference. Then went on to break new ground discussing details of the case to Congress…2/ \\n— Matthew Miller (@matthewamiller) October 28, 2016 Followed by quickly releasing FBI 302\\'s, something they rarely do, and which I doubt they will do for future high-profile cases. 3/ \\n— Matthew Miller (@matthewamiller) October 28, 2016 Each time, he either violated or seriously stretched DOJ rule & precedent. Press conference was the original sin, & it begat the rest. 4/ \\n— Matthew Miller (@matthewamiller) October 28, 2016 But today\\'s disclosure might be worst abuse yet. DOJ goes out of its way to avoid publicly discussing investigations close to election. 5/ \\n— Matthew Miller (@matthewamiller) October 28, 2016 Not just public discussion either. Often won\\'t send subpoenas or take other steps that might leak until after an election is over…6/ \\n— Matthew Miller (@matthewamiller) October 28, 2016 Why? Because voters have no way to interpret FBI/DOJ activity in a neutral way. Who is the target of an investigation? What conduct? 7/ \\n— Matthew Miller (@matthewamiller) October 28, 2016 This might be totally benign & not even involve Clinton. But no way for press or voters to know that. Easy for opponent to make hay over. 8/ \\n— Matthew Miller (@matthewamiller) October 28, 2016 Which takes us back to the original rule: you don\\'t comment on ongoing investigations. Then multiply that times ten close to an election. 9/ \\n— Matthew Miller (@matthewamiller) October 28, 2016 For whatever reason (& there are many theories), Comey continues to ignore that. But only for Clinton. 10/ \\n— Matthew Miller (@matthewamiller) October 28, 2016 FBI is undoubtedly investigating links between the Russian hack, Manafort, & the Trump campaign. But aren\\'t commenting on it. Good! 11/ \\n— Matthew Miller (@matthewamiller) October 28, 2016 \\nMiller points out, “This just smells worse and worse the more we learn”, linking to this: Emails \"were not to or from Clinton\" and appeared like info FBI already had. WTF??? https://t.co/YS6jWfwGzi \\n— Ken Gude (@KenGude) October 29, 2016 \\nThe problem with Comey’s actions isn’t that he is investigating Hillary Clinton; the problem is he is violating long standing rules that prohibit federal employees from doing anything that could be seen as political near an election. It is an established rule that ongoing investigations aren’t commented on for obvious reasons. \\nThis is quite simply not done. Comey’s reasons for doing this are unclear, and perhaps when he provides more information his decision will make more sense. But it’s troubling that we are seeing such a consistent breakdown of tradition and rules/agreements of law surrounding the Trump campaign, which seems to have lowered the bar all around. \\nFBI Director James Comey Schooled by Former DOJ Spokesman for Abusing His Power added by Sarah Jones on Fri, Oct 28th, 2016'"}, "time": 1742563232.2372196}