{"duration": 0.03913998603820801, "input_args": {"text": "'By Sarah Jones on Sun, Oct 30th, 2016 at 8:59 pm Senator Harry Reid dropped the bomb that the FBI and national security experts possess \"explosive information\" about ties and coordination between Russia and Donald Trump and his campaign. Share on Twitter Print This Post \\nTalk about burying the lede. \\nIn Senator Harry Reid’s letter in which he suggests that FBI Director James Comey may have broken the law (the Hatch Law), he also drops the bomb that the FBI and national security experts possess “explosive information” about ties and coordination between Russia and Donald Trump and his campaign. \\nReid writes, “In my communications with you and other top officials in the national security community, it has become clear that you possess explosive information about close ties and coordination between Donald Trump, his top advisors, and the Russian government – a foreign interest openly hostile to the United States, which Trump praises at every opportunity.” \\nReid points out the “disturbing double standard” in Comey’s treatment of sensitive information between the two parties with a “clear intent” to aid one over the other. \\nIf the FBI and national security experts have information that Donald Trump and or his campaign are colluding or collaborating to bring about a particular result regarding the U.S. election or our foreign policy stances, this is an emergency. \\nWhich issue is so much of an emergency that a federal official might consider dropping the bomb just 11 days before an election: Electing someone who is conspiring with Russia or electing someone whose aide may have sent an email she forget to tell everyone about. \\nThe double standard is not only troubling at this point, but dangerous. \\nBomb dropped. \\nEveryone already suspected Trump’s ties to Russia and his campaign has been full of ties to the Kremlin, but now Reid has confirmed information about coordination between Trump and Russia. \\nNow that, ladies and gentlemen, is an October shocker. \\nReid’s full letter follows: \\nDear Director Comey: \\nYour actions in recent months have demonstrated a disturbing double standard for the treatment of sensitive information, with what appears to be a clear intent to aid one political party over another. I am writing to inform you that my office has determined that these actions may violate the Hatch Act, which bars FBI officials from using their official authority to influence an election. Through your partisan actions, you may have broken the law. \\nThe double standard established by your actions is clear. \\nIn my communications with you and other top officials in the national security community, it has become clear that you possess explosive information about close ties and coordination between Donald Trump, his top advisors, and the Russian government – a foreign interest openly hostile to the United States, which Trump praises at every opportunity. The public has a right to know this information. I wrote to you months ago calling for this information to be released to the public. There is no danger to American interests from releasing it. And yet, you continue to resist calls to inform the public of this critical information. \\nBy contrast, as soon as you came into possession of the slightest innuendo related to Secretary Clinton, you rushed to publicize it in the most negative light possible. \\nMoreover, in tarring Secretary Clinton with thin innuendo, you overruled longstanding tradition and the explicit guidance of your own Department. You rushed to take this step eleven days before a presidential election, despite the fact that for all you know, the information you possess could be entirely duplicative of the information you already examined which exonerated Secretary Clinton. \\nAs you know, a memo authored by Deputy Attorney General Sally Yates on March 10, 2016, makes clear that all Justice Department employees, including you, are subject to the Hatch Act. The memo defines the political activity prohibited under the Hatch Act as “activity directed towards the success or failure of a political party, candidate for partisan political office, or partisan political group.” \\nThe clear double-standard established by your actions strongly suggests that your highly selective approach to publicizing information, along with your timing, was intended for the success or failure of a partisan candidate or political group. \\nPlease keep in mind that I have been a supporter of yours in the past. When Republicans filibustered your nomination and delayed your confirmation longer than any previous nominee to your position, I led the fight to get you confirmed because I believed you to be a principled public servant. \\nWith the deepest regret, I now see that I was wrong. \\nSincerely, \\nSenator Harry Reid'"}, "time": 1742628501.0969043}