{"duration": 0.09474539756774902, "input_args": {"text": "'Email \\nLet\\'s talk sense about the election. Nothing is to be gained by refusing to face the hard facts. What are those facts? \\nFirst of all, neither Hillary Clinton nor Donald Trump has the qualifications, the track record or the personal character to be President of the United States. \\nMost of us could probably think of a number of people who would be better in the White House. But here, as elsewhere in life, we can only make our choices among the alternatives actually available. \\nThose of us who have been disgusted by some of the things that Donald Trump has said and done need to face the fact that he is not running against Mother Teresa. His sins have been matched and exceeded by Hillary Clinton and her husband. \\nAs for accomplishments, Trump has none in politics, and business accomplishments do not automatically transfer into government. \\nHillary Clinton has been in politics for decades. But does she have even a single serious accomplishment to show for it? In the Senate, she accomplished nothing, and as Secretary of State far worse than nothing. \\nSecretary Clinton carried out the foreign policy that destroyed two governments of countries which posed no threat whatever to America or to American interests in the Middle East. Each country is now moving in the direction of one of our two most dangerous enemies, Iran and Russia. \\nEgypt is now planning joint military exercises with Russian forces. Libya has already seen the rise of Islamic terrorists who killed the American ambassador whom the Clinton State Department refused to provide the security he asked for repeatedly. \\nSo much for track records. As for personal character, would you want either of them living next door to your family? \\nDonald Trump seems to think that it is OK for the government to seize someone else\\'s home and turn the property over to him, so that he can build something — without having to pay what it would cost him to buy the home. We can\\'t even discuss what he has said about women in a family newspaper. Add an almost childish egomania and you have a 70-year-old adolescent. \\nHillary Clinton is fundamentally very similar. But, having spent decades in the political limelight, she is far more experienced at concealing her ruthless and cunning contempt for anything and anybody that gets in the way of her personal enrichment and power. That includes contempt for the law. \\nLong before her e-mails became an issue, Mrs. Clinton was evading subpoenas for records she had somehow \"lost\" in the White House when she was first lady. Both she and her husband perfected the tactic of stalling and stalling, until enough time had passed that they could say that an issue was now \"old news\" and that it was time to \"move on.\" \\nThe issue before the voters, however, is not which of the two is the worse person. The issue is which is more dangerous to the future of America. Nor is this just a question of what will happen in the next four years. \\nWhoever becomes President of the United States can appoint Supreme Court justices able to destroy the Constitution by \"interpreting\" its protections of freedom out of existence — not just for the next four years, but thereafter. \\nHillary Clinton is already on record as wanting a Supreme Court that will overturn recent decisions protecting free speech and upholding the right to bear arms. Everything in her past shows a contempt for law that makes her a very credible threat to dismantle the Constitution, whenever it gets in the way of her agenda. \\nAll it takes is a Senate controlled by fellow Democrats to let a President Clinton\\'s judicial nominees be confirmed automatically, no matter how little regard for the Constitution those nominees have demonstrated. \\nDonald Trump shows no such ideological agenda and has no such automatic support from Congressional Republicans as to have them rubber stamp either his judicial nominees or whatever other agenda he has. More than that, Trump can be impeached if he oversteps the bounds, without either the Republicans or the media screaming loud protests. \\nTrump seems to pose much less danger — which, unfortunately, is the most we can expect this particular election year. \\n\\nThomas Sowell is a senior fellow at the Hoover Institution, Stanford University, Stanford, CA 94305. His website is www.tsowell.com. To find out more about Thomas Sowell and read features by other Creators Syndicate columnists and cartoonists, visit the Creators Syndicate webpage at www.creators.com . \\nCOPYRIGHT 2016 CREATORS.COM Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742562003.3428762}