{"duration": 0.05325651168823242, "input_args": {"text": "'Sen. Bernie Sanders ( ) started off Monday night’s CNN town hall with Chris Cuomo delivering biting words against   Donald Trump, calling him a “pathological liar,” before going on to praise him for winning the presidency when an audience member asked him what he deemed Trump’s “strongest attribute. ”[“Well, let me  —   that’s not a hard question for me to answer,” Sanders said:  Look, any objective assessment in the last year or a     or how long it was, will tell you that Donald Trump did something extraordinary. Something that nobody, but nobody, thought that he could do. Trump took on the Republican establishment, took on the Democratic establishment, took on the media establishment, and he ended up winning the election to become President of the United States. That is an extraordinary accomplishment. Donald Anyanwu, a student at George Washington University, whose family emigrated to the United States from Nigeria when he was in middle school, asked the question. Anyanwu, a registered independent, voted for Hillary Clinton, but he had asked Sanders to provide a positive remark about Trump “in light of the efforts to inspire a cohesive front. ” Sanders said, “So, I give, you know, Donald Trump his due. And I think any   person has got to. ” Earlier, Sanders had called Trump a “pathological liar” in response to a question that was asked about Trump’s skepticism about the intelligence committee’s findings that suggest Russia meddled in the 2016 elections. Sanders said he agreed with the intelligence committee’s findings on Russia. “We are dealing with a man who, in many respects is  —   how can I phrase this?  —   a pathological liar,” Sanders said. He added, “I have many conservative friends, and I disagree with them. They are not liars. They have their point of view. But time after time after time, he says stuff that is blatantly untrue. ” Follow Adelle Nazarian on Twitter and Periscope @AdelleNaz.'"}, "time": 1742563609.2751284}