{"duration": 0.06116127967834473, "input_args": {"text": "\"One of the themes of this election cycle in America is clarity. \\nGod is showing us what we’ve become. \\nClearly. \\nWith each passing political curveball and October surprise, painful and embarrassing clarity abounds. \\nWe’ve learned and are continuing to learn a lot about our “Christian leaders”. \\nSame goes for our concepts of freedom, liberty, justice, peace, and security… none of which do we dare understand, much less pursue, in an explicitly biblical manner anymore. \\nWe have quite thoroughly rejected Christ as King. \\nWe claim him often as Savior, but have no intent on serving Him as King in practice…political practice, legal practice, educational practice, economic practice, or pretty much any other kind of practices. He’s our favorite trinket, and little more. \\nThat’s the brutally ugly bottom line being emphasized and highlighted and pointed out again and again by God right now in America. \\nThe grace God is showing in the provision of this clarity is something that’s easy to miss, and easy to want to miss , since said clarity serves as just the sort of detailed, inescapable, and unassailable indictment that we’d prefer didn’t exist. \\nBut it does exist. \\nAnd He’s waving it in front of our eyes. \\nHe’s giving us detail upon pathetic detail and revelation after ugly revelation. He’s stacking them high and giving us chance after chance after undeserved chance to acknowledge and repent of that which is being made excruciatingly and redundantly plain. \\nAll we need do is take off our blinders and look at the whole picture plainly presented before us in its crystal clear, wide-open totality as it actually exists, rather than focusing on distractions and little snippets out of context while ignoring the building mountains of truths that deep down we know are fatal to the narratives we prefer over reality. \\nIf we simply look at the whole picture through the lens of a basic biblical worldview, we’ll have no trouble at all seeing why we’re circling the drain as a culture (and why we deserve to do so). \\nJust look at what we’re into: “Hope and change”…apart from submission to Christ as King. . “Making America great again”…apart from submission to Christ as King. . Supporting public schools…even though State-run children’s education is inherently anti-Christ, is literally designed to promote an increasingly anti-Christ population, and is based upon an approach to the pursuit of knowledge (aka “education”) lifted directly from the serpent’s tongue in Genesis 3. . Preserving Social Security…even though the flagrantly socialist/Marxist construct encourages the State to claim yet another role assigned to family and church, thus growing the power of the State and making the masses more dependent upon the State. . Maintaining/expanding a gigantic, globe-spanning military…even though we are supposedly broke and are open, proud champions of socialism, Marxism, Satanism, homosexuality, and any number of fundamentally anti-Christ concepts. . Maintaining our imagined “freedom” and “liberty” to produce, market, and consume porn…even though the God who defines and sustains all true liberty and freedom despises these things and promises to crush those who defend them. . Maintaining our imagined “right” to murder our own children for convenience (or for no reason at all)…even though the God who authored and sustains human life despises child sacrifice and has promised to crush civilizations that embrace it. . Maintaining our imagined “right” to marry someone of the same gender…even though the God who sustains all true rights and defines marriage calls such relationships abominations and routinely destroys cultures that promote them. . Being ever ready to pledge on cue our personal allegiance to the indivisible political power ruling over us, all in the name of a love for America (which has been made into our ruling idol)…even though no such pledge would even be considered by an actual American Founding Father. (The mere fact of their Founding Father status confirms that they did not believe in the indivisible political power of the state, and the fact that we now pledge our allegiance to such power on command by reciting an oath written by a Socialist in the 1800s for the purpose of selling American flags to public schools says a whole lot about how profoundly confused and easily manipulated we’ve become since the time of the Founding Fathers.) . Believing that “We the People” must submit to the systems placed above us…no matter how wildly anti-Christian they become. This has been promoted through a Hitlerian approach to Romans 13 (and other passages from Scripture) as embraced by the vast majority of even the most “conservative, Bible believing” church leaders in the land. . We must support the “lesser” of two evils offered to us by the system under which we are told we must live as good Americans…no matter how vile, sinister, vulgar, corrupt, and overtly anti-Christ those options may be. (See: Hillary Clinton and Donald Trump.) \\nObviously this is a list that could go on for a while, but we’ll pause it here and assume that you get the picture. \\nWe bring these items to focus again in light of an article recently published entitled Once the hope candidate, Obama in his final days faces a hopeless electorate , wherein The Washington Post noted how we live in an age of hopelessness on many levels as we roll from the Obama era on into the Trump or Clinton follow-up. \\nThe hopelessness that has been inspired by our approach to law, liberty, truth, justice, economics, politics and everything else has been building for hundreds of years. Contrary to what pagan political prognosticators of the day would have us believe, the current cultural wreckage is not something that can be understood, much less corrected, by pagan, unbelieving means. \\nThere is and will never be hope for law apart from submission to Christ as King in practice. \\nThere is and will never be hope for education apart from submission to Christ as King in practice. \\nThere is and will never be hope for economics apart from submission to Christ as King in practice. \\nThere is and will never be hope for culture and civilization apart from submission to Christ as King in practice. \\nThat’s how things work in God’s creation, America included. \\nUntil we understand this and repent accordingly, our hopelessness will only deepen and our implosion will only continue. \\nMay God grace His people with the clarity to see, repent, live, and thrive accordingly in this remarkable time…even as an unrepentant American empire crumbles around them. \\nArticle posted with permission from Fire Breathing Christian Don't forget to Like Freedom Outpost on Facebook , Google Plus , & Twitter . You can also get Freedom Outpost delivered to your Amazon Kindle device here . shares\""}, "time": 1742628602.3645558}