{"duration": 0.06360816955566406, "input_args": {"text": "'One man’s front teeth were knocked out. Another blacked out when his car was hit by the force of the blast. And one woman had to have ball bearings tweezed from her flesh, metal fragments removed from her ear and wood shards extracted from her neck. When a   bomb exploded on Saturday night on West 23rd Street in Manhattan, more than two dozen people were hurt  —   most of them struck by shrapnel and flying debris and glass. Officials immediately assured they had only minor injuries, and when Gov. Andrew M. Cuomo announced on Sunday morning that all the victims had been released from hospitals, there was a collective sigh of relief: In a city scarred by terror, not a single life was lost. But for the victims themselves, the injuries were nothing short of horrific  —   perhaps not life ending, but certainly life changing. In interviews, they described the shock of the explosion, then the strangeness of returning to daily life while carrying   injuries, from gashes with stitches to invisible wounds like ringing ears and nightmares. And while thankful to be alive, they experienced a paradox: One of the worst days of their lives is being referred to by practically everyone else as some kind of stroke of good luck. Four of those injured were recent graduates of Boston University, former roommates who had reunited for dinner and were walking to the subway. They were just feet from the trash bin believed to have concealed the explosive device when it detonated. The moment itself was a blur. “All of the sudden we were running out of there,” said one of the four, Noah McAskill, 22. As they joined other victims, they discovered they had all been hurt. Harris Gordon was bleeding from a cut in his back Luke Sorenson had a gash in his leg. Mr. McAskill had escaped with a few cuts and some hearing loss his hearing returned, though his ears were ringing for days. But his roommate, Joshua Lee, had been hit in the face and lost his two front teeth. His face was still swollen days later and he had been outfitted with temporary false teeth, said Mr. Lee, 22, originally from Los Angeles. An oral surgeon would repair his teeth permanently, but the process would take time. He planned to return to work soon. The young men all said they were focusing on resuming normalcy, but “these boys went to Boston University and lived through the Boston Marathon,” Mr. Gordon’s mother, Andrea, said. “They’ve lived through this twice. ” The criminal complaint filed this week against the suspect in the bombing, Ahmad Khan Rahami, listed the injuries suffered by the 31 victims  —   two more than originally reported  —   and included “lacerations in the face, abdomen, legs and arms caused by flying glass” and “metal shrapnel and fragmentation embedded in skin and bone. ” After being released from hospitals in the early hours of Sunday morning, those hurt dispersed into the city, and possibly beyond, left to deal with the aftermath on their own. Helena Ayeh, an architect who lives on West 23rd Street, in the Chelsea neighborhood, was swept off her feet by the blast and cut her right eye. Days later, her eye was still swollen and burning and she had trouble seeing through it, she said. “I’m affected for goodness knows how long, and it’s just sad,” she said. Ms. Ayeh tried to return to work on Monday, she said, but her limited eyesight made it too difficult. She was taken off a project that she was counting on for her income for the remainder of the year. “It’s a very heavy blow,” she said. “I’m sitting here wringing my hands asking, where I go from here?” It could have been worse. The   bomb, loaded with ball bearings, has been described as extremely powerful. Similar bombs at the Boston Marathon in 2013 left three dead and many injured, some requiring amputations. But that was a packed street, with spectators standing shoulder to shoulder and the bombs planted at their feet. While Chelsea is certainly crowded on Saturday nights, the pedestrians and cars were not as close together. At the same time, the placement of the bomb  —   believed to be beneath a   trash bin  —   may have contained the blast somewhat, though it sent the bin flying 120 feet. By sheer luck it did not strike anyone. Brenda Abreu and her boyfriend, David Martinez, 34, were driving past that spot at precisely the worst moment. “One second we were driving,” said Ms. Abreu, 32, who is seven months pregnant. Then the windows on the left side shattered completely, and the car was lifted onto its   wheels. “For a second I thought my car was on fire,” she said. Her boyfriend blacked out at the wheel and sprained his knee in the blast. Debris from the bomb struck him behind the ear, leaving him with burn marks. The next thing Ms. Abreu remembered, she was facing emergency responders near the ambulances. “Am I going to go into labor?” she thought. She was put on a stretcher. At Bellevue Hospital Center, one of four hospitals where victims were sent, the two were examined and released early Sunday morning both sustained mild concussions. Dr. Eric Cruzen, the medical director of emergency medicine at Lenox Health Greenwich Village, said his department treated nine patients, including one pediatric patient, for lacerations from shrapnel and glass, head injuries and mild concussions, and decreased hearing caused by the rapid change in pressure during the explosion. Many of the patients who experienced ear trauma had been inside cars at the time of the explosion, and said their windows had been blown out. The same pressure that shatters a window can also shatter an eardrum, Dr. Cruzen said. “It can burst like a window does,” Dr. Cruzen said. “It can be very alarming. ” He added, “I think the psychological effect of being bombed in your home city was probably the worst. ” Ms. Abreu missed two days of work at her job as an administrative assistant, and had rarely left the house. She has had nightmares and trouble sleeping. She refused to watch the news. “Every time I see his picture,” she said, referring to Mr. Rahami, “it just brings back everything. ” Victims of trauma might experience insomnia, irritability,   or a loss of or gain in appetite, said Dr. Jeffrey Lieberman, professor and chairman of the department of psychiatry at Columbia University Medical Center. They might be easily startled by loud sounds. “These are effects that will linger for some period of time,” he said. Over the long term, people in the most extreme cases might have recurring memories of the event, or even lose the ability to concentrate or perform usual work tasks. A person’s psychological recovery does not depend on the scale of the event, whether it is the attacks of Sept. 11, 2001, or a blast with no serious injuries. “If you’re the person affected, it doesn’t make a difference if it’s a mass tragedy,” Dr. Lieberman said. For those affected by the bombing in Chelsea, feelings are mixed. Since Saturday, Andrea Gordon, the mother of one of the Boston University graduates, has repeatedly thought of other terrorist attacks and found herself flooded with gratitude. “Thank God this guy was captured, and thank God he was an amateur,” she said. Asked if she had talked to her son about how he felt, she said, “I’m going to get there. ” For the moment, her son and his friends were looking to the future. “They don’t want to relive the night,” she said.'"}, "time": 1742628579.8976853}