{"duration": 0.13216733932495117, "input_args": {"text": "'WASHINGTON  —   The senior United States commander in Iraq said on Tuesday that an American airstrike most likely led to the collapse of a building in Mosul that killed scores of civilians this month. But the commander, Lt. Gen. Stephen J. Townsend, indicated that an investigation would also examine whether the attack might have set off a larger blast from explosives set by militants inside the building or nearby. It was the fullest acceptance of responsibility by an American commander since the March 17 airstrike. “My initial assessment is that we probably had a role in these casualties,” said General Townsend, who commands the   task force that is fighting the Islamic State in Iraq and Syria. But he asserted that “the munition that we used should not have collapsed an entire building. ” “That is something we have got to figure out,” he added. With an increase in reports of civilian casualties from the American bombing of Islamic State targets in Iraq and Syria, some human rights groups have questioned whether the rules of engagement have been loosened since President Trump took office. Pentagon officials said this week that the rules had not changed. But General Townsend said on Tuesday that he had won approval for “minor adjustments” to rules for the use of combat power, although he insisted they were not a factor in the Mosul attack. General Townsend acknowledged, however, that steps had been taken to speed up the process of providing air power to support Iraqi troops and their American Special Operations advisers at the leading edge of the offensive to recapture Mosul from the Islamic State. The goal, he said, was to “decentralize”  . General Townsend did not describe the changes in detail, but he cast them as a return to the military’s standard offensive doctrine, in contrast to the “very centralized” approach he said was initially put in place after President Barack Obama sent American forces back to Iraq to combat the Islamic State, also known as ISIS or ISIL. Maj. Gen. Maan   an Iraqi special forces commander, has said that his men called in a coalition airstrike to take out snipers on the roofs of three houses in a Mosul neighborhood called Mosul Jidideh. The Iraqi forces, General Saadi said, were unaware that at least some of the houses were filled with civilians. General Townsend said he did not have information on the Iraqi commander’s specific role, but explained that the United States had been training Iraqi military officers how to call in airstrikes that are carried out by Iraqi aircraft. Any American airstrike requested by the Iraqis, General Townsend said, would need to be approved by American officers. “If he said his guy was calling for fire, he could have been,” he said. “Now how that works is that they don’t call directly to a U. S. fighter overhead and suddenly a U. S. fighter is rolling in on their grid coordinates. ” Iraqi forces have been eager for the help of American air power as they take on the toughest phase of the more than   battle to retake Mosul. American officials have said that 500 Iraqi troops were killed and about 3, 000 wounded in taking the eastern half of the city. General Townsend said the battle for the western half of the city was even more difficult because of what he called its “claustrophobically close terrain” of narrow streets and buildings. He repeated several times that the    fighting was the most intense urban combat since World War II. Adding to the challenge is a factor he did not mention: the decision by Iraq’s governments to urge Mosul’s residents to shelter in place instead of trying to flee. When American troops retook Falluja in 2004, the fierce urban fighting took place in a city that had already been abandoned by most civilians. Though the Iraqis are doing the main fighting on the ground in Mosul, American and coalition forces have been playing an essential role. United States Army Paladin howitzers have been firing rounds into Mosul from their positions outside the city. Task Force Thor, which is based at Qayyarah West Airfield 40 miles south of Mosul, has been firing Himars   rockets into the city. American Apache attack helicopters have added to the firepower. This year, the United States increased the number of soldiers who have been advising Iraqi troops as they have pushed into the city. While the mission of the advisers is not to directly engage in combat, many are in harm’s way as they advise Iraqi units carrying out the fight. On Monday, American military officials said that two infantry companies from the 82nd Airborne Division were being sent to help protect those United States advisers and that a “route clearance” platoon was also being deployed to clear away roadside bombs. Together, the deployment adds about 240 troops to the mission. The troop cap that the Obama administration established for the operation in Iraq  —   what the Pentagon calls the “force manning level” —   is 5, 260. But that formal limit, which the Trump administration is likely to eliminate, does not count temporary deployments. The actual number of troops in Iraq is certainly higher. With more American forces in Iraq, and more United States advisers near the front lines, the need for timely airstrikes is much greater. Brig. Gen. Matthew C. Isler, an Air Force officer who serves as deputy to General Townsend, is in charge of the investigation into the Mosul airstrike. A team of American experts has visited the site to collect evidence to determine what caused the significant loss of civilian life. American officials said they were investigating a number of possibilities, including whether the militants herded the civilians into the building to use as human shields whether the building was rigged with explosives or whether a nearby car bomb exploded. “My initial impression is the enemy had a hand in this, and there’s also a fair chance that our strike had some role in it,” General Townsend said in a briefing broadcast to the Pentagon from Iraq. “I think it’s probably going to play out to be some sort of combination. But you know what, I can’t really say for sure, and we’ve just got to let the investigation play out. ” General Townsend said the results of the investigation would be reported publicly, “unlike our enemy. ” While General Townsend acknowledged an American role in the Mosul strike, he said the allegations that the United States had bombed a school full of refugees in Syria were not credible. That airstrike, which has garnered considerable attention, occurred during an operation in which   Syrian fighters were trying to seal off the western approaches to Raqqa, the Islamic State’s   capital. But General Townsend said that the evidence he had seen indicated that it was about 30 Islamic State fighters who were killed in that attack. “I think that was a clean strike,” he said. He also dismissed reports, publicized by the Islamic State, that an American airstrike had endangered the Tabqa Dam west of Raqqa, saying that the structure was not in imminent danger. “If something happens to the Tabqa Dam, it will be at the hands of ISIS, not the coalition,” he said. Still, the reports of desperate civilians in Mosul prompted Zeid Ra’ad   the United Nations high commissioner for human rights, to urge on Tuesday that the   coalition reconsider its tactics. The United Nations has said that at least 61 people were killed in the March 17 strike in Mosul. Amnesty International said as many as 150 might have died. “The fact that Iraqi authorities repeatedly advised civilians to remain at home, instead of fleeing the area, indicates that coalition forces should have known that these strikes were likely to result in a significant number of civilian casualties,” Donatella Rovera of Amnesty International said in a statement.'"}, "time": 1742562482.8645833}