{"duration": 0.13672852516174316, "input_args": {"text": "'  Pa.  —   The line to see Donald J. Trump snaked back and forth on itself hours before his arrival. There was a carnival atmosphere with people in costumes, including one   man with a sign, “Don’t let the   media elect crooked Hillary. ” A cavalcade of motorcycles roared up, and there were cheers and laughter for a man shouting, “Donald Trump is going to make America great! He hasn’t paid taxes in 20 years!” A day after Mr. Trump defended himself at the second presidential debate for making vulgar comments about women, amid a wave of polls showing an increasing lead for Hillary Clinton, thousands of Trump supporters turned out with undimmed fervor for the Republican nominee and optimism about his electoral prospects. They echoed nearly verbatim Mr. Trump’s defense that his lewd comments about women on a 2005 recording were merely “locker room talk,” calling them harmless words compared with the   actions Mrs. Clinton and her husband had taken to shame women. They reiterated Mr. Trump’s claim that national polls showing him behind by double digits were “rigged” and that he was heading to victory in November. In the campaign’s last weeks, at such rallies, Mr. Trump is sealed in a hermetic bubble with his most fervent supporters. They are people passionate enough to wait hours to attend a rally where the candidate and the crowds draw energy and affirmation from each other, while dismissing any discouraging information. His supporters routinely pointed, as the nominee did, to the huge crowds still flocking to see him as evidence that his campaign remains strong. “I don’t believe anything the media says,” said Brad Chilson, 47, a truck driver from Bradford County, Pa. who waited hours with his wife outside the   Mohegan Sun Arena in   for Mr. Trump. “Look at the turnout we’ve got here. ” Mr. Trump was in high spirits on Monday night in northeastern Pennsylvania, in the heart of a largely white,   region that he has visited regularly, running a campaign sustained by a visceral feel for his audience while ignoring abstractions like data and research. “I think the state of Pennsylvania, we’re going to win so big,” he said. A New York Times polling average shows Mrs. Clinton 7. 2 percentage points ahead in the state. “Everybody in Pennsylvania wants Trump, you know,” he said. “We get crowds like this everywhere. ” He boasted of a rally planned for Florida with an expected 25, 000 people. As he spoke, Katie Packer, a strategist for Mitt Romney in 2012, posted a photograph on Twitter of 30, 000 people at an Ohio rally four years ago a week before Mr. Romney’s defeat. “None of the Trump crowds so far in the general election surpass what we regularly had in ’12,” Ms. Packer wrote. “They are so naïve. ” Yet Mr. Trump whipped the crowd to anger at the news media and its “crooked” polls. At one point, he falsely claimed that CNN had turned off its live coverage as he was accusing the network of manipulating a   focus group. The crowd then chanted an   epithet. He also read the results of unscientific,   online surveys. “Trump 70, Clinton 30,” Mr. Trump quoted from a reader survey by the Drudge Report on which candidate had won the second debate. “Oh, listen to this,” he said, reading from an iPhone. “Time magazine. You think Time magazine likes me?” He cited the result: 89 for Trump, 11 for Clinton. “Oh, here’s a good one,” he added. “Well, they’re slightly conservative  —   Breitbart. 93 to 7,” he read. Mr. Trump’s supporters who were waiting to hear him speak cited alternative sources of information they preferred, dismissing even Fox News in favor of emails from   commentators like Allen B. West, a former congressman, and Dennis Lynch, who makes films about illegal immigration. They also repeated conspiracy theories that flourish online. “A lot of people affiliated with Hillary have died over the years, and nobody says nothing about it,” said Eric Bulger, a retired police officer with the Port Authority for New York and New Jersey. There were equal numbers of women and men at the rally, and many dismissed as insignificant Mr. Trump’s private comments, caught on the 2005 recording, about being able to grab women by their genitals because he was a “star. ” “When all this baloney came out about Trump, I understand it’s a scandal,” said Brenda Stchur, 56, a Democrat from Hudson, Pa. who supports Mr. Trump. “But John F. Kennedy wasn’t innocent, either, and everyone loves John F. Kennedy. ” Marilyn Sevigny, a retiree from Lake Ariel, Pa. said that “as a woman, I don’t like what he said, I’m not defending it. ” But she added that there was a double standard at work. “If a Democrat says it, it’s just words. If a Republican says it, it’s an assault,” she said. Before Sunday’s town   debate, David Quinn, an electronics engineer, told his wife that Mr. Trump should drop out, as some senior elected Republicans were calling on the candidate to do. But Mr. Quinn changed his mind, he said, after Mr. Trump’s apology for his comments from 11 years ago. “The only thing that tape shows is he’s a healthy heterosexual,” he said. Those at the rally agreed that Mr. Trump had won the debate. Many cited as their favorite moment Mr. Trump’s retort that Mrs. Clinton would “be in jail” if he were president. They dismissed the F. B. I. ’s recommendation that Mrs. Clinton should not be prosecuted over her use of a private email server as secretary of state. They faulted the news media for not highlighting that Mrs. Clinton had deleted thousands of emails after receiving a congressional subpoena, as Mr. Trump charged in the debate. Mike Pisano, 65, a factory worker, echoed Mr. Trump’s contention that Mrs. Clinton had escaped indictment because Bill Clinton had met privately with Attorney General Loretta Lynch. “He was on the plane with her fixing that,” Mr. Pisano said. Still, outside the bubble of such devoted followers, Mr. Trump’s prospects in northeastern Pennsylvania are less certain. On  ’s Public Square, whose sidewalks filled during lunch hour on Monday, several Republicans and   Democrats said they were appalled by Mr. Trump and would skip the election, or vote for a   candidate. “I just think he’s a pig,” said Janice Kontur, 44, a registered Republican, who manages an apartment complex. She said she could not bring herself to vote for Mrs. Clinton and planned to sit out Election Day. “As a matter of fact, if he’s elected, me and my daughter will be moving to a different country,” she said of Mr. Trump. Melinda Thompson, a controller for an insurance company, said she would vote for Gary Johnson, the Libertarian candidate. She said of Mr. Trump, “I think his temperament would backfire on the United States. ” Paul Galante, a lawyer on a smoking break across from a statue of Christopher Columbus, said he was a registered Democrat but had consistently voted for Republican presidential nominees. Not this year. “All people want is a reason to like the man, and he doesn’t give them a reason,” he said of Mr. Trump. He called the Republican Party “a joke” for nominating Mr. Trump from a field of 17. In the primary, Mr. Galante wrote in a protest candidate, and he is considering voting for Mrs. Clinton in November. “She’s a sneak and a liar,” he said. “But so what at this point? He’s worse. ” The Trump campaign is counting on doing well in the   region, where factories have closed and the presence of   immigrants has caused tensions. But Mr. Galante, a longtime resident, was deeply skeptical of Mr. Trump’s prospects. “He’s going to get slaughtered,” he said.'"}, "time": 1742564297.2626534}