{"duration": 0.059804677963256836, "input_args": {"text": "'Comments \\nRepublican consultant Ana Navarro tore into Trump surrogate, former Speaker of the House, and unrepentant dirty old man Newt Gingrich during a segment tonight in CNN. The correspondent laid into Gingrich over his disgraceful behavior last night on the Kelly File , calling out the absurd hypocrisy of his attempts to defend Donald Trump’s admitted sexual assaults and accusing host Megyn Kelly of being “fascinated with sex.” \\n“I think the word you were looking for was ‘hypocritical. Remember Newt Gingrich’s wife? When he was running in 2012, told all of us, told the media the media, said it to the camera. Newt Gingrich offered her the choice between an open marriage or a divorce. So maybe, just maybe, if all of that baggage is on your shoulders, maybe you shouldn’t be the surrogate out there wagging your finger and accusing the woman who was reporting on sexual assault — let me explain it slowly — sexual assault and sex are two things. One is unwanted. One is wanted. So maybe they need to understand that to begin with.” \\nNewt Gingrich began having an affair while his wife Jackie Battley was battling cancer and told her he was divorcing her when she was still in the hospital. Gingrich’s campaign treasurer said that Newt told him dismissively that “She’s not young enough or pretty enough to be the wife of the President. And besides, she has cancer.” He then cheated on his second wife with another woman twentysome years his junior. It’s obvious why Gingrich is defending Trump: he’s from the same stock of ageing windbags who view women as objects to be used and discarded when they tire of them. \\nFor Gingrich to become so upset at Kelly for not immediately discarding the allegations of sexual assault facing Trump just shows how out of touch the Trump campaign truly is. Kelly, who has almost certainly weathered her fair share of sexual harassment and unwanted advances from the lecherous codgers at FOX , has good reason to believe these women, because she knows what kind of man Donald Trump is – the same kind of man that sexual predator Roger Ailes is; the same kind of man that rampant philander Newt Gingrich is; the kind of men who have run the Republican Party for decades. The party of “family values” indeed. \\nWatch Navarro’s brutal takedown here:'"}, "time": 1742561847.361262}