{"duration": 0.020750045776367188, "input_args": {"text": "'A new Mexican beer has a label depicting a   gloomy, mariachi President Donald Trump with a swastika belt buckle. [The “Amigous Cerveza” beer  has the word “amigo” misspelled to allegedly make fun of a mispronunciation of the word by Americans, reported Reuters.  The back label of the brew says the Republican president should be “in a mad house, not the White House. ” The chief executive of brewery, Casa Cervecera Cru Cru, Luis Enrique de la Reguera, was reported to be surprised with the success of the product. The original production was gone within a week. “We knew that a Trump label was going to be controversial, but it’s been selling extremely fast,” he said. Cru Cru designed the beer: similar to a New England pale ale with a hint of mango. The idea came to Cru Cru and his partner in Mexico, Error de Diciembre and Epic Brewing, before the presidential election. The Cru Cru team took to Instagram to wish President Trump a happy birthday. Best birthday ever   …     HBP! A post shared by ima_lore (@ima_lore) on May 25, 2017 at 8:42am PDT,  The Republican angered some when during his speech announcing his run for the presidency in June 2015 he said: When do we beat Mexico at the border? They’re laughing at us, at our stupidity. And now they are beating us economically. They are not our friend, believe me. But they’re killing us economically. The U. S. has become a dumping ground for everybody else’s problems. Thank you. It’s true, and these are the best and the finest. When Mexico sends its people, they’re not sending their best. They’re not sending you. They’re not sending you. They’re sending people that have lots of problems, and they’re bringing those problems with us. They’re bringing drugs. They’re bringing crime. They’re rapists. And some, I assume, are good people. But I speak to border guards and they tell us what we’re getting. And it only makes common sense. It only makes common sense. They’re sending us not the right people. It’s coming from more than Mexico. It’s coming from all over South and Latin America, and it’s coming probably —   probably —   from the Middle East. But we don’t know. Because we have no protection and we have no competence, we don’t know what’s happening. And it’s got to stop and it’s got to stop fast. Virginia Senator Tim Kaine later claimed, “As a candidate, [Donald Trump] started his campaign where he called Mexicans rapists and criminals. ” As reported by Breitbart: Trump was referring to illegal aliens coming over the U. S.  border who commit additional crimes, such as rape. As Breitbart Texas has extensively documented, it’s common for human traffickers to “to sexually assault or rape the females” en route to the U. S. and the smugglers “usually remove an article of clothing from the female they rape and they tie it tightly to a tree —  a rape tree. ” Furthermore, it is true that as the U. S. suffers from a massive heroin epidemic that killed over 47, 000 people in 2014 alone, “nearly all” of the heroin consumed in the U. S. is smuggled in by Mexican traffickers, as the Washington Post found. Drug trafficking is an inherently violent operation. Bob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX and Facebook.'"}, "time": 1742628525.2524939}