{"duration": 0.031382083892822266, "input_args": {"text": "'Moms Demand Action founder Shannon Watts suggested President Donald Trump’s   administration is the ‘NRA’s Dream’ but America’s nightmare Sunday, during an appearance MSNBC. [She was especially concerned about the push for “concealed carry reciprocity,” which she described as “extremely dangerous. ”  For anyone not familiar with national reciprocity for concealed carry, the goal is to replace the current patchwork of concealed carry laws with a recognition that a concealed permit from one state is valid in every state. This would allow concealed permit holders to drive from one state to the next and keep their handgun with them for   just as they do in their home state. This is what Watts described as “extremely dangerous. ” She said national reciprocity is “the NRA’s dream but it is a nightmare for public safety. ” She did not provide any data substantiating her suggestion that concealed carry permit holders endanger public safety. Watts also mentioned “silencer legislation” and “talk of executive orders to put guns in schools. ” She then spoke to the fact that President Trump will be speaking at the NRA’s Annual Meetings on April 28, and said, “I would like to see Donald Trump say something about where he stands on these dangerous laws. ” It is important to note that Trump actually led the charge for national reciprocity during his presidential campaign, so there is no need for him to clarify his stance. On September 18, 2015, Breitbart News quoted Trump: The right of   doesn’t stop at the end of your driveway. That’s why I have a concealed carry permit and why tens of millions of Americans do too. That permit should be valid in all 50 states. A driver’s license works in every state, so it’s common sense that a concealed carry permit should work in every state. If we can do that for driving  —   which is a privilege, not a right  —   then surely we can do that for concealed carry, which is a right, not a privilege. Trump’s son, Donald Trump Jr. also spoke plainly during the campaign when he explained that his father would support firearm suppressor deregulation. And Trump was very clear in numerous statements about the dangers posed by   zones, like the ones at Orlando Pulse (June 12, 2106) Umpqua Community College (October 1, 2015) and Sandy Hook Elementary (December 14, 2012). In fact, following the Umpqua Community College attack, The Hill quoted Trump saying, “I’ll tell you, if you had a couple of the teachers or someone with guns in that room, you would have been a hell of a lot better off. ” On April 16, Breitbart News reported Watts’ claim that “caring Americans” support gun control. AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com'"}, "time": 1742628478.3285918}