{"duration": 0.1402735710144043, "input_args": {"text": "\"This post was originally published on this site \\nsott.net/news \\n© Shannon Stapleton / Reuters \\nMoscow-based Institute of Oriental Studies under the Russian Academy of Sciences (IVRAN) presented a devastating report about the lies of the Western mainstream media about Syria. \\nBut this damning report is not getting the attention it deserves by the mainstream media in the West. However, that shouldn’t come as a surprise. There are many facts in the Institute’s report that would make sensations in the EU and the US, had they unmasked the Russian, and not the Western, media falsifications. \\nIn a similar situation, there was a whole media frenzy in the US and EU media in 2014, when a Russian television channel released an interview with a woman refugee from the rebellious Eastern Ukraine, who provided the unconfirmed report about a local boy being crucified by Ukrainian government troops. Meanwhile, in its report, IVRAN proved much cruder, intentional falsifications on the side of the Western media reports about Syria. \\nFor example, IVRAN’s report proves the falsity of a news item published in Britain’s The Daily Express on October 1, 2015, at the very start of Russian air forces’ operation against terrorists in Syria on an invitation from the Syrian government. \\nThe report said that “a Russian air strike on Thursday destroyed a mosque in the town of Jisr Al Shughour, which was taken from government forces by Islamist insurgents earlier this year.” Having studied the photos of the area, made from the planes on October 29, 2015, the researchers from Institute of Oriental Studies proved beyond any reasonable doubt that the mosque in Jisr Al Shughour remained intact in the end of the month, i.e. it had been intact during all of October, 2015. The Russian specialists on Arab studies from IVRAN say they proved that The Daily Express simply provided unverified information from the local opposition activists. \\nUnfortunately, the information on Jisr Al Shughour’s bombing was also cited by London-based The Daily Telegraph, as well as other British and global media. \\nThe Institute for oriental Studies made an important observation. Accusing Russia of not bombing the so called Islamic State (ISIL) and thus not damaging the Islamist terrorists’ infrastructure, the Western mainstream media has not been providing its readers adequate information on OTHER, non-ISIL Islamist groups in the area, some of them no less dangerous than the ISIL. For example, The Daily Telegraph reported on that same day that “Russians continued their aerial bombardment on Thursday, targets included Jisr al-Shughour and Jabal al-Zawiya, areas under the control of Jaish al-Fatah, the Army of Conquest, an alliance of Islamist groups which have won significant victories against the regime this year.” \\nSo, reporting from the same area, The Telegraph actually names the groups which Express called rather vaguely “Islamist insurgents.” These were actually very dangerous terrorist groups of pseudo-Islamic character: Jaish al-Fatakh and the Army of Conquest. They are often cited as terrorist groups by international human rights organizations, some of their members are accused of mistreating the people who work in human rights’ groups. \\nWill you report our findings? \\nWhen the director of the Institute for Oriental Studies, Vitaly Naumkin, was presenting the findings of his colleagues at the press center of Rossiya Segodnya information agency, he was asked a question by a journalist from the Syrian official agency, Sana. “Will the Western media publish what you found or will they keep reporting the same stuff about Syria…?” Naumkin, who had just been asked a question on his Institute’s report by a female correspondent of The Financial Times, readdressed Sana’s question to her. \\n“There is so much news today, and I am not yet in my office,” FT’s Kathrin Hille answered. “So, I am not sure we shall report on your findings.” \\n“I know you won’t,” professor Naumkin noted, smiling bitterly. \\nAccording to Naumkin, Russia’s policy in Syria has become a target of a deliberate disinformation attack from the Western media, especially after the presence of Russia’s air force near Damascus was unveiled in September 2015. \\n“Why is the Western media attacking us so bitterly?” Naumkin asked rhetorically during his press conference. “Because the process of national reconciliation is under way in Syria. And this process is Russia’s main purpose in that area, on the par only with the imperative of damaging or, better, destroying the so called Islamic State. So, the Western media indeed don’t want Russia to achieve its aim, misrepresenting our countries priorities as ‘support for the regime’ or ‘a proxy war against the Western interests.'” \\nMainstream media’s self-exposure \\nIn their report, the experts of Naumkin’s Institute for Oriental Studies noted that some of the Western myths about the civil war in Syria are debunked by the Western media itself – in its rare moments of truth. \\nFor example, at the beginning of the civil war in 2011, the Western media kept saying there were no terrorists among the anti-Assad opposition fighters and that the opposition force was home-grown, not including foreign mercenaries. But already, on August 8, 2013, The New York Times , Anne Barnard and Eric Schmitt, reported from the ISIL’s zone of operations that “the jihadist groups in Syria now include more than 6,000 foreigners.” \\nThe NYT also reported then that the areas controlled by the Syrian opposition and previously described as “liberated” by the Western mainstream media, “may be developing into one of the biggest terrorist threats in the world today” (in fact, they were in the final stages of becoming ISIL-controlled territories). \\nJeffrey Sachs, a prominent US economist and world-known mentor of the Russian liberal reformer Yegor Gaidar, wrote already in September 2013 on the Western governments’ pursuit of a violent overthrow of Syria’s President Assad: “Without their involvement, Assad’s regime would most likely have remained repressive; with their involvement, Syria has become a site of mass death and destruction.” \\nThe ever-changing David Ignatius, of The Washington Post , back in 2012 penned an article headlined ‘Syria’s Eerie Parallel to 1980s Afghanistan.’ In it, Ignatius wrote certain truths which The Washington Post is now trying to make its readers forget: “In Syria, as in Afghanistan, CIA officers are operating… helping Sunni insurgents improve their command and control and engaging in other activities (!). Weapons are coming from third parties (in Afghanistan, they came mostly from China and Egypt; in Syria, they are mainly brought from the black market). And finally, the major financier for both insurgencies has been Saudi Arabia.” \\nDoes one need to remind the reader how the US-backed insurgents in Afghanistan ultimately turned their weapons against the very people who procured them? \\nMr. Ignatius writes about this development in his own article in The Washington Post : “This CIA-backed victory [in Afghanistan] opened the way for decades of chaos and and jihadist extremism that are still menacing Afghanistan, its neighbors and even the United States.” \\nHaving read Ignatius, one listens with special attention to the warning of Professor Vitaly Naumkin, who concludes his presentation with the following statement: “We are in fact in the same trench with the West, facing the same global threat of terrorism. The problem is that the Western leaders are simply too slow to understand this.” \\nOne could not put it better. \\nDmitry Babich was born in Moscow, in 1970. He has worked for various media outlets for 25 years, including The Moscow News and RIA Novosti news agency. He is currently working as a political analyst at Sputnik International, and is a frequent guest on BBC, Al Jazeera, CNN commenting on international affairs and history. Related \""}, "time": 1742561831.3358524}