{"duration": 0.16118931770324707, "input_args": {"text": "'LONDON  —   David Cameron, the British prime minister, has no one to blame but himself. In 2013, besieged by the increasingly assertive   Union wing of his own Conservative Party, Mr. Cameron made a promise intended to keep a   peace among the Tories before the 2015 general election: If   he would hold an    referendum on continued British membership in the bloc. But what seemed then like a relatively   ploy to deal with a   political problem has metastasized into an issue that could badly damage Britain’s economy, influence the country’s direction for generations  —   and determine Mr. Cameron’s political fate. As the nation prepares to vote on Thursday, the betting markets are signaling that Britain will choose to remain in Europe, but polls suggest that the outcome is still too close to call. On Tuesday, speaking in front of No. 10 Downing Street, Mr. Cameron warned that a decision to leave would be an “irreversible” choice. Appealing to older voters, many of whom tend to favor leaving Europe, Mr. Cameron urged them to think about what they would bequeath to the next generation. “Above all it is about our economy,” he said. The bluff, ruddy Mr. Cameron is famously lucky, having pulled out   victories in numerous other scrapes. But in this case, many analysts say, he will be damaged goods even if he wins, with rivals circling to succeed him and Conservatives more divided than ever. If he loses, he will come under pressure to resign, and even if he hangs on for some portion of the four years left in his government’s term, whatever substantive legacy he might have built will be lost to what many consider to be a wholly unnecessary roll of the dice. Martin Wolf, the economic columnist of The Financial Times, wrote that “this referendum is, arguably, the most irresponsible act by a British government in my lifetime. ” Summarizing the nearly unanimous opinion of economists that a British exit  —   “Brexit”  —   would be followed by a major shock and permanent loss of growth, he concluded: “The outcome might well prove devastating. ” Mr. Cameron argues that the referendum had to be called to resolve the festering debate over Britain and the European Union. As in the Scottish referendum on independence in 2014, he says, this vote represents a “great festival of democracy” on a very difficult and divisive topic. But if the Scottish referendum turned nasty, and kept the United Kingdom together, this one has become poisonous, with Mr. Cameron’s own cabinet colleagues and supposed friends saying that he has eroded trust in politics, portraying him as a liar and acting like a government in waiting. It has been a campaign punctuated by numerous claims that have little relationship to the facts, with sharp tones of xenophobia, racism, nativism and Islamophobia. And it was marked tragically last Thursday by the assassination of a young Labour member of Parliament, Jo Cox, who fiercely supported remaining in the union. On Tuesday evening, some of that bitterness surfaced in a fiery television debate in which London’s new mayor, Sadiq Khan, who wants Britain to remain in the bloc, said that the campaign of his opponents “hasn’t been project fear, it’s been project hate as far as immigration is concerned. ” Steven Fielding, a professor of political history at the University of Nottingham, said that Mr. Cameron “has made the case against himself, and he’s damaged either way. ” The prime minister presumably thought it would be an easy win for the “Remain” forces, Mr. Fielding added. “But it’s far tighter than anyone thought,” he said, “and rather than a salve on the Tory party, it’s made the fever worse. ” Tim Bale, a professor of politics at Queen Mary University of London, is slightly less harsh. “It’s really a binary legacy” for Mr. Cameron, he said. “It is either one that ends in almost complete failure or one that seems pretty respectable in electoral and policy terms. I can’t think of another prime minister who had so much riding on one decision. ” If the Remain campaign loses, “the chances of him staying on are pretty remote,” Professor Bale said. “He will go down as the person who miscalculated, taking us out of Europe almost by mistake, and then shuffled off the stage” in “a pretty ignominious exit. ” Even if Britain votes to stay in the bloc, Mr. Bale said, given Mr. Cameron’s small parliamentary majority, “the number of   euroskeptics and   he’ll be subject to defeats and blackmail until he steps down. ” There are those who support the contention that Mr. Cameron had to call this referendum in the face of Tory division and the rise of the U. K. Independence Party and its leader, Nigel Farage. UKIP was cutting into the Conservative vote by arguing, as the “Leave” campaign does now, that Britain could limit immigration and control its own borders only by leaving the European Union. Mr. Cameron, who had repeatedly pledged to get immigration down to the “tens of thousands”  —   even though last year net migration was some 330, 000 people  —   never had a persuasive answer to the immigration question. To pacify the growing number of   Union Tories, keep his leadership position and undermine UKIP, he promised this referendum if he won the 2015 election, which he did by a larger margin than expected. Even before the election, some, like Robin Niblett, the director of Chatham House and a supporter of the Remain movement, argued that a referendum would come at some point, and that it would be more easily won under Mr. Cameron and the Tories. Charles Lewington, a former director of communications for the Conservative Party, said there had to be a referendum. By 2013, he said, “there was tremendous pressure for an   referendum and not just from the old guard. ” Mr. Lewington cited growing concern from Conservative members of Parliament that they were at risk of losing their seats in districts where UKIP was strong. Given the panic in the party, he said, “I don’t think he could have avoided making an   manifesto commitment. ” But Tony Travers, a professor of government at the London School of Economics, is less sure. “Cameron didn’t need to do it,” Professor Travers said. Like Harold Wilson, the Labour prime minister who organized a referendum on Europe in 1975, Mr. Cameron began the referendum as an exercise in “internal party discipline,” he said. It was called “for party reasons more than national ones,” he added. Nicholas Soames, Winston Churchill’s grandson, a friend of Mr. Cameron’s and a Tory legislator, was more scathing about the failure of several Conservative leaders to confront, rather than appease, the   Tory euroskeptics. “If you have an Alsatian sitting in front of you, and it growls at you and bares its teeth, there are two ways of dealing with it,” Mr. Soames said in an interview with the British website Conservativehome. “You can pat it on the head, in which case it’ll bite you, or you can kick it really hard. ” “Successive prime ministers, and it’s not the present prime minister alone, have never understood that they have to take these people on,” Mr. Soames said. If the Remain side loses, both Mr. Cameron and his deputy, the chancellor of the Exchequer, George Osborne, are likely to be gone within months, Mr. Lewington said. While all denying any ambition to replace Mr. Cameron, the sharks are in the water, led by Boris Johnson, the former mayor of London and a prominent campaigner for leaving the European Union. But the winner of such contests in the Tory party is rarely the one who wields the knife, and while Mr. Johnson would seem to lead the race, his success is far from assured.'"}, "time": 1742564322.9165955}