{"duration": 0.08121824264526367, "input_args": {"text": "'Russia, facing deepening scrutiny over accusations that it orchestrated a doping campaign during the Sochi Olympics in 2014, on Sunday made a public plea for its track and field athletes to be allowed to compete in this summer’s Games in Rio de Janeiro. Writing in The Sunday Times, a British newspaper, the Russian sports minister said Russian officials, coaches and athletes made “serious mistakes,” but he stopped short of specifying them or admitting to any state role. “We are very sorry that athletes who tried to deceive us, and the world, were not caught sooner,” wrote the sports minister, Vitaly Mutko. “We are very sorry because Russia is committed to upholding the highest standards in sport and is opposed to anything that threatens the Olympic values. ” But he added: “It cannot be right that clean athletes should suffer for the behavior of others. In no other walk of life would this happen. ” The accusations of an elaborate drug operation at the 2014 Winter Olympics, published last week in The New York Times, have led to growing calls to bar Russia and its powerhouse track and field team from the Rio Games, which are set to open in August. Craig Reedie, the president of the World   Agency, told the BBC on Saturday that it was “highly unlikely” that Russia’s antidoping agency would be declared compliant with world sports rules in time for the Games. Russia was provisionally suspended from international track and field competition by the International Association of Athletics Federations in November after WADA issued a   report that outlined a pervasive culture of doping among the country’s sports programs. The I. A. A. F. is expected to decide next month whether the country has done enough to fix the problems and have its eligibility reinstated. In the New York Times report, Grigory Rodchenkov, a former director of Russia’s antidoping laboratory, detailed how a doping program that involved dozens of athletes unfolded at the Sochi Games. Dr. Rodchenkov said state antidoping experts and members of the intelligence service covertly replaced tainted urine samples with clean ones collected from the athletes months earlier, before they started doping. Russia has reacted to the accusations with statements both deploring the use of   drugs by its athletes and vigorously rejecting contentions that it was involved. On Thursday, the Russian sports ministry acknowledged in a statement that doping problems existed among its athletes while expressing “shock” over Dr. Rodchenkov’s disclosures. Speaking to reporters the next day, a spokesman for President Vladimir V. Putin said, “All this simply looks like slander by a turncoat. ” The deputy sports minister, Yuri Nagornykh, said Russia and the athletes named in the Times article were considering whether to file a defamation lawsuit. On Sunday, Mr. Mutko struck a much more conciliatory tone. He said Russian officials were doing all they could to stamp out doping by the country’s athletes. He also said that aspiring Olympians would be subjected to additional tests and that two “international experts” were now based in Moscow to supervise the country’s antidoping agency. “We have done everything that has been asked of us by the I. A. A. F. in order to be reinstated,” Mr. Mutko wrote in The Sunday Times. However, he added, the scourge of doping extends worldwide. To single out Russia would be unfair, he said. “The Olympic Games should be a cause of unity,” he said. “Barring Russia’s athletes from competing in Rio would risk tearing this unity apart. ” Peter Donnelly, the director of the Centre for Sport Policy Studies at the University of Toronto, said on Sunday that Mr. Mutko had touched on a legitimate problem with how doping violations are handled by sports governing bodies. The International Olympic Committee and world sport federations need to find ways to target punishments at those who are complicit in an athlete’s doping, Dr. Donnelly said, adding, “It’s difficult for me to see how punishing all pending Russian Olympic track and field athletes can be considered as justice. ”'"}, "time": 1742562204.2928267}