{"duration": 0.09186172485351562, "input_args": {"text": "'From: Marina Abramovic <marinaxabramovic@gmail.com<;mailto:marinaxabramovic@gmail.com>;> Date: June 28, 2015 at 2:35:08 AM GMT+2 To: Tony Podesta <podesta@podesta.com<;mailto:podesta@podesta.com>;> Subject: Dinner Dear Tony, I am so looking forward to the Spirit Cooking dinner at my place. Do you think you will be able to let me know if your brother is joining? All my love, Marina \\nThere is much more to the Abramovic-Podesta-Clinton connection than this one e-mail and the social event it makes reference to — and much more than we can cover in this article. However, the MSM pro-Clinton press corps has studiously avoided these ties, except in the few instances where they have ventured into the cesspool to declare that there really is no “cess” there. That was the tack taken by Eric Levitz in a November 4 piece for New York Magazine , a reliable cheering section for Team Hillary throughout the campaign season. Entitled, “Spirit Cooking Explained: Satanic Ritual of Fun Dinner?” Levitz describes Tony Podesta as “a powerful lobbyist and ... a prominent collector of contemporary art.” “The message here is, ostensibly, a dinner invitation that makes playful reference to one of Abramovic’s past works,” writes Levitz . \\nYes, just a “playful,” “fun dinner,” that’s all. But, according to Levitz, the “tin-foil hat” conspiracy wackos of the “far-right fever swamp” have turned this innocent dinner gathering of the Podesta clan and their artistic muse into something sinister. Well, Mr. Levitz — like the Podestas, the Clintons, Lady Gaga, and Abramovic — apparently hales from a different precinct (if not a completely different planet or universe) than most normal, moral, decent Americans, who would be inclined to find the Abramovic dinner “art” both creepy and sinister. Levitz is not unaware of Abramovic’s ultra-dark side; he includes an imbedded video in his article of her performing her infamous Spirit Cooking . (Warning: graphic content, viewer discretion advised.) \\nThe New York mag writer slams the Alex Jones/Info Wars website and Drudge Report for making an issue of these innocuous goings on; they’re obviously unsophisticated rubes with no appreciation for high-toned culture, right? There ain’t no Satanists here, you fools, just artistic types enjoying some campy fun. Right? Well, Drudge and Jones are probably a lot closer to the mark than Levitz. Besides the Spirit Cooking video, Alex Jones includes (among other evidence) a Marina Abramovic portrait (shown above) in which she frames her face with the horns of a bloody goat skull, the symbol of Baphomet, one of the most common Satanic images. Other portraits of the “artist” can be found online showing her with a mouthful of live snakes, as well as her signature fixation on death, cannibalism, and — in general — the lewd, crude, nude, and rude. \\nMarina Abramovic, an unquenchable narcissist, apparently is unsettled by the sudden critical attention, since she is used to being worshipped and fawned over. On November 4, she exploded with the Tweets: “I am not a Satanist! Stop it!” and “My friends, please stop twittering me with tag spiritcooking! Just enjoy art and stop asking me about politics.” Unfortunately for her, she must have forgotten that her Twitter account she used in an attempt to dispel the Spirit Cooking occultism, is “@AbramovicM666.” Probably not the wisest move she’s made. \\n(For an additional spirited and rational discussion of the Spirit Cooking e-mails and their related “context,” see also: Spirit Cooking: Evil In Government: Mike Cernovich, Vox Day and Stefan Molyneux .) \\nThe Clinton-Podesta-Abramovic tie-in might be written off by many doubters as merely a titillating, sensational election-eve story scraped up by political opponents. However, it cannot be written off so easily because it goes to the heart of darkness of the Clinton “organized crime cesspool” that the FBI’s former assistant director James Kallstrom referred to. \\nIt comes on the heels of a long train of verified stories that are interrelated, most especially regarding criminal activities with minors and children. There is, for starters, the long-running close relationship between hedge fund billionaire (and convicted pedophile) Jeffrey Epstein, whose Manhattan mansion and private island estate in the Caribbean have been the sites for many notorious sex parties — especially for Democratic politicians, celebrities, and high-end political donors. Bill and Hillary Clinton, reportedly, have made multiple trips to Epstein’s lair, known as “Sex Slave Island,” which offers a luxurious getaway excursion outside the jurisdiction of authorities who might get in the way of sexual frolicking with teens — and even younger kids. \\nHillary Clinton’s ties to Democratic Congressman Anthony Weiner and the most recent revelations coming from his computer underscore the fact that at the highest levels of power in Washington, D.C., top officals of both parties for many years have been winking at the criminal sexual exploitation of children by politicians and their high-placed friends. Only rarely do the offenses leak out in a way that ends up with prosecution of the powerful, as in the case of Republican Speaker of the House Dennis Hastert, a serial abuser of teenage boys. But, as we have reported, Hastert was just the tip of the iceberg . \\nRelated to this same subject matter are e-mails between Hillary Clinton and her then-top aide Cheryl Mills regarding one Laura Silsby, who was arrested and charged with child abduction and child trafficking in Haiti, after the island was devastated by a hurricane in January 2010. Silsby and nine others posing as missionaries for a non-existent Christian orphanage were apprehended by authorities while attempting to smuggle a busload of 33 Haitian children off the island. Turns out they weren’t orphans after all, and their parents accused Silsby of deception. Silsby’s attorney was convicted felon Jorge Torres Puello, who, at the time, was a fugitive from U.S. authorities for alien smuggling. That should have sent up a red flag or two! (Torres Puello was subsequently captured, prosecuted, and sentenced to three years in U.S. federal prison for alien smuggling .) \\nHowever, thanks to intercession by Secretary of State Hillary Clinton and former President Bill Clinton (who was serving as special UN envoy to Haiti, as well as ramrodding his own very profitable Clinton Foundation ventures in the tragedy-struck island), Laura Silsby’s charges were reduced and she was allowed to leave Haiti with time served. \\nSome analysts and critics have suggested that Silsby was kidnapping the Haitian children to be sold to child sex rings. The evidence we have seen thus far does not prove that claim, but neither is it a far-fetched supposition, considering the sordid sexual swamp that many of the high and mighty are mired in, and considering the Epstein-Clinton-Podesta revelations that are pouring out. At the very least, it must be seriously investigated, in light of the evidence available and the global crisis in child sex trafficking. \\nBut here, as in virtually every other scandal that has embroiled Hillary Clinton, her establishment media pals have given her a Teflon shield. Ditto for the revelations by Kathy Shelton of Arkansas, who, as a 12-year-old, was raped in 1975 by a 41-year-old drifter. Hillary Clinton was his defense lawyer. In a later interview, Clinton laughed as she recalled how she had gotten her child-rapist client off with some courtroom tricks. Moreover, as the victim recounts, Hillary made it appear that the 12-year-old Shelton was the one at fault. “Hillary Clinton lied, terrorized, & mocked me, defending my rapist,” Shelton has tweeted. \\nWhile the latest WikiLeaks releases related to sensational sexual matters are grabbing the headlines of the alternative media (and being ignored by the MSM), literally dozens of other hot issues exposed by WikiLeaks from the Clinton-Podesta e-mails have been either totally buried or hugely under-reported by the Clintonista press corps. In addition to the WikiLeaks revelations (and related exposés) that we have covered in the articles listed below this story, we point you to a helpful summary of several dozen Clinton scandals compiled by Montana researcher activist Clarice Ryan for the Gem State Patriot . In addition, there is a more detailed, annotated online resource with URL links entitled, “The Top 100 Most Damaging Wikileaks (so far)” that is a helpful guide to the thousands of leaked e-mails. Photos at top: Hillary Clinton; Marina Abramovic \\nRelated articles:'"}, "time": 1742628313.392666}