{"duration": 0.047354936599731445, "input_args": {"text": "'Could Hillary Start World War III? Could Hillary Start World War III? By 0 48 \\nYou can condemn that semi-isolationist ‘America First’’ mindset if you want, but the easiest way to prevent the next world war is simply to let the Russians have what they want, provided it makes no difference to you. \\nLike Donald Trump or not – and I like him no more than, well, Hillary Clinton – there is one thing he might be good for. Peace. A small matter, I know, when set against his serial (alleged) philandering and worse, but worth pondering for a moment. A hideous, but necessary thought experiment runs something like this. \\nWhat is the single most important relationship the United States of America could build to secure world peace? Why, the same one that, when it goes horribly wrong, leaves us all sliding towards testing the doctrine of mutually assured destruction in a nuclear age. Always a bit mad to end up there. Yes, that’s right, the most important relationship is with the Russians , or, as we once knew them, the Soviets. They’re the ones we need to get along with. \\nNow this is where The Donald scores above his sensible, sane, intelligent and diplomatic Democratic opponent. Donald gets it. He gets that if you decide to run your foreign policy devoid of moral content with the sole guiding principle that “my enemy’s enemy is my friend” (copyright Joseph Stalin), then peace, cooperation, even alliance with Russia is possible, indeed desirable. \\nCurrent Prices on popular forms of Silver Bullion \\nThe Russians, more than a little cynically, have asked the West for decades to join them in a war against “Islamist terrorism”, but which they principally mean the separatist movements in Chechnya and elsewhere. Donald Trump is the first presidential contender, more even than George W Bush, who looks like he’d actually want to take them up on the offer. Trump is fixated to the point of racism on the militant Islamist violence that he tells his fearful audience is “just around the corner”. It is all too easy to imagine a state visit by Vladimir Putin to Washington where he is feted and falls into the arms (we hope no more) of an affectionate President Trump. The US-Russia Strategic Partnership would be the fruit of that particular liaison, with secret provisions, no doubt, on assassinating terrorist leaders, and public pledges on intelligence sharing, with the whole relationship consummated by series of joint bombing raids in Syria. They would share a goal to destroy Isis, even though they have not been able to do so recently, because it would be part of a wider cooperation. Such would be the new world order.'"}, "time": 1742562173.9481196}