{"duration": 0.05557513236999512, "input_args": {"text": "'Today, in the light of the morning, what do we have in America today?\\nWe have watched a tidal wave come ashore in Washington DC. We saw the impossible, according to the pundits. \\nBut let’s have a bit of sobriety to go along with the wry smile, ok?\\nWe still have policy acts that need to be addressed. In specific order of priority:\\nHealth care monopolies must be broken up and those in the industry who resist must be jailed under existing anti-trust law. This has to happen right up front, especially if we are going to do “tax reform” (and we should) or the result will be deficits that explode so fast, and so ruinously that they will force interest rates up to near or even beyond those of the early 1980s, bankrupting everyone at once that has any debt at all. Simply put you have to take close to a trillion dollars out of the Federal Budget and $2 trillion out of the economy as a whole in terms of spending in this sector or our nation does not fiscally survive. This was true yesterday and it still is. The problem is illustrated here and one potential set of solutions is here , along with my 2012 article here .. “Repeal and replace” will not do it ; you need to attack the problem, not remove the band-aids that were put over a sucking chest wound. President Trump can do the largest part of this without Congress since it requires only enforcing existing anti-trust law, and the responsibility to enforce the law rests solely with the Executive. The swamp must be drained. Candidate Trump repeatedly called for it. President Trump has to do it. Again, this is a function of existing law and therefore requires exactly zero Congressional buy-in. While cabinet-level positions require Senate approval the rank and file cop on the street positions in the US Government do not. There are an utterly insane number of crimes that have been committed over the last two terms and while the Statute of Limitations has run on some of them it has not run on all. Those for which prosecution is still possible must be prosecuted. This is not only important in the medical realm (see above) but also in the financial realm. We can start with Wells Fargo and their recently-exposed outrageous and blatant robbery of their customers but it must not end with “trophy” prosecutions. It is especially important for the stability of our markets and returning some resemblance of trust to them that all persons or organizations that have engaged in various forms of market manipulation which is illegal, I remind you, be held to account. Whether it be “spoofing”, placing orders you cannot clear (because you don’t have the margin to do so) or simply placing orders you never intend to execute (which is illegal and has been since the 1930s ) these crimes must be prosecuted as far back as the Statute of Limitations permits and aggressive prosecution on a forward basis must continue. Most of the rest of what President Trump has promised to do in his Contract with Voters does need Congressional approval. Yes, he can cancel executive orders that were outrageously improper — and he should. But when it comes to tax and trade policy for the most part those issues do require Congressional approval, and here’s the rub for any Republicans who think they can play “ Never Trump ” post this election: With both Houses of Congress there is only party to blame for any sort of obstructionism. If the Republicans wish to lose both houses of Congress in a couple of years all they have to do is keep larding up the debt and refuse to take the issues that must be addressed by both Congress and the Executive on, and it’ll happen. \\nOriginally posted at Market Ticker .\\n'"}, "time": 1742564577.8485146}