{"duration": 0.035562753677368164, "input_args": {"text": "'SEOUL, South Korea  —   North Korea said on Saturday that a diplomat in its London embassy who recently defected to South Korea had fled rather than face punishment for various crimes, calling him “human scum. ” The statement, from the official Korean Central News Agency, was North Korea’s first reaction to the defection of Thae   its most senior official to defect in almost two decades. The defection of Mr. Thae, who was the No. 2 diplomat in the embassy, was announced by South Korea on Wednesday. The North Korean statement said Mr. Thae, whom it did not identify by name, had been ordered in June to return from Britain to Pyongyang, the North’s capital, because he had embezzled state funds, sold official secrets and sexually assaulted a minor. The statement offered no evidence for those accusations. Rather than return home, the statement said, Mr. Thae “proved himself to be human scum who betrayed the fatherland” by fleeing. It said that North Korea had informed the British government of the accusations against Mr. Thae and asked that he be handed over to North Korean officials, but that London had instead created an “indelible stain” in relations between the countries by letting him go to South Korea, to be used in a “smear campaign” against the North. South Korea has not explained how or when Mr. Thae made his way to the country with his wife and children, and the North Korean statement suggested that he had been in British custody beforehand. There was no immediate response from the British or South Korean government. North Korea has typically referred to its defectors as “scum” or “traitors,” often accusing South Korea’s intelligence agency of kidnapping them. On Friday, Jeong   a South Korean government spokesman, said he expected the North to react similarly to Mr. Thae’s defection. Doing otherwise “would be tantamount to admitting to the inferiority of its own regime,” he said. The South has said that Mr. Thae defected out of disillusionment with the North Korean government, and that his decision to flee was a sign that such sentiments were spreading among the North Korean elite.'"}, "time": 1742628517.156539}