{"duration": 0.21400189399719238, "input_args": {"text": "'Eric Zuesse First, the context in which the issue of war against Russia has been raised: Syria’s government is allied with Russia’s government, and ‘The West’ is trying to overthrow Syria’s government and is bringing into Syria, and arming, tens of thousands of jihadists there, as the footsoldiers to do it. Syria and Russia are bombing the people that we are bringing in. The Presidential candidate of the U.S. Democratic Party, Hillary Clinton, is a longstanding and ardent proponent of the U.S. establishing a “no-fly zone” over at least the parts of Syria where non-ISIS jihadists — the jihadists that are financed and armed by the U.S. and its allies (mainly by the Sunni fundamentalist royal families who own Saudi Arabia and Qatar) — have conquered territory from Syria’s (legitimate and internationally recognized) government. It’s conquest of Syria, that the U.S. is backing. The U.S., in both law and fact, is already participating in an invasion of Syria. Syria’s government is run by the ideologically committed anti-Sharia-law and non-sectarian Ba’ath Party, under President Bashar al-Assad, who happens to be nominally an Alawite Shiite (and fundamentalist Sunnis hate Shiites, and all of the jihadists are fundamentalist Sunnis, just as the royal Saudi and Qatari families are ), and Assad has always crushed jihadists in Syria — until Barack Obama became the U.S. President. As soon as Obama came into power, he and Hillary Clinton were working behind the scenes for the overthrow of Bashar al-Assad. Clinton has committed herself clearly to completing what President Obama has started. And she intends to do it by means of instituting in Syria a no-fly zone like she did in Libya ( a big win for her ). But there is a big difference: Russian planes weren’t defending Muammar Gaddafi’s Libyan government. Russian planes are defending Bashar al-Assad’s Syrian government. For the U.S. government to institute a no-fly zone in Syria would mean that the U.S. would shoot down Syrian government planes that are bombing the U.S.-backed jihadists who are fighting to overthrow and replace Assad’s government. Of course many civilians are getting bombed by both the U.S. and Syrian sides, and some of the victims of the Syrian government’s side are publicized on U.S.-allied television in order to stir hatred against Assad and help (the non-ISIS, U.S.-backed) jihadists (such as Al Qaeda in Syria), but this is the way of war — and the propaganda for war — and no “no-fly zone” will improve that situation, but could possibly make it far worse. Russia’s participation in the Syrian war is not an invasion, but America’s is. The Syrian government had requested assistance from the Russian government to help kill all of the jihadist groups (not only ISIS but Al Qaeda in Syria and all the others, all of which are backed by the U.S. and by the royals who own Saudi Arabia and Qatar). The jihadists are trying to overthrow and replace Syria’s secular government. On 30 September 2015, Russia started its bombing campaign there, which continues. Consequently, the U.S.-established no-fly zone in Syria would also be shooting down Russian bombers. At that point, where the U.S. and Russia are at war against each other in Syria due to America’s no-fly zone (in a country where we’re invaders , not invited in by the nation’s government, such as the Russian planes are), either one side or the other would surrender, or else nuclear war would result. How likely would Syria and Russia be to surrender Syria? How likely would the U.S. be to surrender to Russia and Syria? (After all: Hillary Clinton is passionately anti-Russian and anti-Syrian.) In other words, and in short: nuclear war is the likely outcome if Hillary Clinton becomes elected President of the United States . It would be practically unavoidable, if she is elected. The domestic U.S. politics that are associated with this shocking but clear fact are complex, but are likewise clear: The American public simply don’t know or understand these facts; and the reason they don’t is that these facts are hidden from them, as will be exemplified in the following ways: On October 26th, the U.S.-allied propaganda-agency Reuters headlined “Britain, U.S. sending planes, troops to deter Russia in the east” and pretended (without even acknowledging the actual facts of the matter) that this NATO action is a response to ‘deter’ Russia because Russia had accepted in 2014 the overwhelming desire of the residents of Crimea to become Russian citizens after the coup that U.S. President Barack Obama’s Administration had perpetrated in Ukraine during February 2014 , overthrowing the democratically elected Ukrainian President Viktor Yanukovych, for whom 75% of Crimeans had voted . Even Western-sponsored polls that were taken of Crimeans both before and after the resulting Crimean 16 March 2014 referendum on whether Crimea should be restored to being again a province of Russia (which Crimea was until the Soviet dictator Khrushchev had arbitrarily transferred Crimea to Ukraine in 1954) showed that over 90% of Crimeans wanted to do this and that even a higher percentage of them were mad as hell against what America was doing and extremely supportive of Russia’s position on this matter, but the U.S. government’s position is that it was instead ‘conquest of land’ by Russia, and the U.S. and its allies are pouring troops and weapons onto and near Russia’s borders in order to defend against ‘ Russian aggression’ . The power of sheer propaganda! It’s crucial in politics. The way the Reuters ‘news’ report phrased this matter was “NATO’s aim is to make good on a July promise by NATO leaders to deter Russia in Europe’s ex-Soviet states, after Moscow orchestrated the annexation of the Crimea peninsula in 2014.” That’s not as much of a lie as the U.S. President’s use of the word ‘conquest’ to describe Russia’s role there is, but it’s close. Reuters’s report opened with “Britain said on Wednesday it will send fighter jets to Romania next year and the United States promised troops, tanks and artillery to Poland in NATO’s biggest military build-up on Russia’s borders since the Cold War.” But in order to play down the danger here, they refused to headline their ‘news report’ with that, it’s real, actual, news, which was: “NATO’s biggest military build-up on Russia’s borders since the Cold War.” That headline would have attracted far more readers, but in the ‘news’ business in a dictatorship , that’s not the main objective when reporting news that the government wants to bury instead of to go viral. It’s part of ‘news’-management, which includes burying what is important. Then, Reuters quoted the U.S. Secretary of ‘Defense’, who said: “It’s a major sign of the U.S. commitment to strengthening deterrence here.” After the Soviet Union dissolved in 1991, and in the same year terminated its Warsaw Pact military alliance that had been set up by the Soviet Union to mirror America’s NATO alliance, NATO expanded right up to Russia’s borders and is therefore highly aggressive and threatening toward the people of Russia , who don’t like missiles minutes away, any more than Americans would like if Russia took over Mexico and placed troops and missiles on our border. But, according to the U.S.-and-allied propaganda-line, this strangulation of Russia by NATO is ‘deterrence’ against Russia. Then, when Russia responds to such U.S.-aggression by positioning troops and weapons to their side of their border, that’s called ‘aggressive’. And NATO is ‘responding’ to ‘Russia’s aggressive moves’. It’s like blaming a raped woman for trying to defend against her rapist. Hillary Clinton’s actions (never her rhetoric) show that she wants more of that type of thing, especially regarding the Russian people, whom the U.S. government wants to conquer by eliminating their international allies, one by one — and then by eliminating their own leader Vladimir Putin himself, after the original ‘regime change in Iraq’ (whose Saddam Hussein was the first Russia-friendly leader to be eliminated; then Muammar Gaddafi, then Bashar al-Assad, then Viktor Yanukovych ). The pattern is clear. And now NATO is going in for the kill. But this reality is not how America’s ‘impartial’ press reports what is actually a buildup toward a possible NATO invasion of Russia. Of course, America’s Republican Party (or conservative) press have long been controlled by neoconservatives (they were all supportive of ‘regime-change in Iraq’, and the American public never punished them for that — mega-criminal deceit goes unpunished), and so they don’t even pretend to be anything more than nationalistic mouthpieces for the U.S. government’s conquests. However, the Democratic Party’s (or liberal) press do need to cater to some progressive anti-nationalistic audiences. Yet still neoconservatism dominates at such newspapers as The New York Times and the Washington Post , as well as in magazines such as The Atlantic , The New Republic , and Foreign Policy , all of which are, if anything, neoconservative Democratic Party organs. All of them endorse Hillary Clinton. But there is a small progressive wing to American ‘journalism’; and, so, here is how one of the progressive sites, Common Dreams, handles this crucial matter, which might soon end the world as we know it: they headlined on October 26th, “NATO Preps ‘Biggest Military Build-Up on Russia’s Borders Since Cold War’,” and opened (quoting from Reuters and other Western sources): Playing “a dangerous game,” NATO pushes allies to send more troops and military equipment to Eastern Europe. NATO is pushing all allies to deploy more troops and military equipment to Russia’s borders, further ratcheting up tensions as the West prepares for “its biggest military build-up on Russia’s borders since the Cold War,” as Reuters observed. “France, Denmark, Italy and other allies are expected to join the four battle groups led by the United States, Germany, Britain, and Canada to go to Poland, Lithuania, Estonia, and Latvia, with forces ranging from armored infantry to drones,” Reuters reported. “Yet with the U.S. openly talking [about] a war with Russia, the continued deployments seem far from a purely defensive measure,” argued Antiwar.com’s Jason Ditz [who said]: ”Diplomats also suggested it was only partly about sending a message to Russia, and that the real point of the latest push is to get a bunch of nations involved as a ‘message’ to U.S. presidential nominee Donald Trump, who has complained the U.S. is spending too much defending Europe and that Europe isn’t doing enough on its own. That underscores the cynical nature of the deployments, and indeed the sort of thing adding to the sense of NATO being obsolete, that they feel they can afford to organize major deployments just for the sake of scoring political points in member nations’ elections.” These moves are shortsighted, to say the least, wrote Gilbert Doctorow of the American Committee for East-West Accord [by saying]: “America’s steady campaign of expanding NATO, […] its vilification of Russia, and its information war based on lies” are part of “a dangerous game” that is pulling all sides inevitably closer to war, Doctorow argued. Nothing was provided there that highlighted the stark contrast between the strongly anti-invasion Republican Presidential candidate Trump, versus the strongly pro-invasion Democratic candidate Clinton. In other words, no essential context was provided — no context of a policy-decision that America’s voters will have to make, choosing the one or the other to be the next President. Instead, ‘progressive’ news-sites treat their readers and audiences as mere fools who think that voting for a third-party candidate in a U.S. Presidential contest is not a wasted vote, like refusing to vote at all is. The overwhelming majority of the 100+ reader-comments to that Common Dreams report, who expressed a Presidential choice said “Vote Green” or “Jill Stein,” referring to a third-party candidate who stands no chance of winning even one of the 50 U.S. states. In other words: the readers at this progressive site are so unconcerned about the future of the world, that they don’t even care whether the next U.S. President would be Hillary Clinton who would cause nuclear war, or Donald Tump who has consistently argued against her neoconservatism and emphasized the necessity of ending the U.S. government’s rabid hostility toward Russia and ending expansion of NATO up to Russia’s borders. In other words: despite progressive rhetoric, they’re actually oblivious to the world’s future — oblivious to the most important thing of all. And, so, that is the domestic politics of the war that the U.S. elite are determined to wage against Russia. The fix is in for nuclear war. To the owners of the media, the people who hire and fire — and promote and demote — the “news’ people, and thus who shape what the public know and understand and what the public don’t, it’s better that the outcome of the U.S. election be determined by whether or not Donald Trump is a rapist, than by whether or not Hillary Clinton will bring about nuclear war with Russia. So, it’s the way things are. In the U.S.-allied nations such as Britain, the ‘news’ media are similar. For example, Britain’s liberal Guardian headlined on October 27th, “Nato and Russia playing dangerous game with military build-up: Russia wants to detract from problems at home and position itself as a superpower, and Nato troop movements can only help.” It said that, “amid western suspicions the Russian fleet will be used to flatten civilians in Aleppo, Nato’s apparent goal here is to deter future acts of aggression on European territory by Vladimir Putin’s revanchist Russia.” That might as well have been written by the Obama Administration, as by some ‘news’ person. ‘The West’ is clearly behind the plan. Of course, the American public haven’t yet spoken.'"}, "time": 1742562140.9758487}