{"duration": 0.05512857437133789, "input_args": {"text": "'Financial Markets , Gold , Market Manipulation , Precious Metals , U.S. Economy gold coins , money supply , silver eagles , stock bubble admin \\nShort answer: No. \\nA local financial advisor texted me today asking what I thought gold would do if Hillary wins today. Obviously he’s been reading the pedestrian analysis on the topic that has flooded the mainstream media. \\nBut gold doesn’t care who wins. The United States is beset with unsolvable financial and economic issues that will require a systemic reset. The amount of funded Treasury debt outstanding since Obama took office has doubled to $20 trillion. So much for his claim that he reduced the spending deficit. But the result would have been the same if McCain had won in 2008 or if Romney had won in 2012. \\nStocks and bonds are historically overvalued. While the accounting standards have been substantially liberalized thereby enabling companies to artificially boost earnings with gimmicks, using comparable accounting rules to compare now to any other market top in history would show that current valuation ratios are significantly higher than at any other time in the history of U.S. markets. The bond argument is easy: interest rates are at or near all-time lows. Rates can only go higher which means bond prices can only go lower (unless artificially taken negative by the Fed, which would cause gold to go parabolic) . \\nWith fiat paper assets at historically overvalued levels, gold and silver are highly undervalued relative to financial assets and in relation to the quantity of paper money, where the quantity paper money is currency issued plus credit outstanding. The latter is included because debt functions exactly like currency until it’s repaid. Guess what? This country has not reduced the cumulative public and private debt outstanding in the post-World War Two period. The small “blip” indicating overall debt declined in 2010 reflects massive banking sector write-offs and debt-forgiveness, both of which were monetized by the Fed. As long as the level of debt increases, credit outstanding needs to be included in the money supply. \\nThe bottom line is that gold is going to move much higher in value relative to the dollar regardless of which candidate or which party controls the political process. The laws of nature and economics remain constant throughout history. When the Central Bank and Government market intervention eventually fails and these laws reassert their force – which they always do – the “money” that floods out of stocks and bonds will flood into physical gold silver. Share this:'"}, "time": 1742564154.0161014}