{"duration": 0.13687348365783691, "input_args": {"text": "'There’s something about the cooler fall weather that makes my family want to huddle up indoors and eat sweets. Humans are likely programmed to do just this, but let’s not let a change of seasons derail our healthy eating. Here are 5 modified classic fall recipes that will still make your house smell amazing and satisfy your sweet tooth—all without packing on the pounds.\\n5 Favorite Fall Recipes – the Healthy Way! 1. Pumpkin Pie Pumpkin pie defines the Thanksgiving holiday in my household—we eat it as a dessert, but we also eat the leftovers for breakfast. This version adds in rolled oats for fiber and has healthy ground flax, but the full-fat coconut milk means a rich, creamy pie that satisfies.\\nIngredients: \\n1 can (15oz) pumpkin puree 1 (13.5oz) can full-fat coconut milk 1/4 cup gluten-free rolled oats 2 tbsp ground flax 1/4 cup coconut sugar 2 tbsp molasses 2 tsp cinnamon 1 tsp pumpkin pie spice 1/2 tsp salt 1 tbsp pure vanilla extract Instructions: \\nPreheat oven to 400 degrees. Mix the above ingredients together, then pour into a prepared pie crust in a 10-inch round pan. Bake for 30 minutes (it might still appear undercooked—don’t worry!). Let your pie cool, then refrigerate for at least 5 hours. 2. Apple Cider Ingredients: \\n6 cups of organic apple juice 1/4 cups of real maple syrup (you can use even less – let’s face it, apple juice is sweet on its own) 2 cinnamon sticks 6 whole cloves 6 whole allspice berries (optional)* 1 orange peel, cut into strips (optional)* 1 lemon peel, cut into strips (optional)* *Remember, the richness of flavor makes up for a lack of sugar—I’d rather have a spicier cider than one that is too syrupy sweet…\\nInstructions: \\nPour the apple juice and maple syrup into a large stainless steel saucepan. Place the cinnamon sticks, cloves, allspice berries, orange peel and lemon peel in the center of a washed square of cheesecloth; fold up the sides of the cheesecloth to enclose the bundle, then tie it up with a length of kitchen string. Drop the spice bundle into the cider mixture. I’m not that concerned if it all sits in the broth loose – just be careful not to pour it into your mugs when you serve it. Place the saucepan over moderate heat for 5 to 10 minutes, or until the cider is very hot but not boiling. You can leave it on the lowest simmer during a party. Remove the cider from the heat. Discard the spice bundle. Ladle the cider into big cups or mugs, adding a fresh cinnamon stick to each serving if desired. 3. Slow Cooker Baked Apples I love using my slow cooker, especially during autumn. It’s so nice to throw some ingredients in during the morning and then to come home to a house that smells amazing. This simple dessert makes use of the natural sweetness of apples and leaves out much of the sugar.\\nIngredients: \\n5 cups sliced peeled Granny Smith apples (4 medium) 5 cups sliced peeled Braeburn apples (4 medium) ¼ cup margarine (optional) 2 tablespoons fresh lemon juice ¼ cup packed brown sugar (you can even use less or leave it out entirely—experiment to see what works the best for you) 2 teaspoons ground cinnamon ¼ cup apple cider Instructions: \\nSimply mix all ingredients and cook on low for 3-4 hours. If you’re going to be out all day make sure to set the timer on your slow cooker so the apples don’t get mushy. 4. Spiced Pear Cake This spiced pear cake is a crowd pleaser and a great way to use up your canned pears. We’re leaving off the icing in order to make this a healthier choice, but see this recipe for a richer, more decadent version.\\nIngredients \\nFor cake:\\n1 quart-size jar of canned spiced pears , drained (about 3 cups) 3 large eggs 1 1/2 cups of maple syrup 1 1⁄4 cups coconut oil 3 cups gluten-free all-purpose flour 1 teaspoon salt 1 teaspoon baking soda 1/4 cup walnuts or pecans, coarsely chopped 2 teaspoons vanilla extract Instructions\\nPreheat oven to 350°. In a large mixing bowl, beat eggs, 2 cups sugar, and oil until blended. Combine flour, salt, and baking soda, and add to egg mixture, stir slowly until blended. Fold in pears, chopped nuts, and vanilla extract. Pour batter into a greased and floured 10-inch Bundt pan. Bake at 350° for 1 hour or until a wooden pick inserted in center of cake comes out clean. 5. Pumpkin Spice Waffles Adding a little pumpkin spice is a surefire way to savor the fall weather (just ask Starbucks!). Working pumpkin into this traditional waffle recipe (and then tweaking to make it healthier) is a great way to make your breakfasts festive for the fall.\\nIngredients \\n3/4 cup maple syrup 3 tablespoons cornstarch 1-1/4 cup gluten-free all-purpose flour 1-1/2 teaspoon baking powder 1/2 teaspoon sea salt 2 teaspoon cinnamon 2 teaspoon ginger 1/4 teaspoon cloves 1/2 teaspoon nutmeg 2 large eggs 1 cup 2% milk 1 cup canned solid-pack pumpkin 4 tablespoons unsalted butter, melted and warm Instructions: \\nLightly oil and preheat waffle iron. In a large bowl, combine brown sugar and cornstarch in a large bowl. Whisk together to break apart the cornstarch and blend. Add the remaining dry ingredients, and whisk to blend. Separate eggs: yolks go in a medium sized bowl and whites get set aside in a smaller bowl. In a medium bowl, add pumpkin, milk and egg yolks. Whisk to blend. In a small bowl, whip egg whites with a hand mixer on high until stiff peaks form. Set aside. Pour melted butter into pumpkin mixture. As you pour, whisk to combine. Add the pumpkin mixture to the dry ingredients, and mix together until just combined. Slide the whipped egg whites out of the bowl and onto the mixture you just prepared. Gently fold them in until completely mixed. Once the waffle iron is heated, pour batter and press down until ready – about 3 minutes. Pamela Bofferding is a native Texan who now lives with her husband and sons in New York City. She enjoys hiking, traveling, and playing with her dogs.\\nThis information has been made available by Ready Nutrition \\nOriginally published November 9th, 2016 Pumpkin Spice Waffles Spiced Pear Cake Warm Drinks for the Chilly Season 8 Delicious Things to Make With Pumpkin Guilt-Free Chocolate Fudge Brownies {gluten free and paleo} '"}, "time": 1742563337.7690642}