{"duration": 0.0885002613067627, "input_args": {"text": "\"License DMCA \\nWill Trump pull a Brexit times 10? What would it take, beyond WikiLeaks, to bring the Clinton (cash) machine down? Will Hillary win and then declare WWIII against her Russia/Iran/Syria axis of evil ? Will the Middle East totally explode? Will the pivot to Asia totally implode? Will China be ruling the world by 2025? \\nAmidst so many frenetic fragments of geopolitical reality precariously shored against our ruins, the temptation is irresistible to hark back to the late, great, deconstructionist master Jean Baudrillard. During the post-mod 1980s it was hip to be Baudrillardian to the core; his America, originally published in France in 1986, should still be read today as the definitive metaphysical/geological/cultural Instagram of Exceptionalistan. \\nBy the late 1990s, at the end of the millennium, two years before 9/11 -- that seminal before and after event -- Baudrillard was already stressing how we live in a black market maze. Now, it's a black market paroxysm. \\nGlobal multitudes are subjected to a black market of work -- as in the deregulation of the official market; a black market of unemployment; a black market of financial speculation; a black market of misery and poverty; a black market of sex (as in prostitution); a black market of information (as in espionage and shadow wars); a black market of weapons; and even a black market of thinking. \\nWay beyond the late 20th century, in the 2010s what the West praises as liberal democracy -- actually a neoliberal diktat -- has virtually absorbed every ideological divergence, while leaving behind a heap of differences floating in some sort of trompe l'oeil effect. What's left is a widespread, noxious condition; the pre-emptive prohibition of any critical thought, which has no way to express itself other than becoming clandestine (or finding the right internet niche). - Advertisement - \\nBaudrillard already knew that the concept of alter -- killed by conviviality -- does not exist in the official market. So an alter black market also sprung up, co-opted by traffickers; that's, for instance, the realm of racism, nativism and other forms of exclusion. Baudrillard already identified how a contraband alter , expressed by sects and every form of nationalism (nowadays, think about the spectrum between jihadism and extreme-right wing political parties) was bound to become more virulent in a society that is desperately intolerant, obsessed with regimentation, and totally homogenized. \\nThere could be so much exhilaration inbuilt in life lived in a bewildering chimera cocktail of cultures, signs, differences and values; but then came the coupling of thinking with its exact IT replica -- artificial intelligence, playing with the line of demarcation between human and non-human in the domain of thought. \\nThe result, previewed by Baudrillard, was the secretion of a parapolitical society -- with a sort of mafia controlling this secret form of generalized corruption (think the financial Masters of the Universe). Power is unable to fight this mafia -- and that would be, on top of it, hypocritical, because the mafia itself emanates from power. \\nThe end result is that what really matters today, anywhere, mostly tends to happen outside all official circuits; like in a social black market. \\nIs there any information truth? - Advertisement - \\nBaudrillard showed how political economy is a massive machine, producing value, producing signs of wealth, but not wealth itself. The whole media/information system -- still ruled by America -- is a massive machine producing events as signs; exchangeable value in the universal market of ideology, the star system and catastrophism. \\nThis abstraction of information works as in the economy -- disgorging a coded material, deciphered in advance, and negotiable in terms of models, as much as the economy disgorges products negotiable in terms of price and value. \\nSince all merchandise, thanks to this abstraction of value, is exchangeable, then every event (or non-event) is also exchangeable, all replacing one another in the cultural market of information. \\nAnd that takes us to where we live now; Trans-History, and Trans-Politics -- where events have really not happened, as they get lost in the vacuum of information (as much as the economy gets lost in the vacuum of speculation).\""}, "time": 1742562183.1734426}