{"duration": 0.06392836570739746, "input_args": {"text": "'Nancy Armour, writing at USA Today, believes Tom Brady has a lot of explaining to do this Super Bowl week for his friendship with President Donald Trump. Moreover, in the same article, she praises Colin Kaepernick for being “eloquent” in his criticism of law enforcement in America. [The San Francisco 49ers quarterback, who refused to stand for the Star Spangled Banner this season and wore socks with pigs dressed in police uniforms, is “eloquent in detailing his concerns over police brutality in minority communities. He’s sparked conversations and reflection in NFL locker rooms and beyond,” states Armour. “Kaepernick has been open, available and consistent with his opinion. ”   As she trashes the 45th president of the United States, Armour seems surprised when Kaepernick is “portrayed as     and  . ” The writer empathizes with the beleaguered QB because after all, he denies those charges. “He’s had insults, slurs and worse directed at him. He was blamed for the drop in TV ratings early in the season,” Armour laments. And to the author, perhaps the worst insult you could possibly levy on Kaepernick is that “One person last week even tried to say Trump’s election was partly the result of Kaepernick’s protests. ” Of course, as far as Brady is concerned he deserves some tough questioning for his friendship with the president. “Trump’s campaign was steeped in racism, bigotry, and misogyny, and he has doubled down on his hatred in his first week as president. It’s left Americans across the country angry and frightened, fearful that the ideals that have made this country exceptional for more than 200 years are being abandoned,” Armour opines.  Brady describes his relationship with Trump as a long time friendship. He also had the audacity to have a “Make America Great Again” hat in his locker. For Armour that makes the Patriot’s star in support of racism and misogyny, that is unless he can unfriend Trump, Armour leads us to believe.  But, Brady said about the president that, “if you know someone, it doesn’t mean that you agree with everything that they say or do. Right?” “There’s things I don’t believe [in] absolutely. I don’t believe in, you know, there’s a lot of things,” Brady continued. “Not to denounce anything, it’s just that there are different things that I feel like, you know   …     I don’t agree with everything. That’s fine, right?” Nope. That’s not good enough for Armour. Brady must be interrogated this week about Trump. And if he doesn’t know how to open himself to the media then all he needs to do is call on Colin. Because, “If Brady needs an example of how that’s done, he can look at Kaepernick,” Armour informs us. '"}, "time": 1742564475.6058314}