{"duration": 0.03734183311462402, "input_args": {"text": "'A Nevada Congressional candidate is finding himself at the center of a legal controversy following the release of attack ads blaming infamous cattle rancher Cliven Bundy for the deaths of Las Vegas police officers Alyn Beck and Igor Soldo.\\nIn response to the attack ads which depict Bundy’s mugshot and allege that his 2014 standoff with the Bureau of Land Management led to “the deaths of two Las Vegas police officers,” Bundy has filed a lawsuit calling the allegation nothing more than hateful and libelous rhetoric.\\nThe ads which were released by Democratic candidate Ruben Kihuen’s campaign take a huge leap attempting to blame Bundy for the deaths of the police officers by referencing an incident that followed two months after the standoff.\\nKihuen is challenging U.S. Rep. Cresent Hardy (R) for his seat in Nevada Congressional District 4.\\nSo why does Kihuen believe that Bundy is responsible for the murder of two police officers?\\nVia RJ … the Millers had visited the Bundy ranch at one point to join the protesters, but didn’t fit in and left the group. The lawsuit says the Millers went to the ranch but never met or spoke to Bundy before they were forced to leave.\\nBundy’s lawsuit calls the mailer connecting Bundy’s conflict to the police shootings as “libelous” and complains that it exposes Bundy to “hatred, contempt, ridicule and obloquy because it insinuates that (Bundy) orchestrated and promoted the disgraceful and disgusting acts of the killing of two local law enforcement officers.”\\nThe lawsuit says the ads came in the forms of television ads and mailers.\\n…It shows a mugshot of Bundy and states: “This man’s armed standoff led to the deaths of two Las Vegas police officers.” The mailer adds: “And he’s supported by Congressman Hardy.”\\nThoughts on this? Let us know in the comment section below.\\n'"}, "time": 1742564162.148435}