{"duration": 0.08685040473937988, "input_args": {"text": "'in: Government , Government Corruption , Obama Exposed , War Propaganda , World News October 20 marked the fifth anniversary of Muammar Gaddafi’s sodomized-related death – US imperial viciousness responsible for his murder and destruction Africa’s most developed, socially responsible nation. Endless violence and chaos replaced a society safe and fit to live in. Gaddafi provided Libyans with important benefits Americans can’t imagine. More on this below. Hillary orchestrated war to eliminate him, wanting US-controlled puppet governance replacing Libyan sovereign independence. In early 2011, made-in-the-USA protests preceded US-led NATO terror-bombing, indiscriminately massacring civilians, creating charnel house conditions. Endless violence continues daily, exacerbated by ISIS fighters infesting parts of the country, Washington supporting them with funding, weapons and other material aid. Obama and Hillary wanted Gaddafi eliminated for instituting policies all nations should embrace. Previous articles discussed them. He supported pan-Africanism, a United States of Africa free from imperial domination. He wanted Libyans sharing in the country’s oil wealth, a notion foreign to America and other Western powers. Under his 1999 Decision No. 111, all Libyans got free healthcare, education, electricity, water, training, rehabilitation, housing assistance, disability and old-age benefits, interest-free state loans, as well as generous subsidies to study abroad, buy a new car, help couples when they marry, practically free gasoline, and more. Literacy under Gaddafi rose from 20 – 80%. Libya’s hospitals and private clinics were some of the region’s best. Now they’re in shambles. Vital public services he provided no longer exist. Pre-war, Libyans had African’s highest standard of living. Homelessness was nonexistent. Gaddafi believed all Libyans had a right to a home or rent-free apartment, notions unheard of in the West. He rejected farcical Western-style money-controlled democracy (sic), deplored crony capitalism and neoliberal harshness. During his tenure, women had the right to vote, participate politically, as well as own and sell property independently of their husbands. Clause 5 of Libya’s 1969 Constitution granted them equal status with men, notably for education and employment. In January 2011, weeks before US-led NATO naked aggression began, the UN Human Rights Council praised Gaddafi for instituting and supporting important political, economic, education, social and cultural rights. He called his Great Man-Made River (GMMR) development of an ocean-sized aquifer beneath Libya’s sands the “Eighth Wonder of the World” – wanting all Libyans sharing in its benefits. Washington and rogue Western partners wanted it privatized for exclusive corporate gain. Under Gaddafi, the Central Bank of Libya was state-owned, the interest-free Libyan dinar used for productive economic growth, not speculation, profits and bonuses for predatory bankers. He funded Africa’s only communications satellite, saving hundreds of millions of dollars for low-cost incoming and outgoing calls. He provided two-thirds of the $42 billion needed to launch a public African Central Bank, Monetary Fund and Investment Bank. He supported a new gold standard, replacing dollars with gold dinars, aiming to provide real monetary wealth and value, free from predatory Western lending agencies. Washington wants dollar hegemony, maintaining it as the world’s reserve currency, an agenda challenged by Russia, China and other nations, increasingly trading bilaterally in their own currencies. Russia’s Vladimir Putin is threatened. Neocons infesting Washington want regime change. His redoubtable leadership prevents it. Will nuclear war on Russia follow Hillary’s ascension to power next year? Will the unthinkable become reality? Submit your review'"}, "time": 1742561661.8607004}