{"duration": 0.08498334884643555, "input_args": {"text": "'WASHINGTON  —   The Obama administration said Wednesday that the financial outlook for Medicare’s hospital insurance trust fund had deteriorated slightly in the last year and that Social Security still faced serious   financial problems. The report, from the trustees of the two programs, could inject a note of fiscal reality into a presidential campaign that has given scant attention to the government’s fiscal challenges as the population ages. Hillary Clinton, the presumptive Democratic presidential nominee, has proposed increasing Social Security benefits and allowing people age 55 to 64 to “buy into” Medicare, while Donald J. Trump, the presumptive Republican nominee, has repeatedly said he would not cut either program. Under existing law, the trustees said Wednesday, Medicare’s hospital trust fund would be depleted in 2028, two years earlier than projected in last year’s report. In addition, they said, the Social Security trust funds for   benefits and disability insurance, taken together, could be depleted in 2034, the same year projected in last year’s report. Tax collections would then be sufficient to pay about   of promised benefits through 2090, they said. Social Security and Medicare account for about 40 percent of all federal spending. Obama administration officials often say the Affordable Care Act has slowed the growth of health spending, compared with estimates made just before the law was adopted in 2010. But the trustees said Wednesday that the   financial outlook for Medicare had worsened in the last year because of changes in their assumptions and expectations. Medicare actuaries now expect higher use of inpatient hospital services, as well as lower projected improvements in workers’ productivity and lower payroll tax revenue, as a result of slower growth in wages in the next few years. In their report, the trustees  —   four administration officials  —   said that the costs of Medicare and Social Security would grow faster than the economy through the   because of the aging of the baby boom generation. As for Medicare, they said, “growth in expenditures per beneficiary exceeds growth in per capita gross domestic product over this time period. ” The projected growth in Medicare spending will not immediately set off automatic cuts in the program under a controversial provision of the Affordable Care Act that generally requires such cuts when spending is expected to exceed certain benchmarks. However, such cuts could be required in a few years under the trustees’ forecast. Under current projections, they said, the automatic cuts could take effect for the first time in 2019. Medicare now spends an average of nearly $13, 000 per beneficiary, and this figure is expected to exceed $16, 000 in five years, the report said. “  drugs are a major driver of Medicare spending growth,” said Andrew M. Slavitt, the acting administrator of the federal Centers for Medicare and Medicaid Services. Such projections in years past have prompted leaders in both parties to at least broach the idea of benefit cuts or tax increases for entitlement programs. By contrast, President Obama said in Elkhart, Ind. this month that Social Security should be made “more generous,” and that “we could start paying for it by asking the wealthiest Americans to contribute a little bit more. ” Treasury Secretary Jacob J. Lew said Wednesday that he saw no contradiction there. The two objectives  —   ensuring the solvency of Social Security and increasing benefits  —   are “not at all inconsistent” if they are discussed in the context of “a broader conversation” about taxes and benefits, he said. The report predicts that Social Security will provide a modest    adjustment, increasing benefits by   of 1 percent next year. But, it warned of a “substantial increase” in Medicare premiums in 2017 for about 30 percent of beneficiaries. Under assumptions in the report, the standard premium, now $121. 80 a month, would rise to $149, and the change could be announced just weeks before Election Day on Nov. 8. Congress took action last year to shore up Social Security’s disability insurance trust fund, but the report says the legislation was a   fix. The law postponed the projected depletion of the disability trust fund by seven years, to 2023, Mr. Lew said. Like other Democrats, Mr. Lew said the report showed the “positive impact” of the Affordable Care Act. Since the health law was signed, he said, “increases in health care costs have slowed substantially. ” Carolyn W. Colvin, the acting commissioner of Social Security, said Americans should begin a serious discussion of how to close the “future financing gap” in Social Security. Sixty million people now receive Social Security benefits totaling more than $74 billion each month. The number of Social Security beneficiaries is expected to reach 76 million by 2025.'"}, "time": 1742562244.6581855}