{"duration": 0.04994654655456543, "input_args": {"text": "'Syria This file photo shows smoke rising from western Aleppo after militant shelling. \\nAt least 15 civilians are killed and some 100 others injured as foreign-backed militants shell western Aleppo after launching a massive offensive to break the Syrian government\\'s siege over the city. \\nA UK-based monitoring group sympathetic to the militants said hundreds of shells and rockets had fallen on various western neighborhoods of the city on Friday. \\nMilitant groups involved in the attack include Turkey-backed FSA and Jaish al-Fatah, an alliance of terrorist factions actively supported by Saudi Arabia and Turkey, they told news agencies. \\nA senior militant said it was going to be \"a big battle\" with all the groups there participating. \\nThe attack appeared to have been mostly launched by militants from outside the city against government forces that hold its western districts, Reuters news agency reported. \\nThe so-called Syrian Observatory for Human Right said militants had set off several car bombs on the western edge of Aleppo after launching grad rockets at the city\\'s Nairab airbase. \\nHeavy militant bombardment, with more than 150 rockets and shells, struck districts on the southwest of the city, it said. \\nThe Syrian military said a militant attack in that area had been thwarted and the army had destroyed four car bombs. \\nThe massive assault by foreign-backed militants comes in the wake of a unilateral \"humanitarian pause\" declared by Syria and Russia in the city. \\nOn Thursday, the Russian Defense Ministry said aircraft had not carried out any sorties over Aleppo for the past nine days. There were no immediate indication on Friday whether the airstrikes had resumed. \\nMilitants used a US-Russian ceasefire to break the siege in early August, opening up a new route into the city from the south, but government forces quickly closed it. \\nThe new civilian deaths came after at least six children were killed and over a dozen people injured after Takfiri terrorists launched rocket attacks on a school as well as a house in Aleppo.'"}, "time": 1742563336.7233996}