{"duration": 0.15259003639221191, "input_args": {"text": "'While many Super Bowl advertisers chose to be silly or sentimental with their commercials on Sunday, it was the few that ventured  —   or appeared to venture  —   into political territory that attracted the most attention. Among the major brands that used their commercial time for social commentary was Airbnb, which had decided just last week to run an ad. In the ad, the company promoted its view of an open, multicultural world, reflecting its commitment to housing refugees.   revived an ad it ran during the 2014 Super Bowl featuring people singing a multilingual version of “America the Beautiful. ” It managed to strike a new chord with viewers, given the recent national conversation around immigration and diversity, and it prompted a flood of conversation on Twitter. “I thought it was great for Coke to air an old ad because today it feels even more relevant than it did in 2014 when they first aired it,” said Lynn Power, chief executive of J. Walter Thompson New York. It was a smart move from the brand to   an old message, she added, given that “you can’t say it’s a reactionary thing. ” In an interview before halftime during the game, Rob Schwartz, chief executive of TBWA’’Chiat’’Day New York, said, “If there’s anything that’s screaming out here, it’s diversity. ” He added: “People are saying, ‘Is this trolling Trump?’ I don’t think it’s trolling. It’s a big smack in the face of ‘dude, this is America. ’” Still, for the most part, overtly political statements were few and far between  —   by design. A   advertiser, 84 Lumber, had its initial proposal for a commercial rejected by Fox last month for being “too controversial” because it showed a   mother and daughter confronting a border wall between the United States and Mexico. The company edited its spot to remove the wall and directed users to see the end of its commercial online. Budweiser spent days telling the news media that its ad was not a response to President Trump’s recent immigration crackdown. The company’s commercial featured the journey of one of its founders to the United States from Germany in the 1800s and the discrimination he overcame on his way to success. The hashtag #BoycottBudweiser trended on Twitter early on Sunday evening, apparently started by people who disliked the ad. But it was then used by others to defend Budweiser and mock the people who were boycotting the ad. Carl Marci, chief neuroscientist at Nielsen, the TV ratings company, said, “If you make people think too much or get too serious during a game where people are really looking to be entertained, you’re taking a risk. ” That risk can pay off, though. Audi’s ad went viral before the game, having passed five million views on YouTube as of Friday. It was narrated by a father asking pointed questions about what to tell his young daughter one day as she competed in a cart race, such as, “Do I tell her that despite her education, her drive, her skills, her intelligence, she will automatically be valued as less than every man she ever meets?” As she won the race, he reflected that perhaps he would be able to “tell her something different. ” The commercial ended with text including a line saying that Audi of America is “committed to equal pay for equal work. ” But escapism and sentimentality were the strategy for many advertisers as brands tried to provide an antidote to the weighty issues facing the country this year. Mr. Clean was unexpectedly portrayed as something of a sex symbol. Michelob Ultra used the theme song from “Cheers” in its ad, which presented the label as a   beer. Justin Bieber showed off his dance moves for   while Avocados From Mexico jokingly used subliminal messaging to urge more avocado consumption. “Very often on the Super Bowl, we see emotional advertising, or we see   advertising,” said Tim Calkins, a marketing professor at Northwestern University’s Kellogg School of Management. He added, “All the controversy in the country is making advertisers nervous about addressing big, significant issues, and in a polarizing time, it is safest to stick to the product and stick to lighthearted humor. ” Advertisers were willing to pay, on average, about $5 million for   spots during the Super Bowl this year  —   or around $167, 000 per second  —   and even more in promotional costs to reach the game’s more than 100 million viewers. Many released the full ads or teasers online before Sunday while brands such as Snickers and Hyundai went the opposite route, producing their commercials during the game itself, which aired on Fox. Some were not impressed by the bulk of the ads that aired on Sunday, particularly given the rising cost of the commercials. “Comedy, celebrities and anthropomorphic creatures seem to be the   schtick,” said Andrew Essex, the chief executive of Tribeca Enterprises and a former C. E. O. of the creative agency Droga5. “After 50 years, half a century, it’s all feeling a little formulaic,” he added. “I find myself, as someone who’s not doing this anymore, wondering if this is the single greatest act of economic immolation on the planet. ” Others felt that the ads delivered. “People want to see lighthearted things in the Super Bowl, especially at a time when there are so many big issues in the country,” Mr. Calkins said.'"}, "time": 1742561733.7566326}