{"duration": 0.09747838973999023, "input_args": {"text": "'As reported extensively by Breitbart News, ESPN has suffered severe losses in cable subscriptions over the last few years, the repercussion of which will rear its ugly head in the form of significant cutting of   talent in the near future. [According to comments made Thursday by ESPN’s Jim Miller on SI Media Podcast with Richard Deitsch, dozens of employees will soon join the unemployment lines.  “The way that I’ve heard it —  and I’ve kind of run the numbers on it, I think we’re looking at between 40 and 50 people,” Miller said. “And look, there’s a lot of uncertainty about who it’s gonna be and why. Remember, this is not quantum physics, so it’s not an exact equation. ” The plight of ESPN is no trivial matter for entertainment giant Disney, the parent company for the “Worldwide leader in sports entertainment. ” In February, The Wrap reported, “Cable networks, particularly ESPN, have been an albatross on Disney’s stock price even as the company’s two other major prongs, movies, and theme parks, continue to perform well.  “As cheaper TV alternatives began to proliferate, ESPN hemorrhaged subscribers during the course of 2016 and is now at less than 88 million, compared with a peak of 100. 1 million in 2011. At an estimated $7 per subscriber, that dip has been a substantial hit to Disney, especially considering media networks made up 49 percent of Disney’s profits during fiscal 2016. ” Miller presented a potential revised line up for the beleaguered network: 6 a. m.  —     of Neil Everett and Stan Verrett’s SportsCenter from the night before,   a. m.  —   Mike Greenberg’s newly announced show, which, as Miller points out, will feature only one   personality, 10 a. m.   —   First Take, presumably still featuring Stephen A. Smith, Max Kellerman and Molly Qerim,   p. m.  —   A widely rumored but     show featuring Bomani Jones and Pablo Torre,   p. m.  —  ”The normal kind of coverage of what they’re doing, and Around the Horn and PTI, 6 p. m.  —   SC6 with Jemele Hill and Michael Smith, Evening  —   Live sports, 11 p. m.  —   SportsCenter, Midnight  —   Scott Van Pelt’s SportsCenter show, 1 a. m.  —   Everett and Verrett’s SportsCenter show, Miller went on to say, “If you’re ESPN talent and you’re looking at a schedule that’s something like that, based on the commitments they’ve made, if you’re not on that, then you’re starting to feel a little shaky. ” But, he caveated,  “That’s not to say everyone else is gone, but I think those are the people that should take a deep breath, and those are the people that should feel immune. ” Deitsch responded, according to his sources at ESPN, “If you are part of the SportsCenter unit right now but not one of the special talents where management has tapped on the shoulder and given the golden ticket, if I were one of those people I would be talking to my agent and my representation of how management thinks of me. ” Both Deitsch and Miller agreed that the most popular sportscasters will keep their jobs, however, they might be subject to substantial pay cuts.'"}, "time": 1742561890.6490378}