{"duration": 0.19005107879638672, "input_args": {"text": "'TAOYUAN, Taiwan  —   The fields are overgrown with weeds. Warehouses lie abandoned, their corrugated shells covered in rust. In the distance, an air base, where pilots once took off on reconnaissance missions over mainland China, is devoid of activity, its camouflaged hangars and guard towers symbols of a Cold War long over. This neglected area just south of Taiwan’s biggest airport could use a complete makeover. And that is exactly what the local government has in mind. Described as the biggest development project in Taiwan’s history, the   Taoyuan Aerotropolis promises, in a video with a saccharine violin and harp soundtrack, a futuristic utopia of   homes and thousands of technology jobs. Investors are welcome, and on Sept. 8, a   woman named Chen Siting, or Charlyne Chen, arrived, claiming to represent a very prominent businessman: Donald J. Trump. She had been referred to the Taoyuan mayor by Annette Lu, a former vice president of Taiwan, the mayor’s office said in a statement on its website. “I told them: Isn’t Mr. Trump campaigning for president? Isn’t he very busy?” the mayor, Cheng   said in a television interview that aired on Nov. 18, referring to Ms. Chen’s group. “They said she is a company representative. His company is still continuing to look for the world’s best real estate projects, and they very much understand Taiwan. ” “She had authorization documents issued by the Trump company,” he said, without specifying. The mayor’s office, in a Nov. 16 statement, said that although investment opportunities had been discussed, the meeting had not resulted in any agreement, and that the election had not been talked about. The mayor’s office did not respond to a request for comment for this article. On Friday, Amanda Miller, a spokeswoman for the Trump Organization, said that there were “no plans for expansion into Taiwan” and that there had been no “authorized visits” to Taiwan to push for a development project. Asked on Sunday for clarification about the company’s relationship with Ms. Chen and knowledge of her activity in Taiwan, Ms. Miller did not respond to specific questions. She instead repeated in a statement that there had been “no authorized visits to Taiwan on behalf of our brand for the purposes of development, nor are there any active conversations. ” The Sept. 8 meeting, and its confirmation in November, went largely unnoticed outside Taiwan until Friday, when Mr. Trump, the   received a congratulatory phone call from the island’s president, Tsai  . The call is believed to have been the first conversation between a Taiwanese leader and a United States president or   in close to four decades, and it threatens to upend the delicate United   relationship because Beijing views any communication with Taiwan’s leaders as an affront to its claim of sovereignty over the island. And even if it emerges that Ms. Chen was largely freelancing, and not acting on behalf of the Trump Organization, the perception of a possible business conflict in Taiwan further complicates the   relationship. Potential conflicts of interest for Mr. Trump as president have been documented around the world, including in Scotland, India, Brazil, the Philippines, Argentina and Turkey. But perhaps nowhere are the stakes quite as high as in Taiwan, because it involves ties between the United States and China, the countries with the world’s biggest economies and most powerful militaries. “Even if the phone call had not happened, once these business dealings came to light, it would send a very confusing signal to Beijing,” said Marc Lanteigne, a senior research fellow at the Norwegian Institute of International Affairs who focuses on Chinese security issues. Any business ties could undermine the near certainty that world leaders have had for many decades about some of the basic foundations of United States foreign policy, which has included the primacy of maintaining ties with China in a “very narrow framework,” said Shelley Rigger, a professor of political science at Davidson College in North Carolina who studies   States relations. “It is very worrisome not just for leaders in China but for leaders everywhere to think that there could be motivations driving U. S. foreign policy that they can’t, A, know about and, B, work out logically,” Professor Rigger said by telephone. “If the U. S. government is being influenced by some kind of parallel set of side deals and interests that are not the sort of mainstream U. S. foreign policy and national interest agenda, then no one is going to be able to predict anything. ” Adding to the complexity is the fact that the Taoyuan Aerotropolis is a   development project, and Ms. Tsai’s administration must give final approval for the complex plan, which involves removing many people from their homes, before construction can begin. Taoyuan is the center of a metropolitan area with over two million residents. Ms. Chen  —   who, according to online biographies of her, was raised in Las Vegas  —   has been associated with the Trump Organization for several years, and with Ms. Lu, the former vice president, for much longer. In December 2012, a photograph of the two women was posted on the Facebook page of the condominium sales arm of Trump International Realty in Las Vegas, thanking them for visiting. Ms. Chen also accompanied Ms. Lu, who was then the vice president, during a trip to Las Vegas in 2004. “The Trump Organization said: ‘Hey, Ms. Chen, your business and politics connections seem great. Do you want to help us promote our Las Vegas properties? ’” Ms. Chen said in an interview with a Taiwanese television station in late October. Ms. Lu, reached on her mobile phone, did not comment. Ms. Chen could not be reached for comment. In an interview with The Wall Street Journal, Ms. Chen said she had a letter saying she was a “sales ambassador” for Mr. Trump’s company but was not an employee. Ms. Chen’s visit was followed in October by a   visit to Taipei by a Trump Organization employee. The duties of the executive,   Donoghue, include trying to find guests for the company’s hotels worldwide. Ms. Donoghue, who is not part of the company’s development team, did not respond to requests for comment. Ms. Miller of the Trump Organization would not specify with whom she had met during her visit to Taiwan. Ms. Chen, who once headed Nevada’s economic development  office in Taiwan, has been outspoken about her admiration for Mr. Trump, though it is unclear how much is  . “The election demonized Trump,” she said in the   television interview. “But in my experience and close interactions with him, he is very nice, has great bearing, has a very good head for business and really respects women. ”'"}, "time": 1742563971.815201}