{"duration": 0.20749950408935547, "input_args": {"text": "'Nate Cohn, The Upshot’s elections analyst, based in Washington, and Toni Monkovic, an Upshot editor in New York, discussed a big day of polling results, posting a lightly edited transcript of their written exchange.  Toni After a quiet period, the polls poured in over 24 hours. What are the big takeaways? Nate I think the quick ones are that Hillary Clinton’s standing has deteriorated a bit since last month, but that she still has an advantage. Toni Let’s start by looking at the bad news for her. The first polls of the day, from Quinnipiac, probably panicked a lot of Democrats. FLORIDA: Trump 42, Clinton 39 PENNSYLVANIA: Trump 43, Clinton 41 OHIO: Clinton 41, Trump 41 Nate Yeah, the Quinnipiac polls aren’t great for Clinton. Quinnipiac polling has generally tilted toward the G. O. P. all year, so it’s reasonable to suppose that Clinton’s standing in those states would be a bit better in other polls. But they’re still consistent with a narrower race than the one suggested by most polls over the last month. The    polls were in that category as well. Their   numbers were better for Clinton than the Quinnipiac surveys, but they were still weaker for Clinton than their past surveys. Toni  Despite that Republican lean from Quinnipiac, it’s not as if it’s a terrible pollster. Yes, it’s just one poll, but it can’t be dismissed. Nate Well, I do think their Republican lean is a bit concerning. They conduct a lot of polls and they have big samples. As a result, it’s unusually clear that they have a real Republican tilt. But it’s not really clear why they should tilt that way, and that gives me pause. That said, you’re right that the polls shouldn’t be dismissed: Add them to the average. Toni There’s another bit of bad news for Clinton. Again, the mantra is to focus on the polling average, not on one poll. In this case it’s the   poll. It hasn’t been released to the public as we write this Wednesday night, but it will be by the time this is published. It will show her tied with Trump, which is one of her worst recent national results. (Sure, Rasmussen had Trump up by 2, but that’s actually a rare poll that can be disregarded, as you wrote Wednesday.) Nate You certainly can’t dismiss the   poll: It’s a very   survey. And yes, you really can dismiss the Rasmussen poll (unlike Quinnipiac). But as you said, it’s best to focus on the average. Right now, the balance of data remains consistent with a modest Clinton lead. A single   poll showing a tied race isn’t enough to change that: If Clinton is up by, say, 3 or 4 points, you would expect a few   polls to show a very tight contest, while others would show a larger Clinton lead. It’s also possible that the   result is   and a wave of new data will confirm a closer race than the balance of recent evidence. I’m not sure we’ll get to find out, since the convention is just around the corner. Toni This is the speculative part of the program. Her lead is shrinking. Why? On the one hand, you have the rebuke from the F. B. I. director over the emails, and you also have a calamity in which an   killed five police officers in Dallas amid a sense of racial strife. On the other hand, Bernie Sanders endorsed her, although that was very recent (so it wasn’t captured by the polling). Nate Well, I think the F. B. I. is the easiest explanation. I wouldn’t discount racial tension, either. I’d note that Obama’s approval rating in Gallup dipped to 48 percent today, the lowest in a while. I’ll be interested to see whether other polls show that, too. Toni Stating the obvious, but there are more whites than   so   strife is not normally a political winner for Democrats. When we talk about whites favoring Trump, we tend to skip the explanation. Republicans have won whites for decades, but readers should take a look at Nick Confessore’s article for how Trump is taking white identity politics to a new level. Or read Jamelle Bouie in Slate, who’s been writing about this a lot. Nate I certainly agree that racial polarization would be bad for the Democrats. But Trump isn’t doing much better than Mitt Romney among white voters, if at all. He’s losing as many   white voters as he’s gaining among less educated white voters. I think Clinton’s polling numbers may be particularly vulnerable to these sorts of fluctuations in the media environment. She’s counting on the support of a lot of people who simply don’t like her very much. I’d guess a lot of them know, deep down, that they’ll support her eventually. But right now, the act of telling a pollster that they intend to support someone they don’t really want to support might be fairly agonizing. Toni Election 2016: “Fairly agonizing. ” That’s a great summation. Nate One further thought on this: I think it’s relevant that Clinton is falling in these polls more than Trump is gaining. Toni Why? Nate We know that these voters have supported Clinton, even if in modestly more favorable conditions. There’s no way to be sure they’ll return to her side, but surely they’re more likely to revert to her in a more neutral media climate than to support Trump. Toni And the email issue may not resonate quite as much four months from now, especially if Republicans batter it into the ground. Nate It might still resonate quite a bit, but it’s hard for it to resonate much more. I think it’s going to be interesting to see where she’s at after the convention, after she gets some strong character witnesses in President Obama and Elizabeth Warren. Toni Earlier, you mentioned, “I’m not sure we’ll get to find out” about a better measure of the race “since the convention is just around the corner. ” We’re heading into a “noisy” season with polling. Can you explain? Nate Generally, a candidate gets a “bounce” of a few points after a convention. This year, it’s pretty messy. The two conventions basically happen back to back. It’ll be hard to read too much into the polls for a few weeks with the conventions (unless Trump leads coming out of Clinton’s convention, which would obviously be a very strong sign for him). The good news, though, is that the polls start getting fairly accurate a few weeks after the conventions. So that’s something to look forward to. Toni Let’s turn to some of her positive results, and they got more positive as the day wore on. Colorado was particularly a bright spot. Fox had her up by 10 points, and Monmouth by 13. Nate Yeah, that’s a great result for her. It’s not hard to see why it could be a good state for her: It’s very well educated and it has an   Latino vote. The same story basically holds in Virginia, where the Fox poll also showed her doing well. And I think it’s worth remembering that Virginia and Colorado would basically be almost enough to get Clinton over the top. If you give her all of the states carried by Obama where she’s not airing advertisements (which includes Wisconsin and Pennsylvania) then Colorado and Virginia would get her to 269 electoral votes. It would only take one more, and she has a lot of options. It’s hard to look at the polling right now and say that Trump has a discernible edge in any battleground, even if a few  —   like Ohio and Iowa  —   look very close. Toni I was going to ask you about Ohio and Iowa. We’ve gotten quite a few polls from those states recently, and they seem dead even. Nate It does seem that way. Iowa and Ohio are two states where Democrats are heavily dependent on   white voters. Same story in Wisconsin, where Clinton was up by just 4 points today. In all three states, Clinton is running about 3 or 4 points worse than Obama four years ago. It’s kind of the reverse of Colorado and Virginia. Toni But a slight difference with Wisconsin it has been consistently leaning for Clinton. Nate True. My point is just that it’s a state where she’s underperforming Obama, unlike the states where Romney was more dependent on   voters like Colorado and Virginia. Toni The map you discussed supposes she’ll win Pennsylvania, and we had some divergent results in the state today. We also had this tidbit: Pennsylvania white voters: Trump, 40%  —   Clinton, 40% Pennsylvania black voters: Trump, 0%  —   Clinton, 91% It cannot be possible that Trump is getting 0 percent support from black voters. I mean, he made a big production of “my  ” a while back. Nate   well, he’s probably not actually getting zero percent of the black vote. But here, let’s use some data. I have this polling data from 2012 loaded on my computer. It’s 20, 000 interviews, or about 24 times more respondents than the    poll in Pennsylvania. In that data set, there are 1, 881 black respondents, and just 55 of them supported Romney. So in 2012 you would have expected there to be about two voters who were black and supported Mitt Romney in an     national poll. With numbers like that, you’re going to get more than a few polls where there are no black voters for the G. O. P. And here’s a flashback from 2012, from the   poll heading into the G. O. P. convention: Obama ahead   among black voters. Sound familiar? Toni That makes sense, but maybe you’re ruining it  —   the zero somehow seems more meaningful. (Like turning the stereo up to 11.) Nate Here’s something fun: In my data set, which includes 880 respondents from Pennsylvania, the black vote was   for Obama (and that’s with 60 black respondents). I don’t think it’s very meaningful. We know that Clinton is up by a huge margin among black voters. There are going to be polls where Trump gets zero black voters. Toni One thing that’s very meaningful is whether Clinton can win Pennsylvania. You mentioned one overall path to victory, through Colorado and Virginia. It’s also true that if the Democrats hold onto Pennsylvania and win Virginia and Florida, it’s essentially game over. But we didn’t learn that much from the Pennsylvania results today, did we? Nate No, it was a split decision, with Quinnipiac showing a tight race and    showing a considerable Clinton lead. I’m inclined to lean toward    considering that the Clinton campaign isn’t taking Pennsylvania especially seriously [no ad spending, although a   super PAC is spending money there]. But it’d be nice to have more data there. Toni It was a rich day of polling. If you had to assess Clinton’s national lead right now, what would you say, 3 points? Four points? That’s a pretty close race against a candidate who has struggled in  many ways. Nate  I’d probably say 4 or 5 points, but that’s not very  . The newest data does provide reason to pause and wonder whether the race has gotten even tighter, even if the preponderance of evidence doesn’t point that way quite yet. The only other thing I’d say, though, is that we know Clinton has had a rough week or two. The polls are going to bump around, and I think there’s reason to think this is a relatively low point. On Wednesday, Nate and Toni looked at the groups Donald Trump would win if the election were held today. '"}, "time": 1742562280.3488274}