{"duration": 0.04738187789916992, "input_args": {"text": "'By Top Right News on November 18, 2016 in Uncategorized \\nby Brian Hayes | Top Right News \\nPresident-elect Donald J. Trump just made his decision for the nation’s highest legal official: Senator Jeff Sessions of Alabama. \\nAnd it’s a nightmare for liberal Democrats. \\nIn fact that’s exactly what the Huffington Post called him in their flash headline moments ago… \\nJefferson Beauregard Sessions III, 69, would serve as the nation’s top law enforcement official if nominated by Trump and confirmed by his fellow members of the Senate. Sessions, an early Trump backer, is an immigration hard-liner who has been in the Senate since 1997 and previously served as attorney general for the state of Alabama. \\nSessions is as “hardline” as a conservative can get on the core issues of the Trump Agenda, and signals to Washington that Trump is dead-serious about enforcing laws against illegal immigration, enforcing voter ID and gutting the hard-left “civil rights division” at the Department of Justice. \\nSessions is a former U.S. Attorney for the Southern District of Alabama appointed by Ronald Reagan, and a tough prosecutor with little patience for liberal arguments, and a deep respect for the Constitution. \\nSessions is credited with crafting Trump’s entire immigration platform , released last August. His plan includes building a permanent border wall, including details on how he would make Mexico pay for it ; end birthright citizenship , overhaul the refugee program that has overwhelmed America’s heartland, enact mandatory E-Verify to block illegals from jobs, a “pause” in green card approvals to allow unemployed Americans a chance at job positions, and an increase in salaries of H1-B visa holders to stop the undercutting of wages by foreign workers. \\nAnd unlike some cutting-edge picks such as Kansas Secretary of State Kris Kobach, Sessions is almost certain to win speedy confirmation as a sitting, senior Republican Senator. \\nThe official announcement from Trump’s transition team is expected later today. SHARE THIS article if you want Trump to FINALLY enforce the nation’s immigration laws… '"}, "time": 1742563976.5677414}