{"duration": 0.06800222396850586, "input_args": {"text": "'Police fire rubber bullets at pipeline protesters 11/03/2016 \\nKGW \\nPolice in riot gear shot rubber bullets and used pepper spray on demonstrators — who call themselves water protectors — on the shoreline of the Cantapeta Creek, just north of the Standing Rock Sioux Indian Reservation on Wednesday. \\nAfter a few relatively peaceful days at the campground, where thousands have gathered to demonstrate against a controversial North Dakota oil pipeline, demonstrators put out calls on social media to “make your way to the river” for a “river action,” but to do so “in prayer.” \\nIn a Facebook Live stream, Cempoalli Twenny , who says he is at Standing Rock to protect the water, said, “The pipeline is getting really close to the river now, so it’s crunch time.” \\nDemonstrators on the shoreline prayed, played drums, sang, and waded into the river towards the base of the hill where armed police stood. \\nIt was a “100 percent peaceful protest,” according to activist Erin Schrode, who was shot in the lower back with a rubber bullet while standing on the shoreline opposite police. Schrode had joined others from the camp in solidarity as they prayed on the shoreline. \\nA confrontation erupted after law enforcement dismantled a wooden bridge that demonstrators constructed to access the sacred site. \\n“I was shot in point blank range,” said Schrode, who says she is shaken but physically will recover. “Another water protector was also shot at twice at point blank range, but the rubber bullet hit the water, and not him.” \\nIn a press release, the Morton County Sheriff’s Department said it used “less-than-lethal ammunition to control the situation” when a man threw bottles at officers on the police line and when another charged the police line. “Officers also deployed pepper spray and tear gas to disperse the group of protesters who came across the water and camp at officers,” the release said. \\nEven as law enforcement warned protesters to leave the area and return to their camp, demonstrators could be heard yelling back at police. \\n“There was absolutely no provocation of any kind,” said film director Josh Fox, who was also on scene. “The police pepper sprayed people sitting in the water.” \\nLaw enforcement vehicles and personnel have been stationed on a hill overlooking the shoreline in question for a number of days, and the hill is recognized as a burial ground and sacred site by the Standing Rock Sioux. \\nOn Monday, people who identified themselves as water protectors waded across the creek to the hill to request that law enforcement move off the sacred area. \\nAccording to the Morton County Sheriff’s Department public information officer, the police remained there “to prevent criminal trespass on private property.” \\nWednesday, the Department said The U.S. Army Corps of Engineers gave Morton County orders to remove a wooden pedestrian bridge that had been constructed across the river and arrest any individuals who cross the river for criminal trespass. \\n“I was facing the line of officers from across the river and all of a sudden, I felt as if someone swung a mallet with all their might against my lower back. It obliterated me,” said Schrode. “I turned around and I had no idea what just happened. And there was an officer pointing his gun in my direction from a boat.” \\nMorton County called the situation a “standoff” and, in a press release, stated that “protesters involved in this activity are violating numerous federal and state laws.” \\nE’sha Hoferer , who is a member of the Walker River Paiute Tribe and who says he is in Standing Rock to protect the water for his children and grandchildren, told NBC News before Wednesday’s encounter with law enforcement that the construction of the pipeline is “desecrating a lot of sacred sites” and that “a lot of the traditional ecological knowledge that we have – that Standing Rock has – shows that we have ceremonial sites up there, sacred sites, burial sites,” referring to the hill at the center of the standoff. \\nThe last big clash between police and demonstrators took place on Thursday, October 27, when 141 protesters were arrested .'"}, "time": 1742561675.997139}