{"duration": 0.06105971336364746, "input_args": {"text": "'TEL AVIV  —   A Jewish family from Arizona woke up this weekend to find their Hanukkah menorah had been twisted by vandals into the shape of a swastika. [Seeing their neighbors Christmas decorations, Naomi and Seth Ellis’s three children insisted on decorating their home for the Jewish festival, the Washington Post reported. Their parents obliged by erecting an oversize   menorah outside of their home, made of   PVC pipe and using solar powered lights.   “Just waking up to see that first thing is kind of rattling,” Seth Ellis told ABC15. “It just makes me sad and it makes me feel sick that’s still how people look at the world in 2016,” he added. The children did not see what the vandals had done to the menorah but Naomi Ellis said that explaining to her boys, aged five, seven, and nine, what had occurred was difficult. “I’m still not sure how I will explain this to [my children],” she wrote on Facebook. “I’m not sure I quite understand it myself.   …     How can people be filled with so much hate and violence? To think that someone would make such an effort to hurt and vandalize a family is downright sickening. ” “We live in a great neighborhood with kind and welcoming neighbors. We never would have imagined that someone would spread so much hate here,” she said. “We talk a lot about the importance of equality and tolerance, loving everybody no matter what,” she told the Washington Post after speaking with her children. “I had to tell them that not everybody feels that way. Some people are ignorant, and this is what they do. ” “This is the real reality that we live in: People hate us for no reason or want us to feel scared for who we are. That’s not something I wanted to have to tell them,” Naomi told the Post. Seth and Naomi Ellis spent Friday afternoon putting the menorah back together again. “You have to put it back up,” Seth Ellis told ABC15 reporter Megan Thompson. “I mean, what kind of statement is it for me not to put it back up, especially for my kids?” When asked what he would do if the new menorah was also vandalized, Seth answered he would go about rebuilding it again: “As many times as I have to. ” The Ellis family invited their community to attend a Hanukkah lighting ceremony of the new menorah at their home. No arrests have been made.'"}, "time": 1742564612.251031}