{"duration": 0.037670135498046875, "input_args": {"text": "'Kid Has ‘Birthday Surprise’ For Church, Does The Unexpected While Inside   Alisha Rich in Religion Share This \\nA teenager recently celebrated his birthday in Harriman, Tennessee. However, the kid isn’t so fond of his yearly celebration and finally became fed up with it, devising a plan not many would consider. In fact, he came up with a “birthday surprise” for a local church, and onlookers spotted him doing the unexpected after he walked inside. Ryan Nelson \\nRyan Nelson, 13, had explained to his parents that he didn’t want to celebrate his birthday. Although most kids would like to invite all of their friends, open gifts, and eat some birthday cake, Ryan didn’t want to spend his special day that way. Instead of having a huge ordeal for himself, he devised a plan that not many people would ever consider. He was going to give a “birthday surprise” to a church. \\nRyan decided to take the money his parents would have spent on a party, as well as all of his birthday money, and he donated it to a local church. “He also packed up and donated canned soups, ramen noodles and lots of clothes and blankets,” according to WVLT . His donations will go to the M-14 Ministries’ “Dry Bones” shelter. \\n“The community, in my opinion, has given me so much,” Ryan explained. “So I think this year, on my birthday, it’s time to give back to the community.” Ryan’s donations \\nThe director of the shelter, Dwayne Linger, was overwhelmed by Ryan’s generosity. “I just hope that other kids see what he’s done and follow his lead,” Linger said. “I think it’s a great blessing, what he’s done.” Ryan admitted that he came up with the idea after he watched his mother donate to another church earlier this year. \\nIt’s great to see that some of those in the younger generation can think about someone other than themselves. We need to ensure that our children realize how much of an impact their beliefs and actions will have on our country’s future.'"}, "time": 1742563829.0660248}