{"duration": 0.04172635078430176, "input_args": {"text": "'Former Fox News “talent” Megyn Kelly revealed in interviews before the debut of her new NBC show that she has always felt that she was “born” to be a mainstream media personality.  “I understand what that show is. That show is a show I was born to do,” she told the New York Times while promoting her Sunday Night with Megyn Kelly show, which could not even beat a 60 Minutes rerun in its debut. Kelly made similar comments at NBC’s upfront presentations last month. She bluntly told Politico during her round of interviews, “I was not born to be a political news anchor. ” “The audience enjoyed the show and I’m grateful for it,” she said of her Fox News primetime show. “But it wasn’t who I was and it isn’t who I am. ” Kelly told the Daily Beast that cable news offers “no time for wining and dining you gotta get right to it. ” Her new show, though, will allow her time for more nuance and relationship building with her guests. Her show, she says, has “allowed me to open up more and show more of who I am” and “show a range of emotion and personality and sides of me that wasn’t possible when I was in   cable news. ” Like many others who used their positions at    outlets to get adoration from the mainstream press to eventually land a mainstream media gig, Kelly got the requisite pats on the head from The Opposition Party’s members during the 2016 presidential campaign. Using the prominent platform she somehow got on Fox News, Kelly attacked and attempted to kneecap   Trump, most egregiously during a GOP presidential debate when she took Trump’s comments out of context in order to paint him as a sexist pig. The mainstream media howled their approval. And in hindsight, it seems as if Kelly, who conservatives always suspected was more liberal than she let on, was auditioning for them. As for Trump, Kelly told the Daily Beast that she “wouldn’t say no to a sit down” with him but “it’s not something I am pursuing right now. ” “It’s just nice to not be at the pointy point of the spear for every news story he generated,” she told the Times. But Kelly said she was excited to do what she feels she was “born to do. ” She told the Daily Beast that she has learned it was “extremely hard to be a    mother. ” “I was driving the housekeeper crazy. Poor Carla. Nobody was as happy as Carla was when I went back to work,” she said. When news of NBC’s hiring of Kelly broke, one executive reportedly told CNN that “the degree of difficulty” would be “extremely high” for Kelly and if she does not succeed, “she could end up fading into obscurity. ” Kelly’s first two programs have failed to beat reruns of 60 Minutes. Her last even lost to a rerun of America’s Funniest Home Videos. NBC News is reportedly “freaking out” over the “ratings disaster” that is Kelly.'"}, "time": 1742561819.2454293}