{"duration": 1.328418493270874, "input_args": {"text": "'Why Was A Mysterious Navy Plane Conducting “Secret Electronic Command/Control Drill” Over Denver? Mac Slavo SHTFplan.com Read by 2 people \\nIt seems that the U.S. military is geared up for a permanent cyber war with the people and various governments of this globe. \\nThough tensions with Russia may have been temporarily alleviated with the election of Donald Trump – who has signaled for peace with Putin – the long game is much more complicated. \\nWith new powers in Washington taking shape in the next administration, one faction in government was quietly, subtly parading its power. \\nThe Continuity of Government contingent of the shadow government will not be taken out of power by any mere election, and no matter what decisions Trump makes and no matter what inflammatory remark he may make, there are those who will still have their finger on the button. And that means a tremendous amount of power. \\nResidents in the Denver area were presented with a mysterious white plane that flew in a “racetrack pattern” for more than an hour above the city before it landed at Tinker Air Force Base in Oklahoma, where the aircraft – what the Navy has now disclosed to be an E-6B – is housed. \\nHere’s the bizarre route that observers tracked, and the Navy was later forced to confirm: “Mysterious” plane circling over Denver was “just” an E-6B Mercury “doomsday” plane https://t.co/SqJlBkdIqg pic.twitter.com/oE0BBWrhFL \\n— The Aviationist (@TheAviationist) November 17, 2016 \\nIt’s mission remains classified, but military officials admit a drill was underway… \\nvia ABC 7 Denver : \\nA plane shrouded in mystery captured the attention of thousands on Wednesday. Nobody knew why a high-altitude plane circled the City of Denver for hours. Now the Navy has some answers. \\nDenver7 tracked IRON99 as it traveled from the West Coast to Oklahoma, where it eventually landed at Tinker Air Force Base, however it spent roughly an hour in Denver, circling in a racetrack-style holding pattern over the city. \\nDenver7 branded it a mystery in a previous report because officials from the Federal Aviation Administration (FAA), U.S. Northern Command (NORTHCOM), U.S. Strategic Command (STRATCOM), North American Aerospace Defense Command (NORAD) and a dozen Air Force Bases could not confirm what the flight may have been. \\nA day later — after the plane landed — Navy officials… confirmed IRON99’s identity is a Navy E-6B Mercury, created by Boeing at a cost of $141.7 million per unit. \\nThe unit’s overall mission is classified, Hubbell said, [elaborating that] the E-6B is “command, control and communications abilities to direct and employ strategic resources.” \\n[…] the planes are able to launch nuclear missiles and communicate with diverse assets, including nuclear submarines. \\n[…] a high-ranking federal official … said the plane was involved in a classified training mission organized by the Department of Defense. \\nThe training mission reportedly centered around electronic surveillance and involved several agencies which aren’t likely to comment on the mission, the source said. \\nGiven that the E-6B deals with “command, control and communications,” as well as electronic surveillance and communications with nuclear submarines and other assets that could launch nuclear war… one can assume that a major mission is in rehearsal – to take charge of the nation’s vital weapons and resources in the event of a catastrophic emergency, break down in order or disabling of the power structure in Washington. \\nA similar E-4B was spotted flying above the capital on the morning of September 11th, shortly after the attacks. It was reportedly conducting a drill, but later instructed to prepare to go active as a mobile command center. Both planes deal with sensitive electronics communications involving, at least in part, nuclear launch codes and military continuity in the event of a breakdown of order. \\nDOOMSDAY PLANES It is important to note that the E-4B is no ordinary aircraft. It is a militarized version of a Boeing 747-200, equipped with advanced communications equipment, and capable of carrying a crew of up to 112 people. Nicknamed “Doomsday” planes during the Cold War, E-4Bs serve the president, the secretary of defense, and the Joint Chiefs of Staff. In times of national emergency, they can act as highly-survivable command, control, and communications centers to direct forces, execute war orders, and coordinate actions by civil authorities. The U.S. military possesses four of them in total. One is always kept on alert, with a full battle staff. Offutt Air Force Base in Nebraska is the “Main Operating Base” for the E-4B, though there are also numerous “Forward Operating Bases” (FOB) throughout the U.S. [7] \\nHere’s the reported layout of the E-6B, upgraded for the cutting edge of electronic warfare: \\nIn the current context, there are perhaps three distinct fronts that this command unit could have theater over. COMMUNICATIONS BLACKOUT – The E-6B’s communications and control powers could be used to disrupt or disable electronic communications in the population over a given city or area. With sensitive military installations near Colorado Springs, the plane could have blacked out much of the Denver area accordingly with the situation. This CoG plane has dominance over the civilian population, and can bring their ordinary activities to a halt. Surveillance, data collection and ‘drone detection’ may have also been objectives of this drill and real-life activities. CHECK AGAINST AGGRESSION – The E-6B’s capabilities are a powerful counterbalance to possible hostile intentions on the part of Russia, China or other adversaries. As SHTF has often highlighted, modern warfare is based around the use of electromagnetic fields, communications jamming and, potentially, the use of an EMP to knock out electronics. Depending upon the potential situation, the ranking U.S. official on board or in communication with this plane could launch nuclear weapons, communicate with SSBN submarines around the globe or deny airspace to a conflicting force. TRUMP CARD FOR THE COG – Symbolically, at least, the E-6B, conducting a drill a week or so after the election sends a message to the President-elect, and perhaps to his constituents as well, that there are limits to the power of a president. While Trump’s power is theoretically capped by the Constitution’s checks and balances, in the real world, the Continuity of Goverment (CoG) structure has operational superiority over any president, and perhaps they wanted to signal to Trump here (or perhaps not). If any president ‘gets out of line’ or starts to ‘believe they are truly in charge’, this plane can override their ego and maintain the dominance of the status quo… it is a potential coup in motion. \\nThis is the true face of the ruling elite. This is the system they maintain, and anything below this threshold is not truly in charge. \\nThis what democracy looks like, when you strip away the silly game of voting, candidates and campaigns. \\nThis is the military industrial complex that Eisenhower warned us about. \\nRead more:'"}, "time": 1742564574.195662}