{"duration": 1.1403744220733643, "input_args": {"text": "\"US elections don't meet ‘international standards,’ OSCE observer warns US elections don't meet ‘international standards,’ OSCE observer warns By 0 48 \\nThe US electoral process hardly meets “international standards,” a German OSCE observer warns, citing shortcomings that would make it easier to influence voters. The remark comes amid accusations from both presidential campaigns of election interference. \\nJuergen Klimke, a German observer of the Organization for Security and Cooperation in Europe (OSCE), has told the Bild magazine that “the US electoral process still needs to catch up and adapt to international standards.” \\nKlimke, who is also a foreign policy expert in Chancellor Angela Merkel’s CDU party, cited difference in time zones as a major flaw. \\nRead more \\nBecause of the time shifts, “the first election results would already be announced at the time when in other states the polling stations are not yet closed,” he said, adding that it could have “an enormous influence on voters.” \\nHis remarks were echoed by Michael Georg Link, head of German OSCE observer group, who also voiced his concerns in an interview with the Frankfurter Allgemeine Zeitung. \\nUp to 6 million Americans “are exempt from the vote,” Link stressed, meaning an estimated 3.2 US citizens serving prison terms or being convicted of crimes. In addition, some 2.6 million people have already served their sentences and are still not allowed to vote. \\nIn an unprecedented move, the OSCE has decided to deploy dozens of observers to the US. Around 500 of the organization’s officers are expected to arrive for the Election Day, marking a tenfold increase from 2012 election, when it had just 44 observers. \\nRead more \\nLast Friday, Thomas Rymer, the spokesperson for OSCE Office for Democratic Institutions and Human Rights, told Sputnik that eleven observers are already on the ground in Washington, DC, to examine “legal framework, candidate and voter registration, and media coverage, among others.” \\nOSCE officers will not be able to monitor voting elsewhere in the US as 13 states explicitly prohibit international election observation, including Alabama, Alaska, Arizona, Connecticut, Hawaii, Louisiana, Mississippi, North Carolina, Ohio, Oklahoma, Tennessee, Texas and West Virginia. \\nFor the most part, however, states do not regulate the issue, leaving the decision on admitting or rejecting both international and US observers to state or county election authorities. \\nWith less than two weeks to go until the 2016 Election Day, the most controversial and expensive presidential race that will likely cast a shadow over US politics for years to come is nearing an end. \\nBoth camps accuse each other of having a capacity to manipulate voters and falsify the results. Donald Trump, the Republican nominee, has recently warned of a “rigged” election, urging his supporters to act as “citizen observers” as well. In turn, Hillary Clinton’s staff and Obama administration officials speak of alleged Russian attempts to influence the US election. \\nVia RT . This piece was reprinted by RINF Alternative News with permission or license.\""}, "time": 1742562545.3592005}