{"duration": 0.05634331703186035, "input_args": {"text": "'By Jason Easley on Tue, Nov 1st, 2016 at 10:23 pm Republicans are so far removed from reality that Sean Hannity spread a fake news story on his radio show, and nobody noticed the difference. Share on Twitter Print This Post \\nRepublicans are so far removed from reality that Sean Hannity spread a fake news story on his radio show, and nobody noticed the difference. \\nCNN reported, “The progression of events illustrates how fake news stories expand and spread from fringe web sites to nationally syndicated radio shows with millions of listeners. In this case, the fake news originated on a dubious site called “Your News Wire,” which publishes a mix of true, slanted and made-up news. Then, like a game of telephone, by the time the story got to Hannity, even the fake facts were wrong.” \\nSome right-wing websites spread the story, which turned into a tall tale that added new details at each stop. The fake news eventually reached The Gateway Pundit, and to Sean Hannity’s radio show. \\nAfter spreading the fake news to millions of listeners, Hannity downplayed his responsibility to get the facts right, “Bottom line it was brought up in an insignificant way, I was dealing with more important issues like HRC crimes and lies and how CNN has been colluding with the Clinton campaign and CHEATING Bernie Sanders.” \\nHannity was busy dealing with real fake issues like Hillary Clinton’s “crimes” and how the election is being stolen from Donald Trump. \\nHow Hannity put a fake story on the air is a perfect example of how the right-wing media echo chamber works. Nobody at any level bothered to check the facts because in the Republican Party belief has replaced fact. Conservative media knows that their audience wants confirmation of their beliefs, so that is what they provide. \\nIt doesn’t matter if the confirmation is true. What matters is that the audience wants it to be true. \\nSean Hannity is pushing fake news, and he doesn’t care. \\nThis is why there is such a disconnect between Republicans and the rest of the country. Republican voters are living in a fantasy land that Donald Trump was able to exploit and ride the whole way to the Republican nomination. \\nThe conservative media bubble is alive and well, and because of this, things will get a lot worse for Republicans before they begin to get better.'"}, "time": 1742564462.9618187}