{"duration": 0.09844803810119629, "input_args": {"text": "'Actress and   activist Lena Dunham has shared her own diet tips after blasting a celebrity magazine for promoting weight loss advice on a recent cover issue alongside her photograph. [In an Instagram post Monday, the Girls star criticized Us Weekly for putting her image on its cover alongside a caption promoting “slim down diet tips!” which she said is “diametrically opposed to everything” she has fought for her entire career.  The    star has been very vocal about the politics of body image and the fact that she had lost a considerable amount of weight during the presidential election. But Dunham says the “diet tips” Us Weekly cover is “not a compliment to me because it’s not an achievement. ” Instead, Dunham listed her own “20 slimdown diet tips,” a collection of   and   reasons why she has lost weight. The list includes “anxiety disorder,” “an election that reveals the true depths of American misogyny,” and “constant sweaty dreams of dystopian future. ” “Watching institutions you love from Planned Parenthood to PBS be threatened by cartoon   villains” and “marching your ass off” are also among Dunham’s weight loss tips.  20 slimdown diet tips! 1. anxiety disorder * 2. resultant constant nausea 3. an election that reveals the true depths of American misogyny  4. constant sweaty dreams of dystopian future  5. abdominal adhesions pinning ovary below uterus * 6. baseless but still harrowing threats to physical safety online and through smail mail  7. watching institutions you love from Planned Parenthood to PBS be threatened by cartoon   villains  8. finally realizing superheroes aren’t real (specifically the   really thought they’d handle this) 9. marching your ass off 10. a quiet rage that replaces need for food with need for revenge 11. sleeping 19 hours a day 12. realizing that even the liberal media wants dem clicks no matter whut  13. worrying ceaselessly about the health and safety of women you know and women you don’t  14. realizing who ya real friends are 15. having to switch from Uber to Lyft (lots of calories burned trying to understand a new app, then even more trying to understand if the conflict was resolved) 16. bladder spasms, urinary frequency and urgency * 17. having your phone number leaked and violent images texted to your phone by randos under names like VERYFATCHUCKYBOY@creepz. com 18. keeping your back arched against the wind 19. um, who the fuck cares? 20. I have no tips I give no tips I don’t want to be on this cover cuz it’s diametrically opposed to everything I’ve fought my whole career for and it’s not a compliment to me because it’s not an achievement thanx * Star indicates a   condition, A post shared by Lena Dunham (@lenadunham) on May 7, 2017 at 9:55pm PDT,  Dunham has reportedly spent the last week recovering from complications related to her ongoing battle with endometriosis. The actress was rushed to the emergency room following her appearance at the Met Gala last week. Last month, Dunham announced that she and her Girls   Jenni Konner plan to take their Lenny digital newsletter on the road. Dunhan and her friends will tour six cities, beginning May 31 in St. Louis, “connecting to women, to people, in the middle of the country. ” “It’s political, but we’re also trying to bring up issues that you can’t really argue with,” Dunham said. “For example, a portion of our proceeds are going toward arts education organizations for girls in every city. People have a lot of really split opinions on social politics, but you basically have to be a   villain to have a problem with girls receiving arts education. ”   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742562097.0569952}