{"duration": 0.15069007873535156, "input_args": {"text": "'Donald J. Trump publicly retreated from his “birther” campaign on Friday, tersely acknowledging that President Obama was born in the United States  —   and effectively conceding that the conspiracy theory he had promoted for years was baseless. Mr. Trump made no apology for and took no questions about what had amounted to a    smear of the nation’s first black president. Instead, he claimed, falsely, that questions about Mr. Obama’s citizenship were initially stirred by the Democratic presidential nominee, Hillary Clinton, in her unsuccessful primary contest against Mr. Obama in 2008. Still, Mr. Trump’s brief remarks, tacked on to the end of a campaign appearance with military veterans at his new hotel in downtown Washington, represented a sharp reversal from a position he had publicly maintained, over howls of outrage from all but the   extreme of the political spectrum, since 2011. “President Barack Obama was born in the United States, period,” Mr. Trump said. “Now, we all want to get back to making America strong and great again. ” Earlier Friday, Mr. Trump sought to stoke interest in his eventual statement on his birther views, telling Fox Business that he would save his views for the   event at his hotel because “we have to keep the suspense going. ” Mr. Trump’s embrace of and refusal to disavow the birther issue helped drive his standing among black voters to historically low levels, with some public opinion polls showing him supported by zero percent of  . Given his other racially incendiary statements, Mr. Trump’s aides privately say they fear he will be unable to shake free of charges that he is racist, a label that has stuck to him with deleterious effect, polls show. Mindful that the birther issue could also haunt Mr. Trump in his first debate with Mrs. Clinton, on Sept. 26, his aides tried for several days to put it to rest. But Mr. Trump himself revived the issue late Thursday, declining in an interview with The Washington Post to acknowledge that Mr. Obama was born in Hawaii. In his brief remarks, Mr. Trump leveled the accusation  —   which his supporters have been pressing for weeks  —   that Mrs. Clinton first raised doubts eight years ago about Mr. Obama’s birthplace. “Hillary Clinton and her campaign of 2008 started the birther controversy,” Mr. Trump said. “I finished it. ” During the 2008 Democratic contest, a senior strategist for Mrs. Clinton at one point pondered, in an internal memo that was later leaked, the ways in which Mr. Obama’s personal background differed from those of many Americans. But contrary to Mr. Trump’s assertion, neither Mrs. Clinton nor her campaign ever publicly questioned Mr. Obama’s citizenship or birthplace. The topic was such a fringe issue within the Republican Party that in 2011, conservatives, including Ann Coulter, now a vocal Trump supporter, called on Mr. Trump to stop pursuing it. Mr. Trump’s aides, in a statement late Thursday, tried to argue that he had actually “ended” the birther issue. Mr. Trump’s spokesman, Jason Miller, asserted  —   also falsely  —   that Mr. Trump had “obtained” Mr. Obama’s birth certificate the president actually released the   version in 2011. “Mr. Trump did a great service to the president and the country by bringing closure to the issue that Hillary Clinton and her team first raised,” Mr. Miller said. Mr. Trump’s remarks on Friday came after Mr. Obama, in a brief exchange with reporters at the White House, again expressed scorn for the subject. “I was pretty confident about where I was born,” he said. “I think most people were as well. My hope would be that the presidential election reflects more serious issues than that. ” Two of Mr. Trump’s top advisers  —   his campaign manager, Kellyanne Conway, and former Mayor Rudolph W. Giuliani of New York  —   said in recent days that Mr. Trump had come to believe that Mr. Obama was born in the United States. But Mr. Trump refused to say so. “I’ll answer that question at the right time,” Mr. Trump said in the Washington Post interview. “I just don’t want to answer it yet. ” The Clinton campaign made clear that it would not let Mr. Trump slide on the subject. In a speech to the  Black Women’s Agenda symposium in Washington on Friday  —   before Mr. Trump made his statement  —   Mrs. Clinton said Mr. Trump owed Mr. Obama and the country an apology. “For five years he has led the birther movement to delegitimize our first black president,” Mrs. Clinton said. “His campaign was founded on this outrageous lie. ” She added, “There is no erasing it in history. ” Representative James E. Clyburn of South Carolina, a member of the Congressional Black Caucus, said Mr. Trump was making such pronounced racial attacks that critics had struggled to adjust. “One of things that we are all used to in this business is dog whistles,” Mr. Clyburn said. “But the thing that we are not used to, and I’m finding it very difficult to get used to, are the howls of wolves. These are howls. These are not whistles. ” Mr. Trump must improve his standing with suburban moderates who shrink from backing someone accused of racism. But his remarks on Friday seemed unlikely to make much of a dent. Connie Keys, 54, a    mother in Montclair, N. J. said Mr. Trump still seemed not to accept Mr. Obama as presidential. “He makes it sounds like, ‘I should be thanked, I should be applauded, because I’m the one who finally told the country that the president was born here,’ when in fact the voters decided that for themselves when we elected President Obama twice,” said Ms. Keys, who is white. The birther issue brought Mr. Trump attention and vaulted him to the front of Republican primary polls in 2011 as he considered a White House bid. He claimed, without ever offering evidence, that he had hired investigators, and said they “cannot believe what they’re finding. ” Mr. Obama, frustrated by the degree to which questions about his citizenship were spreading and attention was being diverted from federal budget discussions, released his   birth certificate that April. “We do not have time for this kind of silliness,” he said. Mr. Trump, who was en route to New Hampshire for a political trip at the time, took a victory lap. “I am really honored, frankly, to have played such a big role in hopefully, hopefully, getting rid of this issue,” he told reporters. But he still refused to accept that Mr. Obama’s birth certificate was authentic. “We have to look at it to see if it’s real,” he said. On Friday, Senator Lindsey Graham, Republican of South Carolina, a frequent critic of Mr. Trump, said he was glad that Mr. Trump “now rejects the crazy idea President Obama wasn’t born in America. ” But he warned that this would not end the discussion. “The problem he’ll have is that he was a leader of this movement,” Mr. Graham said. “I don’t think he did the country a service, himself a service or the party a service by pushing this so hard and so long. ” Democrats seized on Mr. Trump’s remarks as a litmus test for Republican candidates. “He continues to disqualify himself, and yet Republican Senate candidates continue to stand by his side,” said Sadie Weiner, a spokeswoman for the Democratic Senatorial Campaign Committee. She said Republican candidates needed to say “if they think Donald Trump should apologize to the American people for the absurd lies he has spread about President Obama and why they continue to support a campaign that provides a safe harbor for this type of disgusting race baiting. ” Mr. Trump took no questions after his remarks about Mr. Obama. As reporters shouted questions, he smiled and left the room. Not long after, the structure holding up the curtain that had provided a backdrop for his remarks collapsed, sending American flags toppling to the ground. No one was hurt.'"}, "time": 1742562145.8644931}