{"duration": 0.08521866798400879, "input_args": {"text": "'Nobody knew about this interview for a long time. Vanga made this prophecy just before her death. She asked not to make it public before the new century.\\n\\nOnce Anatoly Lubchenko, Ukrainian businessman and traveler, brought an ordinary audiotape to the correspondent of the Mirror of the Week.\\n\\nAnatoly tells: ‘I visited her in summer 1994, when I was elected to the Rada for the first time. I was just having rest in Bulgaria and somehow I got the idea to come and have a look at her house. I heard that she was ill and had no hope to see her, but when I came to Petrich, a man came out of the crowd and invited me in. They looked at me as if I was leprous, and I really felt scared – who could wait for me?..’\\n\\n\\nShe was lying on a big bed and looked as skinny as a spire. It was quiet there; the flies were spinning around under the limed ceiling. I saw that her days were counted, however there was a long line of people waiting for their turn outside where everyone was anxious to ask about their problems. And there was I who came accidentally and who didn’t know what to ask about.\\n\\nAt that moment she turned to me: ‘Where is your farther?’ In Germany, I answered. She kept silent for a long time and I understood that she knew about his cancer. ‘Soon, – she said, – this disease will be defeated, chained with iron. But your father will not overcome it’. Then she kept silent again and added: ‘But you will be ok, Kiev is a good city, I see…’.\\n\\nAt that moment I thought about my tape recorder with an English lessons tape in it. ‘May I record our conversation?’ I asked. The man sitting on the bench looked at me as if I was his worst enemy, but she laughed as a young lady and said: ‘Yes, but don’t show it to anybody before the new century’. \\n\\n\\nTHE INTERVIEW: \\n\\n– How did you become a seer? \\n– I often saw people who died a long time ago, and they told me what would happen to other people. After that, there came a tall stranger. He told me that the war would start tomorrow and that I must tell people who would die and who would survive and how they could escape death.\\n\\n– Was he alive? \\n– No, dead, just like others.\\n\\n– How did he look like? \\n– A big shadow, waving like a reflection.\\nThey all look like this, or sometimes there is only a voice.\\n\\n– How do you talk to them? \\n– I feel when they appear. First I speak aloud, then I continue in my mind and after that I fall through and can hear everything. The voice comes from a distant place as if on the radio, sometimes it sounds clear, sometimes not…\\n\\n– What do you feel, when ordinary people come to you? \\n– I can see them from afar, each of them, and I know all their lives, as if I’ve watched a film. They are good, evil, different… Everyone wants a miracle and weeps afterwards. But when things are really bad, I keep silence, don’t tell anything. I can only advise.\\n\\n– What? \\n– That people should not be evil, should not revenge or offend anybody, should do good things. They should listen to their hearts. It should be always the heart, because the head makes more mistakes. The heart is connected to cosmos. But not everyone can distinguish between the voice of the heart and the voice of the head.\\n\\n– These dead people tell you just about the future or the past also? \\n– About everything.\\n\\n– What if it concerns distant people and events, like in other countries? \\n– Distances and languages don’t matter, everything goes through the cosmos.\\n\\n– Can you say what will happen to us? \\n– Russia will be ok, but as for Bulgaria and Macedonia – not really. The women in Russia will give birth to many good children, who will change the world. Then there comes a miracle, miraculous times. The science will define what is true in the old books, and what is not. It will find life in cosmos and find out how it came to the Earth. A big city will be dug up. New people will come from the sky, and many miracles will happen. But you have to wait; you must not rush things up, this will happen in a distant future…\\n\\n\\n– And what will happen soon? \\n– The end of the world will happen in nine years, the Earth will turn away from the Sun, so the ice will appear in previously hot places, many animals will die. The people will fight for energy, but their spirits will be strong enough to stop fighting. And then the time will go back.\\n\\n– They say that the end of the world is the deluge… \\n– Deluge will happen also, in about thirty to forty years. A big body will fly to the Earth and hit the water. The waves will wash away many countries, and the sun will fade away for three years.\\n\\n– But will the people survive? \\n– Good people will survive, while the evil ones, those who consider themselves smart, will perish. Many people will die. And then very good life will follow, immortality will come.\\n\\n– The golden age is going to come on the Earth? \\n– It is already coming, but not everyone can see it. In seven years people will stop seeding and cropping, they will only grow things. Animals will breed like plants, while plants will breed like animals. In twenty one years’ time no one will travel on the ground. Trains will fly on the sun wires, oil will be forbidden, the ground will be just giving birth and having rest. In forty years modern diseases will disappear, but the new ones will appear. They will be connected with the brain, because everybody will drink from the sea, and there will be no isles in the sea. Then the water will be found in cosmos, and this water will be good. There will be a huge population. India will be bigger than China. But people will start getting rid of their bodies.\\n\\n– What does it mean – getting rid of their bodies? \\n– One can live without a body, just a personality, just energy, like the dead. But this is a distant future.\\n\\n– Can you predict something about politics for the nearest five years? \\n– Russia will get thinner and take its place again, there will be kindness on the inside and experience on the outside. Europe won’t get younger. America will accept the one with a beard and understand that fear is worse than love. Syria will fall to the feet of the winner, but the winner will turn out to be someone else. Aliens will refuse sharing their knowledge with the strong one. Women’s countries will step back before the men’s ones, but will retain their agendas. A small man will rule you throughout life…\\n\\n– Is there God in the world? \\n– God cannot be in the world, for God IS world. There is no God in the human, but there is a human in God.\\n\\n– Do heaven and hell exist? \\n– Heaven and hell are different sides of the out-of-body life. If the dead person is needed by the living ones – this is heaven.\\n\\n– Are you going to help the living ones after your death? \\nBaba Vanga didn’t answer. Soon there came a click on the tape as if someone had turned it off, although Anatoly swears he didn’t do it. He says that Vanga just got tired and fell asleep…\\n\\nShocked Chicken \\nSOURCE '"}, "time": 1742628460.1112266}