{"duration": 0.21944022178649902, "input_args": {"text": "'https://vault.fbi.gov/hillary-r.-clinton/hillary-r.-clinton-part-04-of-04/view (p. 44) “Early in Clinton’s tenure as secretary of state, she and her staff were observed removing lamps and furniture from the State Department which were transported to her residence in Washington, DC,” After leaving the White House, Hillary was forced to return tens of thousands of dollars worth of White House furniture, china, and artwork that she had stolen. The fact that she stole State Department furniture shouldn’t shock anyone. Recurring Hillary Clinton behavior. 63. Hillary told Tim Kaine back in July 2015 he would be VP https://www.wikileaks.org/podesta-emails/emailid/25445#efmALMAM- “…HRC has personally told Tim Kaine he’s the veep.” “Won’t stop assuring Sens Brown and Heitkamp (at dinner now) that HRC has personally told Tim Kaine he’s the veep.” Kaine says he only knew 48 hours before the announcement. Solidifies all theories that he dropped out as the DNC chair so Debbie Wasserman-Schultz could replace him (and help ensure she rigged the primary for Hillary against Bernie as evidenced in earlier leaks) and open door for Kaine to be VP. This is despite her saying he would be a terrible choice for Obama’s VP in her book when she was talking about the last election. But she needed DWS in charge to ensure she was the nominee. 64. Hillary tweaks her policies based on donors’ wants https://wikileaks.org/podesta-emails/emailid/25320#efmAFmAHCATBAUQ “Raisers are effectively salespeople selling the candidate on the donor marketplace, so their feedback is valuable to HQ in terms of tweaking policy, messaging, tone, etc … big donors usually have ideas/advice and want to feel like they are being heard.” These leaks prove that Hillary will do anything for money, regardless of morals. Her staff even comments often about how worrisome it is. She takes money from countries who kills gays, enslave women, and persecute Christians and doesn’t care about any of it. She changes her policies based on who gives her what. She sells U.S. assets to countries who donate… what a mess… 65. Hillary camp admits it doesn’t support $15 minimum wage https://wikileaks.org/podesta-emails/emailid/2893 “Substantively, we have not supported $15 – you will get a fair number of liberal economists who will say it will lose jobs.” Even if they flip-flop and say they will implement it, they still admit that it is bad for the economy according to liberal economists. 66. Illegally coordinating with Priorities USA, a SuperPAC funded by George Soros https://wikileaks.org/podesta-emails/emailid/2372 “So afraid that NYT is going with this story on Priorities whether we like it or not. They have sources about the meetings.” They were scrambling to make sure they were within the law and really worried the donor list was about to come out. The New York Times spiked the story about the corruption to protect her, shielding the donors which OpenSecrets.org shares with us from a later disclosure . As you can see clearly there, the top contributor is none other than George Soros with $6 million in. Staff from the two groups met and coordinated efforts, which caused the concern from Hillary’s side because the Priorities people were talking and the media, specifically the New York Times hid this violation of campaign election law. 67. Racist and sexist remarks: “too white and too male” https://wikileaks.org/podesta-emails/emailid/24546 “Reed’s lists are still too big, too undifferentiated too white and too male.” Just because the people being referred to are white and male does not stop it from being racist. Just replace it with black and female and you can see why. Race and gender should not be the main determining factor when it comes to administrative positions, only experience and merit, but for Hillary’s staff and democrats race and gender are the determining factors unfortunately. 68. Podesta illegally has access to top secret information https://wikileaks.org/podesta-emails/emailid/11042#efmASpAWS “Two exceptions–White House requests he can handle by email; if any other emergency request comes up, I can process. I’m holding a TS clearance. Scott, you may need to figure out what we need to do to add me to the review authority.” Why does Podesta have a top secret clearance? He’s not holding a government position… 69. Podesta connects to unsecure network where anyone could access classified files https://wikileaks.org/podesta-emails/emailid/10270 “Yes inbox finally opened up. I should never connect to Amtrack wifi. Seems to always screw things up.” Holds TS clearance, conducts official campaign business on unsecure Amtrak WiFi… These are the people Hillary will trust to secure our secrets once in office. Good God… 70. Hillary’s speechwriters: “I don’t mind the ‘backs of dead Americans’ because we need a bit of moral outrage.” (Benghazi) https://wikileaks.org/podesta-emails/emailid/3049 One prominent theme throughout the leaks is that Hillary is just a put together political head piece that is drafted, rewritten, and approved before being sent into public. They note where she should be outraged, they note where she should smile, she even sighed when they told her to sigh. All of the words coming out of her mouth go through weeks of tweaking so that she comes off as likable – and yet she still comes off as a cold. 71. The AP colluding with the Hillary campaign https://wikileaks.org/podesta-emails/emailid/4099 “They do not plan to release anything publicly, so no posting online or anything public-facing, just to the committee. That said, they are considering placing a story with a friendly at the AP (Matt Lee or Bradley Klapper), that would lay this out before the majority on the committee has a chance to realize what they have and distort it.” And the AP is supposed to be THE NEUTRAL news source… wow… 72. Hillary’s camp says she has a “character problem” and is “arrogant” https://wikileaks.org/podesta-emails/emailid/11136#efmAC0AGw “I know this email thing isn’t on the level. I’m fully aware of that. But her inability to just do a national interview and communicate genuine feelings of remorse and regret is now, I fear, becoming a character problem (more so than honesty). People hate her arrogant, like her down. It’s a sexist context, but I think it’s the truth.” Her closest confidants admitting what everyone already knows. She is not genuine. 73. Staging fake anti-Trump protest, conspiring with Univision CEO https://wikileaks.org/podesta-emails/emailid/3718 “Thinking about the early 4, there is the Trump International Hotel in Vegas. Maybe there is an organizing opportunity next week. Would be good to reach out to unite here.” Previous leaks months ago proved many of the “protests” were staged and hired people to be there with professional signs. The James O’Keefe bombshell video ( first one ) proves that all these “protests” were staged and they paid mentally ill people to incite violence. 74. Meeting to go over Cheryl Mills’ testimony https://wikileaks.org/podesta-emails/emailid/12105#efmAC4ADoAHvAIE “Please see below for today’s 8am meeting agenda. Also, please note that this meeting should last a full hour” Lists items to talk about “Timing of Focus Groups re Debate Prep”“8/31 Email Release”“Jake/Cheryl Testimony.” Memo revealing they were discussing the testimony of Cheryl Mills in meetings It must have been highly important to keep all of their stories straight, properly vetted and discussed. 75. Iran nuclear deal was “greatest appeasement since Chamberlain gave Czechoslovakia to Hitler” https://wikileaks.org/podesta-emails/emailid/727 “This agreement condemns the next generation to cleaning up a nuclear war in the Persian Gulf… Yup.” Top Hillary advisor agrees with that statement, indicating they know the Iran deal was terrible despite what they state publicly (another public vs private position). 76. Journalist talks strategy with Clinton staff and asks for permission to write article https://www.wikileaks.org/podesta-emails/emailid/6453 “am not going to raise this publicly, but one of HRC’s opponents will soon charge that she is running an “imperial campaign.” If it is the right opponent, Democrat or Republican, the charge will resonate.” “BTW, I may doing an Elizabeth Warren column soon. If I write that my optimum scenario would be for Elizabeth to ultimately give a big endorsement to HRC and give the keynote speech at the Convention, totally off the record, would that give you a problem? It would be my personal opinion only, but if you have a problem with my suggesting this as my idea, I won’t tell anyone and I won’t include it, deferring to you” Yes. This supposed journalist is discussing strategy with the chairman of the Hillary Clinton campaign. Giving him information and warnings about things he learned from other sources most likely off the record. Extreme collusion between the media and Hillary’s staff. But wait, there is more! He is asking permission from Podesta to write parts of an article. John Podesta responds to the email, and grants permission for the journalist to write the story as originally planned. 77. Bill Clinton admits Clinton Foundation has no “real projects” “He also said he’s worried about the pensions commitment and not having real projects to announce at CGI america. I said we are concerned too…” It was also mentioned that the employees are unhappy. 78. Violating campaign finance law https://wikileaks.org/podesta-emails/emailid/13999#efmAClADMADOAEwAIPAI3 “I’m swinging way above my weight class here. And I’m 100% sure this out of protocol. I’m trying to land the campaign a big fat whale that can give between $100,000 to maybe $1 million if their ego can be reassured that they won’t be just treated “just like any other donor. With your permission, can I CC you in an email to these guys. I’m work with Haim Saban’s political director on these same guys. If it’s 100% inappropriate I understand.” Haim Saiban is the owner of Univision, who has been working with Hillary as revealed throughout the leaks. 79. Interfering with the 2008 Republican primary process https://wikileaks.org/podesta-emails/emailid/27648 “Yes, we need to move with some tactics to try to stop him. Ideas? We should take another swing at the immigration angle. I think this is a crisis. We need to ring the alarm bell. But I’m not sure how we could affect the GOP primary? Earned media play on McCain and immigration. Robocalls to suppress his vote? Turnout evangelicals for Huck?” What right do they have to interfere in another party’s primaries? Not surprised though. 80. Proof that ‘Correct the Record’ (SuperPAC) is directly coordinating with the Hillary campaign against federal campaign law https://www.wikileaks.com/podesta-emails/emailid/5636 (in attachments) “In May of 2015, CTR separated from its parent organization, American Bridge, and became its own SuperPAC. This structure allows CTR to retain its independence but coordinate directly and strategically with the Hillary campaign. This work is necessary now more than ever.” Correct the Record (CTR) is a group funded by globalist billionaire George Soros to pretend Hillary has support online. They pay “an army of nerd virgins” ( their own words ) to create memes and pretend to support Hillary. On popular internet sites like Reddit, Twitter, and Facebook, they are paid to ‘downvote’ or ‘dislike’ or delete anything pro-Trump/anti-Hillary, and fake-promote anything pro-Hillary/anti-Trump. Incredibly sad, but Hillary and her “support” is staged in every department. The same attachment describes everything. 81. Facebook founder Mark Zuckerberg in direct contact with the Hillary campaign https://wikileaks.org/podesta-emails/emailid/15092#efmARfAUUAZpAd9AfGAf6 “[He is] particularly interested in meeting people who could help him understand how to move the needle on the specific public policy issues he cares most about. He wants to meet folks who can inform his understanding about effective political operations to advance public policy goals” They are basically saying he wants to learn how to bribe people. Mark Zuckerberg has been very outspoken about Trump and his wall idea, when he himself is building a large wall around his mansion. Guess protecting yourself is OK, but not the American people. Facebook also manipulates it’s trending stories to not show pro-Trump/anti-Hillary articles or trends, and even censors videos against Hillary . The censorship is well known and has reduced Facebook’s integrity tenfold. Pro-Trump stories with hundreds of thousands of mentions are deleted to allow room for anti-Trump articles with less than a thousand mentions. Happens literally daily. Unfortunately this is the case across Twitter , YouTube , Google , and Reddit as well (and why it seems like at times more support Hillary despite Trump getting 30,000 at his rallies and Hillary getting 200 ). They are in the tank for Hillary. 82. Hillary’s team working with hundreds of MSM news pundits https://www.wikileaks.com/podesta-emails/emailid/5636 (in attachments) “IMPACTING THE DIALOGUE: CTR has identified 372 surrogates including influential and frequent pundits on broadcast and cable news for Presidential 2016 politics and provided them around 80 sets of talking points…” Once again, shows the media collusion with the Hillary campaign. 83. Katy Perry is a puppet for Hillary Clinton https://wikileaks.org/podesta-emails/emailid/27006 “She said no to asking Chelsea. Would go herself before asking her daughter. So we are at plan B: Katy Perry it is.” Huma Abedin writes that they have to send Katy Perry to do an Arkansas event because Hillary is unwilling to ask her daughter to go. Katy Perry is such a puppet for them that they can use her as a replacement for Chelsea when needed. 84. Hillary tries to hide her tiny rallies'"}, "time": 1742563188.5550826}