{"duration": 0.07986617088317871, "input_args": {"text": "'BLM Rapper & Bill’s Alleged Son Have Nasty Surprise For Hillary Posted on October 31, 2016 by Rebecca Diserio in Politics Share This \\nIt looks like when it rains, it pours, and Hillary Clinton is now facing a big problem with Black Lives Matter. It all stems from an alleged affair Bill Clinton had with a black Arkansas prostitute, which produced a son. Now, after years of trying to find out the truth about his biological father, the rumored son’s cause is being taken up by a black rapper, and they have a really bad surprise for Hillary. Rapper “Freenauts” wears “Hillary for Prison” t-shirt while performing rap song “Justice For Danney Williams” \\nThe BLM rapper “Freenauts,” wearing a “Hillary for Prison” t-shirt, put out a video, performing his rap song “Justice for Danney Williams,” referring to Bill Clinton’s alleged lovechild. The video has just over 100,000 views, but now that it is the last week before the election, Donald Trump supporters, as well as Black Lives Matter supporters, are posting it all over social media. \\nThe plight of Arkansas resident Danney Williams has been around for years, and in the past, Hillary’s henchmen put out disinformation to the press to make it seem as if Williams claims had been proven false. \\nIn fact, Danney Williams has never had a DNA test, and many in the media are now realizing that not only does Williams resemble Clinton but his story rings true. Up until Bill Clinton became president, Williams recalls with great detail the Christmas presents Arkansas troopers would bring to his house from then-Governor Bill Clinton. Growing up, Williams was told by his mother and even his teachers that he was Bill Clinton’s son. Rapper “Freenauts” artwork for his song “Justice For Danney Williams” (left), Bill Clinton & Danney Williams (right) \\nWith Hillary taking a hit this week, she can’t afford to lose any of her support from minorities, especially the African-American community. Unfortunately for her, it looks like that may happen after WND made this announcement from Williams: \\nDanney Williams, the man from Little Rock, Arkansas, who has claimed since the 1990s to be the black illegitimate son of former President Bill Clinton, will hold a press conference Tuesday at the National Press Club in Washington, D.C., to make an announcement his supporters characterize as a “bombshell that will rock Hillary’s campaign.” \\nOn October 19, WND reported that lawyers representing Williams, in the hours before the third and final presidential debate in Las Vegas, announced their intention to file a paternity suit demanding DNA evidence from the former president. \\nIt looks like Hillary may be in for a drop in support by African-Americans after Williams describes her as the mean woman who chased his mother away from the Governor’s mansion when he was only a few years old. It may be a day of reckoning for Hillary as everything that can go wrong is all happening at once, and we couldn’t be happier. May Hillary get everything she deserves and then some.'"}, "time": 1742561737.4382453}