{"duration": 0.03157663345336914, "input_args": {"text": "'Frosé? That’s a summer drink. Hot toddies, eggnog, mulled wine? Please, those are for your parents. No, no, the   drink of winter 2016, at least according to a small but dedicated circle of food blogs, is red wine hot chocolate. A post this fall on Martha Stewart’s official Facebook page called it “spectacular. ” Soon after, Cosmopolitan magazine called it “the best of both worlds. ” The Kitchn, a popular recipe site, called it “the answer to your   blues. ” And last month, The Daily Mail had an “exclusive” on a version of the recipe that had grown popular on Pinterest. The basic idea is not new. Most versions follow the same formula as the one posted in 2014 on Imma Eat That, a food blog that has frequently been cited as the recipe has rocked around the internet in the past few years. It’s pretty easy to follow: Depending on your thoughts on hot chocolate, on red wine and on the trend of mixing two separate foods together in heretofore unimagined and occasionally unholy ways, this sounds like either the best idea or the worst idea. And when you can already easily add rum or whiskey or any other spirit to hot chocolate, what else can red wine really bring to the table? The first reaction most people had when they heard about this story? A crinkling of noses and the occasional “eww. ” It was definitely mine. The key is to start with a good hot chocolate, said Jacques Torres, a New York pastry chef whose public identity is so fused with chocolate that he is known as “Mr. Chocolate. “You’re going to use real chocolate,” he said, not cocoa powder, and warm it with milk and a bit of condensed milk for extra silkiness. “Finished chocolate has all the flavor you want,” he said. “It’s smooth and silky it doesn’t have any bitterness. ” Mr. Torres also suggested an important deviation from most of the recipes out there: Do not heat up the wine and the chocolate together. Make your hot chocolate and separately make some mulled wine only then should the two be combined. “If you don’t get the spices, it’s not going to be that good,” he said. “But it can be good with the spices. ” He suggested mulling the wine with allspice, and ancho and chipotle chiles “so you have a little bit of heat with it. ” And so one cold Sunday I set about making this strange Frankendrink. I followed Mr. Torres’s advice, using two especially dark chocolate bars for the hot chocolate. The mulled wine was a simmered mix of what was on hand: orange slices and sugar, water and an entire bottle of cheap red wine (I used a $9 malbec, minus a glass for drinking just in case this whole chocolate thing didn’t work). Allspice, cloves, star anise and cinnamon rounded it out. And then I stood facing two simmering pots of liquid that my brain was still screaming should not be combined. Wine is good, I told myself. Hot chocolate is good. So both went into a mug, were stirred together and topped with a marshmallow. And it was absolutely delicious.'"}, "time": 1742628598.4877107}