{"duration": 0.06315207481384277, "input_args": {"text": "'Amazon will start to ship television sets with Fire TV built in as early as next month, according to a report. [The TV sets, which support “4K video, and pack a   processor, 3GB of RAM and 16GB of internal storage for apps,” will replace Amazon Fire sticks and boxes and are currently available to preorder in various sizes.  “Amazon and Element as well as Westinghouse first announced Fire   TV sets at CES in Las Vegas earlier this year,” reported Variety on Tuesday. “Now, the companies shared a number of additional details, including pricing. Element’s   Fire TV Edition will retail for $449. A   model and a   model will cost $549 and $649, respectively, and a $  model will retail for $899. ” The sets also “directly integrate    broadcast TV,” allowing users to switch between live shows and   streaming services. “Right now, all of this only works with    television, but Gupta said that the ultimate goal was to integrate with streaming TV providers like Sling TV and PlayStation Vue as well,” continued Variety, adding that it will eventually “take away the need to ever use a cable box again. ” “It will have a longer life cycle than a regular smart TV,” said Amazon’s Smart TV Vice President, Sandeep Gupta. “We see Fire TV Edition as a true cord cutter solution. ” Google are also expanding into the television industry with their upcoming YouTube TV package. The package will act as a “skinny bundle” to compete with current cable television providers and will cost just $35 per month. The monthly fee will get users “6 accounts, 3 of which can be used to stream live TV concurrently, and access to 40 different networks, including ‘ABC, CBS, FOX, NBC, ESPN, regional sports networks, and dozens of popular cable networks,’” while it will also use an A. I. searching system similar to Netflix. Customers will, however, be forced to watch commercials on many programs that are not live and are recorded. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742561896.9689429}