{"duration": 0.1121525764465332, "input_args": {"text": "'Until the last mouse click of “To Build a Better Beta,” Pied Piper has existed only in the abstract, with endless promise and limitless value. Richard’s compression platform could be worth billions. It could be the next Facebook. It could change the world. Alternately, it could be utterly worthless, one of the countless failed   that pile up in Silicon Valley like E. T. cartridges in a New Mexico landfill. As Erlich Bachman, the father of such stillborn incubees as Aviato and Nip Alert, says, “Shuttering a company in the Valley like a rite of passage, like herpes simplex one. ” The metaphor gets more disgusting from there. Sunday night’s episode opens with Richard feeling exposed. He has fought hard to get his idea off the ground, but there was a certain amount of comfort in not getting what he wanted. Action Jack’s push for a clunky data storage appliance may have insulted his vision of an elegant compression engine with mass utility, but he could still hide behind the box. If Jack had prevailed, Richard could grouse forever about how his brilliant algorithm was squandered by a   businessman and no one could question it. Bringing the pure, uncompromised Pied Piper into the world is a dream that nonetheless puts Richard on the precipice of a true, lasting, fatal disaster. “To Build a Better Beta” is about the release of the beta version of Pied Piper, which is an important period for any tech company to work out the kinks before an official launch. It’s not one of the funnier episodes this season, because there’s so much heavy lifting required from a plotting standpoint, but it touches smartly on themes of trust, friendship and the lies we tell our friends and ourselves. That’s the benefit of “Silicon Valley” constantly bogging down its characters with setbacks and   conflict: Their response clarifies who they are and brings their relationships into sharper focus. The good news for Richard is that almost everybody loves the platform, including one notoriously critical user who calls it the best beta he’s seen in 15 years in the Valley. A beaming Jared enthuses, “I don’t want to count our chickens before they’re hatched  —   I mean, 3 percent of hatchlings are born mutated or dead  —   but we may have a healthy brood on our hands. ” The bad news is that Monica, whose opinion he values the most, so dislikes it that she initially lies to him about ever trying it at all. Her reassurances are comforting: She passed on a 20 percent stake in Slack, which she still doesn’t get (“Is it email? Is it a chat room? ”) and besides, in this business, investing in people is wiser than investing in products. And yet her general complaint about Pied Piper feeling too “engineered” seems on point, given the distance between the   coding nerds on Richard’s team and the ordinary flesh sacks who would actually be using the platform. “To Build a Better Beta” makes a joke out of Dinesh and Gilfoyle’s failure to fill out a   invite list. It stands to reason that users would find their software   too. The guys at Pied Piper know code, but they don’t know people (or business or fashion or social cues or other   matters) which is in large part of what makes “Silicon Valley” so funny. Gilfoyle and Dinesh each have a cover for their personal dysfunction. Gilfoyle writes off the whole of humankind as inherently venal and untrustworthy: “It’s a war of all against all. The history of humanity is a book written in blood. We’re all just animals in a pit. ” (Jared’s deadpan response, “I feel very sad now,” may be the funniest moment of the episode.) Dinesh merely makes up friends in the dim hope that no one will try to verify them. These cool dudes are too busy “snowboarding in Tahoe” to answer questions about the beta. (As ever, Jared is sympathetic, recalling all the escape plans he hatched with his imaginary friend, Harriet Tubman.) So underneath all the lies told in “To Build a Better Beta,” there’s a pitiful, childlike vulnerability. Monica doesn’t want to hurt Richard’s feelings when his confidence is at its most fragile. Gilfoyle and Dinesh don’t want to admit that they’re the only true friends each has. Only Jared seems comfortable in his own skin, which he’s described as his “home” when he has no place to sleep. Now that they’re finally releasing Pied Piper to an internet of faceless, unsympathetic, often hostile users, they’ll be totally defenseless. The creators of “Silicon Valley” surely know the feeling. Bytes • The unraveling of Bachmanity continues apace, with Erlich and Big Head scrambling to recover $6 million in funds their devious money manager has tucked away for tax purposes. The succession of disastrous meetings gives T. J. Miller an opportunity to hold court, which is always comedy gold. I particularly liked Erlich’s upset mood over the poor recovery efforts on his missing tiki head. • The episode makes a subtle point about the total disregard Silicon Valley has for matters of privacy. Hooli finds out about the Pied Piper beta by spying on company email. Gilfoyle finds out about Hooli scamming an invite code through the “God view” he installed in the platform. The show doesn’t make them equivalent violations  —   Hooli’s is more nefarious, Pied Piper’s more useful  —   but it’s taken as a matter of course that privacy concerns are a joke in the tech world. • Big Head has lost his entire $20 million settlement, but he gets to keep both of the cannonballs he rented. He’s going to be O. K. •   isn’t my favorite character, but his presence as a Erlich’s unwelcome tenant and tormentor this season has been good for a few stray laughs, none heartier than his prank phone call in the seconds before launch. “Erlich Bachman, this is your mom. You are not my baby. ”'"}, "time": 1742562114.4176095}