{"duration": 0.08127689361572266, "input_args": {"text": "'Monday, 31 October 2016 1/2 of The Political Circus Parade \\nHenry Louis Mencken was an American journalist, satirist, cultural critic and scholar of American English. He is regarded as one of the most influential American writers and prose stylists of the first half of the twentieth century. He died in the 1950\\'s. \\nHe keeps me awake at night by speaking to me about American politics and urges me to print his thoughts. In that sense, I am attempting to \"channel\" Menken but imperfectly. No one can equal his brilliant, acerbic take on the imperfections of the American political system and his contempt for ordinary voters politicians, and government employees. \\n\"\"The American political system! It spawns an obvious lunatic by the name of Trump, and an obsessive compulsive secrecy -unimaginabed Clinton, who is a dangerous war hawk willing to risk world war III by challenging Russia in Syria! The American political system! A clown show of an election dominated by the grabbing of vaginas, penis pictures of Weiner\\'s wiener, and trips down memory lane about Bill Clinton\\'s cock,\" he tells me. \\nHe comments to me about the FBI\\'s interference in the current election. \\n\"FBI director James Comey should be fired immediately by Attorney General Loretta Lynch or President Obama. He serves at their pleasure, they are his bosses. Comey is in violation of the Hatch Act. He was told by his superiors in the Justice Department not to discuss developments in the on going investigation of Hillary Clinton\\'s e-mails 11 days for the Presidential election of 2016. It\\'s crazy, Comey admits there is no evidence of any sort of a scandal,\" Menken tells me. \\n\"The Hatch Act says that that a federal employee may not use their position to influence the outcome of elections. His letter to congress, which of course was made public, casts suspicion on Clinton, although there are no specifics about supposed wrongdoing. Comey clearly knew that his actions could implicate Clinton by insinuation, \"Menken states. \\nMenken says neither Obama nor Attorney General Lynch will fire Comey. \"If they did, that would subject them to vicious attacks from the right wing. Comey went public about investigating Clinton back in July. Why? Because he was under intense pressure by the right wing to prosecute her. No FBI Director had ever gone public about an ongoing investigation before. Comey weakly gave into Tea Party-alt.right influence then and has done it again. Both Obama and Lynch cowardly stood by and let Comey get away with violations of the Hatch Act.\" \\n\"Obama! Such a hero to the liberals! He presides over I a country whose economic basis is oligarchy, whose political system is authoritarianism and spying on citizens, and whose political culture is murderous toward the rest of the world resulting in endless wars. Obama is now on pace to deport more people than the sum of all 19 presidents who governed the United States from 1892-2000! What a progressive!\" cries Menken. \\n\"But In this world of sin and sorrow there is always something to be thankful for; as for me, I rejoice that I am not a Republican. A plague upon both Democrats and Republicans. And democracy! Democracy is a pathetic belief in the collective wisdom of individual ignorance. Some 50 million of these enlightened will vote for a narcissistic meglomaniac in 2016! But Trump isn\\'t crafty enough. Wait \\'till someone more clever comes along and the U.S. will elect another Adolph Hitler,\" exclaims H.L. \\nHaving written this, Menken is silent inside my brain as I lie down and I can resume my slumber. \\n\" Make Keith Shirey\\'s day - give this story five thumbs-up (there\\'s no need to register , the thumbs are just down there!)'"}, "time": 1742562111.2524557}