{"duration": 0.1052086353302002, "input_args": {"text": "'Email \\nRecognizing, as I’m sure we all do, that every speech Barack Obama has ever given is a work of oratory genius and each monologue is more memorable than the last, I ask that you think back to his final State of the Union speech. \\nAmongst the ramblings from one statist government giveaway to the next was a segment on what the President classified as the White House Cancer Moonshot. Obama stated on January 12, 2016 that, “last year Vice President Biden said that with a new moonshot, America can cure cancer.” \\nI’m not making light of this statement, and certainly not of Biden, for he lost his son Beau Biden to brain cancer in May of 2015. \\nObama continued by saying that, “last month he [Biden] worked with Congress to give scientists at the National Institutes of Health, the strongest resources they’ve had in over a decade.” He received a standing ovation from virtually ever member in the chamber. \\nThis is my problem. Not that Biden lost his son to cancer and wishes for no one else to suffer the way his son and family did. I get that. It’s the way almost everyone in government proposes to solve the problem. It’s always the same. The federal government ponies up billions of dollars of our money to fund quasi-government science projects, which rarely if ever accomplish anything. \\nHowever laudable this particular goal may be, it is not in the federal government’s job description to be funding medical research. And to me, knowing the feds as I do – this seems to me to be another case of not letting a good crisis go to waste. \\nSome may say this is a jaded opinion and that Obama and Biden are trying to help cure cancer. How could I possibly be against that? I’m not, of course – but I am jaded, and for good reason. I would love to see a cure for all cancers, but government involvement in everything invariably creates more problems than it ever solves. Not to mention that it is just another unconstitutional function. \\nObama then stated that because Biden has \"gone to the mat for all of us on so many issues over the past forty years, I’m puttin’ Joe in charge of mission control.” Really. Name three things ole-Joe has “gone to mat” for us on. Okay – how about two. \\nSo uncle Joe Biden, with his forty years in politics, and zero years in science or medicine, is heading the White House Cancer Moonshot Task Force. Other members of the “Task Force” are from the Department of Defense, Department of Commerce, Health and Human Services, Energy, Veteran Affairs, the OMB, National Economic Council, Domestic Policy Council. Others include the National Cancer Institute, Institutes of Health, and the National Science Foundation. \\nOkay – I get the science institutes – but why the Departments of Commerce, Energy, and others? What do they have to do with curing cancer? Answer – nothing – of course, but government task forces need lots of important people. They won’t contribute anything useful, but it looks impressive. \\nSo, almost a year into the five year Task Force plan – how are things going? Have they made any progress – any breakthroughs? Nope. Joe is out making more speeches, as he did in June, exclaiming that “there is clear sense of – let’s get it done now. We can do it now.” That’s a great sentiment, but having endless meetings and simply exclaiming the urgency will do absolutely nothing. \\nAnd then ole-Joe said something telling in his speech – something Joe does quite often. He said to the scientists in the audience: “We call for help and you all answer. You didn’t need us to call. You were already doin it.” \\nSo, if this is the case – and it is – why do we need this behemoth, billion dollar government taskforce? Why then do we need this collaboration between actual cancer research and government hacks like Biden and other bureaucrats? The answer is that this is what statists do. No matter what the cause, government always must inject itself and eventually take it over. \\nThat was June – six months in. A week ago, closing in on a year after the Moonshot announcement, Obama and Biden held a sit down to report on their progress. Obama stated that Joe has traveled the country and had multiple meetings “in order to really figure out how we get this thing to achieve serious liftoff.” Yes – almost a year in and they are still trying to figure how to begin the Moonshot. \\nObama then stated that, although they would be leaving office soon, what they leave behind is the framework for organizing these efforts. And that in a nutshell, is what the statist government progressive’s goal always is – to build the framework for continual governmental meddling. Later on, they can get down to picking winners and losers, thus hindering real cancer research for those who would rather not play ball and tow the government line, just as it has done with climate science, energy, and many other disciplines. \\nWant to never cure another cancer? The best way to achieve this is to announce that we are from the government and are here to help, support and organize you. Don\\'t forget to Like Freedom Outpost on Facebook , Google Plus , & Twitter . You can also get Freedom Outpost delivered to your Amazon Kindle device here .'"}, "time": 1742562215.6850126}