{"duration": 0.02680349349975586, "input_args": {"text": "'Top White House officials told media outlets on Tuesday that they’re open to a compromise deal on immigration. [But the new reports lack any details about what compromise would be acceptable to President Donald Trump or the     voters who elected him into power.  CNN reported Tuesday that, The President is thinking about adding the topic to his speech tonight to a joint session of Congress, though either way an immigration bill remains a desire for his first term. The topic of enforcing current immigration laws is already in the speech, the official said. The actual details of any proposal are vital because every faction in the huge political dispute over imported   labor says they want a compromise. In 2013, for example, the eight senators who drafted the   “Gang of Eight” immigration bill claimed their bill was a compromise  —   even though it would have gutted sanctions for   employers, granted an   amnesty to millions of illegals, increased the inflow of refugees, and doubled the annual inflow of legal immigrants to roughly 2 million per year.   reformers have pushed their own compromises, which include an amnesty for the 11   illegals in the nation in exchange for sharp reductions in annual legal immigration plus   rules to sanction employers who hire illegal immigrants. That’s the     supported by Mark Krikorian, director of the Center for Immigration Studies, who notes that any overhaul of immigration law requires some purchased support from some   Democrats. In his winning 2016 campaign, Donald Trump won huge public support because of his opposition to amnesty and to   policies, and because of his promise to “buy American and hire American. ” In one 2016 speech, he urged a cutback in legal immigration to historical norms. He also called for a temporary pause in legal immigration, while repeating his promise for a wall that would stop illegal immigration. In August 2015, his policy paper declared: We need to control the admission of new   workers in order to: help wages grow, get teenagers back to work, aid minorities’ rise into the middle class, help schools and communities falling behind, and to ensure our immigrant members of the national family become part of the American dream. On Feb. 9, White House spokesman Sean Spicer said the president is still opposed to the 2013 “Gang of Eight” bill. But if Trump were to reverse his     policies, he’d likely face severe political problems in 2018 and 2020. According to CNN, “It has to be a negotiation,” the official said, arguing that the bill theoretically could make people on both the “far right” and “far left” happy. “It could be good for everyone,” the senior administration official said. “People are exhausted” from debating the topic. Any immigration reductions would be a strategic problem for Democrats because they are hoping that the rising tide of immigrant voters will bring them into power. Any reduction is also a problem for Wall Street investors because their   calculations assume a growing population of   immigrant consumers.'"}, "time": 1742628484.9270144}