{"duration": 0.03166079521179199, "input_args": {"text": "'WASHINGTON  —   Congressional Republicans, donning “Make America Great Again” hats on Tuesday, celebrated their impending control of government, sidestepping questions about disarray in   Donald J. Trump’s transition efforts while Democrats struggled to unify behind their leadership after a brutal election defeat. “Welcome to the dawn of a new unified Republican government,” Speaker Paul D. Ryan said at a news conference Tuesday after a meeting with House Republicans. “This will be a government focused on turning   Trump’s victory into real progress for the American people. ” Mr. Ryan, whose renomination was unanimous, deflected questions about Mr. Trump’s selection of Stephen K. Bannon, the former chairman of Breitbart News with ties to   nationalists, as his chief strategist, and questions about the role of Mr. Trump’s children in the new administration. Mr. Trump “is so successful because he’s surrounded himself with good people,” Mr. Ryan said. As for Mr. Bannon, who has relentlessly attacked Mr. Ryan, he said, smiling stiffly, “I’m not looking backward. ” Representative Nancy Pelosi of California, who has led House Democrats since 2003, found herself facing unexpected pushback in her own   efforts. She postponed a vote that had been scheduled for Thursday until Nov. 30, yielding to the demands of members who asked for more time to reassess. The delay is likely to favor Ms. Pelosi, who will have time to remind members of the money she has raised for them over the years and consolidate her support, which runs deep, especially among the women in her caucus. But the building unease with the status quo in their ranks was clear on Tuesday, members said. Before a tense meeting with members, some had urged Representative Tim Ryan of Ohio, 43, to challenge Ms. Pelosi, 76. He has not yet decided whether to run against her. Representative Marcy Kaptur, an Ohio Democrat who once challenged Ms. Pelosi, said she had previously signed a letter expressing support for her but noted that she would be willing to take a second look at someone from the Rust Belt, where Hillary Clinton lost in what had been Democratic strongholds in presidential elections. “I ran against her for this very reason, that our region needed more voice,” Ms. Kaptur said. Ms. Pelosi called a meeting with other party leaders Tuesday afternoon, and several senior Democrats said there was a jittery feeling in her camp. “We just got a shellacking last Tuesday,” said Representative G. K. Butterfield, Democrat of North Carolina and the chairman of the Congressional Black Caucus. “We got an unexpected defeat, and we’ve got to recalibrate and decide how we go forward. ” Democrats were especially stung by Mrs. Clinton’s loss among   voters. “We’re the party of Franklin Roosevelt,” said Representative Brendan Boyle of Pennsylvania. “We should not be struggling as a party the way we are with   voters. And the fact that we are signals that we need to talk. ” The battle reflects a larger debate within the Democratic Party  —   being played out in its choice for the next chairman of the Democratic National Committee  —   pitting those who want to rebuild the base of President Obama’s support among newer and more diverse voters and those who want to court anew the party’s white   voters, especially in the Midwest. Among Republicans, there was ambiguity of a different sort as they struggled to determine who was in charge of Mr. Trump’s policy agenda. For now, it appears that Vice   Mike Pence is making the calls to Capitol Hill. “Nobody really knows,” former Speaker John Boehner said of Mr. Trump’s agenda in an interview with CNBC. He added, “He is barely a Republican. He could barely be a Democrat as well. Nobody really knows where he is going. ” Other Republicans were generally positive about the prospects of a government in their full control, in spite of the early signs of a bumpy transition. Most Republicans said they knew nothing about Mr. Bannon and had little knowledge of his background. “I really have only met him once,” said Representative Peter King, Republican of New York. “People I’ve spoken to in the campaign have a high regard for him. That’s really all I know. ” There were also clear signs that not all of Mr. Trump’s appointments and legislative notions would get unanimous support from his party. Senator Rand Paul, Republican of Kentucky, spoke out against the possibilities of either Rudolph W. Giuliani or John Bolton as nominees for secretary of state. “Bolton is a longtime member of the failed Washington elite that Trump vowed to oppose, hellbent on repeating virtually every foreign policy mistake the U. S. has made in the last 15 years,” Mr. Paul wrote in an editorial. Senator Lindsey Graham, Republican of South Carolina, said he supported much of Mr. Trump’s agenda, but was also critical of his views on Russia and many of his previous policy proposals on immigration. “I will not vote for a bill that treats a grandmother and a drug dealer the same,” Mr. Graham said.'"}, "time": 1742628533.114517}