{"duration": 0.08712363243103027, "input_args": {"text": "'The Hill remarks on the high volume of leaks from the Trump White House, to the dismay of President Trump’s allies and the delight of adversarial journalists:[Barely a day goes by without some unusual tale emerging from 1600 Pennsylvania Ave. Recent examples in a single New York Times story included the assertion that White House aides have held meetings in the dark because they can’t figure out how the lights work and that the president is fond of watching television alone in his bathrobe. Trump took to Twitter to assert that the Times “writes total fiction” about him, while White House press secretary Sean Spicer insisted that the president does not even own a bathrobe. More serious matters have been leaked as well, such as descriptions of Trump’s call with Australian Prime Minister Malcolm Turnbull. Trump apparently said a U. S.  deal on refugees, agreed to by President Obama, was “the worst deal ever,” and told Turnbull their conversation was “the worst call by far” among several he had held with world leaders that day. “There have been a ton of leaks. It seems that everyone has their own leaking apparatus,” said one of the dismayed Trump allies. “I don’t know how it affects morale, but it is certainly a distraction. They have 55 firehoses aimed at them. Enough of the palace intrigue!”  The Hill reports on speculation the leaks are part of a struggle for supremacy between White House Chief of Staff Reince Priebus and strategist Steve Bannon (formerly of Breitbart News). “Insiders” shot this theory down as an “oversimplification,” arguing that Priebus and Bannon get along much better than the press tends to portray them. Another theory is that knives are coming out for White House press secretary Sean Spicer, whose friends are presumably pushing back to protect him. The Huffington Post proposes that the leaks are coming from veteran officials who are “alarmed by the president’s conduct,” because while some of the leaks are “based on opposition to his policies,” many others “appear motivated by a belief that Trump’s words, deeds, and Tweets pose a genuine threat. ” Actively sabotaging an administration one is supposedly concerned about would be a remarkably selfish and even dangerous strategy, which makes it entirely plausible for Washington lifers. The Huffington Post implies that “widespread leaks and warnings from the national security establishment” over Steve Bannon’s membership in the National Security Council might have played a role in the Yemen raid that went wrong on January 29th. The American people should feel no sense of appreciation or gratitude for those who put American troops in jeopardy and harm our national interests because they want leverage over the president. CNBC cites the advent of an encrypted messaging platform called SecureDrop during the 2016 election cycle, plus the increasing use of various other secure communication systems, as one reason for the high volume of leaks. “It’s hard to name a news organization that has not gotten in touch with us about installing SecureDrop in the past six weeks,” Trevor Timm, executive director of the Freedom of the Press Foundation, said of his organization’s popular tool. He said he thought “general fear that Trump could turn the U. S.’ surveillance on the press” combined with “unrest” in the administration was driving interest in SecureDrop. That’s an interesting contrast with how the press managed only a few days of outrage after President Barack Obama really did turn government surveillance systems on them. “I don’t think it’s impossible that a combination of leaks, and whistleblowers and investigative journalism eventually lead to the downfall of Trump,” Timm added. There might be some manufactured drama in all that talk of encrypted communications. As Randy Evans of the Republican National Committee pointed out to the Huffington Post, leakers aren’t usually caught by wiretapping or email monitoring. The preferred method is the “  test,” in which bits of juicy information are given to suspected leakers, and the boss watches to see which tidbits turn up in the press. President Trump himself has blamed the leaks on “Obama people” left over from the previous administration, in particular citing his leaked phone conversations with the leaders of Australia and Mexico. “It’s a disgrace that they leaked because it’s very much against our country.  It’s a very dangerous thing for this country,” Trump told Fox News.'"}, "time": 1742563558.7510228}