{"duration": 0.03340458869934082, "input_args": {"text": "'in: Civil Rights , Free Speech , Multimedia , Politics , Protestors & Activists , Special Interests This week political cartoonist Ben Garrison returns to the program to discuss the revival of his political visual commentary in the midst of the most tumultuous presidential campaign in recent history. Garrison also discusses his struggle with online trolls over the past several years, the broader war on free speech and political dissent, and how such phenomena are illustrated in the defamatory campaign against Canadian Professor Anthony Hall in October 2016 that led to the academic’s suspension from his university earlier this month. In a sea of homogeneity Ben Garrison’s trailblazing work offers a truly unique perspective on political and economic concerns. A longtime professional painter and freelance graphic artist, his first cartoons appeared in The San Angelo Standard Times in the early 1980s. Garrison has since been a graphic artist at the The San Antonio Express News and The Seattle Post-Intelligencer . In 2008 the big banks were bailed out, which served as Garrison’s wake-up call. The bailout marked the point where he felt he had to do something. Using his graphic art skills he wanted to ring alarm bells and so he became a citizen muckraker. CLICK HERE TO LISTEN In 2009 Garrison began drawing editorial cartoons that skewered the Federal Reserve and the growing police state in America. The Internet made it possible for his cartoons to be seen by millions all over the world. The Internet also made it possible for anonymous entities to deface his work, libel his name and make him into the most trolled cartoonist in the world. Garrison’s wife Tina Garrison is also a cartoonist and in 2010 they began the web site “ grrr.graphics.com .” It features a growling bulldog named “GRRR” who takes a bite out of tyranny. Their dog is doing the job as watchdog that the mainstream media now seems reluctant to do.'"}, "time": 1742562499.0499783}