{"duration": 0.06513309478759766, "input_args": {"text": "'\\nMegyn Kelly will co-host “Live with Kelly” alongside Kelly Ripa on the morning after the presidential election, Nov. 9. It’s anyone’s guess what the Nov. 9 timing means.\\nThe Fox News host of the “The Kelly File” will join Ripa much like Anderson Cooper, Seth Meyers and others have been doing as co-hosts since Michael Strahan left the show for a new role on “Good Morning America,” according to People magazine on Wednesday.\\nActress Naomi Watts and actor Michael Ealy are also scheduled to appear that day.\\nThe Wrap noted that Kelly’s co-hosting gig comes as speculation continues to swirl about her next move as her Fox News contract expires in 2017.\\n“Live with Kelly” which is nationally syndicated by Disney/ABC Home Entertainment and TV Distribution, noted People.\\n“Cue up speculation that Kelly is flirting with ABC News – ‘Live with Kelly’ being syndicated by ABC-parent Disney, and a timeslot competitor to NBC News’ cash cow ‘Today’ show,” said Lisa Moraes on Deadline.com.\\n“In one of those incredible coincidences, word of the booking on the significant election-cycle morning broke the same day Fox News interim CEO Rupert Murdoch gave an interview to his newspaper Wall Street Journal, to publicly announce Kelly is important to the network and he hopes to get her under contract ‘very soon,’ while adding, ominously, ‘we have a deep bench of talent, many of whom would give their right arm for her’ timeslot.”\\nCNN Worldwide chief Jeff Zucker praised Kelly earlier this month, calling her “a tremendous news anchor” but was coy in addressing her contract coming to an end at Fox News, according to Deadline.com, adding “I’ll leave it there.”\\nKelly and fellow Fox News host Sean Hannity had publicly feuded this month over the presidential election, according to the Washington Post, and she told Variety in April she was unsure whether she would resign with Fox News.\\n“I really like my show, and I love my team,” Kelly told Variety then. “But you know, there’s a lot of brain damage that comes from the job. There was probably less brain damage when I worked in the afternoon. I was less well known. I had far less conflict in my life.”\\n“I also have three kids who are soon going to be in school from 8 a.m. to 3 p.m. I come to work at 3:30. I like to see my children. Having said that, my boss has been good about working with me to make me happy – he knows I’m a hard worker. I’ve had few problems here where I couldn’t talk to him and say, ‘Can we work something out?,’ and come away happy,” she added.\\nSource \\n'"}, "time": 1742562272.1091294}