{"duration": 0.2051229476928711, "input_args": {"text": "'geoengineeringwatch.org \\nAre unimaginably powerful microwave transmissions actively and aggressively being used as weapons of mass destruction? If all available evidence is examined, the logical conclusions are chilling. Understanding the full potential of the power that can be projected from the ionosphere heater installations (like HAARP) is difficult and complex. We all know and understand that microwave transmissions produced in our countertop ovens can heat a cup of water (or frozen TV dinners) at blinding speed. Unfortunately, most don\\'t know and thus have never even considered (let alone investigated) what massively powerful and interlinked microwave transmissions can do to the planet . When immensely powerful microwave transmissions are bounced off the atmosphere (facilitated by the atmospheric aerosol saturation) and directed back into the Earth\\'s strata (in a seismically sensitive location), the triggering of seismic activity becomes scientifically possible. The constant jet aircraft spraying of reflective and electrically conductive particles into the atmosphere (as part of the ongoing climate engineering/geoengineering assault) is a verifiable fact. Is New Zealand, yet again, the victim of microwave transmission super-weapons? There is a long list of shocking facts surrounding a number of recent catastrophic earthquakes. It is imperative to examine these facts without preconceptions or programmed denial. Let\\'s start with the month leading up to the extremely destructive 2010 earthquake in Haiti, MIT satellite monitoring detected a radical increase in ULF (ultra low frequency/microwave) radio transmissions over the quake epicenter . \\nSpacecraft Saw ULF Radio Emissions over Haiti before January Quake \\nA French satellite observed a dramatic increase in ultra low frequency radio waves over Haiti in the month before the M7.0 earthquake earlier this year. \\nDEMETER’s is an unusual mission. Its job is to monitor low frequency radio waves generated by earthquakes. \\nToday, a group of geoscientists release the data associated with the M 7.0 earthquake that struck Haiti in January. They say that DEMETER saw a clear increase in ultralow frequency radio waves being emitted from the Earth’s the crust in that region in the build up to the quake. \\nThe anecdotal evidence of electromagnetic effects associated with earthquakes is legion. Various accounts link earthquakes with mysterious light and heating effects. \\nAfter the Haiti quake, the US military moved in and occupied the country. In addition, the long drawn-out Clinton Foundation reconstruction debacle began. The following year a deadly earthquake struck Christchurch, New Zealand. Many circumstances surrounding this disaster were also troubling. Did US officials know the earthquake was coming? Some excerpts from a report on the disaster are below. \\nWas the Christchurch earthquake a terrible natural disaster, or was it a terrible MAN MADE disaster? \\n9 members of US Congress were in Christchurch for a summit meeting on Feb 21 & 22 but left Christchurch 2.5 hours before the earthquake hit and relocated to Wellington even though the meeting was not due to finish until the evening of Feb 22nd. \\nThe US Secretary of Homeland Security, Janet Napolitano, was supposed to be visiting Christchurch and speaking at the summit meeting on Feb 22, but on Feb 18 announced she was cancelling her visit 3. The Deputy Administrator of FEMA (US Federal Emergency Management Agency), Timothy Manning, just happened to be in Christchurch at the time with a US delegation. \\nAll of the rest of the delegation left Christchurch shortly before the quake hit except for Mr Manning who stayed behind, and then after the quake hit he assisted with directing the emergency response. Exactly the same thing happened with FEMA delegates with the Haiti earthquake. In Haiti , the FEMA delegates just happened to be there at the time conducting training exercises for responding to major earthquakes. \\nRecent releases from Wikileaks resulted in the headline below: \\nHillary Clinton Emails Show Advanced Warning of Christchurch Earthquake . \\nIn the days before the catastrophic Japanese Earthquake (that occurred on March 11, 2016), world renowned research institution, MIT, yet again, noted extremely profound and anomalous atmospheric heating directly over the quake epicenter . MIT published the following report: \\nAtmosphere Above Japan Heated Rapidly Before M9 Earthquake \\nInfrared emissions above the epicenter increased dramatically in the days before the devastating earthquake in Japan, say scientists. \\nThey say that before the M9 earthquake, the total electron content of the ionosphere increased dramatically over the epicentre, reaching a maximum three days before the quake struck. \\nAt the same time, satellite observations showed a big increase in infrared emissions from above the epicentre, which peaked in the hours before the quake. In other words, the atmosphere was heating up. \\nThough the science community is desperately trying to link pre-quake atmospheric heating to some unknown phenomenon of an atmospheric coupling with the pressure buildup in the strata, is this a rational conclusion? The much more logical and straightforward conclusion is this, the atmospheric heating is being intentionally created by the global network of ionosphere heaters as immense microwave signals are bounced off of the atmosphere and back down into the planet. Unfortunately, the science community is not allowed to even consider this possibility, let alone talk about it. In the period preceding the decimating Japanese earthquake, US Japanese relations were very strained . The post-quake scenario of US/Japanese relations seemed to suddenly be unquestionable, was there a connection? Was the catastrophic quake just a natural event? Or an engineered warning to Japan? \\nOn the 13th of November, 2016, another catastrophic earthquake struck near Christchurch, New Zealand . The list of troubling questions surrounding this earthquake is long and growing. Below are some quotes from seismologist Anna Kaiser (who is investigating the latest New Zealand earthquake activity): \\nWe don\\'t know what we are dealing with right now but it may be … it involves potentially more than one fault … we need to figure out what was going on before and after the 7.5 magnitude quake… \\nKaiser went on to say this: \\nWe\\'re working very hard … this is looking quite complex. The epicenter was possibly just south of the Hope fault, but it did look like \"something else was going on. \\nThe seismologist statements are only the beginning, there are many more concerning factors surrounding the latest New Zealand Earthquake that should be considered. \\nIn spite of the unfolding US election circumstances, in the days before the latest New Zealand quake John Kerry first went to Christchurch, and then on to McMurdo Station, Antarctica . The stated purpose of Kerry\\'s visit was to examine the effects of global warming and the record low sea ice, but this trip at this time was criticized by some. \\nUS Secretary of State John Kerry is scheduled to head back to New Zealand after checking out summer in Antarctica. \\nHe\\'s been criticized for heading to such a remote place while the US election riveted the world \\nHe tweeted a photograph of himself boarding C-17 cargo plane in Christchurch saying \"headed to Antarctica to see firsthand some of the drastic effects of climate change\". \\nIn Antarctica he was scheduled to meet with scientists and researchers at McMurdo Station, the largest research station of the US Antarctic programme, as well as visit surrounding areas on Ross Island, and the US Government\\'s Amundsen-Scott South Pole Station. \\nHe is the first secretary of state and the most senior US government official to ever travel to Antarctica. \\nHe is hosted by the US National Science Foundation, which manages the US Antarctic program me. \\nIn fact Antarctica has just broken a new climate record, with record low winter sea ice . After a peak of 18.5 million square kilometers in late August , sea ice began retreating about a month ahead of schedule and has been setting daily low records through most of September. Though Antarctic sea ice (and global sea ice) are at record shattering low levels, why else might John Kerry go to McMurdo Station at this exact window of time? Could the ionosphere heater (microwave transmission) facility that is constructed at McMurdo be a factor? Noctilucent clouds in the skies above Antarctica are an ominous harbinger of the atmospheric damage that is occurring there. \\nMany are under the belief that HAARP, now labeled IRI, no longer exists Operationally due to the Gakona, AK spin. One must understand that these Frequency Generators are Globally Ubiquitous. There are so many that are of dissimilar designs, and go by different acronyms, it is not seen as functionally one and the same. In the case of McMurdo’s Radome and all of the Radar equipment there ; Raytheon has had the contracts beginning to end. The National Science Foundation and Raytheon Polar Services Company are housed in the same building. For years the station has grown. It can house 1258 personnel and an average of 200 winter over. \\nRaytheon is one of the largest private \"defense contractors\" on the planet, this corporation is also the holder of numerous climate engineering patents including some that relate directly to ionosphere heaters. The power structure is likely microwaving the skies for a multitude of reasons , none of those reasons are in the interest of the common good. \\nShocking atmospheric flashing lights were filmed in the skies above New Zealand as the massive Earthquake was occurring. \\nKerry returned to Christchurch from Antarctica, and then promptly (and conveniently) departed only hours before the catastrophic earthquake struck . \\nThe statement below is from CBS news. \\nSec. John Kerry had left the country before it struck, and just landed in Singapore on his way to Oman when news of the quake was reported. \\nIs it just a coincidence that US officials always seem to safely depart quake impact zones just prior to the event? \\nThen there is this headline to consider: \\nWorld’s Biggest Seismic Testing “Blast” Ship – Amazon Warrior – Parked on top of New Zealand Fault Line \\nIs this just a coincidence? \\nThe New Zealand Prime Minister\\'s apparent apprehension about the US election results just days prior to the quake are also of interest. \\nMicrowave transmission signals/rings near Antarctica are clearly visible in the satellite composite image shown below. \\nThe regions of New Zealand near the epicenter have been constantly assaulted with aerosols spraying and microwave transmissions. \\nThe uniform ribbing of aerosolized cloud cover is a clear indication of microwave transmission exposure. Though some \"official\" sources try to explain this type of cloud pattern as being a result of the underlying land topography, this explanation is patently false. The same patterns are now regularly seen over oceans as well as land as is shown in the satellite photo below that was taken of New Zealand directly over the quake region. \\nThe image below bears testimony to what the global power structure does to those that try to get in the way of their agendas and operations. This photo is of the bridge of the Greenpeace ship \"The Rainbow Warrior\". It was bombed and sunk by the French Secret Service in order to prevent the ship and its crew from witnessing ongoing illegal and unimaginably destructive nuclear detonations. \\nOver 2 decades ago I dove alone on the wreck of the Rainbow Warrior, as it laid on the seafloor off the coast of New Zealand. I swam through the area shown above, around the ship, and examined the gapping bomb blast hole in the hull of the once noble vessel. I hovered over the wreck and contemplated the tyranny of those who rule the world. We are all at a crossroads, and the horizon is darkening rapidly. The power structure wields weapons of unimaginable destruction, they can only do so because of the order-followers that carry out their insanity. As the saying goes, \"we have seen the enemy, and they are us\". It is up to us, the people, all of us, to refuse any further participation in the insanity. It is up to us to fully investigate and fully face the whole truth. It is up to us to prioritize the fight for the greater good because we owe that debt to our children, to the planet, and to the whole. Make your voice heard , while you can, while it can still matter.'"}, "time": 1742564371.5842626}