{"duration": 0.0775899887084961, "input_args": {"text": "'Time to take a stand against the Demonic Duo: Saudi Arabia and Qatar 28.10.2016 Stoning a child who was raped by a Saudi pig? There are two pariah states in the Middle East, two bedboys of the West and two lackeys which implement western policy, two traitors to the Arab people, two blasphemers against Islam, two foci of evil, two followers of demonology, named Saudi Arabia and Qatar. It is time someone stood up to these disgusting and cowardly bullies. Nobody in the west is going to say anything against Saudi Arabia or Qatar, basically because the west is the world\\'s greatest hypocrite and coward and is governed by corporate greed, into which world the Demonic Duo has wormed its way, rubbing shoulders with the elite, educating their children in the best western schools, doing deals with piles of cash stacked on a table. The west is the Dynamic Duo\\'s whore. Print version Font Size Nobody in the west is going to say anything to their faces, or course, which does not mean they do not speak behind their backs. In the corridors of power, Saudis and Qataris are collectively referred to as fat, lazy good-for-nothings who pretend to be soooo religious at home then as soon as their aircraft takes off they consume whisky or else jet off to Casablanca, Morocco where little boys are lined up for weekends of sexual depravity. What did the Prophet have to say about that? A gay man was stoned to death in Saudi Arabia, forced to sit while a furious crowd hurled stones at his head, bellowing God\\'s will is great, God is great. Allahu Akhbar. Welcome to Saudi Arabia! They are criticized for their disgusting human rights records, their revolting abuses against women, their pig-faced arrogance, holier-than-thou attitude, aggressive and intrusive intolerance. And so what does the west have to say when Saudi Arabia and Qatar commit war crimes in Yemen? Nothing. What does the west have to say when these two countries flood Libya and then Syria with terrorists? Nothing. What does the west have to say when Saudi Arabia and Qatar fund Islamic State, directly or indirectly? Nothing . A Wikileaks document released recently apparently points towards US presidential candidate Hillary Clinton being aware of the fact that Saudi Arabia and Qatar fund Islamic State, directly or indirectly but does the United States of America hold them accountable? Enshrined in the law in most countries is the precept that it is illegal to aid or abet or finance criminal activity and doing so entails accountability. Let us then take the only course of action available. This is not to sell weapons to Saudi Arabia and Qatar under the notion that \"if we don\\'t do it someone else will\" so to Hell with ethics. A certain foreign secretary may recognize these words. But this isn\\'t the Bullingdon Club, it is the real world. Saudi Arabia and Qatar may have wallets stuffed full of notes and they may have a lot of oil to sell, weekend breaks in cushy hotels to offer, call girls or rent boys to send to secret addresses. The girl was 19 years old. She had been raped. In Saudi Arabia, it is her fault because she was \"asking for it\". So she was buried up to her neck in the sand and her head was smashed open with blocks of rocks. Allahu Akhbar! Welcome to Saudi Arabia ! But the fact of the matter is, these two countries have been guilty of murder not only in Yemen but also in Libya and now Syria and Iraq. If they finance Islamic State directly or indirectly, then they are responsible for the acts of the demons they have created and should be forced to pay compensation to the victims, pay compensation to the countries affected and pay for the cultural damage to world heritage. If these two pariah states have directly or indirectly funded Islamic State then they are both guilty of the crimes they have committed. Any business with them is paramount to criminal association and therefore the international community should cut off the cancer where it stands: no contact, no business, no travels. No Saudi, No Qatar, no problem. How the United States of America does business with these two blasphemers after 9/11 defies logic - it is like welcoming the rapist who murdered your daughter into your home and offering him a banquet. It is time someone stood up against Saudi Arabia and Qatar, called a spade a spade, it is time someone outed these two pariah states for what they are, it is time Moslems themselves stood up against them. Saudi Arabia claims it is the home of Islam, organizes the Hajj and declares itself as being the defender of the faith but in fact in its acts it is the worst blasphemer of all, committing murder and masterminding, directly or indirectly, the satanic acts of Islamic State. But Saudi Arabia donates some 20 per cent of the Clinton campaign funding. So if Hillary Clinton wins, this satanic pariah, re-elected to the UN Human Rights Council recently, will continue to act as it pleases. Remember 9/11 anyone? Let\\'s go kiss the Saudi\\'s butt. Saudi Arabia and Qatar are an insult to Islam and to the international community. Mohammed must be disgusted with them. \\nTimothy Bancroft-Hinchey'"}, "time": 1742561930.8382242}