{"duration": 0.49118995666503906, "input_args": {"text": "\"Here's something interesting from The Unz Review... Recipient Name Recipient Email => \\nWithout resorting too much to the wisdom of the ancient Greek myths, we have come to believe that states, regimes, movements and people finally will emerge to act as the inescapable agents of the justice leading to the downfall of the Western empire \\n‘Nemesis, Winged balancer of life, dark-faced goddess, daughter of Justice’ \\nIntroduction \\nSeven is a winning throw of the dice. But in our civil society, seven now signifies the multi-thong scourge, the whip used by the Western world as its instrument of punishment and, in response; seven signifies Nemesis and her sisters, the inescapable agents of the West’s downfall. \\nThe seven scourges of the Western world are used against the people of Asia, Africa, Latin and North America. These whips are constructed, wielded and unleashed especially by the US and the UK. \\nThe seven sisters of Nemesis, the Erinyes, are the Furies who pursue the injustices committed by the Western world against Asia, Latin America, Africa and Europe. Those holding the scourge detest and fear Nemesis and the Furies, but are incapable of destroying them. Try as they might, their whip is in corrupt and feeble hands and, of course, it can only follow their orders: Otherwise, it just twitches and remains immobile, while Nemesis pursues the scourgers of humanity. \\nThe Seven-Tailed Scourge of the Western World \\nThe ‘whip’ wielded by the Western world, is used to punish disobedient, ‘rebellious’ people, movements and states. Their multiple lashes have bloodied countless generations and buried millions. \\nThe seven scourges against humanity are unrepentant in their promotion of ‘Western values’ – visible to the terrified world on the red raw backs of oppressed people, their wounds flayed open by the faceless drones proclaiming their gifts of … freedom and democracy. \\nLet us go forward now and describe the pillars holding up the Western empire, the seven-tailed scourge of humanity. \\n1. Mexico: The Cartel, the Narco-State, US Bankers and Death Squads \\nOver the last two decades, over a quarter million Mexicans have been murdered by the joint forces of the drug cartels, the Mexican State and its death squads, presided over by the US state and backed by its rapacious financial sector. Cartels and complicit Mexican officials prosper because US banks launder their narco-dollars by the billions. On their part, US corporations grow even richer by relocating their plants to Mexico where terrorized workers can be exploited for 1/5 the cost. Amidst the terror and exploitation, over 11 million Mexican workers and family members have fled to the US running from their local scourges, only to confront the US scourge of deportation. Over 2 million have been imprisoned and expelled under Obama. \\n2. Honduras and Guatemala: Imperial Wars, Drug Gangs and Narco-Oligarchs \\nDestitution and state terror are direct products of US-installed regimes in Honduras and Guatemala. Guatemala’s indigenous majority was ravaged by US and Israeli-trained military battalions and death squads. In their wake, scores of narco-gangs, sponsored by local oligarchs and their own private death squads, have emerged. The Honduran people attempted to elect an enlightened liberal President, and were ‘rewarded’ for their peaceful democratic election with a military coup orchestrated by the US Secretary of State, Hillary Clinton. They further underscore the lesson of ‘Western values’: Scores of human rights activists and peasant leaders have been murdered and the scourges continue unabated. \\n3. Colombia: Nobel Prize for Death Squad President \\nFor the past fifteen years, (2001-2016), the Clinton-Bush-Obama regimes launched the seven-billion-dollar ‘Plan Colombia’ terror campaign against the Colombian people. This scourge was so powerful that over two and a half million peasants, Indians and Afro-Colombians have been driven from their homes and villages while, tens of thousands of peasants, trade unionists, human rights activists and civic leaders have been killed. The notorious narco-President Alvaro Uribe and his Vice President Santos worked with the death squads and the Colombian military under the instruction of over one thousand US military advisers and contract mercenaries as they imposed a scorched earth policy – to consolidate a ‘reign of Western values’. \\nIn Colombia, the three-tailed scourge of narco-presidents, death squads and the military decimated rural communities throughout that large and populous nation. They finally induced the FARC guerrillas to submit to a ‘peace’ agreement, which perpetuated the oligarchy. The US remains free to exploit Colombia for its military bases against the rest of Latin America, while foreign corporations exploit its mineral riches. For his part in promoting the ‘peace of the dead’, Colombian President Santos received the Nobel ‘Peace’ Prize. \\n4. Saudi Arabia: A Household Name Among the Middle East Scourges \\nNo country in the Middle East has financed, organized and directed terrorism in the Middle East, South Asia, North and East Africa, the former Soviet Union and even North America, than the Kingdom of Saudi Arabia. It currently scourges the tiny nation of Yemen. Using its ISIS mercenaries, backed by jets, missiles, and logistical support from the UK and the USA, the Saudi despots has invaded maimed and murdered tens of thousands of Yemenis, while hundreds of thousands face starvation in a Saudi-imposed blockade. \\nThe Saudi billionaire regime bankrolled thousands of terrorists in Syria andIraq, giving billions of dollars of business to US and UK arms manufacturers. Saudi monarchs and their extended clans form a parasitic rentier regime unique in the world: They rely on the skills and labor of imported professionals, workers, household servants, mercenary solders, financial managers and even their praetorian guards. They confine their women behind the veil and closed doors, under the absolute rule of male relatives. They chop off the hands, feet and heads of foreign workers and their own citizens for minor offenses, including ‘blasphemy’, criticism of the king or resisting an employer’s abuse. Saudi Arabia, which is totally dependent on Washington’s protection, has become a scourge especially against Muslim people throughout the Middle East and beyond. ORDER IT NOW \\n5. Israel: The Scourge of Palestine and Free People Near and Far \\nThe Israeli State is the head commanding the tentacles of a far-reaching Zionist Power Configuration operating in the US, Canada, England, France and, to a less degree, in satellite states and institutions. Israel was established on the dispossession and ethnic cleansing of millions of Palestinians from their homes and villages since 1948. For almost 50 years, 600,000 ‘Israeli’ Jews (immigrants given automatic ‘citizenship’ and stolen property based solely on their ‘ethno-religious identity) have illegally moved into what remained of historical Palestine, building exclusive ‘Jews-only’ colonial towns on land ripped from its original inhabitants. The Palestinians are herded into apartheid militarized enclaves and squalid camps. Israel invaded and devastated large parts of Lebanon, Egypt and Syria. They have bombed other nations, like Jordan and Iraq, with impunity. The Israeli state uses a virtual fifth column of loyalist organizations and billionaire financiers in the US and EU who ultimately dictate Middle East policy to the ‘elected’ Western politicians. Presidents and Prime Ministers, Cabinet members and legislators must publicly bow to the increasing demands of the overseas Zionist power structure. This has undermined the will and interests of national electorates and democratic procedures. . All public discourse on this vital issue has been censored because critics of Israel’s influence are subjected to unremitting campaigns of overt coercion, threats, jailing on trumped up charges, vilification and job loss – within their own countries in the ‘democratic’ West. Meanwhile, Israel has sold its much-vaunted expertise in surveillance, torture and counter-insurgency to its fellow scourgers in Guatemala, Colombia, Mexico and even Afghanistan. \\n6. Egypt: Modern Scourges of an Ancient People \\nFor decades, Egyptian military dictators have served the Anglo-American Empire and Israel’s ruling colonists in the Middle East, North and East Africa. Generals-turned-’Presidents’ Hosni Mubarak and Abdel Fattah al-Sisi specialized in murdering, torturing and jailing thousands of Egyptian trade unionists, dissident activists, peasant leaders and the restless urban poor. These violently installed Egyptian rulers are expected to collaborate with Israel and trap millions of desperate Palestinians in the world’s largest open air prison – Gaza. Cairo actively collaborates with the US and Israel in subverting the people and institutions of Gaza, Libya, Somalia and Sudan – guaranteeing that none will be functioning, independent modern states. Egypt’s first and only elected president Mohamed Morsi was overthrown by General Sisi and sentenced to twenty years in a military torture dungeon (a virtual death sentence for a 65 year old) by a kangaroo court under the direction of Washington and Tel Aviv. Egypt, once the epicenter for civil democratic expression – ‘the Arab Spring’ – has become the a major staging area for US-backed jihadi terrorists entering Syria. \\n7. ISIS, NUSRA Front, Ukraine and Syria: Puppets, Kleptocrats, Fascists and Terrorists \\nIn this very modern Western world, where democratic values are sold to the cheapest buyer, the US, the UK and the EU shop for mercenaries and puppet regimes in order to scourge their critics and adversaries. \\nThe West, led by the Grand Scourger Hillary Clinton, bombed Libya and destroyed its entire modern state apparatus. They opened the floodgates to thousands of mercenaries and terrorist-thugs of all colors and stripes to feed off the carcass of what Gadhafi and the modern Libyan state had built over the past 40 years. These criminals, draped in the banners of ‘humanitarian intervention’ or ‘mission civilisatice’, ran amok, killing and ravaging tens of thousands of Libyan citizens and contract workers of sub-Saharan African origin. The tens of thousands of Africans desperately fleeing each year into the Mediterranean are the result of this Western rampage against the Libyan state. The jihadis have moved on… by those who forgot to distinguish between terrorists who support our ‘democratic values’ and those who would attack the West. The West can’t be blamed: Mercenaries change sides so often. \\nThe ethnic cleansing scourges of the past returned to the Ukraine: as (neo) fascists took power in Kiev, storming the Parliament and forcing the President to flee. Nazi-era banners decorated the streets of Kiev under the approving gaze of the US State Department. Neo-Nazi thugs massacred scores of unarmed ethnic Russian citizens in the port city of Odessa when they set fire to the main trade union hall where the trapped men, women and youths were burned alive or bludgeoned while fleeing the flames. The US State Department had spent a $5 billion dollars to replace an elected government with a pliant regime in Kiev while large parts of the country fell into civil war. The ethnic Russian populations of the industrialized Donbas region resisted and were invaded by an ethnically cleansed and neo-fascist putschist Ukrainian army – under US-EU supervision. The war has cost tens of thousands of lives, a million refugees fled to Russia and a divided failing state now festers in the heart of Europe. Kleptocrats and Fascists in Kiev oversee an utterly bankrupt economy. The destitute citizens abandon the towns and cities; some fleeing to Poland to pick potatoes as their serf ancestors did a century ago… ORDER IT NOW \\nSyria has been ravaged by an immense army of mercenary scourges, financed and supplied by the US, EU, Turkey and, of course, Saudi Arabia. Al Qaeda had merely to change its battle flags to ‘NUSRA’ and receive the US benediction as ‘moderate pro-Western democrats’ resisting a Baathist Dictatorship in Damascus. In the course of their ‘democratic’ mission they destroyed the ancient, critical cultural and economic center of Aleppo – scourging the Christians and non-jihadi Muslims and other ancient minorities. Over two million Syrians have died or fled the fiery scourge of Anglo-American and Saudi-Turkish terror. \\nThe Seven Sisters: Nemesis and the Furies Confront the Western World \\nThe scourges are falling on hard times: East and West, North and South they face their inescapable Nemesis. Their exposed injustices, crimes and grotesque failures herald their inevitable downfall. The seven furies are even emerging in unusual places: \\n1. The economic and trade power of China challenges the West throughout world, expanding even into the heartland of the empire. The West’s fear over China’s peaceful economic expansion has led Western political leaders to revive protectionist policies, claiming that barriers against Chinese investors must be raised to prevent takeovers by Beijing. From July 2015 to September 2016, the West blocked nearly $40 billion in productive Chinese investment. This comes after decades of preaching the virtues of foreign investment and the universal benefits of ‘globalization’. Suddenly Western leaders claim that Chinese investment is a ‘threat to national security’ and ‘profits Chinese businesses over Western-owned enterprises’… \\nMeanwhile, far from this Sino-phobic hysteria, the countries of Asia, Africa and Latin America actively seek greater economic ties with China, to the detriment of US-EU multinationals. Once servile Asian countries, like the Philippines, have declared unfettered US access to frontline imperial military bases in doubt, as they sign favorable multi-billion trade and investment agreements with China. Western imperial ideology about investment and globalization has boomeranged and met its Nemesis. \\n2. The Russian Furies: Vladimir Putin \\nDuring the 1990’s, the US plundered Russia at will. Washington imposed a unipolar world, celebrated as the ‘New World Order’. They bombed and devastated former Russian allies like Yugoslavia and Iraq, setting up ethnically cleansed rump states like Kosovo for their huge military bases. Meanwhile, Washington reduced Russia, under the inebriate Yeltsin regime, to a backwater vassal stripped of its resources, its institutions, scientists, and research centers. In the absence of war, the Russian economy declined by 50% and life expectancy fell below that of Bangladesh. The US celebrated this ‘victory of democracy’ over a helpless, deteriorating state by welcoming the most obscene new gangster oligarchs and pillagers and laundering their bloodstained loot. \\nThe door slammed shut on the pillage with the election of Vladimir Putin and the demise of the Yeltsin gangster-government. Russia was transformed: Putin reversed Russia’s demise: The economy recovered, living standards rose abruptly; employment in all sectors increased, and cultural, educational and scientific centers were restored. Vladimir Putin was elected and re-elected by overwhelming majorities of the Russian electorate despite huge sums of Western money going to his opponents. Russia systematically recovered many strategic sectors of the economy illegally seized by Western-backed Israeli-Russian oligarchs. Even more important, Putin restored Russian statecraft and diplomacy – formulating a strategy for an independent, democratic foreign policy and restoring Russia’s defense capability. The loss of this critical vassal state under its dipsomaniacal Boris Yeltsin shook the US EU-NATO alliance to its very core. \\nIn the beginning President Putin did not oppose the US-NATO military invasion of Afghanistan, Iraq and Libya. It went along with the economic sanctions imposed on Iran. It even maintained its cooperation despite a US-sponsored attack by the government of Georgia against South Ossetia killing scores of Russian peacekeepers. In the wake of those destabilizing disasters, what finally led the Russian government to reverse its complicity with the West was the horrific US-financed invasion of Syria where Russian jihadis from the Caucasus were playing an important role as mercenaries, threatening to return and undermine the stability of Russia. This was quickly followed by the US-sponsored putsch in Ukraine, fomenting a civil war on Russia’s frontiers, threatening is vital naval base in Crimea and repressing millions of ethnic Russian – Ukrainian citizens in the industrialized Donbas region. These blatant aggression finally pushed Putin to challenge the expansionist policies of Washington and the EU. \\nPutin backed a plebiscite in Crimea and won when its citizens voted overwhelmingly to re-join and preserve the Russian bases. Putin has backed the rebel defense of the Donbas against a NATO-neo-fascist Kiev invasion. \\nPutin accepted a request for aid from the Syrian government as it battled mercenaries and jihadis to preserve its national integrity. The Russians sent arms, troops and air support for the Syrian Arab Army, rolling back the Western and Saudi armed terrorists. \\nIn response to the Washington-EU economic sanctions against Russia over the Crimean plebiscite, Putin signed multi-billion-dollar trade and investment agreements and joint defense pacts with China – mitigating the impact of the sanctions. ORDER IT NOW \\nWherever Washington seeks to seize and control territory and regimes in Eurasia, it now faces the Putin nemesis. In Russia and overseas, in the Middle East and the Caucuses, in the Persian Gulf and Asia, the US meets stalemates at best, and roll-back at worst. \\nThe CIA-stooge Yeltsin and his cronies were evicted from the Kremlin to the indignation of Washington and the EU. Many of the kleptocrats, politicos, thugs and swindlers fled to their new homes in Langley, on Wall Street, in Washington or set up talk-shops at Harvard. Even the gruesome Chechens had their ‘color-coded’ support center (the CIA-American Committee for Peace in Chechnya) based in Boston. Never in modern history has a country so rapidly transformed from degraded vassalage to a dynamic global power as Russia. Never has the US seen its grand imperial design so successfully challenged in so many places at the same time. \\nThe Putin Nemesis has become the inescapable agent of the downfall of the US Empire. \\n3. The Islamic Republic of Iran became a Muslim-nationalist alternative to the US-Israeli dominated Muslim dictatorships and monarchies in the Middle East. The Iranian Revolutions inspired citizens throughout Saudi Arabia, Jordan, Egypt, Tunisia, Morocco, Iraq and Yemen. As a result of its growing influence, Iran was punished by the US and EU with crippling economic sanctions pushed especially by Tel Aviv and its Western agents. Fearful that the Iran’s example would destabilize its control, the US invaded Lebanon, promoted the Israeli invasion and occupation of Lebanon and has backed the terrorist campaign to dismember Syria. The results have been dismal for Washington: Iran continues to support the powerful Hezbollah, a major political and military power in Lebanon. The Saudi’s war against Yemen is largely an ethno-religious campaign to destroy Yeminis who favor independence over Saudi-US control and have Iran’s support. Iraq’s Shia resistance forces are leading the attack against the Saudi-funded ISIS terrorists, with Iranian commanders playing a significant role. \\nHezbollah, Iran’s ally in Lebanon, drove out the Israeli occupation forces and raised the cost of another invasion by Tel Aviv. \\nAgainst all the impotent, corrupt Arab puppets in the Middle East, only Iran has supported the Palestinians. It is the only force capable of retaliating against an Israeli sneak attack – which is why it is demonized. \\nIran is the Nemesis against US plans to conquer and dismember Syria. It has provided arms and volunteers on the battlefield against terrorist mercenaries. \\nIran effectively negotiated a partial lifting of Western sanctions, overcoming Israeli intransigence and securing billion-dollar trade agreements with Germany, Russia and China. It holds the prospects for productive trade and diplomatic deals in the near future – to the howling consternation of its enemies in Washington, Riyadh, London and Tel Aviv. \\nFor all the efforts by the tentacles of Israel’s fifth column, Iran has survived and emerged as the Nemesis of Anglo-American and Israeli ambitions in the Middle East. \\n4. Venezuela became the leading proponent for an independent foreign policy in Latin America. For almost twenty years, US tried repeatedly to overthrow the government in Caracas. They failed: By ballot or by bullet, despite slapping economic sanctions on Venezuela, the US suffered humiliating defeats and failed coups and aborted uprisings. Venezuela remains Washington’s principal Nemesis, thwarting its efforts to make ‘free trade’ pacts and deepen military alliances in Latin America. \\n5. Upon taking office in June 2016, the Philippines new president Rodrigo Duterte assumed the lead role of Washington’s most colorful ‘Nemesis’ in Southeast Asia. Under his widely popular presidency, he pivoted to China, promising to sharply reduce joint Philippine-US military exercises in the South China Sea directed against Beijing and, in return, he secured the co-operation of several hundred leading Philippine entrepreneurs in winning an initial $13 billion dollar public-private Chinese investment package for critical infrastructure and trade development.. \\nPresident Duterte has frequently denounced Washington’s interference in his domestic war on drug traffickers – citing the US hypocrisy in its criticism of his human rights record. He has personally held President Obama responsible for meddling in Philippine affairs. Drawing on the history of the bloody US colonial war against the Philippine people in 1898, he holds the US responsible for inciting ethno-religious conflicts in the southern island of Mindanao – Duterte’s home region. \\nPresident Duterte’s declaration of independence from Washington (”I am no one’s ‘tuta’ (puppy dog)”)and his foreign policy priority of ‘pivoting’ from US military domination to regional economic co-operation with Beijing has turned the Philippines into Washington’s prime Nemesis in Southeast Asia. \\n6. The resistance of the Yemeni people, mainly ethnic Houthi freedom fighters, against the onslaught of bombing and missile strikes by the Saudi-US-UK air force, has aroused widespread solidarity throughout the Middle East. \\nDespite the ongoing massacre of over 10,000 Yeminis, mostly civilians, the Saudi ‘alliance’ has failed to impose a puppet regime. US links with the Saudi dictatorship have undermined its claims of humanitarian concerns for the people of Yemen. The embattled Houthi rebels have secured the support of Iran, Iraq and the majority of people in the Persian Gulf countries. As the war continues, the Saudi’s increasingly rely on military trainers, fighter bombers and logistical experts from the US, UK and NATO to pick the targets and maintain the starvation blockade. Sooner or later the courageous and tenacious resistance of the free people of Yemen against the Saudi overlords will inspire a domestic Saudi uprising against its grotesque and decrepit theocratic-monarchist state. The fall of the Royal House of Saud will bury a major scourge in the Middle East. In a word, the battle for Yemen has become the Nemesis of US-Saudi domination. ORDER IT NOW \\n7. Everywhere in the Western world the ruling classes and their media outlets fear and loath ‘populists’ – leaders, movements, electorates – who reject their austerity programs designed to deepen inequalities and further enrich the elite. Throughout the European Union and in North and South America, workers and middle class majorities are on the march to oust the ‘free market’ regimes and restore the ‘populist’ welfare state, with its emphasis on social services, living wages and humane working conditions. \\nFrom the UK to France, Poland to Portugal, China to North America, Mexico to Argentina, the Nemesis and Furies of populist rollbacks threaten to dislodge the scourge held by the bankers, conglomerates and billionaires. Scattered populists may hold diverse ideologies; some may be nationalists, leftists, workers, farmers, petit bourgeois and public employees, indebted students, ecologists or protectionists. All are both united and divided by disparate interests and beliefs. And all are preparing for the inevitable downfall of the empire of the free market and wars. \\nConclusion \\nToday the world’s greatest global conflicts have lined up the Imperial West and its frontline scourging allies against the Furies and Nemesis emerging on all continents. These are the inescapable agents of the Empire’s downfall. \\nThe scourges of the West have been free to plunder the wealth of subject peoples and launch wars, which ravage both ancient and modern states and cultures while slaughtering and dispossessing scores of millions. The West derives its lifeblood through its seven-tailed scourge. Western elites rule through a chain of scourging puppet states with their bloody accomplices, from narco-murderers, Islamists terrorists, death squads to ordinary ‘piecework’ torturers. \\nWithout resorting too much to the wisdom of the ancient Greek myths, we have come to believe that states, regimes, movements and people finally will emerge to act as the inescapable agents of the justice leading to the downfall of the Western empire. Modern Nemesis and Furies have a dual existence: While bringing down the old order they seek to create alternatives. \\nThe ’scourgers’ are by their nature specialists in wanton crimes against humanity. Nemesis and her sisters challenge and oust the latter as they construct their own new centers of wealth and power. China, Russia and Iran have gone beyond the role of Nemesis to the West – they are poised to build a new civilization on its ruins. \\nIt remains an open question whether they can avoid becoming the new scourge against the people and nations who have risen in revolt.\""}, "time": 1742561728.9360604}