{"duration": 0.11949276924133301, "input_args": {"text": "'Welcome to Watching, The New York Times’s    guide. We comb through releases big and small to email readers twice a week with our timely recommendations. You can browse previous guides here, and to receive recommendations straight to your inbox, sign up here. Stay tuned for our upcoming website. I’m still obsessed with a recent and revolting New York mystery: How did 50   crabs wind up on a subway car? It’s so bizarre and deeply gross. I feel like I’m in Act II of “Macbeth,” when everything goes haywire and the horses start eating one another. This weekend I’ll continue indulging my current obsession with Australian TV. I finished “Wentworth” and “Please Like Me,” and now I’m on Season 2 of the political satire “Dreamland. ” If I’m not careful, “Claire” is going to become “ ” in my brain forever. Have a great weekend. Team Watching and I are, as ever, here for you: watching@nytimes. com. “Run Mama Run” (Watch on ESPN) Watch if you like sports stories and being impressed. Sarah Brown is a   runner trying to make the U. S. Olympic team just 16 weeks after giving birth. “Run Mama Run,” a   web series about her, is fascinating, and the final episode is still in production, since the Olympic track and field trials wrap up Sunday. Beyond the sheer athleticism depicted in “Run,” the series also nods at that unusual spot in culture that Brown occupies: Industry upon industry is built around telling women, especially mothers, what they’re doing wrong. We also venerate athletes to the point that we don’t see them as real people  —   thus allowing us to obsess over their choices in ways that would be creepy and unacceptable for just a private citizen. And there’s Brown, right in the center. “The Circus: Inside the Greatest Political Show on Earth,” Sunday, Showtime, 8 p. m. (The first 13 episodes are also on Showtime Anytime.) Watch if you like political dogfights. At this point in the election cycle, some would rather set their hair on fire than continue engaging with the   aspects of the campaign. Others, though, are just getting fired up. If you are in the latter group, this is for you. The pundits Mark Halperin and John Heilemann (they wrote the book “Game Change,” among other things) focus on the mechanics, the strategy, the players  —   and barely on the actual platforms, which makes the show feel juicy and   rather than like a lecture. The show has a quick turnaround, too, sometimes including footage filmed just days earlier, so it doesn’t seem dated. “The Circus” aired half its season earlier this year, but if you’ve been following the news generally, you don’t need to “catch up. ” “The Night Of,” Sunday, 10 p. m. HBO (the first episode is now available on HBO Go) Watch if you like gripping  —   but devastating  —   crime stories. After a strange night of partying, a young   named Naz finds himself arrested on a charge of murder. The   limited series is based on the British show “Criminal Justice,” which is so intense and absorbing that I’m not sure I ever fully recovered after watching it a few years ago. (It’s not streaming anymore, alas.) Initially, this adaptation was supposed to star James Gandolfini as Naz’s lawyer that role has been recast with John Turturro, though he doesn’t show up much in the pilot. “The Night Of” follows Naz through Rikers Island, then through his trial, which becomes a news media lightning rod. It’s not that anything groundbreaking is happening here, but what is happening is done so well. (Read The New York Times review.) “The Last Alaskans” (Watch on Hulu) Watch if you like thrilling landscapes. I’ve mentioned this show here before, when Season 2 premiered this spring. But Season 1 is now streaming, and a show this beautiful and distinctive deserves another mention. “Alaskans” is a documentary series about the last families allowed to live in the Arctic National Wildlife Refuge, and it is utterly unlike all those other   reality shows it’s not particularly   and there are long stretches of silence and contemplation. The camerawork is astounding, capturing both the immediate concerns of the human subjects and the gaping indifference of the wilderness around them. If this sets you on an Alaska kick, try the web series “Indie Alaska,” too, which is charming and quirky and educational. Three cineastes  —   the directors Robin Hardy, Michael Cimino and Abbas Kiarostami  —   died within a few days of one another this weekend. I’ve chosen a single movie for each that you can watch while you pour one out for these filmmakers.  —   Monica Castillo  : Kiarostami, an Iranian filmmaker and one of the greats of world cinema, was known for his humanistic approach to characters and for blurring the space between real life and fiction. In his 1990 docudrama, “” Kiarostami does both. The film tells the story of a man on trial for trying to pass himself off as a famous director. To make it even more interesting, Kiarostami cast the actual family that was conned by the man on trial. This quiet, brisk film runs just a little over an hour and a half. (Rent on Amazon and iTunes stream on Hulu with your subscription) Heaven’s Gate: “The Deer Hunter” is the obvious Cimino movie. And for good reason. De Niro, Streep, Walken, Cazale! Unfortunately, that film is not streaming anywhere. So try this one instead. Cimino’s much maligned third movie  —   it is often referred to as the film that brought down the United Artists studio  —   has enjoyed a renaissance since the release of a new restoration in 2012. The story follows a lawman struggling to bring his territory to order when wealthy cattle barons declare war on immigrant settlers. Carve out an afternoon (this is a long one) to take in this sweeping dark 1980 western starring Kris Kristofferson, Isabelle Huppert and Jeff Bridges. “Heaven’s Gate” manages to capture both the grandeur and unblinking brutality of the West. (Rent on Amazon and iTunes) The Wicker Man: A religious police officer travels to a remote British island in search of a missing girl, but what he finds is a mysterious and alluring pagan community. This 1973 Hardy film is one of the greats of British horror. Be warned  —   there are a surprising number of folk songs. (Rent on Amazon and iTunes) • This video of Stephen Colbert describing the night he met his wife is romantic, erudite and beautiful. (The Late Show) • Allison Janney talks “Mom,” “Masters of Sex” and, thank God, a little “West Wing. ” (The New York Times Magazine) • This isn’t really TV related, but holy smokes: “Meet Walburga, the Married Woman Who Hid a Secret Lover in Her Attic for a Decade. ” Aaaaah! (KQED)'"}, "time": 1742562589.719903}