{"duration": 0.09226727485656738, "input_args": {"text": "\"By Sarah Jones on Fri, Oct 28th, 2016 at 2:27 pm Donald Trump's message that everything in the U.S. is crap and we are all drowning in economic hardship that only Trump can fix got slapped down today as the U.S. economy “roars back”. Share on Twitter Print This Post \\nDonald Trump’s message that everything in the U.S. is crap and we are all drowning in economic hardship that only Trump can fix got slapped down today as the U.S. economy “roars back”. \\nThe advance estimate of GDP for the third quarter of 2016 showed that the Obama economy grew at an annual rate of 2.9%. The conservative Wall Street Journal headlined this news with, “U.S. Economy Roars Back, Grew 2.9% in Third Quarter.” \\nJason Furman, Chairman of the Council of Economic Advisers, summarized the numbers, “Real GDP grew 2.9 percent at an annual rate in the third quarter, with strong export growth and continued strength in consumer spending.” \\nThis news flies in the face of Donald Trump’s basic economic message of doom and gloom that only he can fix. “The Trump economic plan creates at least 25 million jobs, boosts growth up to 4 percent, and is revenue neutral,” Trump’s website claims. \\nBefore these numbers, Trump’s previous problem was that Trump’s economic plan is a big giveaway to the top one percent, isn’t revenue neutral and would destroy 11 million jobs. Trump also struggled with analysis that his plan could hurt the economy in the long run. \\nThe conservative-leaning Tax Foundation found that Trump’s plan would cost the US trillions of dollars and grow the incomes of the top one percent by 10%-16%. Trump’s tax plan could cost the U.S. 11 million jobs. \\nAccording to a report released at the end of July by Moody’s Analytics, Hillary Clinton’s economic proposals would create millions of jobs and boost economic growth higher than current projections. “The analysis shows that, if implemented, the Democratic nominee’s agenda would create 10.4 million jobs and accelerate economic growth to an annual average of 2.7 percent.” \\nUnder Trump’s plan, Moody’s estimated that unemployment would spike to 7 percent and over 3 million Americans would be put out of work. “The U.S. economy will weaken significantly if Mr. Trump’s economic policies are fully implemented as he has proposed,” the June report said. “The economy will suffer a recession that begins in early 2018 and extends into 2020…even longer than the Great Recession.” \\nYikes. \\nTrump sells these plans with a broadly negative message that often strays from facts. Trump earned a “Pants on Fire!” from PolitiFact for this claim made June 16th, 2015 in his presidential announcement speech, “The last quarter, it was just announced, our gross domestic product … was below zero. Who ever heard of this? It’s never below zero.” \\nBut also they note, “Finally, since Trump was attacking Obama for this bad quarter of growth, we’ll just throw this out: Of the 42 quarters of negative growth since World War II, 30 occurred under Republican presidents and just 12 under Democratic presidents.” \\nToday’s new economic numbers help Clinton make the argument that people should vote for her if they want to continue the record setting job growth numbers and economic growth under President Obama. \\nHillary for America Senior Policy Advisor Jacob Leibenluft pounced on the numbers to say, “Today’s GDP release shows economic growth at its fastest pace in two years… But Hillary Clinton believes there is still more we need to do to build an economy that works for everyone, not just those at the top. Independent experts agree her plan would create good-paying jobs through investments in infrastructure, innovation and education.” \\nThe economy is roaring back under President Obama, and the numbers suggest that it does better under a Democratic president. Donald Trump keeps saying Clinton is 4 more years of Obama, which makes a sunny case for her. \\nTrump is already struggling with just 11 days to go until the election on November 8th, and these numbers just added more weight to his uphill battle. Reality has spoken, and it doesn’t agree with Donald Trump’s vision of America.\""}, "time": 1742561858.1129315}