{"duration": 0.05078911781311035, "input_args": {"text": "'The Minnesota officer who has been on trial for the murder in the shooting death of a black motorist has been found not guilty. The verdict was announced around 2:55 p. m. on Friday. [St. Anthony police Officer Jeronimo Yanez testified during the trial that    Philando Castile had his hand on a gun.  A Facebook video live streamed by Diamond Reynolds, his girlfriend who was in the car, went viral. She narrated as Castile sat dying. Officer Yanez fatally shot Castile on July 6 after a traffic stop in Falcon Heights, a suburb in St. Paul, Minnesota. At the time, there was a question as to whether Castile was a suspect in a recent convenience store robbery. Officer Yanez faced charges of manslaughter and reckless discharge of a weapon. The Minnesota jury has been deliberating this week. Shortly after the shooting, Officer Yanez’ lawyer said, “I can tell you that the stop of the vehicle for an equipment violation was not the only reason for the stop. ” A handgun was recovered at the scene. During the Facebook live stream, Reynolds said, “police just shot my boyfriend for no apparent reason. ” Castile had a concealed handgun license. During Yanez’ trial, a police force expert testified that the officer was justified in his use of force. Expert Joe Dutton told jurors “When Yanez saw the   grip of Castile’s hand, he had to react to the actions of Mr. Castile,” reported the CBS affiliate in Minnesota. He added, “This truly was a   decision, there wasn’t time to do anything else. ” A firefighter testified that he heard Castile’s gun drop to the ground from his pocket when he put him on a stretcher. Officer Yanez took the stand in his defense. He testified that he stopped Castile’s car after Castile drove past him and gave him a “deer in the headlights” look that made him suspicious. “It’s a trigger,” he testified. The officer was already on alert after the convenience store robbery and Castile looked like one of the robbery suspects. He radioed his partner that he was going to pull the car over because “[t]he two occupants just look like people that were involved in a robbery,” Minnesota’s Star Tribune reported. He also had legal grounds to pull Castile over because he was driving with a broken brake light. Yanez walked up to the car, and he could smell burnt or burning marijuana, he testified. The officer told the jury he saw Castile’s hand on the gun and Castile did not follow his instructions not to reach for the gun. He told the jury, “I told him, ‘Don’t pull it out,” but when he saw Castile pull out the top of the gun, “That’s when I engaged Mr. Castile and shot him. ” The officer testified when he saw Castile’s gun, “my family popped into my head. My wife. My baby girl. ” “I did not want to shoot Mr. Castile at all. ” “Those were not my intentions. ” After the shooting, Castile’s mother, Valerie Castile, reportedly told CNN, “I think he was just black in the wrong place. ” Minnesota Governor Mark Dayton further fanned the flame of racial tension when he asked at a press conference after the shooting  —   “Would this have happened if the driver and passenger were white?”  He answered his question saying  —   “I don’t think it would have,” reported Fox 9 News in  . Paul. As can be heard in the video, the officer told the girlfriend, “I told him not to reach for it. I told him to get his hand off of it. ” This occurs at the   mark in the video. Lana Shadwick is a writer and legal analyst for Breitbart Texas. She has served as a prosecutor and associate judge in Texas. Follow her on Twitter @LanaShadwick2'"}, "time": 1742561660.237446}