{"duration": 0.022905349731445312, "input_args": {"text": "'Comedian Sarah Silverman got an earful from her social media followers on Sunday after appearing to mistake a pair of bright orange construction markings for swastikas painted by  . [The    comedian wrote that she was on her way to get coffee when she noticed the markings on the sidewalk.  Walking to get coffee saw these all over a sidewalk in the town I’m in.  Is this an attempt at swastikas? Do neo nazis not have google? pic. twitter.   —   Sarah Silverman (@SarahKSilverman) February 12, 2017,  “Walking to get coffee saw these all over a sidewalk in the town I’m in. Is this an attempt at swastikas? Do neo nazis not have google?” she wrote. Of course, Silverman’s followers were quick to point out that the markings were, in fact, innocuous markings used in construction, often to designate a spot for which there is a pipe or a wire underneath. Others simply ridiculed the comedian for her post, attributing other innocent, everyday situations to the work of nefarious extremists. . @SarahKSilverman Check it out. I even spotted a couple of Nazis in broad daylight testing some sort of abortion prevention laser device pic. twitter.   —   Stephen Miller (@redsteeze) February 13, 2017,  . @SarahKSilverman just saw this mysterious Nazi sign on the street. There’s even a ”15MPH” under it  —   must be some secret Nazi code. pic. twitter.   —   Harry Khachatrian (@Harry1T6) February 13, 2017,  @SarahKSilverman The KKK guys left their hats down the street too. pic. twitter.   —   Eric Larson (@larsoneric50) February 13, 2017,  After realizing her mistake, Silverman posted a series of   tweets in which she explained that she has begun to see swastikas “in everything” due to the country’s current political climate. It’s a construction marker. Innocent mistake for a Jew that gets ”burn in an oven!” at least weekly on twitter. Still pretty close though.. pic. twitter.   —   Sarah Silverman (@SarahKSilverman) February 13, 2017,  To the    smelly condescending cunts who say ima dummy 4 seeing swastikas in street markers:  —   Sarah Silverman (@SarahKSilverman) February 13, 2017,  I’m seeing swastikas in everything fratboys. It started w Bannon’s rise  festered when trump decided not 2 mention Jews re the Holocaust. https:  .   —   Sarah Silverman (@SarahKSilverman) February 13, 2017,  The comedian  —   who was one of Vermont Sen. Bernie Sanders’s earliest and most vocal celebrity supporters before rallying behind eventual Democratic nominee Hillary Clinton in the general election  —   has continued to speak out in opposition to President Donald Trump. Earlier this month, Silverman suggested that the U. S. military could help Americans overthrow the Trump administration. WAKE UP  JOIN THE RESISTANCE.  ONCE THE MILITARY IS W US FASCISTS GET OVERTHROWN. MAD KING  HIS HANDLERS GO BYE BYE❤❤❤❤ https:  .   —   Sarah Silverman (@SarahKSilverman) February 2, 2017,  Shortly after the election, the comedian wrote on Twitter that for many of Clinton’s supporters, the outcome of the race felt like the Great Depression of the 1930s, only worse.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742628479.8149815}