{"duration": 0.10571146011352539, "input_args": {"text": "'Amy Schumer uses her upcoming Netflix premiere The Leather Special to mock “gun nuts” for opposing her gun control efforts. [Schumer began to speak publicly for gun control after John Russell Houser allegedly shot and killed two persons during an airing of Schumer’s Trainwreck in a   theater in Lafayette, Louisiana.  According to The Daily Beast, Schumer talks about gun control in her new special, then hedges her statements by saying “What I learned was, no matter what you say, as soon as you say the word ‘gun,’ what gun nuts hear is, ‘She wants to take all our guns! ’” What Schumer misses is that she has worked with her cousin Senator Chuck Schumer ( ) to push expanded background checks because of the shooting, although the shooter passed a background check to get his gun. “Gun nuts” fail to see the sense in pushing to expand what already failed. But Schumer tries to explain her calls for more background checks by pointing to the mental condition of the Lafayette shooter. She suggests that “even someone who is mentally ill and has been convicted of domestic violence can still obtain a firearm due to various   loopholes. ” To be fair, this is not true. Individuals who are involuntarily committed for mental illness treatment are barred from buying guns —  involuntarily commitment is a threshold that must be crossed. But the judge who handled John Russell Houser’s mental oversight —   Carroll County Probate Judge Betty Cason —  said she never ordered him involuntarily committed. So, there already is a mechanism for keeping the mentally ill from obtaining guns, but they have to meet a certain threshold before being barred from gun purchases. Instead of admitting this, Schumer just mocks the system. She points to blind people and people on the terror watch list buying guns, then says, ““I’m all about equal rights for the disabled, but if Stevie Wonder calls me and he’s like, ‘Do you want to go shooting today?’ I’m going to be like, ‘Hard pass! ’” Schumer does not mention the fact that neither the terror attack in San Bernadino (December 2, 2015) nor Orlando (June 12, 2o16) would have been stopped by adding the terror watch list to background checks because none of the attackers in either case were on the list. AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742563201.1875007}