{"duration": 0.08890366554260254, "input_args": {"text": "'in: Government , War Propaganda , World News The neocon Washington Post features their extremist views, urging greater war on a sovereign independent nation threatening no one. Former State Department official/current Wilson Center vice president Aaron David Miller challenged Hillary, saying “(s)he’s on the hook to deliver” as America’s next president. If she…back(s) down…what explanation can she use?” The Center for American Progress, founded by her campaign chairman John Podesta, called for greater use of US air power in Syria – on the phony pretext of protecting civilians. Throughout her campaign, Hillary supported escalated conflict in Syria, not resolving it diplomatically. Expect her to follow through once in office as Obama’s successor, a near-certainty as things now stand. WaPo editors gave retired US Marine General John Allen and Middle East Institute senior fellow Charles Lister feature op-ed space . Both extremists urge “bring(ing) Syria’s Assad and his backers to account now” – their arguments based on a litany of deception, misinformation and Big Lies, commentaries WaPo features repeatedly, suppressing opposing viewpoints urging peace and stability. Allen and Lister: “For 5½ years, the Syrian government has tortured, shot, bombed and gassed its own people with impunity, with the resulting human cost clear for all to see: nearly 500,000 dead and 11 million displaced. Since Russia’s military intervention began one year ago, conditions have worsened…” Fact: Syria is Obama’s war, orchestrated by Hillary Clinton, entirely responsible for horrific carnage and atrocities – using ISIS and other terrorist foot soldiers, supported by US-led “coalition” air power. Fact: Russia’s intervention in September 2015 changed the dynamic on the ground – a vital campaign to preserve Syrian sovereign independence and territorial integrity, what neocons like Allen and Lister want destroyed, so America can claim another imperial trophy and keep the Middle East pot boiling, Iran the next target. Allen and Lister: “While subjecting his people to unspeakable medieval-style brutality, Syrian President Bashar al-Assad has sabotaged diplomatic initiatives aimed at bringing a lasting calm to his country.” “The most recent such diplomatic scheme was trashed not just by Assad, but also Russia, whose aircraft were accused of subjecting a UN-mandated aid convoy to a ferocious two-hour attack in September.” Fact: Syrians overwhelmingly support Assad, reelecting him democratically in June 2014, wanting no one else leading them. Fact: He’s an eminently decent man, concerned about his nation and welfare of his people, doing his job responsibly, defending them from US-imported death squads. Fact: He’s no “medieval-style brut(e),” a disgraceful Big Lie claiming it – he and millions of Syrians victimized by US imperial viciousness, its genocidal mass slaughter and destruction, what neocons like Allen and Lister support. Fact: Clear evidence shows US-supported terrorists were responsible for attacking and destroying most of a UN humanitarian convoy for beleaguered eastern Aleppo residents. Allen and Lister disgracefully blamed Russia and Syria for war crimes committed by America, its rogue partners and terrorist foot soldiers in Aleppo and elsewhere nationwide. They called for more assertive US action, claiming “(t)he world will not forgive us for our inaction” – while hyping the myth of (nonexistent) moderate rebels waging (nonexistent) civil war against a sitting government both writers want toppled illegally, US-controlled puppet rule replacing it. Allen and Lister: “The credibility of the United States as the leader and defender of the free world must be salvaged from the horrific devastation of Syria.” Fact: Syria was at peace with its neighbors until America and its rogue allies attacked it preemptively without just cause – raping and destroying the country, massacring its people, displacing half its population internally or externally. Allen and Lister urge escalating conflict, not resolving it responsibly – nor holding war criminals in America and its allied countries accountable for high crimes too horrendous to ignore. Submit your review'"}, "time": 1742563828.0062912}