{"duration": 0.1347496509552002, "input_args": {"text": "'Las frases más destacadas del debate de investidura RESUMIMOS LA AGITADA JORNADA DE HOY EN EL CONGRESO Sesión de investidura \\nMariano Rajoy no ha conseguido ser investido presidente en la primera votación a causa del rotundo “no” del PSOE. Una actuación muy poco creíble por parte de la bancada socialista, sobreactuada incluso, como cuando Rafael Hernando, portavoz socialista, se ha levantado de su escaño para votar y, justo después de hacerlo, le ha tirado un vaso de agua a la cara a Rajoy y ha fingido un desmayo. Fuentes del Congreso aseguran que Hernando ha guiñado el ojo a Rajoy en un par de ocasiones para tranquilizar al candidato a la presidencia. \\nRecopilamos a continuación algunos de los momentos más importantes de la jornada. Mariano Rajoy (PP) \\n“He aceptado el encargo del Rey para presentarme a la investidura porque, oigan, es el Rey”. \\n“Hemos ganado dos veces las elecciones, fácilmente. ¿Quieren que gane otra más? Cuando haga falta, yo no tengo prisa”. \\n“Algo le pasa a Cristiano. No está fino. Desde el Partido Popular intentaremos solucionarlo”. \\n“Hace tres días yo estaba en el paro. Y mírenme. Empieza la regeneración del empleo en España”. \\n“Estoy aprendiendo Twitter, ya sigo a Cristiano Ronaldo”. \\n“En Twitter soy @marianocrystal y me gustaría que me hicieran ‘hashtag’ sus señorías”. \\n(A Pablo Iglesias, tras la alusión a los SMS) “También he aprendido a usar los SMS mejor, como usted dice, aunque siempre llamo después para comprobar que han llegado”. \\n(A España) “Eres mía. Sólo mía. Miísima. Más mía no puedes ser. Y no porque yo te lo diga, sino porque así lo has decidido tú. Mía. Sólo mía. Miísima. Esa mía tan tuya de la que me he enamorado”. \\n“Sigan diciendo sus cosas y vayamos alargando debates estériles. Ustedes, y sólo ustedes, serán los responsables de eliminar el puente a todos los diputados”. \\n(A Joan Tardà) “Oiga, se lo diré hasta con cariño, han hecho ustedes llorar a Cristiano”. Antonio Hernando (PSOE) \\n“No le pondremos las cosas fáciles al PP. Sin ir más lejos: hoy he aparcado el coche muy pegadito al de Soraya. A ver cómo entra luego”. \\n“Vamos a hacer de oposición, señor Rajoy, hágase a la idea. Mal empezaríamos con artimañas como los vetos y los decretos […] Sea consciente, señor Rajoy, de que nos vamos a hacer respetar como oposición. No aprobaremos nada, absolutamente nada de lo que usted diga a la primera, lo haremos a la segunda”. \\n“Nos vamos a hacer respetar como oposición. Los ciudadanos nos exigen que les controlemos. Y lo haremos sin gritar ni utilizar la demagogia y con la camisa metida por dentro, que es algo que los españoles aprecian (en referencia a Podemos)”. \\n“Nos sobran razones para no confiar en usted, pero no hay razón para mantener el bloqueo político y llevar a los españoles a nuevas elecciones, sólo nos jugamos el país y además no tenemos candidato en el PSOE”. \\n“Somos de izquierdas, no les quepa ninguna duda. Y seguiremos cantando La Internacional con orgullo. Siempre y cuando La Internacional tenga papeles y esté en una situación regulada”. \\n(A la salida de la cámara, tras la pregunta de un periodista) “Pedro Sánchez y yo somos buenos amigos. Es más: este sábado, en la segunda votación, cantaremos ‘Escondidos’. Yo haré de Bisbal”. Pablo Iglesias (Podemos) \\n“Hay aquí mucho delincuente potencial. Lo sé porque me lo han dicho los precogs”. \\n“Mírenme a los ojos y díganme que no les doy miedo”. \\n“Me debo al honor de mi patria, de los ciudadanos de mi país y de la asociación de rol ‘Sword of Carabanchel’ que saludo desde aquí”. \\n“Supongo que Albert Rivera tendrá que buscar en Google algún Torrent de la película del 23-F pero yo se la puedo pasar en un pen”. \\n“Somos la única oposición real al PP. Errejón mariquita. Nuestra única misión es hacer frente a Rajoy. Íñigo, tonto. No tengan ni una duda de que nada ni nadie nos distraerá. Gafotas cuatroojos”. \\n(A Ferreras) “Ferreras, no me esperes para cenar, que esto va para largo”. Albert Rivera (Ciudadanos) \\n“¡Christian! ¡Que no te chivaste de mi cara!” \\n“¡Que te comiste 10 en una noche y no me diste ni media! ¡Y no me diste ni mierda!” \\n“Sí, el Chuky de Cieza, cuando quieras bajas a buscarme, que tengo yo que engancharte por la banda”. \\n“Gilipollas”. \\n“Te tengo que reventar, literalmente”. \\n“Que te chivaste a tu ma, a mi ma, te chivaste a la… ¡Ya verás!” \\n“¿Sabes lo que tengo ahí en mi coche? ¿Quieres verlo? ¿Quieres sentirlo en el pecho?” \\n(A Iglesias) “¿Ves los agujeros del techo? Eso sí que… ahí la Guardia Civil entrando y ¡pam! ¡pam! Eso sí es un Golpe de Estado… No hay que usar la palabra a la ligera. El que la saca para enseñarla es un parguela”. \\n(A Iglesias) “Así… ¡ñeeepam!” Joan Tardà (ERC) \\n“Ya que el señor Rivera ha usado el catalán entiendo que yo también puedo usarlo. El poble català veié una gran lluminària i cregué que la vida li mancava; mes, abans de perdre del tot la coneixença, encara sentí caure-li al damunt i enfonsar-se en ses carns la grapa peluda i alenada roent de la fera, senyor Rajoy.” \\n“Té nyirvis, senyor Rajoy? Mes l’encís ja estava romput i la terra, bella i tot com suara, no logrà revifar-li el caliu d’aquell primer anhel”. \\n“Li dic que matarem el llop”. Pedro Sánchez (PSOE) \\n“Perdona, ¿está ocupado este escaño? Ah, vale… No, no, ya sigo buscando”. \\n“Oye, ¿está libre este escaño? Ah… Bueno, si le estás guardando el sitio a alguien, poniendo las chaquetas encima, tranquila. Chao”. Ana Pastor, presidenta del Congreso \\n“Por favor, silencio. Señores del PSOE, un minuto de abstención. ¡De atención!”'"}, "time": 1742561659.832787}