{"duration": 0.08117294311523438, "input_args": {"text": "'It seemed like an innocent enough announcement: Michael Strahan, the former football player turned television personality, was shifting assignments on ABC’s morning lineup, the network said Tuesday. He would leave “Live With Kelly and Michael” in September to become a   on “Good Morning America. ” But there was rancor behind the scenes. Mr. Strahan’s   Kelly Ripa, was told of the move just minutes before the announcement, and felt blindsided, said a person who has spoken to her about ABC’s decision. And she made little attempt to conceal her displeasure, skipping Wednesday’s edition on “Live. ” ABC said she would not appear on the show for the rest of the week and would be replaced by Erin Andrews. Ms. Ripa’s absence Wednesday forced Mr. Strahan into the awkward position of addressing the news of his departure with a guest host, Ana Gasteyer, a former “Saturday Night Live” cast member. After Mr. Strahan and Ms. Gasteyer danced their way to the hosts’ desk on the “Live” set, Mr. Strahan said, “I’ve been in the news lately,” before formally announcing that he was leaving. For ABC, what was supposed to be a boost to its morning lineup is instead developing into a giant headache with one of its most prominent stars. Ms. Ripa, who joined the show in 2001, replacing Kathy Lee Gifford, has developed a loyal following of her own. In addition to Ms. Ripa’s apparent displeasure, “Good Morning America” is also presenting the network with cause for concern. Though it remains the   morning show, it’s down 10 percent in total viewers and 18 percent in the      demographic important to advertisers. It is second in that age bracket to NBC’s “Today,” a show that experienced its own ratings difficulties four years ago when it botched Ann Curry’s departure. When Mr. Strahan does join “Good Morning America” in a   role in September, he will be accustomed to the surroundings. He began as an   correspondent for “Good Morning America” two years ago, a decision that Ms. Ripa expressed concerns about at the time, according to the person. Ms. Ripa was worried it would distract him from “Live” but was reassured it would only be a temporary position. Mr. Strahan continued to appear on the morning show, and ABC executives recently decided that bringing him into the “Good Morning America” lineup could help stem the ratings drop. After “Live” ended on Tuesday morning, Ms. Ripa was called to a meeting along with the show’s longtime producer, Michael Gelman, and the WABC general manager, Dave Davis (the show is produced by WABC, and it is distributed by ABC and Disney’s syndication group). She did not know the purpose of the meeting. After a   wait, Mr. Strahan entered the room and broke the news that he was leaving. It wasn’t long before tensions flared. “Didn’t I tell you this was going to happen?” Ms. Ripa said to Mr. Davis at the meeting, according to the person. “I told you two years ago this was going to happen. ” A few minutes after the meeting ended, ABC publicly announced Mr. Strahan’s departure. Ms. Ripa later let the network know she would not appear on Wednesday. Ms. Ripa was angry, this person said, because she perceived that “Good Morning America” was being given priority over “Live. ” Ms. Ripa declined to comment. Ms. Ripa was similarly caught off guard in 2011 when Regis Philbin informed her 20 minutes before show time that he was going to announce his departure on that edition of “Live. ” After Mr. Philbin left the show, “Live” began an open casting call to replace him, cycling in more than a dozen potential   to sit beside Ms. Ripa. After 10 months, ABC selected Mr. Strahan, who is also a commentator on Fox’s N. F. L. pregame show. In a statement, an ABC spokeswoman said: “‘Live’ continues to be a vibrant and enduring franchise under our lead host, the extraordinarily talented Kelly Ripa. ‘Live’ has successfully transitioned   twice before and will do so again. Together with Kelly, ABC and the ‘Live’ team will begin a new search to find a replacement for Michael. ” It appears that Ms. Ripa’s absence will be an extended one: “Live” is not scheduled to shoot on Friday and she had already arranged to take Monday off for a long weekend to celebrate her 20thwedding anniversary, the person said. Friday’s show will be taped on Thursday, so Ms. Andrews will appear for the next two editions of “Live. ” Ms. Ripa will be replaced by the “Pretty Little Liars” actress Shay Mitchell on Monday, an ABC spokeswoman said.'"}, "time": 1742564282.4576519}