{"duration": 0.05044269561767578, "input_args": {"text": "'    actor Daniel   announced his retirement from acting on Tuesday. [The    screen legend  —   considered by many to be among the greatest actors of his generation  —   said in a statement through his publicist that he had made a “private decision” to quit acting, and no further reason was given for the abrupt announcement.  “Daniel   will no longer be working as an actor. He is immensely grateful to all of his collaborators and audiences over the many years,” the star’s publicist, Leslee Dart, said in a statement to Variety. “This is a private decision and neither he nor his representatives will make any further comment on this subject. ”   is the only actor to have won three Best Actor Academy Awards (Jack Nicholson and Walter Brennan each won three apiece, but not all in the lead Actor category) for his roles in Lincoln (2012) There Will Be Blood (2007) and My Left Foot (1989). The actor was also nominated for two additional Oscars for his roles in Gangs of New York (2002) and In the Name of the Father (1993). He also earned critical acclaim for roles in other films including The Boxer (1997) The Age of Innocence (1993) and The Last of the Mohicans (1992).   was a master of method acting and would often remain in character during the entire duration of a film’s shoot. During the filming of My Left Foot, in which he played quadriplegic writer and artist Christy Brown,   was reported to have broken two ribs by refusing to exit his character’s wheelchair for weeks. According to Variety, the actor listened to Eminem records to get into character as the violent, murderous William “Bill the Butcher” Cutting.   was also known to be extremely picky about his projects, often waiting years in between roles. The actor is scheduled to appear in one more film later this year, a drama set in the fashion world of 1950s London called Phantom Thread, directed by his There Will Be Blood collaborator Paul Thomas Anderson. The film is set to be released on Christmas Day.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742562078.4658678}