{"duration": 0.047342777252197266, "input_args": {"text": "'Home › SCIENCE & TECHNOLOGY | US NEWS › SOMEONE IS PRACTICING FOR A ‘GLOBAL BLACKOUT’ OF THE INTERNET, EXPERT SAYS SOMEONE IS PRACTICING FOR A ‘GLOBAL BLACKOUT’ OF THE INTERNET, EXPERT SAYS 0 SHARES \\n[10/27/16] The cyberattack that disrupted a number of major websites including Amazon, PayPal, Twitter and Netflix on Oct. 21 certainly was no accident. In fact, a renowned security guru thinks someone is learning how to take down the Internet. \\nThat expert predicted several weeks earlier that it would happen. \\n“Over the past year or two, someone has been probing the defenses of the companies that run critical pieces of the Internet,” Bruce Schneier wrote on September 13. “These probes take the form of precisely calibrated attacks designed to determine exactly how well these companies can defend themselves, and what would be required to take them down.” \\nInternet infrastructure companies noticed a big upswing in attacks in recent months, Schneier wrote. Those attacks, in fact, were similar to the one that knocked out the company Dyn, which provides critical services to Amazon and the other companies that went down. On Oct. 21, hackers launched a massive distributed denial of service (DDOS) attack on Dyn, overwhelming the system and causing it to crash. \\n“If you want to take a network off the Internet, the easiest way to do it is with a distributed denial-of-service attack (DDoS),” Schneier wrote on his blog and at LawFareBlog.com. “… Basically it means blasting so much data at the site that it’s overwhelmed. These attacks are not new: hackers do this to sites they don’t like, and criminals have done it as a method of extortion. There is an entire industry, with an arsenal of technologies, devoted to DDoS defense. But largely it’s a matter of bandwidth. If the attacker has a bigger fire hose of data than the defender has, the attacker wins.” Post navigation'"}, "time": 1742562989.0382843}