{"duration": 0.05935096740722656, "input_args": {"text": "'Kris Kristofferson’s “Dementia” Turned out to Be Something Completely Different… \\nLyme disease is caused by the bacterium Borrelia burgdorferi and is transmitted to humans through the bite of infected blacklegged ticks. Typical symptoms include fever, headache, fatigue, and a characteristic skin rash called erythema migrans. If left untreated, infection can spread to joints, the heart, and the nervous system. \\nSongwriter and actor Kris Kristofferson has Lyme disease. While this isn’t necessarily good news, it’s new news because for years he was told he was suffering from Alzheimer’s disease or some other type of dementia. \\nFor years Kristofferson, 79, was misdiagnosed, his doctors assuming his issues stemmed from Alzheimer’s or dementia. Thankfully, earlier this year someone finally did a test and it came back positive. \\nHis wife Lisa remembers him taking medications for things he didn’t have, and dealing with all the side effects, but after just three weeks of Lyme treatment, he was back. There are still some down days, but for the most part, he’s his old self. \\nLyme disease is caused by the bite of an infected blacklegged or deer tick. If the tick is a lyme carrier and the bite is left untreated, it can eventually cause a host of debilitating symptoms, weeks or months later. While the disease may reveal itself within 30 days as a characteristic “bull’s-eye” rash, some people never get a rash. \\nMost bites come from the immature form of the tick- the nymph- which is about the size of a poppy seed, so the bite can easily go unnoticed. Someone who has been bitten may experience one or more of the following: Severe headaches Additional rashes on other parts of the body Arthritis with severe joint pain and swelling, often in the knees Facial or Bell’s palsy Muscle and joint pain that comes and goes Heart palpitations or an irregular heartbeat (Lyme carditis) Dizziness or shortness of breath Nerve pain Shooting pains, numbness, or tingling in the hands or feet Problems with short-term memory \\nAnd, even after months or years of infection, other cognitive problems can occur: problems remembering names or words slowed thinking “brain fog” difficulty following conversations \\nPerhaps this is why doctors assumed Kristofferson was suffering from dementia, the symptoms are similar. However, many patients say that their doctors pay little attention to their persisting symptoms and often either assume it’s something else or brush it off. \\nBut it’s time to stop pretending that Lyme disease isn’t the major health threat the government has labeled it. According to the CDC, about 300,000 people a year are diagnosed with Lyme disease. \\nThe medical establishment has been at odds for years. There is strong disagreement about how reliable current testing methods are and even if it should be called a lasting illness. \\nFrom the Next Avenue article: \\n“The term ‘chronic Lyme disease’ (CLD) has been used to describe people with different illnesses,” the National Institute of Allergy and Infectious Diseases says on its website. “While the term is sometimes used to describe illness in patients with Lyme disease, in many occasions it has been used to describe symptoms in people who have no evidence of a current or past infection with [the Lyme bacterium]. \\nThe best way to prevent Lyme is to keep from getting bitten. Avoid wooded areas with a lot of brush, high grass, and leaf litter. When you go off trail (if you must) use bug repellent on exposed skin and clothes and ALWAYS check yourself and your loved ones as soon as you get done. \\nDon’t forget that your pets can also bring them inside so make sure to protect them too. If you use traditional methods, your vet can prescribe something but lavender and geranium oil are also good, natural deterrents for ticks. \\nAgain, you can have fun outside where the ticks are. Just remember to very carefully inspect yourself for ticks after hiking, camping or being in the backyard if it’s close to a wooded area.'"}, "time": 1742562313.2182944}