{"duration": 0.0859529972076416, "input_args": {"text": "'  // 0 Comments Clinton campaign in crisis after FBI agents uncover Hillary emails among sexts to underage girls on Anthony Weiner’s phone. \\nThe new Hillary Clinton emails uncovered by the FBI were discovered on electronic devices belonging to Huma Abedin and her husband, Anthony Weiner . \\nThe devices were seized by the FBI as they investigate allegations Weiner sent illicit sexual messages to underage girls. \\nThe New York Times reports that “ The F.B.I. is investigating illicit text messages that Mr. Weiner sent to a 15-year-old girl in North Carolina. The bureau told Congress on Friday that it had uncovered new emails related to the Clinton case — one federal official said they numbered in the thousands — potentially reigniting an issue that has weighed on the presidential campaign and offering a lifeline to Donald J. Trump less than two weeks before the election. “ \\nHuma Abedin, Hillary’s closest aide, separated from her husband Weiner recently after it was revealed he conducted an online affair with an underage girl – the latest in a long line of scandals for the former congressman. \\nThe FBI informed Congress that while analyzing Weiner’s phone agents had uncovered new Hillary Clinton emails related to the investigation into whether Clinton and her aides mishandled classified information. \\nThe announcement has breathed new life into the Trump campaign – and proved the Republican nominee was eerily accurate with an old prediction. In a statement on his website immediately after the Abedin-Weiner split, Trump questioned Hillary’s judgement in allowing someone like Weiner into her circle of trust: \\nDONALD J. TRUMP STATEMENT ON HILLARY CLINTON’S BAD JUDGMENT “ Huma is making a very wise decision. I know Anthony Weiner well, and she will be far better off without him. I only worry for the country in that Hillary Clinton was careless and negligent in allowing Weiner to have such close proximity to highly classified information. Who knows what he learned and who he told? It’s just another example of Hillary Clinton’s bad judgment. It is possible that our country and its security have been greatly compromised by this.” – Donald J. Trump \\nAnd previously, in an Aug. 3 tweet: It came out that Huma Abedin knows all about Hillary’s private illegal emails. Huma’s PR husband, Anthony Weiner, will tell the world.'"}, "time": 1742561679.7358508}