{"duration": 0.13109064102172852, "input_args": {"text": "'Writers are different from the rest of us. Their castoff scraps can be worth money, not to mention the obsessive attentions of future scholars. Jonathan Lethem, 52, recently became the latest author to sell his personal paper trail to a major archive. The Beinecke Rare Book  Manuscript Library at Yale University acquired a trove of his manuscripts, letters, notes and other artifacts, which will now sit alongside material from Walt Whitman, Sinclair Lewis, James Baldwin and Marilynne Robinson in its rich American literature collection. Mr. Lethem’s papers contain items relating to the novels that made him something of a reluctant patron saint of Brooklyn’s literary ascendance, including “Motherless Brooklyn” (1999) and “The Fortress of Solitude” (2003). But as befits a lifelong collector, music obsessive, comics geek and dedicated chronicler of underground culture, there are also   cartoons, New York 1970s ephemera and what is surely the largest cache of drawings of vomiting cats in any university collection. “For an author who is so much fun as a novelist, it’s interesting to see there is so much fun in his archival documents as well,” said Melissa Barton, the curator of American prose and drama at the Beinecke. (Ms. Barton, citing library policy, declined to say what Yale paid in the sale, which was arranged by the Manhattan book dealer Glenn Horowitz.) Mr. Lethem’s archive also includes two computer hard drives, a laptop and other digital materials, especially from more recent years. “You can feel the evaporation of the physical ephemera,” Mr. Lethem, whose most recent novel, “A Gambler’s Anatomy,” appeared in October, said in an interview. But the bulk of the collection consists of   artifacts, some of them charmingly weird. We asked Mr. Lethem, who left New York in 2010 to teach creative writing at Pomona College in Claremont, Calif. about some of the odder items in his literary closet. The archive includes a number of   comic books Mr. Lethem made as a child, featuring invented superheroes like   Man, whose origin story included an   attempt to start a nudist colony in Alaska. In one installment,   Man (who later got a passing   in “The Fortress of Solitude”) battled Ed Koch, who was no hero to Mr. Lethem’s   bohemian parents. “I didn’t make multiple copies to sell or anything,” he said. “It was more like I was collecting my own weird artifacts from a pretend universe where   Man was a real comic. ” Mr. Lethem swiped this sticker after stumbling on a shoot for the 1979 movie “The Warriors” in the   subway station in Brooklyn, which was standing in for the Times Square station. “This was my subway stop, and the fact that they were turning it into 42nd Street seemed absurd,” Mr. Lethem recalled. “I remember thinking that no one would see or hear about this movie. Nothing that anyone was shooting in my neighborhood could possibly be important. ” The archive contains typescripts of his novels, often affixed with alternate titles. (Would “Motherless Brooklyn” have been a hit if it had been called “Jerks From Nowhere”?) The earliest is “Apes in the Plan,” an unpublished “fake Philip K. Dick novel,” as Mr. Lethem put it, named for a Devo lyric and written between ages 18 and 23. “I wrote three novels on an electric typewriter,” he said. “If I live long enough, I could end up being one of the last living humans who can say that. ” This diary tracking his writing progress, social interactions, exercise and, um, digestion comes from the   when Mr. Lethem had dropped out of Bennington College and moved to Berkeley, Calif. to try to become a writer. “I had thrust myself into a kind of vacuum,” he said. “I had no visible means of support, nor was anyone expecting to hear from me. This kind of weird   probably had to do with externalizing my superego and answering the question ‘Who are you and what did you actually do today? ’” About those drawings of vomiting cats   …     “For about 15 years, every time I had a really good dance party that went late, with people lolling around drunk and exhausted, at about 2 a. m. I would hand out paper and ask everyone to draw a vomiting cat,” Mr. Lethem said. “I ended up with an incredibly thick file of drawings, some by people who went on to be published cartoonists and writers. ” Some of the goofy character names in Mr. Lethem’s novels are drawn from   lists he typed up early in his career, a habit he connects with the wordplay of “Motherless Brooklyn,” whose narrator has Tourette’s syndrome. Mr. Lethem recalled a moment of recognition sparked by an Oliver Sacks essay about a surgeon with Tourette’s who kept a list of more than 200 unusual names as “candy for the mind. ” “He was collecting real names,” Mr. Lethem said. “But when I read that, I thought, ‘Oh my God, that’s me. ’” Names from this list showed up in “Gun, With Occasional Music” (1994) and “Chronic City” (2009). “The Fortress of Solitude,” inspired by Mr. Lethem’s Brooklyn childhood, describes a   store called Samuel J. Underberg, “a site of mysterious life,” where graffiti artists came to buy ink that was specially formulated for stamping prices on slimy packages of meat and therefore ideal for tagging. While writing, Mr. Lethem acquired some random items from the real Underberg’s (now demolished) which are shown here with a 1978 Billboard Hot 100 list, an old calendar and other research materials. “I became a collector of all this tawdry used signage,” he said. “I just thought it was really weird and cool. ” The archive contains dozens of letters from fellow writers and artists, including Donna Tartt, Paul Auster, Suzanne Vega, Jennifer Egan, Thomas Berger and Ursula K. Le Guin. This missive, written on an airline safety card, is from the novelist David Bowman, who died of a cerebral hemorrhage in 2012. “All his letters were like mail art,” Mr. Lethem said. “David had a great, crazy brain. He never stopped covering the world in language. ”'"}, "time": 1742563638.8073227}