{"duration": 0.029345989227294922, "input_args": {"text": "'Politics US actor Robert De Niro (Photo by AFP) \\nHollywood actor Robert De Niro, who had criticized Americans for putting an “idiot” like Donald Trump in a position where he might become the US president, now says he respects him because he is the president-elect of the United States. \\nBefore the November 8 presidential election, De Niro had been enlisted along with several other actors to speak in a non-partisan video encouraging Americans to vote in. But the 73-year-old actor defied script and delivered a scathing rebuke of Trump. \\n“He\\'s so blatantly stupid. He\\'s a punk, he\\'s a dog, he\\'s a pig [...] a mutt who [...] doesn\\'t do his homework, doesn\\'t care. He\\'s an idiot. Colin Powell said it best: He\\'s a national disaster. He\\'s an embarrassment to this country,” the Raging Bull actor said. \\n“It makes me so angry that this country has gotten to this point that this fool, this bozo, has wound up where he has,” he stated. \\n“He talks how he wants to punch people in the face? Well, I\\'d like to punch him in the face,” De Niro said. \\nBut after the Republican presidential nominee was declared the 45th president-elect on Wednesday, De Niro clarified that he would no longer like to punch Trump because the man was elected to the highest seat in political office. \\nThe veteran actor, however, told Jimmy Kimmel on his late-night show on ABC News that he is “not feeling good” after Trump’s victory, which caused protests and student walkouts across the country. \\nProtesters on Wednesday slammed Trump’s divisive campaign rhetoric against immigrants, refugees, Muslims and ethnic minorities. \\nDe Niro said he has to respect Trump because of his new position - which means no punching. \\n“Are you still going to punch Donald Trump in the face?” Kimmel asked the actor, “because you could now get arrested for that, I think.\" \\n“I can’t do that now, he’s the President,” replied De Niro. “And I have to respect that position, although we all know what he… We have to see what he’s gonna do and how he’s really gonna follow through on certain things. As we can see now in a lot of cities, a lot of people are getting very upset and protesting.” \\nMany renowned figures, including some heads of states and other high-ranking officials, had publicly denounced Trump -- some even used abusive language against him -- in the run-up to the November 8 presidential election. But several of them have now softened their stance and some even sent messages of congratulations to the president-elect. Loading ...'"}, "time": 1742562421.3424685}