{"duration": 0.021817684173583984, "input_args": {"text": "\"Don't Get Too Excited About the FBI's New Probe of Clinton \\nThe mainstream corporate media has proven itself very adept at protecting Hillary Originally appeared at Chronicles Magazine \\nThe FBI bombshell is not necessarily a gamechanging event. The Clinton campaign, and its mainstream media extension, have weathered with surprising ease the fainting episode on September 11. \\nIn the next two days they will focus on: the possibility (they will claim likelihood) that Anthony Wener’s/Huma Abedin’s server does not contain any emails not known to the FBI already, let alone those designated confidential, classified, secret or top secret—that was Hillary Clinton’s predictable immediate reaction ; the assertion that the FBI will not be able to sift through thousands of emails quickly enough to provide a clear answer to (1) before the election, which is the coded message behind the Clinton camp’s demand for a “detailed and thorough” investigation—demands for “immediate” disclosure notwithstanding—and an unnamed official has already indicated that it was not likely that the FBI’s review of the additional emails could be completed by Election Day; and the claim that the FBI was acting under political pressure from Clinton’s foes: Sen. Dianne Feinstein has already declared that “the FBI has a history of extreme caution near Election Day so as not to influence the results. Today’s break from that tradition is appalling.” \\nThe one truly appalling event in this saga was James Comey’s decision last spring not to ask for a grand jury, without which the entire investigation into Clinton’s emails was predictably sidetracked. On that inglorious form, his surprise Friday announcement may indicate that the potential for scandal is so great that his options for further damage limitation in Clinton’s interest were extremely limited. \\nHowever . . . In 1982 I interviewed for the BBC World Service one of Ireland’s best respected diplomats and political commentators, Conor Cruise O’Brien, at his home by the cliffs above the Irish Sea. In passing he mentioned Ireland’s scandal-ridden prime minister of the day, Charles Haughey, who had managed repeatedly to survive numerous disclosures of corruption and wrongdoing. O’Brien said that if he saw Charlie Haughey “buried at midnight at a crossroads with a stake driven through his heart, I should continue to wear a clove of garlic around my neck, just in case.” \\nHillary Clinton’s detractors should take note.\""}, "time": 1742628505.4119837}