{"duration": 0.49329495429992676, "input_args": {"text": "'Kevin Meaney, a headliner on the   comedy circuit for more than 30 years, was found dead on Friday at his home in Forestburgh, N. Y. He was 60. Mr. Meaney’s former wife, Mary Ann Halford, confirmed his death. She said the cause was not yet known. Mr. Meaney made numerous appearances on   television talk shows, including more than a dozen on “The Tonight Show Starring Johnny Carson” beginning in 1987, a year after his first HBO special, according to his website. He played the title role, an irresponsible slob saddled with raising his brother’s three children, on “Uncle Buck,” a CBS sitcom based on the John Candy movie of the same name. The show lasted only one season (a 2016 version, starring Mike Epps, had an even shorter run) but Mr. Meaney was seen frequently on television after it was canceled in 1991. In addition to the talk shows of David Letterman, Conan O’Brien and Carson, he was seen on “Saturday Night Live,” “30 Rock,” “2 Broke Girls” and other shows. An energetic live performer with the sensibilities of an   entertainer, Mr. Meaney skewered family life, in particular his mother’s seemingly boundless concern that his actions would cause them to “lose the house. ” “Anything in my house could poke an eye out when I was a kid,” he said in one routine, adding: “I’d be passing pizza across the table. ‘You’re going to take your brother’s eye out with that slice.’ ” He sometimes incorporated music into his act. One signature bit was a   spoof of the hit   single “We Are the World,” in which he impersonated Bob Dylan, Michael Jackson, Willie Nelson, Stevie Wonder and other singers who had performed on the recording. He later employed his singing skills when he was cast in the Broadway musical “Hairspray. ” He played several roles and understudied the part of Edna Turnblad, played by Divine in the John Waters movie that inspired the musical. (He went on to play Edna at the Connecticut Repertory Theater and elsewhere.) Ms. Halford said Mr. Meaney’s experience on the show, which he described on his website as “life changing,” prompted a period of   that led him to realize he was gay. He came out in 2008 while being interviewed on a satellite radio show. His sexual orientation later figured in some of his   routines. In one, Mr. Meaney, who was raised Roman Catholic, described a request from his mother that he go to confession. “I told the priest I was gay, and it was very difficult to tell him that,” Mr. Meaney said in a routine captured on video. “And now we’re dating. ” Mr. Meaney was born in White Plains, N. Y. on April 23, 1956, and grew up in nearby Valhalla, the middle child of five. His father, John, was a firefighter his mother, Patricia, a librarian. While in high school he worked as a waiter at the Knollwood Country Club in Elmsford, N. Y. where he met a   New York radio and television host, Bob Fitzsimmons, who was a club member. “Bob was Kevin’s inspiration,” Ms. Halford said. “He kept asking Bob how to get into show business. ” Mr. Meaney attended a state college before dropping out and moving to San Francisco to pursue a comedy career. At the time, the city was home to a lively comedy scene. He met comedians like Robin Williams and Dana Carvey there, and performed at one of the city’s most popular comedy clubs, the Holy City Zoo. Later, while living in Los Angeles, he met Ms. Halford. They married in 1997 and had a daughter, Kathleen Ann, two years later. She survives him, as do his mother three brothers, Jack, Tim and Thomas and a sister, Cathy Meaney Paulsen. Mr. Meaney and his family moved back to New York in 2002 to be closer to relatives, Ms. Halford said. In addition to performing on Broadway, he continued to perform   across the country at venues of all sizes. “Comedy clubs, private functions,   PTAs, firehouses  —   Kevin could do it all,” his agent, Tom Ingegno, said in an interview on Saturday. “He was just a   performer. The stage was really his home. ” Mr. Meaney was scheduled to perform in East Providence, R. I. on Saturday night. The news of his death drew a flood of reactions from his fellow comedians and entertainers. “I’m heartbroken at the loss of one of the best, kindest people I ever knew,” the writer and producer Lizz Winstead posted on Twitter. Also on Twitter, the comedian and actor Patton Oswalt wrote that he first knew Mr. Meaney as a “brilliant comedian,” and that “then we hung out in Ireland and I found out he was also a terrific person. ”'"}, "time": 1742563313.836998}