{"duration": 0.13592886924743652, "input_args": {"text": "'A Universal Law: Pick Up Your Mental Garbage Nov 21, 2016 1 0 \\nMany people are concerned about the increasing pollution, violence and suffering. We want to help, but many times we feel that we are powerless against these trends. However, there is an universal law that you should take into account before trying to help: You should clean up your mental garbage. The largest manufacturer of junk in our lives is our own Minds, so first of all we need to know clean it up and to recognize its functioning. The Nature of the Mind \\nIn order to control something, we first need to know the thing concerned¸ so we must know our Mind so as to be in charge of it. The most important thing we need to about our Mind is that it is not something that exists separately, individually, like some inanimate object. \\nThe Mind is not an object–it is a process. The process of constantly streaming thoughts. This stream of the thoughts is what we perceive as the Mind. When these thoughts disappear, the Mind disappears with them, as the two are only able to exist together. The very basic nature of thoughts is that they are in a constant move, and this motion, almost automatically, creates the Mind. \\nA characteristic feature of our Mind is that it keeps roaming, wandering; it operates in something like an automatic mode . Thoughts come and go all the time. If we attempt to suppress them, it is only possible with considerable efforts, and even then to a short time only. In most of our waking time, our Mind wanders either in the past or in the future, in our thoughts we deal with our experience of the past, offences we suffered in the past, or with our future plans, goals and fears. \\nAnother characteristic of our Mind is that it constantly evaluates things. It means that we do not simply live through our experiences, but we also categorize them as good or bad. We judge everything that happens to us and everybody we meet in our lives. This permanent categorization may easily lead to a distorted perception of the world, as we evaluate our new experiences in these categories. If we find an experience negative, we will tend to keep–and reinforce–that category for similar experiences in the future. Our perception will therefore be selective, and we will only accept the stimuli that reinforces our categorization, and we tend to ignore those that fall outside our usual categories. \\nThe third important characteristic of the Mind is that it permanently produces stories. These stories often have a disastrous end. For instance, I suddenly try to remember whether I locked the door of my home or not. The Mind immediately fabricates a whole story around the idea: I did leave it open, a burglar came, my valuables have been stolen, and the police, instead of chasing the thief, will harass me with their questions. We often experience the ends and emotional consequences of these stories. Another type of stories deals with us, who are we, what are we like, what we should do or should have done. The entirety of these stories comprises our personal histories. A Foolish Game \\nMost people tend to identify with their thoughts and personal histories , that is, with their Minds. A lot of us are not satisfied with what we are, and we would like to have a better and more beautiful personal history. That is why we create a mental image of our desired personal development, and the ways of making the work of our Minds more effective. \\nIn order to achieve the mental image we ourselves have created, we embark on a foolish game, as we attempt to bring our Minds under our own control, and be the masters of our own development. Since we do not know the nature of the Mind, this venture is destined to failure right from the beginning. \\nThis game is foolish, since in fact one half of the Mind attempts to bring the other half under control. Our Mind itself deems our own mental image of our personal development good. At the same time, this half of the Mind deems the other half, the one we wish to change, bad. Mental images fight against each other, trying to overcome each other, using the weapons of selective perception and story fabrication. The struggle goes on, with changing luck, all through our lives. Sometimes we believe that we are making some progress, we are improving, and a few weeks, months or years later we drop into the abyss of despair. \\nA lot of us play this foolish game all through our lives, because we are unable to recognize the simple fact that a Mind is unable to overcome itself. We may, perhaps, with the utmost effort, suppress what we believe is bad in us. That is, however, just a virtual victory, leading us to virtual calm and personal development, because when our power declines, the suppressed forces break out again, destroying all the temporary results that we achieved previously, washing away the results of our personal development . The Freedom of Tolerance \\nNow we can see that the way leading to our control over our Minds does not lead through suppressing them. It is not possible to control the Mind in the ordinary sense of the word. Partly because it only exists in its functions and operation, and partly because there is nobody to control it. One half of the Mind, as we have seen, does not control, only suppresses the other half. \\nIn order to be able to control our Minds, we must step outside of them . This statement may sound surprising to a lot of us, since we tend to fully identify with our Minds and their operations. As long as this identification is strong, we shall not be able to step outside the crazy dance of our Minds; we will have to merely suffer its consequences. \\nNowadays, however, more and more of us begin to realize and experience that we are more than our Minds, more that our thoughts and emotions, and the personal history these thoughts and emotions build up. Our attention is no longer completely engaged by telling our personal history and identifying with that personal history, and we become more and more sensitive to the deeper dimensions of our life. We also begin to notice the breaks between thoughts, and we begin to turn towards these gates leading beyond the Mind. \\nIn these breaks between thoughts, Mind does not work, it is not there–it simply vanishes. What is left there is the alertly watching Consciousness. If we are able to take roots in that alert Consciousness, we recognize that this watching alertness is tolerant with the Mind and its operations. We shall see that there is nothing wrong with thoughts, nothing wrong with the operations of the Mind. It is not necessary to struggle against the Mind, as it is not an enemy, only an instrument that, without control, tends to function chaotically. \\nWe only have a chance to know the true nature of thoughts and the functions of the Mind if we detach ourselves from them, keep a distance, and do not consider them as enemies. They will reveal their secrets to the alert Consciousness, watching with affection, and we will see the subtle shades of the Mind, the games it plays and the dreams it evokes. Controlling the Mind \\nThis tolerant, alert, watching attitude to the functions of the Mind will give us the ability of stopping our thinking effortlessly. Once thinking has been suspended, the continuous stream of thoughts stops, the Mind itself disappears and stops working. \\nNow we shall not seek our own identity in an identification with the Mind, since we have found our real center, our real self, our alertly watching Consciousness . We will be aware that thoughts and the Mind have not really disappeared, they are still there, only in a dormant state. Our attitude to thoughts and the Mind will entirely change at that moment. We think when necessary, and we do not need the Mind, we put it aside. The Mind no longer dominates our life, it is not more than an obedient tool that we use or not use as we please. \\nThat is when we realize how wonderful an instrument the Mind is, and now we are able to use it for its original purpose. And the purpose of the Mind is to serve as a means of connections, to connect us to the world to each other. Through the Mind, used with alert Consciousness, creative energies are released to the world, and create a wonderful harmony there. \\nRead more articles from Frank M. Wanderer Vote Up Frank M. Wanderer PhD Frank M. Wanderer Ph.D is a professor of psychology, a consciousness researcher and writer. Frank is the author of the books \" The Revolution of Consciousness: De-conditioning the Programmed Mind \", \" Ego - Alertness - Consciousness: The Path to Your Spiritual Home \" and several books on consciousness . With a lifelong interest in the mystery of human existence, Frank’s work is to help others wake up from identification with our personal history and the illusory world of the forms and shapes, and to find our identity in what he calls “the Miracle”, the mystery of the Consciousness. You can also follow his blog HERE'"}, "time": 1742563403.218434}