{"duration": 0.18156909942626953, "input_args": {"text": "'What the WikiLeak Revelations Reveal About Donna Brazile and the DNC Posted on Oct 28, 2016 ( Tim Pierce / CC 2.0 ) \\nDonna Brazile, interim chair of the Democratic National Committee, faces new scrutiny as evidence points to abuses of power. \\nBrazile’s alliance with the Hillary Clinton team looks to have started in 2008. In February of that year, while Clinton was running for president against Barack Obama, CNN political commentator and consultant Paul Begala wrote an email to the Clinton team saying that it should “court” Brazile. At that time, during the primaries, Brazile refused to publicly endorse a candidate but worked closely with the Democratic National Committee (DNC). Until recently, she also worked for CNN and ABC News. Her close relationship with the Clinton camp has deepened over the years. \\nEvidence that Brazile would begin working to help Clinton is seen in an interview she gave with Joe Heim of The Washington Post in 2014. She told Heim: \\nTechnically, I’m neutral, but neutrality is something that gets you in trouble because, you ever notice someone who stands on the white line in the middle of the road? They get run over. And I don’t want to get run over. So I’m not neutral. I have to tell people that I’m neutral, but I’m ready for Hillary. \\nAdvertisement Square, Site wide \\nBy the time this interview was conducted, she was already vice chair of the DNC. It is important to note that article 5, section 4 of the DNC Charter requires that the chairperson, national officers and staff of the DNC “maintain impartiality and evenhandedness during the Democratic Party Presidential nominating process.” \\nIf the WikiLeaks emails are not falsified (and all evidence and history point to that being the case), this notion of impartiality was used by the Clinton camp, to its advantage, throughout the primary campaign. \\nIn late October 2015, Adrienne K. Elrod, director of strategic communications and amplification for Hillary For America, sent out an email under the title “Bernie Pushback Update” that included a broadcasting strategy with the help of Brazile . The plan was to have Brazile appear on TV in the guise of a “strategist” and call out rival Bernie Sanders’ campaign for having a “Bad Strategy.” \\nElrod wrote: “All of our friends going out tonight post debate, including [former Michigan Gov. Jennifer] Granholm, Donna Brazile and [political consultant] Bill Burton, are ready to call Bernie’s team out if it comes up tonight.” \\nThe email was a response to a critique of Clinton by Sen. Sanders. \\nThe reliance on Brazile for help appears to have continued into the new year. On Jan. 3, 2016, an email exchange between John Podesta and Brazile titled “Happy New Year” went as follows: \\nSubject: Re: Happy New Year \\nOn Jan 3, 2016, at 2:25 PM, John Podesta wrote: Wishing you a happy New Year. 2015 was challenging, but we ended in a good place thanks to your help and support. Look forward to working with you to elect the first woman President of the United States. >> Have a great New Year. >> -John \\nOn Sunday, January 3, 2016, Donna Brazile wrote: As soon as the nomination is wrapped up, I will be your biggest surrogate. \\nOn Jan 3, 2016, at 19:33 PM, John Podesta wrote: Thanks Donna. Holed up in the bunker and miss seeing you. \\nTwo days after this exchange, Brazile let the Podesta team know that Sanders was planning to launch a Twitter campaign. The emails reveal that the impartiality clause in article 5, section 4 would be violated again and again. \\nOn Feb. 2, she sent an email to Podesta titled “Good Luck Tonight” and wrote “Shake things up. It’s going to be rough. Very rough.” This was the day before a town hall event in which Clinton and Sanders would appear. \\nMore damning is an email Brazile sent to Podesta on March 12 titled “From Time to Time I Get The Questions In Advance.” In the email, she wrote, “Here’s one that worries me about HRC.” It was a question on the death penalty that was asked—verbatim—the following day at the town hall with Sanders. \\nBrazile released a statement earlier this month after the Podesta emails revealed this exchange. “I often shared my thoughts with each and every campaign, and any suggestions that indicate otherwise are simply untrue,” Brazile said in the statement. “As it pertains to the CNN debates, I never had access to questions and would never have shared them with the candidates if I did.” \\nPerhaps the DNC could be forgiven by claiming they did not know Brazile had such deep ties to Clinton and her campaign. But on July 22, before the Podesta emails were revealed, WikiLeaks released more than 19,000 DNC emails. The revelations forced DNC Chair Debbie Wasserman Schultz to resign after evidence pointed to a heavy bias against Sanders. Brazile was chosen as interim chair, even though the DNC leaks revealed her potential bias. \\nIn an email exchange, Abby Phillip of The Washington Post asked Brazile to respond to allegations that the DNC was not giving adequate representation to the Sanders camp. Brazile’s response: “I have no intention of touching this. Why? Because I will cuss out the Sanders camp!” \\nIn addition, new videos surfaced last week from conservative activist James O’Keefe alleging that the Clinton camp and the DNC worked with influential Democratic operatives on dark campaign strategies against Republican presidential nominee Donald Trump. The videos and allegations mostly center around interviews with Scott Foval and Robert Creamer. Foval was a Democratic operative and national field director for Americans United for Change. Creamer was a Democratic operative working for the DNC , a consultant for Americans United for Chance, the founder and president of Democracy Partners and the husband of Illinois Rep. Jan Schakowsky. \\nIn the videos, Foval talks about inciting confrontation and violence on behalf of the DNC and the Clinton campaign at Trump rallies. Foval is also seen talking about voter fraud schemes and is caught saying, “We manipulate the vote with money and action, not with laws.” \\nCreamer, who is also implicated throughout the videos, has a seemingly close relationship with President Obama. Since 2009, Creamer has visited the White House 342 times, including having made 40 visits to Obama himself. The videos also reveal that Creamer is well connected to the Clinton campaign; he boasts about talking on the phone with campaign operatives at 10:30 a.m. every day. The WikiLeaks documents confirm that they indeed had a close relationship. \\nAaron Black, a DNC rapid response coordinator who worked under Foval, can also be seen taking credit for the shutdown of a Chicago rally for Trump in March. Trump had to cancel his appearance after violence broke out. \\nAccording to O’Keefe, one of the terms used for inciting this type of conflict is known as “bird-dogging.” Multiple Podesta emails make reference to this term. One email written by Ilyse G. Hogue, director of political advocacy and communications at MoveOn.org, explained: “Our members are bird dogging Republican candidates in character all over the country. They dress up as execs from ‘RepubliCorp’ a not-so-fictitious merger between the Republican party and multi-national corporations and go to events.” However, the emails making reference to bird-dogging do not implicate the kind of violence that Foval does in the videos. \\nAccording to The Washington Post reports : “Bird-dogging is a fairly common activist tactic, and reporters often recognize it when seemingly “perfect” questions come from a political audience.” \\nThe videos also allege that Hillary Clinton herself had an idea to place people in Donald Duck costumes at every Trump and Pence rally. The video alleges that Clinton and the DNC wanted Americans United for Change to make this happen. According to O’Keefe, if the Clinton campaign and the DNC worked with the group, it would be an “illegal coordinated campaign expenditure” and a violation of Federal Election Commission (FEC) regulations. According to the video, the Clinton campaign and the DNC (including Brazile) talked on the phone with Creamer to coordinate where the “Donald Ducks” should be placed. Foval said any messages the “ducks” were carrying had to be cleared with the DNC. Creamer was asked why the DNC didn’t fund the project itself. He explained that the committee was worried about a trademark issue between Brazile and ABC, which is owned by Disney. \\nFor some added context, O’Keefe has a history of sometimes editing videos in a way that slightly misrepresent the story. \\nSince the videos were released, Foval has been fired from Americans United for Change and Creamer announced his resignation from the DNC. \\nDemocracy Partners released this statement on Oct. 18, 2016: \\nOur firm has recently been the victim of a well-funded, systematic spy operation that is the modern day equivalent of the Watergate burglars. The plot involved the use of trained operatives using false identifications, disguises and elaborate false covers to infiltrate our firm and others, in order to steal campaign plans, and goad unsuspecting individuals into making careless statements on hidden cameras. One of those individuals was a temporary regional subcontractor who was goaded into statements that do not reflect our values. \\nAccording to The Washington Post, neither man defended the “content of the videos,” but instead questioned the way the videos were edited and the impartiality and history of O’Keefe himself. You can watch the videos here . \\nAfter the third presidential debate last week, Fox News anchor Megyn Kelly grilled Brazile over the allegations in the video and the WikiLeaks emails. Brazile refused to answer directly. Instead, she said she was being “persecuted” and that she wouldn’t “validate falsified information.” Asked if the videos were falsified, she dodged the question and Kelly pointed out that no one has come forward to question the videos’ legitimacy. Pressed regarding the WikiLeaks emails, Brazile responded: “… Thank God, I have not had my personal emails ripped off from me and stolen and given to some criminals to come back altered.” She added, “I have seen so many doctored emails. ... I will not sit here and be persecuted, because your information is totally false.” \\nRobert Graham, from tech blog Errata Security, wrote that using a mechanism called DKIM he was able to prove that none of the emails was modified or doctored . \\nYou can watch the Kelly-Brazile interview below: \\n</p><p> \\nOn Monday, Brazile appeared on Tavis Smiley’s talk show, continuing to spin the WikiLeaks emails. She refused to respond to the actual content, saying that the source of the leaks was “people who have proven to lie and manufacture stories” and that she was launching a cyber security task force. To date, none of the WikiLeaks releases in the past 10 years of publication (which include more than a million documents) ever has proved to be altered or false. Brazile asked Smiley, “How do you disprove a lie?” and repeatedly invoked Russia, claiming that the Russians were trying to sow “seeds of doubts into our entire election apparatus.” Resurrecting Cold War sentiment against Russia is not exclusive to Brazile. In fact, the Clinton camp has been doing plenty of this. \\nPeople have every right to fear a Trump presidency, but when Clinton talks about a no-fly zone in Syria and the DNC is pushing the theory that Russia is trying to undermine the U.S. election, questions must be asked. If the Podesta emails are real, one can see a long history of ulterior motives at play. As of now, Brazile remains the chair and face of the DNC and Clinton looks set to be our next president. TAGS:'"}, "time": 1742562790.9264455}