{"duration": 0.06829619407653809, "input_args": {"text": "'WASHINGTON  —     Donald J. Trump has settled on Gen. John F. Kelly, a retired   Marine general whose son was killed in combat in Afghanistan, as his choice for secretary of Homeland Security, putting a seasoned commander with personal experience of the costs of war in charge of protecting the nation’s borders.   and popular with military personnel, General Kelly, 66, rose to run the United States Southern Command, which put him in charge of the military jail at Guantánamo Bay, Cuba, and exposed him to immigration, drug trafficking and other   problems over a sprawling area that encompasses 32 countries in the Caribbean, Central America and South America. In that job, General Kelly often took a tough tone on border security, warning Congress last year about the risks of smuggling rings in Mexico and Central America that spirited “tens of thousands of people,” including unaccompanied children, “to our nation’s doorstep. ” “Terrorist organizations could seek to leverage those same smuggling routes to move operatives with intent to cause grave harm to our citizens or even bring weapons of mass destruction into the United States,” General Kelly said in testimony to the Senate Armed Services Committee. In 2010, General Kelly earned a painful distinction when his son, Lt. Robert Michael Kelly, was killed after stepping on a land mine while leading a platoon in Afghanistan. General Kelly became the   military officer to lose a son or daughter in Iraq or Afghanistan. Mr. Trump, according to a person briefed on the decision, has not yet formally offered the job to General Kelly, who is out of the country. The   plans to roll out the appointment next week, along with his remaining national security choices, including secretary of state. Immigration advocates reacted to the news with measured approval, in large part because Mr. Trump did not choose Kris Kobach, the Kansas secretary of state, who is known for his extreme   views on immigration and had been championed for the post by   groups. Frank Sharry, the executive director of America’s Voice, an immigration reform group, said General Kelly’s warnings about terrorist groups using smuggling rings were “a little over the top. ” But he said they were understandable coming from a general. “One positive thing is that he understands the problem of root causes of immigration,” said Mr. Sharry, noting that General Kelly had spoken about the need to stem violence in Central American countries, a core cause of immigration toward the United States. General Kelly would be the third retired general to get a senior position in Mr. Trump’s cabinet, reflecting the  ’s comfort with military men in important national security posts. He has selected Gen. James N. Mattis as defense secretary and named Lt. Gen. Michael T. Flynn as national security adviser. He is also considering David H. Petraeus for secretary of state. But it is General Kelly’s experience with nonmilitary issues at Southern Command that put him in line for the Homeland Security post. Less focused on combat than other regional military commands, Southern Command has a reputation for emphasizing “soft power” over hard military might. It gets deeply involved in issues such as migration, organized crime and disaster relief, as well as programs to train local militaries. “A lot of the work we do with countries in our hemisphere focuses on transnational threats, like crime and drugs,” said Jeremy B. Bash, a onetime chief of staff to a former defense secretary, Leon E. Panetta, who worked closely with General Kelly at the Pentagon. “It is an excellent preparation for someone whose job it is to protect the border. ” General Kelly served as the senior military assistant to both Mr. Panetta and his predecessor, Robert M. Gates. He forged close ties to Jeh Johnson, who was then the Pentagon’s general counsel and later became secretary of Homeland Security. Mr. Johnson, a person briefed on the matter said, considered General Kelly to take over the Secret Service after it fell into disarray amid a skein of scandals and security lapses. On Wednesday, Mr. Panetta endorsed General Kelly, calling him an “excellent choice” and urging the Senate to confirm him. “He has led our women and men in uniform and understands what it takes to keep our nation safe,” Mr. Panetta said in a statement. General Kelly, several former colleagues said, was revered in the Marine Corps for his loyalty, humility and honesty. On the issue of Guantánamo Bay, his reputation for candor and bluntness sometimes put him at odds with the White House’s preferred narrative. In March 2013, when a mass hunger strike swept the detainees in the prison, General Kelly testified before Congress that the root cause of the unrest was mounting despair among prisoners that they would never go home because Mr. Obama, stymied in part by congressional transfer restrictions, appeared to have lost interest in closing it. “In talking to the hunger strikers, they had great optimism that Guantánamo would be closed,” he testified. “They were devastated when the president backed off  —   at least their perception  —   of closing the facility. ” He also sought $200 million to rebuild prison facilities and housing for guards at the detention center, an awkward request when the president was saying it would be closed  —   and during a time of budget cuts. At a news conference at the Pentagon marking the end of his command, General Kelly offered a characteristically frank assessment of what would happen if former detainees   with terrorism: “If they go back to the fight, we’ll probably kill them. So that’s a good thing. ” As Mr. Panetta’s military assistant, General Kelly worked to carry out the Obama administration’s policy of allowing women into combat roles. But he later questioned the policy, saying the military would have to lower its physical standards to fulfill the requirement. “If we don’t change standards,” he told reporters, “it will be very, very difficult to have any numbers  —   any real numbers come into the infantry, or the Rangers or the SEALs, but that’s their business. ” As a wartime commander, General Kelly led troops in intense combat in western Iraq. In 2003, he became the first Marine colonel since 1951 to be promoted to brigadier general while in active combat. He has said little publicly about the death of his son in Afghanistan. But it may have played a role in his selection. Mr. Trump, people close to the transition said, wanted people on his national security team who understood personally the hazards of sending Americans into combat. Choosing a bereaved father could also help heal the rift from Mr. Trump’s clash in the summer with Khizr and Ghazala Khan, the   parents of Capt. Humayun Khan, who was killed in 2004 during the Iraq war. The Khans appeared on behalf of Hillary Clinton during the Democratic convention, and later came under sharp criticism from Mr. Trump.'"}, "time": 1742628531.702081}