{"duration": 0.024867773056030273, "input_args": {"text": "'Using the Hubble space telescope, NASA has detected massive flaming spheres traveling at a speed of 580 thousand kilometers per hour. These monstrous balls of melted plasma are located at a distance of 1200 light years from Earth. Their origin is unclear.\\nGiven the speed at which they travel, they could get from the Earth to the Moon in just half an hour. The researchers, who have observed stars in extinction with the telescope since 1990, found that these giant balls have a size twice that of Mars and a temperature much higher than that of the sun. Hypothetically, they would have fed off the star V Hydrae which experts have studied for eight years.\\nEven though this is an exceptional finding, experts have failed to uncover the origin of these mysterious fiery missiles, although they have proposed a theory suggesting that the massive fiery balls were expelled by stars revolving in the orbit of the huge red star and are part of a stellar rain that occurs every eight and a half years.\\nA death of a star Could V Hydrae be the responsible culprit? According to experts, V Hydrae is a bloated red giant that is dying. V Hydrae has already shed half its mass into space in its final death throes and is nos discharging the residual nuclear fuel as it burns out – hardly a probable origin of super-hot, giant blobs of charged gas.\\n“The current best explanation suggests the plasma balls were launched by an unseen companion star,” NASA said in a statement.\\n“According to this theory, the companion would have to be in an elliptical orbit that carries it close to the red giant’s puffed-up atmosphere every 8.5 years. As the companion enters the bloated star’s outer atmosphere, it gobbles up material. This material then settles into a disk around the companion, and serves as the launching pad for blobs of plasma, which travel at roughly a half-million miles per hour.”\\nMassive strings of super hot blobs “We suggest that these gaseous blobs produced during this late phase of a star’s life help make the structures seen in planetary nebulae,” Raghvendra Sahai, an astronomer at NASA’s Jet Propulsion Laboratory in Pasadena, California, and lead author of a study on the cosmic cannonball, said in the statement. “We knew this object had a high-speed outflow from previous data, but this is the first time we are seeing this process in action.”\\nAccording to IBT , between 2002 and 2004, and from 2011 to 2013, researchers led by Raghvendra Sahai utilized Hubble’s imaging spectrograph in order to perform observations of V Hydrae and the regions surrounding it. They discovered supermassive strings of super hot blobs, each with a temperature superior to 17,000 degrees Fahrenheit.\\n“The observations show the blobs moving over time,” Sahai said. “The data show blobs that have just been ejected, blobs that have moved a little farther away, and blobs that are even farther away.”\\nSource: Ancient Code \\n'"}, "time": 1742628514.9448094}