{"duration": 0.07689285278320312, "input_args": {"text": "'BEIJING  —   To the 90 million or so members of China’s Communist Party, President Xi Jinping has a message: Don’t call me president. Don’t call me party secretary. Call me “comrade. ” There is just one problem. In recent decades, the once ubiquitous term for Communist cadres and leaders has been embraced and popularized by a different group of people: gay men and lesbians. The term “tongzhi,” or “comrade,” was a nearly universal form of address in China well into the 1980s, but as Mao jackets gave way to   suits and ties, it fell out of favor among Chinese officials. Among gay men, however, “tongzhi” became a term of affection and solidarity and eventually a catchall label for sexual minorities. A gay and lesbian film festival held annually in Hong Kong has been called the Hong Kong Comrade Film Festival since 1989. And the Beijing center for lesbian, gay, bisexual and transgender people calls itself the Beijing Tongzhi Zhongxin  —   or the Beijing Comrade Center. Even Google has caught on. Enter the characters for tongzhi guanxi  —   literally “comrade relationship” —   into its translator, and it gives you “gay relationship. ” (Baidu, the dominant   search engine, by contrast, offers the literal translation.) Fan Popo, a gay rights activist and filmmaker based in Beijing, said there had been episodes in which Chinese criticized gay rights activists for appropriating the political term. For some younger Chinese, however, the word “comrade” offered a source of comfort for those who felt too ashamed to use the term “tongxinglian,” or homosexual, Mr. Fan said. “But now, people have really gotten used to it,” he said. “Even the   on the bus  —   the people who you would not really expect to know the modern lingo  —   don’t say ‘comrade’ anymore because they know what it means among young people. ” Nowadays, Chinese typically refer to one another as “mister,” “miss” or “madame. ” Strangers often address one another as “young miss,” “beautiful woman,” “handsome man” or “master. ” Within the party, only top leaders are typically referred to as “comrade. ” At the lower levels, “comrade” has been replaced by a grab bag of titles. In a commentary published last year, Study Times, a weekly party journal, railed against modern designations like “deputy secretary,” “boss,” “C. E. O. ,” “grandfather” and “brother. ” “These terms have not only destroyed the seriousness of democratic relations within the party,” the commentary read, “but they have also affected the relationship between the party and the masses as well as the overall image of the party. ” After a meeting last month of the Communist Party’s Central Committee, leaders issued a directive urging party members to eschew titles and honorifics in favor of the revolutionary throwback. The directive instructed that “party members must call each other ‘comrades. ’” Some political experts, however, voiced skepticism that the order would change much. “These days, everyone who joins the party does so to become an official and make money,” said Zhang Lifan, a writer and historian. “You can’t really call these people true comrades. ” There may also be an inherent contradiction. Last month’s Central Committee meeting  —   the same one that issued the order to party members to call one another comrade  —   had another, bigger announcement: “Comrade Xi Jinping” had been elevated to “core” leader, cementing his status as China’s central political strongman. “Power is power,” Mr. Zhang said. “You can say that all party members are comrades. But among all the comrades, there is still a core. ”'"}, "time": 1742562302.776007}