{"duration": 0.10600495338439941, "input_args": {"text": "'Democrats should ask Clinton to step aside ‹ › Since 2011, VNN has operated as part of the Veterans Today Network ; a group that operates over 50 plus media, information and service online sites for U.S. Military Veterans. Lemmings and Republicans – Alan Ned Sabrosky By VNN on November 1, 2016 So why are so many Republican leaders doing all they can do to diminish Trump and give the election to Clinton ? Donald Trump’s Triumph Forces GOP Party Leaders to Make a Decision – Loyalty Pledge \\nFor conservatives and Republicans, a win by Hillary Clinton in November would be a catastrophe — and not just because people like Miley Cyrus and Al Sharpton would not leave the country. Lemmings who vow to leave the U.S. if Trump Wins \\nIt would mean continued assaults on the 1st and 2nd Amendments, especially the latter. Higher taxes and more welfare. More war — Hillary Clinton’s defense secretary-in-waiting, Michelle Flournoy, has openly said as much. And it would mean her appointment of at least one justice to the US Supreme Court, and perhaps as many as four, creating a liberal block of five to seven justices that will put its stamp on the country for a generation or more. Lemmings \\nSo why are so many Republican leaders doing all they can do to diminish Trump and give the election to Clinton, either attacking him openly or withholding support from him? Sure, Trump’s style is often abrasive, and he is a bully, and most importantly to professional politicians, he made fools of the Republican establishment by trashing their best efforts to defeat him. \\nBut all of that has happened earlier, and the party’s leadership have generally rallied around their chosen candidate. So none of the above ought to make so many of the Republican Party’s “leaders” act like lemmings running around in search of a cliff, jeopardizing everything their party has stood for by enhancing Clinton’s prospects. \\nThis type of internal division happened significantly only twice before. In 1860, the Democrats split so badly that the two factions each ran a candidate for president. \\nThe Republican candidate – Abraham Lincoln – won by default, and the outcome was a bloody civil war and poisoned internal relations. \\nIn 1964, the Republican establishment largely rejected their candidate – Barry Goldwater. This gave Lyndon Johnson a win, and America? – well, America got a horribly escalated war in Vietnam we eventually lost, and an even worse “war on poverty” that created a huge welfare class and effectively dismantled the black family. \\nThese precedents are not exactly classified secrets, but much of the Republican “leadership” persists in self-destructive behavior. This is because today, there is one unspoken issue that sets Trump apart from Hillary Clinton, and in opposition to all of the other Republican candidates at the start of the primary season — and, oddly enough, aligns him with Bernie Sanders. \\nThis is that he cannot be counted on to go to war with Iran as soon as possible, which is what Israel wants and what its lobby in the US — AIPAC ( American Israel Public Affairs Committee, the self-described owner of Capitol Hill ) – uses as the litmus test for the legitimacy of a candidate in this election. \\nThus, in obedience to AIPAC, many in the Republican establishment throw their core interests to the wind and in effect serve Hillary Clinton. This was especially evident in the open letter signed by many self-described Republican national security experts declaring Trump unfit for the presidency. \\nLeft unsaid in it was that most are Jewish; many have dual Israeli citizenship; all put Israel first; all have been architects of one or more of our “lovely” Middle East wars since 2001; and all want the US to attack Iran, alone or in concert with Israel. Architects of Endless “Regime Change” wars \\nThis ought to give some idea of the sort of debacle awaiting us after the November elections. When the smoke clears, unless Hillary Clinton’s many scandals surface soon and dramatically, perhaps the Republican Party (or whatever remains of it) will replace the elephant with the lemming as the party symbol. I’m just not sure either deserves that fate.'"}, "time": 1742563794.7118697}