{"duration": 0.04905509948730469, "input_args": {"text": "'Pinterest \\nC.E. Dyer reports that actor James Woods posted a powerful video on Twitter about what happened on Highway 265 in Arkansas over four decades ago that Democrat nominee Hillary Clinton doesn’t want people to know about. \\nThe video chronicled the rape of a 12-year-old Arkansas girl, Kathy Shelton, that occurred on May 10, 1975 when two men lured the girl into their car and brutally assaulted her. \\n— James Woods (@RealJamesWoods) September 20, 2016 \\nThis video details the horrific attack…and the actions of the attorney who defended one of the rapists: Hillary Clinton. \\nAccording to the video, child was raped and beaten so brutally that she spent five days in a coma and was left unable to bear children. \\nA local paper mill worker, 41-year-old Thomas Alfred Taylor, was charged with the rape. Then Hillary Rodham became his attorney. \\nTaylor had semen mixed with the 12-year-old victim’s blood in his underwear, proving that he committed the crime. In court, Hillary maligned the rape victim’s character in order to defend her monster of a client. \\nFrom the video: “Taylor’s attorney went to extraordinary lengths to discredit the child victim, suppressing all oral, written and physical evidence, forcing the 12-year-old to submit to polygraphs and psychiatric evaluations, even accusing the child (who had been a virgin until the attack) of seeking out older men and ‘fantasizing’ her rape.” \\nThe victim has recently come forward to talk about how Hillary’s lies ruined her life, which after the trial spiraled into a struggle with drugs and prison time. \\nShelton, who has already been put through a truly horrific nightmare, had to hear the tapes released in which Hillary laughed about the trial. \\nHillary laughed, on tape, about a trial of a man who brutally raped a 12-year old girl and subsequently received less than a year in prison for his horrific crime. \\nShelton has decided to speak out about her nightmare at the hands of Hillary Rodham. The video ends with a message from Shelton to Clinton, “You lied about me. You took me through Hell.” \\nClinton has claimed that she had an obligation to defend Taylor, but she is wrong; she did not have to do what she did. What she put a 12-year-old rape victim through is beyond the pale. \\nLiberals regularly talk about victim blaming and rape culture in America, but where is the outrage about what Clinton did to a 12-year-old rape victim as a defense attorney? \\nWhat else is there to say really? If you can watch that video and not be utterly and completely disgusted with Clinton, well, God help you. '"}, "time": 1742564504.539807}