{"duration": 0.08426642417907715, "input_args": {"text": "'WASHINGTON  —   Donald J. Trump, the Manhattan real estate mogul who boasts about his wealth, maintains a fleet of aircraft and sells his own brand of neckties, paid respects on Sunday to an incongruous constituency. “Look at all these bikers,” Mr. Trump, standing before a crowd in front of the Lincoln Memorial, said with admiration. “Do we love the bikers? Yes. We love the bikers. ” Mr. Trump was addressing a gathering at the 29th annual Rolling Thunder motorcycle run, a vast event over Memorial Day weekend that is dedicated to accounting for military members taken as prisoners of war or listed as missing in action. Bikers assembled at the Pentagon before riding en masse into the nation’s capital, with many dressed in leather vests covered in patches, their bikes rumbling throughout the afternoon. For the   Mr. Trump, who likes to stress his desire to strengthen the military and improve how veterans are treated, the gathering provided a receptive audience, if one where he might otherwise seem out of place. “He speaks what’s on his mind and means what he says,” said Tom Christian, 43, a heating and   contractor from Tennessee. “And that’s what a biker does. That’s the way we are: We say what we think. If you like it, you like it. If you don’t, go the other way. ” The warm embrace from the crowd gave no hint of the controversy that Mr. Trump incited last year when he denigrated the military service of Senator John McCain of Arizona, a former prisoner of war in North Vietnam. Mr. Trump said Mr. McCain, a fellow Republican, was not a war hero, saying, “I like people that weren’t captured, O. K.?” Mr. Trump is the latest political figure, but not the only one, to pay attention to bikers. Wearing a black   helmet, Sarah Palin, the former governor of Alaska, appeared at Rolling Thunder in 2011, months before saying she would not run for president in 2012. And one of Mr. Trump’s former Republican rivals, Gov. Scott Walker of Wisconsin, a proud   owner, campaigned at Harley dealerships and wore motorcycle boots on the campaign trail. Asked during a debate what he wanted his Secret Service code name to be, he suggested Harley. Campaigning in Wisconsin in March, Mr. Trump observed that Mr. Walker was “always on a Harley. ” “I’m not a huge biker, I have to be honest with you, O. K.?” Mr. Trump added. “I always liked the limo better. ” Nancy Regg, a spokeswoman for Rolling Thunder, said the group had invited Mr. Trump to appear. The group did not extend an invitation to Hillary Clinton or Senator Bernie Sanders, she said. Richard McFadden, 58, an annual Rolling Thunder attendee from North Carolina, said Mrs. Clinton would not have been welcome. “Just like asking Jane Fonda to show up, it’d be a very, very bad thing,” said Mr. McFadden, who works in computer support and wore a button that read, “Hillary for Prison 2016. ” Mr. Trump’s supporters include a group called “Bikers for Trump,” which has more than 46, 000 “likes” on Facebook. Speaking on Sunday, Mr. Trump told the crowd of seeing large numbers of bikers at his campaign events. “I said, ‘What are they all doing here?’ and my people would say, ‘They’re here to protect you, Mr. Trump,’” he said. “It’s an amazing thing. And I want to tell you, some of these people are tough. ” But when he shakes their hands, “there is love, and it’s an incredible feeling, and that’s why I wanted to be with you today,” he said. Wearing a red “Make America Great Again” hat and forgoing a necktie, Mr. Trump pledged to rebuild the military and said George S. Patton and other deceased generals were “spinning in their graves. ” He lamented that veterans “have been treated so badly in this country” and asserted that in many cases, immigrants in the country illegally were taken better care of. He said that on Tuesday he will detail the money he had raised for veterans’ groups. Standing before the reflecting pool with the Washington Monument offering a striking backdrop, Mr. Trump also expressed disappointment about the size of the crowd, which did not fill the space cordoned off in front of the Lincoln Memorial for the event. “I thought this would be like Dr. Martin Luther King, where the people would be lined up from here all the way to the Washington Monument,” he said. He seemed to blame event organizers, saying he passed enormous crowds along the roads on the way to the gathering, including “the most beautiful bikes I’ve ever seen in my life. ” Two retirees from New Jersey, Tom Gadosky and his companion, Marney Pratt, who are both 67, traveled to Rolling Thunder on their    . Both plan to vote for Mr. Trump in November. “A lot of the people, if you walk around, are baby boomers, like us,” Ms. Pratt said. “We’ve been through it all. We want to have it back again. ” Neither of them was bothered by what Mr. Trump had said about Mr. McCain. People, Mr. Gadosky said, “have very short memories. ”'"}, "time": 1742562143.6761818}