{"duration": 0.10668802261352539, "input_args": {"text": "'OMAHA  —   The investor and philanthropist Warren Buffett unleashed a withering attack on Donald J. Trump on Monday for refusing to release his tax returns, asserting he had something to hide, and for misleading voters about his success as a businessman and ability to improve the American economy. Mr. Buffett, known to investors as the Sage of Omaha, said a monkey throwing darts at the stock pages in 1995, when Mr. Trump first offered stock in his Atlantic City hotels, would have come out far ahead of anyone who listened to Mr. Trump’s “siren song” and invested in his company that lost money year over year. The attack from perhaps the nation’s most revered investor undercut a core argument of Mr. Trump’s presidential candidacy: that his success as a businessman qualified him to run the country despite his lack of political experience. Mr. Buffett appeared at a rally with Hillary Clinton, the Democratic nominee, in his hometown, Omaha. Taking on Mr. Trump, he pledged to personally transport 10 Nebraskans to the polls on Election Day on behalf of Mrs. Clinton and urged others to do the same. His appearance made him the latest billionaire to come out strongly against Mr. Trump’s candidacy  —   after speeches by Michael R. Bloomberg at the Democratic National Convention in Philadelphia and by Mark Cuban over the weekend  —   as Mrs. Clinton enlists their support to question Mr. Trump’s business acumen. Mrs. Clinton was campaigning in Nebraska  —   a traditionally Republican state  —   as she sought to seize on momentum from the Democratic convention last week. On Monday, a CBS News poll, the first major national telephone survey after her nomination, showed her enjoying a bump since Republicans nominated Mr. Trump. They were tied at 42 percent after the Republican National Convention, but she now leads him, 46 percent to 39 percent. By campaigning in Nebraska, Mrs. Clinton was trying to pick up support in one of just two states that allocate electoral votes by congressional district. In 2008, Barack Obama won a single electoral vote in the state’s Second District against Senator John McCain, though he lost it in 2012 in his more closely fought   race against Mitt Romney. In his address introducing Mrs. Clinton to the crowd, Mr. Buffett pointed out what most in the audience at a high school gym knew: that their votes could be disproportionately influential because of the state’s peculiar Electoral College system. “We live in a very special place,” Mr. Buffett said. Noting that Jonathan Karl of ABC News predicted on Sunday that the Electoral College could come down to a    tie, Mr. Buffett said, “I am looking at the people that can change that 269 to 270. ” Mr. Buffett harshly criticized Mr. Trump for claiming that he had made “sacrifices” by building buildings and working hard, an argument he made after Khizr Khan, the Muslim father of an Army captain killed in Iraq, said during a speech at the Democratic convention, that Mr. Trump had “sacrificed nothing” for the country. Mr. Buffett said he, like Mr. Trump, had made a lot of money. “I have not sacrificed,” he told the rally. “How in the world can you stand up to a couple of parents who lost a son and talk about sacrificing because you were building a bunch of buildings?” Mr. Buffett quoted a famous rejoinder to Senator Joseph McCarthy during his 1950s   hearings: “Have you no sense of decency, sir?” Mr. Trump was campaigning on Monday in Ohio and Pennsylvania, two swing states that Mrs. Clinton visited over the weekend and where Mr. Trump is pushing his   message hard. Although Mr. Romney won all but one of Nebraska’s 93 counties four years ago, the Clinton campaign sees opportunity this election cycle. The Second District sent a Democrat, Representative Brad Ashford, to Congress in 2014, and he was one of the rare members of his party to unseat an incumbent during a Republican wave. Maine is the only other state to split its electoral votes. In a reverse image of Nebraska, Mr. Trump’s campaign hopes to pick up a vote in more conservative, rural northern Maine. The Clinton campaign hired a Nebraska state director about a month ago, when it also started spending precious resources on TV ads in the state. “There’s serious dollars and I would say serious politicos who have been hired,” said Jane Kleeb, the incoming chairwoman of the Nebraska Democratic Party. At the Philadelphia convention, Ms. Kleeb helped mollify and motivate delegates supporting Senator Bernie Sanders, who carried the Nebraska caucuses during the primary race. More than 1, 000 people snaked back and forth in a parking lot to hear Mrs. Clinton and Mr. Buffett. Among those awaiting the speakers was Jim Magill, a retired chief master sergeant in the Air Force. A Republican, he said he supported Mrs. Clinton and did not believe Mr. Trump’s promises to veterans. He was appalled, he said, about the Republican nominee’s criticism of the Khans. “It was deplorable somebody would say anything like that about a veteran who died for his country to his parents,” Mr. Magill said. “He should have been slapped. ”'"}, "time": 1742563031.3730059}