{"duration": 0.056845903396606445, "input_args": {"text": "'Jason Frierson is an African-American Democrat seeking re-election to   in November 2016. While he is not the incumbent this election, he was the assemblyman for the district during the 77th Nevada State Legislature; in 2013. His opponents are Republican Norm Ross and Democrat-turned-Libertarian John Moore , who is the current person representing the citizens.\\nPlanned Parenthood Endorsement of Jason Frierson Nevada Advocates for Planned Parenthood Affiliates (NAPPA) website lists the candidates it endorses for the state’s 2016 Election Guide. On Frierson’s website, abortions are not on his list of issues. In fact, they are only listed in the list of groups and organizations that support him.\\nThe candidate’s affiliation is evident in his photos taken with the women of the NAPPA dressed wearing the standard issue pink tee shirts. How can an African-American man accept the endorsement of a group whose founder began her campaign for birth control as eugenics against the black population?\\nMargaret Sanger pushed her agenda to forward her cause as early as 1912 when she authored a column, “What Every Girl Should Know.” In 1921, she founded the American Birth Control League and served as president until 1928. The league was the precursor to Planned Parenthood. Sanger was known to write for scientific journals on the importance of birth control for black women. One such article was entitled “Birth Control: The True Eugenics.” She even addressed the Klu Klux Klan in 1926 rally in Silver Lake, New Jersey, according to The Washington Times.\\nIn 2012 the Centers for Disease Control (CDC) reported that there were 699, 202 legal abortions in the United States. That means the abortion to live birth ratio was 210 per 1,000, respectively. This number may not be accurate since there were only 49 areas supplying data.\\nNorm Ross Fundraiser for LLS Whereas Ross opposes any tax funding of Planned Parenthood and prefers support from organizations that save lives. As such, he and his wife, Mojgan, a candidate Leukemia & Lymphoma Society (LLS) Woman of the Year, held a fundraiser in their home raising $5,000 in donations.\\nDuring 2015, the organization invested $67.2 million in research to find a cure for leukemia and lymphoma. Their goal is diametrically opposed to that of Planned Parenthood.\\nThe guest of honor was a young boy, a local resident, who has survived a blood cancer. The LLS website explains the program, Boy & Girl of the Year, provides inspiration and motivation for volunteers and donors.\\nJeana Foster wrote this testimonial: “Working with LLS, meeting ‘Boy and Girl of the Year’ […] and knowing that my efforts will bring us closer to finding a cure for them and all those suffering from blood cancers is truly inspiring.”\\nJason Frierson Following Hillary Clinton’s Policies Does Frierson agree with Hillary Clinton’s Democratic party line?\\nDoes he support open borders, which has created a significant number of non-English speaking students in Nevada’s public schools? What does he think about allowing millions of refugees entering the U.S. without proper vetting? How about the massive tax increases Clinton has promised Americans? What is his stand about the Army General imprisoned for breaches of National Security? Does Frierson really think that Clinton deserves a get-out-of-jail-free-card for the same offenses? What is his position on Transgender restrooms? These questions need to be answered by Frierson. He appears to be a confused candidate; he is endorsed by an organization that provides abortion and was founded by a woman whose philosophy was eugenics of black Americans. Furthermore, Frierson tows the Democratic platform and supports Clinton’s illegitimate candidacy for the presidency.\\nBy Cathy Milne\\nSources:\\nInterview with Norm Ross October 20, 2016\\nJason Frierson For Assembly District 8: Issues; Endorsements\\nThe Washington Times: GROSSU: Margaret Sanger, racist eugenicist extraordinaire\\nBiography: Margaret Sanger\\nThe Leukemia & Lymphoma Society Southern Nevada Chapter Website: About\\nTop and Featured Image Courtesy of Charlotte Copper’s  \\nInset Image Courtesy of Norm Ross – Used With Permission    #CMJournalist , Frierson , John Moore , Norm Ross , Planned Parenthood'"}, "time": 1742562454.1452625}