{"duration": 0.07313704490661621, "input_args": {"text": "'Internet users in Venezuela have finally quantified what it truly means to have a rare Pepe, buying and selling     trading cards as a way to escape the economic control of their socialist government. [The idea of images of the popular green frog being “rare” started off as a joke on 4chan, where users would claim that their images of Pepe were rarer and more valuable than everyone else’s. It escalated into people selling their collections of Pepe on eBay, with bids reaching up to almost $100, 000 before eBay took it down.  There were never any serious transactions however, with everyone involved enjoying the ironic humour of the situation. More recently, a group of redditors have been “trading” memes of any shape and size on    attempting to create a stock market in meme popularity. But, it turns out that rare Pepe collecting online is now a serious business. Sometime last year, an unknown individual began issuing “official” rare Pepe trading cards using the Counterparty platform to link them to bitcoin, in an attempt to poke fun at another online trading game called Spells of Genesis. Today, these cards can be exchanged for the equivalent of thousands of US dollars on Counterparty’s decentralised exchange. This is due to a creation of artificial scarcity in the cards (as one would expect trading cards to have). Anyone can issue their own rare Pepes, but these are then verified by the official Rare Pepe Foundation, and linked to a certain piece of the bitcoin chain via a practice known as coin colouring. Whomsoever owns that particular bitcoin key address owns the Pepe associated with it. All verified rare Pepes can be viewed in a complete directory of them. This is in particular use in Venezuela. Developers of a game called Rare Pepe Party that would utilise some of these cards have claimed that they are needed to keep their company afloat. “We’re based in Venezuela, and our business has been saved by bitcoin many times,” the developer, who wished to remain anonymous, told Crypto Insider. According to them, around 80% of offices in the vicinity of theirs have been closed down in the past year, with even the biggest businesses still around losing up to 90% of their employees. “In that timeframe, thanks to bitcoin related business, we’ve grown our employee base from just 5 to 10 (we’re still a small company),” said the developer. “We’ve   our office.    we’ve been improving, so we’re banking big on bitcoin and now over Counterparty assets. ” However, bitcoin is not completely safe in the South American nation. Venezuela’s equivalent of secret police, SEBIN, have been targeting people using bitcoin and bringing them up on or extortion and bribes, especially bitcoin miners, according to the developer. “Anything bitcoin related is a big   here at the moment  …     this week I got wind of at least two mining operators getting knocks on their doors. ” Jack Hadfield is a student at the University of Warwick and a regular contributor to Breitbart Tech. You can like his page on Facebook and follow him on Twitter @ToryBastard_ or on Gab @JH.'"}, "time": 1742563396.034256}