{"duration": 0.026854753494262695, "input_args": {"text": "'A heterosexual couple have lost their legal battle to enter into a civil partnership. [Academics Rebecca Steinfeld, 35, and Charles Keidan, 40, wanted to secure legal recognition of their   relationship by entering into a civil partnership, rejecting marriage as they claim it carries “patriarchal baggage”. However, they have been prevented from doing so because the Civil Partnership Act 2004 stipulates that only   couples are eligible.  In November the couple, who have a    daughter, challenged a decision by High Court judge Mrs Justice Andrews to dismiss their judicial review action. But on Tuesday their challenge was in turn dismissed by the Court of Appeal, the Telegraph has reported. Addressing Lady Justice Arden, Lord Justice Beatson and Lord Justice Briggs, Karon Monaghan QC advanced the argument that barring the couple from entering into a civil partnership was incompatible with Article 14 of the European Convention, which relates to discrimination, taken with Article 8, which refers to respect for private and family life. “They wish very much  —   and it is of very considerable importance to them  —   to enter into a legally regulated relationship which does not carry with it patriarchal baggage, which many consider comes with the institution of marriage,” she said. Dan Squires QC, acting on behalf of the Secretary of State for Education, who has responsibility for equalities within Government, told the court that a decision had been taken within Government to see how legislation extending marriage for   couples planned out before offering civil partnerships up to heterosexual couples. The judges agreed with the couple that a potential violation of Article 14, taken with Article 8, had been identified, but Lady Justice Arden dissented on the question of whether the Government’s current “wait and see” policy was justified. Ms Steinfeld said: “We are pleased that today’s ruling has shown that the Government must act very soon to end this unfair situation. “All three judges agreed that we’re being treated differently because of our sexual orientation, and that this impacts our private and family life. “All three rejected the argument that we could ‘just get married’. All three emphasised that the Government cannot maintain the status quo for much longer  —   they are on borrowed time. ” Lady Justice Arden had accepted their case on almost every point, she added, saying: “We lost on a technicality, that the Government should be allowed a little more time to make a decision. So there’s everything to fight for, and much in the ruling that gives us reason to be positive and keep going. ” Mr Keidan said: “The Court of Appeal has made it clear the status quo cannot continue. The Government should now recognise the benefits of opening civil partnerships to   couples. “The measure is fair, popular, good for families and children, and long overdue. They have everything to gain. ”'"}, "time": 1742628451.0089023}