{"duration": 0.09106969833374023, "input_args": {"text": "'\\nOK, theoretically, everything will go according to plan, and Donald Trump will be the next president.\\nBut technically, the (s)election hasn’t really taken place yet.\\nPresidential electors of the mystified electoral college must still actually vote for the president, and there isn’t anything to keep them from ‘voting their conscience’ and choosing someone other than Donald Trump.\\nMoreover, it appears that there is an active effort to flip the electoral college to deny Trump the presidency, and toss the White House to either Hillary or a GOP loyalist.\\nThe #NeverTrump crowd and plenty of bitter Hillary supporters are still hoping for a coup, though even they admit it is a long shot – completely unprecedented and anything but likely.\\nAccording to the Blaze :\\nDonald Trump may have won the electoral votes necessary to win the White House, but he he’s likely going to lose the popular vote to Democratic candidate Hillary Clinton. And now two electors have launched a last-minute effort to convince their colleagues to abandon the president-elect. \\n“This is a long shot. It’s a hail Mary,” Bret Chiafolo, a Washington state elector who previously pledged not to vote for Clinton, told Politico Monday. “However, I do see situations where — when we’ve already had two or three [Republican] electors state publicly they didn’t want to vote for Trump. How many of them have real issues with Donald Trump in private?”\\nChiafolo along with Colorado elector Micheal Baca have launched what they call a “moral electors” movement in hopes of convincing 37 of their Republican colleagues to deny Trump their votes. Should they succeed in their radical effort, the presidential decision would be thrown to the Republican-controlled House of Representatives.\\n[…]\\nThe Electoral College consists of 538 members who are expected to convene in their respective state capitals on Dec. 19 to formally vote for the next president… Baca said he hopes the move launches a serious national discussion about abolishing the Electoral College , which would require either a constitutional amendment or legislation in several states.\\nThe speculation is that if this maneuver were to be successful, the GOP-led Congress could be persuaded not to choose Hillary, but to write-in a selection for a party loyalist – like Mitt Romney or John Kasich… maybe even a Bush.\\nOf course, there have also been reports that Team Hillary has been hard at work attempting to persuade electors to switch their votes in the hope, however desperate, that they can still flip the election and take the White House:\\nOn December 19, the Electors of the Electoral College will cast their ballots. If they all vote the way their states voted, Donald Trump will win. However, they can vote for Hillary Clinton if they choose. Even in states where that is not allowed, their vote would still be counted, they would simply pay a small fine – which we can be sure Clinton supporters will be glad to pay! \\nWe are calling on the Electors to ignore their states’ votes and cast their ballots for Secretary Clinton. Why? Mr. Trump is unfit to serve.\\nThe larger issue here is that the system is badly broken, the people are harshly divided along demographic and political lines, and the future is gambling on extreme versions of itself – larger than life candidates, and bizarre back-door maneuvers in attempt to hack the system and bend it in one direction or another.\\nTrump has taken his place on the stage in a thunderous revolt of the people, but his legacy will be tested out the gates by the heavy pressures of Washington lobbyists, intrigue on the part of political insiders and the cults of opposition that are springing up in response to his controversial journey to the White House.\\nThe entire political establishment have been knocked off their perch, though their hold on power has not necessarily been loosened.\\nA whole new era is born, and it remains to be seen how it will play out.\\nRead more: \\nIt’s Not Over Yet: “They Are Probably Still Trying To Steal The Election” | Calls For Electoral College To Ignore Will Of People \\nClinton Insider Confesses: Trump Protests Are Just More Pre-Paid “Soros Riots” to Stir Unrest \\n“Beware of the Shadow Government”: Ron Paul Advises President-Elect \\nTrump Surrounded By Bankers, Wall St. Insiders Banging on the Door to Get In: “Draining the Swamp?” \\n“Violent Revolution If Trump Lets Them Down”: People Remain Poised for Angry Revolt – Roberts '"}, "time": 1742561652.9470243}