{"duration": 0.07586383819580078, "input_args": {"text": "'At the moment that Hillary Clinton was all but clinching the Democratic nomination for president, Meryl Streep was on a stage in Central Park, impersonating Donald J. Trump. In orange face makeup and pompadoured hair, Ms. Streep, the chameleonic   Oscar winner, did a more than credible version of the presumptive Republican nominee, down to the pursed lips and   belly. She got the   voice, too, even while singing. Ms. Streep was part of the Public Theater’s gala benefit celebration on Monday night, a tribute to Shakespeare at the Delacorte Theater, home to Shakespeare in the Park. She was the closing act with Christine Baranski, doing “Brush Up Your Shakespeare,” a number from the Cole Porter musical “Kiss Me, Kate. ” “We could do a deal  —   you’ll let me know  —   why it is all the women say no?” she sang, stretching out her arms in a Trumpian gesture. Later she strolled the stage, gesticulating to the audience in Mr. Trump’s signature     style. The song, traditionally a duet for men, offers advice for picking up women  —   in this case, female voters. Some of the original lyrics were altered, but some could stand as is, for Mr. Trump’s combative attitude: “If she says your behavior is heinous, kick her right in the Coriolanus!” The crowd, which included Michael R. Bloomberg, the former mayor: the United States ambassador to the United Nations, Samantha Power   Miranda and Bette Midler, loved it. Her performance came as something of a surprise to the event organizers, who knew only that Ms. Streep, a supporter of Mrs. Clinton’s, wanted to take on Mr. Trump. “Utterly her idea, beginning to end,” Oskar Eustis, the Public’s artistic director, said after the show. “There were skeptics, there were doubters, but one of those skeptics was not Meryl Streep. She was absolutely sure she could do it. None of us had seen her in costume or makeup, till she walked out tonight. ” Ms. Streep skipped the dinner before the show to get into character, and spent time holed up in her dressing room. “She was showing us this thing that Donald Trump always does,” said the actress Kate Burton, who shared the dressing room with Ms. Streep along with Ms. Baranski, Lily Rabe and Phylicia Rashad. “He apparently does this thing, where he goes to close to his jacket but it doesn’t close all the way, and so he kind of goes for it and then he tries to close it again. ” It was a mannerism that only Ms. Streep seemed to catch, Ms. Burton said. “She treats this like she would her greatest roles: she’s working on it all the time. ” For the show, she came onstage in a black suit, white shirt and overlong, clownish red tie. Her transformation astounded her cast mates, who had only glimpsed her with the Trumpian coif in rehearsal. “She showed up, and I thought, ‘Meryl’s having a terrible hair day,’” said the Shakespeare in the Park veteran Hamish Linklater. (Ms. Burton reported that Ms. Streep even used her own hair: “She did some funky thing with pins. ”) Other performers watched from the wings as she and Ms. Baranski, in a black   pantsuit, did their finale. “She’s willing to try anything, and have fun with what she tries,” Mr. Eustis said of Ms. Streep, who has appeared at the Delacorte several times in starring roles. “She’s just fearless. ” Mr. Linklater, who played a comic Romeo in another number, called Ms. Streep’s take “naughty. ” But, he added, Shakespeare “wanted to be valuable to his times. And she gave a performance that was valuable to her times. So absolutely, she’s honoring the spirit of the evening. ” On Tuesday afternoon, shortly after her name trended on Twitter with news of the Trump portrayal, Ms. Streep issued an statement through a Public Theater spokeswoman. “I appreciate the interest, but this was a   a once in a (last in a) lifetime appearance of this character,” she said.'"}, "time": 1742563711.096349}