{"duration": 0.1105189323425293, "input_args": {"text": "\"Here's something interesting from The Unz Review... Recipient Name Recipient Email => \\nAfter posting Friday’s column, “A Presidency from Hell,” about the investigations a President Hillary Clinton would face, by afternoon it was clear I had understated the gravity of the situation. \\nNetworks exploded with news that FBI Director James Comey had informed Congress he was reopening the investigation into Clinton’s email scandal, which he had said in July had been concluded. \\n“Bombshell” declared Carl Bernstein. The stock market tumbled. “October surprise!” came the cry. \\nThe only explanation, it seemed, was that the FBI had uncovered new information that could lead to a possible indictment of the former secretary of state, who by then could be the president of the United States. \\nBy Sunday, we knew the source of the eruption. \\nHuma Abedin, Clinton’s top aide, sent thousands of emails to the private laptop she shared with husband Anthony Weiner, a.k.a. Carlos Danger, who is under FBI investigation for allegedly sexting with a 15-year-old girl. \\nThe Weiner-Abedin laptop contains 650,000 emails. \\nThe FBI has not yet reviewed Abedin’s emails, and they could turn out to be duplicates of those the FBI has already seen, benign, or not relevant to the investigation of Clinton. \\nBut it does appear that Abedin misled the FBI when she told them all communications devices containing State Department work product were turned over to State when she departed in 2013. \\nClinton, understandably, was stunned and outraged by Comey’s letter. For it casts a cloud of suspicion over her candidacy by raising the possibility that the FBI director could reverse his decision of July, and recommend her prosecution. \\nBy Monday, Oct. 31, new problems had arisen, some potentially crippling or possibly lethal to a Clinton presidency. \\nReporters have unearthed a near-mutiny inside the FBI over the decision to shut down the investigation of the Clinton email scandal and Comey’s recommendation of no prosecution. \\nAndrew McCabe, No. 2 at the FBI, has come under anonymous fire from inside the bureau as one of those most reluctant to pursue aggressively any investigations of the Clintons. \\nMcCabe’s wife, in a 2015 state senate race in Virginia, received $475,000 in PAC contributions from Virginia Gov. Terry McAuliffe, a longtime friend and major fundraiser for Bill and Hillary Clinton. \\nAfter the Senate race that McCabe’s wife lost, he was promoted from No. 3 at the FBI to No. 2, where he has far more influence over decisions to investigate and recommend prosecution. \\nJustice Department higher-ups under Attorney General Loretta Lynch apparently disagreed with Comey notifying Congress, and the nation, to new developments in the email scandal. Yet Comey had given his word to Congress that he would do so. \\nIn the Southern District of New York, which has jurisdiction over the Weiner sexting investigation, FBI agents have reportedly been blocked from opening an investigation into charges of corruption in the Clinton Foundation. \\nThis follows revelations that corporate chiefs and foreign rulers and regimes, hit up for contributions to the Clinton Foundation, were then urged by an ex-Clinton aide to provide six-figure speaking fees for Bill Clinton. \\nThis follows reports the Clinton Foundation took contributions for victims of natural disasters, and awarded multimillion-dollar contracts to contributors to do the work. \\nStill unanswered is what Bill Clinton and Attorney General Lynch discussed during that 30-minute meeting on the Phoenix tarmac, prior to the FBI and Justice Department decision not to indict Hillary Clinton. \\nThe stench of corruption is reaching Bhopal dimensions. \\nWhat appears about to happen seems inevitable and predictable. \\nIf Hillary Clinton is elected, the email scandal, the pay-for-play scandal involving the Clinton Foundation, “Bill Clinton, Inc.,” the truthfulness of her testimony, and reports of Clinton-paid dirty tricksters engaging in brownshirt tactics at Trump rallies, are all going to be investigated more thoroughly by the FBI. \\nAnd if Clinton is president, there is no way her Justice Department can investigate the Clinton scandals, any more than this city in the early 1970s would entrust an investigation into Watergate to the Nixon Justice Department. \\nIf Clinton wins this election, and Republicans hold onto one or both houses of Congress, investigations of the Clinton scandals will start soon after her inaugural and will go on for years. And the clamor for a special prosecutor, who will, as Archibald Cox did with Nixon, build a huge staff and spend years investigating, will become irresistible. \\nRealizing that this is the near-certain fate and future of any Hillary Clinton presidency, and would be disastrous for the country, Sunday night, Doug Schoen, who worked for President Clinton for six years, said he has changed his mind and will not be voting for Hillary. \\nDonald Trump says this is worse than Watergate. As of now, it is only potentially so. \\nBut if Hillary Clinton, this distrusted and disbelieved woman, does take the oath of office on Jan. 20, there is a real possibility that, like Nixon, down the road a year or two, she could be forced from office. \\nDo we really want to go through this again? \\nPatrick J. Buchanan is the author of the new book “The Greatest Comeback: How Richard Nixon Rose From Defeat to Create the New Majority.” \\nCopyright 2016 Creators.com.\""}, "time": 1742561799.1948252}