{"duration": 0.29012107849121094, "input_args": {"text": "'Leave a reply \\nSteve Taylor, Ph.D – From the standpoint of ordinary consciousness, separateness seems to be a basic part of the human condition. Most human beings experience themselves as egos trapped inside their own mind-space, observing a world which seems to be out there, on the other side of their skulls. As a result, the normal human state is one of aloneness. We’re always onlookers rather than participants. We can communicate with other people by speaking, writing or gesturing, but they will never be able to truly know us, or to share our thoughts and feelings. Our inner being will always be sealed off from them. \\nEgo-separation also creates a sense of incompleteness. Because we’re separate from the world, we’re like fragments which have broken off from the whole, and so feel a sense of insufficiency. There s a kind of hole inside us which we spend most of our lives trying to fill (but very rarely manage to), like cats who were taken away from their mother at birth and who are always hankering for affection and attention to try to compensate for a sense of lack. Born-again Christians mean something close to this when they say that there is a god-shaped hole inside us although in my view traditional religion can’t fill the hole either, only provide the same (ultimately incomplete) consolation as wealth or success. \\nAs a result of this aloneness and incompleteness, we don’t feel completely at home in the world. We’re not completely rooted here, and so feel somehow adrift, as if we don’t fully belong, like people who have travelled around the world so much that they no longer feel at home anywhere. Whereas traditional indigenous peoples seem to perceive the world as a benign and benevolent place, to us it seems indifferent and even vaguely malevolent. \\nIn addition, our ego-isolation generates a basic sense of insecurity and insignificance. Our own ego is so tiny and so flimsy in the face of the enormous world out there , like a tiny wooden beach shack at the edge of a vast ocean. We feel dwarfed by the sheer weight of the phenomena and events taking place out there . How can we possibly have any significance in relation to them? How can this fragile entity inside our heads stand up to the might of the world? The Wider Effects of Separateness \\nHowever, the effects of this separateness reach far beyond the individual. In fact, I would go so far as to say that the sense of separateness is the root cause of the constant conflict, warfare and oppression which have blighted human history. The human sense of incompleteness generates a craving for possessions, power and status, as a way of trying to complete ourselves and compensate for our inner discord. We try to complete ourselves – and make ourselves significant – by gaining power over other people or by collecting wealth and possessions. \\nThis desire for wealth and power is the root cause of warfare and oppression too, coupled with the reduced empathy which separateness causes. The separate self walls us off from other human beings, makes it difficult for us to ‘feel with’ them and to experience the world from their perspective. This makes it possible for us to be violent and cruel to other people, since we can’t sense the suffering we cause them. So we oppress and exploit them in the service of our own desires oppress women, members of lower classes or castes, different races, so that we can gain more power, status and wealth. \\nThe sense of separateness is also the root cause of our abuse of the environment. It means that we experience a sense of ‘otherness’ to nature, and that we can’t sense its aliveness, and as a result we don’t feel any qualms about exploiting and abusing it. Why Separateness? \\nI wouldn’t exactly say that separateness is an illusion, as many non-duality teachers would. Not an illusion but an aberration – something which exists but shouldn’t. Children don’t experience separateness; they exist in a state of natural relatedness to the world. This is one of the reasons why childhood is so wonderful because the child feels connected to everything around them, in a participatory flow with all experience, with no in here or out there. \\nThere are also many other peoples in the world who even as adults don’t exist in a state of separateness. Most of the world s indigenous peoples don’t see themselves as separate to their environment. They feel a strong sense of connection to nature, an awareness that they are a part of the web of creation (and one which is no more important than any other). \\nAs Tim Ingold writes of the Batek Negritos of Malaysia, for example, They see themselves as involved in an intimate relationship of interdependence with the plants, animals and hala [spirits] (including the deities) which inhabit their world. Or as the Cherokee Indian scholar Rebecca Adamson points out, for indigenous peoples the environment is perceived as a sensate, conscious entity suffused with spiritual powers through which the human understanding is only realised in perfect humility before the sacred whole. The Hopi use the term Novoitti for the concept of living in harmony with nature, while the Tlingit (also of North America) call it Shogan. \\nThe anthropologist Lucien Levy-Bruhl believed that essential characteristic of native peoples was that the limits of their individuality are variable and ill-defined. He noted that, rather than existing as self-sufficient individual entities, indigenous peoples sense of identity was bound up with their community and their land. He cites reports of native peoples who used the word I when speaking of their group and others who see their land as an extension of their self, so that being forced away from their land would be tantamount to death. (This is why native peoples are often prepared to commit suicide rather than leave their lands.) \\nThe naming practices of certain peoples suggest this too. For us, a name is a permanent label which defines our individuality and autonomy. But Australian Aborigines, for example, do not have fixed names which they keep throughout their lives. Their names regularly change, and include those of other members of their tribe. Other native peoples use tekonyms terms which describe the relationship between two people instead of personal or kinship names. \\nThe sense of separateness seems to be a quirk of our psychological development. For us, it slowly develops as we move into adolescence, becoming firmly established in our late teens. The ego develops as a structure, creating a sense of inner-ness and walling us off. \\nWitness the massive change which occurs when a child enters adolescence. Especially with boys, the freshness and joy of childhood gives way to dullness and confusion. After being a part of the glorious flow of experience, we’re suddenly outside the world, alone inside our own mental space. This is why adolescents have such a strong need for belonging. \\nTheir new sense of separation makes them feel so vulnerable that they need to reinforce their identity by being a part of groups or gangs, or by following fashions. More bleakly, this is also why most murders are committed by young men, in response to perceived slights or insults. With their new fragile sense of identity, young men are liable to take offence at any kind of trivial affront, making them feel belittled and creating an instant desire to take revenge and regain their lost status. \\nI remember this transition clearly from my own adolescence. After a carefree childhood, I suddenly felt locked inside myself, alone with thoughts and feelings which no one else would ever be able to experience. Along with that, I felt an acute self-consciousness. I was aware of every movement I made and every word I spoke, so that I couldn’t do anything naturally anymore. I felt exposed when I walked down the street, aware that people could have been looking at me from their windows. \\nAs they grow into adulthood, most people deal with the fragility and vulnerability of the self by taking on roles and attachments. They take on the roles of their jobs, attach themselves to certain beliefs strengthening their identity with labels such as socialists, atheists or muslims or attach themselves to ambitions, to knowledge they’ve accumulated, to their self-image as important or powerful people, or emotionally attach themselves to other people These roles and attachments become the scaffolding of the ego, propping it up and at the same time, they reinforce separation, making the individual walled off. Awakening From the Sleep of Separateness \\nHowever, no matter how far into separateness we fall, in a sense it’s never more than superficial. No matter how strong the ego becomes, it’s never more than a construct. Everyone experiences moments when separateness temporarily fades, and we become part of the unity again. These are what I refer to as awakening experiences. They frequently occur when we’re walking amongst natural surroundings, when we’re dancing or running, during or after sex, listening to or playing music. In these situations, the normal chattering of the ego which is the normal fuel of the ego, maintaining it as a structure becomes quiet, leading to a softening of its boundaries. Separateness dissolves and we’re afloat on the ocean of Being again, immersed in the glorious is-ness and aliveness of the world. \\nTellingly, in these moments there is always an identity shift. We feel that we’ve become someone else, a deeper, more grounded self which seems more authentically you. The ego-self we identified with before seems like an imposter, a limited and shallow trickster who somehow deluded us into thinking it was our identity. \\nThere are also many cases of extreme loss or intense turmoil, when all of the ego’s building blocks its roles and attachments are broken away. A person might be diagnosed with cancer and told they only have a few months left to live; an alcoholic might reach rock bottom and be on the point of suicide; a person might become seriously disabled through injury or illness; or they might suffer from the trauma of bereavement, depression, the destruction of hopes and beliefs, and so on. In most cases, these forms of loss simply bring sadness and suffering, but for a minority of individuals, they can trigger a spiritual awakening. With all its scaffolding broken down, the normal ego-self dissolves away, and our deeper, truer self emerges in its place, like a butterfly from a caterpillar. The person feels re-born, like a different person inhabiting the same body, with a new sense of meaning and connection. \\nIn all of these experiences, there is a sense of coming home, back to our original oneness, the harmony which both as an individual and as a species we fell away from. It was always there it is always here. It’s just that our separate selves deluded us into thinking we were asleep. \\nSteve Taylor holds a Ph.D in Transpersonal Psychology and is a senior lecturer in Psychology at Leeds Beckett University, UK. For the last five years Steve has been included in Mind, Body, Spirit magazine’s list of the ‘ 100 most spiritually influential living people ’. Connect with Steve at and Facebook.com/SteveTaylorAuthor . SF Source Wake Up World Nov. 2016'"}, "time": 1742564610.6835082}