{"duration": 1.6375007629394531, "input_args": {"text": "'November 25, 2016 - Fort Russ News - \\n-  Christelle NEAN  in DONiPRESS, translated by Tom Winter - \\nСПАСИБО! Thank you! \\nDonetsk 25 Nov 2016 The program of the third day of visit of the French group was totally turned around by the always moving news of the Donbass. That was the day of the funeral commemoration of Commander Motorola, murdered three days earlier during a bomb attack in the elevator of his building.  \\n\\nOur visitors took part in this moving ceremony, placing flowers near his coffin, and joining the people gathered in the center of Donetsk to bid farewell to one of the most emblematic and well-known commanders of the People\\'s Republic of Donetsk (RPD). \\n\\n\\n\\nThey saw with their own eyes the incredible number of ordinary citizens who came to pay homage to this hero of the republic. The first approximate figures of 30,000 people were adjusted later to at least 50,000 people who were there to bid farewell and show their attachment to this commander who had come to help the people of Donbass to defend their freedom. \\n\\nBillboards were installed in the city center with the photo of Commander Motorola and the phrase \"Heroes do not die.\" It was only proper that we go immediately after the funeral to the high place of commemoration of the heroes fallen for the defense of freedom: the hill of Saur Mogila. What better place than this height, twice the subject of intense fighting, and twice retaken at great cost by soldiers defending freedom, to ponder on all those who have, like Commander Motorola, sacrificed their lives for this ideal? \\n\\nThe memorial is no more than a field of ruins, yet several times a year people come here by thousands to celebrate, for example, the Liberation of the Donbass in 1943 or the Victory Ceremonies of 1945. The tombs both at the foot and at top of the hill are there to remind that during the present war, again, the defenders of the Donbass have paid a heavy price for this freedom that they cherish so much. \\n\\n\\n\"It\\'s here in the Donbass that they are fighting for freedom, and in the West they\\'re called terrorists,\" Roxane said. \\n\\nThe people of Donbass, like the people of Russia, cultivate and maintain their memory and their history, so that the errors of the past can no longer be repeated. Follow us for the interview of Antoine and Roxane at the end of this day full of emotions, with their comments on the soul of the Donbass, who are the real terrorists in this war, the support of the Donbass population towards their army, and what their journey has already brought them at the end of these three days: \\n\\n\\n   \\n   Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742564533.5448022}