{"duration": 0.0650186538696289, "input_args": {"text": "'‘Conspiracy Theorists’ Believe They’ve Found Justice Scalia’s MURDER Plot Posted on October 27, 2016 by Dawn Parabellum in Politics Share This \\nIt’s troubling to uncover the dirty secrets in the emails leaked from John Podesta, Hillary Clinton’s campaign chairman, and it just keeps getting worse. Since the mainstream media refuses to do it, many “conspiracy theorists” are investigating for themselves, and internet sleuths believe they’ve uncovered the murder plot of Supreme Court Justice Antonin Scalia. Unsurprisingly, the Clintons may have even more blood on their hands. Supreme Court Justice, Antonin Scalia. \\nThe evidence does look damning. In the email, where coded language and a disjointed writing technique was used, Podesta is offered a “script” to a “movie.” However, that’s the only normal part of this email. \\nThe script writer of the movie is asking Podesta to fund the film, which right away makes the exchange odd since the movie isn’t political and Podesta is Hillary Clinton’s campaign manager, not a movie investor. It seems even more strange once the plot of the movie is revealed in the emails as well. What’s worse, this is not the first email thought to be about the assassination of Antonin Scalia, but I digress. \\nThe movie is about a “Mexican” girl on a journey to find her mother. She crosses paths with a man named Alex who assists her on her journey. They end up at an isolated ranch house with a massive underground tunnel in Tecate, California. There is a Smithsonian map included in a link, which has a line pointing to the “setting” of the film, as seen below. Map included in the Podesta emails showing the “setting” of the “movie” \\nThe map seems inconspicuous enough until it was realized that the pointer of the map is showing the exact location of the Cibolo Ranch where Antonin Scalia died. Below is a Google map showing the location of the Cibolo Ranch. Google map depicting the location of the Cibolo Ranch \\nThe maps were enough to draw the attention of internet sleuths. Digging deeper, they have uncovered more in the same email discussing the details of this “movie,” and honestly, it doesn’t feel right. The entire script of the “movie” can be read in the leaked emails , but one part stands out in addition to connecting the dots with the maps. Ronald Reagan is discussed for some strange reason \\nIt’s difficult to imagine what President Ronald Reagan has to do with a movie about a Mexican woman’s journey, other than the fact that Antonin Scalia was a Reagan appointee. However, it gets a little more creepy further down the slightly discombobulated email. A portion of the lengthy email conspiracy theorists believe details the murder plot of Antonin Scalia \\nHis five “film projects” aren’t detailed. All he says are “two are political, one is spiritual, and two are just for fun.” Conspiracy theorists believe this is a list of his assassinations and the best way to describe who has been killed and why. \\nCould this all be an elaborate movie and the email sender a poor writer? That seems unlikely, considering he’s claiming to have written an entire script. But, could conspiracy theorists have jumped the gun? That’s also possible. \\nThere’s still no absolute proof that this is the murder plot of Supreme Court Justice Antonin Scalia, but with just over one week left until the nation decides who will be the president and Wikileaks still having many more John Podesta emails to release, it’s possible we may see more about this “movie” if that’s what was really being discussed.'"}, "time": 1742562651.1194518}