{"duration": 0.024637937545776367, "input_args": {"text": "'Google could be facing a $9 billion fine from the European Union (EU) following a   investigation into the search engine. [“The EU competition authority accused Google in April 2015 of distorting internet search results to favour its shopping service, harming both rivals and consumers,” reported the Independent on Friday. “The US company has in the past rejected the charges, saying that regulators ignored competition from online retailers Amazon and eBay. ”  The Independent continued to claim in their report that “Fines for companies found guilty of breaching EU antitrust rules can reach 10 per cent of their global turnover, which in Google’s case could be about $9bn of its 2016 turnover. ” “Apart from the fine, the Commission will tell Google to stop its alleged   practices but it is not clear what measures it will order the company to adopt to ensure that rivals get equal treatment in internet shopping results,” they explained. “The regulator could set out general principles or specific instructions for Google to follow, said an observer. ” Google has previously been accused of rigging and changing their search results in their favor, most notably during the 2016 U. S. Presidential Election. Autofill suggestions about Democratic presidential candidate Hillary Clinton’s health were censored, despite the popularity in searches, as well as other search suggestions which conveyed negative messages about Clinton, including “Crooked Hillary. ” During an investigation, users discovered that every other popular search engine featured these popular search suggestions apart from Google, who were major backers of Clinton’s campaign. Last year, WikiLeaks founder and editor Julian Assange claimed that Google was “directly engaged in Hillary Clinton’s campaign,” Negative search suggestions about other candidates, including Bernie Sanders, Donald Trump, and Ted Cruz were not similarly censored. In September, Google was also accused of manipulating the search results for “Jihad” to promote a post from the Islamic Supreme Council defending Jihad as a “misunderstood concept,” while in April the search engine announced that they would be further manipulating results to combat “fake news” and “hate speech. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742561718.0826342}