{"duration": 0.08401679992675781, "input_args": {"text": "'The   photographs of the mutilated body of Emmett Till, the teenager who was lynched by two white men in Mississippi in 1955, served as a catalyst for the civil rights movement and have remained an open wound in American society since they were first published in Jet magazine and The Chicago Defender at the urging of Till’s mother. The images’ continuing power, more than 60 years later, to speak about race and violence is being demonstrated once again in protests that have arisen online and at the newly opened Whitney Biennial over the decision of a white artist, Dana Schutz, to make a painting based on the photographs. An   artist, Parker Bright, has conducted peaceful protests in front of the painting since Friday, positioning himself, sometimes with a few other protesters, in front of the work to partly block its view. He has engaged museum visitors in discussions about the painting while wearing a   with the words “Black Death Spectacle” on the back. Another protester, Hannah Black, a   black artist and writer working in Berlin, has written a letter to the biennial’s curators, Mia Locks and Christopher Y. Lew, urging that the painting be not only removed from the show but also destroyed. “The subject matter is not Schutz’s,” Ms. Black wrote in a Facebook message that has been signed by more than 30 other artists she identifies as nonwhite. “White free speech and white creative freedom have been founded on the constraint of others, and are not natural rights. The painting must go. ” She added that “contemporary art is a fundamentally white supremacist institution despite all our nice friends. ” The protest has found traction on Twitter, where some commenters have called for destruction of the painting and others have focused on what they view as an   attempt by Ms. Schutz to aestheticize an atrocity. Mr. Bright, in a Facebook Live video of his protest, makes some of the same points in objecting to the painting’s inclusion in the show. The biennial is an unusually diverse exhibition of work by 63 artists and collectives nearly half the artists are female and half are nonwhite. Calling the painting “a mockery” and “an injustice to the black community,” Mr. Bright adds that he believes the work perpetuates “the same kind of violence that was enacted” on Till “just to make a painting move. ” “I feel like she doesn’t have the privilege to speak for black people as a whole or for Emmett Till’s family,” Mr. Bright says in the video. He also objects to the thought that the painting could be sold and make Ms. Schutz, whose work is highly sought after, a significant amount of money. Ms. Schutz, who first exhibited the painting last year in a gallery in Berlin, has stated that she intends never to sell the work. In a statement on Tuesday, Ms. Schutz said: “I don’t know what it is like to be black in America but I do know what it is like to be a mother. Emmett was Mamie Till’s only son. The thought of anything happening to your child is beyond comprehension. Their pain is your pain. My engagement with this image was through empathy with his mother. ” She added: “Art can be a space for empathy, a vehicle for connection. I don’t believe that people can ever really know what it is like to be someone else (I will never know the fear that black parents may have) but neither are we all completely unknowable. ” The curators said that they wanted to include the painting because many of the exhibition’s artists focus on violence  —   racial, economic, cultural  —   and they felt that the work raised important questions, especially now, in a political climate in which race, power and privilege have become ever more urgent issues. “For us it was so much about an issue that extends across race,” said Mr. Lew, who along with his   Ms. Locks, met with Mr. Bright on Tuesday to discuss his protest. “Yes, it’s mostly black men who are being killed, but in a larger sense this is an American problem. ” Ms. Locks said: “Right now I think there are a lot of sensitivities not just to race but to questions of identities in general. We welcome these responses. We invited these conversations intentionally in the way that we thought about the show. ” She added that she felt the painting was a means of “not letting Till’s death be forgotten, as Mamie, his mother so wanted. ” The story of Till’s murder has begun to resonate loudly again in recent months. News recently emerged that the Mississippi woman who said that the    Till whistled at her and was verbally and physically aggressive  —   an account that led to Till’s abduction, torture and killing  —   told a historian in 2007 that she had made up the most sensational part of her account. The Black Lives Matter movement and greater awareness of the killing of black men by the police have led to efforts to film the Till story, with at least three screen adaptations in production.'"}, "time": 1742562057.3799539}