{"duration": 0.03943037986755371, "input_args": {"text": "'0 comments Can this really be happening? Michelle Obama has been campaigning for Hillary Clinton for some time. She touts Hillary’s accomplishments while denouncing Donald Trump as a misogynist and all-around scumbag. Just five days ago, the First Lady Of The United States and Hillary Clinton appeared together on stage in Winston-Salem, North Carolina. They held hands, they worked the crowd. Michelle presented a rousing statement: â\\x80\\x9cThere are some folks out there who are commenting that it is unprecedented for a sitting first lady to be so actively engaged in a presidential campaign, and that may be true,â\\x80\\x9d said Mrs. Obama, a reluctant campaigner who has nevertheless emerged in recent weeks as Mrs. Clintonâ\\x80\\x99s most compelling surrogate. â\\x80\\x9cBut what is also true is that this is truly an unprecedented election, and thatâ\\x80\\x99s why Iâ\\x80\\x99m out here,â\\x80\\x9d Mrs. Obama added, arguing that Donald J. Trump, the Republican nominee, was working to discourage people in the crowd from voting by making â\\x80\\x9cthis election so dirty and ugly that we donâ\\x80\\x99t want any part of it.â\\x80\\x9d What a difference a few days makes. Only a few moments ago, Michelle Obama made an earth shattering move on Twitter. Multiple outlets are reporting that Michelle deleted all references of Hillary from her Twitter feed, and all Tweets from the last three years. Yesterday @donnabrazile removed picture of Hilary from her profile. Today @FLOTUS and @MichelleObama removed all tweets mentioning Hillary. pic.twitter.com/e8Ebc53tlu \\nâ\\x80\\x94 DJ Weiner đ\\x9f\\x87şđ\\x9f\\x87¸ (@jeitoapp) November 1, 2016 \\n5.5 million followers and no longer a mention of Hillary Clinton? \\nAre Michelle Obama and the Democrats distancing themselves from the embattled Democrat nominee? \\nIt sure looks like it. \\nRemaining close to Hillary Clinton, with 650,000 insider emails reported to be exposed seems to be risky business. \\nLet’s not forget: WikiLeaks and Anonymous have not weighed in yet in they blockbuster ways that they have promised. \\nOf course, it could be a technical error or coincidence. \\nAfter all, Democrats are good at deleting things.'"}, "time": 1742561701.0896406}