{"duration": 0.12787938117980957, "input_args": {"text": "'The tweets started around 3:20 a. m. on Friday. Inside Trump Tower, a restless figure stirred in the predawn darkness, nursing his grievances and grabbing a device that often lands him in hot water. On his Android phone, Donald J. Trump began to tap out bursts of digital fury: He mocked Alicia Machado, a former Miss Universe and a popular Latin American actress, as a “con,” the “worst” and “disgusting. ” In a final flourish, before the sun came up, the Republican presidential nominee claimed  —   without offering any evidence  —   that she had appeared in a “sex tape. ” The tirade fit a pattern. It is when Mr. Trump is alone with his thoughts, and untethered from his campaign staff, that he has seemed to commit his most   acts. “There has always been this dangerous part of him that will go too far and do something that backfires,” said Michael D’Antonio, the author of “The Truth About Trump,” a new biography of the real estate mogul. “His worst impulses,” he added, “are  . ” Over the past few days, those instincts have been on vivid display. In quick succession, Mr. Trump has repeated his critique that Ms. Machado gained a “massive amount of weight” after she won the Miss Universe crown in 1996 suggested that former President Bill Clinton’s infidelities are fair game for campaign attacks and urged his followers to “check out” a sex tape that may not exist. (Ms. Machado appeared in a risqué scene on a reality television show, but   have discovered no sex tape.) The eruptions could further damage Mr. Trump’s reputation with women and Latino voters at a time when he can scarcely afford to alienate either group, five and a half weeks before Election Day. Yet for close students of Mr. Trump’s career and campaign, it all has a familiar ring. Over the years, he has issued a stream of needlessly cruel and seemingly    insults  —   both on and off social media  —   that have inflamed the public. He declared on Twitter that Kim Novak, a reclusive    actress at the time, “should sue her plastic surgeon,” sending her into hiding. He derided the appearance of a rival, Carly Fiorina, angering female voters by asking: “Can you imagine that, the face of our next president?” And he criticized the mother of a slain American soldier, musing that as a Muslim woman, she was not “allowed” to speak. Such fulminations have almost always arisen from Mr. Trump’s wounded pride, after he has been attacked or has suffered a setback. And they have frequently played out on Twitter, at hours of the day when much of America is asleep. The   tweets about Ms. Machado were a reminder, said the Republican strategist Charles Black, that Mr. Trump “cannot let something drop until he proves he’s right, and it’s beside the point who’s right. ” Around midnight one night during the primary campaign, he posted an unflattering photo of Heidi Cruz, the wife of a Republican rival, Senator Ted Cruz of Texas. Early one morning, he alleged a sexual affair between two   television anchors who had criticized him. Early one Saturday, he distributed an image of Mrs. Clinton, surrounded by falling cash and a   star that many said was a Star of David and was  . And at 11 one evening, he shared a digitally altered image of Jeb Bush appearing to pick his nose. “Late night   Donald is back at it!” an aide to Mr. Bush replied at the time. On Friday, Mr. Trump was at it again between 3:20 and 5:30 a. m. issuing a series of indignant messages that mocked Ms. Machado and Mrs. Clinton, who raised the experience of the former beauty queen to hurt Mr. Trump during the debate. Mrs. Clinton, he wrote, “was duped and used by my worst Miss U. Hillary floated her as an ‘angel’ without checking her past, which is terrible!” A few minutes later, Mr. Trump theorized  —   again, without offering any evidence  —   that Mrs. Clinton had helped Ms. Machado become a United States citizen so that the Democratic nominee could mention the beauty queen in the debate to hurt Mr. Trump. Mr. Trump, in an interview on Friday afternoon, said he remained proud of his tweets. “Why would I have regrets? I’m a very truthful person, and I’m telling the truth. Now people understand it. And before the tweets, people didn’t understand it. ” It is unusual for a major party presidential nominee to directly control any online communications, let alone issue provocative, unsubstantiated claims without the filter of a campaign aide. But Mr. Trump is fixated on Twitter. He has nearly 12 million followers and has reveled in watching his stray thoughts become viral sensations on the social media platform. He has been fond of quoting a fan on Twitter, who described him as “the Ernest Hemingway of a hundred and forty characters. ” So like a car careening down a highway with no guardrails, Mr. Trump on Friday sent out one message after another. His suggestion of a sex tape featuring Ms. Machado sent his most zealous followers hunting for images. A few of them posted pornographic images of women who they believe resembled Ms. Machado. Ms. Machado on Friday called Mr. Trump’s online assault “cheap lies with bad intentions” and said that she would not be intimidated. Aides to Mrs. Clinton, who have long warned of his reckless ways on Twitter, said Mr. Trump’s behavior had once again bolstered their argument that he is mentally unfit for the presidency. “I mean, his latest Twitter meltdown is unhinged, even for him,” Mrs. Clinton said on Friday. “Really, who gets up at 3 o’clock in the morning to engage in a Twitter attack against a former Miss Universe?” she asked. Many wondered aloud on Friday whether Mr. Trump’s erratic   behavior is the result of disorienting insomnia, since he regularly boasts of needing only a few hours of sleep. But Mr. Trump quickly rejected that theory. “For those few people knocking me for tweeting at three o’clock in the morning, at least you know I will be there, awake, to answer the call!” Mr. Trump wrote on Twitter. Not everyone in his life seems so sure. Asked this year which habit she wished her husband would quit, Melania Trump gave a   answer: tweeting.'"}, "time": 1742564615.9482222}