{"duration": 0.04709577560424805, "input_args": {"text": "'Posted on November 2, 2016 by Dr. Eowyn | 14 Comments \\nDemocrat support for Hillary Clinton seems to be wavering in the wake of the FBI re-opening its criminal investigation into then-Secretary of State Hillary Clinton’s unlawful use of an unsecured private email server. The FBI’s decision, announced just last Friday, was provoked by the federal agency stumbling across 650,000 emails on a laptop shared by Hillary aide Huma Abedin with her now-estranged husband, the sexual pervert Anthony Weiner. \\nAs many experts have noted, only something very serious in the new emails — even more serious than what we already know about Hillary’s email thus far — could have prompted the FBI to re-open its investigation. (1) Doug Shoen \\nA big-name Democrat has abandoned Hillary’s sinking ship. \\nHe is Doug Shoen — Fox News contributor; former Democrat pollster/consultant for over 30 years, who is widely recognized as a co-inventor of overnight polling, whose clients included including British PM Tony Blair, Italian PM Silvio Berlusconi, and three Israeli PMs; and a friend of the Clintons since 1994. \\nOn Sunday night, Oct. 30, two days after FBI Director James Comey announced the reopening of the criminal investigation in a letter to Congress, Schoen told Fox News’ Harris Faulkner that he is “reassessing” his support for Hillary, although that doesn’t mean he’s a Trump supporter. \\nHere’s a partial transcript of what Schoen said by Real Clear Politics : \\nDOUG SCHOEN: As you know, I have been a supporter of Secretary Clinton… But given that this investigation is going to go on for many months after the election … But if the Secretary of State wins, we will have a president under criminal investigation, with Huma Abedin under criminal investigation, with the Secretary of State, the president-elect, should she win under investigation. Harris, under these circumstances, I am actively reassessing my support. I’m not a Trump — \\nHARRIS FAULKNER, FOX NEWS: Whoa, whoa, wait a minute. You are not going to vote for Hillary Clinton? \\nSCHOEN: Harris, I’m deeply concerned that we’ll have a constitutional crisis if she’s elected. \\nFAULKNER: Wow! \\nSCHOEN: I want to learn more this week. See what we see. But as of today, I am not a supporter of the Secretary of State for the nation’s highest office. \\nFAULKNER: How long have you known the clintons. \\nSCHOEN: I’ve known the clintons since ’94. \\nFAULKNER: Wow! But their friend here has said he’s reconsidering. \\nSCHOEN: I have to, because of the impact on the governance of the country and our international situation. \\nFAULKNER: So the news in that is are there other people, I would imagine, like Doug Schoen. (2) Chris Matthews? \\nMuch is made of a video clip of Chris Matthews, infamous for his near-orgasmic exclamation during the 2008 Democratic National Convention that listening to Barack Obama sent a thrill up his leg . Matthews has been a relentless promoter of Hillary, fawning over her performance in the first presidential debate against Trump as a “brilliant”“home run”, and declaring the race for the presidency as “over”. \\nOn October 27, 2016, Matthews seemed to be endorsing Trump on his MSNBC Hardball show: \\nAlas, that video clip is misleading. \\nA fuller version of what Matthews said shows that Matthews was simply quoting Trump. In actuality, far from endorsing Trump, Matthews scolded Trump for getting sidetracked on petty issues/feuds, and called Trump’s practice of politics “pathetic”. See the fuller video here . (3) Polls \\nA more important indicator of the fallout from the FBI’s reopening of its criminal investigation into Hillary are the polls. \\nThe latest USC Dornsife/ Los Angeles Times “Daybreak” poll shows that support for Hillary has plummeted after the third and last presidential debate. Trump is now more than 5 points ahead of Hillary, polling at 47.8% vs. Hillary’s 42.4%. Click image ↓ to enlarge \\nDespite the increased support for Trump, when asked who they think will win the presidential election, 54.2% think Hillary will win, vs. 41.3% who think Trump will win. \\nBroken down into demographic groups, however, the LA Times poll shows that Hillary still has a lead among these unregenerate groups : Among those with a college graduate or more education , Hillary still leads at 51.2% vs. Trump’s 38.1%. Among low-income voters (those with less than $35,000 a year in income) who polls show are also the least informed, with the least exposure to Alternate Media, Hillary leads at 53.4% vs. Trump’s 35.6%. Among blacks , Hillary leads at 86.7% vs. Trump’s 4.6%; among Latinos , Hillary leads at 53.1% vs. Trump’s 34.9%. In contrast, among whites, Trump leads at 58.1% vs. Hillary’s 32.2%; among “other” racial-ethnic groups, Trump leads at 49.9% vs. Hillary’s 40.7%. Among females , Hillary still leads at 49.4% vs. Trump’s 40.7%. In contrast, among men, Trump leads at 55.1% vs. Hillary’s 36.3%.'"}, "time": 1742628480.8275287}