{"duration": 0.19198107719421387, "input_args": {"text": "'  Miranda’s final bows for his farewell performance in “Hamilton” on Saturday night seemed routine, if overly humble for the departure of the show’s star and mastermind. He even shared his bows with the other cast members also exiting the show, including Phillipa Soo and the Tony winner Leslie Odom Jr. But then the theme song to “The West Wing” kicked in from the orchestra pit. Mr. Miranda giggled and took a couple of shy bows, only to turn around and be embraced then pushed back to the front of the stage by Christopher Jackson, who plays George Washington, for a proper bow. Still, the curtain call lasted no more than two and a half minutes, despite fervent applause, which had been consistent throughout the night. The opening number received multiple standing ovations, as did many others. But Mr. Miranda and other performers would pause for only a minute each time before moving the show forward. Afterward, in the pouring rain, hundreds and hundreds of fans filled West 46th Street, waiting for Mr. Miranda to emerge from the stage door at the Richard Rodgers Theater. Instead, Mr. Miranda appeared, “Evita”  on a balcony atop the theater’s marquee. Holding an umbrella and waving to fans, he paced from one side of the marquee to the other, occasionally stopping to hold his left hand over his heart to show gratitude. Then he was gone. “It’s over, folks,” a police officer yelled as he tried to keep the crowd out of the street. “There’s no more. ” Despite the rain, many people were reluctant to leave, greeting other cast members at the stage door and holding out for another possible appearance by Mr. Miranda. Inside, he had gotten his hair cut, now that he no longer needed it long for the role. Fans had begun to wait for him much earlier in the day. An hour before the 8 p. m. curtain, hundreds of people flanked the stage door to watch cast members and V. I. P.s come and go, and others stood across the street. Many didn’t even have tickets. “Hamilton” merchandise abounded:   posters and even a woman’s clutch that read “Talk Less,” the advice Aaron Burr gives Hamilton throughout the show. Around 7:10 p. m. Ms. Soo  —   who plays Hamilton’s wife, Eliza  —   entered through the stage door, escorted by her fiancé, the actor Steven Pasquale. He later walked out and approached a police officer, Mike Sullivan, who was standing near the box office and has been assigned to the theater’s block for six years. “Thank you for everything,” Mr. Pasquale said to him. Mr. Sullivan shook his hand, smiled and said, “Of course. ” Nearby, at the front of the   line, was a family of four from Florida. They had bought their tickets in February when their daughters, Katie and Sarah Lafferty, fell in love with the cast recording. And their father, Mike, expected the show to be good, he said, because “the first lady says it’s the best art she’s ever seen in her life. ” So Mr. Lafferty looked ahead at a   block of tickets. This weekend just happened to be the cheapest option. Not so much for recent ticket buyers. Clara Lacey, a    from Los Angeles, flew to New York to see Mr. Miranda’s final performance, and her family bought her a single ticket just a few hours before the show. They paid about $1, 500. Once the house opened at 7:30 p. m. winners of the “Hamilton” ticket lottery  —   a small number of coveted $10 seats are distributed through an online system  —   could claim their prizes. Among them were a young actress, Haleigh Ciel, and her friend Byron Chang. Like many of the other winners, they were excited to have finally won and gotten a chance to see Broadway’s hottest show. But they had no idea this was Mr. Miranda’s farewell. “Oh my God,” Ms. Ciel said. “Now I feel so incredibly honored. ” Others did know, and they were understandably excited for the night. Michelle Foronjy, who works at a Toyota dealership on Long Island, said she screamed when she found out that she had won the lottery and expected to be squeezing her boyfriend’s hand with excitement all night. She was still holding on to him as they left the theater. Celebrities came through the box office doors at a steady pace. Jennifer Lopez, who recently collaborated with Mr. Miranda on a benefit song to aid those affected by the Orlando massacre, attracted attention with the flashes of paparazzi, as did John Kerry with his security detail. (Abigail, a   dog, noticed them but seemed unfazed.) Spike Lee came for his eighth “Hamilton” performance. Mariska Hargitay showed up for the 10th time. No one seemed as devoted as Rosie O’Donnell, who said this was her 24th time, including performances Off Broadway at the Public Theater. Ms. O’Donnell lamented the cast departures, and Ms. Hargitay in particular was preparing for an emotional evening of saying goodbye to Mr. Odom. “There are going to be a lot of tears,” she said. “Oh no, I’m starting to cry just saying that. ” Among the stragglers was Charlie Rose, as well as two young women  —   one of whom, as she was walking through the lobby doors, looked at her ticket and said, “These aren’t great seats. ” Her companion replied: “Who cares? We get to see it. ”'"}, "time": 1742562066.869687}