{"duration": 0.035491228103637695, "input_args": {"text": "'Wells Fargo is Rotting from the Top Down Wells Fargo is Rotting from the Top Down By 0 139 \\nJust when you thought that, surely, big banker greed had bottomed out with 2008’s Wall Street crash and bailout, along comes Wells Fargo, burrowing even deeper into the ethical slime to reach a previously unimaginable level of corporate depravity. \\nIt’s one thing for these finance giants to cook the books or defraud investors, but top executives of Wells Fargo have been profiteering for years by literally forcing their employees to rob the bank’s customers. \\nRather than a culture of service, executives have pushed a high-pressure sales culture since 2009, demanding frontline employees meet extreme quotas of selling a myriad of unnecessary bank products to common depositors who just wanted a simple checking account. (Photo: Shutterstock) \\nEmployees were expected to load each customer with at least eight accounts, and employees were monitored constantly on meeting their quota — fail and you’d be fired. \\nThat’s why the bosses’ sales culture turned employees into a syndicate of bank robbers. The thievery was systemic, and it wasn’t subtle. \\nHalf a million customers were secretly issued credit and debit cards they didn’t request, fake email accounts for online services were set up without customers’ knowledge, depositors’ money was moved from one account to another, signatures were forged, and — of course — Wells Fargo collected fees for all of these bogus transactions, boosting its profits. \\nCEO John Stumpf was recently forced out because of the scandal, but what about the other top executives and the board of directors — all of whom were highly paid partners in this crime? \\nStumpf wasn’t the only rotten apple at Wells Fargo. This isn’t a case of a few bankers gone rogue, but of a whole bank gone rogue, rotting from the head down.'"}, "time": 1742564219.5543258}