{"duration": 0.06869935989379883, "input_args": {"text": "'Huma Abedin Sent Top Secret Docs To Yahoo Acct, Possible ‘Life Insurance’ Posted on October 31, 2016 by Rebecca Diserio in Politics Share This \\nA laptop, allegedly belonging to Huma Abedin’s estranged husband Anthony Weiner, reportedly had thousands of emails from Hillary Clinton’s private server as possible “life insurance” against the corrupt Democrat. We’ve uncovered shocking details behind what Huma did and why she did it as well as explosive information about FBI Director James Comey’s secret war that the liberal media is keeping from you. Huma Abedin (left), Hillary Clinton (middle), Anthony Weiner (right) \\nAfter the New York Police Department was notified about Anthony Weiner sexting an underage girl, they had to investigate, and it was then that they discovered a laptop with over 650,000 “metadata points” and about 10,000 emails overall, which were from the State Department and coming from Hillary Clinton’s home based server. Huma Abedin most probably kept those emails hidden on that laptop for life insurance against evil Hillary: \\n[W]as the laptop in question one of the missing laptops from the Clinton email investigation? One can easily imagine a scenario where this could be the case … One can also easily imagine a scenario where the content therein would be kept by Abedin for a reason; especially by a person who knows EVERYTHING about the extent the severe black hat Clinton’s are willing to go to retain their power. [via The Conservative Treehouse ] \\nThe leaks in this new investigation involving Huma Abedin are coming from the New York police, probably a few detectives who were shocked when they found top secret documents on the laptop when investigating Anthony Weiner, and they are driving the FBI to move forward because, if the bureau doesn’t, they will come out and tell all Americans what they know. Also, there is clear evidence that FBI agents were in revolt after Hillary was let off scot-free, and they were going to leak this information too, if Comey did not re-open the investigation. \\nWhat is it they know? They know Huma Abedin was probably keeping insurance in case Hillary ever turned on her, and Huma was thinking the FBI investigation was over and no one would ever find that laptop with her “life insurance.” Then in late September, Weiner did his illegal sexting thing, and before Huma could collect the laptop with the secret documents, the New York police had seized it. Huma Abedin’s testimony, subpoenaed by Judicial Watch. She admits to using her Yahoo email account for State Department business. \\nJust 11 days before Comey rocked the world on October 28th, announcing he was re-opening the email investigation, he sent out a clue that this is what he was going to do, but we all missed it . Check out this shocking FBI report that Comey released just 11 days ago about Hillary Clinton, which he called the final report on the email scandal: Page(s) 43, 44, 45 – Show aspects of the perspective of Secretary Clinton as she rebukes her security apparatus and puts her diplomatic team at risk. Also the alarming influence of Huma Abedin into security and protocol changes. Page 49 – Discusses the people within the highly secretive “7th Floor Group,” and how they handle security information Page 54 – Discusses the missing boxes of printed Clinton Emails. Page 56 – Discusses how the Secretary of State’s Office runs a secondary U.S. government , separate and apart from the traditional political structure, actually called “the shadow government.” FBI Director James Comey finds himself all alone, fighting against Hillary and her cabal. \\n“A shadow government ,” what the hell is going on? This sounds like some nutjob conspiracy theory, yet this is exactly what Comey released to the American people on October 17th. He was letting us know that Hillary and her cabal are evil and they need to go. \\nI think James Comey is the hero in all of this. At first, we hated him because it seemed he had given into the Obama administration’s evil ways, but all along, he kept fighting, and when Anthony Weiner dropped that laptop at Comey’s feet, it was like a gift from God himself. \\nThe fight isn’t over. We are seeing Hillary and her minions fight back against this new investigation, and I think Comey still has his hands tied, but he is doing what he can. Hopefully, those FBI agents and New York cops who are privy to what it is in Huma’s Yahoo email “life insurance” file will leak the information before the election. \\nWe can see, without any doubt, from Comey’s “final report” that Hillary is a tyrant and she must never be in power again. Let’s spread all this information because the strongest defense against Hillary’s evil is the truth, and as more Americans learn this truth, there is no way she will win.'"}, "time": 1742561977.6092346}