{"duration": 0.11213326454162598, "input_args": {"text": "'  If Hillary Is Not Guilty, Then Why Are Her Supporters Asking Obama To Pardon Her? Hmm… \"Hillary Clinton has not been tried, but there are those who want to drag her for the next three years. It will not stop until they find a reason to put her in jail. That would be a travesty.\"\"It would be a monumental moral mistake to pursue the indictment of Hillary Clinton,\" Jackson said. He said issuing the pardon could help heal the nation, like Ford\\'s pardon of Nixon did.   16, 2016 Speaking at President Gerald Ford’s alma mater, The Rev. Jesse Jackson called for President Obama to issue a blanket pardon to Hillary Clinton before he leaves office, just like Ford did for Richard Nixon. \\nStopping short of saying Clinton did anything wrong , Jackson told a large crowd of University of Michigan students, faculty and administrators gathered at daylong celebration of his career that Obama should short-circuit President-elect Donald Trump’s promised attempt to prosecute Hillary Clinton for use of a private e-mail server. \\n“It would be a monumental moral mistake to pursue the indictment of Hillary Clinton,” Jackson said. He said issuing the pardon could help heal the nation, like Ford’s pardon of Nixon did. Would Obama pardon Clinton before he leaves office? \\n“President Ford said we don’t need him for trophy. We need to move on. President Nixon wasn’t convicted of a crime. He didn’t apply for a pardon. (Ford) did it because he thought it would be best for the country. “Hillary Clinton has not been tried, but there are those who want to drag her for the next three years. It will not stop until they find a reason to put her in jail. That would be a travesty.” \\nIn 1974, Ford, a University of Michigan alumnus, issued a full and complete pardon of Nixon for any crimes he may have committed. He said the pardon was in the best interests of the nation. \\nJackson’s comments came at the end of a long day in Ann Arbor, which included him dropping in on an anti-Trump rally held by students on campus. Jesse Jackson: Obama should pardon Hillary Clinton \\nJackson comes to a campus that is full of strife over race. Numerous racist flyers have been posted and students have alleged they have been attacked because they are Muslim or a minority. There have been anti-Trump marches on U-M’s campus, along with campuses across the nation. A large demonstration marched through a series of U-M buildings even while Jackson was speaking. \\nStudents “are growing up in an America that is in an identity crisis,” Jackson said. “These demonstrations are born out of fear. Fear that the Klan will ride again. Fear that violence (against minorities) is coming back. \\n“In this election, voters voted for fear. I think hope will defeat hate, but it’s a battle.” In a conversation with the Free Press at the beginning of the day, he blamed Trump for the environment of fear. \\nDonald Trump saw an America that was a dry field, and instead of watering it to get the grass growing again, he threw a lit match on it, Jackson said. \\nNow it’s up to Trump to take action, Jackson added. \\n“The one who set the field afire must be the one to put it out,” he told the Free Press in a one-on-one interview. “He had the option to pour water on it (the dry field) and let it grow. He didn’t do that — he chose to light it on fire. One of my concerns is that we see the division in America now because of that. We see classmates, roommates in a conflict over the way the campaign turned out. \\n“He knows Mexicans didn’t take jobs from us. It was the corporations. He knows you can’t deport 15 million (immigrants). It’s not just about the adults, but also about the children who were born here, grew up here and go to school here.” \\nJackson told students not to give up the struggle. \\n“Students, don’t let them take your hope. Deep water doesn’t drown you. You drown because you stop kicking. There is a tug of war for the soul of America. Do we want to be an aristocracy or a democracy? To be silent is to betray your conscience. You must not be silent in the face of violation of human rights.” source SHARE THIS ARTICLE  '"}, "time": 1742561961.5764654}