{"duration": 0.047281742095947266, "input_args": {"text": "'\\nA lot of people, especially millennials, are concerned at Hillary’s war rhetoric, and especially the stuff she made up about tying Wikileaks to Russia at the last debate.\\nNow an ominous new mock ad campaign about registering for the draft for Hillary on Twitter complete with hashtags, #ImWithHer, #EnlistforHer, #FightforHer, and #DieforHer is making the rounds, reminding us all how close America currently is to World War III and which candidate would definitely without a doubt be all about going to war against Russia.\\nAt first glance, it is scary how real these look.\\n#Enlistforher #FightForHer #ImWithHer #KillForHer #DieForHer #BeEvisceratedForHer #NuclearWarForHer pic.twitter.com/SyJhs92hij \\n— Rich Corey (@RichCore9007) October 27, 2016 \\n\\nPre-register for the draft today, nuclear war is coming #ImWithHer #FightForHer #EnlistForHer pic.twitter.com/iPi6IjUU9d \\n— MicroSpookyLeaks™ (@WDFx2EU7) October 27, 2016 \\n\\n#EnlistForHer pic.twitter.com/YpCb5A484M \\n— Place De La Bastille (@PlacedeBastille) October 27, 2016 \\n\\n#FightForHer #EnlistForHer pic.twitter.com/XDjI3Ma8rc \\n— Susan Smith (@Smith85Susan) October 28, 2016 \\n\\n@NBA @chicagobulls \\nVOTE Hillary Clinton & register to become one of 100,000 young men & women to fight in Syria #FightForHer #EnlistForHer pic.twitter.com/s9DmKSZIZt \\n— #EnlistForHer (@DonTrumpMAGA) October 27, 2016 \\n\\n#EnlistForHer #ImWithHer enroll your children today, it’s just a click away, and nuclear war could just be around the corner via @RobbyMook pic.twitter.com/PvNYqI2dOD \\n— MicroSpookyLeaks™ (@WDFx2EU7) October 27, 2016 \\n\\nScary, huh?\\nThis election is so disgusting, it’ll be good when the damn thing is over. Delivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by The Daily Sheeple of www.TheDailySheeple.com . \\nThis content may be freely reproduced in full or in part in digital form with full attribution to the author and a link to www.TheDailySheeple.com. '"}, "time": 1742561645.5639086}