{"duration": 0.05683541297912598, "input_args": {"text": "'The Vatican’s Secretary of State Cardinal Pietro Parolin said Monday that the Holy See is concerned over growing populist and nationalist movements, both in Europe and in the United States. [In an interview for the Italian evening news on the   RAI network, Cardinal Parolin was asked whether the Vatican is worried about what the interviewer called “the spread of nationalism and populism not only in Europe but also in the United States with Donald Trump. ”  “I think so, I think so,” Parolin said. “Certainly these closings are not a good sign,” since many of them “are born of fear, which is not a good counsellor. ” The Cardinal also recalled recent comments by Pope Francis, saying that “there is a risk of history repeating itself. ” In a lengthy interview with the Spanish daily El País in late January, Pope Francis was asked whether he was concerned about the spread of a populism that capitalizes on “people’s fears,” preaching “a message of hate. ” In his reply, Francis distinguished between a good, grassroots populism, where it is the people who are “the protagonists,” and a cult of personality where a charismatic figure like Hitler rises to power and is welcomed as a savior figure. “For me the most typical example of populism in the European sense is the Germany of 1933,” Francis said. After Hindenburg, “Germany tries to get back up, searches for its identity, looks for a leader, someone to give it back its identity and a youngster named Adolf Hitler says, ‘I can do it I can do it. ’” Whereas the first sort of populism is a good thing, the latter can be very dangerous, he said. The risk, Francis said, is that in times of crisis we lack judgment and people can begin to think, “Let’s look for a savior who gives us back our identity and let’s defend ourselves with walls,   whatever, from other people that may rob us of our identity. ” “And that is a very serious thing,” he said. “That is why I always try to say: talk among yourselves, talk to one another. ” In the same interview, the Pope was asked specifically whether he was worried about Donald Trump, whom the interviewer described as a xenophobe filled with “hatred for foreigners. ” Francis said that the new U. S. President deserved to be judged by his actions, not by “prophecies” of what he may or may not do. “I think that we must wait and see,” Francis said. “I don’t like to get ahead of myself nor judge people prematurely. We will see how he acts, what he does, and then I will have an opinion. ” The Pope said it is “most unwise” to be afraid of something that might or might not happen. “It would be like prophets predicting calamities or windfalls that don’t take place. We will see. We will see what he does and then evaluate,” he said. “I prefer to wait and see,” he said. Follow Thomas D. Williams on Twitter  Follow @tdwilliamsrome'"}, "time": 1742562993.4771545}