{"duration": 0.13665080070495605, "input_args": {"text": "'UK citizens and war heroes get cheap pre-fab houses while Muslim colonizers get taxpayer-funded luxurious council homes UK Ministers have been forced to put forward plans for pre-fabricated homes after 30,000 luxury council houses were handed out to unemployed illegal alien Muslim migrants. Migration Watch said the costs will continue to rocket if a “sustainable” level of migration is not achieved. UK Daily Mail More than 11,000 households are raking in benefits that are at least the equivalent of a higher rate taxpayers’ £47,000 salary, it was revealed last month. According to official figures, thousands of Muslim migrant families on benefits are living in luxury homes, with many receiving housing handouts of about £5,000 per month – enough to fund a £1million mortgage. Jonathan Isaby, of the TaxPayers’ Alliance, said: ‘Many taxpayers struggling to make ends meet will find it incredibly unfair that some people are drawing more in benefits than they’ve ever actually earned themselves. UK Express (h/t Rob E) A spokesperson said: “There is a long standing controversy over the granting of social housing to immigrants. This has not been helped by local authorities’ reluctance to publish the relevant information. “Some immigrant groups have very low use of social housing whereas others are more likely to be in social housing than the UK born. There is absolutely nothing in the rules that state that immigrants should get preferential treatment. “However, priority for social housing is largely determined by need and so some ‘high need’ immigrant families (with multiple wives and large litters of kids) will gain access to housing over longer standing local residents deemed to be of lower need. This can be contentious. The 100,000 pre-fab homes(below) proposed by the Government are a far cry from those properties “fit for heroes” and service personnel who were awarded social housing on their return from the horrors of the First World War. “In the future, any housing strategy must address both supply and demand. The Muslim invasion is a major part of housing demand. “Unless net migration is reduced to a manageable and sustainable level a large house building programme will have to continue indefinitely, with all the costs and loss of amenities involved.” A white paper due out next month includes measures to encourage banks to lend to firms which construct off-site before delivering them to their final destination. A Government source said: “The first and most obvious advantage is speeding up the building of housing. “There is pretty good evidence that if you did it at scale it is cheaper.” This has pushed ministers to plan a new wave of pre-made homes to solve the housing crisis. The prefabricated homes can be built off site in as little as a day and take just 48 hours to install on a site. Jonathan Isaby, of the TaxPayers’ Alliance, said: ‘Many taxpayers struggling to make ends meet will find it incredibly unfair that some people are drawing more in benefits than they’ve ever actually earned themselves. But today when approximately 9,000 of our servicemen and women are sleeping rough after leaving the military, Government figures show how an influx of Muslims has seen 30,000 social housing lettings given to immigrants in 2015. Outrage as Afghan War hero who guarded the Queen is thrown out of council home From 2015, Jamie Streets, 34, spent 15 years in the Household Cavalry and suffered brain damage while on duty. But he, his wife Charmaine and their four children are to be kicked out of temporary accommodation after Cornwall County Council denied them a permanent home. Mr Streets served in both Kosovo and Afghanistan and escorted the Queen on ceremonial duty, holding the rank of corporal of horse. But he was discharged on medical grounds last year after suffering serious head injuries and a brain tumor. Although he recovered enough to return to work, he then suffered a seizure and had to leave the Army. Sorry, we decided that unemployed Muslim colonizers deserve a nicer home than war heroes In an open letter to the Prime Minister and Cornwall Council’s chief executive Andrew Kerr, the Household Cavalry Veterans Association says it is “incensed”. Signed by Secretary Rob Mather, the letter claims taxpayers’ money is spent on “lavish lifestyles and foreign aid”, while “serious issues on our own doorstep are not resolved”. “This is not acceptable treatment of one who served his Queen and country.” The seven-bedroom home in Acton, West London, where an Afghan Muslim family were placed at a cost of £2,875 a week to taxpayers UK: Muslim Welfare ‘Refugees’ Trash The £1.25 Million Home They Are Living In For Free And Laugh About It A family of PALESTINIAN MUSLIM freeloaders provoked outrage yesterday by saying they “deserve” to live in a £1.25 million taxpayer-funded luxury home (above) despite trashing it. The mother, Mrs Mahmoud, gets £20,000 a year in housing benefits to pay her rent. Yet she said: “I don’t care if people think I am not grateful. I am entitled to live in a house like this even if I don’t pay for it. “I deserve to live in a nice house and get benefits because I am human.” The family is one of at least 100 unemployed Muslim invaders living in homes on state handouts that could fund £1million mortgages. Muslim mother of eight was placed in a £2.6m house in Notting Hill, west London at the taxpayers’ expense She has since split with her husband and was given British citizenship five years ago but has never worked in this country. She moved with her two sons and five daughters to the three-bedroom house in Fulham, west London, three years ago. It had just undergone a £76,000 refurbishment, half paid for by the taxpayer. She claims her family is being persecuted because neighbours “don’t want a foreigner to come and live in this street.” Thanks for the nice council house, suckers. Migration Watch said the costs will continue to rocket if a “sustainable” level of migration is not achieved. A spokesperson said: “There is a long standing controversy over the granting of social housing to immigrants. This has not been helped by local authorities’ reluctance to publish the relevant information. There is absolutely nothing in the rules that state that immigrants should get preferential treatment.'"}, "time": 1742561642.949828}