{"duration": 0.039759159088134766, "input_args": {"text": "'Email Print This has been the worst week for Hillary Clinton and the best week for the American people. For years, Americans have accepted that Hillary Clinton is simply “too big to jail.” We began to lose hope when the FBI let her off the hook the first time, but it appears Director Comey knew he had to correct a major wrong. An avalanche of investigations has now occurred against Hillary Clinton, her campaign, and her foundation. FBI Director James Comey made the announcement in a letter last Friday afternoon that the bureau will be reopening the investigation into Hillary Clinton’s illegal use of a private email server. Two days later, the FBI opened a second investigation into the Clinton Foundation. As on November 4th, we have reports that two more investigations have been opened by the FBI. The third investigation spawned from WikiLeaks releasing thousands emails and documents purporting that the Clinton Foundation was linked to child exploitation and Jeffrey Epstein. The fourth investigation entails the IRS reviewing the Clinton Foundation for tax evasion, money laundering, and many other things. Hillary sure does make history. Second time she has been under criminal investigation this year as a presidential candidate. \\n— Martin Walsh (@mrwalsh8) October 28, 2016 According to sources with the FBI , it is being heavily reported that FBI Director James Comey has ordered all agents in the Washington D.C. field office and Hoover Building headquarters to report to work immediately Friday morning. “We’re preparing for many arrests from the top down,” an FBI source stated. “I cannot elaborate beyond that.” When the FBI source was asked to elaborate on what he meant by “from the top down,” he added, “You’re a smart guy; read between the lines.” FBI protocol indicates that two scenarios could be unfolding in this situation: The FBI is either preparing to obtain search warrants where they will search any and everything dealing with the Clinton Foundation or they are preparing to make arrests on any and all individuals involved. Or, they are preparing to carry out both actions. We cannot confirm what documents the FBI has, but an FBI source has indicated that they are preparing to make arrests in the coming days. We are unsure if that means Hillary Clinton, but we are confident that many of her cronies will be arrested and charged with several crimes in the coming days. The FBI has the opportunity to right their wrongs. They have more than enough evidence to charge @HillaryClinton . Do your job. \\n— Martin Walsh (@mrwalsh8) November 2, 2016 At this moment, here is a list of the crimes Hillary Clinton and her team are being investigated for by the FBI: Money laundering Sex crimes with minors (children) Perjury Pay to play through Clinton Foundation Obstruction of justice Other felony crimes The FBI would not open several investigations weeks before a presidential election unless the evidence was overwhelming. For the first time in American politics, it appears that no one is too big to jail–even a Clinton. Sources with with the FBI are indicating that orders have come down from the very top that they will be taking actions immediately against Hillary Clinton, her team, and her foundation. Charges for these crimes would result in long prison sentences as well as hefty fines. They would also result in Hillary Clinton losing this election in a complete landslide. We very well may see Hillary Clinton arrested by the FBI in the coming days. Time will tell. Stay tuned. \\nIf you haven’t checked out and liked our Facebook page, please go here and do so. Leave a comment... '"}, "time": 1742563202.2424707}