{"duration": 0.06861639022827148, "input_args": {"text": "'0 Add Comment \\nAN TAOISEACH Enda Kenny yesterday called for a national discussion on pornography, owing to its sometimes corrosive effects on people’s perception of and attitudes toward sex and sexual encounters. \\nThanks to a timely freedom of information request WWN submitted recently, we can reveal that the office of the Taoiseach has been very keen on discussing pornography, and WWN can for the first time publish An Taoiseach’s computer search history. \\n5) “Dear Google, this is private don’t share with anyone. Sexy IRA balaclava ladies” \\nThe Taoiseach’s 5th most popular repeated search reveals a penchant for erotic roleplay. Which is not dissimilar to many young men, whose overexposure to and repeated watching of unrealistic sexual encounters and sexual performance can often lead to several sexual dysfunctions such as impotence. However, watching milfs with great big jugs every evening will probably do you no harm, expert opinion and research be damned. \\n4) “Three-way coalition” \\nEchoing the porn habits of several political science students, who despite having their own sexual experiences, can find consistent watching of over the top scenarios and performances warps their own perception of what sex actually consists of and leave them further isolated from real and intimate personal relationships. But, it doesn’t count when it comes to watching a 16-way orgy, they’re class. \\n3) “Dáil bar after 2am” \\nPresumably searching for a porn parody of that time a sitting TD clutched at a female colleague, forcing her to sit in his lap during a late night sitting of the Dáil. Certain genres of pornography can lead people to believe other people are merely sexual objects, available to provide sexual gratification at any time of their choosing. \\n2) “Dear Google VERY PRIVATE. Female German dominatrix” \\nUnlike Enda here, who has had years to cultivate his understanding of the various genres and the fact that they are rarely if ever representative of real sex, people are now beginning to watch graphic pornography from as young as 12, paving the way for a disorientating experience while having little ability or resources available to provide real and genuine sexual education and information. Unlike yourself, who can’t remember the last time you went on to Pornhub, Redtube, Xvideo or whatever you’re having yourself. \\n1) “Deepthroat whistleblower” \\nWhile we put this entry, searched for 7,000 times, down to the government’s desire to weed out Garda whistleblowers who are making life difficult for the cabinet, other people, chiefly men, regularly look for various scenarios and fantasies which, when not watched in moderation and with an understanding that it is not real life, can devastate their lives and relationships on a permanent basis. ‘Tis grand if you’re just watching the odd hour or two everyday though. \\nFor more information of what porn you should be looking up click HERE.'"}, "time": 1742563080.176137}