{"duration": 0.09533810615539551, "input_args": {"text": "'The Arctic Ocean may seem remote and forbidding, but to birds, whales and other animals, it’s a   dining destination. “It’s a great place to get food in the summertime, so animals are flying or swimming thousands of miles to get there,” said Kevin R. Arrigo, a biological oceanographer at Stanford University. But the menu is changing. Confirming earlier research, scientists reported Wednesday that global warming is altering the ecology of the Arctic Ocean on a huge scale. The annual production of algae, the base of the food web, increased an estimated 47 percent between 1997 and 2015, and the ocean is greening up much earlier each year. These changes are likely to have a profound impact for animals further up the food chain, such as birds, seals, polar bears and whales. But scientists still don’t know enough about the biology of the Arctic Ocean to predict what the ecosystem will look like in decades to come. While global warming has affected the whole planet in recent decades, nowhere has been hit harder than the Arctic. This month, temperatures in the high Arctic have been as much as 36 degrees above average, according to records kept by the Danish Meteorological Institute. In October, the extent of sea ice was 28. 5 percent below average  —   the lowest for the month since scientists began keeping records in 1979. The area of missing ice is the size of Alaska and Texas put together. Since the   researchers like Dr. Arrigo have been trying to assess the effects of retreating ice on the Arctic ecosystem. The sun returns to the Arctic each spring and melts some of the ice that formed in winter. Algae in the open water quickly spring to life and start growing. These algae are the base of the food chain in the Arctic Ocean, grazed by krill and other invertebrates that in turn support bigger fish, mammals and birds. Dr. Arrigo and his colleagues visited the Arctic in research ships to examine algae in the water and to determine how it affected the water’s color. They then reviewed satellite images of the Arctic Ocean, relying on the color of the water to estimate how much algae was growing  —   what scientists call the ocean’s productivity. The sea’s productivity was rapidly increasing, Dr. Arrigo found. Last year he and his colleagues published their latest update, estimating that the productivity of the Arctic rose 30 percent between 1998 and 2012. But Mati Kahru, an oceanographer at the University of California, San Diego, was skeptical. As an expert on remote sensing, he knew how hard it is to get a reliable picture of the Arctic Ocean. The ocean is notoriously cloudy, and algae are not the only thing that tinting the water. Rivers deliver   organic matter into the Arctic Ocean, which can give the impression that there’s more algae in the water than is actually there. Dr. Kahru and his colleagues decided to take an independent look, scouring satellite databases for images taken from 1997 to 2015  —   “every image available,” he said. The scientists used a mathematical equation to determine how the color in each pixel of each image was determined by algae, runoff, and other factors. Dr. Kahru decided that Dr. Arrigo was right: The Arctic Ocean has become vastly more productive. Marcel Babin, an oceanographer at Université Laval in Quebec who was not involved in the new study, said that the researchers had done “very careful work” that confirmed the earlier studies. “It’s an important finding,” he said. Not only is the Arctic Ocean producing more algae, but it’s doing so sooner each year. “These blooms are coming earlier, sometimes two months earlier,” Dr. Kahru said. In fact, the bloom may be coming even sooner than satellites can record. On research cruises, Dr. Arrigo and his colleagues have found that open water is no longer a requirement for algae to grow. The ice has gotten so thin that sunlight reaches through it. “Now they’re not even waiting for the ice to melt,” said Dr. Arrigo said of algal organisms. If we stay on our current course, pouring more carbon dioxide into the atmosphere, the Arctic will only get warmer, perhaps becoming   in the summer. If algae can find more nitrogen and other nutrients in the ocean, its productivity may continue to rise. Scientists can’t yet say what the ecological effects of this transformation will be. “It is probable it will have an impact on the whole food web,” Dr. Babin said. Dr. Babin and his colleagues have been studying that impact over the past two summers on an expedition called the Green Edge Project, which has studied the ecology in Baffin Bay off the coast of northern Canada. They hope to present the first results of the survey next year. Some species may thrive because they can graze on the extra algae. But if the ecosystem comes to life earlier in the year, many species may be left behind. Fish larvae may not be able to develop fast enough. Migrating whales and birds may show up too late. A lot of the extra algae may drop to the sea floor by then, untouched. “It’s going to be a different Arctic unless we turn things around,” said Dr. Arrigo.'"}, "time": 1742562238.657288}