{"duration": 0.015977144241333008, "input_args": {"text": "'Comedian Jerry Seinfeld’s tweet to promote the new season of his comedy series, Comedians in Cars Getting Coffee, offended social media users. [“New! Comedians In Cars Getting Coffee. Lewis Black. Black’s life matters,” the Seinfeld star tweeted on Thursday.  New! Comedians In Cars Getting CoffeeLewis Black.  Black’s life matters.  @Acura! https:  .   —   Jerry Seinfeld (@JerrySeinfeld) January 26, 2017,  Twitter users flooded the social media platform to protest what some called Seinfeld’s ‘offensive” tweet. @JerrySeinfeld @Acura Hey I know you think college kids are too PC but I’m in my 30s and this crap was really offensive and lame.  —   Matt Donaher (@mattdonaher) January 27, 2017,  @JerrySeinfeld @Acura what the fuck jerry,  —   Kevin T. Porter (@KevinTPorter) January 26, 2017,  @JerrySeinfeld @Acura This is worse than the finale of ”Seinfeld” which I still don’t like.  —   Benjamin Siemon (@BenjaminJS) January 26, 2017,  @JerrySeinfeld Now I see why Larry David wrote all the jokes.  —   Tyler Conway (@jtylerconway) January 26, 2017,  @JerrySeinfeld @Acura Perhaps poor taste to use a legitimate movement for a pun about a white guy,  —   no salt nate (@natestradingus) January 26, 2017,  @JerrySeinfeld @Acura i love you man but this is disrespectful.  —   Travon Free (@Travon) January 26, 2017,  Seinfeld has not deleted the tweet or issued an apology in the way most celebrities would after offending potential audience members. And it’s likely due to the fact that the    star is no fan of what he calls “politically correct nonsense. ” In 2014, Seinfeld slammed the idea of creating comedy strictly through the lens of race, gender, or one’s sexual preference. “It’s more about PC nonsense than ‘Are you making us laugh or not? ’” he said. A year later, Seinfeld doubled down on his   remarks, noting that contemporary college students carelessly use the terms “racist” or “sexist. ” “They just want to use these words,” Seinfeld told radio host Colin Cowhard. “‘That’s racist. That’s sexist. That’s prejudice.’ They don’t even know what they’re fucking talking about. ” Seinfeld’s Comedians, in which the comic riding in a car and sitting in diners sharing a cup of coffee with his famous friends, debuted in July 2012. Seinfeld recently signed a deal to bring the the comedy series to streaming giant Netflix. The 9th season of  Comedians in Cars Getting Coffee premiered on January 5. Follow Jerome Hudson on Twitter: @jeromeehudson'"}, "time": 1742628525.410791}