{"duration": 0.05902409553527832, "input_args": {"text": "'Border Patrol Agent Brandon Judd, speaking in his capacity as president of the National Border Patrol Council, pushed back against House Speaker Paul Ryan’s contention that funding for the border wall can be delayed. [Judd’s comments came during an interview with Fox Business Channel’s Stuart Varney where he addressed the dramatic impact the Trump Administration has already had on reducing illegal border crossings. “Speaker Paul Ryan is suggesting that Congress delay border wall funding until next year,” Varney stated. “What do you say about that?”  “I disagree,” Judd said flatly. “President Trump promised that he was going to secure the border, and part of securing the border is putting in place, the proper technology and resources that allows us to be successful and a border wall in strategic locations is one of those things that we must get done. ” Ryan’s comments that he may delay funding the border wall came during a March interview with Norah O’Donnell on “CBS This Morning”. “The big chunk of money for the border wall really is next year’s fiscal appropriations,” Ryan said. “Because they literally can’t start construction even this quickly. ” The Trump Administration is moving forward with the bidding process, Breitbart Texas reported. Officials are expected to choose 4 to 10 companies to build a prototype section of wall to demonstrate their bid’s viability and effectiveness. Officials with knowledge of the plan spoke to the Daily Mail on condition of anonymity and said contractors would build the prototypes on a   strip of   land near San Diego. Trump began seeking bids to build prototypes of the wall in February, Breitbart Texas reported. More than 300 companies quickly signed up to present proposals on how to take the President’s vision and promise to reality. Bob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX and Facebook. (Disclosure: Breitbart Texas sponsored the Green Line podcast for the NBPC in an effort to provide a platform for agents to inform the public about the realities on the border and what Border Patrol agents face. Director Brandon Darby received an award from the Laredo chapter of the NBPC for his work in helping to defend and bring a voice to Border Patrol agents. Breitbart News assisted in covering funeral costs for a slain Border Patrol agent previously. Darby and Breitbart’s senior management have directly stated and shown that helping to bring a voice to the expressed needs and interests of Border Patrol agents is a top priority —  personally, individually and together through Breitbart News.)'"}, "time": 1742564368.407136}