{"duration": 0.0986490249633789, "input_args": {"text": "'posted by Eddie I believe that if we could calculate the strongest emotion of love for people or things, it would be the one for our kids. I cannot imagine what would be my reaction if I caught my 17 years old daughter lying next to a stranger. This Russian dad shared his reaction on Reddit, and what he did will make you love him! A RUSSIAN FATHER SHARED THIS ON REDDIT (english not my native language please be kind): “One morning I came down the stairs, seeing this exact scene my 17 year old with a young man asleep after what must have been a night of ‘hard labour’ I very quietly made breakfast, went back upstairs and told my wife, son and other (youngest) daughter to be very quiet because people where still asleep our dinner table is on the other side of the room, about 20 feet from the couch but right in front of it. We all sat down and I yelled “YOUNG MAN” never ever I’ve seen someone wake up and move from horizontal to vertical that fast “breakfast is ready!” I said with a tone as if I gladly would suck his soul out of his body. Through his left ear I pulled out the chair beside me “sit!” my family silent staring at their plates not even twitching. It must have been the hardest 20 feet for a but naked youngster to cross trying to hide his, I must say, rather impressive morning wood my youngest daughter looking in awe at said piece of wood , as did my wife after he put on his clothes, which lay beside the dinner table, he sat down my son (6.4′) patted him on the shoulder looked him in the eyes, sighed and shook his head by now he was really, really nervous you could almost smell it in my best Russian accent: “my friend, I’m going ask you a question the answer you give is very important….for you…” at this point he was sweating “do you like cats?” He was a very likeable and friendly guy clearly uneducated but not dumb there was something odd about him my daughter assured me he was a very nice and attentive guy she knew him for about a month by then he came by every day since that morning never stayed over at night though every morning he came to pick her up for school on his bicycle, brought her home after, made sure she did her homework looked after her when she was sick and we were at work he took care invested time end effort he had the patience of an angel when she had one of her terrible moods. He said he had no family, no education, no steady job she adores him he adores her who am I to prevent her from learning from her own mistakes. After this had been going on for about 8 months my son came to me he had been asking around about him turns out the guy was homeless his abusive father killed himself his mother, a crack whore took of 3 weeks after that they lived in a rented trailer (yes white trailer trash) he was 15 then and survived for 3 year on the streets sleeping in parks, at the salvation army, with “friends”, cheap ass hotels. working construction jobs now and then when my daughter met him on her riding school, shoveling shit. he’s a good looking guy and, well, you know…17 year old female…raging hormones….now. There I was I knew a young man 18 or 19 years old. who was polite, who comes in smiling who leaves smiling who cares who helps, no need to ask who makes my child happy a kid who had never had a chance to be a kid a mainly absent manic depressive suicidal as a dad a crack whore as a mum sometimes fed by neighbours mostly going hungry. Sometimes when he does not come over because he has a job we miss him they are not buddies but my son gets along with him very well my youngest daughter trusts him unconditionally and my wife’s motherly instinct seems to have expanded and me? I sometimes worry for him I want him to be happy. I told my wife and youngest what I learned about him they cried I had a hard time telling. I was disappointed in my oldest daughter she knew she should have told us she loves him and lets him leave every night to go….were???? (heartless bitch) the next day I gave him a key of our house I told him I expected him home every night home in the next weeks we fixed our spare room and took him shopping for furniture he was quite good in making things he wanted to be his own boss, he liked building things we saw to it that he got an education which enabled him to do just that that was in 2000 now 15 years later my found son and my daughter have thriving business they gave use 3 beautiful grandchildren last year twins 1 girl, 1 boy” True experience of a Russia Father'"}, "time": 1742561799.932033}