{"duration": 0.06271028518676758, "input_args": {"text": "'As a new poll shows 28% of early Republican Florida voters casting their vote for Clinton, Donald Trump is getting desperate. \\nThe Republican nominee begged Clinton voters to change their vote in 6 states where it’s not too late to do so. Trump wrote Wednesday morning, “So now that you can see Hillary was a big mistake, change your vote to MAKE AMERICAN GREAT AGAIN!” You can change your vote in six states. So, now that you see that Hillary was a big mistake, change your vote to MAKE AMERICA GREAT AGAIN! \\n— Donald J. Trump (@realDonaldTrump) November 2, 2016 \\nTuesday evening Trump made the case that due to the FBI’s announcement about Clinton’s emails voters might have buyers’ remorse , “A lot of things have happened over the last few days. This is a message for any Democratic voters who have already cast their ballots for Hillary Clinton and are having a bad case of buyers’ remorse — in other words you want to change your vote — Wisconsin is one of several states where you can change your early ballot if you think you’ve made a mistake.” \\nWhile it’s true that people in some states can change their votes, it’s not true that this rule was changed because of Hillary Clinton’s “emails” and yes, that’s a new Right wing “thing” apparently. Trump doesn’t suggest the law was changed because of Clinton, but he seems to think people will be rushing to change their mind about Clinton because of the non-surprise October “surprise!” the Republican FBI Director delivered , which was perceived to have benefited the Trump ticket. \\nDays ago, Snopes debunked the notion that changing early votes is being allowed because of the FBI’s bizarre announcement that they may or may not have more emails pertaining to Clinton. \\nClaim: After FBI Director Jim Comey announced that he was reviewing e-mails potentially linked to Hillary Clinton, several states announced that they were allowing people to change their early votes. mixture \\nWHAT’S TRUE: Some states allow early voters to change their votes before election day. \\nWHAT’S FALSE: No states changed their election laws in order to allow people who voted early for Hillary Clinton to change their votes. \\nAnd to make this even better, that false information was based on a Fox News report that wasn’t selling the false story about Clinton, but still got some of the information wrong. This is why the Right can’t have nice things. The Left should be vigilant against allowing itself to become too insular, because epistemic closure leads to losing. \\nTrump conveniently ignores his own history of email dumping, exhaustive list of lawsuits, bragging about sexual assault, dissing minorities and a Gold Star family, and national security experts investigating his ties and his campaign’s ties to Russia. \\nOnly a desperate candidate runs on trying to get people to change their votes to him because someone found a Clinton aide’s emails when they don’t even know what they say or if they are duplicates yet. \\nWhile this race is far from over, if all Americans get off their butts and go vote, Donald Trump faces an uphill battle to the White House.'"}, "time": 1742562529.861387}