{"duration": 0.15773677825927734, "input_args": {"text": "'BEIJING  —   An international tribunal in The Hague delivered a sweeping rebuke on Tuesday of China’s behavior in the South China Sea, including its construction of artificial islands, and found that its expansive claim to sovereignty over the waters had no legal basis. The landmark case, brought by the Philippines, was seen as an important crossroads in China’s rise as a global power and in its rivalry with the United States, and it could force Beijing to reconsider its assertive tactics in the region or risk being labeled an international outlaw. It was the first time the Chinese government had been summoned before the international justice system. In its most significant finding, the tribunal rejected China’s argument that it enjoys historic rights over most of the South China Sea. That could give the governments of Brunei, Indonesia, Malaysia, Taiwan and Vietnam more leverage in their own maritime disputes with Beijing. The tribunal also said that China had violated international law by causing “irreparable harm” to the marine environment, endangering Philippine ships and interfering with Philippine fishing and oil exploration. “It’s an overwhelming victory. We won on every significant point,” said the Philippines’ chief counsel in the case, Paul S. Reichler. But while the decision is legally binding, there is no mechanism for enforcing it, and China, which refused to participate in the tribunal’s proceedings, reiterated on Tuesday that it would not abide by it. Speaking at a meeting with European leaders, President Xi Jinping was defiant, reasserting China’s claim to sovereignty over the South China Sea “since ancient times,” the   People’s Daily reported. His remarks echoed a statement from the Foreign Ministry. The tribunal’s decision “is invalid and has no binding force,” the ministry said. “China does not accept or recognize it. ” The foreign secretary of the Philippines, Perfecto Yasay Jr. welcomed the ruling as “significant” and called on “all those concerned to exercise restraint and sobriety. ” The five judges and legal experts on the tribunal ruled unanimously, and the decision was so heavily in favor of the Philippines that there were fears about how the Chinese leadership would react. Many in the region worry that Beijing will accelerate its efforts to assert control over the South China Sea, which includes vital trade routes and fishing waters as well as possible oil and mineral deposits. “Xi Jinping has lost face here, and it will be difficult for China to do nothing,” said Bonnie S. Glaser, a senior adviser for Asia at the Center for Strategic and International Studies in Washington. “I expect a very tough reaction from China, since it has lost on almost every point. There is virtually nothing that it has won. ” The Philippines filed its case in 2013, after China seized a reef over which both countries claim sovereignty. There has been speculation that Beijing might respond to the decision by building an artificial island at the reef, Scarborough Shoal, a move that could set off a conflict with the Philippines and its treaty ally, the United States. The State Department spokesman, John Kirby, said Washington expected China to comply with the ruling. “The world is watching to see if China is really the global power it professes itself to be and the responsible power that it professes itself to be,” he said. The main issue before the panel was the legality of China’s claim to waters within a “  line” that appears on official Chinese maps and encircles as much as 90 percent of the South China Sea, an area the size of Mexico. The Philippines had asked the tribunal to find the claim to be in violation of the United Nations Convention on the Law of the Sea, which both China and the Philippines have ratified. In its decision, the tribunal said any historic rights to the sea that China had previously enjoyed “were extinguished” by the treaty, which lays out rules for drawing zones of control over the world’s oceans based on distances to coastlines. The panel added that while China had used islands in the sea in the past, it had never exercised exclusive authority over the waters. The panel also concluded that several disputed rocks and reefs in the South China Sea were too small for China to claim control of economic activities in the waters around them. As a result, it found, China was engaged in unlawful behavior in Philippine waters, including activities that had aggravated the dispute. The tribunal cited China’s construction of a large artificial island on an atoll known as Mischief Reef. China has built a military airstrip, naval berths and sports fields on the island, but the tribunal ruled that it was in Philippine waters. The judges also said that Beijing had violated international law by causing “severe harm to the coral reef environment” and by failing to prevent Chinese fishermen from harvesting endangered sea turtles and other species “on a substantial scale. ” In an early indication of the regional response, Vietnam  —   which has fraternal Communist ties to China but also significant territorial disputes with it, including over oil exploration rights  —   quickly issued a statement endorsing the tribunal’s decision. China has argued that the tribunal had no jurisdiction in the case. Because the sovereignty of reefs and islands in the sea is disputed, Beijing asserted, the tribunal could not decide on competing claims to the surrounding waters. The treaty covers only maritime disputes, not land disputes. In a tough speech in Washington last week, a former senior Chinese official, Dai Bingguo, said that the findings would amount to no more than “waste paper” and that China would not back down from its activities in the South China Sea even in the face of a fleet of American aircraft carriers. But with the geopolitical stakes high, Mr. Dai also counseled moderation, saying that the situation in the South China Sea “must cool down. ” The issue could have ramifications for domestic politics in China. Mr. Xi has made defense of maritime claims a central part of the governing Communist Party’s narrative that it has restored the nation to global greatness after long periods of humiliation by bigger powers. Any challenge to that narrative is seen in Beijing as a challenge to the party’s rule. On Wednesday morning, an escalating propaganda campaign in China against the tribunal reached a new pitch, with all the major news outlets condemning the decision and trumpeting China’s refusal to be back down. “We do not claim an inch of land that does not belong to us, but we won’t give up any patch that is ours,” said a   editorial in The People’s Daily, which ridiculed the tribunal as a “lackey of some outside forces” that would be remembered as a “laughingstock in human history. ” Some Chinese commentators have said in recent days that the leadership may respond with immediate military maneuvers in the South China Sea. “Whether it will be significant or large scale I cannot say,” said Shi Yinhong, a professor of international relations at Renmin University in Beijing. China is hosting the Group of 20 summit meeting in September, a major international forum that it hopes will proceed without the distraction of conflict. But Mr. Shi said he was not sure the government had “that kind of patience” to wait until after the gathering before taking some sort of action. In a surprising opinion article on the India Today website over the weekend, a professor of international relations at Fudan University in Shanghai, Shen Dingli, wrote that Beijing needed to “revise its stance” and “employ a more effective approach” that maintained China’s “  ‘smiling’ image. ” The new president of the Philippines, Rodrigo Duterte, has signaled that he will be more accommodating toward China than was his predecessor, Benigno S. Aquino III. The case before the tribunal was filed at the initiative of Mr. Aquino, whose term ended June 30. Soon after the case was filed, China began building artificial islands in the Spratly archipelago, much of which is claimed by the Philippines, in a move that many saw as a demonstration of contempt for the international court system. Experts in international law said that negotiations could be the most positive outcome of the case. In 1986, some noted, the United States ignored a ruling from the International Court of Justice that declared its mining of the harbors of Nicaragua to be illegal. Washington had not ratified the Convention on the Law of the Sea, and it still has not. But the ruling 30 years ago by the judges in The Hague emboldened congressional critics to cut funds for the Reagan administration’s campaign against the Sandinista government in Nicaragua, and it galvanized countries in Central America to seek a settlement of the conflict. China is not expected to vacate or dismantle the artificial islands it has built. That makes the legal arguments important, analysts said. “ “The tribunal rulings will move the goal posts towards the Philippines and the smaller countries,” said Markus Gehring, a lecturer in law at Cambridge University. In Manila, the former foreign secretary, Albert F. del Rosario, who brought the case after years of failed negotiations with China, said the path was now open for a lasting settlement of disputes in the South China Sea. “The award provides a basis to further talks and cooperation to encompass all parties, including China,” he said.'"}, "time": 1742564602.42809}