{"duration": 0.050171613693237305, "input_args": {"text": "'on November 6, 2016 3:40 pm · \\nTrying to catch the liar of liars in a lie isn’t hard. Getting him and his campaign to acknowledge that Trump is the liar of liars is. Same thing with bullying, but The New York Times put together a spread of all the bullyish things Trump has said and tweeted, and to whom. Now, the Toronto Star ‘s Daniel Dale has been tracking Trump’s lies for just six weeks, and the paper has compiled a complete list of those lies, which you can find here . \\nThere are literally hundreds of lies in Trump’s speeches. They’re not all 100% unique, but this is probably the final and ultimate proof that Trump will say anything to smear anyone, including his enemies, while keeping his supporters happy. \\nIs there any presidential candidate in history that has lied this much? Tons of people claim Hillary is a master liar, but first, she’s actually more honest than most politicians. Second, even if she could be considered anything like a master liar, she still could not compete with Trump the Liar in any way, shape or form. \\nThe Star put the lies into a whopping 20 categories: Clinton’s policies, WTF, Daesh/Middle East, Clinton’s record, African Americans/Inner cities, The Clintons’ corruption, Rigged election, Trade/Economy, Health care, Trump’s endorsements, Refugees/Immigration, Polls, Obama’s record, The campaign, Russia, Trump’s record, Taxes, Sex assault allegations, Clinton’s health and Government corruption. \\nThey also compiled a list of the top 10 types of lies Trump has told and gave more detailed analysis, beginning with, “The electoral system is rigged.” Of course, it’s rigged against him: \\n“After plummeting in the polls after the first two debates, Trump began to repeatedly question the fairness of the election. ‘Rigged’ became his catchword. \\nHe claimed Hillary Clinton campaign workers hired ‘thugs’ to cause violence at his rallies, twisting the evidence from an undercover video to unfairly disparage Clinton. He claimed there was widespread voter fraud in Philadelphia, Chicago and St. Louis — cities with large black populations that heavily favour Democrats. \\nIn Greeley, Colo., Trump told his supporters if they don’t trust mail-in ballots, they should vote again in person. So, one did. Trump supporter Terri Lynn Rote, a 55-year-old from Iowa, was charged by police for suspicion of voting twice.” \\nNobody’s committing voter suppression and fraud quite like Trumpsters and Republicans. \\nAnother is, “Muslims are risky.” This touches on his assertions that we know nothing about refugees coming from Syria, who could be the great Trojan Horse of our time: \\n“His claims that Syrian refugees — 99 per cent are Muslim — are terrorists plays to the fears of the “other,” even though they are extensively vetted and are predominantly women and children. And their numbers is nowhere near Trump’s claims — about 13,000 have been admitted to the United States in 2016.” \\n“The polls favour Trump.” Har de har har – Trump only looks at the polls he likes, and they’re usually unscientific online polls or other dubious polls. Very few of the established, scientific polls favor him. Nevertheless: \\n“It seems clear Trump manipulates, exaggerates or makes up polls that make it sound as if he is doing better than he actually is. This ‘poll denialism’ gives his supporters licence to dismiss negative polling data, suggests CNN. \\nHis false claims cast doubt on the legitimacy of mainstream polling — and perhaps even the vote itself. If supporters feel Trump should be doing better, then the idea of a rigged election seems more credible. \\nOn Oct. 24, he said ‘I won the last two debates, and every poll showed it.’ In fact, every scientific poll showed that he lost. \\nOf course, when unscientific online polls came out in his favour, Trump was quick to promote — and exaggerate — those numbers.” \\nBut these are just a few of his biggest, most repeated lies. He has also: Falsely said on Twitter, “The failing NYTimes reporters don’t even call us anymore, they just write whatever they want to write, making up sources along the way!” Falsely said, “By ‘open borders,’ [Hillary] means totally unlimited immigration.” Falsely said, “Hillary’s plan includes an open border with the Middle East.” Falsely called NBC anchor Lester Holt, the moderator of the first debate, “a Democrat.” Falsely said, “Wow, just came out on secret tape that Crooked Hillary wants to take in as many Syrians as possible.” Falsely said the U.S. provided Iran “$150 billion” as part of the nuclear deal. Falsely said, “In San Bernardino, many people saw the bombs all over the apartment of the two people that killed 14 and wounded many, many people…Muslims have to report the problems when they see them.” Falsely asserted that Clinton has “been fighting ISIS (her) entire adult life.” Falsely said, “All together, the Hillary Clinton plan would bring in 620,000 refugees in her first term.” Falsely claimed he had been acknowledged to be correct in declaring NATO “obsolete because it doesn’t cover terror;” falsely suggested NATO created an anti-terror position because of his comments. Falsely claimed Clinton didn’t release cholesterol or EKG information Falsely said sexual assault allegations against him “have been largely debunked.” Falsely said, apparently of sexual assault accuser Summer Zervos, “The one young lady has five family members saying what she said is absolute nonsense.” Falsely said “I did not. I did not” to Clinton’s charge that he thinks Climate change is a “hoax perpetrated by the Chinese.” Falsely said, “I was against going into Iraq. And it’s so well-documented.” Falsely said, “Our taxes are so high. Just about the highest in the world.” \\nAnd so many more, just in the last six weeks! Yes, many of them are repeats, but lies are lies. If Trump sees this, he’ll likely throw a livid fit about it and claim that the paper’s lying, and continue to sell the myth that he’s not the liar of liars being caught in a squillion lies. \\nTo see the full list and detailed analysis, click here . \\nFeatured image by Chip Somodevilla via Getty Images Share this Article! Author: Rika Christensen Rika Christensen is an experienced writer and loves debating politics. Engage with her and see more of her work by following her on Facebook and Twitter . Search '"}, "time": 1742628329.8544016}