{"duration": 0.04748725891113281, "input_args": {"text": "'Email \\nIn case this election wasn’t already infuriating enough, here’s something that’s really going to make your blood boil. With hours to go before polls close, voter watchdog groups across the country are reporting that many laser tag establishments are staying open today. \\nThis is seriously alarming news. \\nIn what appears to be a concerted effort to prevent Americans from casting their ballots on time, dozens of laser tag locations are keeping normal business hours on Election Day, inviting one and all to enjoy nonstop laser tag action with all the coolest terrain and equipment. \\nIf true, this could represent voter suppression on an unprecedented, scarcely conceivable scale. It’s appalling to see laser tag places—some of them located within blocks of polling stations in swing states—deploying everything from signs to roadside billboards to social media posts in an attempt to stop Americans from exercising their civic duty. Just take a look at this truly disgusting tweet: \\nGeorge Washington is rolling over in his grave right now. \\nAccording to Leanne Holst, spokesman for the watchdog group Voter Vigilance, laser tag may only be the tip of the iceberg. \\n“Some of these laser tag facilities are continuing to operate roller rinks, 18-hole mini golf courses, and go-kart tracks in a shameless ploy to lure voters as far as possible from the booths,” said Holst. “It’s an utterly transparent tactic, and the saddest thing is just how effective it can be. Laser tag arenas represent a grave, immediate threat to the democratic process.” \\nBelow, via Voter Vigilance, is a partial, ongoing list of laser tag places that have not closed for Election Day, and several with the sheer audacity to offer off-peak, daytime discounts. Lightspeed Go-Karts & Laser Tag (Greenfield, WI) Code Red Laser Tag (Dallas-Fort Worth, TX) Laser Tag Kingdom (Monroe, NH) QZAR (Carle Place, NY) Laser Quest (numerous locations nationwide) Zap Zone (Sterling Heights, MI) Battle Blast Laser Tag (Las Vegas, NV) Lazer Kraze Laser Tag (Erlanger, KY) \\nIf you know of a laser tag place in your district that remains open today, do not be silent. Post their names and pictures in the comments so that we can put a stop to this assault on democracy before any further damage is done.'"}, "time": 1742563876.0517428}