{"duration": 0.06073355674743652, "input_args": {"text": "'Fitzgerald Griffin Foundation October 29, 2016 \\n[Classic: January 22, 1998] — Suddenly nobody is questioning Paula Jones’s veracity anymore. Mrs. Jones told a simple story and has stuck with it, while the president has shifted ground, equivocated with his patented “carefully worded denials,” and let his thuggish, blundering, and very expensive lawyer handle public relations. \\nThe Clinton team’s line, echoed by the major media until recently, has been that Mrs. Jones is “trailer-park trash” whose allegations are credible only to dirty-minded right-wing Clinton-haters. Never mind that her allegations are consistent with a great many other allegations from a great many sources. The Clinton strategy was to scare her off, and then, when that didn’t work, to make her character the issue, leaking their own allegations to the press. \\nBut her tenacity created enormous pressure, forcing the president to make a humiliating appearance in her presence a few days ago to give his deposition — and possibly to try to tamper with other witnesses. Only he knows how many other potential witnesses there are. \\nThe new charges of creepy lechery and criminality have finally cost Clinton his protective press. Though Newsweek spiked its own scoop, the story exploded anyway. All those journalists who have covered for Clinton now feel he’s yanked the rug out from under them once too often \\nAnd it happened because a story they didn’t want to dignify with coverage refused to go away. The story Newsweek spiked was written by Michael Isikoff, who had left the Washington Post in fury two years ago when the paper spiked a similar story he’d written on the Jones suit. But now the “respectable” press has finally caught up with the “crazy” press, leaving Hillary Clinton to repeat her usual gripe — Bill’s just the victim of someone’s political agenda — to an empty gallery. \\nClinton is standing on a precipice, staring down into the abyss of impeachment and prison. One nudge — another story, witness, allegation, or tape recording — could push him over. And the market value of any damaging evidence has skyrocketed, with the media fighting fiercely for the kind of information they used to spurn. He’s at the mercy of any bimbo who wants to step forward. \\nAfter being driven from office, Richard Nixon was able to make a comeback by claiming, however speciously, that his motive had always been to defend the dignity of the presidency. That’s a claim Clinton won’t be able to make. If he seduced a twenty-one-year-old White House intern and urged her to perjure herself for his sake, the dignity of the presidency was the last thing on his mind. Nor will he have the diehard it-didn’t-start-with-Watergate defenders Nixon had. In Clinton’s case, it started long ago in Arkansas. \\nHe arrived in Washington with a trail of sleazy rumors, some of them substantiated. The “respectable” press ignored all that, including the fact that Gennifer Flowers had enjoyed rapid promotion as a state employee (and had tapes of Clinton urging her to lie about their liaison). It ignored “right-wing” reports that he’d used state troopers to procure women. Such stories illustrated his readiness to abuse power for sleazy purposes, but they were treated as cheap sex gossip. When Paula Jones told her story, it fit the pattern — but was rejected as unworthy of serious attention. \\nNow that the pattern is undeniable, Clinton is still Clintonizing — issuing new carefully-worded-denials, as if he might yet exculpate himself with verbal cleverness. It hasn’t sunk in that he no longer has many supporters who will seize on any excuse for believing his version. His guilt isn’t an epistemological puzzle. \\nSupporting Clinton has become extremely costly. He has destroyed the Democrats’ congressional majorities in both houses, and though he managed to win reelection (by methods that will now get redoubled scrutiny), he has destroyed his own presidency. And his disgrace will be contagious. \\nThe major media should not be allowed to ask: “How were we supposed to know?” It’s their business to know — and to inform the public. But their job had to be done by Paula Jones and the “right-wing” press. ### \\nThis is one of 82 essays in Joe Sobran’s collection of his writing on the President Clinton years, titled Hustler: The Clinton Legacy , which has just been republished by FGF Books.'"}, "time": 1742563393.7538526}