{"duration": 0.057290077209472656, "input_args": {"text": "'— Shane Goldmacher (@ShaneGoldmacher) October 29, 2016 \\nThe Clinton campaign’s John Podesta and Robby Mook had a conference call with reporters following the FBI director’s letter to Congress yesterday to let everybody know there’s “nothing to see here”: Podesta says on call that Comey letter was \"Long on innuendo and short on facts\" \\n— Zeke Miller (@ZekeJMiller) October 29, 2016 Podesta on Comey: \"By providing selective information, he’s allowed partisans to distort & exaggerate to inflict maximum political damage\" \\n— Zeke Miller (@ZekeJMiller) October 29, 2016 Podesta spinning: “No indication that this is even about Hillary” \\n— Zeke Miller (@ZekeJMiller) October 29, 2016 Podesta: \"We’re calling on him to come forward and give those answers to the American public\" \\n— Zeke Miller (@ZekeJMiller) October 29, 2016 Podesta: “There’s absolutely nothing that [Huma\\'s] done that we think calls into question anything that she’s done…we stand behind her” \\n— Zeke Miller (@ZekeJMiller) October 29, 2016 Podesta: \"We are not charging him with anything other than taking an unprecedented step for which he owes the American public an explanation \\n— Zeke Miller (@ZekeJMiller) October 29, 2016 \\nDuring an address to the media yesterday after Comey’s letter to Congress was reported, Hillary Clinton claimed it was sent only to Republicans members of Congress, which is false . Here’s Podesta’s attempt to spin Hillary out of a lie: Podesta on Clinton saying letter was sent only to GOP: “I think she had seen the front page of the letter” \\n— Zeke Miller (@ZekeJMiller) October 29, 2016 Last night, @HillaryClinton said Comey sent letter to GOP members. Podesta now say they had only seen 1st page of letter and Dems were cc\\'d \\n— Jeff Zeleny (@jeffzeleny) October 29, 2016 \\nBecause Hillary would have never lied, right? In his endorsement of Hillary, former CIA Director Mike Morell called Clinton prepared and “detail-oriented.” So much for that . @ZekeJMiller pretty pathetic excuse \\n— Carol McIlwain (@carolfoxlover) October 29, 2016 @jeffzeleny @HillaryClinton They should have known such letters typically addressed to committee Chairmen w/ other committee members Cc\\'d. \\n— Doug Sheridan (@dougsheridan) October 29, 2016 \\nDocuments with the letter “C” in them seem to confuse Hillary. Trending'"}, "time": 1742563847.1423502}