{"duration": 0.05223965644836426, "input_args": {"text": "'The mother of a schoolgirl rape victim has said Manchester bomber Salman Abedi was part of a group who waged a   campaign of intimidation against her daughter and family. [Salman Abedi was an associate and childhood friend of Bilal Ahmed, who was jailed with two others for a total of 29 years in 2016 for taking part in the brutal gang rape of the   .  Members of the rapists’ South Manchester community “intimidated and goaded” the victim and her family members throughout the trial, and hurled abuse and blew kisses in court on the day the trio were jailed. The victim’s mother told the Mail on Sunday she is convinced Abedi was part of the mob who intimidated her and her husband outside court, asserting that she recognised Abedi’s name as soon as it became public following the Manchester attack. Concerned about violent imagery on the social media pages of Ahmed and his associates, the    from Cheshire said she reported them to the   hotline in February last year but believes no action was taken. “Now I see Salman, who clearly hung around with them, has become a suicide bomber. So clearly they didn’t look into what I told them properly,” she said, adding: “They are all friends and are ending up terrorists and rapists. “At the time it made me think another one could go on to commit a terrorist act and Salman clearly has. ” The    private schoolgirl, who had little experience with boys, was lured to a hotel in   Manchester by the attackers who had spent the previous night there celebrating Eid. The victim then became involved in what she believed to be a game of hide and seek, before being forced into a room by the group, who then took turns to rape her after deciding she was “easy prey” according to the judge. Speaking to the Mail last year on the campaign of harassment waged against the family, in which she said crowds numbering as many as 50 family members and friends of the attackers showed up to offer support to the rapists, the victim’s mother said: “I was frightened throughout and my husband was frightened. There were so many of them and many of them would goad me when I walked past and deliberately try to intimidate us. “It was scary. If this is what it does to us, then what would this be like for the victim of a rape case?” On Friday, Breitbart London reported that Abedi was part of an   gang who accused teachers of “Islamophobia” for criticising terrorism. During his time at Burnage Academy for Boys in Manchester between 2009 and 2011, the Manchester bomber was reportedly part of a group who took offence at a teacher who “asked what they thought of someone who would strap on a bomb and blow people up”. According to sources talking to The Times, the “group went to complain to their [Religious Education] teacher saying it was Islamophobic”.'"}, "time": 1742561967.0814111}