{"duration": 0.06294631958007812, "input_args": {"text": "'Discover Little Known Health Secrets and Useful Tips For Healthy Living! First Name Indian Man Mahashta Murasi Claims He’s 179 Years Old \\nA retired cobbler from northern India, Mahashta Mûrasi, claims he was born in January 1835, making him not only the oldest man on earth, but the oldest to have ever lived, according to the Guiness World Records. This would make him 179 years old. According to indian officials, the man was born at home in […] Man Diagnosed as ‘Comatose’ for 23 years Was Actually Fully Conscious \\nby Jonathan Benson | Natural News Imagine being stuck in your bed, conscious but unable to speak or move, for a quarter of your life, while everyone around you thought you were just a comatose “vegetable.” This is what happened to 50-year-old Rom Houben of Belgium, who back in 2006, and later reported in 2009, was […] Nestle CEO says You Shouldn’t Have the Right to Water \\nGet ready to feel infuriated: the CEO of Nestle, Peter Brabeck, has been caught on video saying he believes water should not be a public right, that instead it should be something only the wealthy have access to. By Matt Hall — Staff Writer As Nestle is the 27th largest company in the world and does […] Chia Seeds Health Benefits \\nby Kris Gunnars – Authority Nutrition Chia seeds are among the healthiest foods on the planet. They are loaded with nutrients that can have important benefits for your body and brain. Here are 11 health benefits of chia seeds that are supported by human studies. 1. Chia Seeds Deliver a Massive Amount of Nutrients With […] Nature’s Cancer Prevention – Vitamin B17 \\nHave you ever heard of vitamin B17? Maybe you have heard of its other name, Laetrile. Article by Janet Hull Americans cannot access vitamin B17 because the FDA took it off the market in the 1970s, and removed it from the B-Complex vitamins. It is unlawful for any health practitioner to administer this vitamin to patients. […] Illustrations Show Exactly What It’s Like To Have A Panic Attack \\nAnxiety disorders are a quickly growing concern as over forty million Americans find themselves in a fight to cope. Panic attacks effect a varying percentage of those diagnosed with anxiety. It can creep up on a person and strike when they are waiting in line at the store, talking to their children’s teachers, playing basketball or any […] Best Sore Throat Home Remedies \\nHome remedies for sore throat. In this article we will explore some of the most effective home remedies for sore throat. A sore throat is a common condition that often accompanies a cold and can be caused by either a virus or bad bacteria living in the throat. Other causes of sore throats include dry heat, […] MMR vaccines called one of the ‘greatest scandals in medical history’ \\nby J.D. Hayes – Natural News The former chief scientific officer for Britain’s Department of Health who was responsible for deciding if medicines and vaccines were safe for use among the general public says his former employer is guilty of “utterly inexplicable complacency” regarding the mumps, measles and rubella shot. The UK’s Daily Mail Online reports that […] Honey Cleansing: Wash face with honey for clear skin! \\nWhat’s my secret to having clear skin? It’s washing my face with honey! Washing your face with honey can really help you have clear skin and here’s how to do it! by Lauren – Empowered Sustenance Yes, I wash my face with honey! I’m washing my hair with honey… so it only makes sense that I would […] Turmeric Tea Golden Milk Recipe \\nby Katie – WellnessMama.com Turmeric is a root that has been used for thousands of years by many cultures for its potent anti-oxidant and anti-inflammatory properties. Below is my recipe for the healing golden Turmeric Tea.I love it for cooking in foods like curries and as an herbal remedy. Especially this time of year, turmeric is a […] 8 Things People With Hidden Depression Do \\nThough public understanding of depression has improved somewhat over the years, we as a society still frequently misunderstand or overlook hidden depression and its symptoms. by JANE SCEARCE – LifeHack.org Because of the continuing stigma, we don’t always recognize when people in our lives are struggling with this illness. Worse, too many people go undiagnosed because of […] Holistic Tinnitus Remedy That Really Works! \\nHave you been suffering from tinnitus for some time now? If you have, you must know how painful and frustrating all those noises in the ear can be. They can strike anytime in the day, and can become worse in the night. You would probably give anything to get some relief. But that’s of course […] Cherries Help Fight Arthritis & Gout \\nby Arthritis Foundation Generations of people have reported that cherries help keep painful osteoarthritis (OA) and gout flares in check. Now, scientists are putting this popular folk remedy to the test, with promising results. Researchers have tested different amounts of several varieties of cherries in almost every form, from juice to pills. And though most […] Frankincense More Effective Than Chemotherapy in Killing Ovarian Cancer Cells, Study \\nBy Stephen Adkins – University Herald Leicester University researchers have found a cure for ovarian cancer in an aromatic gum resin obtained from an African tree. Researchers say that AKBA (acetyl-11-keto-beta-boswellic acid), a chemical compound in the resin, has cancer-killing properties. It has the potential to destroy ovarian cancer cells. Frankincense (gum resin) is the resin […] Subscribe For Free! Discover Little Known Health Secrets and Useful Tips For Healthy Living! First Name '"}, "time": 1742628557.0880296}