{"duration": 0.029030799865722656, "input_args": {"text": "'Having not yet recovered from the severe earthquakes of recent months, central Italy was struck by 10 earthquakes in succession over a   period Wednesday, all of them registering over 4. 0 on the Richter Scale. [Wednesday’s earthquakes varied in magnitude between 4. 1 and 5. 7, and several lasted a significant amount of time.  The first quake, measuring 5. 3, struck the beleaguered city of Amatrice at 10:25am local time, and the shock waves could be felt in contiguous regions and all the way south in Rome. Amatrice had already been laid waste by a powerful earthquake last August 24, which destroyed the town and left nearly 300 dead. After the quake, the mayor of Amatrice announced: “The town is gone. ” The second quake —  the strongest of all —  hit just a few miles from the epicenter of the first, 45 minutes later. In all, five of the 10 quakes struck within five miles of Amatrice.  The bell tower of the church of Sant’Agostino was one of the few monuments in Amatrice to survive last summer’s earthquake, but Wednesday’s quakes finished the job, bringing the tower crumbling to the ground. To add insult to injury, central Italy had been covered with snow prior to the quakes and was suffering from exceptionally cold temperatures. Civil Protection Chief Fabrizio Curcio said that the wide scope of the tremors, along with the snow, made a comprehensive assessment of the situation difficult. “The situation is quite complicated,” Curcio said. “We are receiving reports from all over the nation. Obviously the quake was felt clearly all over the center, as far as the capital. ” In Rome, children were sent home from school at mid morning, public buildings were evacuated and authorities shut down the subway system. Wednesday’s seismic activity was the third major event of its kind in Italy in less than half a year. The August 24 earthquake demolished several towns of central Italy, including Amatrice, and three more quakes during the night of Oct   wreaked still more devastation and displaced thousands of persons. The October earthquakes reportedly shook Rome’s world heritage ancient buildings, including the Colosseum and Pantheon, and some of the damage has not yet been repaired. Follow Thomas D. Williams on Twitter Follow @tdwilliamsrome'"}, "time": 1742562345.727314}