{"duration": 0.08650803565979004, "input_args": {"text": "'Kevin Green’s lawyers were pleading with the governor for mercy. It was spring 2008, and Mr. Green, a    who had shot and killed a grocery owner, was on Virginia’s death row. His woes, his lawyers said, dated to childhood he was born with his umbilical cord wrapped around his neck, repeated three years of elementary school and never learned to tie his shoes. His was precisely the kind of execution a young Tim Kaine, a   lawyer with a deeply felt revulsion for capital punishment, would have worked himself to the bone to stop. “Murder is wrong in the gulag, in Afghanistan, in Soweto, in the mountains of Guatemala, in Fairfax County,” he once declared, as one of his clients was about to be put to death. “And even the Spring Street Penitentiary. ” But on the night of May 27, Mr. Green was led into the execution chamber at the Greensville Correctional Center, strapped to a gurney and hooked up to intravenous lines. Shortly after 10 p. m. he became the fifth person put to death while Mr. Kaine was the governor of Virginia. For Mr. Kaine, now a senator and Hillary Clinton’s newly named running mate, no issue has been as fraught politically or personally as the death penalty. His handling of capital punishment reveals a central truth about Mr. Kaine: He is both a man of conviction and very much a politician, a man of unshakable faith who nonetheless recognizes  —   and expediently bends to, his critics suggest  —   the reality of the Democratic Party and the state he represents. He opposes both abortion and the death penalty, he has said, because “my faith teaches life is sacred. ” Yet he strongly supports a woman’s right to choose and has a 100 percent rating from Planned Parenthood. And Mr. Kaine presided over 11 executions as governor, delaying some but granting clemency only once. He cast his decisions in simple terms: As Virginia’s governor, he was sworn to uphold the law  —   a message that helped him get elected governor. Calm, never letting his passion overtake reason and open to compromise, Mr. Kaine, 58, is well liked even by many Republicans he has worked with. His centrist appeal is one reason Mrs. Clinton added him to her ticket. But some death penalty opponents cast his decisions as political survival and ambition. “Tim is a politician,” said Jack   who served as the executive director of Virginians for Alternatives to the Death Penalty when Mr. Kaine was the governor. “Even though they say they’re not running for the next office, there’s always something coming up. ” Deep inside, Mr. Kaine’s allies say, his role in seeing prisoners put to death tore at him. On days when an execution was scheduled, said Wayne Turnage, his former chief of staff, the normally outgoing governor would be “less communicative, and quietly pensive,” and when the moment was near, he would retreat to his corner office and remain there alone. When it was over, an aide would enter quietly, to report the dead man’s last words. “I can’t say that I saw him praying,” Mr. Kaine’s former chief legal counsel, Larry Roberts, recalled. “I’m sure that he was. ” Wherever Mr. Kaine could hold to his ideals, his supporters say, he did. Though he commuted only one sentence, to life in prison, Mr. Roberts said the governor’s team concluded the inmate was mentally unfit for execution, using an expansive interpretation of Supreme Court case law that Mr. Kaine’s predecessors might not have employed. When the Supreme Court took up the constitutionality of lethal injection in 2008, Mr. Kaine suspended executions until the court ruled to allow the procedure. And when Republicans in the General Assembly tried to expand use of the death penalty to cover more crimes, the governor blocked them. “If there was any death penalty bill that came up, it would go into the incinerator, I will tell you that,” Mr. Turnage said. “There was no sentiment for expanding the death penalty. That wasn’t going to happen. ” Mr. Kaine declined to be interviewed. But in a 2009 interview with The   toward the end of his term, he said each clemency decision had been “very painful,” though his experience as a lawyer had prepared him. “I’ve eaten the last meal, and I’ve held the guy’s hand, and I’ve been to the Supreme Court, and I’ve been to the protests, and I know this very, very well,” he said. “And because of that, it was kind of demystified. ” Mr. Kaine was a new associate at a Richmond law firm, specializing in civil litigation but eager to carve out a portfolio in civil rights, in the   when he took the first of two pro bono capital punishment cases he would handle. His client was Richard Lee Whitley, convicted of murder for strangling and slitting the throat of an elderly female neighbor, and then sexually assaulting her corpse, after an alcohol and drug binge. It was “not a sympathetic case,” but Mr. Kaine, driven by his faith, “was extremely passionate about it,” said his   Tom Wolf, later Mr. Kaine’s law partner and close friend. “He said there were a lot of people on death row who hadn’t had a fair trial, and there were not nearly enough lawyers willing to take those cases. ” Virginia’s Supreme Court declined to block the execution, so Mr. Kaine turned to the federal courts. He argued that Mr. Whitley had not received a fair trial, because his   lawyer had failed to investigate or introduce evidence of the psychological damage Mr. Whitley had suffered as a child. The judges, Mr. Wolf said, “didn’t buy it. ” Neither did the Supreme Court, which rejected Mr. Kaine’s request for a stay after Virginia’s governor, Gerald L. Baliles, refused a petition for clemency. On July 6, 1987, Mr. Whitley was executed in the electric chair. Mr. Kaine did not witness it  —   Mr. Whitley did not want him to, a Kaine aide said  —   but was intent on being with him in the hours before his death. Along with a priest, they shared Mass and the condemned man’s last meal. “I’m certain that Tim felt very close to him,” Mr. Wolf said. “It was important to him to let Richard know that he was there for him, no matter what, and that he wasn’t just filing papers for him, but that he regarded Richard as a valuable human being. ” In 2005, when he was the lieutenant governor and running for governor against Jerry Kilgore, a former state attorney general, he was fighting the perception that he was too liberal to lead the state. Issue No. 1 was the death penalty Virginia was second only to Texas in executions since 1976. “People thought it was almost disqualifying to be against the death penalty in Virginia,” said Bob Holsworth, a longtime political analyst in the state. Candidates who held the stance were routinely dismissed, he said, as being “soft on crime. ” So Mr. Kaine’s team prepared, developing a message that cast the issue in terms of his faith, pointing out his work as a Jesuit missionary in Honduras. Then, in October, Mr. Kilgore ran an advertisement featuring the father of a murder victim whose killer had been represented by Mr. Kaine. “Tim Kaine says that Adolf Hitler doesn’t qualify for the death penalty,” the grieving father said. The Hitler reference drew condemnation, and the Kaine team responded with its own ad, featuring a serious Mr. Kaine staring straight into the camera and telling voters that he wanted to “set the record straight,” and explaining that despite his religious objections, “as governor I’ll carry out death sentences handed down by Virginia juries because that’s the law. ” The ads and   messaging proved a turning point, said David Eichenbaum, Mr. Kaine’s media strategist. “Once many of these voters learned he was a man of deep faith and actually was a missionary,” Mr. Eichenbaum said, “all of a sudden he wasn’t so liberal anymore. ” The first big test of Mr. Kaine’s promise came in April 2006, three months after he took office. Dexter Lee Vinson, 43, was set to be executed for abducting and killing his former girlfriend, whose mutilated body was found in a vacant house. A Vatican representative and Roman Catholic bishops in Arlington, Va. and Richmond asked Mr. Kaine to spare him. One of Mr. Vinson’s sisters, Jewel Bailey, expressed hope that Mr. Kaine’s religious convictions would win out. “My thing is, ‘Why did you take the position that you have when you don’t believe yourself in the death penalty? ’” she said at the time. “The Bible says, ‘Thou shall not kill,’ and that’s what I’m going to stand by. Thou shall not kill. ” Inside the governor’s office, Mr. Kaine and his lawyers were following a careful protocol devised by an aide to a previous Democratic governor of Virginia, L. Douglas Wilder. The governor would have no direct contact with family members or inmates’ lawyers. Instead, the governor’s staff lawyers would prepare for him a detailed memo with competing arguments  —   the most aggressive case for clemency and the most aggressive case for execution. Mr. Kaine would pepper the lawyers with questions, including whether an inmate might be innocent, or mentally incompetent to face execution, or whether there had been gross procedural irregularities. But he almost always deferred to the findings of courts in the one case in which he granted clemency, he concluded that the inmate’s mental status had changed since he had been convicted, said Mr. Roberts, his former chief counsel. Mr. Kaine took comfort, Mr. Roberts said, in the fact that as the governor, he did not have to actually sign death warrants. It was simply up to him to decide whether to intervene. “I think he viewed himself as the final decision maker, with a caveat,” Mr. Roberts said, “that it was death unless we stepped in, so he was never deciding whether to impose the penalty. ” Mr. Vinson’s was the first execution of Mr. Kaine’s term as governor. Ten more would be put to death, including one of the “D. C. snipers,” John Allen Muhammad, and Mr. Green, whose clemency petition to Mr. Kaine said he was a “mentally retarded man by every reliable scientific measure. ” “This was a case that he could have intervened on, and it wouldn’t have taken much to say, ‘I’m concerned enough to not let the execution go forward,’” said Robert Lee, who worked on Mr. Green’s clemency petition, which asked Mr. Kaine to “err on the side of mercy and life. ” In a statement on his decision, Mr. Kaine said Mr. Green’s sentence had been upheld by several courts, and that the Supreme Court had declined to hear it. “Having carefully reviewed the Petition for Clemency and judicial opinions regarding this case, I find no compelling reason to set aside the sentence that was recommended by the jury, and then imposed and affirmed by the courts,” he wrote. “Accordingly, I decline to intervene. ”'"}, "time": 1742628514.7706687}