{"duration": 0.0526273250579834, "input_args": {"text": "'Michael Moore is totally failing at getting Trump supporters to stop sharing the clip from his anti-Trump movie Posted at 5:23 pm   Greg P. \\nAs we told you yesterday , Michael Moore is royally pissed that Trump supporters having taken a 4-minute clip form his anti-Trump movie out of context and are sharing it as evidence of why Donald Trump will win in November. \\nFirst he tried Snopes to try and convince people that his movie really isn’t pro-Trump: Snopes points out those who have falsely edited a clip from my film to make it seem like something it\\'s not. https://t.co/4u0XwyKU37 \\n— Michael Moore (@MMFlint) October 28, 2016 \\nAnd then he posted a clip from the end of the film where he rips on Donald Trump: Here\\'s the actual end to that scene in my film \"Michael Moore In TrumpLand\", the end Trump doesn\\'t want u to see: https://t.co/RN10G91wGS \\n— Michael Moore (@MMFlint) October 28, 2016 \\nExcept as of the publishing of this post, the anti-Trump ending has only had 15,000+ views:   \\nNow let’s compare that to the YouTube video of the pro-Trump portion of the film that Donald Trump shared yesterday: I agree, @MMFlint – To all Americans, I see you & I hear you. I am your voice. Vote to #DrainTheSwamp w/ me on 11/8. https://t.co/D7nBwkogBb \\n— Donald J. Trump (@realDonaldTrump) October 27, 2016 \\nTrump’s link has 800,000+ views, and counting: \\nAnd keep in mind, this doesn’t even take into account the thousands and thousands of views different copies of this video have racked up. Like this single tweet with 25,000 retweets: If you make this go viral, Trump will win. It\\'s 4 minutes that makes the choice in this election crystal clear. #EarlyVoting pic.twitter.com/UOgqSfet6a \\n— Jared Wyand 🇺🇸 (@JaredWyand) October 25, 2016 \\nAnyway, Moore will be on Bill Maher’s show tonight where we’re sure he’ll continue to make the case that he really doesn’t want Trump to get elected, even though Trump supporters love what he had to say: I\\'m on Bill Maher tonight. HBO. Live. 10pm ET. Our promise back in May: 2 \"personally stop Trump, 2 stand in front of WH door if necessary.\" \\n— Michael Moore (@MMFlint) October 28, 2016 \\nAs for that threat, our money is on the Secret Service figuring out a way to deal with the dual threat of a Maher–Moore roadblock. \\n*** \\nRelated:'"}, "time": 1742564035.7870133}