{"duration": 0.08574748039245605, "input_args": {"text": "'Comprehensive Economic and Trade Agreement (CETA): Canada and the EU By Jim Miles \\nMost interesting watching the progress of the Comprehensive Economic and Trade Agreement (CETA) between Canada and the EU through the various opaque backroom ministrations this past week. \\nNAFTA first \\nAs the progeny of North American Free Trade Agreement (NAFTA, 1994) it serves to refer to a bit of history. Former Prime Minister Brian Mulroney very recently on CBC said that NAFTA was a wonderful agreement. He said that its purpose generally was to help all economies but more specifically “to help Mexican workers” who at that time had been devastated by the devaluation of the peso (also 1994) due to capital flight from Mexico (one of the many outcomes of fiat currency markets). \\nUnfortunately, the record does not support this. Mulroney used the example that this year (2016) more Mexicans were returning home than entering the U.S., implying it was due to the NAFTA success. More realistically it has been due to the increasing police violence in the U.S. accompanied by the election cycle fought between a manipulative chicken-hawk liar and a misogynist xenophobic narcissist. \\nThe truth behind NAFTA is different. Yes thousands of jobs were created in the Mexican maquiladora along the U.S. border. These jobs were filled by workers who in general were displaced from their lands through a combination of two economic hits. First was the IMF and its “structural adjustment programs” (known and admitted failures, at least in an economic sense, not in a political control sense) applied after the 1994 debt collapse. This was quickly followed or accompanied by NAFTA which allowed ample cheap subsidized U.S. agricultural products to flow into Mexico, cutting the main basis of support for the agricultural sector. \\nNot only was NAFTA not good for Mexico, it also seriously affected well paying jobs in Canada and the U.S. as corporations moved their production to where the wages and benefits were lowest or, as for benefits, non-existent. Much of the increased trade was not due to increased economic activity but the recording of cross-border transactions that used to take place internally. Nowadays, views of the U.S. “rust belt” and the declining number of living wage jobs in both Canada and the U.S. testify to the negative impact of NAFTA—except for the corporations and their managers who have gained enormously. \\nAnother aspect of NAFTA that is of note is the political manipulations that occurred in Canada. NAFTA was essentially a Conservative creation under PM Mulroney, as above. The Conservative Party was devastated in 1993 in part due to NAFTA (but also due to other domestic failures)—the interesting part being that his replacement, Jean Chretien, Liberal leader, campaigned against it, but once in power accepted it as it was (with additional “side deals” and promises). \\nOne of its significant factors, other than selling out Canadian workers and resources, was the trade dispute settlement section, the appropriately labeled “Chapter 11” section. This allows for opaque, non-democratic, supranational (above national sovereignty), closed door arbitration panels staffed by selection rather than qualification (other than perhaps their pro-business financial status). Along with this is that a foreign corporation can sue the Canadian government for perceived loss of profits due to some Canadian regulation or policy, regulations that would generally serve to protect the environment, the health, benefits of Canadian workers, and the independent agricultural sector. \\nThis has resulted in many lawsuits against Canadian sovereignty that has cost the taxpayer billions of dollars in lawyers’ fees and settlements to companies that may or may not have intended to set up business here in the first place. It has also caused the government to change some of its regulations in favour of corporations. \\nNAFTA begets CETA \\nThe same indicators on dispute settlement occur with CETA. Many informed citizens object to corporations having supranational rights over sovereignty both in Canada and the EU; concerns that reflect the same “investor dispute settlement” mechanisms. Note also that it is “investor” dispute and not citizen dispute, meaning that the average citizen cannot sue either the government or the corporations for damages to health, benefits, wages et al. There is a lawsuit currently underway to challenge the constitutional legality of the agreement as it also overrides provincial, territorial, and First Nations jurisdiction. These are not national functions but can be effectively manipulated through various degrees of transfer payments and the good old fashioned crony benefit payment system. \\nThe Walloons opposed the “investor dispute mechanism,” in part because it would facilitate the loss of an independent agricultural sector (via Canadian corporations, in effect U.S. branch corporations, suing for agricultural benefits—much of Canada’s agricultural sector is already owned/controlled by a small number of supranational agribusinesses). \\nWhile listening to Scott Peterson on CBC discuss CETA and the Walloons, he said it was “amazing how money and politics are intertwined.” Well, really, if that is the ignorant level of commentary that CBC can provide, considering it abides by establishment guidelines [1], no wonder we get little truth from the media and the government—being intertwined themselves—concerning what is truly being negotiated with CETA. \\nBut Peterson also reiterated the tired old mantra, CETA will create jobs and promote growth. Kevin O’Leary also added his support indicating the agreement is “progressive,” another meaningless platitude when given without context (e.g., progressive for whom?). \\nJobs, growth, the middle class, values, and progressivity \\nPM Trudeau spoke this morning (Sunday, October 30, 2016) after signing CETA. It was almost a déjà vu moment, after having listened to Mulroney brag about jobs and progress with NAFTA. Even further, it has another similarity because it was the loathed Conservative government that began the secret negotiations, only to be defeated, in part because of that, only to have the Trudeau Liberals accept the agreement essentially as is—with a few “side deals” with Belgium and Wallonia—without allowing it to be voted on in a referendum. Do they not trust their ability to manipulate a referendum, relying instead on their false majority (with 39.5 % of the vote) in the House to give it legitimacy? \\nIn sum, very similar to the Mulroney/Chretien duo, and also very similar to our NAFTA partners, wherein the Democrats and Republicans are essentially two sides of the same coin—pretty much literally as it is the corporate-industrial-military coin that determines policy, not the House nor the ever absent referenda. \\nBut on. . . . the rhetoric from Trudeau this morning was quite repetitive, with the same old platitudes brought forth. He indicated “we need economic growth. .to contribute to society,” we have progressive “values and concerns very similar” to the EU, the dispute mechanism is a “progressive mechanism,” and Canada has provided “leadership . . . on values” with “like-minded countries.” Even though it needs to be ratified after signing, it has a “provisional implementation” clause (but that clause has not been ratified?) and we will “feel benefits immediately,” and it is “good for middle class.” \\nSounds great, but if NAFTA is our guide, not much benefit will be seen by the middle class, not much “progress” will be made (exactly how is that defined, Justin?), not many jobs will be created to lift the poor up into the middle class (maybe by Mexican standards).[2] And what really are our values? Corporate control over government? Intertwined networks of bankers, industrialists, militarists, politicians, and media telling us what is best for us? Can we go forever in our finite world with “economic growth” that is based on consumer extractive industries backed by corporate military power? \\nPhD—“piled higher and deeper,” conveyed by Mr. Harper, as he watches his nemesis follow exactly the same policies he had pushed for. The main benefactors of all trade agreements, none of which are “free,” are large corporations and the financiers and politicians that work within and alongside them. \\nIn sum \\nCETA is an agreement that reflects all that was negative about NAFTA. It provides the promise that further agreements (TTIP, TTP) will provide the same investor dispute mechanism that supersedes national sovereignty. It further disenfranchises the average citizen while enriching and empowering the corporate elite, again promising more for the future. It displays all the hollow rhetoric that is manipulated through the media, generally meaningless undefined platitudes without context or reference to the realities of existing agreements. \\nThe Trudeau government is simply reinforcing the Harper government that preceded it, using essentially the same verbiage but somehow with a kinder, gentler persona. And both reflect the will of the corporate political elites who chase the overall dream of global control of wealth and resources regardless of the detriment to the people or the environment. \\nNotes \\n[1] Prime recent example: CBC’s Natasha Fatah commenting on the Syrian war, asking a question about the “collateral effects” of the U.S. led attack on Mosul. So it’s no longer ‘collateral damage’ and assuredly a far cry from “war crimes” charges that are made against Russia and Syria for very similar actions against al-Nusra/al-Qaeda/ISIS in Aleppo. \\n[2] Another CBC asisde: Canada’s Finance Minister Morneau recognized that currently there is a large job “churn” that workers will need to get used to short term, insecure, “precarious” jobs; if this is the way the Finance Minister thinks—along with his cronies—it provides a more realistic picture of what a CETA future will hold for Canada, and other countries aligned inside trade deals. \\nJim Miles is a Canadian educator and a regular contributor/columnist of opinion pieces and book reviews for The Palestine Chronicle. Miles’ work is also presented globally through other alternative websites and news publications. This entry was posted in Business , Commentary . Bookmark the permalink .'"}, "time": 1742628563.83454}