{"duration": 0.0481724739074707, "input_args": {"text": "'Josh Fox on Dakota Access Pipeline Standoff: ‘Where the F*** Is Hillary Clinton Right Now?’   CREDIT \\nFilmmaker Josh Fox has a pretty good idea where Hillary Clinton is likely to be found starting Jan. 20. But before she makes her final play for the White House, Fox has a pressing question for the Democratic  . \\n“Where the fuck is Hillary Clinton right now?” Fox asked during his guest appearance on “Live at Truthdig” at the site’s Los Angeles headquarters. \\nThat was more of a pointed question than a literal one, since anyone with a television or smartphone can easily track down where Clinton is making her latest campaign stump speech. \\nMore specifically, Fox, who’s a climate activist and playwright as well as the director of the Oscar-nominated documentary “Gasland,” was wondering why Clinton wasn’t anywhere near the contested grounds of North Dakota where the ongoing clash over the Dakota Access pipeline is reaching a volatile point. \\n  \\nRemarking that “we all want to think that we would be on the right side” of history and that, for example, “if we were in Selma, we all would have marched with King,” Fox positioned Clinton squarely “on the wrong side of history right now” for maintaining a conspicuous silence about the DAPL battle. \\n“You cannot stand by when a racist occupying force that is run by the government of a rogue state is operating as an arm of the oil and gas industry, is attacking natives, is attacking protesters, is attacking people and torturing them in the ways that we saw in the Iraq War,” Fox said. “It’s unacceptable.” \\nFox was equally unsparing about Clinton’s environmental credentials. “Hillary Clinton is not an environmentalist,” he said. “Hillary Clinton is not adequate on climate change. And right now, she’s standing by while human rights abuses are unfolding in America where she’s running for president.” \\nThe director was making the media rounds to drum up support for the activists and members   allied protesters in North Dakota, some of whom faced off Thursday with police in riot gear as law enforcement and National Guard personnel forcibly removed protesters from their encampment near one of the pipeline’s construction zones. He was also putting out the word about the plight of fellow filmmaker Deia Schlosberg, producer of his 2016 documentary “How to Let Go of the World (and Love All the Things Climate Can’t Change),” who was arrested and hit with conspiracy charges earlier this month while shooting footage of activists at a North Dakota tar sands pipeline. Schlosberg has been charged with three felonies and may face 45 years in prison. \\nWATCH: Amy Goodman Explains Decision to Turn Herself In to North Dakota Authorities (Video) \\n“We need to drop all the charges immediately, we need her footage back—her footage was confiscated,” Fox said of Schlosberg. “We definitely need an outcry and an outpouring of support for our journalists who are facing jail time for doing what is a constitutionally protected activity.” Fox has posted a videotaped statement about his colleague’s plight, as well as information about a petition, on this promotional site for his latest work. \\nDespite his robust criticism of Clinton, Fox told Truthdig’s Sarah Wesley, Emma Niles and Donald Kaufman that he was more concerned about the possibility of GOP nominee Donald Trump winning this election. Fox, who had supported Democratic candidate and Vermont Sen. Bernie Sanders and served on the Democratic platform committee at last summer’s party convention, said he understood Sanders’ reasons for backing the Democratic ticket: “If Bernie Sanders’ legacy was to contribute to the election of Donald Trump, I think his whole life would have been a failure.” \\nAs for Green Party   Jill Stein? “I’m sorry. It’s immoral what she’s doing,” Fox said. “And I don’t care if I say this on air for the very first time—I spent eight years building the environmental movement, I spent eight years coast-to-coast building the [anti-]fracking movement, I went to 250 cities. I did not see the Green Party having a significant hand in the building of that movement.” \\nWatch the full interview below for more about Fox’s take on the presidential candidates, the Dakota Access pipeline crisis and how to be an effective activist (hint: Don’t try it at home):'"}, "time": 1742628417.2897532}