{"duration": 0.057302236557006836, "input_args": {"text": "'Share This \\nA police officer in Hope, Indiana was dispatched to an unusual car in a Dollar General parking lot. Much to his surprise, he found 25-year-old Erika Hurt unconscious with her body slumped in the front seat and her head tilted back. However, the situation would soon turn to horror when the police officer saw what was in the driver’s hand — and it was only made worse as he looked in the backseat. Erika Hurt \\nUnfortunately, the situation took a dark turn as soon as the officer opened the car door and saw what the woman was clutching onto — a heroin needle still in Hurt’s hand. The situation was only be made worse when he looked in the backseat to see the woman’s 10-month-old baby sitting there all alone, crying. \\nOfficers say that Hurt had overdosed on the drug and, after being revived by police, was quickly rushed to an area hospital where she is recovering. Since that time, Hurt has officially been charged with child neglect and possession of drug paraphernalia. Heroin needle still in Erika Hurt’s hand \\nThe troubling images were released to the public, and although most people understand why Town Marshal Matthew Tallent shared the image, a few naysayers have expressed their belief that it was inappropriate to show a woman in such a condition – but this isn’t one man you want to mess with. \\n“I’m trying to show people that this just isn’t a city problem. The heroin epidemic is leaking into small town America and it’s getting really bad,” he told Mail Online . “Not only did this woman overdose and nearly die but, had she not passed out from the drug, she would have driven out of the car park and could still have been driving while passed out or under the influence. She could have killed another innocent family.” \\nFortunately, Tallent did inform the public that the child was physically unharmed, but as he noted, things could have ended much differently. The drug problem here in America is very serious, and we’re seeing it seep into the crack and crevasses of every small town in our nation at this point. \\nIf ever there was an argument to better secure our border, this would be it. If I’ve learned one thing in this world, it’s that you can’t help anyone who doesn’t want to help themselves. With that being said, though, a lot fewer people would need such help if these drugs weren’t so easily making their way into this country. Build that wall, Mr. Trump.'"}, "time": 1742562068.3521554}