{"duration": 0.03368878364562988, "input_args": {"text": "'\\nZero Hedge \\nThe UN is a joke! \\nYesterday, for the first time since 2006, Russia failed to be re-elected for a spot on the UN Human Rights Council (UNHRC) - which until July was chaired by none other than Saudi Arabia - after being narrowly beaten by Croatia in a vote. Meanwhile, Saudi Arabia was successfully re-elected, despite vocal criticism from human rights organizations. The 47 places on the council are distributed on a regional basis, with staggered elections seeing a third of the body re-elected each year. Russia had finished its three-year term, and was running against Hungary and Croatia for the two available seats from Eastern Europe. \\nThe decision was close, and came down to just two votes: with Hungary far ahead, Croatia received the votes of 114 of the 193 member countries, and Russia was selected on 112 ballots. \\n\"It was a very close vote and very good countries competing, Croatia, Hungary. They are fortunate because of their size, they are not exposed to the winds of international diplomacy. Russia is very exposed. We\\'ve been in the UNHRC for several years, and I am sure next time we will stand and get back in,\" Russia\\'s UN envoy Vitaly Churkin said quoted by RT . Russia is eligible to run next year, against a new set of countries. \\nAhead of this year’s vote Russia came under concerted pressure from human rights organizations. “The non-election of Russia shows that the nations of the world can reject gross abusers if they so choose,” said executive director Hillel Neuer. “This makes the election of Saudi Arabia, China and Cuba even more preposterous.” \\nAs we reported earlier this week , a petition signed by 80 NGOs, including Human Rights Watch and Refugees International, asked the voting countries to \"question seriously whether Russia\\'s role in Syria which includes supporting and undertaking military actions which have routinely targeted civilians and civilian objects renders it fit to serve on the UN\\'s premier inter-governmental human rights institution.\" Russia dismissed the petition, published this week, as “cynical” and “dishonorable,” and said the accusations were motivated more by politics than by concern for human rights. Moscow, which has been conducting airstrikes in the country over the past year, says that it is acting legally, following an official call for assistance from the Syrian government, and insists that its war efforts are targeted at terrorists. \\nHowever, most perversely, in what was clearly a politically-motivated choice, Saudi Arabia sailed through the Asian regional ballot with 152 votes, and will sit on the UNHRC alongside China, Japan and Iraq for the next three years. '"}, "time": 1742564292.0450215}