{"duration": 0.0415804386138916, "input_args": {"text": "'PARIS (AP)  —   France’s Interior Ministry says the voter turnout so far in the first round of the presidential election is about the same as it was in 2012, when turnout was high. [At midday Sunday (local time) the ministry said that 28. 54 percent of eligible voters had cast their ballot, compared with 28. 29 percent in 2012.  Commentators have said a low voter turnout would benefit   candidate Marine Le Pen, whose voters are seen to have more enthusiasm and are more certain to vote in a low turnout election than supporters of some other candidates. Outgoing French President Francois Hollande has said the best message of this election would be “to show democracy is stronger than anything” by going out to vote. Hollande, who is not standing for   oversaw tight security measures for Sunday’s first round poll to help prevent disruption after Thursday’s deadly attack on the  . His government mobilized over 50, 000 police and gendarmes to protect polling stations. Voting in his political fiefdom of Tulle in Correze, southwestern France, Hollande said that “we are in such a time, and sadly it’s nothing new and not about to end now, when we must mobilize a lot of means. ” He called the measures a “guarantee to the French people this fundamental right of choosing their future. ” In Montreal, Canada, thousands of resident French nationals have waited in lines that snaked at one point to eight blocks to cast their votes in France’s presidential election. Polls opened Saturday morning in Canada’s main French speaking city, home to Quebec’s highest population of French nationals. French citizens lined up to vote at Montreal’s only polling station at Stanislas College in Outremont. The vote in mainland France is happening Sunday, but polling stations in France’s   overseas territories and in embassies around the world opened on Saturday to allow enough time to collate the vote results altogether.  '"}, "time": 1742562271.381141}