{"duration": 0.04732251167297363, "input_args": {"text": "'Email \\nMore water under the bridge. Am I imagining it or was it clear last year that the public was ready to abandon politics as usual, itself a repudiation of the Democratic and Republican parties? But here we are again. \\nMillions of words have been written about the two most disliked candidates in presidential history, and why not? They are dislikable. And they are the best candidates the two parties could produce. The two parties that the public had shown strong signs it was willing to repudiate. \\nClinton and Trump are the cream that rose to the top, each deserving to lead their parties and the parties each deserving to have them. Who best to lead the 99% into a more equitable society, the billionaire who brags about being rich or the billionaire-in-training? Now we know where we are but before that water went under the bridge there was a third way. The one Sanders didn’t take. \\nHe knew, given the rigged system, that he could only get attention running as a Democrat. That was smart. He pledged not to mount an independent run and to eventually support whoever became the nominee. That was smart. Let’s say whatever happened after that surprised even him. \\nIt soon became apparent that the traditional candidates from both parties couldn’t draw flies. Trump created all the excitement on the right and Sanders did the same on the left. Trump’s message was that you’re all chumps because you’re not like me. Sanders’ message was that you’re all chumps because the deck is stacked against you. \\nSomewhere along the line Sanders realized that his new party was hitting below the belt, the belt being the dividing point above which the expected favoritism towards Clinton would show, and below which that favoritism manifested itself as outright hostility towards him, like he was from a different party (a partial truth), like he was stealing her show. He was. \\nBecause he’s smart, he saw this no later than the rest of us. As many people have suggested, he had ample grounds to rescind his promise not to run outside the party as an independent. He of course didn’t, but I don’t think we’re justified in reading too much into this although many outsiders have. \\nWhat presently interests me is a thought experiment: What would have happened if Sanders had said yes to Jill Stein’s offer of heading the Green Party ticket? She did offer this, and since this is only a thought experiment, let’s further suppose that Ms. Stein would have been willing to step away from the second spot in favor of Elizabeth Warren. \\nThat’s a lot of supposition for two people who are now enthusiastic supporters of HRC (and by default WJC), and wouldn’t have wanted to play the role of spoilers, at least in Sanders’ words. He said he didn’t want to end up like Ralph Nader. That’s a helluva thing to say. \\nHe might also not want to end up like Ramsey Clark, or Daniel Ellsberg, and we know how he feels about Chelsea Manning, Julian Assange, and Edward Snowden. Both Sanders and Warren assiduously avoid the left position on US foreign policy. This is not inconsequential because there’s only two policies, domestic and foreign. Even space fits neatly into the second category. \\nMaybe they avoid criticizing US foreign policy because they’re smart, as in, it’s the smart thing to do. They are politicians and smart enough to know that Americans are not ready to see their country demilitarized, and that’s understating things. If they have any qualms about US hegemony they’re keeping it to themselves. \\nStill, that leaves domestic policy in the age of the aggrieved debt-ridden worker, underpaid and overworked if fortunate enough to be working and insecure at that. It’s already been discounted by worldwide planners that the gap between the haves and the have-nots will be widening, with consequences for future generations. Few of the planners see it as their mission to try to halt or reverse this predictable consequence of neoliberal globalization. Rather the financial and military planners seek to manage it to their advantage, most recently “The Future of the Army” report put out by the Atlantic Council. \\nThis would be a good time to recall a study done in 2013, the Credit Suisse Global Wealth Report: \\nTwo generations ahead, future extrapolations of current wealth growth rates yields almost a billion millionaires, equivalent to 20% of the total adult population. If this scenario unfolds, then billionaires will be commonplace, and there is likely to be a few trillionaires too — eleven according to our best estimate. \\nThere’s a new word in there for us. The wealth of the capitalist class will race away from the worker class like a receding star. \\nBack to our gedanken. Let’s put Sanders (and Warren) into the debates. Their right-leaning foreign policy wouldn’t even be noticed. I don’t think too much has to be said about their advantage on everything else. You can’t tell people you’re for them unless you’re of them, and both Trump and Clinton are distinctly not normal people leading normal lives. Trump plays king in the castle and Clinton has had secret service protection for the last one-third of her life. \\nWould it have been close? Opinions vary but for two reasons they are beside the point. One, even if a losing proposition it carries the fight to the enemy by seizing upon a seminal moment in American history — the point at which the people no longer trusted anything from above that was holding them down. \\nTwo, it didn’t come close to happening. Water under the bridge.'"}, "time": 1742628496.8247716}