{"duration": 0.0360262393951416, "input_args": {"text": "'This is just a guess, but the   programming that is all over television at the moment feels as if it might go largely unwatched. The offerings are generally some combination of   retrospective and       analysis. Do admirers of President Obama really want to revisit his slow slide from 2008 triumph to 2017 vilification? Do fans of the   Donald J. Trump, want to do anything other than say, “Don’t let the door hit you on the way out” and then plunge into their new opportunity? That said, let’s see if we can find any reason to watch two of this week’s programs: four hours’ worth of “Frontline” on PBS titled “Divided States of America,” and a CNN production, “The End: Inside the Last Days of the Obama White House. ” The “Frontline,” which is being broadcast in   chunks on Tuesday and Wednesday nights, is a rehashing of recent history that is for the most part all too familiar, a drumbeat of events that led to a government and a country defined by polarization. Large stretches of it aren’t particularly enlightening  —   who needs to relive the dreary, predictably acrimonious battles over budget stalemates and health care, or to hear sound bites of   radio stars fanning the flames of racism and hate? The structure of this trip down memory lane doesn’t make it any more palatable. Michael Kirk, who made the documentary, is largely content to let the usual talking heads be the guides  —   journalists, political operatives, lawmakers or former lawmakers. Some of them are from the same chattering class that failed to grasp the rise of Mr. Trump in the first place. Hindsight wisdom of this sort seems especially out of place now. As for the ordinary Americans who put Mr. Trump in the White House, we hear them mostly in   clips that only reinforce the easy stereotypes about them. Despite those criticisms, the program does manage to weave a convincing tapestry of discontent, and not just from the obvious threads. Have you forgotten, say, the odd 2009 incident in which Henry Louis Gates Jr. the Harvard scholar, who is black, was arrested after having to force his way into his own home because of a jammed door? This program hasn’t, and places it in the context of the growing schism that ultimately made Mr. Obama a divider rather than a uniter. So the documentary, though it’s not particularly rewarding to watch, does achieve its goal of painting a portrait of a country that is about as disunited as it could be, thanks to economic forces, increasingly unveiled racism and an anger that continues to be hard to pin down. President Obama’s early   pronouncement that the country isn’t a collection of red states and blue states, but is “and always will be the United States of America” is heard here. By the program’s end, it has never seemed more naïve. The CNN program, Wednesday night, is the better of the two, capturing a lot of honesty as it follows staff members in the Obama White House during their final days. It has partisan stretches, of course, but its most interesting passages are a study of what has to happen to transfer the government from one group of handlers to another, regardless of who is transferring to whom. To watch this program is to be impressed with the magnitude of what will happen this week. “It’s the largest takeover of any organization not only on the planet but in history,” says Max Stier of the Partnership for Public Service, an organization focused on improving government effectiveness. Then he notes why it’s especially important now. “The point of maximum vulnerability for our nation is at the transition,” he says, “and in a    world, doing this really well is vital. ”'"}, "time": 1742628473.6578724}