{"duration": 0.06651163101196289, "input_args": {"text": "'The father of Michael Brown accused the City of Ferguson of “asking for” the riots that plagued the city following his son’s death. [His comments came in response to the release of a film, “Stranger Fruit,” during Austin, Texas’ South by Southwest Film Festival. The film reportedly reveals new video footage taken from a market in Ferguson Michael Brown was accused of robbing, CNN reported. Director Jason Pollock claims Brown did not rob the store as widely reported, but was simply picking up some cigarillos the clerks had given him in exchange for marijuana.  The film’s producers accuse the City of Ferguson of hiding this video and only releasing the later video with claims Brown was robbing the store. “Maybe the City of Ferguson wouldn’t have gotten tore up like that,” Michael Brown Sr. said during a press conference about the video. “It’s almost like they asked for it, if you ask me, for not keeping no truth in there. ” Ferguson police responded to the claim by the senior Brown, stating that Michael Brown was not initially stopped in connection with the incident at the store. He was stopped for walking in the middle of the road, CNN stated. The riots that erupted following the shooting death of Michael Brown by a Ferguson police officer had nothing to do with anything that happened at the store, or even the facts of Brown’s encounter with the police officer. Rather, the riots broke out following a false “Hands Up, Don’t Shoot” narrative put forward by politically motivated activists. The riots were further fueled by the Obama Administration’s fanning the flames with rhetoric that supported the false narrative, Breitbart News reported in 2015. “Now the campaign of terror against police has come back to where the great lie started. Obama and Holder will not finish until they have destroyed Ferguson —  destroyed it, in the   parlance of the Vietnam era, in order to save it, razed it to rebuild it in the stylized image of Selma 1965, razed it in order to fit the delusions of an Attorney General who thinks we have made no progress since the era of Malcolm X and a President who once promised —  incredibly! —  to unite America,” Breitbart’s Joel Pollock wrote at the time. Breitbart News reported extensively on the aftermath of the shooting in Ferguson and the subsequent riots and political chaos that arose over the next several months. The release of the new video sparked a new round of protests in Ferguson over the weekend, CNN reported. During a protest Sunday night, a Ferguson police officer’s nose was broken after a female protester punched him in the face. Brandon Darby contributed to this report. Darby serves as Breitbart Texas Managing Director and   . He   the Cartel Chronicles project with Ildefonso Ortiz and Stephen K. Bannon. Follow him on Twitter and Facebook. Bob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX and Facebook.'"}, "time": 1742562303.8592892}