{"duration": 0.07362914085388184, "input_args": {"text": "'Keywords: ban on marijuana , legalized marijuana , Marijuana benefits \\nLong gone are the days where marijuana is seen as taboo. More and more states have been legalizing marijuana for medical use—Alaska, California, DC, Delaware, Maine, Oregon, Massachusetts, Minnesota, Montana, New Hampshire, Rhode Island, New Jersey, New Mexico, Connecticut, Michigan, Maryland, Hawaii, Arizona, Nevada, New York, Ohio, Illinois, Pennsylvania, and Vermont; while Colorado and Washington have made history by decriminalizing the plant completely. Besides the United States, many countries have also began legalizing the use of marijuana (however, in some of these places, cultivating or transporting is still illegal)—Cambodia, Colombia, Costa Rica, Czech Republic, Ecuador, Italy, Estonia, Jamaica, Mexico, Nepal—among many others. \\nAfter a Gallop poll was done, it showed that 58 percent of Americans are in favor of legalizing the natural plant. This is the first time in history that Americans are more in favor of legalizing, than criminalizing, the herb. Below are a few reasons why it’s time to legalize marijuana worldwide. Marijuana can be used to treat a variety of medical ailments. \\nDid you know that marijuana helps in treating epileptic seizures? It contains certain cannabinoids that have anticonvulsant properties, according to Katherine Mortati, MD, a neurologist serving at the Comprehensive Epilepsy Center , SUNY Downstate Medical Center . Furthermore, marijuana has been discovered to relieve nausea in cancer patients, increase appetite in HIV/AIDS patients, relax muscle tension and spasms; and relieve chronic pain. It has a very low abuse risk. \\nAccording to Dr. Sanjay Gupta, CNN’s Chief Medical Correspondent, around 9 to 10 percent of adult users become dependent on marijuana. This is much lower than the dependent 20 percent of cocaine users, 25 percent of addicted heroin users, and the 30 percent of dependent tobacco users. Cannabis can be a useful in treating insomnia. \\nThe number one cause of insomnia is stress, and marijuana aids in relaxation. A study done by the National Cancer Institute found that patients that ingested a cannabis plant extract spray reported a much more restful sleep. It has been researched that THC provides a subject with an easier time falling asleep, longer sleep, deeper sleep, and better breathing while sleeping. The National Institute on Drug Abuse and National Institutes of Health funded studies that reported that subjects were able to fall asleep easier and more quickly after consuming THC. Approximately 40% of Americans have admitted to using marijuana. \\nWith more and more Americans having admit to trying marijuana at least once in their lives, it has been shown that marijuana is less addictive than coffee. Because of this, more people are finding reasons to feel safer when trying the drug. No one has ever died from a marijuana overdose. \\nThere has never been any reported case of anyone ever fatally overdosing on marijuana, despite the large amounts of THC in their systems. Prescription drugs, on the other hand, have been responsible for over 25,000 deaths in 2014 according to the National Institute on Drug Abuse ; while the Center for Disease Control and Prevention report that 6 Americans die every day from alcohol poisoning. \\nSources:'"}, "time": 1742562962.672665}