{"duration": 0.1451125144958496, "input_args": {"text": "'Even though Selina Meyer is the leader of the free world and, also, a woman, “Veep” rarely digs deeply into the gender politics that affect women in positions of power. The show has subtly highlighted the fact that Selina has to worry about her haircuts, her acne and the visibility of the bags under her eyes to a degree that most men officials probably don’t. We’ve also seen her male political colleagues underestimate her on more than one occasion. But most of the time, she and her staff are too busy dealing with things like teleprompter   and data breaches to directly address the sexism that a woman of Selina’s stature would likely confront on a daily basis. That changes in this week’s episode, in which Selina handles several crises unique to a woman POTUS. For starters, there’s that Politico story that claims that a member of the White House staff referred to the president using That Word. (I say That Word because the word in question  —   the most insulting thing a woman can be called  —   is unfit for print here.) Selina instructs Amy, the only woman in her inner circle of advisers, to find out who’s responsible for calling her such a derogatory name. Not surprisingly, it quickly becomes clear that Amy and almost everyone else in that aforementioned inner circle has recently used That Word to describe their boss. (“I shouted it into my phone on the Acela quiet car,” Mike confesses in one of the great,   lines in this episode.) The fact that there’s an ugly, sexist aspect to that particular expletive doesn’t necessarily seem to have occurred to any of them (note: they’re mostly men) and in a way, that makes sense. To borrow a line from “A Christmas Story,” the Oval Office dwellers of “Veep” work in profanity the way other artists might work in oils or clay. It is their true medium they are masters. So many obscenities trip and fall off their tongues every day that it’s unlikely they even considered the harsh ramifications of what they said about Selina. But Selina is very aware of how hurtful That Word is and calls Amy to the White House in the middle of the night to discuss it. In a scene that feels as though it were ripped from an old Bette Davis movie, Selina, dressed in a flowing nightgown while darkly barking orders and smoking a cigarette, delivers a blistering monologue: “I am the first female president of the United States and this is an affront. I’ll tell you something, Amy, a lot of people don’t want me to be president. And you know why. Because fundamentally, people hate women. Right? I mean, they’ll just stop at nothing to get me out of here. Everybody’s trying to get me. But I’m not going to let them. ” Theoretically, it is possible to listen to this speech without being reminded of Hillary Clinton. But so far, I haven’t figured out how. It’s telling that Selina only feels comfortable speaking so pointedly about her gender in a dimly lit room, in the dead of night, with only a single other woman present. It implies that she knows if she were to say any of this during the work day, with all the Oval Office lights on and everyone on her team present, she’d be perceived as crazy or overly sensitive. Consequently, Selina tends to suppress her worst suspicions about how she’s perceived or simply distract herself with the 87 other messes spilled at her feet. For example, later in this episode, when she finds out that Jonah is succeeding in his Congressional campaign by railing against her record, a move that actually validates her theory that everyone is “trying to get her,” she lets it roll off her back. Ben tells her it’s good news since once Jonah gets elected, he’ll support her presidency. (Though, really, can’t we all see Jonah   on that promise once he gets a tiny taste of power?) Regardless, the truth is there’s only so many attacks a woman can worry about at once. There are key points in this episode that deliberately show Selina leaning too hard into stereotypical female behavior. One is that   Oval Office scene with Amy, which casts Selina as the harpy. The other involves her waffling about whether or not to bail out the bank overseen by Charlie Baird, a move that may be the best thing from an economic standpoint but a terrible thing for her image since she’ll be perceived as doing a favor for her lover. That whole story line traffics in two classically demeaning perceptions of women: That they’re indecisive, and that they’re always driven by their hearts instead of their heads. By depicting Selina in this way, it’s as if the show is inviting its audience to see her as a prototypical woman, too. But then “Veep” does something brilliant and subverts all of that by having Selina decide not to bail out Charlie’s bank, primarily because of that drippy “love is what matters” pep talk from Gary. Selina isn’t going to fall for the kind of talk she calls “When Gary Met Sally. ” You can call her That Word and you can think she’s being indecisive but she is still a woman who can’t be pigeonholed. (It’s worth noting that this episode was   by a woman, Georgia Pritchett, and a man, Will Smith, and directed by a man presumably inclined to be sympathetic to Selina  —   Brad Hall, husband of Julia  .) Other examples of women raging against various machines are sprinkled throughout this episode, too. There’s the reappearance of Candi Caruso, the seemingly competent job applicant who once again is called in for an interview and immediately dismissed because the position is being filled  . There’s poor Amy, who’s so overworked that she hilariously tells Siri to set a reminder for her to freeze her eggs. And then there’s Catherine, who has more of a right to feel neglected and demeaned than maybe any other woman on “Veep. ” After struggling for days to have a conversation with her mother, she finally drops a bomb on her at the end of this episode when she announces that she’s fallen in love with Marjorie, Selina’s Secret Service agent who was hired because she supposedly looks like Selina from behind. Despite all those progressive things Selina says for the cameras during a   for her holiday shopping trip to Kramerbooks  Afterwords Café  —   she claims she plans to purchase a book by the   poet Wanda Coleman, as well as a graphic novel “with a strong Asian protagonist”  —   Selina’s   goes out the window when she realizes her daughter is gay. “I wish mother was alive, because this definitely would have killed her,” Selina says. But shouldn’t she have seen this coming? Of course Catherine has fallen for Marjorie. She’s the one person on Earth who looks (a little) like Selina and actually pays attention to Catherine.'"}, "time": 1742564313.787488}