{"duration": 0.12809276580810547, "input_args": {"text": "'WASHINGTON  —   President Obama came into office seven years ago pledging to end the wars of his predecessor, George W. Bush. On May 6, with eight months left before he vacates the White House, Mr. Obama passed a somber,   milestone: He has now been at war longer than Mr. Bush, or any other American president. If the United States remains in combat in Afghanistan, Iraq and Syria until the end of Mr. Obama’s term  —   a   given the president’s recent announcement that he will send 250 additional Special Operations forces to Syria  —   he will leave behind an improbable legacy as the only president in American history to serve two complete terms with the nation at war. Mr. Obama, who won the Nobel Peace Prize in 2009 and spent his years in the White House trying to fulfill the promises he made as an antiwar candidate, would have a longer tour of duty as a wartime president than Franklin D. Roosevelt, Lyndon B. Johnson, Richard M. Nixon or his hero Abraham Lincoln. Granted, Mr. Obama is leaving far fewer soldiers in harm’s way  —   at least 4, 087 in Iraq and 9, 800 in Afghanistan  —   than the 200, 000 troops he inherited from Mr. Bush in the two countries. But Mr. Obama has also approved strikes against terrorist groups in Libya, Pakistan, Somalia and Yemen, for a total of seven countries where his administration has taken military action. “No president wants to be a war president,” said Eliot A. Cohen, a military historian at Johns Hopkins University who backed the war in Iraq and whose son served there twice. “Obama thinks of war as an instrument he has to use very reluctantly. But we’re waging these long, rather strange wars. We’re killing lots of people. We’re taking casualties. ” Mr. Obama has wrestled with this immutable reality from his first year in the White House, when he went for a walk among the tombstones at Arlington National Cemetery before giving the order to send 30, 000 additional troops into Afghanistan. His closest advisers say he has relied so heavily on limited covert operations and drone strikes because he is mindful of the dangers of escalation and has long been skeptical that American military interventions work. Publicly, Mr. Obama acknowledged early on the contradiction between his campaign message and the realities of governing. When he accepted the Nobel in December 2009, he declared that humanity needed to reconcile “two seemingly irreconcilable truths  —   that war is sometimes necessary, and war at some level is an expression of human folly. ” The president has tried to reconcile these truths by approaching his wars in narrow terms, as a chronic but manageable security challenge rather than as an   national campaign, in the tradition of World War II or, to a lesser degree, Vietnam. The longevity of his war record, military historians say, also reflects the changing definition of war. “It’s the difference between being a war president and a president at war,” said Derek Chollet, who served in the State Department and the White House during Mr. Obama’s first term and as the assistant secretary of defense for international security affairs from 2012 to 2015. “Being a war president means that all elements of American power and foreign policy are subservient to fighting the war,” Mr. Chollet said. “What Obama has tried to do, which is why he’s careful about ratcheting up the number of forces, is not to have it overwhelm other priorities. ” But Mr. Obama has found those conflicts maddeningly hard to end. On Oct. 21, 2011, he announced that the last combat soldier would leave Iraq by the end of that year, drawing that   war to a close. “Our troops will definitely be home for the holidays,” Mr. Obama said at the White House. Less than three years later, he told a national television audience that he would send 475 military advisers back to Iraq to help in the battle against the Islamic State, the brutal terrorist group that swept into the security vacuum left by the absent Americans. By last month, more than 5, 000 American troops were in Iraq. A furious firefight this month between Islamic State fighters and Navy SEALs in northern Iraq, in which Special Warfare Operator First Class Charles Keating IV became the third American to die since the campaign against the Islamic State began, harked back to the bloodiest days of the Iraq war. It also made the administration’s argument that the Americans were only advising and assisting Iraqi forces seem ever less plausible. Afghanistan followed a similar cycle of hope and disappointment. In May 2014, Mr. Obama announced that the United States would withdraw the last combat soldier from the country by the end of 2016. “Americans have learned that it’s harder to end wars than it is to begin them,” the president said in the Rose Garden. “Yet this is how wars end in the 21st century. ” Seventeen months later, Mr. Obama halted the withdrawal, telling Americans that he planned to leave more than 5, 000 troops in Afghanistan until early 2017, the end of his presidency. By then, the Taliban controlled more territory in the country than at any time since 2001. Taliban fighters even briefly conquered the northern city of Kunduz. In the bitter battle for control, an American warplane mistakenly fired its missiles into a Doctors Without Borders hospital, killing 42 people and prompting accusations that the United States had committed a war crime. Critics of Mr. Obama have long said his clinical approach to wars weakened the ability of the nation to fight them. “He hasn’t tried to mobilize the country,” Dr. Cohen said. “He hasn’t even tried to explain to the country what the stakes are, why these wars have gone the way they have. ” Mr. Bush was also criticized for failing to ask the American people to make any sacrifices during the Iraq war. But, Dr. Cohen said, “for all his faults, with Bush, there was this visceral desire to win. ” Vincent DeGeorge, a researcher at Carnegie Mellon University who collected the data on presidents at war, said Mr. Obama’s tone mattered less than the decisions he made. “Does the rhetoric a president uses at home matter to the soldiers who come back wounded or get caught in the crossfire?” he asked in an interview. Mr. DeGeorge acknowledged the complications in measuring Mr. Obama’s wars. The   phase of the Afghanistan war, for example, ended formally in December 2014, though thousands of troops remain there. For his analysis, he considered a state of war to exist when less than a month passed between either American casualties or an American airstrike. More so than Mr. Bush or President Bill Clinton, Mr. Obama has fought a multifront war against militants. Officials at the Pentagon referred to the situation as “the new normal. ” But for those who worked in the Obama administration, it made for an unrelenting experience. “As the Middle East coordinator, I certainly felt like it was a wartime pace,” said Philip H. Gordon, who worked in the White House from 2013 to 2015. Still, Mr. Gordon and other former officials drew a distinction between the wars of the 21st century and those of the 20th century. For one, Congress has not specifically authorized any of Mr. Obama’s military campaigns, let alone issued a declaration of war  —   something that it has not done since World War II. “War doesn’t exist anymore, in our official vocabulary,” Mr. Gordon said. It is not clear that Mr. Obama’s successor will take the same approach. The   for the Democratic presidential nomination, Hillary Clinton, has been more receptive to conventional military engagements than Mr. Obama. The presumptive Republican nominee, Donald J. Trump, has pledged to bomb the Islamic State into oblivion, though he has sent contradictory messages about his willingness to dispatch American ground troops into foreign conflicts. Military historians said presidents would probably continue to shrink or stretch the definition of war to suit their political purposes. “Neither Clinton nor Obama identified themselves as war presidents, but Bush did,” said Richard H. Kohn, professor emeritus of history and peace, war and defense at the University of North Carolina at Chapel Hill. “War goes back in human experience thousands of years,” he said. “We know that it has an enormous variation of definitions. ”'"}, "time": 1742563252.778069}