{"duration": 0.0321202278137207, "input_args": {"text": "'They were a 1960s power couple, two hypertalkative showmen: Muhammad Ali, the   boxer born with a slave name, and Howard Cosell, the Jewish Brooklyn lawyer who found his calling in sportscasting. Ali, who died Friday at 74, recited doggerel, danced in the ring, taunted his opponents and converted to Islam. And, as he told us, he was pretty. Cosell was homely, with an adenoidal voice and a collection of toupees. But at his best, he could call a boxing match with dramatic brio, articulate complex issues, narrate football highlights with astonishing skill and little preparation, and, as he often said, “tell it like it is. ” ABC Sports, Cosell’s employer, carried a lot of Ali’s fights, so Cosell was at ringside, inside the ring interviewing Ali and his opponents after fights, or in the network’s studio interviewing Ali. Their camaraderie produced an entertaining union of spirited opposites and a     pairing for the times. One man, Ali, understood racism the other, Cosell, experienced  . And neither could stop talking. Ali spoke to many other journalists, but he and Cosell seemed inseparable: teasing and challenging each other, and   in suits and ties. Ali often threatened to strip off Cosell’s toupee du jour, and in their jokey    each man said the other would have been nothing without him. “Every time you open your mouth, you should be arrested for air pollution,” Ali once told Cosell, who responded, “You would still be in impoverished anonymity in this country if I hadn’t made you. ” Beneath the stagecraft of their relationship was Cosell’s support of Ali, whether by no longer calling him Cassius Clay when others, like his opponent Ernie Terrell, persisted, or by excoriating the New York State Athletic Commission for stripping him of his heavyweight title in 1967 after he refused induction into the Army. They were so tied in the public mind that the columnist Dave Kindred wrote a dual biography of the men, “Sound and Fury,” in 2006. “Had they been practitioners of traditional humility, their extraordinary talents alone would have demanded that attention be paid,” Kindred wrote. “But there was nothing traditional about Ali and Cosell. A thimble would have contained their humility with room left over for an elephant. ” One day in January 1974, shortly before Ali and Joe Frazier’s rematch of their epic bout three years earlier, they joined Cosell at the ABC Sports studio to review film of the first fight. Dennis Lewin, a longtime producer at the network, recalled: “Normally when we had two people for Howard to interview with contrasting views, we sat Howard between them, but I wanted the two of them together to have the byplay better. I didn’t realized it would lead to a fight. ” Indeed, when Ali brought up Frazier’s hospitalization after their first bout, Frazier grew enraged, rose to his feet and asked Ali why he called him ignorant. “Sit down, Joe,” Ali said, but Ali got to his feet and they began wrestling on the studio floor, as stagehands and the fighters’ entourages tried to restore order. Cosell never got out of his chair, narrating the   as if it were a prizefight and trying to determine who was clowning and who was serious. “It’s a bad and ugly scene,” he said, “and it’s unfortunate that it happened as we showed this extraordinary fight. ” Frazier left angrily, leaving Ali alone with Cosell. Ali was petulant afterward and tried to rationalize why he had called Frazier ignorant. Cosell kept prodding Ali back to analyzing the first epic bout. Cosell sounded annoyed, yet paternal, as he tried to bring Ali back to the day’s goal. “I’m going to represent Joe, as a devil’s advocate,” Cosell said. “You have to be a devil to represent Joe,” Ali said. Lewin witnessed many   encounters and saw in them two “gifted and highly intelligent performers” who could “play off each other on any level. ” “They had genuine respect for their mutual talents and what they could do for each other,” he said. “Clearly, they both enabled each other’s careers. ” Both men’s health declined, Ali from Parkinson’s disease, Cosell from multiple problems. In 1992, when Ali celebrated his 50th birthday on a television special, the ailing Cosell offered his greetings in a prerecorded segment that showed his emotional side, without bombast or gibes. “Fifty years old,” he said, “I never thought that could happen, not to you. But it has, and you know something? You are exactly who you said you are. You never wavered. You are free to be who you want to be. ” Cosell paused, choking up, and added, “I love you. ”'"}, "time": 1742628501.9414217}