{"duration": 0.09993624687194824, "input_args": {"text": "'STEVE BANNON Donald’s Trump’s Chief Strategist and Senior Counselor \\n“As a Jew who has worked for years with Steve Bannon, I can tell you he is not an anti-Semite or a white nationalist. He doesn’t have an anti-Semitic bone in his body.” — David Horowitz, Jewish founder of the David Horowitz Freedom Center and editor of FrontPage Magazine . \\nWhen president-elect Donald Trump named Steve Bannon, the controversial media figure behind the alt-right website Breitbart News Network, as his “senior strategist” — major Jewish groups raised the alarm. \\nThe Anti-Defamation League condemned the move, saying Bannon’s website was home to racists and fostered hatred against Jews. But to his Jewish defenders — which include Breitbart’s CEO and senior editors for the site — he is an ally and proud Zionist. \\n“I can say, without hesitation, that Steve is a friend of the Jewish people and a defender of Israel, as well as being a passionate American patriot and a great leader,” Joel Pollak, an Orthodox Jew and a senior editor for Breitbart News, wrote on Monday. \\nIndeed, Breitbart’s origin story has its roots in Israel, according to Larry Solov, Breitbart’s CEO and president, another close Jewish colleague of Bannon. \\nIn a November 2015 post on Breitbart News, Solov describes the conception of the news site in 2007. It happened, Solov writes, during a trip to Israel with Andrew Breitbart, the Jewish founder and namesake of the website. \\nThe site was born to defend the Jewish state. \\n“One thing we specifically discussed that night was our desire to start a site that would be unapologetically pro-freedom and pro-Israel,” Solov wrote. “We were sick of the anti-Israel bias of the mainstream media.” \\nSolov and Breitbart were “blown away by the spirit, tenacity and resourcefulness of the Israeli people on that trip,” Solov wrote. \\nBreitbart died in 2012 and Bannon became editor of the site. \\nUnder Bannon’s leadership, the site became one of the best known platforms and gateways for the alt-right, a diverse group that traffics in white nationalism and racism. Richard Spencer , a founder of the political movement who advocates for the creation of a “white ethno-state,” called Breitbart a “gateway” to alt-right ideas and writers. \\nDuring Trump’s campaign, the site became particularly enamored with the Republican candidate and lampooned and attacked his opponents. \\nFor Ben Shapiro, a former writer at Breitbart News, Bannon betrayed the original vision of the site’s founder. \\n“Andrew Breitbart despised racism,” Shapiro wrote on Monday. “With Bannon embracing Trump, all that changed. Now Breitbart has become the alt-right go-to website … pushing white ethno-nationalism as a legitimate response to political correctness, and the comment section turning into a cesspool for white supremacist mememakers.” \\nBut even as the site may have appealed to anti-Semites, it retained its Zionist bona fides under Bannon. \\nIn 2015, Bannon launched a Jerusalem branch of Breitbart News, which covers events in Israel. It is edited by Israel-based American reporter Aaron Klein, another Bannon advocate. Klein, a Yeshiva University graduate, is also a columnist for the Jewish Press, a weekly newspaper with a conservative bent. \\nKlein recently called the anti-Trump protests across the country a product of “professional agitators” who are seeking the “downfall of the U.S. capitalist system.” \\nThe activist Pamela Geller, known for her anti-Islamic campaigning, also counts herself among Bannon’s Jewish allies. On Twitter, Geller defended Bannon recently, dismissing those who were characterizing Bannon as an anti-Semite. \\n“He partnered [with] Breitbart — a Jew,” she wrote. “He partnered [with] Larry Solov (after Breitbart died) a Jew. He worked [with] me — a Jew.” Then she added: #Zionist. \\nDavid Horowitz, founder of the conservative think tank David Horowitz Freedom Center also came to Bannon’s defense, saying Bannon does not have an “anti-Semitic bone in his body.” \\n“As a Jew who has worked for years with Steve Bannon,” Horowitz wrote in an email to the Forward, “I can tell you he is not an anti-Semite or a white nationalist.” LD : For further proof that Steve Bannon is not going to do anything to challenge Jewish power in America or stand up to Israel, see this thought-provoking article in the Occidental Observer : Anti-Semitism as Political Assassination: The Smearing of Steve Bannon. I really do feel at this stage, though of course I could be wrong, that diehard anti-Semites and ardent White Nationalists are most unlikely to see any of their dreams come true in the foreseeable future. That’s what makes anti-Semites and White nationalists the angriest people on earth: their dreams are constantly being shattered as they see the Jews becoming more powerful and tyrannical at their expense. Constant defeat leaves a bitter taste in the mouth. Like this? Share it now.'"}, "time": 1742561742.907594}