{"duration": 0.15343999862670898, "input_args": {"text": "'■   Donald J. Trump taps wrestling impresario for Small Business Administration. ■  : “I didn’t do anything to divide” the country. ■ The governor of Iowa is the  ’s choice for ambassador to China. ■ Saving the Dreamers. Linda McMahon, the former chief executive officer of World Wrestling Entertainment, was selected on Wednesday by Mr. Trump to head the Small Business Administration, adding another billionaire to the  ’s affluent stable. “Linda has a tremendous background and is widely recognized as one of the country’s top female executives advising businesses around the globe. She helped grow W. W. E. from a modest   operation to a publicly traded global enterprise with more than 800 employees in offices worldwide,” Mr. Trump said in a statement. Ms. McMahon, a failed Senate candidate from Connecticut, was with her husband Vince one of Mr. Trump’s biggest campaign donors. She contributed $6 million to a “super PAC” supporting Mr. Trump in August and September, according to federal election filings. And, of course, Mr. Trump has shown a great facility for professional wrestling, so the choice makes sense. In an interview with Time for its person of the year issue, and a   with NBC’s “Today” show, Mr. Trump talked tough. ■ He insisted he has nothing to do with the “divided states of America” that Time says he will lead. “When you say divided states of America, I didn’t divide them,” he told NBC. “I’m not president yet, so I didn’t do anything to divide. ” ■ He declined to criticize Rodrigo R. Duterte, president of the Philippines, who is leading a bloody campaign in the streets of Manila against drugs, or even to push back on comparisons between Mr. Duterte and the  ’s promised crackdown on criminal illegal immigrants. “Well, hey, look, this is bad stuff,” Mr. Trump told Time. “They slice them up, they carve their initials in the girl’s forehead, O. K.? What are we supposed to do? Be nice about it?” ■ He rejected United States intelligence conclusions that Russia was behind hacks at the Democratic National Committee and Clinton campaign that boosted his campaign. “I don’t believe it. I don’t believe they interfered,” Mr. Trump said of the Russians. ■ And he again said he would press Boeing on an Air Force One upgrade, though his Twitter order to “cancel” the project seems to have faded. “I’m going to negotiate prices, and the planes are too expensive, and we’re going to get the prices down. ” Representative Keith Ellison said Wednesday he would resign his House seat if he is elected chair of the Democratic National Committee, sweeping away an impediment to his bid for the party post while denying his critics a handy argument against his controversial candidacy. “Whoever wins the D. N. C. chair race faces a lot of work, travel, planning and resource raising. I will be ‘ ’ to meet the challenge,’” Mr. Ellison said in a statement. A range of prominent Democrats have expressed unease about installing a   chairman at the D. N. C. at a time when the party is shut out of power in Washington. But that argument against Mr. Ellison has also served as a   for broader, and more delicate, concerns about the liberal Minnesotan. Some Jewish Democrats are nervous about his past ties to the Nation of Islam and comments about Israel. Haim Saban, one of the party’s biggest donors, said Mr. Ellison would be “a disaster” for Democrats.   Trump sounded more conciliatory toward Boeing on Wednesday after its chief executive promised to help control the cost of a proposed new Air Force One plane. Mr. Trump had tweeted “Cancel Order!” on Tuesday after writing that it could cost over $4 billion to build two of the jets with   communications and security by the  . But in a telephone interview with the Today Show, Mr. Trump said that he had since talked to the Boeing executive, Dennis Muilenburg, saying he was a “terrific guy, and we’re going to work it out. ” Mr. Trump said he would negotiate lower prices or “we’re not going to order them, we’ll stay with what we have. ” Mr. Trump said he had tweeted about the project after hearing the cost estimates. He said he had not seen a Chicago Tribune article citing Mr. Muilenburg’s concerns about his trade policies that was posted shortly before his tweet. For all his talk of punishing China,   Trump has chosen a conciliator with a personal relationship with China’s president to be his ambassador in Beijing. An Iowa governor might seem an unlikely choice for one of the more sensitive diplomatic posts, but Gov. Terry Branstad has ties with China that go back decades. Mr. Branstad, whose selection was first reported by Bloomberg News and confirmed on condition of anonymity on Wednesday by two people with direct knowledge, is close to President Xi Jinping, whom he has known for more than three decades. They met in 1985, when Mr. Branstad was serving his first term as governor of Iowa and Mr. Xi was a    rural official in Hebei Province, studying modern American agriculture, including hog and corn farming in Iowa. Mr. Branstad has courted China as governor, promoting his state’s farm goods. As ambassador, he would be tasked with managing a complex relationship that Mr. Trump has already indicated he is willing to shake up. The  ’s call with Taiwan’s president last week prompted criticism from Beijing, which considers it a breakaway province, and Mr. Trump responded with posts on Twitter attacking China for its trade practices and provocative moves in the South China Sea. Mr. Trump is scheduled to travel to Des Moines on Thursday for a rally. Facing intense pressure over the   “Dreamers,” young people brought to the United States by their undocumented parents and allowed to stay under President Obama, Mr. Trump appears to be softening his stance on whether to deport the more than 700, 000 of them. “We’re going work something out that’s going to make people happy and proud,” Mr. Trump told Time. “They got brought here at a very young age, they’ve worked here, they’ve gone to school here. Some were good students. Some have wonderful jobs. And they’re in   land because they don’t know what’s going to happen. ” Mr. Trump did not go into specifics or say he would reverse his promise to reverse Mr. Obama’s executive actions, including the 2012 Deferred Action for Childhood Arrivals, or DACA, which protected young undocumented immigrants from deportation. The Dreamers are likely to present Mr. Trump with the first major domestic policy test of administration, as many of his campaign promises clash with more moderate Republicans and Democrats on Capitol Hill who have implored Mr. Trump not to deny these young adults protective status. Many of Mr. Trump’s top advisers and potential cabinet members, including his nominee for attorney general, Senator Jeff Sessions of Alabama, however, oppose Mr. Obama’s executive action on immigration and other measures that would allow undocumented immigrants to stay in the U. S. Mayor Rahm Emanuel of Chicago made the case to Mr. Trump personally on Wednesday. Emerging into the Trump Tower lobby, Mr. Emanuel said: At a breakfast   at Manhattan’s Cipriani 42nd Street, Mr. Trump on Wednesday gave a tantalizing hint at the inaugural festivities to come for a reality TV   : The helicopter grand entrance. The   said he was paid a visit a day earlier by Mark Burnett, the executive producer of “The Apprentice,” the reality show that helped make the   a household name. Mr. Trump told the crowd that Mr. Burnett proposed reinventing the inauguration with a helicopter taking off from New York City, according to an attendee. Mr. Burnett, who is known for producing shows like “Survivor,” “The Voice” and “Shark Tank” as well, also told Mr. Trump that he should consider a parade up Fifth Avenue. The group planning Mr. Trump’s inauguration has secured about $50 million in pledged donations since it began   in earnest last week, a breakneck pace that promises a glittering event, according to two people involved in the effort. The early success puts Mr. Trump on pace to easily surpass President Obama’s 2009 inauguration, when his finance team raised a record $53 million to fund the inaugural festivities. The group, the Presidential Inaugural Committee, has set a   goal of $65 million to $75 million, though the final figure could well be higher, the two people said. The committee has planned a series of exclusive events around Mr. Trump’s    —   not unlike those planned around past inaugurations  —   to help entice wealthy donors and corporations to open their checkbooks. Evidently, the events are working.   Trump was announced as the Time magazine’s person of the year on Wednesday  —   but with a discordant note. As the magazine’s editor in chief, Nancy Gibbs, put it: Mr. Trump accentuated the positive. “It’s a great honor, it means a lot, especially me growing up reading Time magazine,” he said on the “Today” show on NBC after the choice was announced. Throughout the campaign, Mr. Trump bragged at rallies about how frequently he was on the magazine’s cover. And hey, last year, he said it would never happen. Senator Joe Manchin of West Virginia, one of the most conservative Democrats in Congress, says he is trying to find time for a second trip to Trump Tower in New York, this time to see Reince Priebus, tapped to be the next White House chief of staff. “I’m anxious to talk to him,” he said. What Mr. Manchin wants is unclear. Asked if he were open to serving in the cabinet, he answered, “I’m just anxious to help my country and help my state. ” And what an appointment would mean to Mr. Trump is equally unclear. The other red state Democrat being wooed by the Trump transition team, Senator Heidi Heitkamp of North Dakota, is a more obvious target. Her seat would be filled by an appointment made by North Dakota’s incoming Republican governor, Doug Burgum, giving Republicans a little more cushion for their narrow Senate majority. Mr. Manchin’s successor would be named by West Virginia’s incoming Democratic governor, Jim Justice. With Hillary Clinton’s lead in the popular vote reaching 2. 7 million votes, the Democrats’ losses are looking increasingly improbable but very real. They are annotated on Twitter by David Wasserman, House editor of the nonpartisan Cook Political Report. History is a game of inches  —   or a few thousand votes in Michigan, Wisconsin and Pennsylvania.'"}, "time": 1742564089.6415012}