{"duration": 0.06906747817993164, "input_args": {"text": "'New York City police officers in plain clothes shot and killed a man in Brooklyn early on Sunday when he pointed a   pellet gun at them after robbing a bodega, the police said. Investigators recovered a black imitation pistol from the scene of the shooting, which occurred shortly after 12:40 a. m. on Starr Street near Irving Avenue in the Bushwick neighborhood, said Terence A. Monahan, the chief of patrol. The police officers involved were not identified. The man, whom officials identified as Sergio Reyes, 18, had used the pellet gun to rob the Garden Deli and Grill at 185 Starr Street, the police said. Officials released a surveillance video image of a man  —   dressed in a dark hooded sweatshirt and   pants with a mask covering part of his face  —   pointing the gun at a bodega clerk. The clerk, Mohamed Ali, said Mr. Reyes had entered the bodega and broken a   of beer on the floor. He then grabbed two more beers from the cooler and brought them to the counter, where he pulled out a gun and put it in Mr. Ali’s face, Mr. Ali said. “He said, ‘Bag it up,’” Mr. Ali recalled. “‘Bag it up, or I’m going to kill you. And shut the camera off. ’” Mr. Ali called 911 and a few minutes later heard gunshots down the block. Chief Monahan said the police responded to Mr. Ali’s 911 call around 12:40 a. m. A sergeant and two officers from an   unit in the 83rd Precinct went to the bodega, he said. As they talked to witnesses, the officers spotted Mr. Reyes, who was walking west on Starr Street, alongside Maria Hernandez Park. Chief Monahan said the officers gave Mr. Reyes verbal commands and confronted him in front of 169 Starr Street. “The suspect had a black firearm in his hand and raised it toward the officers,” Chief Monahan said. “The officers fired at the suspect and struck him multiple times. ” Jovan, 22, who lives on Starr Street and did not want his last name used out of concern for his safety, said he heard at least six gunshots and saw a chaotic scene unfold outside his window: people running, a van racing backward along the street  —   he said he thought it might have been an undercover police vehicle  —   and, soon after, a   officer with his gun drawn and briefly pointed at bystanders. Jovan said his first thought was that a gang confrontation had just erupted. He said he remained indoors for fear of being caught in crossfire. Outside, Mr. Reyes had been wounded in the torso, and he was pronounced dead at Woodhull Medical and Mental Health Center, the police said. The three officers involved in the shooting were not hurt. The police said on Sunday evening that they were investigating the shooting and the robbery that preceded it. Mr. Reyes lived a few blocks from the bodega, in a small,   apartment building on Wilson Avenue. On Sunday evening, Mr. Reyes’s father, Antonio Tlapanco, 48, wept as he stood next to a memorial to his slain son: a framed photograph of Mr. Reyes placed on a kitchen table alongside two floral bouquets in vases, candles and an illustration of the Madonna. Mr. Tlapanco, speaking through a Spanish interpreter, said that his son had never been in trouble with the police and that he never carried firearms or weapons of any kind. “I would have known,” said Mr. Tlapanco, who said he regularly checked the contents of all of his children’s backpacks. “The truth is, I don’t know where that came from,” Mr. Tlapanco said of the black pellet gun. “I never saw it around the house. If I would have seen something like that, I would have taken it away from him. ” Mr. Tlapanco said he had questions about the circumstances surrounding his son’s death and the Police Department’s account of it. He showed a photograph that he took at the hospital of bruising on his son’s neck. Mr. Reyes was one of six children, ages 15 to 23, born in the United States to Mr. Tlapanco and his wife, who are immigrants from Mexico. Mr. Tlapanco said Mr. Reyes was a student at Leadership  Public Service High School in Lower Manhattan and was studying to become a social worker. For hours on Sunday, police tape blocked off Starr Street from Irving Avenue to Knickerbocker Avenue, and no one was allowed in Maria Hernandez Park. The park is bordered by small grocers and restaurants, a Pentecostal church, a public school and rows of   apartment buildings. Signs of the neighborhood’s gentrification are evident, including a coffee shop with a youthful clientele directly across Irving Avenue from the scene of the shooting. Noah LePage, 21, said that he had lived on the Suydam Street side of the park since the summer and had seen the police conduct a few drug busts along Starr Street. “We see them a few times in their black vans and everything, but nothing like this,” he said.'"}, "time": 1742562291.5930586}