{"duration": 0.36333513259887695, "input_args": {"text": "'Vladimir Putin at the Valdai International Discussion Club : «Shaping the World of Tomorrow» by Vladimir Putin Voltaire Network | Sochi (Russia) | 27 October 2016 français русский Tarja, Heinz, Thabo, colleagues, ladies and gentlemen,\\nIt is a great pleasure to see you again. I want to start by thanking all of the participants in the Valdai International Discussion Club, from Russia and abroad, for your constructive part in this work, and I want to thank our distinguished guests for their readiness to take part in this open discussion.\\nOur esteemed moderator just wished me a good departure into retirement, and I wish myself the same when the time comes. This is the right approach and the thing to do. But I am not retired yet and am for now the leader of this big country. As such, it is fitting to show restraint and avoid displays of excessive aggressiveness. I do not think that this is my style in any case.\\nBut I do think that we should be frank with each other, particularly here in this gathering. I think we should hold candid, open discussions, otherwise our dialogue makes no sense and would be insipid and without the slightest interest.\\nI think that this style of discussion is extremely needed today given the great changes taking place in the world. The theme for our meeting this year, The Future in Progress: Shaping the World of Tomorrow, is very topical.\\nLast year, the Valdai forum participants discussed the problems with the current world order. Unfortunately, little has changed for the better over these last months. Indeed, it would be more honest to say that nothing has changed.\\nThe tensions engendered by shifts in distribution of economic and political influence continue to grow. Mutual distrust creates a burden that narrows our possibilities for finding effective responses to the real threats and challenges facing the world today. Essentially, the entire globalisation project is in crisis today and in Europe, as we know well, we hear voices now saying that multiculturalism has failed.\\nI think this situation is in many respects the result of mistaken, hasty and to some extent over-confident choices made by some countries’ elites a quarter-of-a-century ago. Back then, in the late 1980s-early 1990s, there was a chance not just to accelerate the globalisation process but also to give it a different quality and make it more harmonious and sustainable in nature.\\nBut some countries that saw themselves as victors in the Cold War, not just saw themselves this way but said it openly, took the course of simply reshaping the global political and economic order to fit their own interests.\\nIn their euphoria, they essentially abandoned substantive and equal dialogue with other actors in international life, chose not to improve or create universal institutions, and attempted instead to bring the entire world under the spread of their own organisations, norms and rules. They chose the road of globalisation and security for their own beloved selves, for the select few, and not for all. But far from everyone was ready to agree with this.\\nWe may as well be frank here, as we know full well that many did not agree with what was happening, but some were unable by then to respond, and others were not yet ready to respond. The result though is that the system of international relations is in a feverish state and the global economy cannot extricate itself from systemic crisis. At the same time, rules and principles, in the economy and in politics, are constantly being distorted and we often see what only yesterday was taken as a truth and raised to dogma status reversed completely.\\nIf the powers that be today find some standard or norm to their advantage, they force everyone else to comply. But if tomorrow these same standards get in their way, they are swift to throw them in the bin, declare them obsolete, and set or try to set new rules.\\nThus, we saw the decisions to launch airstrikes in the centre of Europe, against Belgrade, and then came Iraq, and then Libya. The operations in Afghanistan also started without the corresponding decision from the United Nations Security Council. In their desire to shift the strategic balance in their favour these countries broke apart the international legal framework that prohibited deployment of new missile defence systems. They created and armed terrorist groups, whose cruel actions have sent millions of civilians into flight, made millions of displaced persons and immigrants, and plunged entire regions into chaos.\\nWe see how free trade is being sacrificed and countries use sanctions as a means of political pressure, bypass the World Trade Organisation and attempt to establish closed economic alliances with strict rules and barriers, in which the main beneficiaries are their own transnational corporations. And we know this is happening. They see that they cannot resolve all of the problems within the WTO framework and so think, why not throw the rules and the organisation itself aside and build a new one instead. This illustrates what I just said.\\nAt the same time, some of our partners demonstrate no desire to resolve the real international problems in the world today. In organisations such as NATO, for example, established during the Cold War and clearly out of date today, despite all the talk about the need to adapt to the new reality, no real adaptation takes place. We see constant attempts to turn the OSCE, a crucial mechanism for ensuring common European and also trans-Atlantic security, into an instrument in the service of someone’s foreign policy interests. The result is that this very important organisation has been hollowed out.\\nBut they continue to churn out threats, imaginary and mythical threats such as the ‘Russian military threat’. This is a profitable business that can be used to pump new money into defence budgets at home, get allies to bend to a single superpower’s interests, expand NATO and bring its infrastructure, military units and arms closer to our borders.\\nOf course, it can be a pleasing and even profitable task to portray oneself as the defender of civilisation against the new barbarians. The only thing is that Russia has no intention of attacking anyone. This is all quite absurd. I also read analytical materials, those written by you here today, and by your colleagues in the USA and Europe.\\nIt is unthinkable, foolish and completely unrealistic. Europe alone has 300 million people. All of the NATO members together with the USA have a total population of 600 million, probably. But Russia has only 146 million. It is simply absurd to even conceive such thoughts. And yet they use these ideas in pursuit of their political aims.\\nAnother mythical and imaginary problem is what I can only call the hysteria the USA has whipped up over supposed Russian meddling in the American presidential election. The United States has plenty of genuinely urgent problems, it would seem, from the colossal public debt to the increase in firearms violence and cases of arbitrary action by the police.\\nYou would think that the election debates would concentrate on these and other unresolved problems, but the elite has nothing with which to reassure society, it seems, and therefore attempt to distract public attention by pointing instead to supposed Russian hackers, spies, agents of influence and so forth.\\nI have to ask myself and ask you too: Does anyone seriously imagine that Russia can somehow influence the American people’s choice? America is not some kind of ‘banana republic’, after all, but is a great power. Do correct me if I am wrong.\\nThe question is, if things continue in this vein, what awaits the world? What kind of world will we have tomorrow? Do we have answers to the questions of how to ensure stability, security and sustainable economic growth? Do we know how we will make a more prosperous world?\\nSad as it is to say, there is no consensus on these issues in the world today. Maybe you have come to some common conclusions through your discussions, and I would, of course, be interested to hear them. But it is very clear that there is a lack of strategy and ideas for the future. This creates a climate of uncertainty that has a direct impact on the public mood.\\nSociological studies conducted around the world show that people in different countries and on different continents tend to see the future as murky and bleak. This is sad. The future does not entice them, but frightens them. At the same time, people see no real opportunities or means for changing anything, influencing events and shaping policy.\\nYes, formally speaking, modern countries have all the attributes of democracy: Elections, freedom of speech, access to information, freedom of expression. But even in the most advanced democracies the majority of citizens have no real influence on the political process and no direct and real influence on power.\\nPeople sense an ever-growing gap between their interests and the elite’s vision of the only correct course, a course the elite itself chooses. The result is that referendums and elections increasingly often create surprises for the authorities. People do not at all vote as the official and respectable media outlets advised them to, nor as the mainstream parties advised them to. Public movements that only recently were too far left or too far right are taking centre stage and pushing the political heavyweights aside.\\nAt first, these inconvenient results were hastily declared anomaly or chance. But when they became more frequent, people started saying that society does not understand those at the summit of power and has not yet matured sufficiently to be able to assess the authorities’ labour for the public good. Or they sink into hysteria and declare it the result of foreign, usually Russian, propaganda.\\nFriends and colleagues, I would like to have such a propaganda machine here in Russia, but regrettably, this is not the case. We have not even global mass media outlets of the likes of CNN, BBC and others. We simply do not have this kind of capability yet.\\nAs for the claim that the fringe and populists have defeated the sensible, sober and responsible minority – we are not talking about populists or anything like that but about ordinary people, ordinary citizens who are losing trust in the ruling class. That is the problem.\\nBy the way, with the political agenda already eviscerated as it is, and with elections ceasing to be an instrument for change but consisting instead of nothing but scandals and digging up dirt – who gave someone a pinch, who sleeps with whom, if you’ll excuse me. This just goes beyond all boundaries. And honestly, a look at various candidates’ platforms gives the impression that they were made from the same mould – the difference is slight, if there is any.\\nIt seems as if the elites do not see the deepening stratification in society and the erosion of the middle class, while at the same time, they implant ideological ideas that, in my opinion, are destructive to cultural and national identity. And in certain cases, in some countries they subvert national interests and renounce sovereignty in exchange for the favour of the suzerain.\\nThis begs the question: who is actually the fringe? The expanding class of the supranational oligarchy and bureaucracy, which is in fact often not elected and not controlled by society, or the majority of citizens, who want simple and plain things – stability, free development of their countries, prospects for their lives and the lives of their children, preserving their cultural identity, and, finally, basic security for themselves and their loved ones.\\nPeople are clearly scared to see how terrorism is evolving from a distant threat to an everyday one, how a terrorist attack could occur right near them, on the next street, if not on their own street, while any makeshift item – from a home-made explosive to an ordinary truck – can be used to carry out a mass killing.\\nMoreover, the terrorist attacks that have taken place in the past few years in Boston and other US cities, Paris, Brussels, Nice and German cities, as well as, sadly, in our own country, show that terrorists do not need units or organised structures – they can act independently, on their own, they just need the ideological motivation against their enemies, that is, against you and us.\\nThe terrorist threat is a clear example of how people fail to adequately evaluate the nature and causes of the growing threats. We see this in the way events in Syria are developing. No one has succeeded in stopping the bloodshed and launching a political settlement process. One would think that we would have begun to put together a common front against terrorism now, after such lengthy negotiations, enormous effort and difficult compromises.\\nBut this has not happened and this common front has not emerged. My personal agreements with the President of the United States have not produced results either. There were people in Washington ready to do everything possible to prevent these agreements from being implemented in practice. This all demonstrates an unexplainable and I would say irrational desire on the part of the Western countries to keep making the same mistakes or, as we say here in Russia, keep stepping on the same rake.\\nWe all see what is happening in Afghanistan, Iraq, Libya and a number of other countries. I have to ask, where are the results of the fight against terrorism and extremism? Overall, looking at the world as a whole, there are some results in particular regions and locations, but there is no global result and the terrorist threat continues to grow.\\nWe all remember the euphoria in some capitals over the Arab Spring. Where are these fanfares today? Russia’s calls for a joint fight against terrorism go ignored. What’s more, they continue to arm, supply and train terrorist groups in the hope of using them to achieve their own political aims. This is a very dangerous game and I address the players once again: The extremists in this case are more cunning, clever and stronger than you, and if you play these games with them, you will always lose.\\nColleagues, it is clear that the international community should concentrate on the real problems facing humanity today, the resolution of which will make our world a safer and more stable place and make the system of international relations fairer and more equal. As I said, it is essential to transform globalisation from something for a select few into something for all. It is my firm belief that we can overcome these threats and challenges only by working together on the solid foundation of international law and the United Nations Charter.\\nToday it is the United Nations that continues to remain an agency that is unparalleled in representativeness and universality, a unique venue for equitable dialogue. Its universal rules are necessary for including as many countries as possible in economic and humanitarian integration, guaranteeing their political responsibility and working to coordinate their actions while also preserving their sovereignty and development models.\\nWe have no doubt that sovereignty is the central notion of the entire system of international relations. Respect for it and its consolidation will help underwrite peace and stability both at the national and international levels. There are many countries that can rely on a history stretching back a thousand years, like Russia, and we have come to appreciate our identity, freedom and independence. But we do not seek global domination, expansion or confrontation with anyone.\\nIn our mind, real leadership lies in seeing real problems rather than attempting to invent mythical threats and use them to steamroll others. This is exactly how Russia understands its role in global affairs today.\\nThere are priorities without which a prosperous future for our shared planet is unthinkable and they are absolutely obvious. I won’t be saying anything new here. First of all, there is equal and indivisible security for all states. Only after ending armed conflicts and ensuring the peaceful development of all countries will we be able to talk about economic progress and the resolution of social, humanitarian and other key problems. It is important to fight terrorism and extremism in actuality. It has been said more than once that this evil can only be overcome by a concerted effort of all states of the world. Russia continues to offer this to all interested partners.\\nIt is necessary to add to the international agenda the issue of restoring the Middle Eastern countries’ lasting statehood, economy and social sphere. The mammoth scale of destruction demands drawing up a long-term comprehensive programme, a kind of Marshall Plan, to revive the war- and conflict-ridden area. Russia is certainly willing to join actively in these team efforts.\\nWe cannot achieve global stability unless we guarantee global economic progress. It is essential to provide conditions for creative labour and economic growth at a pace that would put an end to the division of the world into permanent winners and permanent losers. The rules of the game should give the developing economies at least a chance to catch up with those we know as developed economies. We should work to level out the pace of economic development, and brace up backward countries and regions so as to make the fruit of economic growth and technological progress accessible to all. Particularly, this would help to put an end to poverty, one of the worst contemporary problems.\\nIt is also absolutely evident that economic cooperation should be mutually lucrative and rest on universal principles to enable every country to become an equal partner in global economic activities. True, the regionalising trend in the world economy is likely to persist in the medium term. However, regional trade agreements should complement and expand not replace the universal norms and regulations.\\nRussia advocates the harmonisation of regional economic formats based on the principles of transparency and respect for each other’s interests. That is how we arrange the work of the Eurasian Economic Union and conduct negotiations with our partners, particularly on coordination with the Silk Road Economic Belt project, which China is implementing. We expect it to promote an extensive Eurasian partnership, which promises to evolve into one of the formative centres of a vast Eurasian integration area. To implement this idea, 5+1 talks have begun already for an agreement on trade and economic cooperation between all participants in the process.\\nAn important task of ours is to develop human potential. Only a world with ample opportunities for all, with highly skilled workers, access to knowledge and a great variety of ways to realise their potential can be considered truly free. Only a world where people from different countries do not struggle to survive but lead full lives can be stable.\\nA decent future is impossible without environment protection and addressing climate problems. That is why the conservation of the natural world and its diversity and reducing the human impact on the environment will be a priority for the coming decades.\\nAnother priority is global healthcare. Of course, there are many problems, such as large-scale epidemics, decreasing the mortality rate in some regions and the like. So there is enormous room for advancement. All people in the world, not only the elite, should have the right to healthy, long and full lives. This is a noble goal. In short, we should build the foundation for the future world today by investing in all priority areas of human development. And of course, it is necessary to continue a broad-based discussion of our common future so that all sensible and promising initiatives are heard.\\nColleagues, ladies and gentlemen, I am confident that you, as members of the Valdai Club, will actively take part in this work. Your expertise enables you to understand all angles of the processes underway both in Russia and in the world, forecast and evaluate long-term trends, and put forward new initiatives and recommendations that will help us find the way to the more prosperous and sustainable future that we all badly need.\\nThank you very much for your attention.\\nVladimir Putin'"}, "time": 1742561689.7745972}