{"duration": 0.04556131362915039, "input_args": {"text": "'This post was originally published on this site \\nMOSCOW, November 8. /TASS/. Witness in the case of Russian oppositionist Boris Nemtsov’s murder, former worker of a Moscow auto dealership Artyom Trapezin has identified one of the suspects and confirmed selling them a car used by the suspected killers to spy on the politician. \\nThe witness has made this statement at the Moscow District Military Court, which is holding a hearing on the Nemtsov murder case. \\nAccording to the witness, suspect Dadayev was going to buy a car with a copy of a passport allegedly for his brother who had had a car accident. \\n“I earlier saw and talked to Zaur Dadayev. We agreed with him on the price of the car and he drove off for getting money, after which he returned and bought a ZAZ Chance car for 90,000 rubles [$1,400],” Trapezin said. \\nHowever, Dadayev rejected this testimony. \\n“I saw him only in the investigator’s room for the first time. We don’t know each other,” he said. \\nNemtsov, former deputy prime minister under then-President Boris Yeltsin, co-chairman of the Parnas party and lawmaker of the Yaroslavl regional legislature, was gunned down in downtown Moscow on February 27, 2015. Five persons were arrested on March 8 last year on suspicion of murdering the politician: Zaur Dadayev, Anzor and Shadid Gubashev, Tamerlan Eskerkhanov and Khamzat Bakhayev. \\nDepending on their role and the degree of their involvement, they are pressed with charges under part 2, article 105 (“Contract Murder Committed by an Organized Group”) and part 3, article 222 of Russia’s Criminal Code (“Illegal Acquisition, Transfer, Storage, Transportation and Possession of Firearms and Ammunition by an Organized Group”). Article 105 carries a punishment of up to life imprisonment. \\nThe accused persons are denying their complicity in Nemtsov’s murder. The term of their arrest has been extended until December 30. \\nAccording to investigators, the men received at least 15 million rubles ($238,000 at the current exchange rate) for the politician’s murder. They started preparing for the killing back in September 2014. The suspected organizer of the murder is Ruslan Mukhudinov, a former officer of the Chechen “Sever” battalion. Mukhudinov has been charged in absentia. He has been on the international wanted list since November 2015. A criminal case against him and other unidentified persons is investigated separately. \\nIn late June, Russia’s Prosecutor General’s Office sent the criminal case to the Moscow District Military Court to review its merits. The defendants have insisted that the murder case should be considered by the board of jurors. \\nThe case is heard by the Moscow District Military Court rather than the Moscow City Court as Zaur Dadayev, one of the suspected perpetrators, was a serviceman of the “Sever” battalion in the North Caucasus republic of Chechnya at the moment when the murder was committed. \\n{{item.group_date}} '"}, "time": 1742561839.6034315}