{"duration": 0.10528945922851562, "input_args": {"text": "'posted by Eddie Argentinian and Brazilian Doctors claim that the application of a pesticide to Brazil’s drinking water is to blame for the increase in Zika-associated birth defects. With 2014’s Ebola panic all but forgotten, many Americans are now in a frenzy over the spread of the Zika virus. The Zika virus, and the media-driven panic of its spread, began in late 2015 following widespread birth deformations in Brazil, which were quickly linked to Zika. The link between Zika and microcephaly, the most striking birth defect allegedly caused by the virus, was largely based on a scientific paper by A.S. Oliveira Melo that found Zika in the amniotic fluids and other tissues in two cases. That’s right, only two women were examined in the study and the virus wasn’t even found in their blood, just the amniotic fluid. The New York Times reported in February of this year that only 17 of the 404 confirmed cases of microcephaly, only 4.2%, tested positive for Zika. In response to these numbers which show no correlation between the presence of Zika infection and microcephaly, the government and “many researchers” said that this statistic “may be largely irrelevant, because their tests would find the presence of the virus in only a tiny percentage of cases.” Another indicator that the increase in microcephaly and other birth defects may have another cause altogether was Zika’s effects in Colombia. According to Colombia’s government , public health officials have so far diagnosed more than 17,000 pregnant women with Zika but only 18 cases of Zika-associated microcephaly have been reported, less than 0.2%. The birth defect most frequently associated with Zika is microcephaly, an incurable condition that causes brain damage and small head size. Amidst the glaring lack of basis for linking Zika to microcephaly, a group of Argentinian doctors, Médicos de Pueblos Fumigados, have published a report citing a pesticide used to mosquito larva as the real cause of the birth defects. According to the report , the area where most of the affected Brazilian families live, Pernambuco, had its drinking water treated for 18 months with a chemical larvicide that produces fatal birth defects in mosquitoes. Pernambuco reported over 4,000 cases of microcephaly in 2015. The use of the pesticide in water supplies was done as part of a government mosquito control program against other mosquito-borne diseases. The doctors go on to say that in previous Zika epidemics, no birth defects were recorded, despite infecting 75% of the population. They also warned about other anti-Zika control measures of the Brazilian government, such as the introduction of GM mosquitoes, have completely failed and may have dangerous consequences for the environment. A separate group of Brazilian medical professionals, the Brazilian Association for Collective Health, have seconded these claims and have also expressed their belief that the Zika scare is a commercial maneuver from agrochemical companies, which, they say, are deeply integrated into the Latin American ministries of health, as well as the World Health Organization and the Pan American Health Organisation. The symptoms of Zika are identical to the symptoms of mild pesticide poisoning. The pesticide used by the Brazilian government is called pyriproxyfen. Pyriproxyfen was sold under the brand name SumiLarv to the Brazilian government by Sumimoto Chemical Inc., a Japanese strategic partner of Monsanto. The partnership between the two companies began in October 2010 and the collaboration focuses on the US, Brazil, and Argentina. In the US, pyriproxyfen is chiefly marketed as Nylar , an anti-flea product for pets. The EPA found it to be highly toxic to all aquatic life, including fish, plankton, and insects, but ultimately decided to label pyriproxyfen only as “slightly toxic.” According to the CDC , long-term exposure to pyriproxyfen can have long-term effects on the blood and liver, resulting in anemia, impaired functions, and tissue lesions. There are no studies regarding its reproductive effects. However, in animal studies , pyriproxyfen doses of 300 mg/ kg / day and higher caused an increase in “visceral and skeletal” variations in rats, such as deformations of the skull. Despite this evidence, the EPA declined to list pyriproxyfen as having negative reproductive effects. Interestingly, symptoms of pesticide poisoning are very similar to the alleged Zika symptoms that Brazilian women have experienced: rash/skin irritation, conjunctivitis, headaches, and muscle/joint pain. Is the Zika virus being used to cover up what may actually be one of the worst mass poisonings on record? What are your thoughts? Please share, like, and comment on this article! source:'"}, "time": 1742564058.0762532}