{"duration": 0.08318614959716797, "input_args": {"text": "'SYDNEY, Australia  —   A menacing Cyclone Debbie struck the northeastern Australian coastline with devastating force Tuesday, slowly churning its path of destruction inland with wind gusts as high as 160 miles per hour, forcing tens of thousands to flee and leaving at least 48, 000 homes without power. After lashing   tourist islands off the coast, the storm bore down on the mainland, tearing roofs from homes and drenching   coastal towns with heavy rainfall. Its slow, potent march inland had officials fearing widespread damage, but the loss of telephone service and power left emergency responders struggling to assess the situation. “This is a dangerous cyclone,” said Annastacia Palaszczuk, the premier of Queensland. “We are seeing some structural damage in places such as Proserpine, and we expect that there will be that sort of damage along some of those small coastal communities, which are in the direct path of Cyclone Debbie. ” The storm made landfall around 1 p. m. near the resort town of Airlie Beach, which was hit by winds of up to 160 miles an hour, damaging roofs and knocking over palm trees. By nightfall, it was downgraded to a Category 3 storm, from a Category 4, as it began “curving to a more southerly track over inland Queensland,” the Bureau of Meteorology said. A Category 3 storm on the Australian scale typically entails gusts of more than 102 miles an hour. Ms. Palaszczuk said it was difficult to assess the damage. “We’re starting to see it where they’re actually losing communication, and that’s the biggest problem for us  —   because we just don’t know how many people are injured, the status of their homes,” she said. Prime Minister Malcolm Turnbull told Parliament that “conditions have deteriorated badly” in Queensland, adding that the Choules, a landing ship with helicopters and medical personnel, was dispatched to the area, as were air force airlift craft. The government has deployed 1, 000 personnel to provide assistance and disaster relief, with the army on standby to help out. The Insurance Council of Australia declared the cyclone a catastrophe, activating a hotline to help policy holders with claims. The cyclone forced thousands of people to seek shelter well away from   coastal areas. Lama Ghee, 39, arrived at the Ayr shelter with his sister, daughter and three nieces. “I don’t want to stay there in a big cyclone like this and get blown away,” he said, noting that his house was made of wood and was in disrepair and that he feared a storm surge. “I am thinking of my children and my nieces. ” The cyclone was of a size that had not been seen in the state since Cyclone Yasi, a severe tropical storm, hit in 2011. That storm, which caused billions of dollars in damage, was one of the most powerful cyclones to have affected Queensland since   began, according to the Australian Bureau of Meteorology. The slow path of the storm this week had officials concerned about its destructive force. “Debbie is a very large,   system,” said John Fowler, a spokesman for Ergon Energy, noting that 48, 000 customers were without power in the Bowen, Whitsunday and Mackay areas. “This one is actually taking its time, so the longer it takes, the more damage it will do  —   not just to our network but obviously to property as well. ” Among the   concerns was further damage to the Great Barrier Reef, which has already been seriously degraded by warming waters. “There’s probably quite a lot of reef area in the footprint of Cyclone Debbie that’s at risk from damage from the wind and the waves,” said David Wachenfeld, director of reef recovery at the Great Barrier Reef Marine Park Authority. “So it’s a double whammy for the reef with bleaching. ”'"}, "time": 1742561973.9610894}