{"duration": 0.031832218170166016, "input_args": {"text": "'As Hillary’s Henchmen Try To Silence WikiLeaks, Assange Gets Sweet Revenge Posted on October 28, 2016 by Robert Rich in Politics Share This \\nFor many Americans, there’s little doubt that Democrats were behind shutting down Julian Assange in a desperate attempt to silence what he knows, but it’s not working. In fact, just a short while after Hillary Clinton’s henchmen cut him off from the rest of the world, it seems that Assange is about to get himself some sweet revenge – and hopefully, the presidential hopeful likes the color orange. Wikileaks founder Julian Assange (left) and Hillary Clinton (right) \\nDemocrats are using every dirty trick in the book, despite their recent motto being “when they go low, we’ll go high.” In fact, it certainly seems that the only people going low are Hillary Clinton and those fiercely trying to force the American people to let her into the Oval Office. \\nProving just that, it seems that Barack Obama put on the pressure , on behalf of Hillary’s best interest, leading to WikiLeaks founder Julian Assange being cut off from communicating with the world. Although the Ecuadorian government severed his Internet access, claiming they didn’t want to influence an election and Democrats just shrugged off the matter, the American people could see through the line of crap we were being fed. \\nUnfortunately for Hillary and everyone who has lied and deceived in her name, it looks like her campaign is about to come to a screeching halt as the WikiLeaks founder has just promised to get himself some sweet revenge . Now experiencing just how corrupt the left is, Assange claims that his “next leak will result in the arrest of Hillary Clinton.” \\nLet’s just hope Hillary likes the color orange because it looks like she’s about to spend quite a few years wearing a prison jumpsuit. In all, Assange still has over 50,000 emails to release — and those are just the ones belonging to John Podesta.'"}, "time": 1742628489.1285148}