{"duration": 0.03168964385986328, "input_args": {"text": "'Neighbors Add To Hillary Sign With Blunt Message Of Their Own Next Door Posted on October 30, 2016 by Amanda Shea in Politics Share This \\nWhen an apartment-dweller decided to use their entire balcony to show their support for the Democratic candidate, their clever neighbors to the right completed it with a blunt message of their own. By incorporating the “Hillary” sign into a sentence, the people in the building next door made the liberal regret hanging their stupid sign. \\nUnlike the sea of Donald Trump signs that fill neighborhoods throughout the country, it’s exceptionally rare to see a sign supporting Hillary Clinton for president. Perhaps this person of the top floor of a small apartment building was making up for that by being loud and proud of their criminal candidate, but the people parallel to them won the war of words in a big way. \\nJohn Nolte posted a photo of the opinionated neighbors, noting that he’s not sure where these buildings are, but the message they made was very clear. Rather than ripping the Hillary sign down, setting it on fire, or any other destructive act of vandalism that liberals have done to Trump signs, the clever conservative simply completed what the liberal should have said, adding “Is A Liar” to their windows so passersby read the overall display as “Hillary Is A Liar.” Photo of the war or words between neighbors, Tweeted by John Nolte \\nThis statement is not only true but also proves the difference in each candidate’s followers when they disagree with something. The Trump supporters didn’t make a big deal about the Hillary-loving idiots, they had a sense of humor about it. \\nIf it was the other way around, the outcome would have been damaging to the resident’s personal property and possibly even their person, because ignorant liberals get violent when they feel “offended” by something. Conservatives fight with facts, as these people did here by pointing out that Hillary is a liar and why they aren’t voting for her.'"}, "time": 1742562742.4564402}