{"duration": 0.11501193046569824, "input_args": {"text": "'ISTANBUL  —   Lawmakers from President Recep Tayyip Erdogan’s governing party pushed through an amendment to the Turkish Constitution on Friday that would strip members of Parliament of their immunity from prosecution, a move that is likely to lead to the ouster of Kurdish deputies. After months of fierce debate  —   including a brawl in Parliament that left one deputy with a dislocated shoulder  —   376 of the 550 deputies voted in a secret ballot to approve the constitutional amendment, allowing it to pass without a public referendum. Mr. Erdogan is certain to approve the change. The contentious amendment was proposed after Mr. Erdogan called for members of the Kurdish People’s Democratic Party, or H. D. P. to face prosecution for alleged ties with Kurdish militants who have carried out a    insurgency against Turkey. “This is a historic vote,” Mr. Erdogan said on Friday, speaking in his hometown, Rize, on the Black Sea coast. “My people do not want to see guilty lawmakers in this Parliament, especially the supporters of the separatist terrorist organization. ” The H. D. P. is the   party in Parliament with 59 seats 50 of those lawmakers face prosecution. Under the new amendment, they can be prosecuted for a number of charges, including some for terrorism, and will effectively be removed from Parliament. Mr. Erdogan’s governing Justice and Development Party could then call early elections that would help him establish an executive presidency and consolidate more power. “We view this motion as a political coup attempt to completely destroy the separation of powers by subordinating the legislative to the executive and leaving the former to the mercy of a thoroughly politicized and biased judiciary,” the H. D. P. chairmen Selahattin Demirtas and Figen Yuksekdag wrote in a letter to members of the European Parliament in Strasbourg, France. “This coup would be a most crucial step for Erdogan to replace Turkey’s parliamentary democracy, which he has twice declared ‘de facto over,’ with an absolutist presidential system in which the legislative, executive and judiciary powers are virtually monopolized by the president himself,” they added. The constitutional change could complicate Turkey’s relationship with the European Union, and jeopardize a deal agreed in March that renewed talks for Turkey to join the bloc and allowed Turkish citizens to travel in Europe without visas in exchange for Turkey’s help in stemming the flow of asylum seekers to the Continent. Kurdish politicians warned that their exclusion from Parliament could exacerbate tensions in Turkey’s predominantly Kurdish southeast, where the Turkish state has been fighting a counterinsurgency campaign against the militant Kurdistan Workers’ Party, or P. K. K. since the group ended a   last July. “Taking Kurds out of politics and shutting down the political channels to resolve this conflict will only disenfranchise Kurdish youth further and push them toward a radical path in the fight toward great autonomy,” said Kubra Demir, a Kurdish activist in the southeastern city of Sirnak. Analysts who have watched the debate over immunity in Parliament in recent weeks have likened it to a period in 1994 when Kurdish deputies from the Democracy Party, or D. E. P. were imprisoned on terrorism charges, which led to one of the most violent periods in the conflict between Turkey and the Kurds. “It took Turkey almost two decades to recover from that,” said Asli Aydintasbas, a fellow at the European Council on Foreign Relations. “To repeat the same mistake would set back Turkish democracy for quite some time. ” She added: “This will neither solve the Kurdish situation or help Turkey’s territorial integrity in the long run. I worry that Erdogan’s zeal and constant targeting of H. D. P. for this is paving the path for actual division of the country further down the road. ” The change to the Constitution will not just apply to members from the Kurdish party as many as 138 Turkish lawmakers from all parties now find themselves vulnerable to prosecution. Several members of the main opposition Republican People’s Party face charges for insulting Mr. Erdogan, including the party’s leader who called the president a “political and sexual pervert. ” In a statement earlier this week, the H. D. P. said that none of the investigations into its parliamentary deputies were about concerns over corruption, bribery or theft. “They are all about freedom of expression,” the party said in a statement posted on Twitter.'"}, "time": 1742564158.798167}