{"duration": 0.04793953895568848, "input_args": {"text": "'WASHINGTON, D. C.  —   Edward “Ned” Price, the Central Intelligence Agency (CIA) analyst who said he resigned last week because of President Donald Trump’s “disturbing” actions and that his “decision had nothing to do with politics,” donated thousands of dollars to Hillary Clinton’s failed 2016 presidential campaign. [“To be clear, my decision had nothing to do with politics, and I would have been proud to again work under a Republican administration open to intelligence analysis,” Price wrote in an   he penned for the Washington Post Monday. He added, “As intelligence professionals, we’re taught to tune out politics” and noted that “Despite working proudly for Republican and Democratic presidents, I reluctantly concluded that I cannot in good faith serve this administration as an intelligence professional. ”  Price suggested his decision emanated from President Trump’s “disturbing” actions. However, public records indicate Price has been listed as a registered Democrat in D. C. since 2008. Further, Federal Election Commission (FEC) records show that Price donated thousands of dollars to Hillary Clinton’s presidential campaign. These records indicate that on August 21, 2016, he made two donations to Clinton’s campaign. Price donated $2, 300 to the DNC’s Hillary Victory Fund and another $2, 700 to Hillary For America. According to NPR, “The Hillary Victory Fund is a joint fundraising committee for Hillary for America, the Democratic National Committee and the Democratic committees of 32 states and Puerto Rico. ” However, Price’s deep ties to the Democratic Party reach back over 15 years. According to his LinkedIn profile, Price campaigned for Dallas’s former Democratic Mayor Ron Kirk in his unsuccessful bid for the Senate in 2002. Kirk lost to   Attorney General, Sen. John Cornyn ( ). Then, in November 2013, Price contributed $250 to Massachusetts Democrat Seth Moulton in his bid for Congress, according to FEC records. In his   Price also attempted to echo rhetoric from the left alleging Trump’s chief strategist Stephen K. Bannon was “a media champion of white nationalism. ” Those false smears have repeatedly been discredited by individuals from all over the political spectrum. Follow Adelle Nazarian on Twitter and Periscope @AdelleNaz'"}, "time": 1742563196.764892}