{"duration": 0.13069963455200195, "input_args": {"text": "'WASHINGTON  —   By a single vote, the Senate gave final approval on Thursday to a measure to block cities and counties from organizing retirement savings accounts for workers who have no access to   plans. The vote reverses a Labor Department rule that allows local governments to automatically enroll   workers in retirement plans unless they opt out. The   vote was a startling reversal for many Republicans, who have argued for much of their careers that overzealous federal regulators were trampling the rights of state and local governments. In this case, congressional Republicans protested that President Barack Obama’s rules gave local regulators too much leeway. Representative Virginia Foxx, Republican of North Carolina, a sponsor of the legislation, called it “unconscionable” that the Obama administration’s rule was denying workers federal consumer protections. The White House has indicated that President Trump will sign the measure into law. New York City, Philadelphia and Seattle all have considered retirement plans taking advantage of the Labor Department rule  —   what they call a “safe harbor”  —   that Republicans seek to reverse. Five states have also passed legislation permitted by a similar Labor Department regulation, which gives the states the power to appoint private money managers who would oversee portable savings accounts for workers. The Senate is expected to soon take up a separate House resolution rolling back that state rule. The consequences of the Senate’s votes could be significant. The Labor Department rules were designed to give around 13 million people in the five states access to retirement accounts, out of 55 million nationwide who lack   retirement programs. Among those affected most by the measure passed on Thursday will be small business owners and employees who have blanched at the cost of conventional 401( k) plans or pensions. In a joint statement, Mayor Bill de Blasio of New York, the City Council president, the city’s public advocate and a council member said that they were “deeply disappointed that Congress has voted to overturn the Department of Labor rule providing a safe harbor for us to create retirement savings plans for private sector employees. ” “This vote does little more than block them  —   the majority of whom are women and people of color  —   from securing their futures,” the statement said. Thursday’s vote was only the latest regulation that Republicans have rolled back this year using the 1996 Congressional Review Act, which had hardly been used in the two decades before Mr. Trump’s inauguration. Seven rollbacks have been signed into law by President Trump, with several others awaiting his signature. But in this case, Republicans were replacing local regulatory authority with federal control  —   taking up a cause of investment banks that fear competition from state and local governments. The Obama Labor Department’s rule actually gave states more autonomy in reaching contracts with   financial managers to handle the savings accounts. State governments could be administrative conduits, keeping records while passing on funding to private consultants, who would manage the money in place of state treasurers. “Too many states have made questionable decisions when it comes to managing retirement funding,” said Representative Phil Roe, Republican of Tennessee. Republicans maintained that   retirement savings accounts free of federal consumer protection rules had an unfair advantage over plans from   providers. Under the law that governs pensions, employers must show that they are managing their retirement programs on behalf of their workers, not the investment funds  —   a provision some Republicans argued that state and city plans could skirt. In fact, many states that have passed legislation to take advantage of the Labor Department regulation have included a similar “fiduciary responsibility” requirement in their   programs. And Congress has acted to reverse an Obama administration regulation that demanded that retirement investment advisers make their clients’ interests paramount. Senators in both parties lobbed comments on the issue on the Senate floor Wednesday. Critical of what he called the “competitive advantage” that the rules might give cities and states over   retirement offerings, Senator Mitch McConnell of Kentucky, the majority leader, said the Labor Department statutes spelled “more government at the expense of the private sector. ” “These retirement savings regulations are a classic case of the whole being worse than the sum of its parts,” he said. Both of Oregon’s senators, who are Democrats, spoke on behalf of the Labor Department rules, which would protect their state’s “OregonSaves” retirement accounts, scheduled to open in July. “I hear all the time in here about states’ rights. I hear all the time about how states are the place for experimentation to see what works and what doesn’t work,” Senator Jeff Merkley of Oregon said. “This Congressional Review Act proposal says the opposite. It says, ‘Let’s stomp out experiments by our municipalities. ’” Some liberals see the fight over the House bills as a proxy battle that Republicans were eager to wage on behalf of the financial services industry. “They’re ignoring the fact that the idea of the  . R. A. came out of the Heritage Foundation and Brookings,” said Joshua Gotbaum, chairman of the board responsible for setting up Maryland’s version of the plan, referring to a conservative research institution and the more liberal Brookings Institution. “It’s supported by the Republican state treasurer of Utah and Indiana  —   real    Republican states. ” “This is fundamentally a Republican idea,” Mr. Gotbaum added. David John, a policy adviser at AARP and the deputy director of the Brookings Institution’s Retirement Security Project, wrote papers defending the  . R. A. concept while he was at the conservative Heritage Foundation. “This is a problem that could be just as easily dealt with at the federal level. But it’s not being dealt with. Rather than doing nothing, states are stepping in and recognizing that it’s in their financial interests to act and build these systems,” Mr. John said. “With the   plans, we’re seeing for the first time hundreds of thousands of people who have access to these from the day they go to work to the day they retire,” he added. Mr. Gotbaum expressed confidence in states’ ability to defend their prerogatives. “There’s going to be a lawsuit, and the lawsuit is going to decide this,” he said of the next step for them. “They’re going to go ahead no matter what. ”'"}, "time": 1742561710.8579495}