{"duration": 0.2153007984161377, "input_args": {"text": "'Monday on MSNBC’s “Hardball,” in responding to the ongoing story that started at Sunday’s Golden Globes awards ceremony with remarks by actress Meryl Streep criticizing   Donald Trump and continued with tweets from Trump calling Streep “overrated” and a “flunky” for former Democratic presidential candidate Hillary Clinton, actress and singer Barbra Streisand weighed in by wondering how we could take “four years of this. ”  Streisand said, “I thought she said what she said beautifully. And It’s easy enough to see the video online of Trump mocking  —   you just showed it  —   I completely agree with Meryl. It was heartbreaking moment and so beneath the dignity of the presidency, let alone any respectful person. What we need more is kindness and common decency. And what he did, how he reacted and how he needs  —   he has the need to talk back and insult anybody who doesn’t agree with him, and that’s pretty disgraceful. ” She continued, “What’s the signal to little children who watch television and see this behavior of the soon to be president of the United States? Little girls were heartbroken when Hillary Clinton didn’t get to to be president. So I think it’s what they see. Children will listen, I sang that in a song once,  and you know they will see and they will learn. And you know I’m in the middle of having my teeth cleaned. You caught me at a disadvantage. ” She added, “That is why you cant trust anything he says because if you get on his wrong side, he will blast you negatively  …     He had a New Year’s Eve party, but he wasn’t  generous to give that to his followers as a president. He had to charge for it  and put that money into this club. Don’t you think that’s a little strange?” She concluded, “I was very proud of her. She’s a wonderful actress and that he had to denigrate her talent because she spoke out. Why is he not sitting through briefings rather then tweeting this nonsense and rating wars with Arnold Schwarzenegger? I don’t know how we’re going to take four years of this. ” Follow Pam Key on Twitter @pamkeyNEN'"}, "time": 1742564579.6037989}