{"duration": 0.1975541114807129, "input_args": {"text": "'Activist Post As the U.S. Presidential selection circus draws to a close, the United States and Turkey have announced a new plan to defeat ISIS, the same terrorist organization both countries have created, funded, armed, and facilitated, in Syria. The plan revolves around the conquering, occupation, and governing of sovereign Syrian territory in the East, most notably Raqqa.\\nAccording to the U.S. Joint Chiefs of Staff, Gen. Joseph Dunford, after meeting with his Turkish counterpart, that “The coalition and Turkey will work together on the long-term plan for seizing, holding and governing Raqqa.” \\nThe statement by Dunford seems to confirm the fact that the United States will not move forward in its campaign for Raqqa without working closely with the Turks, who are themselves concerned about the makeup of the proxy forces destined to hold power once the campaign is over. The Syrian Democratic Forces, the proxies of choice in this battle, are made up of many Kurdish militias and fighters, an issue that provides much worry on the part of the Turkish government. \\nAs CNN reports , \\nBut DoD News reported that Sunday’s meeting reinforced a longstanding agreement that the US-led coalition would not move ahead with the seizure of Raqqa, “without incorporating the Turks and their perspective into our plans,” according to Dunford. \\nThe Turkish army said in a statement that the military heads had discussed “the methods of a common struggle” against ISIS in Iraq and Syria, “especially in Al Bab and Raqqa in coming days.” \\nAddressing the sensitivities around the ethnic makeup of the forces involved in the operation, Dunford said: “We always knew the SDF wasn’t the solution for holding and governing Raqqa. \\n“What we are working on right now is to find the right mix of forces for the operation.” He said the US would work with Turkey to determine the composition of the forces that would seize and govern the territory, he said. \\nHe said the right approach was for locals to lead the mission to retake the city and run it after ISIS was driven out. \\n“[The operation needs] a predominantly Arab and Sunni Arab force,” he said, according to DoD News. “And there are forces like that. There is the moderate Syrian opposition, the vetted Syrian forces and the Free Syrian Army forces, and there is some initial outreach to forces in Raqqa proper.” \\nDunford said the SDF were moving south to isolate ISIS positions in Raqqa and the surrounding areas — a phase that would take months. \\nEssentially, the United States and Turkey are devising a plan by which to control Raqqa and the territory surrounding it by using proxy forces to overthrow other proxy forces. In other words, the fighters in Raqqa will simply undergo another name change, be replaced with a heavy Kurdish contingent, and act as a carefully placed chess piece by which to prevent the Syrian or Russian militaries from liberating the city. After all, these SDF forces will be presented as “moderate,” a label that cannot be attached to the ISIS fighters currently inhabiting Raqqa. \\nRaqqa has acted as the ISIS capital since the mysterious appearance of the group two years ago and has gone virtually untouched as the Syrian military has been bogged down in major cities and western/central areas of the country in their fight against the Western-backed terrorists. Notably, despite its rhetoric of fighting to “degrade and destroy” ISIS, the U.S.-led coalition has yet to bomb Raqqa. \\nFresh on the heels of a major public relations victory in Palmyra , however, the Syrian military is now inching toward Raqqa and, if successful, it will score one of the biggest victories in the five-year war. This is not only because the de facto ISIS capital will be eliminated or because the SAA will gain more territory, it is because the liberation of Raqqa will be yet another example of how the Syrian military will have accomplished in weeks what the United States and coalition members have claimed may take a decade to do. It will be another instance where the lack of will on the part of the United States to actually destroy Daesh is put on display for the rest of the world, either causing the U.S. to look weak in the eyes of the world or exposing it for actually supporting the terrorist organization to begin with. Regardless, the victory for the Syrian government will be twofold. \\nThat is, unless the U.S. gets there first . . . . \\nThe U.S. has been using the presence of ISIS in Syria as an excuse to bomb, send Special Forces, publicly support terrorists, and possibly invade since the Western-backed terror group appeared on the scene two years ago. Yet, despite its rhetoric, the United States and its coalition have not bombed Raqqa and have largely abstained from bombing (see here and here ) any other terrorist group. Instead, the U.S. has focused on bombing Syrian military targets , civilians and civilian infrastructure ( see here also ), and acting as a deterrent to the Syrian military’s movement in many “rebel-held” areas of the country. \\nNow, however, the United States seems to have great interest in Raqqa as it aids its loose collection of terrorists, fanatical Kurds, and Arabs known as the Syrian Democratic Forces (SDF) in “battles” around the ISIS capital. \\nSo why the sudden interest in Raqqa? It’s fairly simple. The United States sees clearly that the Syrian military and its Russian allies are going to liberate Raqqa soon enough and the U.S. does not want to suffer another public relations setback. A defeat for ISIS is thus a humiliation for the United States. That fact alone should raise some eyebrows. \\nRegardless, the United States would like to have its own “victory” in Raqqa before the Syrians and the Russians can have theirs. If the SDF is able to “take” Raqqa, the U.S. will then be able to shout from the rooftops that America has liberated Raqqa and defeated ISIS in its own capital. \\nThe U.S. also has another goal in Raqqa – the theft of more Syrian territory by using its proxy forces going by the name of the SDF. Whether or not ISIS proper is in control of Raqqa is merely a secondary concern for the United States. If the SDF succeeds in imposing control over the city and the province, then the West will have succeeded in cementing control over the area in the hands of its proxy terrorists once again, but with yet another incarnation of the same Western-backed jihadist fanaticism. The U.S. can then use the “moderate rebel” label to keep Russia and Syria from bombing the fighters who merely assumed a position handed to them, albeit through some level of violence, by ISIS. \\nThis also allows the Western powers supporting their terrorist proxies the opportunity to provide the terrorists with a parcel of land inside Syria’s borders which can be used as a forward operating base and a staging ground for more attacks and operations launched at the rest of the country. \\nWith the situation as it stands, there is now the very real possibility of some type of major confrontation taking place in Raqqa that could very well have international ramifications. On one hand, there is the Syrian military, backed by the Russian Air Force and Russian Special Forces heading east to Raqqa while, on the other side, there is the SDF, backed by the U.S. Air and Special Forces, heading west toward Raqqa . Both sides are in a race to gain control over the ISIS capital, gain territory, and declare a victory for the world to see. But what if they arrive in Raqqa at the same time? \\nIn other words, there is a distinct potential that, in the race for Raqqa, the Syrian/Russian alliance might find itself face to face with the possibility of direct military conflict with the U.S./SDF (terrorist) alliance. At that point, the question will be who, if either, will back down? If both forces decide to push forward, the result could be devastating not only for Syria but for the rest of the world. \\nRegardless of what happens, it is important to remember that the Syrian military is acting entirely in self-defense both against the terrorists posing as “rebels” and the United States. Russia, Iran, and Hezbollah have all been invited in to Syria, acting legally and with the assent of the Syrian government, while the United States and its coalition are once again acting completely outside of international law in an attempt to shore up its terrorist proxies; and, once again, the United States and its coalition of the willing is pushing the patience of the rest of the world. \\nBrandon Turbeville – article archive here – is the author of seven books, Codex Alimentarius — The End of Health Freedom , 7 Real Conspiracies , Five Sense Solutions and Dispatches From a Dissident, volume 1 and volume 2 , The Road to Damascus: The Anglo-American Assault on Syria, and The Difference it Makes: 36 Reasons Why Hillary Clinton Should Never Be President . Turbeville has published over 850 articles on a wide variety of subjects including health, economics, government corruption, and civil liberties. Brandon Turbeville’s radio show Truth on The Tracks can be found every Monday night 9 pm EST at UCYTV . His website is BrandonTurbeville.com He is available for radio and TV interviews. Please contact activistpost (at) gmail.com . \\nThis article may be freely shared in part or in full with author attribution and source link .'"}, "time": 1742561989.5680878}