{"duration": 0.05906081199645996, "input_args": {"text": "'Chris Hedges and Tavis Smiley Discuss Popular Resistance and the Failure of Mainstream Media Posted on Nov 1, 2016 Chris Hedges speaking to Tavis Smiley via video. (Screen shot via PBS ) \\nLast Wednesday, author and Truthdig contributor Chris Hedges joined Tavis Smiley on Smiley’s PBS talk show for a conversation about the current election, the impending threat of neoliberalism and the need for popular progressive movements. \\nFirst, Hedges discussed the two main-party candidates, Hillary Clinton and Donald Trump. Hedges said that Trump is “a man with very little self-control, not much intellectual depth, no real policy experience,” and noted that Clinton is “a creature of the establishment.” \\nHe continued: \\nShe’s emblematic of what, again, across the political spectrum, people have risen up against. \\nAnd, therefore, she’s a very weak and a very dangerous political figure because as this assault continues on the poor, on working men and women, the shrinking middle class, she will become a lightning rod for this discontent.. \\nSmiley asked Hedges, “So your neoliberal criticism notwithstanding, if she wins with what she interprets as a mandate and you don’t think she’s qualified to deal with these issues, what say you about how we at least go about holding her accountable?” \\n“We have to build popular movements to push back,” Hedges declared, “because the system itself is not going to respond.” \\nThe conversation then turned to political representations of popular resistance. Smiley brought up the massive wave of support behind Bernie Sanders’ presidential campaign, and asked, “What happens to those Bernie supporters who can’t make the turn on November 8?” \\n“I am supporting the Green Party,” Hedges replied, “not because I think they can win, but because I look at Syriza, which is now the ruling party of Greece. Ten years ago, they were polling at four percent. I look at groups like Podemos in Spain. I think we have to build not only alternative movements, but alternative forms of political power to represent our interest.” \\nSmiley and Hedges began to wrap up by discussing WikiLeaks and mainstream-media accountability. “What I have not seen as yet is a robust conversation about how we process what we read from WikiLeaks,” Smiley said. “Is Secretary Clinton right essentially that we ought to dismiss this and focus on the issue of who is hacking our emails and what it means if a foreign government is doing that?” \\nHedges responded: \\nWell, I worked for many decades as a newspaper reporter, including 15 for The New York Times, and I was leaked all sorts of material by the U.S. government, by the French Intelligence Agency, even by the Israeli Mossad. And my job as a reporter was to determine whether the information that I had been leaked was true or untrue and then run it [or not]. \\nNow people who leaked me this stuff were not leaking it because they love democracy or an open society. They were leaking it because it was in their interest to leak it. And whoever leaked this to WikiLeaks or wherever they got it, I don’t know, but that’s not the question. \\nThe question is, is this true? And it is a look at the inner workings of power, but I think you’re right. I think that much of the media has diverted attention from the content of the emails to speculate—and it does appear to be speculation—that this is an attempt by Russia to interfere in our elections. \\nFinally, Smiley asked Hedges about the role of the media in the current election. Hedges argued that it was “deeply irresponsible” for mainstream media to rely on Trump’s personality to bring in viewers and higher ratings. \\n“Actual discussion of content, of issues that matter to Americans, is very, very rarely heard in the press….The press has failed us on many levels,” Hedges said. \\nYou can watch the entire interview here .'"}, "time": 1742562114.1149433}