{"duration": 0.07885050773620605, "input_args": {"text": "'Ashutosh attempts suicide at protest rally, rescued while proofreading suicide note Posted on Tweet (Image via shiningindianews.com) \\nDelhi police has foiled a suicide attempt by Aam Aadmi Party spokesperson Ashutosh during a protest rally organized by his party. He was apprehended when he and his team were proofreading his suicide note before attempting suicide. \\nHe was later sent to 14 days judicial custody where he is currently undergoing a refresher course in grammar and spelling. \\nThe incident happened yesterday when AAP supremo Arvind Kejriwal organized an impromptu protest rally at Jantar Mantar to expose Narendra Modi, but unfortunately no one from the media turned up for the event. Crestfallen, Mr. Kejriwal decided to go back on Twitter and continue his service for his constituency when an idea crossed his mind. He shared the idea with Ashutosh and urged him to commit suicide. \\n“But this is not what I was looking forward to when I joined AAP,” retorted Ashutosh. \\n“No, you are not going to die. You will just attempt a suicide. We will call media to cover the event. Just imagine, you will be making headlines, you will be trending on Twitter, everyone will be talking about you. It will be so cool!” \\n“Ok, you do it then if it’s so cool.” \\n“No, I need to oversee the whole event. See, there are two options for you, either do it or find another party.” \\n‘‘Which party will take me if I leave AAP?’ he pondered for a while and said, “Ok, let’s do it.” \\n“Cool, now write a suicide note and let’s get on with this.” \\n“Ok.” \\nAAP party workers gathered around Ashutosh as he typed the opening line on Microsoft Word that read, “I holed Modi resoncible for my deth…” \\nA crack team of 5 proof readers was formed immediately, who advised him about the correction the sentence demanded. \\nHe grinned and typed, “ sorry responcible …not resoncible .. ” \\n“No, you can just delete the words and…” \\nAnother 5 proof readers were hired urgently to strengthen the team as he continued to type the letter. \\nBy the time he completed the letter, the language settings on MS Word had automatically turned into Spanish. \\n“Done,” Ashutosh pronounced with a satisfactory smile as he beheld his creation for a few seconds before calling police to inform them about his plan. \\n“Sir wait, we haven’t started proofreading yet,” implored one of the newly hired proofreaders. \\n“Do you want me to die for real or what?” \\n“No but at least the attempt should look genuine and not a hoax.” \\n“Don’t worry, I’ve informed Darya Ganj Police Station. By the time they beat the traffic to reach here, we will not only complete the proofreading but will also complete the suicide…attempt.” \\n3 proofreaders immediately started to decode the message in the letter in a separate document, another 3 changed the language settings of MS Word, and the rest started deleting the word ‘why’ which he had added at the end of every sentence. But it was too much of an ask for 10 mortals and they couldn’t even rewrite half of the letter when police arrived at the scene. \\nKejriwal tried to cover up the whole mess and handed over the letter to the police inspector, saying, “See, what Modi has done to him! He was about to commit suicide.” \\nThe inspector held the suicide note in front of him and mumbled, “Oh, Ashutosh. We would need some help here.” \\nExperts, including the ones who decoded Nostradamus’s predictions, were flown in from various parts of the world to decipher the message in the letter, however, they haven’t quite succeeded in their endeavor as reports last came in.'"}, "time": 1742561792.3229883}