{"duration": 0.13029694557189941, "input_args": {"text": "'It really is a jungle out there, Blanche, that same cruel,    world described by Darwin. And while it’s noble of you to plead with your sister not to “hang back with the brutes”  —   to choose the aesthetes over the animals  —   you surely know it’s a waste of breath. The New Orleans neighborhood where Blanche DuBois comes calling so disastrously in Tennessee Williams’s “A Streetcar Named Desire” has never seemed quite as atavistic as it does in Benedict Andrews’s compellingly harsh revival, which opened on Sunday night at St. Ann’s Warehouse in Brooklyn. This production pits a fully adrenalized Gillian Anderson, as Blanche, against Ben Foster, as her adversarial    Stanley Kowalski, in a riveting study of the survival of the fittest. Even if you are unfamiliar with the plot, you shouldn’t have trouble predicting its outcome. Mr. Foster’s slyly commanding Stanley  —   a performance that makes the specter of Marlon Brando, who created the part, temporarily retreat into the dusk  —   is obviously the younger, stronger and more confident of the two. But Ms. Anderson’s Blanche has her own arsenal of weapons, and though they may be outdated, she puts up a vigorous defense. This fading feline beauty is clearly fated to lose, but she’s also going down fighting, tooth and manicured nail. This brave new “Streetcar,” which originated at the Young Vic in London, takes a lot of presumptuous risks, yet most of them pay off, at least for as long as you’re watching it. Mr. Andrews, whose wild and divisive production of Jean Genet’s “The Maids” was in New York two summers ago, has dared to reset Williams’s masterpiece in the 21st century. That means no picturesque French Quarter squalor. Magda Willi’s   revolving set  —   which gives us a drone’   of every angle of the two rooms shared by Blanche’s younger sister, Stella (a terrific Vanessa Kirby) and her husband, Stanley  —   has the generic starkness of an   starter apartment for newlyweds. Blanche’s tight, short, flashy wardrobe (Victoria Behr is the costume designer) wouldn’t look out of place in a television pilot for “Real Housewives of New Orleans. ” And   electronic music is blasted between scenes. Yet in bringing us into the present, Mr. Andrews is also leading us into a timelessly primeval world, observed with an anthropological clarity. The New Orleans glimpsed beyond the walls of the Kowalskis’ home is inhabited by men and women who scrap, prowl, bloody one another’s noses and mate like alley cats. There is little conjuring of the illusions that Blanche says she lives by, and she registers more as a   pragmatist in    mode than the usual windblown butterfly. Even when Jon Clark’s lighting plunges us into darkness, the show always seems to be happening beneath the glare of the bright, naked bulbs that are anathema to our   heroine. Such an interpretation largely strips “Streetcar” of its poetry. And there were certainly moments when I missed that poetry. But I was also willing to trade the delicate lyricism of Mr. Williams and Blanche for genuinely original insights into a play I’ve seen many times. In particular, you become conscious of a prescient feminist streak in “Streetcar,” a piercing awareness of a society that values its women according to youth and attractiveness. In this context, Blanche’s obsession with looking pretty acquires a sad emotional weight that tips into existential panic. “People don’t see you  —   men don’t  —   don’t even admit your existence unless they’re making love to you,” she says to Stella. “And you’ve got to have your existence admitted by someone. ” That’s a pretty realistic appraisal, coming as it does from a woman who has always relied on the kindness  —   and interest  —   of the male sex. And as Ms. Anderson says these lines, and others like them, a sense of Blanche as a desperately plotting strategist comes to the fore. Best known for her television appearances as the coolly intelligent detectives on “The Fall” and “The ” Ms. Anderson endows Blanche with a   skepticism that is starting to lose its edge and a calculatedly feminine, shrilly Southern persona that feels thoroughly of the moment. This is the first Blanche I’ve encountered who specifically evokes women of my generation, like those former popular girls you come across at high school reunions, teetering on stilettos between husbands and highballs. This Blanche is forever positioning herself as an object of masculine desire. (Watch her undulating   behind a semitransparent curtain while Stanley and his pals play poker.) Her sense of sex as a weapon, on the one hand, and a necessity, on the other, is beautifully conveyed in her defensive scenes with Mitch (the excellent Corey Johnson) her diffident suitor, and her aggressive encounter with the delivery boy (Otto Farrant) who summons the ghost of the young man to whom she was briefly and ruinously married. And though she may be forever trying to convince her sister to leave the barbaric Stanley, you also feel she’s competing with Stella for his attention. In vain. As embodied by Ms. Kirby, the pregnant Stella glows with the confidence conferred both by new life and her sexually charged relationship with her husband. The physical interdependence between this pair has seldom felt so thick, and when Mr. Foster cries out the immortal mating call, “  ! ,” with a mix of childlike anguish and   longing, you know why Ms. Kirby comes running. Mr. Foster, seen on Broadway in “Orphans” in 2013, provides an effortlessly natural Stanley, unencumbered by the usual preening  . He also manages to evoke a type of man we’ve seen a lot of in recent months  —   the   guy who says he’s voting for Donald Trump because he wants America to be strong and virile again. Contemporary parallels recede, though, as the struggle between Stanley and Blanche acquires momentum. Mr. Andrews has done a masterly job of arranging the play’s central antagonists, so as the set revolves, we’re always aware of their positions in relation to one another, as they take stock of their respective strengths and weaknesses. It’s not easy to keep your balance on a moving stage, or in a changing world. Ms. Anderson’s Blanche becomes increasingly unsteady on the perilously high heels she wears. Mostly, this unusually dynamic “Streetcar” plays more on our nervous system than with our hearts. But when Blanche finally goes down for the count, it’s impossible not to feel a choking rush of compassion for a valiant, misguided fighter who never stood a chance.'"}, "time": 1742563467.2062073}