{"duration": 0.13423371315002441, "input_args": {"text": "'There’s a wheelchair onstage at the Belasco Theater, and it’s drawing an abundance of attention. There’s also a wheelchair onstage at a small theater not far away, and it’s drawing practically no attention at all. The gulf between the two says quite a lot. At the Belasco, the Broadway house on West 44th Street, the wheelchair is one of the conspicuous elaborations the director Sam Gold has brought to his production of “The Glass Menagerie,” the beloved Tennessee Williams drama. The chair isn’t just a prop it’s a necessity for the actress playing Laura, Madison Ferris, who has muscular dystrophy. That bit of casting is, of course, a significant change from the shy girl with a limp that Williams called for in his play. And Mr. Gold’s staging leaves no doubt that Ms. Ferris is not some   actress pretending to have a disability. He has her enter by painstakingly climbing stairs, one of several times that he takes her out of the wheelchair and confronts the audience with the difficulties of having severely limited mobility. Some leading critics have objected to the transformation of Williams’s subtle play about a family enveloped in denial into something more strident. The kindest objections say that Mr. Gold’s interpretation simply doesn’t mesh well with the text harsher ones on theater chat boards have called his use of Ms. Ferris exploitative. Perhaps these detractors are focusing on moments like the one in which Amanda, Laura’s mother, tells her: “You’re not crippled. You just have a little defect  —   hardly noticeable, even!” How can such a line make sense when there’s a wheelchair onstage? For one thing, this is a   “memory play,” told through the recollections of Laura’s brother, Tom (played by Joe Mantello). And memory is an interpretation of the past, not a literal playback of it. But, more than that, to live with a child with a disability is to be both isolated  —   as this family is  —   and susceptible to what seems to others like an unreality. My own daughter, who has a serious disability called Rett syndrome, is just three years younger than the    Laura. Is it easy for me to imagine a parent who sees a vastly different child than the outside world sees? You bet. As for the charge of exploitation, I read that as, “It was unpleasant to see Ms. Ferris pull herself along the floor by her arms I prefer that people with disabilities remain invisible, as they so often are. ” Broadway audiences are accustomed to seeing perfect bodies doing entertaining dance steps. Guess what, Broadway? One in five Americans has a disability, according to the census bureau. Nine blocks north and four blocks west of the Belasco, at the A. R. T.  York Theaters, Theater Breaking Through Barriers has a program of shorts running through Sunday. The company, which has been around since 1979, stages productions using actors with disabilities as well as   actors. The five plays on its current program include works by Neil LaBute and Bekah Brunstetter, a producer of the TV series “This Is Us. ” Nicholas Viselli, the company’s artistic director, has put quirky interstitials between the plays  —   a song, some monologues. Ryan Haddad, who is gay and has cerebral palsy, steals the show with a funny, deeply personal piece called “Hi, Are You Single?” This is the type of production that’s most likely to showcase actors with disabilities: intimate theater, small audience, $25 ticket. The program (which is called “The Other Plays: Short Plays About Diversity and Otherness”) is   but it feels 1, 000 miles from the mainstream represented by the Belasco, where the best seat for “The Glass Menagerie” can set you back more than $200. Mr. Gold’s brashest stroke in a production full of them may be the bridging of that divide  —   taking a theatrical universe that has existed for some time on the outskirts and putting it on a Broadway marquee featuring the   names of Mr. Mantello and Sally Field, who plays Amanda. He’s not the first to do so  —   think back, for instance, to the breathtaking Deaf West reimagining of “Big River” in 2003, featuring a lot of deaf and    actors and sign language, or to the same company’s 2015 “Spring Awakening” (which also had an actor who uses a wheelchair). But it remains a rare occurrence, and as a result Broadway remains unrepresentative of the full range of humanity. So do television, film and most other forms, though inroads are being made there, too. Does the casting of an actor with cerebral palsy to play a character with cerebral palsy on the ABC sitcom “Speechless” seem manipulative? How about the coming introduction of a character with autism on “Sesame Street?” Sometimes, what seems a cheesy gimmick or instance of exploitation is really just the front edge of needed change. Some theatergoers were probably outraged the first time a black Juliet was cast against a white Romeo. Did that change how some of Shakespeare’s lines registered and imbue the play with new meanings? Sure. Is   casting now widely accepted and the theatergoing experience richer for it? Yes. Mr. Gold’s production is hardly perfect. If you figure out that thing with keeping the house lights up for a third of the show, let me know. But at least with the Laura character, he has done what he intended. “I’m not very interested in pretend,” he has said. “I’m interested in putting people onstage. I want people. And I want a world that reflects the real world. ” It’s worth contemplating what that means from the audience’s perspective. On those chat boards, some writers have complained that Ms. Ferris isn’t very good. Here’s the thing: We have been conditioned to define good acting in terms of facial expressions, comic timing, physical bits. An actor with a disability, especially one involving muscle control or cognitive impairment, isn’t necessarily going to be able to give the kind of performance we’re used to. Will Ms. Ferris impress someone looking for that kind of performance? Probably not. But she gives the most realistic portrayal of a person with muscular dystrophy that I’ve ever seen. In any case, the overall package worked for me and showed me a different play, just as Deaf West did with “Big River,” one of my favorite musicals. The Amanda of this “Menagerie” is more in denial than other Amandas the gentleman caller, played by Finn Wittrock, who sees past Laura’s disability, is all the nobler. And  —   especially given the time frame of the play, an era before curb cuts and the Americans With Disabilities Act, Tom’s decision to leave his family is not so much a personal liberation as a cruel abandonment. I don’t really care whether this is what Williams intended. What I admire is the attempt, and the fact that this production has people talking about something other than whether Ms. Field’s Amanda is better or worse than Cherry Jones’s in 2013 or Jessica Lange’s in 2005. Debates like that are the product of a theater of complacency. Debates like the one Mr. Gold has unleashed are what keep theater vigorous and challenging.'"}, "time": 1742564223.472249}