{"duration": 0.08424568176269531, "input_args": {"text": "'By Gordon Duff, Senior Editor on October 29, 2016 FBI Memo: Comey knew nothing was in emails and admits to releasing memo to influence election without cause. Comey: “we do not know the significance of this newly discovered collection of emails” Comey had stored these totally innocent emails as part of the long expected October Surprise. What is Comey being promised? Golf memberships, a free Trump condo? More? Comey says this not an investigation but “supplementing the record.” All this while Trump awaits a December trial for raping a 13 year old. \\nFBI Director James Comey told his bureau that he broke with custom in alerting lawmakers that the investigation into Hillary Clinton’s private email server was being reopened because of its political sensitivity. \\nIn an internal memo obtained by Fox News, the beleaguered director noted that the FBI typically would not communicate with the public when reopening a case, according to a Department of Justice source. But Comey said he had to in this case because Clinton is seeking the White House in an election on Nov. 8. \\nFBI letter from Director James Comey (Fox News) \\n“Of course we don’t ordinarily tell Congress about ongoing investigations, but here I feel an obligation to do so given that I testified repeatedly in recent months that our investigation was completed,” Comey wrote. “I also think it would be misleading to the American people were we not to supplement the record. \\n“At the same time, however, given that we do not know the significance of this newly discovered collection of emails, I don’t want to create a misleading impression,” Comey’s letter continued. “In trying to strike that balance, in a brief letter, and in the middle of an election season, there is significant risk of being misunderstood, but I wanted you to hear directy from me about it.” \\nJustice officials (Including the Attorney General of the United States) warned FBI that Comey’s decision to update Congress was not consistent with department policy \\nSenior Justice Department officials warned the FBI that Director James B. Comey’s decision to notify Congress about renewing the investigation into Hillary Clinton’s private email server was not consistent with long-standing practices of the department, according to officials familiar with the discussions. \\nComey told Justice officials that he intended to inform lawmakers of newly discovered emails. These officials told him the department’s position “that we don’t comment on an ongoing investigation. And we don’t take steps that will be viewed as influencing an election,” said one Justice official who spoke on condition of anonymity to describe the high-level conversations. \\n“Director Comey understood our position. He heard it from Justice leadership,” said the official. “It was conveyed to the FBI, and Comey made an independent decision to alert the Hill. He is operating independently of the Justice Department. And he knows it.” \\nComey decided to inform Congress that he would look again into Hillary Clinton’s handling of emails during her time as secretary of state for two main reasons: a sense of obligation to lawmakers and a concern that word of the new email discovery would leak to the media and raise questions of a coverup. \\nThe rationale, described by officials close to Comey’s decision-making on the condition of anonymity, prompted the FBI director to release his brief letter to Congress on Friday and upset a presidential race less than two weeks before Election Day. It placed Comey again at the center of a highly partisan argument over whether the nation’s top law enforcement agency was unfairly influencing the campaign. \\nIn a memo explaining his decision to FBI employees soon after he sent his letter to Congress, Comey said he felt “an obligation to do so given that I testified repeatedly in recent months that our investigation was completed.” \\n[Read the letter Comey sent to FBI employees explaining his decision] \\n“Of course, we don’t ordinarily tell Congress about ongoing investigations, but here I feel I also think it would be misleading to the American people were we not to supplement the record, ” Comey wrote to his employees. \\nThe last time Comey found himself in the campaign spotlight was in July, when he announced that he had finished a months-long investigation into whether Clinton mishandled classified information through the use of a private email server during her time as secretary of state. After he did so, the denunciation was loudest from Republican nominee Donald Trump and his supporters, who accused the FBI director of bias in favor of Clinton’s candidacy. There was also grumbling within FBI ranks, with a largely conservative investigative corps complaining privately that Comey should have tried harder to make a case. \\nThis time the loudest criticism has come from Clinton and her supporters, who said Friday that Comey had provided too little information about the nature of the new line of investigation and allowed Republicans to seize political ground as a result. The inquiry focuses on Clinton emails found on a computer used by former U.S. congressman Anthony Weiner (D-N.Y.), now under investigation for sending sexually explicit messages to a minor, and top Clinton aide Huma Abedin, who is Weiner’s wife. The couple have since separated. \\n“It is extraordinary that we would see something like this just 11 days out from a presidential election,” John Podesta, the chairman of Clinton’s presidential campaign, said in a statement. “The Director owes it to the American people to immediately provide the full details of what he is now examining. We are confident this will not produce any conclusions different from the one the FBI reached in July.” \\nOfficials familiar with Comey’s thinking said the director on Thursday faced a quandary over how to proceed once the emails, which number more than 1,000 and may duplicate some of those already reviewed, were brought to his attention. \\nComey had just been briefed by a team of investigators who were seeking access to the emails. The director knew he had to move quickly because the information could leak out. \\nThe next day, Comey informed Congress that he would take additional “investigative steps” to evaluate the emails after deciding the emails were pertinent to the Clinton email investigation and that the FBI should take steps to obtain and review them. \\nIn July, Comey had testified under oath before the House Oversight and Government Reform Committee that the FBI was finished investigating the Clinton email matter and that there would be no criminal charges. Comey was asked at the hearing whether he would review any new information the FBI came across. \\n“My first question is this, would you reopen the Clinton investigation if you discovered new information that was both relevant and substantial?” Rep. Lamar Smith (R-Tex.) asked Comey during the hearing. \\n“It’s hard for me to answer in the abstract,” Comey replied at the hearing. “We would certainly look at any new and substantial information.” \\nIn the Friday memo to his employees, Comey acknowledged that the FBI does not yet know the import of the newly discovered emails. “Given that we don’t know the significance of this newly discovered collection of emails, I don’t want to create a misleading impression,” Comey wrote. \\nAn official familiar with Comey’s thinking said that “he felt he had no choice.” \\n“What would it look like if the FBI inadvertently came across additional emails that appear to be relevant to the Clinton investigation and not at least inform the Oversight Committee that this occurred?” the official said. “What would be the criticism then? That the FBI hid it? That the FBI purposely kept this information to themselves?” \\nThe official said the decision came down to which choice “was not as bad as the others.” \\nComey’s action has been blasted by some former Justice Department officials, Clinton campaign officials and Democratic members of Congress. \\n“Without knowing how many emails are involved, who wrote them, when they were written or their subject matter, it’s impossible to make any informed judgment on this development,” said Sen. Dianne Feinstein (D-Calif.), who called the release “appalling.” \\n“However, one thing is clear: Director Comey’s announcement played right into the political campaign of Donald Trump, who is already using the letter for political purposes. And all of this just 11 days before the election,” Feinstein said. \\nMatthew Miller, a former Justice Department spokesman in the Obama administration, said the FBI rarely releases information about ongoing criminal investigations and does not release information about federal investigations this close to political elections. \\n“Comey’s behavior in this case from the beginning has been designed to protect his reputation for independence no matter the consequences to the public, to people under investigation or to the FBI’s own integrity,” Miller said. \\nMiller and other former officials pointed to a 2012 Justice Department memo saying that all employees have the responsibility to enforce the law in a “neutral and impartial manner,” which is “particularly important in an election year.” \\nMiller said he had been involved in cases related to elected officials in which the FBI waited until several days after an election to send subpoenas. “They know that if they even send a subpoena, let alone announce an investigation, that might leak and it might become public and it would unfairly influence the election when voters have no way to interpret the information,” Miller said. \\nNick Ackerman, a former federal prosecutor in New York and an assistant special Watergate prosecutor, said Comey “had no business writing to Congress about supposed new emails that neither he nor anyone in the FBI has ever reviewed.” \\nHe added: “It is not the function of the FBI director to be making public pronouncements about an investigation, never mind about an investigation based on evidence that he acknowledges may not be significant.” \\nIn Comey’s note to employees, he seemed to anticipate that his decision would be controversial. \\n“In trying to strike that balance, in a brief letter and in the middle of an election season, there is significant risk of being misunderstood,” Comey wrote. Related Posts:'"}, "time": 1742628577.3431845}