{"duration": 0.09808802604675293, "input_args": {"text": "'On Thursday, during an Oval Office interview with Reuters, President Trump said: “There is a chance that we could end up having a major, major conflict with North Korea. Absolutely. ”[“We’d love to solve things diplomatically but it’s very difficult,” the president added.  China will clearly play a major role in that   diplomatic resolution, as Trump suggested he would not anger Beijing with another phone call to Taiwan’s president. He explicitly stated he wanted to avoid “causing difficulty” for Chinese President Xi Jinping while he is “doing everything in his power to help us with a big situation. ” He praised Xi as a “good man” who is “trying very hard” to avoid “turmoil and death” on the Korean peninsula. “He is a very good man and I got to know him very well,” said Trump. “With that being said, he loves China and he loves the people of China. I know he would like to be able to do something, perhaps it’s possible that he can’t. ” Trump was also surprisingly sympathetic to North Korean dictator Kim  . “He’s 27 years old. His father dies, took over a regime. So say what you want but that is not easy, especially at that age,” he said of Kim. “I’m not giving him credit or not giving him credit, I’m just saying that’s a very hard thing to do. As to whether or not he’s rational, I have no opinion on it. I hope he’s rational. ” On the other hand, Trump played hardball with South Korea, saying that he intends to renegotiate its   deal with the U. S. “very soon,” and seek compensation for the $1 billion cost of deploying the Terminal High Altitude Area Defense (THAAD)   shield to Seoul. “It is unacceptable, it is a horrible deal made by Hillary. It’s a horrible deal, and we are going to renegotiate that deal or terminate it,” he said of the Korean trade deal, formally known as KORUS, referring to his defeated 2016 presidential opponent and onetime Secretary of State Hillary Clinton. He said it would be much easier to terminate KORUS than the North American Free Trade Agreement, which he has also strongly criticized. “With the Korean deal, we terminate and it’s over. I will do that unless we make a fair deal. We’re getting destroyed in Korea,” he said. According to the Washington Post, the South Korean Trade Ministry stated on Friday that it has no plans to renegotiate the agreement, whose anniversary occurs next week. The United States is currently running a $27. 7 billion trade deficit in goods with South Korea. When Reuters asked when he planned to announce this surprising review of South Korea trade policy, Trump replied, “I’m announcing it now. ” This did not go over well in South Korea, where stocks and currency values immediately tumbled. Among other market indicators, shares in Hyundai Motor dropped by as much as 2. 4 percent, the Korea Composite Stock Price Index slid 0. 1 percent, and the South Korean won dropped 0. 2 percent against the dollar. These would seem more like signs of unease than panic. Analysts told CNBC Trump’s remarks came as a surprise, but most of the South Korean market and its foreign investors await firmer announcements of the Trump administration’s intentions before concluding a trade war is brewing. A foreign policy adviser to the favored candidate in the upcoming emergency South Korea presidential election, Moon   said asking South Korea to pay for THAAD was an “impossible option. ” Moon is already known as a skeptic of THAAD deployment, with his campaign describing the decision of his impeached predecessor Park   to install the system “strongly regrettable” and “very inappropriate” because she did not properly consult with parliament. Moon has called for an immediate halt to the deployment of the THAAD system, which has increased tensions between South Korea and China. Chinese boycotts over THAAD have cost South Korea enough money to raise concerns about the future of South Korea’s economic recovery. China objects to the deployment because it believes THAAD’s powerful radars will be employed to spy on Chinese activity. The New York Times quotes Moon spokespersons describing Trump’s demand for payment as validation of their criticism that Park’s administration was not honest with the Korean people about the costs and drawbacks of the missile shield.'"}, "time": 1742564504.8785431}