{"duration": 0.07258796691894531, "input_args": {"text": "\"Thanks To Recreational Marijuana Being Passed, Californians' Former Charges Are Being Downgraded Nov 16, 2016 0 0 \\nOn the night of the presidential election, many things in our country changed. One of the big winners was marijuana as four new states passed legislation that now allows for recreational marijuana. Those included are Massachusetts, Maine, Nevada and California . With the new law, a person can grow up to 6 plants. \\nSince the laws went into effect the very next day, many people who have been charged with marijuana-related crimes are now finding themselves in unfamiliar, but fortunate territory. \\nAccording to South California Public Radio , attorney Bruce Margolin said: \\n“People with possession for sale, possession with the intent to sell, transportation or giving away more than an ounce, or sale of cannabis, would normally face prison time from three to four years. However, now it’s been reduced to six months in jail, maximum, and a $500 fine, or both.” \\nThe Drug Policy Alliance states that over 11,000 people are arrested each year with cannabis-related charges. Part of the Alliances push for the law changing to recreational use is that it would positively impact the lives of these people who were charged with these “crimes.” Such non-violent crimes should not ruin a person’s life. \\nThese new laws help to bring this specific issue into focus and will likely be a hot topic around this issue for some time to come. \\nWhat should be acceptable for marijuana related charges? In what ways should these charges affect a person’s life and their job? If it was a non-violent act, should the charges be less? Should some charges that were filed before the new legislation be entirely dropped? Which ones specifically? All of these questions are what lawyers, courts and defendants are now facing. \\nHowever, the new laws are still confusing to even lawyers and the courts. Margolin also said: \\n“They don’t know what’s going on. It’s like deer with headlights on them.” \\nWhile there have yet to be any official reports such as this one, it can be assumed that people and the courts in Massachusetts, Nevada and Maine are experiencing the same challenges in adapting to the new norm. \\nOther winners in the marijuana legislation on election night were Florida, Arkansas and North Dakota, as they approved medical marijuana laws. The 2016 Election was a game-changer for cannabis. \\nWhat do you think about the new laws being passed in these states? How should these laws affect a person’s life moving forward? Should there be any special consideration for those with children? In what ways do you see the new laws affecting society in general in those states? How soon will the rest of the nation follow suit now that 8 states, including the biggest one in the U.S. has now passed laws allowing recreational marijuana? At what point does industrial hemp come into the picture? \\nLance Schuttler graduated from the University of Iowa with a degree in Health Science-Health Coaching and offers health coaching services through his website Orgonlight Health. You can follow the Orgonlight Health Facebook page or visit the website for more information on how to receive health coaching for yourself, your friend or family member as well as view other inspiring articles.\""}, "time": 1742562449.577904}