{"duration": 0.04013323783874512, "input_args": {"text": "'By Bill Palmer | October 28, 2016 | 327 230026 SHARES \\nFor all the noise emanating from FBI Director James Comey’s shocking decision to send a letter to Congress falsely implying that he’s reopening his investigation into Hillary Clinton’s emails just eleven days before the election, one might think that Comey at least knew how to cover himself. But as it turns out, not only are the emails in question not from Clinton’s private email server, it’s now been confirmed that they were neither sent by her or received by her. In other words, these emails have literally no connection to Hillary. \\nThe Los Angeles Times confirmed on Friday night that “The emails were not to or from Clinton, and contained information that appeared to be more of what agents had already uncovered.” In other words, James Comey just got caught lying in his attempt at rigging a Presidential election. And yes, that’s a severe violation of a specific federal law. \\nOnce the smoke clears, the FBI Director will have to explain why he not only misused his office to tamper in the election in violation the Hatch Amendment of 1993, but why he flat out lied while doing so. This new confirmation from the LA Times makes unequivocally clear that these new emails in a totally unrelated investigation of Anthony Weiner were not Hillary Clinton emails in any way shape or form. \\nEven prior to this shocking new confirmation of criminal intent on Comey’s part, CNN was already demanding that he resign, and MSNBC was already condemning him in the strongest way possible, even as the ranking member of the House Oversight Committee gave him a deadline to rectify his scandalous behavior. But now that’s known for certain that this new FBI investigation does not involve any emails that were sent or received by Hillary Clinton, the probability has increased that Comey will end up facing criminal punishment for what can now only be defined as an act of domestic terrorism on his part. If you enjoy Daily News Bin, consider making a contribution: Contributed by Daily News Bin staff 230026 '"}, "time": 1742562285.8551385}