{"duration": 0.07462716102600098, "input_args": {"text": "'Don Ciccone may never have achieved the fame of Frankie Valli, but he was a vital member of the Four Seasons, and sang on some of their biggest hits. That is his catchy voice on tastier sections of “Who Loves You” and “December, 1963 (Oh, What a Night),” both revived in the smash Broadway musical “Jersey Boys. ” Mr. Ciccone also led The Critters in the 1960s, with hits like “Younger Girl” and “Mr. Dieingly Sad,” and was a musical director and bassist for Tommy James and the Shondells in the ’90s. An obscure footnote to his extensive recording career was an unreleased batch of songs he recorded in the early 1970s with his longtime friend Brian Gari, 64, a   who lives on the Upper West Side of Manhattan. Mr. Gari wrote the songs and backed Mr. Ciccone on piano on recordings they made as demos to interest record labels. Of 20 selections, several were produced and released as complete songs, but even on the remaining sparse tracks, Mr. Ciccone’s vocals shone. “Don had that    kind voice and we always liked the tapes,” said Mr. Gari, who hung on to those old    demo tapes for the next 45 years. He and Mr. Ciccone would occasionally prod each other to dust them off and release them as a “Ciccone Sings Gari” album. In early October, Mr. Ciccone contacted Mr. Gari and said he planned to finally do just that, but a week later Mr. Ciccone died of a heart attack at age 70. “The week before he died, Don told me he wanted to put out the demos,” Mr. Gari recalled. “He said, ‘My next project is ‘Ciccone sings Gari. ’” Mr. Gari said he decided to realize Mr. Ciccone’s “last wish,” and, on a recent weekday, he was in a music studio near Union Square working with a sound engineer, Peter Millrose, to give Mr. Ciccone’s remarkable vocals on the old tapes a proper setting. One number called, “I Just Had to Say My Last Goodbye” had the jaunty, melodic feel of Todd Rundgren, or the band Chicago in the 1970s. Working from Mr. Gari’s stylistic cues, Mr. Millrose layered piano, bass and drums, and then toyed with horns, strings and other effects to punctuate Mr. Ciccone’s phrasings. As Mr. Gari suggested various riffs or motifs, Mr. Millrose played them on a keyboard and added them to the digital recording until the spare track had become a slick, sturdy, fully orchestrated song. Mr. Millrose worked from sheet music of lyrics and chords written by a teenage Mr. Gari with help from his mother, who unlike Mr. Gari, had the musical training to write the melodies on music paper. Some original elements would not be preserved, like the simulated rainstorm augmenting a lover’s farewell in “She Left on Good Terms. ” The two recorded the song in Mr. Gari’s apartment and used the bathroom shower for rainfall sound effects, along with Mr. Ciccone making sounds of thunder. Mr. Gari called the project bittersweet, bringing him both the joy of hearing Mr. Ciccone’s youthful voice again, but also a twinge of sadness that he was not around to participate and enjoy the results. “It had been my dream to do this album, but I never thought it would happen after he died,” said Mr. Gari, who kept the tapes among a large trove of materials he has amassed in the sprawling,   apartment on West End Avenue where he has lived for more than 50 years while writing almost 1, 000 songs, several books and the music and lyrics for “Late Nite Comic,” which had a brief Broadway run in 1987. Mr. Gari has been married twice and held both his weddings in the apartment, which is full of memorabilia, including a vast archive of Upper West Side photos and film clips he has shot since he was in elementary school. One room is packed with items from Mr. Gari’s maternal grandfather, Eddie Cantor, the movie and radio star. Shortly before his death, Mr. Cantor wrote a letter to the    Brian, praising his creativity and anointing him as “the one to carry on the tradition of show business in the family. ” Mr. Gari immediately began writing songs and riding the bus around Manhattan, selling his songs to music publishers. He enjoyed watching Mr. Ciccone perform with The Critters on “ ” an afternoon dance show hosted by John Zacherle, known as “The Cool Ghoul. ” Mr. Gari wrote an adoring fan letter to Mr. Ciccone in 1966. Mr. Ciccone wrote back and their ensuing correspondence led to a friendship. By 1971, Mr. Gari was a struggling songwriter and Mr. Ciccone was looking for his next recording contract. Mr. Gari would play him the catchy teenage love songs he had written with melodies that he described as in the “sunshine pop” vein. Of the 20 songs they recorded, several were made into fully produced songs, including “Bicycle Ride,” and “Silent Celebration,” which were issued by the Metromedia label on a 45 r. p. m. record. They recorded through 1973, when Mr. Ciccone joined the Four Seasons for a tenure that lasted through 1981. One of his Four Seasons bandmates from the era, Lee Shapiro, will produce one of the songs, Mr. Gari said. Mr. Gari said he hoped to release a CD of the 20 songs, several of which will include guitar work by his friend Dean Bailin, who played the memorable guitar fills on the 1979 hit “Escape (The Piña Colada Song). ” Mr. Gari said he would be happy if the “Ciccone Sings Gari” CD sold just enough copies to cover his recording costs. “I’m doing it because it’s the right thing to do. I’m doing this in his honor,” he said. “It fulfills my dream and his last wishes. I’m taking his death and making something positive out of it. ”'"}, "time": 1742564261.471111}