{"duration": 0.015727519989013672, "input_args": {"text": "'Zero Hedge What The Hell Just Happened In Russia: Powerstation Explosion In Naval Base Region – Helicopters Landing On Moscow Streets – Dead Man Found At Russian Consulate in New York Mac Slavo SHTFplan.com Read by 1 people \\nSomething serious appears to be happening in Russia, as well as at the Russian Consulate in New York. \\nSpeculation abounds as multiple events taking place in the last few hours indicate that either a very coincidental set of events just happened, or an attack has been initiated against Putin’s government. \\nHere’s what we know right now. \\nOn the heels of a previous announced pre-positioning of cyber warfare assets last week and some 300,000 NATO troops preparing for battle in Europe, we learn this morning from RT that a massive blast at an electrical substation in Murmanks, Russia has left part of the region without power. \\nWhat makes this outage particularly interesting is that Murmanks is the main administrative base for the entire Northern Russian Fleet . \\nThe northern Russian port city of Murmansk, with a population of 300,000, has been partly left without electricity following an emergency at an energy facility. Eyewitnesses captured a bright flash, after which the lights went out. … \\nThere have been eyewitnesses’ reports of a “ huge blast ” at one of the city’s electrical substations, according to SeverPost news agency. \\n… \\nThere is apparently no electricity in government headquarters in the city center , FlashNord reported citing its correspondent in the area. Lights have been off in both central areas and in the outskirts, according to SeverPost. \\nAn incident happened at one of the facilities of the Kolenergo regional energy company, its press service told RT, without specifying what exactly happened. \\nThe causes of the “ incident ” are now being investigated by a special commission, the company said, adding that specialists are now working on damage control and recovery.'"}, "time": 1742628590.2151961}