{"duration": 0.03249526023864746, "input_args": {"text": "'Ancient manuscript tells of ancient giant race visiting Earth.\\n\\nThe Qumran caves in the West Bank have been considered a veritable treasure trove for historians, particularly those specialising in ancient literature and mythology. Sixty years ago, archaeologists unearthed an ancient book in these caves which is referred to as ‘The Book of Giants’. This text gives the details about an ancient race of otherworldly creatures who existed and eventually died out on Earth.\\n\\n\\nAt this current time, there is very little that historians can deduce about the authorship of ‘The Book of Giants’. However, it has been noted that there are remarkable crossovers between this mysterious text and other known ancient manuscripts such as the Mesopotamian epic of Gilgamesh and the apocryphal Book of Enoch. [Mahway] mounted up in the air like strong winds, and flew with his hands like eagles […he left behind] the inhabited world and passed over Desolation, the great desert […]and Enoch saw him and hailed him, and Mahway said to him […] hither and thither a second time to Mahway […]The Giants await your words and all the monsters of the earth. If […]has been carried […] from the days of […]their […] and they would be added […] we would know from you their meaning […] two hundred trees that from heaven came down… The Book of the Giants describes the creatures as ‘two hundred trees from heaven’ which came down and populated the planet Earth. They are described as a corrupt and debased species, prone to hideous acts of violence and unnatural acts with animals and human beings. After a period of years, one of the giants Mahway, started to experience prophetic dreams. These dreams saw a tablet bearing the names of everyone on Earth being submerged beneath the water. When the tablet rose again, all but three of the names had been washed away by the waves. This particular passage has been interpreted as referring to the survival of Noah and his family after the great flood.\\n\\n\\nIt was when Mahway shared these visions with his fellow giants that they realised the futility of attempting to resist the forces of heaven. They decided to seek out Enoch and ask him to plead to God on their behalf. Enoch is an ancient Jewish mythological figure believed to be the great-grandfather of Noah. He has a reference in the Book of Genesis where he is described as having a special, personal relationship with God. He lived for an astonishing three hundred and sixty-five years before simply disappearing with God one day. Enoch interceded on behalf of the Giants and delivered a damning judgement to them from God. However, he promised them that there was some hope for their redemption.\\n\\nIt is assumed that the Giants were washed away in the great flood that devastated the world several generations after that. What the race did in the interim is still a matter of great mystery. Another mystery is what this giant race could have been. The fact that they are described as coming down from heaven strongly suggests that there were of an extra-terrestrial origin, which has led some to speculate that the ‘giants’ may have been the heavily mythologised race of ancient aliens called the Nephilim.\\n\\nWATCH THE VIDEO: Disclose TV SOURCE '"}, "time": 1742628445.6407874}