{"duration": 0.15911149978637695, "input_args": {"text": "'“What are 10 words to describe the way you experience your sadness?” “What makes you feel tenderness?” “Describe a lonely day in one sentence. ” This is how Leslie Feist, the Canadian singer and songwriter best known by her last name, returns to public life: armed with 16 emotional prompts that she calls “The Pleasure Questionnaire”  —   an icebreaker of sorts for the strangers she will meet while promoting her new album, “Pleasure,” out April 28 from Interscope. She realizes it’s a big ask. “It’d be hard to know if even within a lifetime of friendship some of these topics on the questionnaire would be tackled,” Feist wrote in an email, promising discretion. “They’re just the things I’d most like to know. ” It’s true that the survey is an accurate indicator of where Feist’s head is lately  —   “Pleasure,” her first LP in six years, is concerned with similarly lofty themes and broad questions, with the music serving as her version of an answer. “Here I am living in my life,” she said, “and songs occur to help me make sense of it. ” Epiphanies are not the point. “I know less now than I ever did about how life is supposed to go. It’s relaxing. ” This is the   state of a singer, now 41, who has rejected a kind of fame that did not suit her in favor of a more personal version of her own making. A decade removed from “1234,” the accidental midcareer hit that altered the course of her life (but not her music) Feist has turned further inward with “Pleasure,” which was inspired by a short    solo tour in 2014. The album is largely just her singular voice and guitar, but it pummels with intimacy and tape hiss as raw whispers turn to wails and tinny riffs clang until they break. Across two long walks in February and March  —   one in Central Park as spring tried to prematurely bloom, and another in the sunny mountains above Los Angeles  —   Feist was voluble and loose, prone to discursive reveries even as she described the personal turmoil and uncertainty that led to this knotty, taxing album. “There’s been a lot of sad times lately,” she said, speaking somewhat abstractly to avoid revealing their roots, while parsing the decision to put “a word that so doesn’t seem to fit” at the forefront of her new work, which hardly oozes joy. (“Pleasure” is also the album’s first song and single.) “It’s such an inaccurate,   word that, in fact, when you look a little closer, it carries in it yearning and loss and ” she said. “Pleasure is implicit in pain, which is implicit in pleasure. ” The producer Mocky, who has worked with Feist on her last three albums, said the goal of the sessions  —   “Pleasure” was recorded mostly live, three times in three different locations  —   was to “be more vulnerable than you’ve been before. ” Amid the success of “The Reminder,” her 2007 album that featured “1234,” Feist took on a rather inaccurate reputation for   tweeness through her most widespread songs (see also: “Mushaboom,” “I Feel It All”). But with “Metals” in 2011, she shook off any lingering commercial expectations, recasting her ambitions with more complex songwriting draped in grand, intricate musical layers. This time around, following that palate cleanser, she tore it all down. “If you came to ‘Metals’ looking for ‘1234,’ you didn’t find it,” Mocky said. “Just when you thought you had that maneuver clocked, now with this, it’s like, ‘Oh, you thought that was a hard left?’ No, no, that wasn’t a hard left at all. This is a hard left. ” New songs like “Lost Dreams” and “Century” are borderline crude with shame and despair, while the minimalist instrumentation leaves Feist’s tender melodies and often gutting lyrics unadorned. “I felt some certainty that you must have   how could I live if you’re still alive?” she sings on “I Wish I Didn’t Miss You. ” “It can feel heavier than metal when you’re by yourself, because you can make so little seem like so much,” Feist said of the stark arrangements, which she called “the natural reflection of my state of mind. ” The album may have started from a place of loneliness, but it landed at “potent, positive solitude,” she said, stressing the difference. In person, Feist’s sprightly demeanor does not betray her inner burdens leave her alone for a moment, and you might return to find her practicing “Silent Night” on a harmonica, giggling knowingly at the absurdity of the scene. There are lighter moments on the album, too  —   attempts to mitigate her own “propensity to swing like a pendulum to extremes,” said Feist, who has sparred with “classic, constant   depression and anxiety,” an affliction she called “so boring. ” The soft and dreamy “Get Not High, Get Not Low” is a reminder to herself, while on the relatively optimistic album closer “Young Up,” she reassures a past self, “Young buck, the end’s not coming. ” These songs came to her at a time when making another album was not a foregone conclusion. “I was completely open to the idea that I might focus on something else for a while,” Feist said. She watched a lot of “Nashville,” traveled and read extensively, and even took up woodworking  —   making benches, bed frames, a screen porch  —   inspired in part by John Steinbeck’s “Journal of a Novel,” the letters he kept while writing “East of Eden. ” Long a nomad, having leapfrogged for years among Toronto, Paris, Berlin and now Los Angeles, Feist also collects, in a classic bohemian sense, what she calls “aspirational people,” though never for wealth or power. There’s the older playwright with access to   real estate, the musical neuroscientist with theories on pleasure, the   busker aspiring to art therapy and the Beckett actress, each with jewels of arcane knowledge to be gleaned. “   Leslie felt   to be in a band with her friends  —   she decided what I’m doing with the rest of my life?” Feist pondered. “I just took a minute to see if any other lightning would strike me  —   a different moment, a different era. ” Of songwriting, she explained, “I wanted to make sure it was a legitimate drive, coming from a really honest and humble place, not because it’s what I do. ” She added: “Of course I worked really hard, but it’s been completely built on a zeitgeist and luck and timing. I didn’t want to keep just plunking quarters in the meter as if I owe it something  —   or as if it owes me something. It had to be a legitimate exchange. And it turned out it was. ” Though she set out to make the album alone, Feist eventually welcomed in Renaud Letang, a longtime collaborator, and Mocky as  . Their job was “to get out of the way,” Mocky said. “She was really owning every note, every decision. ” Such artistic possessiveness may have stemmed from a perceived loss of control around the success of “1234”  —   a song she did not even write  —   which snowballed from an iPod commercial to “Sesame Street,” the pop charts and the Grammys, where Feist was nominated for best new artist in 2008 alongside Taylor Swift and Amy Winehouse. “I felt like a lot of expectations had grown up around me that had not much to do with me,” Feist said. “My goal was to just very carefully descend the ladder with dignity, and go back to the altitude that I can breathe at. ” Still, surrounding “Metals,” “I was much too aware of the external side of things,” a distraction she was finally able to shake for “Pleasure,” she said. Having “accidentally achieved autonomy,” with consistent sales and touring revenue, “I actually finished making this album before we told the label that we’d made it. ” This release will also coincide with a return to an earlier chapter in Feist’s career: playing with the Canadian supergroup Broken Social Scene, which has a new album planned for summer. “My only caveat going in was I want to actually contribute  —   I can’t commit if I’m just singing oohs and aahs,” said Feist, who wrote one song for the project and contributed to about six others. “I don’t even know if I was a part of the last couple of records  —   I can’t actually remember. Certainly I didn’t bring myself to the table like I just did for this song. ” Kevin Drew, the group’s de facto leader and one of Feist’s closest friends (as well as an ex) said: “She penned something stunning. Creatively, it couldn’t have gone any better. ” Mr. Drew also recalled sitting in Feist’s rehearsal space as she worked on her own album. “I see the struggle of honesty,” he said. “There’s no hiding. ” It was laying her emotions so bare that allowed Feist some perspective on them. Climbing rocks in Central Park, she recalled the “shanty hut” on a raw Canadian island where she spends weeks during the summer, isolated and without electricity. “Being on that island, I found really concrete poetry,” Feist said, comparing her moods to the storms that passed over the exposed landscape. “I could see it coming, I would experience it, and then it would be gone. ”'"}, "time": 1742562208.86079}