{"duration": 0.1446692943572998, "input_args": {"text": "'Drew Stratton November 12, 2016 Prep Blog Review: 18+ Tips For Healthy Preppers \\nThe true challenge nowadays is to stay healthy in a toxic environment. Today we have access to medication and doctors, but what if we are in post SHTF environment and there is no way to get help? \\nOne thing’s for sure: when SHTF health becomes your first concern and to stay healthy in a survival situation requires a proper diet, hygiene and sleep. Of course, there are many other skills required, but those make the subjects of other articles. \\nFor this week’s Prep Blog Review I’ve gathered five articles with useful tips, most of them simple home remedies, for healthy preppers. \\n1. 10 Home Remedies For Oral Thrush \\n“Scientifically referred to as orophangeal Candidiasis, oral thrush is basically a yeast infection that tends to develop on the tongue. It’s unpleasant to look at, and even painful when you have it. The frustrating thing about this condition is that it might be drug-resistant, especially if the Candida rejects anti-fungal medication. \\nBut guess what? I will provide you with top 10 home remedies for oral thrush, all of which are safe and proven to treat the condition. But before we look at these remedies, it’s only wise you know what causes oral thrush. After all, that’s where the treatment starts!” \\nRead more on I Keep Healthy . \\n2. 17 Uses For Listerine In A Survival Situation \\n“Many of us are familiar with the distinctive taste of Listerine. Whether it’s in the morning or before bed, the extreme tingle of Listerine is a familiar part of our daily routine. \\nBut did you know that Listerine has many other uses besides a mouthwash? Listerine’s unique antiseptic properties lend well to many other applications, especially in survival situations. \\nTopical antiseptic \\nListerine does such as great job of helping clean the mouth, it shouldn’t be surprising that it also works great for disinfecting minor cuts and wounds. This is due to Listerine’s high alcohol content. \\nListerine may not work as well as dedicated antiseptics, nor be as comfortable to use (alcohol can really sting!), but it definitely works in a pinch to kill bacteria, reduce the chance of infection and speed up the rate of healing.” \\nRead more in Ask A Prepper . \\n3. 4 Natural Steps To Rebuilding Your Gums \\n“It’s common for people these days to have issues with their gums. Many people have been told that their gums are “withering away” or thinning, and even have tooth loss as a result. One young woman I spoke with in the past few months was only in her 20s, and yet her dentist told her she would need three implants and would eventually lose all of her teeth. \\nOthers have periodontal disease and can’t seem to make any progress. They do what the dentist and hygienist says, and yet their mouth never improves. \\nThe teeth weren’t constructed in such a way that missing a day or more of brushing or flossing would be the entire cause of these gum diseases. Instead, you have to look at what is happening in the entire body. The gums are made from tissues synthesized in the body from all the appropriate building materials – protein, silica, vitamin C, copper, zinc and other nutrients.” \\nRead more on Off The Grid News . \\n4. Why You Need Sunlight Everywhere You Go \\n“With the apparent elimination of rickets at the turn of 20th century, following the discovery of the role that vitamin D plays in the elimination of this disease, most may think that vitamin D deficiency is a problem of the past. While vitamin D deficiency is not often found in North America, insufficiency is still very common. \\nThis should not be surprising, being that there has been an unprecedented increase of indoor computer use as social media and remote-access work continue to rise in popularity. The acclimatization of modern people to a lifestyle that is primarily indoors is a recipe for disaster when considering the importance of vitamin D and bone health. \\nThe following will discuss some of the major reasons why you need as much sunlight exposure as you can obtain within reasonable limits and how you can remove the primary obstacles that could be in your way.” \\nRead more on Ready Nutrition . \\n5. 18 Natural Home Remedies For Acne \\n“Before learning about the home remedies for acne, let us first define what acne is. Acne is a superficial skin condition that starts when pores are clogged with oil, dead skin cells, and bacteria. It may come in several forms like pimples, cysts, whiteheads and blackheads. \\nIt may be caused by a combination of several factors but is commonly present during adolescence due to excessive oil production. \\nThere are many acne solutions in the market today, mostly artificial in nature. But why not try these natural ways to clear the stubborn acne in our faces. We’ve included an infographic to serve as a cheat sheet for you to download or pin for later at the end of this article.” \\nRead more on Ultimate Home Remedies . \\nThis   Drew Stratton for Survivopedia. 7 total views, 7 views today'"}, "time": 1742563730.5812657}