{"duration": 0.047384023666381836, "input_args": {"text": "\"Pin 4 \\n( ANTIMEDIA ) Democratic presidential nominee Hillary Clinton escaped further FBI scrutiny over the weekend, just before millions of Americans prepare to cast their vote for president. But according to the latest batch of emails published by WikiLeaks — and listed as unclassified by the U.S. Department of State — she won’t escape public scrutiny for her crimes in Libya. \\nIn an email from Sidney Blumenthal with the subject line “ H: Lots of new intel; possible Libyan collapse. SID ,” dated March 26, 2011, Clinton was warned that al Qaeda militants, as well as members of the Muslim Brotherhood, would rise if then-Libyan president Muammar Gaddafi were ousted. \\nLong before the al-Qaeda-led attack against U.S. government facilities in Benghazi, Libya, Clinton was advised that U.S. efforts in the country would lead to internal collapse, as al-Qaeda militants would infiltrate the post-Gaddafi transitional government. \\nIn the same email , Blumenthal told Clinton that “ [a]n extremely sensitive source ” claimed “ the [anti-Gaddafi] rebels are receiving direct assistance and training from a small number of Egyptian Special Forces units, while French and British Special Operations troops are working out of bases in Egypt, along the Libyan border .” \\nThese troops were in place to oversee “ the transfer of weapons and supplies to the rebels ,” which included “ radical/terrorist groups such as the Libyan Fighting Groups and [al Qaeda] in the Islamic Maghreb (AQIM). ” According to then-French president Nicolas Sarzoky, Blumenthal said in the email , al-Qaeda fighters were “ infiltrating the [Libyan Council (NLC)] and its military command .” \\nBlumenthal also asserted that Sarkozy was reaching out to the Israeli government to obtain “ a clear picture of the role of the Muslim Brotherhood in the rebel leadership .” \\nIn the email , Blumenthal also listed the weapons provided to militants and stocked in Benghazi. \\nThey included “ 82 and 120 mm. mortars; GPZ type machine guns; 12.7mm. machine guns mounted on 4×4 vehicles ; some anti-aircraft batteries type ZSU 23/2 and 23/4 as well as Man-Portable Air-Defense Systems (MANPADS) type SAM7; some tanks type T-72; … Possibly some fixed wing aircraft, and some light transport/medium helicopters .” Sign up for the free Anti-Media newsletter the establishment doesn't want you to receive \\nBlumenthal also reassured Clinton that militants in Benghazi had “ [a] seemingly endless supply of AK47 assault rifles and ammunition (even for systems ZSU 23/4 and 23/2) .” \\nThe email added that French, British, and Egyptian Special Forces troops were training the rebels in Egypt and in the western suburbs of Benghazi. \\nIf anything, this email proves Secretary Clinton was aware of the potential ramifications of U.S. intervention in Libya. Despite the warnings provided by the intelligence sent to her inbox, Clinton and President Barack Obama went along with their plan and, in tandem with other foreign governments , provided aid to rebels with deep and well-known ties with al-Qaeda — one of the United States’ alleged top enemies in the region . \\nThis article ( Hillary Knew She Was Helping Terrorists by Overthrowing Libya’s Gaddafi ) is free and open source. You have permission to republish this article under a Creative Commons license with attribution to Alice Salles and theAntiMedia.org . Anti-Media Radio airs weeknights at 11 pm Eastern/8 pm Pacific. If you spot a typo, please email the error and name of the article to .\""}, "time": 1742563808.4269626}