{"duration": 0.11410045623779297, "input_args": {"text": "'VIDEOS Could the latest solar storm warnings bring an end to civilization as we know it? Here are 5 catastrophic consequences of a major CME hitting the Earth and changing life as we know it By Ryan Banister - November 2, 2016 \\nDid you know that the White House is currently coordinating with Homeland Security to make preparations for a possible solar storm that could bring an end to civilization as we know it? An Executive Order published on October 13, by the Obama administration shows an increasing concern among White House officials about “solar flares, solar energetic particles and geomagnetic disturbances,” following a solar event which generated a Category G2 geomagnetic storm on October 8. This action could likely mean that we have an imminent solar threat in our near future. A solar discharge of great magnitude could mean entire countries could be without electricity, civil unrest and countless lives lost. If federal officials are preparing for this sort of disaster, we have enough reason to arm ourselves with the knowledge of what we might face. What are CMEs? \\nCoronal Mass Ejections (CMEs) are violent explosions of plasma originating from the Sun’s corona, out of which energized particles and powerful magnetic domains emerge as fast as 3,000 kilometers per second. A CME has an associated shock wave and electromagnetic pulse (EMP) that can travel toward the Earth and interrupt satellites and power grids around the planet. There are currently no public disclosures of CMEs being detected, but there is a significant geomagnetic storm event beginning, combined with the Executive Order previously mentioned, gives cause for concern about the possibility of a CME striking our planet in the near future. A recent report from the National Oceanic and Atmospheric Administration (NOAA) Space Weather Prediction Center predicts a Category G2 geomagnetic storm from October 24 – 26. An aurora borealis is projected to be seen in the skies above New York to Wisconsin to Washington state, and interruption to satellites and power lines are expected. \\nIt is possible that this particular storm is not the result of a CME, but in order to be prepared, one must first know what disasters may lie ahead and plan accordingly. Here are 5 catastrophic consequences of a major CME hitting the Earth and changing life as we know it: Satellite Disruption \\nIf there was a high-magnitude impact of solar energy and particles, we would see an immediate response on low-Earth orbiting weather, communications, and military satellites. Some satellites could be crippled for up to a decade . The first sign that a major CME is about to strike will be a loss of connection with or permanent failure of a portion of low-Earth orbiting satellites and their associated infrastructure. The shock wave, in combination with an EMP, would likely cause significant disruption of GPS signals, possibly creating long-term failures across the global navigation satellite system. This would have disastrous implications for commercial airplanes and ships, many of which rely on GPS guidance systems for landing and docking, and a failure of timing on either of these systems could put countless lives at risk. Seismic stations, computer network synchronization and many electric power grids across the world rely on GPS clocks. Geomagnetic disturbances associated with CMEs are known to disrupt GPS clocks through interference of high frequency radio signals in both air and ground transmission. Here is some more information on EMPs. Build Your Own Faraday Cage Out of an Ammo Can Power Grid Failure \\nA large-scale geomagnetic storm generated by interactions between Earth’s magnetic field and magnetic domains originating from the Sun could cause geomagnetically induced current (GIC), where transformers and power lines can experience a large flux in power from changes in the Earth’s magnetic field. The transformers and associated infrastructure may overheat and the power grid across more than half of the U.S. and many other industrialized countries could fail and cause a widespread blackout scenario if there was a large enough solar event. A study by Metatech corporation shows that a GIC with comparable magnitude to that of the 1921 geomagnetic storm would be projected to destroy more than 300 extra high voltage transformers and adjacent power lines across the U.S., leaving approximately 150 million people without power. The study highlights the risk to the power grid saying, “In 1921, a geomagnetic disturbance of approximately 5000 nT/min, ten times the magnitude of the 1989 storm, is believed to have occurred. A storm of this magnitude today would cause widespread damage to the electric grid of unprecedented proportions.” \\nThis means that all streetlights and stores could lose power without warning. Hospitals could lose power, causing failure of equipment and countless lives could be lost. Computers, cell phones, electric cars and anything else that requires a charge would die and be rendered unusable for the duration of the power grid failure. Credit card transactions and ATM machines will not work. A prolonged failure of even one-third of the grid could potentially require at least ten years for the repair and replacement of fried transformers, capacitors and power lines across the country. The end result of such a sudden and extreme loss of electricity would result in a cataclysmic loss of life, with projected human casualties at almost 100 million as a result from one major geomagnetic disturbance. Hurricanes & Tornadoes \\nHurricanes and tornadoes are thought to be closely associated with solar activity, according to Dr. Vladimir I. Merkulov, a Russian physicist who is well-known for his research into gravitational waves in the atmosphere and in vortex chambers. Merkulov has developed the Electro-gravitational Dynamic Concept of Hurricanes and Tornadoes based from observations of the physical structure of vacuum domains originating from the Sun. In his book, Amazing Hydromechanics , he says that tornadoes and hurricanes are caused by increased solar activity, including CMEs, from which vacuum domains emerge that have both electrical and magnetic properties. According to Merkulov, this means that a large CME event could be closely associated with an inestimable increase in the occurrence of tornadoes and hurricanes. While satellite communications fail and the power grid shuts down, residents of the Midwest may be dealing with multiple tornado strikes and coastal areas could have a hurricane fast-approaching the shoreline. Many of them may not realize the immediate threat that is heading toward them due to failing emergency communications being disrupted. Nearby hospitals may be unable to help those who are injured due to the failure of large portions of the power grid. Economic Collapse \\nThe economic collapse that would result from this event would create a poverty never before seen in North America. Losing electricity would mean that ATM machines will not work and banks will be closed. Losing access to electronic currency will cripple many who have become reliant on credit cards and other forms of digital currency. Grocery store shelves will be left entirely empty and supply trucks would likely be unable to resupply stores. If there are gas stations able to process transactions, gas supply will be severely limited. There is no reason to expect that the Federal Reserve Note will survive such a collapse; stored precious metals might become an alternative form of currency and bartering may become a primary means of exchange. Here are six ways to prepare for this type of disaster. Social Upheaval \\nWhen people starve and are unable to get what they need for survival, you can expect that a certain amount of them will end up looting homes or stores . Those who do not live near a river or stream may entirely lose access to clean water, which could likely mean that millions of people would be forced to relocate within days of the initial event. Having firearms for self-defense will be necessary amidst the social upheaval resulting from a CME and the associated events mentioned above. There is no reason to expect that police and military will have the desire nor capability to help those who may fall victim to looters; everyone will have their own family and loved ones to look after. \\nKnowing the risks to life and property that may lie ahead is only a part of the battle. Each of the likely future scenarios mentioned above should be planned for in conjunction with the others.'"}, "time": 1742563715.4479516}