{"duration": 0.08832263946533203, "input_args": {"text": "'License DMCA This is not about how politics controls research on cancer and other diseases. It is about a political economy which, in the name of democracy, is killing us.\\nToday, I got my PSA score (used to assess degree of cancer), and it was not down, after 4 months of a heavy duty cannabis extract treatment and numerous anti-cancer supplements, along with a vegan anti-cancer diet. It didn\\'t go down. After my cancerous prostate was removed 10 years, ago I had nearly 8 yrs cancer free, then two years, ago the score began to rise, from .2 to .4. to .5 to today\\'s .6. \\nThat is a low score, but it is growing and my treatments have not stopped it. I ask: how can I have got cancer when since age 26, I have been on an organic anti-cancer diet? \\nThere are two theories, not necessarily incompatible: one asserts, as the man who discovered the cause of cancer did, that the cause is pollution. Dr. Warburg won the Nobel Prize but the Nazis kept him from accepting it. He said pollution caused cancer. \\nThe other theory is the genetic element: studies on twins seem to show that there is a genetic component, which may not cause cancer but predispose to it, make us vulnerable to the onslaught of pollution. \\nSo I am going to go with the idea that tho genetics makes some more susceptible, it is pollution which is killing us. \\nOn a gross level, this is easy to see. Each year, millions die from fossil fuel pollution; in the US, 13,000 die from coal pollution, and tens of millions suffer from air pollution, not to mention water pollution as in Flint, Michagan and many other cities. - Advertisement - \\nWhy do we have so much pollution? Why haven\\'t we switched to clean energy? Why haven\\'t we banned fossil fuels, which are poisons we eat and drink and breath every day? \\nWe know that pollution kills, makes sick, decreases productivity, increases healthcare costs, makes us suffer and destroys the environment, including climate disruption? Why is nothing being done? \\nThe reason is simple: politics. The oligarchy is made up of those who profit from pollution, from the energy industry to the ag industry. In a democracy, these corporations which are killing us would be stopped. \\nBut in an oligarchy where the polluters rule, all action is to prevent action; private profits trump public safety. Money trumps human health. Accumulating billions is more important than protecting the earth. This is a political decision, within a system of oligarchic rule. We are being killed by cancer because the ruling class has hijacked government and made effective regulation impossible. We are being killed by design, since the fossil fuel elites know the damage their products do. \\nAnd so, as I ponder my next treatment (probably immunotherapy), I ask everyone to consider how our politics, mostly right wing, Republican, pro-corporate but including the establishment Democrats. Clinton, for instance, has received 7 million from the fossil fuel people this year. Clinton is also on record of supporting fracking. - Advertisement - \\nHere is what Sanders said of her in April: \"\"Well, when you vote for virtually every trade agreement that has cost the workers of this country millions of jobs, when you support and continue to support fracking, despite the crisis that we have in terms of clean water,\" he said April 10, \"and essentially, when you have a super PAC that is raising tens of millions of dollars from every special interest out there, including $15 million from Wall Street, the American people do not believe that that is the kind of president that we need to make the changes in America to protect the working families of this country.\" \\nPolitifact concludes that \"Clinton\\'s past support of fracking is well documented.\" \\nAnd so it is not only the Republican\\'s who are blocking action to reduce the damage done by fossil fuels; it is also the Democrats, who are bribed with millions to continue the status quo. Now Clinton says she wants solar on every roof. That is easy to say, and it will get some Bernie supporters to accept her. But her history is of defending the fossil fuel industry. And history trumps hypotheticals. Early detection means early treatment License DMCA Conclusion: pollution is killing us. Both parties have protected this lethal industry to varying degrees. It seems, as with so much else, that if we want change, if we want to stop killing ourselves with toxins in our air and food and water, we will have to finally end the rule of the oligarchs and establish a democratic nation, where the leaders lead in ending pollution and transforming us to clean energy and with it, better health for our families and our earth.'"}, "time": 1742562149.749732}