{"duration": 0.05386781692504883, "input_args": {"text": "'Celebrated evangelical Rev. Franklin Graham says that it was the “hand of God,” rather than Russian hackers, that determined the outcome of November’s presidential election. [“I think maybe God has allowed Donald Trump to win this election to protect this nation for the next few years by giving maybe an opportunity to have some good judges,” he said.  The son of renowned Baptist minister Billy Graham, the Rev. Franklin Graham has been invited by   Trump to be one of six clergy to offer the invocation, benediction, and several readings at his   ceremony on January 20. In an interview with Religion News Service Thursday, Graham said that beyond mere human factors, the mysterious hand of divine providence was at work in the elections. “All I know is Donald Trump was supposed to lose the election” according to all the polls, Graham said. “For these states to go the way they did, in my opinion, I think it was the hand of God,” he said. “It wasn’t hacking. It wasn’t   or whatever. It was God, in my opinion, and I believe his hand was at work, and I think he’s given Christians an opportunity. ” While never officially endorsing Trump, Rev. Graham has been a sharp critic of the Obama administration and a vocal opponent of Hillary Clinton, especially for her uncompromising support of   . Shortly before Election Day, Graham declared that the best choice for president “isn’t difficult to figure out if you are a Christian,” in evident reference to Republican candidate Donald Trump. “There’s two different pictures and two different visions for America,” Graham said in early November. “The Democratic Party has a vision, Hillary Clinton has a vision, Donald Trump has a totally different vision for this nation with the Republican Party. This isn’t difficult to figure out if you are a Christian. ” The evangelist acknowledged that for many, voting for Trump might not have been easy, but he insisted that it was, nonetheless, the better choice and that Trump was a “changed man. ” “You may have to hold your nose and vote,” Graham said. “I have people that say, ‘Well I don’t like Donald Trump, I don’t like what he says.’ Well I don’t like what he said either, I promise I don’t like it. But those are things that he said 11 years ago, not something that he said today. ” “I think Donald Trump has changed,” Graham added. “I think God is working on his heart and in his life. But people have to make up their own mind. ” In a Facebook post some weeks earlier, Graham had stated that “the difference between the candidates is night and day. ” “Some candidates have entire political ads talking about how they spent their career fighting for the rights of children,” he said. “Yet they spent their entire career fighting against the rights of unborn children!” Graham said Hillary Clinton’s progressive agenda was “godless” and could not be defended. Following WikiLeaks revelations, the preacher denounced the “depth of corruption” in Washington politics, calling for its eradication. “WikiLeaks is giving us a much clearer picture of the depth of the corruption that is thriving in our nation’s capital,” Graham wrote, calling it “a swamp that needs to be drained. ” “Our political system is broken, and it will take strong, tough leadership to begin fixing some of this,” Graham said. Regarding the inauguration ceremony, Graham says he still has not decided which Scripture passage to read. “I’m taking time just to pray and ask God to give me wisdom and guidance because it’s a responsibility that I take very seriously,” he said. Follow Thomas D. Williams on Twitter Follow @tdwilliamsrome'"}, "time": 1742562410.7282486}