{"duration": 0.09343719482421875, "input_args": {"text": "'HOUSTON  —   Follow our live N. F. L. playoffs coverage here. Brock Osweiler redeemed himself after last month’s benching. Jadeveon Clowney established himself as a postseason force. And the Houston Texans got their first playoff victory since the 2012 season, beating the Oakland Raiders,   on Saturday. Osweiler threw for a touchdown and ran for another to lead the Texans to the win, in the   round. Clowney, erasing doubts that he deserved to be the top pick in the 2014 draft, got his first career interception, on the Raiders’ second drive. Osweiler, who got his job back last week after Tom Savage sustained a concussion, finished with only 168 passing yards but played his best game of the season. “It just goes back to having confidence in my teammates,” said Osweiler, who had never played in a playoff game, having been benched by the Denver Broncos last postseason in favor of Peyton Manning. “Believing in what you see, and just rip it. Cut it loose, and don’t have any hesitation. ” Houston ( ) and its   defense, led by Clowney and Whitney Mercilus, advanced to face either the Kansas City Chiefs or the New England Patriots in the divisional round. Clowney was roundly criticized in his first two   seasons before his star turn this season as he helped make up for the loss of J. J. Watt, who was placed on injured reserve in September. “Things didn’t go well earlier in my career, but I’m on the right track now,” Clowney said. The Raiders were making their first trip to the playoffs since the 2002 season, when they went to the Super Bowl, but it ended with a thud behind the struggles of their   quarterback, the rookie Connor Cook. He threw for 161 yards, with one touchdown and three interceptions. “It was his first start, on the road, in a playoff game, against the No.   defense,” Raiders Coach Jack Del Rio said. “It was a tough draw for him. We had hopes that we would be able to do enough around him so he wouldn’t have to do as much. ” Cook became the first quarterback in N. F. L. history to make his first start in a playoff game. The usual starter, Derek Carr, a contender for the Most Valuable Player Award, broke his leg two weeks ago, and Matt McGloin injured his shoulder last weekend. The Raiders were also missing their star left tackle, Donald Penn, whose streak of 160 straight starts ended because of a knee injury. The Raiders ( ) got touchdowns from Latavius Murray and Andre Holmes, but cornerback David Amerson said things would have been different if the team had fewer injuries. “I’ve got all the faith in Connor or Matt  —   any backups we’ve got,” he said. “But they know, at full strength, ain’t nobody in the league touching us, man. We’re going to take this loss on the chin, and we’re going to come back, for sure. ” Houston led by 13 at halftime after touchdowns by DeAndre Hopkins and Lamar Miller, who scored a play after Clowney’s interception. Houston increased its lead to   on a   run by Osweiler early in the fourth quarter.'"}, "time": 1742564331.8051202}