{"duration": 0.12661075592041016, "input_args": {"text": "'Politics If Hillary Wins, Here Are 10 Things Anyone Can Celebrate \\n\"So why not give everyone a free day, dress everyone in Boy Scout outfits and make them march along the Pennsylvania Avenue singing songs about the Great Mother of the Nation. Finally, North Korea would meet its match.\" Hooray! (Click to enlarge) The author is an Associate Professor of Slavic Languages at Brown University, an American Ivy League university. People are justifiably frightened by the prospect of Hillary Clinton re-entering the White House, as if her first stay wasn’t bad enough. To all those who think that her warmongering would result in military confrontation with Russia, and her cozy relationships with bankers would lead to economic collapse, I would like to offer something to cheer about. # 10 America is the country of émigrés, of people who were given a second chance after they landed here. So Hillary’s second coming to the White House, would be the source of endless inspirational stories for the poor suckers belonging to the 99% and who rely on the crumbs that 1% drops to them from their table. Never give up, there is always a second chance at joining this coveted table. # 9 Hillary’s victory would spawn a great new industry for senior citizens. Rather than looking forward to playing bingo or taking cruises, any senior could aspire to become president. What a great area of possibilities! I can imagine courses opening all over the country on such diverse subjects as to how to open a foundation and take bribes legally; how to negotiate with lobbyists, how to laugh demonically and sarcastically, how to erase your emails, and how to forget bad things that you’ve done. Not sure the seniors would pay for this last group of courses, but worth trying anyway. # 8 With Hillary in the White House, the whole world would celebrate her reception of several Nobel Prizes simultaneously. Judging by the eagerness with which they responded to President Obama’s promises of peace, it is hard to imagine Nobel Prize committees failing to respond to Hillary’s winning ways. Consequently, we will be able to rejoice at Hillary’s Nobel prizes for Peace (in the Middle East in particular), for fiction (her whole life is one big fantasy); for mathematics (for inventing computer algorithms that either destroy emails, or attributes them to the hacking Russians), for chemistry (for inventing the coating, that makes Teflon look fragile and crumbling), and for physics (for constructing this missile shield that would enable her to create unopposed no-fly zones any place she wants). This latter prize she might share with the great chief of Pentagon and physicist in his own right, Mr. Ashton Carter. # 7 Hillary’s success would result in a new arms race with Russia, providing endless amounts of jobs for students of Russian, since there will be a need to discover all the mischief of Russians and therefore beef up all the seventeen agencies that, according to Hillary, keep on spying on Russians. Furthermore, with Russians being what they are, seventeen agencies are hardly enough. There should be at least 1001. I can easily foresee the brightest future for all Slavic Departments. A bit of self-serving, I agree, but after all, with Hillary we are entering a new “self-serving-is-good” age. # 6 Hillary would also unleash a new politically correct language onto the world. Just the other day, as I was booking hotel room, I was asked about my gender. And there were only two options to choose. What a disgrace! With Hillary in the White House, all the great students of Ivy League Universities – and they are the only ones who can remember and pontificate on all thirty one gender identities introduced by political correctness --would find fantastic employment advising various companies, agencies, even countries, on this subject. And this is only the beginning. Think about the great employment opportunities for those who can distinguish and label all thirty-one types of terrorists currently fighting in Syria. The State Department, which already employs seventy thousand people, would have to be drastically expanded to accommodate such experts. # 5 The Saudis could buy all Trump’s Hotels, including the one that is supposed to be next to the White House; consequently, they could negotiate with Hillary directly, without leaving any paper or internet trace. So, there won’t be any need for Wiki-leaks emails, and other bothersome documents, all of which seem to distract the country from its main task. The task indicated to all of us by Hillary’s one-time rival, Bernie Sanders, who after he announced, “people are sick of hearing about these damn emails ,” proceeded, without further ado, to lick Hillary’s behind. And so did all his followers who are now cheering for the rest of us to do the same. # 4 A Hillary victory would guarantee the continuity of the same people in such positions of power as Pentagon, State Department, Treasury, CIA, or Senate. Who needs unnecessary disruption that comes with the change of various leaders? With Republicans switching to Hillary, it is high time that we modify the elections in general, to cement the elite’s hold on power. They are obviously very good for the country; otherwise, we would not be voting for the same people again and again. So why not give everyone a free day, dress everyone in Boy Scout outfits and make them march along the Pennsylvania Ave singing songs about the Great Mother of the Nation. Finally, North Korea would meet its match. Who are those skeptics who say that Kim is a serious threat to US? To their Kims we offer our Clintons, to their party we offer our party, to their elections --our elections, to their meager amount of nukes we offer our full arsenal of nukes. So eat your kimchi, Mr. Kim and go back to jailing your opponents. # 3 This small step for mankind will be a giant step for all women in the world. Never mind the previous great examples of female presidents and national leaders. They were not Americans, and therefore cannot possibly serve as role models. With Hillary, every woman could look at her daughter and say: “Don’t worry. One of these days, you’ll marry an ambitious young man from provinces, and you’ll do everything in your abilities to help him succeed. And after he enjoys all the perks that come with his success, while you continue to serve him with devotion and loyalty, you’ll get your second chance. Just be patient!” What a great inspiration to all the young women of this nation! # 2 The banking industry would experience a real renaissance. New York would be renamed New Wall Street, since only bankers could afford to live there. Unopposed and unregulated, they would become truly creative, selling us mortgages for the use of air, sea, rain, stars, and sky. And putting all their profits to good use, they will make sure to provide us with perfect replacements for any retiring party apparatchik. # 1 Warmongering industries, Silicon Valley, and the entire state of California would be given a chance to compete with bankers in terms of power and money. With the shortage of water, the state is slowly turning into a desert. So inventing gadgets for the military, and testing nukes in California deserts, would be a fantastic solution. And in terms of the rest of the country, frankly, who cares about them. Their task is to pay taxes, buy the new financial vehicles invented in New York, play with the new gadgets invented in California, and keep on voting for Hillary, our Big Sister, who never sleeps, devising ways to protect us from those pesky North Koreans and Russians. So it is high time for people who inhabit this little patch of land squeezed between California and New York, to all those formerly known as “the great unwashed,” but rebranded recently as “deplorables” it is high time for you all to give up on your sexist, gun-toting, racist ways, and begin to rejoice in the fact that in this wonderful land of yours and theirs everything is for a woman… And her name is Hillary. Did you enjoy this article? - Consider helping us! Russia Insider depends on your donations: the more you give, the more we can do. $1 $10 Other amount \\nIf you wish you make a tax-deductible contribution of $1,000 or more, please visit our Support page for instructions Click here for our commenting guidelines On fire'"}, "time": 1742561780.1251671}