{"duration": 0.01611781120300293, "input_args": {"text": "\"(Before It's News)\\nObvious political double standards\\nWhen it comes to scandal-plagued and utterly dishonest Hillary Clinton, the U.S. Attorney General Loretta Lynch clandestinely meets on the tarmac of Sky Harbor airport for a tête-à-tête with Hill’s husband Bill aboard a private jet — ostensibly to discuss grandchildren.\\nAnd, though FBI Director James Comey found compelling evidence of concerning issues in Hillary Clinton’s use of multiple private email servers, he concluded that he would not recommend charges against her, though he conceded Clinton and her aides were “extremely careless” in handling classified information. Comey refused to recommend an indictment against Hillary Clinton, despite “evidence” she violated laws pertaining to the handling of classified information, jeopardizing U.S. national security. These breaches occurred during her term as Secretary of State. “There is evidence to support a conclusion that any reasonable person in Secretary Clinton’s position should have known that an unclassified system was no place for that information,” Comey acknowledged.\\nAdditionally, Comey noted that other individuals in a similar situation would not necessarily be let off the hook with no charges, and would probably face penalties. “But that’s not what we’re deciding now,” he glibly fed us, the sheeple. “We are expressing to Justice our view that no charges be made in this case.”\\n“Justice,” of course, is U.S. Attorney General Loretta Lynch of the tarmac meeting fame. Addressing the people of the United States, the FBI director actually said that “no outside influence of any kind was brought to bear” on the investigation. He neglected to mention the inappropriate meeting between former president Bill Clinton and Loretta Lynch aboard a private jet.\\nHillary Clinton is free to run for the U.S. Presidency, guaranteeing Obama’s third term.\\nHere in Arizona, we have what clearly appears to be a personal vendetta carried out by a federal judge timed to coincide with the General Election in which popular Sheriff Joe Arpaio is on the ballot running for a seventh term. He was formally charged Tuesday with criminal contempt of court for ignoring U.S. District Judge Murray Snow’s order in a three-year old racial-profiling case. Arpaio acknowledged violating Snow’s order but insists the breach wasn’t intentional\\nArpaio’s challenger in the race is once again rough ‘er up Democrat Paul Penzone, funded by multi-billionaire Socialist George Soros, who is contemptuous of national borders. Soros also funds Hillary Clinton and John McCain .\\nIf convicted, Sheriff Arpaio could face up to six months in jail. A misdemeanor conviction would not bar Arpaio from serving as sheriff.\\nSheriff Arpaio’s interview with Lou Dobbs is worth your time:\""}, "time": 1742628553.610816}