{"duration": 0.07587790489196777, "input_args": {"text": "'Home / Badge Abuse / Family Sues After Cops Shot 6yo Autistic Boy and Watched Him “Suffer Immensely” As He Died Family Sues After Cops Shot 6yo Autistic Boy and Watched Him “Suffer Immensely” As He Died Claire Bernish October 29, 2016 Leave a comment \\nMarksville, LA — A federal lawsuit has now been filed against several Louisiana law enforcement agencies for the fatal shooting of six-year-old Jeremy Mardis, who “suffered immensely” on November 3, 2015, due to “a barbaric and excessive use of deadly force.” \\nAttorneys representing Christopher Few, Jeremy’s father, who suffered serious injuries in the incident; mother, Catherine Mardis; and Candace Few, whose vehicle her brother, Christopher, drove the night of the shooting, filed a federal civil lawsuit on Thursday in an attempt at justice for the needless death of the young child. \\nIn fact, video footage of the incident so shocked Louisiana State Police Col. Mike Edmonson, he told reporters in November, “It is the most disturbing thing I’ve seen, and I will leave it at that.” \\nAccording to the lawsuit, referenced by KLFY , defendants include “Norris Greenhouse Jr. and Derrick Stafford, the two former Marksville Ward 2 deputy marshals facing second-degree murder and attempted second-degree murder in the case. Both pleaded not guilty and are facing separate trials. \\n“But the lawsuit also names as defendants Marksville City Marshal Floyd Voinche, the Marksville City Court, the town of Marksville, Avoyelles Parish, Progressive Paloverde Insurance Company and the other two officers involved in the chase of Few that night — Jason Brouillette and Kenneth Parnell III.” \\nOn November 3, 2015, according to the original police account, the four officers were attempting to serve a warrant for Few — who then fled in his sister’s Kia Sport, with Jeremy buckled in the passenger seat. \\nPolice had claimed Few was armed and posed an imminent deadly threat — so Officers Greenhouse and Stafford opened fire — emptying 18 rounds at the vehicle, critically injuring Few and killing the 6-year-old, who had autism. \\nIn actuality, no warrant had been issued for Few, and both father and son were unarmed — indeed, as video evidence shows, Few had his hands in the air when he received “two or three” bullets to the head and chest, while Jeremy suffered “four or five” shots to the head and neck. \\nAppallingly, Jeremy languished in agony, still holding onto life for over five minutes after being shot multiple times — but officers failed to even check for a pulse or render assistance. \\n“During this time, Jeremy was bleeding profusely and suffered immensely due to the gunshot wounds,” the lawsuit states, according to KFLY . \\n“It was not until approximately some seven and one-half to eight minutes or so after the hail of gunfire, that an officer at the scene, believed to be Parnell, finally checked Jeremy for a pulse and discovered that he was still alive, despite having been shot multiple times including in the head and neck,” it reads. \\n“However, none of the officers at the scene, including Stafford, Greenhouse, Brouillette and Parnell initiated or rendered any form of first aid, nor did they undertake any other measures in an attempt to stop Jeremy’s bleeding or otherwise alleviate or mitigate Jeremy’s suffering, or made any attempts to save his life. \\n“Sadly, Jeremy was left to suffer — and die — while the officers casually searched for ‘gloves.’” \\nAn exact motive for the original traffic stop — given the fictitious claim of a warrant and that Few did not have a weapon — has yet to be publicly released by officials. Attorneys for Greenhouse and Stafford stated during court proceedings Few had been standing in the road, blocking traffic, ignored officers’ commands, and then fled the scene. \\nBut the lawsuit contends there had been no clear reason for police to pursue the vehicle Few was driving, and when he ultimately did pull over, the vehicle, “even if it were moving forward or backwards — did not and could not have presented an imminent threat of death or great bodily harm to any of the officers at the scene or innocent bystanders.” \\nAs video clearly shows, Few pulled to the side of the road, raised his arms above his head and made no threatening gestures — in other words, he posed not even the slightest legitimate threat to their safety. The lawsuit continues : \\n“Moreover, at the time the pursuit of Christopher was initiated, and thereafter during the pursuit, none of the officers had reasonable or probable cause to believe that Christopher had committed some crime, was committing a crime or was about to commit a crime. The pursuit was unlawful, as was the subsequent use of deadly force.” \\nFatally shooting a 6-year-old child wasn’t the first brutal act by either Stafford or Greenhouse. As The Free Thought Project reported, the pair of rageful cops have a history of brutalizing their town with impunity — and as the lawsuit notes, it seems no vetting procedure was in place when Greenhouse and Stafford were hired. \\nAdditionally, when attorneys made a public records request with Marksville City Marshal Floyd Voinche for hiring, training, and disciplinary guidelines concerning deputy marshals, they received a telling one-sentence reply: “No such records exist.” \\n“The need for such policies is so obvious,” KFLY quotes the lawsuit, “for the safety of the public and the protection of constitutional rights that the lack of such policies constitutes deliberate indifference and a reckless disregard for the public and plaintiffs’ constitutional rights.” \\nBut the fact it took an innocent 6-year-old’s death to force the city to examine such policies is endemic of brutal policing in the United States — and one means officers can employ to work around appropriate discipline is to resign and simply move on to the next department. \\nIn late September, in a stunning act of hubris, Stafford again requested charges be dropped since he acted in self defense — despite damning evidence to the contrary. \\nThe family of Jeremy Mardis is requesting a jury trial in this lawsuit. Share Social Trending'"}, "time": 1742562272.9701371}