{"duration": 0.07023358345031738, "input_args": {"text": "'Share This \\nAlthough the majority of attention seems to be on Hillary Clinton these days, it seems that her entire staff is currently under speculation. In fact, Huma Abedin is in a bit more trouble than she bargained for after the dirty thing she did to the FBI back in June – and it could be coming back to bite her. \\nAs much of the nation is aware, the FBI recently thrust Hillary’s campaign into chaos by announcing that they reopened the presidential hopeful’s criminal email case. However, she’s not the only one under a microscope. Huma, who is Hillary’s closest aide, just got some seriously bad news . Hillary Clinton (left) and her closest aide, Huma Abedin (right) \\nFor those unaware, the FBI recently announced that they came into some new emails that may be pertinent to Hillary’s case. Come to find out, Huma had actually left them on a computer that she shared with her husband, disgraced congressman and alleged pedophile Anthony Weiner. \\nHowever, the bad news doesn’t end there as Huma actually said under oath in a sworn deposition that she looked for all devices that she thought contained government work and handed them over to the State Department. With this taking place on June 28, 2016, it looks like Hillary’s little helper actually perjured herself in order to defend her boss. \\nUnfortunately for her, she seems to be having a rough time. In fact, a picture was released on the day that the FBI made the announcement, and it seems to show a crying Huma abord Hillary’s plane: Image surfaces of Huma Abedin crying on plane as Clinton Campaign finds out the FBI has re-opened the email investigation. #HillarysEmails pic.twitter.com/2yIUgiYOsV \\n— REGATED (@regated) October 29, 2016 \\nMaking matters worse for her, reports further indicate that Huma wasn’t on Hillary’s plane on Saturday with no signs of her return in site. According to speculation, many believe that she may actually be sitting down with lawyers in an attempt to get ahead of the backlash coming her way: #Hillarysemail Huma Abedin is not on the plane with #HillaryClinton today. She must be freaking out especially since she signed this doc. pic.twitter.com/KOwI5rN1pW \\n— Trump Street Team FL (@ChatRevolve) October 29, 2016 \\nWhen it comes down to it, Americans are sick and tired of being lied to by crooked Hillary and her campaign. We’re done with watching the political elite get away with things that others would be in prison for. However, it seems as though the tides are changing and Hillary and her goons could find themselves living in a cage for the next few years just like they deserve. \\nHowever, it seems as though the tides are changing and Hillary and her goons could find themselves living in a cage for the next few years just like they deserve. Her White House dreams are turning into a jailhouse nightmare, and it’s long overdue.'"}, "time": 1742562174.4806702}