{"duration": 0.07079243659973145, "input_args": {"text": "'After a stunted   order, the Fox baseball series “Pitch” has officially struck out. [The TV series telling the story of the fictional “first female pitcher in Major League Baseball” has been canceled after a single, shortened and   season, Fox has announced.  Executive producer Kevin Falls revealed the network’s decision on his Twitter feed, thanking the “faithful fans” for “trying so hard” to save the show. I’m sorry to tell you that @PITCHonFOX will not be getting a second season. #Pitch,  —   Kevin Falls (@KevinFalls) May 2, 2017,  Falls heads up Left Coast Productions, and if “Pitch” was any indication, then the “left” part of that moniker is fitting. Within the first two minutes of the opening scene of the first episode, “Pitch” worked in both gay activist and TV host Ellen DeGeneres and former Secretary of State and failed Democrat candidate for president, Hillary Clinton. The first few episodes of the short order, single season also featured Fox Sports 1’s Katie Nolan, who portrayed herself as a TV sports analyst, the same Katie Nolan who took to Twitter to call popular Fox News personality Sean Hannity a “literal fu**ing moron. ” Some say that Fox hurt the series when it rushed the show to air months earlier than its original Spring of 2017 launch date. The network jumped the show into rotation, though, after ABC moved “Scandal” to accommodate star Kerry Washington’s pregnancy. Fox thought it could capitalize on audiences looking for a series starring a strong female lead, but audiences didn’t comply with the network’s hopes. Star Kylie Bunbury, who portrayed the titular “Pitch” character Ginny Baker, tweeted that her “heart is heavy. ” My heart is heavy. 💔 Pitch will not be returning. I don’t have some eloquently thought out  …     https:  .   —   Kylie Bunbury (@kyliebunbury) May 2, 2017,  The fictional baseball series had a lot of early buzz, but according to Variety, the show never connected with viewers and earned dismal ratings “averaging a 0. 8    day Nielsen rating in the   demo and 3 million total viewers per episode. ” In a piece published by MRCTV. org, Breitbart Sports’ Dylan Gwinn jabbed the idea that a woman could compete as a pitcher in the Major Leagues. The concept was wholly unbelievable, Gwinn said, because “the fastest pitch ever thrown by a woman was 69 mph, a feat easily reached, and frequently surpassed, by most male high school pitchers. ” Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742561635.367269}