{"duration": 0.04758739471435547, "input_args": {"text": "'Secretary of State John Kerry’s rebuke of the Israeli government on Wednesday set off a wave of criticism from lawmakers in both parties. Republicans denounced what they said was the Obama administration’s harsh treatment of a steadfast ally and Democrats signaled that they were uneasy with Mr. Kerry’s pressure on Israel, even as they praised the effort to promote Middle East peace. In Europe, however, Mr. Kerry’s speech was greeted warmly, with officials calling it a courageous and thoughtful effort to salvage the idea of a   solution for the Israelis and Palestinians. Still, across the Arab world, his harsh words for Israel were met with a collective shrug, coming at the end of eight years of Obama administration policies that left many in the Middle East frustrated. On Capitol Hill, hours after Mr. Kerry used what may be his last major address to bluntly inform the Israeli prime minister, Benjamin Netanyahu, that “friends need to tell each other the hard truths,” he received a reminder of the deep support Israel enjoys in an otherwise sharply divided Congress. “While he may not have intended it, I fear Secretary Kerry, in his speech and action at the U. N. has emboldened extremists on both sides,” said Senator Chuck Schumer, the incoming Senate Democratic leader. A bipartisan chorus of lawmakers, upset with President Obama’s decision last week to allow the passage of a United Nations resolution condemning Israel’s construction of settlements in disputed territory, made clear that they were looking past the departing administration. Senator Benjamin L. Cardin of Maryland, the top Democrat on the Foreign Relations Committee, said he shared Mr. Kerry’s concerns “with the lack of forward progress on a   solution. ” But Mr. Cardin also said he was unhappy that Mr. Obama had not vetoed the United Nations resolution, instead abstaining from the vote. He pledged to “explore congressional action that can mitigate the negative implications” of it. The most ardent supporters of Israel in Congress seemed just as liberated as Mr. Kerry was to let loose. “Secretary Kerry’s speech today was at best a pointless tirade in the waning days of an outgoing administration,” said Senator John McCain, Republican of Arizona. “At worst, it was another dangerous outburst that will further Israel’s diplomatic isolation and embolden its enemies. ” Representative Eliot L. Engel of New York, the top Democrat on the House Foreign Affairs Committee, called Mr. Kerry’s speech “gratuitous” and “wrong. ” “There doesn’t seem any purpose to this other than to embarrass Israel,” Mr. Engel said. “It just pained me to watch it. ” Democratic members of Congress who are closer to Mr. Kerry, a former senator, and the Obama administration were more measured. Many had been angered by Mr. Netanyahu’s decision last year to accept an invitation from the   House to deliver a speech in the Capitol, where he confronted the president over the Iran nuclear accord. Yet even these Democrats  —   eyeing the arrival of a Republican    that has vowed strong support for Israel  —   left little doubt that they were parting ways with Mr. Obama on the substance of the United Nations resolution. Senator Bill Nelson of Florida, who is facing   in 2018, said he knew why Mr. Kerry was frustrated over the settlements, which he called an “impediment toward a negotiated   solution. ” But he was quick to note that he was among the 88 senators who signed a letter months ago opposing the sort of United Nations resolution on Israel that the Security Council approved last week. In France, Britain and Germany, Mr. Kerry’s speech was greeted with more   support. Senator Nathalie Goulet, vice president of the Foreign Affairs Committee in the French Senate, said Mr. Kerry “is right, he is absolutely right. ” “The more there are settlements,” she said, “the less it is likely there will be a   solution. But nobody ever dares condemn Israel. There is a double standard that nourishes the propaganda of the terrorists. ” In a statement, the German foreign minister,   Steinmeier, praised Mr. Kerry’s speech as a “passionate and deeply convincing” defense of “the only credible way” to solve the issue: a   solution. British officials said they regarded Mr. Kerry’s speech as a thoughtful summary of longstanding British and European concerns about the direction of Israeli politics. Britain and France, both members of the Security Council, voted for the resolution on settlements, and France has been extremely active in pressing for a kind of peace conference, to which the Israelis have objected. In the Arab world, analysts said the Obama administration should have spoken out sooner. “At the last five minutes of the hour, apparently Kerry and Obama are showing some courage to stand up to Israel, but it is coming too late in the game,” said Abdulkhaleq Abdulla, a professor of political science in the United Arab Emirates. “It is after the fact. They should have shown this amount of political courage four years ago, if not eight years ago. ” But the Palestinian issue today is not as central as it once was in the wider Arab consciousness. “Arab countries have sociopolitical problems that trump the Palestinian cause,” said Ziad A. Akl, a senior researcher at the Ahram Center for Political and Strategic Studies in Cairo.'"}, "time": 1742628508.4503734}