{"duration": 0.11922335624694824, "input_args": {"text": "'In late July, The American Conservative ran an interview with J. D. Vance that drew so much traffic it briefly crippled the central nervous system of the magazine’s website. The interviewer’s last line implored readers to have a look at Mr. Vance’s publishing debut, “Hillbilly Elegy: A Memoir of a Family and Culture in Crisis. ” Ever since, his book has hovered at high altitude on Amazon, seldom dipping below No. 10. After reading “Hillbilly Elegy,” you can easily understand why. This is a historically peculiar election cycle, boisterously disrupted by outsiders, one of whom found the perfect host body in the Republican Party and became its presidential nominee. An investigation of voter estrangement has never felt more urgent, and we’re certainly not getting one from the lacquered chatterers on the boob tube. Now, along comes Mr. Vance, offering a compassionate, discerning sociological analysis of the white underclass that has helped drive the politics of rebellion, particularly the ascent of Donald J. Trump. Combining thoughtful inquiry with firsthand experience, Mr. Vance has inadvertently provided a civilized reference guide for an uncivilized election, and he’s done so in a vocabulary intelligible to both Democrats and Republicans. Imagine that. On the checklist of modern privilege, Mr. Vance, 31, has the top four in the bag: He is white, male, straight and Protestant. But his profile is misleading. His people  —   hillbillies, rednecks, white trash, choose your epithet (or term of affection, depending on your point of view)  —   didn’t step off the Mayflower and become part of America’s ascendant class. “Poverty is the family tradition,” he writes. His ancestors and kin were sharecroppers, coal miners, machinists, millworkers  —   all     occupations that over the years have vanished or offered diminished security. Mr. Vance was raised in Middletown, Ohio, a   steel town filled with Kentucky transplants, which at one point included his Mamaw and Papaw  —   in newscaster English, that’s grandma and grandpa  —   who moved there shortly after World War II. Though the couple eventually managed to achieve the material comforts of a   life (house, car) they brought their Appalachian values and habits with them. Some were wonderfully positive, like loyalty and love of country. But others, like a tendency toward violence and verbal abuse, were inimical to family life. Papaw was forever coming home drunk. Mamaw, “a violent nondrunk,” was forever tormenting him, whether by serving him artfully arranged plates of garbage for dinner or dousing him with gasoline. All this guerrilla warfare affected their children. Mr. Vance’s mother was an empress of instability  —   violent, feckless, prone to hysteria. A long stint in rehab couldn’t shake her addiction to prescription narcotics (she’d later move on to heroin). She spun through more boyfriends than this reader could count and at least five husbands. The only reason Mr. Vance made it out in one piece is because his grandparents eventually reconciled, becoming his unofficial guardians. (He also spent a terrifically affirming four years in the Marines.) Mamaw was especially encouraging. She was tough as snakeskin,   as a mobster and filled with love. In a town where many children don’t finish high school, she raised a grandson who managed to graduate from Ohio State University and Yale Law School, defying skyscraping odds. “Hillbilly Elegy,” in my mind, divides into two components: the family stories Mr. Vance tells  —   most of which are no doubt better experienced on the page than they were in real life  —   and the questions he raises. Chief among them: How much should he hold his hillbilly kin responsible for their own misfortunes? In Mr. Vance’s estimation, the answer is: a lot. Economic insecurity, he’s convinced, accounts for only a small part of his community’s problems the much larger issue is hillbilly culture itself. Though proud of it in many ways, he’s also convinced that it “increasingly encourages social decay instead of counteracting it. ” His frustration with the nonworking white poor is especially acute. He recalls being a cashier at a Middletown grocery store and watching resentfully as his neighbors, who had creatively gamed the welfare system, jabbered on their cellphones as they were going through the checkout line. He could not afford a cellphone. “Political scientists have spent millions of words trying to explain how Appalachia and the South went from staunchly Democratic to staunchly Republican in less than a generation,” Mr. Vance writes. He suspects those cellphones have a lot to do with it. “I could never understand why our lives felt like a struggle while those living off of government largess enjoyed trinkets that I only dreamed about. ” Time and again, Mr. Vance preaches a message of tough love and personal responsibility. He has no patience with an old acquaintance who told him he quit his job because he hated waking up early, only to take to Facebook to blame the “Obama economy. ” Or with a former   at a tile warehouse who missed work once a week though his girlfriend was pregnant. Squint, and you’ll note the incendiary nature of Mr. Vance’s argument. It’s always treacherous business to blame a group for its own misfortunes. Certainly, an outsider cannot say what Mr. Vance is saying to his kin and kind. But he can  —   just as President Obama can say to fellow   “brothers should pull up their pants,” as he did on MTV. The difference is that President Obama believes poverty, though it may have a cultural component, is largely a structural problem, one the government can play a large role in fixing. Mr. Vance, a conservative, takes a far dimmer view. Whether you agree with Mr. Vance or not, you must admire him for his   confrontation with a taboo subject. And he frames his critique generously, stipulating that it isn’t laziness that’s destroying hillbilly culture but what the psychologist Martin Seligman calls “learned helplessness”  —   the fatalistic belief, born of too much adversity, that nothing can be done to change your lot. What he’s really writing about is despair. Never is Mr. Vance more aware of this pessimism and estrangement than when he leaves for Ohio State University. He’s plumped with hope his neighbors, left behind, feel its opposite. “There was something almost spiritual,” he writes, “about the cynicism of the community at large. ” His friends and relations are convinced that the media lies. That politicians lie. That the military, an institution they revere, is fighting two fruitless wars. Universities feel “rigged” and inaccessible job prospects are slim. For what purpose do you live under such circumstances? When the stanchions of your life have sunk into the muck? Mr. Vance doesn’t have all the answers. But he’s advancing the conversation.'"}, "time": 1742561704.2272806}