{"duration": 0.09772586822509766, "input_args": {"text": "'We are the Anunnaki’s sons, and have been given a push in our development by those minor gods. We are not alone in the Universe, and there exists Entities that are more advanced than us. Those Entities have been watching us and visiting periodically our Planet. All our Religions, that in a certain way teach basically the same, need to be reformulated, as in some cases we have been calling god some of those higher Entities\\n\\nAll that, and much more, is engraved in thousands of tablets that have survived for more than 5.000 years, preserved in the best possible way, as burnt clay! Those clay tablets were cooked by the fire of the library of Nineveh, and by that abnormal fact, were then given an extra resistance to endure time!\\n\\n\\nThe big question is then, who is the Anunnaki’s God? The real Universal God? \\n\\nThe Real Universal God is a much more abstract one and is the togetherness of all Universal Consciousness. The Holly Spirit, the togetherness of all consciousness, is the Universal God, but by being such an abstract idea people have tended to forget, and revert to more humanized types of gods.\\n\\nQuantum Theory tells us than man go on creating his own world, and in it resides the source of man free will.\\n\\nWe can by our conscience influence the way the wave will collapse. Everything being waves means we are all part of a Universal net, where anyone influences everyone! Evil is a man’s creation. The USA Military and economic cartels have kept some very important discoveries, particularly in the field of Energy generation, hidden from us, for more than 40 years.\\n\\nTo have no doubts about this so delicate and important subject, read the book that Steven M. Greer just published, called “Disclosure”. Steven is a M.D. Doctor, working in the emergency room of an American Hospital, who since 1993 has dedicated most of his time trying to force the American and other Governments to disclose all the facts they have hidden about Human contacts with Alien entities. \\n\\nAfter reading his last book, you will be terrible scared, but deeply convinced that something very big and important has been kept hidden for too long, and so well hidden that even some American Presidents knew very little about it!\\n\\nThe late President Eisenhower in his last speech to the Country, in January 1961, alerted about the dangers of the “huge industrial and military machinery of defense”. This machinery does not respect anyone, not even the USA President, who they feel is a transitory person, while they are permanent ones. They have created a real perfect secret environment, where no one has the vision of the global, and neither the capacity to unblock the system.\\n\\nThis covert program is so well protected that today, there is not in the USA anyone capable to give an order to disclose it!\\n\\nUnbelievable as it may be, one of the reasons why the secret has been so well kept, is that today it is hard to find who can reveal it, or who has the key to open the vaults of the secret! Its control has run out of the governments and no democratic institution has the power, or knowledge, to control it. The biggest reaction to the disclosure of such a secret comes in the first place from the political power, which is dead scared of the consequences such world socio-economical changes will generate\\n\\nMaybe we can keep this secret till this generation dies, but no doubt we will transmit a moribund planet to our sons and all futures generations. The consequences of avoiding the problem are too high to risk.\\n\\nThe Earth is becoming polluted beyond repair, with 6 billion people wishing to have access to all modern amenities; our fossil energies will be depleted in no more than 20 years. So, by now we know who we are, who re-made us, or gave us a push in the evolution scale, and who those so funny and fierce gods, we were for so long mistook with the real God. \\n\\nWe also have now an idea how the Churches should be reformulated in order as to be able to keep having a place in this new society. We know that certain knowledge, given to us by Entities from another planet, should be soon disclosed, as with it we still can avoid the Earth destruction by pollution and fossil energy exhaustion. We have in our hands the ways to leave to our sons and grandsons a better and cleaner world, and just because of such an egoistic scare, we have no right to cowardly, like Nero enjoying the sight of Rome in flames, keep just for ourselves the last days of our Planet Earth.\\n\\nWe know that to arrive safely to the end, we have to be very cautious and follow a very narrow way The Universe has plenty of time for itself, and if we fail, others will win and pass the bridge safely. The end result is in our hands.\\n\\nAs Neil Freer says in “God Games”:\\n\\n“We are entering now the end game phase!”\\n\\nLocklip \\nSOURCE '"}, "time": 1742563859.4281306}