{"duration": 0.07861065864562988, "input_args": {"text": "'The concept of owning backyard homesteading has been steadily increasing in popularity over the last decade. As people–particularly those in urban areas–have become more knowledgeable about sustainability and ecological living, backyard chickens in particular have become a kind of mascot for the particular lifestyle. It’s affordable, funky, and fun to raise chickens, but this practice is not without some risks.\\nLive poultry, such as chickens, ducks, geese, and turkeys, often carry harmful germs. This year there have been several reported cases of Salmonella spreading via backyard chickens by the CDC . Eight different states are reporting Salmonella outbreaks linked to backyard chickens.\\nThese germs naturally live in the intestines of poultry (and many other animals). Salmonella germs therefore exist in their droppings and on their bodies (feathers, feet, and beaks) even when the birds appear healthy and clean. The germs can then easily get on cages, coops, food dishes, hay, plants, and soil in the area where the birds live and roam. Germs can then pass onto the hands, shoes, and clothes of people who handle the birds or their eggs. While it usually doesn’t cause the birds to be sick or show signs of infection, Salmonella causes serious issues when it is passed on to people. It’s not a matter of keeping your chicken coops clean or purchasing “healthy” chickens. Even organically fed poultry in spotless coops can have Salmonella and there is really no way of knowing which birds have it.\\nIs Salmonella Serious? Salmonella infection is no joke: it can cause serious intestinal distress with symptoms including diarrhea, vomiting, fever, and abdominal cramping. If the symptoms are severe enough, an infected person will require hospitalization. Babies and children under the age of five, pregnant women, the elderly, and people with immune deficiencies are more likely to have serious symptoms. If the infection goes untreated, Salmonella can even spread from the intestines to the bloodstream, which leads to the infection traveling rapidly to other places in the body. A course of strong antibiotics and observation by a doctor is then necessary. In rare cases, if left untreated Salmonella can even lead to death.\\nHow To Avoid Salmonella infection The number one way to avoid Salmonella infection is to always wash your hands with soap and warm water after handling a chicken or anything that may have been in contact with chicken droppings. You should also cook any collected eggs thoroughly and be present when small children are around poultry to ensure they do not touch their hands to their mouths without hand washing, etc. In fact, if your children are under five years of age, they should not handle chickens or their eggs at all (the same goes for anyone over 65 or anyone with a compromised immune system).\\nIt should go without saying, but never let the chickens into your home, especially not into your kitchen or areas where food is prepared. You also don’t want to eat or drink anything near the areas where you are minding your chicken coop. And chickens are adorable, but limit cuddling and never kiss them.\\nHow to Treat Salmonella If you do contract Salmonella and you are an adult with an otherwise healthy immune system, you should be fine in a week or two, though you will feel pretty miserable while the infection runs its course. (If you are in the compromised immune system category, your doctor might prescribe antibiotics and keep you in the hospital where you can be observed.) Make sure to contact your doctor if your symptoms seem to be worsening or if you have a high fever. \\nPamela Bofferding is a native Texan who now lives with her husband and sons in New York City. She enjoys hiking, traveling, and playing with her dogs.\\nThis information has been made available by Ready Nutrition \\nOriginally published November 1st, 2016 How – and Why – You Should Make Your Own Peanut… Oh, Nuts! Another Nut Butter Recall – This Time, in… Sustainable Essentials: 8 Necessary Items for Raising Baby… Upcoming Health Crisis? 4th Incident of Superbug Gene Found… Shocking Photos: This is the Chicken That You Feed Your… '"}, "time": 1742564017.1028585}