{"duration": 0.08284354209899902, "input_args": {"text": "'When Jeff Hornacek took the job as the Knicks coach last May, he did so with eyes wide open. He was not oblivious to the dysfunction that has been a part of the organization for years. He expected some controversy or another with the Knicks. Roughly nine months into his tenure, the team has not fallen short of Hornacek’s expectations. “It’s lived up to the billing,” he said Wednesday before the Knicks fell,   to the Los Angeles Clippers. “It’s been something out here. ” But even Hornacek could not have expected that the game that night would dissolve into a   circus. While a feud continues to stew between the Knicks president Phil Jackson and the team’s top star, Carmelo Anthony, amid   struggles, their game ceded the spotlight Wednesday night to a courtside fracas. Charles Oakley, the voluble but beloved former Knicks stalwart, was arrested after getting into an altercation with security guards midway through the first quarter. Oakley was removed from Madison Square Garden and handcuffed. Oakley was sitting courtside, in an aisle seat in the first row of the section near the Knicks’ bench. Accounts of his behavior varied widely. According to some spectators seated nearby, he had been calm early in the game. He took a photograph with Felice Bergman, a fan with season tickets several rows higher. James L. Dolan, the Knicks’ owner, with whom Oakley has a contentious relationship, sat nearby, but several spectators said they did not see Oakley exchange any words with Dolan or try to provoke him. But they did see Oakley exchanging glances with a security guard who was standing several feet away. Oakley seemed to utter something to the guard when he walked by, according to T. J. Veenstra, who was sitting behind Oakley. A guard soon came over to Oakley and asked him to leave. Oakley asked why. “He just couldn’t understand why,” said Matthew Barbara, who sat a few rows up from Oakley. “We didn’t see him throw a punch or do anything. He wasn’t nasty to any of the people behind him. We’re trying to figure out what happened. ” Oakley was soon surrounded by a phalanx of guards, as John McEnroe, the former tennis champion, stood behind them on the court watching. As they tried to remove Oakley, he pushed one guard twice before being restrained and taken away. The game, which was still in its early stages, stopped as players from both teams watched the commotion. As he was being led out, the crowd chanted: “Oakley! Oakley!” Knicks guard Derrick Rose later said: “That was the weirdest. I didn’t know what was going on. ” The police said Oakley had been charged with three counts of   assault and one count of criminal trespass, all misdemeanors. He was released with an appearance ticket. The Knicks, in a statement, said Oakley had behaved in a “highly inappropriate and completely abusive manner. ” But fans sitting nearby said they did not feel that was the case. “Nothing he did rose to the level of what happened,” Jamie Vitiello said. “They overacted. ” The episode was a distraction from another Knicks quarrel. The previous day, Jackson had posted a message on Twitter that seemed to endorse a Bleacher Report story painting Anthony as a star who did not have a sufficient will to win and who was more interested in building his brand and his own statistics. It was another shot in a feud between Jackson and Anthony that has persisted all season. After the game, Anthony was asked if he still trusted Jackson. “I did say that,” Anthony said, adding: “I trust the process. ” Anthony and Jackson have met twice to calm the waters. In December, Jackson said Anthony was a   on offense. In January, Charley Rosen, a longtime confidante of Jackson’s, wrote a column on FanRag Sports that said Anthony had “outlived his usefulness in New York. ” And for the last several weeks, Anthony has heard his name in trade rumors as the Knicks have reportedly tried to trade him, to teams including the Clippers. Anthony, however, has a   clause in his contract and has not indicated that he wants to leave the organization. Jackson, however, did try to play peacekeeper in the Knicks’ other contentious situation on Wednesday. After Oakley was taken away from his seat, Jackson rushed out to the tunnel to try to calm him. But Oakley continued to fume as he stood outside the court with his hands in cuffs and guards surrounding him. “I didn’t do nothing,” he said, mixing in expletives. He said Dolan was responsible  —   although he did not say for what. Oakley has had a conflicted relationship with the Knicks. He was a fan favorite during his 10 seasons with the team. He was known for his rugged and physical style and helped take them to the 1994 N. B. A. Finals. Yet, he has been exiled over the last few years after a falling out with the organization. While many of his former teammates returned to Madison Square Garden, Oakley had not. “The boss don’t like me,” Oakley told The New York Times last fall. He said he has tried to meet with Dolan but has been rebuffed. “I mean, I had at least 15 people try to set up a meeting,” Oakley said. “He won’t meet. I want to sit down to talk to him. I want me and him in a room. And lock the door. Lock that door!” On Wednesday, however, they shared an arena  —   one that had once been the setting for Oakley’s glory days. When he was eclipsed by security guards, Doc Rivers, the Clippers coach and a former teammate, immediately recognized him at the center. “That was tough to watch,” Rivers said.'"}, "time": 1742564503.0431318}