{"duration": 0.06348180770874023, "input_args": {"text": "'Outgoing White House Chief of Staff Denis McDonough declined to call   Donald Trump “legitimate” when questioned by CNN’s Jake Tapper on State of the Union on Sunday morning. [McDonough would only say that President Barack Obama considered Donald Trump’s election “freely elected. ”  He added that the Democrats that are boycotting Trump’s inauguration on Friday have “significant” concerns. Specifically, McDonough suggested that Trump’s election was influenced by Russia. He also suggested Trump could allay those concerns by “reaching out” to Democrats who refused to attend the ceremony. The following exchange took place: Tapper: There are now at least eighteen House democrats who are boycotting the Trump inauguration. Does President Obama think that’s appropriate, or do they think, does he think they should follow his lead and attend for the sake of honoring the office and the peaceful transfer of power? McDonough: Well, the president has made very clear since the election that we should do everything in our power in this transition period to make sure that the next president and his team are up and ready to go. In fact, on Tuesday night in a speech he called him the “freely elected” President of the United States. So that’s the charge that we have taken. By the same token these Democrats and others have pointed out that they’ve got a significant concerns. And we found some of those concerns  —   the intelligence shows that the Russians did intervene, and they did intervene with the purpose of helping one candidate, and hurting the other. So these are by no means, uh, trivial concerns. So my hope would be that the   will reach out to somebody as consequential and somebody who is such a leader as John Lewis, who has done so many things over the course of his life, to try to work this out. And hopefully it’s not just reach out to him, but pursue some of the policies that Mr. Lewis has literally fought, bled, and gone to jail for over the course of his remarkable life. And that would be that kind of thing that would not only send a message to the American people that we’re prepared to work together, but would also sent a message to the Russians that we are united, their efforts to divide us, to weaken us, to advance their own interest at the expense of ours, are going to fail. McDonough was referring to the spat between Trump and Rep. John Lewis ( ) who recently called Trump “illegitimate” because of a “conspiracy” by Russia. (Trump responded by questioning Lewis’s commitment to his district.) Tapper followed up to clarify whether President Obama considered Trump “legitimate”: Tapper: Just to be clear though, President Obama thinks that   Trump is legitimate. McDonough: The President has made very clear that he believes that he is the “freely elected” president. He will be inaugurated on Friday, and he will come into office hopefully strengthened by the kind of transition that we’ve tried to run in this White House. Tapper followed up by asking McDonough whether, given Trump’s own efforts to question Obama’s legitimacy with the “Birther” theory, “should put this away, this whole idea of legitimate, illegitimate. ” McDonough declined: “The president’s not going to get into the middle of this right now. ” Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742563965.1427207}