{"duration": 0.054834604263305664, "input_args": {"text": "'At a Donald Trump rally in North Carolina, a proud Ginger Glover waved a “Lyin’ Hillary Doll” with a special edition noose on it. \\nWatch a clip with Glover at the Wednesday rally here via NBC News : \\nGlover said the noose was her way of making a point that Hillary Clinton should be “incarcerated at the very least,” but when asked said she doesn’t think Clinton should be killed. \\nYet her employees put the noose on the doll for her and she brought it out in public and waved it around. For “effect.” \\nWhere is all of the Trump rallies’ violent rhetoric and imagery going? \\nDonald Trump seems to attract people who are angry and want someone to blame. \\nThe Washington Post did an incredible story on Melanie Austin, a Trump supporter who said Trump sees the world like she does. She realized this days after she had been injected with something intended to “calm” her, after she was involuntarily committed for homicidal ideation against President Obama. \\nThe first time she had seen him, at a rally in June, she was just beginning to realize how many people saw the world the way she did, that she was one among millions. At the time, her hips were still sore from a series of injections intended to calm her. She had gotten them in February, during a difficult time in her life, when she had been involuntarily hospitalized for several weeks after what she called a “rant,” a series of online postings that included one saying that Obama should be hanged and the White House fumigated and burned to the ground. On her discharge papers, in a box labeled “medical problem,” a doctor had typed “homicidal ideation.” \\nDonald Trump and the alt-right, and indeed way too many elected Republicans, have already pointed these folks at Hillary Clinton and Barack Obama as Evil People Who Must Be Harmed. When you attract unstable people who are easily manipulated out of anger and fear and then direct them to harm someone, as Trump and his advisers have done suggesting Hillary Clinton might be shot and saying she should be executed with a firing squad, you are responsible for inciting violence. \\nThings are not going well for Trump supporters, and even buoyed as they are with unscientific online polls and delusions fed by the alt-right media and Fox News, they smell defeat. \\nPerhaps that’s not connected to this specific woman who brought a Hillary Clinton doll in a noose to wave at a Trump rally last night, but it is a trend we’re seeing in general – angry Trump fans using more and more violent rhetoric. \\nThere will be more of this, not less, as Trump’s likely defeat becomes reality outside of tinfoil circles. \\nThis is political intimidation that mimics Donald Trump’s despotic promises to jail Clinton even though she’s been cleared of wrong-doing in all of the relentless Republican investigations into her activities as Secretary of State. \\nOf which there will be plenty more, Republicans promise us, should she win — because just like the Trump camp doesn’t want you to vote, Republicans only want government to work when they’re not in power. \\nThe potent mixture of tinfoil and rage is creating a toxic brew of violent fantasies and rhetoric among Trump supporters. \\nImage: Screencap from NBC News video'"}, "time": 1742564233.2542906}