{"duration": 0.08302879333496094, "input_args": {"text": "'In a special session held Monday evening, Austin Independent School District trustees voted   to adopt a sanctuary policy resolution that strives to “create a safe and caring learning environment so as to foster a culture of trust and respect” for all students “regardless of their immigration status or the status of their parents. ”[The school board’s resolution calls for “schools and classrooms” that are “safe, welcoming and inclusive places, noting “all children are entitled to a public education” based on the 1982 United States Supreme Court ruling, Plyler v. Doe, which protects   illegal immigrant minors from discrimination and requires that U. S. public schools educate these students. The document did not mention the federal Family Educational Rights and Privacy Act (FERPA) which prohibits schools from turning over student immigration status to federal agents, as Breitbart Texas reported.  The resolution states Austin ISD policy bars “any acts of discrimination or harassment, based on race, color, religion, sex, gender, gender identity, gender expressions, sexual orientation, national origin, disability, and age. ” The district says it embraces equity, diversity, and inclusion, accomplished through named supporting programs like Whole Child, Every Child,” part of the Whole Child approach to “improve each child’s cognitive, physical, social, and emotional development” “No Place for Hate,” an   League (ADL) campaign to combat bigotry and celebrate diversity   behavioral health centers and Social and Emotional Learning (SEL) which promotes the   and   competencies often associated with the public education reform movement. After the unanimous vote, trustee Paul Saldaña told reporters he wished Austin ISD acted sooner but crafting a resolution was a step in the right direction. He said: “We still have a lot of work to do to reassure our families that coming to school is safe. ” Earlier Monday, Austin ISD Superintendent Paul Cruz issued a statement: “We are unwavering in our support of students, families, and staff and want to reassure them that the district’s commitments have not changed. ” KVUE reported he said: “I fully support our teachers, our principals and our staff members in creating safe learning environments for all of our students. ” Austin ISD’s online “your rights, immigration, and resources” links to the district’s refugee support office, a “hub for refugee and asylee students and their families currently enrolled” or seeking to be enrolled in the district’s schools. They offer family support services like translation and interpretation, school registration assistance, social and emotional support, plus staff and community training. Reportedly, more than 20, 000 Austin students skipped school last Thursday to protest a “Day without Immigrants. ” Breitbart Texas reported the truant protesters rallied against recent U. S. Immigration and Customs Enforcement (ICE) raids where officials arrested violent criminals and people who sexually assault children. Education Austin, the school district’s labor and teacher union affiliated with the two largest teacher unions in the nation, the National Education Association (NEA) and the American Federation of Teachers (AFT) plus labor union   called on Austin ISD to take a stronger stand on behalf of illegal immigrants. They provided 3, 000 of their teacher union members with flyers for students on their rights when faced with dealing with an ICE agent, according to the Austin  .  Last week, the state’s largest school district, Houston ISD, adopted a sanctuary policy which reaffirmed support for illegal immigrants impacted by any state and federal travel bans, offered a safe haven for students, families, and employees illegally in the United States. In late December, the El Paso border school district declared sanctuary status. San Antonio ISD inches closer to approving a similar resolution. Follow Merrill Hope, a member of the original Breitbart Texas team, on Twitter.'"}, "time": 1742561972.4394166}