{"duration": 0.04449200630187988, "input_args": {"text": "'Videos Malala Announced That She Plans To Become Prime Minister Of Pakistan At a conference this month in the United Arab Emirates, Malala announced that she intends to one day be the prime minister of Pakistan. | November 1, 2016 Be Sociable, Share! Malala Yousafzai gestures as she speaks to an audience during a discussion of her book, “I am Malala” hosted by the John F. Kennedy Library and held at Boston College High School Saturday, Oct. 12, 2013, in Dorchester, Mass. (AP Photo/Jessica Rinaldi) \\nMalala Yousufzai is a remarkable young woman who has made headlines and is known globally for the brave work she does in Pakistan, her home country. Her fight for the right for everyone to have a proper education, especially women, has put her life at risk many times and she even survived an assassination attempt where she was shot in the head. \\nWhen she was just 17, she won the Nobel Peace Prize and her book, I Am Malala, is a national bestseller. Now, at the age of 19, she is still working harder than ever to improve education in both Pakistan and other countries worldwide. One of her most recent moves was opening a school for refugee girls aged 14-18 in Lebanon, on the border of Syria. \\nAt a conference this month in the United Arab Emirates, Malala announced that she intends to one day be the prime minister of Pakistan. She said that when she grew up, women were really only allowed to be doctors, teachers, and housewives. However, her education and activism has helped her see the world and her place in it different. “When I saw women role models, it broadened my vision. I saw Benazir Bhutto as a woman leader [who was] twice the prime minister of Pakistan. I heard about women athletes, women astronauts, women artists, women entrepreneurs … It allowed me to recognize the potential that I had, and that I can have as a woman, to achieve anything in my life,” she said. “My dream changed from becoming a doctor to becoming the prime minister of Pakistan.” It may seem prestigious to be a doctor as a female in Pakistan, which it certainly is, the job does come with strings attached. Though the huge majority of medical students are female, only 23 percent of registered doctors are women. This is because being a doctor or even in medical school is a big selling point for marriage proposals, so the majority of women wind up getting married and not working as doctors. The ratio of medical students and their propensity for excelling more than their male counterparts is likely culturally-driven as well. One fifth-year medical student gave his opinion on the issue: “Boys go out, hang out with their friends,” he said. “Girls can’t go out as much, so they stay at home and rote-learn.” Malala can truly do anything she sets her mind to, whether it be going to medical school, becoming prime minister , or continuing with her activist efforts. This young woman has so far stunned the world into listening what she has to say as she raises awareness about what a lack of education can do to women in hers and other countries. Education for girls is necessary to improve the world and the quality of life for people everywhere, and Malala will not rest until significant changes are made to include girls in school. This work by True Activist is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike International License.'"}, "time": 1742562016.8086045}