{"duration": 0.21097517013549805, "input_args": {"text": "'Share on Twitter \\nOn Tuesday night, an interview between Fox News host Megyn Kelly and Former House Speaker Newt Gingrich got intense in a hurry. \\nAfter Kelly referenced Trump as a “sexual predator,” Gingrich fiercely accused her of “using language that’s inflammatory that’s not true,” adding : \\n“You are fascinated with sex and you don’t care about public policy! That’s what I get out of watching you tonight!” \\nIf viewers were fired up by the heated exchange, a tweet sent out by the Trump campaign\\'s social media director Dan Scavino only poured fuel onto that fire: . @MegynKelly made a total fool out of herself tonight- attacking @realDonaldTrump . Watch what happens to her after this election is over. — Dan Scavino Jr. (@DanScavino) October 26, 2016 \\nWhile it\\'s not explicitly clear what Scavino meant by “watch what happens,” the implications of his comment certainly didn\\'t go unnoticed. \\nAmericans quickly came down on both sides of the issue, with many rushing to Kelly\\'s defense in the face of the “threat”: @DanScavino \"Watch what happens to her?\" I\\'m no Kelly fan, but your campaign really isn\\'t learning from the whole \"threats vs women\" thing. — Dennis Perkins (@DennisPerkins5) October 26, 2016 . @DanScavino She does just fine after the election, I\\'m guessing. You vanish into obscurity. — Trey Graham (@treygraham) October 26, 2016 @DanScavino @megynkelly @realDonaldTrump You want to be a little more specific about that? Punk. — HarleyPeyton (@HarleyPeyton) October 26, 2016 \\nStill, there were plenty who agreed with Gingrich\\'s suggestion that Kelly was being biased: @DanScavino @megynkelly @realDonaldTrump I used to be a huge fan of Megyn Kelly but no more. Totally unfair to the frmr Speaker. — Scott Schulze (@payshel) October 26, 2016 @DanScavino @megynkelly @realDonaldTrump Send her to CNN. They need more Crooked dishonest journalists! — Trump Revolution (@DonaldTrump_Rev) October 26, 2016 @DanScavino @megynkelly @realDonaldTrump Why surprised?Kelly is a dumb puppet paid millions (thro that book deal?) just to attack DJT.Tragic — Maya Varma (@swargcoming) October 26, 2016 \\nSince early in the 2016 election cycle, there\\'s no doubt that Kelly and the Trump campaign haven\\'t seen eye-to-eye. \\nMore recently, it seemed that tensions had cooled between the GOP nominee and the Fox News host. If Scavino\\'s tweet is any indication, however, that may no longer be the story. '"}, "time": 1742562762.6981132}