{"duration": 0.06415987014770508, "input_args": {"text": "'By wmw_admin on November 4, 2016 “… And Someone’s Bones”– Milton William Cooper ( Behold a Pale Horse ) — Oct 15, 2016 \\nA few weeks ago, some media outlets reported a story about a Chinese man, Yang Qingpei, who brutally killed his parents over a domestic financial dispute, and then murdered seventeen additional people in his home village in a failed attempt to conceal the crime . Due to China’s strict gun control policies, he hacked his victims to pieces with a machete. China’s Xinhua state news agency has yet to release a complete list of victims, but our source within the secretive nation obtained shocking information that eviscerates the official story and proves that the nineteen murders were indeed committed to conceal a hidden motive. But it had nothing to do with a financial dispute. It had everything to do with silencing a potential Nibiru whistle-blower. \\nOne victim was Kum Hia Nao, a research assistant at the Chinese National Astronomical Observatory, part of the Chinese Academy of Sciences. According to usually reliable sources, Nao had worked at the country’s Five Hundred Meter Aperture Spherical Telescope (FAST,) and had been reprimanded twice for making inquiries about Nibiru, said to be a brown dwarf with seven orbiting planets on a near-collision course with Earth. Conflicting reports make it difficult to determine exactly when Nao learned about Nibiru, either before or after being assigned to the observatory. Regardless, he was courageous enough to discuss a taboo subject in a country that routinely executes citizens for speaking out of line. His superiors obviously noticed his rebellious behavior, because, if all information is accurate, they concocted an elaborate plan to end his life and hide the motive for the crime. Unconfirmed reports, supported by two credible witnesses, place Barrack Hussein Obama and newly elected Nibiru Czar Victoria Newland at the observatory sometime during Obama’s recent trip to China, where he attended the G20 summit. \\nOn September 27, Nao visited his grandparents at a remote village in southwest China’s Yunnan Province. He had previously filed a ‘vacation report’ with his employer, detailing his travel times and locations, pinpointing exactly where he would be located. \\n“They could easily track his movements,” our source said. Many people in China are compelled to file a detailed report prior to taking a leave of absence from work. The slightest deviation has dire consequences. So if you file a report, you stick to it, like glue. Kum Hia Nao never stood a chance against anyone who wished to end his life.” \\nThe attacks happened on September 30. Nao and his grandparents were enjoying a quite dinner of rice and minced meat when Yang Qingpei burst into the hovel and one by one slaughtered them with a machete, the assassin’s sixth, seventh, and eighth victims of the night. Yang Qingpei went on to kill an additional seven people in a calculated, murderous rampage that stunned a nation. \\n“Qingpei was no ordinary citizen,” our source said. “He was a highly skilled, highly trailed killer. What are the odds of an untrained person, armed only with a knife, killing nineteen people, many of whom were physically larger and stronger than he appeared.” \\nYang Qingpei, it turns out, served four years in The People’s Liberation Army Special Forces. He was also an expert in Kung-Fu. Fitting the puzzle pieces together, the logical conclusion is that he was contracted to carry out the brutal murders. He probably had no idea one his victims was a Nibiru scientist. \\n“It’s highly unlikely they told him anything about his victims,” our source said. “They probably said kill your parents, say it was over money, confess to it, we’ll get you off the hook, and you’ll be handsomely rewarded down the line. They gave him a list of people to kill, along with some random victims, and, sadly, Kum Hia Nao’s name was on that list.” \\nThis demonstrates that the United States is not the only country to silence, discredit, or murder potential whistle-blowers, and that, with the exception of Vladimir Putin and Fidel Castro, world leaders will try to prevent Nibiru disclosure, at any cost.'"}, "time": 1742628412.1574273}