{"duration": 0.12128567695617676, "input_args": {"text": "'Good morning.  Here’s what you need to know: •   Donald J. Trump is holding meetings with retired Gen. David H. Petraeus, Mitt Romney and Senator Bob Corker, chairman of the Foreign Relations Committee,  in the hunt for a secretary of state, a quest that has divided his loyalists. Mr. Trump drew criticism from across the political spectrum for suggesting without evidence that millions of people voted illegally. California’s top election official called Mr. Trump’s assertion “absurd. ” Mr. Trump also threatened the thaw with Cuba, which has just begun its official mourning for the longtime leader Fidel Castro. From new Israelis brashness to European politics to global markets, Mr. Trump’s election is shaping events around the world. _____ • New York, Los Angeles, Boston, Philadelphia and San Francisco are among the American cities that have vowed to fight the Trump administration’s promised efforts to deport illegal immigrants. Our profile of the  ’s chief strategist, Stephen K. Bannon, above, portrays a politically combative populist who has long courted politicians who share his worldview. New York’s Trump Tower, where the transition effort is focused, has been heavily fortified as a kind of White House North. _____ • Syrian government forces and Kurdish fighters took back large sections of   eastern Aleppo, a potential turning point in a grinding civil war. Their advance broke a   siege and sent thousands of people fleeing amid scenes of chaos and death. _____ • Chinese officials are moving to downsize the world’s largest Buddhist institute, razing houses and reportedly evicting around 1, 000 people from the center in Tibet. The government says it intends to improve infrastructure, but critics see the tightening control as Beijing’s latest effort to diminish the distinct character of Tibet. _____ • The World Trade Organization ordered the United States to end a special tax cut for Boeing meant to ensure that the aerospace giant would manufacture the wings for its new 777X jetliner only in the U. S. • The Standard Chartered bank is expected to begin staff cuts in Singapore and Hong Kong this week as it follows through on plans to eliminate 15, 000 jobs. • Japan releases monthly unemployment figures and household spending data. • Samsung Electronics said it would review whether to undergo a corporate restructuring amid pressure from investors. • The Organization for Economic Cooperation and Development said fiscal plans by Mr. Trump, along with China and Europe, would invigorate major economies, and lifted its global growth forecast for next year. • Chinese investors are rushing to invest in commodities, even obscure ones such as glass and garlic. • Here is a snapshot of global markets. • An    Somali student at Ohio State University was shot dead after he drove his car onto a campus sidewalk and emerged slashing with a butcher knife, injuring 11. Officials said they were trying to determine whether it was an act of terrorism. [The New York Times] • China is taking aim at NASA with heavy investment in its own space program. But it also hopes the funding will spur growth in the technology sector. [Bloomberg] • Prime Minister Najib Razak of Malaysia is coasting into this year’s assembly of the United Malays National Organization after weathering a financial scandal and ousting foes. [The Straits Times] • South Korea’s plan to require schools to use   textbooks fell victim to the rolling corruption scandal surrounding President Park  . [The New York Times] • Thailand’s Parliament may officially invite the crown prince to take the throne left empty since the king’s death in October. [Reuters] • Japan’s prime minister is still pushing the   Partnership through Parliament in a   effort to save the pact and his own political capital. [Xinhua] • A Japanese skating rink that had frozen 5, 000 sea creatures into its ice closed after just two weeks amid public horror. “Nothing but insanity,” one critic wrote. [The New York Times] • Nearly 200 professors in the United States appeared on a “watchlist” that claimed they advance “leftist propaganda,” stirring concerns about academic freedom. [The New York Times] • A map circulating on Facebook, showing the names and addresses of Jewish people in Berlin, deepened the debate about how Facebook should regulate content. [The New York Times] • After their 10th draw, Magnus Carlsen and Sergey Karjakin will finish the World Chess Championship in New York with a special tiebreaker on Wednesday. [The New York Times] • The NASA craft that has been circling Saturn and its moons for 12 years is entering its final months.  Cassini’s new orbit will be taking it over the planet’s north and south poles and then into a series of dives. It will return to slicing between the planet and its rings, before crashing into the clouds and immolating in September. • The space surrounding Earth has grown so clogged by spent rocket stages, inert satellites and other debris that some scientists fear low orbit could become unusable. But Mitsunobu Okada, a Japanese entrepreneur, believes he has a solution. His company, Astroscale, aims to track and intercept debris with its own satellites, preventing collisions with active spacecraft. • Back on terra firma, a new study of   in Tanzania found that the tribe, which engaged in regular activity every day, showed extraordinarily good cardiovascular health. The findings suggest that regular, if moderate, exercise may indeed be crucial to well being, even deep into old age. • Happy 117th birthday, Emma Morano. The world’s oldest person, she was born on this day in 1899. A relative quoted her as saying, “My word, I’m as old as the hills. ” As   programs have proliferated in cities around the world, a clear point of friction has emerged for bicycle commuters: How to they protect their fragile skulls? Many are unwilling to share helmets with strangers, because of germs and stuff. And carrying a helmet at all times can be a burden. Luckily, a selection of foldable helmets has emerged to help solve the problem. This month, one such product, the EcoHelmet, won the 2016 James Dyson award. A cheap, recyclable helmet made from cardstock paper, the EcoHelmet was designed by Isis Shiffer, who will receive $45, 000 to “further develop” her invention. The helmet uses a honeycomb pattern to diffuse the impact of a blow, and Ms. Shiffer has said that it is as safe as a standard polystyrene helmet. But if you’re unconvinced, there are other options. The Plixi helmet, from Overade, is more like a traditional helmet, and folds down to a more portable size. A collapsible option from a company called Closca has the added benefit of making you look like a character in a   epic. Helmets. org, a helmet advocacy program and nonprofit, has a handy list of foldable helmets, including whether they meet European and American safety standards. You can find that here. Jonah Engel Bromwich contributed reporting. _____ Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742563787.4889042}