{"duration": 0.06309032440185547, "input_args": {"text": "'The Deep-Programs of your Conditioned Mind are Living your Life Nov 4, 2016 3 0 \\n“The first gift of your conscious alertness is when you discover, that instead of you, the deep-programs of your conditioned mind are living your life” Frank M. Wanderer \\nThe society and culture in which you have grown up programmed those fixed patterns of the mind into you, and your identity who you are and what your job is in this world, is based upon those patterns. What need we know about this fixed conditioned mental patterns? The fixed patterns of your mind are individual, since they reflect the expectations of the particular environment in which you have been brought up. The expectations usually influence you unconsciously, almost like automatic deep programs of the mind. These systematic patterns of thoughts, programmed into you by your parents and teachers are deeply embedded into your mind and subconscious by the psychological mechanisms of identification, and they automatically surface every now and then. These patterns strive to be self-sustaining, and they generate the work of mind. The result is the cobweb of thoughts with which you identify and that is how you live your life. As these in-depth conditioning have become a part of your mind in the course of your upbringing, a particular situation or person immediately activates them. You automatically put on the mask appropriate for the particular situation, tailored to the expectations of the situation or person. The fixed operational methods of the mind cannot be defeated by the works of the mind itself, that is, by effort, practice or your willpower. When a fixed mental pattern appears, all you need to do is watch how it works, what expectation activates it. But you do not need to fight it, you do not need to make any effort to neutralize it. There is only one remedy against them, and that is Sight, nourished by the deeper dimensions of Alertness , and the Sight will bring recognition to you. The power of Sight is that it reduces your identification with your mind, and places you back into your original state of existence: Oneness. When you see and recognize how your fixed mental patterns work, the energy supply they receive gradually dries up, since the energy that formerly supplied these patterns now supply the emergence of the deeper dimensions of Alertness in you. In this way, conditioned mental patterns gradually lose their power and they vanish. As a result, the work of the mind that might have appeared chaotic to you before become increasingly transparent. In this way, Consciousness and Presence will increasingly dominate your mind, and they will be manifested in longer and longer periods of silence. That is how the mind regains its original mission, and it will become a means by which Consciousness is able to express itself in the world of forms and shapes .'"}, "time": 1742562646.0153418}