{"duration": 0.11764907836914062, "input_args": {"text": "'SAN DIEGO  —   The last line of defense against the torrent of   untruths and outright fakery that make up so much of the modern internet is in a downscale strip mall near the beach. Snopes, the   website, does not have an office designed to impress, or even be noticed. A big sign outside still bears the name of the previous tenant, a maker of underwater headphones. Inside there’s nothing much  —   a bunch of improvised desks, a table tennis table, cartons of Popchips and cases of Dr Pepper. It looks like a   on the way to nowhere. Appearances deceive. This is where the muddled masses come by the virtual millions to establish just what the heck is really going on in a world turned upside down. Did Donald J. Trump say on Twitter that he planned to arrest the “Saturday Night Live” star Alec Baldwin for sedition? Has Hillary Clinton quietly filed for divorce? Was Mr. Trump giving Kanye West a cabinet position? And was Alan Thicke, the star of “Growing Pains,” really dead? All untrue, except for the demise of Mr. Thicke, which was easily verifiable. “Rationality seems to have fallen out of vogue,” said Brooke Binkowski, Snopes’s managing editor. “People don’t know what to believe anymore. Everything is really strange right now. ” That is certainly true at Snopes itself. For 20 years, the site was dedicated to urban legends, like the purported existence of alligators in New York City sewers, and other benign misinformation. But its range and readership increased significantly during a prolonged presidential election campaign in which the facts became a partisan issue and reality itself seemed up for grabs. One way to chart Snopes’s increasing prominence is by measuring the rise in fake news about the site itself. If you believe the internet, the founder of Snopes, David Mikkelson, has a longer rap sheet than Al Capone. He was supposedly arrested for committing fraud and corruption and running a pit bull ring. In the wake of a deal that Snopes and others made this month to start   for Facebook, new slurs and allegations poured forth. The underlying message of these spurious attacks is that the movement to   the internet is a   conspiracy whose real goal is to censor the right, and therefore must be resisted at all costs. “Smearing people just because you don’t like what they’re saying often works to shut them up,” Ms. Binkowski, 39, said. “But at Snopes you learn to grow a thick skin. I will always push back. At least until someone shows up at my workplace and kills me. ” Mr. Mikkelson, a former computer programmer, met his first wife, Barbara, in a folklore discussion group on the internet. They called their website Snopes in tribute to the venal family in William Faulkner’s novels. Their first group of posts, back in 1995, tackled questions about Disneyland, such as whether there really was a secret restaurant at the park. (There was.) It was a time when the nascent web was seen as a force that would deliver enlightenment and truth to all. Starting about two years ago, Snopes made an effort to professionalize itself. It added a dozen staff members just in time to become the   debunking site for an election full of venom. The number of unique users jumped 42 percent over 2015, peaking at nearly 2. 5 million the day after the election. Just about everyone at Snopes thought things would calm down after the votes were in. “The fake news wasn’t from Trump so much. It was from people who hated Hillary Clinton,” Ms. Binkowski said. “Once the election was over we figured it would go away. ” She scheduled a vacation, and thought she would spend more time writing about such things as how no one has a water bed anymore. Mr. Mikkelson, 56, went on a lengthy honeymoon in Japan and China. But the role of fake news and misinformation in Mr. Trump’s surprise win quickly reached a fever pitch, prompting questions about the extent to which Facebook, where many of these bogus stories were shared, had influenced the election. Reluctantly, the social media giant was forced to act. The plan is for Facebook to send questionable links to a coalition of   sites, including Snopes. If the links are found to be dubious, Facebook will alert users by marking stories with a “disputed” designation. Mr. Mikkelson, speaking from Washington State, declined to claim this new initiative was a potential turning point in the quest for truth on the internet, or even in the history of Snopes. “I said, ‘O. K. we’ll give it a try,’” he said. “It doesn’t really involve us doing anything we wouldn’t already be doing. ” As for Facebook, he thinks it had to do something but had few good options. Blocking content outright, for instance, would be a public relations minefield. Even when he is in this country, Mr. Mikkelson is a bit elusive. His voice mail box is full, but he is in no hurry to clear it out. In the wake of a contentious divorce from Barbara, he now owns half of Snopes. The other half is owned by the principals of Proper Media, a digital media firm. All of Snopes’s revenue  —   Mr. Mikkelson says he doesn’t know what it is  —   come from ads. Facebook is not paying for its services. Nor is the billionaire George Soros funding the site, although that is sometimes asserted in   stories. Mr. Mikkelson seems more amused than outraged by the spectacle that is the internet, even when it takes aim at him. “We don’t have any inflated sense of   at Snopes,” he said. “People are always telling us, ‘You’re deviating from your mission.’ My response is: ‘We don’t have a mission. We just do what we do. ’” But he conceded that something had gone wrong with the early utopian dreams for the internet. “Making everyone equal as an information source doesn’t work very well in practice,” he said. Then he laughed, something he does frequently. Ms. Binkowski, a former radio reporter who still freelances about border issues, thinks there is a mission. “Not to be ideological or Pollyannaish, but you have to believe this work makes a difference,” she said. “Otherwise you’d just go back to bed and drink. ” Although there are other benefits to working at Snopes: “I really like telling people they’re wrong. ” The Snopes writers generally take a   perspective on fake news. The practice itself they see as ancient. The difference now is that the stories circulate faster and people can make money spreading them, which gives its purveyors a whole new motivation. There is also a cultural shift, said Kim LaCapria, who lives on Long Island and writes many of the Snopes political posts. “It used to be that if you got too far from the mainstream, you were shunned for being a little nutty,” she said. “Now there is so much nutty going around that it’s socially acceptable to embrace wild accusations. No one is embarrassed by anything anymore. ” The remedy, she and Ms. Binkowski feel, is more traditional journalism. “People aren’t necessarily getting the media literacy they need, so they’re just kind of panicking,” Ms. LaCapria said. Mr. Thicke’s death underlined this. In addition to those asking direct questions, thousands of users searched Snopes for confirmation of the actor’s demise. “People think the death of a    from a heart attack must be a hoax. That is how muddy the waters are now,” Ms. LaCapria said. “They are afraid, even with such an easily verifiable thing, to trust anyone. ” But there are also those who trust too much, and they are a much larger group. The bios at the end of posts on Snopes are often whimsical, so Ms. LaCapria wrote that she got her job “due to an executive order unilaterally passed by President Obama during a secret,   session. ” A joke  —   but her own mother took it at face value. “You’ve known me for 36 years. Of course it’s not true!” Ms. LaCapria told her. “It’s very easy for us to be tricked, all of us. ”'"}, "time": 1742562125.8490965}