{"duration": 0.18579673767089844, "input_args": {"text": "'LEXINGTON, Va.  —   “It’s just indescribable,” Sally Mann, the photographer and writer, was saying. She stood in the kitchen of the home she built on her family’s farm with Larry Mann, her husband of 46 years, and erupted in tears. “I’m just trying to keep moving,” she said. On the large dining table were her haunting, evocative photographs taken over the years of the studio in downtown Lexington where her friend, the painter Cy Twombly, had worked. Twombly was born 23 years before Ms. Mann in this same small town in Virginia. In her intimate and elegiac images, some with just the play of light on the wall and floor of the emptied studio, after his death in 2011, it was hard not to feel an acute absence  —   not of one man but two. In June, while preparing an exhibition of these photos, Ms. Mann suffered a sudden and most devastating loss. Emmett, her eldest child, who had struggled with schizophrenia in adulthood, took his own life, at the age of 36. Now the Twombly catalog she is gazing at, and the show, called “Remembered Light,” opening on Sept. 22 at the Gagosian Gallery in Manhattan, are “suffused with grief,” she said. The name Sally Mann is inseparable from the indelible images of her children, Emmett, Jessie and Virginia, in their unfettered youthful play, sometimes naked, in the countryside. In her   memoir, “Hold Still,” published last year, Ms. Mann wrote that her family pictures  —   which in the early 1990s became engulfed in morality debates about the depiction of children’s bodies and judgment of Ms. Mann as a mother  —   could not be completely understood outside the context of this farm. The farm is remote and sylvan, with horses grazing alongside the winding drive, dogs underfoot and a menagerie of colorful birds in the greenhouse sharing a glass wall with the open dining area. A communal family space flows into Ms. Mann’s office, with a photograph on her desk of a young Twombly taken by Robert Rauschenberg when they were at Black Mountain College together in 1951. It leads into her studio hung with the familiar,   photographs of Emmett and his sisters in their childhood. “I never separated myself as an artist and a mother,” said Ms. Mann, 65, who has always found her inspiration close to home, “in what William Carlos Williams called ‘the local,’” she wrote in her memoir. In this local realm she has created photographs of lush Southern landscapes and studies of her husband’s body revealing the effects of his progressive muscular dystrophy. Her art and motherhood “were really intertwined,” she continued. “It wasn’t hard until I had to defend it. ” Inevitably, there will be a chorus that assigns blame to the mother “for everything,” she added. Ms. Mann has barely ventured off the farm since Emmett’s death. Focusing on the printing of her Twombly images grounded her during the torturous weeks of June. In late July she offered to take a visitor with her on a foray into Lexington, a tour of the markers in Twombly’s life, and, as it turned out, her own. Her first stop would be Walmart, where she said Twombly liked to sit on a bench outside. “One of the most urbane, sophisticated humans alive, he would just sit there and watch the people come out and look at the mountains,” she said. “He was fascinated. ” Ms. Mann’s kinship with Twombly, whose wry, mentorly presence is woven throughout her memoir, began with her parents. Her father, a country doctor in Lexington for many years, first invited Twombly, then a high school senior, to dinner in the  . As a hostess gift, the artist brought an abstract tabletop sculpture he had crafted from found wood and metal. (That 1946 sculpture was in the first room of Twombly’s 1994 MoMA retrospective.) Early patrons, her parents bought one of Twombly’s   and pencil paintings in 1955 for $150, a transaction that may have occurred on the street. Last year, a 1968 “blackboard” painting set a new auction record for a Twombly work, of just over $70. 5 million at Sotheby’s New York. When Twombly moved back to his hometown in 1993 from Gaeta, Italy, for six months each year, “we became friends and compatriots and companions and helpmates,” Ms. Mann said. That developed just as Ms. Mann was receiving both acclaim and backlash from critics for photographs of her children. She and Twombly  —   a regular at her Thanksgiving dinners  —   visited back and forth constantly and casually. A record of their admiration for each other as artists  —   and for the creative process  —   is captured in the new exhibition. A painter of grand, abstract canvases cascading with layers of graffitilike script or explosions of vivid color, Twombly set up his studio in the most pedestrian of storefronts in downtown Lexington. “It was crude as can be, drop ceiling with water stains,” Ms. Mann said of the space that had been the gas company headquarters and then an eye doctor’s office. At Twombly’s suggestion, she began taking pictures there in 1999. “Usually I’m so blinkered when I approach work, but these were done for fun,” said Ms. Mann, who thinks her work shares with Twombly’s a kind of Southern melancholy or “moldering decadence,” as she put it. She switched from her trademark     view camera to a more nimble digital camera, which she retrofitted with an uncoated antique lens to give the pictures a blinding radiance and flair. “Cy would be taking pictures, too,” she said, adding that he once pointed his little Polaroid into the reverse end of her view camera. “He taught me a lot. He was so loose and free and energetic. ” Ms. Mann’s earliest photograph in the Gagosian exhibition focuses on Twombly’s tidy lineup of paints, brushes and stained cloths in a spartan   room. “I had no idea what level of misrule and chaos it would turn into,” she said. Over the sequence, the space becomes densely populated with Twombly’s secondhand finds, including a plastic flamingo and ceramic frog, and white plaster assemblage sculptures, bathed in hazy light filtering through the Venetian blinds. Next, Ms. Mann wanted to visit the Antique Mall that she and Twombly frequented together. She walked through aisles of    and nodded to a deer’s head similar to one in her picture of his cluttered work table. “He just loved this kitschy stuff,” she said. “He had such a wide spectrum of embrace, from the sublime to the ridiculous. ” Looking at the images, John Ravenal, who organized her 2010 survey “Sally Mann: The Flesh and the Spirit” at the Virginia Museum of Fine Arts in Richmond, was struck by how Ms. Mann chose not to use her signature   collodion process, which typically gives her images a high degree of distortion and painterly sensuality. “I think that is really a sign of respect,” he said. “The careful focus on the contents, on the subject matter, is rich enough that it didn’t need this extra layer of abstraction. ” Twombly’s studio is now a shop called Old Lex Mercantile. The new owners led Ms. Mann to the back to see   drywall, removed during their renovation. She showed them her photographs of the same wall, intact, in the exhibition catalog. Nicola Del Roscio, director of the Cy Twombly Foundation and the artist’s longtime companion, recalled how Twombly painted a series by tacking a new canvas on top of older ones. He said that the artist appreciated the sounds of street activity and fragments of conversation that would trickle in to the studio. “He could not survive if he did not do a little trip every day around the countryside,” he said, whether strolling by the mansions of Lexington or making an excursion to Walmart. After Twombly’s death, Mr. Del Roscio asked Ms. Mann to photograph the interior of the artist’s home before its eclectic arrangements were packed up. They include one with an old master print on his mantel behind a framed sign saying “Street girls bringing in sailors must pay for room in advance. ” Today the sign graces Ms. Mann’s studio. Ms. Mann pulled up to the Lexington Restaurant, a diner where Twombly came for the grits and banter. “He would take really   art people from Europe here,” Ms. Mann said, adding that it was rumored he had left $10, 000 tips for waitresses. Eyeing an older waitress who might provide confirmation, she approached the counter and began chatting her up. A couple of minutes later, Ms. Mann exclaimed loudly, “Oh, of course you are!” Slipping back into the booth, Ms. Mann said that 40 years ago the waitress had “typed my master’s thesis in creative writing, and her daughter babysat for my kids. ” And yes, the rumor was true. At the diner, Ms. Mann brought up her son. “Emmett had three terrible brain injuries,” she said. He was hit by a car when he was very young, something she examined in her book. There were two other accidents in adulthood. “That’s when the schizophrenia took over,” she explained. “We don’t know if the injuries caused it, or exacerbated it, or if it was genetic. ” She felt he had been responding well to treatment, and the family was completely caught off guard by what happened. She asked if we could make a quick stop at Emmett’s house nearby, to retrieve a small bookshelf she wanted to keep. She steeled herself before entering the bungalow. Inside was just a small drift of household items piled to one side. Unflinchingly, she hoisted the humble shelf and walked it to her car trunk. On this day, as in her writing and through her view camera, she stared as squarely as she could, contemplating the passage of time and the transience of life.'"}, "time": 1742561708.565359}