{"duration": 0.12045812606811523, "input_args": {"text": "\"License DMCA \\nThere is a recurring concern in discussions about the economy that technology threatens the livelihood of large segments of the workforce. The exact mechanism varies. In one version, the robots will take all the jobs, leading to a massive surge in unemployment. A somewhat different version has the development of technology benefiting people with college and advanced degrees to the detriment of those with less education. In this story, the highly educated do well, while the less educated see stagnant or declining wages. \\nWhile the future may actually be one of continually rising inequality, it is important to realize that technology is not the culprit. It is not the technology that determines who gets the benefits of major innovations; it is laws that govern technology, which in turn are made by politicians. Specifically, the laws on patents and intellectual property more generally will determine whether advances in technology are associated with increasing inequality or broadly shared prosperity. \\nStarting with the robot story, we are supposed to be concerned that robots will replace workers in factories and warehouses. Robots can do the job better and cheaper. We will also have self-driving cars, trucks and buses. This will displace millions of additional workers and radically reduce the demand for cars. (We can summon a car to take us from point A to point B when we need it. There is no reason to have a car rusting in front of our house.) \\nThat's the displacement story, but suppose that robots are extremely cheap. There is no obvious reason they shouldn't be cheap. After all, we probably won't need any rare materials to make robots. And presumably robots could be mostly manufactured by other robots, so the labor involved wouldn't be expensive. In this case, we should be able to buy a robot at our local hardware store or from our favorite internet retailer for a few hundred dollars. - Advertisement - \\nOnce we buy the robot, we can have it clean our house, cook our food, mow our lawn and do all sorts of other tasks that we may not want to do ourselves. We can probably even save on our food budget by having the robot plant and tend a vegetable garden. If robots are doing all this work for us and we no longer need to buy and maintain a car to meet our transportation needs, we should all have a high standard of living. \\nBut suppose that patents and related protections keep the price of robots high. And instead of technology driving down the cost of transportation with self-driving cars to almost nothing, patent monopolies allow the top executives and shareholders of Uber or its equivalent to get very rich at the expense of the rest of the population. In that scenario, most people may not benefit to any great extent from technology. In that case, robots may take our jobs, but instead of the benefits from productivity growth being passed along in higher wages and lower prices, as was true in past decades, the benefits go to minority of well-situated individuals. \\nTo some extent we have already seen this story as Congress has repeatedly acted to make patent and related protections stronger and longer. In the longer category, copyright protection has been extended from 55 years to 95 years. Patent protection has been extended from 14 years from the date of issuance to 20 years from the date of application, with a wide variety of conditions allowing for further extensions. Patent protection was also extended to new areas so that it now applies to life forms, software and business methods. \\nThe impact of these stronger protections is most visible in the area of prescription drugs. We will spend over $430 billion in 2016 (2.3 percent of GDP) on drugs that would likely sell for 10 to 20 percent of this amount in a free market. In addition to patent protection, drug manufacturers can also now enjoy data exclusivity for test data and a wide variety of other protections that act to prevent generic competition. \\nThe problem associated with excessive protection of intellectual property is vividly illustrated with the Hepatitis C drug Sovaldi. This drug has a list price in the United States of $84,000 for a three-month course of treatment. A high-quality generic version is available in India for $200. Insurers and governments have struggled to come up with the money to pay for Sovaldi and, in many cases, have sought to deny treatment to patients. If Sovaldi could be purchased at its generic price, the cost of treatment would be a non-issue for those with Hepatitis C. - Advertisement - \\nThose who developed and marketed Sovaldi are now getting very rich as a result of its high price. But this is not a story of technology making them rich; it is a story of government-granted patent monopolies making them rich. \\nIf we are bothered by the upward redistribution of income of the last four decades, we should be looking at how we support the process of innovation, not blaming robots. \\nOf course we do need a mechanism to support research, innovation and creative work. But there is little evidence that the lengthening and strengthening of intellectual property protection in the last four decades has led to a faster pace of innovation. Furthermore, there are other mechanisms for financing research. We spend over $30 billion a year supporting biomedical research at the National Institutes of Health. This mostly supports basic research, but there is no reason that the funding could not be expanded with additional funds devoted explicitly to the developing and testing of new drugs. \\nMost importantly, we have to understand that the incomes that people earn as a result of intellectual property protections are due to government policy. They are not the result of technology. If we are bothered by the upward redistribution of income of the last four decades, we should be looking at how we support the process of innovation, not blaming robots.\""}, "time": 1742563969.1058946}