{"duration": 0.06965279579162598, "input_args": {"text": "'WASHINGTON, D. C.  —   Vice President Mike Pence addressed a sea of nearly 20, 000 people at the annual American Israel Public Affairs Committee (AIPAC) conference on Sunday, where he spoke of the “unbreakable” bond between the United States and Israel. [Pence also assured those gathered that his administration would subdue the Iranian regime’s destabilizing efforts in the region, vowing that the atrocities which haunt the Jewish people from the past would never again manifest itself. He also reiterated President Donald Trump’s promise to move the U. S. Embassy from Tel Aviv to Jerusalem.  “After decades of simply talking about it, the President of the United States is giving serious consideration to moving the American embassy from Tel Aviv to Jerusalem,” Pence said. Last month, Trump met with Israeli Prime Minister Benjamin Netanyahu and said his administration was looking at the move “very, very strongly. ” He also said, “We’re looking at it with great care. ” Pence noted that while talks between the Israelis and Palestinians would require some compromises, “President Trump will never compromise the safety and security of the Jewish State Israel. ” The Islamic Republic of Iran’s destabilizing efforts in the Middle East have been a major concern for America’s regional allies. But the threat has not been greater for any nation than for Israel, the subject of   death chants at Iranian schools that attempt to indoctrinate youth against the leader of the free world. The people of Iran, however, are a separate entity from the regime and also suffer under the oppression of the Islamic regime. “The Ayatollahs in Tehran openly admit their desire to wipe Israel off the map and drive its people into the sea,” Pence said. “America will no longer tolerate Iran’s efforts to destabilize the region and jeopardize Israel’s security,” Pence assured. He told them that “under President Donald Trump, the United States of America will not allow Iran to develop a nuclear weapon. This is our solemn promise to you, to Israel, and to the world. History attests that enmity toward the Jewish people often turns from evil thought to evil action. ” The vice president was moved to tears as he related the gripping story of his meeting with a Holocaust survivor during his visit to the first Nazi concentration camp in Dachau, Germany, last month, after attending a security conference there. His tour guide, Abdi Noor, 93, had been imprisoned in Dachau as a    boy. Pence described the hellish torment Noor had experienced as a slave in the Nazi camp. Then, he described the defining moment of his trip. “Then he stopped, looked up at me with tears in his eyes and said words I’ll never forget. He said, ‘Then the Americans came.’ I was so proud. Those words underscored the imperative of American strength, and they powerfully remind us of the immutable bond between our people and the people of Israel,” Pence said. He added, “Under President Trump’s leadership, America will be strong, stronger than ever before. ” Before Pence took the stage, virtuoso Hagai Shaham played Israel’s national anthem, the “Hatikvah,” on the violin. The Nazis had forced Jews to play violins as they witnessed their fellow Jews march to their deaths in gas chambers. At one point during Shaham’s performance, the crowd lent their voices to the sound of the instrument and sang the words to the song, which means “The Hope. ” Pence finished his speech by telling those gathered, “I know with all of my heart that with your help, with God’s help, and with the strong leadership of President Donald Trump, our nations and our peoples will remain forever friends, and we will go forth together to meet the glorious future that awaits. Thank you. God bless you, God bless Israel, and God bless the United States of America. ” Follow Adelle Nazarian on Facebook and Twitter.'"}, "time": 1742563495.218589}