{"duration": 0.09287428855895996, "input_args": {"text": "'WMD \\nANNOUNCEMENT! \\nJust a reminder that this site continues to be attacked by the crybaby hackers, so if you cannot reach it, wait a couple minutes and try again. THOUGHT FOR THE DAY! \"It is a terrible situation when the Government, to insure the National Wealth, must go in debt and submit to ruinous interest charges, at the hands of men, who control the fictitious value of gold. Interest is the invention of Satan.\" -- Thomas Edison YOUR RANDOM DHS MONITORED PHRASE OF THE DAY Chemical burn \\nPaid advertising at What Really Happened may not represent the views and opinions of this website and its contributors. No endorsement of products and services advertised is either expressed or implied. \\nThe Death Of John Kennedy By Michael Rivero\\nThere have been two official investigations. One concluded Oswald acted alone, the other that there was a conspiracy. After half a century, many of the key documents which could tell the whole story remain classified. John F. Kennedy\\'s brain is still missing from the National Archives. Why, if it is an open and shut case? Why the secrecy, if Oswald was just a \"crazed lone gunman\"? \\nThe House Select Committee on Assassinations concluded that John F. Kennedy was the victim of a conspiracy based on the recording of the gunshots fired in Dealey Plaza, captured over a police radio. A total of 7 impulses were caught on the tape, but citing budgetary constraints, the HSCA only had 4 of them analyzed. The analysis concluded that all 4 were gunshots, two of them occurring within 1/2 a second of each other, too close to be fired by one man. Comparisons of the echoes with test shots fired in Dealey Plaza confirmed that at least one of the recorded shots had indeed been fired from the Grassy Knoll. Needless to say, the existence of 5, rather than just 3, gunshots destroyed the Oswald as lone gunman cover-up. Warren supporters quickly tried to dismiss the audio record of the gunshots by claiming that the recording was actually of gunshots in another part of the city, and confused for Dealey Plaza shots because of a timing error. Without explaining just where the other shots had occurred, or why the echo patterns exactly matched the test shots fired in Dealey Plaza, the Warren supporters declared victory. New research has shown that the report that dismissed the audio recording of the gunshots was itself deeply flawed, and ignored evidence that confirmed both the location and time of the recording as being in Dealey Plaza at the time of the JFK assassination. This means that the original House Select Committee on Assassinations conclusion is the correct one. There were at least five gunshots in Dealey Plaza, two of them within 1/2 second of each other, and at least one of the shots came from the Grassy Knoll. UPDATE: The Deathbed Confession of CIA Agent, E. Howard Hunt to his son on the JFK Assassination. UPDATE: Numerous witnesses had reported a large obvious exit wound in the back of Kennedy\\'s head, consistent with the reports of a gunshot from the Grassy Knoll. The Warren Commission dismissed the exit wound and reports of a shooter on the Grassy Knoll and published in their report photographs of the back of Kennedy\\'s head that showed no damage. Now it has been revealed that the Warren Commission did not publish the actual autopsy photos but substituted photos taken after morticians had reconstructed Kennedy\\'s head an anticipation of a possible open casket viewing prior to the funeral , as had been done with Lincoln. \\nAlthough described as a mix-up, the simplest explanation is deliberate deception by the Warren Commission. Dan Rather\\'s \"fib\" \\nDan Rather, at the time an unknown newscaster from a small market Texas TV station, viewed the Zapruder film, then described it to America on the CBS network. As this recording of that broadcast shows, Rather lied to all of America in claiming that the head shot pushed John F. Kennedy\\'s head forward. \\nRather makes the claim that Kennedy\\'s head \"rocketed forward\" at 2:15 in the above video. He also makes a point of saying there were only three shots in total. Rather\\'s meteoric rise to network status and stardom soon followed this broadcast. When the Zapruder film was finally shown publicly, during Jim Garrison\\'s trial of CIA agent Clay Shaw, Rather\\'s lie was revealed for all to see. A Revealing Wink \\nMost Americans who lived through the Kennedy assassination are very familiar with the above photo of Vice President Lyndon Johnson being sworn in as President aboard Air Force One. \\nBut very few people are aware of another photograph snapped just seconds later! \\nIn this photo, Congressman Albert Thomas winks back at the brand-new President!'"}, "time": 1742564416.3150835}