{"duration": 0.0992128849029541, "input_args": {"text": "'Around this time last year, when Kanye West was griping about the Grammys, he took to Twitter and asked, incredulously, “Has anyone at the Grammys ever heard March Madness? ??” That would be one of several hits by Future, who in a spectacular run beginning in late 2014 and lasting through the end of 2015, released a cluster of outstanding mixtapes and albums that somehow landed out of the reach of mainstream awareness, even as they set the agenda, again and again, within  . That Future wouldn’t be lauded by the Grammys  —   the same thing happened this year, for what it’s worth  —   reflects his precarious relationship to the old   establishment (loosely welcome, but held at arm’s length) as well as the way the new   establishment has little need for the old rule makers, either within the genre or outside. Whether he’s accepted or not, Future persists. He’s perhaps the only rapper working who has successfully mimicked the samizdat, sub rosa feel of the mixtape era and parlayed it into a sustainable   career. He is both ubiquitous and obscure, a cipher who pops up in the most unexpected places. He is always on the horizon, and always in the shadows. Accordingly, he’s put out a pair of new albums in quick succession: “Future,” which was released two weeks ago and topped the Billboard album chart, and “Hndrxx,” which followed last week and is expected to topple its predecessor. (If that happens, he will become the first artist in Billboard history to pull off that feat.) This rainstorm of music is purposeful  —   as much as any aesthetic choice, excess is Future’s art. Most artists try their best to skip from peak to peak, knowing that the valleys in between can be deep and unforgiving. But Future’s consistency has tremendous value  —   he’s as much high plateau as peak, and better off for it. As has become clear over the past three years, Future is telling one long, wide, deep story, rather than dozens of discrete ones. His boasts are built with creatine, his voice soaked in acid. He’s a cryptic storyteller, in so much as his stories have beginnings, middles or ends. Typically, he strings together a few fragments with wild impact, covering the same thin topical range. A good example is the intro of “Hallucinating”: “I seduce you with this Aston Martin I bought   you done did more drugs than me? You must be hallucinating. ” He’s not preoccupied with crafting songs  —   though when he relaxes, he makes some of the most thrilling ones. Rather, he is submerged in a lifestyle, and his lyrics are quick, impressionistic smears. Taken in sum, his music verges on ambient, a   sound without edges or direction. In this way, Future is surprisingly   to the album format  —   he’s best consumed in wide gulps. Others use albums to shape coherent narratives for Future, they’re meant as floods. Total absorption is the thing. Most striking is how “Future” and “Hndrxx” tell two different stories while feeling like part of the same formless narrative. “Future” is closer to his earlier work, with barked brags (the excellent “Super Trapper”) and ruminative   that veers toward the psychedelic (“I don’t ever walk on   float off Earth, always float off Earth”). Antagonism is here, too: There’s a song called “POA,” as in power of attorney, as in what kind of life must you be living that legal terminology is so close to the fore of your creativity? The final two songs on “Future”  —   “When I Was Broke” and “Feds Did a Sweep”  —   strike a tone of deep melancholy that’s picked up on “Hndrxx” and used as a foundation. “Hndrxx” is almost wholly devoted to affairs of the heart  —   how his is fragile, and how he treats others’ carelessly. Several songs are strikingly personal, seemingly inspired by his publicly troubled relationship with the RB singer Ciara, with whom he has a son. “I told you from the start you was gonna turn on me,” he sings at the beginning of “Turn on Me,” then castigates himself for the relationship’s mistakes and its fallout: On both albums, the reference points are the same  —   glistening, wet diamonds Range Rovers purchased with pocket money women from all parts of the globe getting celebrated and mistreated, often in the same breath. Because these albums are best taken in their totality, it doesn’t quite matter if there are duds sprinkled throughout, and of course there are. Instead, it’s more revealing to focus on the technical rules Future revises, or ignores: He long ago melted the line between singing and rapping, but sometimes, he changes the rhyming syllable   as if he’s forgotten, or doesn’t care he raps in abstracted fragments and yet manages to sing a heartfelt duet with Rihanna (“Selfish”). The ocean is far more important than any one wave. On both albums, the rapping is more literal and direct than it has been in recent years  —   the enunciation is stronger (and therefore less intriguing) and often he’s emphasizing the final syllable in each line as a way of planting a flag. That directness hasn’t always been central to his work, but it’s reflective of the slightly more exalted position he holds in pop right now, a level of success where he’s guesting on Ariana Grande and Maroon 5 songs (which come as slightly less of a shock than when he teamed up with the early adopter Miley Cyrus a few years ago). One of the upsides of releasing so much music is that it’s easier to hide an occasional bizarre misstep. But even if Future continues to flirt with pop attention, it’s unlikely to be his dominant narrative. He’s more a state of mind than a set of songs. “Future” and “Hndrxx,” though very good, aren’t his best work, but they’re part of a story that’s still unfolding. Whether anyone’s listening or not, the Future story has no end.'"}, "time": 1742562157.0010273}