{"duration": 0.07128334045410156, "input_args": {"text": "'TEL AVIV  —   Leaders of the International Women’s Strike have no idea about the meaning of feminism and have hijacked the movement to protest the “occupation of Palestine” and “Israeli apartheid” instead of speaking out against the “occupation of women’s bodies” and “Islam’s religious and gendered apartheid,”  a leading   feminist told Breitbart Jerusalem. [According to Dr. Phyllis Chesler, emerita professor of psychology at City University of New York and a bestselling author, following Israel’s 1967 defensive war, Palestinians replaced women as “the favored victims of the month” in liberal circles.  “Now, it was formerly colonized Arab men of color, symbolized by the Palestinians, that became an obsession,” she told Breitbart Jerusalem. Even feminists themselves, Chesler noted, were no “longer concerned with the occupation of women’s bodies worldwide, but rather with the alleged occupation of a country that had never existed: Palestine. ” Chesler, considered a second wave feminist leader, said her generation was focused on “the sexual objectification of women economic parity abortion rights and on all the violence that took place mainly against women: rape, incest, sexual harassment,   pornography, and prostitution. ” But then, “  and postmodernism swept the Western Academy,” she said. Indeed, organizers of Wednesday’s Women’s Strike published on their website that they “stand for an uncompromising   and   feminism” first and foremost the “decolonization of Palestine. ” As Chesler notes, women’s rights have been pushed out the picture in favor of a warped   view. “The West, including Israel, became the world’s worst colonialists. Israel, not Islam, was accused of practicing apartheid. In reality, Islam is the largest practitioner of both gender and religious apartheid, but Israel served as the scapegoat for all the crimes perpetrated by Muslims including slavery,   racism, conversion via the sword, persecution of   religious minorities, imperialism, colonialism  —   and the most barbaric abuse of women,” Chesler said. “Feminists and other Western academics and progressives simply do not want to know about Islam’s history or current nature. Those who critique Islam, however mildly, are accused of being racists and Islamophobes and may be sued or killed,” she added. Chesler said that feminists today should be focusing on combating “forced   forced child marriage, female genital mutilation, polygamy, and femicide, or honor killing. ” “Sadly, tragically, the feminists who are being funded by Soros the   feminists who proudly wore the hijab at the   march simply do not understand that girls and women are killed for refusing to wear the hijab,” she said. She praised Israel for having robust feminist and gay rights movements and mused that any activists hoping to spearhead similar movements in countries such as Saudi Arabia, Egypt, Iran, and Pakistan, would end up being “jailed, tortured, raped, and murdered, perhaps beheaded. ” Women like Rasmea Odeh and Linda Sarsour, the faces behind Wednesday’s women’s strike as well as January’s Women’s March, are not feminists, Chesler said. As Breitbart Jerusalem reported, Odeh, who together with other strike organizers are calling to “decolonize Palestine” and protest the “white supremacists in the current government,” is a convicted terrorist accused of bombing attacks in the late 1960s that killed two Israeli university students and injured nine more. In 1980, Odeh was freed from an Israeli jail as part of a prisoner exchange deal, and a decade later emigrated to the U. S. She recently made headlines again after being charged with immigration fraud for lying about her terrorist background when applying for U. S. citizenship. For her part, Linda Sarsour is an     activist who made headlines for becoming the lead plaintiff in the lawsuit against Trump’s executive order on immigration.'"}, "time": 1742562210.120384}