{"duration": 1.3025245666503906, "input_args": {"text": "'. Mr Netanyahu has presented this as a rebuff to those who accuse him of jeopardising Israeli security interests with his government\\x92s repeated affronts to the White House.\\nIn the past weeks alone, defence minister Avigdor Lieberman has compared last year\\x92s nuclear deal between Washington and Iran with the 1938 Munich pact, which bolstered Hitler; and Mr Netanyahu has implied that US opposition to settlement expansion is the same as support for the \\x93ethnic cleansing\\x94 of Jews.\\nAmerican president Barack Obama, meanwhile, hopes to stifle his own critics who insinuate that he is anti-Israel. The deal should serve as a fillip too for Hillary Clinton, the Democratic party\\x92s candidate to succeed Mr Obama in November\\x92s election.\\nIn reality, however, the Obama administration has quietly punished Mr Netanyahu for his misbehaviour. Israeli expectations of a $4.5bn-a-year deal were whittled down after Mr Netanyahu stalled negotiations last year as he sought to recruit Congress to his battle against the Iran deal.\\nIn fact, Israel already receives roughly $3.8bn \\x96 if Congress\\x92s assistance on developing missile defence programmes is factored in. Notably, Israel has been forced to promise not to approach Congress for extra funds.\\nThe deal takes into account neither inflation nor the dollar\\x92s depreciation against the shekel.\\nA bigger blow still is the White House\\x92s demand to phase out a special exemption that allowed Israel to spend nearly 40 per cent of aid locally on weapon and fuel purchases. Israel will soon have to buy all its armaments from the US, ending what amounted to a subsidy to its own arms industry.\\nNonetheless, Washington\\x92s renewed military largesse \\x96 in the face of almost continual insults \\x96 inevitably fuels claims that the Israeli tail is wagging the US dog. Even The New York Times has described the aid package as \\x93too big\\x94.\\nSince the 1973 war, Israel has received at least $100bn in military aid, with more assistance hidden from view. Back in the 1970s, Washington paid half of Israel\\x92s military budget. Today it still foots a fifth of the bill, despite Israel\\x92s economic success.\\nBut the US expects a return on its massive investment. As the late Israeli politician-general Ariel Sharon once observed, \\xadIsrael has been a US \\x93aircraft carrier\\x94 in the Middle East, acting as the regional bully and carrying out operations that benefit Washington.\\nAlmost no one blames the US for Israeli attacks that wiped out Iraq\\x92s and Syria\\x92s nuclear programmes. A nuclear-armed Iraq or Syria would have deterred later US-backed moves at regime overthrow, as well as countering the strategic advantage Israel derives from its own nuclear arsenal.\\nIn addition, Israel\\x92s US-sponsored military prowess is a triple boon to the US weapons industry, the country\\x92s most powerful lobby. Public funds are siphoned off to let Israel buy goodies from American arms makers. That, in turn, serves as a shop window for other customers and spurs an endless and lucrative game of catch-up in the rest of the Middle East.\\nThe first F-35 fighter jets to arrive in Israel in December \\x96 their various components produced in 46 US states \\x96 will increase the clamour for the cutting-edge warplane.\\nIsrael is also a \\x93front-line laboratory\\x94, as former Israeli army negotiator Eival Gilady admitted at the weekend, that develops and field-tests new technology Washington can later use itself.\\nThe US is planning to buy back the missile interception system Iron Dome \\x96 which neutralises battlefield threats of retaliation \\x96 it largely paid for. Israel works closely too with the US in developing cyber\\xadwarfare, such as the Stuxnet worm that damaged Iran\\x92s civilian nuclear programme.\\nBut the clearest message from Israel\\x92s new aid package is one delivered to the Palestinians: Washington sees no pressing strategic interest in ending the occupation. It stood up to Mr Netanyahu over the Iran deal but will not risk a damaging clash over Palestinian statehood.\\nSome believe that Mr Obama signed the aid package to win the credibility necessary to overcome his domestic Israel lobby and pull a rabbit from the hat: an initiative, unveiled shortly before he leaves office, that corners Mr Netanyahu into making peace.\\nHopes have been raised by an expected meeting at the United Nations in New York on Wednesday. But their first talks in 10 months are planned only to demonstrate unity to confound critics of the aid deal.\\nIf Mr Obama really wanted to pressure Mr Netanyahu, he would have used the aid agreement as leverage. Now Mr Netanyahu need not fear US financial retaliation, even as he intensifies effective annexation of the West Bank.\\nMr Netanyahu has drawn the right lesson from the aid deal \\x96 he can act against the Palestinians with continuing US impunity.\\n- See more at: http://www.jonathan-cook.net/2016-09-19/palestinians-lose-in-us-military-aid-deal-with-israel/#sthash.fL4Eq28N.dpuf Forget the FBI Cache; The Podesta Emails Show How America is Run By Thomas Frank\\nNovember 01, 2016 \" Information Clearing House \" - \" The Guardian \" - T he emails currently roiling the US presidential campaign are part of some unknown digital collection amassed by the troublesome Anthony Weiner, but if your purpose is to understand the clique of people who dominate Washington today, the emails that really matter are the ones being slowly released by WikiLeaks from the hacked account of Hillary Clinton\\x92s campaign chair John Podesta. They are last week\\x92s scandal in a year running over with scandals, but in truth their significance goes far beyond mere scandal: they are a window into the soul of the Democratic party and into the dreams and thoughts of the class to whom the party answers.\\nThe class to which I refer is not rising in angry protest; they are by and large pretty satisfied, pretty contented. Nobody takes road trips to exotic West Virginia to see what the members of this class looks like or how they live; on the contrary, they are the ones for whom such stories are written. This bunch doesn\\x92t have to make do with a comb-over TV mountebank for a leader; for this class, the choices are always pretty good, and this year they happen to be excellent.\\nThey are the comfortable and well-educated mainstay of our modern Democratic party. They are also the grandees of our national media; the architects of our software; the designers of our streets; the high officials of our banking system; the authors of just about every plan to fix social security or fine-tune the Middle East with precision droning. They are, they think, not a class at all but rather the enlightened ones, the people who must be answered to but who need never explain themselves.\\nLet us turn the magnifying glass on them for a change, by sorting through the hacked personal emails of John Podesta, who has been a Washington power broker for decades. I admit that I feel uncomfortable digging through this hoard; stealing someone\\x92s email is a crime, after all, and it is outrageous that people\\x92s personal information has been exposed, since WikiLeaks doesn\\x92t seem to have redacted the emails in any way. There is also the issue of authenticity to contend with: we don\\x92t know absolutely and for sure that these emails were not tampered with by whoever stole them from John Podesta. The supposed authors of the messages are refusing to confirm or deny their authenticity, and though they seem to be real, there is a small possibility they aren\\x92t.\\nRepublican nominee hunkers down at Valley Forge; surrogates spread out as campaign enters final week; Clinton camp accuses FBI of double standards\\nWith all that taken into consideration, I think the WikiLeaks releases furnish us with an opportunity to observe the upper reaches of the American status hierarchy in all its righteousness and majesty.\\nThe dramatis personae of the liberal class are all present in this amazing body of work: financial innovators. High-achieving colleagues attempting to get jobs for their high-achieving children. Foundation executives doing fine and noble things. Prizes, of course, and high academic achievement.\\nCertain industries loom large and virtuous here. Hillary\\x92s ingratiating speeches to Wall Street are well known of course, but what is remarkable is that, in the party of Jackson and Bryan and Roosevelt, smiling financiers now seem to stand on every corner, constantly proffering advice about this and that. In one now-famous email chain, for example, the reader can watch current US trade representative Michael Froman, writing from a Citibank email address in 2008, appear to name President Obama\\x92s cabinet even before the great hope-and-change election was decided (incidentally, an important clue to understanding why that greatest of zombie banks was never put out of its misery).\\nThe far-sighted innovators of Silicon Valley are also here in force, interacting all the time with the leaders of the party of the people. We watch as Podesta appears to email Sheryl Sandberg. He makes plans to visit Mark Zuckerberg (who, according to one missive, wants to \\x93learn more about next steps for his philanthropy and social action\\x94). Podesta exchanges emails with an entrepreneur about an ugly race now unfolding for Silicon Valley\\x92s seat in Congress; this man, in turn, appears to forward to Podesta the remarks of yet another Silicon Valley grandee, who complains that one of the Democratic combatants in that fight was criticizing billionaires who give to Democrats. Specifically, the miscreant Dem in question was said to be:\\n\\x93 spinning (and attacking) donors who have supported Democrats. John Arnold and Marc Leder have both given to Cory Booker, Joe Kennedy, and others. He is also attacking every billionaire that donates to [Congressional candidate] Ro [Khanna], many whom support other Democrats as well.\\x94\\nAttacking billionaires! In the year 2015! It was, one of the correspondents appears to write, \\x93madness and political malpractice of the party to allow this to continue\\x94.\\nThere are wonderful things to be found in this treasure trove when you search the gilded words \\x93Davos\\x94 or \\x93Tahoe\\x94. But it is when you search \\x93Vineyard\\x94 on the WikiLeaks dump that you realize these people truly inhabit a different world from the rest of us. By \\x93vineyard\\x94, of course, they mean Martha\\x92s Vineyard, the ritzy vacation resort island off the coast of Massachusetts where presidents Clinton and Obama spent most of their summer vacations. The Vineyard is a place for the very, very rich to unwind, yes, but as we learn from these emails, it is also a place of high idealism; a land of enlightened liberal commitment far beyond anything ordinary citizens can ever achieve.\\nConsider, for example, the 2015 email from a foundation executive to a retired mortgage banker (who then seems to have forwarded the note on to Podesta, and thus into history) expressing concern that \\x93Hillary\\x92s image is being torn apart in the media and there\\x92s not enough effective push back\\x94. The public eavesdrops as yet another financier invites Podesta to a dinner featuring \\x93food produced exclusively by the island\\x92s farmers and fishermen which will be matched with specially selected wines\\x94. We learn how a Hillary campaign aide recommended that a policy statement appear on a certain day so that \\x93It wont get in the way of any other news we are trying to make \\x96 but far enough ahead of Hamptons and Vineyard money events\\x94. We even read the pleadings of a man who wants to be invited to a state dinner at the White House and who offers, as one of several exhibits in his favor, the fact that he \\x93joined the DSCC Majority Trust in Martha\\x92s Vineyard (contributing over $32,400 to Democratic senators) in July 2014\\x94.\\n(Hilariously, in another email chain , the Clinton team appears to scheme to \\x93hit\\x94 Bernie Sanders for attending \\x93DSCC retreats on Martha\\x92s Vineyard with lobbyists\\x94.)\\nThen there is the apparent nepotism, the dozens if not hundreds of mundane emails in which petitioners for this or that plum Washington job or high-profile academic appointment politely appeal to Podesta \\x96 the ward-heeler of the meritocratic elite \\x96 for a solicitous word whispered in the ear of a powerful crony.\\nThis genre of Podesta email, in which people try to arrange jobs for themselves or their kids, points us toward the most fundamental thing we know about the people at the top of this class: their loyalty to one another and the way it overrides everything else. Of course Hillary Clinton staffed her state department with investment bankers and then did speaking engagements for investment banks as soon as she was done at the state department. Of course she appears to think that any kind of bank reform should \\x93come from the industry itself\\x94. And of course no elite bankers were ever prosecuted by the Obama administration. Read these emails and you understand, with a start, that the people at the top tier of American life all know each other. They are all engaged in promoting one another\\x92s careers, constantly.\\nEverything blurs into everything else in this world. The state department, the banks, Silicon Valley, the nonprofits, the \\x93 Global CEO Advisory Firm \\x94 that appears to have solicited donations for the Clinton Foundation. Executives here go from foundation to government to thinktank to startup. There are honors. Venture capital. Foundation grants. Endowed chairs. Advanced degrees. For them the door revolves. The friends all succeed. They break every boundary.\\nBut the One Big Boundary remains. Yes, it\\x92s all supposed to be a meritocracy. But if you aren\\x92t part of this happy, prosperous in-group \\x96 if you don\\x92t have John Podesta\\x92s email address \\x96 you\\x92re out.'"}, "time": 1742562739.8254113}