{"duration": 0.07236313819885254, "input_args": {"text": "'Thu, 27 Oct 2016 14:52 UTC From the University of Sheffield and \"The Day After Tomorrow\" department comes this climate disaster movie plot wherein global warming, er, climate change, cause the polar jet stream to go wacky and freeze us extra good in winter. Really. No mention of what caused similar weather during the \" Little Ice Age \" between roughly AD 1300 and 1850 , except that they are sure they\\'ve ruled out \"natural variation\" now. The movie plot from IMDB : As Paleoclimatologist named Jack Hall is in Antartica, he discovers that a huge ice sheet has sheared off. But what he does not know is that this event will trigger a massive climate shift that will affect the world population. Meanwhile, his son Sam is with friends in New York to attend an event. There they discover that it has been raining non-stop for the past 3 days, and after a series of weather-related disasters begin to occur over the world, everybody realizes the world is entering a new Ice Age and the world population begins trying to evacuate to the warmer climates of the south. Jack makes a daring attempt to rescue his son and his friends who are stuck in New York and who have managed to survive not only a massive wave but also freezing cold temperatures that could possibly kill them. The paper press release via Eurekalert, they even have a scientist named \"Hall\": Extreme cold winters fueled by jet stream and climate change: Scientists agree for first time that climate change may be intensifying the effects of the jet stream , causing extreme cold weather in the UK and US Study could improve long-term forecasting of winter weather in most populous parts of the world More accurate forecasting could help communities, businesses and economies prepare for severe weather and make life and cost-saving decisions Scientists have agreed for the first time that recent severe cold winter weather in the UK and US may have been influenced by climate change in the Arctic, according to a new study. The research, carried out by an international team of scientists including the University of Sheffield, has found that warming in the Arctic may be intensifying the effects of the jet stream\\'s position, which in the winter can cause extreme cold weather , such as the winter of 2014/15 which saw record snowfall levels in New York. Scientists previously had two schools of thought. One group believe that natural variability in the jet stream\\'s position has caused the recent severe cold winter weather seen in places such as the Eastern United States and the UK. The other camp includes scientists who are finding possible connections between the warming of the Arctic - such as melting sea ice, warming air temperatures, and rising sea surface temperatures - and the emerging pattern of severe cold winter weather. Now, Professor Edward Hanna and Dr Richard Hall from the University\\'s Department of Geography, together with Professor. James E. Overland from the US Oceanographic and Atmospheric Administration (NOAA), have brought together a diverse group of researchers from both sides of the debate. The researchers have found that the recent pattern of cold winters is primarily caused by natural changes to the jet stream\\'s position ; however, the warming of the Arctic appears to be exerting an influence on cold spells, but the location of these can vary from year to year. Previous studies have shown that when the jet stream is wavy there are more episodes of severe cold weather plunging south from the Arctic into the mid-latitudes, which persist for weeks at a time. But when the jet stream is flowing strongly from west to east and not very wavy, we tend to see more normal winter weather in countries within the mid-latitudes. \"We\\'ve always had years with wavy and not so wavy jet stream winds, but in the last one to two decades the warming Arctic could well have been amplifying the effects of the wavy patterns,\" Professor Hanna said. He added: \"This may have contributed to some recent extreme cold winter spells along the eastern seaboard of the United States, in eastern Asia, and at times over the UK (e.g. 2009/10 and 2010/11). \"Improving our ability to predict how climate change is affecting the jet stream will help to improve our long-term prediction of winter weather in some of the most highly populated regions of the world. \"This would be hugely beneficial for communities, businesses, and entire economies in the northern hemisphere. The public could better prepare for severe winter weather and have access to extra crucial information that could help make live-saving and cost-saving decisions.\" The study, Nonlinear response of mid-latitude weather to the changing Arctic, is published today (26 October 2016) in the journal Nature Climate Change on 26 October 2016. The research was partly sponsored by the International Arctic Science Committee (IASC) and the Climate and Cryosphere (CliC) project of the World Climate Research Programme (WCRP). It further cements the University\\'s position at the forefront of climate change research and gives geography students at Sheffield access to the latest innovations in environmental science. Comment: In other words, \"natural variations mostly account for the cold weather, but global warming causes cold weather\"? Global warming stopped years ago, and is itself a natural variation over the long term. Humanity better face it: the global climate is self-regulating, and ice ages happen regularly. The Gulf Stream would probably be a better phenomenon to analyze in this regard: Fire and Ice: The Day After Tomorrow .'"}, "time": 1742563878.855499}