{"duration": 0.23119807243347168, "input_args": {"text": "'WASHINGTON  —   President Trump used his first full day in office on Saturday to unleash a remarkably bitter attack on the news media, falsely accusing journalists of both inventing a rift between him and intelligence agencies and deliberately understating the size of his inauguration crowd. In a visit to the Central Intelligence Agency intended to showcase his support for the intelligence community, Mr. Trump ignored his own repeated public statements criticizing the intelligence community, a group he compared to Nazis just over a week ago. He also called journalists “among the most dishonest human beings on earth,” and he said that up to 1. 5 million people had attended his inauguration, a claim that photographs disproved. Later, at the White House, he dispatched Sean Spicer, the press secretary, to the briefing room in the West Wing, where Mr. Spicer scolded reporters and made a series of false statements. He said news organizations had deliberately misstated the size of the crowd at Mr. Trump’s inauguration on Friday in an attempt to sow divisions at a time when Mr. Trump was trying to unify the country, warning that the new administration would hold them to account. The statements from the new president and his spokesman came as hundreds of thousands of people protested against Mr. Trump, a crowd that appeared to dwarf the one that gathered the day before when he was sworn in. It was a striking display of invective and grievance at the dawn of a presidency, usually a time when the White House works to set a tone of national unity and to build confidence in a new leader. Instead, the president and his team appeared embattled and defensive, signaling that the pugnacious style Mr. Trump employed as a candidate will persist now that he has ascended to the nation’s highest office. Saturday was supposed to be a day for Mr. Trump to mend fences with the intelligence community, with an appearance at the C. I. A. ’s headquarters in Langley, Va. While he was lavish in his praise, the president focused in his   speech on his complaints about news coverage of his criticism of the nation’s spy agencies, and meandered to other topics, including the crowd size at his inauguration, his level of political support, his mental age and his intellectual heft. “I just want to let you know, I am so behind you,” Mr. Trump told more than 300 employees assembled in the lobby for his remarks. In recent weeks, Mr. Trump has questioned the intelligence agencies’ conclusion that Russia meddled in the United States election on his behalf. After the disclosure of a dossier with unsubstantiated claims about Mr. Trump, he accused the intelligence community of allowing the leak and wrote on Twitter, “Are we living in Nazi Germany?” On Saturday, he said journalists were responsible for any suggestion that he was not fully supportive of intelligence agencies’ work. “I have a running war with the media,” Mr. Trump said. “They are among the most dishonest human beings on earth, and they sort of made it sound like I had a feud with the intelligence community. ” “The reason you’re the No. 1 stop is, it is exactly the opposite,” Mr. Trump added. “I love you, I respect you, there’s nobody I respect more. ” Mr. Trump also took issue with news reports about the number of people who attended his inauguration, complaining that the news media used photographs of “an empty field” to make it seem as if his inauguration did not draw many people. “We caught them in a beauty,” Mr. Trump said of the news media, “and I think they’re going to pay a big price. ” Mr. Spicer said that Mr. Trump had drawn “the largest audience to ever witness an inauguration,” a statement that photographs clearly show to be false. Mr. Spicer said photographs of the inaugural ceremonies were deliberately framed “to minimize the enormous support that had gathered on the National Mall,” although he provided no proof of either assertion. Photographs of Barack Obama’s inauguration in 2009 and of Mr. Trump’s plainly showed that the crowd on Friday was significantly smaller, but Mr. Spicer attributed that disparity to new white ground coverings he said had caused empty areas to stand out and to security measures that had blocked people from entering the Mall. “These attempts to lessen the enthusiasm of the inauguration are shameful and wrong,” Mr. Spicer said. He also admonished a journalist for erroneously reporting on Friday that Mr. Trump had removed a bust of the Rev. Dr. Martin Luther King Jr. from the Oval Office, calling the mistake  —   which was corrected quickly  —   “egregious. ” And he incorrectly claimed that ridership on Washington’s subway system was higher than on Inauguration Day in 2013. In reality, there were 782, 000 riders that year, compared with 571, 000 riders this year, according to figures from the   transit authority. Mr. Spicer also said that security measures had been extended farther down the National Mall this year, preventing “hundreds of thousands of people” from viewing the ceremony. But the Secret Service said the measures were largely unchanged this year, and there were few reports of long lines or delays. Commentary about the size of his inauguration crowd made Mr. Trump increasingly angry on Friday, according to several people familiar with his thinking. On Saturday, Mr. Trump told his advisers that he wanted to push back hard on “dishonest media” coverage  —   mostly referring to a Twitter post from a New York Times reporter showing    frames of Mr. Trump’s crowd and Mr. Obama’s in 2009. But most of Mr. Trump’s advisers urged him to focus on the responsibilities of his office during his first full day as president. However, in his remarks at the C. I. A. he wandered off topic several times, at various points telling the crowd he felt no older than 39 (he is 70) reassuring anyone who questioned his intelligence by saying, “I’m, like, a smart person” and musing out loud about how many intelligence workers backed his candidacy. “Probably almost everybody in this room voted for me, but I will not ask you to raise your hands if you did,” Mr. Trump said. “We’re all on the same wavelength, folks. ” But most of his remarks were devoted to attacking the news media. And Mr. Spicer picked up the theme later in the day in the White House briefing room. But his appearance, according to the people familiar with Mr. Trump’s thinking, went too far, in the president’s opinion. Mr. Trump’s appearance at the C. I. A. touched off a fierce reaction from some current and former intelligence officials. Nick Shapiro, who served as chief of staff to John O. Brennan, who resigned Friday as the C. I. A. director, said Mr. Brennan “is deeply saddened and angered at Donald Trump’s despicable display of   in front of C. I. A. ’s Memorial Wall of Agency heroes. “Brennan says that Trump should be ashamed of himself,” Mr. Shapiro added. “I was heartened that the president gave a speech at C. I. A. ,” said Michael V. Hayden, a former director of the C. I. A. and the National Security Agency. “It would have been even better if more of it had been about C. I. A. ” Representative Adam B. Schiff of California, the ranking Democrat on the House Intelligence Committee, said that he had had high hopes for Mr. Trump’s visit as a step to begin healing the relationship between the president and the intelligence community, but that Mr. Trump’s meandering speech had dashed them. “While standing in front of the stars representing C. I. A. personnel who lost their lives in the service of their country  —   hallowed ground  —   Trump gave little more than a perfunctory acknowledgment of their service and sacrifice,” Mr. Schiff said. “He will need to do more than use the agency memorial as a backdrop if he wants to earn the respect of the men and women who provide the best intelligence in the world. ” Mr. Trump said nothing during the visit about how he had mocked the C. I. A. and other intelligence agencies as “the same people that said Saddam Hussein had weapons of mass destruction. ” He did not mention his apparent willingness to believe Julian Assange, the founder of WikiLeaks, who is widely detested at the C. I. A. over his own intelligence agencies. He also did not say whether he would start receiving the daily intelligence briefs that are prepared for the president. The agency sees the president as its main audience, and his dismissal of the need for daily briefings from the intelligence community has raised concerns about morale among people who believe their work will not be respected at the White House. Since the election, hopes at the C. I. A. that the new administration would bring an infusion of energy and ideas have given way to trepidation about what Mr. Trump and his loyalists have planned. But the nomination of Mike Pompeo, a former Army infantry officer who is well versed in issues facing the intelligence community, to lead the C. I. A. has been received positively at the agency. “He has left the strong impression that he doesn’t trust the intelligence community and that he doesn’t have tremendous regard for their work,” Mark M. Lowenthal, a retired C. I. A. analyst, said of Mr. Trump. “The obvious thing to do is to counter that by saying, ‘I value you. I look forward to working with you. ’” “He called them Nazis,” Mr. Lowenthal added, referring to Mr. Trump’s characterization of the intelligence community. Mr. Lowenthal said Saturday’s visit should have been “a stroking expedition. ”'"}, "time": 1742563400.9126387}