{"duration": 0.30826711654663086, "input_args": {"text": "'When Technology Becomes Religion And Science Becomes God By Michael Snyder, on March 1st, 2015 \\nAre we in love with how smart we are? In America today, there are technology companies that have a much larger “cult following” than any religious organization. And there are millions upon millions of Americans that freely confess that they “believe in science”. So what does this say about us? Does it say that we have discarded ancient “superstitions” and instead have embraced logic and reason? Sadly, in most cases the truth is that we have simply traded one form of religion for another. Scientists and technology gurus have become our new high priests, and most of us blindly follow whatever they tell us. But in the end, just like with so many religious organizations, it is all about the money. Those with the money determine what the science is going to say, who the high priests are going to be, and what messages are conveyed to the public. For example, once upon a time the big tobacco companies had armies of doctors and scientists that swore up and down that smoking cigarettes was not harmful. In fact, many doctors and dentists in America once personally endorsed specific brands of cigarettes. Of course millions of Americans were getting sick and dying, but this was dismissed as “anecdotal evidence”. And over in Germany, “science” was once used to prove that the Germans were the master race. We look back in horror now, but at the time the best “science” in the world was used as justification to promote some horrible untruths. And of course the same thing is happening today. We are told over and over that “the science is settled” regarding genetically-modified food, climate change and vaccine safety, and yet those of us that think for ourselves know that isn’t the case at all. But if you do not believe in the “official story”, you don’t get to be part of the “scientific establishment”. By definition, the only people that get to be “scientific experts” are the ones that embrace the “doctrine” of those that control the big corporations, that fund the research studies at the major universities and that own the big media outlets. Everyone else is not permitted to be part of the discussion. \\nAs I have written about previously , I spent eight years studying at public universities in the United States. And over time, I got to see where most “scientific truths” come from these days. \\nMost of the time, the theories that people believe are so “scientific” were simply pulled out of thin air. In other words, they were just the product of someone’s overactive imagination. In recent decades, there have been countless examples of “existing science” being overturned and rewritten when more information and evidence become available. This is because the “existing science” did not have any foundation to begin with. \\nAnd yet we continue to make the same mistake today. Instead of calling them “theories”, which is what they should do, scientists all over the world are so eager to make bold pronouncements about the wonderful new “discoveries” that they have made. These bold pronouncements are then repeated over and over and over again until they become “facts”. But of course they are not facts at all. \\nFor instance, at one time it was a “scientific fact” that it was perfectly safe to smoke cigarettes. The following comes from a recent article by Tony Cartalucci … \\nIt wasn’t long ago when big-tobacco had armies of “scientists” citing the latest “studies” confirming the health benefits and safety of smoking. Of course these were paid liars, not scientists, even if many of them had PhDs. And it was lies they were telling, even if mixed with shades of science. \\nIn case you are too young to remember those days, Cartalucci included the following compilation of old tobacco ads in his article … \\nEven worse is how the Nazi used science. \\nTo them, the “facts” of Darwinism proved that they were the master race … \\nHiding behind science is nothing new. Darwinists hid behind it to prop up their racism, which in fact inspired the Nazis to hide behind it to scientifically prove they were the “master race.” The Nazis, in fact, loved science, and used it with horrible precision. \\nAt any point in history, has “science” ever had all the answers? \\nOf course not. \\nAnd without a doubt, someday people will look back and mock all of us for how stupid we were. \\nBut we never stop to consider that. Instead, we are all just so proud of ourselves and our accomplishments. \\nIn fact, as I mentioned above, there are a lot of people out there that virtually worship technology these days. Just consider the following excerpt from a Los Angeles Times article entitled “ How Steve Jobs and Apple turned technology into a religion “… \\nDecades after Apple’s founding, we’ve grown used to referring to lovers of the company’s products as a “ cult .” The devotion of customers to Apple products has long been the envy of competitors for its fanatical fervor. \\nIt turns out that the religious intensity with which people follow the company is not entirely by accident. In a new book, “Appletopia,” author Brett Robinson examines the way that Steve Jobs drew on religious metaphors and iconography to elevate his products specifically, and technology more generally, into a kind of religion . \\n“The creative rhetoric around Apple’s technology has favored religious metaphors,” Robinson said in an interview. “Some of it is conscious on Apple’s part. Some of it is unconscious.” \\nBut certainly this is less strange than what a lot of religious people do, right? \\nAfter all, there are millions upon millions of people out there that do some really strange things in the name of religion. For example, on the other side of the globe 400 men cut off their own testicles in an attempt to get closer to God. \\nMany would say that our worship of science and technology is evidence that we have evolved beyond our ancestors. In fact, there are some “scientific minds” that are now proclaiming that science will one day eliminate belief in God altogether. For example, the following comes from an article entitled “ Will Science Someday Rule Out the Possibility of God? “… \\nOver the past few centuries, science can be said to have gradually chipped away at the traditional grounds for believing in God. Much of what once seemed mysterious — the existence of humanity, the life-bearing perfection of Earth, the workings of the universe — can now be explained by biology, astronomy, physics and other domains of science. \\nAlthough cosmic mysteries remain, Sean Carroll, a theoretical cosmologist at the California Institute of Technology, says there’s good reason to think science will ultimately arrive at a complete understanding of the universe that leaves no grounds for God whatsoever. \\nCarroll argues that God’s sphere of influence has shrunk drastically in modern times, as physics and cosmology have expanded in their ability to explain the origin and evolution of the universe . “As we learn more about the universe, there’s less and less need to look outside it for help,” he told Life’s Little Mysteries. \\nPersonally, I find this laughable. \\nDarwinists have been trying to move God out of the picture for decades, but they are fighting a losing battle. Over time, more and more evidence has come out that has shot the theory of evolution full of holes. For much more on this, please see my previous article entitled “ 44 Reasons Why Evolution Is Just A Fairy Tale For Adults “. \\nAnd as far as whether or not God exists, this is something that I have been investigating for many, many years. My legal training has taught me to think critically and to allow the evidence to speak for itself. Over time, I came to learn that there is a vast   that leads to one inescapable conclusion. In the end, the overwhelming conclusion that I reached was that God is very, very real. You can find a few of my thoughts in an article entitled “ Did You Know? ” \\nSo what do you think? \\nDoes our society worship technology? \\nHas “science” become a god in America? \\nPlease feel free to add to the discussion by posting a comment below… \\nSign Of Judgment? Total Solar Eclipse On March 20th Falls In The Middle Of The Four Blood Red Moons » GetReal4U2 \\nGod is…very…very…real…Another great article Michael…the “end times” are drawing near…it’s so freaky how the word of God is literally being fulfilled before our very eyes…the miracle of the state of Israel and how it would become a stumbling block for the entire world…the prime minister is speaking to congress…and the current administration is having a fit,,,yep…the very countries named in end time prophesy…(Russia/Iran etc…) are lining up just as it said…the coming solar eclipse and blood moon on passover…are more signs of the end coming soon…the looming economic collapse is very near…ushering in the one world government…sadly most don’t believe it…or worse…even care… MichaelfromTheEconomicCollapse \\nVery well said. guest \\nWell let’s see here, They have their astrologers, diviners, soothsayers, wizards, seekers and speakers of the ‘secret’ things, knowers of ‘truth’, priests and preistess’s. They have all of the false gods of the O.T. and try to legitimize them with a covering of ‘science’. I’m waiting for the return of ‘nimrod’. I think he is going to offer them the ‘tree of life’. When the locusts come out of the pit to torment them and Death hides from them, then only might they begin to understand that the devil gave them the desire of their hearts, but it wasn’t quite what they imagined. Too late. DJohn1 \\nYou bring up a very interesting question in this article. I am proud of you for doing so. The conflict between science and religion has been going on for a very long time. It dates back to at least the 15-16th century. Long before Darwin and his theories of evolution in the 1850s. \\nAs a child I asked a lot of questions. Usually we were in a Methodist Church or a United Brethren Church being instructed on religion. I was told as a child that Heaven was above us and Hell was below us. If you were not good but evil then you would most likely end up when you die go below us in Hell. If you were a Christian the all is forgiven and you go to Heaven. \\nBy the time I was 13 I had read the Bible cover to cover in old English which is what the King James Bible is written in. It was originally written in the 1620s. Or thereabouts. So was Shakespeare. Being of English Origin, my original vocabulary did come a little closer to Old English than American English did. I still did not understand everything. \\nThe fly in the ointment is that Science discovered the true nature of this Heaven and Hell that they were speaking about when it was discovered the Earth is not flat, it rotates around the Sun, and the core of the Earth is possibly 10,000 degrees Fahrenheit. So the churches adapted. Now these places are very seldom described in churches as to an exact location at all. In the 1880s or thereabouts, a bishop in the Catholic Church added up all the ages of the various people in the Old Testament, added in the time of Christ’s birth to the present time and came up with a number that was the age of the Universe. To this day, a lot of people believe that number. The Earth cannot be more than 6,000 years old! There are people that take that age as gospel. Science is no better. They believe we originated from evolved creatures related to the apes. Well, they might be partially correct or not. We do not have the same number of chromosomes as apes. \\nOur chromosomes show considerable evidence of manipulation because two chromosomes are merged into double sized chromosomes. That it reproduces is amazing. We currently have over 400 genetic diseases or errors in the genetic code. Far too many for it to be normal. That spells an artificially created animal. That is a direct opposition to evolutionary theory. Science ignores it whenever they can. Their tenure is based on following religiously the original Darwin theory. The universe is at least 15 billion years old. I question that figure. I think it is older. I base that on the speed of light being 186,125 miles per second, and that being the top speed that something can travel without passing backwards in time. The known universe is huge. There are over 100,000 known galaxies and that number is probably conservative. I think there are a whole lot more than that. God says in the Bible I am the Alpha and Omega. The beginning and the end. I believe God. He defines himself as I am that I am. If ever English were inadequate to describe the original translations of the Bible this would be it. Meantime back at the local Church, Synagogue, Temples, etc. this pretty much goes undiscussed by religious authorities. The common person does not ask a lot of questions. The church authorities are probably grateful for that small blessing. \\nA lot of religions discourage questions and I understand why. IF. That is the real question. IF Science is right? IF the universe is as large as they say it is? IF God is as old as the Universe? Then that makes God something so powerful that no one is even aware just how powerful and old God really is. \\nI believe in God. I believe in Jesus Christ. I believe in the Holy Spirit. I have faith in Jesus. I have faith in prayer. I believe that when (not if) my body dies, my brain dies, that the operating soul then departs the body. That soul IF I am correct will go to be with Jesus. The rest of it is unknown as to how it all works. I have seen more than one miracle in my time here on Earth. I was privileged to know a priest that lived through Burma. 2,000 went in and 200 came out of Burma alive. He was the only Chaplain of God to survive. I remember clearly he did a Mass and pulled most of the energy from me one Saturday. 3 days later a female I was close to in Denver(I was in Niagara Falls AB, New York) wrote me a note and specified the exact time it happened. She asked what happened. All the power went out of her the same time it happened to me. In my 40s, a doctor diagnosed me with heart trouble. I was with a Pentacostal Singles Group and I was very worried. They laid hands on me and prayed for a cure. I went in and joined the artery club. They probed my heart through an artery in my leg. They could find nothing wrong. My Father was dying. He had a blood disease. He had some tooth work done and it would not quit bleeding. I called on prayer partners for my Mother’s sake. The only clotting compound left in the country (the FDA had banned it) was at the hospital they took him to. He lived. I believe. \\nReason says none of this could have happened. Faith says it did. MichaelfromTheEconomicCollapse \\nThank you for sharing all of that DJohn. \\nMichael Guest \\nYou did not read the King James Bible in “Old English.” The King James Bible was written between 1604 and 1611, and was written in Early Modern English (or, basically, just “English” since it’s not that much different from our modern-day language. \\nYou would not be able to read Old English without training, since Old English was used from about the 600s – 1066, and is basically a completely different language, since it’s much closer to German or Scandinavian. DJohn1 \\nBy Old English I was referring to the language used in the Bible and Shakespere. \\nEnglish itself is a conglomeration of different languages and was a trade language originally. Thank you for the information, I was not aware that it also referred to language from 600-1066. That date 1066 is also significant for William the Conquerer. \\nWhen a book is written with numerous words that have multiple meanings then that becomes a problem. We have over 250 denominations of “Christians” in the United States alone. Probably that number is too conservative. England itself was a mixing pot of genetics and language. K \\nSo scientists will one day prove there is no God. Sorry God already proved to me, real scientists don’t exist. VigilanteCaregiver \\nSerious science cannot prove nor disprove the existence of God – that’s not what it’s for. Serious sciences like physics, mathematics, chemistry, etc. can help you form an argument in favor of a creator, but it doesn’t provide anything that can prove definite existence… and I like to think He did this on purpose. Mike \\nI would have to say that observing creation through the sciences points to a creator with a purpose. Therefore, “The heavens are telling of the glory of God; And their expanse is declaring the work of His hands.” Psalm 19:1 VigilanteCaregiver \\nI’ve been saying this for years and most trolls here go bat &#$% crazy. Science is not capable of being a religion anyway; just those who crave power and utilize politicized pseudoscience myths like evolution, deviant marriage, eugenics, and so on. It just sounds cool to say you believe in science. Of course faith is a vast part of science (you have to believe your results after all), but it’s not a faith in a creator nor a faith leads to strong values and character, freedom and responsibility, nor the ability to grow and develop. It’s a worship of base things and stuff. It’s a worship of earth and the goods of the earth… worship of Baal. guest'"}, "time": 1742563587.6330862}