{"duration": 0.055498600006103516, "input_args": {"text": "'According to a report, the Congressional Black Caucus (CBC) intends to sponsor a ceremony in the U. S. Capital to   the offensive,   painting depicting police as pigs. Members of the Caucus are insisting that they are “defending the Constitution” by   the controversial artwork. [The news of the CBC’s intentions was made public by a January 9 tweet from Fox Business Network contributor Charles V Payne.  Breaking News Congressional Black Caucus to rehang ”Police as Pigs” painting tomorrow saying: ”It’s about defending the Constitution. ”  —   Charles V Payne (@cvpayne) January 9, 2017,  The painting depicting police officers as giant pigs pushing minorities around in Ferguson, Missouri, was originally hung by Missouri Democrat Lacy Clay in the tunnel of the Congressional Cannon office building of the U. S. Capitol complex. But it was recently pulled down by California Republican Duncan Hunter who said the thing fosters an “untrue narrative” that police don’t care about the public in general and minorities in particular. “This false narrative portrays law enforcement professionals as posing a danger to the very communities we serve. That is untrue and this ‘art’ reinforces this false narrative and is disrespectful on so many levels,” Rep. Hunter said after he removed the offensive painting from the wall. The Californian also said that numerous members of the Capitol Police had expressed their dismay at the painting’s inclusion in the display of art works submitted by the nation’s high schoolers to the Congressional Art Competition. Hunter also noted that Rep. Lacy can keep putting it up, but he can also keep taking it back down. Since the painting attacking police went up in the Capitol, police groups and unions have criticized the artwork and have demanded its removal. One police union called the painting “reprehensible and repugnant. ” The CBC, though, is claiming it is replacing the panting because of “the Constitution. ” “The rehanging of this painting for public view represents more than just protecting the rights of a student artist, it is a proud statement in defense of the 1st Amendment to the U. S. Constitution which guarantees freedom of expression to every American,” a statement by the CBC said. The statement also noted the offensive painting had been “removed without permission or proper authority” by Rep. Hunter. In reply to his tweet announcing the intention to   the painting, one Twitter user ruefully noted that the family of a recently murdered African American Orlando officer might not be very appreciative of the CBC’s using the Constitution as an excuse to spread hate. @cvpayne I am sure Master Sgt. Debra Clayton’s family  OPD is thankful that the Black Caucus fought so hard in defending a stupid painting. pic. twitter.   —   Mrz Mazz (@mrzmazz) January 9, 2017,  Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742564133.7042148}