{"duration": 0.03854489326477051, "input_args": {"text": "'0 19 2 0 A majority of likely US voters are concerned about the potential for violence during the upcoming presidential election on November 8, a USA TODAY/Suffolk University Poll revealed on Wednesday. \\nWASHINGTON (Sputnik) — The 2016 election will be the first held without the full protections afforded by the 1965 Voting Rights Act, which the US Supreme Court invalidated in 2013. The decision limited the federal government\\'s power to supervise areas of the country historically prone to voter intimidation. © AP Photo/ Don Ryan Black Lives Matter Activist Endorses Clinton for US President in Opinion Article \"A 51 percent majority of likely voters express at least some concern about the possibility of violence on Election Day; one in five are ‘very concerned’,\" the poll stated. \\nAdditionally, only 40 percent of the 1,000 respondents said they were very confident the country would have a peaceful transition of power from President Barack Obama to his successor. © REUTERS/ Nick Oxford/File Photo Coalition of US Rights Groups Urges States to Prevent Voter Discrimination \\nRepublican nominee Donald Trump has claimed the election is rigged and called for his supporters, including police and sheriffs, to independently patrol polling places for voter fraud, sparking at least some concerns that minority voters could be subject to intimidation. \\nTrump, but also numerous other critics , have warned of mass voter fraud in light of the fact that no mechanism exists to verify individuals are legally entitled to vote or keep people from voting more than once. Moreover, critics have raised the issue of names of dead people being included on voter lists as well as voting machines being highly vulnerable to manipulation and hacking. \\nOn October 19, detectives in the US state of Indiana found evidence of mass voter registration fraud after conducting an investigation into tampering of personal voter data. ...'"}, "time": 1742564577.3305273}