{"duration": 0.03766942024230957, "input_args": {"text": "'WASHINGTON  —   Senators received a rare briefing at the White House on Wednesday from the President Trump’s national security team on North Korea’s nuclear weapons program, which has become one of the most pressing foreign policy challenges early on in the administration. [“Sobering briefing,” tweeted Sen. Steve Daines ( ) after the briefing, hosted by Secretary of State Rex Tillerson, Defense Secretary Jim Mattis and Director of National Intelligence Dan Coats. The President also briefly attended the event.  Sen. Marco Rubio ( ) called it an “important” meeting. “We will never accept North Korea as a legitimate nuclear weapons power,” he tweeted. Just returned to Capitol.  Sobering briefing. https:  .   —   Steve Daines (@SteveDaines) April 26, 2017,  Just attended important @WhiteHouse meeting on #NorthKorea. We will never accept North Korea as a legitimate nuclear weapons power.  —   Senator Rubio Press (@SenRubioPress) April 26, 2017,  Sen. John Barrasso ( ) told NBC News that North Korea’s “capacity is increasing and has increased significantly. ” After the meeting, Tillerson, Mattis, and Coats released a statement, calling North Korea’s pursuit of nuclear weapons an “urgent national security threat and top foreign policy priority”: Just weeks after Trump took office, North Korea   a   ballistic missile, on February 11. The regime then launched four ballistic missiles on March 6. On April 5, it launched another missile. The tests, in defiance of international law, show progress in North Korea’s illicit nuclear weapons program. Earlier this year, North Korea fired a missile using solid fuel, which makes it harder to detect before launch. North Korea’s leader Kim   has vowed to obtain a nuclear weapon that can hit the U. S. homeland, and Trump has warned that it will not happen during his watch. The White House meeting was highly atypical. In the previous administration, the White House would often send senior officials to Capitol Hill to brief lawmakers, as opposed to inviting them to the White House. While some critics argued the briefings were little more than a photo opportunity, others  —   including Sen. David Perdue ( )  —    praised the White House for inviting both Democrats and Republicans to the briefing, and for trying to engage with senators. Senate Armed Services Committee member @sendavidperdue’s statement on White House #NorthKorea meeting: pic. twitter.   —   Kristina Wong (@kristina_wong) April 26, 2017,  Sen. Roger Wicker ( ) after the meeting, also praised the president, saying he “deserves credit for updating the entire Senate. ” “The Administration’s decision to hold this   briefing at the White House indicates the seriousness of the threat,” he said in a statement. Sen. Todd Young ( .) called North Korea a “grave” and “urgent threat. ” Democrats were more critical. Sen. Ed Markey ( ) said on NBC News it was “heartening” that there was more talk about diplomacy, but said it was in the context of more U. S. military exercises in the region and expressed concern about an “accidental war. ” After the Senate meeting was announced, the White House decided to hold a briefing for members of the House, but at the Capitol. Senators were bussed over to the briefing, which took place in the Eisenhower Executive Office Building on the White House grounds. The meeting occurred as the U. S. continued to deploy parts of a missile defense system to South Korea, known as the Terminal High Altitude Area Defense (THAAD). U. S. Pacific Command Commander Adm. Harry Harris said earlier in the day that the system would be operational “in the coming days. ” Sen. Ted Cruz ( ) after the meeting tweeted that it was “time to  ” North Korea as a state sponsor of terrorism, following a Reuters report saying that the administration was considering doing so.  N Korea utilizes terrorism  funds terrorists. Time to   as state sponsor of terrorism as called for in S. 672 https:  .   —   Senator Ted Cruz (@SenTedCruz) April 26, 2017, '"}, "time": 1742628448.6517642}