{"duration": 0.09516406059265137, "input_args": {"text": "'Email Print Cleveland, Ohio – Beyonce and Jay Z performed for “free” at the Get out the Vote concert last night for Hillary Clinton. However, sources revealed that the power couple was paid $62 Million to perform. According to sources closely connected with the power couple, Clinton and her campaign flew Beyonce and Jay Z out to a private meeting to discuss the election. With Hillary lacking the African-American voting numbers that Barack Obama had during his 2008 presidential, the Clinton campaign made a quick and desperate move in their final efforts to secure African-American votes. Empire Herald reported : “Jay and Beyonce got a call a few weeks ago from Clinton. She invited them for a weekend stay at a luxury hotel to meet regarding the election. Before Jay Z or Beyonce could voice any concerns or ask questions, Hillary pulled out a check. Beyonce saw the check first and her eye lit up like Christmas lights. On the last day of the meeting, Hillary told said to everyone, including Jay Z and Beyonce, “We definitely got the black vote now.” On the flight back to New York, Jay Z said, “You know what, Black Lives Matter, they matter because we got paid $62 Million to represent them.” Hillary Clinton can officially add Beyoncé and Jay Z to her list of devoted supporters. The musical power couple headlined a free get-out-the-vote concert in Cleveland on Friday night. . Cole, Chance The Rapper, and Big Sean were also among the list of artists who performed, offering their support to the Democratic nominee for president. As the concert’s official main headliner, Jay-Z kicked off the event with “Dirt Off Your Shoulder,” “F—WithMeYouKnowIGotIt,” and a couple of his older hit records. Shawn “Jay Z” Carter also brought out Big Sean to perform “Clique”. After Big Sean, Chance The Rapper, and J. Cole finished, Beyoncé made her entrance with her anthemic “Formation.” But before “Freedom” rang out, she shared her thoughts about the election. “There was a time when a woman’s opinion did not matter. If you were black, white, Mexican, Asian, Muslim, educated, poor, or rich, if you were a woman, it didn’t matter,” Beyoncé said. “Less than 100 years ago, women did not have the right to vote. Look how far we’ve come from having no voice to being on the brink of making history again, by electing the first woman president. But we have to vote. The world looks to us as a progressive country that leads change.” She continued: “Eight years ago, I was so inspired to know that my nephew, a young black child, could grow up knowing his dreams could be realized by witnessing a black president. And now, we have the opportunity to create more change. I want my daughter to grow up seeing a woman lead our country and know that her possibilities are limitless. “We have to think about the future of our daughters, our sons, and vote for someone who cares for them as much as we do,” she continued, concluding: “And that is why I’m with her.” After Beyonce’s performance, she and her husband, Jay Z, bowed, hugged, and kissed, ending their night with their official endorsement of Hillary Clinton. then Jay Z made his endorsement. “I want to grow up in a world where our daughter has no limitations. She can feel like she can be whatever she wants to be in the world,” he said. “This other guy [Donald Trump], I don’t have any ill will towards him, but his conversation is divisive, and that’s not an evolved soul to me. He cannot be my president. He cannot be our president. Once you divide us, you weaken us. We’re stronger together,” Jay Z added. Jay Z then welcomed Hillary Clinton on stage and, along with Beyoncé, gave the 69-year-old politician a big hug. Then, the former Secretary of State grabbed the mic. “We have a woman who is an inspiration to so many others. I thank Beyoncé for standing up and showing the world we are strongest when we look out for each other,” Clinton said. “And I thank Jay for addressing in his music some of our biggest challenges in the country: poverty, racism, the urgent end for criminal justice reform.” \\nIf you haven’t checked out and liked our Facebook page, please go here and do so. Leave a comment... '"}, "time": 1742561956.521287}