{"duration": 0.06618332862854004, "input_args": {"text": "'Date: 2015-03-08 15:49 Subject: Fwd: Lanny Davis We gotta zap Lanny out of our universe. Can\\'t believe he committed her to a private review of her hard drive on TV. On March 4, 2015, two days after the e-mail in which Podesta wrote, “we are going to have to dump all those emails so better to do so sooner than later,” the House Select Committee on Benghazi subpoenaed Clinton demanding “any and all documents and communications in your possession, and/or sent from or received by the email adresses [sic] ‘ ,’ ‘ ,’ or any other email adress [sic] or communications device used by you or another on your behalf, referring or relating to” the committee’s investigation into Benghazi. The subpoena specifically demanded all such “communications” “for the time period of January 1, 2011 through December 31, 2012.” Clinton — in a possible move to buy more time to “dump all those emails” — falsely claimed that she had not been subpoenaed. The committee responded by making the subpoena public. Committee Chairman Trey Gowdy wrote, “I would not make this [subpoena] public now, but after Secretary Clinton falsely claimed the committee did not subpoena her, I have no choice in order to correct the inaccuracy.” The press release , dated July 18, 2015 says, in part: “The committee has issued several subpoenas, but I have not sought to make them public,\" said committee Chairman Trey Gowdy. “I would not make this one public now, but after Secretary Clinton falsely claimed the committee did not subpoena her, I have no choice in order to correct the inaccuracy. The committee immediately subpoenaed Clinton personally after learning the full extent of her unusual email arrangement with herself, and would have done so earlier if the State Department or Clinton had been forthcoming that State did not maintain custody of her records and only Secretary Clinton herself had her records when Congress first requested them.” “The fact remains, despite when this subpoena was issued, Secretary Clinton had a statutory duty to preserve records from her entire time in office, and she had a legal duty to cooperate with and tell the truth to congressional investigators requesting her records going back to September of 2012. Yet despite direct congressional inquiry, she refused to inform the public of her unusual email arrangement. This information only came to light because of a Select Committee request, not a voluntary decision to turn over records almost two years after leaving office, records which always should have been in State’s custody.\" \"Moreover, the timing of the Secretary\\'s decision to delete and attempt to permanently destroy emails is curious at best. The Secretary left office in February of 2013. By her own admission she did not delete or destroy emails until the fall of 2014, well after this Committee had been actively engaged in securing her emails from the Department of State. For 20 months, it was not too burdensome or cumbersome for the Secretary to house records on her personal server but mysteriously in the fall of 2014 she decided to delete and attempt to permanently destroy those same records.\" The press release contains a link to the actual subpoena . As the press release makes clear, “By her own admission” Hillary Clinton “did not delete or destroy emails until the fall of 2014.” What is left unclear is this: If those e-mails had already been deleted (as she claimed), then what e-mails was Podesta referring to when he said they were “going to have to dump” them “sooner” rather than “later”? And if the e-mails had been deleted in 2014, why did Hillary have her server wiped using BleachBit before turning it over to investigators? It is hopeful that two things will happen following this most recent disclosure. The first is that this will find its way into the newly reopened investigation into Clinton’s use of the private, unsecured server. The second is that WikiLeaks will release additional pieces of the puzzle to clarify what is still unclear. With less than a week left until the election, it is likely to be an exciting few days. Photo of John Podesta: AP Images Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742562293.3379989}