{"duration": 0.0942225456237793, "input_args": {"text": "'WASHINGTON, D. C.  —     DNC Chair Tom Perez called President Donald Trump’s first joint address to Congress “Steve Bannon on steroids with a smile” during an interview with Rachel Maddow on MSNBC, where he appeared with his appointed deputy chair, Keith Ellison. [Ellison laughed, raised his eyebrows, and looked at Perez after he made that statement.  According to one MSNBC reporter, when asked about Trump’s speech, Perez sarcastically clapped: “Oh, he read a TelePrompTer!! It’s like my kid ate and didn’t spill!” When asked about the speech DNC Chair Perez sarcastically clapped:  ”oh, he read a TelePrompTer!! It’s like my kid ate and didn’t spill!”  —   Michael LaRosa (@MichaelLaRosaDC) March 1, 2017,  Perez said Trump started out his speech with “alternative facts. ” He charged that Trump “took credit for things [he] had nothing to do with  …     . All these new companies are adding jobs. ” He added, sarcastically, that “since January 20, the Washington Wizards have one of the best records in the NBA, including they beat the Golden State Warriors tonight. Must have been Trump. ” Trump started his speech on Tuesday night reminding the nation of Black History Month and condemning the recent spate of   attacks: Tonight, as we mark the conclusion of our celebration of Black History Month, we are reminded of our Nation’s path toward civil rights and the work that still remains. Recent threats targeting Jewish Community Centers and vandalism of Jewish cemeteries, as well as last week’s shooting in Kansas City, remind us that while we may be a Nation divided on policies, we are a country that stands united in condemning hate and evil in all its forms. Each American generation passes the torch of truth, liberty and justice  —   in an unbroken chain all the way down to the present. That torch is now in our hands. And we will use it to light up the world.  I am here tonight to deliver a message of unity and strength, and it is a message deeply delivered from my heart. In his interview with MSNBC, Perez continued, “Then you move on to immigrant baiting. You know, that immigrant baiting is like the salt and pepper on the table of that Trump administration. ” He said, “And then you close it up with a bunch of promises that you’ll never keep. And frankly, some of the promises, I’m glad they can’t keep, because the Affordable Care Act is a lifesaver. It’s not a job killer. ” Ellison took the opportunity to recruit for the Democratic Party. “This is a good time to get   with the Democratic Party,” “We have a level of organization, unity, commitment and passion that, I think, is going to serve the American people very well. ” Perez added: “Our most important area of agreement, and we have many, is that we need to redefine the mission of the Democratic Party. ” Follow Adelle Nazarian on Twitter and Periscope @AdelleNaz'"}, "time": 1742564058.5592906}