{"duration": 0.06301546096801758, "input_args": {"text": "'STRANGERS IN THEIR OWN LANDAnger and Mourning on the American RightBy Arlie Russell Hochschild351 pp. The New Press. $27. 95. Arlie Hochschild’s generous but disconcerting look at the Tea Party presents a likable fellow named Lee Sherman, who once worked for a Louisiana chemical plant where his duties included illegally dumping toxic waste into the bayou. Sherman did the dirty work then the company did him dirty. After 15 years on the job, he was doused with chemicals that “burned my clothes clean off me” and left him ill. But rather than pay his disability costs, his bosses accused him of absenteeism and fired him. Sherman became a fledgling environmentalist and got his revenge after a giant fish kill threatened the livelihood of nearby fishermen. Company officials feigned innocence, but Sherman barged into a public meeting with an incriminating sign: I’M THE ONE WHO DUMPED IT IN THE BAYOU.   a couple of decades and Sherman, still an environmentalist, is campaigning for a Tea Party congressman who wants to gut the Environmental Protection Agency. Sherman still distrusts chemical companies, but he distrusts the federal government more, because it spends his tax money on people who “lazed around days and partied at night. ” In “Strangers in Their Own Land,” which has been nominated for a National Book Award, Hochschild calls this the “Great Paradox”  —   opposition to federal help from people and places that need it  —   and sets off across Louisiana on an energetic,   quest to understand it. A distinguished Berkeley sociologist, Hochschild is a woman of the left, but her mission is empathy, not polemics. She takes seriously the Tea Partiers’ complaints that they have become the “strangers” of the title  —   triply marginalized by flat or falling wages, rapid demographic change, and liberal culture that mocks their faith and patriotism. Her affection for her characters is palpable. But the resentments she finds are as toxic as the pollutants in the marsh and metastasizing throughout politics. What unites her subjects is the powerful feeling that others are “cutting in line” and that the federal government is supporting people on the dole  —   “taking money from the workers and giving it to the idle. ” Income is flowing up, but the anger points down. The people who feel this are white. The usurpers they picture are blacks and immigrants. Hochschild takes care not to call anyone racist but concludes that “race is an essential part of this story. ” When she asks a   mayor to describe his politics, his first two issues  —   or is it one in his mind?  —   are welfare and race: “I don’t like the government paying unwed mothers to have a lot of kids, and I don’t go for affirmative action. ” In welfare politics, this is déjà vu all over again. It’s been two decades since Bill Clinton signed a tough welfare law aimed in part to end the politics of blame. “Ending welfare as we know it” would recast the needy as workers, he said, and build support for a new safety net. The rolls of the main federal cash program have fallen by 80 percent from their 1990s highs  —   in Louisiana, by 95 percent. But reverse class anger is more potent than ever. Liberals have long wondered why    voters support policies that (the liberals think) hurt the working class. Why would victims of pollution side with the polluters? Theories abound. Thomas Frank accuses the G. O. P. of luring voters with social issues but delivering tax cuts for the rich. Others point to the political machines built by   donors like Charles and David Koch. Still others emphasize the influence of conservative media like Fox News. Hochschild sees these as partial explanations but wants a fuller understanding of “emotion in politics”  —   she wants to know how Tea Partiers feel, on the theory that the movement serves their “emotional  ” by providing “a giddy release” from years of frustration. Six characters dominate the book, including Harold Areno, who lives on a swamp so polluted even the rugged cypress trees are dead. He and his wife have had cancer. Yet Areno supports politicians hostile to environmental regulation because he cares more about banning abortion. “We vote for candidates that put the Bible where it belongs,” he said. Mike Schaff lost his neighborhood to the Bayou Corne sinkhole, which started to swallow 37 acres in 2012 after a lightly regulated drilling company punctured an underground salt dome. But he remains a “free market man,” because “Big Government” threatens “community. ” Many Tea Party adherents warn that more regulation will cost them jobs. (A   mayor says the pungent chemical plant “smells like rice and  gravy. ”) But Hochschild detects other passions and assembles what she calls the “deep story”  —   a “feels as if” story, beyond facts or judgment, that presents her subjects’ worldview. It goes like this: “You are patiently standing in a long line” for something you call the American dream. You are white, Christian, of modest means, and getting along in years. You are male. There are people of color behind you, and “in principle you wish them well. ” But you’ve waited long, worked hard, “and the line is barely moving. ” Then “Look! You see people cutting in line ahead of you!” Who are these interlopers? “Some are black,” others “immigrants, refugees. ” They get affirmative action, sympathy and welfare  —   “checks for the listless and idle. ” The government wants you to feel sorry for them. And who runs the government? “The biracial son of a   single mother,” and he’s cheering on the line cutters. “The president and his wife are line cutters themselves. ” The liberal media mocks you as racist or homophobic. Everywhere you look, “you feel betrayed. ” Hochschild runs the myth past her Tea Party friends. “You’ve read my mind,” Lee Sherman said. “I live your analogy,” Mike Schaff said. Harold Areno’s niece agrees, and says she has seen people drive their children to Head Start in Lexuses. “If people refuse to work, we should let them starve,” she said. Actually, anger this raw may depart from the 1990s, when welfare critics often framed their attacks as efforts to help the poor by fighting dependency. The resentments Hochschild presents are unadorned, and they have mutated into a broader suspicion of almost everything the federal government does. “The government has gone rogue, corrupt, malicious and ugly,” one Tea Partier complains. “It can’t help anybody. ” Did welfare really “end”? Conservatives say no. Cash aid plummeted, but food stamp usage soared to new highs and the Medicaid rolls expanded. There’s room for debate, but the grievances Hochschild presents feel immune to policy solutions. As long as larger forces are squeezing whites of modest means, it’s going to “feel as if” people are cutting in line. In Lexuses. None of Hochschild’s characters appear to have been directly hurt by competition from people of color. Their economic problems lie elsewhere, she argues, in unchecked corporate power and technological transformation. Still there’s no denying that demographic and cultural change have robbed white men of the status they once enjoyed. Hochschild doesn’t buy the racial   but she can see their pain. Whatever racial or class resentments she finds, Hochschild makes clear that she likes the people she meets. They aren’t just soldiers in a class war but victims of one, too. She mourns their economic losses, praises their warmth and hospitality, and admires their “grit and resilience. ” While her hopes of finding common political ground seem overly optimistic, this is a smart, respectful and compelling book.'"}, "time": 1742628583.6281862}