{"duration": 0.11263203620910645, "input_args": {"text": "'Drew Stratton October 29, 2016 Prep Blog Review: How To Survive The Flu & Cold Season \\nReady or not, the flu and cold season is here. I’m sure you are not the type person to stay in bed all day long as you have so many things to do for your winter preparedness. \\nEven though both are respiratory illnesses and share similar symptoms like runny or stuffy nose, sneezing, sore throat and cough, a cold is milder than a flu and it doesn’t usually result in other serious health problems. \\nI can’t say the same thing about the flu. So, if you also have fever, headaches and muscle soreness, you should see a doctor. \\nSo, for this week’s Prep Blog Review I’ve gathered a handful of tips to help you feel better during the flu & cold season. 5 Natural Ways to Fight a Cold or the Flu \\n“It is that time of year again, the beginning of cold and flu season. Yuck! Although many of us would love to stay inside and avoid all those nasty germs lurking about in public, it is not always feasible. So, let’s look at a few ways to fight off and relieve the symptoms of a cold or the flu, Naturally: \\nHerbs: \\nOne of the best herbs to stimulate immune supporting white blood cells, T cells, macrophage and interferon activity is Echinacea. This can be taken at the first signs of a cold and will help to ease the symptoms. Boneset is another herb that will help to stimulate the immune system and is one of the most effective herbs to fight a cold or the flu. It promotes sweating and helps your body to release toxins. Although you could steep it and drink as a tea it is best to take it in pill form if possible, as it can be quite bitter tasting.” \\nRead more on The Trailer Park Homesteader . 4 Ways to Cut the Duration of Your Cold \\n“At our house, back to school means back to kids bringing home germs. When the leaves start turning, I start reaching for my cough drops, feeling that all too familiar tickle in my throat. If I can, I try to drink tons of water, wash my hands like crazy, and keep the bug from taking hold. But once I know I’m past the point of no return, the following things can help cut the duration of my cold and get me back to my busy life. \\nDo you know how to tell   cold and a flu virus?” \\nRead more on Ready Nutrition . 17 Natural Antibiotics Our Grandparent Used Instead of Pills \\n“For hundreds of years, maybe even longer, our grannies and grandfathers relied on simple household items to heal. For that purpose, they picked different natural antibiotics, which they mostly found in home, gardens or meadows and woods nearby. \\nMuch of this came out of necessity. Rather than using an antibacterial facial scrub, our Nanas massaged honey deep into their pores. By using proven old home remedies, we can treat and cure various health problems and do a lot for our health avoiding unpleasant medications side effects, too.” \\nRead more on Backdoor Prepper . What You Need to Know About Expired Prescription Drugs \\n“The topic of using expired prescription drugs comes up frequently in survival and preparedness circles. Although there are many articles detailing with the efficacy of outdated meds, one question I get over and over again is “what do I do when the meds run out?” \\nWhereas there is no single clear answer, one thing we can all start to do now is hang on to our old, unused meds. For the most part and with very few exceptions, they will be viable for two to twelve years beyond their expiration date. The secret is to keep them in a cool, dark, location that is not too dissimilar from your food storage.” \\nRead more on Backdoor Survival . Prepping For Medical Emergencies \\n“Planning for medical emergencies is one of the biggest challenges one faces. This is especially true if the situation will occur with limited outside resources on which to rely. There are several things you can do to improve the odds for yourself and your loved ones, including solid medical knowledge, the leadership skills necessary to create a makeshift hospital, and a comprehensive medical stockpile.” \\nRead more on The Prepper Journal . \\n\\n  Drew Stratton for Survivopedia. 11 total views, 10 views today'"}, "time": 1742563187.8771827}