{"duration": 0.11594343185424805, "input_args": {"text": "'Deadline : \\nDonald Trumpâ\\x80\\x99s star on the iconic Hollywood Walk of Fame was destroyed early Wednesday morning by a man dressed as a city construction worker wielding a sledgehammer and pickax. The man, who told Deadline his name was Jamie Otis, said he was trying to extract the star to auction it off and raise funds for the women who have come forward to accuse Trump of sexually assaulting them over the decades. \\nThe embedded terrazzo and brass star, dedicated in 2007 in recognition of the now-GOP presidential candidateâ\\x80\\x99s days as host of NBCâ\\x80\\x99s The Apprentice, was smashed to bits, with shrapnel flying everywhere in the early-morning hours at the starâ\\x80\\x99s sidewalk home at 6801 Hollywood Blvd. near the Dolby Theatre. Check out Deadlineâ\\x80\\x99s exclusive video above. \\nThe incident occurred around 5:45 AM with a few bystanders stopping to watch. An LAPD police cruiser showed up around 6:15, but Otis already had left the scene. \\nHe wanted to give money to lying sluts. \\nsmdh. \\nNone of these stupid bitches have any evidence for their retarded claims. And they must have been put up to this by someone agreeing to pay their legal fees, because they’re all going to get sued, whether Trump wins or loses. \\nAnd this man wants to give them free money. Just because. My princesses. \\nThe Evolutionary Roots of White-Knighting \\nWhite-knighting has a biological explanation. Women have far more reproductive value than men do. And they are productive for a much shorter period of time. So a young fertile woman is of extreme value to the tribe, the nation, the race. This is why we all have these super-strong instincts to protect women. \\nTechnically, a society where the overwhelming majority of men had been killed, but the women were still alive, could recuperate. It takes a man five minutes to produce a child, while it takes a woman about three years (from conception to the point where it could exist without its mother). \\nSo, in a naturally functioning society, the white knight instinct is a good thing. \\nHowever, we don’t live in naturally functioning society. We live in a totally jewed-out nightmare dystopia where nature itself has been turned on its head and women have been given authority to rule over men. We have also been systematically brainwashed to believe that women are the same as men, and thus possess a similar morality to men – for example, we are taught that women don’t lie constantly as a matter of course (they do), we are taught that they have the capacity to feel guilt (they don’t, they only feel shame) and we are taught that they can use logic to evaluate situations (they can’t). \\nBasically, women do not have the physical strength to acquire necessary physical resources, so they have to use other methods to get what they need. \\nHistorically, though there was always a strong desire to protect women, women were not considered an authority on reality and there was an understanding that the basic biological nature of women is to survive on lies, manipulation and various schemes. So, while we would certainly hang a rapist if we found a rapist to have violently raped a woman, we didn’t take women at their word whenever they said anything. \\nWe also didn’t have these new forms of rape, such as “date rape.” If a woman went to the cops and said “I was in this man’s bedroom and he raped me,” the cops would say “well what were you doing in his room? Did he kidnap you?” \\nWe also would have been extremely skeptical of women accusing a rich man of sexual impropriety, as it is clear she has a whole lot to gain from doing so. \\nSo, even while the natural instinct is to come rushing in like a valiant knight whenever a woman cries that a man has disrespected her honor, this instinct was tempered by a logical understanding of the natural behavior of women. \\nAnother interesting element here worth noting is that while alpha males are much less prone to take the histrionics of women seriously, it is not because alpha males have less of a drive to protect women. It is because alpha males generally have more experience with women, and are thus much more likely to be aware of their tricks. Beta males also have the (presumably subconscious) belief that white-knighting will get them laid (protip: it does not), but this is also mainly due to a lack of understanding of female behavior due to a lack of exposure. \\nThere is also the fact that beta males have less testosterone, generally, and so are more likely to associate with females. You will notice that men who have “female friends” that they are not having sex with or trying to have sex with tend to be non-masculine. You also find this among men who will spend too much time with their girlfriends. \\nMen who take the opinions of women seriously on any level whatsoever tend to exhibit signs of femininity. For masculine men, a woman expressing her opinion on anything is either cute or repulsive. \\nMaximizing Male Exploitation \\nWomen instinctively understand this current backward situation, and are using it to maximum effect. Historically, women would have been ashamed to do what they are doing now. But because they know they can get away with it – and they know society won’t shame them – they are pushing it as far as they possibly can. \\nAnd that is what we see with the Clinton campaign’s use of these “woman abuser” allegations against Trump. \\nThey are attacking both the male white-knight instinct, as we see this poor dumb bastard who smashed the star responding to, and they are attacking the instinct of women to unify as a collective group against men for their own protection (which is a separate phenomenon which I will go into another time – basically, women had to get along with each other in nature to raise each other’s kids, and they often used this unity amongst themselves as a lobbying bloc against the men of their tribe/clan/village). \\nThe psychological elements of this election are absolutely fascinating. But most people don’t understand psychology. If everyone understood psychology, then in some way, psychology itself would cease to exist, as we would all be perfectly rational robot-like beings.'"}, "time": 1742561889.54647}