{"duration": 0.12136006355285645, "input_args": {"text": "'LONDON  —   The director of the C. I. A. has issued a stark warning to   Donald J. Trump: Tearing up the Iran nuclear deal would be “the height of folly” and “disastrous. ” During the election campaign, Mr. Trump railed against the deal, calling it a disaster and pledging to “dismantle” the historic accord, reached in 2015, in which Tehran agreed to limits on its nuclear program in return for the lifting of international oil and financial sanctions. Representative Mike Pompeo of Kansas, a Republican whom Mr. Trump has chosen to succeed John O. Brennan as head of the C. I. A. wrote in   on Twitter, “I look forward to rolling back this disastrous deal with the world’s largest state sponsor of terrorism. ” But in an interview with the BBC that was published on its website on Wednesday, Mr. Brennan warned that scrapping the nuclear deal would undermine American foreign policy, embolden   in Iran and threaten to set off an arms race in the Middle East by encouraging other countries to develop nuclear weapons. “First of all, for one administration to tear up an agreement that a previous administration made would be unprecedented,” Mr. Brennan said in the BBC interview, which the broadcaster said was the first by a C. I. A. director with the British news media. “I think it would be the height of folly if the next administration were to tear up that agreement. ” Mr. Trump has professed admiration for President Vladimir V. Putin of Russia, calling him a strong leader, and promised closer relations with Moscow, but Mr. Brennan, who was appointed by President Obama and will step down in January after four years, warned that the incoming administration needed to be skeptical about the Kremlin. “I think President Trump and the new administration need to be wary of Russian promises,” he told the BBC, reiterating the widely held view that Russia had carried out hacking during the United States election and blaming Moscow for the deteriorating situation in Syria. He said he had spoken with officials in Russia about the hacking accusations and had warned them that such activity would have adverse consequences. The United States should not “stoop to their level,” he said, even as he emphasized that there were other means to make sure Moscow understood unequivocally that the United States would not tolerate such practices. He characterized the killing of civilians in Syria as “outrageous” and blamed the government of President Bashar   and Russia for the bloodshed, warning that Moscow had shown that it was willing to protect its interests with a reckless disregard for the people affected by its policies. “Russia is a country that will pursue its national interests, frequently to the detriment of the interests of the peoples of the countries wherein it operates,” he said. Mr. Brennan told the BBC that the United States should continue to support moderate rebels fighting Mr. Assad’s forces in Syria as a bulwark against the “onslaught” meted out by the Syrian government and its allies, Russia, Iran and Hezbollah. Alluding to the ferocious fighting in recent days in the Syrian city of Aleppo, which has seen thousands of civilians flee for their lives, he said Russia had failed to show that it was a dependable negotiating partner and had prolonged the discussion process with the aim of choking the city. “I do not have confidence that the Russians are going to relent until they are able to achieve as much tactical battlefield successes as possible,” he said. Mr. Brennan also took a strong stand against waterboarding, which he said had undermined the C. I. A. The agency came under fierce international criticism after using interrogation methods like waterboarding in the aftermath of the Sept. 11, 2001, attacks in the United States, and Mr. Obama has since banned the practice. During the campaign, Mr. Trump pledged to bring back waterboarding and said he was open to unspecified methods he characterized as “a hell of a lot worse. ” And even as he indicated in an interview last week with the The New York Times that he had heard persuasive arguments that torture was not effective, he has left the option open. Mr. Brennan warned that the use of waterboarding would be rejected by most officers at the C. I. A. “Without a doubt, the C. I. A. really took some body blows as a result of its experiences,” he told the BBC. “I think the overwhelming majority of C. I. A. officers would not want to get back into that business. ” Mr. Brennan warned that despite recent setbacks on the battlefield in Iraq and elsewhere, Islamic State operatives responsible for waging attacks against the West remained “very active” and retained the means to continue their campaign. He also said the incoming administration should be careful how it characterizes the fight against Islamic extremists, because of the risk of playing into the hands of terrorists. “The new team needs to be disciplined in the language that they use, the messages that they send, because if they are not disciplined, their language will be exploited by the terrorists and extremist organizations as a way to portray the United States and the government as being   and we are not. ” Mr. Brennan told the BBC that he was ready to sit down with the new administration and to outline the challenges. “There are a lot of people out there who read the papers and listened to news broadcasts where the facts may be a bit  —   you know  —   off,” he said. “And so I want to make sure the new team understands what the reality is. It ultimately will be up to them to decide how to carry out their responsibilities. ”'"}, "time": 1742563749.143801}