{"duration": 0.12461709976196289, "input_args": {"text": "'Email \\nRepublican presidential contender Donald Trump has received a lot of flak in the media for alleging that the election is “rigged” and implying that he may contest the results of the election if he loses. But what happened in Virginia provides fodder to claims that Democrats are pulling out all the stops to secure Hillary Clinton’s victory. Virginia Governor Terry McAuliffe (shown) has granted voting rights to 60,000 convicted felons in time to register to vote, which the Daily Caller notes could be enough to swing the election in Hillary Clinton’s favor. \\nEarlier this year, Governor McAuliffe, a close personal friend of the Clinton family who personally guaranteed a loan for the purchase of their home in Chappaqua, New York in 1999, attempted to use an executive order to restore the voting rights of over 200,000 convicted felons — including violent and repeat offenders. \\nState Delegate James Edmunds declared Governor McAuliffe’s actions to be in violation of the state’s constitution: The Constitution of Virginia grants the Governor the authority to restore the civil rights of convicted felons. The Constitution also vests the clemency power in the office of the Governor. However, that authority is limited and must be applied on an individual basis. The Constitution says no \"person\" may vote unless \"his\" civil rights have been restored by the Governor. \\nAccording to Edmunds, Governor McAuliffe’s blanket restoration of voting rights “undermin[es] the strength of the criminal justice system and the sanctity of our civil rights.” \\nBreitbart News’ Ken Klukowski notes that even Clinton’s running mate, former Virginia Governor Tim Kaine, concluded when he was governor that he did not have the legal authority to grant such rights to all Virginia felons. Kaine heeded the advice of his lawyers, who said that “power could be exercised only in particular cases to named individuals for whom a specific grant of executive clemency is sought,” and further wrote that the “notion that the Constitution of the Commonwealth would be rewritten via executive order is troubling.” \\nFortunately, the Virginia Supreme Court ruled in July that governors cannot issue a blanket restoration of felons’ right to vote en masse, but instead must consider them on a case-by-case basis. That ruling invalidated McAuliffe’s sweeping executive order restoring voting privileges to more than 200,000 felons who’d completed their sentences. \\nThe court’s ruling did not stop him, however. The Daily Caller writes, “To get around that, McAuliffe used a mechanical autopen to rapidly sign thousands of letters, as if he had personally reviewed them.” \\nMcAuliffe’s office claimed that voting rights were restored to 13,000 felons, which Republicans discovered “mistakenly” included 132 sex offenders still in custody and several convicted murderers on probation in other states. But the Daily Caller News Foundation Investigative Group learned that the actual number was much higher, closer to 60,000, a significant figure that could make a difference in the battleground state. \\nHowever, Clara Belle Wheeler, Republican vice-chairman of the Virginia Board of Elections, states that McAuliffe’s use of the autopen may not have satisfied the state’s requirement that mandates each person’s record be reviewed before voting rights can be restored. \\n“I think the General Assembly caucus that brought suit made it abundantly clear that you must look at each person and evaluate each individual person’s record: have they served their time, have they paid their restoration if it was due, have they finished their probation, are they citizens, have they not been arrested for some other crime,” Wheeler said. “The code of Virginia requires that each person is treated as an individual rather than as a bulk because each individual has a different set of circumstances and those should be evaluated.” \\nMeanwhile, the 60,000 felon voters could turn the tides of the election, notes the Daily Caller: Virginia’s recent political history has seen multiple races that were decided by tiny margins. The 2014 U.S. Senate race, for example, was decided by only 17,000 votes, while the attorney general’s race came down to a mere 165 votes. \\nWheeler confirmed that the additional 60,000 votes had the potential to impact the outcome of the election. When the Daily Caller raised this concern, she responded, “I am acutely and chronically aware of that.” \\nOf the two presidential contenders, Clinton could potentially benefit significantly from the additional votes, according to a 2014 study in The Annals of the American Academy of Political and Social Science , which found, “Democrats would benefit from additional ex-felon participation.” \\nThe study’s authors, professors from the University of Pennsylvania and Stanford University, found that in some states, felons register Democratic by more than six-to-one. They also cited a study that found 73 percent of convicts who turn out for presidential elections would vote Democrat. \\nBut McAuliffe purports that his intentions were not politically motivated, but were instead merely to remove barriers from those who have been unfairly disenfranchised, particularly minorities. “Restoring the rights of Virginians who have served their time and live, work and pay taxes in our communities is one of the pressing civil rights issues of our day,” McAuliffe said in a statement. “I have met these men and women and know how sincerely they want to contribute to our society as full citizens again.” \\nYet, the Daily Caller reports that after McAuliffe’s efforts to restore voting privileges to 200,000 felons, Clinton’s staff called it a “great announcement” in an e-mail and set up a call about it. \\nIt’s worth noting that Governor McAuliffe’s political action committee donated nearly $500,000 to the 2015 Virginia state Senate campaign of Dr. Jill McCabe, wife of Andrew McCabe, the now deputy director of the FBI who helped supervise the probe of Clinton’s mishandling of classified information. \\nIt pays to have friends in positions of power. \\nGovernor McAuliffe’s actions are yet another example of the election “rigging” to which Trump has referred throughout his campaign. \\nThe GOP nominee told supporters at a midnight rally in Virginia that the governor is “letting criminals cancel out the votes of law-abiding citizens.” \\nOther examples of election rigging cited by Trump include a “corrupt media” and an opponent he stated “shouldn’t be allowed to run” because of her e-mail crimes.  '"}, "time": 1742561841.4460526}