{"duration": 0.08337879180908203, "input_args": {"text": "'RT October 26, 2016 \\nTop NATO & EU officials expressed anger at Spain’s permit reportedly issued to a Russian aircraft carrier group to take on fuel and supplies at Ceuta, a city with unclear political status. Spain says Russia’s warships have been mooring there “for years.” \\nA barrage of harsh statements followed when Spanish media reported that Russia’s naval battle group led by aircraft carrier Admiral Kuznetsov would make a stopover at the autonomous port of Ceuta after passing the Straits of Gibraltar on Wednesday. \\nBattle Stations! Putin’s fearsome fleet locked, loaded & ready for war with Britain… or not \\nRussian ships would moor in Ceuta to take on fuel and supplies under a permit issued by Spain’s Foreign Ministry, Spanish newspaper ABC reported on Tuesday, also citing Defense Minister Pedro Morenes, who said that “there was a prior authorization for this particular case.” \\nGuy Verhofstadt, former Belgian prime minister and currently EU envoy for Brexit talks with the UK, expressed his outrage, calling Spain’s decision “the harassment of EU and NATO forces.” \\nIn a Facebook post, he said that NATO member Spain “provides assistance to a fleet which has one purpose,” adding that “only last week this Spanish Government signed up to a statement from the European Council accusing Russia of war crimes against civilians in Aleppo.” \\nLater in the day, NATO Secretary General Jens Stoltenberg made it clear that the bloc wants Madrid to rethink the stopover permit. A d v e r t i s e m e n t \\n“We are concerned and I have expressed that very clearly about potential use of this battle group to increase Russia’s ability and to be a platform for airstrikes against Syria,” he said. \\n“This is something I have conveyed very clearly before and I repeat those concerns today and I believe that all NATO allies are aware that this battle group can be used to conduct airstrikes against Aleppo and Syria.” \\nHe then downplayed the rhetoric, noting that “it’s for each nation to decide whether these ships can get supplies and be fuelled in different harbors along the route towards the eastern Mediterranean.” \\nLate Tuesday night, the Spanish Foreign Ministry said it was “reviewing” the decision. “The latest stopover requests are being reviewed at the moment based on the information we are receiving from our allies and from Russian authorities,” the ministry said in a statement, quoted by Reuters. \\nEarlier in the day, however, the ministry told RIA Novosti that Madrid allows Russian ships to dock in Spanish ports as “routine navigation” which effectively lies outside EU sanctions imposed on Moscow. \\nIn the meantime, a spokesman for the Foreign Ministry told the Telegraph the requests from the Russian Navy “are considered on case-by-case basis,” stressing that “Russian navy vessels have been making calls in Spanish ports for years.” \\nCeuta, an autonomous Spanish enclave on the tip of Africa’s northern coast, lies along the Straits of Gibraltar and borders Morocco, which also claims the territory as its own. \\nAlthough Ceuta is part of the EU, its status within NATO is still unresolved. Since 2011, Spain has rankled the bloc by allowing 57 Russian warships to refuel at the enclave. \\nThe mission of the Admiral Kuznetsov carrier group has already triggered a media frenzy across Europe, with British, Norwegian, and Dutch navies sending frigates and surveillance vessels to shadow the Russian warships as they round European shores through international waters. \\nOnce they reach Syrian shores, the ships will provide backup for Russia’s naval standing group already deployed to the area, according to the Russian Defense Ministry. This article was posted: Wednesday, October 26, 2016 at 6:21 am Share this article'"}, "time": 1742562650.0191317}