{"duration": 0.05256819725036621, "input_args": {"text": "'You are here: Home / US / Progressive Hypocrisy On Tolerance BRUTALLY Exposed Progressive Hypocrisy On Tolerance BRUTALLY Exposed October 27, 2016 Pinterest \\nRobert Gehl reports that, in her Washington Post article explaining why she and her lady friends decided to drive around the neighborhood and steal Donald Trump signs from private property, there’s one line that explains perfectly the leftist mentality. \\nThe liberal idea that your feelings are more important than the law – your personal opinions, or grudges, or perceived injustices grant you permission to commit criminal acts with little regard to the consequences. \\nBetta Stothart wrote her article in The Post on Tuesday (she provided a link to her Twitter feed, which was brand new at the time she wrote it, but has already been taken down) confessing to driving around her Falmouth, Maine, neighborhood with two other compatriots stealing dozens of Donald Trump signs from people’s yards. \\nShe was caught and arrested and now has to go to court. She tells us she’s sorry, but she’s not. Because her feelings about this campaign are more important. Read how she describes her situation: \\nI committed a crime this month, along with two of my friends. I’m not the lawbreaking type. In fact, as a 52-year-old mom, my life is pretty predictable and boring. But this election, a particular candidate’s boasts about women pushed me over the edge. \\nIn the suburban, upper-middle-class part of Maine where I live, Republicans and Democrats live together mostly in harmony. In every election cycle, there’s some tension. But the 2016 presidential campaign has been different. Tensions in my town are running at a fevered pitch. \\nWhich is how three middle-aged moms came to be running down the road, tearing up the Donald Trump signs along our version of Main Street. We’d been talking about the infamous Billy Bush tape and the women who have since come forward to share their own stories of abuse. We were angry. Getting Trump’s name off our median strip seemed like the best way to express our rage. \\nThese three women must have been proud of themselves, probably laughing heartily as they committed theft, trespassing and violated the First Amendment of their neighbors. Why? Because she thinks she was assaulted by the signs. \\nIn retrospect, I realize I shouldn’t be proud of my transgression. Hanging out with a bunch of moms, we started grousing about the proliferation of signs. Can you believe someone would put that many Trump signs so close together on our roads? It’s so rude. Who is this jerk? We felt assaulted by the number of signs . The idea of “cleansing” our streets seemed like the fastest way to restore balance and alleviate our election stress — at least, that night it did. \\n“ Assaulted” ? This is exactly why the Left is so dangerous. They are “assaulted” by ideas – by mere thoughts or opinions that are not their own. They will do anything- and Ms. Stothart did – to silence any dissent. \\nAnd she writes that “ in retrospect, I realize I shouldn’t be proud of my transgression. ” \\nShe doesn’t say she isn’t proud, she merely tells us that in retrospect she shouldn’t be proud. \\nWhich tells us that she is . She is proud of what she did. \\nWhen asked what she would say to the victims of her trespassing and theft, she offers no apology, merely a justification that Trump is bad, and that because she herself was a victim of an unwanted sexual advance, it justifies her behavior. \\nShe claims she’ll go to court in December with some sense of humility and shame – she’ll “explain” and “apologize.” \\nBut she’s not sorry. Not really. \\nTo her – and the millions of Leftists like her – the ends justify the means. Silence dissent, crush the opposition, tear down and destroy any thing that strays from your worldview. \\nThis is the world that Ms. Stothart lives in. She still lives in it today. She takes pride in suppressing the political view of her fellow Americans. \\nShe writes that the “agitation and fear is rising on both sides.” \\nNo, Ms. Stothart. I have yet to see a single story about a Trump supporter violating the Constitutional rights of a Hillary Clinton supporter by stealing yard signs. \\nThis is liberal America. This is Ms. Stothart’s America. \\nThis is not the America I want to live in.'"}, "time": 1742628360.9107525}