{"duration": 0.12864089012145996, "input_args": {"text": "\"Idols of Intellectual Perversity: How Ideology Corrupts the Minds of Smart People ‹ › GPD is our General Posting Department whereby we share posts from other sources along with general information with our readers. It is managed by our Editorial Board Russian battle group reaches Mediterranean after ‘causing stir’ in the West (VIDEO) By GPD on November 1, 2016 The nuclear-powered heavy cruiser Peter the Great. © Dover-Marina.com / Sputnik A Russian naval group, headed by the Admiral Kuznetsov aircraft carrier and the battle cruiser Peter the Great, has made its way into the Mediterranean, causing quite a stir in the West, the Russian Defense Ministry said. \\nMoscow has been surprised by the countries that have denied Russia’s warships entry to their ports, Russian Defense Minister Sergey Shoigu said, adding that ‘Western colleagues’ need to decide who they are actually fight against – terrorists or Russia. \\n“The movement of our ships has caused a stir among our Western partners, ” Shoigu said on Tuesday. \\n“ But the most surprising thing was the position of certain countries that, under pressure from the US and NATO, have publicly refused our warships entry to their ports. ” \\n“It did not affect the schedule of their movement along the chosen route, as they had been provided with all the necessary resources,” he added. \\nThe defense minister noted that the decisions of some countries to deny Russian ships entry to Western ports has demonstrated how, in fact, “ our partners understand their contribution to the fight against international terrorism in Syria.” \\n“It is time for our Western colleagues to decide who they are actually fighting – terrorists or Russia. As one poet once said, ‘one cannot sit on one and the same place on different trains,’” Shoigu added. \\nThe Ministry of Defense has released a sneak peak video, showing raw images of Russia’s ship-borne air strike force and warships, headed by the Admiral Kuznetsov aircraft carrier, but it is unclear when exactly the footage was shot. \\nA war of words was unleashed in late October when the Spanish media reported that the Russian naval ships would be making a stopover at the autonomous port of Ceuta after passing the Straits of Gibraltar. \\nNATO Secretary General Jens Stoltenberg made it crystal clear that the bloc wanted Madrid to rethink the stopover permit. “ We are concerned and I have expressed that very clearly about potential use of this battle group to increase Russia’s ability and to be a platform for airstrikes against Syria ,” he said at that time. Russia withdraws request for carrier battle group to refuel in Spain amid NATO pressure on Madrid \\nBelgium’s former prime minister and current EU envoy to the UK for Brexit talks, Guy Verhofstadt, said in a Facebook post that, despite being a NATO member, Spain “provides assistance to a fleet which has one purpose, ” noting that “ only last week this Spanish Government signed up to a statement from the European Council accusing Russia of war crimes against civilians in Aleppo.” \\nReneging on a previous agreement with Moscow, the Spanish Foreign Ministry reacted by issuing a statement declaring that Madrid could refuse permission to the Russian warships, which were heading for the Mediterranean to enter Ceuta, a Spanish enclave on the North African coast. \\nWhile the Western media reported that Russia had withdrawn its request for a stopover, the Russian Defense Ministry said such a stop had never been on the schedule in the first place. \\n“The Russian aircraft carrier group is fully supplied with sufficient material stocks to carry out its mission in the off-shore maritime zone in autonomous mode,” said ministry spokesman Major-General Igor Konashenkov. \\nSoon thereafter, Malta was forced to make a statement refuting media reports that the carrier group would be refueling at one of its ports. \\nThe Russian warships, including the Admiral Kuznetsov, the Pyotr Veliky battle cruiser, and the Severomorsk and Vice-Admiral Kulakov anti-submarine warfare destroyers, were sent to the Mediterranean on October 15. \\n“The goal of the campaign is to ensure a naval presence in operationally important areas of the oceans,” Russia’s Defense Ministry said in a statement. \\nREAD MORE: Battle Stations! Putin’s fearsome fleet locked, loaded & ready for war with Britain… or not \\nThe Admiral Kuznetsov carrier group’s tour has caused a media frenzy across Europe, with British, Norwegian, and Dutch navies sending frigates and surveillance vessels to shadow the Russian warships as they rounded European shores through international waters. \\nShoigu said on Tuesday that the Russian naval group had arrived in the Mediterranean Sea from the Atlantic Ocean, according to TASS news agency. \\n“Last week, our ship-borne air strike force, led by the missile cruiser Pyotr Veliky, made a passage through the eastern Atlantic into the Mediterranean Sea. On October 27-29, support vessels replenished the naval group with all kinds of supplies to the required level, ” Shoigu said. Related Posts: No Related Posts The views expressed herein are the views of the author exclusively and not necessarily the views of VT, VT authors, affiliates, advertisers, sponsors, partners, technicians, or the Veterans Today Network and its assigns. LEGAL NOTICE - COMMENT POLICY Posted by GPD on November 1, 2016, With 63 Reads Filed under Military . You can follow any responses to this entry through the RSS 2.0 . You can skip to the end and leave a response. Pinging is currently not allowed. FaceBook Comments \\nYou must be logged in to post a comment Login WHAT'S HOT\""}, "time": 1742564033.3828833}