{"duration": 0.09316587448120117, "input_args": {"text": "'Share on Twitter \\nDonald Trump\\'s campaign manager Kellyanne Conway took incoming fire on behalf of her boss about the candidate\\'s treatment of reporters covering his campaign. \\nWolf Blitzer asked Conway to convince Trump not to ridicule reporters at his rallies, saying that they are “scared” violence will go down: \\n“He shouldn\\'t be doing that. I mean, can you talk to him? And say to him, \\'Mr. Trump, we only have a few days left, these are hardworking young journalists, they deserve to have some security,\\' if you will, because some of those Trump supporters out there, they get pretty nasty with what they\\'re screaming at these young people.” Image Credit: Screenshot/CNN \\nConway said she would tell him. And then, she calmly withdrew her rhetorical scalpel, checked the glinting blade by the bright studio lights and carved out the reasons for Blitzer on why the reporters who cover the candidate deserve ridicule. \\nShe mentioned the WikiLeaks email which showed reporters had sought approval for stories from Clinton campaign chair John Podesta: \\n\"...[T]hat\\'s not journalism, that\\'s advocacy and, frankly, that\\'s collusion. So if there\\'s any spectrum between coziness to collaboration to collusion—any of that would bother us. \\nMany journalists have admitted that Donald Trump has compelled them to suspend objective standards of journalism. I think Americans deserve to have the race covered fairly.\" \\nBlitzer interrupted to mention the scared young reporters who might be harmed by Trump supporters. \\nConway said: \\n“[T]he only violence I saw at rallies so far was what we saw on video tape by somebody whose cohorts were at the White House 346 times, actively paying people—$1,500 a pop—to be protesters to incite violence at Trump rallies. That\\'s being done by Democratic operatives. The stink goes all the way up the chain through the DNC and related groups to Hillary Clinton\\'s campaign. That\\'s all I saw, but I\\'ll make a deal with those embeds [cross talk with Wolf]...I\\'ll excuse some of their tweets, but their twitter feed for some of them—we\\'ve done an analysis— 85%-90% negative toward Donald Trump.” Image Credit: Screenshot/CNN \\nThen Conway asked Blitzer a final, rhetorical question about the coverage of the campaign: \\n“I wonder if the way the news is being covered in this election cycle, particularly in the last few weeks, is the way Americans actually see the news and see the race? It\\'s not clear to me that they\\'re being told is what they think is important to them is what is being reported to them.” \\nConway claimed that what people at Trump rallies are concerned with are jobs, ObamaCare and defeating ISIS, not necessarily what\\'s being reported. '"}, "time": 1742563015.4872608}