{"duration": 0.1690068244934082, "input_args": {"text": "'WASHINGTON  —   When it came time to make his case for the judgment of history, President Barack Obama had a ready rebuttal to one of the most cutting critiques of his time in office. Although friends and foes alike faulted him for not following through on his threat to retaliate when Syria gassed its own people in 2013, Mr. Obama would counter that he had actually achieved a better result through an agreement with President Bashar   to surrender all of his chemical weapons. After last week, even former Obama aides assume that he will have to rethink that passage in his memoir. More than 80 civilians were killed in what Western analysts called a sarin attack by Syrian forces  —   a chilling demonstration that the agreement did not succeed. In recent days, former aides have lamented what they considered one of the worst moments of the Obama presidency and privately conceded that his legacy would suffer. “If the Syrian government carried out the attack and the agent was sarin, then clearly the 2013 agreement didn’t succeed in its objective of eliminating Bashar’s C. W.,” or chemical weapons, said Robert Einhorn, who was the State Department special adviser for nonproliferation and arms control under Mr. Obama before the agreement. “Either he didn’t declare all his C. W. and kept some hidden in reserve, or he illegally produced some sarin after his stock was eliminated  —   most likely the former. ” Other former Obama advisers questioned the wisdom of negotiating with Mr. Assad and said last week’s attack illustrated the flaws in the deal, which was brokered by President Vladimir V. Putin of Russia as a way to prevent the United States from using force. “For me, this tragedy underscores the dangers of trying to do deals with dictators without a comprehensive, invasive and permanent inspection regime,” said Michael McFaul, who was Mr. Obama’s ambassador to Russia. “It also shows the limits of doing deals with Putin. Surely, the Russians must have known about these C. W. ” Putting the best face on it, former Obama advisers said it was better to have removed 1, 300 tons of chemical weapons from Syria even if Mr. Assad cheated and kept some, or later developed more. “Imagine what Syria would look like without that deal,” said Antony J. Blinken, a former deputy secretary of state. “It would be awash in chemical weapons, which would fall into the hands of ISIS, Al Nusra or other groups. ” Still, the administration knew all along that it had probably not gotten all of the chemical weapons, and tried to get Russia to help press Syria, without success. “We always knew we had not gotten everything, that the Syrians had not been fully forthcoming in their declaration,” Mr. Blinken said. Even before last week’s chemical attack, many veterans of Mr. Obama’s team considered his handling of Syria his biggest failing and expressed regret that their administration did not stop a war that has left more than 400, 000 dead and millions displaced. Many of them even praised President Trump for taking the very action that Mr. Obama refused to take four years ago, by ordering a cruise missile strike against Syria. “Donald Trump has done the right thing on Syria,”   Slaughter, the director of policy planning in Mr. Obama’s State Department, wrote on Twitter. “Finally!! After years of useless handwringing in the face of hideous atrocities. ” Tom Malinowski, an assistant secretary of state for human rights for Mr. Obama, wrote in The Atlantic, “The lesson I would draw from that experience is that when dealing with mass killing by unconventional or conventional means, deterrence is more effective than disarmament. ” Mr. Obama grappled with Syria for much of his tenure but resisted being directly drawn in, for fear of thrusting America into another Middle East quagmire without solving the problem. The most searing moment came in 2013, when Mr. Assad’s forces killed 1, 400 civilians with chemical weapons, brazenly crossing what Mr. Obama had said would be his “red line. ” Mr. Obama prepared a military strike to retaliate, but hesitated amid domestic opposition in both parties and asked Congress to decide whether to proceed. When it became clear that Congress would not give its approval, he grabbed onto a political lifeline from Mr. Putin, who proposed a deal in which Mr. Assad would give up his chemical weapons arsenal. Under the deal, Syria joined the Chemical Weapons Convention, and over the next nine months, vast stores of lethal poisons were removed and ultimately destroyed. In June 2014, the Organization for the Prohibition of Chemical Weapons certified that all of Syria’s declared weapons had been removed. Two months later, when the last chemicals were destroyed, Mr. Obama celebrated. “Today we mark an important achievement in our ongoing effort to counter the spread of weapons of mass destruction by eliminating Syria’s declared chemical weapons stockpile,” he said in a statement. In the months to come, Mr. Obama and his aides pointed to that agreement in response to criticism that he had failed to enforce his red line. “Well, it turns out we’re getting chemical weapons out of Syria without having initiated a strike,” Mr. Obama said in April 2014. “So what else are you talking about?” Three months later, Secretary of State John Kerry said, “With respect to Syria, we struck a deal where we got 100 percent of the chemical weapons out. ” And three months after that, Mr. Kerry said Mr. Obama’s threat of force had made it possible to “cut the deal that got 100 percent of the declared chemical weapons out of Syria, and people nevertheless have been critical  —   one day of bombing versus the virtue of getting 100 percent of the chemical weapons out of Syria. ” As late as this January, Susan E. Rice, Mr. Obama’s national security adviser, said on NPR: “We were able to find a solution that didn’t necessitate the use of force that actually removed the chemical weapons that were known from Syria in a way that the use of force would never have accomplished. We were able to get the Syrian government to voluntarily and verifiably give up its chemical weapons stockpile. ” Publicly, Mr. Obama’s advisers sometimes referred to “known” or “declared” stockpiles to qualify their claims, and sometimes did not. But from the start of the deal, there were discrepancies in Mr. Assad’s weapons declarations. In February 2016, James R. Clapper Jr. the national intelligence director, told Congress that “we assess that Syria has not declared all the elements of its chemical weapons program. ” Moreover, Mr. Assad’s forces resorted to makeshift chlorine bombs, using a chemical that was not covered by the agreement and is not barred by international law, though its use as a weapon of war is. Mr. Blinken said the Obama administration had pressed the United Nations to respond, but Russia blocked such efforts. Critics say Mr. Obama oversold the agreement with Russia. “The defense was that he got all the C. W. out, and now that defense is shown to be plain false,” said Elliott Abrams, a deputy national security adviser to President George W. Bush. “If Obama administration officials knew that at the time, they were deliberately misstating the facts. I think Obama will never live this down, nor should he. ” Frederic C. Hof, who worked on Syria policy at the State Department under Mr. Obama before leaving and becoming a sharp critic of the administration, said the agreement remained defensible because it took weapons out of Mr. Assad’s hands. But Mr. Hof noted that Mr. Assad was still left “free to perform mass homicide by other means,” and that neither Mr. Obama’s deal nor Mr. Trump’s missile strike would stop him. “He now counts on the West again to leave him free to kill as long as he does so without chemicals,” Mr. Hof said. “If this is what happens, the U. S. airstrikes of April 7 will go down in history as a        gesture that did nothing to counter violent extremism, stop mass homicide or restore the reputation of the U. S. ”'"}, "time": 1742564416.5956106}