{"duration": 0.039957523345947266, "input_args": {"text": "'Putin Just Exposed US Election Rigging By Trolling The State Dept. In The Most Hilarious Way Oct 28, 2016 Previous post \\nProving he does, indeed, possess both a caustic wit and sharp political acumen, Putin just shut down the raging rigged elections controversy in what could best be called an epic prank to prove the point — Russia requested, and was unsurprisingly denied, permission to monitor the U.S. presidential election. \\nThink about it. This somewhat tongue-in-cheek offer, although likely made with the expectation of futility, makes several critical points on the true farcical nature of the American electoral process. \\nState Department spokesman Mark Toner, cited by USA Today , dismissively condemned President Vladimir Putin’s suggestion as a “PR stunt,” and Meg Casper, spokeswoman for Louisiana Secretary of State Tom Schedler, noted, “We’ve allowed observers from overseas in the past from other countries, never from Russia,” adding both the FBI and Department of Homeland Security “told us not to do this.” \\nBut the swift rebuke from the U.S. aligns more with its unprecedented since the Cold War anti-Russia propaganda campaign — a sensationalistic and proven fictitious narrative meant to inculcate Americans into believing Russia poses an imminent threat. \\nIn fact, with the Clinton campaign thoroughly capitalizing on the laughable narrative to warn Russia might attempt to rig the elections, and Donald Trump, rightly pointing to the former secretary of state’s efforts to rig the system from within and being accused of having ties to Putin, the State Department’s rebuke seems more a hypocrisy-tinged joke. \\nAs USA Today reports, “Toner noted that U.S. officials participated in a similar observation mission for Russia’s parliamentary elections in September.” \\nHow the U.S. State Department expects anyone to ignore this blatant moral duplicity — It’s Perfectly Acceptable When We Do It, But Not For Someone We Don’t Like — was not made immediately clear. \\nRussia would, by any measurable standard, have every reason to act as an election observer, despite being “categorically rejected” — all talk of the \\nFOR ENTIRE ARTICLE CLICK LINK'"}, "time": 1742563275.6472576}