{"duration": 0.0478060245513916, "input_args": {"text": "'Home / Badge Abuse / WATCH: California Cops Rob Every Penny from Innocent Family, Including their Children WATCH: California Cops Rob Every Penny from Innocent Family, Including their Children Claire Bernish November 2, 2016 Leave a comment \\nSan Diego, CA — James Slatic took every precaution possible to ensure his California medical marijuana business was in full compliance with local, state, and federal laws — and that appropriate taxes and fees, hundreds of thousands each year, were always paid on time. \\nBut despite conducting business professionally and legally, nearly 30 heavily armed San Diego police and DEA agents broke into and destroyed Med-West Distribution, stole all the legal products inside, confiscated his computers and servers — and proceeded to clean out his entire family’s life savings, including the accounts of his high school and college-aged daughters, and his 84-year-old mother’s safety deposit box. \\nBy obstinately refusing to acknowledge Med-West’s legal status, law enforcement used highly contentious federal civil asset forfeiture (CAF) law to rob the Slatics of everything they’d earned — including $324,000 in proceeds from the lucrative medical cannabis business, according to the Institute for Justice (IJ). \\n“This case is not about crime fighting,” IJ attorney Wesley Hottot, who now represents the Slatics, explained. “This case is about policing for profit, and it illustrates the abusive power of civil forfeiture at its worst.” \\nAs countless families and individuals around the country have been shocked to learn, the State can rob you blind, taking everything of value — bank accounts, vehicles, electronics, and even houses, etc. — without proof any crime has been committed. \\nJames Slatic has never been convicted or charged with any wrongdoing in the matter — but the nightmare of civil asset forfeiture doesn’t end with a lack of charges or conviction. In fact, attempting to reclaim property and cash can be a nightmare of red tape, court appearances and legal fees — and, even then, isn’t always a successful venture. And like so many others, Slatic had not been familiar with this legal, policing-for-profit scheme prior to his firsthand encounter. \\n“I’ve done nothing wrong,” he told the Institute for Justice. “It’s beyond frustrating that my family’s money was taken without any criminal charges being filed. My wife and teenage daughters had nothing to do with my business whatsoever, and the District Attorney took their college savings accounts. This is not just wrong; it is unconstitutional.” \\nWhile he certainly might be right, CAF is federal law — a brief reprieve in January, when the Department of Justice suspended the program, only lasted through early April — because the ability of police to steal people’s stuff and either use it or the proceeds from its sale is just too damned profitable. \\nIndeed, police and other agencies — particularly the Drug Enforcement Agency — make a killing in this legalized State robbery sham, and many departments have come to rely on CAF profiteering to bolster their funding. \\n“Civil forfeiture is one of the greatest threats to property rights in the nation,” said IJ attorney Allison Daniel, also representing the Slatic family. “Civil forfeiture takes the American principle of innocent until proven guilty and flips it on its head, treating property owners worse than criminals by making them prove their innocence.” \\nAt 7:30 in the morning on January 28, 2016 — as surveillance cameras outside and inside Med-West captured on video — the San Diego Joint Narcotics Task Force used a sledgehammer to break down the door of Slatic’s legal business, and stormed in, pointing automatic weapons at the heads of innocent employees inside. \\nNeedlessly and recklessly, around 28 officers took everything of value inside, destroying and scattering property in the process. \\nAs Slatic told IJ, in addition to assets stolen from the business, the greedy cops cleared family bank accounts of over $100,000 — leaving his daughters scrambling to pay for school supplies, like college textbooks, while putting their tuition and fees in jeopardy. \\nAnnette Slatic, James’ wife, who works as a nurse at the Veterans Administration, found out about the raid and financial seizure when she tried to pay for groceries that morning and had her card declined. Then her daughter, Penny, a high-schooler, tried to pay using her ATM card — and was also declined. Without notice, the Slatics suddenly found themselves essentially penniless and unsure how to afford basic needs. \\nNow they’re fighting to get everything back, since under California law, “probable cause” a crime has been committed must be established before officers can use civil asset forfeiture to seize property and cash. \\nAs the Institute for Justice explains, “Because police and prosecutors ignored Med-West’s status as a legal marijuana business, they did not have probable cause to seize the Slatics’ money. Even if Med-West had been an illegal operation (and it was not), the Slatics’ personal money is not connected to the business.” \\nPerhaps the Slatics will have better luck in getting justice than innumerable others who have been unfortunate enough to be victims of legalized robbery. \\nDespite massive controversy surrounding the program — and one of its creators now denouncing the policing-for-profit scheme it has become — civil asset forfeiture won’t be going anywhere soon. \\nWhile some states have severely curtailed cops’ ability to take your stuff, by implementing strictures requiring a conviction and similar limits, others have taken CAF to new levels. Oklahoma Highway Patrol began using a device called an ERAD , which scans bank and prepaid cards — right from a person’s wallet — to seize all cash in an individual’s account during a traffic stop if an officer even suspects a person of committing a drug-related offense. \\n“Three decades ago, I helped create our civil asset forfeiture system,” wrote Brad Cates in an opinion piece for the Wall Street Journal , “now it’s time to end it.” \\nThis is what it’s like to run a legal business, pay taxes, and follow the law in a Police State: Share'"}, "time": 1742628595.110115}