{"duration": 0.032628536224365234, "input_args": {"text": "'in: War Propaganda , World News (© Omar Sanadiki / Reuters) They’ve done it before without causing casualties or damage. According the Russian Foreign Ministry, terrorists fired two mortar rounds at the embassy’s compound. One shell exploded near the diplomatic mission’s entrance, damaging the building and four vehicles. The attack came from terrorist-controlled Jobar district. On Friday, the Security Council addressed the incident, saying its “members…condemned in the strongest terms another mortar shelling of the Embassy of the Russian Federation in Damascus (Syrian Arab Republic), which caused significant material damage.” They stressed the “fundamental principle of the inviolability of diplomatic and consular premises.” Host governments are obligated “to take all appropriate steps to protect diplomatic and consular premises against any intrusion or damage, and to prevent any disturbance of the peace of these missions or impairment of their dignity, and to prevent any attack on diplomatic premises, agents and consular officers.” Not easily done when countries are attacked by foreign-supported death squads, supplied with heavy weapons to wage war. Russian Foreign Ministry spokeswoman Maria Zakharova expressed concern over no “international reaction…but we will try to get it,” she said, including on the platform of international organizations, because we are talking about a diplomatic mission, about systematic terrorist attacks.” Russian upper house Federation Council Security and Defense Committee first deputy chairman Frants Klintesevich believes the latest shelling was conducted to disrupt Moscow’s humanitarian pause, saying it failed – nor can there be an “option of making any concessions to terrorists.” Separately, heavily US-led Western pressure got General Assembly members to vote Russia off the UN Human Rights Council – a body infested with major human rights abusers, including reelected member Saudi Arabia with over a three-fourths majority vote. Ignored was its genocidal war on Yemen, ruthless despotic rule tolerating no dissent, arbitrary arrests and imprisonments, torture and physical abuse, public beheadings and whippings, violence against women, along with other major violations of civil and human rights. Russia, Hungary and Croatia vied for two Eastern European seats. Moscow’s UN envoy Vitaly Churkin said “(i)t was a very close vote and very good countries competing, Croatia, Hungary. They are fortunate because of their size, they are not exposed to the winds of international diplomacy. Russia is very exposed. We’ve been in the UNHRC for several years, and I am sure next time we will stand and get back in.” Not easily as long as Washington maintains pressure to prevent it. US-led NATO’s undeclared war on Russia continues. Hillary’s ascension to power next year threatens to turn it red hot. Submit your review'"}, "time": 1742628402.8629518}