{"duration": 0.13115191459655762, "input_args": {"text": "'WASHINGTON  —   American lawmakers have for years been assailing companies for dodging taxes with overseas maneuvers. But now that the European Union has done something about it by trying to wrest billions of dollars from Apple, those officials have offered a response viewed by many as rife with hypocrisy: collective outrage. Tax avoidance has become a lightning rod as the presidential campaign has taken on a strong populist cast, and leading Republicans and Democrats in Congress have demanded that companies be forced to pay their fair share. Both Hillary Clinton and Donald J. Trump have vowed to crack down on deals that allow companies to relocate their headquarters overseas to lower their tax bills, and the Treasury Department has made limiting international loopholes a priority. Despite all that, Apple  —   a company long accused of being overly creative at avoiding taxes  —   now has the federal government standing up for it after the European Union’s executive commission ordered Ireland on Tuesday to collect $14. 5 billion in taxes from the company. And for at least some American politicians, the anger stems from a simple calculation: The tax money that the European Union extracts from Apple should be going to the United States Treasury, not that they have figured out how to make that happen. “It’s remarkable to think that the administration has been flying over to Brussels on taxpayers’ dollars to lobby the European Union against collecting taxes owed in Europe when they’re not collecting the taxes owed here,” said Clark Gascoigne, deputy director of the Financial Accountability and Corporate Transparency Coalition. “It’s terribly ironic. ” Most lawmakers and business groups do not see it that way. They defended Apple by arguing that the European Union was overstepping its authority and reinterpreting international tax law to unfairly penalize the company. Some called it a new brand of protectionism. The Treasury Department said the ruling was “deeply troubling. ” The Business Roundtable, a lobbying organization for America’s largest companies, called the move a “reckless and dramatic overreach” and an “act of aggression” against a company and a sovereign government. In Congress, lawmakers in both parties have urged the Treasury Department to be tougher on European officials as they aggressively investigate what they call undue tax benefits given by member nations to leading American companies. Members of the Senate Finance Committee sent a letter in May to Jacob J. Lew, the Treasury secretary, urging him to consider retaliation that would include doubling taxes on companies and individuals in Europe. The European Commission “is using a theory to make tax law, is doing it in a way that is retroactive and that overrides national tax law authority, in our view,” Mr. Lew said Wednesday at a Brookings Institution event previewing this weekend’s meeting in China of the Group of 20 largest industrial economies. He pushed back against the idea that Treasury is condoning tax evasion, saying legislation that prevents companies from parking income overseas to avoid being taxed in the United States “will see action probably not in my tenure but early in the next administration. ” The European Commission’s ruling has even managed to forge a rare moment of agreement between the House speaker, Paul D. Ryan, Republican of Wisconsin, and Senator Chuck Schumer, a New York Democrat who is likely to become the next leader of his party in the Senate. “This decision is awful,” Mr. Ryan said in a statement. “Slamming a company with a giant tax bill  —   years after the fact  —   sends exactly the wrong message to job creators on both sides of the Atlantic. ” Mr. Schumer said in an interview that he and Mr. Ryan had been discussing possibilities for a corporate tax overhaul for next year. He said he was optimistic about the prospect of requiring corporate money to return to the United States at a lower tax rate, with some of the proceeds being used to fund a large investment in infrastructure. The action taken by the European Union, he said, should be an impetus to get moving on such legislation. “The European Union is going to grab this money, instead of the U. S.,” Mr. Schumer said. “It’s a big signpost here for us. Let’s get moving. ” He added: “We’re trying to protect our U. S. tax base. That money sitting over there should be here in the U. S. not in Ireland and not in the E. U. ” The bipartisan “consensus” that the corporate tax rate should be cut in exchange for loopholes closures emerged in President Obama’s first term, yet Congress has not formally drafted a bill, much less voted on one. Tax experts said that without a deep cut in the tax rate, companies like Apple would be better off paying back taxes in Europe than repatriating their overseas cash. “This is not taking 13 billion euros out of the U. S. Treasury’s pocket and U. S. taxpayers’ pocket and putting it into Europe,” said Jeffery M. Kadet, a tax lecturer at the University of Washington School of Law. “They wouldn’t be bringing this money back to the U. S. anyway. ” Reuven S.   who directs the international taxation program at the University of Michigan Law School, said that the European Union had a strong case for collecting the taxes from Apple and that if the situation were reversed, Americans would be clamoring to collect taxes from a foreign company. “Just because it happens to be an American company, to say that the European Union should not take action, I think, is the height of hypocrisy,” Mr.   said. While most lawmakers condemned the treatment of Apple, one prominent former senator said he was pleased to see Europe take action. Carl M. Levin, Democrat of Michigan, who was chairman of the Senate Permanent Subcommittee on Investigations when it examined Apple’s use of tax havens in 2013, said the European Commission should fill the vacuum left by lackadaisical tax enforcement in the United States. “The royalties Apple collects for its overseas sales of products designed and developed in the U. S. should be taxed in the U. S.,” Mr. Levin said. “But Apple has avoided the billions of dollars of taxes it owes the U. S. by transferring its intellectual property to itself in Ireland. ” Blaming Apple and the Internal Revenue Service, he added, “When Apple used those tax avoidance schemes, it is understandable that Europe would try to go after them. ” It remains to be seen if corporate tax reform will be a priority for the next administration, but the language used by both Mrs. Clinton and Mr. Trump on the campaign trail suggests that it is a strong possibility. Mrs. Clinton has released a formal proposal to prevent   corporate inversions and to reward companies that keep their operations in the United States. Mr. Trump, who has called for a boycott of Apple products, has threatened to punish companies that relocate to other countries by imposing taxes on products they sell in the United States. The news that a corporate giant might have evaded billions of dollars in taxes could become another populist rallying cry. “There’s a reason Donald Trump and Bernie Sanders did so well in the campaign this year,” Mr. Gascoigne, of the Financial Accountability and Corporate Transparency Coalition, said. “People are fed up with the kinds of   deals that are happening at the large multinational companies at the expense of the American people. ”'"}, "time": 1742562254.639944}