{"duration": 0.04727673530578613, "input_args": {"text": "'  \\nYet another woman has stepped forward to accuse Republican nominee Donald Trump of sexual assault. Ninni Laaksonen, crowned the 2006 Miss Finland , has become the fourteenth woman to come forward and accuse Trump of unwanted advances. Speaking to local newspaper Ilta-Sanomat, Laaksonen described how moments before she was set to appear on the Late Show With David Letterman , Trump came up to her and began groping her buttocks. \\n““Before the show we were photographed outside the building. Trump stood right next to me and suddenly he squeezed my butt. He really grabbed my butt. I don’t think anybody saw it but I flinched and thought: ‘What is happening?’” \\nLaaksonen later attended a party with other contestants. “Somebody told me there that Trump liked me because I looked like Melania when she was younger. It left me disgusted.” \\nThe story echos the complaints made by numerous women about Trump, who boasted on a hot mic of casually committing sexual assault on women he finds attractive. “I’m automatically attracted to beautiful women — I just start kissing them, it’s like a magnet…I don’t even wait. And when you’re a star, they let you do it. You can do anything… Grab ’em by the pussy” said Trump to Entertainment Tonight’s Billy Bush. \\nThat admission opened the floodgates as dozens of women came forth telling stories that all reinforce each other’s credibility, painting a portrait of a serial predator who treats women’s bodies as objects for him to grope and force himself upon as he pleases. His response to the allegations has been to demean the women, insult them for their looks, and threaten to sue them for “libel.” The consistency of the women’s accounts taken in the context of his own words should leave little doubt in the mind of the American voter of who is telling the truth here.'"}, "time": 1742563915.9901936}