{"duration": 0.1646723747253418, "input_args": {"text": "'In this time of relentlessness and ubiquity, there is no art more potent, or shocking, than the art of disappearance. Silence may not be Frank Ocean’s greatest gift, but it’s one the RB singer has wielded effectively for most of the four years since his last album, “Channel Orange. ” The reactions to his evaporation from public life have been most intriguing to watch  —   his denial has been seen as a necessary balm against the scrutiny of fame, and then, after a while, a sort of insult, and finally, in the   to his   projects, a possible sign of failure on the horizon. Lest you mistake the silence of creative gestation for the silence of lethargy, Mr. Ocean has now swapped scarcity for abundance. Since Thursday, he has released, in effect, two new albums  —   “Blonde” and a “visual album” called “Endless,” both exclusive to Apple Music  —   a video for the song “Nikes,” and an oversize art magazine, Boys Don’t Cry, which includes a CD version of “Blonde” and was made available free at   shops in four cities. Though “Endless,” with its meaningfully slow   video of Mr. Ocean building a staircase, came first, the pairing of “Blonde” and Boys Don’t Cry captures the range of Mr. Ocean’s ambitions and gifts. “Blonde” is dewy, radiant and easeful, with an approach to incantatory soul that evolves moment to moment. It’s feverish but unhurried, a slowly smoldering set that’s emphatic about loneliness. “I couldn’t gauge your   can’t relate to my peers,” Mr. Ocean sings on “Seigfried. ” Mr. Ocean writes impressionistically, and sings with a casual sternness, as if sauntering into the studio, smearing out an idea running through his head, then retreating. That’s reflected in the range of vocal approaches he takes on “Blonde”:   exhalation, digitally manipulated childlike singing, forceful spoken word,   rapping, obscured conversation. Mr. Ocean’s previous projects  —   the 2011 mixtape “Nostalgia, Ultra” and the 2012 album “Channel Orange”  —   were products of an intuitive songwriter and a singer just getting comfortable with the outer boundaries of his power. “Blonde” and “Endless” show someone willing to forsake that progress in service of perfecting a mood. He excels on the ecstatically relaxed “Pink + White” and the mildly    “Self Control. ” On the puppyish “Solo,” he’s as close to content as he gets here mostly, he labors over romantic scenarios that leave him vexed, or worse. So often on this album, he’s pleading for recognition: “I’ll sleep between y’all, it’s nothing” (“Self Control”) “I’m not him but I’ll mean something to you” (“Nikes”). “Blonde” is also not precious about the sanctity of Mr. Ocean’s perspective. It includes a scolding voice mail from a mother (possibly Mr. Ocean’s) to a son a story narrated by the French producer Sebastian about the paranoia of the digital age and a kinetic,   verse from André 3000 on “Solo (Reprise)” that swallows all the air around it. Yet at the same time, Beyoncé and Kendrick Lamar are here, in largely ceremonial roles. (A list of album collaborators appears in the magazine, but full writing and production credits were not immediately made available.) In 2016, the condition and circumstances of an album’s release are integral to its reception. For Beyoncé, the sudden drop of “Lemonade” underscored her militaristic precision for Kanye West, the   album “The Life of Pablo” reflected his artistic restlessness for Rihanna, the stumbled rollout of “Anti” matched her confident indifference. From a distance, Mr. Ocean’s return came in fits and starts, with release plans hinted at, then abandoned. But what Mr. Ocean has achieved with the complexity of this rollout  —   as well as his ability to mold corporate motives to his benefit  —   is an almost complete reframing of his public narrative. Mr. Ocean is now a photographer. A screenplay writer. An essayist (his Tumblr posts after the Orlando shooting and Prince’s death have been cleareyed and devastatingly felt). And in the video of “Endless,” a carpenter. (One of the more fun artifacts of Mr. Ocean’s absence  —   and there are many  —   was a tweet, recently rediscovered, written in March by a woman who met a man at a bar who boasted of teaching Mr. Ocean how to build a staircase. He wasn’t lying.) Much of this comes in Boys Don’t Cry, which is an impressively polished and elaborate data dump of Mr. Ocean’s nonmusical taste. The aesthetic is decidedly indebted to the peak Tumblr era of a few years ago, a jumble of ideas inspired by the curiosity fostered and satiated by the internet. Over 300 pages long, it includes a   printed with Jenny Holzer’s “Truisms” (which he wears in the “Nikes” video) a photo spread of Kanye West picking up McDonald’s at a   in a Lamborghini another photo spread detailing what appear to be the   specifications in the studio of the artist Tom Sachs and what look like internet search histories collected from Mr. Ocean and some of his collaborators. Much of the magazine is given over to the eroticism of the automobile  —   there are photos of Mr. Ocean looking blissful around cars, a spread of racecar drivers deep in thought, a striking photo shoot of nude young Chinese men draped on and in a compact sedan. In an essay at the beginning of the magazine, Mr. Ocean suggests his car fixation might be part of “a deep subconscious straight boy fantasy,” but then adds, “Consciously though, I don’t want straight  —   a little bent is good. ” Mr. Ocean announced on his Tumblr in 2012 that when he was 19 he fell in love with a man. Sexual fluidity and ambiguity play key parts in the new projects. The magazine features both nude men and women, and there are small references to gender nonconformity throughout these works: a shot of Mr. Ocean wearing strong eyeliner in the “Nikes” video, and another in the middle of a   photo shoot in the magazine or a sample of the drag icon Crystal LaBeija, taken from the documentary “The Queen,” on “Endless. ” And most vividly, his album is called “Blonde,” but its cover reads “blond,” alongside a photo of Mr. Ocean, his short hair dyed neon green  —   the feminine, the masculine, the none of the above. This elasticity extends to the music, which avoids easy formatting, in terms of structure. On this record, there is nothing like “Thinkin Bout You,” his biggest hit  —   no song that centers Mr. Ocean’s very real gift for melody. Instead, Mr. Ocean moves from feeling to feeling, hurt to hurt, not stopping long enough to privilege any one moment. On iTunes, you can only buy “Blonde” as a whole, conveniently both a comment on its unity and also a clear commercial tactic  —   with four years in the shadows, Mr. Ocean has perfected the navigation of the intersection of corporate and emotional concerns. This is perhaps the truest way to release music in 2016, especially for an artist who inspires fervor at the level Mr. Ocean does: Use the available tools to fill the vacuum of your own making, not the one made for you. On “Futura Free,” he tells off the world: “I ain’t on your   ain’t on no schedule. ”'"}, "time": 1742561890.8182445}