{"duration": 0.1131296157836914, "input_args": {"text": "'Citizen journalism with a punch How NATO Is Trying to Sabotage the Turkey-Russia Reset \\nDeployments to the Black Sea and rhetoric on Aleppo are serving one important goal -- placing pressure on Turkey to backpedal on rapprochement with Moscow Originally appeared at Indian Punchline \\nThe Secretary-General of the North Atlantic Treaty Organization (NATO) Jens Stoltenberg in his ‘doorstep statement’ today on the 2-day meeting of the alliance’s defence ministers in Brussels said, inter alia, that an agenda item concerns “making progress on plans” for more NATO presence in the Black Sea region. He cited Russia’s belligerence as the rationale for such move. Interestingly, there was much emphasis on the Russian operations in Syria in Stoltenberg’s media briefing. ( Transcript ) \\nPrima facie, Syria is not ‘NATO territory’, but a linkage is being established between NATO posturing toward Russia and the latter’s military presence in Syria. This can only happen at the behest of the United States, because Stoltenberg wouldn’t even sneeze sans green signal from Washington. \\nOf course, generally speaking, boosting the ‘enemy’ image of Russia is useful and necessary for Washington to keep the alliance going, since the member countries are otherwise loathe to increase their defence budgets to 2% of GDP. The US also calibrates the NATO posturing toward Russia to curb any proximity developing between individual European countries and Moscow at the bilateral level as well as to ensure that the sanctions against Russia will remain in place. \\nHowever, the plan to discuss Black Sea deployment as well as Stoltenberg’s emphasis on Aleppo also appears to serve another US objective – namely, put pressure on Turkey to delimit its strategic autonomy vis-à-vis Syrian conflict. \\nSignificantly, NATO intervened publicly – alongside an American demarche – to force Spain to refuse refuelling for the Russian flotilla of warships (including aircraft carrier Admiral Kuznetsov) heading for eastern Mediterranean. This has been justified on the ground that with beefed up military prowess, Russian operations in Aleppo might intensify. ( RT ) \\nThe alibi that NATO has advanced is laughable – namely, humanitarian considerations – given the alliance’s brutal war crimes in Libya and its role in the gruesome murder of Muammar Gaddafi. Seumas Milne wrote in Guardian newspaper at that time, ‘If there were global justice, NATO would be in the dock over Libya.’ ( Guardian ) \\nSo, why is Stoltenberg acting like this? The answer is, Spain’s rethink on refuelling the Russian flotilla on the basis of a NATO demarche, is intended to create a precedent that will also be applicable to Turkey. Indeed, Washington is having a difficult time to ‘manage’ Turkey. Turkish President Recep Erdogan is on guard vis-à-vis Washington ever since Ankara concluded that the US had a hand in the July 15 attempted coup to overthrow his government. Turkey’s Deputy Prime Minister Numan Kurtulmus had some strong words for the Obama administration when he left Ankara for Washington on Tuesday on a mission to put more pressure on Washington to extradite the Islamist preacher Fetullah Gulen. (Hurriyet) \\nBut then, wouldn’t Ankara know that Washington simply cannot extradite Gulen who has worked for the CIA? Of course the Turks would know that alright. So, it is a catch-22 situation. Gulen has become a lump stuck in Uncle Sam’s throat. Read a caustic commentary by the pro-government Sabah newspaper titled What happens if Washington refuses to extradite Fetullah Gulen? \\nTo be sure, Turkey’s role in any plans on NATO deployment in the Black Sea will be crucial because of its prerogatives under the Montreaux Convention (1936), which severely restricts the traffic of warships (other than Turkey and Russia’s) through the Bosporus. In principle, Turkey will be obliged to go along with any NATO plans to step up deployment in the Black Sea. But in reality, Turkey would know that Moscow expects it to fully and faithfully observe the provisions of the Montreaux Convention. You bet Erdogan will twiddle thumbs and keep Stoltenberg waiting in the ante-room, no matter the decision to accelerate NATO deployment in the Black Sea. \\nClearly, the US hopes to somehow insert NATO into the Turkey-Russia rapprochement. Washington feels uneasy that Erdogan and Russian President Vladimir Putin are effectively coordinating their approaches to the Aleppo situation. What emerges out of all this is the desperate extent to which Washington will go to stall the progress of the Russian-Syrian mlitary operations to liberate Aleppo from the al-Qaeda affiliate Nusra. Conceivably, the Obama administration would prefer to somehow keep the Syrian situation fluid for Hillary Clinton to do what she promises to do — namely, revive the ‘regime change agenda in that country, if need be through a US military intervention. (See the piece in Telegraph titled Hillary Clinton will reset Syria policy against ‘murderous’ Assad regime .) \\nErdogan disclosed today that the Turkish military operations in northern Syria will steer clear of Aleppo. He said he has discussed the matter with Putin. At the same time, he gave a punch to Washington by revealing that Turkey next intends to target Manbij in northern Syria with a view to drive out from the city the Syrian Kurdish militia, who happen to be the US’ closest ally on the Syrian chessboard. ( Hurriyet ) Did you enjoy this article? - Consider helping us! Russia Insider depends on your donations: the more you give, the more we can do. $1 $10 Other amount \\nIf you wish you make a tax-deductible contribution of $1,000 or more, please visit our Support page for instructions Click here for our commenting guidelines On fire'"}, "time": 1742561661.9773974}