{"duration": 0.26175785064697266, "input_args": {"text": "\"=By= Simon Wood Editor's Note Simon Wood writes an excellent dissertation on lesser evilism and how it integrates with the current rendition of destructive capitalism. He is very correct that people in the US are too easily convinced that they only have a choice of two candidates – the two put forward by they duopoly. There are other parties and candidates, and voting for them is not a waste of a vote. Of course, it helps a lot if folks get involved before they submit their ballot. “How many more of these stinking, double-downer sideshows will we have to go through before we can get ourselves straight enough to put together some kind of national election that will give me and the at least 20 million people I tend to agree with a chance to vote FOR something, instead of always being faced with that old familiar choice between the lesser of two evils?” – Hunter S. Thompson (Fear and Loathing on the Campaign Trail ’72) “Ever get the feeling you’ve been cheated?” – John Lydon \\nPeople died for your right to vote! \\nThis admonition – an example of social shaming (and hence control) – will be familiar to all thinking citizens daring to suggest that voting is meaningless when no viable candidate holds views or proposes policies that come anywhere close to their own. \\nAs with most methods of social control, the premise is a misrepresentation – in other words, a lie. Those brave, worthy souls who gave their lives died not for the right to vote, but the right to a meaningful and representative vote. It follows that there is no worse debasement of their sacrifice imaginable than the idea of voting for a perceived lesser evil; the ultimate insult to these martyrs is that people in their tens of millions vote willingly for evil because they feel they have no other choice – especially when the only candidates who stand a chance of winning represent no one but the most privileged and protected people in society. \\nPolitical control of the US has long been dominated by the two main parties. Administrations are dominated by men and women connected through revolving doors in a bewildering array of networks, lobby groups, think tanks, banks, corporations and institutions. All are rich and all benefit from the continuation of the status quo. Serious studies have concluded what every sentient American already knows: That the US is an oligarchy. That the two-party system is the means of offering the illusion of democratic choice. That a powerful elite remains in power whoever claims electoral victory. \\nThis fact alone renders irrelevant the vapid, insipid rants of ‘analysts’ and ‘experts’ on the relative strengths and flaws of Donald Trump and Hillary Clinton on mainstream cable shows and throughout the corporate media. It is distraction: white noise designed to elevate emotional responses and to reinforce loyalty to a viewer’s chosen team and disgust toward the enemy. In short – we are all being played. \\nThe term lesser evil is itself a misnomer. The principle of lesser evil is a key feature of realpolitik – a Machiavellian form of politics closely associated with the likes of war criminal at-large (and Nobel Peace Prize recipient) Henry Kissinger. It states that when faced with two unpleasant choices, it is rational to choose the least unpleasant. US voters are faced instead with what is known as a false dilemma – a situation where only limited choices are seriously considered, while in fact other choices are available like Jill Stein and Gary Johnson et al. \\nMany Americans can be forgiven for being unaware of this, conditioned as they are to dismiss as a ‘wasted vote’ the other available options: Namely third-party candidates and – the option most likely to earn you a people-died-for-your-right-to-vote scolding – the perfectly moral choice of spoiling one’s ballot or not voting at all, moral in that if a system in which you participate leads to unacceptable actions on the part of your government whoever you choose, you have the moral right – some would say responsibility – to refuse to participate. \\nFor those who support neither of the two candidates who can realistically win, this is a classic catch-22 situation – you lose whatever, and the establishment elites win whatever. At this point you are faced with a moral choice: Do you accept that you live in a fixed system or not? Do you want to live in a democratic society where every person has an equal voice or not? Are you OK living in a de facto tyranny of the rich and powerful? \\nMotivated – as most are in our late-stage capitalist societies – by self-interest, those sufficiently well-off, privileged or protected are likely to either accept this or at least avoid answering the question. Those who suffer under the system – and those motivated by conscience or altruism – will probably demur. But the evil genius in the apparatuses of indoctrination (education, media etc.) is that those who suffer – even those who suffer greatly – can be easily coaxed into supporting – often fanatically – one of the two wings of the Republican-Democrat duopoly. This is aided by the cognitive bias known as system justification , a social psychology construct that ‘proposes that people have several underlying needs, which vary from individual to individual, that can be satisfied by the defense and justification of the status quo, even when the system may be disadvantageous to certain people’. \\nIn practice one cannot escape from the fact that within the system as it stands, the duopoly – and therefore the power elites – will win. A simple glance at the current betting odds for all the presidential candidates makes that clear. Even if one votes with one’s conscience for, say, Green Party candidate Jill Stein, one does so in the knowledge that it can only ever be a protest vote and the duopoly will still win . One can discuss the many serious flaws in the US electoral system all day long but the duopoly will still win . \\nWe return then to ‘lesser evil’. Proponents of this principle who say that it is the only realistic choice ignore two vital points: \\nFirst, the definition of lesser evil itself is debatable when one compares Donald Trump and Hillary Clinton, both of whom have unfavorability ratings currently averaging 59% and 52% respectively, according to Real Clear Politics. [Note: polls like these can only be taken as a barometer]. \\nThe establishment line is firmly against Trump, targeting his contradictory and sometimes overtly fascistic or racist comments, his obvious boorishness and overall personality flaws, and his – real or not [which no longer matters in modern political discourse] – alleged indiscretions with women. \\nFor all these serious flaws, however, Trump has never held public office and can not therefore be judged on his record at the very highest echelons of power as Clinton can. Given that Clinton is strongly favored [according to bookmakers] to win the election, an objective analysis of her record is necessary for her supporters. This is not necessary for Trump, whose flaws are plastered all over the media daily in fine detail: Trump is Trump and the whole world knows it. The opposite holds for Clinton, who continues to benefit from media deflection of the recent WikiLeaks disclosures (where all emails are – according to the various talking heads and with zero evidence – either doctored or part of a Russian plot). Other WikiLeaks disclosures are simply ignored, and one CNN reporter even went so far as to lie outright to his viewers, telling them it was illegal to read the emails. \\nThe recent bombshell announcement by James B. Comey, the head of the FBI, that the Clinton email investigation – which was thought to be dead and buried in July – has been re-opened is potentially more damaging for Clinton, with the media unable to ignore the story. The response of the Clinton campaign and its sympathetic media has been to deflect attention away from Clinton and pile pressure on Comey, suggesting that he may have broken the law. \\nClinton was rebuked at a July press conference by Comey for the ‘extremely careless’ way in which she handled emails containing classified information on insecure servers, a violation of statutes. He nevertheless said at the time that the FBI would not recommend that prosecutors seek criminal charges against Clinton. \\nSuspicions that the FBI was going light on Clinton in return for undisclosed concessions were bolstered by a report in the Wall Street Journal this week: The political organization of Virginia Gov. Terry McAuliffe, an influential Democrat with longstanding ties to Bill and Hillary Clinton, gave nearly $500,000 to the election campaign of the wife of an official at the Federal Bureau of Investigation who later helped oversee the investigation into Mrs. Clinton’s email use. Campaign finance records show Mr. McAuliffe’s political-action committee donated $467,500 to the 2015 state Senate campaign of Dr. Jill McCabe, who is married to Andrew McCabe, now the deputy director of the FBI. The Virginia Democratic Party, over which Mr. McAuliffe exerts considerable control, donated an additional $207,788 worth of support to Dr. McCabe’s campaign in the form of mailers, according to the records. That adds up to slightly more than $675,000 to her candidacy from entities either directly under Mr. McAuliffe’s control or strongly influenced by him. The figure represents more than a third of all the campaign funds Dr. McCabe raised in the effort. \\n.. Mr. McAuliffe has been a central figure in the Clintons’ political careers for decades. In the 1990s, he was Bill Clinton’s chief fundraiser and he remains one of the couple’s closest allies and public boosters. Mrs. Clinton appeared with him in northern Virginia in 2015 as he sought to increase the number of Democrats in the state legislature. \\n… At the end of July 2015, Mr. McCabe was promoted to FBI headquarters and assumed the No. 3 position at the agency. In February 2016, he became FBI Director James Comey’s second-in-command. As deputy director, Mr. McCabe was part of the executive leadership team overseeing the Clinton email investigation, though FBI officials say any final decisions on that probe were made by Mr. Comey, who served as a high-ranking Justice Department official in the administration of George W. Bush. \\nProfessor of History Gary Leupp provides in his article ‘The Warmongering Record of Hillary Clinton’ a useful overview that should concern every citizen on the planet, including a more detailed description of her part in the destruction of an entire nation state: Libya. Highlights include: Clinton has been a keen advocate for the expansion of an antiquated Cold War military alliance that persists in provoking Russia. As New York senator Clinton endorsed the murderous ongoing sanctions against Iraq, imposed by the UN in 1990 and continued until 2003. She was a strident supporter of the Iraq War. She actively pursued anti-democratic regime change in Ukraine. She wanted to provide military assistance to the “moderate” armed opposition in Syria, to effect regime change, and after leaving office criticized Obama for not supplying more than he did. She has been an unremitting supporter of Israeli aggression, whenever it occurs. Hillary tacitly endorsed the military coup against elected Honduran president Manuel Zelaya in 2009, refusing to call it such (even though Obama did). [Please read original article for full details] Salon notes that a British Parliament report concluded that the NATO attack on Libya was based on an ‘array of lies’: “We have seen no evidence that the UK Government carried out a proper analysis of the nature of the rebellion in Libya,” the report states. “UK strategy was founded on erroneous assumptions and an incomplete understanding of the evidence.” The Foreign Affairs Committee concludes that the British government “failed to identify that the threat to civilians was overstated and that the rebels included a significant Islamist element.” \\nA Vox analysis of the recent WikiLeaks disclosures concluded that ‘leaked emails confirm Clinton Foundation blurred public/private lines and that the ‘disclosures detail Clinton’s coziness with Wall Street and top donors’. \\nA group of Reddit users compiled a sourced list of the 100 most serious WikiLeaks disclosures that – when read – utterly damns Clinton as one of the most corrupt politicians ever to run as US president – if not the most. \\nThe second truth that lesser evilists ignore is the undeniable fact that decades of pressing the lesser evil argument has succeeded only in bringing about more and more evil. Artist and filmmaker Mara Ahmed writes : Police brutality, mass incarceration, the breakup of families via record deportations, pre-emptive wars, remote-control wars, dirty wars, the deepening of the surveillance state and the widening of economic disparity, the continuing corporatization of the government and the poisoning and pillaging of the planet–these didn’t just start with Bush or slow down during Obama’s presidency. If anything, these policies were turned up a notch over the last eight years. \\nAny objective comparison of the US along with the overall global situation pre-9/11 and now shows a marked deterioration in all areas, with widespread violence at home and abroad now the norm. \\nA vast tissue of poor judgment, obfuscation and outright corruption. A long history of support for illegal wars and violent interventions based – again – on lies. Alleged collusion with terrorist groups for geostrategic gain. There are Americans who have received life sentences for crimes such as stealing socks, baby shoes or a slice of pizza under the Three-Strikes Laws of the 1990s, yet Clinton is not only spared investigation for this unfathomable web of likely criminality, but has even been allowed to run for the highest office in a nation of over 300 million people, where she would have executive control over the world’s most powerful military as well as the nuclear codes. Even worse – for the rest of the planet’s inhabitants – she has made no secret of her desire to pursue a more ‘muscular’ foreign policy than Obama. \\nTo any right-thinking, peace-loving person this is insane. Don’t expect many in the corporate media to agree with that analysis, however, as WikiLeaks has revealed the names of ‘at least 65 MSM reporters [who] were meeting with and/or coordinating offline with top Hillary advisors’. \\nJim Hoft writing at Gateway Pundit added: They were invited to top elitist dinners with Hillary Campaign Chairman John Podesta or Chief Campaign strategist Joel Benenson. The Clinton campaign sent out invites to New York reporters in April 2015 on their off-the-record meeting on how to sell Hillary Clinton to the public. \\nThose with experience debating Clinton supporters can confront them with all this and more but the response is always the same: “She might be bad, but Trump is worse”. \\nMara Ahmed writes : Lesser evilism is one thing but hardcore Clintonism is another. The complete break from reality (couched in inclusive, feminist language), the privileged belief that as long as we recycle our trash and drive fuel-efficient cars, we are going to be okay, and the lack of empathy with the pain we create in the world and at home, astonishes me. \\nThere is a larger issue here. Lesser evilism is a symptom of human malaise under the dominant system of predatory capitalism. That millions of people can even consider willingly casting a vote for a candidate as demonstrably corrupt as Clinton, whatever the justification (fear of Trump), instead of demanding something better only demonstrates how whipped into timidity and passivity the human spirit has become. \\nInstigators like Edward Bernays and others that have brought to life this monstrous system of control through fear and distraction are guilty of the single greatest crime in human history. For pay, power and fame, they have employed their knowledge and research of psychology and propaganda methods in full awareness of what the results would be. They have reduced vast swathes of humanity to mindless consumption addicts, have attempted to destroy the social bonds that define our species, and have caused the waste of billions of lives. The human brain – one of the greatest wonders in nature – which, through the ineffable interactions between intelligence, emotions and inspiration is capable of genius could have been employed to raise humanity into an enlightened age; instead it has been utterly wasted, used instead as a tool for dreaming up new ways to consume, as well as new ways of deceiving people to consume. \\nThat in itself is a horror, but this malaise has spread throughout the world and multitudes suffer hideously for it. The 21,000 people (many of whom are children) who die of hunger – an easily preventable condition – every day – a silent holocaust of the meek far removed from Western cameras. The children who die in US-instigated wars. The democratically elected governments subverted in CIA coups, often leading to decades of killing, torture and rape of the people. The environmental catastrophes. The mass extinctions. The use of torture. The use of depleted uranium and chemical weapons. The list is endless. \\nThe lesser evil scam has to end because the world is now at a critical juncture. The US elites, through their presidential puppets, are drawing the world into a potentially deadly confrontation with nuclear-armed Russia. Russian military doctrine makes it clear that nuclear weapons can be used as a response even to conventional attack on its soil: The Russian Federation shall reserve the right to use nuclear weapons in response to the use of nuclear and other types of weapons of mass destruction against it and/or its allies, as well as in the event of aggression against the Russian Federation with the use of conventional weapons when the very existence of the state is in jeopardy. The decision to use nuclear weapons shall be taken by the President of the Russian Federation. \\nEven a limited nuclear exchange could be catastrophic for life on earth. Lesser-evilists who lack the courage, foresight and historical awareness to try to force radical change from outside the system, to demand change in a mass, organised assault on the power elites, could soon be faced with a very unpleasant radical change not of their choosing sooner than they expect. If – when – Clinton presses for war with Russia, how will the lesser evil argument sound in the depths of a nuclear winter? \\nThere is lesser evil writ large. The US electoral system is gamed to ensure a win that means the psychopaths in Wall Street and the certifiable lunatics in the Pentagon and the CIA get to carry on doing what they’ve been doing for all our lifetimes. These people have demonstrated their disdain for risk, their greed, hubris and incompetence again and again. They are perfectly capable of bringing the whole planet down and us with it. \\nThe concept of freedom – a word now coughed out with a cynical laugh – has been replaced by a forest of empty slogans – soundbites for the soundbitten generation – that ape the commercial mantras which now dominate every facet of human existence. People trapped in the party political paradigm believe – with earnest naivete – that change can come from within the system, that if they wait long and ask politely enough, the elites will voluntarily – in some inexplicable act of humanitarianism – relinquish their stranglehold and hand over power to the humanitarians. \\nThis is dangerous idiocy. Change will never come from within. The key institutions are too deeply corrupted, infested with precisely the wrong types of people. Any short-term progress will be superficial and swiftly subsumed; any protest brutally crushed and/or co-opted. Inquire of Occupy. With a nuclear exchange now a real possibility – one that would kill almost every living thing on the planet – the time is now or never to stop playing the game. \\n“What has happened,” asks John Pilger, “to the great tradition of popular direct action, unfettered to parties? Where is the courage, imagination and commitment required to begin the long journey to a better, just and peaceful world? Where are the dissidents in art, film, the theatre, literature? Where are those who will shatter the silence? Or do we wait until the first nuclear missile is fired?” Syrian home reconstructed from bombed remains. \\nSimon Wood is a freelance writer covering human rights, geopolitics, civil liberties, democracy, propaganda and media criticism. His articles can be found at The 99.99998271% and The Daily 99.99998271% . You can also follow Simon through twitter or Facebook . Note to Commenters Due to severe hacking attacks in the recent past that brought our site down for up to 11 days with considerable loss of circulation, we exercise extreme caution in the comments we publish, as the comment box has been one of the main arteries to inject malicious code. Because of that comments may not appear immediately, but rest assured that if you are a legitimate commenter your opinion will be published within 24 hours. If your comment fails to appear, and you wish to reach us directly, send us a mail at: editor@greanvillepost.com \\nWe apologize for this inconvenience. Nauseated by the Had enough of their lies, escapism, omissions and relentless manipulation?\""}, "time": 1742628497.2289815}