{"duration": 0.13513422012329102, "input_args": {"text": "'Reality check media NATO to Further Militarize the Black Sea \\nA permanent presence of non-Black Sea NATO members in the Black Sea is on the horizon Originally appeared at Strategic Culture Foundation \\nThe October 26-27 NATO defense ministers meeting confirmed the decisions to beef up the military posture against Russia along its borders. The plans to boost presence in the Baltic States and Poland were approved at the bloc’s Warsaw summit in July but the issue of strengthening Black Sea presence was hung in the air. The idea of forming a \"Black Sea Fleet\" did not materialize. \\nThis time the defense chiefs agreed to significantly boost allied forces specifically in that region. The US, Canada, Germany, the Netherlands, Poland and Turkey indicated their willingness to contribute. Other countries are also expected to join. Romania and Bulgaria will host an increased air force presence, designed to undertake surveillance missions over the Black Sea. Starting next year, Romania also hopes to head a multinational force there. The UK, Canada and Poland will send aircraft to be based in the Romanian southeastern Mihail Kogalniceanu air base. \\nRomania, Bulgaria and Turkey are also expected to come forward with a plan to increase naval and air patrols in the area by the beginning of 2017. The US supports the Romania’s initiative to establish a multinational naval brigade in the region. The plans on enhancing Black Sea presence will be finalized during another meeting of NATO’s defense ministers in February. The proposals on two basic elements for the maritime component – a strengthened training framework and a coordination body for the Black Sea that reports to the specialized NATO command – are expected to be submitted for consideration by that time. \\nSofia and Bucharest would work together and define their takes on the increased NATO deployment in the Black Sea by December. With the naval brigade on the agenda, Bulgaria has agreed to participate with 400 troops in the multinational brigade in Romania. The unit is intended to facilitate the flow of forces throughout the region. \\nAccording to Doug Lute, US ambassador to NATO, that amounts to a new land presence in NATO’s southeast. Romania calls for a regular trilateral format of joint naval exercises in the Black Sea, along with Turkey and Bulgaria, with the eventual participation of non-littoral NATO members. US servicemen conduct periodic training exercises on Romanian and Bulgarian firing ranges. \\nNATO General Secretary Jens Stoltenberg said Georgia and Ukraine will be fully involved in the plans. According to him, «It is important to have close contact with partner countries like Ukraine and Georgia—being non-NATO members but NATO partners—and to dialogue with them regarding our increased presence in the Black Sea». \\nIn September, US and Bulgarian aircraft launched joint regular patrols in the Black Sea. The patrolling mission greatly increases the risk of an accident, especially with the Russian S-400 long range systems stationed in Crimea. \\nA NATO naval task force permanently deployed in the Black Sea will require non-Black Sea states to rotate their ships every 21 days, raising the cost of the operation, in line with the provisions of the Montreux Convention (1936). Bulgarian, Romanian, Ukrainian and Georgian navies can hardly make a significant contribution. It will put on the agenda the need for major NATO seafaring members hand over some of their own warships to them. One of the ideas under consideration is reflagging some NATO naval assets under the three Black Sea members’ flags to boost permanent naval capabilities in the theater. Politically, bringing together NATO and non-NATO ships together under one operational control is a highly provocative step towards Russia. \\nUS destroyers and cruisers visit the Black Sea from time to time to provide NATO with long range first strike capability. The Romania-based BMD system uses the Mk-41 launcher capable of firing Tomahawk long range precision-guided missiles against land assets. \\nThe NATO’s decision to beef up its presence in the Black Sea comes just four months after it unveiled the deployment of 4,000 soldiers to the Baltic republics and Poland, backed up by a rapid reaction force of some 40,000 troops capable of reaching the region in days. Romania already hosts a ballistic missile defense (BMD) with the plans under way to have another operational BMD system deployed on Polish soil in 2018. \\nThe NATO plans are doomed to be counterproductive bringing more escalatory than deterrent value. They will inevitably provoke Russia into taking measures in response. The Black Sea will become a region of uncontrollable arms race. For instance, with the NATO Aegis Ashore BMD system deployed, Romania has become a target for Russia’s military as it had been warned. \\nRather symbolically the announcement of the plans coincided with the news that Russia launched on October 26 Veliky Novgorod super-stealth submarine capable of striking land, sea and underwater targets - the latest addition to Russia’s Black Sea Fleet. Kolpino - another Varshavyanka-class submarine – will be launched in November. \\nThe Russian territory is protected by Russia\\'s Bastion-P (K-300P) anti-ship coastal defense missile systems equipped with Onyx missiles. \\nThese Mach 2.6 supersonic missiles are highly maneuverable, difficult to detect and have a range of nearly 300 kilometers. With the help of the Monolith-B radar station, the system is capable of obtaining over-the-horizon target designation many miles beyond the horizon. The long range cruise missile capable Su-24 supersonic attack aircraft are already deployed in Crimea. By deploying a naval group to the Black Sea, NATO puts it at risk. \\nThe militarization of the region against the background of high tensions is a very negative trend. An accident may spark a big fire. The just announced NATO plans testify to the intention of NATO’s leadership to turn the Black Sea into a \"NATO lake\" permanently patrolled by a naval task flotilla with air cover in the proximity of Russian border. The October 26-27 NATO defense ministers’ meeting illustrated the fact that the alliance is shifting to a Cold War-era security framework . \\nThe decision to militarize the Black Sea will make Russia and NATO balance on the brink of conflict instead of joining together in the fight against terrorists - the common enemy. The costly effort will require a lot of time and effort to make the world less safe.'"}, "time": 1742562308.054322}