{"duration": 0.02947378158569336, "input_args": {"text": "'  500,000 People Sign Petition Asking Electoral College to Pick Clinton as President Instead of Trump The petition, launched on Wednesday after Donald Trump was elected President, calls for the Electoral College to “ignore their states’ votes and cast their ballots for Secretary Clinton.” Although Trump won over the 270 necessary electoral votes to secure the Presidency, Clinton narrowly earned the nation’s popular vote.   11, 2016 A petition on Change.org calling for the Electoral College to elect Hillary Clinton as President has earned over half of the signatures needed for it to be sent to the governing body. EDITOR’S NOTE: As stupid as this seems on the surface, at this point, I am not taking anything for granted. Donald Trump voters across America need to be made aware of this, and even now be working against it. Remember that with the Clintons, it’s never over. Ever. And as Christopher Stevens and Vince Foster will tell you, these people will stop at nothing. And please be forewarned, while this petition strategy is far-fetched, it is not impossible. The petition , launched on Wednesday after Donald Trump was elected President, calls for the Electoral College to “ignore their states’ votes and cast their ballots for Secretary Clinton.” Although Trump won over the 270 necessary electoral votes to secure the Presidency, Clinton narrowly earned the nation’s popular vote . The Electoral College – which was first introduced in 1804 – is comprised of 538 electors. Each state’s number of electors is decided by its number of members in Congress, which is dependent on the state’s population. So, when American citizens cast their ballots, they aren’t directly voting for president – they’re voting for electors. This year, Trump took 279, to Clinton’s 228. Petition circulates for Clinton presidency: Most states use a “winner-take-all” system when it comes to electoral votes, although there is no Constitutional provision or federal law that requires electors to vote a certain way. Twenty-six states and Washington, D.C., do, however, “bind” their electors to vote for the promised candidate on Dec. 19 – in this case, Trump. In many cases, “faithless electors” are forced to pay a fine if they vote against the popular choice. Understanding what a “Faithless Elector” is: \\nIn order for Hillary’s supporters to be successful, they will need to sway a significant number of the Electoral College to become “faithless electors”. This video will make it clear what exactly that is and how the process works. Maine and Nebraska follow a different method , called the congressional district method, which allots two electoral votes to the popular vote winner, and additional votes for each congressional district won by the candidates. Crying Hillary Voters Compilation: Faithless electors have not ever reversed the presidency. The Change.org petition, which was at over 500,000 signatures on Thursday afternoon, said that Clinton supporters would be happy to pay any fees accrued by those who choose to be faithless electors. “Mr. Trump is unfit to serve,” the petition claimed. “His scapegoating of so many Americans, and his impulsivity, bullying, lying, admitted history of sexual assault, and utter lack of experience make him a danger to the Republic. Secretary Clinton WON THE POPULAR VOTE and should be President.” source  '"}, "time": 1742628559.0553813}