{"duration": 0.03996467590332031, "input_args": {"text": "'posted by Eddie During the Indian PM, Narendra Modi’s visit to the U.S.A, Facebook founder Mark Zuckerberg said that he had visited a temple in India during the initial days of Facebook when it was going through a tough patch. The temple which Mark mentioned was of the “Neem Karoli Baba.” Since its inception, the temple has been a magnet for tech honchos from across the globe. Mark was told about this temple by Steve Jobs –“Father of the Digital Revolution.” The temple is in the Kaichi Ashram, which is a beautiful secluded ashram located in the Kumoan hills in Uttarakhand. It was in June 1964 when the first temple was inaugurated. It is approximately 38 km from Nainital. The temples are open to everyone from 7 am to 6 pm and the temple is closed in winters for 4-5 months because it gets very cold there. Neem Karoli Baba Neem Karoli Baba was born in Akbarpur village in Uttar Pradesh. When he was 11 he was married to a brahmin girl and soon after his marriage he left his home. It is believed that by the time he was 17, he knew everything. Baba kept himself engaged in social work throughout his lifetime. Krishna das was his devotee Krishna Das(born as Jeffrey Kagel) came to India and became the devotee of Neem Karoli Baba and studied ancient Indian meditation practices. He is now devoted to singing and teaching of Kirtan. In India, he often visits Rishikesh for practicing Yoga and meditation. He was referred as the “Rockstar of Yoga” at the 2013 Grammy Awards. Julia Roberts started following Hinduism just after looking at his picture. Roberts said that her interest in Hinduism came from seeing a picture of Neem Karoli Baba. She said,” I was so drawn to this picture of a person and I did not know who he was or what he was but I felt a very strong interest.” Where did the Apple logo come from? Jobs visited India in 1974 as a hippie or what he called it a “spiritual retreat” and a philosophical quest. The Kainchi Ashram is the place where Steve got the vision to create Apple. Jobs said his visit to India was one of the experiences which he will never forget in his life. The Beatles and their Indian connection In February 1968 The Beatles traveled to Rishikesh to attend a meditation session at the ashram of Maharishi Mahesh Yogi. India from the very beginning has been the land of enlightenment and divine spirituality. He knew everything It is said that his word was the last on any matter. Soon after he said smallpox will be eradicated from this world, it really vanished and a postcard was released to mark this occasion. Watch the video here'"}, "time": 1742564045.7406497}