{"duration": 0.08557295799255371, "input_args": {"text": "'Area: Total of 0.44 sq. km. (109 acres).Population (July 2006 est.): 932.Ethnic groups: Italian, Swiss, other.Religion: Roman Catholic.Languages: Italian, Latin, French, various others.Literacy: 100%. Work force: 3,000 lay workers (reside outside the Vatican).GovernmentType: Papacy; ecclesiastical governmental and administrative capital of the Roman Catholic Church.Independence: Sovereign entity since medieval times (Lateran Pacts confirming independence and sovereignty of The Holy See signed with Italy on February 11, 1929).Suffrage: Limited to Cardinals less than 80 years old. EconomyBudget: Revenues (2005) $247 million; expenditures (2005) $243 million.Industries: Printing; production of coins, medals, postage stamps, a small amount of mosaics, and staff uniforms; worldwide banking and financial activities. This unique, noncommercial economy is also supported financially by contributions (known as Peter\\'s Pence) from Roman Catholics throughout the world, the sale of postage stamps and tourist mementos, fees from admissions to museums, and the sale of publications. The incomes and living standards of lay workers are comparable to, or somewhat better than, those of counterparts who work in the city of Rome.PEOPLE AND HISTORY Almost all of Vatican City\\'s citizens live inside the Vatican\\'s walls. The Vatican includes high-ranking dignitaries, priests, nuns, and guards as well as about 3,000 lay workers who comprise the majority of the work force. The Holy See\\'s diplomatic history began in the fourth century, but the boundaries of the papacy\\'s temporal power have shifted over the centuries. From the 8th century through the middle of the 19th century, the Popes held sway over the Papal States, which included a broad band of territory across central Italy. In 1860, after prolonged civil and regional unrest, Victor Emmanuel\\'s army seized the Papal States, leaving only Rome and surrounding coastal regions under papal control. In 1870, Victor Emmanuel captured Rome itself and declared it the new capital of Italy, ending papal claims to temporal power. Pope Pius IX and his successors disputed the legitimacy of these acts and proclaimed themselves to be \"prisoners\" in the Vatican. Finally, in 1929, the Italian Government and the Holy See signed three agreements resolving the dispute: A treaty recognizing the independence and sovereignty of the Holy See and creating the State of the Vatican City; A concordat defining the relations between the government and the church within Italy; and A financial convention providing the Holy See with compensation for its losses in 1870. A revised concordat, altering the terms of church-state relations, was signed in 1984.'"}, "time": 1742563192.2212095}