{"duration": 0.14310741424560547, "input_args": {"text": "'\\n\\nIt is 1860 and Stephen Douglas is running against Abraham Lincoln. Lincoln’s election will lead to a civil war. The pitfalls of catastrophic events were ever present.\\nIn 2016, it is Donald Trump vs. Hillary Clinton. It is becoming clear that the election of either candidate will set off civil unrest and possibly lead to a civil war.\\nWe are now just beginning to see a myriad of pieces fall into place in which will irrevocably divide this country for at least a generation.\\nWhen Hillary Clinton wins, the awakened American people, and some in the military will not accept this country being handed off to the UN and ultimately the Chinese. Hillary has no plan for America and the reason is clear. America has no future is she is elected by hook or crook.\\nIf Trump even gets close to winning, the forces are of the NWO are not going to forsake the continued raping of the American people and just give up. They will fight!\\nThe Electoral College Through out this week, I have documented case after case of voter fraud through the use of George Soros voting machines. Soros is omnipresent in the voting fraud fiasco. Also, I have broken a story about the attempted bribe of an elector in Arizona and this is only the beginning.\\nThis summer we will begin to hear rumors of the officials of the Electoral College being bought off by TPTB, for it is their vote, not the people, whose votes will elect the next President. Trump could win 70% of the vote and not carry one state if the Electoral College refuses to cast their vote in accordance with the popular vote. And you thought you lived in a Republican form of Democracy.\\nAs I just pointed out, there is always the question of “dirty” voting machines. Most pollsters will tell you that if the general vote is reported with more than 3-4% variation from the polls, one can easily demonstrate voter fraud. However, do you think TPTB, the criminal elite running this country, will care at this point that you know what they are doing? This is why they do the fake polls to condition us to the fact that Trump is losing. He is not, he is winning in a landslide. Further, the globalists always have their finger on the false flag button. This is why they have economic collapse, World War III, power grid down, a manufactured food crisis, etc., etc., etc., and the ultimate martial law to accompany any and all of these potentialities waiting in the wings.\\nRight now, UWEX 16 is practicing for Civil War and foreign troops are in play. UWEX 16 (i.e. Jade Helm 16) will be spreading to other states as announced in their operational plans. The Federal Reserve has met with Obama and Biden. The only thing that Obama could the Fed is the use of the military to put down any populist uprising over a stolen election or a false flag attack to prevent the election from happening.\\nNow, Paul Martin’s sources have learned and are communicating that there is a coordinated 18 state swat team drill. Could they be practicing for anything else but civil unrest over a stolen election? In short, if by some manner of Divine intervention, Trump wins, we will see massive terrorism in this country on an unprecedented scale from the Clinton Democrats and the terrorists we have let into the country through the Refugee/Resettlement program. I believe that Obama will not leave the White House and will impose his version of martial law, Executive Order 13603 style.\\nIf Clinton is able to steal the election, America is done and unfortunately, the streets will run red with blood.\\nMore Foreign Troops The knot in the noose, consists of the foreign troop movements that are taking place on our soil. I am getting repeated reports of large armored columns of UN vehicles being transporting or traveling on their own in the South stretching from Texas to Georgia. However, wide scale proof, with clear and convincing photos, not photo shopped, are lacking. Do I think that foreign military are planning for civil unrest in America? Yes, there is no question. I am encouraging all to keep their eyes open, take raw footage and transmit the raw footage to outlets like the The Common Sense Show .\\nYesterday, when I said on a radio interview that America is grave danger because of Trump securing the nomination, these are just a few of the things that I had in mind. Yesterday, I was reading about massive revivals in West Virginia. Pray that these revivals sweep the country because we, the American public are defenseless and our faith is our best defense.\\nConclusion Barring a miracle from the Almighty, the forces of subjugation have lined up against Trump and appear to have stolen the election. Pray, pray and pray some more that this 4th degree Coven Witch is not allowed to occupy the White House.\\nP lease Donate to The Common Sense Show \\n \\nPLEASE SUBSCRIBE TO OUR YOUTUBE CHANNEL AND DON’T FORGET TO “LIKE” US \\n\\n \\n\\nThis is the absolute best in food storage. Dave Hodges is a satisfied customer. Don’t wait until it is too late. Click Here for more information.\\n\\n\\n'"}, "time": 1742628542.9996192}