{"duration": 0.09106206893920898, "input_args": {"text": "'BALTIMORE  —   Nearly two years after the death of a black man in police custody led to violent riots here, the Justice Department and city leaders announced on Thursday a   agreement to impose greater oversight and training on a police force found to have routinely harassed minorities. Negotiators have been rushing for weeks to complete the deal before the Jan. 20 inauguration of Donald J. Trump and the expected confirmation of his attorney general pick, Senator Jeff Sessions. Both men are seen as hostile to police oversight agreements like the one put in place on Thursday, with Mr. Trump denouncing what he called the “war on police” during his presidential campaign. Justice Department negotiators are moving quickly to complete a second investigation in Chicago, which has also been wracked by violence and tension between the police and residents. The findings of that investigation could come as early as Friday. Announcing the Baltimore deal at City Hall, Attorney General Loretta E. Lynch said she was confident that the reforms mandated by the deal would take hold even if the Trump administration were to take steps to try to undo it. “This agreement is binding and it will live on,” said Ms. Lynch, flanked by Mayor Catherine Pugh, Police Commissioner Kevin Davis, Vanita Gupta, the head of the civil rights division at the Justice Department, and others. Mr. Davis said the pact provides “a path forward” that he said will benefit both his officers and the city’s residents and that it should serve as a model for thousands of other police departments in tackling tensions. Baltimore came under Justice Department scrutiny after an   man, Freddie Gray, 25, died of a spinal cord injury he received while in police custody in 2015 as he was being transported in a department van. The death led to widespread protests  —   Gov. Larry Hogan, a Republican, called in the National Guard to quell riots  —   and appeals for federal intervention. In the ensuing political fallout, the Democratic mayor, Stephanie   dismissed the police chief and six officers were charged in Mr. Gray’s death none were convicted. The episode roiled racial tensions nationwide amid a string of other deaths of black men in police confrontations nationwide, from Ferguson, Mo. to Staten Island. The Justice Department filed a   consent decree in federal court on Thursday just minutes before announcing the deal. A judge must approve it before the city and the Police Department begin putting in place more than a dozen changes, including improved training and technology, community oversight, and greater transparency in dealings between the police and the public. Once that is done, the crucial first step will almost surely fall to the Trump administration: working with the city to recommend an outside, independent monitor to determine whether Baltimore is adequately taking steps to address what a blistering Justice Department report in August found was systemic racial bias in its policing. Ms. Pugh, a Democrat who has been in office 33 days, recounted hectic, 1:30 a. m. phone calls with negotiators in the weeks leading up to the agreement. She called the results “a great day” for Baltimore. She made clear what she considered the most important element: “training, training, training, training. ” The agreement requires officers to go through 80 hours of training in practices like community policing and proper tactics for stops, searches and arrests. Another measure will require improved safety technology and video cameras inside police vans like the one used to transport Mr. Gray when he died. The Justice Department’s report on city policing last year found that officers routinely stopped large numbers of people in poor, black neighborhoods for dubious reasons, and arrested residents merely for speaking out in ways police officers deemed disrespectful. In Baltimore, a city that is 63 percent black, the report found that 91 percent of those arrested on discretionary offenses like “failure to obey” or “trespassing” were  . Blacks made up 60 percent of Baltimore’s drivers but accounted for 82 percent of traffic stops. Of the 410 pedestrians who were stopped at least 10 times in the five and a half years of data reviewed, 95 percent were black. The findings also painted a picture of a police culture deeply dismissive of sexual assault victims and hostile toward prostitutes and transgender people. The decree’s requirements are intended to prohibit unlawful stops and arrests, and to prevent discriminatory policing and excessive force. Representative Elijah Cummings, a Maryland Democrat, called the agreement “a chance to   trust” between residents and the police after a painful few years. DeRay Mckesson, a   voice in the Black Lives Matter movement who lives in Baltimore, said he was impressed by the decree’s wide range. “It is the first consent decree that I have seen that addresses the Police Department’s internal affairs division,” Mr. Mckesson said by text message, “and goes further to ensure that officers are not targeting poor citizens or citizens in historically ‘ ’ areas and addresses the response to citizens in crisis or with mental health challenges. ” Provisions of the decree prohibit the police from stopping people based solely on where they are, or how they respond to the presence of a police officer. The Supreme Court has ruled that officers can stop a person who flees from them in   neighborhoods. “This starts to push back on that line and says, ‘Look, we’re really reinforcing that people have a right to avoid contact with the police and the place they live shouldn’t be an important factor in how much Fourth Amendment protection they get,’” said David Jaros, an associate professor of law at the University of Baltimore. “But at the same time,” Mr. Jaros added, “it’s ambiguous as to what its reach is,” and whether it limits police actions further than existing law does. Tessa   the president of Baltimore’s branch of the N. A. A. C. P. said she was heartened to see that the Police Department had already implemented reforms  —   like testing body cameras and changing aspects of prisoner transport  —   and hoped the consent decree would bring more. But Tawanda Jones, the sister of Tyrone West, who died in 2013 after a struggle with the police, said the rush to finish the deal and the coming handover of power in Washington had eroded her faith that the decree would bring about meaningful change in Baltimore. “What does a piece of paper mean? It means nothing,” Ms. Jones said. “It’s not a training issue it’s a system that is broke. It’s a system that doesn’t hold people accountable. ”'"}, "time": 1742562903.9405673}