{"duration": 1.295295238494873, "input_args": {"text": "'By Daily News Bin | October 28, 2016 | 10 6265 SHARES \\nThe ranking Democrats in the House of Representatives have publicly given FBI Director James Comey a very short deadline for clarifying the intentionally vague and misleading letter he sent today and fixing the mess he’s created with eleven days remaining before the Presidential election. Led by Congressman Elijah Cummings, the ranking member on the House Oversight Committee, the House Democrats have made clear that they intend to finish Comey off if he doesn’t fix this in time. \\nCummings wasn’t clear what the specific consequences for James Comey will be if he fails to walk back his criminal actions. But during his CNN on-air appearance on Friday night, he did make clear that Comey only has until the end of this weekend in order to find a way to rectify the mess he’s made. The Democrats do not currently have majority control over the House Oversight Committee, making it difficult for them to haul Comey in for interrogation on Monday, as none of the Republicans on the committee would likely be willing to go along with it. However that can’t stop Cummings and the other Democrats on the committee from immediately moving forward against Comey in other ways. \\nAmong the various legal paths the House Democrats can pursue are the fact that James Comey violated the Hatch Amendment which makes it a crime to use ones position as a government official to try to rig a Presidential election; there is already Department of Justice action in this regard . Comey also severely violated the FBI’s own policy of never interfering in Presidential elections with less than sixty days remaining; in this instance there are just eleven days remaining. All eyes are now on Elijah Cummings and the House Democrats, who now have a clear intention of ending James Comey’s tenure if he continues down this illegal path beyond the weekend. If you enjoy Daily News Bin, consider making a contribution: Contributed by Daily News Bin staff 6265 SHARES '"}, "time": 1742564435.0097756}