{"duration": 0.1659083366394043, "input_args": {"text": "'Christopher David Leave a Comment \\nThere are many things that we assume are good for our health. We assume these things because it is the norm, and we have heard them for our entire lives. Most of them are true, but these assumptions about healthy living are not always beneficial. In fact, some of them could even be harmful. \\nWhat is even more disturbing than the falsity of our assumptions is the reason why they are “common knowledge” in the first place. For instance, we know that the normal human diet consists of three meals a day and occasional snacks. Right? \\nThe common assumption that we should eat three times a day, without fasting, may not actually be backed by science. Instead of research and scientific study, this assumption could be fueled by money. Lots and lots of money. \\nThis was the topic of recent TED Talks discussion with Professor Mark Mattson. Professor Mattson is a professor of Neuroscience at John Hopkins University. He is also the Chief of the Laboratory of Neuroscience at the National Institute of Aging. He is one of the foremost researchers in the study of the cellular and molecular mechanisms underlying neurodegenerative disorders such as Parkinson’s disorder and Alzheimer’s disease. Professor Mattson has received multiple awards and accolades for his contributions to these fields including Alzheimer’s Association Zenith Award. \\nSo basically, he’s pretty smart when it comes to brain stuff. During the TEDx, Professor Mattson described his research into fasting and the positive effects it could have on the human brain. It is a fascinating subject that makes one wonder why it is not more commonly discussed. Professor Mattson also delves into the reason for this, and it is a bit unsettling. Neurological Disorders \\nAccording to the Alzheimer’s Foundation of America , 5.1 million people in the United States may have Alzheimer’s disease as of 2015. Research shows that the the chance of developing Alzheimer’s doubles every five years over the age of 65. \\nAs the population is aging– particularly in the instance of the Baby Boomers– the incidence of the Alzheimer’s is rising. Between 2010 and 2050, the number of Americans over the age of 65 will increase by more than double. The number of people over the age of 85 will increase by more than triple. \\nAccording to Professor Mattson, the number of Americans with Alzheimer’s will triple by 2050. The disease does not only effect seniors or the elderly. It is estimated that over 500,000 people in the United States have some form of dementia, including Alzheimer’s disease. This is commonly referred to as “early onset” dementia. \\nOnce it develops, it is estimated that between one to four family members are required to act as caregivers to the individual with the disease. Even if you are not personally impacted by the disease, you probably know someone who is. There is also an increasing chance that you will be affected as you get older. \\nAlthough it is not as prevalent, there are similar statistics for other neurological disorders such as Parkinson’s disease . Currently, nearly one million people in the United States are affected by Parkinson’s, and the number is rising. Every year, nearly 60,000 new cases of Parkinson’s disease are diagnosed in the U.S. alone. \\nThe average age for the onset of the disorder is 60, but symptoms can progress for periods of longer than 20 years. Early onset instances of Parkinson’s disease generally occur around age 50 and account for approximately five to ten percent of diagnosed cases. \\nThese numbers do not even include other neurological disorders such as muscular dystrophy, multiple sclerosis and ALS (Lou Gehrig’s disease). Overall, it is estimated that over 6.1 million Americans suffer from some form of neurological disorder such as these. \\nAs of now, there is no known cure for any of them. That is why any possible method of prevention is vital. According to Professor Mattson, he believes he has found a way to do just that. Fasting and Reducing Caloric Intake \\nProfessor Mattson and his team have done extensive research and published multiple papers on how reducing caloric intake can extend lifespan. In his TEDx discussion, he mentions that they were able to increase the lifespan of laboratory animals by 30 to 40 percent simply by reducing how much they eat. This was due to slower degeneration of brain cells by energy intake. \\nWhile he does not simply state one should eat less to live longer, Professor Mattson does believe that periodic fasting can have a similar effect in humans. For centuries, humans have believed fasting to have both physical and spiritual benefits. As far back as Plato, anecdotal evidence exists of periodic fasting being a key factor in people living extended life. In Upton Sinclair’s 1911 book “ The Fasting Cure ,” he discusses several real-life instances of people who have experienced positive health results and recovered from disease as a result of fasting. \\nThe reason Professor Mattson believes that fasting has positive results for your brain is due to how your brain reacts to stress. During times of fasting, your brain will become stressed and develop “adaptive stress response pathways” that will help it cope with the lack of energy. These adaptation help your brain remain strong and resist neurological disease. \\nThere is also evidence of this in evolutionary terms. When an animal is deprived of food, its brain will activate these adaptive stress response pathways. Basically, it is a mechanism of the brain telling the animal: “Go get me some food.” \\nIn this way, fasting has similar effects as exercising. Like physical exertion, fasting creates a psychological challenge and stimulates the creation of neurotrophic factors. These are sciencey thingies that can help prevent the degeneration of nerve cells in your brain and even, in one of the brain, help to generate new ones. Fasting will also help to create “ketones” in the brain that provide an alternative fuel and increase the metabolism of the brain. \\nBasically, fasting causes your brain to exercise. Through this exercise, it grows stronger in its ability to fight degenerative diseases and retain cognitive abilities. So, why don’t we know this stuff? \\nAccording to Professor Mattson: \\n“Why is it that the normal diet is three meals a day plus snacks? It isn’t that it’s the healthiest eating pattern, now that’s my opinion but I think there is a lot of evidence to support that. There are a lot of pressures to have that eating pattern, there’s a lot of money involved. The food industry — are they going to make money from skipping breakfast like I did today? No, they’re going to lose money. If people fast, the food industry loses money. What about the pharmaceutical industries? What if people do some intermittent fasting, exercise periodically and are very healthy, is the pharmaceutical industry going to make any money on healthy people?” \\nAs he stated, this is only his opinion, but there is evidence that indicates the possibility of pharmaceutical companies interfering with medical research. \\nIn an article titled “Why Most Published Research Findings Are False,” John P.A. Ioannidis of the Stanford University School of Medicine argues just that. Particularly relating to the influence of large corporations and pharmaceutical companies in research, Ioannidis states a research finding is less likely to be true when there is “greater financial and other interest and prejudice.” \\nIoannidis also found that many current research studies simply reinforce current assumptions or prove the prevailing bias. Ionnadis and Mattson are far from alone in these beliefs. The Editor and Chief of The Lancet Dr. Richard Horton recently published a similar study showing that much of the scientific literature published today is either inaccurate, biased or simply untrue. According to Dr. Marcia Angell , the former Editor in Chief at the New England Journal of Medicine, “[the] pharmaceutical industry likes to depict itself as a research-based industry, as the source of innovative drugs. Nothing could be further from the truth.” \\nThe increasingly common belief that many of our common beliefs could be untrue is unsettling, to say the least. It has long been an accepted fact that financial gains influence almost every aspect of our culture, so it should not be hard to believe that they influence health research. Fasting for Brain Power \\nIf Professor Mattson and his team are correct about how reducing caloric intake can improve and protect our cognitive abilities, you will probably want to start doing so. However, it is important to be responsible and not just stop eating because you heard it would help your brain. If you did that, you might not have the best of brains anyway. \\nThere are many modern diets that already stress the importance of fasting and the health benefits that come with it. The method that Professor Mattson recommends is what is called the “5:2 Diet” method of fasting. Simply put, this involves eating normally for five days of the week and fasting for two. On the fasting days, you would eat approximately one quarter of the calories you eat on your regular days. \\nAs is the case with any new changes to your health habits, it is important to check with your doctor first. Particularly if you plan on implementing a big change like periodic fasting, it is also smart to do your research first. There are several books an millions of articles available on the subject to help you find which method works for you. Leave a Reply Your email address will not be published. Comment '"}, "time": 1742562136.808296}