{"duration": 0.03454113006591797, "input_args": {"text": "'Fox News \\nThe FBI has reopened its investigation into Hillary Clinton’s use of a private server while secretary of state after discovering new emails, in a stunning turn of events just days before the presidential election. \\nFBI Director James Comey wrote in a letter to top members of Congress Friday that the bureau has “learned of the existence of emails that appear to be pertinent to the investigation.” \\nCLICK HERE TO READ THE LETTER \\nComey did not detail those emails, saying only that they surfaced “in connection with an unrelated case.” \\nHe told lawmakers the investigative team briefed him on the information a day earlier, “and I agreed that the FBI should take appropriate investigative steps designed to allow investigators to review these emails to determine whether they contain classified information, as well as to assess their importance to our investigation.” \\nHe said the FBI could not yet assess whether the new material is significant and he could not predict how long it will take to complete “this additional work.” \\nA senior law enforcement official separately told Fox News the FBI decision is not linked to WikiLeaks messages or any hack, and the newly discovered emails did not come from the Clinton server – but from another device from another government official. \\nThe move comes after Comey and the Justice Department decided in July not to pursue charges over Clinton’s email practices, saying at the time that the investigation was finished. \\nComey has since come under criticism from Donald Trump, lawmakers and others who claim the investigation downplayed the mishandling of classified information during Clinton’s tenure. \\nTrump, speaking to cheering supporters Friday afternoon in Manchester, N.H., praised the FBI for having the “courage” to “right the horrible mistake that they made” – saying he hopes that is “corrected.” \\n“Hillary Clinton’s corruption is on a scale we have never seen before,” Trump said. “We must not let her take her criminal scheme into the Oval Office.” \\nIn a nod to the significance of the FBI’s announcement, Trump quipped: “The rest of my speech is going to be so boring.” \\nOther GOP lawmakers also weighed in, urging the bureau to pursue a thorough new probe. \\n“The FBI’s decision to reopen its investigation into Secretary Clinton reinforces what the House Judiciary Committee has been saying for months: the more we learn about Secretary Clinton’s use of a private email server, the clearer it becomes that she and her associates committed wrongdoing and jeopardized national security,” House Judiciary Committee Chairman Bob Goodlatte, R-Va., said in a statement. \\nRepublican National Committee Chairman Reince Priebus said the discovery must be “serious” for the bureau to investigate this close to the election. \\nClinton did not respond to questions from reporters about the development as she landed in Cedar Rapids, Iowa, and did not address the matter while speaking to supporters in the same city. \\nThe development comes 11 days before the general election, and is the latest shockwave to hit the race. Clinton had been gaining in the polls over Trump in the wake of the release of footage showing Trump talking about groping women and subsequent allegations of sexual assault and harassment against him. \\nHowever, daily revelations from hacked Clinton campaign emails obtained by WikiLeaks have become a headache for the Democrat’s campaign. The resumption of the FBI probe poses a potentially bigger problem. \\nRon Hosko, former assistant director of the FBI, told Fox News in a telephone interview that retired FBI officials were “livid” at Comey over the fact that charges were not brought against Clinton in round one of the investigation. \\n“He lit her on fire and then walked away,” Hosko said of Comey holding a news conference laying out Clinton’s mishandling of classified information but then not pressing criminal charges. \\nHosko said he still defends Comey for not pressing charges because the FBI always has to make a decision “based on what they have” at the time. Hosko said he thinks agents were probing a separate matter and found emails that made them say, “Oh my God look at what we have.” \\nHouse Speaker Paul Ryan called the FBI decision “long overdue.” BREAKING NEWS → The FBI is reopening its investigation into Secretary Hillary Clinton. \\nMy full statement ⇩ pic.twitter.com/LHfyg46dWk \\n— Paul Ryan (@SpeakerRyan) October 28, 2016 \\nBut former Obama administration spokesman Tommy Vietor chided the bureau on Twitter. How many emails did the FBI find? Get your butt in gear, read them, assess them, form a conclusion. Letting this hang is so irresponsible.'"}, "time": 1742628447.862137}