{"duration": 0.19306182861328125, "input_args": {"text": "'Retail department store Nordstrom’s decision last week to cut first daughter Ivanka Trump’s fashion line has sparked a tremendous backlash from consumers —  especially women —  who say the company’s move has led them to boycott the store and cut up their Nordstrom’s cards. [Nordstrom’s claimed that the Ivanka Trump brand wasn’t performing well, but industry insiders tell Breitbart News that’s just not accurate. Nordstrom’s decision to mislead the public on why they are stopping carrying the Ivanka Trump brand is part of the fury out there among its longtime customers, who tell Breitbart News they’re cutting up their Nordstrom’s cards and won’t shop at the store anymore. Some even say they plan to return all their recent purchases.  “We’ve said all along we make buying decisions based on performance,” Nordstrom’s press spokesperson told Fortune magazine last week. “In this case, based on the brand’s performance, we’ve decided not to buy it for this season. ” Nordstrom’s had previously taken a neutral approach to boycotters’ calls for the company to discontinue carrying the brand. An internal email sent last November 21 from company   Pete Nordstrom to employees affirmed they would continue carrying the brand, of which he wrote, “[It] has grown to be a sizable and successful business,” according to Fortune. The November email stated their policy on carrying products based on results: “If people don’t buy it, we won’t sell it. ” Nordstrom’s statement went on to state, “We strive to be agnostic about politics and to treat all our customers with respect. ” In response to media reporting on the email, Nordstrom’s told Fortune, “The email, though meant for an internal audience, captures everything we have to say on this subject. So far we have received many positive responses from our employees. ” A Nordstrom representative responded to requests for comment from Breitbart News via email by stating that it will keep selling whatever it has left of Ivanka Trump’s brand. “We’ve offered the brand in different categories and divisions (Shoes, Apparel, Accessories, full price and off price,   and online),” the Nordstrom representative said. “Because of variations of when previous buys were made, when they’re delivered and how fast they sell through, we’ll continue to have it available for a while. ” The representative refused to provide numbers of how many responses there were to the company pulling Trump’s brand after multiple requests. She also stated that there were no plans to reveal whether the responses were more negative or positive. But, in reality, the brand wasn’t performing badly. Nordstrom’s came under political fire from a series of hardcore   activists, according to People Magazine. “The luxury retailer, which has faced calls for months from the #grabyourwallet movement to drop Ivanka merchandise, said that Nordstrom switches out about 10 percent of its assortment each year to refresh it as a matter of course in running its business, culling lines that aren’t selling well enough,” People’s Stephanie Petit wrote on Wednesday. An industry veteran familiar with Nordstrom’s told Breitbart News that the claim Ivanka’s brand wasn’t performing well is, simply put, not true: This is a classic example of a retailer making a decision based on their fear of standing up to political pressure  —   even on a limited scale. It was clear from their actions since last fall that Nordstrom would prefer to sell out to loud liberal groups who weren’t even regular Nordstrom consumers, just to avoid controversy. It’s sort of amazing that a store which relies on women around the country would fold so quickly to a group with limited reach just to avoid controversy. You would think that Nordstrom would want to stand up for a well known women’s brand whose namesake is a role model for women entrepreneurs, who has consistently supported women’s issues, and represents all of the strength and conviction which women around the country admire. Insiders know how stores can easily play games with placement of merchandise and other ways to lower numbers, and its very possible Nordstrom did that here to cover themselves. It’s amazing that Nordstrom wouldn’t have learned the lesson to be more focused on the entire country and not a limited group of complainers. In fact, the company has been playing politics with   actions for some time now on other matters as well. An overtly political message came across in an internal memo sent last week from Nordstrom’s to its employees, a portion of which spoke to the President’s temporary travel restriction on those coming from seven   nations identified during the Obama Administration. The Seattle PI quoted a portion of the internal Nordstrom’s memo: Last Friday an executive order was signed by the President of the United States related to immigration. This subject is one we’re watching closely  —   our family’s heritage, the company’s roots, and the diverse employees and customers we serve are top of mind. When John W. Nordstrom came to the U. S. as an immigrant, he was given opportunities that allowed him to find a more prosperous and happy life. In so many ways, our humble beginnings and the work ethic and gratitude that goes with it helped shape the culture of our company to this day. Despite efforts by a handful of people to boycott Ivanka Trump’s line, her business manager Abigail Klem told the Guardian last year that the brand has seen “significant year over year revenue growth. ” “We are proud that our business is growing rapidly and that our brand resonates strongly with women who are inspired by our messaging and excited about the polished and chic   products that we offer,” Klem said. A majority of millennial women, according to a study from BrandKeys highlighted by Forbes last year, are sticking with the Ivanka Trump brand even if they don’t support her father’s policies.   percent of the millennial women surveyed said they were either “extremely likely” or “very likely” to purchase Ivanka Trump fashion products when asked: “In light of Ivanka Trump’s involvement with the Trump campaign for president, how likely would you be to consider buying her line of shoes or clothing?” Another 32 percent added they were “somewhat likely,” meaning a total of 83 percent of millennial women still like Ivanka Trump’s line, even when considering her father’s presidential campaign and politics. Only 17 percent said they were “not very likely” or “not at all likely” to buy Ivanka Trump products in light of her father’s campaign. BrandKeys surveyed 950 women across nine U. S. census regions between 18 and    from Oct. 21 to Oct. 24, 2016. “Each of the respondents indicated she’d made one or more dress or shoe purchase of at least $250 in the past 12 months,” Forbes magazine’s Clare O’Connor wrote about the poll. What’s more, the targeting of Ivanka Trump and her brand is hardly something that could be considered   activism by its ringleaders.   fanatics have fervently pursued an effectual ban of Trump brands from retailers. Brand strategist and founder of the   Trump boycott Shannon Coulter spearheaded the #grabyourwallet boycott of retailers carrying Trump family brand products according to Business Insider. The report states that the boycott gained steam after the viral Twitter posted letter of someone claiming to be a lifelong Nordstrom customer. “The hate speech directed at African Americans, Latinos, Jews, Muslims, LGBT people, and women by the Trump campaign is unacceptable and does not seem to represent Nordstrom’s values,” read a portion of the letter. On January 29 the @SheWhoVotes twitter account wrote of Counselor to the President KellyAnne Conway, “Why does Kellyanne always look like she just emerged from a vat of grease? Or is that just Trump slime?” The account retweeted the tweet on Friday after news of Nordstrom dropping the Ivanka Trump brand. A January 23 tweet from the account called Conway, “Sewer Rat Barbie. ” Coulter has been tracking availability of Trump’s products on Nordstrom’s website in recent months, according to Business Insider. She claims that in early December, shortly after the November 21 Pete Nordstrom letter to employees saying they would keep the brand, there were 71   items available by last week there were 26, and as of Wednesday there were nine. It is unclear if she had documentation of those numbers. A Friday morning search for “Ivanka Trump” did however, return results for just four products. But the negativity from these   activists doesn’t get Ivanka Trump down. She’s standing firm, and emerging from this targeting campaign even stronger. In an interview with Fast Company last October, right before the election, Ivanka Trump stood by her father —  and her brand —  and didn’t flinch. She said the scrutiny and the targeting that has come her way has made her a stronger, tougher woman. “I mean, it’s been a year and a half of enormous scrutiny, of my family, every business, every movement, action,” she said. ”But I think that, you know, that sort of comes with the territory. And I think I’ve probably learned a lot through it and I’ve probably grown a bit tougher in terms of my resilience toward what is thrown our way because, you know, I’ve read some very negative stuff. ” “I learned a long time ago that I can’t control the opinions of others or what they project on me. All I can do is live my life, and I’ve tried to do that,” she also said in that interview. Ivanka Trump, the daughter of President Donald J. Trump, has since her father’s inauguration stepped back from her roles in not only the Trump organization, but also her own brand as she moved to Washington, D. C. She has been vocal about advocating for improved access to childcare and for women. Her husband Jared Kushner accepted a position as senior advisor to President Trump, and the duo have been integral to President Trump’s early successes. In response to the news about Nordstrom cutting his daughter’s fashion line, President Trump bashed the retail department store on Twitter. My daughter Ivanka has been treated so unfairly by @Nordstrom. She is a great person  —   always pushing me to do the right thing! Terrible!  —   Donald J. Trump (@realDonaldTrump) February 8, 2017,  In response to Trump’s tweet —  and the ongoing boycott of Nordstrom’s for the company’s political decision to cut Ivanka Trump’s line —  Nordstrom’s stock tumbled on Wednesday. “Shares of Nordstrom fell from session highs Wednesday after President Donald Trump said his daughter, Ivanka Trump, had been treated unfairly by the company,” CNBC’s Berkeley Lovelace wrote on Wednesday. Lovelace’s piece notes that Nordstrom’s stock is seriously hurting this year overall, too: “With Wednesday’s drop, Nordstrom’s shares are down more than 10 percent year to date. ” Fueling the fire against Nordstrom’s for the decision to drop Ivanka Trump’s line is a boycott from women all across the country. A host of responses on social media showed backlash over the decision, including this exchange in which a Twitter user challenges the company’s claim that the decision was based solely on sales and the company defends its claim: @Nordstrom @beebobaby if it’s not political then why are these liberal loons at #GrabYourWallet taking credit for you dropping Ivanka? Huh?  —   RockPrincess (@Rockprincess818) February 4, 2017,  @Rockprincess818 We can confirm this decision was based on the brand’s performance.  —   Nordstrom (@Nordstrom) February 4, 2017,  @Nordstrom @Rockprincess818 Nordstrom hold on ur statement doesn’t match up 2 statement from Ivanka Trump’s co. statement they have proof,  —   4reallyandtruly (@4ReallyandTruly) February 4, 2017,  @4ReallyandTruly Because of variations in when previous buys were made, we’ll continue to have it available for a while.  —   Nordstrom (@Nordstrom) February 4, 2017,  @Nordstrom It’s not available online correct? So where is it available?  —   4reallyandtruly (@4ReallyandTruly) February 4, 2017,  @4ReallyandTruly You may see some items still available in our stores as they sell through the current season’s merchandise.  —   Nordstrom (@Nordstrom) February 4, 2017,  @Nordstrom Why not online?  —   4reallyandtruly (@4ReallyandTruly) February 4, 2017,  @4ReallyandTruly  You’ll be able to see online inventory as long as we have it in stock.  —   Nordstrom (@Nordstrom) February 4, 2017,  An attempt to place a particular size and type of Ivanka Trump shoe in an online purchase cart on Nordstrom’s website as of Friday showed that shoe out of stock however, a check of stores revealed that the shoe was in stock in a Nordstrom retail location. Facebook user Shari Bartel Dresselhaus posted a letter to Nordstrom from her niece, a former Nordstrom employee and loyal customer. The letter called out Nordstrom, noting a social media post, “  …    after seeing a post by Olivia Kim whom I recall to be one of your corporate leaders writing #yeswecan #yeswedid below a screenshot of the news article indicating the separation from the Ivanka Trump brand, I am left feeling that this decision was not made purely based on sales performance. ” #yeswecan #yeswedid @ Nordstrom https:  .   —   olivia kim (@OliviaKim) February 3, 2017,  Many women nationwide have told Breitbart News as well that they plan to stop shopping at Nordstrom’s. “I will stop patronizing their stores, after 30 years of loyalty, until they stop caving in to the left looneys!” Gay Moreno, who lives in Crossville, Tennessee, told Breitbart News. “Political beliefs are one thing weakness in the face of anarchy is another!” “I’ve had enough of the pompous snobbery of the left and that it seeps through to our retail industry shows me a total lack of respect for the consumer and the patrons,” Wendy Burdette from Clifton, Virginia, said in an email. She said she plans to “shred” her Nordstrom’s card because he doesn’t “need” it anymore. “I will be calling Nordstrom and canceling my credit card after 20 plus years of patronage due to their dropping of the Ivanka Trump line,” Laura Lightstone from Gaithersburg, Maryland, told Breitbart News. “I will also be returning the items I just bought from them last week. I am willing to make a statement in a piece you are writing. ” “I have been a frequent shopper at Nordstrom with their credit card but will destroy the card if they do in fact discontinue the Ivanka line,” Sandy Dominick from Fairfax, Virginia —  originally from Canton, Ohio —  said in an email. “Very tired of sore losers. I was very unhappy for past 7 years (note: I gave Obama a year) but never behaved like a spoiled brat. ” Deb Chandler, a public relations executive in Washington, D. C. who describes herself as a moderate Republican raised by Southern Democrats, told Breitbart News she’s now boycotting Nordstrom’s over this decision: As a moderate Republican, raised by southern Democrats (Louisiana and Texas,) a child of military veterans, a business owner, and a woman, whose favorite pair of heels happens to be a golden brushed leather pump with a sassy bow by Ivanka Trump, I question where I am in the ongoing transition happening in America. Seriously, has my life come down to a pair of pumps? Yes, apparently so. I am disheartened to find this week, alongside riots and fires at Berkley in an effort to stop free speech, that Nordstrom decided to pull the Ivanka Trump lines from their stores. “For crying out loud people, I have the right to chose my brand and where I buy my shoes from without a major campaign directing how I spend my hard earned money,” Chandler added. Andrea Lafferty, a conservative leader who is also the president of the group Women for a Great America, told Breitbart News she is done with Nordstrom’s too. “Nordstrom’s needs to figure out that their demographic is Christian women not snotty hoodlums wearing masks,” Lafferty said. Lynda DiPasquale, a New Jersey Nordstrom’s shopper, cut up her card over this. “I just cut up my Nordstrom platinum card as I refuse to waste thousands of dollars to support a company that mixes their politics with my fine shopping experience,” DiPasquale said in an email. “On the bright side  …    my husband will be THRILLED. ” Lee O’Connor, another woman who used to shop at Nordstrom’s, won’t anymore. “Store credit cards are an unnecessary nuisance, so I don’t have a Nordstrom’s card to shred,” she said in an email. “But I won’t be spending any of my   dollars at Nordstrom’s or any other store that caves to pressure from the Left to stop carrying the beautiful and affordable items in the Ivanka Trump Collection. ” So is Kelley Pinzon, another previously loyal Nordstrom’s shopper. “After 28 years of customer loyalty, I will shred my Nordstrom card by the end of the week if y’all do not start selling Ivanka Trump products again,” Pinzon said in an email. “Please stop selling political messages and sell merchandise. I want to see Ivanka’s line restored. ” And it’s not just women boycotting Nordstrom’s now: Brad Botwin, a previous shopper at the department store chain who is from Rockville, Maryland, told Breitbart News he’s done with them too. “I am a long time Nordstrom customer and exclusively purchase my suits, shirts and ties at Nordstrom,” Botwin said in an email. “No longer because of their punitive and political act to drop Ivanka Trump’s clothing line. I have also   Nordstrom to drop me from their special email list of events and other messages. If this organization doesn’t have the backbone to stand up to the unfair left wing pressure against Ivanka Trump, I shudder to think what next they will cave on next. Decisions like this erode the freedoms and liberty of all Americans. ”'"}, "time": 1742628437.7345705}