{"duration": 0.1769564151763916, "input_args": {"text": "'PRAIRIE VILLAGE, Kan.  —   Dinah Sykes, a parent of two boys in a suburb of Kansas City, started noticing changes to her children’s public schools a few years ago. Class sizes were growing. The school library had stopped buying books. So she used her position as the president of the   association to start a new tradition: Instead of bringing cupcakes to class for their birthdays, students were asked to bring a book to donate to the school library. Ms. Sykes is a Republican who once voted for the governor from her party, Sam Brownback. But now, she said, she is so concerned that public schools are endangered by the state’s budget crisis that she is running for a seat in the State Senate, challenging the incumbent senator in the Republican primary in August. “We’re getting a bad reputation: that our state doesn’t care about public education,” Ms. Sykes said. “We live in Kansas because of the great quality of life, the great schools, the great amenities. I want my boys to have the opportunity to have the same. ” The struggle over school funding in Kansas reached a new crisis point when the State Supreme Court on Friday ruled that the   Legislature had not abided by its constitutional mandate to finance public schools equitably, especially poorer districts with less property wealth. The court, in an effort to force legislative action, reiterated a deadline that gave the state until June 30 to fix the problem or face a school shutdown. The ruling exacerbated tensions over budgets enacted by Mr. Brownback and the Legislature that education officials say have led school districts to eliminate programs, lay off staff members or even shorten the school week. Officials worry that the state’s budget, which included cuts by Mr. Brownback to higher education and many state agencies, may not be able to absorb further reductions to find the level of additional funding the court is looking for  —   estimated at $40 million or more. Of even greater concern to many parents is a sense, they say, that the state leadership does not support the very concept of public education. “People are saying, ‘This is not the Kansas I know,’ and ‘This is not the Republican Party I know,’” said Judith Deedy, who helped start the group Game On for Kansas Schools. As in other states, the effect of reduced funding varies from one district to another. In poorer districts like Kansas City and Wichita, students are crammed into deteriorating buildings with bloated class sizes. One district in southeast Kansas, facing a budget shortfall, recently pared its school week to four days. But even in wealthier districts, like the one here, parents are watching the tighter budgets  —   and the disappearing contingency funds  —   with alarm. The issue has increased pressure on Mr. Brownback, who had already come under fire for Kansas’ budget woes and cuts to state programs after enacting the largest tax cuts in state history in 2012 and 2013. He won   in 2015 against a Democratic challenger who hammered him for education cuts. But a survey in February by Fort Hays State University found that 69 percent of Kansans were dissatisfied with his job performance and 21 percent were satisfied. Three years remain in his second term and, under   laws, he cannot run again. In 2015, facing large projected shortfalls, Mr. Brownback cut   funding by 1. 5 percent. He and the Legislature then changed the funding formula from a   distribution, which gave extra money to schools educating    students, to a system of fixed block grants. But he kept a promise to protect schools from further cuts in the 2016 budget and reduced funds for many state agencies and higher education, including community colleges and technical schools. Mr. Brownback and his legislative allies say that the schools already have plenty of money and that districts could spend more prudently or dip deeper into their reserves. “Since taking office, Governor Brownback has increased state funding to schools every year, investing more than $4 billion  —   approximately half of the state’s budget  —   in   funding,” said Eileen Hawley, a spokeswoman for Mr. Brownback. “At the same time, he has returned more local control to those closest to the classroom  —   teachers and parents  —   so they have more direct control over how funds are spent to benefit students. ” District officials say, however, that the funding has not kept pace with a rise in fixed costs. The Shawnee Mission School District, for instance, faces an increase of $1 million in a year for bus services. Other expenses, even for school supplies, have grown in many districts, frustrating officials who say they need more help from the state to cover costs. Under Mr. Brownback, who took office in 2011, state aid per pupil dropped to $3, 800 from $4, 400, according to the Kansas branch of the National Education Association. That reduction has come even as enrollment and the cost of health insurance have increased for many districts, said Mark Tallman of the Kansas Association of School Boards. “Since the Great Recession, when you adjust for inflation, total school funding in Kansas has been basically flat,” he said. Tensions flared when the State Supreme Court first ruled in February that unless poorer districts begin receiving more money by the end of June, the state’s public schools could be shut down. Mr. Brownback signed a bill in April intending to fix the education funding formula. But the court on Friday said the measure had not solved the problem and reiterated the deadline. What happens next is not clear. Schools in Kansas are generally finished for this academic year and Wednesday was set to be the Legislature’s last day, though it could return for a special session. Conservative lawmakers have denounced activist judges and Mr. Brownback has accused the court of “political brinksmanship. ” But the governor had hinted that he might cut funding to Medicaid and higher education if the Supreme Court ordered the state to allocate more money for schools. Without a legislative solution, school summer programs would likely be interrupted and schools would not be able to reopen in August.  The continuing turmoil has turned many previously content parents into activists demanding that Mr. Brownback reverse course on his large tax cuts in order to free up money for public schools. “The overall sentiment here is, ‘We need different representation in Topeka that will stand up to the governor,’” said Cindy Neely, a registered Republican and guidance counselor who said her school district was “constantly” looking for places to trim its budget. “It feels like, in Kansas, the last two to three years have just been constant stress and constant worry. ” LeEtta Felter, a Republican and a school board member in Olathe, a large suburb of Kansas City, said her district’s budget was struggling to cover rising costs and expanding enrollment. The district has begun to tap into its reserves and has been told by elected officials not to expect any increase in funding next year, she said. “They’re in an   panic,” Ms. Felter said of lawmakers in Topeka. “They love to use the term ‘buckets of money’ that the districts are hoarding. Any responsible entity has a   fund, except for the State of Kansas. ” In Kansas City, school officials say they have been shortchanged by tens of millions of dollars over the past five years because the Legislature has not taken into account their needs when financing poorer districts like theirs. Ninety percent of the students in the Kansas City school district qualify for free or   lunch, and 40 percent are nonnative English speakers. Cynthia Lane, the superintendent of schools in the Kansas City district, said preparations were underway in case schools are shut down, as the Supreme Court has threatened. Schools are usually busy during the summer months, with administrators and members of staff preparing for the upcoming academic year, she said. The first day of school is scheduled for Aug. 15. “If we can’t pay bills, how do we keep our utilities on, how do we keep our security system on?” she said. “Folks are really frustrated and embarrassed that Kansas is the butt of jokes across the nation. He continues to say things are fine, when they are not fine. ” The Wichita School Board voted on May 18 to eliminate more than 100 jobs and to close an alternative high school, as part of efforts to trim about $18 million from the district’s budget. At that meeting, Mike Rodee, the vice president of the board, blamed state officials for forcing budget cuts. “We need to look at all the people that are doing it to us,” he said at the school board meeting. “Our legislators, our government, our governor  —   we are the ones who are fighting to keep the schools alive, and they are fighting to close them. ” Some school principals say they are resigned to making do with what money they have. At Welborn Elementary School in Kansas City, classes are held in two aging buildings and students dash back and forth during the day. Teachers keep a watchful eye on them as they cross an active parking lot between the buildings. “I don’t need much,” said Jennifer Malone, the principal, one recent afternoon. “I just want a building. ”'"}, "time": 1742563256.9932692}