{"duration": 0.09681320190429688, "input_args": {"text": "'Donnerstag, 3. November 2016 Oettinger: \"Ich habe nichts gegen Schlitzaugen. Einige meiner besten Freunde sind Reisfresser\" Wieder einmal hat Günther Oettinger (CDU) mit einer Rede für Aufsehen gesorgt. Dabei fiel im Hinblick auf China unter anderem die Formulierung \"Schlitzaugen und Schlitzohren\". Im exklusiven Postillon -Interview äußert sich der künftige EU-Haushaltskommissar nun detailliert zu seinen umstrittenen Äußerungen: Postillon: Herr Oettinger, derzeit werden Sie von vielen Menschen kritisiert, weil Sie Chinesen unter anderem als \"Schlitzaugen\" bezeichnet haben. Viele haben das als rassistische Äußerung aufgefasst. Oettinger: Das ist völlig falsch rübergekommen. Ich habe nichts gegen Schlitzaugen. Einige meiner besten Freunde sind Reisfresser. Postillon: Ach ja? Wie heißen die denn, diese besten Freunde? Oettinger: Äh… Ich bin zum Beispiel erst neulich Sushi-Essen gewesen und habe dem Kellner sogar ein Trinkgeld gegeben. Der hieß… wahrscheinlich Tsching Tschang Tschong oder so. Keine Ahnung. Die schauen doch alle gleich aus. Außerdem habe ich mal in Thailand Urlaub gemacht, wo ich die Kultur der Gelbhäute aus erster Hand erleben konnte. Postillon: Wie darf man Ihre Aussagen denn dann verstehen? Oettinger: Das war als Kompliment gemeint. Ich habe nämlich unglaublichen Respekt vor diesen China-Männern, weil sie so unglaublich fleißig sind – und das obwohl sie nur ein beschränktes Sichtfeld haben und dazu noch so klein sind. Postillon: Haben Sie eine Botschaft an das chinesische Volk? Oettinger: Ja. Ich sag\\'s am besten gleich so, dass sie es verstehen. (räuspert sich) Liebe Asia-Männel, hiel splicht Günthel Oettingel. Ich möchte mich auflichtig bei Ihnen entschuldigen. Sollte jemand von Ihnen so velweichlicht sein, dass ich ihn mit meinen Wolten velletzt haben könnte, so tut mil das leid. Bitte investielen Sie tlotzdem fleißig in Ländel del EU und lassen Sie sich Ihlen Hund schmecken. Postillon: Klare Worte. Oettinger: Ja. Ich schätze, nach diesel … äh dieser Entschuldigung sollte dann auch das ganze Missverständnis ausgeräumt sein. Postillon: Was meinten Sie genau, als Sie in Ihrer Rede von einer \"Pflicht-Homoehe\" sprachen? Oettinger: Herrgott! Sind die Tucken jetzt auch noch beleidigt? Dann entschuldige ich mich dafür eben auch noch: Sorry, liebe Hinterlader! War echt nicht so gemeint, also bitte beruhigen Sie sich. Gehen Sie shoppen, schwuchteln Sie herum – was auch immer man halt so macht als Sodomist. Postillon: Damit dürften Sie wieder rehabilitiert sein. Kommen wir zu Ihren beruflichen Aussichten. Nach zwei Jahren als EU-Kommissar für Digitalwirtschaft wechseln Sie jetzt auf den Posten des Haushaltskommissars. Oettinger: Das kam tatsächlich überraschend. Immerhin habe ich mich gerade so langsam in den Job als Digitalkommissar reingefuchst. Ich habe sogar schon mit dem Gedanken gespielt, mir dieses Internet selbst mal anzuschauen, quasi im Saiberschbäis zu sörfen, wie Profis das nennen. Das kann ich mir jetzt wohl sparen. Postillon: Wie haben Sie reagiert, als Sie erfuhren, dass Sie Haushaltskommissar werden sollen? Oettinger: Erst war ich stinksauer. Haushalt ist ja eigentlich Frauensache. Ich habe nicht verstanden, warum die da einen Mann haben wollen. Aber dann hat mir wer erklärt, dass Haushalt was mit Geld zu tun hat. Klar, dass man das keine Frau machen lassen kann. Postillon: Haben Sie schon erste politische Pläne? Oettinger: Nein. Ich hatte noch keine Zeit, mich mit den für meinen neuen Aufgabenbereich zuständigen Wirtschaftslobbyisten zu treffen. Was ich will, kann ich Ihnen erst danach sagen. Postillon: Vielen Dank, Herr Oettinger, für dieses aufschlussreiche Gespräch. Oettinger: Aber gerne doch. Für einen Pressefritzen waren Sie eigentlich ganz erträglich.'"}, "time": 1742561852.7091982}