{"duration": 0.07499909400939941, "input_args": {"text": "'We Are Change \\nIn the latest newly released Project Veritas video, James O’Keefe and crew have exposed a disturbing racism inside the Democratic party. Benjamin Barber, one of Hillary Clinton’s major donors, said “Blacks are seriously fucked in the head” for helping “the other side.”\\nIn the video, a Project Veritas journalist talks to Benjamin Barber i nside a Democrat fundraiser for North Carolina U.S. Senate candidate Deborah Ross. In the video, Barber compared black people voting for Republicans to Sonderkommandos Jews who helped kill other Jews for the Nazis.\\n\\n“Have you heard of the Sonderkommandos? Jewish guards who helped murder Jews in the camps. So there were even Jews that were helping the Nazis murder Jews! So blacks who are helping the other side are seriously fucked in the head. They’re only helping the enemy who will destroy them. Maybe they think ‘if I help them we’ll get along okay; somehow I’ll save my race by working with the murderers.’”\\nDeborah Ross also makes comments about black voters being less likely to vote if an ID law was passed requiring voters to provide a form of identification.\\n“Republicans know that African Americans are less likely to have the ID so they won’t vote.” – Democratic Senate candidate D eborah Ross. \\nIn another segment of the video the Project Veritas journalist says “so it’s like they are voting against their own self interest?” to both Benjamin Barber and Leah Barber.\\nBoth responded agreeing with the journalist’s statement.\\n“It doesn’t make any sense, You’re voting against your self interest. In the name of change, what is the change that they want to see.” – Leah Barber\\nProject Veritas showed the comments made by Benjamin Barber and U.S. senate candidate Deborah Ross to several prominent black Americans who were all absolutely disgusted by the comments.\\n“Wow, so that’s what they think of us? I’m speechless. For the most part it’s wrong, it’s an eye opener but that’s what happens when we as blacks vote for one party,” Robert Foster said after seeing the video.\\nPastor William Cooper weighed in when questioned if he was betraying his race as an African American voter voting for a Republican.\\nCooper responded “absolutely not I think I’m benefiting my race by voting against the Democrat party that takes the African American vote for granted. They don’t offer us anything.”\\nBishop Patrick Wooden added his frustration and disgust saying, “I think that Deborah Ross has showed her true colors, if that’s not racism and condescending and basically calling blacks stupid and ignorant and saying we’re voting against our own self interest if we support any Republican I am appalled.”\\nPamela Wooden expressed her disappointment saying she “considered it an insult to see those accusations and hear that type of discussion is insulting to me as an African American.”\\nFinally, John Amanchukwu said that “It’s not just dark money, it’s racist and evil money filled with venom and you can look at his eyes in the video and you can see there’s a rage there and there’s a deep seeded resentment of African Americans.”\\n \\n \\n \\n \\n \\n \\n \\n \\nThe post Video Exposes Hillary Donor: “Blacks Are Seriously Fucked in The Head” appeared first on We Are Change .\\n'"}, "time": 1742564432.1588483}