{"duration": 0.08072733879089355, "input_args": {"text": "'WASHINGTON, D. C.  —   Vice President Mike Pence highlighted the nearly 2 million Americans who have dropped Obamacare this year in a Tuesday speech to employees at U. S. Health and Human Services ahead of meetings with lawmakers at the White House and on Capitol Hill. [The Vice President called the “ongoing collapse” of Obamacare  —   the “death spiral”  —   one of the most pressing issues facing Americans today. “This will be the North Star of our Administration,” Pence said of improving the healthcare system.  “We are going to repeal and replace Obamacare,” he said, citing the broken promises of the Affordable Care Act. While discussing the promise that premiums would go down, Pence referenced a report that revealed premiums have instead skyrocketed under Obamacare  —   more than doubling for the average American. “While costs are soaring  …    choices are plummeting. Insurance companies are pulling out of Obamacare left and right,” said Pence. A chart displayed above Pence read, “Only 10 million enrolled, 28 million still uninsured. ” He also referenced the 1. 9 million Americans that signed up for plans on the Obamacare exchanges, but have not followed through on paying their premiums. This figure comes from a new Centers for Medicare and Medicaid Services (CMS) report released on Monday, detailing the 10. 3 million who have paid their premiums as of March 15, out of the 12. 2 million who have signed up. Pence described meeting Julie Champine on a recent trip to Wisconsin. He recalled her story of losing health insurance and her doctor while she faced health issues. She was forced to sign up for an Obamacare plan which in 2016 cost more than $9, 000 in premiums for her family and carries a $13, 000 deductible. Champine’s plan premium increased another $2, 600 this year, said Pence. “Julie told me that her Obamacare health insurance plan costs more than her mortgage and she can’t even afford to use it,” said Pence. A few months back she dropped her plan for a few months in order to afford Christmas presents for her kids. Pence remarked how important the men and women who serve in U. S. Health and Human Services are and thanked them for their service. HHS Secretary Dr. Tom Price said before introducing Pence, that the work of HHS goes beyond the border of the United States and recalled a recent trip to Liberia. He lauded U. S. efforts to beat back Ebola in Africa. Price remarked of the challenges Americans face when it comes to obtaining quality health care. He voiced the goal of getting us to a healthcare system where Americans can afford health care and health coverage. He spoke of stabilizing markets, opening up enrollment options and   …     with the goal of installing a more   healthcare system. “The Affordable Care Act took a lot of power away from the states,” added Price who said they are continuing to make progress on innovations. In early May, health insurer Aetna pulled out of yet another state’s individual market, Virginia. CNN Money reported that the company cited massive losses under Obamacare as the reason why. Within days, Fox Business reported that Aetna would pull out of Obamacare exchanges completely by 2018. After passing through the U. S. House of Representatives, the American Health Care Act sits waiting for a vote on the floor of the U. S. Senate. The bill is designed to roll back much of President Barack Obama’s signature health insurance mandate. The bill has been presented as the first of several phases to dismantle Obamacare. President Trump has often stated that Obamacare is in a “death spiral” under which healthcare premiums continue to skyrocket. He has promised to repeal Obamacare. Following his speech, the Vice President is traveling to the White House for lunch with President Trump and members of Congress. Afterward, Pence will join lawmakers for the Senate Republican Policy lunch and hold additional meetings.'"}, "time": 1742562283.0570214}