{"duration": 0.14857006072998047, "input_args": {"text": "'CNN checked in on the   surveillance story Monday morning and seemed profoundly confused about what is actually going on:[An incendiary idea first put forward by   radio host Mark Levin is now burning across Washington, fanned by President Trump’s tweets and a huge number of supportive commentators and websites  —   even though the facts don’t back up the conclusion. Breitbart News has given the conspiracy theory a name: “DeepStateGate. ” Others are going with “ObamaGate. ” And Fox News host Sean Hannity is asking: “What did OBAMA know and when did he know it? ??” Levin’s original idea, advanced on Thursday, was that former President Barack Obama and his allies have mounted a “silent coup” against Trump using “police state” tactics. Levin   news stories that supported his thesis and omitted information that cut against it. The next day, Rush Limbaugh echoed Levin’s “silent coup” language, and Breitbart columnist Joel Pollak published an “expanded version of that case. ” That’s how the idea reached Trump’s radar. The Breitbart article “circulated” in the West Wing, a White House official told CNN’s Jeff Zeleny, and the information “infuriated” Trump. To be clear, Levin and Limbaugh and Pollak didn’t publish any original reporting. They merely claimed to have connected some dots. [Emphasis mine] Perhaps CNN’s writers should read their own copy more carefully and save themselves some befuddlement. This isn’t an “incendiary idea put forth by   radio host Mark Levin,”   columnist Joel Pollak, or Joel’s merry   sidekick, Yours Truly. We’re all just reading stories the mainstream media pumped out with frantic speed over the past few months.   You made DeepStateGate happen, mainstream media. You ran   scuttlebutt from your old pals in the Obama administration to keep your precious “Russia stole the election from Hillary!” narrative alive. You led your readers to believe it was all hard news, based on solid intel from trustworthy sources. As I noted on Sunday, sometimes you buried “this is all groundless hearsay” disclaimers six paragraphs into the stories, but the headlines screamed about the wiretaps that angered President Trump.  Here, for example, is a nice catch from   raconteur Raheem Kassam, the   editor of the   Breitbart London division of   Breitbart News: Mmmhmmm. pic. twitter.   —   Raheem Kassam (@RaheemKassam) March 6, 2017,  That headline, “Wiretapped Data Used in Inquiry of Trump Aides,” was most assuredly not a   production, and it’s not even slightly ambiguous about the existence of wiretapping. Jeff Dunetz at The Lid couldn’t help noticing that the exact same reporter who wrote that New York Times piece in January is now claiming, right in his headlines, that Trump has “no evidence” of the very same wiretaps he reported as established fact just two months ago. “This is the ultimate in liberal media bias. In January Michael S. Schmidt perpetuated the rumor that team Trump had Russian connections, and to support his point he said that Trump’s people were wiretapped. However when President Trump claimed his people were wiretapped, the same guy, Michael S. Schmidt, said there was no evidence,” Dunetz observes. This is backpedaling on a scale one would only expect to see if a pack of velociraptors appeared at the finish line of the Tour de France. It doesn’t help that reporters slipped a few “none of this can be confirmed” caveats into their stories  —   caveats that were, of course, left out by the many social media loudspeakers that blasted their incendiary headlines into Twitter streams and Facebook feeds.  There were always cracks in the media’s   stories. As of yesterday, the cracks became more important than the stories. Suddenly the media is shrieking at us for daring to take their coverage seriously. The problem with major media coverage of intelligence stories is that top officials and policymakers always have more information than the public. The mainstream press has gone so berserk with anonymous leaks since Trump won the 2016 election that We the People have no logical means of fully evaluating anything they write. We don’t know who the sources for these stories are, or what their agenda is  —   although skeptical readers can guess, based on how most of these anonymous leaks cut against the new White House. Kellyanne Conway made this point on Fox  Friends Monday, when she argued that President Trump “has information and intelligence that the rest of us do not”: ”He’s the President of the United States. He has information and intelligence that the rest of us do not.”  —  @KellyannePolls pic. twitter.   —   FOX  friends (@foxandfriends) March 6, 2017,  We’ve heard such assertions many times before, from both sides of the partisan divide. For example, the defenders of NSA surveillance operations insisted they were useful for preserving national security, but they couldn’t give us the classified details that would prove it. Critics had the same problem from the opposite direction. Many national security and law enforcement debates end with assurances that our top men and women know things they can’t tell us about. Until now, media coverage has been driven by anonymous leakers who assured us they know things they can’t tell us about, peddling a few juicy tidbits they weren’t supposed to talk about. The President of the United States is very well situated to play that game too.  If Trump is strictly going by the reports from big media outlets and their favorite leakers, whose fault is it that he became convinced the Obama administration was spying on him? Mark Levin hit that point in his response to the CNN article: I simply put together the stories that YOUR profession reported, on the public record.  Do you deny there were two FISA applications?  Do you deny the first was turned down?  Do you deny the second was approved?  It’s called the Foreign Intelligence Surveillance Court.  It is about surveillance.  The fact that we cannot discern all the details because of the secrecy, except for what the media have revealed and selective leaks by the government, should cause you to want to know more, not to trash those who point it out.   And yes, we can make several logical implications based on events and experience.   A FISA application is a big deal.  One, or two in this case, that involve campaign surrogates, or a server or computer related to a candidate or campaign, etc. is a big deal.  President Obama’s statement is not a definitive statement of anything, other than he, personally, did not order a wiretap, which I never claimed.  But that does not mean he was unaware of surveillance activity by several of his departments, even through routine reports to the president, such as the Daily Intel Briefing or information conveyed to him or his staff via the Justice Department re the FBI   activities. Levin noted that in the course of denying any FISA surveillance was conducted against Trump Tower, James Clapper also said “no connections between the Russians and the Trump campaign have been found. ” That is   …     rather different from the conclusion one would reach by ingesting mainstream media coverage over the past few months, isn’t it?  Perhaps CNN should take a break from sneering at “  conspiracy theories” and take a look at what   blogs have been saying about the   story. Until yesterday, they were firmly convinced that extensive surveillance was conducted against Trump and his campaign, and it produced all kinds of damaging information. President Trump is gambling a good deal of credibility with his accusation of Obama wiretapping. The Obama officials and Big Media outlets sitting across the table from him don’t have much credibility to ante up against him. Complicated controversies usually have complex outcomes, so the smart bet is that both sides will end up with something that allows them to claim vindication, and we’ll most likely have another credibility smackdown. Meanwhile, we’ll probably see a sharp decrease in reports based on leaked material the media insisted was genuine, right up until the moment Donald Trump believed them.'"}, "time": 1742563492.6867867}