{"duration": 0.1019132137298584, "input_args": {"text": "'MEXICO CITY  —   Trailing badly in the polls, and with elections just around the corner, Roxana Luna reached for transcendental salvation. In a ceremony outside the government headquarters of Mexico’s Puebla State, Ms. Luna, a candidate for governor, unleashed a troupe of Aztec dancers across the colonial building’s cobblestone forecourt. They hopped around wearing leather skirts and spectacular feather headdresses. One drew designs in the air with smoke from burning tree resin. Another blew a conch shell. Ms. Luna explained to bemused onlookers that the event last week was a purification ritual intended to flush out “the curse” of bad government, along with fear, coercion, vote buying, apathy and violence. “People who feel desperate turn to ritualistic cleansings,” she said. “We’ve been cursed. ” It is election time in Mexico again, with voters going to the polls on Sunday for municipal and regional elections, including the governorships in 12 of Mexico’s 32 states. While some might quibble with Ms. Luna’s technique, few would argue against her appeal to clean up Mexico’s electoral politics. Mexican political campaigns have never been for the faint of heart, and this year has been no different, with    contests that have made a certain presidential contest north of the border look almost quaint in comparison. The official campaign period in Mexico, which by law lasted only two months and ended on Wednesday, was marked by “a dirty war,” to use the favored term of the Mexican news media and political class. Candidates all over the country have hurled accusations of corruption at one another, including charges of graft and financing by drug traffickers. In the governor’s race in Veracruz, one candidate even accused his main competitor of being a pedophile. Some contests also featured violence and intimidation, including the firebombing of a party leader’s office in Veracruz. Dozens of local and regional candidates withdrew from races, reportedly because of threats from drug traffickers. A lot is at stake. More than 1, 300 seats are up for grabs, with the governorships the most important. The outcome of Sunday’s vote could also serve as a prologue for the 2018 presidential election. President Enrique Peña Nieto’s Institutional Revolutionary Party holds nine of the 12 contested governorships, but he is polling lower than any president in the past two decades, and his plummeting popularity could hurt his party’s chances on Sunday. Luis Carlos Ugalde, the director of Integralia Consultores, a political consultancy in Mexico City, said the level of invective and the prevalence of corruption allegations had increased in recent electoral cycles. This year’s tone was “the most negative” he had seen, he said. The rancor of the current campaigns is likely to influence the tenor of the presidential election, said Mr. Ugalde, who served as president of Mexico’s election commission in the 2000s. “This could cause a very troubled atmosphere in 2018,” he predicted. Arguably, the most contentious race this year has been for governor in Veracruz, a state wracked by corruption and violence. The   are two cousins who, despite their family ties, have lobbed accusations and insults at each other. Héctor Yunes Landa, the candidate for the incumbent Institutional Revolutionary Party, has accused his opponent, Miguel Ángel Yunes Linares, the candidate of a coalition between the Democratic Revolution Party and the National Action Party, of being a pedophile, warning voters to “take care of the safety of your children,” according to local news media. Mr. Yunes Linares, who is trying to break the rival party’s   hold on the state’s governorship, has denied the charges. Officials in Mr. Yunes Linares’s campaign have accused his cousin of vote buying and of underreporting his wealth in a public declaration of his assets. Mr. Yunes Linares’s chances may have improved in light of a recent investigation by the news site Animal Político, which found that the state’s current administration funneled about $35 million to ghost companies. The governor, Javier Duarte, has denied any wrongdoing. In the northern border state of Tamaulipas, the leading candidates for governor and their parties have been accused of having links to drug cartels. The Institutional Revolutionary Party’s candidate for governor, Baltazar Hinojosa Ochoa, has been accused of receiving money from the Gulf Cartel during a mayoral run in 2002 in the municipality of Matamoros. He has denied the allegations. Mr. Hinojosa Ochoa’s party has accused his main rival, Francisco García Cabeza de Vaca, the candidate for the National Action Party, of having his own links to organized crime. To support its accusations, the Institutional Revolutionary Party submitted a photo to government investigators showing gunmen riding around in a truck decorated with the symbol of the rival party. A Revolutionary Party official later admitted that the photograph had been taken in another state and, in any case, had been doctored. Candidates for governor in several other states  —   including Chihuahua, Oaxaca, Quintana Roo and Sinaloa  —   have also had to parry accusations of corruption and links to organized crime. The war of words has been punctuated by violent threats and attacks. On Tuesday, a group of armed attackers firebombed the offices of the Veracruz state leader for the National Action Party. “These are the costs of challenging a corrupt, unscrupulous system,” the party leader, José de Jesús Mancha, said in a statement after the bombing. In Puebla, an official from the Institutional Revolutionary Party was wounded in a shooting while he was driving. A party leader, Jorge Estefan Chidiac, blamed the state administration, led by the National Action Party, for the attack, saying it “was part of a strategy of the state government to destabilize, intimidate and threaten the people of Puebla. ” National Action Party officials denied responsibility. In Sinaloa, a candidate for the state legislature said his house had been shot at, and an office linked to the campaign of a mayoral candidate was ransacked by burglars, according to local news media accounts. In Culiacán, the capital of Sinaloa, someone spray painted death threats against a candidate for governor on the walls of a university. During a radio interview on Thursday, Miguel Ángel Osorio Chong, Mexico’s interior secretary, called the campaign period “the most ruthless of any electoral processes. ” “I don’t understand this kind of democracy,” he said. “I believe in competition, and when there’s an accusation and there are problems, you have to say something. But it went too far. ”'"}, "time": 1742564524.2010121}