{"duration": 0.08303427696228027, "input_args": {"text": "'In an unparalleled moment of national pride laced with sorrow, Canada stopped for a few hours on Saturday night to venerate the Tragically Hip, the band that for many has come closest to defining that country’s cultural identity. “Thank you,” Gord Downie, the Hip’s frontman, told the crowd from a stage in Kingston, Ontario, “for keeping me pushing, and keeping me pushing. ” In late May, Mr. Downie, 52, revealed that he had terminal brain cancer. Far from retreating, the band instead planned a short summer tour, by turns jubilant and wrenching, that has transfixed much of Canada for the last month. Kingston, the group’s hometown, was the last stop. Mr. Downie arrived onstage at the Rogers   arena  —   on The Tragically Hip Way  —   in a suit and jauntily feathered hat, and, with his four bandmates of over 30 years, tore through a   set of   hits and lyrical deep cuts. The mood was triumphal: The concert started after a spontaneous audience rendition of “O Canada” and ended with three encores. Prime Minister Justin Trudeau, who said he had been a fan since high school, was there, in a black Tragically Hip  . “This is a moment that’s going to be extremely powerful for all Canadians, I know,” he said in a live interview with the Canadian Broadcasting Corporation before the show. “Gord and the Tragically Hip are an inevitable and essential part of what we are and who we are as a country. And tonight we get to say thanks, and we get to celebrate that. ” With a nationally televised live stream on Saturday, people gathered to witness what could be Mr. Downie’s last major outing with the Hip, a rock act that is “our Stones, our Hendrix, our Zeppelin, our Bob Dylan, all wrapped up in one awesome band,” as one Kingston fan, Wes Guidry, put it. There were viewing events in hockey arenas, town squares, clubs and restaurants from the Yukon to Nova Scotia, and in United States towns near the border, like Plattsburgh, N. Y. “Dear World,” the Toronto police wrote on Twitter on Saturday morning. “Please be advised that Canada will be closed tonight at 8:30 p. m. Have a #TragicallyHip day. ” In terms of national attention, the Kingston concert was “analogous to the Super Bowl,” said Randy Lennox, president of broadcasting and content for Bell Media, a major Canadian broadcaster. Mr. Lennox, who previously ran Universal Canada, the Tragically Hip’s label, and who has known the band members since 1988, said that Mr. Downie is to Canada what Bono is to Ireland. “This is indigenous, this is a band that is our soul,” he said. (Mr. Downie has declined interview requests.) Since its first studio album in 1989, the Hip, as the band is widely known, has risen from a   bar band to one whose dense lyrics, touching on hockey players and heroes of the Canadian wilderness, now invite close reading  —   “a proletarian group with an intellectual sensibility,” as the Canadian cultural essayist and novelist Stephen Marche wrote in The New Yorker. “  hockey fans howl their biggest anthems in parking lots after games assistant professors of Canadian literature listen to their later work while jogging. ” Though they’ve had a few legs up  —   in 1995 Dan Aykroyd, a longtime fan and fellow Canadian, brought them to play on “Saturday Night Live”  —   their success never translated south. But being a uniquely Canadian phenomenon (they’re on a stamp) has endeared them even further at home. “We’re a country that hasn’t really embraced its history just yet,” said the musician Kevin Drew, of Broken Social Scene. “We’re still trying to figure out what makes us Canadian, and we have one of the loudest neighbors in the world, so this band helped a country, and Gord helped people lyrically, slowly start to try to define themselves. ” With Dave Hamelin, Mr. Drew was a producer on the Hip’s most recent album, “Man Machine Poem,” which was recorded, he said, before Mr. Downie’s December cancer diagnosis, and released in June, shortly after the band announced it. In the studio, Mr. Drew said, he saw the fluidity of three decades of musicianship among the Hip’s other members: the bassist Gord Sinclair, the guitarists Paul Langlois and Rob Baker, and the drummer Johnny Fay. “I saw them write a song in three minutes once,” he said. “It blew my mind. ” And Mr. Downie was as open and   as a novice. “He would be pacing around, saying, ‘Let’s go as far as we can,’” Mr. Drew said. “Gord pushes you to be your best,” he added. “That’s why people come to his shows and sing their guts out, because they feel like their best selves. ” The Hip has had a deep impact on the Canadian musical scene. Allan Reid, president and chief executive of the Canadian Academy of Recording Arts and Sciences, which presents the Juno Awards, the Canadian Grammys, called the Hip “the best rock band this country has ever seen. ” (The band has earned 14 Junos.) Geddy Lee, frontman for Rush, for whom the Hip once opened, praised them in an email for their “blues based, sinewy, guitar rock combined with Gord’s original poetic style of lyrics. ” He attended one of their Toronto shows this month  —   “an incredibly heartfelt and moving experience,” he said, “one I shall never forget. ” And band members continue to mentor younger acts, like Arkells, which opened for them recently. “There’s a Gord line I love,” from the record “Now for Plan A,” the Arkells singer, Max Kerman, wrote in an email: “‘We don’t want to do it. We want to be it.’ Gord committed himself to a life of music and performance art in an incredibly profound way. ” At a Pearl Jam concert in Wrigley Field in Chicago on Saturday, Eddie Vedder dedicated the song “Light Years” to the Hip. “Their poetry is staggering,” said Sarah Polley, the Canadian actress and filmmaker, who covered the Hip’s song “Courage” for her 1997 film, “The Sweet Hereafter. ” “They are the soundtrack of this country in so many ways. ” Ms. Polley was also at one of their recent Toronto shows. “It’s been such a gift that they’ve let us say thank you with this tour,” she said in an email. “I bought a grilled cheese sandwich yesterday and the guy serving me started talking about them and the two of us just stood there and wept together without apology or embarrassment. ” The tour has also become a   mission: Mr. Downie, whose cancer, glioblastoma, is not curable, started a brain cancer research fund at the Sunnybrook Foundation, a health center affiliated with the University of Toronto, and the Canadian Cancer Society was also expecting hundreds of thousands of dollars in donations this weekend, a spokeswoman said. “The gesture and the courageousness of doing what they were doing wasn’t lost on anyone,” said Mr. Drew, who was at shows in Toronto and Kingston. Though Mr. Downie relied on teleprompters for help with lyrics, and was not as kinetic as in the past, the performances “were exceptional,” Mr. Drew said. “The detail, the care  —   they were there and they were present. They pushed themselves. ” In the final moments of many of their recent shows, Mr. Downie has been alone onstage, looking out into a roaring audience. “It’s an implicit goodbye, without being overt,” Mr. Lennox, the media executive and Mr. Downie’s longtime friend, said. But at the end of their show in Kingston, for their   about final song, the Hip simply played one of their biggest hits, “Ahead by a Century,” a 1996   pop song about childhood innocence, beloved and performed by gymnasiums full of Canadian schoolchildren for years. The night felt, Mr. Drew said, “hopeful. ”'"}, "time": 1742628409.2439337}