{"duration": 0.03681302070617676, "input_args": {"text": "'Actress and human rights activist Angelina Jolie says President Donald Trump’s executive order temporarily suspending the U. S. Refugee Admissions Program is like “playing with fire” and will “worsen” America’s war against terrorists. [“Shutting our door to refugees or discriminating among them is not our way, and does not make us safer,” Jolie wrote in an   published Thursday in the New York Times. “Acting out of fear is not our way. Targeting the weakest does not show strength. ”  Jolie, who serves as special envoy of the United Nations High Commissioner for Refugees, says “the lesson of the years we have spent fighting terrorism since Sept. 11 is that every time we depart from our values we worsen the very problem we are trying to contain. ” President Trump’s order suspended the U. S. Refugee Admissions Program for 120 days and bars refugees from failed terror   coming into the United States during that period. A review of the refugee vetting process is now underway. While never mentioning Trump’s name, Jolie rebukes the president’s refuge order calling it a departure from “our country’s history of giving shelter to the most vulnerable people. Americans have shed blood to defend the idea that human rights transcend culture, geography, ethnicity and religion. ” While acknowledging Trump’s pledge to protect America from its enemies around the world, Jolie says the president’s action “must be measured and should be based on facts, not fear. ” “If we send a message that it is acceptable to close the door to refugees, or to discriminate among them on the basis of religion, we are playing with fire. We are lighting a fuse that will burn across continents, inviting the very instability we seek to protect ourselves against,” the Academy Award winner writes. Last May, Jolie criticized Trump after he proposed his plan to temporarily halt entry for nationals from countries fraught with terror. “To me, America is built on people from around the world coming together for freedoms, especially freedom of religion,” Jolie said. “So it’s hard to hear this is coming from someone who is pressing to be an American president” While the Maleficent star continues to condemn Trump’s policies, her father actor John Voight is a fierce supporter. Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742561776.013684}