{"duration": 0.26775050163269043, "input_args": {"text": "'“I love that you still say y’all!” Cecile Richards said to Barbara Bush. Within minutes, both women sounded markedly more Texan than they had when they walked into the restaurant. But Texas twangs may be the least of what they have in common. The families of Ms. Bush, 34, daughter of former President George W. Bush and the chief executive of Global Health Corps, a nonprofit organization, and Ms. Richards, 58, president of Planned Parenthood Federation of America and daughter of former Gov. Ann W. Richards of Texas, go way back. At the 1988 Democratic convention, Governor Richards, who died in 2006, got off one of the best   in memory when she said of former President (and candidate at the time) George Bush: “Poor George. He can’t help it. He was born with a silver foot in his mouth. ” His son George W. evened the score in 1994 by beating her decisively in the Texas governor’s race. But there was no trace of animosity when the women met for lunch at Gotham Bar and Grill. They are enthusiastic supporters of each other’s work. Before becoming president of Planned Parenthood in 2006, the nation’s leading provider of reproductive health services and sex education for women, men and young people, Ms. Richards founded America Votes, a group that coordinates and promotes progressive issues. Before that, she was deputy chief of staff to Representative Nancy Pelosi, the California Democrat who is now the House minority leader, and worked for many years as a labor organizer. Ms. Bush founded Global Health Corps in 2009 (along with her twin sister, Jenna Bush Hager, and others) to address disparate health results among rich and poor countries. The organization provides yearlong fellowships to young professionals with diverse backgrounds by embedding them in health organizations in Africa and underserved communities in the United States. The number of fellows has grown from 22 in its inaugural year to 140 in its eighth class, which began this month, from a pool of over 5, 000 applicants. Over black cod (for Ms. Bush) and branzino (for Ms. Richards) the pair discussed the challenges of growing up in political families the politicization of health care, especially for women and the coincidence of appearing in a recent collection of essays, “What I Told My Daughter: Lessons from Leaders on Raising the Next Generation of Empowered Women,” edited by Nina Tassler. PHILIP GALANES: Let’s start with Nora Ephron, who said that, as a kid, she dreamt of being the president’s daughter because of all the attention she’d get, especially from boys. Did that indirect spotlight appeal to you? BARBARA BUSH: I really didn’t notice it. I was so young. When I was 8, I asked a friend when her grandfather’s inauguration was. I had just been to my grandfather’s, and I assumed everybody had one. PG: How about when your father ran for president? BB: We were 18 then. At 18, you’re focused on yourself and where you’ll go to college. Our parents wanted that for us. CECILE RICHARDS: I was at a very different time in my life. I was 30 when I moved back to Texas to help with Mom’s campaign. I had a    daughter and was pregnant with twins at her inauguration. BB: You have twins? I’m a twin. CR: Twins are the best. PG: Did you like campaigning for your mother, or was it an obligation? CR: Oh, there was never any question about it. It’s different, running as a woman. And at that point, my mother wasn’t married. We were her support system. But it’s a mixed bag, seeing your parent run for office. There’s a little bit of glamour, but a lot of pain and suffering, watching them go through tough times. BB: I never read the media about my dad. I already had an opinion about him, millions of opinions. I didn’t need another person telling me what to think. And when it comes to attacks, people are attacking a caricature. They don’t actually know the person. I have the luxury of knowing my parents deeply. CR: A lot of people think of Ann Richards as larger than life. She always said: “Take me, warts and all. ” But I saw the vulnerabilities that the public didn’t. One of her favorite things was going to the movies and sitting in the dark. No one could bother her there. PG: You also can’t criticize your parents the way we civilians can. The first time I was really aware of Barbara was when you made that P. S. A. for gay marriage. There was a firestorm about your falling out with your father. BB: I didn’t realize how much attention that would get. Whoopi Goldberg had done one. And Julianne Moore. They had about 70 views. I didn’t think mine was going to get many more. But, of course, it did. Because the narrative was that I was breaking with my father. But I had talked to my dad about doing it, and he was very supportive. What surprised me were all the people who said: “How brave! Betraying your family like that. ” But my parents raised us to use our voices for issues we care about, and I feel strongly about marriage equality. The only brave thing is that I’m shy. That was the win: I used my voice. PG: It was your media debut. Meanwhile, everyone alive must know about Cecile’s marathon testimony before Congress last year over the battle to defund Planned Parenthood. Five hours! Lots of coffee or tranquilizers  —   or both? CR: They don’t let you do anything. You just sit there, at the pleasure of Congress, while they go in and out, taking breaks and talking in the hallways. I had no idea that it was going to be   on television, or that so many people would watch. I still have people come up to me on the subway and say they watched all five hours. PG: I couldn’t believe how rude the congressmen were. In a weird way, did they do you and Planned Parenthood a favor? CR: I think millions of people were exposed to the   of health care, and the aggressive attitudes toward women, the disrespect. It happened to be me, but it could have been any woman. There was a real lack of empathy for what women go through to access health care. PG: Did you walk out of the room thinking, “I just knocked it out of the park”? CR: Oh, no. It was more like: I just survived an endurance test. Later, I read a text from one of my twins, Daniel, who wrote: “Mom, I’m so proud of you. You’re doing a great job. And I think raising me really prepared you for this hearing today. ” BB: That’s so sweet. PG: It also brings us to your great commonality: women’s and global health. With your connections, I bet you could do anything you want. What led you to health care? The last I knew, Barbara was doing an internship at Proenza Schouler. BB: I still love them and would work for them still. PG: I remember an interview with your mother, Laura Bush, who sounded slightly apologetic that you were taking so long to land on a career. And you were only 25. CR: So, we share that, too: mothers who had high expectations for us. It’s a lot. BB: I still don’t know what my end goal is going to be. CR: Can I say how impressive Barbara is? It’s one thing to work at a    organization like Planned Parenthood, trying to shift the boat into the 21st century. But it’s another to say: “I see a problem, and I’m going to start an organization to fix it. ” BB: Since I was born, in 1981, we’ve had the drugs to save the millions of kids around the world who die every year. Yet the number of deaths hasn’t dropped at all. We have the tools to keep people healthy, but the systems are broken. CR: All my life, I’ve been lucky to work in social justice, starting as a labor organizer working with   working women. They’re the same ones we see at Planned Parenthood now: women trying to raise their kids, many of them single moms, working two jobs. And if you don’t have access to health care, women will put their health after everyone else’s. It’s like dinner was in Texas: Women took the chicken legs after everyone else had eaten. Women will go without cancer screenings or family planning, which causes unintended pregnancies. Barbara knows this from global health: If women are healthy, their families are healthy, their communities are healthy. It’s one of the most powerful ways to make social change. BB: Thanks to my parents, I got lots of exposure. I traveled with them when they launched Pepfar, an amazing program that saves the lives of people with H. I. V. around the world. At that time, if you were H. I. V. positive in the United States, it was just another chronic illness. But in a developing country, it was a death sentence. I met people who were mourning the deaths of their children and sisters, because they didn’t have access to drugs that exist. That blew my mind. We have the tools to solve these problems. We just need to use them more effectively. CR: It’s the same in reproductive health. We have the technology. But it’s not enough unless there’s public policy that supports getting women access to care. PG: I can’t imagine anyone in America disagreeing with the idea that we should all have health care. So, why is this conversation so poisonous? CR: There’s a total disconnect between political rhetoric and where the American people are. They believe folks should have access to health care and family planning. They believe young people should have sex education. No parent wants their child to get an infection, or get pregnant before they’re ready. We’re at a   low for unintended pregnancy in America. In any other moment, folks would go: “Wow! Let’s do more of that. It’s good for women and saves money. ” But the political environment is tough right now. BB: It’s crazy, and sad to think that health care is a polarizing issue, because it’s not a polarizing space. As a human, I hope everyone is healthy. And what happens in other places matters here. We saw that with Ebola. Everyone started paying attention when it seemed like it might impact us. But diseases don’t respect international borders. PG: Do you see big roles for storytelling and empathy? CR: So much shame has been placed on women, for having sex or using birth control or choosing to end a pregnancy. When women tell their stories, it makes a big difference. We learned that from the L. G. B. T. community, in terms of knowing people. Women come up to me all the time and thank me for telling my story, and sometimes they tell me theirs. But I was with three women in Pennsylvania, where they were trying to pass an outrageous, restrictive bill on abortions. These women desperately wanted their pregnancies, but learned at 20 weeks about severe fetal abnormalities. And here they were at a press conference, sharing their anguish in front of clicking cameras. I had two thoughts: What bravery. Then, why should they have to bare their souls? I see empathy every day, but I’m sorry that women still have to share their most personal stories. PG: The   millennials play big roles in both your organizations. BB: We think millennials are great. So many young people want to work on social change. They want to do good. Global Health started because this great talent pipeline was not moving into health care. It’s hard to know how you fit in if you’re not a doctor or nurse. If we can demystify that and create channels into Planned Parenthood and other exceptional organizations, then we’ll have an army of people working to solve health problems. CR: Ten years ago, when I came to Planned Parenthood, I met these young kids who were called “peer educators. ” They provided sex education in schools and talked to their principals about access to health care. They were in every town. I thought, “What you really are is leaders. ” And the great thing about bringing in thousands of young people to an organization is they begin to change it. One of the things I’m proud of at Planned Parenthood is the number of health centers providing trans care, which was largely driven by young activists. BB: I didn’t know what was in front of me when we were starting Global Health Corps. We didn’t even know if anyone would apply. We could never have predicted that a few years in, we’d have gotten to work with 600 amazing young people, 97 percent of whom stay in global health or social justice issues related to it. Our challenge is to keep growing as responsibly as we can. But we see a huge demand. CR: My biggest hope is that we can take partisanship out of this arena. Not to get too political, but we have Republican patients and staff members and board members. The need for health care doesn’t come with a party label. Under the Affordable Care Act, every woman who has health insurance gets birth control at no cost. That’s 55 million women. We don’t have to invent a new kind of birth control. We just have to close the lid between needing it and delivering it. And I’m optimistic that we’re on the cusp of making that happen. BB: You’ve got to be an optimist. PG: Let’s end with Nina Tassler’s book, “What I Told My Daughter. ” Cecile wrote an essay, and Barbara is the subject of her mom’s essay. So, what would you tell young women on the road to empowerment? CR: My mom used to say she saw too many young women passing up opportunities because they were afraid of failing. Her message to me was: “This is the only life you get. Take every chance and run with it  —   even if it doesn’t work out. ” BB: When I was thinking about starting Global Health, but afraid I wasn’t ready, my mom said: “You’re in another job, but always talking about Global Health. Are you going to be happy leaving this on your   list forever?” It’s the same with young fellows I speak with. They’re worried about taking the “right” next step at the “right” time. But there’s never a right time. Who knows where life is going to take us? CR: Exactly. Just do it. What’s the worst that could happen?'"}, "time": 1742561754.6153579}