{"duration": 0.10651445388793945, "input_args": {"text": "\"Subscribe \\nThe Obama administration recently announced measures to fight opioid addiction with treatment and prevention . It is hard to predict how these measures – and the new CDC guidelines – will affect chronic pain patients. However, in order to understand the many concerns patients with chronic pain have raised, it’s important to hear about what they are already facing. \\nWomen, particularly women of color, face a difficult time getting diagnosed with chronic pain conditions, let alone receiving treatment . Age also plays a role – young chronic pain patients may face difficulties in receiving accurate care. Several women with chronic pain shared their stories with me in an effort to display how difficult things already are for many of us in chronic pain. \\nHoly, a young woman from Maryland living with Ankylosing Spondylitis (AS), shared some of her struggles with me yesterday. AS is a debilitating form of arthritis that mainly attacks the back and spine. As such, it causes a tremendous amount of pain which can escalate during periods called ‘flare-ups.’ During flare-ups, patients may have to up medications such as corticosteroids (Prednisone) and pain medication. \\nHoly has been refused medical care during painful flare-ups that caused her to go to the emergency room. Currently, she is in so much pain that she is unable to work or continue pursuing secondary education. \\nShe feels that her pain could be better controlled with a higher dose of the opiate she is currently on, but fears the reactions and repercussions she will face by asking for that dose. Holy’s insurance won’t cover a consultation with a pain management specialist, something that many physicians are requiring in order to get away from prescribing opiates themselves. All she wants is to be able to function enough to pursue her education and have a semblance of Quality of Life (QOL). \\nHoly’s story is not unlike that of Britta in Minnesota, who currently has little pain management for her chronic illness-related pain. While she would like to ask for pain management and discuss medications, her insurance and health care organization have both put extreme regulations on opiates. \\nOther patients, including yours truly, already experience issues when picking up opiates or other controlled substances for pain relief at the pharmacy. We are often treated like criminals, something that becomes more obvious when you hear about urine and blood testing for illegal drugs in order to obtain your pain relief. \\nWhile the stories above are the most common I encounter, there are rare stories like that of Gwendolyn from Colorado. While she admits she is terrified of the effects of the new prescription guidelines, Gwendolyn sees a pain management specialist who has assured her that they will do whatever they can to make sure the process of obtaining her script doesn’t change and that her QOL isn’t negatively affected. Like Holy, though, she still has had negative responses when needing to utilize the emergency room. \\nAn important note to make: Uncontrolled pain can and does lead to suicide . Patients who have little to no QOL and cannot access pain relief often feel as though they have nowhere to turn. Relationships suffer, contributing to a feeling of isolation and loneliness. There are some doctors who see this , who realize that pain and depression may be related, and who are reluctant to follow or are even actively resisting the various new guidelines. \\nIt remains to be seen how the new guidelines will affect healthcare across the country. Reducing the number of deaths from opiate abuse is important, but we also need to be mindful of those in unending pain who may have no other options than opiates. Limiting their access reduces their QoL and will, ultimately, lead to preventable deaths. \\nFeatured Image via Charles Williams/Flickr , available under a Creative Commons 2.0 license . About Kirsten Schultz \\nKirsten Schultz is a writer and chronic illness guru living in Madison, Wisconsin. Her undergraduate degree is in religious studies with a double minor in history and politics. However, during her first go of graduate school, she fell extremely ill and had to drop out. She now shares her musings on living with chronic illness at her site Not Standing Still's Disease, writes about how illness affects Quality of Life (QoL) issues at Chronic Sex and Creaky Joints, and runs a weekly chat on QoL issues Thursday nights on Twitter. Connect\""}, "time": 1742562790.4138715}