{"duration": 0.06701159477233887, "input_args": {"text": "'TEL AVIV  —   The Palestinian Authority has paid out NIS 4 billion ($1. 12 billion) over the past four years towards salaries for terrorists and their families, a former intelligence chief said on Monday. [Brig. . (res.) Yossi Kuperwasser, who served as the director general of the Ministry of Strategic Affairs, told the Knesset’s Foreign Affairs and Defense Committee that the longer a Palestinian security prisoner is jailed, “the higher the salary.   …     Anyone who has sat in prison for more than 30 years gets NIS 12, 000 ($3, 360) per month. ”  “When they’re released, they get a grant and are promised a job at the Palestinian Authority. They get a military rank that’s determined according to the number of years they’ve served in jail,” he added, according to the (Hebrew) NRG website. Kuperwasser also said the PA’s claim that the funds are social welfare benefits to needy families is simply a lie. Their own budgets, he said, “clearly state that these are salaries and not welfare payments. ” Kuperwasser, today a project director at the Jerusalem Center for Public Affairs think tank, told the Committee that the funds were channeled indirectly from the PA to recipients “via a   ‘payment fund. ’” “There was a willingness to believe the lies that it was social support. In practice, no steps have been taken to change the situation and in the meantime, the Palestinians are trying to depict themselves as supporting peace while they are still paying the families of terrorists,” Kuperwasser said. “Assurance of a cash prize for acts of terror is encouragement to terrorism and is against international law, international conventions, the Oslo accords and other agreements that they have signed on. ” The Knesset briefing came days after President Donald Trump visited Israel and met with PA President Mahmoud Abbas for the second time in one month. Trump addressed Abbas on the issue at their joint press conference, saying, “Peace can never take root in an environment where violence is tolerated, funded or rewarded. ” According to Israel’s Channel 2 TV, when Trump and Abbas met behind closed doors just an hour earlier, the U. S. president lashed out at the Palestinian leader for lying to him. “You tricked me in DC! You talked there about your commitment to peace, but the Israelis showed me your involvement in incitement [against Israel],” Trump fumed. The sudden display of anger shocked the Palestinian representatives into silence for several minutes, the report said, and thereafter the meeting was filled with tension. Palestinian sources swiftly denied the report, saying the meeting went well. The Palestinian Ma’an news agency quoted a PA official on Monday accusing Israel’s media of “lying” about the meeting in order to evade peace talks “because the Israelis don’t want to achieve peace. ” However, a Palestinian official told the Israel Hayom daily on Monday that while the meeting “started on a positive note,” it soon “deteriorated after Trump accused Abbas of supporting incitement and terrorism with the salaries paid to prisoners. ” “Trump made it clear to Abbas that he must curb   incitement in the Palestinian education system, saying Abbas cannot turn a blind eye to Palestinian incitement and pay stipends to terrorists’ families while simultaneously setting conditions that hinder any progress in the peace talks,” the report said. Abbas reportedly defended his government’s actions by saying that “in the past, there was a joint   committee that sought to deal with incitement on both sides, but it has not met for years. As for the prisoners’ stipends, those are paid by the PLO’s prisoner authority, not the Palestinian government. ” At this point, according to the Israel Hayom report, “Trump lost his patience and interrupted Abbas, banging his fist on the table and admonishing him, saying, ‘You can talk about how much you want peace, but that’s empty [rhetoric]. ’” Following Kuperwasser’s briefing on Monday, the committee’s chairman, Avi Dichter (Likud) said he would review what steps Israel should take in response to what he said was continued Palestinian incitement to terror. “The State of Israel cannot get involved in a political process aimed at peace when those who are supposed to be our partners incite [to terror]. For years, not only has it [incitement] not decreased, it has increased,” Dichter, a former director of the Shin Bet security service, said. According to PA law, Palestinian security prisoners in Israeli jails and families of terrorists killed while carrying out attacks against Israelis receive monthly stipends that range from a few hundred dollars to a few thousand in accordance with the gravity of their crimes. The U. S. Congress is pushing hard for the Taylor Force Act  —   legislation that would cut U. S. funding to the Palestinian Authority so long as it continues to provide financial support to the families of perpetrators of attacks against Israelis and  . The bill is named after former U. S. Army veteran and Vanderbilt University graduate student Taylor Force, who was killed in a stabbing attack while he toured Tel Aviv with his school in March 2016. On Tuesday, Nitsana   told Breitbart News Daily it was “shocking” that the administration was still implicitly supporting the payment of terrorists’ salaries and it was high time the U. S. cut funding to the PA. This money is inducing others to go and kill, and as you can see not only Israelis are getting killed on the streets of Tel Aviv and Jerusalem. A lot of tourists are getting killed. Israel is a popular country and gets a lot of visits from people all over the world, and Taylor Force was not the first American getting killed in Tel Aviv and unfortunately will not be the last one. The United States knows that part of the money they are giving to the Palestinian Authority is going to pay these prisoners and to pay the families of those who have killed their own civilians, American citizens, and as you say it’s totally ironic, horrible and unbelievable that the administration keeps supporting the Palestinian Authority without demanding right now to bring to a halt right now all these payments to the prisoners and the families of suicide bombers.'"}, "time": 1742628373.1899886}