{"duration": 0.09087777137756348, "input_args": {"text": "' It Was the Rise of the Davos Class That Sealed America\\x92s Fate\\nHillary Clinton\\x92s embrace of neoliberalism was disastrous. The only answer now is to take on the billionaires\\nBy Naomi Klein\\nNovember 10, 2016 \" Information Clearing House \" - \" The Guardian \" - They will blame James Comey and the FBI. They will blame voter suppression and racism. They will blame Bernie or bust and misogyny. They will blame third parties and independent candidates. They will blame the corporate media for giving him the platform, social media for being a bullhorn, and WikiLeaks for airing the laundry.\\nBut this leaves out the force most responsible for creating the nightmare in which we now find ourselves wide awake: neoliberalism. That worldview \\x96 fully embodied by Hillary Clinton and her machine \\x96 is no match for Trump-style extremism. The decision to run one against the other is what sealed our fate. If we learn nothing else, can we please learn from that mistake?\\nHere is what we need to understand: a hell of a lot of people are in pain. Under neoliberal policies of deregulation, privatisation, austerity and corporate trade, their living standards have declined precipitously. They have lost jobs. They have lost pensions. They have lost much of the safety net that used to make these losses less frightening. They see a future for their kids even worse than their precarious present.\\nAt the same time, they have witnessed the rise of the Davos class, a hyper-connected network of banking and tech billionaires, elected leaders who are awfully cosy with those interests, and Hollywood celebrities who make the whole thing seem unbearably glamorous. Success is a party to which they were not invited, and they know in their hearts that this rising wealth and power is somehow directly connected to their growing debts and powerlessness.\\nFor the people who saw security and status as their birthright \\x96 and that means white men most of all \\x96 these losses are unbearable.\\nDonald Trump speaks directly to that pain. The Brexit campaign spoke to that pain. So do all of the rising far-right parties in Europe. They answer it with nostalgic nationalism and anger at remote economic bureaucracies \\x96 whether Washington, the North American free trade agreement the World Trade Organisation or the EU. And of course, they answer it by bashing immigrants and people of colour, vilifying Muslims, and degrading women. Elite neoliberalism has nothing to offer that pain, because neoliberalism unleashed the Davos class. People such as Hillary and Bill Clinton are the toast of the Davos party. In truth, they threw the party.\\nTrump\\x92s message was: \\x93All is hell.\\x94 Clinton answered: \\x93All is well.\\x94 But it\\x92s not well \\x96 far from it.\\nNeo-fascist responses to rampant insecurity and inequality are not going to go away. But what we know from the 1930s is that what it takes to do battle with fascism is a real left. A good chunk of Trump\\x92s support could be peeled away if there were a genuine redistributive agenda on the table. An agenda to take on the billionaire class with more than rhetoric, and use the money for a green new deal. Such a plan could create a tidal wave of well-paying unionised jobs, bring badly needed resources and opportunities to communities of colour, and insist that polluters should pay for workers to be retrained and fully included in this future. It could fashion policies that fight institutionalised racism, economic inequality and climate change at the same time. It could take on bad trade deals and police violence, and honour indigenous people as the original protectors of the land, water and air.\\nPeople have a right to be angry, and a powerful, intersectional left agenda can direct that anger where it belongs, while fighting for holistic solutions that will bring a frayed society together.\\nSuch a coalition is possible. In Canada, we have begun to cobble it together under the banner of a people\\x92s agenda called The Leap Manifesto , endorsed by more than 220 organisations from Greenpeace Canada to Black Lives Matter Toronto, and some of our largest trade unions.\\nBernie Sanders\\x92 amazing campaign went a long way towards building this sort of coalition, and demonstrated that the appetite for democratic socialism is out there. But early on, there was a failure in the campaign to connect with older black and Latino voters who are the demographic most abused by our current economic model. That failure prevented the campaign from reaching its full potential. Those mistakes can be corrected and a bold, transformative coalition is there to be built on.\\nThat is the task ahead. The Democratic party needs to be either decisively wrested from pro-corporate neoliberals, or it needs to be abandoned. From Elizabeth Warren to Nina Turner, to the Occupy alumni who took the Bernie campaign supernova, there is a stronger field of coalition-inspiring progressive leaders out there than at any point in my lifetime. We are \\x93leaderful\\x94, as many in the Movement for Black Lives say.\\nSo let\\x92s get out of shock as fast as we can and build the kind of radical movement that has a genuine answer to the hate and fear represented by the Trumps of this world. Let\\x92s set aside whatever is keeping us apart and start right now.\\nNaomi Klein is the author of This Changes Everything: Capitalism vs the Climate . She tweets @NaomiAKlein'"}, "time": 1742564411.8360217}