{"duration": 0.17061781883239746, "input_args": {"text": "'Donate Remember This When You Talk About Standing Rock Dan Nanamkin during the treaty camp’s confrontation with militarized police force on Thursday afternoon. Photo by Adam Alexander Johansson. By Kelly Hayes / yesmagazine.org \\nThis piece is very personal because, as an Indigenous woman, my analysis is very personal, as is the analysis that my friends on the frontlines have shared with me. We obviously can’t speak for everyone involved, as Native beliefs and perspectives are as diverse as the convictions of any people. But as my friends hold strong on the frontlines of Standing Rock, and I watch transfixed with both pride and worry, we feel the need to say a few things. \\nI’ve been in and out of communication with my friends at Standing Rock all day. As you might imagine, as much as they don’t want me to worry, it’s pretty hard for them to stay in touch. I asked if there was anything they wanted me to convey on social media, as most of them are maintaining a very limited presence on such platforms. The following is my best effort to summarize what they had to say, and to chime in with a few corresponding thoughts of my own. \\nIt is crucial that people recognize that Standing Rock is part of an ongoing struggle against colonial violence. #NoDAPL is a front of struggle in a long-erased war against Native peoples — a war that has been active since first contact, and waged without interruption. Our efforts to survive the conditions of this anti-Native society have gone largely unnoticed because white supremacy is the law of the land, and because we, as Native people, have been pushed beyond the limits of public consciousness. \\nThe fact that we are more likely to be killed by law enforcement than any other group speaks to the fact that Native erasure is ubiquitous, both culturally and literally, but pushed from public view. Our struggles intersect with numerous others, but are perpetrated with different motives and intentions. Anti-Blackness, for example, is a performative enforcement of structural power, whereas the violence against us is a matter of pragmatism. The struggle at Standing Rock is an effort to prevent the construction of a deadly, destructive mechanism, created by greed-driven people with no regard for our lives. It has always been this way. We die, and have died, for the sake of expansion and white wealth, and for the maintenance of both. \\nThe harms committed against us have long been relegated to the history books. This erasure has occurred for the sake of both white supremacy and US mythology, such as American exceptionalism. It has also been perpetuated to sustain the comfort of those who benefit from harms committed against us. Our struggles have been kept both out of sight and out of mind — easily forgotten by those who aren’t directly impacted. \\nIt should be clear to everyone that we are not simply here in those rare moments when others bear witness. \\nTo reiterate (what should be obvious): We are not simply here when you see us. \\nWe have always been here, fighting for our lives, surviving colonization, and that reality is rarely acknowledged. Even people who believe in freedom frequently overlook our issues, as well as the intersections of their issues with our own. It matters that more of the world is bearing witness in this historic moment, but we feel the need to point out that the dialogue around #NoDAPL has become extremely climate oriented. Yes, there is an undeniable connectivity between this front of struggle and the larger fight to combat climate change. We fully recognize that all of humanity is at risk of extinction, whether they realize it or not. But intersectionality does not mean focusing exclusively on the intersections of our respective work. \\nIt sometimes means taking a journey well outside the bounds of those intersections. \\nIn discussing #NoDAPL, too few people have started from a place of naming that we have a right to defend our water and our lives, simply because we have a natural right to defend ourselves and our communities. When “climate justice”, in a very broad sense, becomes the center of conversation, our fronts of struggle are often reduced to a staging ground for the messaging of NGOs. \\nThis is happening far too frequently in public discussion of #NoDAPL. \\nYes, everyone should be talking about climate change, but you should also be talking about the fact that Native communities deserve to survive, because our lives are worth defending in their own right — not simply because “this affects us all.” \\nSo when you talk about Standing Rock, please begin by acknowledging that this pipeline was redirected from an area where it was most likely to impact white people. And please remind people that our people are struggling to survive the violence of colonization on many fronts, and that people shouldn’t simply engage with or retweet such stories when they see a concrete connection to their own issues — or a jumping off point to discuss their own issues. Our friends, allies and accomplices should be fighting alongside us because they value our humanity and right to live, in addition to whatever else they believe in. \\nEvery Native at Standing Rock — every Native on this continent — has survived the genocide of a hundred million of our people. That means that every Indigenous child born is a victory against colonialism, but we are all born into a fight for our very existence. We need that to be named and centered, which is a courtesy we are rarely afforded. \\nThis message is not a condemnation. It’s an ask. \\nWe are asking that you help ensure that dialogue around this issue begins with and centers a discussion of anti-Native violence and policies, no matter what other connections you might ultimately make, because those discussions simply don’t happen in this country. There obviously aren’t enough people talking about climate change, but there are even fewer people — and let’s be real, far fewer people — discussing the various forms of violence we are up against, and acting in solidarity with us. And while such discussions have always been deserved, we are living in a moment when Native water protectors and water warriors have more than earned both acknowledgement and solidarity. \\nSo if you have been with us in this fight, we appreciate you. But we are reaching out, right now, in these brave days for our people, and asking that you keep the aforementioned truths front and center as you discuss this effort. This moment is, first and foremost, about Native liberation, self determination and Native survival. That needs to be centered and celebrated. \\nThanks, \\nK and friends \\nKelly Hayes is a direct action trainer and a co-founder of The Chicago Light Brigade and the direct action collective Lifted Voices. She blogs at TransformativeSpaces.org , where this article originally appeared, about U.S. movements and her work as an organizer against state violence. 4.0 ·'"}, "time": 1742561641.0355687}