{"duration": 0.10312509536743164, "input_args": {"text": "'You are here: Home / US / New Poll Reveals The REAL REASON NFL Rating Are in The Toilet New Poll Reveals The REAL REASON NFL Rating Are in The Toilet October 28, 2016 Pinterest \\nIt probably won’t come as a surprise to anyone why NFL ratings seem to be sinking this season. It’s not because people are busy and have suddenly decided not to watch football. There are indeed several reasons, but the main reason seems to be due to the National Anthem protests by some NFL players. \\nNo one has an issue with any of these men protesting – it’s called the 1 st Amendment – but people tune into football to forget about the daily grind and everything that’s going on in the world for a couple hours a week and don’t need to see some jackasses protesting AT WORK. \\nLet’s face it, you would probably get fired if you suddenly decided to protest during your work day while AT work. That’s exactly what these guys are doing. They should wait until they are out of work, like the rest of the country, to protest. No one would take issue with that. \\nFrom CBS Boston : \\nA fresh poll from Seton Hall surveyed 841 adults across the U.S. Each respondent was asked to identify seven separate factors as a reason for the NFL ratings drop, allowing them to answer “yes” or “no” for each of them. The leading factor, according to the poll, was the national anthem protests, which scored “yes” at a rate of 56 percent. \\nOther answers also scored “yes” at a high rate, including 50 percent of “yeses” for coverage of the presidential election, 47 percent for the league’s handling of domestic violence cases, 44 percent for the over-saturation of the market, 39 percent for increased interest in postseason baseball, and 33 percent for controversy over head injuries and player safety. \\nAgain, it’s not about their right to protest. It’s that they are protesting AT WORK and protesting in front of CUSTOMERS of their EMPLOYERS. Customers who pay their multi-million dollar salaries every year through watching the NFL; buying tickets to games and buying products of said teams. \\nForget the fact they are protesting for a bogus, communist-driven cause like ‘Black Lives Matter.’ The cause isn’t even relevant, it’s that they are doing it at work and interfering with their job – to entertain their customers. If you can’t do the one job you’re paid to do, you shouldn’t have that job. \\nAnd NFL ratings will continue to slide if these tools continue to fail at their job.'"}, "time": 1742563857.1675773}