{"duration": 0.1696183681488037, "input_args": {"text": "'Anti-trust and anti-corporate Anti-imperialism \\nWhile few radicals have made it into public executive positions either, they are numerous in politics, especially at the local level where communal ties can predominate. Radicals have always worked in organized groups—‘societies,’ unions, and parties—which have been a multiplier for their demands. \\nCritically, these are grievance-driven policies. One could say that the goal of radicals is to force an end to exploitation, particularly economic exploitation since most radicals come from those on the bitter end of such equations. As such, many of them have specific remedies or end states. Notably absent are ‘moral uplift,’ better society objectives other than in the abstract sense. Further, since so much of radicalism is communally based it has often been difficult for radicals to form inter-communal alliances. \\nSecondarily, since the goals are highly specific to individual groups, factionalism is endemic. Radicals have disproportionately been drawn from the poor, and from minority communities; groups who have had little to lose, and for whom even small gains loom large, especially economic ones. These have been disproportionately non-Anglo American, many of whom brought their radicalism with them from prior experiences in Europe, though occasionally their message has radicalized contemporary indigenés, for example ‘Big Bill’ Haywood or John Reed (or Chris Hedges). Radicals have always had to ‘struggle,’ not least since they have consistently been assaulted by other factions and the state: militancy was their real party card. If this wasn’t necessarily violent, it was confrontational, as in boycotts and occupations (sit-downs). While radical women have always been visible, the backbone of radicals always was minority community men. Think Joe Hill and Sam Gompers. \\nMany earlier immigrant communities experienced considerable oppression, and not only came to America as an escape but brought radical elements with them. That was true amongst German, Polish, Jewish, and Italian immigrants, and was relevant amongst the small West Indian population as well. Their third and fourth generation descendants are, at best, little involved with radical organizing. Present immigrant communities to the US are substantially from Central America and its surrounds, East Asia, and sub-Saharan Africa. These communities have not brought radical elements with them: those have tended to stay home or go elsewhere. They have largely come here for the opportunity to better themselves, and shaking the social order is the last thing on their agenda. The exception to that are Muslim immigrants to the US, of diverse background though substantially Arab in origin. Presently, they lack indigenous American allies, and are heavily policed by the state; they are no way placed to take a vanguard position supposing that they were so inclined. \\nReviewing the summary above, it will be evident that the supply of aggrieved militants has thinned out. One could say, uncharitably, they their residual objective has been a piece of the pie, and to be left alone to eat it in dignity. “Share the wealth,” is the substance of their message. Once they have any, the tendency is to sing another song. On a darker note, some were later sedentarized by acquiring apparatuses, which easily rancidify into patronage and rent-seeking gatekeepers. \\nWhat radicals do best is bunch up and shove, that is organize and agitate. Those now don’t bunch, and have little inclination to shove as opposed to fit in. But for blatant discrimination, present immigrants would be a reliable, conservative voter base not inclined to pursue economic grievances through activism. Without that muscle, labor has no strength. What labor has are mortgages, debt, and a lot to lose, not a matrix congruent with agitation. \\nFrom the perspective here, progressive and radical vectors and their policies overlap directly only in a few areas. Moreover, these vectors have tended to be pursued by discrete demographic and ethnic communities, though of course values and polices have been swapped and shared at times and in places. The success of one vector has tended to advance the success of the other Said another way, they have been more powerful in combination than either would be alone. If radicals might have achieved some of their goals without progressive support, though, the reverse is not true. Progressive advocacy particularly lacks any traction at present absent effective radical agitation to make the progressives seem like ‘the reasonable ones.’ \\nA further conclusion from this analysis is that the assault of the right has been focused disproportionately upon the prior policy and institutional gains of the radical vector. From one perspective, one could hypothesize that the broader socio-culture has focused its response upon the ‘most foreign’ or perhaps ‘least native’ contentions. I’m far from sure that I believe that myself. For one thing, the oligarchy and the right are most hostile to economic claims. With the exception of environmental activism, which has huge economic implications, most advocacy for economic justice has lain primarily with the radical rather than progressive community. Radical agitation has been the most militant, provided the most physical muscle, and is historically sourced amongst the poor, all reasons why radical successes should be expected to draw the larger reactionary attack. Then too, economic reforms are easier to attack since they are far less embedded in law than social reforms. And further, one should not assume a reactionary program will stop if and when the institutional bulwark of economic justice and organization is crushed, since there will be little to bar the marginalization or ban of existing progressive successes after such a point. \\nStill, any progressive or radical revival has to take into account that the assault of reaction has been principally aimed at economic justice and its supporting legal and institutional bases in the US and the UK. \\n“The best lack all conviction, while the worst are full of passionate intensity . . . .” \\nIf it all seems black, consider: Social justice never seemed deader than 1957, but enormous reforms were enacted by 1974. Progressivism was never more prostrate than c. 1900, but a broad reformist agenda was emplaced by 1916. \\nThe downside to those comparisons, though, is that radicalism did much of the agitation to impel reform in both cases, and it is just that engaged radicalism which we most lack now. To go back a further iteration to the 1849s, progressives sans radicals were far less successful until slaver states were stupid enough to revolt. The American socio-political context is more divided and radicalism weaker today than at any time since the 1840s. \\nAs of 2011, I would say that progressivism is broader and better known than at any time in American history, not least because of the validation and presence of past success. We can rely on the oligarchy to push to egregious excess. What we cannot rely upon is public agitation to be the thin end of the wedge. \\nCan we, then, expect oligarchical corruption and economic losses to push liberals and the haute bourgeois toward a reformist program? I wouldn’t count on that, and in particular, no one should expect that to happen quickly if it occurs at all. Take as an example Dylan Ratigan’s recent rant against elite corruption (to unfairly single out one prominent instance). His solution? “Let’s all get together on a Big Capitalist Spend-a-thon.” Because we’re ‘too divided,’ so we need something like a ‘Moon Program that brought us together.’ Now, I don’t know where Ratigan was in 1962, but that was the height of Civil Rights agitation, concurrent with mass agitation against atomic weapons testing, and also the start of the anti-poverty campaigns. His image of the country pulling together is something seen through the dollar signs on white tinted glasses, frankly. \\nBut there are two deeper points to take from his appeal. First, he, as many, evidently believes that capitalism will really save him and us, it’s just that ‘a few’ have hijacked it. He doesn’t want to change any system, only to get back to some non-existent past in the imagination when it worked, or rather when it worked ‘for people like me . . er, us.’ Many think like this, and it is a huge load of sand in the crankcase on any drive for change. What these folks want never worked for many in this society, but too many believe in retrospect that it did because that belief validates a lot of comfortable lies. That embrace of plasticine phantasies is a dead weight against change. \\nSecond, Ratigan inveighed against ‘factionalism’ even more than against corrupt oligarchs. Like many, he sees himself as in a reasonable center between ‘the left’ and ‘the right,’ and in firm American tradition mentioned above he is suspicious of special interests advocating ‘their position.’ So he wants us to come together around a common position. Now, the political naivety of this is stunning given the overt, anti-social, anti-citizen program of the right through a generation, pushed in private by many whom he doubtless respects in public. \\nBut even accepting the false analysis, what stands out is the extent to which progressives have let themselves become seen as ‘special interests’ advocating ‘for the few.’ Ratigan isn’t alone; many ‘liberals’ and ‘centrists’ and ‘independent voters’ share this view of progressives, explicitly or implicitly. This is where progressives are in the public mind, and not simply through propaganda from the right. \\nProgressives have successfully become tarred as ‘factional’ in significant part due to their involvement with identity politics, i.e. ‘X rights.’ The Democratic Party has correctly identified this imprimatur as an electoral loser, and for that reason amongst others have abandoned progressivism in the most cowardly way. However, we cannot expect ‘reasonable centrists,’ delusional or not, to embrace the reform program of ‘those X favorers;’ this will not happen. And not necessarily because ‘centrists’ hate ‘those Xers,’ but because the societal disposition is to shun advocates of minority advantage. \\nOne could list numerous conceptual failures amongst liberal and radical activists in this way. I’m going to limit myself to a few, with similarly few remedies to follow. Progressives have a childish fondness for a show of hands, i.e. elections, and a present obsession with the current reactionary ‘hypocrite’ coughed up by the oligarchy and the latter’s media. Both are pointless and self-defeating. Winning elections doesn’t matter; passing laws and regulations, and winning court decisions on their basis is what matters. The former may lead to the latter, but it hasn’t for twenty years at least. And the oligarchy can always recruit another quisling, the supply is endless; their personalities are irrelevant. \\nMoreover, the ideological ultra-right doesn’t care if they are in the minority: they’re delusionally convinced of their own validity, and will continue in their ways whether they get 10% or 70% of the vote. What matters isn’t what they’re after but simply beating them. \\nProgressives have become far too obsessed with ‘the agenda of the right’ to the point that they themselves presently have no positive agenda, certainly none that can draw in the uncommitted. Progressive actions are wholly defensive rather than offensive, and this maximizes the oligarchy’s huge advantage in money and organization. In an endless search for ‘equality,’ progressive activists have handcuffed themselves to the contemporary equivalent of campaigning for temperance (banning alcohol so as to ‘force’ uplift). These activisms and other, broader forms of identity politics aren’t something I would call for abandoning. They cannot, however, recruit a wider reform movement, and indeed actively repel those of limited political education because they focus inherently on ‘some, not all.’ \\nOn the radical side, employer based privileges (i.e. ‘contracts’) will continue to be broad-base losers for left liberals, exactly because they inherently favor ‘some, not all.’ The workplace organizing model was always compromised; in the US, it has failed. Narrow unions are dead, not least because corporations can move jobs, sites, and countries far too readily. Something much in evidence now amongst anti-union working class and petit bourgeois folks who should, in principle, support unions to enhance ‘prevailing standards’ gains is, explicitly, spite that some have good jobs and protections while these others don’t. If rightist propaganda has exploited this, the situation is nonetheless a huge bar to extending a radical reform program even amongst existing union members, to say nothing of those on the outside. Issue- and instance-specific campaigns such as opposition to fracking run into the same problems. If you are directly effected, it’s a crisis; if you live 100 miles away, it’s not your problem (seemingly). \\nSimilarly, “Free my spliff” doesn’t have much currency for non-tokers. The problem is that instance- and job-specific injustices have always been and remain primary, organizational drawing cards. These are what radicalize many individuals, and get them involved with activism to solve them. \\nTo me, the only way out of these dead ends lies in committing to a defined agenda of institutionalized, economic justice because this affects all. Social justice cannot be secured absent economic justice. Any such agenda is going to be anti-corporate, anti-poverty, pro-education (and job re-education), and pro-regulation. It has to be citizen-based outside of existing political parties. This kind of program can be articulated as pro-community rather than pro-faction if the organizing is done. This has to be pursued from a defined agenda, unapologetically, and from a pro-citizen(ship) position regardless of other more discrete goals. \\nWill Anglo-American progressives articulate any such program and organize around it? I can’t say that I’m optimistic. Yates said it best in the fewest words in a comparable social moment heading on for four generations ago. To extend upon that thought, the contemporaneous Fabian Society had a fine, progressive program. Almost anything they could have aimed for within reason was ultimately put in place too—from 1944-50 when the British Empire was derelict, the state effectively bankrupt, and the ruling class irretrievably discredited by their knee-jerk nationalism and societal niggardlyness. Between the wars, Fabian successors were unable to accomplish anything meaningful on their own. \\nAnd yes, we too now can rely upon the oligarchy to fail. They have nothing to offer 90% of the citizenry, economically or socially. They have been serial catastrophists in their grossly speculative market manipulation, and only grasp after ever more gassy phantasms following each failure. Their ‘bombsight hegemony’ pursued abroad gets no peace, no silence, and no net profit. Both on an historical basis and on present scrutiny, we can rely upon the extractive class to drive themselves right into the bridge abutment of ruin. \\nWhat we can’t rely upon is for them to impact that moment quickly. From an historical and cyclical perspective, ‘just waiting it out’ might take until 2035, even 2045. Now a generation of squalor and iniquity in the US is nothing to remark on scaled against world-historical standards; it would fit with the rule of things rather than the exceptions. Americans think that they are exceptional, and that that isn’t how they do things. Well, they’ll have to live up to that, because what is certain is that we won’t have reform without struggle. Government-buying oligarchs; sold-out liberals clutching their meal tickets; loose cannon fascist minority; deeply divided society: that’s too many logs to leap on a single, lucky bound, or to be rolled by Some Sainted Prez (of which we’ll have none). If we want change sooner than a generation of rot from now, it will have to be worked for, and worked for not with wagging fingers and dabs of money thrown at issues but with organization. \\nProgressives will continue to lose as long as they continue to act with strategic irresolution and tactical incompetence. They no longer have a political party to carry their banner: the Democrats have completely shut them out. Waverers and the Great Huddled Middle won’t respect, and so won’t support, natterers who won’t fight. \\nWe are not in a time for converting but one for confronting; not a time for compromise but a time for direct action. Holding actions are a way to lose slowly, an offensive program is needed. Naming and shaming, and electing the Next Great Saviour have both failed, and progressives need to get off those donkeys and articulate a real activist agenda. Spectacle gatherings which the media ignore and where everyone goes home Monday morning are presently ineffective because there is no organized base to make use of them. Money is not the main problem; feet on the ground moving forward are the real problem. A discrete agenda pursued full-time by experienced organizers is the solution. Less talk, and more walk. \\nProgressives have successfully stamped Big Capital as ‘anti-us’ historically, and they need to return to this. Those active for social reform have to forget about the electoral cycle. They have to forget about what the lunatic Right is doing as much as possible and concentrate on what they themselves are in process of accomplishing. They need a compact reform agenda (yes, bullet points and not more than ten of them). They need a defined activist strategy, no matter how large the difficulties or time horizon appear. They need to build genuinely activist organizations with specific plans to achieve a core set of goals. And they have to reclaim militancy as a word, and deed, of pride. If they do those things, they will make real progress, and moreover they will be ready when the moment comes for breakthrough amongst the wider society. 0 0 0 0 0 0 This entry was posted in Politics on by Lambert Strether . About Lambert Strether \\nLambert Strether has been blogging, managing online communities, and doing system administration 24/7 since 2003, in Drupal and WordPress. Besides political economy and the political scene, he blogs about rhetoric, software engineering, permaculture, history, literature, local politics, international travel, food, and fixing stuff around the house. The nom de plume “Lambert Strether” comes from Henry James’s The Ambassadors: “Live all you can. It’s a mistake not to.” You can follow him on Twitter at @lambertstrether. http://www.correntewire.com'"}, "time": 1742628437.2337582}