{"duration": 0.07732915878295898, "input_args": {"text": "'Google Pinterest Digg Linkedin Reddit Stumbleupon Print Delicious Pocket Tumblr \\nThe stakes were very high for Melania Trump’s big campaign speech, the only one she’s given since being very publicly mocked for stealing her best lines from the RNC from none other than First Lady Michelle Obama. Unfortunately for the Trump campaign, the pressure must have gotten to her. \\nShe plagiarized again. \\nIt took less than an hour for people to figure it out, but the source will have people scratching their heads for days. Melania, Trump’s third wife, seems to have lifted portions of her speech from Marla Maples, Trump’s second wife. \\nWhile speaking about her experiences as an immigrant, Melania said “America meant if you could dream it, you could become it.” \\nTablet Magazine writer Yair Rosenberg, simply put the line into Google and saw what came up. It was a direct quote from Marla Maples given to a magazine in the 90s. Melania just plagiarized Trump\\'s second wife Marla Maples. Here\\'s the only Google results for \"if you could dream it, you could become it\": pic.twitter.com/ALeHuSZqEm \\n— (((Yair Rosenberg))) (@Yair_Rosenberg) November 3, 2016 \\nIs “If you could dream it, you could become it” a cliche? Sure. Is it weird that Melania would say the exact same phrase that Marla had? Definitely. \\nHowever, more damning is what else Rosenberg noticed. It\\'s not just the one cliched line, it\\'s that the entire section about parents/opportunities is a ripoff, just like it was by Michelle Obama https://t.co/IK15IXH7As \\n— (((Yair Rosenberg))) (@Yair_Rosenberg) November 3, 2016 \\nIt’s as if Melania typed what she wanted to say into Google, found the interview by Marla Maples, and simply made it her speech . \\nEducator and speechwriter Yoni Brander pointed out that the odd butchering of the truism “If you can dream it, you can be it” suggests Melania really did lift the section directly from Marla – the only other person on record as having screwed it up that way. 3. can dream it, you can become it.\" by William A. Ward. But the form used byMelania which cuts the beginning of the quote and changes \\n— yoni brander (@yonibrander) November 3, 2016 4. changes the tense to \"if you dream it, you could become it” a variant that appears in only in one other place- Marla Maples interview \\n— yoni brander (@yonibrander) November 3, 2016 \\nIt is also in line with how Melania says she screwed up her RNC speech. She told reporters at the time that she accidentally plagiarized by harmlessly finding passages from other people that spoke to her and using them as her starting point. One of those passages, Michelle Obama’s speech, made its way into the final draft. In the same way, it appears Melania plagiarized her husband’s ex-wife. \\nTo which one must conclude that Trump’s camp is run by an staggering assortment of incompetent buffoons. To screw up one major speech is a goof, to screw up two in a row… that’s a level of idiocy that is difficult to wrap one’s head around. And while Melania needs to stop using Google to write her speeches, Trump’s campaign needs to spend five minutes making sure she doesn’t steal lines from the candidate’s ex-wife. It’s not rocket science. \\nFeatured image via Alex Wong/Getty Images Share this Article!'"}, "time": 1742563959.576099}