{"duration": 0.10427165031433105, "input_args": {"text": "'Should The Royal Monarchy Be Abolished? UK Taxpayers Think So Nov 20, 2016 1 0 \\nThe first few questions we should ask ourselves is “what point is there to even having a monarchy?” Additionally, “what good do they provide for the people of the UK and world? What is their purpose?” \\nUnited Kingdom taxpayers are asking themselves these questions and more amid fresh calls for the monarchy to be dissolved. Personal wealth estimated at over £300m, yet they want taxpayers to pay for the building? \\nThe Independent reports that Buckingham Palace is in need of repair, which is projected to be a 10 year project and will cost around £400 million-all from taxpayer money. The British government agreed to the increase in taxpayer funding, which is set to increase by 66%. \\nThose fighting for the abolishment of the monarchy are upset that the Royal Crown wants the public to pay for the renovation, all the while the Crown has an estimated worth of over £300 million, and owning land around the world estimated at a worth of over £7 billion. \\nGraham Smith, who is the chief executive of the Anti-Monarch Group Republic said: \\nThis is an absolute disgrace. An indictment of the Queen’s scandalous mismanagement of royal finances over six decades. MPs have repeatedly called on the Palace to fund repairs by opening up to tourists all year round and they’ve refused. If the royals can’t look after the buildings and raise their own revenue to fund maintenance, it’s time to give them up. \\nThe royals cost the taxpayer over £334 million per year and that keeps going up. We need independent inquiry and full disclosure of their spending. The monarchy’s costs need to be stripped right back, put the institution on a proper budgetary footing and allow parliament to approve the budget each year.” \\nSmith is right. Why is the cost to fund the royal family going up each year when they are worth over billions of pounds already? Additionally, we must ask why the Prime Minister, the Chancellor and the Keeper of the Privy Purse continue to agree to this increase in funding. \\nAgain, this is yet another example of how governments and the people who really run them, do not have any interest in bettering the world for all, but only for themselves. \\nFurthermore, it is well known throughout the world how the Crown still owns the United States and that the IRS is nothing but a royal corporation, where U.S. taxpayer money conveniently works it way back to the top. \\nThe world also knows about the massive, pedophilia ring that the elites in London have been and continue to be involved in, thanks to 60 Minutes Australia (a mainstream source that did an incredible job investigating the still unsolved story). \\nLastly, we must all continue to declare our sovereignty from such oppressive, cunning and secretive cults. We are living human beings and no longer need rulers, especially those who continue to rule with such a dark agenda. \\nWhile this story is still developing and the Crown will likely not go quietly into the night, humanity is waking up quickly and we can expect more people throughout the UK, as well as the world, to reclaim financial and social freedom. Perhaps Brexit was just the beginning.'"}, "time": 1742628557.9397948}