{"duration": 0.1601574420928955, "input_args": {"text": "'It was nearly eight years ago, somehow. Those who gathered then  —   curious, hopeful, freezing  —   remember it all: the ocean of faces across the National Mall the crackling energy, building as they waited the catharsis of more than a million strangers finding occasion to shiver together, cheer together, cry together after a presidential campaign that had, to them, affirmed the best of America. “On this day, we come to proclaim an end to the petty grievances and false promises,” President Obama vowed, just after assuming the title, “the recriminations and   dogmas that for far too long have strangled our politics. ” They remember that pledge. They do not remember why it seemed possible. The elections of 2008 and 2016: twin political moments that cannot be disentangled  —   an earthquake and its aftershock, jolting the American psyche into an era of spectacular contradiction. An increasingly popular departing president is leading a country that most voters believe is on the wrong track.   economic unease festers at a time, the statistics show, of relative economic stability  —   eight years after even an escalating financial crisis seemed, to some, a mere blip on the path to “Yes, we can. ” And a campaign pocked with racism and sexism, rendered in open view, may well reach this conclusion: Americans replacing their first black chief executive with their first female one. If 2008 was an emblem of progress on at least one measure, 2016 has required the grim acceptance of the limits, the disappointments, the blind spots  —   a nation taking a long look inward, and shuddering. “I didn’t think about those other million people out there,” Edith S. Childs, the South Carolina councilwoman whose mantra “Fired up, ready to go!” was adopted by Mr. Obama as a campaign rallying cry. “They were still in the ’40s and ’50s in their minds and wishing it hadn’t happened. ” She sighed a bit. “Too late,” Ms. Childs said, days before an election for which she sounded decidedly less fired up. “It happened. ” It did happen. And then came this. A New York   News poll this month found that 82 percent of voters felt more disgusted than excited about American politics because of this campaign.   percent of Donald J. Trump supporters said a Hillary Clinton presidency would make them scared or concerned.   percent of Clinton supporters said the same of a Trump administration. There is a tendency to sanitize bygone political eras in the retelling, to draw straight lines where squiggles belong. Surely some signposts of unrest were discernible many exits ago  —   the rise in income inequality, scraping away at the middle class the preponderance of partisan news media congressional functionality morphing from labored to gridlocked to hopeless. Such bitter divisions had flared long before Mr. Trump seared his surname onto the democratic process. “Hamilton,” the acclaimed Broadway musical, after all, crests with a fatal gunfight between statesmen. And for all the   tributes to John McCain and Mitt Romney, who are now held up by Democrats as exemplars of erstwhile Republican honor and sanity, many Obama supporters once seethed at the sight of them  —   and, for at least a few months of 2008, of Mrs. Clinton, too. So much was bound to get worse before it got better. People lost jobs, savings, homes. Some looked at the president and saw distance, fecklessness, insufficiency. Most were not outright bigots. Still. Norms had been threatened before 2016, but never bulldozed with such ease. Truth has often felt contested, but never so thoroughly subjective. There have been crusades against political correctness, but never a national reckoning over the propriety of boasting about sexual assault. “It’s like with family or a friend or someone you’re dating. And you say, ‘Let’s just be honest! ’” said George Saunders, the author and essayist, who chronicled Trump supporters for The New Yorker in July. “Then they are, and it’s like, ‘Oh, God. ’” This unburdening has redrawn 2008 as something of a utopia in hindsight, taunting the present with its flights of inspiration, its relative   its basic civility most of the time. Though Mr. Obama commanded about 53 percent of the popular vote, 74 percent of Americans said they felt positively about his election, according to a Los Angeles   poll in December 2008. Any present traces of that race register now as dizzying distortions, shards culled from a   mirror. Mr. McCain’s captivity in combat was invoked by Mr. Trump as an argument against his heroism. Mr. McCain’s memorably pointed defense of Mr. Obama after a voter labeled him “an Arab” has given way to a Republican nominee advocating a ban on Muslims entering the United States. Mr. McCain, in conceding, hailed the historic moment: “Senator Obama has achieved a great thing for himself and for his country. ” Mr. Trump has not committed to accepting the results of the election. In fact, many Republicans insisted then that they hoped to see Mr. Obama succeed. But there were two sides in 2008, too, and many millions of voters dismayed at the outcome. Mr. McCain’s running mate, Sarah Palin, helped coax what became the Tea Party into full bloom  —   an insurgency that helped spawn Mr. Trump’s own  —   exporting the boiling anger from her campaign events to a mass audience, even as some McCain aides expressed horror at what they had wrought. Many conservatives see a through line from Ms. Palin’s treatment by the national news media, which they viewed as unfair and condescending, to the heightened distrust of traditional news sources. This context, they say, can account for the otherwise   Americans now prone to screaming obscenities at reporters during Trump rallies. But the fury rings familiar. Those early, menacing shouts from Palin crowds  —   “Kill him!” or “Terrorist!” at a mention of Mr. Obama  —   have wafted to the main stage, absorbed and repurposed by the speakers at the microphone. Amid signs and chants demanding Mrs. Clinton’s jailing, wishing her death and denouncing her with unprintable gendered slurs, Mr. Trump has himself wondered aloud about the “Second Amendment people” who might take matters into their own hands if she is elected. And after years of questioning Mr. Obama’s birthplace  —   then falsely accusing Mrs. Clinton’s 2008 campaign of having done so first  —   Mr. Trump has seen to it that his followers would never view a Clinton presidency as legitimate. Republicans are promising investigations. Voters are predicting impeachment, on vague grounds. Some conservative lawmakers are saying they can make peace with an   Supreme Court in perpetuity, rather than allowing any Democratic president to fill the tiebreaking vacancy. The result is a sort of   resignation, even among those who admire Mrs. Clinton most, about the scope of her triumph if she wins. Mr. Obama ascended with impossible expectations, largely of his own making. His preferred successor would take office on the assumption that precious little will be permitted to change. It is a sobering turn for those overjoyed at the prospect of a female president. It is also a grim confirmation of Mrs. Clinton’s argument against Mr. Obama in the first place. It was she who, in 2008, seemed to mock the   sunniness of his message in the Democratic primary campaign, the   that sheer force of personality would be enough. “The sky will open, the light will come down, celestial choirs will be singing,” Mrs. Clinton   at one campaign stop, forecasting an Obama presidency, “and everyone will know we should do the right thing and the world will be perfect. ” She shrugged. “Maybe I’ve just lived a little long,” Mrs. Clinton said then, “but I have no illusions about how hard this is going to be. ”'"}, "time": 1742563078.1874304}