{"duration": 0.0476384162902832, "input_args": {"text": "'  Dr. Eowyn | 8 Comments \\nFriday is usually the day when controversial and incendiary news is dumped because the people doing the dumping are counting on Americans not paying due attention, preoccupied as they are with their plans for the weekend. \\nYesterday, October 28, 2016, 11 days before Election Day , came news that FBI Director James Comey sent a letter to congressional leaders and relevant committee chairmen that in the course of investigating “an unrelated case,” the FBI found new emails that “appear to be pertinent” to the FBI’s case on then-Secretary of State Hillary Clinton’s unsecured private email server. As a result, the FBI is reopening its investigation of Hillary. \\nThe FBI began their investigation of Hillary in July, 2015. A year later, Comey announced that the FBI was not recommending charges against Hillary, saying “no reasonable prosecutor” would bring such a case. But he did chastise the former secretary of state for being “extremely careless” in her handling of sensitive information. For her part, Hillary continues to insist lie that her decision to use a private email server was merely a “mistake,” that the emails contained no classified information, and that she violated no laws. \\nAddressed to the respective Chairpersons of Congressional Committees on Intelligence, Judiciary, Appropriations, Homeland Security and Governmental Affairs, Oversight and Government Reform, below is Comey’s brief letter of October 28, 2016 : \\nU.S. Department of Justice Federal Bureau of Investigation Washington, D. C. 20535 \\nOctober 28, 2016 \\nDear Messrs Chairmen: \\nIn previous congressional testimony, l referred to the fact that the Federal Bureau of Investigation (FBI) had completed its investigation of former Secretary Clinton’s personal email server. Due to recent developments, I am writing to supplement my previous testimony. \\nIn connection with an unrelated case, the FBI has learned of the existence of emails that appear to be pertinent to the investigation. I am writing to inform you that the investigative team briefed me on this yesterday, and I agreed that the FBI should take appropriate investigative steps designed to allow investigators to review these emails to determine whether they contain classified information, as well as to assess their importance to our investigation. \\nAlthough the FBI cannot yet assess whether or not this material may be significant , and I cannot predict how long it will take us to complete this additional work , I believe it is important to update your Committees about our efforts in light of my previous testimony. \\nSincerely yours, James B. Comey Director \\nThe “unrelated case” is the FBI’s investigation of illicit text messages (sextexts) sent to a 15-year-old female minor in North Carolina by Anthony Weiner, the disgraced former Congressman (D-NY) and estranged husband of Huma Abedin, a top aide to Hillary Clinton. Note: Even after losing his Congressional seat after news broke of his sextexts and sending a picture of his erection to a woman, Weiner has continued with his sextexts. The most recent scandal was his sending , to a busty 40-something divorcee in California, a picture of himself with an erection, in bed next to his infant child ( New York Post ). \\nAs part of the probe, the FBI seized devices from Weiner, including a laptop computer shared by Weiner and Abedin. The laptop’s hard drive reportedly contained thousands of Abedin’s emails to Hillary and other State Department officials. \\nExperts believe that since Comey’s letter was sent just 11 days before the 2016 presidential election, the FBI must have found something significant despite Comey’s assertion otherwise. \\nVictoria Toensing, a former deputy assistant attorney general of the U.S. and a former assistant U.S. attorney, suspects agents came directly to Comey with evidence he could not ignore. Toensing said: “Well, it couldn’t be a trifling thing, because this is a big deal. You can see the brouhaha this is causing, so it couldn’t just be a little incident over email. It has to be pretty significant.” \\nToensing and her husband, former U.S. Attorney Joe diGenova, have publicly discussed the number of career FBI and Justice Department employees who are disgusted that Hillary was not prosecuted for her “careless” handling of classified information and that Comey refused even to recommend charges. She believes Comey may have acted Friday with that internal criticism in mind: “I think he’s felt the heat. If nobody had criticized him at all he might have made this go under the rug. He knows he’s in a glass house.” \\nPredictably, the news that it was Anthony Weiner’s sexual indiscretions that led the FBI to re-open its investigation of Hillary mere days before the presidential election, resulted in a flurry of jokes, puns and innuendos, such as “Cocktober Surprise”. But the best line is from ZeroHedge reader Omega_Man: \\nBREAKING: DNC-Clinton campaign, along with Donna Brazile, have stated that the young girl Weiner was flirting with was actually Vladimir Putin in disguise. \\nHow ironic that the political ambitions of Hillary — the woman who means to be America’s first female president — may be scuttled by two dicks. Already neck-deep in the ever-increasing number of women who accuse Bill Clinton of sexual harassment, rape, and fathering a child out of wedlock, Hillary now finds herself re-enmeshed in FBI investigation as a result of Anthony Weiner’s sexual exploits. \\nIt’s self-proclaimed feminist Hillary’s karmic payback for not just turning a blind eye to her husband’s decades of abusing women, but scapegoating and blaming his victims as sluts and floozies.'"}, "time": 1742628472.5220077}