{"duration": 0.03167605400085449, "input_args": {"text": "'Google Pinterest Digg Linkedin Reddit Stumbleupon Print Delicious Pocket Tumblr \\nBy now, we all know that the Secret Service had to rush GOP presidential nominee Donald Trump off the stage at a rally in Reno, Nevada on Saturday night. It turned out to be nothing – just a protester with a sign. At the time it all looked pretty chaotic and frightening, but it turned out that Trump was just fine. The “gun” turned out to be an anti-Trump poster. The man turned out to be a Republican who just wanted the opportunity to protest what Trump had done to his party with a “Republicans against Trump” sign. There was no threat. \\nThose facts don’t matter to the Trump team, though, as campaign manager Kellyanne Conway went on CNN’s State of the Union and insisted to host Jake Tapper that it was indeed a very real attempt on Trump’s life. \\nFirst, Tapper inquired as to why Trump’s people were “retweeting misinformation that this was an assassination attempt.” Conway responded: \\n“It’s scary. All the coverage is usually about our protesters wreaking havoc and making people feel afraid. And it certainly goes both ways. I’m with Mr. Trump and the Secret Service routinely. They do an amazing job. \\nI also want to point out because some people are spreading misinformation about the protester. He had canvassed for Hillary Clinton and he had donated to her campaign. So, this is a Democratic plant or operative trying to disrupt our rally. And I think people saw a nimble resilient Donald Trump who would be nimble and resilient as president as well.” \\nTapper called Conway on her bullshit, though, and shot back: \\n“Except it wasn’t an assassination attempt. It was apparently a local voter, a Republican who says he is supporting Hillary Clinton. He has given money to Hillary Clinton. He has canvassed for Hillary Clinton. But he says he’s a Republican. But most importantly, he was not trying to assassinate anyone.” \\nThis was not an assassination attempt, but why is your campaign spreading that it was?” \\nConway waffled, saying, “That’s really remarkable. That that’s what the storyline is here.” \\nOf course, she then did what Trumpkins backed into corners always do, and tried to start changing the subject to the imagined sins of Hillary Clinton. She insisted that the only reason Beyonce, Jay Z and other A-List stars were on the trail with Hillary was that nobody wanted to go to Hillary rallies. Finally, Conway said she’d consider changing the assassination lie if CNN went on the record against “all the storylines, all the headlines, all the breathless predictions of the last two weeks that turned out not to be true.” \\nTapper said to that: \\n“I never reported anything along those lines.” \\nAnd irritable Conway insisted: \\n“CNN certainly has. You’ve got to be honest here.” \\nTapper continued, “We’ve been saying all along that Donald Trump has a path to the presidency.” \\nConway then interjected with her trademark “WOW!” \\nTapper plowed on, though, and nailed the humiliation home, and actually laughed in her face, saying: \\n“You can say ‘wow’ all you want, I’ve never said that the race was over. We can replay as many tapes as you want.” \\nTapper was right to hammer Conway like this. Trump’s entire campaign has been one big con job, built upon fear, ignorance, bigotry, incompetence, and lies. It’s about time someone called them out for what they really are. \\nWatch the exchange below: \\nFeatured image via video screen capture Share this Article!'"}, "time": 1742628445.4819107}