{"duration": 0.13363337516784668, "input_args": {"text": "'\\nThe 2016 US Presidential election has seen a coming together of hard-core Bush-era neocons and the anti-Bush liberal-left in support of the candidacy of Hillary Rodham Clinton.\\nThe unofficial coalition, which looks likely to help propel the Democratic nominee to the White House (if the polls are to believed), will have surprised many, but it’s not the first time self-identified progressives have – wittingly or unwittingly – aided the cause of the most reactionary people in western politics.\\nThe neocons: a group of ultra-hawkish hard-right imperialists, who are quite happy for the US to illegally invade other sovereign states and drop bombs all over the world. The liberal-left: who profess their support for human rights, internationalism and progressive causes.\\nAt first sight, these two groups don’t appear to have much in common. But the truth is the liberal-left have for a long time been the accomplices of the endless war lobby.\\nThink back to 1999 and the US-led bombing of Yugoslavia. Never mind that the Balkan state was a multi-party democracy that operated an economy with very high levels of public/social ownership: the liberal-left cheered as bombs rained down on Belgrade, Nis and Kragujevac . Many ‘progressives’ swallowed hook, line and sinker the lurid claims of a ‘genocide’ being committed in the province of Kosovo, which were later dismissed by a UN court.\\nAlthough it was promoted as a ‘humanitarian’ venture, the bombing of Yugoslavia was in fact a hard-right project pushed by fiercely anti-socialist/anti-communist Cold War warriors.\\nIt’s worth noting the names on the Executive Committee of the ‘Balkan Action Committee’ which lobbied hard for war against Yugoslavia in 1999. They included Richard Perle, Paul Wolfowitz and Donald Rumsfeld – three men we would all hear a lot more from in the build-up to war with Iraq.\\nThe liberal-left were also broadly on board for the invasion of Afghanistan in 2001, an assault we were told would greatly help women’s rights.\\nHowever, in 2003, there was a break between most of the liberal-left and the neocons over the invasion of Iraq. This military aggression, unlike the one against Yugoslavia, was led by a Republican president. George W. Bush, the man at the helm, was too much of a Texan ‘redneck’ for educated liberal-leftists to support.\\nProgressives who had no problem with backing an illegal war against Yugoslavia, found they did have a problem backing an illegal war against Iraq.\\nIn the end, the only ‘liberals’ who supported the Iraq invasion were neo-cons masquerading as liberals, and we all saw through their disguise.\\nIn 2011, though it was ‘business as usual’ for the neocon/liberal-left alliance as a ‘nice’ Democrat administration helped destroy Libya – the country which had the highest living standards in Africa – and whose ‘tyrannical’ government provided free health care, education, and electricity to all of its citizens.\\nAgain, this was a military assault which was pushed by neocons, the same crowd who’d lobbied for war against Yugoslavia and Iraq. Once again the liberal-left didn’t seem to notice, or indeed to care, who was behind it.\\nThe toppling of Muammar Gaddafi (the latest neocon-designated ‘New Hitler’ who was hell-bent on ‘genocide’), would lead to a more democratic Libya with major advances in human rights, liberal-leftists assured us. In fact, the NATO attack on Libya turned the country into a failed state and a haven for jihadists.\\nHillary Clinton, as Secretary of State in 2011, played a prominent role in the destruction of Libya – so much so that Wikileaks founder Julian Assange, in a recent interview with John Pilger, has labelled it ‘Hillary’s war.’\\nBut Libya has been quietly forgotten during the Presidential election campaign, as indeed has the Iraq war.\\nLiberal-leftists who couldn’t bear the sight of George W. Bush are lining up with pro-Iraq war hawks to try and get HRC elected.\\nFilm-maker Michael Moore, who made the fiercely anti-Bush documentary, Fahrenheit 9-11, finds himself on the same side as Bush’s speechwriter David Frum and Robert Kagan, co-founder of the Project for the New American Century. That would have seemed unthinkable a few years back, but it’s happening today, folks.\\nWhy are America’s liberal-left doing this? It’s not as if Trump or Clinton are the only options: Dr Jill Stein’s policies on social justice, war and peace, and climate change are far more progressive than Clinton’s. Why, instead of backing Stein, are they enabling Washington’s war lobby again, just as they did in 1999 and in 2011 during the bombing of Libya? Don’t they ever learn their lesson? How naive are liberals to be fooled by the sudden neo-con concern for ‘women’s rights’ and the rights of immigrants and gay people?\\nMake no mistake, the PNAC crowd are backing Clinton, not because they are appalled at sexist/racist or politically incorrect statements made by Donald Trump, but because they believe HRC will be the candidate who is more likely to continue the policy of endless war. More specifically, in regards to Syria, they want a US President who will prioritize on toppling the secular government of President Assad – not defeating ISIS. Trump’s great ‘crime’ in their eyes is that he does want to prioritize on ISIS – and horror of horrors – to work with Russia to defeat terrorism.\\nAs America goes to the polls today, the stakes could not be higher. Clinton’s support for the imposition of a No-Fly Zone against Russian and Syrian aircraft risks starting World War Three, and the deaths of potentially hundreds of thousands, if not millions of people.\\nIs that what the ‘progressives’ who are lining up with the destroyers of Iraq really want?\\nSource \\n'"}, "time": 1742563261.1920493}