{"duration": 0.1204063892364502, "input_args": {"text": "\". When Does Our Consciousness Transform From Being Purely Intuitive to Linear Thought? Rather than looking at consciousness as belonging to a child or an adult, let us look at the idea of... Print Email http://humansarefree.com/2016/11/when-does-our-consciousness-transform.html Rather than looking at consciousness as belonging to a child or an adult, let us look at the idea of consciousness being both an energy and at the same time a state of being. There are two states: one state is becoming, when we use the potential, the activity and the power to change what we are at present to something else. The other state is being. We become, we are.In consciousness both these possibilities exist, of becoming and of being, and these possibilities actualize themselves when in the right environment. When we are born, our consciousness is pure, without any influences or impressions of the present day environment.That pure consciousness remains with us in our young days until the age of eight. This state of consciousness is like a sponge, it is simply absorbing everything, absorbing the information received through the senses, absorbing the information received through the interactions, absorbing the information received through the intellectual and emotional inputs.In this manner the consciousness conditions itself to survive and to exist in this material plane.Until the age of eight, the information received by the consciousness is purely intuitive. Non-linear information, non-sequential information, is received — the idea of the left and right hemispheres of the brain. A child grows in our society conditioned to believe that happiness is perpetually postponed for tomorrow.When we begin our school education, a change happens in the pattern of consciousness and we begin a sequential learning process , a linear learning process. The moment the sequential and linear learning process begins, our personality changes. We become fixed in certain ideas, that A comes before B, C follows B, and in this way an understanding is developed. That understanding is a very set understanding, and this is where the personality undergoes a major transformation in life.You can give consciousness any shape you want. The family contributes to giving shape to that consciousness. The culture in which we live, the social environment, the religious environment, the educational environment, all contribute to the formation of human consciousness.Development of consciousness in all levels — intuitive, spiritual, cultural, social, personal, psychic — happens before the age of eight, before the child actually joins the first class of primary school. The day we join the first class of primary school this development stops and linear development begins.The education received by consciousness until the age of eight is a system of impressions which superimpose themselves on consciousness. They are concepts of imprints left on the mind by experience. Many traditions and philosophies have greatly emphasized the need for greater awareness during our stages of spiritual development before the age of eight, because in your future life, when you grow up, when you are thirty or forty or sixty, you become that person. You express those qualities and habits which you imbibed before the age of eight. What you are today is what you were made before the age of eight. What you were made after the age of eight is seen in the degrees and diplomas you have in your homes, in your bags and in your workplaces. That is your qualification to survive in the world, which you received after the age of eight. But the nature, the mind and the responses of the mind, the ability to manage situations in life and to deal with people, all these abilities you gained in your childhood, in that subtle education which was imbibed by the consciousness.And it is this consciousness which has to be nurtured more and more.There is a different mind beyond the rational, intellectual mind, which we call the psychic mind, or the intuitive mind, or the higher mind. When that higher mind kicks in, the mental faculties open up and manifest. It is this nature which has to be cultivated in a child.It has been the experience of people who have been working with children for many years that the receptivity of children is much greater than that of grownups. They understand things in a different way and in a better way because their mind is not cluttered with impressions, ideas and concepts. Their mind is free. While saying a little, they understand a lot. There is the limitation that they are not able to express themselves, not able to convey what they desire or feel or need or want, but their mental frequencies are much higher than the pre-defined frequencies of grownups. Grownups function in pre-defined frequencies according to their education, but children are intuitive. The main thrust of yoga education for children is to provide them with the appropriate consciousness which can be useful for them in their lives. Classification of Consciousness Normal consciousness is classified in four compartments: Waking, dreaming, sleeping and spiritually awakened. But the consciousness of children functions at a different level, at the intuitive level, until the age of eight. So for children the classification is different. It is intuitive and awake, intuitive and dreaming, intuitive and sleeping and intuitive and creative. This is the division of consciousness in a child.That is the major difference between a child's expression of the conscious faculties and a grownup's expression of the conscious faculties. In the course of time psychologists and psychoanalysts will come to this understanding that the consciousness of children has a different set, which is the flowering spiritually awakened, the highest intuitive spiritual awareness. We have lost that intuitive ability with the sequential and linear understanding of education that we have received. So we need to move from the so-called present waking state, to being spiritually awakened. We have to learn how to become like a child again. By Swami Saraswati Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related\""}, "time": 1742564382.8029408}