{"duration": 0.03454160690307617, "input_args": {"text": "'Chilling images capture destruction as two earthquakes hit Italy (PHOTOS, VIDEOS)   People walk past a destroyed building in the village of Visso, central Italy, after earthquakes on October 26, 2016. © Tiziana Fabi / AFP With two earthquakes hitting central Italy on Wednesday, social media users were quick to capture the devastation on camera. \\nThe second Italy earthquake has been rated 6.0 by the USGS. Virtually the same spot as the foreshock, which remains a 5.5. — Sean Breslin (@Sean_Breslin) October 26, 2016 \\nThe tremors were strong enough to be felt in Rome, which is over 150 km away and residents reported their homes shaking. \\n“Our village does not exist anymore,” the mayor of Ussita reportedly said. +++ \"Our village does not exist anymore after latest #earthquake \", Mayor of Ussita (Marche) to ANSA +++ #Terremoto #Italy — Antonello Guerrera (@antoguerrera) October 26, 2016 Sounds unbelievable, but luckily so far NO ONE KILLED after the latest strong #earthquake in Italy. A few slightly injured #Terremoto — Antonello Guerrera (@antoguerrera) October 26, 2016 \\nSome buildings reportedly collapsed in the area struck by the quakes. However, the damage is believed to be much less than in August, when a major earthquake hit Marche, Lazio and Umbria regions. \\nHundreds of people were killed in the August 24 quake and several towns were razed to the ground in the worst-affected areas. Second more violent #earthquake hits same region in #Italy . 5.9 magnitude in #Ussita . Mayor says city in panic @inewsmalta #Terremoto pic.twitter.com/dIlW1fc5j7 — Jake Azzopardi (@JakeaAzzopardi) October 26, 2016 \\nSeveral people were reportedly injured in Wednesday’s tremors, officials in the town of Visso said, and several older buildings – including a church – have collapsed. Some areas have lost power, and several roads remain closed. — Russian Market (@russian_market) October 26, 2016 \\nIn Castelsantangelo sul Nera, which has around 300 residents, the town’s mayor Mauro Falucci confirmed that there was no electricity.'"}, "time": 1742563145.439369}