{"duration": 0.07575583457946777, "input_args": {"text": "'BEIJING  —   When Ms. Wang, a    from Shanghai, discovered texts on her husband’s phone that suggested he was having an affair with one of his employees, she was distraught. “I couldn’t sleep at night and couldn’t stop crying,” she said. “I was very hurt. ” She decided to take action, though perhaps not in the expected way. Rather than confronting her husband, she searched online for a “mistress dispeller. ’’   services, increasingly common in China’s larger cities, specialize in ending affairs between married men and their extramarital lovers. Typically hired by a scorned wife, they coach women on how to save their marriages, while inducing the mistress to disappear. For a fee that can start in the tens of thousands of dollars, they will subtly infiltrate the mistress’s life, winning her friendship and trust in an attempt to break up the affair. The services have emerged as China’s economy has opened up in recent decades, and as extramarital affairs grew more common. With greater opportunities and incentives to be unfaithful  —   not a few businessmen and officials signal status by maintaining fetching young women  —   new businesses to combat the cheating have apparently flourished. The personal accounts from people who say they have used them are difficult to independently confirm, and there are no exact figures for the number of mistress dispellers in China. But a search on Baidu, a Chinese search engine, yields pages of ads and blogs that link back to   companies based in cities like Shanghai and Guangzhou. After her own search, Ms. Wang decided to hire Weiqing International Marriage Hospital Emotion Clinic Group, a   service in Shanghai. “I looked at some cases on their websites and didn’t know if I should trust them,’’ she said. “But I felt I had no other options, so I thought, why not try it?” Weiqing eventually ended the affair, she said, by persuading the other woman to take a   job in another city. “I don’t care how that woman is living now,’’ Ms. Wang said. “I just feel relieved that my husband is back. ’’ Ms. Wang, who was recommended by Weiqing to be interviewed for this article, declined to give her full name, saying she wanted to protect her family’s privacy. She would not say how much she paid, except that it was enough that she asked her parents for help. Weiqing said it started helping clients like Ms. Wang in 2001 in Shanghai, and has since expanded to 59 cities. Mistress dispelling typically begins with research on the targeted woman, said Shu Xin, Weiqing’s director. An investigation team  —   often including a psychotherapist and, to keep on the safe side, a lawyer  —   analyzes her family, friends, education and job before sending in an employee whom Weiqing calls a counselor. “Once we figure out what type of mistress she is  —   in it for money, love or sex  —   we draw up a plan,” Mr. Shu said. The counselor might move into the mistress’s apartment building or start working out at her gym, getting to know her, becoming her confidante and eventually turning her feelings against her partner. Sometimes, the counselor finds her a new lover, a job opening in another city or otherwise persuades her to leave the married man. Weiqing and other agencies said their counselors were prohibited from becoming intimately involved with the mistresses or from using or threatening violence. Kang Na, who runs a   service called the Reunion Company in the southern city of Shenzhen, said he recruited male counselors from his own social circle. They are chosen for their attractive looks and personality, he said. He then trains them to avoid detection and to navigate complex emotional situations. While the counselor goes to work, the   service advises the wife on how to make herself more attractive to her husband. “We want to disrupt conventional ways of thinking,” Mr. Kang said. “Chinese women think that if you treat men well, they’ll love you more. But often, we men love the people who hurt us the most. ” One response to marital infidelity is divorce. But divorce can be costly, especially for women. Aside from the social stigma that falls more heavily on women, family property and finances in China tend to be registered in the husband’s name. A divorced woman can find herself homeless, adding to the pressure of taking measures to save the marriage. But many Chinese men resist discussing marital problems with marriage counselors or other outside professionals, said Tang Yinghong, a psychologist and columnist based in Leshan, Sichuan Province. “Husbands in China still hold the traditional view that a family’s dirty laundry should not be aired publicly,’’ he said. And the wives, unwilling to undergo a difficult divorce, he said, “would rather turn to a mistress dispeller behind their husbands’ back. ’’ Ideally, the husband never finds out why his mistress left him. The services are not cheap. Mr. Kang charges a base fee of 300, 000 renminbi, about $45, 000, but he said that costs can mount if counselors need to rent expensive apartments or cars to endear themselves to the mistresses. Clients usually pay half the fee in advance and the balance once the case is successfully concluded. Mr. Kang said the balance is waived if the mistress is not dispelled, but he put his success rate at 90 percent, in part because he only takes on cases he thinks can be solved. The companies say it typically takes about three months to dispel a mistress. Yu Feng, director of the Chongqing Jialijiawai Marriage and Family Service Center, said his team has dispelled 260 mistresses in the last two years. Recently, however,   services have faced new challenges. Since he came to power in late 2012, President Xi Jinping has waged an aggressive campaign against official corruption. More than 280, 000 officials were penalized for such abuses in 2015 alone. Austerity measures that include bans on extravagant consumption have also made keeping a mistress more hazardous to officials’ careers. A study in 2013 by Renmin University found that 95 percent of corrupt officials kept mistresses. In some cases, officials have found their misdeeds reported to investigators by discontented lovers. “Since the campaign started, many officials have avoided taking on a mistress or have tried to get rid of them themselves,” said Li Qingyu, a counselor at the Baihe Emotion Clinic in Beijing, which provides matchmaking and marriage counseling as well as mistress dispelling. Mistress dispellers are also viewed unfavorably by many traditional marriage counselors. “This kind of service won’t really bring a family back together,” said Liu Weimin, director of the Guangdong Province Marriage and Family Counselors Association, a professional organization based in Shenzhen. “These problems need to be solved between the husband and wife. ” Still, the companies say they are growing. Last year, Weiqing said it had 10, 000 clients, up from 8, 000 the year before, while Mr. Kang, of the Reunion Company, said he received about 175 inquiries a day, up from 96 a day in 2015. These numbers could not be independently confirmed. Some mistress dispellers have begun to expand their operations overseas, mainly serving ethnic Chinese women living abroad. But Mr. Kang said he was preparing to start   services for   clients in Europe and North America by opening a call center based in the Philippines or Malaysia. “We began by servicing Chinese,’’ Mr. Kang said. “But we’ve discovered in the course of our work that it’s not just our own people who have these problems. Everyone does. ”'"}, "time": 1742628570.6635106}