{"duration": 0.05323982238769531, "input_args": {"text": "'Content Warning: Adult language]  This week on his “Savage Love” podcast, gay rights activist Dan Savage went after first lady Melania Trump, saying she was “as ugly on the inside as she is pretty on the outside. ” “I want to open today’s show talking about someone I hate,” Savage, who is a     activist, said. “But God knows there’s enough hate in the world, and I don’t want to add to the sum total but forgive me, I have got to get this off my chest: I f***ing hate Melania Trump. ” He continued, “I’m not alone in loathing Donald Trump’s third wife  —   she’s married to a misogynist after all. Odds are good her husband hates her, too. But there are some folks on the left who not only don’t hate her. They view her as some sort of sympathetic figure. The pretty princess in the tower locked up by the orange ogre with the bad combover, a princess desperately blinking out distress signals during   ceremonies and inaugural balls. ” He added, “I think we can credit that undeserving charitable view of our new first lady to our propensity as humans, as a species to think that the insides of pretty people match the outsides of pretty people. And that may be true sometimes but only randomly. And everyone always beware of confirmation bias. And you know what it’s definitely not true in this case. Mrs. Trump, Melania Trump, is as ugly on the inside as she is pretty on the outside. She is a birther. Pretty Melania went on TV to push the same racist conspiracy theories about Barack Obama that her husband did. She’s an immigrant who doesn’t give a s**t about the plight of other immigrants. She’s famously a plagiarist. And she’s brought ruinous lawsuits against journalists and bloggers accusing them of, among other things, potentially interfering with her ability to profit off her role as first lady. ” (  The Wrap) Follow Pam Key on Twitter @pamkeyNEN'"}, "time": 1742562310.065963}