{"duration": 0.209672212600708, "input_args": {"text": "'THIS Is Why Most Analysts’ Gold & Silver Price Forecasts Are Wrong Posted on Home » Silver » Silver News » THIS Is Why Most Analysts’ Gold & Silver Price Forecasts Are Wrong \\nWhat Has Been The Real Driver Of The Gold & Silver Price? \\n\\nFrom SRSRocco : \\nPrecious metals investors are being misled by most analysts’ price forecasts because they do not understand the critical underlying fundamental value mechanism. Furthermore, there seems to be a great deal of animosity from the short-term trading analysts who view many in the precious metals community as pandering hype and conspiracies. \\nOne of these analysts is Avi Gilburt of the Elliottwavetrader site. He criticizes the “Gold bugs” in a few of his more recent articles, Who Do You Allow Yourself To Be Manipulated , Did Your Mother Write An Article On Gold , and Damn Manipulators . \\nFeel free to check out these articles as Avi Gilburt condemns those precious metals analysts who continue to regurgitate the “manipulation” theme over and over. On the other hand, Avi truly believes the value of the metals, and other commodities are based upon looking at the “tea leaves” or studying “goat entrails” as it pertains to the Elliott Wave theory . \\nMost certainly, he will defend the Elliott Wave theory to the death. While I admire that sort of conviction, Avi Gilburt is just as guilty in his forecasting of the “value” of gold and silver just as much as the precious metals community that he constantly criticizes. \\nThat being said, there is a difference between the two camps, in my opinion. While I am frustrated with the precious metals community in their lack of understanding of the true value of gold and silver, the short-term trading analysts such as Avi Gilburt and Dan Norcini are quite vicious in their critiques. \\nThis is also true for CPM Group’s Jeff Christian. I heard from a source that when Jeff Christian was a part of a precious metals round table, when the question was posed to the group to the number of individuals who believed the metals were being manipulated, he blurted out, “Anyone in this group that follows my work, YOU BETTER NOT RAISE YOUR HAND.” Now, that isn’t the exact remark… but close enough. \\nThe subject of precious metals manipulation is quite complex, so I’d rather not get into it in this article. However, I will show where the precious metals community and the short-term trading analysts are incorrect in their approach for forecasting the value of gold and silver. What Has Been The Real Driver Of The Gold & Silver Price \\nEven though I have discussed this in prior articles, new information confirms my analysis. While most economists, traders and the those in the precious metals community believe that “Supply & Demand” have been the leading factor in determining the value of gold or silver , it’s not, rather it has always been the “ENERGY FACTOR.” \\nHere is an updated chart showing the relationship between the price of silver and oil since 1900: \\nAs you can see, the price of silver and oil remained flat (on the chart) until 1971. Actually, the price of oil and silver stayed below $2.00 (except for a few years) from 1900-1970. When President Nixon dropped the Gold-Dollar peg in 1971, this significantly changed the value of the precious metals and oil. \\nEven though the movement of the oil and silver price are not exactly related, we can definitely see a high degree of correlation. Thus, as the price of oil skyrocketed in the 1970’s, so did the price of silver. Moreover, the same thing took place in 2000-2016. \\nDoes Avi Gilburt have a chart showing this to his members? I doubt it. Of course, the short-term price movements of silver and oil are not as precise as the longer term valuations shown in the chart above, but we can clearly see that the forces of “Supply & Demand” are less of factor than the changing value of oil. \\nThis is also true for gold. This chart shows the price of gold versus oil since 1940: \\nAgain, we can clearly see that the price of gold and oil remained flat-lined until 1971. As the oil price shot up in the 1970’s, so did the gold price. When the oil price declined and stayed low in the 1980’s and 90’s, so did the value of gold. However, as the price of oil surged to $112 in 2012 from $20 in 1999, so did the value of gold. Gold jumped from $279 in 2000 to $1669 in 2012. \\nThere’s no coincidence that the value of oil and gold jumped 500+% from 2000-2012. While the silver price jumped seven times from $4.95 in 2000, to $35 in 2012, its current price is 3.5 times higher than 2000 and gold is 4.5 times higher. \\nWhich means, there are more factors in determining the gold and silver price than just the metals relationship with the oil price. That being said, supply and demand factors play a “ROLE” in impacting the price of gold and silver… BUT ONLY AS A MINOR PART compared to the overriding oil price dynamics. \\nWhat I am saying here is this… the value of gold and silver has been, and will continue to be tied to the oil price dynamics, however, supply and demand factors are contributor… BUT TO A MUCH LESSER DEGREE. Gold & Silver Bullion Are Beginning To Disconnect To The Value Of Oil \\nSomething interesting has happened recently in the price movement of gold and silver… they seem to be now disconnecting from the value of oil. If we take a look at the two gold and silver charts below, we can see that as the price of oil has remained flat in 2015-2016, the gold and silver price has turned higher, especially the gold price: \\nWhile the gold price has jumped up higher than the silver price (in relative terms), they are both moving up as the oil price remains flat. To understand why this is happening, I have to explain two KEY FUNCTIONS; Market Sentiment The Coming Oil Price Crash \\nShort-term trading analysts suggest that “Market Sentiment” plays a role in determining the price of a commodity, stock or bond. While I would agree with them to a small degree, they are correct for the wrong reason. \\nLet me explain this as it pertains to the value of gold and silver. At the beginning of the year, the stock market crashed 2,000 points quickly, so investors moved into gold and silver in a big way, especially the institutional investors who bought the Gold ETFs. So, the “Knee-Jerk” reaction by most traders and investors is that market sentiment turned around and the movement of funds into gold and silver pushed up their price. \\nAgain, I agree with that on principle, but for a very different reason. “Market Sentiment”, as it is used as a tool for determining the price of gold and silver, is only working to the extent that it is “WAKING UP INVESTORS TO THE TRUE FUNDAMENTAL VALUE”, but just for a brief period of time. \\nYou have to think of precious metals market sentiment similar to when a spouse believes their partner might be having an affair. When something very suspicions happens, the spouse gets very angry and the partner tries to calm them down by giving a reason (excuse) why is not true. So, in a few days, the spouse believes the partner and everything calms down. \\nThis type of “UP & DOWN” sentiment continues in the relationship causing a great deal of volatility in the marriage. However, one day, the spouse finally catches the partner in the act and the TRUTH finally comes out. Then there is no more lies, deceit, excuses or manipulation of the facts to keep the spouse believing that everything is fine. The spouse has now taken the RED PILL, so to speak, and cannot unlearn what they now know. \\nThis is a perfect example of what is taking place as it pertains to “MARKET SENTIMENT” in the precious metals market. When investors start to get fearful or extremely worried about the Stock & Bond markets, they rush into the precious metals… for a brief period of time. \\nWhen the Fed and Central Banks pump Trillions of Dollars of liquidity into the financial system, they bring calm back into the markets easing investors fear and worry. Thus, gold and silver demand declines. \\nUnfortunately, this is a game that is hiding the truth. So, when investors finally realize the Stock and Bond Market are the biggest Ponzi Schemes in history, the MAD RUSH into the metals will begin. \\nNow, the reason the Stock and Bond Market are nothing more than HOT AIR and the typical Ponzi Scheme, can be seen in this chart by Louis Arnoux: \\nThe value of U.S. GDP per head, in Oil & Gold all went up together until 1970. While U.S. GDP has continued higher and higher, we can clearly see that the gold and oil (red & blue color) trend lines behaved much different;y. I would advise watching my Thermodynamic Collapse Interview with Dr. Louis Arnoux to explain the details: \\nHowever, the only way for real wealth to be generated, it has to coincide with the value of gold and oil. Unfortunately, the value of gold and oil in GDP per head for each American crashed (2012), while stated GDP continued to record territory. \\nThus, the real GDP value reported by the U.S. Government is highly inflated. This is based on understanding the “Thermodynamic Oil Collapse” and its impact on the entire global economy. According to Louis Arnoux and the Hills Group work, the price of oil will continue to crash to a MAXIMUM PRICE of $12 by 2020. \\nThis is due to their calculation of the “Remaining Value” of oil in a barrel. You have to think about it like an automobile. When the car is brand new, the value is say, $30,000. However, after 15 years, the car is only worth $5,000. The economic value of that car has been “DEPLETED. ” While it still works, the 15 year-old car does not contain the same “embedded” energy as a brand new car…. so the value is much less. \\nThe Hills Group ETP oil model has calculated that the value of a barrel of oil is behaving similar to a used car. The costs of producing a barrel of oil is so high now, when we consider the entire Oil Industry & Support Systems”, there won’t be much value left to the Globalized Industrial World in five years. \\nI will be writing more on this going forward as gold and silver investors will benefit the most as the Thermodynamic Oil Collapse goes over the cliff. Why Will The Value Of Gold & Silver Surge When Most Everything Else Implodes \\nWhile the oil price has been the leading driver in the value of Gold & Silver for more than a century, it is beginning to disconnect. Why? Because the gold and silver price have been valued as “commodities”, rather than as “high-quality stores of value.” \\nI will be writing an article showing this more in detail, however total Global Assets are estimated to be $373 trillion, according to a report by Savills World Research. The majority of those assets are real estate…. mostly residential real estate. \\nAs the price of oil continues lower and lower, it will destroy the value of most Stocks, Bonds and Real Estate. These assets only derive their value from burning more energy each year. However, the cost to produce a barrel of oil has become so high now, there isn’t much value left over to support the $373 trillion in global assets. \\nWhich means, the collapse in the price of oil, will be the FACTOR that finally wakes up the world that they have been investing in the wrong assets. It will be the MOTHER OF ALL MARKET SENTIMENT moves. \\nI gather Avi Gilburt will discard this article as just another complete waste of time, but he is undoubtedly blind to the oil-energy dynamics. So, I would bet my bottom Silver Dollar that Avi will continue to read the tea leaves and goat entrails of the Elliott Wave Theory right up until the point the system disintegrates. And maybe he should, because when the PHAT LADY SINGS, he will have to find some other occupation. Buy 90% Junk Silver Coins at SD Bullion As Low As $2.19/oz Over Spot!'"}, "time": 1742561752.4279726}