{"duration": 0.03940272331237793, "input_args": {"text": "'Yemen UAE Minister of State for Foreign Affairs Anwar Gargash (Photo by Reuters) \\nThe United Arab Emirates, a key Saudi ally in its deadly aggression against Yemen, has welcomed a new United Nations peace proposal to end the Yemen conflict. \\n\"The UAE supports the efforts of UN [Special] Envoy [for Yemen] Ismail Ould Cheikh Ahmed knowing that the mission of a mediator is always tough,\" Minister of State for Foreign Affairs Anwar Gargash said on his Twitter account on Thursday. \\nThe remarks came two days after the UN envoy submitted the plan to Yemen’s Houthi Ansarullah movement and its allies. \\nAccording to informed sources, the roadmap urges agreement on naming a new vice president after the withdrawal of Houthis from the capital Sana’a and other cities and their handover of arms to a third party. \\nThe initiative further calls on former Yemeni president, Abd Rabbuh Mansur Hadi, to transfer power to the vice president who would appoint a new premier to form a government. United Nations Special Envoy for Yemen, Ismail Ould Cheikh Ahmed, speaks to reporters at Sana’a airport following his visit to the Yemeni capital on October 25, 2016. (Photo by Reuters) \\n“The roadmap represents a political solution for the Yemeni crisis,” Gargash said, adding, “UN efforts represent a chance to bring Yemenis back to the political track. Other alternatives are gloomy.” \\nThe Hadi administration, however, said that it had not received any roadmap for a political settlement. \\nPeace talks, which were held between Yemen’s opposing parties in Kuwait, ended in deadlock in August. \\nEarlier this week, Ahmed made a visit to Sana’a, where he held meetings with Yemen’s warring sides and called for a return to a cessation of hostilities to allow aid deliveries. \\nThe Riyadh regime resumed its deadly airstrikes on Yemen on Sunday hours after a three-day truce in the conflict-ridden country expired. \\nYemen has seen almost daily military attacks by Saudi Arabia since late March 2015, with the UN putting the toll from the aggression at more than 10,000. \\nThe offensive was launched to crush the Houthi Ansarullah movement and its allies and reinstate the former Yemeni government. \\nThe Houthi Ansarullah fighters took state matters in their own hands after the resignation and escape of Hadi, which threw Yemen into a state of uncertainty and threatened a total security breakdown in the country, where an al-Qaeda affiliate is present. Loading ...'"}, "time": 1742562387.3169754}