{"duration": 0.0854940414428711, "input_args": {"text": "'Texas leaders and farm owners secured a victory in the battle against the Bureau of Land Management’s (BLM) attempted land grab along the banks of the Red River. The federal agency announced it is suspending the surveys ordered during the Obama Administration to justify the attempted takeover of 90, 000 acres of land. [The BLM admitted this week admitted in a letter issued on March 29 (attached below) that it used an “incorrect methodology” in its justification for the attempted taking of land that had been in the possession of many Texas landowners for generations. “Having reviewed this deposition testimony and other new information, the BLM believes the survey methodology was used in error and may have caused errors in identifying the location of the Gradient Boundary,” Acting Cadastral Survey Chief Stephen Beyerlein wrote in the letter.  “The BLM’s admission that it used incorrect methodology in these surveys and the decision to suspend the surveys is welcome news,” U. S. Representative Mac Thornberry ( ) said in a statement obtained by Breitbart Texas. “The portions of the river that the agency has surveyed strayed widely from the accepted gradient boundary survey method established by the Supreme Court in Oklahoma v. Texas. It is encouraging that the BLM has admitted their error and that all administrative action will be suspended until the matter is resolved. I will continue working with the landowners, local and state officials, and Senator Cornyn ( ) until this issue is resolved once and for all. ” Thornberry is the author of the “Red River Gradient Boundary Survey Act” which passed earlier this year. Texas farmers applauded the action by the BLM. “We’re pleased the Bureau of Land Management has done the right thing by admitting that the land surveys do not take the movement of the Red River into consideration,” Texas Farm Bureau (TFB) President Russell Boening said in a written statement. “TFB has been involved in this situation for years. We take it very seriously when government decides that private property no longer belongs to those who have purchased, paid taxes and hold titles to it. ” “When this was brought to our attention by TFB member Tommy Henderson, we knew we had to act,” Boening said. “We sent a video crew to Tommy’s place to document his fight for family land along the river. That video went viral and brought   light to the situation. ” Following a tip from   Agriculture Commissioner Sid Miller, Breitbart Texas initially brought national attention to the issue that the BLM’s actions threatened landowners like Tommy Henderson whose family owned some of this land for generations. “Several local news outlets had written about the issue,” BLM Spokesman Paul McGuire told Breitbart Texas at the time. “But when Breitbart wrote about it, I called Washington and said, ‘This thing is going to blow up now. ’” And blow up it did. The following day, many national outlets picked up the story and ran with it.   Attorney General Greg Abbott said, in an exclusive interview with Breitbart Texas the next day, ““I am about ready to go to the Red River and raise a ‘Come and Take It’ flag to tell the feds to stay out of Texas. ” He fired off a letter to   Director Neil Kornze demanding answers on the issue. The BLM responded they weren’t taking the land because “It is already ours. ” Texas’ leadership including   General Greg Abbott,  . Governor David Dewhurst,   Land Office Commissioner Jerry Patterson, and State Senator Craig Estes (  Falls) joined with Texas’ U. S. Senators, John Cornyn and Ted Cruz, and U. S. Rep. Mac Thornberry to try to get the BLM to release the land back to the Texans who had believed they owned the land, in some cases for many generations. Then Governor Rick Perry weighed in on the issue in May when he said the “the federal government already owns too much land. ” Following the BLM’s announcement,   Abbott said, “The BLM’s prior actions have been hostile to landowners and their property rights, and I’m pleased an end has come to this unconscionable land grab. (This) decision by the Trump administration is a victory for Texas landowners along the Red River and for our constitutional rights. ” Texas Attorney General Ken Paxton filed a lawsuit in federal court in November 2015 challenging the federal encroachment on Texas land. “The borders of any state are a fundamental expression of its sovereignty, and are established through extensive surveys and legal precedent,” Paxton said at the time in a statement obtained by Breitbart Texas. “We will not allow the federal government to arbitrarily infringe upon Texas land and undermine the private property rights of our citizens. The federal government must follow the law and recognize our correct borders, consistent with decisions of the U. S. Supreme Court defining the boundary formed by the Red River. ” The following month, Texas General Land Office Commiccioner George P. Bush also joined in the lawsuit defending the Texas landowners. Paxton praised the decision made this week by the BLM to back down on the land grab issue. “This latest action by the Trump administration protects the property rights of Texans as defined by the U. S. Supreme Court and prevents the federal government from infringing upon Texas’ sovereign borders,” the Texas AG said in a written statement. “It was our contention all along that the BLM’s surveys were conducted improperly and unlawfully. We will vigilantly defend Texas’ border from federal overreach. ” The BLM has suspended all administrative actions regarding these 90, 000 acres of sovereign Texas land, the TFB stated. In August 2015, Tommy Henderson won his personal battle with the BLM over the acreage his family lost in a federal lawsuit. He regained full ownership and control over the land after being forced to pay a “statutorily required payment of $1. 25 per acre,” for the land his family had owned since 1904. In response to this week’s action by the BLM, Henderson told the TFB, “The fight’s not over yet, but we’ve made a pretty good step. We have to get this fixed, so BLM never comes back again and tries this. ” Bob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX and Facebook.  '"}, "time": 1742563740.9853811}