{"duration": 0.05682206153869629, "input_args": {"text": "'A photo published on the Politico website shows House Minority Leader Nancy Pelosi ( ) meeting with Russian Ambassador Sergey Kislyak in 2010  —   a direct contradiction to her telling reporters at the website she had not met with the diplomat. [After tweeting on Friday morning that Senate Minority Leader Chuck Schumer ( . Y.) should be investigated for meeting with Russian President Vladimir Putin in 2003, President Donald Trump tweeted that a second investigation into Pelosi’s past should be launched.  I hereby demand a second investigation, after Schumer, of Pelosi for her close ties to Russia, and lying about it. https:  .   —   Donald J. Trump (@realDonaldTrump) March 3, 2017,  “I hereby demand a second investigation, after Schumer, of Pelosi for her close ties to Russia, and lying about it,” Trump tweeted on Friday. “Not with this Russian ambassador, no,” Pelosi told Politico’s Jake Sherman and Anna Palmer during a Playbook interview, when asked if she’d ever met with the Russian envoy. “But a file photo from Pelosi’s 2010 meeting with Russian President Dmitry Medvedev shows Kislyak at the table across from Pelosi  —   then House Speaker  —   and Rep. Steny Hoyer ( . ),” Politico reported. “Medvedev had been in the country for a meeting with President Barack Obama a day earlier and stopped in on Capitol Hill to meet with congressional leaders as well. ” “Asked to square Pelosi’s comments with the photo of the meeting, a spokesman said that Pelosi had simply meant she never had a solo meeting with Kislyak,” Politico reported. “Of course, that’s what she meant,” Pelosi’s spokesman Drew Hammill said. “She has never had a private    with him. ” Politico reported: Pelosi’s explanation is similar to one offered by Sen. Claire McCaskill Thursday, after she swiped at Attorney General Jeff Sessions for privately meeting with Kislyak in 2016 and failing to disclose it when asked about communications with Russians during his confirmation proceedings in January. Sessions has emphasized that meetings with ambassadors are common for lawmakers and that he met with Kislyak in his capacity as a member of the Senate Armed Services Committee. McCaskill tweeted that in her 10 years serving on the Armed Services Committee she had never “ever” met with Kislyak, but walked back her comment by using the same reasoning as Pelosi, saying she had never met with him   .'"}, "time": 1742562404.9125206}