{"duration": 0.11144447326660156, "input_args": {"text": "'We’re now three years and seven shows into the     phenomenon. It’s time to begin drawing conclusions from this continuing experiment. You’ll recall that NBC began the parade in December 2013 with “The Sound of Music Live! ,” which starred Carrie Underwood as Maria. A year later came “Peter Pan Live! ,” also on NBC, and last December the network served up “The Wiz Live!” Fox got into the act this year with “Grease: Live! ,” “The Passion” and “The Rocky Horror Picture Show,” and on Wednesday night NBC resumed its December tradition with “Hairspray Live!” [ Review: “Hairspray Live!” Had Power Voices but Still Lacked Power ] Let’s cut to the chase: “The Wiz” was the best by far. But in terms of ratings, which is what this is really all about, “The Sound of Music” is the king (more than 18 million viewers) fueled no doubt by a curiosity factor, since it was first. “Grease” is second at about 12 million, then and “The Wiz” at 11. 5 million. Preliminary numbers for “Hairspray” put it somewhat behind those. But in general the bloom seems to be off the rose, and these musicals are settling into a     ratings zone. So maybe the phenomenon continues indefinitely, maybe not. But at this point, we have a pretty good idea of how to make them work. Among the poorest ratings performers and least watchable productions was Fox’s “Rocky Horror” in October, which was not performed live. That made it little more than a remake of the 1975 film version, a wonderful cult favorite built around a   performance by Tim Curry. Laverne Cox had the unenviable job of stepping into his shoes as    and never looked as if she was doing more than imitating her onscreen predecessor, something that was true of the rest of the cast as well. And for the viewer the enterprise lacked that little bit of spark that comes from knowing you’re watching a live performance. Granted, these are heavily regimented productions with little risk of a catastrophic misstep, but still  —   it’s fun to dream. Ms. Underwood, the country singer and “American Idol” winner, was the unfortunate sacrificial lamb who proved this point in “The Sound of Music. ” She has a nice voice, but it’s not a stage voice, the kind a classic musical requires. (Also, she’s not an actress.) Anyone thrown into one of these productions as   to attract viewers  —   and the ratings suggested that Ms. Underwood, with her substantial fan base, did attract viewers  —   is in danger of seeming inadequate next to whatever veteran stage actors are in the show. Ms. Underwood’s weaknesses were only underscored by the presence of Laura Benanti and Audra McDonald. Similarly, Allison Williams, as Peter Pan, was even more of a dud when compared with   like Kelli O’Hara and Christian Borle.   can work, but only when the production plays to the strengths of those performers. “The Wiz” did  —   its     score was just right for   Mary J. Blige and other recording artists in that cast. And Jennifer Hudson, who has starred on Broadway but is better known for her screen and singing careers, was a “Hairspray Live!” highlight, belting out powerful numbers like “I Know Where I’ve Been” and “Big, Blonde and Beautiful. ” Several of these productions, especially “Grease” and “Hairspray,” have gone to downright desperate lengths to try to make an impact on social media and with young demographics (or at least, young demographics that condescending TV executives apparently define as “too stupid to appreciate art for art’s sake”). “Hairspray” kept pausing to introduce us to its   squad and to check in on   viewing parties in various cities. It’s as if the producers don’t trust the musical itself to be interesting. The thing is, all of these works, even the pop ones like “Grease” and “Hairspray,” have story lines. Some of those stories, like the one in “Hairspray,” are pretty powerful if they’re left alone. But if they’re interrupted so we can hear from supposed fans dressed in period clothes at a viewing party in Philadelphia, they have no chance. “Grease” had a live audience viewing parts of the show. So did “Hairspray. ” But both of these productions sent their casts galloping about from set to set, so the audience wasn’t always there. And when it was present, it sometimes was more cheerleader than audience, whooping it up in a way that called attention to itself. Who wants to tune in a TV show to watch people watching other people perform? Either figure out a higher purpose for a live audience or jettison it, please. “Grease” went by in a blur of blandness. So did “Rocky Horror. ” But people will be talking about Ms. Hudson’s chilling “I Know Where I’ve Been” for a long time. And “memorable” doesn’t necessarily mean “wonderful. ” It can also mean “debatable. ” What other performance are people still talking about? Christopher Walken’s odd Captain Hook in the   “Peter Pan. ” Was he lost, dazed, confused? Or slyly brilliant? Hard to say, but kudos for the casting decision. Harvey Fierstein, in contrast, was a safe choice for Edna Turnblad in “Hairspray,” since he played the part on Broadway. Sure, it’s fun to hear his growly voice, but the selection felt like an opportunity missed.'"}, "time": 1742564089.4880612}