{"duration": 0.04254317283630371, "input_args": {"text": "'During a recent ABC News interview, President Donald Trump described Chicago as a “war zone” and warned that Mayor Rahm Emanuel (D) and city officials must stop the “carnage” or get out of the way so the feds can do it. [Democrats like Representative Luis Gutierrez (  ) mocked Trump’s assessment, but a video published by the Independent Police Review Authority shows that the moniker “war zone” is àpropos.  The video is a compilation of dash and body cam videos that were made while officers pursued and ultimately “shot and killed    Richard Grimes, who was suspected of shooting a pregnant    woman in the abdomen in the 4600 block of West Adams. ” The caption from the video sets the scene: The incident started about 11:30 p. m. on Nov. 27, [2016] as officers responded to a call of the domestic battery. After the initial shooting, Grimes left the scene but ran into officers in the first block of North Kenton, where he fired a handgun at the officers before running away, police said at the time. The officers chased Grimes and a perimeter of the area was established. Dashboard camera video appears to show Grimes shooting at one officer as he exited his police car. The officer immediately dropped to the ground as others arrived and looked to be checking to see if he was shot. Grimes was spotted again in a gangway in the 4500 block of West Washington, where he again shot at the officers, authorities said. The officers returned fire, striking him. Dozens of gunshots can be heard in the videos, with police dispatchers warning officers to “Watch the crossfire. ” A short time later, an officer yells “He’s down! He’s down! He’s down!” WARNING —    SITUATIONS,  President Trump’s ABC News interview aired on January 25, and the Wall Street Journal quoted Trump comparing Chicago to a “war zone. ” In fact, the president suggested Chicago is worse that some of the areas where our troops are currently deployed, saying, “Afghanistan is not like what’s happening in Chicago. ” AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742562072.7188838}