{"duration": 0.08566522598266602, "input_args": {"text": "'(27 fans) - Advertisement - \" We like nonfiction, and we live in fictitious times. We live in the time where we have fictitious election results that elects a fictitious President. We live in a time where we have a man sending us to war for fictitious reasons. Whether it\\'s the fiction of duct tape or the fictitious orange alerts, we are against this war, Mr. Bush.\"--Michael Moore Oscar acceptance speech, moments before his mic was cut off. This year may mark a turning point, where the moral bankruptcy was laid bare for all. I\\'m speaking of the Bernie Sanders flip-flop for Hillary Clinton, the predictable bait-and-switch, which Democrats never seem to imagine in real time. The rest of us have seen it so often that the ruse has become routine Standard Operating Procedure. A particularly notable case is Sarah Silverman, the filthy-mouthed comedienne, who originally championed Bernie. But she quickly fell into lockstep for Hillary. Silverman had a soul empty enough to go and scold the United States to support a candidate whom she had just been fighting against , and who actually stole the nomination from her own candidate through back-room deals at the DNC and through apparent voting-machine hacking . The thief was rewarded instead of jailed for some reason, which Hollywood has had absolutely zero interest in, as if it didn\\'t happen. They moved on instantly to lambast us all about Donald Trump 24/7. Orwell couldn\\'t have written it better. Hollywood has a highly complex understanding of political philosophy and particularly of this presidential race: 1. Trump Bad 2. Hillary Woman 3. So-called \"Lesser Evil\" We should acknowledge, those who are literate, that Hillary Clinton\\'s repeated threats to escalate World War 3 over Syria leave her as potentially the greater evil, not the lesser at all. The jury is very much out. \" Goldwater Girl\" Hillary Rodham Clinton has a lengthy record of supporting every US aggressive war and opposing none. She may have played a part in the killings of over 2 million human beings so far, merely tallying those casualties from the three countries of Iraq, Syria and Libya. One may opt to also add another half-million Iraqi children who died as a result of her husband\\'s eight years of sanctions. - Advertisement - I noticed Hollywood\\'s widespread mindless support for Democrats back in 2000, when I kicked that shockingly corrupt party to the curb and joyfully cast a vote for Ralph Nader, an actual American hero whose efforts have saved lives. Die-hard whiners of the Democratic rank-and-file still falsely claim that big bad Ralph gave the election to Dubya Bush, when anyone with the ability to read can see that it was the Supreme Court which stopped the legitimate counting of Florida ballots. Add Bush\\'s brother Jeb purging nearly two-hundred thousand minority voters from rolls. But the mindless strategy of attacking third parties and attempting to delegitimize democracy itself persists among the ignorant (a majority of Democrats perhaps). This is by design; this is who they are. They do not believe in democracy, because the billionaires who fund them do not believe in any democracy they cannot control. George W. Bush\\'s theft of the presidency did help expose the moral bankruptcy of Democrats as well as Republicans. When Bush lied about Iraq, Hillary Clinton was right there with him embellishing and freestyling! She claimed Iraq\\'s non-existent \"weapons of mass destruction\" to be \"undisputed.\" Her lies helped sell the war to Congress, a war of aggression: what the Nazis did and were hung for at Nuremberg. Her role in aggressive war and in destroying International Law as a restraint against belligerence are profound crimes, grievous war crimes: \"the supreme international crime\" in the words of U.S. Judge Robert Jackson. When a handful of Democrats attempted to impeach the Bush junta for crimes relating to those wars, as well as to torture and cover-up, it was Democrat Nancy Pelosi who announced \"Impeachment is off the table.\" Criminal collusion, allowing the crimes to stand without recourse, that is what they did. The US federal government has served as a protection racket for international war crimes. The damage that Democrats inflicted upon the rule of law is equal to that of the Republicans. The former had a moral and legal responsibility to defend the Constitution, their oaths of office, but voluntarily opted not to. The Internet helped flood the world with information to pass around, both good and bad, but the crimes of both parties became difficult for them to wash away now that Google made all web searchers equal. Today, things have accelerated into realms of the absurd. CNN recently cut off a congressman in mid-sentence for uttering the word \"Wikileaks.\" This Soviet-style clampdown on dissent remains a shocker even in a society that\\'s pretty much seen it all. - Advertisement - The media, distrusted by most , is only one aspect of the problem though. Americans get their views from joking heads as much as from stodgy teleprompter readers. Talk shows and comedy skits propagandize viewers every bit as much as do the Washington Post or New York Times . Celebrity endorsements matter. A casual glance at those programs would reveal that democracy is non-existent in Hollywood today. All voices are not represented. Minority candidates cannot get air time, will not be interviewed, and will only be mocked in absentia as per John Oliver\\'s recent disgraceful hit piece on Green Party candidate Jill Stein , a cowardly move John. Shameful. But Oliver is far from alone. I single him out because he knows better and could have done justice to the Green Party and to its clear alternative to perpetual war, empire, and industrialized ecocide. But where would that have left him personally vis a vis the Hollywood political consensus?'"}, "time": 1742563674.528813}