{"duration": 0.13643312454223633, "input_args": {"text": "'Trump the Great\\nPaul Craig Roberts\\nLiberals, progressives, and the left-wing (to the extent that one still exists) are aligning with the corrupt oligarchy against president-elect Trump and the American people. \\nThey are busy at work trying to generate hysteria over Trump’s “authoritarian personality and followers.” In other words, the message is: here come the fascists.\\nLiberals and progressives wailed and whined about “an all white male cabinet,” only to be made fools by Trump’s appointment of a black male and two women, one a minority and one a Trump critic.\\nThe oligarchs are organizing their liberal progressive front groups to disrupt Trump’s inauguration in an effort to continue the attempt to delegitimize Trump the way the paid Maidan protesters were used in Kiev to delegitimize the elected Ukrainian government.\\nTo the extent any of the Trump protesters are sincere and not merely paid tools of oligarchs, such as George Soros, military and financial interests, and global capitalists, they should consider that false claims and unjustified criticism can cause Trump and his supporters to close their ears to all criticism and make it easier for neoconservatives to influence Trump by offering support.\\nAt this point we don’t know what a Trump government is going to do. If he sells out the people, he won’t be reelected. If he is defeated by the oligarchy, the people will become more radical. \\nWe do not know how Washington insiders appointed to the government will behave inside a Trump presidency. Unless they are ideologues like the neoconservatives or agents of powerful interests, insiders survive by going along with the current. If the current changes under Trump, so will the insiders. \\nTrump got elected because flyover America has had all it can take from the self-dealing oligarchy. The vast bullk of America has seen its economic prospects and that of children and grandchildren decline for a quarter century. The states Hillary carried are limited to the liberal enclaves and oligarchy’s stomping grounds on the NE and West coasts and in Colorado and New Mexico, where effete wealthy liberals have located because of the scenary. If you look at the red/blue electoral map, geographically speaking Hillary’s support is very limited.\\nWe know that Hillary is an agent for the One Percent. The Clintons $120 million personal wealth and $1.6 billion personal foundation are proof that the Clintons are bought-and-paid-for. We know that Hillary is responsible for the destruction of Libya and of much of Syria and for the overthrow of the democratically elected government in Ukraine. We know that the Clinton regime’s sanctions on Iraq resulted in the deaths of 500,000 children. These are war crimes and crimes against humanity. We know Hillary used government office for private gain. We know she violated national security laws without being held accountable. What we don’t know is why groups that allegedly are liberal-progressive-leftwing are such fervent supporters of Hillary.\\nOne possible answer is that these groups are mere fronts for vested interests and are devoid of any sincere motives.\\nAnother possible answer is that these groups believe that the important issues are not jobs for Americans and avoiding war with nuclear powers, but transgender, homosexual and illegal alien rights.\\nAnother possible answer is that these groups are uninformed and stupid.\\nWhat these protesters see as a threat in Trump’s strong and willful personality is actually a virtue. A cipher like Obama has no more ability to stand up to the oligarchy than a disengaged George W. Bush so easily stage-managed by Dick Cheney. Nothing less than an authoritarian style and personality is a match for the well-entrenched ruling oligarchy and willful neoconservatives. If Trump were a shrinking violet, the electorate would have ignored him.\\nTrump did not purchase his presidency with the offer of handouts to blacks, the poor generally, teachers unions, farmers, abortion rights for women, etc. Trump was elected because he said: “Those who control the levers of power in Washington and the global special interests they partner with, don’t have your good in mind. It’s a global power structure that is responsible for the economic decisions that have robbed our working class, stripped our country of its wealth and put that money into the pockets of a handful of large corporations and political entities. The only thing that can stop this corrupt machine is you.”\\nIt has been a long time since the electorate heard this kind of talk from someone seeking public office. Trump’s words are what Americans were waiting to hear.\\nAs willful as Trump is, he is only one person. The oligarchy are many.\\nAs impressive as Trump’s billion dollars is, the oligarchs have trillions.\\nCongress being in Republican hands will spare Trump partisan obstruction, but Congress remains in the hands of interest groups. \\nAs powerful as the office of the president can be, without unity in government changes from the top don’t occur, especially if the president is at odds with the military with regard to the alleged threat posed by Russia and China. Trump says he wants peace with the nuclear powers. The military/security complex needs an enemy for its budget.\\nIt is absolutely necessary that a lid be put on tensions between nuclear powers and that economic opportunity reappears for the American people. Trump is not positioned to benefit from war and jobs offshoring. The only sensible strategy is to support him on these issues and to hold his feet to the fire.\\nAs for the immigration issue, the Obama Justice (sic) Department has just worsened the picture with its ruling that American police departments cannot discriminate against non-citizens by only hiring citizens as officers. Now that US citizens face arrest in their own country by non-citizens, the resentment of immigrants will increase. Clearly it is nonsensical to devalue American citizenship in this way. Clearly it is sensible to put a lid on immigration until the US economy is again able to create jobs capable of sustaining an independent existence. \\nIf Trump can defeat the oligarchy and save America, he can go down in history as Trump the Great. I think that this prospect appeals to Trump more than more wealth. Instead of trying to tear him down in advance, he should be supported. With Trump’s determination and the people’s support, change from the top down is possible. Otherwise, change has to come from the bottom up, and that means an awful lot of blood in the streets. \\nThe post Trump the Great — Paul Craig Roberts appeared first on PaulCraigRoberts.org .'"}, "time": 1742561698.4171853}