{"duration": 0.08908677101135254, "input_args": {"text": "'Waking Times \\nDerek Nance is a Kentucky man who has chosen to eat only raw meat in his effort to get rid of a mystery illness. He found himself with little appetite for regular food and vomiting after he ate, which resulted in significant weight loss. After eliminating food after food after food, he discovered that a carnivorous version of the Paleo diet cured his digestive problems and left him feeling pretty fantastic. \\nSome of you may find these images disgusting, but for Nance, this is what meal time look like. \\nNance doesn’t just grab a steak every time he’s hungry. A lot of thought and planning goes into his diet. He mostly eats grass-fed lamb, which he buys locally and slaughters himself. He avoids animals that are pumped full of hormones , such as pig. The animals he chooses are free-range and raised on several varieties of grass, which impacts the taste and quality of the meat. \\nWhen Nance slaughters an animal, it seems that no part goes unused. In addition to the meat, the organs give him Vitamin C. He eats lots of animal fat and also uses it to brush his teeth. Brains are considered a delicacy, followed by a nice glass of blood to wash it all down. \\nProbiotic -rich rotten meat is also on Nance’s menu. In an interview with Vice.com , Nance explains why he eats rotten meat: \\n“Half of the problem with my digestion was actually just lack of enzymes. My body just doesn’t produce enough enzymes to digest starchy foods. So the probiotic bacteria in rotten meat actually help me to digest the food.” The Fight Against the Modern Diet \\nSome may think it very unusual and actually unhealthy for a man to live only on raw meat. Yet, we cannot deny that our contemporary way of eating has resulted in an increase in modern diseases such as obesity, heart disease, diabetes, and cancer. \\nHumans in general suffer from more chronic illnesses than ever before. Is an all-meat diet, or even a Paleo diet , the solution? Many health professionals and nutritionists would strongly disagree, but they will agree that our food choices play a major role in how healthy a person is. Diets, such as the Paleo diet with mostly meats and seasonal vegetables, fruit, nuts and roots, cut out processed foods that are often full of sodium, preservatives, and genetically-modified ingredients. \\n“The nutritional qualities of modern processed foods and foods introduced during the Neolithic period are discordant with our ancient and conservative genome. This genetic discordance ultimately manifests itself as various chronic illnesses, which have been dubbed ‘diseases of civilization.’ ~ Dr. Loren Cordain, author of The Paleo Diet \\nDerek Nance is an example of what can happen when a person is willing to make the effort to address illness by changing up the diet. For Nance who’s been following his unusual diet for over seven years, after the first few weeks of raw meat, “I felt absolutely great, and I never went back.” \\n“Listen to your body. Do what feels right for yourself. Be your own guinea pig. As soon as something doesn’t feel right or doesn’t make sense to you, maybe you can tweak it a little bit.” ~ Pete Evans, TV personality, award-winning chef and author of Healthy Every Day and The Complete Gut Health Cookbook Read more articles by Anna Hunt . About the Author \\nAnna Hunt is co-owner of OffgridOutpost.com , an online store offering GMO-free healthy storable food and emergency kits . She is also the staff writer for WakingTimes.com . Anna is a certified Hatha yoga instructor and founder of Atenas Yoga Center. She enjoys raising her children and being a voice for optimal human health and wellness. Visit her essential oils store here . Visit Offgrid Outpost on Facebook . \\nSources:'"}, "time": 1742563142.1870627}