{"duration": 0.0728769302368164, "input_args": {"text": "\"Trump’s grandfather was a pimp and tax evader; his father a member of the KKK ‹ › South Front Analysis & Intelligence is a public analytical project maintained by an independent team of experts from the four corners of the Earth focusing on international relations issues and crises. They focus on analysis and intelligence of the ongoing crises and the biggest stories from around the world: Ukraine, the war in Middle East, Central Asia issues, protest movements in the Balkans, migration crises, and others. In addition, they provide military operations analysis, the military posture of major world powers, and other important data influencing the growth of tensions between countries and nations. We try to dig out the truth on issues which are barely covered by governments and mainstream media. Syrian War Report – October 28, 2016: Militants Make Do-Or-Die Attempt to Break Aleppo Siege By South Front on October 28, 2016 …from SouthFront \\nOn October 28, the joint militant forces launched a full-scale offensive in order to break the siege of militant-controlled neighborhoods of Aleppo city that had been set by the Syrian government forces. The operation was led by Jabhat Fatah al-Sham (formerly Jabhat al-Nusra, the Syrian Al-Qaeda branch). Jaish al-Mujahideen, Fastaqim Kama Umirt, Faylaq al-Sham, Ajnad al-Sham, Ahrar al-Sham and the Islamic Front joint the offensive. \\nThe attack begun with massive shelling of the al-Assad Neighborhood in western Aleppo with ‘Grad’ missiles, artillery and mortars. Then, three vehicle-borne improvised explosive devices [suicide – 2, remote controlled – 1] targeted the government positions and the militants launched the main phase of the attack in the direction of Al-Assad Military Academy. \\nIn total, about 3,000 fighters, up to 30 artillery units and unspecified number of heavy military equipment were involved in the operation. The pro-government forces responded with massive artillery fire and air strikes. Air raids were also reported in the area of Khan Tuman, serving the rear base of attack. \\nConsidering the sides’ military capabilities and the terrain features, SF forecasts that the terrorists will not be able to break the siege of Aleppo in case of the effective operations by the Syrian military staff. \\nThe Kurdish YPG have killed over 30 members of Turkish-backed militant groups in clashes near the village of Tall Malid in northern Syria, according to pro-Kurdish sources. Since October 26, YPG units have conducte da series of attacks on the Turkish-backed militant alliance, known as the Free Syrian Army (FSA), and retook the villages of Tall Malid, Jisr ash-Samuqah and others – from it. \\nIn a separate development, the Turkish forces seized the villages of Diwêr El-Hewa and Eblayê that had been controlled by ISIS. \\nOn October 27, the Syrian army’s Tiger Forces and the National Defense Forces liberated the strategic town of Suran in northern Hama. Then, the government forces launched an advance on Taibat Imam. On October 28, clashes continued in the area. Related Posts: No Related Posts The views expressed herein are the views of the author exclusively and not necessarily the views of VT, VT authors, affiliates, advertisers, sponsors, partners, technicians, or the Veterans Today Network and its assigns. LEGAL NOTICE - COMMENT POLICY Posted by South Front on October 28, 2016, With 617 Reads Filed under WarZone . You can follow any responses to this entry through the RSS 2.0 . You can skip to the end and leave a response. Pinging is currently not allowed. FaceBook Comments \\nYou must be logged in to post a comment Login WHAT'S HOT\""}, "time": 1742562117.4897337}