{"duration": 0.03881216049194336, "input_args": {"text": "'Curtis Flournoy dislikes white people almost as much as the Oxford comma. [Police in Charlotte, North Carolina, arrested the      for allegedly setting fire to a market owned by an immigrant from Bhutan. The arsonist left a note, which began: “Our newly elected president Donald Trump is our nation builder for white America. ”  The culprit in the   and fire not only attempted to depict white supporters of the president as violent racists, but as   as well. “You all know that, we want our country back on the right track,” he informed. “We need to get rid of Muslims, Indians and all immigrants. Specially, we don’t want business by refugees and immigrant any more. ” The staged hate crime mirrors several other faux attacks on religious and ethnic minorities in the wake of Donald Trump’s political emergence. In Manhattan in December, a Muslim woman claimed a trio of white drunks assaulted her on a crowded subway train and pulled on her hijab while chanting   slogans and issuing   taunts. Earlier in Mississippi, news reports indicated a hate crime when “Vote Trump” appeared   on a   black church. Police later arrested an   parishioner for the crime. Whereas the Muslim college   allegedly made up the story to avoid the wrath of her father after breaking curfew, the culprit in the Charlotte attack appears to have harbored no motive save for embarrassing white Trump supporters. He broke a window and set fire to the establishment. He did not steal anything, save for a sentence’s right to   agreement. “We are ready to wake up some of our great state including North Carolina and we will take care of the country he typed. “Immigrants and refugee are taking our job, doing business and leaving us standard. So, you are not allowed to do business any more. ” After a “God Bless America” complementary close, the   identified himself as “White America. ” But the racist surveillance video shows a black American. Throw the book at him —  Strunk and White’s Elements of Style.'"}, "time": 1742564270.1362312}