{"duration": 0.29404377937316895, "input_args": {"text": "'Africa , Hybrid Wars By Andrew KORYBKO (USA) \\nThe introductory text prefaced the general concepts that the author will be extrapolating on further in the research, and now that the basics of the overall analytical foundation and the contours of the reference map are out of the way, it’s time to begin exploring the influence of hegemonic and institutional regionalism on African geopolitics, widely investigating the asymmetrical threats endemic to each area, and start elucidating China’s overall Silk Road vision for the continent. \\nAfrican Regions, Their Respective (And Prospective) Leaders, And Interregional Conflict Scenarios \\nThe author’s preferred method of explaining Africa’s geopolitics is to begin as broadly as possible and then gradually become more specific, with the entire continuum of study eventually leading to the reader’s solid understanding of China’s visionary plans. To start off, it’s necessary to divide Africa into five separate regions and identify the state within each which holds the most influential demographic, economic, and military sway (cumulatively described as leadership) and has the most promising long-term potential (operative word) to become a regional heavyweight if it isn’t one already: \\n* Brown – North Africa – Egypt * Orange – Horn And East Africa – Ethiopia * Blue – Central-South Africa – Democratic Republic of the Congo (DRC) * Red – Southern Cone – South Africa \\nInterpretation: \\nIt should immediately be said that the above map is a conceptualized representation that includes both current and prospective realities (the latter in reference to the DRC), and that the shaded areas are rough estimates of the approximate spread of each region. There are certainly limits to each identified core country’s influence and it’s predicted that there will obviously be competitive coalitions both within its own sphere and outside of it that assemble to challenge the given state’s leadership over the said region. For example, this can currently be seen by the former French colonies of West Africa having their own Paris-controlled currency and collectively viewing Nigeria’s regional ascendency with suspicion, which has been particularly evident when it comes to Chad and its uninvited (but unopposed) anti-terrorist military involvement in northeastern Nigeria. While admittedly imperfect in certain respects, the simplified map does present a relatively accurate snapshot of the broader geopolitical processes that are presently underway in Africa and allows observers to relatively accurately extrapolate on their predicted trajectory. Therefore, the map should only be seen as a basic working model through which the reader can acquire a generalized idea about the continent and a prism of perspective through which they can thus interpret the rest of the unfolding Hybrid War analysis. \\nFocal Points Of Overlap: \\nThe introduction spoke about some of the overlap potential between the earlier-identified regions of Hybrid War study, but seeing as how the most recent map is somewhat different in categorizing the entire continent into geographic blocs, it’s necessary to succinctly touch upon some of the areas of overlap that may not have been addressed previously. \\nNorth-Central Nexus: \\nThis tinderbox of a locale is defined as the convergence area between Chad, the Central African Republic (CAR), Sudan, and South Sudan, and it’s marked by an array of interlinked involvement between state and non-state actors in each other’s affairs. Chad and Sudan had earlier vied for influence in the latter’s region of Darfur, and N’djamena also exerts influence in the Muslim reaches of Northern CAR. Khartoum is involved in a back-and-forth proxy war with Juba along their shared frontier which sees both sides supporting a mix of non-state rebel actors (some of which are defined by the respective targeted governments as terrorists), and the globally notorious non-state bogeyman of Joseph Kony and his Lord’s Resistance Army operates between CAR and South Sudan. The below map conceptualizes the dangerous interplay between forces in this totally destabilized region and shows how the only missing factors are the ‘geographic diagonal’ involvement of Chad in South Sudan and Sudan in CAR, and a possibly disruptive humanitarian/militant influence emanating from CAR to Chad (which is not unlikely if confessional tensions spike once more): \\nMountain Mayhem: \\nThe next most conflict-prone area of regional overlap is the mountainous area that straddles the DRC and Uganda, Rwandan, and Burundian borders. After the end of the Second Congo War (“Africa’s World War”), Ugandan and Rwandan pro- and anti-government militia groups ended up controlling this part of the DRC and seizing the profitable mining deposits located here. There’s a lot of legal and illegal cross-border traffic between the two sides, and it’s well known that conflicts from one part of the mountains could easily spill over to the other due to the well-established economic and demographic connections that link them. Burundi figures into the equation because it’s the ‘weak man of East Africa’, a recent civil war state that is now being pushed back to the brink as part of the US’ Hybrid War agenda against China (which will be addressed in full later on at the appropriate section). Destabilization in this country could easily move west and north to DRC and Rwanda, creating a tri-state ethno-regional conflagration that would inevitable come to involve Uganda as well. \\nFor the time being, though, dominant influence between the two identified African regions is pretty one-sided, with Rwanda and Uganda exerting control over the DRC and not the other way around. This is primarily due to their respective nationals and affiliated militias (both pro- and anti-government ones) creating a sort of ‘strategic depth’ that has profoundly penetrated just about all levels of life in the eastern DRC. However, if the DRC ever got back on track after being spectacularly sidelined by the West’s covert war against it in the early 1960s and further weakened by the First and Second Congo Wars, then it’s foreseeable that the cross-border flow of influence could either be equalized or even reversed if the right demographic factors were leveraged under the proper geopolitical conditions. \\nRegardless of the ‘positive’ movement of influence in either direction, if cross-border Hybrid War triggers are activated, then it’s likely that the general destabilization could also involve Tanzania and possibly even Zambia. The last possibility is more likely so if a renewed Katanga separatist or anti-government campaign is ever launched within the region, which might pan out to be the case if popular former governor and “ opposition ” leader Moisi Katumbi stirs the pot of regionalism should President Kabila run for what would at this point be an unconstitutional third term , delays the elections, or is accused (whether rightfully or wrongfully) of committing voter fraud that helps him or a hand-picked political successor win at the polls. \\nSahara Terror: \\nThe next interregional conflict overlap in Africa deals with terrorist groups in the Sahara, in particular the interplay between transnational militant organizations operating in the broad expanse between Mali, Mauritania, Algeria, Niger, and Libya. The NATO War on Libya destroyed the most prosperous and stable state in Africa and was the catalyst for destabilizing the rest of the aforementioned states ‘downstream’ via the newly opened weapon and militant channel that was created in the former Jamahiriya. This wide space is sparsely populated but is rich in oil, natural gas, and uranium deposits. For this reason, Sahara terrorism directly affects the global commodities trade and the interests of certain Great Powers and their most prominent transnational corporations. \\nAs a fitting example, France’s nuclear leader Areva controls uranium mines in Niger, and the in-country French military contingent there is also tasked with protecting them, among its other responsibilities. Furthermore, the mixture of destabilization in the region, low energy prices, and rapid LNG industry developments have led to the indefinite shelving of the tentative proposal for a Trans-Saharan gas pipeline from Nigeria to southern Europe via Niger and Algeria, but this idea nonetheless still remains a possibility that might one day be revived . \\nWidening the interregional scope of the Libyan-originated destabilization that is now plaguing the Sahara, the terrorist hijacking of the Tuareg’s 2011-2012 “Azawad” self-determination movement in Mali has also led to a spillover effect of Islamic/Salafist violence in Burkina Faso and the Ivory Coast , non-Sahara countries which are part of the greater West African region. Therefore, the two launching pads of inter- and intra-regional destabilization can be identified as Libya and Mali, with the latter becoming totally unbalanced only after the former’s collapse following the US-led NATO war against it. \\nMalawi In The Middle: \\nFormerly part of the British Empire and administered together with Zambia and Zimbabwe as a member of the “Central African Federation” in the closing days of colonialism, Malawi is categorized as part of the Southern Cone sphere of regional influence because most of its international trade runs through Mozambique. The landlocked country is one of the world’s poorest and least-developed nations, and the state’s dire poverty has created a situation where anti-government sentiment can be easily manipulated. \\nWhile Malawi isn’t directly a part of China’s larger integrated Silk Road network in Africa, the two countries have quickly moved closer to one another economically over the past couple of years after the African state disowned its prior decades-long relationship with Taiwan, thus raising the covert consternation of the US and pushing Washington to order its top diplomat in the country to prepare for a coup and possible Hybrid War attempt. \\nMalawi’s geopolitical position is such that any large-scale destabilization within the country’s borders could easily spread to Mozambique, but most important for the research’s focus, it could also just as likely move northwards to Zambia and Tanzania, two pivotal countries that are involved in China’s transcontinental Silk Road projects. Because of the conflict overspill potential that a seemingly tiny and assumedly geopolitically irrelevant state like Malawi can have, it’s accurate to label it a “Second Burundi” in terms of the chances that it could be used to trigger a regional conflagration that could subsequently offset China’s integrative vision for the continent. \\nIf timed to coincide with a Hybrid War in Burundi, then a prospectively planned one in Malawi would deal double a dose of destabilization to Tanzania and could be used to spark a larger transregional conflict zone between Uganda and Mozambique. \\nFurthermore, there exists the potential (which will be discussed at a future point in the research) that this could either trigger the renewed Katanga secessionist crisis or anti-government movement that was mentioned before or be timed to coincide with it in its own right during the elections that are tentatively forecast for late 2016. If this scenario eventuates, then the simultaneously exploding series of latent conflicts would certainly spell the end for all of China’s transcontinental integrative plans, although it might still be possible to salvage the ones dealing only with East African coast (and which will also be described later on in detail). \\nThe Real African World War: \\nThe nightmare scenario that could one day transpire in Africa is if the super- and sub-equatorial active and potential conflict zones find a way to interlink with one another and turn the whole continent into a massive Hybrid War battleground. While somewhat far-fetched at the moment and tactically hindered by the DRC’s jungled geographic ‘firewall’, if another ‘African World War’ takes place in the Congo, then the resultant destabilization could be enough to surmount this physical difficulty and summon a Black Hole of Chaos that sparks a real “African World War’ which ends up connecting the Saharan-based terrorists with the Lake Malawi militants. This could most realistically be achieved via an outbreak of large-scale turmoil in the Nigerien-Chadian buffer zone and the Zambia-Tanzania-Katanga Province New Silk Road infrastructural nexus. Non-African Foreign Military Bases \\nKeeping with the present security theme, non-African foreign militaries have left a remarkable footprint on the continent. For the most part, it’s primarily the US and France that have spread their units far and wide, although Washington “officially” claims that it only has a single military facility in Djibouti. Despite the technical ‘legalese’ of the Pentagon’s pronouncements, investigative journalist Nick Turse has unearthed piles of evidence proving that drone bases, logistics hubs, and other covert warfare-facilitating outposts are surreptitiously being utilized all across Africa. The reader is strongly encouraged to read this author’s works and become familiar with his findings, as they detail the contours of the shadow war that the US has been waging on Africa ever since 9/11. To summarize the US role in Africa in the most concisely pertinent way, the Pentagon regularly conducts training exercises with almost every single African military in one capacity or another, and it keeps a more lasting presence in the contiguous Sahara-Sahel-jungled area that stretches from the Atlantic to the Indian Ocean and has been called “ The New Spice Route ”. As taken from the last hyperlinked source, here’s a map displaying how this network, which has also been nicknamed “the hippo trench”, looks from a continental perspective, but it should be kept in mind that Ethiopia is no longer a formal part of this arrangement after it asked the US to remove its drone base in early 2016 in the months following the original article’s publication: \\nThe other military power most actively involved in Africa is France, which had earlier colonized a large chunk of the continent in the late-19 th and early-20 th centuries. The most active part of its force is deployed in the Sahel region as part of “ Operation Barkhane ” which stretches across what has been referred to as the “G5 Sahel” countries of Mauritania, Mali, Burkina Faso, Niger, and Chad. In addition to this, Paris also keeps troops in Senegal, Ivory Coast, Gabon, Central African Republic (CAR), and Djibouti. Here’s what France’s military deployments look like when they’re mapped out: \\n* Red: G5 Sahel * Pink all others \\nComparing the two maps, it’s possible to observe a military overlap between the US and France in Senegal, Mali, Burkina Faso, Niger, Chad, CAR, and Djibouti: \\nWhile most of the double concentration of foreign military bases lies in Western and Central Africa, the fact that this is also present in Djibouti mustn’t be overlooked. In fact, the miniscule East African nation has a disproportionate military significance in that it concurrently hosts American, French, Japanese , Chinese , and soon even Saudi bases, making it by far a global military anomaly in this regard. With the focus now on East Africa, it’s timely to state that this part of the continent beyond Djibouti is also becoming heavily militarized by foreign forces as well. The UAE is suspected of having a naval base in Eritrea and is purportedly prospecting for facilities in Somalia’s autonomous breakaway region of Somaliland, while Turkey is also building a military base in the civil war-torn country. On top of all of this, Qatar maintains a small amount of “peacekeepers” in both Eritrea and Djibouti ever since 2010 as part of its UN-related responsibility in supposedly “mediating” between the two asides after a tense border dispute in 2008. This strategic concentration of forces has the effect of creating the perception that landlocked yet economically promising Ethiopia is being encircled, especially by the GCC-member states of Saudi Arabia, Qatar, and the UAE, which will be an important fact that will be returned to later on when the research addresses the Horn of Africa region. \\n* Red: Horn of Africa states with foreign military bases * Orange: Ethiopia African Military Blocs \\nAlthough there’s a diversified non-African military presence all throughout the continent, Africa has still been able to assemble a loose network of regional military-security blocs that operate under the nominal aegis of the African Union (AU). The African Standby Forces , as they’re known, are divided according to Regional Economic Communities (RECs) and Regions and given defined areas of responsibility. The economic boundaries of most of these geographic blocs overlap with their military ones and will be described more in the next section, but for the time being, here’s what the AU’s allocation looks like: \\n* Brown: North Africa Regional Capability * Yellow: ECOWAS * Purple: Economic Community of Central African States (ECCAS) * Orange: East African Standby Force (EASF) * Red: Southern African Development Community (SADC) \\nNOTE: South Sudan is not yet a full member of the East African Standby Force, while Angola and Burundi are listed as having dual responsibilities within their shared ECCAS and SADC and the EASF, respectively. Additionally, it’s important to point out that the East African Community is divided between South Sudan, Kenya, Uganda, Rwanda, and Burundi’s commitment to the EASF, Burundi’s additional responsibilities to the ECCAS, and Tanzania’s incorporation into the SADC zone of responsibility. Also, because Morocco is not part of the AU as per the Western Sahara dispute, it’s not party to the African Standby Forces agreement in any capacity. \\nThe last thing that’s important to point out about Africa’s military blocs is that Nigeria, Niger, Cameroon, and Chad have aligned their forces to battle the Boko Haram threat that afflicts their shared Lake Chad basin. Documenting this on a map, it superficially looks like a formidable military alliance, but it’s actually a poorly coordinated and internally competing force dominated by mutually suspicious Nigeria and Chad: \\nTo be continued… \\nAndrew Korybko is the American political commentator currently working for the Sputnik agency. He is the author of the monograph “ Hybrid Wars: The Indirect Adaptive Approach To Regime Change ” (2015). This text will be included into his forthcoming book on the theory of Hybrid Warfare. \\nPREVIOUS CHAPTERS:'"}, "time": 1742564402.2049124}