{"duration": 0.033324241638183594, "input_args": {"text": "'Yemen This still shows Abdul-Malik al-Houthi, the leader of Yemen’s Houthi Ansarullah movement, delivering a televised speech. (file photo) \\nThe leader of Yemen’s Houthi Ansarullah movement says Saudi Arabia commits crimes across the globe with the US green light. \\nAbdul-Malik al-Houthi said on Wednesday that the Al Saud family has adopted a hypocritical approach in the Muslim world, the proof of which is Takfiri violence gripping the region. \\n\"When Washington gives the Riyadh regime the green light, sedition sparks in all countries, with the Saudi offensive being in line with such a trend,\" he added. \\nThe Houthi leader also warned that Saudi Arabia is seeking to damage security in some Arab countries such as Egypt, Yemen, Syria and Iraq through petrodollars and deceptive propaganda works. \\nInstead of countering the enemies of Islam, including the US and Israel, the kingdom has been engaged in spreading Takfiri ideology and arming terrorists, Houthi noted. \\n\\'Saudi has Yemenis’ blood on its hands\\' \\nOn October 8, in one of the deadliest attacks Yemen, Saudi warplanes bombarded a funeral hall packed with mourners in Sana’a, killing over 140 people and injuring at least 525 others. \\nHuman Rights Watch, a New York-based rights group, said that the Sana’a bombing constitutes an apparent war crime, while Amnesty International said the attack was a reminder of the need for the suspension of arms sales to Saudi Arabia. People inspect the aftermath of a Saudi airstrike in Sana’a, Yemen, October 8, 2016. (Photo by AP) \\nSaudi Arabia committed crimes by the Sana’a attack, but it tried to acquit itself of the assault, Houthi said, adding that there was no clear sign suggesting an end to the Saudi offensive. \\nHe also stressed that Yemenis cannot rely on the United Nations as the world body has not adopted a position regarding the Saudi attack in Sana’a. \\nHouthi further wished victory for the Palestinian nation and the resistance front in Lebanon and Syria as well as the Iraqi people in their anti-terror operation in the city of Mosul. \\nThe Riyadh regime resumed its deadly airstrikes on Yemen on Sunday hours after a three-day truce in the conflict-ridden country expired. \\nYemen has seen almost daily military attacks by Saudi Arabia since late March 2015, with the UN putting the toll from the aggression at more than 10,000. \\nThe offensive was launched to crush the Houthi Ansarullah movement and its allies and reinstate the former Yemeni government. The US has been providing logistic and surveillance support to the kingdom in the bloody military campaign. Loading ...'"}, "time": 1742628321.390681}