{"duration": 0.09822440147399902, "input_args": {"text": "'Anybody with kids can tell you that getting them to develop healthy eating habits is no easy feat. We know that children in the US are in the midst of an obesity epidemic—that they are eating processed foods and drinking sugary drinks and sodas at an alarming rate. But studies now show that children are hardwired to like sweet, high-caloric foods (the theory is that this preference gives them an evolutionary advantage for growth, particularly in circumstances when calories are scarce). So how can we counteract these biological impulses in our kids and also make sure they are eating plenty of fresh vegetables?\\nKids may not gravitate naturally toward vegetables, but when they are responsible for growing them and harvesting them from their own gardens, they are much more likely to taste their efforts. In addition, there are a few very sweet things you can grow in your garden that acts as introductory veggies, a kind of “gateway” to the world of vegetables. Once you win kids over with a few known favorites, you can sneak in the less sugary veggies and open them up to a lifetime of flavorful, healthy choices.\\n6 ‘Gateway Veggies’ Kids Will Love! Carrots You can thank Bugs Bunny for making carrots appealing to young kids. Carrots are often the only vegetable picky eaters will agree to, but it’s not a bad starting point. Kids are great at pulling these up from the garden by themselves and leaving the leafy green tops on makes the act of eating them more like the cartoons. The sweet flavor comes in at about 6 grams per cup (for comparison, a typical candy bar has more than 25 grams of sugar) and they are a handy snack that almost every kid loves to crunch on.\\nCherry Tomatoes Tomatoes are technically a fruit, of course, but the sweet, flavorful garden favorite has just 3.9 grams of sugar for a cup serving. A single cherry tomato plant can provide a huge harvest and kids love that they can be popped right into their mouths for a treat. Even if you have a big garden, you might want to plant tomatoes in planters on your patio so that they are always readily available to add to salads or snacks. Once kids are sold on the cherry variety, you can introduce them to the various other types of tomatoes available to them.\\nSugar Snap Peas These veggies have “sugar” in their name for a reason, and kids love to help pick and pop out these sweet, healthy peas. They taste great raw and are fast growing so kids can quickly see their progress in the garden. A cup has just 2.5 grams of sugar\\nSweet Corn It isn’t the easiest vegetable to grow, but if you are able to, sweet corn is a huge favorite for kids. It can be used in salads and soups and is a great side dish, but perhaps the best way to enjoy corn is to eat it straight from the garden. Adding this more difficult plant to your garden will help kids to see how their hard work and effort pays off. Corn has 6.8 grams of sugar per cup, though it is a higher glycemic food that raises blood sugar levels a bit more than the other veggies in this list.\\nRutabagas Though it is not the prettiest veggie in town, the rutabaga is a sweet treat that is often overlooked. It is a hardy, cool-weather biennial grown as an annual and it’s easy to maintain. It has a sweet woody flavor and can be cut into sticks and eaten raw (at our house we call them rutabaga fries). Rutabagas have 6 grams of sugar per cup, the same amount as a carrot.\\nBeets People think of beets as an adult vegetable that you have to trick kids into eating, something along the lines of Brussels sprouts. In reality, kids are naturally attracted to the bright red color and the unusual shape and, if your kids fascinated with bodily functions like mine are, they will be all too excited to see the “result” (i.e., bright red poop!) that comes from eating a meal of beets. Like other root veggies, beets are easy for kids to pull out of the ground themselves. The beet is actually sweeter than any other vegetable in this list, coming in at 9 grams per cup, but the fiber and other nutrients make it a very healthy choice.\\n\\n\\nPamela Bofferding is a native Texan who now lives with her husband and sons in New York City. She enjoys hiking, traveling, and playing with her dogs.\\nThis information has been made available by Ready Nutrition \\nOriginally published November 22nd, 2016 How Farmers Markets Can Teach Your Kids the Values of Local… Delicious and Healthy Quinoa Coconut Granola Bars Fruit By Design: The Cotton Candy Grape Top powerful fall foods for your health Spice Up Your Vacation With These 7 Spices '"}, "time": 1742562551.8460438}