{"duration": 1.4362950325012207, "input_args": {"text": "'by Outis Philalithopoulos In the most recent episode of this series , the ghost of Outis had fun watching a Disney movie. Afterwards, he spoke with Zootopia ‘s star, Judy Hopps, about the movie’s sly humor, and its efficacy at stigmatizing prejudice and fostering empathy for the suffering of others. After my visit from Judy, I felt reinvigorated, ready to take a fresh look at the questions that had puzzled me. I could discern three large scale principles at work in deciding whom to include and whom to exclude from the liberal tent. One is postmodernism. One is smartness. And the third, seen clearly in Zootopia , is a consensus about the reality of certain kinds of suffering and trauma. During the past few decades, the importance of smartness has if anything increased. A college education has become a basic requirement for being middle class, and parents of all political stripes scrabble desperately to get their children into the “best” schools. The credentialing sectors of capitalism have been dominated by liberals for decades, but only recently have we successfully leveraged this strategic asset into the idea that liberals are basically the same as educated people. Other sites of cultural production – Hollywood, television, marketing, social media corporations – are also stereotypically liberal, and have become much more responsive to pressure from progressives. Movies like Zootopia , watched by millions of parents and children, show how it is possible to direct corporate power toward positive goals. We have succeeded in dividing capitalism into two halves, one still ugly and irredeemable, but the other (the cultural and credentialing sectors) tamed, dynamic, and fashionable. We absorb into our alliance everyone from marketing professionals to college professors to people who just like the Daily Show, reinforcing our sense of truth by identifying things as stupid, backwards, or insane. Looking now at the other two principles – postmodernism and suffering – Wendy Brown foretold that, as foci, they would be unable to coexist. Since the time of her prediction, the balance between the two has shifted dramatically, and it has become clear that Brown was rooting for the losing side. Postmodernism lamented the modern world’s lack of orienting fixed points, and maybe tried to make a virtue out of this disorientation. Maybe, as I suggested to Foucault, it tried to establish the insistent assertion of the lack of fixed points as its own fixed point, and then covered the maneuver in a bewildering morass of verbiage. The contrast with the familiar liberalism of today is stark. We have reconstructed ourselves as progressives, burying postmodernism and reconstituting a robust sense of absolute morality and truth. The process took some time to gather steam, but is now at the helm of mainstream culture. Although we believe in some positive ideals like education, we have been especially successful at vanquishing the corrosive doubts of postmodernism by setting up negative ideals as transcendentally true. At the center of our imagination are atrocities like slavery, genocide, rape – these no one can doubt, these are things to which at one’s peril one refuses to kneel. Who can deny that they exist, that they hurt, that they are evil? We therefore pick out vivid episodes in which certain groups of people suffered, and make it clear that anyone that does not ritually acknowledge the reality of their suffering is unworthy to be part of society. In this way, we manage to stigmatize horrible, regressive behavior, but that isn’t enough. High profile instances of genocide and torture don’t appear every day, and commitment flags without regular stimulation. And so we have taken seriously at least one idea from postmodernism, the fascination with slight conceptual nuances, and the faith or fear that these nuances can produce enormously consequential effects. We focus not just on torture but also on less obviously brutal but still hurtful behavior (“micro-aggressions”); not just on behavior but on language, not just on language but also on thoughts. By discouraging hurtful speech and sensitizing people to implicit bias, we make the world a more pleasant place. Critics of progressives complain about “political correctness,” but you can’t forge a unitary culture without imposing boundaries, and we mainly focus on obvious principles of good manners and consideration toward others. Zootopia as an Allegory Although there is still a long way to go, the progress of our culture toward liberation is historically unparalleled. Zootopia provides an extensive allegory about our achievement. We naturally dread the uncivilized past. One symbol of the past is the pathetic figure of Judy’s parents, who tell her to settle and not follow her dreams. More frighteningly, the plot of the movie revolves around the mysterious fact that some animals are reverting to wildness – the past is thus not merely the past, but threatens to return. There is a still more insidious threat, which is the possibility that some part of the past remains lodged inside of us, like the specks of evil that St. Augustine once believed that God places in us in order to foil our efforts to attain goodness on our own. This fear is hardly surprising, given that we have come to a consensus that certain ways of talking that just twenty or even ten years ago passed without comment in liberal circles are, in reality, clearly problematic. The climax of Zootopia is when Judy, without any selfish or cruel intent, loses control of her mouth – and primitive, nonprogressive ideas escape from it. Zootopia doesn’t merely show us the shadow of the past, but also offers us, as individuals, hope in the exciting future. Judy avoids becoming a carrot farmer like her parents, and is able to move past the degrading experience of working as a “meter maid.” By virtue of being impressive, competent, and using the rules in her favor, she is able to rise to the top and be valued for her abilities. Leftists often worry that professional success can lead to people losing their moral compass. Zootopia offers a helpful perspective on this dilemma. When Judy reaches the pinnacle of success, that is precisely when she messes up and says problematic things. At first glance, Zootopia seems to suggest that morality is far more important than worldly success. Judy responds to her fault by taking a leave of absence from her job and feeling terrible. In the end, she is only able to redeem herself by treating herself as utterly worthless: by confessing abjectly to Nick, pronouncing herself damned, and handing him the only key that can set her free. I now realized, though, that the message of the movie was optimistic. True, if we say or think wrong things, we need to respond seriously, the way Judy did. But if we do that – and if we express support for progressive ideals and acknowledge our privilege – then we can be as successful as we want to be. There doesn’t need to be any conflict between ambition and being a good person. That doesn’t mean that liberals have to care about professional success. If you want to care about people in Africa or the plight of the working class, that’s great, too. The important thing is that we come together on the important things, like basic moral principles and recognizing the suffering of marginalized groups. As this consensus consolidates, society will continue to progress. Some people will try to derail the process, maybe due to sensitivity about having been called out, or anger at losing their privilege. More and more, those people will be seen as throwbacks. Demographic forces will render them irrelevant. Maybe they will just be swept away by globalization. Or – maybe – they can work at the DMV. The Phantom A bell sounded and roused me from my vision of the future. There I saw a Phantom, draped and hooded, gliding like mist along the ground towards me. It was shrouded in a deep, black garment, which concealed its head, its face, its form, and left nothing visible except one outstretched hand. “The Spirit of Liberalism Yet To Come, I presume?” I asked. The Spirit did not answer. I felt a stab of fear at what it might show me. Would the current positive trajectory continue? Would the future bring cultural progress in ways I couldn’t even imagine? Or would the 2020s instead feature a cyclical swing back to postmodernism? Or something worse still? The Spirit merely pointed onward with its hand. I followed it, and found myself listening to another speech, taking place not in the far future, but toward the end of 2016. Yet my sense of foreboding did not abate, and for apparently no reason at all, the cloud-capped towers and gorgeous palaces of my vision suddenly seemed insubstantial, and vain. I remain curious why the “debate” over antiracism as a politics takes such indirect and evasive forms – like the analogizing and guilt by association, moralistic bombast in lieu of concrete argument – and why it persists in establishing, even often while denying the move, the terms of debate as race vs. class. He seemed to refer to “antiracism” as if it were not an obviously good thing. I looked at his name plate. Adolph Reed? Who was this person? In the logic of antiracism, exposure of the racial element of an instance of wrongdoing will lead to a recognition of injustice, which will in turn lead to remedial action – though not much attentions seems ever given to how this part is supposed to work. I suspect this is because the exposure part, which feels so righteously yet undemandingly good, is the real focus. I did not understand why the sound of his voice troubled me so much. “Spirit!” I exclaimed, “this is a fearful place. I will not forget its lessons, trust me. Let me go!” But the Ghost only pointed, with an unmoved finger, at Reed, whose icy words burned in my ears. These responses [show] how fundamentally antiracism and other identitarian programs are not only the left wing of neoliberalism but active agencies in its imposition of a notion of the boundaries of the politically thinkable – sort of neoliberalism’s intellectual and cultural border guard. “Answer me one question,” I cried. “Are the things Reed says the shadows of things to come, or are they merely his own cynical perspective?” I caught at the Spirit’s spectral hand. It sought to free itself, but I persisted. Yet the Spirit was stronger than I was, and repulsed me. I fell to the ground, and when I arose, I was alone in the weeping land. * * * The series concludes tomorrow, with Outis reaching new conclusions and making an important decision. Sources: Adolph Reed’s remarks are from a recent interview and an earlier article . Some of the thoughts on political correctness are based on Belle Waring’s Crooked Timber article . 0 0 0 0 0 0'"}, "time": 1742563217.216951}