{"duration": 0.05499267578125, "input_args": {"text": "'ISTANBUL  —   The Turkish authorities extended their purge of state institutions on Tuesday, suspending more than 15, 000 employees of the education ministry for suspected links to a failed military coup last week. Shortly after the suspensions were announced, the High Education Board ordered the resignation of more than 1, 500 deans from universities across the country and revoked the licenses of 21, 000 teachers, Turkish officials said. By Tuesday night, the government of President Recep Tayyip Erdogan had either purged or detained nearly 35, 000 members of the military, security forces and judiciary in an effort to remove from the government bureaucracy and   loyalists of Fethullah Gulen, a Muslim cleric whom the government has accused of orchestrating Friday’s coup attempt. Prime Minister Binali Yildirim likened Mr. Gulen’s followers to a “parallel terrorist organization. ” “We will dig them up by their roots so that no clandestine terrorist organization will have the nerve to betray our blessed people again,” Mr. Yildirim told Parliament on Tuesday. The purges of educational institutions are intended to blunt the influence of followers of Mr. Gulen, a rival of Mr. Erdogan’s who has been in   exile in Pennsylvania since 1999. Mr. Gulen has inspired an international network of schools, including more than 160 public charter schools in the United States, which have won grants from the federal government. But Mr. Gulen’s movement has said it has no direct ties to these schools and he has denied involvement in the coup. Western diplomats have criticized Turkey for the sweeping expulsions and arrests in the wake of the attempted coup, urging Mr. Erdogan’s government to remain committed to democratic principles including respect for human rights and for the rule of law. Turkish officials say their response is appropriate considering that the plotters have been accused of trying to kill or capture the president. “It took several thousand soldiers to carry out this coup attempt,” the president’s spokesman, Ibrahim Kalin, said on Tuesday. “We have seen many of them on the streets and there are those that hijacked helicopters and  . Many of those shot at innocent people and blocked the roads. ” “Then there were the generals that planned the coup and declared martial law,” he continued. “It is only natural that we apply the rule of law to arrest these people on charges of treason and trying to change the constitutional order of the country illegally. ” The Turkish government also widened its crackdown on news outlets sympathetic to Mr. Gulen by canceling licenses on Tuesday for a number of radio and television channels. Earlier this year, this Turkish authorities seized Turkey’s most popular newspaper, Zaman, after a court ruling placed it under state control. The newspaper was closely associated with Mr. Gulen and had become fiercely critical of Mr. Erdogan and his government.'"}, "time": 1742562561.0051026}