{"duration": 1.6487948894500732, "input_args": {"text": "'  \\nTrump’s campaign has been frantic to close the huge gap in donations between Clinton’s and their own. By some estimates, Hillary is outspending Trump 7-to-1 in advertising – a steep hill to climb for a campaign that is already losing badly in nearly every battleground state. \\nBut in his desperation, Trump did something incredibly stupid. He promised his fans that he would “triple match” any donation over $75 that they made on October 1st. \\nHis fans, believing Trump would put his money where his mouth is, gave generously. Instead of make good on the promise, Trump donated squat. In fact, his donations for the entire month were less than he should have donated that very first day. On Oct 1, I got an email from Trump pledging to triple donations for 24 hrs. \\nDonors gave $165,829 that day. \\nTrump gave $30,682 all month. \\n— Ryan Struyk (@ryanstruyk) October 28, 2016 \\nEven for Trump’s diehard fans, this looks like the man is just the kind of grifter his critics have always claimed he was. Despite pretending to “self-fund” his campaign, Trump has chipped in hardly anything. He’s run his campaign much like he ran his charity, using other people’s money to promote himself. \\nThis is in stark contrast to Trump’s boasts. Famously, the candidate once said he was willing to spend upwards of one billion dollars on his campaign to be president. With just 11 days to go, Trump hasn’t even come close. Most estimates put his own contribution around $50 million – chump change for an alleged billionaire. Kellyanne Conway: The rest of Trump’s $100 million donation to his campaign is still coming (with 11 days left) pic.twitter.com/7U3UF9a0dM \\n— Matthew Gertz (@MattGertz) October 28, 2016 \\nAnd it seems Trump’s campaign knows how badly he screwed this up. His campaign manager Kellyanne Conway scrambled to the nearest media outlet to proclaim that Trump would absolutely be fulfilling a promise he made to donate $100 million by the election. (Note again: He has just 11 days left to do so.) \\nAnd then Trump himself reportedly wired $10 million to his campaign on Friday morning in a day late, dollar short desperation maneuver to help pull out of this tailspin. Donald Trump wired $10M of his own money into this presidential campaign this morning – Dow Jones \\n— CNBC Now (@CNBCnow) October 28, 2016 \\nIt’s hard to truly be surprised that Trump has been stingy with his own campaign. This is the “billionaire” who managed to pay no taxes in twenty years and donate almost no money to charity in the same period. He makes Scrooge McDuck look generous. And with less than two weeks to go, Trump’s chances of becoming president are looking about as fictional as the cartoon duck. \\nGo home, Donald. \\nFeatured image via Ethan Miller/Getty Images Share this Article!'"}, "time": 1742564575.8514552}