{"duration": 0.11221504211425781, "input_args": {"text": "'  lady Michelle Obama is calling into question the “motives” of those who oppose her bland, tasteless, and universally hated school lunch rules, insisting that those who oppose her ideas don’t care about kids and don’t mind if they “eat crap. ”[Speaking at the annual Partnership for a Healthier America conference, Michelle Obama responded with venom to critics of her school lunch program.  Warming to her reply, Mrs. Obama slammed anyone who stood against her policy and characterized critics as people who don’t want kids to be healthy. Michelle Obama criticizes Trump administration’s decision on school lunch rules: “Think about why someone is OK with your kids eating crap. ” pic. twitter.   —   Bradd Jaffy (@BraddJaffy) May 12, 2017,  Saying, “This is where you have to look at motives,” Obama also hinted that she felt the only reason people opposed her nutrition rules is because people opposed her husband on a political level. “It’s not politics, it’s parenting,” she insisted. “You have to stop and think, ‘Why don’t you want our kids to have good food at school? What is wrong with you and why is that a partisan issue?” Obama said. “Why would that be political?” “Moms, think about this. I don’t care what state you live in, take me out of the equation, like me, don’t like me, but think about why someone is OK with your kids eating crap,” the former first lady continued. “Because here’s the secret: If somebody is doing that, they don’t care about your kid, and we need to demand everyone to care deeply about our kids,” Obama exclaimed. “Every elected official on this planet should understand, don’t play with our children, don’t do it,” she concluded. Nowhere in the discussion did Obama note that it is the role of parents to guide their children’s eating habits, not that of the government. In another part of her appearance, Obama ran contrary to the penchant of liberals who constantly insist that children should be given the same   power as adults. At one point, Michelle Obama claimed that kids should not have any say in the foods they eat at school. “How about we stop asking kids how they feel about their food? Kids, my kids included, if they could eat pizza and french fries every day with ice cream on top and a soda, they would think they were happy until they got sick,” she said during the session. “That to me is one of the most ridiculous things we talk about in this movement, that the kids aren’t happy. Well, you know what? Kids don’t like math, either. So what are we going to do, stop teaching math? We gonna cut history out because there are kids who are bored with history? We are the adults in the room, you know? They look to us. So let’s just stop with that. I’m good if kids are mad at me,” she concluded. Obama is unhappy that the Trump administration has begun the process of rolling back the unappetizing food restrictions the former first lady put into place during her husband’s tenure in the White House. Late last month, U. S. Secretary of Agriculture Sonny Perdue began easing some of the restrictions Obama worked to enforce in school lunch programs throughout the country. Perdue put in place an interim rule for the   school year that suspended Obama’s requirements for sodium reduction and whole grains. The new rules also once again permitted   flavored milk in school cafeterias. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742561678.6449234}