{"duration": 0.07549643516540527, "input_args": {"text": "'BEIRUT, Lebanon  —   To the overnight editor at the Arab affairs website, it looked like big news: Kuwait, apparently following the lead of President Trump, had issued a visa ban on citizens from five other predominantly Muslim countries. The editor wrote an article, and the news rocketed through cyberspace. One link caught the eye of Mr. Trump himself, who shared it on his official Facebook page with a word of praise for the reported policy: “Smart!” But there was a problem: The Kuwait ban was from 2011, long before Mr. Trump announced a similar measure in the United States, said James Brownsell, the managing editor of The New Arab, the site that produced that article on Feb. 1. His writer did not notice that the news was years old. Many sites that often support Mr. Trump and also published the report, including Infowars. com and Russia’s Sputnik news agency, have since clarified that it was outdated and unrelated to Mr. Trump’s order. But by Tuesday night, his uncorrected posting had racked up more than 251, 000 reactions, 68, 000 shares and 15, 000 comments, many by fans who see Kuwait’s supposed decision to follow Mr. Trump as a vindication of the president’s policy. “So you mean to tell me Muslims are banning Muslims from certain countries?” a user wrote under the name Christina Villar. “Then we have some Americans thinking our president is heartless. No, he is smart!” The White House did not respond on Tuesday night to a request for comment on Mr. Trump’s remarks. The internet has long been home to countless sites of dubious credibility, and the Arab world is full of news sites bankrolled by private parties to promote their interests. Historically, their audiences have been limited. But in this case, false information, based on a mistake from a   news source, was trumpeted to a vast audience by an American president who is prone to exaggeration and falsehoods, whose immigration policy is under fire, and whose administration has promoted the term “alternative facts. ” That exposure has shocked, and pleased, some who published the false information. “It has been quite staggering,” said Dina Dabbous, the   editor in chief of Albawaba, the   website whose link Mr. Trump shared. “We were quite satisfied, smugly, with that particular piece. ” But the site has since corrected the article on its website. The spreading of articles about the old Kuwait visa ban began last week, after Mr. Trump signed an executive order blocking citizens from seven   countries from entering the United States. As chaos spread at airports and opponents mounted legal challenges to the order, an editor working the night shift at The New Arab, a news site based in London, came across a report that Kuwait had announced a visa ban of its own on citizens from five   states. Keenly aware of the “justifiable international public interest,” the editor quickly wrote and published an article about the Kuwaiti ban without realizing that it was based on “a decision made in 2011,” according to a statement posted on the site on Tuesday after The New York Times inquired about the article’s origin. By the time the error was spotted and the article updated, the first, erroneous version had already spread. “Mistakes happen and unfortunately we found ourselves in a situation where a serious mistake like this (for which the member of staff has been disciplined) went viral,” the site’s statement said. The New Arab called its mistake “a solitary aberration from our usually excellent coverage. ” Because of a syndication agreement, the erroneous article appeared on Albawaba on the same day it was published by The New Arab. On Albawaba, the headline read, “Kuwait issues its own   visa ban for five   countries. ” That article caught international attention, and a number of sites that often defend Mr. Trump’s policies ran their own versions of it. Breitbart News, whose former chairman, Stephen K. Bannon, is now Mr. Trump’s chief strategist, said concerns about “radical Islamic terrorism” had prompted Kuwait to impose the ban. Infowars. com published a version that said Kuwait was worried about “possible migration of radical Islamic terrorists. ” Sputnik, a Russian   news agency that often  spreads disinformation, said Kuwait had “ripped a page from the playbook of U. S. President Donald Trump” with its own visa ban. But indications soon surfaced that the article was wrong. Pakistan’s ambassador to Kuwait denied that a visa ban had been placed on Pakistanis. And on Feb. 3, Kuwait said in a statement on its state news service, KUNA, that it “categorically denied” that it had stopped issuing visas for some nationalities. By the time some of the sites that had published the erroneous information issued clarifications, noting the Kuwaiti denial, the articles on The New Arab and Albawaba topped the “most popular” lists on their sites, even though the articles were six days old. Mr. Brownsell, of The New Arab, said his site’s article had generated more traffic than most of its articles, although he declined to give numbers. “It is safe to say more than usual,” he said. Albawaba issued a statement, also after an inquiry from The Times, saying its article had highlighted how hard it is for people from Syria and other countries to obtain visas to Kuwait, even if there is no official blanket ban. “President Trump, you’re not wrong here!” the statement from Albawaba said. “Our only fault was to call it a visa ban when it should behoove us to call it extreme vetting, or maybe even a ban with few exceptions. ” Ms. Dabbous, the editor at Albawaba, said in a phone interview on Tuesday that the article had served the site’s goal of airing “some of the truths about the Middle East that are narratives that you don’t often see. ” She was unconcerned that her site had kept the erroneous article shared by Mr. Trump up for six days. “With this one, we didn’t consider it all that wrong because we just think it exposes other truths,” she said.'"}, "time": 1742628414.6233559}