{"duration": 0.03995656967163086, "input_args": {"text": "'For this week’s “Unauthorized Disclosure” podcast, Rania Khalek returns as co-host to process how to handle all the fear, panic, and uncertainty created by the presidential election of Donald Trump. \\nWe assess what needs to be fought immediately. Kevin Gosztola suggests the Dakota Access pipeline and return of the Keystone XL pipeline will need to face resistance. \\n“Climate change is probably the most important to organize and push back against. This is going to require people putting their bodies on the line,” Khalek adds. And Gosztola suggests we will need to support not just journalists charged with felonies but all people who are taking action to stop a “moral calamity from taking place,” especially in local communities defending indigenous land from destruction by fossil fuel extraction. \\nKhalek shares her concern that the backing of Republican mega-donor Sheldon Adelson and the people Trump is surrounding himself means it is time to worry about a Trump administration bombing Iran. “There is going to have to be some resurgence in antiwar activism because that would be another moral calamity.”\\nThen, domestically, Khalek says we have to support immigrant communities facing the threat of deportation and support organizations that defend them as well. We have to encourage resistance to any efforts to ban Muslims as well. \\nLots of people in the United States are looking for ways they can plug in to stop Trump. Media organizations and nonprofit organizations, like the ACLU, have seen an incredible surge in donations. In that vein, Khalek and Gosztola suggest you support their journalism if you want something tangible and immediate to do. Khalek is raising money for a series of articles on the war in Syria. Gosztola runs Shadowproof, and the organization is consistently eager to have new members join . (Anyone who donates $5/month receives a tote bag.) \\nDuring the show, the hosts also confront the reality that the last eight years of Democrats, including President Barack Obama’s administration, laid the groundwork for a lot of what Trump plans to do. \\nIt should serve as a warning, Khalek declares. “Even when your team does something bad or your team takes power that nobody should have, just because you trust the person who is currently president and occupying the White House doesn’t mean it is going to stay that way forever. You always have to remember whatever powers they take, the next Donald Trump gets to use.” \\nThe latest episode is available on iTunes. To listen to the episode (and also to download the episode), go here . A page will load with the audio file of the interview that will automatically play.\\nThe post The Aftermath of Trump’s Election: Facing Down Fear, Panic, And Uncertainty appeared first on Shadowproof .\\n'"}, "time": 1742564360.6742096}