{"duration": 0.11523985862731934, "input_args": {"text": "'We Are Change \\nIssues surrounding Hillary Clinton’s health and ability to take on the demanding position of President have pervaded this presidential race. But several recent WikiLeaks emails from John Podesta, chairman of Hillary’s campaign, have revealed that Hillary Clinton’s health problems cannot possibly be branded as “conspiracy theories” any longer.\\n\\nBefore Hillary Clinton announced her run for president, an email sent on March 14th, 2014, by campaign manager Robert Mook to Clinton campaign chairman Podesta asks whether Podesta has discussed Hillary’s “taxes and health.” The email states that he acknowledges they’re both “hyper sensitive” issues, wondering whether “both are better dealt with very early so we control them–rather than responding to calls for transparency.” \\nIn this thread, Mook stated “Yes. We need to kill that baby in the cradle.” (Which perfectly articulates how sadistic the Clinton campaign and agenda is within a single metaphor.)\\nA later email thread from July 31, 2015 , shows Dan Schwerin, Clinton’s director of speech writing, aiming to roll out Hillary’s tax records along with a letter from her physician stating that she is “in excellent health,” and that following this “We expect the stories that pop at 2 pm to have headlines such as “CLINTON IN ‘EXCELLENT HEALTH,’ MEDICAL RECORDS SAY” … “CLINTON RELEASES HEALTH REPORT” … “CLINTON CAMP AIMS TO ONE-UP BUSH IN DISCLOSING FINANCES”\\nThe emails expose the Clinton campaign’s attempts to suppress any further inquiry into these health problems and control the narrative, and provide them with “the best possible, ‘fighting’ chance of promoting the most helpful story lines.”\\nAlso stating that “the first stories on health won’t pop until 2. 1 pm is just when we will quietly approach the reporters, ” the Clinton camp is exposed in the way in which the mainstream media has held complete bias in favor of a Clinton presidency. This has also been revealed through all the recent Podesta email Wikileaks releases. Just one example being an email sent April 30, 2015, by Politico reporter Glenn Thrush, who even called himself a “hack” when asking Hillary’s top campaign aide, John Podesta, to check over sections of his report regarding the Democratic presidential candidate before publication. \\n\\nStartlingly, an email exchange between Hillary’s campaign leaders, Tanden and Podesta, even questions if she is aware that we are living on planet Earth. Telling an audience in Ohio that she was “moderate and center” after previously stating just a few days prior that she was “progressive”, Tanden asks, “Why did she call herself a moderate?”\\nPodesta replied “ I pushed her on this on Sunday night. She claims she didn’t remember saying it. Not sure I believe her.” \\nIn response, Tanden stated, “I mean it makes my life more difficult after telling every reporter I know she’s actually progressive but that is really the smallest of issues. It worries me more that she doesn’t seem to know what planet we are all living in at the moment. ” \\nIt can be speculated as to what this statement is referring to, but it is evident that this proves Hillary’s lack of awareness and mental stability. Perhaps regarding her inability to hold a firm political position, or even more worryingly, her inability to retain even the most basic and fundamental information, due to a medical condition that she is suffering from. Giving credibility to the latter possibility, Hillary’s top aide Huma Abedin admits that the former Secretary of State is “still not perfect in her head,” in a newly revealed Wikileaks email on Tuesday.\\nCountless incidents capturing Hillary’s poor health and unstable mental state have been brought to light, despite the Clinton campaign and mainstream media’s attempted censoring of this content in the hope that portraying a false narrative regarding these episodes will stray attention away from this issue. For example, after Hillary’s recent fall at a 9/11 memorial event filmed by a bystander, the Clinton campaign tried to cover up by claiming this was due to “pneumonia and dehydration” even though Clinton does not appear limp, as though she has fainted. In contrast, she appears ridged and shaky throughout this episode, as Secret Service agents lift her into the vehicle. However, Hillary’s constant tumbles do not surprise me, as the gravitational force pulling this Democratic nominee towards underworld must be so incredibly strong.\\nThis along with many other recently recorded accounts of Hillary’s severe coughing fits , dangerous falls, recurring eye problems , and the spitting up of a vile yellow substance, have undoubtedly shown that this presidential candidate is scarcely physically fit to perform duties as president. Hillary’s mental state is also a major point of concern, which top aides, Podesta and Abedin, have confirmed through the Wikileaks emails stated in this article.\\nIf Hillary blatantly appears unable to function healthily during her time running for president, we can only expect these issues to increase in severity if she were to take on the stressful position of president.\\nThe post WikiLeaks Podesta Emails Confirm Hillary’s Health Issues appeared first on We Are Change .\\n'"}, "time": 1742564518.5293095}