{"duration": 0.057581424713134766, "input_args": {"text": "'Italians this week cheered the electoral defeat of a mayor who signed a deal with George Soros to turn the tiny island of Lampedusa into a gateway to Europe for migrants travelling from Africa. [“Thank you, you have eradicated the Lampedusa cancer,” read graffiti sprayed across walls on several streets of the small island with just 6, 000 residents after voters ousted Mayor Giusi Nicolini.  The Lampedusa native was kicked into third place at local elections Sunday, locals electing businessman Salvatore “Totò” Martello, who said during the campaign that he “cannot stand seeing migrants swarming everywhere”. Since taking office in 2012 the outgoing mayor transformed the island into a gateway to Europe, streamlining migrant processing to enable Lampedusa’s reception centre to process and give shelter to 700 asylum seekers at a time,  moving most of them on to Sicily or the Italian mainland. Nicolini, who has used her status as a public figure to repeatedly promote open borders and acceptance of mass migration to Europe, was two months ago awarded the UNESCO Peace Prize for her “boundless humanity and unwavering commitment to refugee crisis management and integration”. And in October last year, the decorated mayor attended dinner with Barack Obama at the White House, brought along by Italy’s   Minister, the unelected technocrat Matteo Renzi, as one of the people who represented the best of Italy. Following Nicolini’s defeat, “conservative activists joyfully posted altered images representing the former mayor as an illegal immigrant expelled from the country and memes claiming she is an agent of George Soros,” according to the Washington Post, which described the Hungarian billionaire as “the liberal tycoon whom conspiracy theorists accuse of being behind the wave of African immigration to Europe. ” The outgoing mayor rushed to destroy and delete “files, documents, private correspondence and entire folders” from computers in her office upon her electoral defeat, telling the media: “No, I do not have time to respond to Martello, my priorities lie elsewhere. ” Questioning her haste in clearing the mayoral office, several Italian websites pointed to documents that emerged in 2014 which showed Nicolini signed a “memorandum of understanding” with Open Society Initiative for Europe (OSIFE) in which the   agreed to let Soros’ international funding network “help strengthen Lampedusa’s capacity [to take migrants] and promote the island’s population and its guests. ” Noting how, with so many African migrants arriving on boats, Lampedusa “operates in a state of chronic emergency” the OSIFE document asserts the island “will require manpower and expertise to complement its current workforce. ” Under the terms of the agreement, the funding body sent personnel to Lampedusa who set up “humanitarian” and “cultural” projects on the island,. “The agreement does not provide direct financing,” the document states, explaining that “OSIFE will provide the service via a person on the island with skills suitable for the purpose, and adding that funds allocated to Lampedusa will be sent to “specific bank accounts” which must be used specifically for projects promoting mass migration. Last year, leaked OSIFE documents revealed Soros proclaimed that mass migration to Europe should be accepted as a “new normal” carrying with it “new opportunities” for the billionaire’s cash to influence immigration policies on a global scale.'"}, "time": 1742564399.9927814}