{"duration": 0.08241081237792969, "input_args": {"text": "'by ANYA V \\nIn 1928, a man named H.B. Reese, created the peanut butter cup. Mr. Reese was a dairy farmer and a shipping forman for Milton S. Hershey, and found him inspiring. \\nMr. Reese left dairy farming and created the Harry Burnett Reese Candy Co. in his basement within his home located in Hershey Pennsylvania. In 1956, Mr. Reese died, leaving his candy company to his six sons. In 1963, the Reese’ sons merged their fathers’ company with the Hershey Chocolate Corp. The merger was a tax-free, stock-for-stock merger. The six brothers received 666,316 common stocks valued at $23.5 million dollars in 1963. There are now 20 variations of Reese peanut butter cups. Even though Mr. Reese created a tasty candy and his six sons made wise business partnerships, their candy’s ingredients have become questionable. \\nReese’s Peanut Butter Cups are made with the controversial ingredient PGPR (Polyglycerol polyricinoleate, which is used as a substitute for cocoa butter. The FDA has determined it to be “safe for humans as long as you restrict your intake to 7.5 milligrams per kilogram of body weight. Otherwise you’d be open to reversible liver enlargement at higher intakes”. \\nLet’s take a look at the other ingredients in one of the worlds’ most favorite candy. \\nReese’s peanut butter cup ingredients: \\nMilk chocolate, (milk, chocolate, sugar, cocoa butter, chocolate, no fat milk, milk fat, lactose, soy lecithin, PGPR), peanuts, sugar, dextrose, salt, TBHQ and citric acid. \\n•PGPR (polyglycerol pilyricinoleate): Reese’s are made with this controversial ingredient PGPR that has replaced cocoa butter in an effort to cut down on manufacturing costs. PGPR is made from castor beans that reduces the viscosity of chocolate. This chemical has been found to cause gastrointestinal discomfort and allergic reaction in children. \\n•Soy lecithin: 93% of soy is genetically modified. Soy lecithin can cause breast cancer, has negative effects on fertility and reproduction, may lead to behavioral and cerebral abnormalities. ( Read More About Soy Lecithin ) \\n•TBHQ (tertiary butylhydroquinone): TBHQ comes from petroleum and is related to butane. This can be toxic and also cause nausea, vomiting, ringing in the ear, delirium and collapse. It is shown to cause stomach cancer in lab rats, fragment DNA and cause damage to humane lung and umbilical cells. In children it can cause anxiety, restlessness, and intensify the symptoms of ADHD. Want to make your own? Enjoy this recipe I have included:'"}, "time": 1742628289.568605}