{"duration": 0.06547117233276367, "input_args": {"text": "'November 7, 2016, 2:45 pm   \\nFBI Director Comey’s weekend decision not to pursue crooked Hillary for her mishandling of secret government emails was a startling acquiescence to the White House position: In a letter to Congress, Comey said that Clinton should not face criminal charges on the basis of newly discovered State Department emails on a non-secure device. \\nOne can imagine that the FBI Director was ferociously pressured to back down from his earlier accusations. And the switch created the desired headlines one day before the election that concerned voters could safely choose Hillary: she won’t be dragged from the Oval Office to be tried as a criminal! \\nThe Sacramento Bee had a nicely artistic presentation: \\nThe liberal press all headlined with the same not-so-subliminal message — Vote Democrat: \\nFBI SAYS REVIEW CLEARS CLINTON IN EMAIL INQUIRY — New York Times \\nFBI won’t pursue charges against Clinton — Washington Post \\nFBI Affirms No Clinton Charges —Wall Street Journal \\nFBI clears Clinton but Anger Persists — Los Angeles Times \\nClinton cleared in late twist — Chicago Tribune \\nFBI clears Clinton in email case — Houston Chronicle \\nAgain, no FBI e-mail charge — Denver Post \\nSo five out of eight newspapers (chosen by me as being typical major publications) used the verb “clear” which is broad and has the air of finality. \\nHowever, the truth is more complex than a brief headline can convey: Hillary may get a temporary reprieve on the email case now, but that doesn’t mean she is off the hook. As Congressman Trey Gowdy (a former prosecutor) remarked on Sunday, “Investigations are never over unless a statute of limitations has expired or unless jeopardy has attached.” \\nSo if something more incriminating turns up, it’s game on. \\nPlus, the Clinton Foundation remains an object of FBI investigation and is rumored to be a stronger case. In fact, Clinton Cash author Peter Schweizer appeared on a Fox Business show Monday and remarked, “The way it’s been explained to me by people in the FBI sphere is that basically they’re going to get one bite at this apple, so if you bring an email case prosecution, or were to do that and were to fail, the Clinton Foundation investigation just politically would be too much.” \\nCertainly the Wikileaks story that Chelsea’s deluxe wedding was financed by the Foundation has refocused attention on family’s corrupt slush fund disguised as a do-gooder organization. \\nSo Hillary in prison orange remains a possibility, albeit an unlikely one.'"}, "time": 1742564425.649331}