{"duration": 0.07253479957580566, "input_args": {"text": "'After This October Surprise, Donald Trump Only Has One Option Left: Expose The Clinton Crimes Michael On Television Democrats Are Now Calling For A ‘Revolution In The Streets’, And I Believe That They Are Quite Serious By Michael Snyder, on November 13th, 2016 \\nThe surprise victory by Donald Trump on November 8th has spawned a series of violent protests and riots all over the nation as stunned leftists continue to throw the largest post-election temper tantrum in U.S. history. Protesters in large cities all across America have been disrupting public transportation, looting stores, hurling objects at the police and burning Trump in effigy. There have even been shootings at anti-Trump rallies in Seattle and in Portland . Hundreds of protesters have been arrested so far, and organizers are promising that this is only just the beginning. Meanwhile, large numbers of enraged leftists are physically threatening Trump on Twitter , and some are even calling for a violent revolution. Sadly, I believe that they are quite serious about this. \\nEven some big celebrity names are starting to use the word “revolution” in messages to their followers. On Twitter, Katy Perry has ominously warned that “ the revolution is coming “, and comedian Sarah Silverman has boldly declared that “ Trump gets a chance to hear us (or else we R them) If he fails REVOLUTION IN THE STREETS “. \\nOf course other leftists are seeking less violent ways to oppose Trump. There is a major push to use the electoral college to block a Trump presidency, if that fails there are many hoping to immediately impeach Trump once he takes office, and other activists such as former Labor Secretary Robert Reich are calling for a new third party if their planned post-election takeover of the Democratic Party is not successful. \\nBut for many on the radical left the time for patience is over. The “Not My President” movement is taking off like a rocket, and one survey found that only 58 percent of all Clinton supporters consider Trump’s victory to be legitimate. A protest near Trump Tower in New York City on Saturday drew approximately 25,000 people, and USA Today reported that the anti-Trump protest in Portland, Oregon on Saturday night rapidly “ devolved into a riot “. \\nIt is becoming clear that these protests are not going away any time soon, and some are even beginning to refer to this movement as “the Purple Revolution” … \\nNo sooner had Trump been declared the 45 th president of the United States, Soros-funded political operations launched their activities to disrupt Trump during Obama’s lame-duck period and thereafter. The swiftness of the Purple Revolution is reminiscent of the speed at which protesters hit the streets of Kiev, the Ukrainian capital, in two Orange Revolutions sponsored by Soros, one in 2004 and the other, ten years later, in 2014. \\nAs the Clintons were embracing purple in New York, street demonstrations, some violent, all coordinated by the Soros-funded Moveon.org and Black Lives Matter, broke out in New York, Los Angeles, Chicago, Oakland, Nashville, Cleveland, Washington, Austin, Seattle, Philadelphia, Richmond, St. Paul, Kansas City, Omaha, San Francisco, and some 200 other cities across the United States. \\nSo could we actually see a violent revolution on the streets of America? \\nIs the radical left really so horrified by the prospect of a Trump presidency that they would actually be willing to engage in a prolonged campaign of chaos, violence and physical intimidation? \\nWell, the Oath Keepers are so concerned about what this movement could become that they have initiated an intelligence gathering operation that they are calling “Operation HYPO” … \\nClearly as Oath Keepers, we cannot simply sit around and watch while the enemies of liberty work to use violence to initiate a communist revolution in our country. As a result of the intelligence being provided by our Operation Sabot operatives, we have initiated Operation HYPO. We have allowed our personnel to burrow deep inside these protest organizations to collect information regarding tactics, motivations, schedules and logistics. \\nWe had operatives at the planning meetings for the protests that occurred last evening in Baltimore, MD and Philadelphia, PA . Our operatives have also penetrated numerous other planning organizations in cities across the country. For OPSEC reasons, the precise list of cities we are operating in will not be publicly disclosed. \\nAnd one thing that we already know is that the radical left is hoping to organize the largest political protest in United States history in Washington D.C. on Inauguration Day. I will be writing about this later today on The Most Important News . \\nThe election of Donald Trump has been the single most galvanizing event for the radical left that we have seen in decades. One of the early leaders of the “Not My President” movement is filmmaker Michael Moore, and the following are three of his key action points which he feels must be implemented immediately … \\n1. Must quickly and decisively form an opposition movement, the likes of which hasn’t been seen since the 1960s. I will do my part to help lead this as I’m sure many others (Bernie, Elizabeth Warren, MoveOn, the hip-hop community, DFA, etc.) will, too. The core of this opposition force will be fueled by young people who, as with Occupy Wall Street and Black Lives Matter, don’t tolerate b.s. and are relentless in their resistance to authority. They have no interest in compromising with racists and misogynists. 2. Prepare to impeach Trump. Just as the Republicans were already planning to do with President Hillary from Day One, we must organize the apparatus that will bring charges against him when he violates his oath and breaks the law — and then we must remove him from office. 3. Must commit right now to a vigorous fight (including civil disobedience, if necessary)which will block any and all Donald Trump Supreme Court nominees who do not meet our approval. We demand the Democrats in the Senate aggressively filibuster any nominees who support Citizens United or who oppose the rights of women, immigrants and the poor. This is non-negotiable. \\nBut of course other liberals are still in the “shock and disbelief” stage. As I have stated before, Americans were more emotionally invested in this election than they had been in any election in decades, and the aftermath has not been pretty. \\nThis has been particularly true on college campuses all over the nation. According to the New York Post , college administrators have been going to extraordinary lengths to soothe the deep emotional pain that many of their students are experiencing… \\u200aThe University of Michigan offered its traumatized students coloring books and Play-Doh to calm them. (Are its students in college or kindergarten?) \\u200aThe University of Kansas reminded its stressed-out kids that therapy dogs, a regular campus feature, were available. \\u200aCornell University, an Ivy League school, held a campus-wide “cry-in,” with officials handing out tissues and hot chocolate. \\u200aTufts University offered its devastated students arts and crafts sessions. (OK, not kindergarten — more like summer camp.) \\u200aAt campuses from elite Yale to Connecticut to Iowa and beyond, professors canceled classes and/or exams — either because students asked or because instructors were too distraught to teach. \\nAnd it is also being reported that suicide hotlines are ringing off the hook all over the nation. \\nWe have never seen anything like this ever before, and I have a feeling that this “Not My President” movement is going to absolutely dwarf the “Occupy Wall Street” and “Black Lives Matter” movements. And considering the very high levels of anger, frustration and pain that these radical leftists are feeling, it is easy to see how this movement could become very violent. \\nMany patriots, conservatives and Christians were hoping that Donald Trump could bring America together and lead us into a new era of peace and prosperity, but the radical left already hates Trump more than any president that has ever come before him. \\nIt isn’t going to take much to push the radical left over the edge, and if that happens we could see endless chaos, violence and civil unrest for the next four years.'"}, "time": 1742628448.8085752}