{"duration": 0.0407717227935791, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. Primaries in six states played out even as the presidential nominations seemed to be set. Hillary Clinton had already hit the delegate threshold to secure the Democratic nomination, but cemented her standing with a wins in New Jersey, New Mexico and South Dakota. Bernie Sanders vowed to fight on, hoping a win in California might prompt superdelegates to defect to him. ______ 2. Donald Trump  said his comments about a Hispanic judge  —   suggesting he would not be able to handle a case against the   Trump University fairly because of his heritage  —   had been misconstrued. Mr. Trump spoke after Speaker Paul Ryan, above, called Mr. Trump’s criticism “the textbook definition of a racist comment” and “absolutely unacceptable. ” ______ 3. India’s prime minister, Narendra Modi, goaded by concern over a possible Trump presidency, showcased an unusually cooperative approach on his second visit to the White House in two years. He took crucial steps toward ratifying the Paris climate accord and finishing the purchase of nuclear reactors, with a military deal to come. “Modi wants to get as much as he can out of Obama’s last months in office,” an analyst said. ______ 4. More than 350, 000 people have signed a petition for the recall of a California judge who sentenced this Stanford University student, Brock Turner, to only six months in jail after he was convicted of sexual assault. The victim’s   cry for justice, published after the sentencing, has been viewed more than 8. 5 million times. ______ 5. Muhammad Ali died just as a foundation devoted to the photographer Gordon Parks was preparing to exhibit some of his images of the boxer. The new show features previously unseen photos of Ali taken on assignment for Life magazine between 1966 and 1970. Above, Ali praying before a bout in London. ______ 6. J. K. Rowling pleaded with fans to keep the plot twists in “Harry Potter and the Cursed Child” secret. The play, which begins at the point where her   series ends, opened in previews in London. No spoilers here: “Ron still provides comic relief,” our reporter says, “Hermione remains cerebral and slightly bossy and Harry tries as hard as he can but doesn’t quite live up to his own expectations. ” ______ 7. In a rare victory against prison abuses, five New York City correction officers were convicted of all charges in the beating of a Rikers Island inmate in 2012. The inmate testified that he was punched, kicked and stomped, and spat up blood for months. Several more accused officers are to hear their verdict on Friday. “Regrettably, some people think of prisoners as less than human,” said a lawyer. ______ 8. The Syrian president, Bashar   swore to retake “every inch” of territory lost in six years of civil war. His defiant address offered no hope that he would back a revival of talks to find a political solution. Meanwhile, U. N. officials said the Syrian authorities had delayed approval for desperately needed food aid for civilians trapped in a   area near the capital. ______ 9. Finally, the cosmologist Stephen Hawking, who suffers from a form of Lou Gehrig’s disease, made a significant addition to his groundbreaking work on black holes. Working with two colleagues, he found that the essential properties of whatever falls into these cosmic pits may, after all, survive. Or, as he put it recently, black holes “are not the eternal prisons they were once thought. ” ______ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742562384.797179}