{"duration": 0.05035877227783203, "input_args": {"text": "'The biggest book of the summer isn’t a blockbuster thriller or a splashy celebrity memoir. It’s a play about a   wizard. The publication of “Harry Potter and the Cursed Child,” the eighth installment in J. K. Rowling’s   series, is being celebrated at more than 5, 000 bookstores and libraries across the country this weekend, with midnight release parties featuring costume contests, magic shows, wizard rock bands, live owls and butterbeer, the beverage of choice among young wizards. The elaborate rollout has all the flourishes that fans have come to expect for a new Harry Potter book. But for many nostalgic readers, this one feels different. “Cursed Child” is not a new novel, but a script of a play  —   a format that typically isn’t read for pleasure and almost never produces overnight best sellers. And unlike the previous seven books in the series, it was not written by Ms. Rowling herself. In a sense, “Cursed Child” is more like sanctioned fan fiction than a new work by a beloved writer. Ms. Rowling worked on the play’s plot with the playwright Jack Thorne and the director John Tiffany, and while she helped shape the story, she has made it abundantly clear that she did not write the script. The idea for the play, which explores Harry’s life as an adult and parent, didn’t originate with Ms. Rowling, either: She merely agreed to it when two theater producers proposed the concept. Which raises a sticky question: If Ms. Rowling didn’t conceive the play, or write it, is “Cursed Child” really a new Harry Potter story by J. K. Rowling? And if it isn’t, do Harry Potter fans even care? Many, apparently, do not. “J. K. Rowling’s involvement legitimizes it as canon, and the fact that other people collaborated on it doesn’t detract from that,” said Matt Maggiacomo, executive director of the Harry Potter Alliance, a nonprofit group that promotes literacy and other causes. Melissa Anelli, the author of “Harry, a History,” a book about the Harry Potter phenomenon, agreed that any story with Ms. Rowling’s blessing counts as a continuation of the tale  —   a view that many Potter fans seem to share, based on the vast number of preorders and the ecstatic response on social media to news that the play would be published. “The thing that we all always want most from her is a book, but if we’re getting the story in the form of a play, as long as she says it’s the real deal, we’re on board,” said Ms. Anelli, who is organizing a midnight release party for some 2, 000 fans at Geeky Con, a festival in Orlando, Fla. that will feature a costume ball and performances by wizard rock bands. But other Potter fans are skeptical, arguing that a story that didn’t spring from Ms. Rowling’s imagination just isn’t the same. “I’ve spoken to a lot of people who aren’t sure if they’re going to treat it as canon, because J. K. Rowling didn’t write it,” said Helen Haslam, who publishes Potter fan fiction at the website Wattpad. “I grew up with the books, I spent a lot of time in that world, and the idea of someone else adding to that is a little bit  . ” Some will skip it altogether. Sharanya Sharma, an elementary school teacher in Washington who fell under Harry Potter’s spell when she was 9, said she was satisfied when the series ended with “Harry Potter and the Deathly Hallows. ” “I worry that it would negatively affect my memories of what Harry Potter meant to me when I was growing up,” she said. “Sometimes I go back and reread Harry Potter as a nostalgic experience, and I’m not sure I want to ruin that. ” Though it’s been nearly a decade since Ms. Rowling ended her beloved series, devotion among   fans has never waned. While Ms. Rowling has moved on to writing adult fiction, she has continued to embellish the Potter universe, not just with material on her Pottermore website but also through public pronouncements about the characters. The fans’ fervor has been steadily fed by a stream of blockbuster movies, theme parks, new short stories about the wizarding world released on Pottermore, and now, “Cursed Child,” which picks up with a scene from the epilogue in “Deathly Hallows,” as a   Harry watches his own sons depart for Hogwarts. The play, which officially opens on Saturday in London, has already generated ecstatic praise from theater critics. It’s hard to imagine enthusiasm running as high for the unvarnished script, which could fall flat on the page without the elaborate staging and the emotional nuances of a performance. “I think there will be a lot of disappointment,” said John Granger, who has published several books of literary criticism about Harry Potter and dismissed the play as “franchise exploitation. ” Still, “Cursed Child”  —   which is being released at midnight on Saturday (just in time for Harry’s birthday Sunday)  —   is on track to be a blockbuster. Scholastic, Ms. Rowling’s American publisher, is printing 4. 5 million copies  —   a staggeringly large number, though it scarcely approaches the    run for “Deathly Hallows. ” Barnes  Noble reported that “Cursed Child” is the most heavily preordered book since “Deathly Hallows. ” On Amazon, “Cursed Child” has held steady at, or near, the top of the   list since publication was announced in February, making it the site’s   book so far this year. Some booksellers and librarians say that the story’s format could introduce young readers to the pleasures of reading drama for entertainment. While most high school students are exposed to classics by Shakespeare, Sophocles and Arthur Miller, children and teenagers rarely pick up plays for fun. “They’re going to discover how much their own imagination can add,” said Peter Glassman, the founder and owner of Books of Wonder in Manhattan, which will have live owls, jugglers and magicians at its midnight release party. Scholastic is hoping that readers will embrace the book, regardless of the form. “Play format, novel format, it’s still a story,” said Arthur A. Levine, the vice president and publisher of Arthur A. Levine Books, a Scholastic imprint that publishes Harry Potter. As the series, which has sold more than 450 million copies globally, has become an undisputed modern classic, Scholastic has capitalized by releasing new editions with revamped covers and illustrations. “They sell year after year after year, when a new generation discovers Harry Potter,” Mr. Levine said. “We try to keep giving them something new. ” This year, fans will get plenty. In November, Scholastic is publishing the screenplay for “Fantastic Beasts and Where to Find Them,” a coming movie that expands the Harry Potter universe to North America. Readers are already swooning, driving the screenplay to No. 34 on Friday on Amazon’s   list. Unlike “Cursed Child,” this script was written by Ms. Rowling herself.'"}, "time": 1742628493.2151408}