{"duration": 0.1664564609527588, "input_args": {"text": "\"Le datsan d'Aguinskoïé : plongée au cœur du bouddhisme russe Aguinskoïé est un petit village situé au sud du kraï de Transbaïkalie (près de 5 000 km à l'est de Moscou), bordé par le lac Baïkal à l'ouest et la Mongolie au sud. Quand on demande aux habitants s'ils considèrent que le village se trouve en Sibérie, ils répondent résolument : « Non, c'est le kraï de Transbaïkalie ». En Transbaïkalie, l'originalité régionale et la proximité de l'Orient transparaissent de toutes parts : dans le tintement délicat des clochettes qui enveloppe le datsan d'Aguinskoïé pour s'envoler vers les cimes des pins. Dans le vent poussiéreux qui se promène dans la steppe aux odeurs d'herbe séchée. Dans l'arôme des buuz frais (grands raviolis) de mouton, qui pénètre dans les rues du village à travers les portes des cafés. Pour la plupart des habitants de la Sibérie, Aguinskoïé est un point inconnu sur la carte. En revanche, pour les Bouriates, qui représentent la majorité de la population locale, ainsi que pour les bouddhistes de Transbaïkalie, mais aussi de Bouriatie, de la République de l'Altaï, de Mongolie et du Touva, Aguinskoïé est une maison où les anciens préservent les légendes et rites nationaux. Une maison où il est facile de prier et où l'on revient après de longs voyages. 1 Un endroit sous les pins « On nous laissera rentrer dans le datsan ? C'est tout de même un monastère, un lieu fermé. Les lamas voudront-ils nous rencontrer ? » , demandé-je à mon guide à l'entrée du datsan d'Aguinskoïé. « Certainement. Dans le bouddhisme, le lama est un enseignant, c'est le sens du mot en tibétain. On considère que le lama doit répondre aux questions et apporter conseil à tous ceux qui s'adressent à lui. Peu importe s'il s'agit d'un bouddhiste, d'un chrétien ou d'un représentant d'un autre culte » , répond mon compagnon Daba Dabaïev, lama, photographe et voyageur. Nous entrons dans le datsan d'Aguinskoïé, l'un des plus anciens de Sibérie : il a plus de 200 ans. Le père de Daba Dabaïev l'a amené au datsan d'Aguinskoïé dès qu'il a terminé le collège. Daba a d'abord étudié à l'Académie du datsan, à la faculté de philosophie bouddhiste, puis, en troisième année, il a opté pour la faculté de peinture avant de travailler ensuite comme photographe au datsan. Il a 30 ans. « Je suis arrivé ici à l'âge de 14 ans et je ne comprenais pas bien ce qu'était un datsan, ce qu'était le bouddhisme. La première année, je voulais fuir. J'avais beaucoup de cours, beaucoup de travail, il fallait obéir aux lamas plus âgés et exécuter leurs ordres, c'est la règle. Je rentrais à la maison pour les vacances, je ressentais une liberté que je n'oublierai sans doute jamais et pensais : « Je suis chez moi ! ». Deux ans plus tard, en arrivant en Khakassie, je me surprenais à penser : « Vivement que je rentre au datsan ». C'est ma maison » . Nous sommes installés dans le dougan (temple dans le bouddhisme tibétain, ndlr) le plus ancien et le plus beau du datsan d'Aguinskoïé, le dougan Devajine. Il est entouré de rangées de pins et de tambours sacrés qui contiennent entre cent et quatre cent mille prières. Les bouddhistes laïcs et les lamas du monastère tournent ces tambours dans le sens des aiguilles d'une montre, c'est l'une des formes de prière. À l'intérieur, le dougan est décoré de tableaux de Koless Sansara, de portraits de lamas respectés persécutés dans les années 1930 et d'une statue dorée de Bouddha. On ressent les traditions tibétaines, mais comme les premiers dougans furent bâtis par des maçons et charpentiers russes, des éléments de l'architecture russe sont également présents. Par exemple, les grandes fenêtres grillagées rappellent celles des terems (palais en bois, ndlr) des contes avec la lueur du jour tombant sur le plancher par taches de lumière chaude. Le musée régional d'Aguinskoïé porte le nom du chercheur orientaliste et voyageur Gombojab Tsybikov (1873 – 1930). Cet habitant d'un petit village bouriate aida en 1905 la revue National Geographic à se relever économiquement et à regagner sa notoriété mondiale. En 1899, Tsybikov part en mission de recherche pour la Société russe de géographie au Tibet central, dans sa capitale fermée Lhassa. À l'époque, aucun étranger à l'exception des citoyens chinois et mongols n'a le droit de se rendre au Tibet, ainsi Tsybikov voyage déguisé en pèlerin. La direction de la Société russe de géographie équipe le Bouriate d'une caméra portative Self-Worker, d'objectifs anastigmats Hertz et de plaques anglaises de la marque Empress. La photographie étant passible de la peine de mort dans la capitale tibétaine, Tsybikov utilise une ruse : il cache sa caméra dans le tambour portatif de prière qu'il garde tout le temps sur lui. En 1905, la revue National Geographic publie un reportage sur le Tibet. Gombojab Tsybikov et son collègue Ovche Norzounov, qui photographiait également Lhassa même en avoir averti Tsybikov, offrent les images à la revue. Au début du XXe siècle, parier sur la photographie assortie d'un petit texte est nouveau pour la revue. Cette décision s'avère payante : la revue peut ainsi survivre en temps de crise et trouve son style de présentation. Baigné par cette lumière, Daba est installé sur un banc et égrène le chapelet bouddhiste entre ses mains. Il porte une veste urbaine bordeaux dont la couleur rappelle en tout point la veste des lamas en peau de mouton. Daba voyage beaucoup à travers la Sibérie, mais reste toujours rattaché intérieurement, et même extérieurement, à sa maison, le datsan : en traversant les portes du temple pour sortir dans le grand monde, un lama reste toujours lama. 2 Coucher de soleil sur le bas-côté « Quitter Aguinskoïé ou partir en voyage ne veut pas dire qu'on rompt le lien avec nos racines , estime Daba. Le Dalaï Lama dit que pour atteindre la paix intérieure absolue et le bonheur, on doit se rendre dans un endroit qu'on ne connaît pas au moins une fois par an. Ainsi, le cerveau pourra évoluer ». Nous sommes installés avec Daba et son ami photographe et opérateur Boulat dans un café en bord de route et dégustons de délicieux buuz de beauf haché, plat national des Bouriates. Daba et Boulat parcourent depuis plusieurs années leur région natale et font des reportages et des films pour leur chaîne Travelman. Leur dernière réalisation est le court-métrage de fiction Nuusa ( « secret » en bouriate). « Les amis qui sont partis me demandent parfois : « Pourquoi restes-tu à Aguinskoïé ? Pars au plus vite, tant que tu n'es pas recouvert de racines » , raconte Boulat. Mais on ne peut pas fuir ses problèmes, tout est à l'intérieur de l'homme. Il faut voyager et regarder le monde alentour, mais il faut aussi savoir trouver l'inspiration pour travailler au datsan d'Aguinskoïé. Nous la trouvons ». Auteur : Anna Grouzdeva\""}, "time": 1742562034.7546687}