{"duration": 0.04746818542480469, "input_args": {"text": "'Share on Facebook \\nMoveOn.org is a George Soros NGO…and George Soros NGOs have nothing to do with charity or justice, and everything to do with political leverage, and in extreme cases government insurrection. \\nWe have seen Soros begin destructive movements to remove those he deems unsuitable to govern in a variety of countries, most recently in Ukraine, with the Soros sponsored Maidan coup. \\nNow it looks like Soros may be setting his sights on sabotaging the forthcoming Trump presidency. \\nWe do know, thanks to Wikileaks, that George Soros was a huge supporter of Hillary Clinton, as Hillary Clinton was always looking out of George Soros’ best interests. \\nWe are certain Trump’s victory is a bitter pill for globalist Soros to swallow. Between Putin and Trump, Soros may finally be starting to feel his power on the world stage falter. \\nWe will see if MoveOn.org’s call to protest has legs, or if it will gradually fizzle and fade, in much the same way we can only hope Soros will eventually do. \\nNBC’s Katy Tur said… \\n“It’s surreal in NYC. People are walking around like zombies with thousand yard stares.” \\nZerohedge reports … \\nSeemingly unwilling to accept the results of the democratic selection of the nation’s leader for the next four years, hundreds of grieving Hillary Clinton supporters – egged on by George Soros’ MoveOn.org – are laying siege to Trump Tower in New York City. Screaming “Fuck Donald Trump”, yelling “Not My President”, chanting “Pussy Grabs Back”, and burning the American flag, it appears these young millennials are just the kind of deplorables this country should be proud of… \\nMoveOn.org released this press release on Wednesday, calling on people to take to the streets: \\nAmericans to Come Together in Hundreds Peaceful Gatherings of Solidarity, Resistance, and Resolve Following Election Results \\nHundreds of Americans, dozens of organizations to gather peacefully outside the White House and in cities and towns nationwide to take a continued stand against misogyny, racism, Islamophobia, and xenophobia. \\nTonight, thousands of Americans will come together at hundreds of peaceful gatherings in cities and towns across the nation, including outside the White House, following the results of Tuesday’s presidential election. \\nThe gatherings – organized by MoveOn.org and allies – will affirm a continued rejection of Donald Trump’s bigotry, xenophobia, Islamophobia, and misogyny and demonstrate our resolve to fight together for the America we still believe is possible. \\nWithin two hours of the call-to-action, MoveOn members had created more than 200 gatherings nationwide, with the number continuing to grow on Wednesday afternoon. \\nWHAT: Hundreds of peaceful gatherings of solidarity, resistance, and resolve nationwide \\nWHEN / WHERE: Find local gatherings here . Major gatherings include in New York City’s Columbus Circle and outside the White House in Washington, DC . \\nRSVP: Please email press@moveon.org to confirm attendance. \\n“This is a disaster. We fought our hearts out to avert this reality. But now it’s here,” MoveOn.org staff wrote to members on Wednesday. “The new president-elect and many of his most prominent supporters have targeted, demeaned, and threatened millions of us—and millions of our friends, family, and loved ones. Both chambers of Congress remain in Republican hands. We are entering an era of profound and unprecedented challenge, a time of danger for our communities and our country. In this moment, we have to take care of ourselves, our families, and our friends—especially those of us who are on the front lines facing hate, including Latinos, women, immigrants, refugees, Black people, Muslims, LGBT Americans, and so many others. And we need to make it clear that we will continue to stand together.”'"}, "time": 1742563262.9764163}