{"duration": 0.12168383598327637, "input_args": {"text": "'WASHINGTON  —   Some of the current members of the Supreme Court had written books before they were nominated. Remember “Civil Procedure in Sweden,” by Justice Ruth Bader Ginsburg? Or “Regulation and Its Reform,” by Justice Stephen G. Breyer? Perhaps not. But a book by Judge Neil M. Gorsuch, President Trump’s pick for the Supreme Court, may make a more lasting impression. It is called “The Future of Assisted Suicide and Euthanasia,” and it opens a window into Judge Gorsuch’s thinking not only on those topics, which are interesting enough, but also on the relationship between them and abortion. The book, published in 2006, is ambitious, learned, balanced and unusually lucid, at ease in philosophy, law and empirical research. It discusses the Supreme Court’s abortion jurisprudence in detail, but Judge Gorsuch’s goal was not to critique those cases. He asked, rather, whether a constitutional right to abortion necessarily implies a right to assisted suicide and euthanasia. Sure, there are general statements about the value of human life, drawn from what Judge Gorsuch called “secular moral theory. ” “Human life is fundamentally and inherently valuable,” he wrote, adding that “the intentional taking of human life by private persons is always wrong. ” This led him to support existing laws barring assisted suicide and euthanasia. But that broad statement does not answer the question of whether a fetus is a human life in the sense that Judge Gorsuch meant, or where he stands on Roe v. Wade, the 1973 decision establishing a constitutional right to abortion. Asked about the book at his 2006 confirmation hearing, after President George W. Bush nominated him to the federal appeals court in Denver, Judge Gorsuch first said that his personal views did not affect his judicial work. “My writings, just to clarify, have been largely in defense of existing law, that is, they are consistent with the Supreme Court’s decisions in this area and existing law in most places,” he added. “So, I do not think there is actually much tension between my writings and anything that might come before the court. ” That is about right. In the book, Judge Gorsuch argued that bans on assisted suicide and euthanasia should be retained, based partly on his understanding of the limits of the constitutional logic of the Supreme Court’s abortion decisions. His account of Roe v. Wade, for instance, is straightforward. “Under Roe’s express holding,” Judge Gorsuch wrote, “a fetus does not qualify as a person. ” In a footnote, he described a contrary view from a 1986 dissent. Notably, it came from a mentor, Justice Byron R. White, for whom Judge Gorsuch worked as a law clerk in 1993 and 1994. “The right to terminate a pregnancy differs from the right to use contraceptives because the former involves the death of a person while the latter does not,” Judge Gorsuch wrote, describing his old boss’s views. The important point for Judge Gorsuch was that the debate over assisted suicide was different from the one over abortion, as there was no doubt that there was a person involved when suicide was at issue. The task there, he said, was balancing “the interests of those persons who wish to control the timing of their deaths and those vulnerable individuals whose lives may be taken without their consent due to mistake, abuse or pressure in a regime where assisted suicide is legal. ” Judge Gorsuch also worked for Justice Anthony M. Kennedy during his clerkship for Justice White, who had by then retired. As it happened, Judge Gorsuch arrived at the Supreme Court soon after another major abortion decision, Planned Parenthood of Southeastern Pennsylvania v. Casey, issued in 1992. In a carefully hedged statement that avoided reliance on firsthand knowledge, though he doubtless had some, Judge Gorsuch described the atmosphere at the court in the wake of the Casey decision. “Rumors persist,” Judge Gorsuch wrote, “of considerable acrimony among court members during deliberations in Casey, arising perhaps in part because Justice Kennedy reportedly switched his vote after the court’s conference on the case, thereby altering the outcome in the case. ” The Casey decision is generally said to have reaffirmed Roe’s core holding. In the book, Judge Gorsuch argued that the decision should be read narrowly, in an apparent attempt to limit its implications for a right to assisted suicide or euthanasia. He acknowledged that the controlling opinion in Casey  —   from Justices Kennedy, Sandra Day O’Connor and David H. Souter  —   contained sweeping language, and he quoted what he called its “mystery of life” passage, which is generally attributed to Justice Kennedy. “At the heart of liberty is the right to define one’s own concept of existence, of meaning, of the universe, and of the mystery of human life,” the joint opinion said. But the opinion also relied on a second and narrower ground, saying that respect for precedent  —   stare decisis, in legal Latin  —   required the court to follow Roe. Judge Gorsuch argued that the flowery stuff was an aside. “Usually, though not always, only the narrowest rationale is said to control future courts,” he wrote. “Casey may come to be dominantly read as a stare decisis decision  —   a ruling, in essence, that we must respect the abortion right out of traditional deference to settled law  —   rather than creating any new,   right to ‘define one’s concept of existence,’” Judge Gorsuch wrote. At bottom, then, Judge Gorsuch saw no necessary constitutional connection between a right to abortion and one to assisted suicide or euthanasia. But Justice Antonin Scalia, who died last year and whom Judge Gorsuch hopes to replace, said the questions were related, if only because the Constitution was silent about all of them. “We have now determined,” Justice Scalia said in a 2004 speech, “that liberties exist under the federal Constitution  —   the right to abortion, the right to homosexual sodomy  —   which were so little rooted in the traditions of the American people that they were criminal for 200 years. ” He added that his colleagues might be prepared to discover a right to assisted suicide in the Constitution. “We’re not ready to announce that right,” he said, sarcastically. “Check back with us. ”'"}, "time": 1742563165.7409558}