{"duration": 0.01606011390686035, "input_args": {"text": "'A number of iconic fashion designers are reportedly chomping at the bit for the chance to dress future First Lady Melania Trump for Inauguration Day. [New York socialite and philanthropist and Trump family friend Jean Shafiroff, who sits on the Couture Council of The Museum at New York’s Fashion Institute of Technology, took a poll to determine how interested designers were when asked their thoughts on dressing Mrs. Trump.  Shafiroff told the New York Post that Zac Posen, B. Michael America, Victor de Souza, and Zang Toi are among the designers who say they’d be willing to dress the First Lady  . “Any designer who dresses her will get enormous press,” Shafiroff told the outlet. The news comes after several   designers, including Tom Ford and Marc Jacobs, publicly declined to design clothing for Mrs. Trump. “‘I have no interest whatsoever in dressing Melania Trump,” Jacobs told WWD in November. Shortly after Trump’s victory in November, designer Sophie Theallet urged her colleagues in the fashion world not to design clothing for or associate with the new First Lady in any way. “The rhetoric of racism, sexism, and xenophobia unleashed by her husband’s presidential campaign are incompatible with the shared values we live by. I encourage my fellow designers to do the same,” she said. Designer Stefano Gabbana,   of fashion house Dolce  Gabbana, has proudly posted photos on his Instagram of Mrs. Trump wearing his clothing. The photos caused a stir on social media, and Gabbana fired back at critics threatening to boycott his designs. “How many stupid and ignorant people r on Instagram! !!” Gabbana wrote back in one of several comments taking aim at the negative posters. “Please if you don’t like my post unfollow me  …     thank you. ” Last month, designer Calvin Klein said “of course” he would dress Melania Trump. “She’s beautiful,” the designer told TMZ.   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742628594.27809}