{"duration": 0.11461782455444336, "input_args": {"text": "'The president of Russia, Vladimir V. Putin, articulated a possible legal strategy on Wednesday for scores of Russian athletes preparing to defend themselves in sports doping prosecutions: casting doubt on the chain of custody for their urine samples. “When we provided the test samples, there were no complaints,” Mr. Putin said, going on to describe the microscopic scratches on glass sample bottles that investigators said showed that Russia’s Federal Security Service had cracked into them to switch out the athletes’ incriminating urine. “If there was a problem with scratches of whatever kind, this should have been noted in the relevant reports, but there was nothing of this sort. In other words, these samples were stored somewhere, and we cannot be held responsible for the storage conditions,” he said. The scores of glass bottles in question from the 2014 Sochi Olympics  —   bottles thought to be   before last year’s scandal  —   have been stored by the International Olympic Committee in a secure lab in Switzerland for the last three years. All are being   by the committee. Its ultimate disciplinary decisions, unlikely to come before the spring, are expected to be followed by challenges in the Court of Arbitration for Sport. That could push deliberation into next year and further confuse the eligibility of Russian Olympians leading to the 2018 Winter Games in Pyeongchang, South Korea. Mr. Putin, who has been largely dismissive of the evidence exposing an elaborate Russian doping operation, also expressed respect for the World   Agency, the global antidoping regulator, and the investigations it had commissioned into Russia’s cheating. “We must pay heed to what this independent commission says, despite the shortcomings in its work,” he said, referring to a team led by the Canadian lawyer Richard McLaren that concluded in December that 1, 000 Russian athletes were involved in a   doping program. “We must pay heed to its work and its results, and to WADA’s demands, because we need to acknowledge that there are established and identified cases of doping here, and this is a totally unacceptable situation,” he said. Mr. Putin’s remarks  —   delivered in Krasnoyarsk, a city in eastern Siberia that is preparing to host the 2019 University Games  —   signaled a shift after months of rejecting the basic conclusions of Mr. McLaren’s inquiry. Regulators have said Russia must accept those conclusions or credibly rebut them to return to good standing in international competition. The Russian doping scandal upended global sports last year, months before the 2016 Olympics, when the nation’s former antidoping lab chief, Dr. Grigory Rodchenkov, delivered an insider’s account of Russia’s   conspiracy to drug surreptitiously and dominate global standings, most notably at the Sochi Olympics, where it controlled the   lab and had an opportunity to break into the bottles overnight. Since Dr. Rodchenkov spoke out and Mr. McLaren confirmed his story, Mr. Putin and Vitaly Mutko, Russia’s deputy prime minister and former sports minister, have delivered inconsistently conciliatory and defiant responses to the scandal. But with the I. O. C. having begun disciplinary proceedings for doping against 28 Russian Olympians who competed in Sochi, Mr. Putin’s remarks on Wednesday addressed specific facts about the case against his nation’s Olympians. Since leaving Sochi, the doping samples in question have been stored by the I. O. C. in a secure lab in Switzerland. And the University of Lausanne is collaborating with the committee in developing a methodology to scrutinize doping samples, according to Dr. Richard Budgett, the medical and scientific director of the I. O. C. “It has to be recorded extremely carefully. That’s why it’s taking a couple months,” Dr. Budgett said. While Mr. Putin referred to other shortcomings in the array of evidence assembled  —   including what he described as “inaccurate translations or inadequate evidence” presented by Mr. McLaren to international sports officials  —   his overall message on Wednesday was a broad acknowledgment of institutional failures. “Our existing antidoping monitoring system has not worked effectively, and this is our fault, and is something we need to admit and address directly,” Mr. Putin said. In December, top Russian sports officials acknowledged to The New York Times that “an institutional conspiracy” had implicated multiple employees of the government’s sports ministry. They insisted, however  —   as Mr. Putin repeated on Wednesday  —   that the schemes had not been supported by the state, which many officials defined as Mr. Putin and a few of his top associates. Mr. Putin’s remarks came one day after United States lawmakers called a congressional hearing, expressing outrage at Russia’s cheating and what they called global sports officials’ insufficient response to the scandal. “Exactly how far and who was involved  —   we don’t yet know,” Dr. Budgett, who testified at the hearing, said afterward. He acknowledged that Russia’s Federal Security Service had played a part and that Russia’s deputy sports minister had been dismissed for his involvement. “That’s what the commission is doing, getting to the bottom of who was involved within the Russian state and the Russian system. ”'"}, "time": 1742564384.3286316}