{"duration": 0.09230494499206543, "input_args": {"text": "'DB Feedbacker Claims He Was on B29s That Fire-Bombed Hiroshima and Nagasaki By Daily Bell Staff - November 18, 2016 \\nWell now!! i was a pilot of a B 29, on the raids of both Hiroshima and Nagasaki. i am 96 years old. Yes we firebombed these cities as well as Tokyo. But there were A bombs dropped on the two cities in question. –ALPHAMEG feedback to DB article \\nWe’ve written numerous articles referring to the Pentagon’s lies about its nuclear program – both today and over the past 65 years or so. Now someone (see excerpt above) steps forward in a feedback to claim that indeed the Pentagon, along with millions of pages of military history, has not been telling the truth about Hiroshima and Nagasaki. \\nThe feedback comes in response to our article, “If Trump Wants to Fix the ‘Disaster’ of the Pentagon, He Should Clean Up Its Nuclear Lies,” here. \\nALPHAMEG seems to be a longtime poster but we have no idea if he is 96 years old, or if he participated in a firebombing raid on Hiroshima and Nagasaki. We have no idea if his feedback is a hoax, a joke or even a “mis-remembering.” \\nHowever, in response to his lengthy feedback, we wrote the following: \\nDo you realize the magnitude of the cover-up you are suggesting? Hiroshima and Nagasaki were fire-bombed? This negates 65 years of recorded history and changes the entire post-war narrative. Incredible! We have doubts about the severity of the radiation by the way. \\nRegardless of any nuclear detonations, the idea Hiroshima and Nagasaki were firebombed radically changes the military narrative of the war’s end. But we and others have regularly offered this alternative retelling. \\nEven a cursory investigation of America’s pre- and post-war nuclear program reveals a good many inconsistencies and outright lies. The Pentagon has manipulated its nuclear narrative from the very beginning, and so presumably have other countries who joined in later. You can see some of the articles we’ve written on elements of the Pentagon’s apparent nuclear fiction here, here and here . \\nWe would invite ALPHAMEG to send us a feedback elaborating on his fire-bombing raids over Hiroshima and Nagasaki. Additionally, we would invite anyone else who has knowledge of these raids, or apparently participated in them or was involved with the Pentagon’s nuclear program in the early days, to write to us as well. \\nThe early days of the Pentagon’s nuclear program, especially, have surely not been properly related. Instead, we have been subject to reams of propaganda and obfuscation. This is especially sad when we consider how many millions of school-children in the 20th century spent time practicing ducking beneath their desks so they would know how to take shelter in case of a nearby atomic explosion. \\nOf course the ramifications are far larger. The threat of nuclear warfare has profoundly shaped the psychology of billions of people and reshaped world history. If things are not as they seem, if the Pentagon and US government have substituted – at least in some cases – PR hype for truth-telling, we should do our best to find out more. It’s a most important effort. \\nConclusion: Only once we know, can we can make informed decisions about our place in the world – and understand more clearly how our society generally operates, and what can be done to change it for the better.'"}, "time": 1742561896.2692907}