{"duration": 0.13829421997070312, "input_args": {"text": "'For this Sunday’s Arts and Leisure section, I profiled John Mayer, the    singer, songwriter and guitar virtuoso, who also happens to be a prodigious talker  —   for better or worse. In 2010, a run of   interviews changed the course of his career as both a musician and a celebrity. “Only recently do I make decisions about putting a record or a video out that aren’t saddled with guilt,” he said this month in Los Angeles. “I feel like I have a) done the work and b) been out long enough so that people can believe I’ve done the work. ” He added: “It took me five years to go, ‘O. K. come on, let’s go back to the party. You’re not going to make a fool of yourself. ’” As Mr. Mayer prepped for the release next month of his new album, “The Search for Everything,” which he hopes will be return to the pop mainstream, I trailed him between the recording studio and a shoot for a music video, a frenetic four days capped by an additional   interview over dinner. Below are some additional edited excerpts from our hours of conversation. (You can read the full story here.) “Your No. 1 Google result is a certain thing, but you’ve got to do something bigger than that to knock it off of first place. For me, when I was at my most popular, I maligned myself. It’s a very interesting thing because if, when you mellow out in your life, it’s the wrong time . .. I think a lot of people’s last impression of me is outdated. “As I autopsy that part of my life, it turns out that I was under the impression that I was a bigger star than I was. I appreciate that there was a market correction. I actually really do. There was a market correction and I’m probably about as big as I should be. ” [He quickly revised this statement.] “I’d like to be a little bigger. ” “My brother just had a baby. That’ll rattle you, man. I’m looking at these pictures of him giving her a bath when I’m lying in a hotel penthouse in Hollywood and it’s almost a cliché. The oxytocin flows freely in my brain when I see that stuff. “[For me,] everything anatomically and chemically is healthy. It works. All the mechanisms are in place. It’s just the life that I have, which is fabulous  —   it’s just a bit more time on the International Space Station. Don’t ever let me give you the sense that I don’t love being on the International Space Station. It’s a pretty cool reason why you haven’t settled down  —   because you’re an astronaut. I’ve never hated it. Sometimes I get upset at the way that it is, but the real question is: Will the appearance of this job prevent what I’m absolutely entitled to psychologically? That’s the scary part. “I’m still always going to be a kid from Fairfield, Conn. They don’t make rock stars in Fairfield, Conn. They don’t. They make good people who get a job, get married, they watch TV together, they start a life together and make other good people. ” “I live for FedEx tracking numbers. I have a FedEx tracking number that’s so hot right now I’ll be watching it all night like Norad tracking Santa Claus. It’s from Japan, it’s getting here tomorrow. But [my stuff] gets held up in customs a lot because it’s so much Japanese clothing that customs is like, ‘What store is this going to?’ Like, no, it’s a person. ‘It can’t be going to a person, this is too much commercial value. ’” “‘Your Body Is a Wonderland’ lives so much in its own atmosphere that it’s like it’s been handed to me by some other person. There was a time where I didn’t want to play it, where I took it very personally that people were making jokes about it. Now I go: ‘It’s kind of cool to have one.’ I don’t know if you’ve made it if you don’t have the one [thing] that the least initiated person can yell at you when they see you. Dave Chappelle has Rick James, you know?” “We live in a time right now where the message will be judged against the messenger. There are times when I say to myself, ‘I don’t have the right to.’ Because I haven’t introduced myself to the world or placed myself as a mouthpiece in that way, I guess I shied away from it. ” “I had the most incredible time there and I learned a lot about who I used to be, because I used to have my heart out in front of me to every person I met. It didn’t matter who you were. I didn’t have time to make a value judgment. Everybody would get to look at it and touch it and put their gum out on it. And I would leave sad because I would go in with this huge, heavy beating heart for somebody to come put their arms around me and think I was great. And they just wouldn’t because you don’t do that at a party. “But I go through the therapy and I grow up and I dig out the things that were stuck in the fibers. [At the party,] I didn’t put my heart out to anybody that I didn’t know. I didn’t even bother going up to people that I didn’t know. The thing I told myself, which is so healthy  —   so please don’t tell me that I’m wrong  —   was: ‘She doesn’t care about me.’ It’s not my job to win them all over. ” “You are not included in something if you are a solo artist. You cannot feel inclusion. You cannot feel being under a wing. I had never before been out of that role where you are in the saddle and everything is your call and all eyes are on you. Since I was a teenager! I was just there as a piece of their puzzle. ” “Here’s what’ll happen: Some people will write, ‘I can’t front, John Mayer’s got moves, though.’ And some people are going to write, ‘John Mayer looks hideously dumb dancing.’ Here’s my prediction: The people who say that I have moves aren’t fans of mine and the people who say that I was hideous and made a fool of myself are   John Mayer fans. Because they just don’t see me that way. ”'"}, "time": 1742563481.1268153}