{"duration": 0.09511542320251465, "input_args": {"text": "'(1 fan) - Advertisement - \\n\"China installed 26 gigawatts (Gw) of renewable electric generation in the last two years,\" said Colleen Regan, Head of North American Environmental Markets and Cross-sector Research, Bloomberg New Energy Finance. She was presenting at Colorado State University\\'s 21 st Century Energy Transition Symposium. \\nAfterword, she confirmed that China installed 20 gigawatts of solar photovoltaic (PV) panels in the first 6 months of 2016, dwarfing the 4.3 Gw California installed in all of 2014. \\nRegan\\'s information demonstrates how rapidly renewable energy can overtake fossil fuel. Twenty Gw of capacity equals roughly 40, 500 megawatt coal-fired generating stations. It\\'s 8 times more than the 2.5 Gw of generating capacity at Colstrip, Montana\\'s mammoth mine-mouth coal-fired complex. \\nTo reduce human-caused climate change, Regan forecasts China will meet its 5 year goals of installing 26 Gw of wind and solar generation each year by 2020. By August 2016 China had cut 150 million metric tons of coal capacity, 60 percent of its annual target. \\nThis demolishes assumptions that increased coal sales to China will prop up bankrupt US coal companies, and dwindling coal tax and royalty revenues in coal producing states. China has moved away from the coal generating frenzy. Its cities have pollution levels 8 times higher than the maximums which trigger alarm in the US. And it can no longer afford to use 20% of its water to cool power plants. Horrible pollution day at the Great Wall License DMCA \\nHence, Chinese coal use dropped 2% in 2014 and 3% in 2015. That helped cause \"1,000 of China\\'s 11,000 coal mines to close,\" according to symposium presenter, Jennifer Turner, Director of the China Environment Forum at the Woodrow Wilson Center. There are \"now 1.3 million unemployed Chinese coal miners,\" she said. Chinese are preoccupied with finding them jobs rather than importing coal to help keep Montana\\'s 1900 coal miners employed. Consequently, rational investors who are cognizant of this reality should be less optimistic about developing coal export terminals on our west coast. \\nWhat about the 1.3 to 1.5 billion people still without electricity? Won\\'t they want to use cheap coal-fire electricity? They would if it were cheaper. But it\\'s not. So they are skipping fossil fuel technology--just like they skipped landline telephones--and are moving to renewable electric generation, much of it coming from distributed micro grids and battery storage. - Advertisement - \\nConfirmation that renewables are often cheaper came from Symposium panelist Cathy Woollums, Sr. Vice President, Environmental & Chief Environmental Counsel for Warren Buffett\\'s Berkshire Hathaway Energy. She said, \"MidAmerican Energy received Iowa Utilities Board approval to install 1000, 2 Megawatt Vestas wind turbines\" by 2019. It will ensure that Iowa--which now gets 35% of its electricity from the wind--will be running on 85% clean electrons by 2019, far ahead of Colorado\\'s 30% and Montana\\'s 15%. \\nMs. Woollums said, \"To do the 2 gigawatt project, MidAmerican did not ask to increase electricity rates\" for the 752,000 electric customers in Iowa, Illinois, Nebraska and South Dakota. She also said Mid-America was not planning to build natural gas facilities to integrate the wind into its system. The project--which rivals the capacity of Colstrip\\'s four largest coal-fired facilities--will generate more than $1.2 billion in landowner easement and property tax payments over the next 40 years. \\nThus, Montana and other coal-state businesses will have a tougher time competing in surrounding states whose utilities are incorporating more no-fuel-cost electricity (i.e., renewables) into their electricity generation mix. \\nMid-America has a 100% renewable energy vision. At least 17 US cities have committed to work toward 100% too, including: Fort Collins, Boulder, and Aspen, Colorado; Rochester, Minnesota; Greenberg, Kansas; and San Francisco, San Diego, and Santa Barbara, California. Palo Alto, California, and Burlington, Vermont are already there. \\nXcel Energy will close two Minnesota coal-fired plants by 2026. Xcel will add at least 1 Gw of cost-effective wind turbines by 2019, and 0.65 Gw of community solar gardens or other cost-effective solar installations by 2021. So, as Montana\\'s neighbors install more green electricity, it\\'ll be less able to export dirty electrons unless exports meet green energy requirements. - Advertisement - \\n2015 produced $349 billion in clean energy investment. Some believe that\\'s a \"war on coal\" that Trump and some Republicans can stop. Others know they\\'ll just \"make electricity more expensive again.\"'"}, "time": 1742561833.9684122}