{"duration": 0.03742694854736328, "input_args": {"text": "'Videos Aid Agencies in Iraq Brace for Exodus as Civilians Flee US Mosul Offensive The UN has reported six camps are ready to accept about 50,000 people, and 11 more camps are in the process of being readied. At the same time, the UN has warned that they don’t have the funding to support all of these refugees over the long run, and the Mosul battle looks to very much be the long run. | November 3, 2016 Be Sociable, Share! Civilians flee villages outside Mosul the day after Iraqi Kurdish forces launch an operation east of the Islamic State-held city in Iraq on Monday, Aug. 15, 2016. The Kurdish forces known as the Peshmerga say they have retaken 12 villages in the operation in an effort to encircle the city. (AP Photo/Susannah George) \\nAid agencies which have been trying to prepare for the huge influx of displaced persons from the city of Mosul are reporting the first arrivals of civilians who fled the surrounding towns , most arriving on foot, and many with nothing more than the clothing on their backs. \\nThe agencies are playing up the months of preparation they engaged in, but exactly how they will cope with what could easily be a million new refugees with very little assistance from either the Iraqi government or from the US-led coalition, is still up in the air. \\nThe UN has reported six camps are ready to accept about 50,000 people, and 11 more camps are in the process of being readied. At the same time, the UN has warned that they don’t have the funding to support all of these refugees over the long run, and the Mosul battle looks to very much be the long run. \\nIraq has warned civilians in Mosul against fleeing from the city, a warning that came after the US announced they intend to conduct air strikes against fleeing ISIS fighters. It’s unclear how many civilians will be able to “stay put” as they were ordered, but the expectations of an intense urban battle are likely to drive many to flee while they still can. \\nThis article originally appeared on Antiwar.com . Be Sociable, Share!'"}, "time": 1742562333.9954455}