{"duration": 0.027424335479736328, "input_args": {"text": "'Americans ripped from fantasy world ‘like babies from a womb’: By hatesec , on November 14th, 2016 \\nROANOKE, Va. — FBI agents claim two stoned American white men were “ripped like babies from a womb” following Tuesday’s election results. \\nInvestigators who have been working on the case since Wednesday said the men appeared paranoid and terrified, as if they had seen some horrible aspect. \\n“It was like they were just seeing the world for the first time,” the agent said. He called it “the 9/11 of their time”– a point of reference in their timeline of social consciousness beyond which no innocence can be returned. \\nOne of the guys was passed out in police custody, because he’s a pot-smoking CRIMINAL, but the other one was cool because he didn’t have weed on him, so he told Internet Chronicle how his world view changed: \\nI thought we’d come farther than this, man. I actually really thought we had come so far, we could get a career criminal elected into office over Archie Bunker. Turns out, I was wrong about a lot of things. Next time, I’m voting with my heart: I’m going Gary Johnson. Now he has a plan ! \\n“They’ll never forget how they remembered America’s paranoid, racist history extending as far back as the 1970s, when white nerds killed disco, for which we have already apologized profusely .” federal agent Smith said. “Nor will they forget how flimsy a candidate can be, who deletes subpoenaed emails on command for her corporate power-lords.” \\nInternet Chronicle linguistics analyst and hate philosopher Dr. Angstrom H. Troubadour believes in front loading attribution, and that blatant misuse of language itself led to the seemingly eternal crisis of political misunderstanding between the so-called Left and so-called Right. \\n“The words ‘liberal’ and ‘conservative’ don’t even have denotations anymore. They mean what people want them to mean,” Troubadour said. “These words are to be avoided at all cost.” \\nmakin money, makin money, makin money, makin money, makin money, makin money’s for the words. \\n[Editor’s note: Remember Trump’s CRAZY response when the 60 Minutes lady asked him how many more tax dollars would be spent drone striking weddings?] Share this article'"}, "time": 1742563122.428302}