{"duration": 0.07845473289489746, "input_args": {"text": "'Waking Times \\nNow that the establishment corporate and liberal media have declared open war on so-called ‘ fake news ,’ already rolling out plans to flag, censor, robotically restrict and demonetize the efforts of independent journalists, the world waits with bated breath to see exactly what form the control of information will take. \\nThe 24/7 talking heads on cable news are already repeating ad nauseam the ‘fake news’ talking points, as they do whenever there is a top-down agenda to push onto our supposedly free society. \\nIn this case: America is divided because of fake news, fake news is a dangerous threat to democracy, fake news looks just like real news and we need experts to tell us what’s what, if we don’t stop fake news then people will be misled, fake news causes confusion and disrupts society, facts have no meaning when there’s fake news, fake news is information warfare and needs to be treated like terrorism. \\nYou may be wondering, what, then, is real news? \\nHere’s an example, hot off the press. \\nAt the ongoing Standing Rock civil disobedience action in protest of the Dakota Access Pipeline, some 167 people were injured last night by militarized police forces who assaulted a bridge occupied by peaceful protestors including men, women, children and elderly persons. The temperature was well below freezing and for hours the police sprayed the crowd water cannons, fired many rounds of flash bang grenades, rubber bullets, tear gas, and used the LRAD acoustic weapon to disperse dissidents. \\nHere’s a video of the assault, from TYT . \\nDuring the assault, at least one elder was left in critical condition and it is reported that 13-year old girl suffered serious injuries when shot with a rubber bullet. \\nThis is happening in America, to Americans, by American police, which makes it quite newsworthy to Americans. \\nWe know without question, without even having to ask, that any crackdown on ‘fake news’ will not in any way apply to mainstream, corporate news sources such as the major newspapers and the major cable news networks. \\nA scan of ‘real news’ sources the morning after this major confrontation between police and resistors at Standing Rock reveals that stories like this, stories of resistance to corporate rule and government authoritarianism. \\nThese Sources Did Not Report On This: \\nCNN.com – Although the homepage of CNN features around a hundred stories, as of the time of this post, there was no mention whatsoever about the Standing Rock confrontation last night. \\nMSNBC.com – No mention whatsoever of this event on this mainstream news site. The top 6 posts at the time this article was written were all about Donald Trump, his cabinet picks, and how his administration was going to be terrible. \\nCBS News – No coverage of this story on the CBS News homepage. \\nDrudgeReport.com – This story has not been aggregated on the Drudge Report. \\nThese Sources Did Report on This: \\nFoxNews.com – The confrontation did make it the homepage of Fox, but not as a headline story. A short video was included, and the coverage was short and to the point.'"}, "time": 1742562621.1403787}