{"duration": 0.09437108039855957, "input_args": {"text": "'Comedy Central is set to debut a new weekly late night series, The President Show, that will see comedian Anthony Atamanuik play a parody President Donald Trump who will address the American people straight from the Oval Office. [The new show, created by Atamanuik, will premier on Thursday, April 27 and will reportedly run weekly if it becomes a ratings success.  “When I was first approached about this show I thought it would be about me, but on further thought, this makes way more sense,” Comedy Central president Kent Alterman said.  Comedy Central released a short video clip on Monday, which offers a glimpse of what audiences can expect from Atamanuik’s parody Trump.   . @LateNightDonald makes a surprising announcement. No, he’s not resigning. #PresidentShowpic. twitter.   —   The President Show (@PresidentShow) April 3, 2017,  “They unzipped my pants. They got on their knees, it was disgusting,” Atamanuik says, surrounded by a gaggle of reporters on Air Force One. “And I would get incredible ratings, some of the best ratings, huge ratings. Great ratings, ok? And they’d say, You want to be on the same channel as Noah Trevor, or whatever the guy’s name is. Who cares? Whatever. I said just invite me on and be nice. ” “I’ll have the best guests, the most beautiful women. It will be so funny, the most funny show,” he says. Atamanuik has made something of a career out of lampooning the president. The 30 Rock alum has performed his Trump impersonation on The View, CNN’s Newsroom, and on a   Trump vs. Bernie debate comedy tour that aired on Fusion. “Laughing at the President is a proud American tradition and we hope not to disappoint anyone in that department,” Atamanuik said in a statement. “But our political system is too broken for us to be content joking about one man, even though he is a disastrous silly little toddler boy. Mostly I’d just like to thank Comedy Central for giving us this platform to speak truth to power and if we’re lucky, end up in prison!”   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742563018.3487613}