{"duration": 0.1869947910308838, "input_args": {"text": "'ABOVE: Image by DonkeyHotey | CC BY 2.0 “We must develop a principled opposition to US imperialist policy [in Syria], without prevarications. The task falls on the left, but it cannot be a left divided by relativist consideration of “evil” on all sides…” W hy are they lying? Everything is being done to convince the public that Russia wants war; that it has annexed Ukraine; that it will attack Western Europe; that it will crush the Baltic states and Poland in its advance; that it’s committing war crimes in Syria; that Assad is a dictator and a butcher; that he has met peaceful demands for reform with brutal repression; that those fighting Assad are moderate rebels; that he is dropping barrel bombs on civilians. Why are they lying? Because the people don’t want war: they want jobs and bread. They will not agree to murder people who have done them no harm. They will consent to war if told they are under attack or that the war will save other people from genocide, rape, or other gross violations of human rights. The people are not interested in world domination, but the elite are. The people are, therefore, the enemy within. They must be persuaded to support the elite’s plan by perverting their decency. They must be made to cringe in fear. They must be made to believe that war—any war—will be defensive. This is the tactic of terrorists: terrorizing the population to obtain political ends. Hillary Clinton is lying: a no-fly zone in Syria will not “save lives.” In her last presidential debate, Clinton said that she wants a no-fly zone in Syria because it will “save lives”: “I’m going to continue to push for a no-fly zone and safe havens within Syria, not only to help protect the Syrians and prevent the constant outflow of refugees, but to, frankly, gain some leverage on both the Syrian government and the Russians.” The “leverage” she is seeking is Russian roulette with the planet. The chairman of the Joint Chiefs of Staff, General Dunford, noted in response that a no-fly zone in Syria might trigger a war with Russia, a nuclear power. Neither does she believe that a no-fly zone will save lives. In a closed-door speech to Goldman Sachs in 2013, Clinton said: “To have a no-fly zone you have to take out all of the air defense, many of which are located in populated areas. So our missiles, even if they are standoff missiles so we’re not putting our pilots at risk—you’re going to kill a lot of Syrians.” She knows what is at stake with a no-fly zone in Syria, and yet she tells us the opposite of what she knows will happen. In other words, she’s lying. What has changed Clinton’s mind since 2013? In 2013, there was no need to risk nuclear war over Syria. The so-called Free Syrian Army and assorted rebel groups were doing just fine in their offensive. In 2013, Syria stood alone, apart from some Iranian assistance. Until 2015, the Assad government was on its last breath, in retreat from the provinces of Raqqa, Aleppo, Hama, Idlib, and Latakia. By September 2015, the generous financial, military, and operational support by the United States, Qatar, Saudi Arabia, and Turkey to the “anti-Syrian coalition”– Islamic State, the Jabbat al-Nusra, the “Free Syrian Army”–was paying great dividends in advancing the destabilization of the Assad government. Soon, it could be expected that the symbolic head of Assad would sit on a silver platter in the White House, along with other colonial trophies. In their obsession to vilify Trump, who certainly deserves a lot of manure for his innumerable character flaws and vile political ideas, the Democrats and other liberals massing under Hillary’s “Big Tent”, have totally forgotten Hillary’s many crimes and also embraced the demonization of Putin and Russia, a different game altogether, and one with huge risks for humanity. The Orwellian assault on Russia is part of a filthy propaganda line floated by the warmongering Neocons Imperialists, of which Hillary is a card-carrying member. But self-righteous stupidity, and lopsided vision is the very trademark of Democratic party liberals and fellow water carriers. The saddest and most disturbing part of this abject campaign without precedent in its degree of filth even for American standards, is that even people who normally know better have embraced it, as this disgraceful cartoon by the normally lucid Dan Perkins (Tom Tomorrow comic strip) sadly proves. (Click image for best resolution). The humanitarian consequences for Syrians, however, were catastrophic. Fleeing the terror of a Syria in the clutches of cutthroat mercenary armies, refugees flooded Turkey, Jordan, Greece, and other countries, becoming human barter between Turkey and the European Union. The EU paid Turkey two billion euro to keep within its borders this human avalanche of “collateral damage.” That was the situation in September of 2015, when Russia, invited by the legitimate Syrian government, legitimately intervened in Syria with aircraft, support personnel, military advisors and equipment. In a year of Russian efforts to establish a premise for a peaceful solution in Syria by eliminating the militant rabble the Western chorus of “Assad must go” has mutated into a furious hiss of impotent rage. No one expects Assad to go now, unless the US comes up with a strategy to reverse the losses the Russian intervention has inflicted. In a year of Russian efforts to establish a premise for a peaceful solution in Syria by eliminating the militant rabble the Western chorus of “Assad must go” has mutated into a furious hiss of impotent rage. Enter Hillary’s reversal on the no-fly zone, which now, contrary to her judgment in 2013, will “save lives.” What is a no-fly zone? A no-fly zone is a coercive appropriation of the partial airspace of a sovereign country. It is the arbitrary creation of a demilitarized zone in the sky to prevent belligerent powers from flying in that air space. In Syria, the “belligerent power,” ironically, would be the internationally recognized legitimate Syrian government and its legitimate ally, Russia. According to former UN Secretary Boutros Boutros-Ghali, in an interview with John Pilger, a no-fly zone is illegal under international law. No-fly zones are post-Soviet inventions. The measure was never proposed, used, or authorized to this day by the UN Security Council until the Soviet Union virtually dissolved. This restraint was exercised by the US for the excellent reason that no such aggression on a sovereign state would have been tolerated without massive fuss at the UN Security Council and a bad rap for the US. There have been only three instances of a no-fly zone so far, all in the wake of the disappearance of the USSR: Iraq (1991-2003), Bosnia (1993-95), and Libya (2011), all initiated on the hypocritical pretense of “saving lives.” What is Plan B? I n one word: escalation. Apart from partitioning the air space of Syria, Plan B would provide for supplying, through Qatar or Saudi Arabia, man-portable air defense systems to the “moderate opposition,” including if it is acknowledged that the “moderate opposition” has allied itself openly with the al-Nusra front. Plan B has not been approved, but the media has floated a series of reports throughout October as being under consideration. On October 28, the New York Times published an astonishing conclusion about an aspect of the Obama administration’s strategy in Syria, though gently and benevolently worded. The Times indicated that it was being felt that Obama had insufficiently armed the “moderate opposition,” so that in Aleppo it had “no choice” but to partner with al-Qaeda affiliate Jabhat Fatah al-Sham (formerly al-Nusra) to fight off Putin and Assad. At the same time, Reuters noted that the Obama administration had formerly considered arming the “moderates” with anti-air missiles but was constrained by the fear that such weapons would fall in the hands of ”extremists.” Such reports suggest, rather boldly, I think, that “former restraint” might have to give way to greater support for the “moderate” militants, including if they partner with “extremists.” Thus, we arrive at a point of utter bewilderment in which we verify the absurdity of launching a War on Terror to end up fighting a War with Terror. Oppose US imperialism I t is good and proper that we should denounce Hillary Clinton for her vile record of regime change (in Honduras), crime of aggression (Libya), threats to Russia and China, corruption, illegality, and abuse of power. She’s clearly unfit to be president of any decent country that calls itself democratic. However, fixating on her individual agency lets the policy off the hook. The US is not yet a banana republic, in which the patriarch of some rich landowning family becomes the patriarch-autocrat of a country. An intricate network of powerful interests, which determine the policy, rules the US, frantic to maintain global economic and military dominance. This ruling class selects the candidate who will best carry out the policy. Hillary Clinton will be the servant of the interests of the ruling class of which she is a member. She will be their president. So it’s the policy that must be opposed, and this policy is imperialist. We must develop a principled opposition to this policy, without prevarications. The task falls on the left, but it cannot be a left divided by relativist consideration of “evil” on all sides. However we may feel about the morality of governments in Russia, China, Syria, Iran, etc., one thing is clear: they did not launch a war on Iraq, opening the door to all the crimes that followed from that original crime. It is time to decide whether we want to live with things as they are or change them. And we must begin by changing them at home. NOTE: ALL IMAGE CAPTIONS, PULL QUOTES AND COMMENTARY BY THE EDITORS, NOT THE AUTHORS PLEASE COMMENT AND DEBATE DIRECTLY ON OUR FACEBOOK GROUP CLICK HERE ABOUT THE AUTHOR Luciana Bohne is co-founder of Film Criticism, a journal of cinema studies, and teaches at Edinboro University in Pennsylvania. She can be reached Note to Commenters Due to severe hacking attacks in the recent past that brought our site down for up to 11 days with considerable loss of circulation, we exercise extreme caution in the comments we publish, as the comment box has been one of the main arteries to inject malicious code. Because of that comments may not appear immediately, but rest assured that if you are a legitimate commenter your opinion will be published within 24 hours. If your comment fails to appear, and you wish to reach us directly, send us a mail at: editor@greanvillepost.com \\nWe apologize for this inconvenience. \\nWhat will it take to bring America to live according to its own propaganda? =SUBSCRIBE TODAY! NOTHING TO LOSE, EVERYTHING TO GAIN.= free • safe • invaluable If you appreciate our articles, do the right thing and let us know by subscribing. It’s free and it implies no obligation to you— ever. We just want to have a way to reach our most loyal readers on important occasions when their input is necessary. In return you get our email newsletter compiling the best of The Greanville Post several times a week.'"}, "time": 1742561753.2106333}