{"duration": 0.1286168098449707, "input_args": {"text": "'Roger Ailes, the chairman of Fox News, was accused on Wednesday of forcing out a prominent female anchor after she refused his sexual advances and complained to him about persistent harassment in the newsroom, a startling accusation against perhaps the most powerful man in television news. In a lawsuit, the anchor, Gretchen Carlson, a longtime Fox employee who left the network last month, portrays Mr. Ailes as a loutish and serial sexual harasser, accusing him of ogling her in his office, calling her “sexy,” and describes a boys’ club environment at the network. Her charges  —   including the accusation that Mr. Ailes explicitly asked Ms. Carlson for a sexual relationship during a meeting in his office  —   amounted to an almost unprecedented public attack on Mr. Ailes, a towering figure in media and Republican politics who typically enjoys absolute loyalty from his employees. Late Wednesday, the parent company of Fox News, 21st Century Fox, issued a measured statement, saying it had “full confidence’’ in Mr. Ailes, but had initiated an internal review of Ms. Carlson’s charges. “We take these matters seriously,” the company said. Mr. Ailes, in a separate statement, was far less temperate. “Gretchen Carlson’s allegations are false,” he wrote. “This is a retaliatory suit for the network’s decision not to renew her contract,” which he attributed to ratings he called “disappointingly low. ’’ He added: “This defamatory lawsuit is not only offensive, it is wholly without merit and will be defended vigorously. ” The suit arrives at a complex moment for Mr. Ailes, who is facing new challenges to the television empire that he has overseen, with   control and huge success, for two decades. While he retains the support of his corporate boss, Rupert Murdoch, Mr. Ailes, 76, has sometimes clashed with Mr. Murdoch’s sons, James and Lachlan, who have ascended to the most senior leadership roles at the company. And Fox News, while still enjoying high ratings, is facing renewed competition from CNN, which has been closing what was long an enormous gap in ratings between the networks. (In one important demographic, CNN has narrowed its deficit with Fox News to its slimmest figure in eight years.) The network has also been less of a dominant political force in this year’s presidential election, with the Republican nominee, Donald J. Trump, publicly clashing with the network and some of its anchors, a sharp contrast from previous election cycles. Ms. Carlson, 50, filed her lawsuit in Superior Court in New Jersey, where Mr. Ailes maintains a residence. She contends that during a meeting last fall to discuss her concerns that she was being treated unfairly, Mr. Ailes told her: “I think you and I should have had a sexual relationship a long time ago and then you’d be good and better and I’d be good and better. ” When she rebuffed him, the lawsuit claims, Mr. Ailes retaliated by reducing Ms. Carlson’s salary, curtailing her   appearances and, to her surprise, declining to renew her contract last month. Ms. Carlson’s suit, filed by the law firm Smith Mullin of Montclair, N. J. names Mr. Ailes as the sole defendant and seeks a variety of compensatory damages. Her lead lawyer, Nancy Erika Smith, said in an interview that Ms. Carlson’s grievance was with Mr. Ailes personally, not the Fox network. “We were considering taking action before she was terminated,” Ms. Smith said. “The firing sort of pulled the trigger for us. ” Mr. Ailes is known as a fierce public relations warrior who can be ruthless with enemies. Ms. Carlson can be   on air, but she is working with a formidable team: Ms. Smith once brought a sexual harassment suit against a former acting governor of New Jersey, and Ms. Carlson’s husband, Casey Close, is a powerful sports agent known for tenacious negotiating on behalf of clients like Derek Jeter. Ms. Smith, the lawyer, said that several women had contacted her saying they had similar experiences with Mr. Ailes, although she declined to name them. A 2014 biography of Mr. Ailes, by the journalist Gabriel Sherman, “The Loudest Voice in the Room,’’ recounted an episode in the 1980s, when Mr. Ailes was at NBC, involving a woman named Randi Harrison who said he offered her an extra $100 a week in salary in exchange for having sex with him “whenever I want. ” (Fox News denied the claim at the time Ms. Harrison corroborated the account in a phone interview on Wednesday.) Ms. Carlson joined Fox News in 2005. In her suit, Ms. Carlson, who once walked off a Fox set as her   made jokes about women, portrays a culture at the network where casual sexism is tolerated, part of a broader Ailes news aesthetic of bombastic coverage and physically attractive talent. In 2009, Ms. Carlson contends, she complained to the network about her   on the popular “Fox  Friends” morning show, Steve Doocy, saying he belittled her on the set, openly mocked her among colleagues and once tried to shush her during a live broadcast by pulling down her arm. Mr. Ailes, the lawsuit states, responded by calling Ms. Carlson a “man hater” and saying “she needed to learn to ‘get along with the boys.’ ” Ms. Carlson claims that because of her complaints, Mr. Ailes eventually reassigned her from “Fox  Friends,” in 2013, to a less prestigious slot. Until last month, Ms. Carlson was still hosting that program, “The Real Story With Gretchen Carlson,” which is broadcast at 2 p. m. on the network. The show had consistently won its time slot, averaging 1. 1 million viewers in recent months. But it was the network’s   daytime program among a crucial advertising demographic, raising concerns at Fox News that it was losing ground to competition from CNN. Mr. Ailes has minted stars like Bill O’Reilly and Megyn Kelly, who now host the two   shows in cable news. And he established Fox News as a powerful force in Republican politics and a major profit center for Mr. Murdoch’s media empire. Even Ms. Carlson has had kind words for Mr. Ailes. In a book published last year, “Getting Real,” Ms. Carlson described Mr. Ailes as “the most accessible boss I’ve ever worked for,” and thanked him for encouraging her career. Shelley Ross, a longtime TV news executive, has been quoted as saying Mr. Ailes used inappropriate comments with her during a job interview. In an email on Wednesday, she played down that incident and praised Mr. Ailes. “I have had many bosses throughout my career Roger turned out to be one of my favorites,” she wrote, adding, “If you want to expose disgusting immoral behavior in network and cable news, I have much better candidates about whom you could write. ” Ms. Carlson’s announcement of her lawsuit on Wednesday was carefully coordinated. A public relations firm distributed copies of the complaint to reporters across a variety of disciplines. Shortly afterward, on Twitter, Ms. Carlson offered thanks for an “outpouring of support” and introduced a hashtag: #StandWithGretchen. By the afternoon, a link to her lawsuit was prominently posted on her personal website. The public nature of the suit was unusual, some legal experts said, since typically such suits are settled privately. “The fact that it isn’t proceeding along that trajectory suggests that Carlson had an interest in seeing these allegations brought forward in the public forum,” said Debra Katz, a lawyer who specializes in sexual harassment cases.'"}, "time": 1742563637.8621552}