{"duration": 0.12073206901550293, "input_args": {"text": "'Financial Markets , Market Manipulation , U.S. Economy accounting fraud , Elon Musk , Tesla , TSLA admin \\nTesla created massive confusion in the financial reporting and analyst community by allegedly coming clean and report actual GAAP quarterly financial results for its 3rd quarter. But of course, just like the entire U.S. Banana Republic, the use of extreme obfuscation, deceit, propaganda and lies once again is the norm with Tesla’s quarterly report. \\nTSLA’s use of revenue recognition, deferred revenue and operating leases and its definition of “free cash flow” are enough to create a dedicated forensic accounting case study at the University of Chicago Graduate School of Business, where I did indeed nearly ace a forensic accounting course. \\nI don’t have enough time to lay out all of specifics and I’m not getting paid to write this blog post – but suffice it to say that several items in Tesla’s financials this quarter serve as big red flag warning flares. Of course, the market probably won’t care, as it seems that the market cap of a company’s stock is directly proportional to the grandiosity of the Company’s accounting abuse and fraud. And there’s no one in DC to enforce the laws already in place that are designed to prevent this fraud because the guys running these companies make substantial contributions to the Establishment politicians – just ask Jeff Bezos and Hillary Clinton. \\nBut I’ll point out some of the glaring problems in TSLA’s “GAAP” accounting based on cursory sleuthing. \\nFirst and foremost, in his description of the results for the quarter, Musk stated that “residual lease risk” exposure was 32% of deliveries, down from 36% in Q2. But this is a highly deceptive metric. IN FACT , deferred revenue as a percentage of total revenue for the quarter soared to 61.4% from 44% in Q2. Deferred revenue is the amount of revenue that is subject to “residual risk” from leasing financing. This number is found on the liability side of the balance sheet. The deferred revenue liability account went from $558 million in Q2 to $1.4 billion in Q3. This is a huge jump in amount of risk-infused lease-based financing used to generate sales. \\nIn and of itself, using deferred revenue accounting to this degree is highly subjective and susceptible to fraudulent risk assumptions. But the fact that Musk tries to mask the truth by using a bogus metric to make it seem like TSLA’s exposure to the residual risk embedded in the profoundly questionable leases used to generate revenues and unit sales is a loud signal that there’s fraud embedded in TSLA’s “GAAP” financials. \\nWhen you look at what is being reported as “GAAP operating income” consider that a huge proportion of that income is subject to the risk of coming back at the company in form of “one-time” GAAP charges which result from having to reverse out a large portion of the “GAAP” revenues when the value attached to the cars that will likely come flying back at TSLA when the leases expire is substantially lower than the amount guaranteed by TSLA. This “GAAP” presentation makes a farce of bona fide accounting standards. \\nAnother huge red flag is the huge jump in accounts payable. In June, accounts payable were 87% of revenues. But by September, accounts payable were more than 100% of revenues. The only reason TSLA would stretch out its payables like this is if it needed the cash. Not paying bills for a company like TSLA is a source of free financing. But this is an extreme slow-down in bill payments. There’s no way to know for sure what’s going on, but something is wrong. \\nA third huge red flag is the way in which Musk throws around the term “free cash flow.” His definition is just as fraudulent as Amazon.con’s definition. At this point in time, because TSLA has only released an 8k which does not contain an GAAP statement of cash flows, there’s no way to know the amount of free or negative free cash flow attributable to TSLA’s operations. That is, “free cash flow” in the context of the deceitful manner in which TSLA’s financials are presented. \\nHaving said that, Musk states in the 8k that TSLA generated “positive free cash flow.” No, Elon, you did not. Buried in the 8k is a section titled, “selected cash flow information.” He lays out his definition of “free cash flow” showing $176 million defined as cash flows provided by operating activities less capex. The GAAP definition of free cash flow, however, also includes debt repayment and other sundry items that drain cash. We won’t know the full extent of these items until the 10Q is released. \\nHowever, TSLA reported that it payed down $178 million on its borrowing facilities. Using GAAP free cash flow, this takes Elon free cash flow negative. Furthermore, if TSLA had maintained accounts payable at 86% of revenues, this would have sucked another $324 million of cash from TSLA’s operations, leaving the Company with a free cash flow deficit of $326 million. \\nThere’s a lot more going on with TSLA’s operations that is deceitful, if not outright fraudulent. This is just the “low hanging fruit.” At some point the capital markets will stop funding this fraud and that’s when the fun begins. Of course, by that time insiders will have sucked $100’s of millions of wealth out this Company that will never be retrievable. In just the last 12 months, insiders have unloaded 4.1 million shares, or roughly $860 million worth of stock. Oh wait, there was one open market purchase of stock by an insider of a whopping 1,394 shares. \\nIt’s my view the idiotic shareholders who give money to TSLA deserve what they’ll get eventually. But then again, many of them are sheeple who have placed trust in financial fiduciaries, like pension managers and investment advisors, to invest their savings. Share this:'"}, "time": 1742561910.0343478}