{"duration": 0.1483297348022461, "input_args": {"text": "'Email \\nPetty tyranny is alive and well in the home of the Magna Carta, thanks to a sweeping 2014 crime act. According to a new report from the Manifesto Club, a British civil-liberties organization, U.K. residents are being cited and fined — under the threat of criminal prosecution for failure to comply — for such offenses as not weeding their gardens, crying too loudly in their own homes, posting signs critical of local government policies, or even feeding wild birds. \\nThe Anti-social Behavior, Crime and Policing Act — passed at the urging of Theresa May, then home secretary and now prime minister — gave local officials the authority to issue Community Protection Notices (CPNs) to individuals 16 or older whenever officials believe that “the conduct of the individual … is having a detrimental effect, of a persistent and continuing nature, on the quality of life of those in the locality.” \\nAn official may issue a CPN on the spot, with only minimal warning to the individual being cited, for any offense he deems worthy, including things occurring within someone’s home. The CPN may demand that the cited individual either refrain from a particular activity or take specific actions, or both; and it may impose a fine of up to $124. In addition, if an individual refuses to comply with a CPN, he may be subjected to criminal prosecution and, if convicted, fined as much as $3,100. \\nCPNs, noted the Manifesto Club, do “not have to go through a magistrates’ court, and the standard of proof is significantly lower” than that for civil injunctions. “CPNs therefore give council officials unprecedented powers to direct the behavior of particular individuals, backed up by the force of the criminal law.” \\nThe group found that between October 2014 and October 2015, councils issued 3,943 CPNs and 9,546 CPN warnings. Between April 1, 2015, and December 31, 2015, there were 254 prosecutions for failure to comply with a CPN; 200 of those were successful. \\nA number of CPNs concerned activities taking place inside the home. Most were related to noises that could be heard in adjoining properties, including apartments. Shouting, swearing, and even crying that could be overheard were forbidden, as was “noise from televisions, sound equipment (stereo systems), radios, musical instruments, domestic appliances and power tools.” \\nFour councils issued CPNs prohibiting people from feeding birds in their gardens — this despite the fact that the Royal Society for the Protection of Birds actually encourages people to do just that. \\n“Such orders,” wrote the Manifesto Club, “undermine the privacy and sanctity of the home. If you cannot cry within your own house, or feed the birds in your garden, then the home has no significant meaning as a private space which is protected from the demands of the outer world.” Moreover, “The noise restrictions specified in these orders are unrealistically low: it is rare that TVs or music cannot be overheard to some extent in adjoining properties, and a certain background noise is part and parcel of living in a flat or terraced house. It may be that some of these individuals’ behavior would qualify as a statutory nuisance, but the issued CPNs set the conditions so low as to criminalize very ordinary behavior.” \\nMany, if not most, of the CPNs concerned the conditions of people’s yards, or “gardens” in British parlance. While some requested the removal of waste such as sofas, others were merely for gardens that were not kept up to the standards of the official issuing the CPN. Several councils issued CPNs to individuals unfortunate enough to have Japanese knotweed, an invasive plant species, pop up in their gardens. Should those individuals fail to eradicate the weed — a lengthy and difficult process requiring deep excavation — they could end up with criminal records. \\n“Councils can also use the measures to stifle criticism of council policy,” the Manifesto Club found. \\nA man in East Lancashire was threatened with a CPN ordering him to take down “inflammatory” signs that criticized a new housing development sanctioned by the council. The signs were on his back gate and on a tree on the edge of his property. The council’s community protection coordinator said: “This notice would ultimately give the council the ability to enter the land and remove the signs.” \\nCPNs have been used to force people to maintain their houses in keeping with others’ tastes. One homeowner was threatened with prosecution if he did not clean his windows both inside and out. Another was cited for keeping a bicycle collection on his property. \\nFurthermore, CPNs can require people to take expensive remedial actions. If an individual refuses to comply, the council can have the work performed and then bill the homeowner for it. Sources of overheard noise can be seized and destroyed. \\n“There appears to be little respect for the rights of home ownership or the notion that your house or garden are [sic] places that you can manage as you see fit,” observed the Manifesto Club. “Now it is the complainant outsider, and not the home owner or occupier, who appears to have the weight of authority and the balance of the law on their side.” \\nCouncils have also used CPNs to target particular individuals’ public behavior rather than going through the messy and public process of enacting general restrictions or obtaining civil injunctions. At least two councils have no laws against begging or public sleeping — one, in fact, was forced to withdraw a previous order prohibiting them because of public protest — but have used CPNs to enforce de facto bans on these activities. Some CPNs were issued to people who clearly needed help rather than prosecution, such as a homeless, mentally ill man who insisted on sleeping in the woods on hospital grounds but was harming no one. \\nIt’s not hard to figure out why local officials love CPNs: They can make up “laws” on the spot — some councils’ CPN forms don’t specify particular offenses but allow officers to write in whatever they please — and enforce them (and collect fines) without the bother of proving their case in court. \\n“It is a principle of law that more specific powers should be preferred to more general ones,” argued the Manifesto Club. “In fact, we are seeing the opposite: the more general CPN power is being preferred to more specific powers. A quick-fix, all-purpose measure is being used in areas where other powers could be used, which means that the punishment of offences such as neighbor nuisance is occurring beyond the purview of formal law and procedure.” \\nThe Manifesto Club, along with other civil-liberties organizations, is calling on the government to greatly curtail the use of CPNs. They also note that individuals can appeal CPNs in court and encourage more to do so. \\nThe good news, the group’s Josie Appleton told CNSNews.com , is that the CPN statute hasn’t become entrenched law yet. \\n“I think it’s very early days,” she said. “I’m hopeful.” Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742561996.9332526}