{"duration": 0.16355443000793457, "input_args": {"text": "'Beverly Hills, Calif.  —   More than five decades after they started, the Rolling Stones are a rock institution still running on intuition, impulse and chemistry. “Blue  Lonesome,” their new album, arrived as a happy accident  —   or, as Keith Richards said with his piratical cackle, “as if we’d been ordered to do it from some higher being. ” It started as a break from their own material, then suddenly turned into a   throwback: the Stones returning to their   days as a   cover band, knocking out songs live in the studio and recording an entire album in three days. “Blue  Lonesome” is the first studio album the Stones have made since “A Bigger Bang” in 2005 it’s due for release on Dec. 2. Talking about it put smiles on band members’ faces in an   string of interviews last month at the Four Seasons Hotel in Beverly Hills, a few days after the band’s jubilant set at the first weekend of the Desert Trip festival in Indio, Calif. “This album,” said the drummer, Charlie Watts, “is what I’ve always wanted the Stones to do. It’s what we do best and what we did when we first got together. ” In conversation, they play   roles: Mr. Watts as   and supportive, the guitarist Ronnie Wood still treating himself as a new band member (he joined in 1975) Mr. Richards as the    roots music fan and Mick Jagger as the extrovert and  . “Blue  Lonesome” is not the batch of new   songs that the band has been laboring over intermittently for years between bursts of touring, like the Latin American tour that concluded with an unprecedented concert in Havana and that has been the subject of two documentaries: “Olé Olé Olé” and “Havana Moon. ” In recent years, the band has tried to follow up on touring momentum with recording sessions. But the new songs, Mr. Jagger said with a frown, currently add up to “half an album. ” Mr. Wood said new songs need time to settle in. “It’s like putting it on top of the strainer and seeing what soaks through by the time you come back to them again,” he explained. “The lumps that are left on top after time has gone by, that’s what you make your dough out of. ” He added, “It wouldn’t surprise me if we recut them all again. It’s one of those things. ” Instead, “Blue  Lonesome” is a set of a dozen blues songs that were originally recorded, mostly in the   by titans like Howlin’ Wolf, Little Walter and Jimmy Reed. It was the breakthrough era of electric Chicago blues: a modernized, urbanized, amplified update of music from the Deep South. “These guys were basically inventing,” Mr. Richards said. “They had nothing to fall back on. They’d got these new guitars and amplifiers. They were all feeling their way through it. So there’s a feeling about that particular period of the blues which we could identify with, because you could hear the guys egging each other on and wondering where it’s going to go. ” The style was barely a decade old when it changed the lives of the English teenagers who would become the Rolling Stones, along with a generation of musicians worldwide. The rest is rock history, as the blues has been transplanted, revamped, venerated, repeatedly rediscovered and sometimes plundered, with its ideas ricocheting across cultural and geographical divides long before the more recent discussions about cultural appropriation. The blues became one of the foundations of rock, though its influence has been waning in recent decades. “Sounds have changed,” Mr. Jagger said. “What makes you excited now is not the same. In music, everything’s different. But the blues still have something about them that’s really good. I love all kinds of music, and I still listen to the blues. ” The songs for “Blue  Lonesome” were all on his iPod. Half a century on, playing vintage blues songs is an act of preservation and reclamation  —   and for the Rolling Stones, who have always been careful to credit their sources, a matter of continuity. “We’ve known these songs for 50 years,” Mr. Jagger said. “It is a learned idiom. It’s like me singing in Italian. If I’d been doing that for 50 years, you wouldn’t ask me, ‘How do you feel about singing in Italian?’ I don’t feel anything about singing in Italian, I always sang in Italian.’ It works most of the time. It’s like, you just have to go with it and suspend disbelief. “To me it’s a homage to all those people that we’ve always loved since we were kids,” he added. “I can see why people might find it vaguely not correct, but we’ve always done it. And the artists themselves, they never objected. ” “Blue  Lonesome” was recorded nearly a year ago, on the spur of the moment. While planning for recording sessions, Mr. Richards recalled, he emailed Mr. Wood, urging him to learn “Blue and Lonesome” by the   singer and harmonica player Little Walter. “If Keith says something like that, there’s a reason for it,” said Don Was, the Stones’ longtime  . “I don’t think he meant, ‘Go do this because we’re going to do a blues album.’ More like, ‘Let’s apply the principles of “Blue and Lonesome” to what we’re doing here. ’” The sessions took place in December at British Grove Studios, a West London complex owned by Mark Knopfler of Dire Straits. There, the Stones were recording together in a large open room with a setup generally used to record classical music: a tall,   contraption called a Decca tree, which uses overhead microphones to capture what a conductor hears. (The tree was devised at Decca Records, the Stones’ first label British Grove also has a vintage Decca mixing console, Mr. Was said.) It was a deliberately   configuration: not layering isolated instruments, but demanding an    live approach. The band was “a little unsure of the studio and the sound of it,” Mr. Richards recalled. So it fell back on the blues. “I looked at Ronnie and said, ‘Let’s put a hold on this new stuff while we try and figure things out and get the room warmed up. O. K.: ‘Blue and Lonesome.’ “And it comes out that suddenly the room’s opened up and the sound is there,” Mr. Richards continued. “And then, ‘That was damned good, man!’ Mick turns around and says, ‘Let’s do Howlin’ Wolf’s “Commit a Crime”’  —   and it really just led from there. No preplanning, no real instigation. Suddenly Mick just jumped on this train that he’s so good at. ” Mr. Richards recalled thinking: “Keep rolling, keep rolling! I don’t care how many you do  —   just catch it while the man’s in the mood. ” He laughed. “It just bloody happened. That was the amazing thing and the beauty of it,” he said. At the end of the first session, the Stones had recorded five songs. “No one said, ‘We should do a blues album,’” Mr. Was said. “It’s like, when a guy’s throwing a   you don’t talk to him about it in the middle of the game. ” Still, Mr. Was suggested that Mr. Jagger choose more songs band members who didn’t know them learned them over a weekend. With further serendipity, Eric Clapton was also at British Grove, doing some mixing, and in the next session he ended up sitting in on two songs, joining the improvisational weave of guitars. Mr. Richards was happy to, as he said, “Just roll it, decide later what to do with it,” he said. “It was only at the end, when we’d got 12 tracks and Don Was and I were talking together, and Mick was there and he was saying, ‘This is an album. You can’t chop this up. ’” Mr. Wood recalled, “I got a text from Mick saying, ‘The blues tracks are really sounding good.’ And I thought, is this from the Jagger that I know? Because he never, never says that things are happening well. ” Mr. Jagger described the album as “an exercise in sprezzatura”  —   a term for hiding skillful effort behind seeming nonchalance. “You’ve got to concentrate, but it can’t sound like it’s difficult. And it doesn’t,” he said. The Stones tucked lifelong blues scholarship behind the kick and yowl of the music. As they delved into individual songs, the band praised the   studio musicians who forged the Chicago sound: guitarists like Howlin’ Wolf’s sideman Hubert Sumlin (with whom Mr. Richards shared regular jam sessions) and drummers like Freddy Below and Earl Phillips. “When I was doing my song choices, I was thinking about tempos, moods, keys, different emotions,” Mr. Jagger said. But feel came first. “They’ve still got to blow you away a bit. They’ve still got to be exciting. ” The songs on “Blue  Lonesome” are, deliberately,   choices rather than   war horses. The Jimmy Reed song, for instance, isn’t “Big Boss Man” but the spooky, echoey, melancholy “Little Rain. ” From Howlin’ Wolf, Mr. Jagger chose two tales of fierce, comic romantic strife and churning rhythm: “Just Like I Treat You” and “Commit a Crime. ” Little Walter’s songs  —   there are four on the album  —   fell naturally into Mr. Jagger’s vocal range and gave him a chance to play lots of harmonica. Many of the songs elude the regularity of   blues they add or skip beats, start vocals in unexpected places, lurch and leap.     have often flattened out those quirks, but the Stones maintain them. “It’s not like rock music or programmed drum music,” Mr. Jagger said. “It pulsates in a very weird way, where each bar is different. And that’s what’s interesting about this kind of music when it’s played properly. It has a swerve, and it has a dynamism about it. ” Mr. Jagger also noted that while the songs were recorded almost entirely in real time, the final mixes were painstaking. “I just looked back at the original records, and we wanted some of these moods,” he said. “Every track is different. We all thought it was going to be easy but it wasn’t. ” Still, after more than a decade between albums, “Blue  Lonesome” may have loosened up the Stones for their own new songs. Sessions for the next studio album are still in progress. “We did things after we’d done this and I’d say, ‘O. K. just play it! It’s only got three chords, just play it, stop thinking about it,’” Mr. Jagger said. “‘Just imagine this is a blues. ’”'"}, "time": 1742561722.4650261}