{"duration": 0.09169530868530273, "input_args": {"text": "'Email \\nMarch 11, 2011: A massive earthquake of 9.0 magnitude struck off the coast of Japan, triggering a devastating tsunami, which left parts of the country in utter shambles. Official reports claim that 15,891 people lost their lives, 6,152 were injured and 2,584 were reported missing. \\nVia Anonews SPONSORED LINKS \\nThis was the most powerful earthquake ever recorded to have struck Japan, and the fourth most powerful in the world, since modern record keeping began in 1900. [1] This earthquake was so intense in magnitude, that it shifted Honshu, the main island of Japan by an estimated eight feet and actually shifted the Earth’s axis by between four and ten inches! Scroll Down For Videos Below \\nJapan is a nation containing many nuclear reactors which produce roughly 30% of the nation’s electricity. [3] The majority of operable nuclear reactors are right along the coast, in one of the most seismically active areas on the entire planet! Map which shows the locations of Japan’s, reactor sights. Notice how they are along the coast, in perhaps the most seismically active location on the entire planet. \\nThe powerful tsunami caused complete devastation of three of the six nuclear reactors at the Fukushima Daiichi facility, the cores of which melted within the first three days. In November 2011, the Japanese Science Ministry reported that radioactive cesium had contaminated 11,580 square miles of the land surface of Japan, [4] with an additional 4,500 square miles contaminated. \\nThe destroyed reactor sites have been dumping hundreds of tons of radioactive waste into the Pacific Ocean, every single day for the past four years and the devastating results are now becoming plainly obvious. Radioactive cesium (an alkali metal) rapidly contaminates an ecosystem and poisons the entire food chain, and this waste offshoot has been detected in Japanese foodstuffs over a 200 mile radius of the Daiichi facility. [6] \\nCesium and other radioactive waste products are bioaccumulative, meaning that they accumulate in an organism at a rate faster than the organism can eliminate it. Of course the Japanese government and TEPCO (Tokyo Electric Power Company) have blatantly lied about the amount of radioactive waste that has been leaking into the Pacific, however, the devastating results have been impossible to ignore. \\nI’ve wondered since the beginning of this disaster-which has already shown to be far worse that the Chernobyl nuclear disaster in the Ukraine, in 1986-why the world’s top, leading scientists have not come together to figure out how to stop the leaking radiation. The reason is because no one knows how to deal with this catastrophe. \\nIn March of 2015, it was reported in the Times of London, that Akira Ono, the chief of the Fukushima power station admitted that the technology needed to decommission the three melted-down reactors does not exist, and he has no idea how it will be developed. [7] \\nMore recently, Naohiro Masuda, the decommissioning chief of the Fukushima Daiichi Decommissioning Company, also stated that the technology does not exist to remove the highly radioactive debris from the damaged reactors: \\nOno also claimed that decommissioning the plant by 2051 may be impossible without huge leaps in technological advancement. [8] It’s also been estimated that plutonium fallout has been 70,000 times greater than atomic bomb fallout in Japan! [9] \\nJapan has also seen a skyrocketing of childhood Cancer rates, particularly, thyroid Cancer. [10] As of August, 2013, TEPCO admitted that between “20 trillion to 40 trillion becquerels [11] of radioactive tritium may have leaked into the sea since the disaster.” [12] Since it’s been shown over and again, that TEPCO repeatedly lied and covered up the true extent of the disaster, that number is most likely far greater. \\nWhile official sources keep claiming that there is no danger from the leaking radiation, sea life all along the west coast of the US has been dying in alarming numbers, and many fish and sea creatures tested off the west coast have shown extremely high amounts of radioactivity, that far exceeds safe limits. In actuality though, there really are no “safe” limits of radiation. \\nThe Japan Times reported on Feb 25 th , 2015, that cesium and other radioactive waste was pouring from the reactor one site, directly into the ocean. [13] TEPCO did nothing to prevent the leak and simply ignored the problem for close to a year! [14] \\nThere has been a massive die-off of marine life along the west coast of the US, which has scientists “baffled.” Do you mean to tell me that scientists studying this death of the Pacific haven’t taken into account the possibility that it could be caused by the hundreds of tons of nuclear waste that has been pouring into the Pacific each day for the last four years? So few dare to admit the extent of damage caused by this disaster or the fact that it is forcing us to face the possibility of our own extinction. What happens when the planet’s largest body of water is rendered lifeless on a planet made up mostly of water? What happens when the radiation accumulates in the atmosphere and is spread throughout the world by the jet stream? Massive die-off of sea lions along the west coast has left scientists “baffled.” Might it have something to do with the hundreds of tons of radioactive waste that has been pouring into the Pacific each day for four years? \\nIn 2013, the Huffington Post reported that massive amounts of krill washed up along the west coast in a 250 mile stretch from Oregon to California. [15] Krill is an essential part of the ocean’s food chain. When marine life on the low end of the food chain dies off, the larger animals that feed on that marine life starve to death. Carcasses of dead sea lions and seals that were examined revealed high doses of radiation, [16] and yet, mainstream scientists remain “baffled.” This dead sea lion showed extremely high levels of radiation near its heart and liver. The Pacific Ocean is dying at an alarming rate, and no one seems to notice it, or, they simply put on the blinders and embrace abject denial. \\nIt has also been widely reported that massive amounts of starfish have appeared along the west coast that have literally turned to mush. USA Today reported on this, [17] and of course they claim that no one knows why; it’s a mystery. Might it have something to do with the fact that the Pacific has become a toxic, nuclear waste dump? Of course not, that’s just crazy, paranoid, tin-foil-hat talk. The level of cognitive dissonance that ensnares the minds of most people is truly staggering to me. USA Today headline from Dec, 2013. No one knows why? Might it have something to do with the fact that the Pacific Ocean has become the world’s largest, toxic waste dump? It’s also been reported that 98% of the sea floor of the Pacific is covered with dead sea life. [18] Not surprisingly, mainstream scientists blame this massive death of the Pacific on global warming. \\n“In the 24 years of this study, the past two years have been the biggest amounts of this detritus by far,” said marine biologist Christine Huffard, who works at the research station off of California. “Multiple other stations throughout the Pacific have seen similarly alarming increases.” [19] \\nThe feeble efforts of TEPCO and the Japanese government to stop the radioactive leaks, with ice walls, dams, and other paltry, makeshift remedies have been in vain. Nobody knows how to contain the radioactive leaks, so the Japanese govt. and TEPCO do the next best thing; they lie about it and downplay the dangers. Business as usual! \\nThe head of the National Cancer Research Center in Japan, reported in Feb, 2015, that Cancer rates have skyrocketed by 6,000% and that it was being “swept under the rug.” [20] It must be global warming causing this unprecedented rise in Cancer rates eh? In Jan, 2015, Japan’s nuclear regulator approved TEPCO’s ingenious plan to simply drain waste-water into the ocean. [21] \\nIn Nov, 2014, Ken Buesseler, of the Woods Hole Oceanographic Institution claimed: \\n“My biggest concern is what’s going on in Japan today, and how that might make its way across to our coast. We know it’s still leaking because we’re measuring higher levels off Japan to this day. Even just the basic question, ‘How much radioactivity was released at Fukushima ?’ I can’t answer that today. We may never be able to because of the lack of sampling, particularly in the ocean.” [22] \\nAn experienced, veteran sailor by the name of Ivan Macfadyen, who has sailed the Pacific taking part in races, stated in an interview that: \\n“It’s dead…for thousands of miles there was nothing [between US and Japan] like sailing in a dead sea…everything’s all gone. Just talking about it makes me feel like I want to cry. No birds, no fish, no sharks, no dolphins, no turtles, nothing.” [23] \\nThis is the legacy that humanity is leaving for their posterity; a dead world. Humanity has allowed itself to be ruled by a ruthless, psychopathic gang of parasites whose greed and insatiable lust for power knows no bounds. There really is no one to blame but ourselves. The information in this article is not even a scratch in the surface of the true magnitude of this nuclear disaster. The radiation will bioaccumulate in the ocean and atmosphere for centuries to come. Mankind is staring our very extinction in the face. This is an opportunity for humanity to face the force of our own destructiveness, and to come together as one family. Unfortunately, the average person’s thoughts seem to be firmly fixated on the sports scores, who’s blowing who in the latest, celebrity scandal or the latest pop culture fad. Unfortunately, the world’s masses suffer from a serious condition known as, Rectal-Cranial Inversion! \\nLet us also not forget the Deepwater Horizon disaster that occurred in the Gulf of Mexico, on April 20, 2010. Massive amounts of oil leaked into the gulf, and in the subsequent cleanup attempt, the well was capped which caused a crack in the seabed, causing extreme amounts of oil to pour into the gulf, killing marine life in droves and destroying the fishing industry in that region. A highly toxic and controversial dispersant called Corexit was dumped into the sea, and the results have been catastrophic. \\nFishermen have reported sea creatures being caught in the gulf that had lesions on their bodies and all sorts of other anomalies including mutated sea life, eyeless shrimp and ulcers Related Items:'"}, "time": 1742628518.2218542}