{"duration": 0.10145878791809082, "input_args": {"text": "'CDC Vaccine Whistleblower On Dumping EVIDENCE of AUTISM in the TRASH Posted on Tweet Home » Headlines » World News » CDC Vaccine Whistleblower On Dumping EVIDENCE of AUTISM in the TRASH \\nMore is at stake here than the danger of the MMR vaccine. The CDC has done hundreds of key studies on vaccine safety. They are all thrown into doubt by Thompson’s assertion — recently quoted by Congressman Bill Posey on the floor of the Congress—that Thompson and his colleagues brought a garbage can into a CDC office and threw out documents that would have shown the MMR connection to autism. \\n\\nMy previous article, “CDC commits new vaccine-autism crime,” details the CDC’s refusal to allow its own researcher and chief whistleblower, William Thompson, to testify in a court case involving a boy who was severely damaged by vaccinations. \\nTND Guest Contributor: Jon Rappoport \\nIt’s time to remember William Thompson—again. Here are excerpts from two articles I wrote before the stunning film Vaxxed ( trailer ) was released. Vaxxed is all about Thompson’s revelations and their implications. \\n(August 2015) …William Thompson, long-time CDC researcher, publicly admitted he hid evidence that indicted the MMR vaccine for its connection to autism. \\nIt’s been a year since Thompson publicly accused his colleagues at the CDC of doing the same thing. Two of those colleagues, Frank DeStefano and Collen Boyle, are high-ranking CDC executives in the area of vaccine safety. \\nDuring this past year, mainstream reporters and defenders of the realm have taken two approaches: silence; and vague claims that Thompson’s statements are false. \\nBoth of these approaches are slimy and disingenuous, because the man we want to hear from is Thompson himself. And we have not. \\nWe want to hear from him in a public setting, in front of a hearing where he can speak at length, where he can fill in details, where he can air all his claims without censorship. \\nAt the moment, the possibility of such a hearing is remote, because the US Congress is bought and sold. \\nShort of a hearing, we want Thompson to sit down with a reporter and speak on camera, extensively, and submit himself to questions. \\nHe has said he will not do this. He and his lawyer, Rick Morgan, know there are a number of reporters who will do a proper interview, without edits. I could easily name a dozen reporters who would conduct an in-depth interview, live, online, for the whole world to see. \\nWhat if there never is a full-blooded open Congressional hearing? What then? Will Thompson maintain silence for the rest of his life? \\nMore is at stake here than the danger of the MMR vaccine. The CDC has done hundreds of key studies on vaccine safety. They are all thrown into doubt by Thompson’s assertion — recently quoted by Congressman Bill Posey on the floor of the Congress— that Thompson and his colleagues brought a garbage can into a CDC office and threw out documents that would have shown the MMR connection to autism. \\nThis speaks of a massive indifference to human life and safety. \\nThompson should also know, and certainly does know, that Congressional hearings have a way of soft-pedaling accusations against government agencies. There is no guarantee that, in such a setting, he would be able to air his confession and his grievances in full. \\nWhereas, in an interview with independent investigators/reporters, he would have complete latitude. Time constraints would not apply. He would be asked for many, many details. The full story, from his point of view, would emerge. \\nIt is my conclusion that Thompson entered into an arrangement with his bosses at the CDC. After his public confession of a year ago, it was too late to put the genie back in the bottle and cork it. But damage control could be undertaken. \\nThompson could say ( and he did ) t hat he was willing (and only willing) to work with Congress to present the truth. His CDC bosses were confident they could, with the help of powerful friends in government and in the pharmaceutical industry, prevent Congressional investigation and exposure. \\nAnd if Thompson maintained silence otherwise, refusing to talk to reporters, he would be off the hook. \\nThe CDC assured Thompson that he could continue to work for them and retire and receive his full pension. \\nThat’s my conclusion. If I’m in error, let Thompson or his lawyer, Rick Morgan, correct me.'"}, "time": 1742561814.4178474}