{"duration": 0.0991520881652832, "input_args": {"text": "'BERLIN  —   A day after voters in Chancellor Angela Merkel’s political home state delivered what amounted to a strong rejection of her refugee policy, the German leader acknowledged on Monday that she was “very dissatisfied” with the result but insisted that she would stick with her chosen course. Ms. Merkel, who was attending a summit meeting in China, waited 18 hours before addressing the unprecedented   finish of her   party in state elections on Sunday in the impoverished northeastern state of   where she has her own parliamentary constituency. The nationalist,   Alternative for Germany finished in second place, with 21 percent of the vote, behind the   Social Democrats, with almost 31 percent. Ms. Merkel’s Christian Democrats received 19 percent. Ms. Merkel’s bloc of Christian Democrats and their Bavarian sister party, the Christian Social Union, had never been overtaken on the right in any state or national election in the history of modern Germany, and the result prompted the chancellor’s critics from her own camp and across the spectrum to renew speculation about her future. “Right now, the chancellor is not hitting the right tone in almost all the areas that most concern her voters  —   refugees, Europe, public safety,” wrote Gabor Steingart, the publisher of the main business daily Handelsblatt, which has been among her strongest critics. “It is a remarkably pale light which is falling on the first stateswoman these days. This is what the twilight of a chancellorship looks like. ” Facing another election in two weeks in the   of Berlin, and three more state ballots next year before national elections in the fall, Ms. Merkel insisted that voters would eventually come to support her refugee policy. Germany has taken in almost one million refugees, many of them Muslims fleeing war in the Middle East, over the past year. Integrating many and deporting those who have no claim on asylum is the right course, she said. In a hasty meeting with German reporters broadcast live from China, Ms. Merkel said that national themes  —   in particular migration and integration  —   had been dominant in the vote and that “many people do not have sufficient confidence in our ability to solve this. ” “Now the name of the game is to regain trust,” she said. “Only with time can we solve the problems,” not just those concerning migrants but also those dealing with fears for the future in a rapidly changing world, she added. Ms. Merkel, who has been in power since 2005 and is Europe’s   head of government, indicated that she bore some responsibility for the result on Sunday because she is the leader of the Christian Democrats and chancellor in a coalition with the   Social Democrats. “Everybody has to reflect on how can we win back trust, and above all, of course, me,” the German news agency DPA quoted her as saying in an aside to reporters at the Group of 20 summit meeting in Hangzhou, China. Her party’s general secretary, Peter Tauber, was almost the only leading Christian Democrat talking to reporters in Germany on Monday after he conceded “bitter” defeat in Sunday’s vote. “Angela Merkel has led Germany through several crises,” Mr. Tauber said. “People can rely on the fact that she will this time, too. ” But Ms. Merkel, while still enjoying ratings that many leaders would embrace, has lost popularity since the weekend exactly a year ago when she threw open German borders to migrants then trapped in Hungary. Hundreds of thousands of migrants poured in over the months that followed, prompting her conservative allies in Bavaria’s Christian Social Union, in particular, to demand a limit on the number of asylum seekers. Ms. Merkel, the daughter of a Lutheran pastor in Communist East Germany, insisted that there was no way to impose a quota on those fleeing war and oppression. Some Bavarian conservatives used the vote on Sunday to reiterate their demands, indicating that Ms. Merkel faces a tough fight, possibly even in her own camp, if she decides next year to seek a fourth term as chancellor. Ms. Merkel declined on Monday, as she has in the past, to say whether she would run in 2017. The leaders of Alternative for Germany, the   group that finished ahead of Ms. Merkel’s party, were in a jubilant mood on Monday and vowed to keep up the pressure on the chancellor. Sunday’s loss “is even more bitter for the Christian Democrats because it comes on Merkel’s home turf,” said Frauke Petry, one of two national leaders of the   party. “And we will see to it that she continues to lose that ground. ” An analysis of the vote showed that the far right was particularly attractive to people who had not voted in previous elections in the state. Turnout went from 51 percent in the last state elections in 2011 to 61 percent. But all the major parties  —   the Social Democrats, the Christian Democrats, the   Die Linke and even the Greens  —   lost voters to the Alternative for Germany. Jörg Meuthen, another leader of the rightist party, said the group’s showing proved that it had become a mainstream force. “In the long term, we want to govern this country,” he said.'"}, "time": 1742561901.526755}