{"duration": 0.1109151840209961, "input_args": {"text": "'Mosul will not be taken, ISIS will not be destroyed 27.10.2016 In June of 2014, the world was amazed to see the Iraq army - armed and trained by the Americans - losing ground to the Islamic State. Fallujah, Ramadi and Iraq\\'s second largest city, Mosul , fell within a month. The operation to liberate Mosul was launched on October 16. Will the city be liberated from ISIS terrorists?In 2014, the whole world started talking about the emergence of new terrorists . The world could not destroy them as the Americans wanted to use the new terrorists to their advantage to struggle against geopolitical rivals - Iran and Russia. Now we can see the Americans trying to take Mosul. The Western press is full of rosy expectations about the imminent collapse of the Islamic State\" (a terrorist organization banned in Russia). Fallujah and Ramadi have been liberated - one only has to take the two-million-strong Mosul, and the trick is done. Yet, the trick does not seem to be that simple. Firstly, Mosul is a city with a Sunni population in the Shiite-ruled country. This is the first resistance factor. Secondly, Mosul is the actual capital of the Islamic State - this is a city, the status of which determines the status of the Islamists. Therefore, there will be fierce battles, a humanitarian catastrophe and up to one million refugees. This is where Russia will be able to draw a parallel with Aleppo - something the Americans will not like. In pictures: The storm of Mosul, Iraq Nevertheless, if we do not see all that, and 9,000 ISIS fighters will leave Mosul, it will mean that they have been affiliated with Turkey and the United States. It is not hard to guess where the Turks and the Americans will send them to - to Syria: Deir ez-Zor, Palmyra, Damascus. Will there be US flag draped coffins coming from Iraq? The city is being stormed by motley and, one might even say, hostile forces . No one knows how they may fight for power during the operation. An Iraqi anonymous observer in Baghdad said that \"the offensive on Mosul looks hopeless, but one pins all their hopes on the support from the US, The Independent wrote. At least 12 US generals and 5,000 American troops are in Iraq, and they will play a crucial role in the fight. Five thousand is a lot, but what if the Americans start suffering losses? \"The Iraqis say that Mosul is their center. The Kurds say that the city is their center,\" Semyon Bagdasarov, an expert on Central Asia and the Middle East at the Center for Analytical Research told Pravda.Ru. Peshmerga (the Kurdish militia - ed.) is the core strength: five thousand Kurds are attacking Mosul, and what they will take will be their territory. The Kurdistan Workers\\' Party is also involved, and they are not going to share with anyone. All these are hostile parties, including the Turkish army and the Sunni militia. In general, it is total chaos.\" According to Colonel Tim Collins, a former officer in the British Army, who fought in Iraq in 2003, currently the chief of the security service at New Century, the conflict may exacerbate further against the background of the conflict between the Turks and the Kurds. The Iranians would like to see this problem by increasing their influence on Iraq. The Syrians want to punish the Sunnis, the Iraqi army wants to restore its reputation, the colonel said in an interview with CNN. General Qasem Soleimani of the Iranian Revolutionary Guards could be one of the winners, Collins believes. Whoever becomes the victor in Mosul, the Islamic State will not be defeated , even if ISIS loses Mosul. The organization will recover in Libya, Afghanistan, Indonesia, the Philippines and elsewhere - whenever Washington needs those terrorists. They will not stop recruiting new members across the globe, because the Americans continue spreading their ideology to the Islamic world. Will Europe rebel against Washington, or will it continue to suffer from refugees and Jihadists? Lyuba Lulko Read article on the Russian version of Pravda.Ru Russia to save Iraq from ISIS'"}, "time": 1742564525.68568}