{"duration": 0.033731698989868164, "input_args": {"text": "\"Interviews Syria should be able to choose its allies in the battle against Daesh, says American political analyst James Petras. \\nThe Pentagon's plan to launch an offensive against the Daesh (ISIL) terrorist group in Syria is only aimed at undermining a successful attempt by the Syrian government and its allies to defeat the terror group, says James Petras, an American political commentator. \\nUS Defense Secretary Ashton Carter told NBC News on Wednesday that the Pentagon is planning a ground offensive to oust Daesh from the Syrian city of Raqqah, the terror group’s stronghold in the country. \\nCarter, who was in Iraq earlier this week amid the ongoing battle to retake the city of Mosul from Daesh, said the Raqqah offensive would begin when Iraq’s second largest city is cleared. \\nHe claimed that US forces won't be directly involved in any of the operations. \\n“This is a ploy to have the US in northern Syria,” Petras said, arguing that the US was seeking to undermine international efforts to defeat Daesh in a bid to reinforce its own foothold in the conflict-ridden country. \\n“I don’t believe that the attack on Raqqah is a positive move because I think it brings the US closer to its policy of establishing a no-fly zone in northern Syria which will directly affect the efforts of the Syrian government and its allies—Iran and Russia—to defend the country.” \\nThe analyst noted that Raqqah is a “problem for the Syrian people” and Damascus should be allowed to choose its allies in the battle. \\nPetras went on to note that Carter’s remarks bear similarities to US Democratic presidential candidate Hillary Clinton’s plans for a “conflagration” in the Middle East. \\nThe ongoing Western efforts in Syria have a different nature. Washington and its allies have come under fire for openly seeking to remove President Bashar al-Assad from power. \\nCarter’s claim that US ground forces will have no part in the fight against Daesh came at a time when more than 5,000 American soldiers were stationed in Iraq, tasked with providing training and intelligence to Iraqi forces. Loading ...\""}, "time": 1742562177.6727483}