{"duration": 0.1188650131225586, "input_args": {"text": "'Comments \\nRepublican Donald Trump has denied Russian business ties throughout his entire campaign for President, even after confirmed videos (below) show him bragging adamantly about his relationship with Russian President Vladimir Putin. \\nHowever, Mother Jones just reported that Trump actually maintains a mutually beneficial, direct relationship with Putin, which is why the FBI has been conducting an inquiry into Trump’s campaign management since August. The entire report proves Trump’s Russian connection and was provided to the FBI in August by a “veteran spy”— and publicly revealed this afternoon . Here’s the conclusion: \\n“Russian regime has been cultivating, supporting and assisting TRUMP for at least 5 years. Aim, endorsed by PUTIN, has been to encourage splits and divisions in western alliance.” It maintained that Trump “and his inner circle have accepted a regular flow of intelligence from the Kremlin, including on his Democratic and other political rivals.” It claimed that Russian intelligence had “compromised” Trump during his visits to Moscow and could “blackmail him.” It also reported that Russian intelligence had compiled a dossier on Hillary Clinton based on “bugged conversations she had on various visits to Russia and intercepted phone calls.” \\nThe former intelligence officer says the response from the FBI was “shock and horror.” The FBI, after receiving the first memo, did not immediately request additional material, according to the former intelligence officer and his American associates. Yet in August, they say, the FBI asked him for all information in his possession and for him to explain how the material had been gathered and to identify his sources. The former spy forwarded to the bureau several memos—some of which referred to members of Trump’s inner circle. After that point, he continued to share information with the FBI. “It’s quite clear there was or is a pretty substantial inquiry going on,” he says. \\n“This is something of huge significance, way above party politics,” the former intelligence officer comments. “I think [Trump’s] own party should be aware of this stuff as well.” \\nThe above bombshell has been confirmed by the federal government. The western spy revealed that the Kremlin began working with Trump up to five years ago. \\nUltimately, this western spy went to the FBI due to the seriousness of the information that he had uncovered. \\nA senior US government official not involved in this case but familiar with the former spy tells Mother Jones that he has been a credible source with a proven record of providing reliable, sensitive, and important information to the US government. \\nA former senior intelligence officer for a Western country who specialized in Russian counterintelligence tells Mother Jones that in recent months he provided the bureau with memos, based on his recent interactions with Russian sources, contending the Russian government has for years tried to co-opt and assist Trump—and that the FBI requested more information from him. \\nIn June, the former Western intelligence officer—who spent almost two decades on Russian intelligence matters and who now works with a US firm that gathers information on Russia for corporate clients—was assigned the task of researching Trump’s dealings in Russia and elsewhere, according to the former spy and his associates in this American firm. This was for an opposition research project originally financed by a Republican client critical of the celebrity mogul. (Before the former spy was retained, the project’s financing switched to a client allied with Democrats.) “It started off as a fairly general inquiry,” says the former spook, who asks not to be identified. But when he dug into Trump, he notes, he came across troubling information indicating connections between Trump and the Russian government. According to his sources, he says, “there was an established exchange of information between the Trump campaign and the Kremlin of mutual benefit.” \\nThis was, the former spy remarks, “an extraordinary situation.” He regularly consults with US government agencies on Russian matters, and near the start of July on his own initiative—without the permission of the US company that hired him—he sent a report he had written for that firm to a contact at the FBI, according to the former intelligence officer and his American associates, who asked not to be identified. (He declines to identify the FBI contact.) The former spy says he concluded that the information he had collected on Trump was “sufficiently serious” to share with the FBI. \\nThis newest Mother Jones report is chilling news, implicating the Trump campaign in the kind of high level dirty politics that the Republican’s political hero Richard Nixon would’ve found awfully familiar –only with a bizarre Russian twist. Nixon resigned in disgrace after an investigation found evidence that he’d ordered a break-in to the Democratic National Committee’s offices at the Watergate Hotel seeking information to swing his election. Trump doesn’t look like he will get that opportunity, but might face just as much public scrutiny in the wake of election day due to his Russian ties. \\nDonald Trump is the first American politician in history to openly beg Russia for help in an election, let alone in a presidential campaign. The Republican certainly has benefitted from a string of stolen email releases, which has strangely only afflicted Democrats — and not a single Republican. \\nWatch Trump admit to MSNBC that he has a relationship with Putin – twice:'"}, "time": 1742564158.105938}