{"duration": 0.09233951568603516, "input_args": {"text": "'Waking Times \\nIt’s always important to keep a strong perspective on reality and the objective truth about what is happening even though we ourselves (readers, truth seekers) are humans with principles, passion, interests, needs and emotions. These are factors which sometimes can make objectivity difficult to see. Yes, we all have human attributes meant for our own good and for survival which, if not carefully handled, can make us vulnerable to deep state propaganda, political strategies, psychological operations and political agendas. This is saying a lot so let’s break this down and see if we can apply some principles that make this reality easier to understand. Engineered Chaos \\nThe first point I want to emphasize as I did in several articles of the past month or so is that no one should be mistaken, in America we are smack in the middle of an engineered chaos. That’s right. Political chaos that was planned and desired by the ruling elite. Nothing going on now is by coincidence. If anyone thinks the revelations, leaks, surprises, shocking news, infighting, controversies, division, accusations and political clashes of the past months is spontaneous and coincidental then you are far too naive to comprehend what we are about to discuss. Please try to see how politics in the year 2016 with all the technology available, the global agendas of the elite, the opportunity to control resources and the trillions of dollars at stake is indeed all by design. The ruling elite can and thus WILL always try to steer humanity in the direction of their liking. This basic reality of the ruling elite pulling the strings at the highest level is the fundamental basis to understanding how the world works today. For everyone else who understands this, let’s move on. \\nEngineered chaos and the orchestration of division, strife and clashes of ideology leading to civil unrest and ultimately the fracturing of nation-states is the standard mechanism by which the US empire has exerted its domination over nation-states, especially since the creation of the CIA in 1947. This is how the US overthrows governments. What About This Election Season? \\nThe most important thing we need to understand is that chaos and civil unrest is engineered and it is usually based on the following factors: Legitimate gripes and discontent held by some or all of the people Because it is based on legitimate gripes and concerns it always appeals to at least some of the people involved The ruling elite always have an end game planned as a result of the chaos and civil unrest. \\nThis is all we need to understand in order to recognize the engineered election season chaos and unrest we’ve all experienced and witnessed here in America over the past few months. Now let’s apply these rules to the reality we face today in the US. Legitimate Gripes, Concerns and Discontent \\nI (we) are all part of this discontent. In this current example we (truth seekers, Republicans, Trump supporters, Bernie Sanders supporters, even some Democrats, anyone not completely brainwashed with Hillary propaganda) have watched as Hillary Clinton and her supporting criminal DNC, mainstream media and long list of players both domestically and globally have committed unspeakable crimes and blatantly gotten away with it. Corruption has exploded and propaganda and lies have been used to cover it up or ignore these crimes. There’s your “legitimate gripe.” Again, we’re not talking about JUST Hillary, we’re talking Bill Clinton, Bush Junior, Cheney, Soros and so on. We’re talking almost the entire mainstream media, Obama and his conspirators and many more. \\nThe legitimacy of many of our concerns are overwhelming. The reality is that the revelations of the Clinton crimes and all the corruption and evil being officially revealed by all the sources (WikiLeaks, Project Veritas, FBI. etc.) is welcomed and to be taken serious. There’s your legitimate reason for chaos and civil unrest and I (we) are part of it. Appealing to large segments of the population \\nThe concerns of criminality is very real for most Americans and exposing this criminality must be done. This is appealing to all of us. The controllers know this. They (the ruling elite) have to base a perceived organic chaos in America on real issues and real concerns. Because of this, naturally many of us want to see these revelations and calls for justice and accountability come to fruition. This by definition is what a revolution looks like. We embrace it, again, because it’s based on real issues that need real attention. This is appealing even to me and many others. This “appeal” is part of the engineering of the chaos and civil unrest. Ruling Elite Will Always Manipulate End Game to Their Benefit \\nThe one thing the masses cannot do is tell the ruling elite how to think. We (humanity) don’t sit in on their (CFR and Bilderberg) meetings. We can only respond to the reality that unfolds before us with the wisdom we have which is obtained from the knowledge and understanding we gain over time. The knowledge and understanding comes from staying on top of current events, researching things on your own, thinking critically on your own, being awakened and eager to follow truth. In order to dwell in this truth-seeking mode and build your knowledge, understanding and wisdom you must by default truly understand that mainstream media is all lies and deceit controlled and operated by the elite for the purposes of controlling the beliefs of the masses. \\nSo while you are packing your brain with knowledge and following truth, realize that the ruling elite have their own plans and their own paradigm. This reality will never change. Throughout history we have seen empires come and go. Those who thirst for power will always exists and it is the wise person who learns to navigate life knowing that these control freaks exist. This is how we know for sure that the ruling WILL manipulate the end result of this election season for their benefit. \\nMore than ever, we (truth seekers) need to be alert and aware of this reality. At no point will we be able to say “it’s over now, we can live in peace.” No way. Do not be fooled. Freedom must constantly be fought for. Governments will always be corrupt. That doesn’t mean we stop trying either. \\nIn the best-case scenario we might see a lot of people charged and convicted for their crimes against humanity, the Constitution, America and the world. In the best-case scenario things will get a tiny bit better for a season. We’ll take the good while it lasts. We shouldn’t pin our hopes on a leader (whoever it may be) to lead us from the top-down. Making This Engineered Chaos a Win-Win \\nThe mark of a true revolution is one where we the people begin to realize that all these “leaders” that want to rule humanity from the top-down are useless to us. Eventually humanity will see that we don’t need them any more. Humanity will someday soon be ready to move on to a new paradigm. One of self-sustaining existence which takes advantage of technology, new levels of self-awareness, new strategies and models for survival and economic growth and true “sustainability.” Sustainability of the principles of truth, justice, freedom and liberty. \\nSo as this election season winds down and America awaits the big surprise which may include orchestrated revolts, terrorism or worse, let’s think ahead and consider what is it that we all REALLY want. Is it really all about electing or selecting a leader to lead us? What if humanity is ready to think outside the box? \\nFor now it appears we have an opportunity to see some of the scum politicians who have betrayed humanity and America be taken down. We’re all left wondering, will this happen now, this week, very soon? And, how will that play into the elections (selection)? \\nFinally, believe it or not, despite all the craziness going on I am thankful for this version of engineered chaos since indeed it has an appeal to some of us. We are actually hearing rumors of the possible arrest of some of the elites, and if you ask me it’s music to my ears. Of course I’ll believe it when I see it, and for what it’s worth I’ll take the engineered chaos and see where it takes us. I believe somehow it gets us closer to wherever it is we are going. Either way, as I’ve said before, paradigm shift IS here. What we do with it is up to us. And being rooted in reality and truth is all we need to make the right decisions moving forward. That to me is good news and that is why I welcome all the events that are unfolding, for better or for worse. About the Author \\nBernie is a revolutionary writer with a background in medicine, psychology, and information technology. He is the author of The Art of Overcoming the New World Order and has written numerous articles over the years about freedom, government corruption and conspiracies, and solutions. A former host of the 9/11 Freefall radio show, Bernie is also the creator of the Truth and Art TV project where he shares articles and videos about issues that raise our consciousness and offer solutions to our current problems. His efforts are designed to encourage others to joyfully stand for truth, to expose government tactics of propaganda, fear and deception, and to address the psychology of dealing with the rising new world order. He is also a former U.S. Marine who believes it is our duty to stand for and defend the U.S. Constitution against all enemies foreign and domestic. A peace activist, he believes information and awareness is the first step toward being free from enslavement from the globalist control system which now threatens humanity. He believes love conquers all fear and it is up to each and every one of us to manifest the solutions and the change that you want to see in this world, because doing this is the very thing that will ensure victory and restoration of the human race from the rising global enslavement system, and will offer hope to future generations. \\nThis article ( A Positive Perspective on the Engineered US Election Chaos ) was originally created and published by Bernie Suarez at Truth and Art TV and is re-posted here with permission. \\n~~ Help Waking Times to raise the vibration by sharing this article with friends and family…'"}, "time": 1742628494.1224382}