{"duration": 0.07744622230529785, "input_args": {"text": "'  NORTH CAROLINA: Top Democratic Donor – Blacks Are “Seriously F***Ed In The Head” [VIDEO] NORTH CAROLINA: Top Democratic Donor – Blacks Are “Seriously F***Ed In The Head” [VIDEO] November 2, 2016, 3:39 pm by Terresa Monroe-Hamilton Leave a Comment 0 \\nNoisyRoom.net \\nIn North Carolina , a major donor to US Senate candidate Deborah Ross, was caught on video by Project Veritas saying some very disturbing things. He compared black Republicans to Jews helping Nazis during the Holocaust. Benjamin Barber also said that blacks are “seriously f***ed in the head.” \\nJames O’Keefe and Project Veritas have been relentless in exposing Democrats and the left this election cycle. They’ve done terrific work, much to the chagrin of Barber. Benjamin and Leah Barber were caught on undercover video at a fundraiser for Ross. They are also major donors to Hillary Clinton’s presidential campaign. Figures. \\nFirst up in the video is Ross comparing voter ID laws to racist Jim Crow laws in the South. Then the conversation with the Barbers began. And it was a doozy. \\n“It doesn’t make sense,” Leah Barber said about African Americans who support Republicans. “You’re voting against your self-interest. In the name of change, what is the change that they want to see?” \\nFrom PJ Media : \\nIn a new video released today by Project Veritas Action, a top Democratic donor is caught on camera horribly maligning Republican blacks at a fundraiser for North Carolina U.S. Senate candidate Deborah Ross. In the video, Benjamin Barber, a prominent Ross and Clinton donor, compares blacks who vote Republican to Nazis at the fundraiser for Ross on the Upper West Side of New York City on September 19, 2016. \\n“Have you heard of the Sonderkommandos? Jewish guards who helped murder Jews in the camps. So there were even Jews that were helping the Nazis murder Jews! So blacks who are helping the other side are seriously fucked in the head,” Barber said. “They’re only helping the enemy who will destroy them. Maybe they think ‘if I help them we’ll get along okay; somehow I’ll save my race by working with the murderers.’” \\nThe irony here is rich considering the sordid history of George Soros , another prominent big Democrat donor who literally was a Jewish Nazi collaborator as a teenager during World War II in his native Budapest, Hungary. \\nAn analogy of the Sonderkommandos… work units in Nazi death camps? This guy just trashed African Americans and Jews. What an asshat. The death camps were usually composed of Jewish males, forced to dispose of bodies from the gas chambers. They did not assist with the killings themselves. Assertions otherwise are obscene. \\nProject Veritas showed the video to some religious leaders and others in the black community who were shocked by the contents of the video. \\n“I think that Deborah Ross has shown her true colors. If this is not a, if that… what you just showed me is not racism and condescending and basically calling blacks stupid and ignorant and saying that we are voting against our own self-interest if we support any Republican. I am appalled. I am incensed. Deborah Ross should be called to task for something like that,” said Bishop Wooden, a black voter in North Carolina. \\nNo one should be shocked by this… the undercurrent of racism and Antisemitism has always been out there for the Democrats. You just got to see some honesty for a change instead of the usual pandering. Disgusting and revealing. 0'"}, "time": 1742562819.786675}