{"duration": 0.025905847549438477, "input_args": {"text": "'WASHINGTON, D. C.  —   Hours after James T. Hodgkinson, 66, targeted Republican Members of Congress practicing for a charity baseball game, in a shooting that left Rep. Steve Scalise ( ) and three members of the Capitol Hill Police severely wounded, House Speaker Nancy Pelosi took the House floor. [“I pray for Donald Trump, that his presidency will be successful and that his family will be safe,” Pelosi said of President Donald Trump.  “I have been probably the target of more, political target of probably more threats than anyone perhaps other than the President of the United States Barack Obama. And so I pray for Barack Obama, and now I continue to pray for him,” Pelosi said. “And I pray for Donald Trump, that his presidency will be successful and that his family will be safe,” she said. Less than one month into Trump’s presidency, Pelosi said that said while she has not seen a completed case for his impeachment, a “very scientific, methodical way” was being created to help the Democrats achieve this aim. On Monday, Pelosi predicted that Trump would “ . ” But now, just a few days later, she is throwing her support behind the president in the wake of this tragedy in Alexandria. Earlier in her speech on the House floor on Wednesday, Pelosi said that “we speak for each other in saying, we send our thoughts and prayers to our colleague, Steve Scalise. ” She continued: Personally we have our   connection so as soon as I heard his name, I was filled with concern, as I would be for anyone here. But we had that special connection, and so our hopes and prayers  —   and as I said to the Speaker [Paul Ryan] I’ll be asking you every five minutes, ‘How is Steve coming along?’ Pelosi added that she prays “frequently, and certainly every Sunday. ” She added: When this team was on the field practicing with such brotherhood  —   I don’t know if you have any sisters on your team we have two on our team  —   for this person to take this action was so cowardly, so cowardly. We cannot let that be a victory for the assailant or anyone who would think that way. We will use this occasion as one that brings us together and not separates us further. Before taking the House floor Wednesday afternoon, Pelosi tweeted: On days like today, there are no Democrats or Republicans, only Americans united in our thoughts for the wounded. https:  .   —   Nancy Pelosi (@NancyPelosi) June 14, 2017,  However, for Hodgkinson  —   a staunch Bernie Sanders ( ) supporter who hated President Donald Trump  —   Republicans were his target. Rep. Ron DeSantis ( ) was also present at Wednesday’s baseball practice. He said Hodgkinson had approached him and Rep. Jeff Duncan ( ) to ask which political party was practicing. “There was a guy that walked up to us that was asking whether there was Republicans or Democrats out there. And it was just a little odd  …     so we told the police that,” DeSantis said. In addition to his affiliation with a number of   groups, Hodgkinson belonged to one named “Terminate The Republican Party. ” Hodgkinson has since died, President Trump confirmed in his remarks, as a result of gunfire exchange between him and the Capitol Hill Police. The Capitol Hill Police officers were present because Scalise is a member of GOP leadership. Some members of Congress said that had it not been for Scalise’s security detail, the shooting could have turned into a massacre. Adelle Nazarian is a politics and national security reporter for Breitbart News. Follow her on Facebook and Twitter.'"}, "time": 1742628549.1803818}