{"duration": 0.0305483341217041, "input_args": {"text": "'Hillary Clinton and 6 aides had access to classified State Department information after she left office, lawmaker says | @edhenry pic. twitter.  Friday on Fox News Channel’s “Fox  Friends,” network correspondent Ed Henry reported Sen. Chuck Grassley ( ) had revealed former Secretary of State Hillary Clinton, the 2016 presidential nominee for the Democratic Party, and six of her aides retained their access to top secret and classified information after leaving the State Department in 2013.  “We’re learning from Republican Sen. Chuck Grassley that she and six staffers in 2013 retained clearances where they still had access to top secret and classified information,” Henry said. “Why? They were titled ‘research assistants.’ So the assumption on Capitol Hill is it was because she was writing her memoirs and saying, ‘Look, I still need access to this information in order to go through what happened in Syria, what happened with Russia. But obviously think back to what James Comey said in how Hillary Clinton handled classified information. ” Henry was referring to Comey’s July 2016 statement calling Clinton “extremely careless” in how she handled classified information. “He obviously believes something needs to be done about this,” Henry added. “The only positive for Chuck Grassley at this point is, there’s no longer a Democrat at the State Department, obviously. You got Rex Tillerson, so if you have these documents on why she retained these clearances, and for example does she still have a clearance today? A lot of former officials get to keep these clearances for years  —   when they’re consultants   …     some of them like to retain it because they say I was in the middle of all of these important issues. I need to keep abreast of it. Been then some of these folks in Washington  —   they say drain the swamp. ” Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742628369.0913866}