{"duration": 0.04546189308166504, "input_args": {"text": "'WCD Ministry to reward married men who select “What is your anniversary date?” as security question Posted on Tweet \\nThe Ministry of Women and Child Development, headed by Maneka Gandhi has announced a new bravery award for married Indian men who select “What is your anniversary date?” as a security question during their registration process with any website online. \\n“The idea is to encourage married men across the country to remember their wedding anniversaries correctly and well. This, in turn, will prevent unwanted acrimony in families in India and foster better husband-wife relationships. The number of married Indian men who remember their wedding anniversaries is abysmal and this is an earnest effort to improve the rate. Even today, lakhs of Indian married men who sign up for anything online and create an account anywhere usually choose ‘What is your first pet’s name?’, or ‘When is your birthday?’, or ‘Which is your favorite car?’ as their security question,” WCD Minister Maneka Gandhi told The UnReal Times . \\n“Hardly anyone ever chooses ‘What is your anniversary date?’ as a security question, simply because there have been people who have forgotten their passwords and not only have they been unable to retrieve their accounts due to inability to answer the security question correctly, but they have also been unable to retrieve access to their own households, due to highly miffed wives. We do not want to further penalize those who forget their anniversaries as they would already be in deep shit, so we’re trying to change this the positive way – by honoring those few who do. We hope the number of men who do remember the anniversaries grows due to this,” Gandhi added. \\nThe ministry’s policy, however, wasn’t without its share of initial controversy. BJP MP Varun Gandhi, who was one of the first married men to stake claim for the award, after bravely selecting the anniversary security question while registering at Patanjali’s online retail website to buy their honey bottles, has been denied an award by his mother. “I’m sorry, Varun’s case is special – anything other than honey and I would gladly give him the award. I will even overlook the fact that our women journos’ Whatsapp group was totally against Varun buying things from Patanjali, of all places, but honey is an absolute no-no,” Maneka Gandhi is reported to have said. \\nVarun’s act of bravado reportedly hasn’t found favor with his better half too. “Poor Varun, he told Yamini ‘I’ll never forget our anniversary, honey!’ to which she yelled back ‘Don’t you dare say honey again!’” a WCD ministry source told The UnReal Times . Tweet About Ashwin Kumar \\n1 of the proud columnists of URT, former co-editor of URT Tamil, amateur musician, Real Harris Jayaraj devotee, UnReal T. Rajendar fanatic, passionate about stopping female foeticide.'"}, "time": 1742562231.8418858}