{"duration": 0.06640410423278809, "input_args": {"text": "'Geert Wilders, the Eurosceptic,   migration candidate who heads the insurgent Party for Freedom (PVV)  has blasted incumbent head of government Mark Rutte as a “prime minister for foreigners” urging voters to put the Netherlands first in a fiery debate. [“I say to all Dutch people at home, when you go to vote on Wednesday, if you want to put our country up for sale and ensure that our money goes to asylum seekers, Brussels and Africa instead of our own people, vote for the VVD”  —   the political party which Rutte heads.  Wilders also called on Rutte to expel Turkey’s ambassador, after the country’s authoritarian president Recep Tayyip Erdoğan denigrated the Dutch as “Nazi remnants” and threatened the Netherlands with “harsh retaliation” for preventing Turkish government ministers from staging a political rally in Rotterdam. Wilders said anything less would be “an insult to us and our police officers” after Turkish migrants and dual nationals rioted in support of their native country’s Islamist president. But Rutte ruled the measure out. “It’s the difference between tweeting from the sofa and running a country,” he said, in reference to the robust message to Turkish rioters which Wilders broadcasted in the wake of the unrest. 🇳🇱🇹🇷 Geert Wilders’s message to Turks: ”You are not welcome here!”    #Turkey #Rotterdam pic. twitter.   —   Keith Walker (@KeithWalkerNews) March 12, 2017,  “You are no Europeans, and you will never be,” he said. “An Islamic state like Turkey does not belong to Europe. All the values Europe stands for  —   freedom, democracy, human rights  —   are incompatible with Islam. “Turkey voted for Erdoğan, a dangerous Islamist who raises the flag of Islam. We do not want more, but less Islam. So Turkey, stay away from us. You are not welcome here. ” Rutte cited a desire to avoid escalating the dispute with Turkey as his reason for failing to act  —   although the Turks have already effectively expelled the Dutch ambassador from their own capital. BREAKING: Turkey says Dutch ambassador can’t return, will advise parliament to withdraw from   friendship group.  —   The Associated Press (@AP) March 13, 2017,  The VVD leader ruled out any sort of coalition agreement with Wilders’s party, which is on course to come first in the upcoming election, casting up comments Wilders made about Moroccan criminals which resulted in controversial hate speech charges. “Since then you have radicalised still further by saying the mosques will close and you will remove Qur’ans from people’s homes,” Rutte claimed. “I will not work with a politician like that, either in government or with a supporting deal. Not ever, ever. ” Wilders did, in fact, rise in the opinion polls after the courts convicted him for his remarks.'"}, "time": 1742561722.6294365}