{"duration": 0.07150840759277344, "input_args": {"text": "'“People are not happy. BIG lines. What is going on?” \\nSteve Watson Prison Planet.com October 27, 2016 \\nGOP Nominee Donald Trump, who has for weeks warned that the election could be rigged against him, shot out a tweet Thursday indicating that he is aware of reports of machines ‘flipping’ to register votes for Hillary Clinton, when voters choose Trump. \\n“A lot of call-ins about vote flipping at the voting booths in Texas,” Trump tweeted. \\n“People are not happy. BIG lines. What is going on?” A lot of call-ins about vote flipping at the voting booths in Texas. People are not happy. BIG lines. What is going on? \\n— Donald J. Trump (@realDonaldTrump) October 27, 2016 \\nAs Infowars has highlighted , there have already been numerous reports of early voters in Texas seeing their ballots flipped from Donald Trump to Hillary Clinton. A d v e r t i s e m e n t \\nWhile election officials have dismissed the reports, suggesting ‘user error’ is to blame, tech experts have long warned that the machines can become less accurate over time. \\nLarry Norden, a voting technology expert, told NPR that the reports usually arise where outdated technology is being employed. \\n“Over time, as people vote, that calibration becomes less and less accurate,” Norden noted. \\nDuring elections over the past decade and more there have been reports of voting machines ‘flipping’. Indeed, the reports were so widespread that even entertainment shows such as The Simpsons drew attention to it: \\nMeanwhile, The Washington Post has admitted that the press is engaging in voter suppression, bizarrely claiming it is a legitimate way of countering Trump’s ‘rigged’ election claims. \\nCallum Borchers, author at the Washington Post blog The Fix writes: Since the final presidential debate last week, many news outlets have been delivering an unvarnished message to Donald Trump supporters: Your candidate is virtually certain to lose the election Nov. 8. A day later, the Times’s Upshot blog increased Clinton’s chances of winning to 93 percent , an all-time high. On Monday, Politico’s Ben Schreckinger wrote that “ Donald Trump’s path to an election night win is almost entirely closed .” Here at The Fix, Chris Cillizza and Aaron Blake wrote that “ Donald Trump’s chances of winning are approaching zero .” These are accurate, statistically sound statements. But they are something else, too. Declarations that Trump is highly unlikely to win also serve as counters to the Republican nominee’s warning that the “rigged” election could be “ stolen from us .” \\nThe latest polls, which Trump insists are rigged due to oversampling, show Clinton with a double digit lead. \\nHowever, Hillary Clinton’s campaign manager Robby Mook has warned that Trump’s suggestions that the polls are wrong and he can still win are “absolutely right.” \\n“We’ve seen polls tighten since the third debate and we expect things to get even closer before Election Day.” Mook said, urging Clinton supporters to vote. \\n“Make no mistake. With only 10 percent of votes cast, Donald Trump could win this election,” Mook said.   9:15  '"}, "time": 1742563294.9858823}