{"duration": 0.08458638191223145, "input_args": {"text": "'By wmw_admin on November 5, 2016 Darrell DeLamaid — Market Watch Nov 3, 2016 Trump supporter at Trump rally tells media covering the event exactly what he thinks of them. Click to enlarge \\nWhatever else this year’s bizarre and destructive presidential campaign achieves, it may well sound the death knell for legacy news media. \\nNewspapers have long since been doomed by the digital revolution and the collapse of their economic model. New waves of buyouts and layoffs recently announced by the New York Times, USA Today and the Wall Street Journal mark another step by print media toward extinction. \\nBroadcast networks, too, face severe difficulties as new technologies and changes in viewing habits transform the television industry and bring new challenges to news operations. . \\nBut it is the bias of the establishment media so blatantly in favor of the establishment candidate, Hillary Clinton, that may strip these news organizations of their last claim to value — as an objective and authoritative source of information — and hasten their demise. \\nWhen Liz Spayd started her new assignment as the public editor of the New York Times last summer. she was taken aback by the deluge of email criticizing the newspaper for “ one-sided reporting ” and “relentless bias against Trump.” \\nHer inquiries in the newsroom were met “with a roll of the eyes,” Spayd said, and the claim that all sides hate the Times because they are even-handed in their reporting. \\n“That response may be tempting, but unless the strategy is to become The New Republic gone daily, this perception by many readers strikes me as poison,” Spayd said candidly. “A paper whose journalism appeals to only half the country has a dangerously severed public mission.” \\nShe went on to muse that a fracturing media environment, with people seeking out the news they want to hear, might be pulling the Times to the left, which is where two-thirds of its readers are. This would be bad, she said, because of the stories that would be missed — such as the “surprising” triumph of Donald Trump in capturing the Republican nomination. \\n“Imagine a country where the greatest, most powerful newsroom in the free world was viewed not as a voice that speaks to all but as one that has taken sides,” she said, before grimly asking, “Or has that already happened?” \\nYes, indeed, it has. Behind all the Times’ fawning profiles of Clinton — and the denigrating pieces not only on Trump but also Democratic challenger Bernie Sanders — was a cozy understanding between Times reporters and the Clinton campaign, WikiLeaks has shown us, that getting Clinton elected is something of a collaborative effort. \\nBut it’s not just the Times — though the failing at what remains the nation’s premier newspaper is more egregious — but much of the rest of the establishment media as well. . \\nLongtime media critic Howard Kurtz, while acknowledging that Trump suffered from numerous self-inflicted wounds, said last week (before the FBI announced it was reopening the investigation into Clinton’s emails) that it looked like the mainstream media was doing a victory lap for defeating Trump, treating the election as if it were already over. \\nTrump, Kurtz said, has “been hit with the most sustained wave of hostile coverage ever aimed at a major-party presidential nominee.” \\nIn an accompanying video, he added, “There will be a stain on the press for being so openly one-sided in a presidential election, and that will not go away.” \\nEditors at the Times, the Washington Post and elsewhere justify this hostility because they have determined that Trump is an existential threat to democracy and the worst presidential nominee in history and can’t be treated as an ordinary candidate. \\nSo why do the polls show the worst nominee ever running neck-and-neck with the candidate President Barack Obama has praised as the most qualified person ever to run for president? \\nDo these editors know something that tens of millions of American voters are missing? Whose job is it really to decide what poses a threat to our democracy — a handful of editors in the corporate media or the voters? \\n“This election has exposed as never before that there is indeed a media elite, bound together by class and geography, that is utterly clueless about its own biases and filters,” freelance investigative reporter Kenneth Silverstein wrote this week in the Observer. \\nSilverstein had some unkind words for Trump, describing him as an “addled, reckless, dangerous billionaire.” He added, however, that Trump’s success “may be a sad reflection of the complete breakdown of our political system, but it doesn’t make Trump’s appeal to a significant chunk of the electorate illegitimate.” \\nThe devastation of the industrial heartland, sinking wages, skyrocketing health-care costs, deep-seated economic insecurity fueling an opioid epidemic, and Clinton’s strong bent toward military interventionism “are highly rational reasons for any voter to consider casting a ballot for Trump,” Silverstein said. \\nHe went on to cite leaked emails showing Clinton campaign staff strategizing about how to plant stories with friendly journalists at the Times, Vox and MSNBC, among others, as well as deferential emails in return from journalists. \\nSilverstein acknowledged that he has an ax to grind because his own negative story for Fusion about a Clinton Foundation project in Colombia came under attack from the Clinton campaign. And this op-ed lambasting the media appeared in the Observer, which is owned and managed by Trump’s son-in-law, Jared Kushner — but, hey, it wasn’t going to be published by the Times. \\nThere is a long tradition in American politics of blaming the media when your message isn’t getting through. But in this case, as Trump narrows the gap with Clinton in the closing days of the race, it seems more like his message is getting through in spite of the media. \\nThis is how former House Speaker Newt Gingrich, a Trump ally, responded to a question this week from ABC’s Martha Raddatz about whether he really believed an election could be rigged against Trump: “I think that without the unending one-sided assault of the news media, Trump would be beating Hillary by 15 points,” Gingrich said. “The news media’s one-sidedness is the worst I’ve seen in my lifetime, and I’m old enough that that’s a fairly long statement.”'"}, "time": 1742562086.6959324}