{"duration": 0.05445575714111328, "input_args": {"text": "'Dutch Anti-Islam MP Wilders to Snub Hate Speech Trial AFP, October 28, 2016 \\nDefiant Dutch anti-Islam politician Geert Wilders said Friday he will refuse to attend his hate speech trial next week, dubbing it a travesty aimed at silencing him as the country prepares for 2017 elections. \\nThe trial opens on Monday before a three-judge bench with the far-right politician facing charges of insulting a racial group and inciting racial hatred for comments he made about Moroccans living in the Netherlands. \\n“It is my right and my duty as a politician to speak about the problems in our country,” Wilders said in a statement Friday, dubbing the case “a political trial, in which I refuse to cooperate”. \\nIt comes as opinion polls have shown his far-right Freedom Party (PVV) doing well ahead of March elections. \\nAfter riding high amid the migrant crisis, the party is now polling neck-and-neck with Prime Minister Mark Rutte’s Liberals each predicted to win between 25 to 29 seats in the 150-seat parliament. \\nSet to last until November 25, the trial focuses on a comment made at a March 2014 rally when Wilders asked supporters if they wanted “fewer or more Moroccans in your city and in the Netherlands?” \\nWhen the crowd shouted back “Fewer! Fewer!” Wilders answered: “We’re going to organise that.” \\n{snip} \\nWilders said Friday he would leave his defence in the hands of his lawyer Geert-Jan Knoops and instead “go to work” in the parliament in The Hague. \\n{snip} \\nJudges earlier this month dismissed arguments by Wilders’ lawyers that the trial was “politically motivated” adding they did not believe it will impact the PVV’s election campaign. \\nPoliticians “are granted broad freedoms of expression because of their official position,” the judges ruled last month. \\n“Precisely therefore politicians have an important role to avoid feeding intolerance by making these kind of public statements.” \\nWilders hit back Friday saying “it is a travesty that I have to stand trial because I spoke about fewer Moroccans.” \\n“Millions of Dutch citizens (43 percent of the population) want fewer Moroccans,” he claimed. \\n“Not because they despise all Moroccans or want all Moroccans out of the country, but because they are sick and tired of the nuisance and terror caused by so many Moroccans.” \\n{snip}'"}, "time": 1742563377.170589}