{"duration": 0.0780935287475586, "input_args": {"text": "'David Simon, creator of HBO’s famed crime drama The Wire, suggested that those who oppose Donald Trump should “pick up a goddamn brick” if the president fires special counsel Robert Mueller. [“If Donald Trump fires Robert Mueller and is allowed to do so, pick up a goddamn brick,” Simon tweeted Monday. “That’s all that’s left to you. ”  If Donald Trump fires Robert Mueller and is allowed to do so, pick up a goddamn brick. That’s all that’s left to you.  —   David Simon (@AoDespair) June 12, 2017,  The       —   whose credits also include the HBO drama Treme and the upcoming series The Deuce  —   continued to taunt social media users who accused him of inciting violence. “Given that you were provoked to a keyboard, inciting stupidity is a more likely plea bargain in my future,” he tweeted at one user on Tuesday. Given that you were provoked to a keyboard, inciting stupidity is a more likely plea bargain in my future. https:  .   —   David Simon (@AoDespair) June 13, 2017,  Simon was defiant, still, after another Twitter user said they would make the United States Secret Service aware of his tweet, which the user said appeared to condone violence against President Trump. “Don’t just call the Secret Service, ya rube,” he wrote. “Call the Justice League. They’re the first line of defense against disturbing rhetoric. Go big!” he said referring to the DC Comics superhero group. Simon has been a vocal critic of the president. In April, the producer slammed Trump’s proposed budget cuts, asking, “Anybody sentient among the       crowd that wants to take a crack at this?” Anybody sentient among the       crowd that wants to take a crack at this? https:  .   —   David Simon (@AoDespair) March 16, 2017,  According to a PBS News’ Judy Woodruff, Trump considered firing Mueller this week. The special counselor appointed to oversee the investigation into alleged connections between the president and Russia has reportedly hired several attorneys who have donated almost exclusively to Democratic politicians, according to CNN.   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742563726.2496767}