{"duration": 0.15703511238098145, "input_args": {"text": "'CHICAGO  —   J. Dennis Hastert, once among the nation’s most powerful politicians, was sentenced on Wednesday to 15 months in prison for illegally structuring bank transactions in an effort to cover up his sexual abuse of young members of a wrestling team he coached decades ago. In a hearing that was by turns harrowing and revelatory, Mr. Hastert publicly admitted for the first time to abusing his athletes, was confronted in emotional addresses by one of the former wrestlers and the sister of another, and faced a long, scathing rebuke from the judge. Mr. Hastert, 74, who made an unlikely rise from beloved   wrestling coach in Illinois to speaker of the House in Washington, sat slouched in a wheelchair in a federal courtroom here as a judge announced that he was rejecting pleas for probation from Mr. Hastert’s lawyers, as well as prosecutors’ endorsement of a shorter prison stay. While the sentencing hearing was, technically, about a violation of banking rules and regulations, the proceedings focused squarely on the underlying reason for Mr. Hastert’s puzzling bank withdrawals  —   his abuse of young wrestlers who had viewed him as a role model. “The defendant is a serial child molester,” said Judge Thomas M. Durkin of Federal District Court, as Mr. Hastert sat impassively, often staring downward, hands crossed on his lap. He added, “Some actions can obliterate a lifetime of good works. Nothing is more stunning than having ‘serial child molester’ and ‘speaker of the House’ in the same sentence. ” Mr. Hastert was not charged with sexual abuse because statutes of limitation for acts in the 1960s and ’70s have run out the judge noted pointedly that punishment for such a conviction would have been far worse. Illegally structuring bank transactions to keep such abuse secret  —   the felony count to which Mr. Hastert pleaded guilty  —   carried a maximum sentence of five years in prison. Mr. Hastert, whose date to report to prison has yet to be set, was ordered to pay $250, 000 in fines, never to contact his victims and to receive   treatment. “If there’s a public shaming of the defendant because of the conduct he’s engaged in, so be it,” Judge Durkin said. Mr. Hastert has had a series of illnesses since last year, including a stroke, a blood stream infection and a spinal infection  —   factors his lawyers and family members argued should be taken into account in the sentencing. They urged the judge to consider the entire arc of his life and career, including his years of public service. As Mr. Hastert prepared to address the judge, he used a walker to rise to his feet, but his voice was firm and clear. “The thing I want to do today is say I’m sorry to those I hurt and misled,” said Mr. Hastert, whose grown sons were in the courtroom. “I want to apologize to the boys I mistreated when I was their coach. What I did was wrong and I regret it. ” Mr. Hastert’s remarks followed a tearful, halting statement from one of his victims, Scott Cross, a former wrestler, who had never before spoken publicly about his abuse and who said that he had not even been sure whether he could bring himself to make his statement now. “As a high school wrestler I looked up to Coach Hastert  —   he was a key figure in my life,” said Mr. Cross, now 53 and a businessman who works in financial services in the Chicago area. From a podium just feet from Mr. Hastert’s wheelchair, Mr. Cross recalled abuse that occurred on a locker room training table when he was 17. “I felt intense pain, shame and guilt,” he said. He said that he had gone years without speaking of what had happened, even to his parents and closest friends. “I’ve always felt that what Coach Hastert had done to me was my darkest secret,” Mr. Cross said. The revelation that Mr. Cross was among Mr. Hastert’s victims caused a ripple through Illinois’s Republican Party, where Mr. Hastert had gotten his political start and had been a political mentor to Mr. Cross’s brother, Tom Cross, a former state House Republican leader. Judge Durkin noted that Mr. Hastert had recently unsuccessfully sought a letter of support from Tom Cross. Judge Durkin is the brother of another prominent lawmaker here, Jim Durkin, the Republican leader in the state House, and the judge had offered last year to recuse himself in the case. The sister of another victim, Stephen Reinboldt, spoke directly to Mr. Hastert, describing lonely, isolated years Mr. Reinboldt spent after repeated abuse by Mr. Hastert in high school until his death of AIDS in 1995. “You took his life, Mr. Hastert,” Jolene Burdge, the sister, said. “Not because he died of AIDS, but because you took his innocence and turned it against him. ” At one point, the judge stared down at Mr. Hastert from the bench, and questioned him about the victims, one by one. “You said you mistreated athletes. Did you sexually abuse Mr. Cross?” he asked. “I don’t remember doing that, but I accept his statement,” Mr. Hastert replied. “Did you sexually abuse Victim B?” Judge Durkin asked, referring to one of at least two other former wrestlers whose names have not been made public. Mr. Hastert paused. “Yes,” he said. “How about Mr. Reinboldt  —   did you sexually abuse him?” Judge Durkin asked. Mr. Hastert said that was “a different situation,” but eventually acknowledged the abuse. Patrick Collins, a former federal prosecutor in Chicago who has handled corruption cases including that of former Gov. George Ryan, a Republican, said that it was unusual for a judge to veer so far from the sentencing guidelines, which recommended no prison time or up to six months. “It’s extraordinary that the case was on its face a    financial structuring case with the conduct acknowledged, but the sentencing was about everything, essentially, but the structuring,” Mr. Collins said. Mr. Hastert’s fall from genial retired House speaker and hometown celebrity was sudden and steep. For decades, both in Washington and in Yorkville, on the edge of Chicago’s western suburbs, where Mr. Hastert had coached the local high school wrestling team to state championship, he had a reputation for appearing    and steady. Mr. Hastert, who had served in the Illinois legislature and was then elected to Congress, found himself catapulted to speaker in 1999, in part because he seemed to be a safe, agreeable option. After leaving Congress, he went on to become a lobbyist. He was charged last May with lying to the F. B. I. and making cash withdrawals in a way devised to hide the fact that he was paying $3. 5 million to a former wrestler for misconduct. The wrestler, whose name has not been revealed and who is identified in documents only as Individual A, told of abuse in a motel room during a wrestling camp trip when he was 14. After the payments began, around 2010, the federal authorities took notice of large, unexplained withdrawals Mr. Hastert was making from his bank. When told that large withdrawals had to be reported, Mr. Hastert began drawing smaller sums, prosecutors say, to avoid notice. The wrestler sued Mr. Hastert this week, saying he still owed him $1. 8 million of their   settlement. Before the hearing, a long list of supporters  —   from Mr. Hastert’s wife, Jean, to Tom DeLay, the former House majority leader  —   had sent letters to Judge Durkin. “He doesn’t deserve what he is going through,” Mr. DeLay wrote. But for nearly 45 minutes on Wednesday, Judge Durkin held forth in a passionate, often contemptuous tone, with little interruption. He said that Mr. Hastert had “manipulated” the F. B. I. and the United States attorney’s office, diverted their investigation and knowingly tried to “set up” Individual A, actions that were “intentional, thought out and desperate. ” The judge spoke broadly about child sexual abuse and the lifelong damage it inflicts. “Can you imagine the whispers, the   the sideways glances if you’re a    boy and you accuse the town hero of molesting you?” he said. He dismissed the defense’s arguments that Mr. Hastert was too old, frail or ill to be properly taken care of in a federal prison. And he ended with a blunt synopsis. “This is a horrible case  —   a horrible set of circumstances, horrible for the defendant, horrible for the victims, horrible for our country,” he said. “I hope I never have to see a case like this again. Court adjourned. ”'"}, "time": 1742562714.6401677}