{"duration": 0.015980243682861328, "input_args": {"text": "'By Chad Kautzer / filmsforaction.org \\nMy appeal to leftist comrades who think that not voting is a way to be a \"principled\" leftist, or that it\\'s leftist to choose a third-party candidate so you can vote in good conscience. These are not leftist positions (Yes, I dare to assert a basic standard for distinguishing liberal and Leftist positions). \\nIt would be leftist to organize a boycott of the vote, so that abstention was a collective act with a clear and practical goal. It would also be leftist to vote for a third-party candidate if it furthered a leftist project. Currently, neither of these is the case, so we can take them off the table. \\nLiberals are committed to an electoral system of politics and believe that politicians should \"represent\" their will. Indeed, many liberals want to completely identify with their candidates. This leads liberals to talk about voting their conscience or abstaining because they don\\'t want to have to choose between the lessor of two evils. The liberal illusion is that it could ever be otherwise (next time we\\'ll have candidates we can believe in!). \\nElections are always a choice between evils, but elections are only one component of leftist politics. We choose the candidates who will do the least amount of harm to our larger projects for radical change. And after voting, we get on with those projects - mobilizing at the grassroots, educating and organizing against oppression, capacitating our communities, and constantly challenging ourselves to be better friends and comrades. \\nWhen we vote, we do not endorse liberalism and we are not morally compromised (as liberals would assert). We are using whatever resources are available to us to realize leftist goals and sometimes that means little more than choosing a politician who represents the least opposition to those goals. \\nSo, leftist comrades, I say this with love: let\\'s shake off the liberal moralism of electoral politics and focus on what best enables the achievement of practical, leftist projects. This work is licensed under an Attribution-NonCommercial-ShareAlike 4.0 International License 4.3 ·'"}, "time": 1742628455.529619}