{"duration": 0.15804338455200195, "input_args": {"text": "'BERKELEY, Calif.  —   A vain politician runs for the presidency, short on specifics but long on bluster, inveighing against a religious minority and promising to make America prosperous again. Sound familiar? It did to the leaders of Berkeley Repertory Theater, who, casting about for a show to coincide with the fall presidential campaign, hit upon an idea: They would write a new adaptation of Sinclair Lewis’s 1935 novel imagining the election of an American demagogue: “It Can’t Happen Here. ” The play, which began previews on Friday, is among scores of efforts by theaters across the United States to provoke discussion and reflection about this year’s unusual election, and the unease that it has exposed. Some, like Berkeley Rep, explicitly aim to prompt discussion about Donald J. Trump, whose candidacy has alarmed many in the   theater world others have opted to stage works in which characters grapple with issues debated during the campaign, like immigration or economic inequality. “Art shouldn’t fall into any kind of simplistic, didactic haranguing, and topicality is a dangerous thing, because you always get outstripped by reality,” said Tony Taccone, the longtime artistic director of Berkeley Rep, and a   with Bennett S. Cohen, of the new adaptation. However, he said, “With the election looming, it felt incumbent on us to respond if we could. ” On a recent afternoon, the cast and crew of “It Can’t Happen Here” gathered at Berkeley Rep’s administrative campus in a   warehouse once occupied by the North Face, to run through the play one last time before moving into a downtown Berkeley theater. The designers had embraced the    feel of a campaign: The set featured flags and drums and images of national parks, and the sound design included a Sousa march. Fourteen actors played nearly 50 roles, and practiced egging on the audience to cheer and jeer with the onstage pageantry. The theater printed     lapel stickers bearing the play’s name for patrons, meant to echo the ubiquitous “I Voted” stickers leaders considered, but decided against, holding a series of related discussion programs, thinking that the culture is already saturated with election talk. The play is scheduled to close Nov. 6, two days before the election. Around the country, theaters are acknowledging the election in various ways. On Broadway, “Kinky Boots” has created a video and website to promote voter registration, while “Hamilton” cast members are planning to register voters outside their theater on Wednesday and Saturday Off Broadway, “Avenue Q” has added Hillary Clinton and Donald Trump puppets to its company. Some theaters are staging Mike Daisey’s comedic monologue “The Trump Card,” while many others have brought back plays about political figures, from Frank Rizzo in Philadelphia to Lyndon Baines Johnson in Cleveland and Costa Mesa, Calif. In Washington, five prominent theaters are holding a series of free Monday night readings of politically themed plays, including “Ivanka: A Medea for Right Now,” a fictional work about Mr. Trump’s daughter by the playwright Joshua Harmon. Berkeley Rep hit upon “It Can’t Happen Here” about eight months ago, when an unexpected hole opened in its fall season. Lisa Peterson, who had signed on to direct a show for Berkeley Rep, Googled the phrase “it can’t happen here” and stumbled across the Sinclair Lewis novel, which she was not familiar with Mr. Taccone had read the book in high school and thought it would work. The novel is about a Vermont newspaper editor, Doremus Jessup, who opposes a demagogic presidential candidate, Berzelius Windrip it is a satirical and melodramatic cautionary tale, in which Mr. Windrip wins the election, imposes martial law and seizes control of newspapers his regime arrests and even kills his critics. Lewis, who had already won the Nobel Prize for literature, wrote the novel against an ominous backdrop: Hitler and Mussolini were in power in Germany and Italy, and Huey Long, a senator and former governor who wielded unusual power in Louisiana, was preparing to run for the American presidency. There are some striking similarities between the campaign pitches by the fictional Mr. Windrip and the real Mr. Trump  —   both men were even nominated for the presidency in Cleveland. But there are significant differences: Windrip, among other things, is a Democrat (in the novel, the Republican nominee winds up fleeing to Canada to plot a rebellion) and prone to warnings against Jews Mr. Trump, of course, is a Republican who has focused his concern on Muslims. In their new adaptation, Mr. Taccone and Mr. Cohen have sharpened the echoes. They wrote the campaign remarks by Windrip after watching stump speeches by Mr. Trump they have one of their characters comment on the role of the news media (“The more offensive his remarks, the more papers get sold”) and, in a dig at Hillary Clinton’s reference to some Trump supporters as belonging to a “basket of deplorables,” a character explaining Windrip’s popularity says, “It’s not because they’re all stupid and prejudiced and deplorable. ” The novel was first adapted into a play and presented around the country in the late 1930s by the Federal Theater Project  —   Lewis himself appeared in one production, in Cohasset, Mass. as the journalist Jessup. But Berkeley Rep deemed that adaptation unrevivable (“it’s ghastly,” said Susan Medak, its managing director) so Mr. Taccone and Mr. Cohen, with the blessing of the Lewis estate, set about writing a new one in unusually short time. “What we saw as the risk was that Trump would not make it through the primaries, and the piece would feel irrelevant,” Ms. Medak said. “But even if the elections ended up not being about Trump  —   and obviously we hoped they wouldn’t be  —   there was something about this that felt as though it was speaking to what the American public was concerned about, regardless of who the candidate was. ” Noting that the 1930s adaptation by Lewis and J. C. Moffitt was presented by multiple theaters around the country, Berkeley Rep this month invited theaters, universities and libraries across the country to hold readings of the play 30 organizations signed up in the first week. “It’s an outrageous story,” said Tom Nelis, the actor (last seen on Broadway in “The Visit”) portraying the journalist Jessup in Berkeley. “But you can’t watch it and not think it’s plausible. ” Had enough of CNN? Ready for politics with a dose of stage drama? Berkeley Rep’s new adaptation of “It Can’t Happen Here” is just one example of how theaters around the country have prepared programming to reflect the American presidential campaign. Some are mounting familiar works, from “Coriolanus” to “All the Way,” thinking that their themes will resonate especially strongly this fall others are focusing on new shows. Here are some examples: 45 PLAYS FOR 45 PRESIDENTS At the Merrimack Repertory Theatre in Lowell, Mass. An evening of   plays, one for every president, followed by an audience vote on whether it would like to see another two minutes about Donald J. Trump or about Hillary Clinton. Through Sunday. IT CAN’T HAPPEN HERE A new adaptation, by Tony Taccone and Bennett S. Cohen, of the 1935 novel by Sinclair Lewis, at Berkeley Repertory Theater. Through Nov. 6. LET TRUMP BE TRUMP A comedy by John Krizel at the Davenport Theater in Manhattan. Oct. 11 to 13. THEATRICAL SELECTIONS Five   play readings, at Arena Stage, the Kennedy Center, Shakespeare Theater Company, Signature Theater and Studio Theater in Washington. Oct. 3 through Nov. 7. THE TRUMP CARD A monologue written by Mike Daisey is being performed at theaters around the country. Among them are the Broad Stage in Santa Monica, Calif. (on Thursday) and the La Jolla Playhouse in San Diego (through Sunday). VICUÑA A new satirical play by Jon Robin Baitz at Center Theater Group in Los Angeles about a tailor whose clients include a real estate tycoon and star of reality television who becomes a nominee for president. Oct. 23 through Nov. 20. SCENES FROM COURT LIFE, OR THE WHIPPING BOY AND HIS PRINCE, A new play by Sarah Ruhl explores parallels between the Stuarts of Britain and the Bush family. Yale Repertory Theater, Friday through Oct. 22. THE TRIAL OF AN AMERICAN PRESIDENT A jury made up of audience members “tries” George W. Bush at the Lion Theater in Manhattan. Through Oct. 15. WINTER WHEAT This play at the Barter Theater in Abingdon, Va. explores the passage of the 19th Amendment giving women the right to vote. Oct. 6 through Nov. 12. DOOMOCRACY A Creative Time installation by Pedro Reyes at the Brooklyn Army Terminal pegged to Halloween and the presidential election. Oct. 7 through Nov. 6. THE REAL AMERICANS A solo show at the Marsh in San Francisco in which Dan Hoyle recounts his interviews with residents of   America. ThroughOct. 15. VOTE OR DIE LAUGHING An evening of “postmodern political vaudeville” from Culture Clash at the Valley Performing Arts Center in Northridge, Calif. explores the intersection of Election Day and the Day of the Dead. Nov. 1.    Presented on election night at the Baltimore Museum of Art by Center Stage. Playwrights will take prompts from attendees and generate short plays about the election. Nov. 8. AN ELECTION NIGHT HOOTENANNY at Joe’s Pub in Manhattan will feature Michael Friedman performing songs based on voter interviews. Nov. 8.'"}, "time": 1742563361.7028644}