{"duration": 0.015839338302612305, "input_args": {"text": "'Toni Airaksinen, College Fix, November 4, 2016 \\n{snip} \\nThe Rutgers University student who hosted anti-feminist provocateur Milo Yiannopoulos for his first U.S. college event says the student newspaper fired him Monday because of his conservative views. \\nAviv Khavich published his final column for The Daily Targum Sunday night, arguing that immigration enforcement is not “anti-immigrant.” \\nHe spoke as an immigrant himself, born in Israel after his Ashkenazi Jewish parents fled Belarus in the wake of the Soviet Union’s collapse. \\nBut the trigger for the firing may have been Khavich’s demand that his column include the phrase “illegal aliens” to describe those in the country illegally. \\nIt was the final straw for the Daily’s editor, who said Khavich repeatedly fought over “stylistic” editing changes to his columns over the past several months. \\n{snip} \\nBut two of his last three [columns] were about immigration. Khavich opposes accepting Syrian refugees into America as a security threat, and his final column Sunday said flatly: “Justice is mass deportation. Justice is respecting my [legal immigrant] family and millions of others like us.” \\nKhavich told The College Fix in a phone interview that “every instance of ‘illegal alien’ I wrote was changed to ‘undocumented immigrant’” by his editors. “But I considered it a part of my opinion to not use” the latter term, which he finds “politically correct and also inaccurate.” \\nWhen Khavich complained to his editor about the edited draft, she said the “illegal” edit came from the top: Editor in Chief Dan Corey wanted the column to follow Associated Press Style. \\nThe AP Stylebook was revised three years ago to disapprove of using “illegal” to describe a person, as opposed to an action, after having affirmed “illegal immigrant” just a year earlier . \\nBut AP Style also frowns upon “undocumented”–the term used in Khavich’s published column–because the term is “not precise.” Khavich notes that federal law uses the term “alien.” \\nHis editor was “not happy” after being confronted, Khavich said, and he was fired the next day. \\n{snip} \\n“At the slightest questioning of their ‘unbiased editing,’ they jump at the excuse to rid themselves of someone who has been challenging their narrative,” he wrote in The Tab. \\n“I was writing articles that very strongly challenged narratives,” he told The Fix. “I am sure that it was a termination was based on political bias.”'"}, "time": 1742628528.620935}