{"duration": 0.10128498077392578, "input_args": {"text": "\"We Are Change \\nObama’s brother from Kenya, Malik, wants him to Pardon Julian Assange. It seems hate of the international whistle-blower Organization doesn’t run in the family. Malik told Obama, via twitter, “brother please pardon Julian Assange! All he is doing is freeing emails.”\\n@POTUS brother please pardon Julian Assange! All he is doing is freeing emails\\n— Malik Obama (@ObamaMalik) October 26, 2016 \\n\\nSomething that based Obama said himself was that he was for more transparency in government, but that was Obama before he was in office for a few years, that was campaign Obama. Then during his first term he said this about transparency and the truth:\\n“The only people who don’t want to disclose the truth are people with something to hide.” ~Barack Obama\\n\\nThose promises were just that, promises, like every year we get together and pretend voting is going to change something; and listen to candidates feed us bull shit when every year election fraud has been the centralized problem that subverts democracy like the plague.\\nAnd now we have potentially the worst two “choices” for presidential history; both have a corrupt past. We the American people are being asked to forgive one of these two people: Donald Trump for his potentially corrupt deals with the mafia, or Hillary with her long list of corruption since Arkansas in the 1980s, which has expanded since Wikileaks began leaking John Podesta’s emails, confirming that Donald Trump’s nickname “Crooked Hillary” was accurate. Hillary Clinton has cronies in power already; the other, new to politics and a former entertainer and businessman, is Donald Trump. One, Russian President Vladimir Putin has said, if voted in, we are going to war; the other, he said there would be peace.\\nThe emails that wikileaks has been releasing have revealed a multitude of corruption revelations behind both the Clinton Campaign, exposing Hillary Clinton’s character and demeanor itself. Exposing her pay-to-play schemes as Secretary of State, lies to the American public on issues while in secret taking “big donations” for speeches, the opposite of what she says she supports, and something she calls a “public and private opinion” on issues, which most logical people would call lying and deceiving voters.\\nObama, himself, lied for Hillary and said he didn’t know about the private server which Wikileaks has exposed. Obama was sending emails back and forth to Hillary’s email address proving that he did indeed know about the server and that the email she was using wasn’t a state.gov-provided email account.\\nSo Obama’s brother wants him to forget about all that, the Cablegate scandal which, again, Hillary Clinton was apart of, and more? To say the least, Wikileaks and its founding owner Julian Assange have a long rap sheet with the Obama administration. They have crossed paths many times and Malik wants Barack to just forget about it. That’s unlikely but, hey, it’s the thought that counts, right?\\nIn another twist of fate Malik Obama also supports Donald Trump sporting the # Africans4Trump hashtag in his twitter bio, complete with Donald Trump’s signature hashtag #MAGA. He also has a series of tweets that are saying most of what every other normal American, without a President as a brother, is saying, “This election looks rigged.” That’s right Obama’s brother believes in the dreaded chupacabra election fraud monster that visits every 4 years, just another thing that sets him apart from his brother.\\nHe additionally mocked Hillary’s pay-to-play scandal tweeting the 100K check he was accidentally sent by a mogul in Tehran . I wonder if Malik has seen the Project Veritas videos ?\\nDo not let my brother rig the election @realDonaldTrump \\n— Malik Obama (@ObamaMalik) October 26, 2016 \\nAmerica always lectures Afrika about elections but this election looks rigged! Vote Trump anyway\\n— Malik Obama (@ObamaMalik) October 27, 2016 \\nDo not cheat Colorado or New Hampshire. I will know and I will be mad\\n— Malik Obama (@ObamaMalik) October 27, 2016 \\n\\nObama also hates Trump so are we sure these two are really related? Someone get Maury for a DNA test. Apparently Malik also wonders if they are related sometimes too.\\nWell they are half-brothers so that may explain the chemical imbalance in the force some what..\\nAll I know is that my brother has done nothing for the Kenyan side of his family. I wonder if we are related sometimes.\\n— Malik Obama (@ObamaMalik) October 25, 2016 \\n\\nWikileaks additionally in a nod to Malik, tweeted out “Assange & Kenya’s background” with a link to “The looting of Kenya under President Moi.” \\nPresident Obama's brother calls for @POTUS to pardon Assange https://t.co/BjtaY2wrJ1 \\nAssange & Kenya, background: https://t.co/BQ8EqCXTqD \\n— WikiLeaks (@wikileaks) October 26, 2016 \\n\\n \\n \\n \\nThe post Obama’s Brother Malik Supports Trump AND Wants Obama To Pardon Julian Assange appeared first on We Are Change .\\n\""}, "time": 1742563347.5344825}