{"duration": 0.037078142166137695, "input_args": {"text": "'Report: Trump hosted cocaine-fueled parties with underage girls ‹ › GPD is our General Posting Department whereby we share posts from other sources along with general information with our readers. It is managed by our Editorial Board Western firms primed to cash in on Syria’s oil and gas ‘frontier’ By GPD on October 26, 2016 Once Syria conflict resolved, prospects for Syrian offshore production\\u200a\\u200aare high. by Nafeez Ahmed US, British, French, Israeli and other energy interests could be prime beneficiaries of military operations in Iraq and Syria designed to rollback the power of the ‘Islamic State’ (ISIS) and, potentially, the Bashar al-Assad regime. A study for a global oil services company backed by the French government and linked to Britain’s Tory-led administration, published during the height of the Arab Spring, hailed the significant “hydrocarbon potential” of Syria’s offshore resources. The 2011 study was printed in GeoArabia , a petroleum industry journal published by a Bahrain-based consultancy, GulfPetroLink, which is sponsored by some of the world’s biggest oil companies, including Chevron, ExxonMobil, Saudi Aramco, Shell, Total, and BP. GeoArabia’s content has no open subscription system and is exclusively distributed to transnational energy corporations, corporate sponsors and related organisations, as well as some universities. Authored by Steven A. Bowman, a Senior Geoscientist for the French energy company CGGVeritas, the study identified “three sedimentary basins, Levantine, Cyprus, and Latakia, located in offshore Syria” and highlighted “significant evidence for a working petroleum system in offshore Syria with numerous onshore oil and gas shows, DHIs (direct hydrocarbon indicators) observed on seismic, and oil seeps identified from satellite imagery.” Read Full Extensive Report at Insurge Intelligence >>>> Related Posts:'"}, "time": 1742563830.2768939}