{"duration": 0.03239893913269043, "input_args": {"text": "'  \\nIt was recently noted that superhero costumes were far outpacing princess ones as children’s Halloween outfits of choice this year . But what would be dead last? Probably the hackneyed political groan-inducer dreamed up by Liz Cheney for her daughter. \\nFor inexplicable reasons, Liz Cheney – daughter of America’s most detestable former vice president, Dick – decided to staple a bunch of pieces of office scrap paper onto her daughter and send her to school as “Hillary Clinton’s deleted emails.” Ugh. \\nOn social media, proud mom Liz even boasted about the costume. Trick or treat? Our daughter Gracie went to school in the scariest of Halloween costumes: Hillary Clinton’s deleted emails. #HappyHalloween pic.twitter.com/Gs33p78FJT \\n— Liz Cheney (@Liz_Cheney) October 31, 2016 \\nIt’s hard to imagine a less “cool” thing to go as than the living embodiment of a manufactured right-wing scandal that only aging conservatives cared about in the first place. Teens, whom already lean heavily liberal, probably won’t spontaneously become registered Republicans because a classmate showed up covered in paper. Making matters worse, the costume’s gimmick isn’t even obvious. Kids will have to go up to Gracie and ask “So what are you supposed to be?” And she will have to respond, time and again, “I’m Hillary Clinton’s deleted emails. Those things your grandfather was yelling about at the family reunion and quite literally nobody else is interested in.” \\nAnd because irony died and was buried in a shallow grave this year, Liz Cheney didn’t bother to justify her own father’s carelessness with emails. Forget the 33,000 emails, the Bush Administration “lost” or “deleted” over 22 million. Guess whose emails “disappeared” most often? \\nMost troubling, researchers found a suspicious pattern in the White House email system blackouts, including periods when there were no emails available from the office of Vice President Dick Cheney. “That the vice president’s office, widely characterized as the most powerful vice president in history, should have no archived emails in its accounts for scores of days—especially days when there was discussion of whether to invade Iraq—beggared the imagination,” says Thomas Blanton, director of the Washington-based National Security Archive. \\nI guess stapling 22 million emails to her daughter would be a bit impractical, though. Maybe they should have stuck with a superhero costume. \\nFeatured image via Twitter'"}, "time": 1742562682.344824}