{"duration": 0.08128571510314941, "input_args": {"text": "'During his speech at CPAC on Friday, President Trump dubbed CNN the “Clinton News Network,” and said, “we are fighting the fake news. ” And that he’s “against the people that make up stories, and make up sources. They shouldn’t be allowed to use sources unless they use somebody’s name. ”  Trump reacted to some of the applause during his speech by saying, that the “dishonest media” would say he didn’t get a standing ovation because “everybody stood and nobody sat. So, they will say, ‘He never got a standing ovation.’ They are the worst. ” He later added, “I want you all to know that we are fighting the fake news. It’s fake, phony, fake. A few days ago, I called the fake news the enemy of the people and they are. They are the enemy of the people, because they have no sources. They just make them up when there are none. I saw one story recently where they said nine people have confirmed, there are no nine people, I don’t believe there was one or two people, nine people.   …     They make up sources. They’re very dishonest people. In fact, in covering my comments, the dishonest media did not explain that I called the fake news the enemy of the people, the fake news. They dropped off the word ‘fake,’ and all of a sudden, the story became the media is the enemy. ” Trump further stated that he wasn’t against the media and didn’t mind negative stories if he “deserved” them. He added, “I’m against the people that make up stories, and make up sources. They shouldn’t be allowed to use sources unless they use somebody’s name. ” After saying that there were good reporters out there, Trump concluded by referencing the “Clinton News Network” and saying, “I mean, it’s a very sensitive topic, and they get upset when we expose their false stories, they say that we can’t criticize their dishonest coverage because of the First Amendment.   …     I love the First Amendment, nobody know  —   loves it better than me, nobody. I mean, who uses it more than I do? But the First Amendment gives all of us, it gives it to me, it gives it to you, it gives it to all Americans, the right to speak our minds freely. It gives you the right, and me the right to criticize fake news, and criticize it strongly. And many of these groups are part of the large media corporations that have their own agenda, and it’s not your agenda, and it’s not the country’s agenda. It’s their own agenda. they have a professional obligation, as members of the press, to report honestly, but, as you saw, throughout the entire campaign, and even now, the fake news doesn’t tell the truth. ” Follow Ian Hanchett on Twitter @IanHanchett'"}, "time": 1742564165.2033231}