{"duration": 0.04654884338378906, "input_args": {"text": "'Vladimir The Great: Russia’s Refurbished Empire November 01, 2016 NEW BOSS: A mural of Russia’s president covers the wall of a residential building in Simferopol, Crimea, August 19, 2015. The message reads: \"Ours\". REUTERS/Pavel Rebrov \\nRussia has begun rebuilding a chain of military installations from Crimea to Kaliningrad, with 18 new sites near Sevastopol alone. Russia has reoccupied the missile bunkers that dot the verdant hills along Crimea’s southern coast. Villager who worked at Crimea base: “It is a functioning military base with an anti-ship missile system.” Russia is creating a chain of radar stations on rocky hilltops around Crimea. Local villager: “There is a military base here, air defense system and missiles. There are air defense systems on every cape here.” On the outskirts of the port city of Sevastopol sits another radar station called “Dnepr.” Russian newspaper Izvestiya: Moscow will restore the Dnepr station so it can “detect launches of ballistic, cruise and hypersonic missiles from the Black Sea and Mediterranean Sea area.” In Crimea region Russia has 18 sites, including naval bases, radar stations and airfields. Refurbished Russian military facilities now stretch north in an arc through western Russia to Kaliningrad. Russian Prime Minister Dmitry Medvedev in Feb: “We have, in effect, slid into a new Cold War.” Britain’s Defense Minister Michael Fallon in Sep: London was concerned about military buildup in Crimea “and indeed the militarization of the Black Sea region generally. Both Bulgaria and Romania feel very threatened.” Since May: Romania has hosted a U.S.-controlled international missile shield, operational by late 2018. Poland is hosting the other main land-based component in the shield. Washington: The shield is designed as a defense against Iranian missile strikes. Russian President Vladimir Putin: The system and NATO are both threats to Russia’s security, our country will retaliate. \\n(SIMFEROPOL, CRIMEA) The missile bunkers that dot the verdant hills along Crimea’s southern coast are known locally as Object 100. Until recently, tourists paid $50 to visit the crumbling and abandoned former Soviet sites, which served during the Cold War as a defense against naval attack from the Black Sea. \\nNow the bunkers are coming back online. After Russia took control of Crimea from Ukraine in 2014, signs went up in the woods around the sites warning visitors against entering a “forbidden zone of the Russian Ministry of Defense.” A resident of a nearby village who said he was employed at the base last year said Russian soldiers had re-occupied the sites and blocked roads leading into the area. He was unable to say when the Russian soldiers arrived. \\n“It is a functioning military base with an anti-ship missile system,” the villager told a Reuters reporter who visited the area in July. \\nThe bunkers are just one small part of a new Russian program to militarize the Crimean peninsula. Based on recent site observations by Reuters, accounts from locals, media reports and official Russian data, Moscow has reanimated multiple Soviet-built facilities in the region, built new bases and stationed soldiers there. \\nCrimea sits at the southern end of a line of new and refurbished Russian military facilities that stretches north in an arc through western Russia and ends in the country’s Baltic outpost of Kaliningrad. \\nThe military buildup is echoed in NATO countries such as Poland and the Baltic states, where U.S. forces are beefing up patrols and conducting more frequent exercises.'"}, "time": 1742563660.896817}