{"duration": 0.0160064697265625, "input_args": {"text": "'A    staffer for Rep. Dana Rohrabacher ( ) was knocked unconscious by   protesters as she attempted to leave her office, according to a report from CBS Los Angeles. [Kathleen Staunton, who works as Rohrabacher’s district director, had the door of her Huntington Beach office yanked open in front of her as she tried to leave, causing her to trip, hit her head, and fall unconscious. A    girl also got caught up in the incident, but thankfully was not harmed.  In a statement, Rohrabacher said that he was “outraged beyond words that protesters who mobbed my Huntington Beach office violently knocked down my faithful district director, Kathleen Staunton, causing her to be hospitalized. ” “And, yes, deliberate or not, the incident came as part of a mob action that not only intimidates but coerces. Though the protesters think of themselves as idealists, they engaged in political thuggery, pure and simple,” he continued. Rohrabacher Outraged by Assault on his District Director by ‘Indivisible’ Mob https:  .   —   Dana Rohrabacher (@RepRohrabacher) February 15, 2017,  The protests were organized by a group known as Indivisible OC, whose stated aim is to “resist against the Trump agenda. ” However, the group failed to take responsibility for the injury, instead claiming they were handing out Valentines Day cards. Regarding the ”tussle” at @DanaRohrabacher’s office:https:  .  pic. twitter.   —   Indivisible OC (@indivisible_oc) February 15, 2017,  “When Megan Blash and her    daughter, Lola, arrived at Rep. Dana Rohrabacher’s office to hand deliver a Valentine’s Day card, they were met with a shut and locked door,” the group said in a statement. “Rep. Rohrabacher’s disdain for visiting constituents led to Lola sliding her card under his door, which led to a staffer accidentally opening the door on Lola’s head and the following   ‘tussle,’” they continued. The police did not make any arrests. You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742628571.8154206}