{"duration": 0.07300901412963867, "input_args": {"text": "'One of the persistent tragedies of Android, Google’s   mobile operating system, is that it continues to be better in theory than in reality. The search company has spent more than a decade perfecting its software, and in the abstract, Android is now just as pristinely   as Apple’s iOS. But almost nobody buys Google’s idealized version of Android instead, most people buy a version that has been chewed up and predigested through the    supply chain, an intestinal pathway that never fails to transform good software into heaps of steaming code. For Android phones, this usually means loads of terrible, unnecessary apps installed by carriers and by the phone manufacturer itself. That’s why I was puzzled last week when the European Union opened a strange new front in its antitrust inquiry against Google. Contrary to what you might have concluded from looking at your phone, the regulators argue that Android’s problem isn’t too many preloaded apps  —   it’s too few, and it’s all Google’s fault. “Based on our investigation thus far, we believe that Google’s behavior denies consumers a wider choice of mobile apps and services and stands in the way of innovation by other players, in breach of E. U. antitrust rules,” Margrethe Vestager, the European commissioner for competition, said in a statement. The charges make sense in the abstract. Google makes the world’s most popular mobile operating system, and some of its licenses do compel phone makers to include several Google apps, even if they just want to include the Google Play app store. On paper, that may constitute unfair “bundling,” one of the sins that did in Microsoft at its apex in the late 1990s. Yet the European charges miss the messy reality of life on Android, which is clear to anyone who studies the mobile software business: Android phones come teeming with   apps, often to the point of frustration for users. The search company appears powerless to keep many of them off people’s devices, even when doing so might help its business. There’s no better evidence for this than the meteoric rise of Facebook, Google’s archrival, which announced another blowout earnings report on Wednesday  —   with much of its revenue coming from ads on Android phones. Facebook’s numbers show the primary weakness in the European Union’s case: If Google’s grand plan really is to keep rivals off Android phones, it sure is doing a poor job of it. Representatives for the European Commission and for Google declined to comment for this column, citing the current regulatory process. In a statement last week responding to the E. U.’s statement of objections, Kent Walker, Google’s general counsel, said the company would aim to show regulators that Android has been “good for competition and for consumers. ” The Federal Trade Commission is also looking into Android. Harry First, a law professor at New York University who studies antitrust issues, says the key difficulty for regulators in this case is that the tech world has changed radically since the Microsoft antitrust case. Back then, Microsoft managed to outflank rivals like Netscape by bundling its Internet Explorer browser with its Windows operating system, and by using licenses and payments to prevent computer makers from installing competing browsers. “In the Microsoft era people were unfamiliar with downloading, and nothing was as effective as getting the browser installed by the O. E. M. s,” he said, using the abbreviation for original equipment makers, or computer manufacturers. “But now, I’d be surprised if people aren’t fully at ease with downloading things from app stores, and people are familiar with having more than one app on their phone that does the same thing,” he said. “The E. U. has to tell an exclusion story, but it’s hard for me to see the exclusion story here. ” Consider, for instance, the market for messaging apps. Google runs a messaging service called Hangouts that comes bundled with many Android phones. If you scoured the globe I’m sure you’d find people who regularly use and love Hangouts, just like you could find people who regularly listen to Nickelback. But Hangouts is clearly no messaging juggernaut. In much of the world, that title belongs to two apps owned by Facebook  —   Messenger, which has 800 million active users a month, and WhatsApp, which has more than a billion. (Google has never disclosed the Hangouts user base analysts I spoke to estimated that its share of the messaging market was in the single digits.) Then there’s the popularity of the main Facebook app. As its chief executive, Mark Zuckerberg, has acknowledged, the company was late to realize the importance of mobile phones for years, its smartphone app was a slow, kludgy mess, and until just a few years ago it had no mobile revenue to speak of. Google, meanwhile, bundled its own social network, Google Plus, with Android phones. So if you were looking at the market a few years ago through the eyes of an E. U. antitrust regulator, you might have anticipated some trouble for Facebook on Android phones, and you might even have ventured that Google Plus would become a hit. After all, here was a small,   upstart pitted against a   giant that owned the operating system. Of course, that’s not how things turned out. Google Plus is now all but dead. And Facebook did not just survive the shift to mobile phones, it became the unstoppable force in the industry. Facebook now derives the vast majority of its revenue from mobile ads. Its sales are growing at a breathtaking clip. People now spend more time on the Facebook app than doing anything else on their phones. Facebook’s embedded web browser  —   which opens if you click a web link from within the Facebook app  —   is now used to access nearly as many web pages as the included web browsers on Android and iOS, according to a report by the research firm ScientiaMobile. How did Facebook get so popular on phones? On the whole, it happened the   way: People loved Facebook, they had no trouble finding it in mobile app stores, and they began to download and use it. In other words, unlike in the desktop era ruled by Microsoft, Google’s platform dominance on mobile phones does not appear to have posed any hindrance to a competitor’s rise. The same appears to be happening with other Google rivals. Google bundles its cloud storage system, Drive, with Android, but that hasn’t stopped Dropbox from gaining 500 million downloads on Android phones. Google bundles its music service with Android, but with 30 million paying subscribers, it is Spotify, not Google, that is the dominant force in streaming music. (Google has not disclosed its subscriber numbers.) The E. U.’s objections go beyond the supposed restrictions that Google places on Android’s app ecosystem. Another key charge involves Google’s dominance in web search. Regulators say Google ensures that it remains Android’s dominant search engine both by requiring phone makers to install the Chrome browser on their phones and, in some instances, by paying manufacturers to position the Google Search app on the phone’s home screen. Mr. First, the law professor, said the search issue isn’t as   as the question of whether Google has restricted rival apps. But he noted that the general flexibility of Android  —   the fact that, in general, Google makes it pretty easy for device makers and users to tinker with the software  —   cuts in Google’s favor. “I have this new Samsung Galaxy S5 that I haven’t used before, so I thought let’s see what happens if I try to install DuckDuckGo,” he said, referring to the   search engine. “So I downloaded it, that was easy to do. And the first time that I searched for something I got a prompt that said, ‘Which one do you want to use  —   and do you want to use it just once or always? ’” Mr. First said the interaction was noteworthy: Android easily let him download a rival to Google’s offering, and it even asked him if he wanted to set the rival as a default. “It’s hard to see how the commission could do better than that,” he said.'"}, "time": 1742628540.66325}