{"duration": 0.03906655311584473, "input_args": {"text": "'There is “no point” putting Muslims in Britain under scrutiny after three terror attacks in three months, according to Baroness Sayeeda Warsi, who argued the UK should include Islamophobia in its definition of “extremism”. [Asserting that Britain’s relationship with its resident Muslims should be reset from scratch, Warsi demanded an end to pressure on the Muslim community, which she declared to be united in fighting terror.  Highlighting how “imams and young people have taken to the streets” and “Muslims have raised money for the victims” the former Conservative Party chairman said Muslims in Britain have played their part in opposing Islamist terror attacks and suggested anger at terror attacks is even stronger within the Muslim community than amongst the general public. “I’ve never seen as much anger. The language used to describe the terrorists has never been sharper, angrier, and, I would say, the level of anger towards the terrorists from British Muslims is even greater than it is within the mainstream,” she said. Because of this, the Baroness urged the government to show restraint in its response to terrorism, telling The Guardian: “There’s no point saying we need to go deeper into the Muslim community, because in all cases they reported them [the terrorists] it was obvious to them who was radicalised. ” According to Warsi, the government should instead be reviewing how it defines extremism, and consider Islamophobia to be a problem similar to that of Islamism. “There is still no definition of   extremism,” she lamented. “The only definition of extremism that exists within government policy is Islamism. We also have no definition of what is Islamophobia. ” The Baroness also condemned calls made by policymakers for Muslims to integrate into British society. “The majority of terrorists speak good English,” she insisted, pointing out that the perpetrators of many of the recent terror attacks lived Westernised lifestyles at some stage. Describing integration as “a   pastime” Warsi argued the only way the government can tackle the problem of extremist and “separatist” religious communities in Britain is by improving Muslims’ situation with regards to “economics, poverty, life chances”.'"}, "time": 1742563324.7528622}