{"duration": 0.03140735626220703, "input_args": {"text": "'A study conducted at the University of Toronto concluded that extreme protest tactics such as blocking traffic, damaging property, and rioting actually reduce popular support for the political movements that employ them. [The study, which was conducted by Professor Matthew Feinberg of the University of Toronto, is entitled “Extreme Protest Tactics Reduce Popular Support For Social Movements,” and suggests that unusual protest tactics such as rioting reduce support for the movements that choose to employ them.  Feinberg claims that he was inspired to study the effects of such forms of protests during his time as a graduate student at UC Berkeley, a time in which he claims he attended many protests himself. Feinberg and his graduate advisor at UCB began to wonder “which tactics would be more successful than others and which tactics could” backfire. Feinberg set up experiments in which research participants were exposed to videos of the protest tactics of members of animal rights groups, Black Lives Matter, and   protesters. Feinberg concluded that the more extreme a protest became, the less likely the participant was to support the movement. In an interview with Campus Reform, Feinberg claimed that participants were especially turned off by the   protesters who chose to block traffic. “What we found most startling was in the   protests. When participants were exposed to the traffic blocking video —  the participants regardless of their political ideology —  showed an increase in support when presented with that video,” Feinberg said. Asked about the recent riots at his alma mater in response to a visit by Breitbart Senior Editor MILO, Feinberg remarked that the protesters’ conduct could definitely be considered “extreme protest behaviors,” suggesting that their efforts in attracting support to their movement have likely backfired.'"}, "time": 1742562246.7285016}