{"duration": 0.03854012489318848, "input_args": {"text": "'Go to Article \\nThe wickedness of the Hillary Clinton campaign knows no limits. When emails were leaked, Clinton’s campaign manager sent an email to John Podesta suggest not that they admit the truth and repent, but attempt to deceive the American people further by putting out their own leaks as a decoy. \\nThe Daily Caller reports: \\nFormer Secretary of State Hillary Clinton’s presidential campaign manager wanted to leak an announcement — presumably officially announcing her presidential candidacy — as a “decoy” after the New York Times first reported her email scandal in March 2015. \\n“I think we should get a credible leak out that we’re announcing on the 20th. As a decoy,” campaign manager Robby Mook told Clinton adviser John Podesta in a March 12, 2015, email 10 days after the New York Times story broke. The email was made public Monday by Wikileaks. \\nCompleting this poll entitles you to Daily Caller news updates free of charge. You may opt out at anytime. You also agree to our Privacy Policy and Terms of Use.Podesta didn’t respond to the email thread and Clinton’s campaign didn’t officially announce her candidacy until April 12, 2015. \\nClinton’s use of private email addresses and a homebrew server located in her New York mansion to conduct official Department of State business and communicate classified information continues to plague her candidacy, with less than one week before the presidential election. \\nWhat are some of these decoys? Several have shown up at the Baltimore Gazette . Then there is this from Reuters. \\nIsn’t this just the way Communists operate in putting out their propaganda? I mean we expect it in Communist countries, but this is just outright deception by the Clinton campaign. If you want to know what you would see in a Clinton White House, just recall the lies of Bill Clinton . Then, combine those with the lies of Barack Hussein Obama Soetoro Sobarkah and you might get close to the amount of lies you will be told daily from Hillary Clinton and her administration.  '"}, "time": 1742628400.3181946}