{"duration": 0.08205127716064453, "input_args": {"text": "'\\nBy Peter Koenig , November 15 2016 \\nThe elections may have been rigged, probably by both sides, as the elusive elite, or what’s also called the ’Deep State’, may be divided. It looks like the better ‘rigger’ emerged as the winner. The final popular vote count indicates a slight advantage of Hillary over Trump. Never mind, the system was purposefully designed un-democratically in the 18th Century by the Founding Fathers, who never really had the intention to create a truly democratic United States of America of equal rights for all. \\nBy Tony Cartalucci , November 15 2016 \\nThe so-called “alternative right” is at least posing as holding its breath over the prospects of Bush-era Neo-Conservative John Bolton being appointed as US Secretary of State. However, with the appointment of Breitbart’s Steven Bannon as Chief Strategist and Senior Counselor of the incoming administration of President-elect Donald Trump, Bolton and his Neo-Conservative agenda already has a solid foot in the door. \\nBy Dr. Binoy Kampmark , November 15 2016 \\nIn an age where many pundits and pollsters ought to be put out to an ignoble pasture, predictions and astrology gazing on the US election continues. While he did have a better sense of this election than most, actually predicting the result, Michael Moore has decided to essentially ignore it except in the negative. \\nBy Carla Stea , November 15 2016 \\nNATO’s preparation for, and provocation of war with Russia is evident in these UN Security Council meetings. This brinksmanship is a game of “chicken,” or, perhaps this perilous activity can be more aptly described as NATO’s game of “Russian Roulette” with the lives of all humanity. \\nBy Ellen Brown , November 15 2016 \\nDonald Trump was an outsider who boldly stormed the citadel of Washington DC and won. He has promised real change, but his infrastructure plan appears to be just more of the same – privatizing public assets and delivering unearned profits to investors at the expense of the people. He needs to try something new; and for this he could look to Abraham Lincoln, whose bold solution was very similar to one now being considered in Europe: just print the money. Related '"}, "time": 1742562705.7520885}