{"duration": 0.12824273109436035, "input_args": {"text": "'Dr. Jim Willie: ‘The Western central bank franchise system is totally broken, totally insolvent, and totally corrupt’… Bloomberg: ‘If debt continues to increase at twice the rate of GDP, financial engineering can only smooth things over for so long.’ by IWB · October 27, 2016 Tweet Schaeuble says monetary policy has reached its limits There is a growing international consensus that monetary policy has reached the limits of its possibilities, German Finance Wolfgang Schaeuble told a group of government officials in Berlin on Tuesday. \\nhttp://www.reuters.com/article/us-germany-schaeuble-liquidity-idUSKCN12P2EN China Gets Desperate About Debt \\nWith its debts surging and growth sluggish, China has hit on a new strategy to revitalize its ailing economy. It’s the same as the old strategy. Only this time, it won’t work. \\nEarlier this month, China’s State Council released guidelines for a new swap program, in which companies can exchange troubled debt with banks in return for equity. The government hopes this will give the firms a chance to restructure on favorable terms, and avoid the prospect of “zombie companies” propped up indefinitely by state-owned lenders. \\nOptimists point to a similar program that China executed, with some success, a little more than a decade ago. But they’re overlooking the primary reason that the previous swap seemed to work — which doesn’t portend success this time around. \\nIn the late 1990s, responding to a similar bout of excessive borrowing, China’s government created state-owned asset-management companies to help banks clean up their balance sheets. Firms such as China Cinda Asset Management Co. and China Huarong Asset Management Co. grew out of this program. These “bad banks” purchased a wide variety of assets and held them for extended periods with minimal return, thus helping the banks to continue lending. \\nThe extent to which this solved any problems, as opposed to papering them over, is debatable. But even the limited success of that program won’t be repeated this time around. \\n… \\nIn this light, China doesn’t need a new debt-for-equity swap program. It needs to cut credit growth. If debt continues to increase at twice the rate of GDP, financial engineering can only smooth things over for so long. The government also needs to recapitalize the banking system. That will be expensive: By most estimates, it will cost upward of $500 billion . But if banks simply shuffle bad debt between themselves, as is happening so far, there will be no net change to the health of the system. \\nUnfortunately for China, there’s no cheap or easy way out of this problem. Someday, the debt always comes due. \\nhttps://www.bloomberg.com/view/articles/2016-10-26/china-gets-desperate-about-debt \\nEurope could be on eve of banking Armageddon which will dwarf Credit Crunch, says expert \\nGERMANY, Italy, Switzerland, Britain and France are facing the catastrophic consequences of ‘over leveraging’ as Europe’s biggest banks prepare to release their latest results over the next two days. \\nAnd analysts say the potential for a cataclysmic failure could spread like a wild-fire hitting the continent and beyond as the true extent of deep troubles in the international banking sector are revealed. \\nThe IMF and German governments have refused to step in to prop-up struggling banks but risk analysts are warning Deutsche Bank, RBS, Lloyds, Unicredit, Intesa SanPaolo, and BMPS could all need a state bail out. \\nAnd it’s going to be a wake up call for the whole of Europe say experts who fear the reports are not going to be good for anyone. \\nWith alarming simliarities to the 2008 global financial crash, the latest results could spell disaster not only for the wealthy bankers paid to operate the system but for ordinary savers. \\nNew York based David Hendler of Viola Risk Advisors says the next two days could have serious ramifications for the entire globe. \\nHe said: “Like autumn leaves falling from the mighty oaks, the incredible yellows, oranges, and reds, will turn and rot into the ugly browns and black detritus, leading to smelly and then crumbled leaves. \\nDr. Jim Willie Writes: \\nThe Western central bank franchise system is totally broken, totally insolvent, and totally corrupt. It invites the Gold Standard return. The entire financial system is built upon a debt-based monetary system. The debt saturation process has run its full course. The central bank heads have been covering the sovereign debt for the last five years, having rendered their balance sheets as ruined. Debt is at obscene levels, like $19.7 trillion for the USGovt. No debt limits are in place anymore, a signal that most likely it has already defaulted. A hidden game is underway, with control lost to the creditors, even as they attempt to salvage their debt holdings. The major central banks continue to manage badly the great game, where money is fake phony and a farce. A titanic battle is underway, where the Eastern nations are discarding their USTreasury Bonds, and doing so in tremendous volume while they set up the many platforms and pieces to the Gold Standard.'"}, "time": 1742562164.891579}