{"duration": 0.26512598991394043, "input_args": {"text": "'By Guitarsandmore , April 30, 2006 at 5:37 am Link to this comment (Unregistered commenter) \\n\\x93there were \\x93the wise men,\\x94 a discreet gathering of corporate lawyers, diplomats and security strategists who advised President Johnson that the costs of Vietnam were greater than any of the benefits.\\x94 .. . \\x93As The New York Times finally reported on Monday, April 24, the \\x93wise men\\x94 are being recreated through the \\x93Iraq Study Group,\\x94 funded by Congress, co-chaired by James Baker and Lee Hamilton, and including such power.\\x94 \\nIt is funny how in this country it always comes down to economics and laws. I would think that in a true Democracy the will of the people would prevail but apparently we always need a group of wise men too. \\nThe protest marches, work stoppages, civil disobedience, will all contribute to the high cost of the war and as this \\x93group of wise men\\x94 conducts the study our efforts will all factor in. \\nIt will cost us more in the long run should we become known as the country that tried to control all of the world\\x92s resources (oil wells in Iraq, Iran, Saudi Arabia). The world will not think much of Democracy if we continue to invade countries based on fears of what might happen. \\nLet the will of the people prevail. \\nBy Guitarsandmore , April 29, 2006 at 8:53 pm Link to this comment (Unregistered commenter) \\nExcellent post professor Hayden! I am glad to see you posting here where there is some substance to the blogs. Your article is full of news, information, and valuable insights I have not been able to find elsewhere. Thank you. \\nSo Scott Ritter is frustrated (already)! Oh, boy! I first heard about the horrors of the Vietnam war when I was 15 and still in High School. Many years later in my twenties I was still protesting the Vietnam war after seeing my friend\\x92s Uncle burn himself on the steps of the Capitol building. \\nAs I recall certain peace activists were expressing concerns then too about one message being delivered by the peace movement (and the right message as well). I was told to shut up and let those that can deliver a consistent singular message do so. \\nStudents for a Democratic Society (SDS) split into two factions; the Progressive Labor Party and the Weathermen. But I believe it was the many different groups coming together in April and May of 1970 in Washington DC to March for peace that turned the tide of American opinion about Vietnam. I remember riding in a station wagon loaded down with 10 people that belonged to a Methodist minister and had no SDS people in it at all. Each person in that car had different reasons for marching but all came to protest the war. \\nThis weekend Tens of thousands of protesters marched Saturday through lower Manhattan to demand an immediate withdrawal of U.S. troops from Iraq. \\nEveryone should continue to write to their Senators and congressmen but also participate in the marches if possible. \\nThe only points we have to agree on are these: \\n1.Stop the war in Iraq 2.Tell Congress to cut off funding war. 3.No more preemptive strikes anywhere. 4.Bring the troops home now. \\nAll of this should fit nicely on the front and back of two signs. You carry one and your significant other carries the other one. \\nWe can talk about how we are going to turn the oil economy into an alternate energy economy later. What we have to do right now is stop the U.S. war machine from marching across the entire world stamping out potential threats. \\nIf you have to choose between dynamite and peace marches I hope you choose peace marches. \\nBy Fadel Abdallah , April 29, 2006 at 2:06 pm Link to this comment (Unregistered commenter) \\nGenerally speaking, I liked Tom Hyden’s piece and would identify with most of its premise. However, I have and apprehension about any movement that would identify its agenda as against war; as if war is a necessary human condition we await to happen, then we mobilize to oppose it, hence the “Anti-War Movement.” I want to be part of a movement that considers wars as the ultimate evil and the ultimate form of terrorism, which shoud be prevented with sound planned activism; but not wait to react to it after the fact of war is upon us. Further, I want to be part of a movement for true democracy; not a democracy that can be sold to the highest bidders, who will always be the members of the merchants of death, represnted by the military-industial complex. I want to be part of a genuinly fair and just democracy that leads the world by example; and not be led by the wims of special interest groups, such as the Israeli Lobby. I want to be part of a movement that have at its core philosophy that might is not right. I want to be part of a genuine humanistic movement that recognizes, with regret, that we “are living at a tumultuous moment in a 500-year history of crusades, slavery, colonialism and patriarchy”, and we are going sincerely to make amends! \\nBy Scott , April 29, 2006 at 8:48 am Link to this comment (Unregistered commenter) \\nETSpoon (1st reply in this thread) makes a good point about this war being fought by “those who want to be there”. In Canada a fair bit of political hay is made of this we-want-to-be-there mentality by soldiers, especially after they’ve been killed. The media is usually filled with stories about the dead soldiers committment and their willingness to be at war. \\nAs in the US all Canadians are being cajoled to support our troops. Well, he fact is, as a taxpayer, I AM supporting Canada’s troops, but against my will. \\nSometimes it feels like the only reason we’re at war is so Canadian conservatives can use our involvement in Afghanistan as a pretext to spend a bunch of money (my money) on the military, something they’ve wanted to do for decades. \\nI suggest that peace activists in both our countries start a tax revolt until a mechanism is in place that ensures supporters are the ones that foot the bill for the wars they want. This would certainly be in line with the long-touted user-pay principle that most war supporters inist on in virtually every other case where public monies are spent. \\nBy Ahmad-Fathi Abumaraq , April 29, 2006 at 3:49 am Link to this comment (Unregistered commenter) \\nThank you very informative,a treasure of information ,clear thinking precise,concise and to the point.God bless the NOBLE MEN. \\nBy S VAN DUSEN , April 27, 2006 at 8:22 pm Link to this comment (Unregistered commenter) \\nThank you, Tom, for your percpective on the current state of the ‘Peace Movement’ and, by extension, the progressive radical movement in general. This really does seem to be “the best of times and the worst of times.” The ‘Peace Movement’ has made a tremendous difference in keeping the issue of the Irag war from simply becoming part of the background noise of daily life. It does seem, however, to be struggling against an immensely powerful current of apathy and indifference. Progressive Radicalism too has helped to focus public attention, however fleetingly, on a broad array of pertinent issues. Still, the movement, as a whole, seems to have (d)evolved into a fractious multi- tude of cliques whose exclusionary ideological rigidity and seeming dependence on confrontational theatrics discourages committed involvement. \\nIn many ways this is no different than the conditions present during the ‘Viet Nam’ era. The ‘Anti-War Movement’ faced a tremendous uphill battle against public opinion and government repression. Other issues, when they were understood at all, faced reactions ranging from condesending amusement to violent hostility. Proponents of peace and other issues utilized an array of tactics ranging from reasoned discourse, to non-violent civil disobedience, to carnival antics, to paramilitary, guerrilla violence. \\nStill, there are signigicant differences between then and now. For one thing, this is not all new. We’ve seen this type of thing before. Early in the Viet Nam war, those in opposition based their position on comprehensive pacifism and anti-imperialism. It took the revelations of Daniel Ellsberg and the release of the “Pentagon Papers” to expose the general public to the mind set of the decision makers in the executive branch, the intelligence community, and the military, and to the lies, deceptions, and covert, provocative actions under- taken to involve the nation in a predetermined and unnecessary war. This time around, the charges of deception and fraud began before the war started and the evidense to support those charges followed on immediately. Public disillusionment has taken months not years. Let us see how this disillusionment translates into votes in the mid-term elections. \\nSecondly, there is no draft as we knew it then. Young men of college age (women are still not required to register) are not currently faced with the life or death possiblity of being called to involuntary military service and probable combat duty. The disproportionate representation of minorities among combat casualties is also not a current factor. The ‘backdoor draft’ created by the deployment of National Guard units (to a degree unprecedented in history), the calling up of reservists (some of whom have been effectively out of the military for years), and the indefinite extension of tours of duty has temporarily filled the military’s manpower needs. This has left the military to be viewed by many, if not most, as a volunteer force, serving in one sense or another by choice. It has also left the vast majority of otherwise draft elgible men free to pursue other options. This lack of direct personal involvement makes this particular population segment difficult to galvanize in to political action as they were during Viet Nam. It may well be the returning veterans of the Irag war, including significant numbers of women (some greviously wounded), who will form one of the most prominent segments of the current Anti-War Move- ment. Senator Kerry and other members of the Viet Nam Veterans Against the War, still active in politics and progressive causes, should cultivate this group with particular care. \\nThird, the Anti-War Movement has thusfar avoided making some of the more egregiously boneheaded errors of the Viet Nam era. The labeling of common soldiers as “baby killers”, the disrespect, mistreatment, and abuse of returning veterans, and the general indifference to their hardships and very existence by large portions of the Movement and general public have been largely avoided. The well intentioned, but utterly inappropriate, gestures of high-profile celeb- rities meeting with the leadership of opposing forces, visiting territories con- trolled by them, and touring their military facilities has also been avoided. Those mistakes continue to haunt the Peace Movement and have, in all like- lihood, contributed to the initial public support for the Bush administration’s policies and reluctance to give credibility to those opposed to those policies. It is gratifying to see that the Peace Movement is able to learn from its errors even if this nation’s leadership cannot. \\nFourth, while Congress possessed a solid and powerful cadre of leaders opposed to the Viet Nam war in the form of Senators Morse, Hatfield, McCarthy, Muskie, McGovern, and Kennedy as well as several members of the House of Representatives, it still took years to develop any significant oppo- sition to White House policy in Viet Nam. It was not until the release of the “Pentagon Papers” that support for the war began to evaporate, and it was not until Watergate that political support for the Nixon administration disap- peared. Today there is a much broader base of opposition in the Congress and, after the initial acquiesence to President Bush’s call to arms, that oppo- sition has coalesced and stood strong. It is only the minority status of the Democratic representatives and the iron grip of the Republican party over its members that is keeping all support from collapsing in the face of mounting evidence of fraud, deceipt, and the abuse of power by this administration. \\nFinally, you may be right, Tom. The Movement has, in many ways, become ‘mainstream’. Maybe the radicals are “disappearing in the midst of their own success”. The array of issues that formed the great, broad umbrella of the ‘Counter Culture’ have spread widely throughout the society as a whole. Things that once appeared alien and outrageous have now become common- place. Ideas that once appeared to be held only by “prophetic minorities” are now the intellectual property of anyone with the courage and independence to subscribe. This is, in part, a product of our ‘information age’ and it is a GOOD thing. \\nIt is good to see that some of you ‘old hands’ are still out there and speaking up, Tom. Your book, REUNION, Random House, New York, was quite infor- mative. With examples like you it will be easier for some of us to “be winter soldiers in a long war,” and spread the ‘Viet Nam Syndrome’ everywhere. \\nBy Thomas Bregman , April 27, 2006 at 6:27 am Link to this comment (Unregistered commenter) \\nComment #7938 by Tony Wicher on 4/26 at 8:31 am \\nTony. I also voted for (financially supported and walked the streets too) for Kerry, but don’t think I could do so again. \\nThought his 04’ loss was caused by a variety of factors (republican fear and wedge strategy, corporate media complicity, national democratic party ineptitude, tactical vote suppression, et al) he must be held personally accountable for his incredibly off kilter campaign. \\nIt seems to me that some of the other possible candidates have gotten a clue on issues, bearing and process. Though I’m not ready to commit at this point, I’ll certainly going to take a hard look at Gore, Edwards and Feingold for starters. \\nI also think a self finanaced + netroots dark horse might emerge. Some not nutty millionaire / billionaire (like Ned Lamont’s challenge to psuedo-dem Liberman in CT) could use his/her personal $$$$ to get a campaign jump started and then use internet financing to move beyond vanity. \\nWhat do think? \\nBy Edwaard A. Marshall , April 26, 2006 at 10:34 am Link to this comment (Unregistered commenter) \\nWHY IS IT THAT WHEN BOOKING A HOTEL THE IMPERIAL SUITE SOUNDS QUITE ENTICING WHERE AS NO ONE WOULD THINK OF BOOKING A NAZI SUITE? THERE IS THE PROBLEM. \\nBy nolaman , April 26, 2006 at 8:55 am Link to this comment (Unregistered commenter) \\n“Sen. John Kerry\\x92s call for military withdrawal by the end of this year. Kerry stands a definite chance of filling the moral void in the present political process. When he steadfastly embraces his record as a young man, the message resonates in several ways.” \\nI am a former member of John Kerry’s Vietnam Vets Against the War. \\nOh, how I wish that John Kerry or someone from that era’s anti-war movement would embrace their earlier principles. \\nDuring his shameful presidential run Kerry ran away from his youthful principled stand against the Vietnam war. I kept waiting for him to resolutely defend his anti-war past. \\nThe only thing he has said recently that resonated with me was his referrence to how many men died so needlessly after it was clear there was no military solution in Vietnam. \\nThere is no military solution in Iraq!!! \\nMen dieing there as we speak are dieing to salvage the political careers of Bush and company… and even Kerry if he doesn’t take a stronger stand! \\nBy Tony Wicher , April 26, 2006 at 8:31 am Link to this comment (Unregistered commenter) \\nComment on Comment #7812 by Thomas Bregman on 4/25 at 9:59 am \\nHear, hear! My sentiments about Hillary exactly. Bill had his faults, but I’ve got much more respect for him than I do for her. Hell, she should have been there giving him blow jobs when he really needed it. \\nI voted for Kerry. In spite of that travesty of a campaign he ran and all the shit I talked about him after the election, he still looks like the best prominent Democrat in the running. I could vote for him again if I had to, but not Hillary. \\nAs to Comment #7805 by ETSpoon, you are a damn fool. The peace movement is alive and well and succeeding. The last thing we need is naysayers like you. Why don’t you get a job with the Bush Administration? That seems to be where your true sympathies lie. \\nBy Peter Meldrum , April 26, 2006 at 7:10 am Link to this comment (Unregistered commenter) \\nWhether America accepts it or not it has lost the war in Iraq. \\nAs predicted by many the country has descended into Civil War. \\nNow to add the folly of assaulting Iran will, in the words of the Editorial Writer of the Daily Times, “see the region erupt in flames”. \\nIt is time for the American people to demand the return of the troops, demand a complete reassesment and retrenching of American foreign policy, to demand that American leaders address America’s internal problems, to demand America’s leaders abandon their desire to rule the world. \\nAnd possibly, just possibly, return democracy to America. \\nBy G.Anderson , April 25, 2006 at 10:45 pm Link to this comment (Unregistered commenter) \\nJust as military leaders sometimes prepare to fight the wars of the past, political movements can become mired in views of the world that have been discredited. \\nCertainly the absence of effective political oppostition to the war and any large demonstrations against the war is an indication that something is missing… \\nIs it just a question of leadership, or has the country become conservative after all? If that is the reason, then political rants against the war will not make one bit of difference. \\nThe Anti War Movement can only dream of having mass demonstrations on the scale of the recent pro amnesty immigration protests. \\nOn the other hand there is nothing like loosing to make your point… \\nWhen American’s defeat in Iraq does come, America’s political leaders will have a better understanding of the politic’s of America’s citizens. \\nBy Bo , April 25, 2006 at 6:07 pm Link to this comment (Unregistered commenter) \\nThe America SAD DENIAL Case \\nYour war against Fear is not justified. It is actually a Resource War for oil, and a currency war for the dollar. Global Oil production has peaked and US will suffer the most from this crisis. The United States uses 25% of the world\\x92s oil yet only has 5% of the world\\x92s population. America is heavily in debt and bankruptcy is unavoidable. The coming housing bust will send the economy into a second greater depression. \\nWhile the Middle East countries find themselves targets in the “war on terror”, China, Russia, and Latin America find themselves targets in the recently declared and much more expansive “war on tyranny.” Whereas the “war on terror” is really a war for control of the world’s oil reserves, this newly declared “war on tyranny” is really a war for control of the world’s oil distribution and transportation chokepoints. \\nThe dollar is in collapse, the economy is going to crash, oil is getting more scarce everyday. America is a nation that has its infrastructure built exclusively to be run on abundant cheap oil, with global demand of oil increasing exponentially and supply decreasing year after year, America has no other choice than to wage a global war on oil and currency and under the ruse of terror and freedom. \\nWhat? No believe? You still denial?? \\nIs your entire country on crack? Are all you Americans out of your cotton picking minds? Are you completely freaking delusional? Homicidal? Psychotic? Have you lost any shred of a moral compass? WHAT IN THE NAME OF JESUS H. CHRIST ON A CRUTCH IS WRONG WITH YOU PEOPLE \\nLet me offer up one small datum which may completely change the equation for you: According to the CIA (If they have any credibility left.) even accord to them Iran is at least five years away from a nuclear weapon. \\nFive years. \\nFive years is time for diplomacy to accomplish a hell of a lot. \\nI would also point out that the Atomic Energy Commission, various other international bodies and other inspections have essentially found no sign that Iran is even working on a nuclear weapon. \\nThe only actual evidence that Iran has anything close to nuclear weapons technology is blueprints *that the CIA gave to them!* \\nHave you all forgotten that the evidence on Iraq was spectacularly wrong? Have you all ignored the fact that it was fabricated? Why then are we going down the exact same road of stage managed, fabricated pseudo-evidence and wild-ass hysteria? \\nWhat is wrong with you people? \\nThis entire crisis has been manufactured, and has been years in the making. \\nStop and think back five years. What did we have five years ago? A moderate reformist Iranian government making overtures to the United States, rebuilding its relationship with Europe, liberalizing its society, and modernizing its economy. \\nPost 9/11 vigil in Iran. 9/11 comes along, the Iranians are overflowing with sympathy. Mass candlelit vigils are held in Tehran. Iran offers aid and cooperation. \\nIran hates the Taliban who have executed Iranian diplomats and massacred Afghan Shiites. Iran hates Saddam Hussein. Iran hates Al Qaeda which is a Sunni Fundamentalist organization which declares Shiites infidels and subhuman. \\nIran shares its intelligence with America - they even arrested Taliban members and handed them over to US custody. \\nSo we’ve got the Iranian spring; things are finally going to sort out. \\nAnd what happens? The Bush administration rebuffs every Iranian overture and does its best to instigate a cold war. Afghanistan is invaded, and suddenly, the Iranians are looking at American troops and allies on their eastern border. Then Iraq is invaded, and American troops and allies on their western border. Then bases and treaties in Uzbekistan, and whoops, there’s more American troops and allies on the northern border. The Persian Gulf is filled with American warships and carrier fleets. \\nNow the Iranians are surrounded. And the tough talk is constant. Iran is part of the ‘Axis of Evil’ and Americans tell each other “Baghdad, humph, real men go to Tehran.” Essentially, America has been threatening military action against Iran for the last five years, and has surrounded the country on every side with troops, bases and allies. \\nAmerican aircraft invade Iranian airspace regularly, American special forces undertake operations inside Iran and Americans regularly accuse Iranians of interference in Iraq. \\nDick Cheney pontificates about Israel bombing Iran *after he has just handed over to Israel the long range bombers and bunker busting bombs* required to do the job. \\nMeanwhile, the United States undertakes economic warfare against Iran, interfering with its business dealings with third party countries, trying to scuttle a pipeline deal with India, and it goes on and on. The hysteria about the Iranians nuclear program is just more of the same. \\nNow how in God’s Bloody Name do you think the Iranians are going to respond to that. Should they concede the nuclear program, abandon their pipeline project? If so, its not going to do them any good. America will just seek more concessions. Each surrender will be met by new demands. This isn’t hard to figure out. It’s exactly what Bush did with Iraq. \\nPerhaps overtures, good will gestures, trying to act like a peaceful nation. Did all those things, doesn’t matter. The Bush administration is still on a collision course. \\nSo, the Mullahs are concerned that they’re faced with a homicidal crazy state, the Iranian people are scared. When people are scared and faced with an aggressive warmongering power which keeps threatening to attack them, continually trespasses on its borders and is undertaking economic warfare… who the hell are they going to elect? Ahminajad may be a crazy bastard, but you assholes, you utter assholes did every thing you could to elect him short of donating 50,000 Diebold machines and mailing his party the trapdoor codes. \\nSo, having pursued a psychotically aggressive course, you’ve backed Iran into a corner, and engineered a regime which refuses to back further. \\nAnd *you* are the victims in all this? *You* are the ones under threat? It’s *self defense*???? \\nAnd of course, you goofily believe that you can just bomb or nuke Iran with impunity? \\nHoly microeconomic theory batman! Iran’s nuclear facilities are distributed across the country and in hardened sites near population centers. So any strike that cripples a significant portion of Iran’s nuclear capacity will inevitably be so large and kill so many people that its going to be tantamount to inviting full scale war. \\nThink about that. Iran is 70 million people, an area five times the size of Iraq, not disemboweled by 12 years of sanctions and air raids. On the other side of the coin, America’s ground army is busted and tied down in Iraq. There’s no troops to throw at a major Iranian military force, so you have to hope that bombing will do the trick. The occupation forces in Iraq are in occupation and not territorial defense mode. And Iraq is 65% Shiites who are probably not going to be happy that you’re blowing up their brother Shiites. \\nMeanwhile, the Strait of Hormuz is so narrow that sinking one supertanker will block it indefinitely, and Iran borders the strait on three sides. Block Hormuz and any naval groups inside the Persian Gulf are trapped there. Any naval groups outside the Persian Gulf are trapped outside. Forget about any oil coming out of the Persian Gulf from Iraq, Kuwait, Quatar, Bahrain, Saudi Arabia or the UAE. Think about what that does to the price of oil, and to the world economy. Think about what that does to dependent countries like Japan, India, China and Europe. \\nIn short it\\x92s so appallingly stupid and colossally risky, that I can see why your idiots in charge might consider using nuclear weapons. But throw a few nukes around and see how the rest of the world reacts? Every dirt-wad country is going to be mortgaging the Presidential palace to get its own nuclear deterrent from Pakistan or North Korea. How do you feel about the Indonesian Bomb, the Malaysian Bomb, the Thai Bomb, the Myanmar Bomb, the Algerian Bomb, the Saudi Bomb, the Egyptian Bomb, the Brazilian Bomb, the Argentine Bomb, the Venezuelan Bomb, the Cuban Bomb, the Japanese Bomb, the Canadian frigging Bomb. You are no longer trustworthy. North Korea, always borderline psychotic is going to be mondo difficult to deal with. You’ve just guaranteed yourself a full fledged nuclear arms race, balls to the wall with both Russia and China, and quite possibly Europe. \\nAnd of course there’s no guarantee that the rest of the world will allow this. Do you want an armed standoff with the Russians? Suppose they ‘loan’ their finest interceptor jets, pilots and radar systems to the Iranians… Do you want to meet *that* on a bombing raid? And if you do meet *that* what are you going to do when half your planes are blasted out of the skies conducting an illegal raid on civilian populations in a foreign country? Cry? Send a harsh note? \\nLaunch a first strike? \\nWorld goes boom. What happens if the Chinese decide to hold Taiwan and South Korea hostage? What do you do? Back off Iran or sell out East Asia? \\nHell, in that kind of standoff, someone sneezes and its not going to matter who launched a first strike. \\nOr would you like an economic standoff, say with Europe, or with Japan and China. Suppose that the Europeans or Chinese decide “screw the worldwide depression, you assholes are just too dangerous to have around.” Trillions of dollars get dumped on the market, loans get called in, the bottom drops out of your dollar, its thousand per cent inflation and no manufacturing base and your own trade embargoes. So much for America. \\nI mean, it\\x92s morally wrong; it\\x92s stupid on every level. And yet here you are discussing why maybe you should get out in front of the Republicans on this, or planning your surrender to Bush. Why are you even discussing this? \\nWhat is wrong with America? \\nCase in Iraq: \\nAnyone here still remember the scam of Al Samoud 2? \\nI totally forgot about it until today when I read that Iran has enriched a supply of uranium for the first time and Iran’s president has said Iran won’t back down ``one iota’’ over its nuclear program. \\nRemember when Saddam backed down? Its been so long even MY memory’s been washed by Washington, but before the WMB bullshit we were hearing ranting and trash from Bush that it was because of Iraq’s Al Samoud 2 missiles had 10 miles extra range than allowed by the UN [funny how US itself never follows UN regulations] that the US was going to attack Iraq. Al Samoud 2 was a big issue for a while, and Bush gave Saddam an ultimatum of a week or so to disarm and destroy all 90 some missiles or else the US EVIL EMPIRE was going to attack…. \\nwhat happened?'"}, "time": 1742628503.8853106}