{"duration": 0.11088275909423828, "input_args": {"text": "'Breitbart News has arrived. The opinion and news site, once a curiosity of the fringe right wing, is now an increasingly powerful voice, and virtual rallying spot, for millions of disaffected conservatives who propelled Donald J. Trump to the Republican nomination for president. Known for gleefully bashing the old Republican establishment, Breitbart now finds itself at the center of the party’s presidential campaign. Its longtime chairman, Stephen K. Bannon, was named campaign chief by Mr. Trump, whose nationalist,   message routinely mirrors the Breitbart worldview. On Facebook, it rivals news organizations like The Washington Post and Yahoo, and it has challenged conservative favorites like Fox News in its influence on the campaign, if not in size of audience. On Thursday, the site received its biggest billing yet  —   in the form of a scathing condemnation. In a nationally televised speech, Hillary Clinton identified Breitbart as the Democratic Party’s media enemy No. 1, warning about a “de facto merger” between the Trump campaign and a news outlet that she described as racist, radical and offensive. For Mrs. Clinton, it was a strategic attack that linked Mr. Trump to leading avatars of the   right. But among Breitbart’s ideologically driven journalists, her remarks were taken as validation. “I’ll play it cool, but not that cool: It was a big moment,” the site’s editor in chief, Alexander Marlow, 30, said in an interview on Friday. “A major presidential candidate engaging us like that, and calling us out directly, was quite thrilling. ” The rise of Breitbart News, founded a decade ago by the provocateur Andrew Breitbart, who died in 2012, is an unlikely outcome for a small, decentralized news outlet with a penchant for infighting. But it remains an outsize source of controversy  —   for liberals and even many traditional conservatives  —   over material that has been called misogynist, xenophobic and racist. The site refers to “migrant rape gangs” in Europe, and was among the first news outlets to disseminate unsubstantiated rumors that Mrs. Clinton was in ill health. Its writers often vilify the Black Lives Matter movement, emphasizing what they call a scourge of “   crime,” and described “young Muslims in the West” as the world’s “ticking time bomb. ” Before Mr. Breitbart died, the site had gained notoriety by championing the Tea Party movement and publicizing an undercover video that led to the closing of Acorn, the community organizing group. It also posted misleading footage of Shirley Sherrod, a black Department of Agriculture official, who was fired for seeming to express resentment toward a white farmer the White House later apologized. Last month, Milo Yiannopoulos, the site’s tech editor, was banned from Twitter after inspiring a sustained online harassment campaign against the “Saturday Night Live” actor Leslie Jones. Reports surfaced this week about domestic violence charges filed against Mr. Bannon stemming from a divorce in 1996. Supporters say it is the site’s willingness to embrace viewpoints considered far outside the bounds of respectable political discourse that is the very source of its success  —   in the same way that Mr. Trump’s more extreme proposals, like banning Muslims from entering the country, galvanized the Republican primary electorate. And like Mr. Trump, Breitbart excels on social media. Last month, it ranked as the 11th most popular site on Facebook, according to statistics from the social analytics firm NewsWhip. A year ago, its Facebook page had fewer than a million followers now, it has more than 2. 3 million. The Breitbart home page drew 18 million visitors last month, roughly the same as Politico, according to data from comScore. It beat conservative competitors like The Daily Caller, though mainstream sites like CNN draw tens of millions more visitors each month. Breitbart, which is privately owned, has declined to release revenue figures. The site appears to be backed by Mr. Breitbart’s estate its chief executive, Larry Solov and the family of Robert Mercer, a wealthy conservative donor and Trump supporter, according to corporate documents and two people briefed on the company’s finances. For Mr. Marlow, the editor in chief, the site’s success comes from attracting an underserved segment of conservatives  —   opponents of immigration and free trade who did not see their views reflected in other outlets. In online conservative news media, Mr. Marlow said, “The focus has not been on the traditional    dichotomy. It’s become populism and nationalism versus globalism. ” He said that Fox News, long a favored venue for the Republican establishment, had lost its feel for the   right, saying the network harps on older controversies, like the attack on the American diplomatic mission in Benghazi, Libya, and that its owner, Rupert Murdoch, is unwilling to criticize open immigration. “Fox is critical of Trump and a lot of the values that his voters stand for,” Mr. Marlow said. “A lot of conservatives feel betrayed. ” (Fox News has drawn its   ratings amid this year’s campaign, and Mr. Trump routinely appears on the network. “We will let our   year speak for itself,” the network said in a statement on Friday.) For those who track hate groups, Breitbart’s success is particularly alarming. “Breitbart in the last year or so has consistently picked up themes coming from the ” said Heidi Beirich, the director of the Intelligence Project at the Southern Poverty Law Center, using a nickname for a loosely affiliated online movement that includes   nationalists and many supporters of Mr. Trump. Ms. Beirich said that Breitbart came to her attention because she found that white supremacist websites, like The Daily Stormer, were increasingly linking to its coverage. “To people in the   who have basically been maligned and haven’t been part of the political system at all, this is a big, big deal,” she said, adding: “Their views are finally in the mainstream. ” It was this development that prompted aides to Mrs. Clinton to consider whether she should explicitly call out Breitbart to voters. “We think it’s important that people understand what Trump stands for, and what these groups stand for, and what it means that he echoes them,” said Glen Caplin, a Clinton campaign spokesman. Breitbart issued a statement on Thursday dismissing Mrs. Clinton’s address as “one of the most bizarre, paranoid, conspiratorial presidential campaign speeches in recent memory. ” On Friday it posted a list of what it called the “Top 20 lies in Hillary’s ‘ ’ speech. ” Not everyone affiliated with Breitbart is pleased with the site’s recent turn. Several longtime staff members quit earlier this year, saying that Mr. Bannon had turned a website founded on   grounds into a de facto propaganda outlet for Mr. Trump. “I don’t think it would be Andrew Breitbart’s proudest moment to be called the foundation for white supremacy on the internet,” Ben Shapiro, one of the editors who resigned, said on Friday. Did Mr. Shapiro ever expect to see Breitbart, which began as a   aggregator of wire stories, prominently featured in a speech by a   presidential candidate? “It wouldn’t have surprised me if a Democratic presidential candidate did that,” Mr. Shapiro said. “I’m just surprised that she’s not wrong. ”'"}, "time": 1742564261.5819938}