{"duration": 0.04843425750732422, "input_args": {"text": "'Apparently New England Patriots defensive end Chris Long got a bit fed up with the attacks launched against him for his decision to skip the White House meeting the team earned by winning the Super Bowl LI. Long jumped to his Twitter account to slam fans disappointed over his decision. [After announcing that he would be one of at least six Patriots players who will not attend the White House meeting, Long was hit with a wave of tweets by fans upset over his move. Some of the criticism appears to have stuck in the player’s craw and he took to Twitter to strike back with a series of disjointed, sometimes childish, other times sensible attacks on the fans.  Of all his tweets, one stood out as a common sense note about what these White House events really are. ”You should go talk to trump if you want change” I’m skipping a photo op, not a congressional hearing.  —   Chris Long (@JOEL9ONE) February 17, 2017,  Indeed, the event is just a photo op. But, if it is that meaningless, why make such a big statement by skipping it? In any case, Long unleashed a tweetstorm of other responses to fans to explain his decision and in many cases responding directly to their complaints. Sorry dude. I appreciate your support of me as a football player, but I just don’t get this tweet. https:  .   —   Chris Long (@JOEL9ONE) February 17, 2017,  Heard it all this week  …    if you don’t want to hear about some of the dumb shit I’ve heard  …    mute away, but it’s good. Rapid fire time, yeah?  —   Chris Long (@JOEL9ONE) February 17, 2017,  ”Respect the office” Ok birther theory guy,  —   Chris Long (@JOEL9ONE) February 17, 2017,  ”Stick to football” you don’t look like a state senator yourself there bud.  —   Chris Long (@JOEL9ONE) February 17, 2017,  ”I hope they cut you” I’m a free agent.  —   Chris Long (@JOEL9ONE) February 17, 2017,  ”stop being self important. I’m no longer a fan” I’m self important but you thought this was important enough to bring to my attention, eh?  —   Chris Long (@JOEL9ONE) February 17, 2017,  ”You just wanna be a cool lib” Actually I’m well aware the minute I believe something they don’t, libs will hit me w this GIF pic. twitter.   —   Chris Long (@JOEL9ONE) February 17, 2017,  ”You just wanna be a cool lib” As a football player, liberals thought I was a living, breathing piece of steak before I agreed with them.  —   Chris Long (@JOEL9ONE) February 17, 2017,  ”You hate the troops” The secondary focus of my foundation (out of two causes) is veteran support. Do your research. Also, not relatable.  —   Chris Long (@JOEL9ONE) February 17, 2017,  ”You hate white people” You realize all humans that live in America should be concerned? Also that assumption says something about you.  —   Chris Long (@JOEL9ONE) February 17, 2017,  ”Stop believing the media.” Dude I just saw you retweet Fox News.  —   Chris Long (@JOEL9ONE) February 17, 2017,  I think that’s it but check this gem out. Bye for now! pic. twitter.   —   Chris Long (@JOEL9ONE) February 17, 2017,  So I’ve listened to it all week. And it’s sparse really. Most people aren’t ridiculous. Thought y’all may enjoy that thread.  —   Chris Long (@JOEL9ONE) February 17, 2017,  Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742562059.0676792}