{"duration": 0.017804622650146484, "input_args": {"text": "'Foreign Policy During a debate at the House of Commons in Parliament on Wednesday, British Prime Minister Theresa May shunned answering the call of Labour leader Jeremy Corbyn to end the country\\'s weapons sales to Saudi Arabia. \\nBritish Prime Minister Theresa May has refused to withdraw support for Saudi Arabia’s place at the UN Human Rights Council despite the regime’s atrocities in Yemen. \\nDuring a debate at the House of Commons in Parliament on Wednesday, May shunned answering the call of Labour leader Jeremy Corbyn to end the country\\'s weapons sales to Saudi Arabia. \\n\"The issues are being investigated… We are very clear that the only solution that is going to work for Yemen is actually to make sure that we have the political solution that will give stability in Yemen,\" May told Corbyn and the parliamentarians. \\nInstead of answering the direct question, May spoke about the UK government’s contribution to the humanitarian aid provided to the crisis-torn country. \\nCorbyn also questioned May’s support for Saudi Arabia’s membership in the UN Human Rights Council. A crucial vote on the membership of Riyadh in the council will take place later this month. A Yemeni man stands on October 24, 2016 at the site of an air raid on a funeral ceremony that killed 140 people and wounded 525 on October 5. (Photo by AFP) \\nLondon has repeatedly been blamed by human rights groups, including Oxfam and Amnesty International, for fueling the Yemeni war by supplying Saudi Arabia with weapons. \\nSince the conflict began last year, the British government has approved more than £3 billion ($3.7 billion) in arms sales to the Saudis and military contractors hope more deals are in the pipeline. \\nYemen has been under almost daily airstrikes by Saudi Arabia since March 2015. International sources put the death toll from the aggression at almost 10,000. \\nRights groups have also condemned the Kingdom’s crackdown on dissent and prosecution of pro-reform activists. Loading ...'"}, "time": 1742628556.4179623}