{"duration": 0.09048724174499512, "input_args": {"text": "'NBC News’ Megyn Kelly can’t get any love.  On Saturday, journalist Yashar Ali obtained an unedited video of Kelly’s interview with Russian President Vladimir Putin for the   HuffPost and promptly eviscerated the “nervous” Kelly for asking Putin “softball” questions. He wrote that the unedited footage “shows a nervous Kelly who asked the authoritarian leader softball questions and failed to hold him accountable on key topics. ” “Most troubling, Kelly devoted precious time in her short interview to a question that led one former CIA Russia analyst to say that it sounded as if Putin had written the question himself,” he continues. According to the HuffPost piece, the “last question Kelly asked Putin, which was not aired, was startling in its pandering. ” Kelly asks Putin in the unaired footage: We have been here in St. Petersburg for about a week now. And virtually every person we have met on the street says what they respect about you is they feel that you have returned dignity to Russia, that you’ve returned Russia to a place of respect. You’ve been in the leadership of this country for 17 years now. Has it taken any sort of personal toll on you? A former CIA Russia analyst told HuffPost that the Kremlin could use Kelly’s interview for propaganda purposes: I can’t begin to tell you what this did for Putin’s ego, and I wouldn’t put it past the Kremlin to use it for propaganda purposes. Putin’s obsession is, by his definition, making Russia great again. He’s obsessed with the idea that he has returned the country to what he sees as the glory days of the USSR. He feels that since the breakup of the USSR, Russia has too often ceded ground where it shouldn’t have. And he’s obsessed with people seeing him as the one who brought dignity back to Russia. According to the HuffPost piece, “Kelly’s questions were so weak and she missed so many opportunities that several network news reporters asked HuffPost the unthinkable: ‘Did NBC News, in their negotiations with the Kremlin, agree to terms and conditions on questions or topics? ’” NBC sources reportedly confirmed that that there were no conditions, but the piece noted that “a spokesman for NBC News declined to comment on Kelly’s choice of questions. ” Though establishment media journalists patted Kelly on the head when she tried to undercut Donald Trump during the 2016 election cycle, they mostly slammed Kelly for being way out of her league after Putin’s interview. The Los Angeles Times noted that Kelly’s   interview was “child’s play” for Putin, who “outmaneuvered” her “as he displayed an elusive and ultimately dismissive demeanor toward Kelly. ” According to the Times, Kelly’s   party delivered “more of a fizzle than a bang. ” “The interview, which was teased for weeks on NBC as a   exclusive, lasted less than 10 minutes,” the Times continued. “But that was just about enough time to confirm that she’s still not a great interviewer. ” Yahoo’s Ken Tucker wrote that Putin’s “a load of nonsense” comment could have described “most of the premiere of Sunday Night With Megyn Kelly. ” He added that Kelly was “no match” for Putin. On the day before Kelly’s controversial interview with Alex Jones is set to air, HuffPost noted that “multiple sources at NBC News” have wondered if network executives “misjudged Kelly’s skill set, popularity and savvy as a reporter. ” A television executive reportedly told CNN that NBC’s “fundamental mistake” was thinking that Kelly was a “superstar. ” The New York Times also doubted Kelly’s ability to do a   interview with Jones, pointing out that “NBC has not released a transcript of Ms. Kelly’s interview, leading some to speculate that her interrogation of Mr. Jones over his more contentious views  —   for instance, that Sandy Hook was a hoax and the Sept. 11 terrorist attacks were carried out by the United States government  —   was less than ferocious. ” Despite all of the hype, Kelly has failed to deliver ratings for NBC. The debut of Kelly’s show could not even beat out a rerun of 60 Minutes two weeks ago. Last Sunday, her second show tanked as well, losing to another rerun of 60 Minutes in addition to a rerun of America’s Funniest Home Videos. After just two shows, NBC executives are already reportedly “freaking out” over the “ratings disaster” that is Kelly.'"}, "time": 1742562510.6202583}