{"duration": 0.0569300651550293, "input_args": {"text": "'Dienstag, 15. November 2016 Flitzer auf dem Spielfeld! Schach-WM muss kurzzeitig unterbrochen werden New York (dpo) - Eklat bei der Schach-WM in New York! Die dritte Partie zwischen Titelverteidiger Magnus Carlsen und Herausforderer Sergei Karjakin musste schon nach wenigen Zügen zwischenzeitlich unterbrochen werden, weil ein Flitzer auf das Spielfeld rannte. Bei dem völlig nackten Störenfried handelte es sich offenbar um einen 43-jährigen Mann aus New York. Das Spiel zwischen dem Dänen und dem Russen begann sich nach drei Stunden und 42 Minuten gerade zu entfalten, als im Publikum plötzlich ein Mann aufsprang, sich seine Kleider vom Leib riss und auf das Spielfeld stürmte. Die Zuschauer reagierten teils empört, teils belustigt auf die unerwartete Unterbrechung. Magnus Carlsen überlegt, was er gegen den Flitzer unternehmen kann. Karjakin-Fan Elena Suchow hatte gute Sicht auf die Szene, die vom Schachverband FIDE geschickt aus der Live-Übertragung durch einen Kamerawechsel herausgeschnitten wurde: \"Er bewegte sich mal gerade, mal schräg, so dass es schwierig war, ihn matt zu setzen. Ich glaube aber, er wollte zum König von Carlsen gelangen. Ob er ihn schlagen wollte oder ob er nur ein Fan war – keine Ahnung.\" Karjakin reagierte am schnellsten und versuchte, den Flitzer mit einem kurz zuvor freigespielten auf A1 stehenden Turm zu schlagen, doch da hatte sich der nackte Mann bereits mit einem beherzten Rösselsprung von Feld A5 auf C4 in Sicherheit gebracht. Minutenlang entkam der Däne den herbeigeeilten Sicherheitskräften mit teilweise irregulären Spielzügen (u.a. Flugrolle von F8 auf C7, Sprung von D4 auf F1), bevor er schließlich zu Boden gerungen und abgeführt werden konnte. Dabei fielen mehrere Spielfiguren um. Erst nach einer viertelstündigen Unterbrechung sowie einer hitzigen Diskussion, ob einer von Karjakins Bauern wirklich auf B8 gestanden habe und sofort gegen eine Dame eingetauscht werden müsse, konnte die Partie wieder aufgenommen werden. Sie endete ohne weiteren Zwischenfall in einem Remis. fed, ssi, dan; Foto [M]: Shutterstock / Duncan Yoyos , CC BY-SA 2.0 , Foto unten: Ralf Roletschek , CC BY-SA 3.0 Artikel teilen:'"}, "time": 1742562002.958839}