{"duration": 0.04531216621398926, "input_args": {"text": "'TRUNEWS 11/04/16 Spirit Cooking: Will America Repent Before The Russians Fry US November 04, 2016 Will America repent BEFORE the Russians fry our nation with nukes? Today on TRUNEWS, Rick Wiles discusses the shocking vindication of his 18 years of warnings from God’s pulpit, that our reality has been hijacked by a Luciferian blood drinking elite. Rick will detail the latest revelations from the FBI investigation into Hillary Diane Rodham Clinton, involving trusted aide Huma Abedin turning State’s evidence, and WikiLeaks releasing proof the Left engages in satanic ’Spirit Cooking’ rituals. \\nToday’s Audio Streamcast. Click the audio bar to listen: <span itemprop=\"name\" content=\"TRUNEWS 11/04/16 Spirit Cooking: Will America Repent Before The Russians Fry US\"></span> <span itemprop=\"description\" content=\"Will America repent BEFORE the Russians fry our nation with nukes? Today on TRUNEWS, Rick Wiles discusses the shocking vindication of his 18 years of warnings from God’s pulpit, that our reality has been hijacked by a Luciferian blood drinking elite. Rick will detail the latest revelations from the FBI investigation into Hillary Diane Rodham Clinton, involving trusted aide Huma Abedin turning State’s evidence, and WikiLeaks releasing proof the Left engages in satanic ’Spirit Cooking’ rituals.\"></span> <span itemprop=\"duration\" content=\"4200\"></span> <span itemprop=\"thumbnail\" content=\"http://static.panda-os.com/p/1305/sp/130500/thumbnail/entry_id/0_kgq98alm/version/1 /acv/62\"></span> <span itemprop=\"width\" content=\"350\"></span> <span itemprop=\"height\" content=\"25\"></span> <a href=\"http://corp.kaltura.com/products/video-platform-features\">Video Platform</a> <a href=\"http://corp.kaltura.com/Products/Features/Video-Management\">Video Management</a> <a href=\"http://corp.kaltura.com/Video-Solutions\">Video Solutions</a> <a href=\"http://corp.kaltura.com/Products/Features/Video-Player\">Video Player</a> \\nRight-click to download today’s show to your local device in mp3 format: Streamcast MP3 \\nEmail: | Twitter: @EdwardSzall | Facebook: Ed Szall DOWNLOAD THE TRUNEWS MOBILE APP on Apple and Google Play ! Donate Today! Support TRUNEWS to help build a global news network that provides a credible source for world news \\nWe believe Christians need and deserve their own global news network to keep the worldwide Church informed, and to offer Christians a positive alternative to the anti-Christian bigotry of the mainstream news media How To Listen To TRUNEWS \\nHere on our show pages, there are two ways to listen to TRUNEWS. The first is to use the embedded player on the page. It is the black bar that you see above. Just click the arrow on the player for today’s broadcast. If you prefer to save the program to listen to it later on your PC or mobile device, just click the ‘DOWNLOAD MP3’ link above to archive that particular streamcast. Streamcast Archives'"}, "time": 1742564429.671267}