{"duration": 0.07458853721618652, "input_args": {"text": "'Wed, 26 Oct 2016 23:19 UTC An expansive new analysis by Yale School of Public Health researchers confirms that numerous carcinogens involved in the controversial practice of hydraulic fracturing have the potential to contaminate air and water in nearby communities. Fracking is now common in the United States, currently occurring in 30 states, and with millions of people living within one mile of a fracking site . The study suggests that the presence of carcinogens involved in or released by hydraulic fracturing operations has the potential to increase the risk of childhood leukemia. The presence of chemicals alone does not confirm exposure or risk of exposure to carcinogens and future studies are needed to evaluate cancer risk. \"Because children are a particularly vulnerable population, research efforts should first be directed toward investigating whether exposure to hydraulic fracturing is associated with an increased risk,\" said lead author Nicole Deziel, Ph.D., assistant professor. Childhood leukemia is a particular concern because of the severity and short latency period of the disease. The study is published in the journal Science of the Total Environment . The team examined an extensive list of more than 1,000 chemicals that may be released into air or water as a result of fracking. \"Previous studies have examined the carcinogenicity of more selective lists of chemicals,\" said Deziel. \"To our knowledge, our analysis represents the most expansive review of carcinogenicity of hydraulic fracturing-related chemicals in the published literature.\" According to the findings, the majority of chemicals (>80 percent) lacked sufficient data on cancer-causing potential, highlighting an important knowledge gap. Of the 119 compounds with sufficient data, 44 percent of the water pollutants and 60 percent of air pollutants were either confirmed or possible carcinogens. Because some chemicals could be released to both air and water, t he study revealed a total of 55 unique compounds with carcinogenic potential . Furthermore, 20 chemicals had evidence of increased risk for leukemia or lymphoma specifically. This analysis creates a priority list of carcinogens to target for future exposure and health studies. Fracking, also known as unconventional oil and gas development, has increased dramatically in recent years, and the practice is expected to grow in the future. The process involves drilling deep, as far as two miles, into the earth and releasing a high-pressure mixture of water, sand and chemicals that fracture the rock and release the gas or oil trapped inside. While fracking increases the production of domestic oil and natural gas and decreases prices, it is controversial because of the significant amounts of water that must be used as well as transported to fracking sites, as well as the release of carcinogens. The team has begun been testing air and water samples for some of these known and suspected carcinogens in a community with particularly intense exposure to fracking to evaluate whether people there are exposed to these compounds, and if so, at what concentrations.'"}, "time": 1742562031.1945367}