{"duration": 0.10097312927246094, "input_args": {"text": "'Norway’s immigration minister Sylvi Listhaug has slammed the “agenda”  “liberal media” after being accused of wearing a crucifix necklace merely as a “prop” to promote “xenophobic” views. [Listhaug said the left wing media “doesn’t care about facts” as long as right wingers are the target after writer and former newspaper editor Sven Egil Omdal claimed the Progress Party politician had never worn the crucifix before being appointed immigration and integration minister.  In a message posted to Facebook, alongside a picture of Ms Listhaug wearing the crucifix while speaking at the Oslo Symposium, the left wing journalist wrote: “She looks like a bishop even when she says that it ‘has never been something for us’ to live side by side with people from another culture. “Sylvi Listhaug is almost always seen wearing the cross now, and she is always talking about how important it is for her. But I’ve been through all images in the Scanpix database in the period from 2001 to December 15, 2015, when she became immigration and integration minister. She does not wear the cross necklace on one of them. ” “Would I say she’s using the cross as a political prop to appeal to strange people who think xenophobia is a Christian virtue? Yes, I would,” concluded Mr Omdal, who has weekly columns in four newspapers. Ms Listhaug hit back at what she called the “vile attack” accusing the “media mogul” of “spreading fake news” which the minister said Mr Omdal “invented to make me look evil and cynical”. “He has received well over 1, 000 likes, many of them from journalists and media professionals on an outright lie” she wrote to Facebook. She then pointed to three Scanpix photos from 2006 and 2007 attached to the post in which she can be seen wearing the crucifix, to disprove the journalist’s claim. The minister described how the jewellery piece  —   a gift from her grandmother who is nearly 100 years old  —   means a lot to her. Ms Listhaug took aim at the leftist media, writing: “It’s no wonder a growing number of people have seen through many of the leftist media and are relying less on journalists. “They have an agenda, which is attacking the right. They have no standards and they don’t care about the facts  —   everything is okay as long as I or the Progress Party is the target. ” Ms. Listhaug, who is Norway’s first ever immigration and integration minister, received global press attention soon after taking up the post after she said that Jesus would support her party’s tough stance on immigration. “What Jesus cared about is you should help as many people as possible  —   and that’s not as many as possible in Norway,” she said. She asserted it’s possible to relieve the suffering of a lot more people in refugee camps in the Middle East rather than encouraging them to make a perilous journey across Europe.'"}, "time": 1742628504.7801683}