{"duration": 0.06433272361755371, "input_args": {"text": "'Topics: Hillary Clinton , Donald Trump , 2016 Presidential Election , Men , Hillary Clinton emails , Jill Stein   Ah, the USA. You had a nice run. Well, not \\'nice\\' really, but not awful. Well parts of it were awful, but - oh, never \\nNEW YORK, NY - A mere twenty-four hours before Election Day, it appears there\\'s one group of voters Hillary Clinton still hasn\\'t managed to win over: young, white men. A recent survey revealed that this group is overwhelmingly reluctant to cast their vote for the only candidate in the 2016 election with any real chance of defeating Actual Yam in a Wig and Part-time Hitler Impersonator Donald Trump. \\nChad Chadderdon, one such millennial, says that Clinton still doesn\\'t seem trustworthy to him. \\n\"She\\'s been in politics for like thirty years, so it seems like maybe she\\'s been plotting to be president this whole time, like she had career goals or something, and that seems suspicious to me. \\n\"With Bernie it always seemed like he\\'d just rolled out of bed and decided to run for president,\" he adds, tearing up at the mention of the beloved Senator. \"Maybe if Hillary stopped brushing her hair, I\\'d feel better about her.\" \\nBut the real problem with Clinton? Her emails. \\n\"It just shows how out-of-touch she really is,\" says Mark Markman, one of Chad\\'s fraternity brothers. \"I mean who even uses email anymore? It\\'s all about Snapchat now.\" \\nSo, if not Clinton, who will these young, white men be voting for on November 8th? \\n\"I\\'m going with Jill Stein,\" says Chad. \"Sure, she\\'s been accused of pandering to anti-vaxxers and it\\'s unclear whether she actually knows how the government works, but at least her voice doesn\\'t irritate me.\" \\nMark, on the other hand, plans to vote for former CIA operations officer Evan McMullin, who\\'s been gaining ground in the state everyone would forget about if it weren\\'t for Mormons, Utah. \\n\"Nobody\\'s ever heard of him, and I like that,\" he says. \"And if he gets enough votes, maybe he\\'ll have a real run of it in 2020. I wanna be able to say I voted for McMullin before everybody else did.\" \\nOverall, young white men seem energized to cast their votes tomorrow, probably because they don\\'t really have that much at stake here. \\n\"It\\'s nice to finally feel like we don\\'t need our parents to ruin the country for us, anymore,\" says Chad. \"We can fuck shit up all on our own.\" \\nAnd they may very well do just that. Make Samantha Irene\\'s  '"}, "time": 1742562864.746956}