{"duration": 0.03190779685974121, "input_args": {"text": "'Home | World | Donald Trump: “I’m Going to Grab the World By the P*ssy!” Donald Trump: “I’m Going to Grab the World By the P*ssy!” By Colonel Sharkey 09/11/2016 10:14:09 \\n  has won the presidency and he will now bide his time in making his agenda known. \\n\\n\\nAs the safe zones crack, the microaggressions rack, and the SJWs whack, there is great fear in America today. \\nFor eight long tortuous years we have been witness to the incessant moaning of the leftist socialist contingent and their wishes to curtail free speech, to force their doctrines into peoples’ mouths, to promote their socialist utopian mirage that never happened upon the populace. \\nAs the Obama doctrine, a stout hatred of the British, a devout homosexual agenda and a consummate Marxist ideology were splattered onto every American orifice and fucked with lube, ends, it ends in shame, acrimony and the indignity of being erased completely from history without any recognition. \\nDonald Trump will dismantle Obamacare, he will take down all these socialist executive actions, he will completely remove any evidence that Obama was ever president. There will be no trace of Obama in four years of Trump presidency left, and his legacy will be zero, just a grain of sand in an ocean of time. \\nAs for the global community, there will be a trade war with China now. The Chinese have for too long taken the U.S. for granted, and their time of selling Yanks cheap plastic trinkets that break after one day are over. Anything made in China is of the worst quality, and is immediately viewed as dispensable. \\nThe South Americans streaming over the borders will no longer be tolerated and encouraged, as much as the Democrats utilised these people as fodder for votes, those days are long gone. Look where it got Hillary? \\nMexico will be taxed to hell, and the illegals shipped to the border and thrown into the desert. Walk back to Mexico where you came from you dirty slickback they will say. \\nIf the blacks riot again, they will this time get a proper response, not the Obama response that was so prevalent during his tenure. There will be live ammo used on the blacks to put them firmly in their place. \\nAnyone who says Trump is not establishment is wrong, he was not only born into the establishment but the people he knows are all establishment. One must remember that the establishment controls both sides of any argument, and whoever wins is always the establishment. \\nWhen Trump met Kissinger, that was a clue that there was movement in his campaign, and this meeting alone should have signalled a change in sentiment amongst the controllers. \\nThe rhetoric used in Trump’s acceptance speech was far removed from the braggadocio and fascism of his former speeches, this is because Trump can now bide his time, he will cut down the Muslims in his own time, he will make his mark on Saudi Arabia, and Iran, in his own time, that will come. If you are a devout Muslim in America and dress like one, you will be targeted soon, so it is in your best interests to either assimilate into the American ways of dress and habits or to leave. You will be targeted in the streets, and you will be hounded out of town. This is why you must leave now, or later on find yourself in a camp, similar to how the Japanese were treated in World War two. \\nA great war is coming, and even though Putin and Trump may seem chummy now, there is one thing you must never do, and that is trust a Russian. It is an impossible feat in itself, because how can you trust something that moves from one side to the other so quickly? \\nWe must prepare, and we must look to places of safety far away from any civilisation or U.S. interests to find that safety as the war will be long and vicious, possibly nuclear. \\nKudos to Trump for winning, but where he touched Americans with his emotive rhetoric he has left a warning of the future, for without constraint and patience, there will be global war soon, and this is firmly within the establishment’s agenda. \\nLet the Purge begin.'"}, "time": 1742628503.9331033}