{"duration": 0.16786551475524902, "input_args": {"text": "'FLINT, Mich.  —   Health care workers are scrambling to help the people here cope with what many fear will be chronic consequences of the city’s water contamination crisis: profound stress, worry, depression and guilt. Uncertainty about their own health and the health of their children, the   nature of the crisis, and raw anger over government’s role in both causing the lead contamination and trying to remedy it, are all taking their toll on Flint’s residents. “The first thing I noticed when I got to Flint, quite honestly, was the level of fear and anxiety and distress,” said Dr. Nicole Lurie, an assistant secretary at the Department of Health and Human Services who has been coordinating the federal recovery effort here since January. On Wednesday, President Obama will pay his first visit to the city since the lead contamination was revealed. A team of behavioral health specialists from the United States Public Health Service began addressing the mental health problem in February by providing “psychological first aid” training for people interested in helping others cope with the water emergency. Genesee Health System, a local mental health agency, also created the Flint Community Resilience Group, whose members are focusing on the   psychological consequences of the water crisis and how to address them. With a $500, 000 emergency grant from the state, the group is offering free crisis counseling at churches and the public library, and has held two community meetings on stress management. Social workers and social work students from around the state are helping with the counseling on a volunteer basis. But the need probably extends far beyond the 400 people who have been helped since the counseling started in February. Diane Breckenridge, Genesee Health’s liaison to local hospitals, said she had seen “people come into the hospitals directly related to breakdowns, nervous breakdowns, if you will. ” “Most of it’s been depression or suicidal ideation directly linked to what’s going on with their children,” she added. “They just feel like they can’t even let their children take a bath. ” Children, too, are traumatized, said Dexter Clarke, a supervisor at Genesee Health, not least because they constantly hear frightening things on television about the lead crisis, including breathless advertisements by personal injury lawyers seeking clients. “I teach a   class of little girls every Wednesday, and they’re from Flint,” Ms. Breckenridge said, “and I just get all kinds of questions because they’re terrified. ” A bill in the United States House of Representatives would provide $5 million for mental health needs in Flint as part of a broader aid package, but has not gotten traction. A separate aid package in the Senate appears to have more momentum, but does not include money for mental health. The state, meanwhile, is planning to send mobile crisis teams into Flint neighborhoods and to provide help to local pediatricians through a child psychiatric teleprogram. Michigan’s earlier decision to expand Medicaid under the Affordable Care Act will help more   residents get psychological help, although officials at Genesee Health System worry about not having enough licensed social workers to meet the eventual demand. About 15, 000 additional children and pregnant women here will be eligible for Medicaid, possibly starting this month, under a temporary program that government and local officials are rushing to put together. One challenge is convincing people to seek mental health care. The Rev. Rigel J. Dawson, pastor of the North Central Church of Christ and a member of the Flint Community Resilience Group, said his focus was on persuading   residents of the   city to pursue psychological help if they need it. “There’s a history, especially in the   church, of ‘I’m strong enough spiritually to deal with it,’” Mr. Dawson said. “You see the signs of stress and what it’s doing to the community, but we’re conditioned to put on our church face and act like it’s O. K. ” Danis Russell, the chief executive of Genesee Health System, said that while the potential for stigma had kept many here from seeking mental health services in the past, the water crisis might make them more willing. “Now there’s an acceptable reason,” he said. “People may say: ‘This isn’t my fault. Somebody did this to us and everybody’s getting help, so I should, too. ’” Still, Mr. Russell added, “What the demand will look like going forward, I don’t think anyone knows. ” Five Flint residents recently shared their accounts of the psychological impact of the crisis: Janice Berryman spends solitary days in a home scattered with pink pillows and angel figurines, following every twist of Flint’s water crisis on television and trying to keep her anger at bay. Her tap water was found to have extremely high lead levels as recently as February, she said. Family members have stopped visiting, including a niece in Arkansas whose twin toddlers Ms. Berryman, 71, is aching to meet. Sometimes her loneliness brings her to tears, she said. For a while she found it helped to attend protests, and she even took a bus to Lansing in January to march outside the Capitol during Gov. Rick Snyder’s State of the State address. But with heart disease, diabetes and other ailments, “I just said, ‘I’ve got to back down. ’” She began sleeping a lot  —   too much, her relatives told her. “If you go to sleep, it feels like it’s all going to go away,” she said. “But it don’t. ” Her doctor has persuaded her to try the crisis counseling at the public library. “He said, ‘I think you need to, Jan, just to get your feelings out,’” she said. “But if I don’t feel it’s working? Adios. If they try to start pushing pills on me, I’ll be gone. I don’t need a bunch of pills to drug me up. ” Two of Ms. Berryman’s siblings died young, experiences that she said had forced her to learn endurance. “I think that’s why I handle this a little better than others,” she said. “No matter what your anger level is, God sees you through. ” Bob and Johanna Atwood Brown thought they were doing everything right. When reports of lead in the water supply surfaced last summer, they installed a filter on their faucet, which removes lead up to 150 parts per billion. They used bottled water for drinking, but relied on their filtered tap water for cooking, coffee or to make their    son and his friends   on hot summer days. But when they had their water tested in January, they learned that it contained lead at 200 parts per billion  —   more than their filter was designed to handle, and far more than the federal safety threshold of 15 parts per billion. Ms. Brown said she was haunted by thoughts of her son and his friends drinking the lemonade and   she had made them. “The guilt is unreal,” she said. “I poisoned other people’s children. ” Mr. Brown said he felt as if he had failed as a father and protector of his family. “You beat yourself up,” he said. “Why didn’t we do something earlier? Why didn’t we test earlier?” Their son received a diagnosis of bipolar disorder and attention deficit disorder before the water crisis, and the Browns said they feared that the lead could exacerbate those problems  —   or produce others. He “has special needs as it is, so it’s hard to tell if there’s a behavioral component,” Ms. Brown said. “Things are not clear. ” She added: “Are we going to get cancer from this? I’m terrified. ” As an outlet, Ms. Brown has started a blog and uses Facebook. She was already seeing a therapist, she said, but now the stress and guilt associated with her home’s water contamination dominate her sessions. Mr. Brown said he did not talk about it much, but as the associate director in Flint for Michigan State University’s Center for Economic and Community Development, he finds it therapeutic to share his story when he speaks at events and meetings. “It never leaves you,” Mr. Brown said. “At some point you just want to jump up and down and yell and scream, and then you just try to move forward. Because what are you going to say?” Too often now, Nicole Lewis cannot sleep. “I’m up until midnight some nights because I can’t shut down,” she said. “Just thinking about my life in general  —   like really, did I deserve this? Did my kids deserve this?” Ms. Lewis, a    accountant and single mother of two boys, said she had also been experiencing chest pains. When they come, she lies down and drinks bottled water. “Yet I’ve been told that this bottled water could have lead, too,” she said, voicing a common concern here. To help her nerves, she recently installed a home water filtration system, paying $42. 50 a month for the service on her main water supply line. She also bought a blender to make her sons smoothies with   vegetables, like spinach and kale. But still her mind races, especially late at night. Her    was just found to have attention deficit disorder, she said. Her    is already showing athletic promise, but she wonders whether lead exposure will affect his ability to play sports. She also worries that living in Flint will brand her as damaged goods if she ever tries to find a job elsewhere. “When they see my résumé will they say, ‘Oh wait, she’s from Flint  —   she might be a huge liability for us’?” she said. She has no time for a therapist, she said, but regularly talks to her mother in Houston. “I just vent a lot of stuff out to her,” she said. “She’s a listening ear. ” As if there were not enough putting Maelores Collins on edge, her dog will not stop barking. She suspects Flint’s water is to blame. “I think he’s hallucinating,” she said as Wally, a Yorkshire terrier, yapped from a cage near the back door. “We need to get him tested. ” The barking adds to a sense of disorder that has agitated Ms. Collins, 48, for months. She is tired of the water bottles cluttering her house, and of eating only microwaved food because she fears cooking with even filtered tap water. Small kindnesses, like her sister bringing over potpies from Kentucky Fried Chicken, keep her going. Ms. Collins blames the water for a problem that deeply troubles her: Her hair has broken off over the past six months. Her   therapy consists of cruising the aisles of Walmart or playing bid whist, a card game, with friends. A few months ago, her doctor also prescribed Xanax, a tranquilizer, which she takes “to get up” in the morning, she said. “I’m depressed, I’m angry, my anxiety is running high,” said Ms. Collins, a former construction worker who has asthma and is on permanent disability. Worse off, she said, is her    grandson, who refuses to drink even bottled water and will eat only off paper plates. The family jumped several hurdles to secure a psychiatric appointment for him in early May. “He’s freaking out  —   he’s like, ‘We’re all going to die from the water,’” Ms. Collins said. “I said, ‘You’re young, you ain’t going nowhere.’ But I can’t convince this boy. ” Ms. Collins called the situation “crazy. ” “Lose your hair, your family tripping about different things, your kids leaving water bottles all over the house,” she said. She laughed sharply. Wally continued his frantic barking, and she cast a withering glance his way. “This thing,” she said, “will never be over. ”'"}, "time": 1742563788.208479}