{"duration": 0.14802837371826172, "input_args": {"text": "'NEWARK  —   Gov. Chris Christie of New Jersey was told about the George Washington Bridge lane closings  —   and that they were done to punish a mayor who had declined to endorse him for    —   during a Sept. 11 memorial service two days after they began, a former ally who orchestrated the scheme testified in federal court here on Tuesday. Mr. Christie, the witness recalled, laughed at the news. The closings of the access lanes in September 2013 continued for two more days, creating a catastrophic traffic jam that created gridlock for emergency vehicles, school buses and commuters in Fort Lee, N. J. But Mr. Christie made no effort to reopen the lanes and end the gridlock. Instead, his former ally said, the governor was clearly delighted and seemed to savor the scheme. And after learning that the Fort Lee mayor’s persistent and urgent calls for help were being ignored, Mr. Christie said in a sarcastic tone, “I imagine he wouldn’t get his calls returned. ” The former ally, David Wildstein, who has pleaded guilty to being the culprit behind the lane closings, testified as prosecutors showed a series of photographs of him, Mr. Christie and Bill Baroni, then the governor’s top staff appointee at the Port Authority of New York and New Jersey, which runs the bridge, at a service in Lower Manhattan on the 12th anniversary of the Sept. 11, 2001, terrorist attacks. The photos showed the three men in a loose huddle outside the governor’s official vehicle on a dirt roadway between the Sept. 11 memorial and the World Trade Center construction site. Mr. Christie, who has previously said he did not recall the conversation, appears engaged and animated, looking directly into Mr. Baroni’s eyes, raising his eyebrows and laughing in some of the frames and reaching out to touch the other men’s arms. “We were all very relaxed,” Mr. Wildstein testified. “Were you and Mr. Baroni bragging?” asked Lee Cortes, an assistant United States attorney. “Very much so,” Mr. Wildstein said. “This was our one constituent. I was pleasing my one constituent. I was rather happy that he was happy. ” Mr. Wildstein’s testimony narrating the set of photographs was the first detailed accounting of how the governor learned about the closings  —   which would ultimately become a scandal damaging his presidential ambitions. Mr. Christie is not charged in the case. Prosecutors have declined to explain their decisions on whom to charge, but the United States attorney for New Jersey, Paul J. Fishman, has said that simply knowing is not a federal crime. He noted that when Ms. Kelly and Mr. Baroni were charged that there were unindicted   but said his office had brought only charges it believed it could prove beyond a reasonable doubt. Mr. Baroni began, Mr. Wildstein testified on Tuesday, by telling Mr. Christie in a sardonic tone that there was a “tremendous amount of traffic” in Fort Lee and told Mr. Christie, a Republican, he would be “very pleased to know” that the mayor, a Democrat, was “very frustrated,” Mr. Wildstein testified. Mr. Christie joked about Mr. Wildstein’s role, he testified, using the name Mr. Wildstein had used in his past life as an anonymous political blogger, Wally Edge. “Mr. Baroni said to Governor Christie that I was monitoring the traffic, I was watching over everything,” he recalled. “Governor Christie said in the sarcastic tone of the conversation, ‘Well, I’m sure Mr. Edge would not be involved in anything that’s political. ’” Mr. Wildstein testified that Mr. Christie had not known about the lane closings before they happened. But the governor did know that the mayor, Mark Sokolich, had fallen out of favor with the Christie team for refusing to endorse him despite nearly three years of wooing with gifts and favors from the administration. And Mr. Christie did not signal disapproval. “From this conversation, were you concerned about continuing the lane reduction?” the prosecutor, Mr. Cortes asked. “No, not at all,” Mr. Wildstein said. Beginning with a marathon news conference in January 2014 after the lane closing scheme had become  public, Mr. Christie has insisted that he had nothing to do with planning or executing the shutdown of two of the three access lanes from Fort Lee to the bridge, the world’s busiest. At an event in Trenton on Tuesday, he denied Mr. Wildstein’s allegations that he knew about the closings as they were happening. “All kinds of stuff is going on up in a courtroom in Newark,” Mr. Christie said. “I want to be really clear: I have not and will not say anything different than I’ve been saying since January 2014. No matter what is said up there, I had no knowledge prior to or during these lane realignments. ” But here, where Mr. Baroni and Bridget Anne Kelly, a former deputy chief of staff to Mr. Christie, are on trial in United States District Court on charges including  fraud and conspiracy, prosecutors and defense lawyers alike have said Mr. Christie understood what was going on while the lanes were closed. Mr. Wildstein testified that he and Mr. Baroni had looked forward to telling the governor, seeing it as “a curtain call. ” Ms. Kelly, he said, had told him, “The governor is going to love this. ” “I remember the quote,” Mr. Wildstein added. “‘The governor is going to love this. ’” Mr. Wildstein also named other members of Mr. Christie’s inner circle who he said had known well before it became public that the lane closings had been intended as retaliation against the mayor. Among them was a confidant of the governor’s, David Samson, then the chairman of the Port Authority. He came later to the conversation at the Sept. 11 memorial, according to the testimony and photographs presented in court. As he did, Mr. Samson told Mr. Christie that another Democratic mayor, Steven Fulop of Jersey City, was pressing him to meet to discuss Port Authority business, Mr. Wildstein recalled. But the Christie administration was mad at Mayor Fulop as well, for not endorsing the governor. The governor, Mr. Wildstein said, had previously ordered his administration to cancel a day’s worth of meetings intended to help introduce the mayor to administration officials who could help him. “Governor Christie said no, no meetings with Mayor Fulop,” Mr. Wildstein testified. “He’s not getting any responses from the administration, just like Mayor Sokolich wasn’t. ” Two days later, Mr. Wildstein testified, Mr. Samson reassured Mr. Baroni that he would help “retaliate” against a New York official who had ordered the lanes reopened. Two months later, when Mr. Christie had won   but reporters were continuing to pose questions about the lane closings, Mr. Wildstein met with Michael DuHaime, the governor’s political strategist. Mr. Wildstein testified that he told Mr. DuHaime that he had directed the scheme, and that Mr. Baroni was involved, along with Ms. Kelly and Bill Stepien, the governor’s campaign manager. He also told Mr. DuHaime that he had told Mr. Christie about it on Sept. 11. “I told him that we had discussed it with Governor Christie and that Governor Christie seemed to be enjoying it,” Mr. Wildstein testified. “Mr. DuHaime was upset with me,” he added. “He thought this had been a very bad idea. ” He recalled Mr. DuHaime’s saying, “I wish you had spoken with me I would have told you not to do it. ” Mr. Wildstein said he told Mr. DuHaime that he was willing to resign “so the story might go away” and others would not get in trouble. “Mr. DuHaime did not think the story would reach that level,” Mr. Wildstein testified. “He did not think the story would go as bad as it did. ”'"}, "time": 1742562220.958741}