{"duration": 0.10186910629272461, "input_args": {"text": "'GARLAND, Tex.  —   There was a time when he was known as a   young man  —   a regular at his church and a pleasant presence on a   suburban, multicultural street in a neighborhood called Camelot. He grew up to serve his country in Afghanistan. But on Thursday night,    Micah Johnson, an   drove his car to a rally against police violence and began killing  officers in downtown Dallas, hoping to single out the white ones. In the process, he also managed to bring his war back home, killing at least one fellow military veteran and heightening fears that the nation he had been deployed to protect overseas was now failing to address its growing racial divide at home. The Dallas police remained on edge Saturday. In the late afternoon, officers drew their weapons and cleared an area near the back of their headquarters after a report of a suspicious person in a department parking garage. The agency later said that no one had been found. In the past several days, as demonstrators jammed the streets in a number of American cities, protesting police violence, new details emerged about Mr. Johnson’s life. They revealed a young man who had returned in disgrace from his stint abroad in the Army Reserve, but then continued a training regimen of his own devising, conducting   exercises in his backyard and reportedly joining a gym that offered martial arts and weapons classes. A Dallas County official also revealed Saturday that Mr. Johnson  —   who killed five officers and wounded seven others, as well as two civilians, before the police killed him with a   explosive device  —   had kept an extensive journal and described a method of attack in which a gunman fired on a target and then quickly moved to another location to confuse an enemy. Although it did not seem to be a precise plan for Mr. Johnson’s ambush, it was strikingly similar to the tactics he used. “It’s talking not only about how to kill but how to keep from being killed,” said Clay Jenkins, Dallas County’s chief executive and director of homeland security and emergency management, who said he had not read the original journal but had reviewed summaries of it. “It shows that he’s well prepared. ” Mr. Johnson showed an affinity for radical   organizations on his Facebook page. Organizers of the Black Lives Matter network and others have denounced Mr. Johnson’s shooting spree. In a news conference on Saturday in Warsaw, President Obama said it was “very hard to untangle the motives” behind the shooting. “As we’ve seen in a whole range of incidents with mass shooters, they are, by definition, troubled,” Mr. Obama said. “By definition, if you shoot people who pose no threat to you  —   strangers  —   you have a troubled mind. What triggers that, what feeds it, what sets it off, I’ll leave that to psychologists and people who study these kinds of incidents. ” On Saturday, Gov. Greg Abbott of Texas said in a statement that Mr. Obama had called him to offer condolences. Mr. Abbott said he had thanked the president and reiterated the need for Americans to unite after the shooting. Tensions remained high, however. In San Antonio, the police were investigating reports late Saturday that gunshots had been fired at their department’s headquarters, Chief William McManus said at a briefing. Officers said that they heard gunshots hitting the building just before 10 p. m. and that “a number of shell casings” were recovered, Chief McManus said. There were no injuries. Mr. Johnson spent some of his childhood at the home of his father and stepmother in Garland, about a   drive north of downtown Dallas. Their neighborhood, Camelot, is a collection of   and     houses of    vintage, and their house is set in the middle of a   block, where a number of neighboring homes this weekend still displayed American flags from the Fourth of July weekend. The neighbors walking by or working on their lawns were black, white, Hispanic and Asian. Courtney Williams, 37, an electrician who lives in Forney, just east of Dallas, said he had known Mr. Johnson during his teenage days, when Mr. Johnson would stay with his mother in the Pleasant Grove area of Dallas. The two young men attended the same church, and Mr. Williams recalled Mr. Johnson as a “ ” youth who was active in church events and the typical pursuits of a teenager. “Video games, the whole nine yards,” he said. Mr. Johnson showed no interest in weapons, Mr. Williams said. “He was just a quiet kid,” Mr. Williams said. “No attitude, no trouble with school. Just a normal kid. ” Mr. Williams lost touch with Mr. Johnson after the younger man graduated from John Horn High School in Mesquite, Tex. where he had shown some interest in the military, going so far as to participate in the school’s Junior Reserve Officers Training Corps program. He was not, it seemed on Saturday, a standout: Horn’s former J. R. O. T. C. instructor said he had little recollection of Mr. Johnson. He enlisted in the Army Reserve in 2009 and was assigned to a unit  —   a component of the 420th Engineer Brigade  —   near Dallas. More than four years later, the unit deployed to Afghanistan. But before the soldiers left for the Afghan theater, they stood in formation not far from the streets where Mr. Johnson would someday stage a siege. An officer urged them to take care of their families and cultivate their faith. He also emphasized the importance of adapting on the fly. “Continue to build the flexibility to adjust to changing and unforeseen situations faster than the enemy can adapt,” the officer said, according to a video of the ceremony. “This is how we will succeed. ” But Mr. Johnson did not succeed. While overseas, a female soldier in Mr. Johnson’s unit accused him of sexual harassment. When the Army considered kicking him out, he waived his right to a hearing in exchange for a lesser charge. Soon he was back in Texas, living with his mother. Ron Price, 49, a former president of the Dallas school board, lives in Mesquite, about four blocks away. He used to see Mr. Johnson in the neighborhood and exchange hellos. He said he had noticed nothing really remarkable about him. “He was just another guy at the gas station,” he said. But Mr. Jenkins said a neighbor had seen Mr. Johnson doing militarylike exercises in his backyard in Mesquite in the last couple of weeks. Mr. Johnson’s preparations seemingly extended to visits to a “  and personal protection” gym in the Dallas area. The gym’s owner, Justin Everman, told The Daily Beast that it counted many police officers among its members, and he sought to distance himself and his business from Mr. Johnson. “It’s disgusting, what he did,” Mr. Everman told The Daily Beast. “I’m disgusted. ” In addition to reading summaries of the journal, Mr. Jenkins said he had heard descriptions of its contents from other officials. Some of it was given over to very specific combat and sniper tactics, including details, Mr. Jenkins said, of “what we call ‘shoot and move’ tactics  —   ways to fire on a target and then move quickly and get into position at another location to inflict more damage on targets without them being able to ascertain where the shots are coming from. ” This tactic is used by the military’s special forces. “When you couple ‘shoot and move’ and other tactics in his writings, his practice in the yard, his interest in weaponry, it seems to me that this was a   individual,” Mr. Jenkins said. He added, “It appeared that he was an excellent marksman and was calmly shooting, as opposed to someone who’s just holding a gun up and aiming it and pulling the trigger in the direction of where they think people are. ” Mr. Jenkins said Mr. Johnson had used a semiautomatic SKS rifle and a   handgun. He drove his vehicle to the demonstration and parked it, Mr. Jenkins said, but was on foot at many points throughout the attack. Mr. Johnson’s knowledge of “shoot and move”  —   and the fact that a few of the protesters in the crowd who were not involved in the shooting were armed and carrying rifles  —   has helped shed light on how a theory of multiple assailants emerged. In Texas, gun owners can legally and openly carry what are known as long guns, including shotguns and rifles. The carrying of handguns is regulated in Texas and requires a   permit, whether concealed or openly carried, but the carrying of rifles is largely unregulated and requires no permit. The   open carrying of rifles has become common at many demonstrations in Texas in recent years. “When the shooting first happened, you had people in the crowd who were carrying long rifles and dressed in camouflage,” Mr. Jenkins said. “And then the shooting happens, and those people begin to disperse and move quickly, and they have guns and they’re not police officers and there’s a shooting, and so one of the things that people would investigate quickly is did they have anything to do with whatever is happening. ” Mr. Jenkins said that Mr. Johnson did not appear to have advance knowledge of the march route. Parts of the route were determined on the spot without planning, Mr. Jenkins said. Throughout a sweltering Saturday, a section of downtown Dallas remained a   crime scene as investigators faced a second day of piecing together the details of the attack, an inquiry that had included more than 200 interviews. More than 20 square blocks remained cordoned off. Two squad cars outside Police Headquarters have become memorials, covered in flowers, balloons, posters and handwritten notes. On Friday evening, before the officers went on heightened alert, person after person slowly and quietly approached the cars to add tributes. A Dallas police sergeant wiped her eyes, and a handful of people gathered in a circle to pray. Similar moments played out on Saturday. “I miss you already Brother, but you are home with the angels now,” said a note about Officer Brent Thompson. The authors wrote, “You were, are, and always will be our hero. ” As Mayor Mike Rawlings visited Police Headquarters on Saturday, he told reporters: “We’re all human here, and I think that people feel each other’s pain. And that’s what makes it great, that’s what makes you hopeful that we can do this, that we can move from senselessness, absurdity that’s like a Camus novel, to something that has redemption and hope in it. And that’s ultimately what we need to do. ” He stopped to speak with a woman kneeling by one police car and told her, “Pray hard, sister. ”'"}, "time": 1742628542.1661727}