{"duration": 0.3137543201446533, "input_args": {"text": "'World War III — the first (and final) nuclear war — has never been so likely as it is now. Eric Zuesse, originally posted at strategic-culture.org Here is the reason why we are currently even closer to a civilization-ending nuclear war than was the case during the Cuban Missile Crisis of 1962: During the Cold War, the two sides agreed that any war between the capitalist side and the communist side would escalate to nuclear war between the U.S. and the USSR and constitute Mutually Assured Destruction (M.A.D.). Therefore, because of this mutual acceptance of M.A.D., hot war didn’t develop during that entire period, from 1945 till the Soviet Union dissolved and ended its military alliance the Warsaw Pact, both of which ended in 1991. Throughout that 45-year period, called “the Cold War,” there was no hot war between the two nuclear superpowers, because both sides believed that any hot war would end in M.A.D. — mutual annihilation, and the end of civilization. It would end that way because any hot war between the two sides would terminate either in one side surrendering to the other, or else in at least one of the two sides (presumably to be started by the one that’s on the brink of defeat in the traditional hot war) nuclear-attacking the other (as being its only alternative to defeat). In other words, M.A.D. recognized and accepted the fact that for a nuclear power to attack a nuclear power with non-nuclear weaponry will almost certainly provoke a nuclear war at the moment when one of the two is losing (or about to lose) the conventional conflict to the other. Nuclear weapons are weapons of last resort, but they exist in order to prevent defeat. That’s what they exist for. If Japan had had deliverable nuclear weapons, then the end of World War II would have been considerably delayed. Japan would have lost because it had no allies, but the end of WW II would have been very different than it was. Only M.A.D. avoided the Cold War becoming a hot war. But M.A.D. is not just a physical reality but equally importantly a mutually-shared belief-system , a belief-system that becomes no longer operative if one of the two sides switches to believe that a way exists actually to win a nuclear war — in other words, to believe that conquest of a nuclear power by another nuclear power is a real possibility. During the years prior to 2006, there was an increasing though unspoken belief at the top of the U.S. aristocracy (the people who control the U.S. government — or at least have controlled it since 1981 ), that the United States would be able to win a nuclear war against Russia; and, suddenly, in 2006, the belief was published, and virtually no one who possessed power or influence challenged it; and, from that time forward, M.A.D. was ended on the American side, and nuclear weapons became, in the U.S., strategized within a new framework (called “nuclear primacy” ) — the framework of nuclear weapons as constituting the ultimate weapons of conquest by the U.S. government. After 1991, when the Warsaw Pact no longer existed, the U.S. military alliance NATO invited into its membership all of the former states of the USSR except Russia (thereby indicating NATO’s continuing hostility toward that particular nation and the fraudulence of NATO’s peace with it), and also invited in all of the USSR’s former Warsaw Pact allies, and so NATO (a now clearly anti-Russian, no longer at all anti-communist, alliance) has come to extend right up to Russia’s own borders — something that the U.S. had refused to allow the USSR to do to the U.S. in 1962, when the Soviet dictator Khrushchev wanted to place nuclear missiles in Cuba just 90 miles from America’s border. In the new era during which the U.S. government and its allies believe that nuclear primacy is about to be achieved, the framework in which the use of ‘nuclear primacy’ would be ‘justified’ is that, as soon as such ‘primacy’ is believed to have been obtained (such as by means of anti-ballistic missiles having been installed that would supposedly annihilate Russia’s nuclear arsenal before their warheads could even be released to retaliate against the U.S.-and-allied nuclear invasion), the U.S. side’s ‘defensive’ traditional-weapons invasion of Russia is being defeated by the Russians, and so the only way available to prevent the defeat of the U.S.-and-allied forces is by the use of nuclear weapons (the ‘taking-advantage’ of America’s ‘nuclear primacy’). That’s how the nuclear attack would be ’justified’, as a ‘necessary defensive response’ against Russia. Consequently, in the current U.S.-NATO operation on and near Russia’s borders , the Alliance is starting the buildup of its traditional invasion forces. This includes even some U.S. allies that aren’t in NATO . The supposed ‘justification’ for this amassing of invasion-forces on Russia’s borders is to ‘defend’ against ‘Russia’s aggression’ when (in March 2014 just weeks after the bloody U.S. coup in Ukraine ) Russia enabled the residents of Crimea to rejoin Crimea as part of Russia, of which Crimea had been until the Soviet dictator Khrushchev arbitrarily transferred Crimea to Ukraine in 1954 . That disagreement about Crimea is the supposed root-cause for NATO’s involvement, even though Ukraine still isn’t (and previously didn’t want to be) a member of the NATO alliance. Anyway: this is the rationalization for NATO’s buildup toward what could become WW III. Ever since 19 February 2016, the U.S. has been storing tanks and artillery , sufficient “to support 15,000 Marines” in undisclosed “confidential” Norwegian caves. Norway has a 200-mile border with Russia. CNN’s news-report on that was accompanied by a video headlined “Russia Reveals Aggressive Military Plans” . It reported that Russia’s (democratically elected, though not mentioned as such) President, Vladimir Putin, was moving troops and weapons toward Norway’s border. (How would the U.S. respond if Russia were to be storing invasion-equipment and troops in Mexico near the U.S. border? Would the U.S. be moving troops and weapons near the Mexican border to protect against an invasion of America; and, if so, then how accurate would it be if Russia’s media then headlined “America Reveals Aggressive Military Plans”? Hitler’s Germany used those sorts of media-tactics, but this time Obama’s America is doing that.) Marine Corps Times headlined on October 24th, “More than 300 Marines heading to Norway in January” . U.S. President Barack Obama means business: he’s getting things set up for Hillary Clinton to finish as his successor. This kind of boldness exceeds anything during the Cold War. America, and its greatly expanded NATO, thus now surrounds Russia not just with its tanks etc., but with its missiles and bombers, on and near Russia’s borders, and so the flight-time from launch to the nuclear-bombing (if the ground-invasion of Russia encounters defeat) will be less than ten minutes, sometimes even less than the time for Russia to get its own missiles launched in retaliation against ours; and so a U.S. blitz nuclear attack against Russia could conceivably be an entirely one-sided war. Here is how that scenario — the end of physical M.A.D. — has actually become the objective sought by the U.S. government (and the necessary backstory for America’s war-drills on Russia’s borders): In 2006, the U.S. aristocracy published in the journal Foreign Affairs, from their Council on Foreign Relations, the first article which said that the U.S. goal should no longer be a continuation of M.A.D., but instead “The Rise of U.S. Nuclear Primacy” , by which the U.S. aristocracy meant the rise of America’s ability to win a nuclear war against Russia. It established this stunning goal merely by saying that such an objective could be achieved and that it should be achieved, and by the article’s being published by the U.S. aristocracy itself (the people who control this country), and by furthermore the U.S. aristocracy not condemning and rejecting and repudiating it but simply letting that article stand with little to no public discussion (and no public debate) about it, much less with the chorus of public condemnations of it in the U.S. press, such as would have happened if America were a democracy — but this nation no longer is a democracy, it has become an aristocracy , and this aristocracy had now published the “Nuclear Primacy” article. (By contrast, in the obscure journal China Security was published in the Autumn 2006 issue the main critique against it, “The Fallacy of Nuclear Primacy” . That article had no impact.) The Foreign Affairs article even was so bold as to assert that “U.S. leaders have always aspired to this goal” (nuclear primacy) — a wild and unsupported allegation that’s not much different from alleging that not only George W. Bush but all U.S. Presidents after World War II were aspiring to have the ability to conquer Russia (and the authors were asserting that only now was this supposedly terrific ability coming within reach). It was explicit about G.W. Bush’s having this desire: “The intentional pursuit of nuclear primacy is, moreover, entirely consistent with the United States’ declared policy of expanding its global dominance. The Bush administration’s 2002 National Security Strategy explicitly states that the United States aims to establish military primacy.” That allegation was tragically true, which is one of the reasons why Bush (like his father, who actually started the determined policy to achieve nuclear primacy) was so dangerous and harmful a President. His invasion of Iraq was merely a sympton of that deeper disease. And, so, this article about “The Rise of U.S. Nuclear Primacy” and “The End of” M.A.D., was now — since it was published by the CFR and not rejected by any influential group — accepted within the U.S. as a goal, “Nuclear Primacy,” which the U.S. government could and should strive for. That idea, of a winnable nuclear war (winnable by the U.S., of course), was no longer heretical, no longer viewed as repugnant. In fact, this article had been introduced and accepted by Harvard University simultaneously in its longer form and simultaneously published by their scholarly journal International Security , which is the leading (it’s the world’s most influential) scholarly journal dealing with that subject, and its title there was “The End of MAD?” . (The periods are customarily removed from the acronym “M.A.D.”, perhaps in order to associate the M.A.D. concept with the pejorative term, insanity. So — at least in the United States — the termination of M.A.D. has always had a favorable ring to it, even before that goal became effectively U.S. policy, which it has been at least ever since 2006.) And no one was saying that Harvard and its journal and the CFR were the ones who were at all “mad” or anything similar, such as “insane.” The aristocracy’s stamp of approval upon the concept of nuclear primacy was clear, from at least 2006 on. Although M.A.D. continued as regards Russia’s side, it no longer remained operative thinking on America’s side. That’s now clear, and this is Russia’s predicament — and the world’s (because a nuclear war involving even just one of the two nuclear superpowers would destroy the world ). U.S. President Barack Obama is putting the goal of nuclear primacy into place, starting with implementation of Ronald Reagan’s proposed “Star Wars” Anti-Ballistic Missile (ABM) defense system, now called the Ballistic Missile Defense (BMD) system, and technically called by the name of its current embodiment: Lockheed Martin’s, Boeing’s, and Raytheon’s, Aegis Ashore system, which Obama first made operational in Romania on 12 May 2016 . It’s designed so as to enable a surprise nuclear attack against Russia in which any missiles that Russia might be able to launch in retaliation will supposedly (if the system works 100%) be annihilated during their launch-phase. Officially , however, its purpose is to defend Europe from being attacked by Iranian missiles. Any public U.S. admission that this ‘defensive’ system is actually preparation for a blitz U.S. nuclear assault on Russia is obviously out of the question. And, obviously, Russians know that Obama is lying and that this is preparation by the U.S. for a blitz nuclear attack against Russia. The West’s ‘news’ media might be such ‘fools’ as not to be aware of that fact, but Putin has made quite clear that he is not, and he is preparing Russia to deal with it. Obama’s action here was made possible by U.S. President George W. Bush’s 2002 unilateral termination of the 1972 Anti-Ballistic-Missile Treaty with Russia’s predecessor, the Soviet Union. Bush rushed forward with Reagan’s “Star Wars” program even despite there having been no successful tests of the necessary technology: the existing technology consistently failed but Bush decided to invest $53 billion of U.S. taxpayers’ money in it . Bush in 2004 received British Prime Minister Tony Blair’s participation and provisioning of locations and facilities to implement the plan , and Bush was also pressing both Poland and the Czech Republic to allow the U.S. to position ABMs there . Obama came into office criticizing the ABM plan and pretending not to be hostile toward Russia. He deceived Vladimir Putin into thinking that Obama sincerely wanted to pursue peace and cooperation with Russia. As soon as Obama became re-elected, his verbal smiling teeth immediately became actual glaring fangs. Then, soon after his regime overthrew in a bloody February 2014 coup the Moscow-friendly democratically elected President of Ukraine, bordering Russia , Russia started in the summer of 2014 to ignore the 1987 Intermediate Nuclear Forces Treaty, because for Washington the next step (beyond Ukraine) clearly now would be Moscow and so all bets were off. The installation of the Aegis Ashore in Romania likewise violates that Treaty , which is one important reason why Obama lies to say that all of the Aegis Ashore facilities will be targeted against Iran — and maybe also North Korea — but never against Russia. The full Aegis Ashore system, which will require several such sites, isn’t yet operational. NATO’s PR-arm the Atlantic Council, has mentioned among the Aegis Ashore’s benefits, that for the next such site, in Poland, “Poland announced in late April that it would buy eight Patriot missile batteries from Virginia-based Raytheon Co. in a deal that could generate at least $2.5 billion in US export content.” The U.S. government officials and their friends who have invested in Raytheon and the other ‘defense’ firms didn’t need to be informed of this by any PR person. They already knew of it from more reliable sources, and perhaps they even have invested in nuclear bunkers for themselves and their friends and their friends’ friends . Lots of money is changing hands during this build-up. Also in 2006, later in that year, specifically on 18 November 2006, was published at Global Research, which is an independent Canadian online international site dealing with geostrategy, a superb summary of the connection that this plan has to America’s string of invasions in the Middle East. It’s titled “Plans for Redrawing the Middle East: The Project for a ‘New Middle East’,” by Mahdi Darius Nazemroaya, who explains: It should be noted that in his book, “The Grand Chessboard: American Primacy and Its Geo-strategic Imperatives,” Zbigniew Brzezinski, a former U.S. National Security Advisor, alluded to the modern Middle East as a control lever of an area he, Brzezinski, calls the Eurasian Balkans. The Eurasian Balkans consists of the Caucasus (Georgia, the Republic of Azerbaijan, and Armenia) and Central Asia (Kazakhstan, Uzbekistan, Kyrgyzstan, Tajikistan, Turkmenistan, Afghanistan, and Tajikistan) and to some extent both Iran and Turkey. Iran and Turkey both form the northernmost tiers of the Middle East (excluding the Caucasus4) that edge into Europe and the former Soviet Union. The Map of the “New Middle East” A relatively unknown map of the Middle East, NATO-garrisoned Afghanistan, and Pakistan has been circulating around strategic, governmental, NATO, policy and military circles since mid-2006. It has been casually allowed to surface in public, maybe in an attempt to build consensus and to slowly prepare the general public for possible, maybe even cataclysmic, changes in the Middle East. This is a map of a redrawn and restructured Middle East identified as the “New Middle East.” MAP OF THE NEW MIDDLE EAST Note: The following map was prepared by Lieutenant-Colonel Ralph Peters. It was published in the Armed Forces Journal in June 2006, Peters is a retired colonel of the U.S. National War Academy. (Map Copyright Lieutenant-Colonel Ralph Peters 2006). Although the map does not officially reflect Pentagon doctrine, it has been used in a training program at NATO’s Defense College for senior military officers. This map, as well as other similar maps, has most probably been used at the National War Academy as well as in military planning circles. Brzezinski’s advocacy of “American Primacy” fits perfectly with the aristocracy’s support of “Nuclear Primacy,” and appeared eight years before it. His 1998 book was seminal also in many other ways. And, as that Nazemroaya article made clear, Brzezinski’s plan was already being put into effect by the U.S. government, even before 2006. However, the person who actually made the seminal decision behind all of this, the decision to conquer Russia, was U.S. President George Herbert Walker Bush, on the night of 24 February 1990, just before the Soviet Union ended. He was the person who decided that after the USSR and its Warsaw Pact terminated, NATO would continue that cold war until Russia has been surrounded by U.S. allies, who are Russia’s enemies, when Russia will ultimately either surrender or else be destroyed by the U.S. and its friends. Even if Russia assumes that any such nuclear war would be M.A.D., the government of the U.S. no longer does. That’s Russia’s predicament — and the world’s . However, military planners in the U.S. and its vassal nations, do not include in their calculations the world: the impacts that such nuclear winter and all the rest will have if their dream of ‘nuclear primacy’ amounts to anything more than merely the vicious hoax that it is. This fact, of their ignoring the world, is scandalous — against our military planners. They are so obsessed with ‘victory’, that they are willing to participate in this false and potentially mega-catastrophic dream, of ‘nuclear primacy’. Unless and until nuclear weapons are totally eliminated (which might never happen), their constructive function, of preventing WW III, must continue, not end as a result of ‘nuclear primacy’ and other such lies and delusions. However, the ‘news’ media, especially in ‘The West’, are not pointing out those lies and distortions, but instead reinforcing them. If there is to be a WW III, it will end the world . That is the key fact, which is ignored by ‘The West’s’ military planners. NATO needs to end now, just as the Warsaw Pact did in 1991 — when an indecent, oligarchic , ‘The West’ continued the Cold War despite the Warsaw Pact’s end, and now is making it hot.'"}, "time": 1742563346.6632783}