{"duration": 0.10638761520385742, "input_args": {"text": "'John Carney, Breitbart News finance and economics editor, joined SiriusXM host Alex Marlow on Thursday’s Breitbart News Daily to talk about the Dow’s hitting 21, 000 for the first time after President Trump’s address to Congress. [Marlow asked what Dow 21, 000 means to the average person. Carney replied that “people’s retirement savings [and] investment portfolios, have gone up tremendously. ”  “We’ve seen a tremendous rally  —   in fact, the fastest ever, or it tied the fastest ever   gain on record. You might remember just a little while ago, we were talking about Dow 20, 000, and then in just a few weeks, we’ve hit Dow 21, 000. Huge, tremendous rally,” Carney said. Marlow asked if President Trump’s “gloating” and “braggadocio” over the stock market rally could backfire. “Yeah, look, you’ve got to be careful, right? Because if you own the rally, and it reverses, you’re going to end up owning the slump, as well,” Carney cautioned. “Stock markets don’t only go up. They’re not only going to go up during the Trump administration. So far, they have  —   the stock market’s actually up 15 percent since Election Day, which is gigantic. It’s up five percent just over the last few weeks. But history is very clear: stock markets go up, and they go down. You’ve got to be a little cautious about this. ” “A lot of the force behind the rally is a lot of optimism about what’s going to happen with taxes, with trade, with regulation, but all that stuff has to go through Congress, and Congress can be a very messy place,” he noted. “We don’t know a lot of the details about what’s going to happen with Trump’s tax plan. Even if we knew the details about what he wants, that’ll get changed when it goes to Congress. People could be disappointed. The Federal Reserve could raise interest rates ibn fact, they’re likely to. That could also end up putting the brakes on the rally and perhaps causing stocks to go the other way. ” “Yeah, you’ve got to be cautious when you start bragging about the stock market going up,” he advised. Marlow asked if Met Life’s “too big to fail” case would be a major test of Trump’s agenda, a subject Carney is writing about at length for Breitbart News. “Met Life is one of the three largest insurance companies in the United States. AIG and Prudential are the others,” Carney explained. “Under the Obama administration, a financial regulatory body called FSOC labeled them as ‘too big to fail.’ The official label is a SIFI, Systemically Important Financial Institution. Met Life fought it, won in court, and the court struck down that designation. ” “The Obama administration appealed that case and said, ‘Even though the court struck it down, we would like the appeals court to put that label back on them as too big to fail.’ The court hasn’t decided anything yet. The Trump administration can, if it wants to, rescind the appeal  —   in other words, ask the court, ‘Hey, never mind. We’re okay with the original decision’ and go forward with that,” he continued. “This will be a test. The president has said he wants to slow down the enormous growth of the regulatory state. This is an opportunity to do that, but there’s a ticking clock on it. Once the appeals court makes its decision, you can’t sort of wave it away the way you can right now, and you’ll end up having to appeal it perhaps to the Supreme Court,” he said. “There’s an opportunity to slow the growth of the regulatory state. The question is whether or not they’re going to take it now,” Carney concluded. Marlow noted that Trump has been criticized as a “champion of Wall Street,” even though he ran a populist campaign. “Look, I think that there are multiple ways of thinking about somebody as a ‘champion for Wall Street,’” Carney argued. “The Trump administration so far, at least in terms of the stock market, has been very good for a lot of these big financial institutions  —   but it’s also been very good for the smaller businesses. If you look at the broader index, the SP 500 or the Russell 2000, those stocks have also done very well. ”  “Even though it entails putting more regulation on them, it also sort of puts a patina of protection around them and says these are the institutions that the United States thinks are so important it will never let them fail,” he said. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742563618.387857}