{"duration": 0.031768083572387695, "input_args": {"text": "'Chelsea Handler has blasted the “gun lobby” and issued a renewed call for increased gun control measures days before the talk show host is set to be honored at the   Brady Center Bear Awards Wednesday night. [In an interview with the Hollywood Reporter this week, Handler said she believes President Donald Trump loves the “gun lobby” and “doesn’t give a sh*t about people. ”  In fact, Handler contends that Trump “doesn’t care about anybody. ” Handler told THR: Obviously, [the state of] gun control in this country is totally unacceptable, and the gun lobby is so strong and so powerful that anytime a celebrity can bring attention to this cause  —   among many other [causes]  —   you know it’s an easy thing for anyone to do. We’re way behind the times in terms of gun control in this country, and it doesn’t seem like it’s going anywhere anytime soon. Our voices just need to keep getting louder, and the people that make an impact need to really just step up and stick their necks out a little bit more. THR then pointed to the NRA’s support of Trump during last year’s campaign campaign and Trump’s   Amendment stance then and now. Handler responded, “People need to be louder than ever with this president and his relationship to the gun lobby. He doesn’t give a s —  about people. He doesn’t care about anybody. ” The host of Netflix’s Chelsea also appeared to suggest that gun ownership is nothing more than a “hobby. ” “Nobody is trying to take away your guns. If you want to go shoot, you know, whatever, in the woods, that’s fine, but it’s a hobby,” she told THR. “If your hobby is [affecting] innocent people being killed all the time, children included, don’t you think you should reconsider the lack of restrictions placed on your hobby?” Handler mentioned a few specific gun controls she believes are needed, such as “heightened  …     restrictions on buying guns. ” The left has been pursuing such restrictions in the form of universal background checks for decades, but the American people have continually elected people —  either to Congress, the White House, or both —  who will prevent such checks from being put in place. The opposition to the checks springs from the understanding that they not the real goal of the left. Rather, the goal is the gun registration that follows such checks (see California). Moreover, the American people have rejected such checks because they do not work determined attackers still kill large numbers of innocents at will with firearms, knives,   trucks. After all, France has universal background checks, yet they witnessed 142 innocents gunned down by terrorists in 2015 alone. London has such checks too, but that did not stop three attackers from driving a van into pedestrians on London Bridge on June 3, 2017, then chasing and stabbing innocents in Borough Market. Closer to home. California has universal background checks, but that did not prevent the May 23, 2014 Santa Barbara attack, the December 2, 2015, San Bernardino attack, the June 1, 2016, UCLA   or the October 8, 2016, ambush and murder of two Palm Springs police officers. Additionally, the attacks in France and the one in San Bernardino occurred in   zones, and Trump condemned such zones from the campaign trail, arguing that citizens ought to be able to be armed to shoot back. On January 10, 2016, just over after month after the San Bernardino attack, Trump told NBC’s Meet the Press: If in Paris or if in California recently, where the fourteen people were killed and probably others to follow —  in terms of that group because you have some people who are very, very badly wounded —  if in Paris they had guns or if in California [they had guns,] on the other side, where the bullets go both ways, not just in one direction. You wouldn’t have had the kind of carnage that you had. That does not sound like a man who “doesn’t care about anybody. ” Instead, it sounds like a man that wants American citizens to have a fighting chance should a terror attack occur. This article has been updated to include additional information. AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742628553.9537306}