{"duration": 0.24057626724243164, "input_args": {"text": "'Mon, 24 Oct 2016 18:05 UTC Criminal defense attorney says both DNC and Clinton campaign guilty of \\'numerous\\' crimes Undercover videos, released this week by conservative activist group Project Veritas, show Democratic operatives conspiring to incite violence at Trump rallies — and may be enough to warrant a federal investigation. Hillary Clinton has already faced one FBI investigation for her use of a private server to transmit and store emails while she was secretary of state, and now her campaign could face a second one into the Democrats\\' long tradition of violent agitation. \"This is not just about inciting riots, which is bad enough, it is also about a confessed conspiracy to try to steal an election through violence.\" \"There is sufficient factual predicate to open an investigation\" into the Democratic National Committee and Clinton campaign\\'s involvement in the conspiracies described in the videos, Brady Toensing, a white-collar criminal defense attorney, told LifeZette. \" The potential crimes admitted to on the tapes are numerous,\" Toensing said. \"There are civil rights violations and the crime of inciting a riot. But all you need is one, and then a conspiracy to commit any of these crimes is itself a federal felony, which on its own comes with up to five years in prison,\" he added. \"There are also numerous potential state law violations and civil causes of action.\" © Project Veritas Scott Foval In one of the videos, Democratic consultant and Field Director for Americans United for Change Scott Foval admitted to paying people to incite violence at Trump events. \"The bird-dogging. The aggressive bird-dogging. What I call it is \\'conflict engagement,\\'\" Foval said. \"Conflict engagement in the lines at Trump rallies? We\\'re starting anarchy. And he needs to understand that we\\'re starting anarchy, \" he continued. \"We have mentally ill people that we pay to do sh**, make no mistake,\" Foval added. \"If you\\'re there and you\\'re protesting and you do these actions, you will be attacked at Trump rallies. That\\'s what we want.\" \"Foval is describing what is called conduct laundering, but they got sloppy,\" said Toensing, a former U.S. Senate legislative aide for campaign financing who has represented clients in multiple state and federal campaign finance investigations. \"In their arrogance, they bragged about the scheme on tape and, as part of that scheme, engaged a convicted felon, having him visit the White House more than three hundred times. It raises serious questions that call out for compelled answers given under oath,\" Toensing continued. © Project Veritas \"Wherever Trumps and Pence are going to be, we have events and we have a whole team across the country that does both consultants and people from the Democratic Party. And the Democratic Party apparatus and the people from the campaign, the Clinton campaign and my role with the campaign is to manage all that.\" - Robert Creamer The felon to whom Toensing refers is Robert Creamer, a Democratic operative, DNC member, and head of the Democracy Partners organization, who spent five months in prison in 2006 on bank fraud and tax evasion charges. Creamer is the link between the campaign and Foval. \"We are contracted directly to the DNC and the campaign,\" Foval said in the video. \"I am contracted to [Creamer] but I answer to the head [of] special events for the DNC and the head of the special events and political for the campaign,\" he explained. Ultimately the campaign is responsible for his \"rapid response\" operations, Foval claimed. \"The campaign pays DNC, DNC pays Democracy Partners, Democracy Partners pays the Foval Group, the Foval Group goes and executes the sh** on the ground,\" he said. Another man caught on the video, Aaron Black, confirmed this relationship. Black identified himself as the \"deputy rapid response director for the DNC for all things Trump on the ground,\" and claimed his role is secret. \"Nobody\\'s really supposed to know about me,\" Black said. Black also said it was this conspiracy that orchestrated the violence in Chicago. \"So the Chicago protest, when they shut all that, that was us. It was more [Creamer] than me, but none of this is supposed to come back to us because we want it coming from people. We don\\'t want it to come from the party.\" Creamer himself implicated Clinton directly in this nefarious scheme. \"I mean, Hillary knows through the chain of command what\\'s going on,\" he said. \"The campaign is fully in it.\" © Project Veritas Aaron Black aka Aaron Minter This activity is a clear violation of 18 U.S.C. Section 2101, which forbids the use of \"any facility of interstate or foreign commerce, including, but not limited to, the mail, telegraph, telephone, radio, or television with intent to incite a riot; or to organize promote, encourage, or carry on a riot; or to ... aid or abet any person in inciting or participating in or carrying on a riot or committing any act of violence in furtherance of a riot.\" \"The shredding machines and BleachBit were probably put to work right after the release of these tapes. So time is of the essence,\" Toensing said. \"The Republican Party should demand that state and federal authorities immediately open an investigation. They should demand that a grand jury be convened, that forthwith subpoenas be served, and that search warrants be executed,\" he suggested. There are other ways an investigation could be initiated, according to Toensing. \"Congress can do its own investigation,\" said Toensing. \"There\\'s talk about that but they\\'re out of session right now,\" he added. \"Someone could [also] go to a local U.S. attorney where the offence occurred,\" Toensing continued. \"If conduct spreads to a certain area, the local authorities have jurisdiction and the local district attorney can convene a jury,\" he said. \"The FBI could [also] open an investigation on its own,\" Toensing noted. He also pointed out that the Secret Service has grounds to open an investigation into \"people who are intentionally fomenting violence and creating a hazard for [a] candidate.\" In either case, however, \"the U.S. attorney would then decide whether to proceed.\" Unfortunately, as Toensing observed, \"the U.S. attorneys are appointed by Obama.\" The way Obama\\'s Justice Department handled the Clinton email investigation — not to mention the implications for Obama if the DNC and Clinton campaign are prosecuted for a federal conspiracy — doesn\\'t exactly breed confidence that the administration will take action. \"I wouldn\\'t hold my breath,\" Toensing said. Even if the Obama administration refuses to act, however, it is likely others involved will face consequences for their actions. \"This is not just about inciting riots, which is bad enough,\" said Toensing. \"It is also about a confessed conspiracy to try to steal an election through violence.\" The Left has been conspiring to bring about political change through violence since its very inception. Foval himself expresses this truth perfectly in the recording. Conservatives \"have fewer guys willing to step out on the line for what they believe in,\" Foval said. \"There is a level of adherence to rules on the other side.\" Comment: \"In the beginning the organizer\\'s first job is to create the issues or problems.\" ― Saul D. Alinsky, \"Rules for Radicals: A Pragmatic Primer for Realistic Radicals.\" Killary was one of Alinsky\\'s protégés and actually wrote her thesis on his political model.'"}, "time": 1742563886.7867482}