{"duration": 0.08519959449768066, "input_args": {"text": "'From the beginning, the Chainsmokers knew dance music was a joke. The festivals, the groupthink, the   sounds  —   these were the hallmarks of a scene designed for ecstatic release, but also one that was easily parodied. And so rather than make serious music that others might dismiss, they embodied parody themselves. They made songs about selfies and Kanye West (in so much as they were about anything) and saw their stars rise. They seemed to understand, in a particularly disquieting way, how easy it was to game the system, turning growing American interest in and tolerance of   dance music into a platform for   ambition. That made the Chainsmokers both disorientingly effective and easily loathed. So maybe it’s humility, or maybe it’s strategy, but pointedly, over the last couple of years, the duo of Andrew Taggart and Alex Pall have been engaged in a very public process of dismantling mainstream dance music from within. By this point, they are essentially a pop duo  —   Mr. Taggart sings and writes, and both men produce. Instead of   club music though, they’ve come to specialize in a style that approximates a skinned and deboned version of those sounds, maintaining a handful of its key gestures and flourishes while administering a benzodiazepine to the tempo and volume. In 2015 and 2016, three Chainsmokers songs reached the Top 10 of the Billboard singles chart, as have two songs that appear on their new album, “Memories  …    Do Not Open,” “Paris” and the Coldplay collaboration “Something Just Like This. ” Each hit has been more denuded than the one that preceded it. This is the logical endpoint of the American   explosion of the last decade, which was almost certainly never going to end in a nightclub. It was a long con in retraining pop ears to accept some of that world’s sonic ideas. By that measurement, “Memories  …    Do Not Open”  —   the first   Chainsmokers album  —   is a savvy success that cannily toys with expectations. Most songs hover between 95 and 105 beats per minute, something more than a slog but less than a gallop. Often, when a song arrives at the drop  —   the place where an explosion usually lands  —   it instead veers into something like a sun shower, or a crowd applauding in the distance, rarely the usual gut punch. But these strategic victories don’t overshadow the Chainsmokers’ myriad weaknesses. In the ecosystem in which the Chainsmokers have thrived  —     dance music and the pop that derives from its distillation  —   the album is a meaningless concept, and the album format underscores both this duo’s weaknesses and strengths. Mr. Taggart is a capable but unexciting singer. And he has shockingly few lyrical ideas, less of a concern for performers more adept with melody. Most songs here moan about brittle young relationships over the musical equivalent of bringing an amiable golden retriever along for an unhurried jog. (The songs written with the   Emily Warren, like “Don’t Say” and the excellent “My Type,” are among the best here, with an emotional texture the others grasp for futilely.) Two    songs, the impressive “Honest” and “Wake Up Alone,” parse the weight that fame exacts on emotional relationships  —   they’re among the most credible on the album. While the Chainsmokers often appear to have decided what sort of music they’re not making, their affirmative choices are lacking. “The One” ends up somewhere near chillwave, “Break Up Every Night” is toothless   and “Last Day Alive,” a collaboration with the   duo Florida Georgia Line, is 100 percent pure pablum, a collection of dim anthemic sayings in search of a stadium, a twinkle with no diamond. All of this makes for songs in search of remixes, skeletons notable as much for what’s missing as what’s there. That’s a curious position for an act moving from the world of   festivals, where the scene is the star more than the performer, to the world of pop, where personality counts, a shift that may well be the Chainsmokers’ undoing, even if their music remains effective. That’s because onstage, on the duo’s handful of televised performances, they’re almost brutally awkward. On “Saturday Night Live”  —   where they performed “Paris” and “Break Up Every Night” last weekend  —   they were listless and limp. Of course they were. Mr. Taggart is not an aggressively trained pop star (and for what it’s worth, not a disruptive punk either). He was uncomfortable in the same way a young indie rock or folk singer might be, unsure of how to use his body as effectively as his voice. The Chainsmokers might have gamed their way into pop, but pop is hard work  —   inside jokes melt under the klieg lights.'"}, "time": 1742562192.9419787}