{"duration": 0.05700278282165527, "input_args": {"text": "'« Previous - Next » The Genes Of This Tribe Carry A DNA Of A Third Unknown Human Species \\nNew evidence found by scientists has started to suggest that the people living on the islands of Melanesia could have human DNA the world has never seen. \\nThe theory is that the DNA does not come from a Neanderthal or Denisovan (which are the two ancient species we most closely relate humans with). Scientists believe that they come from a new undiscovered species that derived from the South Pacific, northeast of Austrailia. Is There a New \"Human\" Species Waiting to be Discovered? \\nBohlender a scientist who studies DNA and its historical significance conducted a study looking at humans and how they are linked to Neanderthals and Denisovans. He concluded that at this current point we are not looking at humans ancient history fully. \\nBohlender is not saying we are not closely connected to Neanderthals and Denisovans but that we have a connection with another species that is unidentified. It is common knowledge that 100,000+ years ago our ancestors migrated out of Africa and were introduced to other hominid species living in Europe and similar areas . \\nWe see this through various studies that state we have anywhere between 1.5 to 5 percent of out DNA. As well a study done this year linked DNA from Neanderthals to diseases (i.e. Depression, heart attacks, etc.) and that HPV was transmitted between Neanderthals and Denisovans. \\nThrough these highly credible sources, Bohlender estimates that what we know about the history of Neanderthals could be quite different. He states that because of these various things that happened to the Neanderthals and their significant species timeline there must have been more connections we do not know about. \\nThis is where Bohlender introduces his third species that had a critical role is there period and can help explain why we have unknown DNA in humans. Although all of these may be true we do not have that much are evidence that this third species even existed. \\nOnly a few teeth, bones and missing links have been found. This does not mean that there are a whole different species waiting to be discovered because we do not have enough proof or peer review to stamp this information factual. \\nThis article (The Genes Of This Tribe Carry A DNA Of A Third Unknown Human Species) is free and open source. You have permission to republish this article under a Creative Commons license with full attribution and a link to the original source on Disclose.tv Related Articles'"}, "time": 1742563742.2212486}