{"duration": 0.12730169296264648, "input_args": {"text": "'RENO, Nev.  —   Hillary Clinton delivered a blistering denunciation Thursday of Donald J. Trump’s personal and political history with race, arguing in her most forceful terms yet that a nationalist conservative fringe had engulfed the Republican Party. In a   address, building to a controlled simmer, Mrs. Clinton did everything but call Mr. Trump a racist outright  —   saying he had promoted “racist lie” after “racist lie,” pushed conspiracy theories with “racist undertones” and heartened racists across the country by submitting to an “emerging racist ideology known as the  . ” “He is taking hate groups mainstream,” Mrs. Clinton told supporters at a community college here, “and helping a radical fringe take over the Republican Party. ” Mrs. Clinton said that while a racially charged and “paranoid fringe” had always existed in politics, “it’s never had the nominee of a major party stoking it, encouraging it and giving it a national megaphone, until now. ” Mrs. Clinton’s remarks coincide with a conspicuous shift in strategy from Mr. Trump, who has spoken with more compassion about people in the country illegally and expressed a desire to win   support. He has even suggested he might revisit his call to deport 11 million immigrants in the United States illegally, a pivot seen as an attempt to draw in moderate voters turned off by his views. With Mr. Trump’s rise, Mrs. Clinton has often struck a       theme in her critiques  —   warning sternly and repeatedly that the arc of his candidacy transcended standard political attack. But her effort on Thursday was remarkable for its exhaustive accounting of Mr. Trump’s controversial racial history in business and in his presidential campaign. Mrs. Clinton detailed the Justice Department’s housing discrimination case against Mr. Trump during the 1970s, noting that the applications of black and Latino residents “would be marked with a ‘C’  —   ‘C’ for colored. ” She said state regulators had fined a Trump casino for repeatedly removing black dealers from the floor and reminded the audience of Mr. Trump’s promotion of “birtherism,” questioning President Obama’s birthplace. She recalled his opening salvo in the Republican primary, calling Mexican immigrants rapists and criminals when he announced his candidacy, and his more recent suggestion that a judge with a Mexican heritage could not be impartial in hearing a case involving Trump University. “This is someone who retweets white supremacists online,” Mrs. Clinton said, citing a posting by someone with the user name “WhiteGenocideTM. “Trump took this fringe bigot with a few dozen followers and spread his message to 11 million people. ” By the end, Mrs. Clinton was quoting headlines from the Breitbart News website, which is overseen by Mr. Trump’s new campaign chief, Stephen K. Bannon. “I’m not making this up,” she warned, before digging into the site’s archives: “Birth Control Makes Women Unattractive and Crazy” “‘Would You Rather Your Child Had Feminism or Cancer? ’” “Hoist It High and Proud: The Confederate Flag Proclaims a Glorious Heritage. ” The address came a week after Mr. Trump hired Mr. Bannon, who has eagerly described the site as “the platform for the  ”  —   a loosely defined and contested term often associated with white nationalist and   sentiment. “The de facto merger between Breitbart and the Trump campaign represents a landmark achievement for the ” Mrs. Clinton said. At a rally in Manchester, N. H. on Thursday afternoon, Mr. Trump offered a   response to Mrs. Clinton’s speech, portraying her attacks as directed not only at him, but also at his many supporters. “She lies, and she smears, and she paints decent Americans  —   you  —   as racists,” he said, motioning toward the crowd gathered at a hotel. “She bullies voters who only want a better future and tries to intimidate them out of voting for a change. ” He offered a pointed response to Mrs. Clinton and those “pushing her to spread smears and her lies about decent people. ” “I have three words,” he said. “I want you to remember these three words: Shame on you. ” Mrs. Clinton’s pitch seemed aimed largely at moderate Republicans and other voters who have watched Mr. Trump’s attempts in recent days to soften his image. “Trump is trying to rebrand himself,” she said. “Don’t be fooled. ” She detailed explicit rejections of racist behavior from prominent Republicans in the past, like Bob Dole, George W. Bush and Senator John McCain of Arizona. And she defended the House speaker, Paul D. Ryan, and Senator Ted Cruz, who had been attacked by Mr. Trump’s campaign. Mrs. Clinton suggested a reason Mr. Trump had latched onto the   theory that Mr. Cruz’s father was involved in the assassination of John F. Kennedy. “Perhaps in Trump’s mind, because Mr. Cruz was a Cuban immigrant, he must have had something to do with it,” she said, speaking before two dozen American flags. She later called the Trump campaign “a moment of reckoning for every Republican dismayed that the Party of Lincoln has become the Party of Trump. ” In a signal of the gravity with which the campaign viewed her speech, Mrs. Clinton took the stage without music. Jason Miller, a spokesman for Mr. Trump, said that with her attacks, Mrs. Clinton was merely trying to direct attention away from her own controversies. “Hillary Clinton’s attempt to delete the single worst week of her political career isn’t going to work,” he said, citing uproars over her private email server and the Clinton Foundation. Mr. Trump’s recent efforts to moderate his tone, which have come in front of predominantly white audiences, have more than occasionally offended minority voters. Mr. Trump has said   live in neighborhoods resembling “war zones,” struggle to get by on food stamps and constantly face down errant gunfire. “What do you have to lose?” he has asked. On Thursday, Mrs. Clinton offered her response: “The answer is everything. ” As Mr. Trump has been recalibrating his message, Mrs. Clinton’s team has been straining to hold Mr. Trump to his statements from the Republican nominating fight, reminding voters of his   stance on immigration and arguing that his campaign has encouraged hate groups. On Thursday morning, Mrs. Clinton posted a campaign video on Twitter featuring clips of white supremacists praising Mr. Trump. It included a   interview in which Mr. Trump initially declined to disavow David Duke, the former Ku Klux Klan leader. Near the end of Mrs. Clinton’s video, these words appear: “If Trump wins, they could be running the country. ” In her speech, she alluded to a   Trump effect in schools, citing instances of bullying that have targeted Latino and Muslim students, and lamented his penchant for conspiracy theories. “This is what happens when you treat The National Enquirer like gospel,” she said. She mused at the Trump team’s suggestion that she was in the throes of a health crisis. “Dream on,” she said.'"}, "time": 1742564355.0066519}