{"duration": 0.06337523460388184, "input_args": {"text": "'(image credit: AP/Charlie Neibergall) Dallas elections officials say allegations “likely false or instances of user error” Over the past few weeks corporate news media have interpreted Donald Trump’s repeated claims of a “rigged” election as exaggerated. The Republican presidential candidate’s response in the third presidential debate of perhaps not accepting the election result was met with similar bluster by the major punditocracy. The experience of voters in Texas and other states may be bearing out Trump’s warning as multiple reports are surfacing of electronic voting machines changing virtual ballots from Republican to Democratic presidential candidates. Because Texas law prohibits videos and photos in polling places many voters in that state explain the apparent polling shenanigans on social media. As The Economic Collapse Blog observes , [A] number of voters in Texas are reporting that the voting machines switched their votes from Donald Trump to Hillary Clinton. The odd thing is that none of the other choices were affected when these individuals attempted to vote for a straight Republican ticket. If Hillary Clinton is declared the winner of the state of Texas on election night, a full investigation of these voting machines should be conducted, because there is no way that Donald Trump should lose that state. I have said that it will be the greatest miracle in U.S. political history if Donald Trump wins this election, but without the state of Texas Donald Trump has exactly zero chance of winning. So those living down in Texas need to keep reporting anything unusual that they see or hear when they go to vote. Here are several social media posts from the Dallas Morning New s article at the I Am A Texan blog . The Dallas Morning News similarly reports : Early voters in Texas have claimed that voting machines in Dallas, Collin, Tarrant and other counties changed their presidential votes from Donald Trump to Hillary Clinton. The allegations follow a similar pattern: Voters say they voted straight-ticket Republican, but when they reviewed their ballots, they reflected they had voted for Hillary Clinton for president, not Donald Trump. Their votes for Republicans in down-ballot races were not affected, according to the complaints. But elections officials say the allegations are more than likely false or instances of user error. Garland City Council member Stephen Stanley said he went to an early voting station at Nicholson Memorial South Branch Library on Tuesday morning while campaigning for candidates on the ballot. He said around noon a woman came out of the library and told him she had tried to vote straight ticket Republican but the machine said she had voted straight Democrat. The woman told him a poll worker apologized that the machine wasn’t working and instructed her to use another one. Stanley said he was worried about people who didn’t double-check their ballots. “My question is how many other people didn’t know,” Stanley said. Dallas County elections administrator Toni Pippins-Poole encouraged all voters to double-check their ballots before submitting them. She said she’s received second-hand reports of malfunctioning machines, but no one has logged an official complaint and she doesn’t have any names to go with the claims. H/t Matrix Bob'"}, "time": 1742562133.7051826}