{"duration": 0.16246438026428223, "input_args": {"text": "'VILNIUS, Lithuania  —   Facing trial in Russia over the theft of a   drawing valued by its creator at $1. 55, Nikita Kulachenkov, a Russian forensic accountant involved in anticorruption work, fled to Lithuania to avoid what he decided was a doomed battle against   charges. What he did not realize was that Russia’s reach these days extends far beyond its borders. Arriving in Cyprus from Lithuania in January to join his mother for a holiday, Mr. Kulachenkov was stopped at airport passport control, questioned for hours by immigration officials and then taken in handcuffs to a police detention center. “They told me there was a problem with Russia and kept asking me what crime I had committed,” Mr. Kulachenkov recalled. Cypriot immigration and police officers seemed as mystified as he was, he said, by a note in their computer systems that described him as a wanted criminal requiring immediate arrest. The wanted notice had been put there in August last year by Russia, where the theft of millions and even billions of dollars by the politically connected goes mostly unpunished but where the alleged theft of a street sweeper’s    drawing has been the focus of a lengthy investigation involving some of the country’s most senior law enforcement officials. The arrest demand, known as a “diffusion,” had gone out to Cyprus and 50 other countries through the international police organization, Interpol. It had not been endorsed by Interpol, which is “strictly forbidden” by its Constitution from any action of a “political character,” but nonetheless labeled the    anticorruption activist as a criminal in databases around the world. Determined to punish domestic opponents who flee abroad, as well as   whose lives and finances it wants to disrupt, Moscow has developed an elaborate and   strategy in recent years of using  —   critics say abusing  —   foreign courts and law enforcement systems to go after its enemies. Some countries, including Russia, “work really hard to get Interpol alerts” against political enemies, said Jago Russell, the chief executive of Fair Trials International, a human rights group in London, because “this helps give credibility to their own prosecution and undermines the reputation of the accused. ” “It is also potentially a good threat to use against people still in the country: ‘You may be able to leave, but don’t assume you will be safe,’” he added. The efforts have often fallen flat in the end, but have succeeded in tying up their targets in legal knots for months and years. Acting on a Russian request, a British court, for example, froze the worldwide assets of Sergei Pugachev, a former close friend of President Vladimir V. Putin’s who fell out with the Kremlin in a squabble over property and fled to Britain, then France. Russia has also used British courts and Interpol to pursue what many Western governments view as a vendetta against William F. Browder, an   British citizen. Mr. Browder was convicted in absentia in Russia of tax fraud after he fled to London and mounted an international campaign against Russia over the killing of his jailed Moscow lawyer, Sergei Magnitsky. Mr. Browder defeated a libel case in 2013 brought in London by a Moscow police officer whom the financier had accused of involvement in a fraud uncovered by Mr. Magnitsky. But he faces a new fight as Russia seeks to get British courts to find and freeze his assets and enforce a civil judgment against him in Russia. The only winners in most such cases are expensive lawyers, for whom pursuing Russia’s foes in foreign courts has become a highly lucrative business. Russia pushed three times between 2012 and 2015 to get Interpol to issue arrest orders against Mr. Browder. Having failed each time to convince the police organization that it did not have political motives, it announced this summer that it would try yet again. “The Russians try stuff a hundred times, and sometimes it works,” Mr. Browder said. “They can fail 99 times, but the 100th time it could work. For them, that makes it all worthwhile. ” He described the practice as “lawfare. ” Based in Lyon, France, and comprising 190 countries, Interpol defines its role as enabling “police around the world to work together to make the world a safer place. ” It has often done this, allowing police forces to share information about the whereabouts of mafia bosses, murderers and other criminals, and to secure their arrest. But the Interpol membership of nations  —   like Russia, Iran and Zimbabwe  —   that routinely use their justice systems to persecute political foes has stirred worries that wanted notices can be easily misused. In September, the congressional Tom Lantos Human Rights Commission heard a litany of complaints about abuse from experts and victims of Interpol notices during a discussion of how to reform the police organization’s system of   red notices. Interpol issues such notices, which amount to an international arrest warrant, at the request of a member country seeking help in catching a fugitive who has fled abroad. Interpol’s computer system also circulates diffusions like the one against Mr. Kulachenkov. These are less formal than red notices, but are also used to request the arrest or location of an individual, or information, in relation to a police investigation. Interpol does not release figures for how many red notices or other arrest alerts are issued through its computer system by each member country, but the number of people identified in Interpol’s databases as wanted criminal suspects has risen sharply in recent years. In 2004, Interpol issued just 1, 924 red notices at the request of member countries. Last year, it issued 11, 492, as well as 22, 753 diffusions. As a result of one of those, Mr. Kulachenkov spent nearly three weeks in a Cypriot jail while the authorities in Cyprus reviewed a request from Moscow that he be sent to Russia to stand trial in a case that even Russia’s prosecutor general had initially ruled was not worth pursuing. The drawing he is accused of stealing was done by Sergei Sotov, a street sweeper and artist who had left it and other examples of his work hanging on railings around Vladimir, a city east of Moscow. The street sweeper made no complaint to the police when the drawing disappeared, and said he was glad that someone liked his work. In the end, Cyprus decided not to extradite Mr. Kulachenkov after Lithuania advised it that he had no criminal record and had been granted political asylum because of his work in Russia with Alexei Navalny. A prominent anticorruption campaigner and Kremlin opponent, Mr. Navalny himself has been ensnared in a tangle of apparently   criminal cases in Moscow, including the supposed art theft. The Russian authorities, said Mr. Kulachenkov, whose name has been purged from Interpol’s databases, “don’t really care about me, but they wanted to send a message that if you get involved with Navalny, we will make problems for you, even if you leave Russia. ” Stung by criticism that its role fighting real crime is being hijacked by repressive regimes, Interpol has moved to strengthen safeguards against abuse, particularly since the naming of a new secretary general, Jürgen Stock, in late 2014. Mr. Russell, of Fair Trials International, acknowledged that the group “is trying to make it more difficult to game the system. ” Interpol said last year that it would not issue arrest notices against people who had been granted political asylum or other forms of refugee status, though this did not help Mr. Kulachenkov when he traveled to Cyprus in January. Asked about that, a spokeswoman for the Interpol General Secretariat in Lyon said that she could not comment on individual cases, but that the policy of not targeting recipients of political asylum for arrest would work only if countries passed on information about who had been granted such a status. In most cases, she added, “this information is not available to the General Secretariat” when red notices or diffusions are issued. Whatever Interpol finally does to stop the gaming of the system, it is too late for Petr Silaev, a    Russian editor. Mr. Silaev took part in demonstrations against the destruction of a forest in Khimki near Moscow in 2010 and fled to Brussels seeking refuge after several protesters were badly beaten and the authorities branded the protests an armed riot. He was later given political asylum in Finland and felt safe, until he took a trip to Spain to visit friends. Two days after his arrival, Spanish antiterrorism police officers stormed a hostel where he was staying and arrested him on the basis of a red notice issued against him by Interpol at Moscow’s request. Held for nearly two weeks in a Spanish prison while a Madrid court approved his extradition to Moscow, he finally managed to phone a lawyer in Finland and contact Fair Trials International, which has campaigned against abuses of Interpol by repressive governments. After appeals from a German member of the European Parliament and a storm of protest in the European news media, the authorities released Mr. Silaev from prison but ordered that he report to the Spanish police once a week. Six months later, in early 2013, a Madrid court canceled Mr. Silaev’s extradition order and allowed him to return to Finland, where he spent another year pleading with Interpol to purge his name from its database. “Interpol is a very   organization,” Mr. Silaev said, describing it as “absolutely nontransparent” and easily manipulated by governments that regard protesters as no different from “rapists and murderers. ” Interpol says it cannot publicly share information that belongs not to itself but to the member countries that provide it. “It is a nightmare that keeps coming back if you don’t know how to fight it,” said   Kross, a member of Parliament in Estonia and former coordinator of the country’s intelligence services who has been targeted for arrest at least twice by Russia through Interpol. Pilloried on Russian state television as a dangerous criminal, Mr. Kross has battled for years to purge international arrest orders issued against him. He and Estonian government officials say the orders are based entirely on fabricated claims by Russia that he was involved in hijacking a cargo ship off the coast of Sweden in 2009. Mr. Kross, who is the son of a prominent Estonian writer arrested by the Soviet authorities and a frequent critic of Russia’s direction under Mr. Putin, believes the Russian accusations are payback for his work helping Georgia during its 2008 war with Russia. “All Western institutions, particularly those in law enforcement, are based on good faith in government,” Mr. Kross said. “It is not foreseen that governments themselves are criminal. They can cook up anything they want and put it in the system, and the whole system starts to work against its purpose. ” Invented criminal cases, he said, “work like a computer virus: You put it in the system, and it starts to create havoc. ” Mr. Kulachenkov, the accused Russian art thief, said friends had warned him that Russia might try to get at him through Interpol. After his flight from Moscow to Lithuania in 2014, he wrote a lengthy letter to the police organization, pleading that it not list him as a criminal. “It has become evident that Russian authorities use local investigation bodies and criminal justice systems to pursue their own political objectives,” he wrote. He detailed the Russian case against him for the supposed theft of the crude drawing that even Russian investigators, after inflating the artist’s initial evaluation of less than $2, valued at just $75. He said he wished he had never taken the drawing, which he and a colleague gave to Mr. Navalny as a birthday gift. Taking the art “was a bad idea, but it was not a criminal offense,” Mr. Kulachenkov said. “This whole thing is not about the drawing or me, but about Alexei,” he said of Mr. Navalny. “They are making him toxic. Anybody involved with Alexei gets a criminal case. ”'"}, "time": 1742563590.5854716}