{"duration": 0.031759023666381836, "input_args": {"text": "'As the Prime Minister’s Article 50 letter made its way to Brussels, Brexit campaign leader Nigel Farage paid “a personal tribute and thank you” to former Breitbart boss Stephen K. Bannon for the role he played in securing victory for the Leave campaign in the European Union (EU) referendum. [In an interview with Breitbart London Editor in Chief Raheem Kassam on Breitbart News Daily, to mark the occasion of Britain finally triggering Article 50 of the Lisbon Treaty and officially commencing the Brexit process, the former UKIP chief was bursting with enthusiasm:  “Good morning everybody! It’s a happy day here in London!” he began. “All through the campaign, I went round the country with a placard that said, ‘We want out country back’  —   and I’m just getting a marker pen, and I’m going to cross out the ‘want’ and put ‘got’. “It’s a big, big day, and I think at 12:30, when that letter is delivered in Brussels we will have passed the point of no return. We are going to become an independent,   normal democratic nation again. ” Kassam asked the veteran campaigner if he had ever worried that “legacy Remainers” such as former prime minister Tony Blair and millionaire financier Gina Miller, might succeed in preventing this day from coming to pass. “Well, it shouldn’t have taken nine months,” Farage replied. “Talk about a long gestation!” He did not believe, however, that there was any realistic way out for the political class after more than 17 million British voters backed Brexit, and suggested the delay may have been due to the fact that “the establishment did not want us to vote to leave [and] did not expect us to vote to leave” and made no contingency plans for it. Asked if he thought diehard Remainers might now turn their efforts towards making a success of Brexit, Farage was sceptical. “I don’t think they’ll ever give up they’ve been so used to having their own way,” he said. “But they will begin to look more and more ridiculous. ” Farage confessed that family, friends, and colleagues “all thought I’d been smoking something funny” when he first set out in politics, and that actually achieving Brexit “looked completely and utterly impossible in every way”. “But it’s been a   journey. At first, dozens of people were there helping and supporting me. Then it was hundreds, then it was thousands, then it was millions  —   and today, the impossible dream came true. ” Farage attributed Brexit to failures within the EU itself, including the euro “which nearly all the Remoaners would have signed the country up to 15 years ago”. He took the opportunity to pay tribute to Breitbart News Network in general and former Executive Chairman Stephen K. Bannon, now a leading figure within President Donald J. Trump’s administration, in particular, for giving eurosceptic voices shut out by the establishment media a platform where they could speak to the public: “One of the very important things that happened is, because we had the entire media against us, and not even willing to give us a fair hearing, I think when Bannon opened up the Breitbart office in London and began to give the arguments that I was making a fair hearing, and very quickly, as Breitbart does well, started to reach a very, very big audience. I think actually on this great Brexit day I have to say a personal thank you and tribute to Steve Bannon for having the foresightedness of doing that with Breitbart, and I’m extremely grateful. ” '"}, "time": 1742628481.9094439}