{"duration": 0.11596822738647461, "input_args": {"text": "'BREAKING : Desperate Iraqi Christians PRAY for a TRUMP VICTORY BREAKING : Desperate Iraqi Christians PRAY for a TRUMP VICTORY Breaking News By Amy Moreno November 7, 2016 Donald Trump is the ONLY one who can rid the world of ISIS. \\nAfter all, Hillary, Qatar, and the Saudis created them, so trust me, with her, ISIS isn’t going anywhere. \\nThe world knows this – Americans need to understand it as well – Hillary is a foreign policy wrecking ball of failure. \\nShe’s made a massive mess of everything in the Middle East – Lybia being the biggest DISASTER yet. \\nThanks in large part to Hillary Clinton’s disastrous decisions, we live in a SCARY world. \\nShe’s destabilized an entire continent (Africa) and caused a massive migration of these refugees, which are destroying Europe. \\n…..and now, she wants to go to war with Russia. \\nShe’s a warmongering NIGHTMARE. \\nThe Christians people in Iraq who have felt the WRATH of ISIS “get it.” \\nThey’re praying for a Trump victory. \\nJoin them in prayer and VOTE. \\nIf we vote, we win. First mass in over two years in the city of Qaraqosh, Iraq. pic.twitter.com/QrAyqmfifv \\n— Ali Ajeena (@AliAjeena) November 3, 2016 \\nFrom Express.co \\nIRAQI Christians will pray for Donald Trump’s election victory after they condemned US Government for “abandoning” them to the barbaric terror of Islamic State. \\nThe Christian community in the latest Iraqi town to be freed from ISIS have opened up about how they were terrorised at the hands of the twisted jihadi militants. \\nThe once-bustling Qaraqosh, which boasted of more than 50,000 Christian residents, was recaptured from the jihadis last week. \\nResidents who stayed in the town have described how ISIS told every Christian to pay a massive tax, convert to Islam or face execution… \\n…Those who survived the terror have now voiced their outrage that President Obama refused to protect them when Iraq’s largest Christian city fell to ISIS more than two years ago. \\nA man in the village said he hopes Donald Trump – a widely favoured candidate in the town – will bring a different approach to Iraqi Christians. \\nHe told the camera: “Obama has never helped the Christians. In fact, he despises them. In the last 26 months, he has shown he despises all of them. \\n“But we have hope in the new president, Trump. This is a movement – we are the political OUTSIDERS fighting against the FAILED GLOBAL ESTABLISHMENT! Join the resistance and help us fight to put America First ! Amy Moreno is a Published Author , Pug Lover & Game of Thrones Nerd. You can follow her on Twitter here and Facebook here . Support the Trump Movement and help us fight Liberal Media Bias. Please LIKE and SHARE this story on Facebook or Twitter. '"}, "time": 1742562572.7251482}