{"duration": 0.05343270301818848, "input_args": {"text": "\"Denver sued by homeless over 'sweeps' as vagrant camps return Published time: 27 Oct, 2016 01:02 Get short URL © Tami Chappell / Reuters Denver seems to be losing its battle with homelessness, as sporadic camps reportedly resurfaced after a major clean-up in March. On top of that, the city is battling through a lawsuit from homeless people claiming they were subjected to unlawful “sweeps.” \\n“Since the beginning of the summer it seems like there are more people on the streets and sidewalks,” a local woman, Stephanie Mills, told KCNC. “It just seems to be getting worse and worse as the weeks go by.” Read more Church faces daily $100 fine for housing homeless on its lot, battles with neighbors \\nIt has been half-a-year since Denver started its crackdown on numerous homeless campsites. Citing health concerns, city officials started clearing out camps that blocked public sidewalks. However, the order did not last long. \\nAccording to KCNC, the city receives complaints about homeless camps daily, but it cannot do anything to fix the problem. \\n“We’ll get calls from people who have one homeless person and they want us to ‘Beam them up, Scotty,’” Bennie Milliner, executive director of Denver’s Road Home, told the news channel. \\nAccording to Milliner, Denver has enough shelters to accommodate its homeless population, but not everyone wants to go there. Instead, many are willing to remain on the street, especially downtown. \\nThose sleeping rough are not willing to give up easily. They have high hopes of winning a class-action lawsuit filed in August, challenging the city’s so-called “homeless sweeps.” This month, the case made it to a federal court. \\n“These ongoing sweeps are conducted without notice or with inadequate notice and in a manner that prevents Plaintiffs and Plaintiff Class from retrieving their property,” the lawsuit reads, stating that the way the sweeps are conducted “shock[s] the consciences.” \\n“It is difficult to imagine what it must feel like to be already homeless and suffering, then be forced to watch as everything you own in the world is thrown into a dump truck while you are afforded no means to contest the seizure and destruction of your property,” a defense team representing the homeless wrote. Lawsuit Challenges Denver’s Sweeps Of The Homeless https://t.co/HrMa6dVlSY pic.twitter.com/A2SdfwddeE — CBSDenver (@CBSDenver) October 26, 2016 \\nThey argue that Denver has no legal basis for treating “this vulnerable class as though their civil rights were non-existent.” \\nThe lawsuit, which speaks on behalf of thousands of homeless people, also names a number of individual officials, including Mayor Michael Hancock and Police Chief Robert White as main violators. Attorney representing homeless class action suit, addresses media b4 1st hearing at 9am & Denver homeless gather 2 voice concern @CBSDenver pic.twitter.com/UZivcRLPLv — Jamie Leary (@JamieALeary) October 12, 2016 \\nIt will be up to the court to decide whether Hancock, White, and other city officials have violated any rights during more than two years of clearings. \\nApproximately 5,500 of Denver’s residents are homeless, according to the Metro Denver Homeless Initiative, the lawsuit states.\""}, "time": 1742563750.6514616}