{"duration": 1.4208505153656006, "input_args": {"text": "'Parkinson’s Disease and the Uric Acid Sweet Spot VN:F [1.9.22_1171] \\nThe link between Parkinson’s and dairy may not just be explained by the pesticides and lactose. Close Transcript Transcript: Parkinson’s Disease and the Uric Acid Sweet Spot \\nBelow is an approximation of this video’s audio content. To see any graphs, charts, graphics, images, and quotes to which Dr. Greger may be referring, watch the above video. \\nParkinson’s disease is the second most common neurodegenerative disorder after Alzheimer’s. Characterized by a slowness of movement, rigidity, tremor, and stooping posture that all gets worse and worse—and, there’s also non-movement symptoms, like cognitive impairment, sleep, smell, and mood disturbances, as the disease spreads to other areas of the brain. \\nThe cause of Parkinson’s is perhaps one of the most important questions posed by the science of aging. For example, why is the consumption of dairy products associated with increased risk for Parkinson’s? Maybe, because they contribute to “our exposure to pesticides and other neurotoxins,” like dieldrin, which continues to be found in the autopsied brains of Parkinson’s victims—even though it was banned decades ago. But, it lingers in the environment, and we continue to be exposed to the pesticide through contaminated dairy, and other animal products. \\nIt’s “unlikely to be due to milk compounds such as calcium,…D,…fat, or…protein,” since there’s no association with Parkinson’s when they’re “derived from other sources.” It could be the milk sugar, though (lactose), accounting for the increased risk of death and bone fractures, as well as Parkinson’s, and earlier onset Huntington’s disease. \\nBut, there’s a third possibility, as well. Milk lowers uric acid levels, and uric acid may be protective against Huntington’s, and also slow the decline of Parkinson’s—and, most importantly, may lower the risk of getting Parkinson’s in the first place, thought to be because uric acid is an important antioxidant in the brain, something we’ve known for over thirty years now. \\nThis can be shown directly in human nerve cells in a petri dish. Add the pesticide rotenone, and oxidative stress shoots up. Add the pro-oxidant homocysteine, and it goes up even more. But, add some uric acid, and it completely suppresses the oxidative stress caused by the pesticide. \\nBut, drinking milk has a uric acid-lowering effect, citing this study, describing it as “[A] cute effect of milk.” But it turned out to be just a cute typo. An “Acute effect of milk on uric acid levels” in the blood. Drink cow’s milk, and uric acid levels drop 10% within hours. Drink soy milk, and they go up 10% within hours. Now, for the painful arthritic disease, gout, which is caused by too much uric acid, the uric acid-lowering effect of dairy is a good thing. \\nBut, uric acid is a double-edged sword. If our uric acid levels are too high, we can get gout. But, if they’re too low, it may increase our risk of neurodegenerative diseases, such as Alzheimer’s, Huntington’s, Parkinson’s, and MS. Here’s the five-year risk of gout in men for various uric acid levels. If our uric acid is over 10, we have a 30% chance of suffering an attack of gout within the next five years, whereas at levels under 7, our risk is less than 1%. \\nSo, it might make sense to have levels as high as possible, without going over 7, to protect the brain, without risking our joints. But, having excessive uric acid in the blood puts more than just our joints in jeopardy. Yes, having too low levels may increase our risk of MS, Parkinson’s, Alzheimer’s, and even cancer—but, having too high levels may increase our risk of gout, kidney, and heart disease. \\nSo, having a uric acid level over 7 isn’t just associated with an increased risk of gout, but an increased risk of dying from all causes. But, having a low uric acid level may also shorten our lifespan by increasing mortality. High uric acid is associated with increased risk of death from heart disease, but low uric acid is associated with increased risk of fatal stroke, for example. So, keeping uric acid at optimum levels—the sweet spot between 5 and 7—may protect the brain in more ways than one. \\nIf you measure the uric acid levels in those with Parkinson’s, they come in down around here, which can explain why dairy consumption may increase risk for Parkinson’s, because milk pushes uric acid levels down. Dairy may also explain the differences in uric acid levels between meat-eaters, vegetarians, and vegans. If you plot men out, vegans are significantly higher than vegetarians—presumably because they don’t drink milk, with those eating meat and milk somewhere in between. Please consider volunteering to help out on the site. \\nLactose and Parkinson’s? See Could Lactose Explain the Milk – Parkinson’s Disease Link? . \\nUric acid as an antioxidant? I’ve touched on that before in Miocene Meteorites and Uric Acid . \\nIf levels are too high, consider cutting down on Flesh and Fructose and eating cherries (see Gout Treatment with a Cherry on Top and Treating Gout with Cherry Juice ). Check out Preventing Gout Attacks with Diet . \\nCan a plant-based diet be used to treat Parkinson’s? See Treating Parkinson’s Disease With Diet . Any plant foods in particular that may help? Try nightshade veggies: Peppers and Parkinson’s: The Benefits of Smoking Without the Risks? \\nIf you haven’t yet, you can subscribe to my videos for free by clicking here . To post comments or questions into our discussion board, first log into Disqus with your NutritionFacts.org account or with one of the accepted social media logins. Click on Login to choose a login method. Click here for help. Comment Etiquette Joe Caner \\nI have an uncle with Parkinson’s and diabetes. It is a terribly debilitating disease. It is very frustrating for him. He is there, but has been slowly loosing his ability to communicate coherently. It is difficult to see this once witty, cosmopolitan and articulate man become a prisoner within his own body. The last time I saw him he offered me ice cream. There were several gallons of the stuff in their freezer, and he scooped out a large bowl with several different varieties for himself. My aunt told me that is all he wants to eat now a days. I declined telling him I no longer eat animal products. I told him that he would do well to adopt the same eating pattern. One of my cousins told me don’t bother because he has one foot in the grave and the other on a banana peel, and that it would be a shame to deprive him of one of his last pleasures. It is very sad. WFPBRunner \\nI’ve been there. I had a patient who weighed 250 and Parkinson’s. I explained to the family that if he lost weight he would get around a lot better. They said the same thing. We feel so bad for him that we give him treats. After busting them many times they finally got the message. He got down to 160 and his medication was decreased. He was able to get around much better-even able to take long walks without assistant. Food and our attachments are a funny thing. Thea \\nJoe Caner: I’m sorry to hear about your uncle. It can be so heart breaking to see loved ones making these types of decisions. My heart goes out to you. Blair Rollin \\nI think , when they get to that point, they’re not really enjoying life anyway. Food consumption is the last bit of control they have in their lives. Eating fat and refined sugar is probably one of the few happinesses that they can even experience. My friend eats, and always has, a diet of mostly processed meats and dairy. “Very few vegetables.” He went on bp meds when he was 40, suffers debilitating gout and is in terrible health. When I suggest to him that his health problems are due to his diet and he should switch to a vegan diet his response is, “You have to die, right?”. I think this is a common attitude. Most of the diet related health problems manifest gradually and are confused with normal aging. They suffer from health hopelessness and can’t even remember what it was like to be healthy. Rachel \\nTo Joe and everyone who responded to Joe: I, too, have watched loved ones succumb to the chronic diseases of our times and die slow painful deaths. It is painful for us, the living, as well. And hopeless feeling. But this is also why those of us on this site need to stay the course and show others that the fates of our loved ones do not have to be our fate too. I hold my good health (63, BMI 21, no meds, no diseases, no doctors necessary) out as an example of what we CAN have as we age if we so choose. I try not to miss an opportunity to tell people, when they ask me about my WFPB diet, about the diabetes, blindness, cancer in my family and how my lack of those diseases in myself is no mistake. Every day I get to be an example to my community of the good health anyone can also have. But this topic intersects with another larger topic and that is ObamaCare. We are all paying gigantic insurance premiums – including myself – to pay for the ill health of those we love and are ill. The meat and dairy industry continues to cost us all. So I try to not miss an opportunity to delicately remind the curious of that fact – especially those who complain about the high cost of insurance. Because it isn’t the high cost of insurance that is the problem. It is the high cost of medical treatment for a very sick society. It took many years to get the word out about the cigarette industry. It will take decades on this topic as well. But each day we can all take great pride in honoring our loved ones by standing – and eating – for good health in their names and memories. That is the only way that I can deal with the pain of missing those I still love so much. Thea \\nRachel: Nice. Thank you for your thoughts. susan \\nBeautifully said Rachel, thank you Toni Aparici Galindo \\nHow do i raise uric acid, i’m vegan and i have it in 3,77 mg/dl. I suppose i need to increase the protein intake by consuming more beans? lemonhead \\nhttp://nutritionfacts.org/video/apple-juice-may-be-worse-than-sugar-water/ Toni Aparici Galindo \\nI eat at least 5 pieces of fruit a day. Very complex science nutrition. I,m 35 may be you get more uric acid as you get old, so my levels are normal. https://www.ncbi.nlm.nih.gov/pubmed/12242321 Don Forrester MD-NF Moderator \\nI wouldn’t go out of my way to increase uric acid levels. Lifestyle practices associated with elevated uric acid levels (e.g. alcohol, increased body fat, meat, fish, shellfish, low fiber, low folate, low physical activity) are on balance more harmful. There is no association of increased uric acid with consumption of animal or plant protein or purine rich vegetables (e.g. asparagus, cauliflower, peas). Keep up with NF.org as the science keeps coming! Have a happy holiday season. HaltheVegan \\nIn the graph shown in the video, it looks like soy milk raises uric acid levels at least for a few hours after drinking it. If one has slightly low uric acid (4.5 mg/dl), would it be advisable to drink some soy milk to raise it to the 5 to 7 mg/dl range suggested in the video? (PS, I’m WFPB and do moderate exercise. ) David J \\nCoffee and supplemental C lower uric acid, so you might want to avoid those. susan \\nVery interesting video. I went searching for info about the connection between heart disease and uric acid levels. http://www.medscape.com/viewarticle/472684_3 According to this link women are at mant times greater risk of death due to ischemic heart disease when uric acid levels rise above 7.0 … 300% greater risk for women (!!!) vs 77% for men. How is it that this is not even mentioned by doctors? even when I suffered gout one summer, the doctor laughed and said I was hardly henry the Vlll type being fit and slim, and said, ‘next time, dont suffer, come in and get meds’ \\nMy question is, is the connection to heart, kidney, and other diseases in fact weak, and if not why are doctors not mentioning this as a matter of course to patients? George \\nIt’s impossible to have percentages over 100% because then everyone would have it! Basic level statistics susan \\nhi George, thanks, I just took it from the medscape page.. so it could be written, 0.77 vs 3.0 ? anyway the fact remains that women are at high risk of cvd with elevated uric acid levels independent of other factors. And, I wonder if family members suffering gout increases risk ? I have to look into this more John \\nGeorge, it’s about risk. If one way you had 10% risk, then you changed something and now your risk is 30%, you had 300% of the risk you had before. John S susan \\nyes, thank you John for your comments. I find this and related topics so interesting. I have been viewing the other videos linked under Doctors notes having to do with uric acid levels, diet as in cause and treatment etc. Dr Forrester posted some causes of elevated uric acid levels above, but in my case (I dont drink etc) they say my one gout attack could be dehydration related since I joined the running club that year. In any event, once was enough! Here today reading about parkinson’s and other devestating diseases, I have to agree with Rachel that in going forward the thing to do is stay informed and be the best example we can be. John \\nThey probably don’t know. The majority of their continuing education is paid for by Big Pharma. WHy would Big Pharma care about that? John S \\nHello, so would ghee (clarified butter) have any effect on uric acid? George \\nM. D.: The only dairy product I consume is 1 tsp of ghee a day, which is the only thing that keeps me from having to deal with dry eyes, so i’m interested in your question. Please read under the possible mechanisms in the following article; https://www.dairynutrition.ca/index.php/scientific-evidence/roles-on-certain-health-conditions/milk-products-and-gout Ghee is all lipids and based on the information given they don’t seem to have anything to do with the effect of dairy on serum uric acid levels. But this site promotes dairy products, so without reading the papers, we shouldn’t come to conclusions. susan \\nThis link may offer some ideas MD, if you scroll down and look undet Appendix 1 , dietary advice for gout patients. They advise fresh fruits and vegetables, daals, and similar dishes are good. Fat laden ‘party foods’ are to be avoided. http://doctor.ndtv.com/topicdetails/ndtv/tid/60/Gout_and_high_blood_uric_acid_levels_(hyperuricaemia) .html Skeptic Steve Billig \\nMany (most?) metabolic activities in the body fall into the “Goldilocks” category of those with a sweet spot (range actually) above which and below which are unhealthful [body temperature, respiration, blood pressure, blood pH, many minerals (iron), many vitamins (A), dietary protein, calories and on and on]. Happily, a well designed vegan diet often is helpful in keeping the body in the healthy range. I hope there is a follow-up to this video that describes the food and food group strategies that help keep uric acid levels in the healthy range, and vegetarian dietary patterns that push the body out of the healthy uric acid range. broccolu \\nSometimes it is hard to differentiate when it is sciences and when it is the anti meat anti dairy stance from the good doctor. \\nFirst of all, pesticides are everywhere, in plant foods and animal foods. If you eat GMO plant foods and don’t wash them thoroughly then you will eat a load of pesticides. \\nSecondly, about the uric acid, I look at all the research articles and they said that low uric acid is associated with Parkinson’s disease. Nowhere does it say about dairy products. So a lot of people have low uric acid for a number of reasons. For instance eating cherry will lower your uric acid too. Should we stop eating cherry because of this? Does Dr Greger talk about not eating cherry to avoid Parkinson’s? \\nAt the Parkinson’s web site, they talk about taking inosine supplement to raise the uric acid level which can be low in some people due to a number of reasons (not because of milk or cherry, LOL).'"}, "time": 1742563983.8806822}