{"duration": 0.04633331298828125, "input_args": {"text": "'  \\nThe Wells Fargo bank account scandal took center stage in the news last week and in all likelihood will continue to make headlines for many weeks to come. What Wells Fargo employees did in opening bank accounts without customers’ authorization was obviously wrong, but in true Washington fashion the scandal is being used to deflect attention away from larger, more enduring, and more important scandals. \\nWhat Wells Fargo employees who opened these accounts engaged in was nothing more than fraud and theft, and they should be punished accordingly. But how much larger is the fraud perpetrated by the Federal Reserve System and why does the Fed continue to go unpunished? For over 100 years the Federal Reserve System has been devaluing the dollar, siphoning money from the wallets of savers into the pockets of debtors. Where is the outrage? Where are the hearings? Why isn’t Congress up in arms about the Fed’s malfeasance? It reminds me of the story of the pirate confronting Alexander the Great. When accused by Alexander of piracy, he replies “Because I do it with a small boat, I am called a pirate and a thief. You, with a great navy, molest the world and are called an emperor.” \\nOver two thousand years later, not much has changed. Wells Fargo will face more scrutiny and perhaps more punishment. There will undoubtedly be more calls for stricter regulation, notwithstanding the fact that regulators failed to detect this fraud, just as they have failed to detect every fraud and financial crisis in history. And who will suffer? Why, the average account-holder of course. \\nAny penalties assessed against Wells Fargo will be made up by increasing fees on account-holders. Clawbacks of bonuses, if they occur, will likely face resistance from the beneficiaries of those bonuses, leading to protracted and costly lawsuits. Even if the Wells Fargo CEO and top executives of Wells Fargo step down, the culture at Wells Fargo is unlikely to change anytime soon. As one of the largest banks in the world, Wells Fargo knows that it is not only too big to fail, but also too big to prosecute. At the end of the day, no matter how much public posturing there is, Wells Fargo and the regulators will remain best buddies. And those regulators who failed to catch this fraud will be rewarded with more power and larger budgets, courtesy of the US taxpayer. \\nThrough all of this, the Federal Reserve will continue its policy of low interest rates and easy money. Retirees who hoped to be able to live off the interest on their investments will find themselves squeezed by continued low interest rates. Those living on fixed incomes will see their monthly checks buying less and less as the prices of food staples continue to rise. The fat cats on Wall Street will continue to have access to cheap and easy money while those on Main Street will face a constantly declining quality of life. \\nIt is well past time for the Federal Reserve to face the same music as Wells Fargo and the bad actors on Wall Street. It is, after all, the Federal Reserve’s creation of money out of thin air that enables all of this fraudulent behavior in the first place, so why should the Fed remain untouchable? Let’s hope that someday Congress wakes up, hauls the Federal Reserve in for questioning, and puts as much pressure on the Fed as it does on private sector fraudsters.'"}, "time": 1742563283.2877057}