{"duration": 0.11950135231018066, "input_args": {"text": "'Scandalous Poll: 84% of Ukrainians want Putin as their president November 13, 2016 - Fort Russ - Zavtra - translated by J. Arnoldski - The Ukrainian publication Nedelya.UA conducted a poll among its readers asking the following question: “Which politician would you entrust with the governance of your country?” The survey was participated in by 41,600 readers and showed the following figures: 84% (34,900) of Ukrainian respondents want to see Vladimir Putin as president of Ukraine. In second place with 5% (2,000) was Belarusian President Alexander Lukashenko. Third place with 2% (820) was claimed by Xi Jinping and fourth, also with 2% (708) was leader of the Liberal Democratic Party of Russia, Vladimir Zhirinovsky. The current president of Ukraine, Petro Poroshenko, took 5th place with only 1% (538 votes). Further down the list were German Chancellor Angela Merkel (1%, 430 votes), the chairman of the French National Front Marine Le Pen (1%, 426 votes), Kazakh President Nursultan Nazarbayev (1%, 318), and US President Barack Obama (1%, 244 votes). Notably enough, former Georgian president and until recently head of the Odessa region, Mikhail Saakashvili, was not included on the list. According to doctor of economic sciences and director of the Institute for Problems of Globalization, Mikhail Delyakin, the results are not representative. The expert remarked: “Without a doubt, the figures are unrepresentative: not only Ukrainians could take part in the voting, and the audience of the site speaks Russian - there is no Ukrainian version. At the same time, it is hardly likely, for example, that the Russian readers of this Ukrainian site are supporters of Putin. They are most likely fans of Bandera.” “On the other hand, the main part of Ukraine (including Banderites) speaks Russian, not Ukrainian. This was exposed by Guinness, which conducted an innocent poll on the quality of vegetables and allowed respondents to choose between surveys in Ukrainian or Russian. 77% chose Russian. Since then, this share has declined, but it is still clearly more than half even taking into account the departure of Crimea, the DPR and LPR, and the fact that most educated and cultured, i.e., Russian-speaking Ukrainians have fled to every corner, and mainly Russia, from this ‘victorious democracy’ and the European Nazi course,” Delyagin pointed out. “Nevertheless, it might be that overall these figures reflect the real mood of those Ukrainians who have been brutalized by the complete nobody thieves and killers imposed upon them by the West as their leaders. For the same motives, the most respected political leader in Russia is Stalin. Respect for Putin even sometimes appears among Russophobes who think: ‘With such a leader, we would have long ago defeated those Moskals,” Delyagin continued. The economist concluded with the following commentary: “Of course, this does not mean that the destructive liberal socio-economic policies pursued in Russia by appointees like Medvedev and Navulinnaya are correct. However, against the general backdrop of the nobody leaders of the modern West and its satellites, Putin is really a symbol of reason and hope for a better future for all of humanity, not the rapidly dwindling ‘Golden Billion.’” Follow us on Facebook! '"}, "time": 1742564323.7251382}