{"duration": 0.09343361854553223, "input_args": {"text": "'For the fourth time in less than two weeks, the police department in Oakland, Calif. is answering to a different leader. The changes have come as the city deals with two investigations involving its officers: a widening sex scandal and a series of racist text messages sent within the department. “As the mayor of Oakland, I am here to run a police department, not a frat house,” Mayor Libby Schaaf said at a news conference on Friday. The sex scandal unfurled after the suicide of one of the department’s officers last fall. An    woman has since alleged in several media reports that she had sex with that officer and several others from Oakland and other police departments in the area, including some while she was a minor. “We continue to be disgusted and outraged by the idea that anyone could abuse an underage victim of sexual exploitation,” Ms. Schaaf said in a statement on June 11. The police department’s former chief, Sean Whent, resigned on June 9. Mr. Whent’s resignation was “a personal choice, which we respect,” said Ms. Schaaf, who then named Ben Fairow the interim chief. Mr. Fairow had previously worked in the department and was serving as deputy chief for the Bay Area Rapid Transit. He lasted five days in the job. “I have just received information that has caused me to lose confidence in Ben Fairow’s ability to lead the Oakland Police Department at this particular moment in time,” the mayor said in a statement on Wednesday, announcing Mr. Fairow’s departure. She did not elaborate on specific reasons for her decision. The department’s assistant chief, Paul Figueroa, was then named acting police chief. That lasted two days: Mr. Figueroa said in a statement on Friday that he was taking leave and would return to the department as a captain. “I feel that this is an appropriate time to place civilian oversight over this police department and to send a very clear message about how serious we are about not tolerating misconduct, unethical behavior, and to root out what is clearly a toxic macho culture,” Ms. Schaaf said, in announcing that the city administrator, Sabrina Landreth, will oversee the department while a national search is conducted for a new chief. The handling of the sex scandal is being reviewed by Oakland’s district attorney and an independent investigator. The Associated Press reported that of the 14 Oakland police officers involved in the sex scandal, two have resigned and three others are on paid leave. Ms. Schaaf said the investigation into racist text messages is not related to the sex scandal or the resignation of Mr. Figueroa. “We do think it’s relevant to share that the text messages were sent by   officers,” the mayor said. “But they are wholly inappropriate and not acceptable from anyone who wears the badge of the Oakland Police Department. ” Neither the mayor’s office nor investigators have released the text messages to the public. The mayor would not say how many officers were involved with the text messages, but said the investigation “suggests that it is not as widespread as the sex scandal. ” “I want to assure the citizens of Oakland that we are hellbent on rooting out this disgusting culture,” Ms. Schaaf said.'"}, "time": 1742562442.5977464}