{"duration": 0.032102346420288086, "input_args": {"text": "'Breitbart’s    Alex Marlow interviewed House Ways and Means Committee Chairman Kevin Brady on reforming the tax code, the proposed border adjustment tax, and abolishing the death tax. [Brady highlighted congressional Republicans’ proposal to tax foreign imports and end taxes on   products.  “We’re going to end the tax on ‘Made in America,’” Brady said at the Conservative Political Action Conference in National Harbor, Maryland.  The “Made in America” tax gained its nickname from supporters of   products because   products in the U. S. are taxed at a lower rate than products made in the U. S. Brady and House Republicans have proposed a border adjustment tax that would impose a 20 percent tax on imports and is estimated to raise over a trillion dollars in a decade. President Trump has said that the border tax could boost U. S. jobs, but Marlow wondered whether the tax will have any consequences for small businesses that rely on imports, such as job losses. Marlow said that 97 percent of importers are small business and asked Brady whether the tax would make it harder for small businesses to conduct business. Brady said that foreign products receive a lot of special tax breaks, and “competition is best for consumers when everyone is taxed the same. ” Brady also advocated for a “fairer, simpler tax code” and said Americans will soon be able to file taxes with less paperwork. “The tax code will be so fair and so simple, nine out of 10 Americans will be able to file on a   system,” Brady said. Marlow brought up the topic of media bias  —   which, as the    of Breitbart News, was his “favorite topic. ” He asked Brady what he thought of the current “media environment” surrounding the issue of taxation. “It’s a challenge, ” Brady said. Marlow also highlighted how taxation can be viewed as a moral issue, citing “the confiscation of wealth from the American people,” and asked Brady whether the issue of taxation should be considered through a “moral lens. ” Brady replied that it should be, citing the “work, innovation, and value” American workers bring to the economy. Marlow closed the interview by asking Brady what would happen to the death tax in the future. “For the first time since the death tax was created in 1916, House Republicans propose to permanently kill the death tax,” Brady said.'"}, "time": 1742564485.8424275}