{"duration": 0.09332990646362305, "input_args": {"text": "'LONDON  —   Britain’s political crisis was set aside, at least temporarily, on Friday as leaders made their way to France to attend commemorations for the 100th anniversary of the Battle of the Somme. Still, contenders to replace Prime Minister David Cameron are beginning to firm up the groundwork for their campaigns, with Michael Gove making a speech a day after throwing his hat in the ring. Here’s your daily “Brexit” briefing. • Michael Gove, whose surprise entrance into the race for Conservative Party leader (and prime minister) helped knock Boris Johnson out of the contest, said on Friday that while he lacked charisma, he could deliver change. Challengers to Mr. Gove, including former Defense Secretary Liam Fox, have also been making their cases. Ken Clarke, a former chancellor of the Exchequer, said Mr. Gove should stand aside. Read our rundown of the contenders to be Britain’s next leader. • Mr. Cameron and the Labour Party’s embattled leader, Jeremy Corbyn, attended commemorations for the Battle of the Somme. Members of the royal family will be there as well. Smaller ceremonies are taking place across the country. • George Osborne, the chancellor of the Exchequer, met with business leaders in Manchester. And John McDonnell, the Labour Party’s shadow chancellor, spoke to a business audience in London. • Mr. Gove’s candidacy turned the race on its head. Several British newspapers have    accounts of how that happened. The BBC’s political editor runs through conspiracy theories about Thursday’s events. The Daily Mail has thrown its weight behind the oddsmakers’ favorite, Home Secretary Theresa May. • Mr. Johnson, once the favorite, said on Thursday he would not run a Conservative stalwart says he has “ripped the party apart. ” My colleague Sarah Lyall writes that Mr. Johnson was done in by his own hubris and lack of preparation. A piece in our   section likens the former London mayor to someone who would “order a lavish meal and the best wine on the menu and then walk out. ” • Whither London? It’s been only a week since the referendum, and already European cities are  jockeying to lure away businesses. My colleague James B. Stewart ranks the alternatives. • Tony Blair, the former Labour prime minister, argues that Britain is “in peril” and pleads for the Conservatives to conduct their leadership election with “genuine patriotic regard. ” • Slovakia takes over the rotating   presidency of the Council of the European Union today. Why is that interesting? It will hand off to Malta, which in July 2017 was supposed to hand off to . .. Britain. People on the Continent aren’t happy, and there are reports that Britain wants to hand off the presidency anyway. • Mr. Osborne abandoned a pledge to return to a budget surplus by 2020. He and his party have long argued that austerity was necessary in order to restore health to Britain’s public finances. • The pound fell sharply against the dollar when Mark J. Carney, the governor of Britain’s central bank, said on Thursday that the bank may need to cut interest rates, but the currency recovered somewhat. British and Continental European stocks were headed for a fourth straight day of gains. Jeff Sommer writes that past crises give clues that markets will recover their losses after the announcement of the referendum result. • Standard  Poor’s lowered its rating on   European Union debt, citing the uncertainty after the British referendum results. There will be more Brexit news to come. Keep checking back for updates.'"}, "time": 1742562255.6364436}