{"duration": 0.2353377342224121, "input_args": {"text": "'1549 Views November 01, 2016 8 Comments Guest Posts The Saker \\nby Ghassan Kadi \\nMy American friend Roger is a staunch Democrat supporter. He is in his seventies and has always voted Democrat. \\nHim and I have had countless discussions over the many years that we have known each other. His paternal roots are Arabic and he sees himself to be on the “left” side of politics, anti-Israel lobby, anti-Empire, but of late, him and I have not been able to see eye-to-eye on the Trump-Clinton race to the Whitehouse issue. \\nHe is with the view that Obama has inherited a financial and military disaster and did the best he could, and that he should not be blamed for his failure to “perform” as many did after his elaborate and successful “yes we can” slogan. He supported Obama-care and other domestic reform policies, and this is perhaps where Roger and I stop to agree and start to disagree. \\nMany, including Roger, look at the appalling record of the Republican American Party and try to paint a tainted image of it. The party that is affectionately called the Grand Old Party or the GOP by its own staunch supporters certainly has enough such records to put it up there with charges of global mayhem and genocide. The GOP has given birth to monsters; people like Nixon, the Bushes, and of course, who can forget Dr. Kissinger? McCain is another character that comes to mind; one that no thinking man could trust with a dog, a Federal Senator who commands self-given authority that no one seems to be able to either understand the mandate of, or challenge. \\nAt the end of the infamous line Republican line, well at least thus far, enter Donald Trump. And what a character he is? Need one say more? \\nGod forbid if this article may be read like a defense of the GOP. The GOP is run by the rich and the privileged, and as described by George W. Bush himself, by “the haves and have more”. It is the party of Dick Cheney who saw in Iraq an opportunity to generate contracts for Haliburton. If tens of thousands, hundreds of thousands of Iraqis had to die for him to achieve his objective, he would not and did not blink. \\nThis is the party that condones and feeds Christian Zionists. It is the party that has huge control over the media. It is the party that runs the world like it is a business enterprise. \\nSadly, and whether the rest of the world likes it or not, until the current global status quo changes, no political party in the world affects the rest of the world like the ruling party in the United States. Whilst elections in other countries are by-and-large domestic affairs that affect domestic politics of the country concerned, American elections have implications that are not only domestically bound, but have a much further global reach that encompasses every corner of the world. \\nAs a non-American, personally, I am much more concerned about the wider global implications of American politics than the domestic ones. This is not to say that I am indifferent about America and the American people. As a matter of fact, not only do I have close friends who live in America, but also close family members there, and I have grave concerns for all mankind in every corner of the globe, by my interest in American politics remains focused on foreign policy matters; and to this effect, I am only able to relate to the choice between the major two American parties from the perspective of their foreign policies. \\nAs America insists to be the world police and the unrivalled superpower, a stature many Americans are refusing to accept that they have already lost, it must accept what comes with it and concede that the rest of the world is hoping that the American people will choose the better candidate as the new president; or should I say the one who is less harmful to the world. \\nIn between Donald and Hillary, who fits the less-harmful bill? This is the question. \\nEnough has been recently said about Hillary’s health to write a horror novel. Her “mini-strokes” and “alleged” recent case of pneumonia have made headlines as big, if not bigger than her infamous hidden emails, allegations of involvement in the murder of an American Ambassador and even selling arms to ISIS. Very recently however, the issue of the emails is resurfacing again, and very late in the campaign, perhaps late enough to serve Hillary with a knock out. \\nHowever, her zeal to reach the Whitehouse seems to have been in her mind even before Bill’s (her husband) Monica scandal back in 1998. Hillary was prepared to publicly support Bill, appear to “forgive” him and move on, because she had a bigger fish to fry; the Whitehouse. She somehow managed to hush down all other sex offence allegations against Bill, all the while, and hypocritically, trying to score mileage from similar allegations against Trump. \\nHer unabated lust for power will not stop at anything for as long as she ends up at the helm, the first female American President, even if she has to be Commander In Chief from behind the control button of a wheelchair. \\nThere are even observations and allegations that many people who have campaigned against her have died under suspicious circumstances. Whether this mystery is going to be taken up by main stream media just on the eve of the elections to serve her with yet another under-the-belt knock out remains to be seen. \\nHer uncontrollable laughs and hysterical facial expressions leave many questions unanswered. \\nIn between the two front runners Donald and Hillary, it is hard to say that she presents herself as the sane and rational choice. \\nIs there a party-based distinction on foreign affairs matters? Perhaps now, but not historically. \\nFor some reason, the American Republican Party is seen as the party of the hawks and the Democrats are seen as the doves. But are they? \\nTo answer this question in an unbiased manner, we ought to look back at history. Notwithstanding the colourful history of the GOP, the Bushes; father and son, Cheney, the NeoCons and Co., what is really the history of the American Democratic Party? \\nA few landmark historical decisions make it very clear. So let us start with current events before we dwell into recent history that some might have chosen to forget. \\nThe “War On Syria” was the brainless child of the so-called “Arab Spring”, a spring that was heralded by the visit of an American President to Cairo and a speech he made to Sunni Muslim clergy at Al-Azhar University. The President’s name is Barak Obama, and he is a Democrat. Obama’s speech was a subtle endorsement for the Arab street, and to be specific to the Sunni Muslim Arab street to rise. \\nThe Maidan phenomenon and all the events that followed in Ukraine, the anti-Russian sanctions, escalations and intimidations and the creation of a very volatile situation in Europe; a situation that remains hot and of unpredictable consequences, have all been orchestrated by the same President; Obama….a Democrat. \\nLast but not least, the current tension in the South China Sea is also the outcome of the same President, the incumbent Democrat; Barak Obama. \\nNow, let us not forget that President Obama is a Nobel Prize laureate; ironically for peace. \\nThe American involvement in the Vietnam War started under the tenure of the sweetheart Hollywood-star like American President; JFK. It reached its climax during the LBJ administration. Both Kennedy and Johnson were Democrats. \\nBut all of the above monstrosity is dwarfed by dropping the A-Bombs on Hiroshima and Nagasaki. Many strategists have argued over the last seven decades as to whether or not President Truman had no other choice to end the war quickly, but those arguments do not change the fact that two; not one, atom bombs were dropped on cities. It is pertinent to note here that the Manhattan Project generated two types of bombs, “Little Boy” (used in Hiroshima) and “Fat Man” (used in Nagasaki). It doesn’t take a genius to at least suspect that the American administration wanted to test the two types and that therefore, in their eyes, destroying Hiroshima alone was not enough. \\nThat said, and even though no A-Bombs were dropped in Western Europe and specifically on Germany, the brutality that civilians in German towns and cities have suffered were simply acts of vengeance and many of them had no military gains to achieve. \\nHarry Truman was not a Republican. He was yet another Democrat. \\nBut haven’t we forgotten the other Democrat sweetheart of the Whitehouse? The almost saint-in-waiting? The smiling Colgate-ad President Jimmy Carter. \\nMany see that Carter had an impeccable record of being a humanitarian of the highest degree. As a matter of fact, credit must be given to him for his post-presidency peace campaigns, and specifically for standing up for the Palestinian people and for not being silenced by the Israel lobby. \\nHowever, in reality, it was during the Carter administration that Al-Qaeda was created under the blessing and auspices of the USA. It was a criminal with a twisted mind aka Zbigniew Brzezinski, Carter’s National Security Advisor, who actually established the first Jihadist army. In his narrow-minded and short-sighted vision, he thought that the best way to fight the Soviets in Afghanistan was to support and train Islamist fighters to rise against the “infidel” Communists. And even though the plot eventually generated ISIS, a monster that turned not only against the hand the fed it but also against the whole world, to this date, Brzezinski maintains that he came up with a genius master plan. Once again, Carter and Brzezinski were both Democrats. \\nAnd now, it is Clinton who is beating up the drums of war against Russia and China. \\nAmericans may have their legitimate preferences that would make them go either for Trump or for Clinton. Supporters of each team can and do provide huge lists that make their candidate of choice the better one. Arguably, one of them could well be better for America; the truth is that as a citizen of the world, and as mentioned before, I am more interested in a President who is better for the rest of the world. \\nWhether Trump will trump up the military after an election win is anyone’s guess. But Clinton is beating the drums of war already. To this effect, and as we stand today, on the international arena, she is the hawk; not Trump. \\nAmericans who are disenchanted by wars must realize that this time around, the choice to vote Democrat is an endorsement of her war aspirations. \\nAmericans with two minds as to which way to go on the 8 th of this month ought to remember that whatever their personal, local and/or domestic issues are, the USA will not win a nuclear war against either Russia or China; let alone both combined. \\nThose swinging voters who easily vote for either major party depending on an array of factors, should hopefully discern that this time that a vote for Clinton is a vote for war. \\nIf some have never voted for the GOP in the past, and more so are physically unable to vote for Trump, and/or if others are disenchanted by both major parties or actually never voted before, and if they regard both candidates as equally farcical, one would wonder as to what are waiting for to vote outside the two major parties? What caliber of Democrat and Republican candidates are such reluctant American voters waiting for to vote for a third option? \\nSome argue that a vote for the Greens is a wasted vote because the Greens will never make it into the Whitehouse, at least not in the foreseeable future, but in reality, any vote that does not endorse Hillary Clinton is not a wasted vote. The Essential Saker: from the trenches of the emerging multipolar world $27.95 '"}, "time": 1742563501.2503302}