{"duration": 0.03677964210510254, "input_args": {"text": "'Leave a reply \\nGreg Hunter – Internet data mining expert Clif High predicted that “Trump would win” the election and that Hillary Clinton would go “missing” after the election. Sure enough, Hillary was missing the night of her defeat. What does that mean? \\nHigh thinks, “That there was a breakdown among a very delicate relationship among a lot of powerful parties that failed to deliver as promised. The plan didn’t work. So, now there is no real plan “B.” There never could be under the circumstances. \\nWe are in a situation where there can’t be a plan “B” for the Federal Reserve, for example. They (FED) have to go on a certain path, they’re doomed. That is true of the criminal organization we call CGI (Clinton Global Initiative). Any criminal gang, no matter where it is in the social order, progresses along a certain path, runs into opposition and dies. It always happens, and it always will.” \\nSo, does Clif High think Hillary Clinton is in jeopardy? High answers, “I certainly do.” High’s data mining also shows that “Clinton minions are worried . . . all I get in the data is all these people have fear and worry.” \\nOn the financial front, High contends we will have inflation and deflation at the same time. And High says interest rates are headed up and will continue to rise. High explains, “My definition is deflation, but maybe we should define it as debt destruction and inflation. \\nThe powers that be and the Federal Reserve in the data sets that I have are showing that they are really worried and start to get worried by the 12 th of December, and it breaks out into the public in early January. They are worried about the destruction of all of this debt by dollars pouring back into the U.S. \\nThe debt is actually being paid off by all this money coming back into the U.S. It’s not an actual increase of actual cash. It is a destruction of all the derivatives . . . It is debt destruction for sure. . . . Also, a component of the hyperinflation is they can’t destroy all the repatriated dollars (flowing back in) fast enough. So, some of those do show up in the supply chain of the digital cost we have to deal with. . . .So, as this deflation starts, the hyperinflation is already going to be ongoing.” In short, High says your home will go down in value while you are paying much more for supplies to live in it. \\nOn gold and silver, High says never mind the recent price drop. High says, “They’re real money, always have been, and you are going to need it. . . . How can it be silly to hold real money? Americans are going to have to face up to the fact that we have been deluded by a propaganda press that was attempting to sow a particular viewpoint around the world. We tried to conquer the world with dollars and the threat of bullets . . . . Our dollars were accepted all around the world, and people gave us real stuff for those green pieces of paper. They’re not going to do that anymore. So, if you want that coconut from Malaysia . . . you are going to have to pay something that has value. Those little green pieces of paper will not after a short period of time. They are going to have value inside the country for a while, but outside the country, people are going to say I want gold or silver or oil. I want to see something of value.” \\nHigh can’t name a price for gold and silver, but his “predictive linguistics” says, “At some point in 2017, probably past mid-year, we’re going to be looking at hyperinflation so bad that the DOW will be measured around $100,000 to $125,000. Meaning, the dollar will be so worthless that it will take $125,000 to buy the little basket that is the DOW. I also have language that says an ounce of gold will be approaching the DOW in terms of value. This is not ludicrous. In the last depression in 1933 and 1934, after the shutting of the banks . . . we had a point where gold and the DOW were the same, and gold dominated the DOW for decades.” \\nJoin Greg Hunter as he goes One-on-One with Internet predictive linguistics expert Clif High of HalfPastHuman.com. SF Source USA Watchdog  '"}, "time": 1742628489.184135}