{"duration": 0.07746338844299316, "input_args": {"text": "'November 18, 2016 -  By Eduard Popov for Fort Russ - translated by J. Arnoldski -  \\n\\n\\nOn November 17th, the Third Committee of the UN General Assembly voted on a resolution to combat the glorification of Nazism proposed by Russia in collaboration with 54 states. The delegations of 131 out of 193 states voted to support the resolution, which also concerned combatting contemporary forms of racism. 48 delegations abstained, including some EU countries. Only three countries voted against the document: Palau, the US, and Ukraine. Thus, the situation from 2015 was repeated, the only difference being that back then Canada voted not to condemn Nazism. \\nAt first glance, what is surprising is the absence of the Baltic states, specifically Latvia and Estonia, on this extra short list of those opposed. It is in Latvia and Estonia that the glorification of the “exploits” of local Waffen SS divisions has taken a most radical and consistent form. However, this can be explained by the fact that the Baltic states are EU members and are therefore compelled to restrain some of their desires.  \\nEverything is more or less clear with the United States’ vote. After the Second World War, numerous Nazi collaborators were settled in America, especially Ukrainians from both factions of the Organization of Ukrainian Nationalists. Apparently, the influence of the Ukrainian (Galician) diaspora has a, if not decisive, then at least important impact on US policy. \\nUkraine is even less restrained than the Baltic states of the EU. The idolization of Nazi collaborators has begun to be widespread at least since the victory of the Maidan (if we don’t count Viktor Yushchenko’s presidency), so Ukrainians are striving to catch up and surpass Latvia and Estonia in the open glorification of Nazism.   \\nIn the future, additional legislative measures against the glorification of the Waffen SS and Hitlerite collaborationists will need to be adopted. It is entirely unclear why Russia has become the victim of attacks by the neo-Nazi Baltic regimes for “Soviet occupation” but is in no hurry to make counter-claims against those countries which now openly hold marches for veterans and adherents of the Waffen SS, a criminal organization which was convicted at the Nuremberg Tribunal.  \\nMeasures of an economic nature should be taken. On November 18th, a report surfaced that Rosselkhoznadzor (the Russian state organization overseeing agricultural imports) gave permission for canned fish to be delivered from Latvia and Estonia. This has caused great bewilderment and indignation. First of all, these states, as EU members, have imposed sanctions against Russia. Secondly, their Waffen SS marches make any trade concessions from Russia morally unacceptable. After all, no other country suffered more from the crimes of Nazism than Russia.  \\nThe Baltic Waffen SS divisions fought (or, more precisely, carried out punitive operations) largely on the territory of Russia’s northern regions. After the war, the Soviet communist regime treated these ex-executioners fairly gently and, in doing so, likely committed a big mistake. the Baltic Nazis did not appreciate humanity, and the same thing can be said of the Banderites in Ukraine. \\nRussia should follow the example of Poland and adopt legislation on a state level which names the criminal deeds of the organizations in the former USSR countries (above all, Ukraine and the Baltics) which collaborated with the Hitlerite occupation regime. This means the national formations of the Waffen SS and collaborationist groupings such as OUN-UPA, etc.).  \\n\\nRussia has the right to impose economic, legal, and social measures against these countries and urge the international community to join the fight against the glorification of Nazism at the state level.  \\n\\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742562279.527574}