{"duration": 0.062285423278808594, "input_args": {"text": "'License DMCA \\nWall Street really wants Congress to override both presidential candidates and We the People, and push that Trans-Pacific Partnership (TPP) through after the election, but before the new President and Congress take office. \\nAs Politico\\'s Morning Trade reported Thursday, \"Eight major financial services industry associations made an appeal to congressional leaders to support passage of the TPP this year.\" \\nWell, that\\'s that, then; instructions have come down from management. Get TPP done -- and lock in corporate rule -- before democracy and representative government and We the People can stop it. \\nMeanwhile ... those countries we are \"partnering\" with? How are people and workers treated? How do countries like Vietnam handle basic human rights, labor rights, environmental protections, things like that? What are we getting ourselves into? - Advertisement - \\nNguy...n Ngoc Nhdegrees Quynh is coordinator for the Vietnamese Bloggers Network and receiver of the 2015 Civil Rights Defender of the Year award , \\n\"Civil Rights Defenders is delighted to announce that the recipient of the 2015 Civil Rights Defender of the Year Award is Nguy...n Ngá»\\x8dc Nhdegrees Quynh. She is Coordinator for the Vietnamese Bloggers Network and well known for her use of social media to speak out against injustices and human rights abuses in Vietnam.\" \\nIn 2014, Quynh the Stockholm-based NGO Civil Rights Defenders honored her as a Human Rights Defender. \\nQuynh blogs under the pseudonym of Me Nam (Mother Mushroom). She writes about corruption in the government and warns readers about problems with things like the way the government protects them from things like toxic chemical spills. \\nBecause of this, Vietnam has arrested Quynh on charges of \"spreading propaganda against the state.\" - Advertisement - \\nNY Times, October 11, \" Vietnam Arrests Mother Mushroom, a Top Blogger, for Criticizing Government \": \\n\"The authorities in Vietnam said on Tuesday that they had arrested a popular blogger who has criticized the country\\'s one-party government over politically delicate topics, including a dump of toxic chemicals that devastated fishing communities and set off protests. \\n\"The blogger, Nguyen Ngoc Nhu Quynh, 37, was detained on Monday in Khanh Hoa, a south-central province. She was accused on Tuesday of distorting the truth and spreading propaganda against the state, according to the Vietnamese news media. The charges carry a maximum prison term of 12 years. No trial date was given.\" \\nQuynh could be imprisoned for up to 12 years for criticizing her government\\'s handling of a toxic chemical spill at a foreign-owned steel mill.'"}, "time": 1742562441.4076355}