{"duration": 0.14302492141723633, "input_args": {"text": "\"« Reply #406 on: October 01, 2016, 10:33:18 AM » WHERE\\x92S THERE A CRASH? WORLD ECONOMY COLLAPSING!!!HEADLINES SEPTEMBER 2016 OECD Trims Global Growth Forecasts Citing Low-growth TrapOECD Warns Of Weak Trade, Financial Distortions As Low-growth Trap DeepensWTO Cuts Global Trade Growth Outlook ASIA India's Industrial Production Falls Unexpectedly In JulyChina Factory Activity Stagnates In AugustChina Private Sector Growth Eases In AugustChina Exports Fall In AugustHong Kong Private Sector Contracts In JulyHong Kong Retail Sales Fall More Than Expected In August Japan Unemployment Rate Rises In August Japan Monetary Base Jumps 24.2% In AugustJapan Service Sector Contracts In AugustJapan's Leading Index Drops In JulyJapan GDP Revised Up To 0.2% On Quarter In Q2Japan Tertiary Activity Index Rises Less Than Expected In JulyJapan Revised July Industrial Production Data Reveals DeclineJapanese Exports Decline for 11th Straight Month in AugustJapan August Trade Deficit Y18.711 BillionJapan Has Y18.711 Billion Trade Deficit In AugustJapan All Industry Activity Growth Eases In JulyJapan Household Spending Falls 4.6% In AugustJapan Retail Sales Slide 1.1% In AugustJapan Aug Housng Starts Climb Less Than ForecastJapan Jul Leading Index Unrevised South Korea Jobless Rate Rises In August South Korea's Exports Dip 6% y/y In SeptemberSouth Korea Money Supply Growth Eases In JulySouth Korea Industrial Production Dips 2.4% In AugustSouth Korea Manufacturing PMI Hits 14-Year LowSouth Korea Consumer Confidence Slows In September Singapore Q2 Jobless Rate Rises Singapore GDP Growth Likely To Stay At 1.8% In 2017Singapore NODX Registers Flat Growth In August Malaysia Jobless Rate Rises In July Malaysia Exports Fall Unexpectedly In JulyMalaysia Industrial Production Growth Eases More Than ForecastMalaysia Manufacturing PMI Continues To ContractAustralia's Service Sector Contracts Sharply In August - AiGAustralia Has A$15.535 Billion Current Account DeficitAustralia Construction Sector Contracts In August - AiGAustralia GDP Expands 0.5% On Quarter In Q2Australia Has A$2.410 Billion Trade DeficitAustralia Keeps Key Interest Rate UnchangedAustralia Home Loans Slide 4.2% In JulyAustralia Leading Index Unchanged In August - WestpacNew Zealand August Credit Card Spending Falls 0.8%New Zealand Credit Card Spending Falls In AugustNew Zealand Q2 Current Account Deficit NZ$1.826 BillionNew Zealand Building Permits Dip 1.0% In AugustNew Zealand Has NZ$1.265 Billion Trade Deficit U.S. U.S. Weekly Jobless Claims Up In AugustU.S. Weekly Jobless Claims Rise In September U.S. Job Growth Falls Short Of Estimates In AugustU.S. Employment Increases By Less Than Expected In AugustU.S. Labor Productivity Falls More Than Initially Estimated In Q2U.S. Manufacturing Activity Unexpectedly Contracts In AugustU.S. Construction Spending Holds Unchanged In JulyChicago Business Barometer Drops Much More Than Expected In AugustU.S. Service Sector Growth Slows To Six-Year Low In AugustU.S. Wholesale Inventories Virtually Unchanged In JulyU.S. Consumer Sentiment Unexpectedly Unchanged In SeptemberU.S. Retail Sales Drop 0.3% In August, More Than ExpectedU.S. Business Inventories Come In Flat In JulyU.S. Industrial Production Falls More Than Expected In AugustNew York Manufacturing Remains WeakAtlanta Fed Downgrades U.S. Third-Quarter GDP View To 2.9%U.S. Housing Starts Slump Much More Than Expected In AugustU.S. Home Refinancing Activity Falls To Lowest Since JuneU.S. Housing Starts Pull Back More Than Expected In August U.S. Leading Economic Index Unexpectedly Edges Lower In AugustU.S. Existing Home Sales Unexpectedly Fall 0.9% In AugustU.S. Pending Home Sales Pull Back Sharply In AugustU.S. Durable Goods Orders Unexpectedly Come In Flat In AugustU.S. Home Price Growth Continues To Slow In JulyU.S. New Home Sales Pull Back Sharply In August BRAZIL Brazil Industrial Production Declines In JulyBrazil Retail Sales Decline In July SOUTH AFRICA South Africa Manufacturing Production Rises Less Than ExpectedSouth Africa's Leading Index Continues To Fall In JulySouth Africa's Trade Balance Swings To Deficit EURO ZONE Eurozone Factory Growth At 3-Month LowEurozone Private Sector Growth At 19-Month LowEurozone Industrial Production Declines In JulyEurozone Trade Surplus Falls Unexpectedly In JulyEurozone Current Account Surplus Shrinks In JulyEurozone Private Sector Growth Weakens On ServicesEurozone Private Sector Growth At 20-Month LowEurozone Q2 GDP Weakened From Q1Eurozone Q2 Growth Confirmed At 0.3% German Unemployment Rises Unexpectedly In September German Industrial Production Falls UnexpectedlyGerman Industrial Output Falls Most In Nearly 2 YearsGerman Exports Fall Unexpectedly In JulyGerman Economic Sentiment Unchanged In SeptemberGermany Private Sector Growth Weakens In SeptemberGerman Construction Orders Decline In JulyGerman Retail Sales Fall More Than Expected In AugustLeading Think Tanks Cuts Germany's Growth Outlook Swiss Jobless Rate Rises In August Swiss Watch Exports Decline In AugustAustria Production Index Drops In JulyBelgium Consumer Confidence Plunges In SeptemberDenmark Retail Sales Fall For Second MonthDenmark Consumer Confidence Weakens In SeptemberDenmark Revises Q2 Growth Lower Norway's Jobless Rate Rises In July Norway Retail Sales Unexpectedly Fall In JulyNorway Trade Surplus Declines In August As Exports Fell And Imports Surged Sweden Jobless Rate Climbs Unexpectedly In August Sweden Manufacturing Growth Eases Sharply In AugustNIER Trims Sweden's 2016 Growth ForecastSweden Current Account Surplus Declines Notably In Q2Sweden's Services Sector Growth Eases Notably In AugustSweden's Finmin Proposes Expenditure Cuts In 2017 BudgetFinland June Trade Surplus Revised DownFinland Economy Stagnates In Q2Finland Trade Deficit Widens In JulyFinland Retail Sales Fall In JulyFinland Q2 General Government Surplus FallsFinland Trade Deficit Widens More Than EstimatedFrench Consumer Spending Falls Unexpectedly In JulyFrance Current Account Deficit Widens In JulyFrench July Trade Deficit Widens More Than ExpectedFrench Industrial Output Falls Unexpectedly In JulyFrance GDP Contracts In Q2France Q2 Maastricht Debt RisesU.K. Construction Sector Contracts In AugustU.K. Manufacturing Output Logs Biggest Fall In A YearU.K. Halifax House Price Inflation Eases More Than ForecastBCC Trims U.K. Growth OutlookU.K. House Price Inflation Eases In JulyU.K. Construction Output Stagnates In JulyU.K. Retail Sales Fall In AugustFinancial Fraud Happened Once In Every 15 Secs In UK In H1: StudyU.K. Budget Deficit Exceeds ForecastU.K. Mortgage Approvals Lowest Since Late 2014U.K. House Price Inflation Slows Less Than ExpectedU.K. Q2 GDP Growth Rev Up To 0.7%Ireland Trade Surplus Shrinks In JulyIrish Retail Sales Fall In August Spain Unemployment Rises In August Spain's Industrial Production Falls Notably In JulySpain July Home Mortgages Fall 14.9%Spain Retail Sales Fall For First Time In 3 MonthsItaly Economy Stagnated In Q2Italy Factory PMI At 20-month LowItaly's Trade Surplus At 1-Year High As Decline In Imports Eceeded Fall In ExportsItaly Consumer Confidence At 14-month LowItaly's Economy Set To Remain Weak In Months Ahead: IstatCroatia Industrial Production Growth Slows SharplyCzech Retail Sales Sales Growth Slows In JulyCzech Industrial Production Plummets In JulyCzech Trade Balance Turns To Deficit In JulySlovakia Exports Decline For First Time In 4 MonthsHungary June Trade Surplus Revised DownHungary Retail Sales Growth Eases Unexpectedly In JulyHungary Industrial Production Falls For Second MonthRomania Retail Sales Growth Slows For Fourth MonthRomania Industrial Production Unchanged In JulyEstonia Q2 GDP Growth EasesEstonia Trade Deficit Widens In JulyLatvia July Industrial Production Growth Eases SharplyLatvia Retail Sales Growth Eases In AugustLithuania Industrial Production Drops In August Turkey Jobless Rate At 4-Month High In June Turkey's Industrial Production Declines Sharply In JulyTurkey Q2 GDP Growth Eases More Than ForecastTurkey's Consumer Confidence Weakens In SeptemberLebanon Private Sector Downturn Continues In August Logged\""}, "time": 1742564016.8867946}