{"duration": 0.12345767021179199, "input_args": {"text": "'With the apparent elimination of rickets at the turn of 20 th century, following the discovery of the role that vitamin D plays in the elimination of this disease, most may think that vitamin D deficiency is a problem of the past. While vitamin D deficiency is not often found in North America, insufficiency is still very common . This should not be surprising, being that there has been an unprecedented increase of indoor computer use as social media and remote-access work continue to rise in popularity. The acclimatization of modern people to a lifestyle that is primarily indoors is a recipe for disaster when considering the importance of vitamin D and bone health. The following will discuss some of the major reasons why you need as much sunlight exposure as you can obtain within reasonable limits and how you can remove the primary obstacles that could be in your way.\\n( Sign up for our FREE newsletter to get the latest prepping advice, gardening secrets, homesteading tips and more delivered straight to your inbox!) Benefits of Vitamin D Vitamin D is critical for establishing the body’s processes which contribute to building and repairing bone. Through the synthesis of vitamin D, the body absorbs and retains calcium and phosphorus, which are required for maintaining bone health. Vitamin D has been shown to reduce cancer mortality and all-cause mortality. A study found that vitamin D2 improves memory in rats, which may have to do with the observed protection of cortical neurons from toxicity and suppressed apoptosis. Other studies suggest that vitamin D may be helpful for those suffering from chronic kidney disease and might even be helpful in the management of multiple sclerosis.\\nSources of Vitamin D Although vitamin D is most often studied in the form of supplements, the primary source of vitamin D for humans is by the absorption of UV radiation through sun exposure. The body generates vitamin D from cholesterol in the blood during a metabolic process initiated by sun exposure. While vitamin D2 and D3 supplements have come to be effectively used by individuals who are experiencing deficiency, the most advantageous way to make sure you are getting enough vitamin D is to set aside a limited amount of time to expose your skin to the Sun periodically each day.\\nInadequate Sun Exposure There are a number of natural and unnatural causes of inadequate sun exposure. A worldwide study conducted in 2010 found that vitamin D deficiency and insufficiency are still very common, citing cultural habits of people around the world to cover much of their skin and a reluctance to spend time outdoors as the primary causes of deficiency in Africa and the Middle-East. North America is mentioned as still suffering from a widespread vitamin D insufficiency, which may be caused by these same cultural habits.\\nThe shade of a person’s skin can also be a significant determining factor of how much sun exposure one might require daily. Pigmentation of skin will determine the amount of light reflected and amount of absorption of light impeded. Darker skin reflects more light and absorbs less. Individuals who have darker shades of skin will require more sun exposure on average than a lighter-skinned individual. Also, remember that sunscreen is meant to block the sun for prolonged periods in direct sunlight, so applying sunscreen for limited daily sun exposure would be counterproductive. Of course, as an added measure, someone who has darker pigmentation may consider taking a supplement, but this is may not be the best long-term strategy.\\nIt must be noted that some are restricted to only relying on supplementation due to the geographic location in which they reside. If someone does not have the resources to do so, relocation is not a primary strategy. In the United Kingdom, for instance, a person may require vitamin D supplements from late September to early March because of the heavy cloud cover and inability to access sunlight.\\nThe Right Amount of Sunlight Ultraviolet A (UVA) and Ultraviolet B (UVB) radiation are the primary cause of skin damage related to sun exposure. UVA rays can cause long-term damage related to skin cancer, while UVB rays are primarily responsible for sunburns. UVB radiation has the strongest presence during the hours leading up to and past noon, however, atmospheric conditions, seasons and latitude are the ultimate determining factors of the magnitude and concentration of the Sun’s rays. It is best to go outside when the UV index rating is between 3 and 5.\\nThe best way to prevent vitamin D deficiency is to schedule time daily to be outside. Expose as much skin to direct sunlight as you feel comfortable doing. Keeping in mind the risks and benefits, you should consider having at least 15 minutes to an hour of combined direct sun exposure each day. For someone of a lighter skin tone, one 15-minute sitting in the sun each day may be enough time and an hour might be damaging, but those of darker skin tones will require more. \\nThis information has been made available by Ready Nutrition \\nOriginally published November 8th, 2016 Vitamin D supplementation – how will it help me… 13% Of U.S. Deaths Attributed to Low Vitamin D Levels Large Study Reveals the Importance of Sunshine on Health 6 Ways to Naturally Protect Your Skin From the Sun Vitamin D deficiency substantially increases risk of… '"}, "time": 1742563208.0812235}