{"duration": 0.033170223236083984, "input_args": {"text": "'LOS ANGELES  —   Show business rule of thumb: Never underestimate a   tot. Going into the weekend, most box office analysts predicted that “Beauty and the Beast” would easily remain the No. 1 movie in North America. One challenger, “The Boss Baby,” had received negative reviews. (The Los Angeles Times deemed it a “rancid diaper. ”) Another new arrival, “Ghost in the Shell,” had been written off as a contender after becoming embroiled in a “whitewashing” casting controversy. But “The Boss Baby”  —   in the tradition of “Look Who’s Talking,” Stewie from “Family Guy” and the   Baby Herman from “Who Framed Roger Rabbit”  —   proved enormously popular, pushing past Belle of “Beauty and the Beast” to take in roughly $49 million. Theaters far from the coasts (Indianapolis, Denver) saw especially strong turnout, according to the film’s distributor, 20th Century Fox. Produced by DreamWorks Animation, “The Boss Baby” cost at least $200 million to make and market. It has taken in an additional $59 million overseas. Alec Baldwin, riding a wave of popularity for his “Saturday Night Live” portrayal of President Trump, gave voice to the baby. “Beauty and the Beast” (Disney) had $47. 5 million in ticket sales, for a   domestic total of $395 million and a global one of $876 million, according to comScore, which compiles box office data. Fizzling in third place was “Ghost in the Shell,” a   version of a  Japanese manga by Shirow Masamune. It collected about $19 million  —   not nearly enough given production and marketing costs of at least $150 million. “Ghost in the Shell” (DreamWorks Pictures and Paramount Pictures) was also weak overseas, where it took in about $40 million. Casting Scarlett Johansson in a role originally played by an Asian actor was one misstep. The marketing may have been another Paramount’s campaign was visually arresting but failed to broaden the film’s appeal beyond older male   fans. And the film was in many ways a mishmash, leading to weak reviews and word of mouth, as evidenced by CinemaScore exit polls.'"}, "time": 1742562187.657008}