{"duration": 0.0788412094116211, "input_args": {"text": "'Since the election, “Never Trump” means never getting a job in   Donald Trump’s administration, and that’s a bad thing, according to a new Washington Post article. [The article channels the   laments of establishment Republicans who signed the two main “Never Trump” letters during the GOP primaries.  Before he won, the conversation was, ‘We really would love for you to change your mind and join us,’\\u2009” Peter Feaver, a National Security Council special adviser under President George W. Bush, said of informal talks with Trump aides. Feaver, who signed both letters, added that, “Since he won .\\u2009.\\u2009. the conversation is, ‘There likely will be a blacklist of people who signed the letters who won’t themselves be eligible for a post. ’” The “Never Trump” Republicans signed public letters saying Trump “would be the most reckless president in American history. ” Now that Trump is about to take office, they’re prepared to nobly serve their country, but only if Trump will come to his senses and hire them. The Washington Post portrays the routine job consideration of applicant’s loyalty as something sinister and frightening as it presents responses from Republicans surprised they are now unwelcome. According to the Post: “It’s hostile,” said this person, who spoke on the condition of anonymity for fear of further retribution. “It’s not just that we’re frozen out  …     I was told they said there was an enemies list. ” Still, the Post’s editors are standing up for the Republicans they like. “The   has virtually no experience in national security and foreign policy, and his transition team could presumably benefit from the broadest pool of applicants for the influential appointive positions in the State Department, Pentagon and Department of Homeland Security,” the Post snipes. “[T]he purportedly blacklisted figures report to their jobs at Washington law firms and think tanks in a state of indefinite limbo as their colleagues, some working in the same offices, are flirting with potential administration jobs. ” Unhappily for those in the D. C. holding pens, the Trump administration has rejected much of Washington’s   culture and is staffing key posts with military and business leaders. “The   favors people who have been successful in the private sector and amassed personal wealth over those who have achieved prominence in academic or policy fields,” the Post writes in another article. “Those close to him  …     see think tanks as part of a Washington culture that has failed to implement good governance, while becoming beholden to donors. ” The same elite that attended the same schools, lives ensconced in the same wealthy zip codes, holds the same narrow views on trade, immigration, and war, are now competing with an alternative elite brought in by Trump. Given their vitriol during the campaign, and the weeping and gnashing of teeth after Trump’s election night win, getting passed over for an administration job should not be a surprise. But the political class thinks it’s indispensable, and there would be no consequences for them. They believed the 2016 election would be a polite argument between the Clinton and Bush dynasties —  and Trump would never win. What the Washington Post calls “establishment  ” find themselves shut out of shaping the future of the country with no one to blame but themselves. Read it all here.'"}, "time": 1742562130.0656626}