{"duration": 0.14984440803527832, "input_args": {"text": "'Recent incidents in France are most telling about an Age of Enlightenment giving way, albeit centuries later, to an “Age of Turbidity. ”[  century Europeans sparked the Age of Enlightenment. Mankind —  motivated to move toward reason as the primary source of authority and legitimacy and away from traditional orthodoxies such as religion and absolute monarchy —  enjoyed tremendous benefits by doing so.  In France, particularly, challenges arose to the dogmas of the Catholic Church. Overcoming those challenges gave rise to many ideals we enjoy today such as liberty, progress, tolerance, constitutional government and separation of church and state. Sadly, these ideals are now being lost in a new age —  one of turbidity in which facts are hidden. As seen by this week’s attack in London, the Muslim perpetrator had been previously investigated over concerns about his “violent extremism” —  more accurately known as “radical Islam. ” Originally credited with seeding acceptance for an enlightening age, France now irresponsibly sows seeds of disenlightenment —  clouding individual cognitive thinking about the very ideals that made Western civilization and influence so great. Take the case of two of France’ s Muslim cultural heroes —  darlings of both the country’s leftist mainstream media and its Hollywood set. As popular news stories about Mehdi Meklat, a writer and documentary film producer, appeared in the French press, the U. S. mainstream media also portrayed him in a very positive light. The Washington Post last year noted Meklat, at 23, was already a celebrity, among “France’s youngest public intellectuals” who sees no point in a university education, whose world begins where Paris ends, whose works reveal an “overarching intent: showing the world the complicated reality of the Paris suburbs where  …    (he was) born and raised. ” The public was led to believe Meklat effectively had integrated into French life, earning Western tolerance himself as one contributing to society. But, last February, his image was severely tarnished as it was exposed to the light of truth. An unidentified Facebook user shared some of his tweets over the past several years, revealing a much different person than the human rights activist portrayed by the media. As for conservative presidential candidate Marine Le Pen, Meklat wrote, “I am going to slit your throat  . ” As for Jews, he called for Hitler’s return “to kill” them. As for former Charlie Hebdo    Charb before he was killed in the January 2015 terrorist attack, he wanted to “rape” him by shoving “Lagulole knives up his  …    ” As for white people, “they must die as soon as possible. ” As for movie legend Brigitte Bardot, he desired to sodomize her with light bulbs. These tweets paint the picture of a dangerous young psychotic who harbors a deep anger and resentment against all   and who would not hesitate to act out this hatred if in a position to do so. Yet he is held up by others to the public as an example of a cultural hero. For over five years, Meklat had been using the social media, often via a pseudonym, to inject hatred, intolerance and violence into discussions about all whom he found undeserving of life —  targeting gays, Jews, women, whites, etc. —  but never ISIS or other Islamic terrorists. After being exposed, Meklat immediately deleted over 50, 000 tweets, perhaps hoping the nightmare exposure of his true   would, with time, be forgotten. Meanwhile, after having made such threatening comments about others over the years, he now laments about living in fear for his life, undoubtedly blind to the hypocrisy of his having created similar fear for others. Meklat is not an isolated case in the French media and film industry where young Muslim artists muddy the waters of Western values with their own contrary ones yet are falsely portrayed as cultural heroes. Similar praise was heaped upon Houda Benyamina —  a   documentary film producer. Her film “Divines,” described as a “hate film against France,” criticized everything in the state including schools, police, fire and rescue, and the demonization of Muslim migrants who were targeted by a “French racist society” in which nobody understood “the beauty of their souls. ” At the French equivalent of the Oscars, Benyamina received Best First Film award and a standing ovation. It is doubtful among those standing were surviving members of a generation of French warriors who 72 years earlier courageously fought to free France of German occupation, well understanding freedom has its flaws. Unsurprisingly, Hollywood’s Golden Globes also nominated Divines for an award. But Benyamina too has been exposed to the light of truth, her tweets suggesting ISIS is a victim of Israeli and U. S. manipulation. Social media exposure also became a nightmare for Benyamina’s younger sister, Oulaya Amamra, who received Best Young Actress award for the same movie and was pictured with Meklat at the event. After her tweets revealed dozens of racist (“dirty  ”) and homophobic comments, she too raced to delete them. It is the likes of Meklat, Benyamina and Amamra and their ilk whom the media and France’s version of Hollywood tout as examples of “integrated” Muslims making contributions to Western society. During the Age of Enlightenment, there was a Latin phrase that came to symbolize this era. The phrase was “Sapere Aude” which, loosely translated, means “Dare to be wise” or “Dare to think for yourself. ” In the 21st century, as members of the media and entertainment industry seek to portray a story or support a cause that allows them to feel good, they often fail to think for themselves, making sure what they promote, in reality, really contributes to making the world a better place in which to live. Their irresponsibility in doing so, creating a culture in which democracy’s values are replaced by hatred, intolerance, and violence, will leave a future generation of historians calling our century the “Age of Turbidity. ” Lt. Colonel James G. Zumwalt, USMC (Ret.) is a retired Marine infantry officer who served in the Vietnam war, the U. S. invasion of Panama and the first Gulf war. He is the author of “Bare Feet, Iron Will —  Stories from the Other Side of Vietnam’s Battlefields,” “Living the Juche Lie: North Korea’s Kim Dynasty” and “Doomsday: Iran —  The Clock is Ticking. ” He frequently writes on foreign policy and defense issues.'"}, "time": 1742563708.0675507}