{"duration": 0.09793925285339355, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. WikiLeaks’ latest release, if confirmed, appears certain to rock the technology world and deliver a serious blow to the C. I. A. The   Vault 7 documents offer details of what are described as highly classified C. I. A. hacking tools used to break into smartphones and computers, turn   TVs into spies and bypass encryption on messaging services like Signal, WhatsApp and Telegram. WikiLeaks said the source of the leak was raising policy questions that “urgently need to be debated in public. ” _____ 2. “Obamacare Lite. ” That was Senator Rand Paul, who like many other conservatives is in revolt over the Republican plan to replace the Affordable Care Act. The legislation would end mandated coverage but maintains many of the basic benefits that critics  —   including the Club for Growth, Heritage Action for America and the brothers Charles G. and David H. Koch’s Americans for Prosperity  —   see as warping the free market. _____ 3. Senate Republicans rejected Democrats’ calls for a special counsel to lead the investigation into Russian interference in the presidential election. The sparring came at a Judiciary Committee hearing on Mr. Trump’s nominee to be deputy attorney general, Rod J. Rosenstein. He would oversee any such inquiry since Attorney General Jeff Sessions recused himself. _____ 4. In the Netherlands, there’s also concern about foreign influence in coming elections  —   by American money. The     leader, Geert Wilders, is getting donations from American conservatives attracted to his   Union and   views. “We would not have thought that people from other countries would have been interested in our politics,” said a member of Parliament. “Maybe we underestimated ourselves. ” _____ 5. China warned of a nuclear arms race in Northeast Asia after the United States began delivering parts of an advanced missile defense system, known as Thaad, to South Korea. The system, meant to counter the growing threat from North Korea, could be operational as early as April. And North Korea blocked all Malaysians from leaving the country, deepening tensions over last month’s assassination of Kim  . _____ 6. Mr. Trump’s revision of the U. S. program for refugees reduces the number the country will accept by more than half. This year’s arrivals already approach the new ceiling of 50, 000. Thousands of Central Americans seeking to escape brutal gang violence may not make the cut, like two girls in El Salvador who saw their grandparents gunned down and who are themselves being hunted. “We got a call last weekend telling us that they’d find us under whatever rock we were hiding,” their aunt said. _____ 7. And some migrants in the U. S. are trying to make their way out. People from Yemen, Turkey and elsewhere have been streaming through a small town in upstate New York en route to Canada, driven by anxieties over the travel ban,   sentiment and frustration over the immigration process. It’s almost impossible to apply for asylum at border posts, so they slip by to get arrested on Canadian soil and try their luck from inside Canada’s legal system. _____ 8. Canada came in second in the annual U. S. News  World Report survey of the best countries in the world. The 2017 rankings prioritized countries that enjoy peace, quiet and prosperity, after surveys indicated widespread anxiety over social and geopolitical change. Switzerland took the No. 1 spot. Third? Britain. _____ 9. Travel advice: Cash redemption is often the worst value for your credit card points. We took a close look at the Chase, American Express and Citi rewards programs, and found better deals if you bank the points and use them to book flights through your card or partner sites. _____ 10. Finally, “huge news for refrigerators everywhere. ” That was a blogger’s take on the pending retirement of the longtime cartoon editor of The New Yorker, Bob Mankoff. We talked with him about some of his favorites from among the hundreds of his own cartoons that have appeared in the magazine. The one above was such a hit that he had the phrase trademarked. “One of the things you have to recognize about humor is that at its heart it’s stupid, and we should enjoy that stupidity,” Mr. Mankoff said. Photographs may appear out of order for some readers. Viewing this version of the briefing should help. Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742561880.1419897}