{"duration": 0.07841682434082031, "input_args": {"text": "'IQUITOS, Peru  —   Venezuela’s Supreme Court on Saturday reversed parts of a decision to strip the national legislature of its powers, an abrupt shift that came amid mounting domestic and international criticism that the country was edging toward dictatorship. “The decisions of the court have not divested the Parliament of its powers,” Maikel Moreno, the court’s chief judge, said in an address on Saturday afternoon. He said the Supreme Court should not be in conflict with other branches of government “because it is only an arbiter. ” The state television network VTV on Saturday published summaries of the court’s most recent rulings in which the judges said they had “suppressed” parts of an earlier decision to nullify the legislature and allow the court to write laws itself. Judge Moreno said the court had also reversed a decision to strip lawmakers of their immunity from prosecution. The court’s initial ruling, published on Wednesday night, prompted widespread outrage because it removed what most consider to be the last remaining check to President Nicolás Maduro’s growing power, the   legislature. The court, packed with judges loyal to Mr. Maduro, is considered to be controlled by the president. Saturday’s decision appeared to have support among top officials in Mr. Maduro’s government. Ernesto Villegas, the information minister, characterized the previous rulings as a mistake when he took to Twitter on Saturday to say that the court was “correcting the rulings. ” But as of late Saturday, the court itself had not published its rulings on its website, leaving it unclear how far the court planned to go in restoring the legislature’s powers, which it has been chipping away at for more than a year. Margarita López Maya, a Venezuelan political scientist, said the court appeared to consider the legislature to be in contempt, meaning that it might not be able to pass laws, even if the court agreed not to take over its legislative powers. The court has also spent the past year overturning major decisions made by the chamber, Ms. López said, including a law granting amnesty to political prisoners and moves to block the president from expanding his power over the economy. That stalemate, she added, seemed unlikely to change. “It’s like a chess game where you just moved one pawn,” she said. Enrique Sánchez Falcón, a Venezuelan constitutional expert, said he also believed that the court would continue to consider the legislature to be in contempt of the law and questioned whether it was even legal for its earlier decision to be revised. But the series of events had done damage to the rule of law in Venezuela, he said. “The constitutional order of Venezuela has been completely fractured,” he said. On Saturday, the Venezuelan opposition showed no signs that it would accept the court’s reversal as evidence that a respect for democratic principles had been restored. Several thousand protesters gathered in the streets in a show of support for the National Assembly. Witnesses said that security forces dispersed by firing tear gas canisters, which injured at least two lawmakers who had joined the protest. The court’s initial decision also revealed dissent within Mr. Maduro’s movement that could reflect limits on his march toward   rule. Chief among them was Luisa Ortega, the attorney general, who on Friday issued a dramatic rebuke to the president, holding a news conference in which she said that the rulings violated the inclusive spirit of Venezuela’s laws. The decision by the court represented “a rupture in the constitutional order,” Ms. Ortega said. Ms. Ortega, a longtime follower of Mr. Maduro’s predecessor, Hugo Chávez, has remained loyal to Mr. Maduro. But she emerged as a leading critic when she spoke out against a massacre of civilians by the military in the Barlovento region, outside Caracas, in October. Américo Martí, a Venezuelan lawyer and leftist leader, said that Ms. Ortega’s dissent represented a “kind of democratic reaction within Chavismo and a reflection of the international and national pressure” the movement was facing. The court’s decision generated condemnation outside Venezuela as well, with critics saying that the country had become a dictatorship in all but name. Luis Almagro, the secretary general of the Organization of American States, a regional body that aims to promote democracy, trade, and economic and social development, called the move a “  coup,” while the United States and other countries condemned the decision as eroding the country’s democracy. “What we have warned of has finally come to pass,” said Mr. Almagro, who has spent much of the past year chastising the government, even accusing Mr. Maduro of aiming to become a “petty dictator. ” Critics say the court’s assault on the legislature is part of a longer slide away from democracy that has come as the government’s popularity has declined amid the worst economic crisis in recent memory. Falling oil prices and years of economic mismanagement have left many Venezuelans facing shortages of food and basic medicines, setting off widespread protests. The government is holding at least 114 political prisoners, according to Penal Forum, a human rights group. Local elections that were to have been held last year have been postponed.'"}, "time": 1742562312.6137075}