{"duration": 1.537757396697998, "input_args": {"text": "'By Gordon Duff, Senior Editor on November 2, 2016 By Gordon Duff, Senior Editor and Ian Greenhalgh, Managing Editor \\nSources within the FBI have informed VT that a cabal tied to right wing extremists, in particular General Paul Vallely’s Stand Up America (advocating the violent overthrow of the American government) and the Federalist Society along with groups like St. Hubertus and Bilderberg, now run the rank and file of the FBI. The FBI is now a key component of the secret societies that John F. Kennedy warned about. When top DC insiders meet with oil and defense contractors, be it a “prayer breakfast” or “hunting society” or to dance around a fire somewhere wearing horned headgear, the FBI is there. \\nCalls for a special prosecutor to investigate possible FBI involvement in attempts to rig this years presidential election have more to them than meet the eye. A culture of corruption has infected the FBI to the point where they have become a danger to national security. Let’s be clear, the majority of FBI agents are not only competent and honest, they are fine people. However, this is a deeply political group, strongly right wing, with a very secretive hierarchy that has not only taken sides in the election, but has been involved in covering up terrorist acts and organized crime for years. \\nRecently, CNN called for a special prosecutor to investigate the FBI. There is a reason for this, which we will get into, not at some small risk. CNN also reported on “fake news” and the threat it entails. What if I told you that the majority of FBI agents, including highest level officials, were not only “birthers,” a belief even Trump now has backed away from, but openly talk about murders they believe Hillary Clinton has committed or continue to insist that President Obama is a Muslim? Worse still, many actually insist that Barack Obama is the anti-Christ. \\nNot only are those who run America’s most powerful law enforcement organization rooted in conspiracy theories and delusions, they are continually hoaxed by fake news stories. \\nWorse still, the FBI has, for years, covered for financial criminals, the payday loan scams, the mortgage “robo-signers” and more. When America’s savings and loans were crashed by fraud during the Reagan administration, costing $1.4 trillion, few went to jail. This may have been the beginning. When, in 2007, America’s investment banking system collapsed, the price of that nearing $10 trillion, all of which involved criminal fraud on an unimaginable scale, all that could be done was a “bail out,” but no prosecutions though nearly half the equity value of the entire nation had been redirected overseas by an international criminal cabal. \\nThis is the same FBI, under the guidance of Attorney General Alberto Gonzales, that got behind torture, kidnapping and illegal surveillance. \\nWhere we are now is this, organized crime at the highest levels is free to operate in the US with impunity while the FBI runs political witch hunts under the direction of right wing extremist groups. \\nWe are told that the FBI helped squash the 9/11 investigations, including releasing certain suspects tied to foreign intelligence services along with a series of investigations tied to voter intimidation, voting machine hacking and the death of Michael Connell , which would have brought down the Bush presidency. \\nRead today’s New York Times about Donald Trump’s income taxes, where the term “improper” is used when describing Trump’s taking huge tax deductions for losses by others. Even the Times is afraid of using the term “criminal.” It isn’t Trump they are afraid of. Gambling boss Sheldon Adelson just gave Trump $25m today, dirty money to bolster a flagging campaign, donated after the FBI attempt to down Clinton with a phony email scandal failed miserably due to VT investigative reporting . \\nVT’s allegations have now all been supported, and sources are coming forward about much more serious problems within the FBI and real threats to national security. \\nThe Federalists \\nThere is both a public and private version of the Federalist Society. They organize high school debates, the recruit “like minded conservatives” to go to law school or in law schools, they push “right minded” lawyers into key positions in politics, in the courts and in the FBI. There’s the rub. There is a dark side to the federalists as well, agenda drive and very “anti-government,” as much as any militia, in fact “out neoconning” the neocons hands down. \\nThe Federalist Society is powerful, embedded everywhere and operating with a grand plan, one that involves something beyond tyranny as we know it, the full unabridged version of the corporate state where superior man is allowed his way and others, well, they learn to lie down and take it. \\nThis is conservatism, or “neo-conservatism” as it exists, not on the news but in real life, elitism at the hands of self proclaimed elites “in their own minds,” empowered mama’s boys, ass kissers and the kids that hung around the teacher’s skirts during recess so they wouldn’t get their tiny little asses handed to them by regular children. \\nThe Plot \\nWhat if congress were controlled by the Federalists? What if the Federalists controlled, until Scalia was killed anyway, the Supreme Court as well? What if the Federalists organized congress to block judicial appointments, in order to run the courts and control key cases around the country for paying clients, some drug cartels, defense companies but more often big polluters, drug companies and banks, the kind of banks that robo-sign mortgages and bilk customers out of their savings. \\nThe Federalists run the FBI, having taken over after pushing aside the Mormon contingent, still alive and well but less powerful, that was put in place by Hoover. \\nHere’s the rub, we have seen congress do little during the Obama presidency but run investigations, some of them like Benghazi, built on “fake news” and internet conspiracies. We also mentioned that the FBI, rather than being a collection of elitist lawyers and big IQ guys, is now Fox News conspiracy junkies who, after 9/11, ate the entire donut cart of fantasy fed to the general public and have, for more than a decade, chased shadows and fought a war on terror against organization that never existed. \\nWhere this applies now is in what we have seen over the past few days. We have established the “crying liberal goodguy” credentials of James Comey, FBI Director. We know he hates torture, fought against, for awhile at least, the surveillance state and certainly convinced President Obama that he was going to be able to clean up the FBI after its long descent into disrepute during the Bush/Gonzales period. \\nFor years, every time Alex Jones or some other podcaster or blogger, a “fake news” generator came up with a tale about Hillary Clinton, Congress put millions on the table and began the witch hunt. The version of Benghazi that congress chases around and the one the intelligence agencies know is real are so unrelated as to share almost no facts at all. Everything about Libya was secret, including the shotgun wedding between Gaddaffi and Bush/Blair, a sick threesome involving not just arms dealing but a covert nuclear weapons program, germ warfare labs and surrogate terrorism to be blamed on others, like Syria. \\nWhere it gets dangerous is here, we have congress controlled by the GOP, a mix of Tea Party true believers, with the wild eyed look worn down a bit and the “I am for sale, name a price” written on their fat pink little pig faces. \\nMix in the usual suspects, the “Washington types,” running when told, where told, fully at the services of the lobby, Israel, big Pharma, the drug cartels who top off their Bain Capital/Cayman Islands bank accounts… \\nAdd to that, the endless obstructionism, the endless investigations and, wait for it, an FBI now controlled by the Federalist Society, the name group that runs the congressional investigations and manages the payoffs as well. \\nThen Obama throws Comey into the mix. Here is what we are told; Comey killed the expected prosecution of Hillary not because the investigation showed she didn’t commit crimes but because the investigation showed very much that she had committed many crimes, but for one minor problem. The investigation itself was corrupt, fabricating evidence, intimidating witnesses and falsifying everything it touched. The Federalists expected Comey to bend over as he had so many times in the past. Instead, he simply threw it all out. \\nThe leaders of the FBI cabal met at a contractors ranch in Montana to discuss how to get not only Hillary but Comey as well. The deal was this, take a batch of emails that were “out there,” and there were hundreds of thousands unaccounted for. Seed classified information into them, for “security’s sake” like had been done before, something Comey caught onto when he killed the FBI’s case against Hillary. \\nThen to do two things, crash the election and get rid of Comey. With Trump coming in, if things work out, Comey will be replaced with a puppet of choice and the Federalist run FBI will be unleashed to blackmail, torture and fabricate evidence until caught and there will be nobody left to speak up. \\nWorking hand in hand with them will be congress and pouring money in, the drug cartels, the Israel/Saudi/Turkish lobby, big oil and maybe even the Russians as well, who knows. The sky is the limit. This is just like the good old days with Nixon. \\nSetting up Comey was easy. Get the emails, put them on Weiner’s computer and fail to legally gain access to them by not applying for a search warrant. Then go to Comey telling him they were just found. With his weak constitution and the abuse he got from Trump’s people, combined with the “line agent insurrection” (yes, this is the term used) for standing up against them once, Comey would fold. \\nComey folded, he took the bait and ran to congress with the weeks old illegally obtained probably seeded and falsified evidence that has burned down his career. \\nWith calls for FBI Director James Comey to step down and accusations of FBI corruption from both the Trump and Clinton campaigns, sources have begun to come forward. What we are hearing, primarily from inside the FBI but from Washington insiders of both parties, will shake the very foundations of the republic. We begin: \\nWhat We Know \\nJames Comey has a history as a reformer and advocate of constitutional rights. In 2004, he was brought into the Bush Department of Justice but soon found much amiss and became a critic of torture, rendition and “cooked” terror cases. President Obama believed he was pulling a fast one by moving Comey, a Republican, into the slot as FBI director. Comey was tasked with reforming the Bureau, which had begun “cowboying” cases and making up the rules, widely abusing even its broadened powers under anti-terror legislation that many legal experts cite as being unconstitutional. To many in the FBI, the Patriot Acts and FISA weren’t tyrannical enough. \\nThe FBI is overrun with factions and some of them are closely tied to extremist groups that advocate the overthrow of the United States government. \\nLet’s be clear, most FBI agents are lawyers, many are experienced law enforcement officers and, typically, the majority are frighteningly honest, a bit dull and very right wing. Most FBI agents are “birthers,” and still believe that President Obama is a Muslim and was born in Kenya, though there is no evidence, whatsoever, to imply that either assertion has merit. \\nStill they believe this. In discussions with FBI agents and ranking FBI officials, invariably they are horribly uninformed on international affairs and seem as though they get their ideas about terror threats from TV shows. Most are not rooted in reality, not by standards of an intelligence agency or military command. The FBI has developed a closed culture, almost cult-like, where influences are often extremist, sometimes religious and were the organs of oversight and control have broken down. \\nThe FBI can’t be trusted. \\nThe public knows that Director Comey wrote a letter to congress where he expressed an obligation to inform congress of evidence he had just received that indicated that not all emails between former Secretary of State Clinton and others, sent through a private server, had been evaluated for potential criminal elements. The letter went no further. \\nComey had been warned not to send the letter, advised may be a better term, by Attorney General Loretta Lynch and other officials, making their case that he is not authorized to released such information and that the timing of this was highly suspect and this act would damage the reputation of the FBI. \\nLynch was unaware that the emails had, in fact, been around for a up to a month. She was alway unaware that they had been illegally downloaded or “synced” into Anthony Weiner’s computer. She was further unaware that existing search warrants made viewing or evaluating these emails, in any way, no matter how they had been accessed, was illegal. \\nThus, when Comey commented in his letter about the basic nature of the emails, information only available through a process that violated law, he moved into the area of gross misconduct, perhaps criminal misconduct and left himself open for accusations of Hatch Act violation. The basis Comey applied for rationalizing his act was predicated on these points: A valid search warrant that covered these emails was in place. It was not. These emails had been, in fact, already in the hard drive and were not placed there, “planted” or “synced” by the FBI. If Comey were told this or failed to ask or make certain, the standard for conspiracy and obstruction charges exist within his office and the case management team at the FBI. Comey based his letter on what he claimed was his belief that these emails had just been discovered. In fact they had been around for as long as five weeks, a fact that raises more questions: Why did Comey wait until just prior to an election? Who did he talk to? What transpired during this period? Why did Comey not as for a search warrant to review the emails, though we know the process, or at least a cursory and quite illegal process had already begun, until after he wrote his letter and was bombarded with criticism? \\nA powerful group of FBI agents, opposed to Hillary Clinton, a group that includes extremists tied to the are the force behind the bizarre letter Director James Comey wrote to Congress last Friday, which have led to calls for his resignation and even arrest. \\n\\nThe FBI claims it knew of the Weiner/Abedin emails as early as September 22, 2016 and had certainly accessed them, without a warrant, by October 3 or 4. \\nDirector Comey’s letter to Congress makes reference to knowledge that could only be obtained by reviewing minimally header material but also limited text in the emails, which he makes note of, though there is no legal basis for him having any information at all, as no warrant was issued until yesterday. \\nYesterday, Comey announced that the emails had been held for some time. If this is true, it was done without his knowledge, a serious breach of national security. If he did know, it is for Comey to show how he dealt with that knowledge for the past 30 days, with whom he conferred and why he waited. This is where Senator Reid finds basis for citing Comey as in criminal violation of the Hatch Act and sees likely intent on Comey’s part to rig an election. \\n\\nThings in Washington are coming apart as a pattern of “cowboying,” up to and including criminal acts, planting evidence, Hatch Act violations, perjury and obstruction may well have infected the FBI. Sources indicate that “line agents” within the FBI who either support the Trump candidacy or strongly oppose Hillary Clinton, are using the Bureau to try to rig this year’s presidential election, an assertion now echoing around Washington. \\nThe Hillary email issues, cited by Senator Harry Reid (D) Utah as a violation of the Hatch Act, Federal employees involved in rigging an election, is only the tip of the iceberg. Yesterday, FBI Director James Comey admitted that he didn’t know agents had withheld emails by Clinton aide, Huma Abedin, that he mistakenly reported to congress as a recent discovery. \\nIn fact, not only had the agents held these emails for weeks, as early as September 22, 2016, they had failed to ask for a warrant to even view them. Moreover, the acquisition of the emails itself was, according to numerous sources, an abuse of a warrant. Worse still, as the emails weren’t actually even on the computer but were loaded to it, and then misrepresented as being “found” on the computer’s hard drive. \\nPractices like this were commonplace during the second Bush administration and it was James Comey that was brought in to institute reforms and end the procedural abuses that had become rampant inside the Bureau. After 9/11 sweeping changes in surveillance legislation and broadly expanded powers instilled in many agents, according to sources in the Department of Justice, a broad disrespect for constitutional guarantees. \\n“They went a bit nuts there, and by the time Ashcroft (Attorney General) tried to rein them in, it was too late. Ashcroft was sick and was eventually pushed out by even stronger advocates of enhanced interrogation and the rule of the day, “rounding up the usual suspects,” guilty or not, in order to make the papers and sell more terror legislation.”'"}, "time": 1742564494.2914717}