{"duration": 0.13916301727294922, "input_args": {"text": "'EAST HAMPTON, N. Y.  —   When the leaves return to the trees outside David Rattray’s office window at The East Hampton Star, it means only one thing: “The beginning of the mayhem. ” And on Thursday morning, with the leaves an adolescent green, Mr. Rattray, The Star’s editor, gathered his staff in the paper’s central newsroom to hash out their coverage plans for this summer’s version of it, which would start in earnest over Memorial Day weekend. The Star newsroom is a tight space, with walls that have cracks from the day a couple of years ago when engineers showed up close to the paper’s deadline to tilt the   house back onto a proper vertical, a vital fix for a building Mr. Rattray’s family built in 1900. (The weekly paper still came out on time the newsroom staff just worked through the righting.) As Mr. Rattray ran through the story lineup for the next issue, the paper’s editor at large, Irene Silverman, who has worked there since 1968, tracked a daddy longlegs’ meandering path across her desk. First, there was the “Memorial Day Mayhem ” when the town government’s crackdown on wild partying in the township would be put to the test for the first time. Then there was a   battle royal playing out before zoning officials: Action on a new tennis court at the old Gardiner Estate was threatening to kill the om at the neighbor’s meditation house. But what really caught Mr. Rattray’s ear was word of $18 French fries at Duryea’s, a beloved old lobster shack in Montauk that had just received a St.   makeover from its new owner, the billionaire investor Marc Rowan. “I think there’s an editorial about $18 fries  —   about why, and for whom,” Mr. Rattray said. Some member of the Rattray clan has been running this meeting for 81 years  —   since the family bought the paper from the Boughtons, who bought it from its founder, George Burling, in 1890 for $100. The paper is still extra wide, like the original, and it has resisted the   appeal of shrinking down. But while in 1890 The Star served as a place to announce a local lad’s marriage “to the best girl in the country,” it now covers fights over housing for immigrants the school curriculum and the tensions among the superwealthy, the somewhat wealthy and the     who work for them. And somewhere along the way it picked up a logo under its masthead: “Shines for All. ” An alternative might be, “It Endures. ” Through the advent of the movie house, the radio, the television, glossy new magazines and now the Internet, The Star has continued to stand. And that’s a   testament to the central role that     newspapers can still play  —   even though, like its   brethren, it faces its worst, and possibly last, threat from the web. The Star, a paid weekly, is luckier than most in its class. Many big real estate brokers still view its great big print spreads as a good way to market their huge Hamptons properties. And Craigslist does not have enough of a presence here to kill off The Star’s classified listings. Advertising has given The Star enough resources to start a new    glossy magazine, East, and enough juice to maintain the paper’s mission, which is to “ask hard questions, not be afraid to make public officials angry,” Mr. Rattray said. But new competitors like Curbed. com, owned by Vox Media, and Patch, not to mention Facebook, have exerted pressure. Circulation is down to a maximum of 12, 000 from 16, 000, though many tens of thousands more read it online. “Our gross is about half of what it was at its peak” in 2006, Mr. Rattray told me as we sat in the garden behind the Star headquarters on Thursday, with the first of the holiday traffic trickling by on Main Street. With a shrinking advertising base, Mr. Rattray, a fit 53, has had to pare his staff and take on some of the more menial duties himself: helping with obituaries, letters to the editor (which are published in full, in keeping with a longstanding Star policy) and even the community and government calendars. He still has to find time to write the editorials, the latest of which favored the town’s moves against the “excesses of the summer bar and party scene”  —   the primary generator of mayhem. The scene has been stoked by what longtime residents see as an invasion of club promoters and developers with sensibilities that can seem more Manhattan than Montauk, a hamlet with a proud   fishing tradition. There were already signs of a public backlash after the town’s strict enforcement of state and local codes pushed one popular  —   and, in some quarters, infamous  —   club, Cyril’s Fish House, to shut down, and another, The Surf Lodge, to at least temporarily halt its concert lineup of big acts. But Mr. Rattray went ahead with his editorial anyway. “Without a   but fair   newspaper, the forces kind of arrayed against this place, the South Fork, would win,” Mr. Rattray said. “Maybe that’s arrogant to think, but it’s how I was raised. ” It’s also how Mr. Rattray is raising his three children  —   the oldest is 15  —   who he hopes will succeed him. But most young people interested in media careers seem drawn not to newspapers but to where the growth and opportunity are: modern   with their use of Instagram and Facebook and their new ways of working more closely with advertisers and making them part of the editorial content. I got to see that firsthand when I visited the young crew running Whalebone Media, who in about a year have built their own    media company. With the stylishly beachy sensibility of its surfer millennial founders, Whalebone publishes a free glossy lifestyle magazine with a circulation of 20, 000, and it tells prospective advertisers that it drew more than two million views through social media in its first several months of operation. Whalebone’s offices are sleek and new, with big windows facing Montauk Harbor. Its publisher, Eddie Berrang, and managing director, Bronson Lamb, began the company in conjunction with their friend Jesse James Joeckel’s   clothing brand, Whalebone. Mr. Joeckel founded the Whalebone Creative label in 2010 after designing   and logos for local surf shops. They went door to door to get enough sponsorship to publish the first issue of Whalebone magazine. Their first major advertiser: Soul Cycle, which had taken over the old   Montauk movie theater where the ticket taker also worked the popcorn machine. When I referred to Whalebone as a publication, Mr. Berrang, 34, corrected me. “The word ‘publication,’ it’s an antiquated term,” he said. “It’s just a dying medium. ” Whalebone has a robust web presence that will soon include a new retail site. The whole experience relies on what the company calls “submersive media”: The Whalebone crew designs sponsors’ ads to run seamlessly, and openly, in the editorial content, such that a gorgeous spread of old Montauk fishing photos in the latest issue of the magazine is prominently “presented by Chris Coleman with Saunders” real estate. Their young readers are unfazed by that sort of integration, they say. That’s good, because as traditional print advertising dwindles, media organizations everywhere have to come up with new ways to pay for their coverage. Yet newspapers like The Star can change only so much. Hard news missions preclude slow dancing with advertisers. With the more traditional model, Mr. Rattray says, “I can only see out about 18 months. ” Regardless of what happens after that, this much is true now: The Star still shines for all after 131 years, it endures. Its new media cousins should be so fortunate.'"}, "time": 1742562587.9012234}