{"duration": 0.1441209316253662, "input_args": {"text": "'What does Bob Dylan think about winning the Nobel Prize? The Swedish Academy, which bestows the award, does not know because it has not spoken to him. And Mr. Dylan, despite performing twice since being named the latest Nobel laureate in literature last week, has yet to make a public statement about the honor. Sara Danius, the permanent secretary of the academy, told Swedish public radio on Monday that the academy has been in contact with an associate of Mr. Dylan, but apparently not with the artist himself. Ms. Danius said she did not know whether he planned to attend the award ceremony in Stockholm on Dec. 10. “Right now we are doing nothing,” Ms. Danius said, according to a translation of her comments reported by the British newspaper The Guardian. “I have called and sent emails to his closest collaborator and received very friendly replies. For now, that is certainly enough. ” It has been four days, as of Monday, since Mr. Dylan, 75, won the Nobel, the first time the award has gone to a musician. The announcement set off a debate in literary circles over whether Mr. Dylan was an appropriate choice. On Thursday night, just hours after the announcement. Mr. Dylan and his band played at a theater in Las Vegas, and he said not a word about winning the world’s highest literary honor. The next day, he was at Desert Trip, the   festival in Indio, Calif. and again made no remarks from the stage, though observers studied his performance for any clue of a reaction, however remote. Mr. Dylan’s set at that show was almost identical to that of the first weekend, with an intriguing addition: “Why Try to Change Me Now? ,” a chestnut written by Cy Coleman and Joseph McCarthy that Mr. Dylan included on his 2015 album “Shadows in the Night. ” (The Rolling Stones, who played next, openly celebrated Mr. Dylan. “We have never shared the stage with a Nobel Prize winner before,” said Mick Jagger. “Bob is like our own Walt Whitman. ”) A spokesman for Mr. Dylan declined to comment on Monday. Mr. Dylan’s reticence is well known. He gives relatively few interviews, and in concert he rarely interacts with his audience. He also maintains a close command over his business affairs, to the extent that even Columbia Records, the label that has been Mr. Dylan’s home for almost his entire   career, seemed to be waiting for a cue from its famous artist, publishing little more than a perfunctory tweet about the Nobel. But it is extremely unusual for a Nobel laureate to respond with radio silence. Even Alice Munro, the Canadian   writer who was not well enough to attend the ceremony when she won three years ago at age 82, sent her daughter to Stockholm to accept the prize on her behalf. In the literary world, early dissent about Mr. Dylan as a choice for the award has turned into a chorus, as some writers, including the poets Amy King and Danniel Schoonebeek, have called on Mr. Dylan to turn the honor down, as   Sartre did in 1964. “Will Bob Dylan even show up to the ceremony? ,” Mr. Schoonebeek, wrote on PEN’s website after the organization asked writers and publishers to respond to the award. “Everyone already knows his records front to back, he’s already a household name all over the world, does this award do anything to effect any change whatsoever?” He added: “If he hasn’t done so already, Bob Dylan should turn down the award. ” The novelist Porochista Khakpour faulted the Swedish Academy for honoring a music icon over international authors who could draw overdue attention to an entire region. “The Nobel, which is a very international prize, is such a great opportunity to introduce us to someone who we’ve never heard of,” Ms. Khakpour said in an interview. Mr. Dylan, who may be a contrarian or may just be unpredictable, has turned up for   honors. He was present at the Golden Globes in 2001 to accept the award for best original song, for “Things Have Changed” (from “Wonder Boys”) giving a speech of about 15 seconds in which he thanked his band, his record company, his family “and that’s about it. ” When he was honored by MusiCares, a charity connected to the Grammy Awards, in 2015, Mr. Dylan stunned a roomful of jaded record executives and journalists with 35 minutes of prepared comments. He went into revealing detail about his songwriting methods and how songs can resonate  —   a glimpse, perhaps, at how he might handle a Nobel speech, should he choose to make one. “These songs of mine,” he said, “they’re like mystery plays, the kind Shakespeare saw when he was growing up. I think you could trace what I do back that far. They were on the fringes then, and I think they’re on the fringes now. ”'"}, "time": 1742562862.8164985}