{"duration": 0.04624485969543457, "input_args": {"text": "'The bill for Britain’s Brexit divorce settlement is growing ever longer, with leaders in Brussels now saying that Britain should continue to pick up a portion of the tab for migrants living in Turkey beyond accession. [Initial demands that Britain should pay into the European Union’s   Multiannual Financial Framework (MFF) until it expires at the end of 2020  —   a year after Brexit  —   have since expanded to include references to “issues resulting from” the budget, as well as those related to the European Investment Bank (EIB) and European Development Fund (EDF).  German representatives are now suggesting that “issues” may include the Facility for Refugees, paid to Turkey, which currently stands at some €3 billion, of which €1. 5 billion has already been allocated and €777 million spent. The member states are insisting that a financial settlement is reached before addressing questions of trade. A senior EU official has admitted that it is impossible to calculate the full cost of “political commitments” but warned that the other member states were determined to present a united front on the question of finance. “What really surprised me was the unanimous view on the question of the financial settlement,” he said of a preparatory meeting to draw up negotiating guidelines. “I have never seen net payers and net contributors working so closely together to make sure the financial settlement and a substantive decision on this should be part of this ‘sufficient progress’ [before the issue of trade talks can be raised]. ” Prime Minister Theresa May has said that Britain will not pay to exit the EU, but will stand by her financial commitments. However, she has denied the commitments add up to €60 billion, as EU figures are suggesting. “Even using their broadest parameters, we run the numbers and cannot get to €60bn,” a British source told The Telegraph. “A lot of the things being said by the European side now are simply unrealistic. Everyone is posturing and positioning. The negotiations will bring it all back to reality. ” German Chancellor Angela Merkel warned Britain not to harbour “illusions” that the Brexit negotiations can be run parallel to trade talks, reiterating the EU intended to stand its ground on negotiating a financial settlement before contemplating trade talks. Conversely, British negotiators in Whitehall have shown willingness to pay into the MFF beyond Brexit in the hope of buying good will on trade talks.'"}, "time": 1742562101.3656096}