{"duration": 0.07977652549743652, "input_args": {"text": "'Aspartame Corporation Searle Created First Birth Control Pill: American Eugenics and Big Pharma, a History   \\n( Era of Wisdom ) Did you know that Aspartame producing corporation Searle also manufactured the first birth control pill ? \\nAfter Donald Rumsfeld was Secretary of Defense under Gerald Ford , he was the CEO of Searle , engineering their merger with Monsanto. A testament to his influence, he became Secretary of Defense again during the Bush Administration, participating in atrocious torture and war crimes such as the ones at Abu Ghraib. \\nOne of the most veracious proponents for forced sterilization of blacks , the poor, and “imbeciles,” Planned Parenthood founder Margaret Sanger , was a main contributor to what would culminate into Searle’s manufacture of “Enovid”: the first hormonal birth control pill. This philosophy is commonly known as “ eugenics ,” sometimes referred to as “dysgenics” or “epi-eugenics.” \\nWell summarized by the Embryo Project : “ Enovid was the first hormonal birth control pill. G.D. Searle and Company began marketing Enovid as a contraceptive in 1960. The technology was created by the joint efforts of many individuals and organizations, including Margaret Sanger, Katharine McCormick , Gregory Pincus, John Rock, Syntex , S.A. Laboratories, and G.D. Searle and Company Laboratories. Although there were many pieces and contributors to the final product, it was first conceived of and created by Gregory Pincus and Margaret Sanger through the Worcester Foundation in Worcester, Massachusetts, and was distributed by Searle, located in Chicago.” \\nTo illustrate historical ties between “big pharma” and eugenics, let’s take a look at the legacy of Dr. John Hurty, an early chemist at Prozac producer Eli Lilly and Company in the 1870’s. \\nHurty would go on to influence the passage of the United States’ first mandatory sterilization law, in 1907 Indiana . \\nHe was a tireless eugenicist , who believed that the poor, colored people , the disabled, ect. were a burden to the state and society, unfit for reproduction, and should be sterilized. \\nUpwards of 60,000 Americans were involuntarily sterilized through to even the 1970’s , while Dr. John Hurty, Margaret Sanger, David Starr Jordan and others made major contributions. Reading from an article by renowned author Edwin Black : “Ultimately, eugenics practitioners coercively sterilized some 60,000 Americans, barred the marriage of thousands, forcibly segregated thousands in “colonies,” and persecuted untold numbers in ways we are just learning.” \\nDr. John Hurty, first president of Stanford David Starr Jordan, and Margaret Sanger were members of the scientific, academic class which birthed eugenics, and eventually the world we live in today where Searle had a hand in both birth control, and suspicious toxins such as Aspartame. \\nReading from this document, which is based on the 1946 book “ The Hoosier Health Officer: A Biography of Dr. John N. Hurty “ : “In 1873, John Newell Hurty went to work for Col. Eli Lilly in his newly established Eli Lilly and Company Pharmaceuticals in Indianapolis as his chief chemist. Then in 1879, Hurty opened his own drug store at the corner of Ohio and Pennsylvania streets. In the basement of that establishment, he set up one of the first analytical laboratories in the state. Among the variety of things he tested for purity was water for the Indianapolis Water Company. In 1884, Dr. Hurty established, and for a time taught at, the School of Pharmacy at Purdue University. In 1891, Hurty earned his medical degree from the Medical College of Indiana. In 1899, Dr. Hurty wrote a bill that became the first comprehensive food and drug legislation to be enacted in the United States. It was not only used as a model by other states, but the Federal Law of 1906 is taken almost word for word from Dr. Hurty’s bill.” \\nThis article/video seeks to pose the question: was birth control created as part of eugenics, population control, as part of something that goes beyond money or some alleged philanthropic agenda? Are certain chemicals or pharmaceuticals in circulation designed to fulfill an agenda that goes beyond money, an agenda perhaps that extends into eugenics? \\nWe are not suggesting people do one thing or another with their bodies, we are not asking you to make a decision about your health, but we are presenting you with historical info to better make decisions for yourself. \\nWe’re making the case that Searle profited from the eugenic ambitions of people such as Margaret Sanger: while it is unclear at this moment whether Searle cared about simply money or something deeper. This should raise suspicion about why they pushed so hard for the legalization of Aspartame after the FDA had already banned it , under the direction of powerful Donald Rumsfeld. \\nGiven all of this history, we would be wise to ask: could Aspartame possibly have roots in eugenics? Could certain pharmaceutical drugs have ties to eugenics? It is not a wild accusation or unreasonable question to ponder. \\nTo take it even further: FDA commissioner Margaret Hamburg is the daughter of not one, but two directors of the American Eugenics Society, which later was quietly renamed the “ The Society for Biodemography and Social Biology .”'"}, "time": 1742562410.9817662}