{"duration": 0.053713321685791016, "input_args": {"text": "'LONDON  —   George Michael, the English   who became a pop legend in the 1980s and ’90s and who was found dead on Christmas Day, died of a heart condition, according to a coroner’s statement released on Tuesday. Darren Salter, the senior coroner for Oxfordshire County, said Mr. Michael, 53, died at his home in    of natural causes: dilated cardiomyopathy with myocarditis and fatty liver. Dilated cardiomyopathy develops when the heart’s ventricles enlarge and weaken, a process that usually starts in the left ventricle. The weakening of the heart’s chambers causes the heart muscle to work harder, and over time that reduces its ability to pump blood. Myocarditis is inflammation of the heart muscle. Fat buildup in the liver can be caused by drinking alcohol, but there is also a common nonalcoholic variant that is related to being overweight or obese. Mr. Michael had a history of hard living: In 2007 he was sentenced to community service and barred from driving for two years after he was found asleep behind the wheel of a car while under the influence of drugs. The following year, he was arrested on suspicion of possessing crack cocaine. Mr. Salter’s statement did not specify the cause of the fat building in the liver. Because the death was natural, “the investigation is being discontinued and there is no need for an inquest or any further enquiries,” Mr. Salter said in a statement. “No further updates will be provided and the family requests the media and public respect their privacy. ” Mr. Michael, who was born in London to a British mother and a Greek Cypriot father, started the group Wham! with a high school friend, Andrew Ridgeley. The pair became household names with the 1984 single “Wake Me Up Before You  . ” They split up in 1986, and Mr. Michael began a solo career with his album “Faith,” released in 1987. His final studio album featuring new songs was “Patience” in 2004. On Monday, Mr. Michael was celebrated at Paris Fashion Week when the designer Stella McCartney closed her show with a procession of models dancing to his song “Faith” and chanting the words “love” and “faith. ” Mr. Michael had famously cast five supermodels who had appeared together on the cover of British Vogue  —   Naomi Campbell, Linda Evangelista, Christy Turlington, Cindy Crawford and Tatjana Patitz  —   in the David   video for his 1990 song “Freedom! ’90. ”'"}, "time": 1742563103.7992837}