{"duration": 0.1425342559814453, "input_args": {"text": "\"Politics US, Russia to Meet to Discuss Intermediate Nuclear Forces Treaty \\nThe US has accused Russia of breaking the INF Treaty and summoned a special meeting, but as of yet Washington has provided no evidence of Russian violations Originally appeared at Strategic Culture Foundation \\nThe United States has called for a special meeting with Russia over alleged violations of the 1987 Intermediate-range Nuclear Forces (INF) treaty - a landmark Cold War-era agreement. \\nWashington wants the Special Verification Commission (SVC) to discuss the problems related to the treaty’s compliance. The event is expected to take place in mid-November. The INF set up the Special Verification Commission as a way to deal with disputes surrounding the treaty. Ukraine, Belarus and Kazakhstan can also attend the meeting because they housed intermediate range missiles before the disintegration of the Soviet Union and remain parties to the treaty. No SVC meeting has been convened since 2003. \\nRussia welcomes the United States' offer. «We have responded positively», said Mikhail Ulyanov, the head of Foreign Ministry's Non-Proliferation and Arms Control Department. \\nThe treaty, which bans testing, producing, and possessing ground-launched ballistic and cruise missiles with ranges between 500 to 5,500 kilometers, eliminated an entire class of missiles from Europe, and set up an extensive system of verification and compliance. \\nTwo years ago, the United States first asserted that Russia was in violation of the treaty, by developing a missile system that fell within the INF prohibitions. \\nLast year, Rose Gottemoeller, the Under Secretary of State for Arms Control and International Security, said that Russia risked provoking «military and economic countermeasures» if it continued to stonewall the INF issue. \\nThe US has not released any specifics about which exactly Russian missile is the source of the violation. It should be noted that if Washington cannot present compelling evidence of the Russian non-compliance, the United States could be seen by the world as the party that killed the INF Treaty. The only thing the State Department has said is that an unspecified Russian ground-launched cruise missile breaches the agreement. \\nThe issue has been in focus of US media outlets recently. For instance, an article published by The New York Times on October 19 said « Russia appears to be moving ahead with a program to produce a ground-launched cruise missile». \\nAccording to the article, «the concern goes beyond those raised by the United States in July 2014, when the Obama administration said that Russia had violated the 1987 treaty on Intermediate-Range Nuclear Forces». On the very same day, The Wall Street Journal chimed in saying «The US is escalating a dispute with Russia over its accusations that Moscow possesses banned missile technology». \\nOn October 17, two top House Republican chairmen - House Armed Services Committee Chairman Mac Thornberry (Texas) and House Intelligence Committee Chairman Devin Nunes (Calif.) – wrote a letter to the US president saying «It has become apparent to us that the situation regarding Russia’s violation has worsened, and Russia is now in material breach of the treaty». \\nRussia, in turn, has accused the US of violating the pact. According to Russia’s officials, the Aegis Ashore missile defense system that the US has activated in Romania and plans to install in Poland represents a violation of the treaty. \\nAegis Ashore uses the naval Mk-41 launching system, which is capable of firing long-range cruise missile. This is a blatant violation of the INF Treaty provisions. \\nThe treaty bans launchers capable of firing intermediate range missiles. Mk-41s deployed in Europe may launch short and intermediate range cruise missiles deep into Russian territory. A US intermediate range weapon launched from Romania or Poland would require only a short flight time to reach beyond the Urals. Russia has also said that American armed drones violate the treaty. \\nThe US plans to arm tactical aviation in Europe with modernized B61-12 guided warheads will virtually nullify all the benefits of the INF Treaty from the point of view of Russia’s security. The aircraft could fly from bases in Lithuania, Estonia and Poland to Russia’s largest cities in 15-20 minutes – not that much longer than the flight time of the missiles scuttled by the INF treaty. \\nIf the US really wants the talks to produce a positive result, all these concerns should be part of the agenda. \\nThe SVC meeting will take place against the background of Russia’s withdrawal from the plutonium disposal deal with the US because of Washington’s non-compliance, recent movement of nuclear-capable Iskander missiles to Kaliningrad , rising tensions over NATO’s ground forces to deploy near Russian borders in 2017, US withdrawal from the agreement over Syria and apparent disintegration of arms control regime. \\nOnly political unity among the major global powers can reverse the disintegration process. Non-compliance, technical or material, is not the only problem the INF faces. Russia and the US adherence to the treaty’s provisions does not prevent other countries from efforts to acquire ground-based intermediate range nuclear capability. The treaty should become multilateral. Russia and the US could cooperate in an effort to reach this goal with the help of the United Nations. It may be kind of forgotten today as so many things have happened since then, but in October 2007 Russia and the United States issued a joint statement to call on all countries to join a global INF Treaty addressing the First Committee (Disarmament and International Security) of the UN General Assembly. \\nSetting the existing differences aside, the parties could revive the process in an effort to involve other states. \\nThe SVC meeting may become a venue for addressing other issues related to arms control. The concerns are there. Candid talk is the best way to address the burning problems of mutual interest. \\nThe US has demonstratively refused to discuss the host of problems related to the ballistic missile defense in Europe. \\nThis stance is erroneous. The US should change its approach to the problem. The two great powers do need a venue for arms control dialogue. The reached agreement to restart contacts within the framework of SVC against the background of US presidential election gives hope that the tide may gradually turn.  \""}, "time": 1742561724.402548}