{"duration": 0.03176379203796387, "input_args": {"text": "'Posted on October 27, 2016 by Sean Adl-Tabatabai in Middle East , News // 0 Comments \\nThe Palestinian Foreign Ministry have urged The International Criminal Court (ICC) to prosecute the Israeli army after they confessed to “field executions” against Palestinians. \\nThe Ministry made the comments after a leaked Israeli army report admitted it was possible to avoid firing against Palestinian people. \\nXinhuanet.com reports: \\n“The leaking of an Israeli army internal memo is meant to distort the work of the ICC and its preliminary investigations with regards to Israeli crimes including field executions in order to claim that the occupation authorities are undergoing due procedures with regards to such crimes,” the ministry said in a statement. \\nThe ministry said that although the report mentions four cases, it “ignores the fact that all cases of field executions that claimed the lives of dozens of Palestinians did not impose any serious harm or life threat to soldiers.” \\nIsraeli public radio reported early on Tuesday that an internal report was dispatched to army soldiers saying that it was possible to avoid shooting Palestinians in the West Bank in four separate incident if the army forces acted in a proper way during those incidents. \\nThe report added that two Palestinians were killed in those incidents and two others were critically injured, pointing out that soldiers opened fire towards them while they should have not, and that if they had acted differently in some cases, they would have avoided shooting them. \\nA wave of tensions has been flaring between Israel and the Palestinians in the Palestinian territories since October 2015. \\nOfficial figures say at least 226 Palestinians and 40 Israeli were killed. \\nTension between the two ides mounted and went on on daily basis following the daily assaults on Jerusalem by Israeli settlers and security forces, besides the repeated attempts of radical Jewish groups to get into Al-Aqsa Mosque in East Jerusalem.'"}, "time": 1742564120.8244257}