{"duration": 0.10275435447692871, "input_args": {"text": "'Editor’s Note : The CDC is guilty of nothing shorter than CRIMES AGAINST HUMANITY. Period.\\n\\n \\nHere are the bones of the story. For the first time in 30 years, a vaccine-damage case has gone before a court judge. Lawyers for a 16-year-old autistic boy are suing a medical clinic for administering vaccines that brought about the autism. The CDC, of course, denies any connection between vaccines and autism. But one of its own long-time researchers, William Thompson, has publicly confessed to fraud in that area. Thompson states that he and his colleagues concealed research data that would have shown the MMR vaccine and mercury-laden vaccines do cause autism. The lawyers for the 16-year-old boy want to bring in Thompson to testify about what he knows. The CDC has said NO. The head of the CDC, Thomas Frieden, states, “Dr. William Thompson’s deposition testimony would not substantially promote the objectives of CDC or HHS [the Department of Health and Human Services].”\\nWell, he’s right, because the CDC is the PR arm of the vaccine industry. The CDC is a major purchaser of vaccines for the US federal government. If this boy won his case, other cases would follow. The potential monetary exposure in judgments? A trillion dollars or more.\\nEcowatch.com has the details :\\n“The medical malpractice case seeking Dr. Thompson’s testimony is on behalf of 16-year-old Yates Hazlehurst. The lawsuit alleges that Yates is autistic as a result of vaccine injuries, which occurred when the vaccines were improperly administered in 2001. Because of the Vaccine Injury Compensation Act of 1986 (VICA), Hazlehurst v. The Jackson Clinic is the only vaccine injury case that has gone to any U.S. court in 30 years.”\\n“Dr. Thompson wants to reveal the scientific fraud and destruction of evidence that took place in the studies that he co-authored. However, in accordance with the Whistle Blower Protection Act and other federal regulations, Dr. Thompson can not testify under oath without the permission of the director of the CDC, Dr. Thomas Frieden.”\\n“The request on behalf of Hazlehurst specifically relates to the issue of causation, i.e. the issue of whether vaccines can cause autism, which the State of Tennessee Circuit Court Judge found to be both relevant and a proper basis for seeking the deposition of Dr. Thompson.”\\n“Judge Acree ordered on Feb. 5 that Dr. Thompson should be deposed. Following Judge’s Acree’s ruling, Smith [Bryan Smith, the boy’s attorney] filed a formal request to CDC to make Thompson available for deposition and trial testimony.”\\n“On Sept. 22, in a letter from CDC Director Thomas Freiden, CDC denied Smith’s request. Smith explained that ‘this denial was a disappointment but not a surprise, since the inescapable implication of Dr. Thompson’s testimony is that the agency fraudulently altered the science to undermine autism cases worth potentially $1 trillion in compensation ordered by Congress’.”\\n“Smith and Kennedy [Robert F Kennedy, Jr., the boy’s other attorney] plan to immediately appeal the CDC’s denial to federal court.”\\nWilliam Thompson, the CDC whistleblower, is the subject of the film Vaxxed ( trailer ). Thompson has admitted publicly that he and his CDC colleagues literally threw damning data into a garbage can, to avoid reaching the conclusion, in a 2004 study, that the MMR vaccine raises the risk of autism in children.\\nHis testimony in court would be explosive, to say the least.\\nSince he is still employed by the CDC, his bosses can keep him out of court. They can muzzle him. They can threaten him. No doubt, Thompson has also signed non-disclosure agreements with the Agency.\\nHow far would the federal government go to silence Thompson, who could open a Pandora’s box containing a trillion dollars in potential judgements? All the way is the obvious answer.\\nThe implications of Thompson’s testimony involve much more than money: the massive destruction of lives through vaccinations. That is ultimately the crime of crimes at the bottom of the cover-up.\\nAnd the CDC would be rightly seen as a primary agent in both the crimes and the cover-up.\\nIf the US Department of Justice had any sense of honor, or courage, scores of CDC employees would be in jail right now.\\nAnd if major media outlets had any sense of honor, or courage, they would be swarming all over the CDC, hammering on many employees and obtaining confessions from them, releasing the rank truth about vaccines from the Agency’s offices and labs of shame.\\n(To read about Jon’s mega-collection, Power Outside The Matrix , click here .) Delivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by Jon Rappoport of No More Fake News . \\nThe author of an explosive collection, THE MATRIX REVEALED , Jon was a candidate for a US Congressional seat in the 29th District of California. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. '"}, "time": 1742562136.6274753}