{"duration": 0.09693574905395508, "input_args": {"text": "\"Comments \\nA federal judge in Ohio has slapped the Trump Campaign and dirty trickster Roger Stone with a restraining order for their minority voter intimidation tactics. Judge James S. Gwin issued an order that prohibits the Trump campaign and Roger Stone or his super PAC “Stop the Steal” from seven illegal activities, listed below. Stone did not make an appearance or send counsel. Amazingly, the Ohio Republican Pary avoided being enjoined by the order. \\nOhio Democratic Party Chairman David Pepper said in a statement to Cleveland.com that “with this decision, Ohioans can feel confident that they will be able to make their voices heard in this election.” Yale educated civil rights lawyer Subodh Chandra gave a play by play of the hearing on twitter, and noted that the Trump campaign had few answers for the judge’s questions. Chandra’s conclusions about the voter suppression hearing reflect the new terrain that the Republican party and Trump campaign have blazed in their open desire to suppress the vote: Graduating @YaleLawSch 22 yrs ago, I never thought I'd be sitting in a fed ct watching a hrng re enforcement of the KKK Act for an election. \\n— (((Subodh Chandra))) (@SubodhChandra) November 4, 2016 \\nThe federal judge’s ruling prohibits the following illegal behaviors by Donald Trump, Roger Stone and “Stop the Steal”: \\na. Hindering or delaying a voter or prospective voter from reaching or leaving the polling place fixed for casting the voter’s ballot; \\nb. Engaging in any unauthorized “poll watching” activities inside of polling places, within one hundred feet of polling places (“the buffer zone”)11, or within ten feet of a voter standing in a line extending beyond the buffer zone.12 Unauthorized “poll watching” includes challenging or questioning voters or prospective voters about their eligibility to vote, or training, organizing, or directing others to do the same; \\nc. Interrogating, admonishing, interfering with, or verbally harassing voters or prospective voters inside polling places, in the buffer zone, or within ten feet of a voter standing in line outside the buffer zone, or training, organizing, or directing others to do the same; \\nd. Distributing literature and/or stating to individuals at polling places, in the buffer zone, or within ten feet of a voter standing in line outside the buffer zone, that voter fraud is a crime, or describing the penalties under any Ohio or Federal statute for impermissibly casting a ballot, or training, organizing, or directing individuals to do the same; \\ne. Gathering or loitering, or otherwise being present without the intention to vote, at polling places, in the buffer zone, or within ten feet of a voter standing in line outside the buffer zone; \\nf. Following, taking photos of, or otherwise recording voters or prospective voters, those assisting voters or prospective voters, or their vehicles at or around a polling place, or training, organizing, or directing others to do the same; \\ng. Questioning, and training, organizing, or deputizing any persons to question voters at Ohio polling places, in the buffer zone, or within ten feet of a voter standing in line outside the buffer zone, under the guise of the purported “exit polling” or “citizen journalist” operations organized and encouraged by Defendants Stone and Stop the Steal. \\nThe Republican National Committee was also in court this morning, and a federal judge in Newark heard both sides of the DNC’s national action to stop minority voter intimidation under a 1982 consent decree. Spokesmen for the Democratic lawyers said that they were satisfied with the results of the hearing, and that the judge said he wouldn’t finish ruling today, but that a decision may be disseminated over the weekend in the emergency litigation. \\nThe Republican nominee’s efforts at voter intimidation and a campaign of suppressing the vote are the last refuge of a political loser. More importantly, Trump and Stone’s actions violate the federal laws meant to protect the right to vote, democracy and civil rights in America for all citizens.\""}, "time": 1742563275.7607443}