{"duration": 0.3060140609741211, "input_args": {"text": "\"  VN:F [1.9.22_1171] \\n  Close Transcript Transcript:   \\nBelow is an approximation of this video’s audio content. To see any graphs, charts, graphics, images, and quotes to which Dr. Greger may be referring, watch the above video. Most deaths in the United States are preventable, and related to nutrition. According to the most rigorous analysis of risk factors ever published, the Global Burden of Disease study, funded by the Bill and Melinda Gates Foundation, the number one cause of death in the United States, and the number one cause of disability in this country, is our diet—which has bumped tobacco smoking to number two. Smoking now only kills about a half million Americans every year, whereas our diet now kills hundreds of thousands more. So, if most death and disability is preventable, and related to nutrition, then obviously, nutrition is the number one thing taught in medical school; right? It’s the number one thing your doctor talks to you about. How could there be such a disconnect between the science, and the practice, of medicine? Let’s do a thought experiment. Imagine yourself a smoker back in the 1950s. The average per capita cigarette consumption was about 4,000 cigarettes a year. Think about that. In the 1950s, the average person walking around smoked a half pack a day. The media was telling you to smoke. Famous athletes agreed. Even Santa Claus cared enough about your throat to want you to smoke. I mean, you want to keep fit, and stay slender; so, you make sure to smoke. And eat lots of hot dogs to keep trim, and lots of sugar to stay slim and trim—a lot less fattening than that apple there. I mean, sheesh. Though apples do “connote goodness and freshness,” reads one internal tobacco industry memo, which brings up many possibilities for making “youth-oriented” cigarettes. They wanted to make apple-flavored cigarettes for kids. In addition to staying fit and slender, and soothing your throat, “For digestion’s sake,” you smoke. I mean, “No curative power is claimed for [by] Philip Morris—but [hey], an ounce of prevention is worth a pound of cure.” Better be safe than sorry, and smoke. Like eating, smoking was a family affair. “Gee, Mommy, you sure enjoy your Marlboro! You’re darn tootin’. Just one question, Mom: can you afford not to smoke Marlboros?” In the 1950s, your kids were giving you cigarettes. Even your dog was giving you cigarettes. “Blow in her face and she’ll follow you anywhere.”“No woman ever says no.” They’re “so round, so firm, so fully packed.” After all, John Wayne smoked them (until he got lung cancer and died). Back then, even the Paleo folks were smoking, and so were the doctors. Now, this is not to say there wasn’t controversy within the medical profession. Yes, some doctors smoked Camels, but other physicians preferred Luckies. So, there was some disagreement. “Eminent doctors, on high and impartial medical authority, call for Philip Morris.” Even the specialists couldn’t agree which cigarette was better for your throat. So, best to stick to the science. And, more scientists smoke this brand. This should not be rocket science—but even the rocket scientists had their favorite: for “the man who thinks for himself.” We know why the AMA may have been sucking up to the tobacco industry, refusing to endorse the Surgeon General’s report on smoking, after they were handed a ten million dollar check from the tobacco industry. But, why weren’t more individual doctors speaking out? Well, there were a few gallant souls ahead of their time, writing in, as there are today, standing up against industries killing millions. But, why not more? Maybe, it’s because the majority of physicians themselves smoked cigarettes—just like the majority of physicians today continue to eat foods that are contributing to our epidemics of dietary diseases. What was the AMA’s rallying cry back then? Everything in moderation. Extensive scientific studies have proven “smoking in moderation”—oh, that’s fine. Sound familiar? Eating the Standard American Diet today is like being a smoker back in the 1950s. Most everyone you know eats this way. It’s normal—it’s what they feed people in hospitals, for gosh sake. But, you don’t have to wait until society catches up with the science again. Sometimes, it takes a whole generation for things to change in medicine. The old guard of smoking physicians and medical school professors die off, and a new generation takes its place. But how many patients need to die in the interim? Please consider volunteering to help out on the site. Close Sources Video Sources vegetarians Doctor's Note \\nIn this video, I try to answer the question that surely must occur to anyone even dipping their toes into the lifestyle medicine literature: “Wait a second, if this were true, why didn’t my doctor tell me?” If, for example, our #1 killer can be reversed through diet, why isn’t it front page news, taught to every medical student, broadcast from every mountaintop by medical organizations and government dietary guidelines? Still confused? Check out my other videos that address these questions: \\nIs the risk of smoking and the Standard American Diet really comparable, though? See Animal Protein Compared to Cigarette Smoking . \\nIf you haven’t yet, you can subscribe to my videos for free by clicking here . To post comments or questions into our discussion board, first log into Disqus with your NutritionFacts.org account or with one of the accepted social media logins. Click on Login to choose a login method. Click here for help. \\nWish I could take out a billboard for this one! schkorpio@hotmail.com \\nKickstarter? :) I would chip in. Gatherer \\nWhen Dr Greger isn’t limited to a short video he can make his points even more obvious! For a longer version of the content in today’s video see the last part of “Food as Medicine: Preventing and Treating the Most Dreaded Diseases with Diet”. Start at 54:46 and go to 1:12:20. I love the quotes by Dr Neal Barnard and Dr Kim Williams near the end. Plantstrongdoc M.D. \\nThe only thing I remember from medschool regarding nutrition was my professor in cardiology saying that it is impossible to bring down the cholesterol with diet alone, you need medication, and my professor in haematology saying that it is probably healthy to be a vegetarian, but you will surely develop anaemia, and them I remember a very skilled cardiologist who inhaled huge amounts of cake between the angiograms, not to mention the child oncologist who was a heavy smoker, wrinkled in his face like a raisin and his skin had a slightly yellow tone. When I was an intern, one of my collegues brought his own dinner – chips and coke. Regarding nutrition: DONT LISTEN TO YOUR DOCTOR! The chance that he or she on the field of nutrition is an ignorant is probably near 100% plant_this_thought \\nThe interns at the hospital I used to work at were always boasting about how little sleep they got, how crappy their diet was, etc., competing to show how much they could abuse their own bodies, as if this somehow showed their commitment to the profession of helping others to get well. lemonhead \\nI’ve always wondered if, due to the harsh conditions of medical training, there’s selection for particularly physically robust people and that they would, perhaps, be less sympathetic to people prone to illness having not experienced such states themselves. Ryan \\nEven if they taught more nutrition in medical school it wouldn’t help much if they keep using the current batch of nutrition textbooks. I’m in college for nursing right now and they’re covering nutrition in my class *right now* and I’m having to tune it out to keep myself from interrupting class on how dangerous and outdated the information they’re teaching is. \\nMeat and dairy is being referenced as safe and nutritious food. There is hardly mention of how diet impacts health other than preventing deficiencies and obesity. Vegans are lumped in with vegetarians and are only mentioned because of the risk of b12 and vitamin D deficit. I can go on and on… it’s infuriating. \\nI don’t know whether it’s more frustrating that a whole generation of new nurses is being prejudiced against a whole plant foods diet or that the professors who say ‘evidence-based practice’ in every other breath won’t bother changing the curricula to match the science. Plantstrongdoc M.D. \\nGood point. Places where nutrition is taught, it is not exactly Greger, Esselstyn, McDougall, Klaper they refer to.“Meat and dairy is being referenced as safe and nutritious food”– OK there is still a long way.“nutritional deficiencies (probably referring to vitamin and minerals) – which century does the teachers come from? :-) Ryan \\nWell the one professor jokes that she used to work with Florence Nightingale… Betsy \\nI’ve been eating about 97% vegan for 8 years or so based on the writings of the docs you mentioned, but now I’m very confused because docs like Mark Hyman who is well respected in the functional medicine field and works at the Cleveland Clinic, studies showing to eat more fat – granted its fat like avocado/coconut oil and he says not to eat it with unhealthy carbs, but his talks with other professionals on his Fat Summits don’t seem to be in alignment with the docs you mentioned. In fact I know Dr. Esselstyn thinks all oils are a waste of calories. Mark said on one of the videos that his LDL has gone way up from eating so much coconut oil, but these folks are citing studies too. It’s very confusing. Thea \\nBetsy: . When all is said and done, Hyman is citing studies, but he is misleading people in various ways when he does it. VegCoach found the following 4 minute video about one of Mark Hyman’s claims that demonstrates my point. https://www.youtube.com/watch?v=RovJRlTbsgw&feature=youtu.be . Also, the following post from Tom Goff looks into some of the other of Hyman’s claims. http://nutritionfacts.org/2016/03/22/the-effects-of-dietary-cholesterol-on-blood-cholesterol/#comment-2584872026 . I agree that it *is* terribly confusing for most people. It really frustrates me that a lack of integrity and basic human decency is affecting the very lives of so many people. Jean \\nAm I the only one that at 100% volume can barely hear this video? Thea \\nJean: The volume is working fine for me and no one else has mentioned the volume as being an issue. . I’m not sure if this will be worth it to you or not, but you might narrow down the issue by trying other recent videos on this site to see if you experience the same problem and then try a video or two on a different browser. Maybe whatever you find out with these experiments will help you narrow down the problem??? . Sorry I don’t have anything more concrete for you. John \\nI did have to turn it up in order to hear all the words on a technical subject. John S docbeccy \\nI agree! When Dr. Hyman’s book on the sugar solution came out I got a free advance excerpt. I was stunned to see he recommended BACON!! I tried to engage in a dialogue as to why he thought a high fat, nitrate laden, version of cured meat belonged in anyone’s diet but I never got a response. When I visited the Canyon Ranch Spa this summer and spoke with their medical director he was very sad that one of their former medical directors was clearly less interested in patient health than other priorities. One needs to be judicious as we wade through the conflicting experts. Thea \\ndocbeccy: Thank you for your reply. That’s some interesting insight. . re: “…wade through conflicting experts.” One of the biggest mistakes I see people making is along the lines of false equivalencies. I see it all the time here on NutritionFacts. “You say this, but these other people say something else and they have valid points too.” There are times when a “side” is not equally valid. If you give equal weight to all sides without having the ability to filter (as most people do not when it comes to nutrition), then you can end up confused and/or finding a balance between two view points which is not actually reasonable/balanced/based on the evidence. . I wish there was a way to help people see through this, but I don’t think there is at this time. People are just massively confused, often invested in that confusion, and I don’t judge them. It is tough! At some point, I think the situation will be like the smoking issue and everyone will just get it instinctively, because like the smoking issue at some point the science (and noticing the health of WFPB eaters long term) will win out. In the mean time, we can do our part to help by continuing to volunteer on NutritionFacts. :-) Plantstrongdoc M.D. \\nWell – I think it is important to look at the big lines, because there are small differences between what these great docs (and others) recommend. E.g. McDougall is very fond of starches and has nothing against a little salt, Furhmann is very fond of beans and vegetables, for some a little processed oil is OK, For Ornish small amounts of egg white is OK and so on. Common to them is they recommend a mostly vegan diet – I think that is the important point John \\nHi Betsy, I have been saying this for a long time. You’ll never see this here, but other scientists critique Dr. Greger’s finding the same way as Thea does about Dr. Hyman below. I just try to listen to all of them that seem to have substance and sift them through my own filter. John S Thea \\nJohn S: Did you watch that 4 minute video? I’ve never seen Dr. Greger make a claim about a study where the study actually says the very opposite of Dr. Greger’s claim–not the way that Dr. Hyman did. I highly recommend watching that 4 minute video. John \\nYes, I did watch the 4 minute video. I also saw the Klaper video. I was only allowed to see the viewpoint of the person making the video, and he wasn’t honest about what Dr. Hyman actually said. Hyman was talking about calories burned by people when they ate different things,and the video never addressed the issue that Hyman brought up. John S Thea \\nJohn: FYI: I looked into this video in the past. I went to Hyman’s site and I read his claims and then examined the claims in the video. I do not remember see any discrepancies. Anyway, glad you got to see the video. . Note, I did not reference a Dr. Klaper video in the above post. I don’t know what you are referring to. Kwarya \\nWas just telling MY nursing professor the same sort of thing today when our book and her lecture were touting certain foods, most if which fall in the “animal products” category! There is never a single reference in my nursing books to a healthier lifestyle other than going “low fat” (with the SAD). Misterimpatient \\nFor the record, John Wayne died of stomach cancer (1979) not lung cancer. He had a lung removed in 1964 due to lung cancer. https://en.wikipedia.org/wiki/John_Wayne Plantstrongdoc M.D. \\nSmokers also have an increased risk of stomach cancer. Misterimpatient \\nThank you. I understand that. The video says he died of lung cancer, which is not correct. Rhombopterix \\nhe got lung cancer: true and he died: true \\nhow does your comment help us? Misterimpatient \\nIf there is one thing we count on from nutritionfacts.org it is accurate information. Go to 3:10 in the video and consider the content “…until he got lung cancer and died.” An honest listener will hear this and think that lung cancer was the cause of death. In fact, stomach cancer was the cause of death in very source I found. \\nSo how does my comment help? It attempts, without contempt for others, to correct verifiably incorrect information in the video. Thea \\nMisterimpatient: I will pass this onto staff. Todd \\nGood point. Attention to detail is important on a site like this. It’s possible, I suppose, that the stomach cancer that took John Wayne’s life was a metastasis of the original lung cancer, in which case the original cancer would be cited as the cause of death. But unless we know that for sure, it’s not a good idea to state that he died of lung cancer. Plantstrongdoc M.D. \\nTypically lung cancer spread to the brain, bone or liver. Tired of War \\nWhile Wayne’s 6 pack-a-day cigarette habit might have had something to do with his death, I’m pretty sure that the ultimate reason for his demise was his role as Genghis Khan, in the movie, “The Conqueror.” The film was shot downwind from active, above ground, nuclear bomb testing sites, in 1956, and quite a few of those involved in the filming succumbed to cancer in the years that followed. I fear that there are some historical personalities that one should portray, with great caution. Misterimpatient \\nWell played. Very well played indeed. George \\nI don’t know about you, but there is a certain amount of people for whom the truth is important. And also there are people (like our host) how ask others to point out eventual mistakes in their work. Unless you have a hostile relationship with the truth, Misterimpatient’s comment should help you, too. Colonel Forbin \\nSick world we live in. Robbin \\nI think back then tobacco companies were paying off everyone now pharmaceutical companies are paying off everyone. Maybe a lot of doctors smoked back in the day, but I think a lot of doctors like their pills today. There is no money in gardening, but there is in pill popping. I think sometimes it would be easier just to eat like everyone else, then I remember I don’t want to feel like sh*t like everyone, or be on medications like everyone. Blair Rollin \\nIt sure would be a lot easier. I do a whole lotta kitchen time since we switched to WFPB. But then again, I’m passing most people even 30 years younger than me out on the trail. And I can stand to look in the mirror. Ellen Mulcrone \\nHello, \\nI was wondering if anyone knew how to treat Lichen Sclerosus with diet, and if anyone had found any scientific based evidence to support this? I can’t find anything on the site. \\nThanks!\""}, "time": 1742563210.3678267}