{"duration": 0.019458770751953125, "input_args": {"text": "'Back on the campaign trail,   Donald J. Trump argued that the United States faced a threat  —   radical Islamic terrorism  —   on par with fascism, Nazism and communism. He declared to a cheering crowd in Youngstown, Ohio, that “those who do not believe in our Constitution or who support bigotry and hatred will not be allowed into our country. ” Now that view is not the stuff of stump speeches. It’s America’s foreign policy. As the White House puts in place a sweeping immigration ban focused on   countries, one of the top investigative reporters at The New York Times, Scott Shane, has been seeking an answer to one big question. He wants to know where the president’s views on Islam came from. We talk with him on the show about what he’s found. If you are on your phone and don’t see an audio player on this page, follow the instructions below. On your iPhone or iPad: Open your podcast app. It’s a   app called “Podcasts” with a purple icon. If you’re reading this from your phone, tap this link, which will take you straight there. (You can also use the magnifying glass icon to search just type “The Daily. ”) Once on the series page, you can tap on the episode title to play the episode (make sure you have an internet connection) and tap on the “subscribe” button to have new episodes sent to your phone free. Or if you have another preferred podcast player, you can find “The Daily” there. (Here’s the RSS feed.) On your Android phone or tablet: Open your podcast app. It’s a   app called “Play Music” with an    icon. If you’re reading this from your phone, tap this link, which will take you straight there. (You can also use the magnifying glass icon to search just type “The Daily. ”) Once on the series page, you can tap on the episode title to play the episode (make sure you have an internet connection) and tap on the word “subscribe” to have new episodes sent to your phone free. Or if you have another preferred podcast player, you can find “The Daily” there. (Here’s the RSS feed.) From a desktop or laptop: Click the “play” button above to start the show. Make sure to keep that window open on your browser if you’re doing other things, or else the audio will stop. You can always find the latest episode at nytimes. . On Amazon Echo, Echo Dot or Tap: Open your Alexa app. From the navigation panel on the left, select “Settings,” then select “Flash Briefing,” then select “Get more Flash Briefing Content. ” Look for “The New York Times” and select “Enable Skill. ” Now you can say, “Alexa, what’s my flash briefing?” and you will hear “The Daily. ” On Google Home: You can say “Okay, Google, play New York Times news” to listen to that day’s audio report.'"}, "time": 1742628560.382254}