{"duration": 0.03555560111999512, "input_args": {"text": "'The “Fearless Girl” statue which stands opposite of the iconic charging bull on Wall Street is racking up awards this week at Cannes Lions, the largest annual gathering of marketing executives. [The statue was commissioned on behalf of asset manager State Street and advertising agency McCann New York as a way of encouraging firms to hire more female executives.  “Its simplicity in the use of symbolism transcends geography, it transcends language, it transcends culture,” Wendy Clark, CEO of DDB North America, told Adweek. “For us, while it is a girl, it elegantly captures women’s journeys and our path to empowerment. And it also encapsulates our hopes and our ambitions for every little girl in the world. ” Clark also serves as the jury president of the Cannes Lions awards week, which was inspired by the Cannes Film Festival and takes place at the same conference center in Cannes, France. The “Fearless Girl” statue took home the Grand Prix in the Glass, PR and Outdoor Lions categories on the festival’s first day. The statue was sculpted by artist Kristen Visbal in an effort to encourage gender diversity amongst corporate executives. “The girl is standing there like this in front the bull, saying, ‘Now, what are you going to do?’  Arturo Di Modica said, who sculpted the Charging Bull statue. Di Modica argues that the “Fearless Girl” statue violates his artistic rights as it changes the meaning of the bull statue. “Remove her and place her somewhere else in the city,” Di Modica’s attorney said. “We’ve got lots of ideas. And damages must be awarded to Arturo for violation of his legal, statutory rights. ” Tom Ciccotta is a libertarian who writes about economics and higher education for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com'"}, "time": 1742564110.3734615}