{"duration": 0.06189393997192383, "input_args": {"text": "'John Podesta, Hillary Clinton’s former presidential campaign chairman, has claimed there was a “failing” by mainstream media to protect American democracy during the 2016 presidential election. [“The fact that there was substantiation that the Russians had hacked my emails, the DNC emails, that Wikileaks was an instrument of an attempt by Vladimir Putin and the Russian Federation to undermine our democracy, that could have been reflected in the press and I don’t believe it was,” Podesta said in an interview with the BBC’s Evan Davis.  “And I think that was actually a failing on behalf of the mainstream media and particularly some of the major news outlets in our country like The New York Times,” he continued.  However, there is little evidence to support Podesta’s claims, given that mainstream news outlets such as The New York Times, CNN, and The Washington Post all gave extensive coverage to potential Russian interference in the election and did not fully report the range of explosive revelations that emerged from the Wikileaks releases. “The [mainstream media] decided it was more interesting, maybe more titillating, to get into the kinda campaign gossip which was what those emails were,” Podesta continued. Podesta’s claims are also undermined by the vigorous support Clinton received from nearly all the mainstream media, earning endorsements from The New York Times, The Washington Post, The Boston Globe, New York Daily News, The Los Angeles Times, and nearly all metro and regional newspapers across the country. Furthermore, emails revealed by Wikileaks actually showed extensive collusion between mainstream media journalists and Clinton’s campaign, principally via Podesta, without revealing this to their audience. Prominent examples of that collusion include CNBC’s Chief Washington Correspondent John Harwood regularly emailing Podesta to congratulate him on primary wins, former POLITICO reporter Glenn Thrush asking Podesta to approve a story he wrote pertaining to Clinton’s campaign, while The New York Times’ political correspondent Maggie Haberman was described by the campaign as a “friendly journalist” who “teed up” stories and “never disappointed” the Clinton campaign. A study in the run up to the November election also found that 96 percent of campaign donations from persons in the media went toward Hillary Clinton. Discussing the future of the Democratic Party, Podesta added that he was now “fully into the resistance” against Donald Trump and the new administration. You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742562031.2564306}