{"duration": 0.19489336013793945, "input_args": {"text": "'WASHINGTON  —   When President Trump’s new Middle East envoy began haggling over the details of an agreement with Israel to curb construction of Jewish settlements in the West Bank, they turned to a politically improbable adviser: Yael Lempert, a    diplomat who worked on the issue in Barack Obama’s White House. When Mr. Trump met with the leaders of Japan, Britain and Canada, he included Thomas A. Shannon Jr. another career diplomat, who rose to the No. 3 post in Mr. Obama’s State Department. And when Secretary of State Rex W. Tillerson traveled to Turkey this past week to rally support for the military campaign against the Islamic State, he took along Brett H. McGurk, who coordinated that effort as Mr. Obama’s special envoy. These diplomats are part of a rare cohort in the Trump administration: holdovers from the Obama years, whose skills, knowledge and bureaucratic finesse have enabled them to survive, even thrive, in an administration determined to purge all vestiges of its predecessor. Anytime there is a change in administrations, career government officials face a tricky transition. But that process has been particularly difficult under Mr. Trump, because of the insurgent nature of his campaign and his deep suspicion of the permanent bureaucracy. While these diplomats have held on through multiple transfers of power in Washington, navigating this new administration poses special challenges. Ms. Lempert has come under fire from people on the Israeli right, who accuse her of continuing to push Mr. Obama’s    policies. And Mr. Shannon’s ability to get along with Mr. Trump’s inner circle has rankled some in the State Department, which has become a hotbed of dissent against the new president and his policies. “They’re relying on these people for sheer expertise,” said Elliott Abrams, a Republican   elder who was briefly considered for the post of deputy secretary of state. “But there is a danger here. You have to make a judgment about whether the career person was so embedded in the previous administration that they need to go immediately. ” The status of Obama holdovers remains a source of tension within the National Security Council. Since the inauguration in January, Mr. Trump’s aides have pushed to get rid of many of them, in part because they question whether people who worked for Mr. Obama can be loyal to Mr. Trump. It is unclear whether the new national security adviser, Lt. Gen. H. R. McMaster, is resisting these efforts, though he has made a point of meeting with the career staff. The problem is compounded by severe delays at the White House in filling jobs. So far, it has nominated people for only 43 of 553 key executive branch positions, according to a tally by the nonpartisan Center for Presidential Transition at the Partnership for Public Service. The delays are particularly acute in the national security field, where the White House is confronting crises like the military campaign against the Islamic State. Even before his secretary of state, Mr. Tillerson, was confirmed, Mr. Trump had signed an executive order barring visitors from seven predominantly Muslim countries and moved to revive peace negotiations between Israel and the Palestinians. The travel ban thrust Mr. Shannon, whose title is under secretary of state for political affairs but who was then serving as acting secretary of state, into an awkward spot. The White House barely consulted the State Department before issuing the order, and it relied on Mr. Shannon to rally his colleagues  —   many of whom bitterly opposed the order  —   to enforce it. White House officials, some of whom had expected the State Department to actively undermine the president, said they were surprised by the speed with which it issued instructions to consular offices worldwide. They credit Mr. Shannon, 59, with overseeing that response. “He was a rock” that weekend, said Stephen K. Bannon, the president’s chief strategist. “Really came to the forefront with leadership, judgment and class. Folks think very highly of him. ” Mr. Shannon also stood in for Mr. Tillerson in the president’s meetings with Prime Ministers Theresa May of Britain, Shinzo Abe of Japan and Justin Trudeau of Canada. At the news conferences in the East Room after those meetings, he was the lone outsider who sat with Mr. Bannon and other members of Mr. Trump’s inner circle. In all these cases, Mr. Shannon said, he was simply doing his job as a Foreign Service officer. “We take an oath to the Constitution, and that Constitution is all about respect for our laws and for the will of our people,” he said. “We have to respect the decision of the American people. ” A   veteran of the Foreign Service, Mr. Shannon served in the National Security Council during the George W. Bush administration, where he became a favorite of Mr. Bush’s secretary of state, Condoleezza Rice. He also served as assistant secretary for Western Hemisphere affairs under Mr. Bush and Mr. Obama, a job in which he won the trust of Secretary of State Hillary Clinton. “I am not the least bit surprised he is one of the last men standing,” said Daniel Restrepo, a former senior director in the National Security Council who worked with Mr. Shannon. “He’s both an effective diplomat and an effective bureaucrat, with an agreeable personality. ” Arturo Valenzuela, who succeeded him as assistant secretary, noted that Mr. Shannon was a fan of Nascar. That helps give him a common touch, which Mr. Valenzuela said might appeal to the people in Mr. Trump’s circle, even though he has a doctorate in history from Oxford. Certainly, Mr. Shannon has built bridges to Mr. Tillerson, who recently asked him to stay on as under secretary, traditionally the   post for a career diplomat. For Ms. Lempert, who has been posted to Jerusalem and advised Mrs. Clinton’s cabinet successor, John Kerry, on his dealings with Prime Minister Benjamin Netanyahu of Israel, the appeal to Mr. Trump’s advisers was her experience in the complex,   world of   negotiations. Her colleagues say she is well connected on both sides and is viewed as an honest broker (though in Israel, critics fault her for what they say was her role in Mr. Obama’s campaign to pressure Mr. Netanyahu to freeze settlements). As it happens, Mr. Trump  —   through his special envoy, Jason D. Greenblatt  —   is now pushing the Israeli leader to slow down construction as well. And Mr. Greenblatt, a lawyer who worked for the Trump Organization and has no experience in Middle East diplomacy, decided to keep Ms. Lempert on to advise him on the ins and outs of that negotiation. Ms. Lempert, who is Jewish and also served in the Bush administration, played a major role in negotiating a $38 billion military aid package for Israel on behalf of the Obama administration. Still, after reports surfaced that Mr. Netanyahu’s aides were suspicious of her involvement in the talks, the prime minister’s office felt obliged to issue a statement saying it had no objection to her. Mr. Greenblatt, in a statement, said, “I have been ably supported by the extremely   officials at the National Security Council (including N. S. C. Senior Director Yael Lempert). ” She declined to comment, as did colleagues from the Obama administration. Some said they worried that praise from them would hurt her with her new bosses. A few of Mr. McGurk’s former colleagues demurred from commenting for the same reason. But of all the Obama holdovers, he has had perhaps the smoothest transition. In part, that is because Mr. McGurk, 43, has been working on Iraq and related issues through three administrations. He also clerked for Chief Justice William H. Rehnquist, which Republicans view as a valuable credential. This past week, he was at Mr. Tillerson’s side in the Turkish capital, Ankara, advising him on the bewildering politics of the   coalition against the Islamic State. The United States plans to use a combined force of Arab and Kurdish forces to mount an assault on Raqqa, the Islamic State stronghold in Syria. But the Turks, who are fighting Kurdish militants at home, are balking because they view the Kurdish units as terrorists. Mr. McGurk organized a recent meeting of coalition members in Washington. In addition to his network of contacts in the region, he has forged close ties to the Pentagon, including to Defense Secretary Jim Mattis. “By virtue of his experience, he has almost      knowledge,” said Peter D. Feaver, who worked with Mr. McGurk in the   National Security Council. “In Brett’s case, he has proven he can be a loyal team player on very different teams. ”'"}, "time": 1742563982.030659}