{"duration": 0.14589715003967285, "input_args": {"text": "'Clinton perversion of electoral procedures, manipulation of media and the Justice system should make every American voter think twice about Hillary \\nBefore we get into the meat of this thing, let me make two things very clear: The evidence presented here is not the usual half-checked/chosen at random/doctored stuff we’re used to in madcap conspiracy rumours. Everything shown here is a matter of undisputed public record – a rare thing in this Presidential campaign I’m not trying to prove a theory here, as I lack the resources to do so. I am merely using informed logic to establish those four things required to build any credible case: behavioural track record, means, motive and opportunity. There is no doubt in my mind, however, that in terms of capability of performing dirty tricks, the Clinton campaign ticks all four boxes. The Clintons’ track record on dirty tricks \\nNegative advertising, smear rumour, making rally halls look more full/empty on TV and innate media bias have all been obvious for many years in Western election campaigns. Not surprisingly, during Presidential campaigns this is heightened by the physically more personal nature of the contest. \\nHuffington Post banned The Slog from commenting in 2012 after I alleged the use of troll swarms by Obama to mess up Republican sites. Three months later, his White House CoS casually confirmed the story. \\nThis is truth bending, and isn’t illegal. But the Clinton track record against Bernie Sanders is of a quite different order. I was given first-hand evidence, for example, of blatant threats to Democratic National Convention (DNC) workers that anyone helping organise Sanders rallies would have no future or place in a Clinton White House. But there is also disturbing evidence of electoral irregularity as well. October 2015 – over 120,000 voting registrations lost in Brooklyn – & rock solid Sanders neighbourhood, plus nearly a third of Sanders supporters complaining that, on pitching up to vote, their Party registrations had been changed Over nine straight 2015 primaries, Sanders won seven: in the other two, “massive voter irregularities” were reported. Hillary won them. The supposedly neutral DNC is stuffed with overt Clinton activists. The private company collecting sensitive poll/registration information NPG van has close ties to Bill Clinton and worked for him in 1992. Leaks from NPG are, to say the least, recurrent. On the eve of the Democratic party’s convention in Philadelphia, a whopping 20,000 emails were made public by Wikileaks showing supposedly ‘neutral’ senior party officials tried to undermine Mr Sanders’s insurgent left-wing campaign by publicly portraying him as an atheist. Solidly Sanders locations in Arizona’s Maciopa County found their polling booths available reduced from 200 to 60. Odd behaviour during a Primary campaign. Undercover videos just four days ago showed two senior DNC operatives openly admitting to paid interference with Trump rallies and voter registration manipulation. \\nThese days, one talks to Washington pundits who – sadly – shrug and say “both sides are at it – they cancel each other out”. But what I’ve shown above is just a fraction of highlights compared to the total media exposure of Clinton criminality. Doing a quick count from 78 sites, press titles and broadcasters last night, allegations against the Clinton campaign outnumber all others by 5/2. \\nHowever, it’s at this point that we go beyond even electoral irregularity and into suggestions of Hillary Clinton perverting the course of events at the Department of Justice (DoJ). Here, we segue neatly into ‘means’. The means to destroy Trump \\nWithout any shadow of doubt, the biggest bubbling-under scandal of the campaign (until complaints about Trump’s locker-room and sex abuse behaviour ‘surfaced’) was that involving emails sent by Hillary Clinton during her time as Secretary of State. \\nThe headline here is this: while heading up State, she only used her own personal and heavily abuse-protected server to send official emails – rather than official State Department email accounts maintained on federal servers. On leaving that job, the State Department hurriedly classified all the emails retrospectively. \\nThis suggestive of the fact that Ms Clinton has something to hide. Her behaviour was also highly irregular, and cannot solely be explained by national security concerns: if there are fears about how secure State is, then we may as well all pack up and go home. (There are as it happens; but their security is a hundred times more sophisticated than hers). \\nHillary maintains that her behaviour did not break federal rules, and there are precedents to show that. The hole in her defence is that there are no precedents for all the emails to have produced on her private server. \\nHaving seen the content of some 150 emails, the FBI began by being quite bullish on the subject of an investigation. But then suddenly it wasn’t. An anodyne report was eventually issued in July 2016, criticising her “extreme carelessness”. \\nHer behaviour does not support that finding. Over at the DoJ, Dan Metcalfe, head of the Justice Department’s Office of Information and Privacy (FOIA), said this gave her even tighter control over her emails by not involving a third party such as Google, and helped prevent their disclosure by Congressional subpoena. He added: “She managed successfully to insulate her official emails, categorically, from the FOIA, both during her tenure at State and long after her departure from it—perhaps forever”, making it “a blatant circumvention of the FOIA by someone who unquestionably knows better” . \\nBut neither State nor the DoJ did anything. The former issued a report making it clear that Secretary Clinton had lied to employees about the ‘permission’ she had, and confirmed that permission had never been sought. She also lied to the media about never sending classified material via her own server: a review of the 55,000-page email eventually released found “hundreds of potentially classified emails”. \\nThere is a clear – very clear – scenario that scopes out here: that of an ambitious wannabe US President conspiring to hide her guilt about stuff in perpetuity. Among the forty emails held back by US security agencies are those assumed to refer to the Benghazi Compound disaster, during which the Ambassador lost his life in the most bestial manner. \\nHowever, the FBI having been quietly told to pipe down, the job facing the Clintons now was to get the DoJ onside. Bill went right to the very top. \\nIn late June 2016, it was reported that Bill Clinton met privately with Attorney General Loretta Lynch on her private plane on the tarmac at Phoenix Sky Harbor International Airport. Three days later, a Justice Department official categorically told the media that Attorney General Lynch will accept “whatever recommendation career prosecutors and the F.B.I. director make about whether to bring charges related to Hillary Clinton’s personal email server”. \\nWashington sources confirm that Lynch “already pretty much knew what the FBI would say”. Did the Clintons have a strong motive? \\nNothing is ever conclusive in these areas. But the overwhelming suggestion from these events is that the Clintons most certainly do have the means to influence the activities and output of the Justice Department. \\nHowever, it’s easy to argue that Candidate Clinton had little to fear from Trump; the media almost universally dismissed him as a no-hoper. So why take the risk of, potentially, using the DoJ to put her adversary in a spot? \\nIt’s easy to argue that, but the US media have been wrong about Donald Trump since Day One. And the facts don’t support the argument. \\nLast night, the BBC released this trend map of the poll support for each candidate throughout the campaign: \\nOn this diagram, I have indicated in green ink the two points at which Clinton and Trump are neck and neck. In early to mid July – following embarrassing email revelations – Clinton’s support dips, and Trump briefly overtakes her. \\nFrom the word go, the Clinton campaign saw Trump’s financial background, practices and exposure as an obvious weakness. Having pressed hard for his tax returns, once his official election as the GOP presidential nominee was confirmed – June 19th 2016 – they began demanding to see his financials. \\nIn fact, they already knew of one unfortunate link: on March 20th, the Murdoch-owned Wall Street Journal had featured a piece showing Donald Trump’s massive dependence on Deutsche Bank as a credit supplier. The Murdoch press is campaigning solidly for Hillary, and Rupert himself has given substantial donations to her presidential bid. His motives towards her and Deutsche have been detailed by The Slog elsewhere . \\nThe dates here are key – particularly the dates from which Deutsche Bank ceases to be ‘troubled’ in the background, and increasingly becomes a foreground, front-page crisis . \\nIn early to mid June, Trump racks up his support and closes the gap with Clinton.Other financial papers pick up on the WSJ story….despite the fact that Trump’s cash flow and personal salary alone would be enough to pay off all the Deutsche loans. At this point, the International Monetary Fund releases a report saying that Deutsche Bank “appears to be the most important net contributor to systemic risks in the global banking system.” \\nThe IMF – and its boss Christine Lagarde – are prime movers in aiding Clintonian foreign policy relating to the EU and North Africa. But still Trump’s support leaps from 34-40%. Then early July, S&P Global Ratings lowers its outlook on Deutsche Bank to negative. At the same time, Deutsche Bank’s U.S. unit fails the U.S. Federal Reserve’s stress test. The story filters down into non-specialist media. Clinton consolidates her lead. \\nBut by this time, DB is starting to look like a basket case – which it has been for years – and the ‘ailing’ bank gets kicked out of the STOXX blue-chip Europe 50 index. \\nAnd yet, the Donald starts to recover momentum. By mid September, he’s back to almost neck and neck. It’s now that the DoJ Establishment goes for the throat.The Justice Department chooses this precise moment – September 16th – to splash with the news that Deutsche Bank faces a whopping $14.5 billion malpractice fine. Within hours, its shares go into freefall. \\nBetween September 20th and 28th, a broader media blitz and online campaign openly calls Trump “massively dependent on Deutsche loans”. Counterspin from the Deutsche camp claims negotiations to reduce the DoJ fine are well in hand. Two days later Justice splashes again: no, it alleges, they haven’t even started yet. \\nBut still, general awareness of the Trump-Deutsche link remains low….and Trump himself steadies his poll ratings. Locker rooms, pussy grabbing abuse allegations suddenly sprout via close Clinton ally David Farenthold. Donald’s poll ratings dive. \\nDonald Trump is just beginning to recover his position. Already pro-Democrat sites are switching tack to say that Trump “is a puppet candidate of foreign banks” – a silly allegation, given that he only works with one, and it’s more dependent on his business than vice versa. Meanwhile, the Department of Justice has Deutsche CEO John Cryan by the balls; as far as the Clintons are concerned, it holds all the cards. Opportunity \\nFor myself, I doubt very much that Hillary & Co will go any further down the ‘dodgy credit’ road. With only two weeks to go to Election day, an imminent Deutsche collapse would play into Trump’s allegedly wandering hands: it is, after all, the US unit that faces the fine, and Trump’s populism is anti Wall Street. \\nI think an equal (if not bigger) force behind pushing Deutsche Bank into the limelight is that of forcing it into a Middle East role where it can be a Rottweiller controlled by State, its old boss Hillary Clinton, and massive regional investor Rupert Murdoch. \\nBut while the opportunity was there, it’s obvious that Bill Clinton had all the influence his wife needs to help her get elected. Indeed, by being so unpopular in his own Party, Donald Trump has made this a much easier task: nobody but nobody in the US élite wants Trump in the White House. \\nAs I endeavoured to stress at the outset, the object in this post is not to prove a conspiracy, but rather to present an avalanche of evidence to support one simple – and widespread – observation about the Hillarybillies: as their power has increased, so too has their megalomania inflated to a frightening degree. \\nWhere once there were only crooked land deals and cigars to go on, today it is easy to argue that this creepy couple are operating at the kind of level where the American systems of Law, foreign policy, power separation and democracy itself are being perverted. This much has been obvious for some time; but American voters need to make their minds up by November 8th which they want least – Donald Trump in the White House, or Mr and Mrs Clinton doing the bidding of corporate globalism…while dragging the US further and further towards geopolitical confrontation. \\nLooked at in that way, while this has probably been the most superficial and childish Presidential contest in American history, it will probably also turn out to have been the most important.'"}, "time": 1742628395.0041957}