{"duration": 0.049118757247924805, "input_args": {"text": "'Google Pinterest Digg Linkedin Reddit Stumbleupon Print Delicious Pocket Tumblr \\nOn Sunday, President Barack Obama was on the campaign trail stumping for Hillary Clinton in Florida when he started brutally mocking Donald Trump upon learning that his campaign may have taken away his Twitter account in the final days leading up to the election. \\nThe president couldn’t help himself; he just had to go after the man who he characterized as being too immature to step into his job. \\n“Apparently his campaign has taken away his Twitter,” Obama said during a Florida rally for Hillary Clinton , to laughs. \\nThe president then used humor to make a point to remind everyone of just what was at stake in this election. “In the last two days, they had so little confidence in his self control, they said: ‘We’re just going to take away your Twitter.’ Now, if somebody cant handle a Twitter account, they can’t handle the nuclear code,” Obama continued. “If somebody starts tweeting at three in the morning because SNL made fun of you, then you can’t handle the nuclear codes.” \\nOn Sunday, the New York Times reported that Trump no longer controls his Twitter account. Instead, the Republican nominee appears to have aides creating “Trump safe” messages on his behalf while he focuses his energy on whining and lying at his live rallies. \\nDuring the rally in the battleground state of Florida, Obama labeled Trump as being “uniquely unqualified” and “temperamentally unfit” to serve as Commander-in-Chief. “I’ve been in this office now almost eight years and here’s what I can tell you,” Obama said. “Who you are, what you are, does not change when you take office. It just magnifies who you are. It just shines a spotlight on who are you.” Every day there’s another example of how much of a complete joke Trump’s campaign has been over the past year. But as much as we would love to laugh at this clown, we must first make sure he doesn’t get elected. Or else the joke’s on us. Featured image via (Photo by Drew Angerer/Getty Images) and (Photo by Olivier Douliery-Pool/Getty Images) Share this Article!'"}, "time": 1742564126.616478}