{"duration": 0.060894012451171875, "input_args": {"text": "'It’s a bittersweet wedding story a decade in the making: Nearly 10 years after Jeni Stepien’s father was killed, the man who received her father’s donated heart traveled from New Jersey to Pennsylvania to walk her down the aisle. “The murder and the wedding happened within a   radius” in the town of Swissvale, Pa. Ms. Stepien, an elementary schoolteacher, said in an interview on Monday, as she was about to board a plane for her honeymoon. “And I was just thinking, ‘My dad is here with us, and this man is here with us because of us.’ ” This story began in September 2006, when her father, Michael Stepien, was walking home from his job as head chef at a restaurant. Mr. Stepien, 53, was cutting through an alley when he was robbed at gunpoint by a    who shot him in the head at close range, she said. Leslie L. Brown was convicted of   murder in the killing and is serving 40 years to life in prison, according to news reports. As her father lay dying at a hospital, Ms. Stepien said, her family “decided to accept the inevitable” and donated his organs through an organization called the Center for Organ Recovery and Education. The organization allows donor families and the recipients to keep in touch with one another after the transplant. Mr. Stepien’s heart went to Arthur Thomas, a father of four who lives in Lawrenceville, N. J. and who Ms. Stepien said had been within days of dying. Given a diagnosis of ventricular tachycardia about 16 years before receiving the transplant, Mr. Thomas, 72, said in an interview on Monday that he was in congestive heart failure when word arrived that his doctors had found a heart. “In order to get to the top of the transplant list, you have to be really hurting,” Mr. Thomas said. “Once I had my transplant, I, of course, decided I would write a   to the family. ” From there, a relationship was forged through monthly phone calls, emails and letters. Ms. Stepien’s mother, Bernice, kept in touch with Mr. Thomas, even swapping cards on Christmas and flowers on birthdays. At times, they compared parenting tips. But the families had not thought about meeting in person until Jeni Stepien, 33, became engaged to Paul Maenner, a    engineer, in October. “One of my first thoughts in that following week was, ‘Who will walk me down the aisle?’ ” Ms. Stepien said. “I was thinking, ‘Oh, my gosh, it would be so incredible to have a physical piece of my father there.’ ” At her fiancé’s suggestion, Ms. Stepien wrote Mr. Thomas, whom the family calls Tom, asking him to walk her down the aisle. Mr. Thomas said yes, but only after running the proposition by his    daughter, Jackie, he said. “She said, ‘I think it’s a wonderful idea,’ ” Mr. Thomas said of his daughter, who also recommended that he start practicing walking down the aisle. (He said he practiced once before the wedding.) Mr. Thomas, a retired college adviser who formerly worked at a boarding school in Lawrenceville, warned Ms. Stepien that his emotions might get the best of him. Ms. Stepien said she felt the same, and told him, “I’ll be right there with you. ” The wedding took place on Saturday in the church in Swissvale where Ms. Stepien’s parents were married. Mr. Thomas and the bride formally met one day earlier, when he suggested she grip his wrist, where his pulse is strongest. “I thought that would be the best way for her to feel close to her dad,” Mr. Thomas said. “That’s her father’s heart beating. ” At the church, the bride was photographed touching Mr. Thomas’s chest. At the reception, they danced together, and guests mingled with Mr. Thomas and his wife, Nancy. The two families say they want to keep in touch and will plan a   somewhere down the road  —   maybe an event with a little less pressure. “I felt wonderful about bringing her dad’s heart to Pittsburgh,” Mr. Thomas said. “If I had to, I would’ve walked. ”'"}, "time": 1742564118.7413194}