{"duration": 0.11094045639038086, "input_args": {"text": "\"Eric ZUESSE | 19.11.2016 | OPINION Obama’s Zero Legacy «Trump did more than any democrat to deflate the neocon/neoliberal agenda that liberals themselves screamed was fascist when Bush was president». That was a brilliant and profoundly true reader-comment recently posted about Hillary Clinton supporters who are demonstrating against Trump’s winning the Presidency. Clinton-Obama Democrats who remain loyal to the Democratic Party in the wake of Trump’s victory are world-champion hypocrites, even if they’re too oblivious to know it. The Clinton-Obama political tradition of pro-megacorporate government, actually repudiates, instead of embodies, that of the Democratic Party’s earlier quintessential exemplar: the 1932-1980 FDR-dominated (Franklin Delano Roosevelt) era, the most progressive period in all of U.S. history. Though I voted both times for Barack Obama, he turned out to be one of the worst U.S. Presidents, if not the worst of them all — even if he was (as I thought each time) the best of the bad (in each election). His only real legacy as President turns out to have been disasters, including things far worse than his failed Obamacare, which increased the healthcare inflation-rate in our country, where healthcare already costs twice as much — and twice as high a percentage of GDP — as the international OECD average, but delivers inferior healthcare results. America is becoming internationally even less competitive in our healthcare system than before — which was already at the international bottom. It’s sucking the lifesblood out of the U.S. economy. But most of the real hell that Obama produced is in foreign countries: his bloody coup in Ukraine followed by civil war there, and the bloody catastrophe in Libya , and the bloody years-long attempt ( ever since Obama first came into office ) to overthrow the non-sectarian leader of Syria, Bashar al-Assad, and replace him with Al Nusra and other jihadists that the Obama-regime weaponized and the Saud regime financed and recruited hoping for them to replace Assad and produce a Sharia-law Syrian government. Al Qaeda in Syria — «Al Nusra» — were leading Obama’s ‘moderate rebels’ in Syria. The Administration kept this fact hidden from the American public until late in October when Hillary’s victory seemed assured and so Obama started to acknowledge publicly that he was actually backing all of the anti-Assad people there except ISIS. Thus, for example, on October 20 th , Russia’s Sputnik News quoted an interview two days earlier in which the American Russia-expert Stephen Cohen had remarked upon this sudden change: «If you pick up a paper today the narrative is completely different», the US academic stressed, «In Aleppo there are only rebels, there are no longer terrorists. You don't see the word 'terrorist' or 'jihadist' in the narrative any more. And alongside them, with rebels protecting them, there are children who are being killed by Russian and Syrian war planes». As the whole narrative has been re-written, Moscow and Damascus are now being portrayed as «war criminals» which are targeting civilians in Aleppo, he noted. Whereas previously, Obama behind-the-scenes had been protecting and arming the non-ISIS jihadists even while acknowledging that they existed, he was now starting publicly to acknowledge that the U.S. was actually supporting them. According to the US academic, the inconvenient truth is that the US and its allies in one way or another have abetted terrorists in Syria for many years. «The motive of the United States, the only mission that the US has in Syria, is removing [Syrian President] Assad from power», Cohen emphasized, adding that the most powerful force fighting against Damascus are jihadi terrorists. But after the election, because Trump will be Obama’s successor, Obama has finally decided that Al Qaeda and the other jihadist groups that it leads in Syria are no longer ‘moderates’, but instead are people to target and kill in Syria. Finally — after his having long refused to join Russia’s air-campaign to kill them there . I write this as a three-time voter for Barack Obama (both the primaries and the general election in 2008, and then again the general in 2012). I first became disappointed with Obama soon after his election in 2008 as President, when, on 25 November 2008 , he chose as the White House’s chief economic advisor the snobbish Republican-turned-Democrat Lawrence Summers, whose advice to President Bill Clinton in 1999 had encouraged him to terminate FDR’s Glass-Steagall separation of consumer-banking (checking and savings accounts) from investment-banking (Wall Street’s casinos) . That Clinton action had left the FDIC protections of savers on the hook to bail out the billionaire gamblers who found themselves without a musical-chairs seat when the music finally stopped and George W. Bush's MBS Ponzi real-estate economy came crashing down in 2007-2008. Clinton’s repeal of Glass-Steagall necessitated the Bush-Obama bailout of Wall Street — Main Street’s bailout of Wall Street. I recognized Obama to be a total fake ‘progressive’ because, the day before, on 24 November 2008, he had appointed yet another pro-repeal ‘Democrat’, Summers’s friend Timothy Geithner , who was the G.W. Bush era’s N.Y. Federal Reserve Bank President and thus king of Wall Street, to become U.S. Treasury Secretary, supposedly to help America recover from the crash that Geithner and Summers and Bill Clinton had in crucial ways created. (The other major way they did was their supporting total deregulation of derivative securities — turning derivatives into the financial system’s crack cocaine. Brilliant! Brilliantly evil .) And even before that, on November 18th, he had appointed Eric Holder to be Attorney General, signaling that the U.S. ‘Justice’ Department was to become headed by Wall Street’s Mr. Unaccountability, an infamous champion of keeping billionaires not only unconvicted and even uncharged but uninvestigated on any criminal law the billionaire might actually have committed — and thus out of prison. Even then — before he had so much as entered the White House — Obama showed that he wasn’t really interested in serving the public but in protecting the banksters, just like Bill Clinton and G.W. Bush had done before him. I kept voting for Obama because the alternative — originally Hillary Clinton, and then John McCain, in 2008, but now Romney in 2012 — was even worse. The system itself was rotten; it gave us only a choice only between bads (goods for the aristocracy but bads for the public) — this was by now clear. And here’s how bad President Obama actually was: On 27 March 2009, Obama secretly told the chieftains of Wall Street assembled at a private meeting inside the White House (from which these morsels leaked out), «My Administration is the only thing between you and the pitchforks», thus comparing these billionaires and agents of billionaires, with the martyred Blacks whom KKKers in previous decades had chased with pitchforks before lynching. But that’s not all of what Obama said to the banksters. This arrogant self-identifier with the aristocracy was very direct with them about his siding with them and their agents who had ripped off the entire world and enriched themselves thereby: «You guys have an acute public relations problem, and I want to help… I’m not out there to go after you. I’m protecting you». And that’s exactly what he then, in fact, did (he told the truth only to his masters, never to their victims the public): On 15 November 2011, TRAC Reports headlined that «Criminal Prosecutions for Financial Institution Fraud Continue to Fall» , to record lows under Obama, even below the pathetic level of George W. Bush. 2009 was a record low. 2010 was a new record low. So was 2011. TRAC Reports never issued a follow-up article on that, but on 21 October 2016, they headlined with their usual understatement, «White Collar Crime Prosecutions for August 2016» , and showed there that since 2003 each month’s white-collar-crime prosecutions had peaked in 2011, and now were at record lows in 2015 and 2016. This at least suggests that the category of white-collar crimes that consists of «financial institution fraud» had at least not risen from its all-time low posted in 2011. During Obama’s 24 January 2012 State of the Union address, he promised « to expand our investigations into the abusive lending and packaging of risky mortgages that led to the housing crisis. (Applause.) This new unit will hold accountable those who broke the law». He lied. Two years later , the Inspector General of the U.S. Department of Justice issued on 13 March 2014 its « Audit of the Department of Justice’s Efforts to Address Mortgage Fraud», and reported «We found mortgage fraud to be a low priority, or not [even] listed as a priority, for the FBI Field Offices we visited». No wonder that white-collar-crime prosecutions were subsequently at record lows. It’s not merely Hillary Clinton and her emails; it’s the entire aristocracy who stand above the nation’s laws, under Barack Obama’s Presidential Administration. Impunity hidden behind lies is what defines Obama’s Presidential legacy. But it’s zero in other ways, too. Obama’s most ambitious project was his three proposed mega-‘trade’ treaties — TPP, TTIP, and TISA — each of which was designed with a feature in it called «Investor State Dispute Resolution» or ISDS, which empowers international corporations to sue any signatory nation that will increase any regulation regarding the environment or product-safety or the rights of workers (employees) — no matter what the latest scientific findings on such a given subject might happen to indicate. The international corporation can sue for ‘loss of profits’ when any such regulation is made more stringent. Profits to stockholders are sovereign and protected above the citizenry, the electorate; the controlling stockholder in an international corporation is granted rights that are above the rights of any mere citizen — even if that controlling stockholder lives abroad, and even if the international corporation is a foreign corporation. ISDS grants only one-way rights to sue: corporations suing governments, no governments suing corporations. Taxpayers pay those fines. The suits are heard in no court of law in any nation but in international-corporate panels, each having three ‘arbitrators’ no judges and no juries and no democratic accountability to any electorate at all except to stockholders who elect the board of directors in their international corporation. Hillary Clinton favored it and would probably have passed some or all of these, essentially, fascist-world-government treaties, into law, but instead Donald Trump will be President. He is far less likely to move forward with Obama’s grand scheme. «Poverty Rose In 96% Of U.S. House Districts, During Obama’s Presidency» . What does Obama have to show for his 8 years in the White House? He served his masters well, even if not as well as he had been hoping. The income and wealth of the billionaires soared like at no time since 1923-1928. The «Share of income and wealth of bottom 90 % wealth holders» both declined. He served his masters well. But they weren’t the American public, and they certainly weren’t the publics in other nations, especially not in Syria, Libya, Ukraine, Honduras, and Haiti , in each of which nations Obama made things far worse, and turned them into hell. To call his legacy «zero» is actually unrealistic praise; his legacy is deeply negative . He’ll be rewarded handsomely for it, by his masters — which never were the American public.\""}, "time": 1742628462.7459683}