{"duration": 0.05993819236755371, "input_args": {"text": "'Donald J. Trump on Sunday renewed his call for the United States to consider profiling as a preventive tactic against terrorism in the aftermath of the mass shooting last week in Orlando, Fla. “I hate the concept of profiling, but we have to start using common sense,” Mr. Trump, the presumptive Republican presidential nominee, said in an interview on CBS’s “Face the Nation. ” Mr. Trump issued a similar call in December after the terrorist attack in San Bernardino, Calif. which left 14 people dead and more than 20 injured. On Sunday, he also sought to downplay any differences between his positions on gun control and those of the National Rifle Association. Last week, Mr. Trump wrote on Twitter that people on the government’s terrorist watch list should be barred from buying firearms, a stance that contradicts that of the N. R. A. But Mr. Trump seems to be backtracking, saying on ABC’s “This Week” that he “understands exactly” the N. R. A. ’s objections to restricting access to people on the watch list. “A lot of people are on the list that really maybe shouldn’t be on the list, and their rights are being taken away,” he said. The N. R. A. used the Sunday morning political shows to criticize, and even to mock, Democratic efforts to pass new gun control laws after the Orlando shooting. Wayne LaPierre, the group’s executive vice president, said on “Face the Nation” that legislation was effectively useless at preventing terrorist attacks. “These bad guys we’re facing, they don’t say: ‘Oh gosh, they passed a law. Oh gosh, I don’t think I could do it,’” Mr. LaPierre said. Democrats made their own push for expanded gun control  —   which the Senate is to take up Monday  —   and more broadly, for a   effort to take on opponents of stricter gun control. Senator Chris Murphy, Democrat of Connecticut, who led a   marathon of speeches on the Senate floor that ended early Thursday, said on ABC that “the only way that you win this issue is by building a political infrastructure around the country that rivals that of the gun lobby. ” Mr. Trump’s presumptive Democratic opponent, Hillary Clinton, expressed her support for the effort, writing “Stand strong @ChrisMurphyCT” on Twitter. Profiling has been an occasional theme of the Trump campaign. In addition to his most recent comments, Mr. Trump has discussed increased surveillance of Muslims and mosques, and has said that he would consider registering Muslims in a special database or requiring that they carry cards that identify them as Muslim.'"}, "time": 1742563314.1263955}