{"duration": 0.06334066390991211, "input_args": {"text": "'It is New York’s own version of hitchhiking: asking for a swipe of a stranger’s MetroCard. And just like the hitchhiker’s thumb, it has its own distinctive hand signal, which, if all goes well, results in a free subway ride. If all does not, it often leads to handcuffs. “The defendant moved his hand in a    motion, which, based on my training and experience, is typical of asking to be swiped into the subway system,” Officer Kentrevo Mills of a transit counterterrorism unit in the New York Police Department stated in an arrest affidavit for a man beseeching swipes in February in the station at Lexington Avenue and 125th Street. For years, the police have been arresting people for asking for swipes in front of the turnstiles. That changed last month, when the police decided to try a more lenient approach against   and other   rule breakers, at least in Manhattan. Now officers are supposed to issue a ticket or court summons rather than make an arrest. But new statistics and a review of court records show, for the first time, the lengths the police had previously gone to try to stamp out the practice of  . Even counterterrorism officers had arrested violators. Since 2013, the police have made more than 10, 000 arrests of people for asking for swipes and, therefore, impeding the flow of subway passengers, according to statistics from the police. There were 800 arrests this year alone, before the policy change. In explaining the more lenient approach last month to the rank and file, the Police Department’s internal order said the new policy was the result of a decision by the Manhattan district attorney’s office to no longer prosecute people arrested for minor infractions such as   smoking in the subway, or taking up two seats on a subway car. In a statement announcing the change, Cyrus R. Vance Jr. the Manhattan district attorney, cited a desire to free the police, prosecutors and courts from processing the most minor cases. “And by reducing unnecessary incarceration, we make our criminal justice system fairer for all New Yorkers,” he said in the statement. In interviews,   said they are more orderly than the police give them credit for. They are, after all, asking for admittance to the subway system, rather than hopping the turnstile, a misdemeanor. “They don’t want you to hop and they don’t want you to ask for a swipe,” James Green, 22, said as he begged for a swipe in the station at St. Nicholas Avenue and 125th Street this month. “What exactly are you supposed to do?” And with a single subway ride costing $2. 75, they see themselves not as scofflaws but as people who simply cannot afford public transportation. “Some people don’t have money on them,” Mr. Green said. “But they have places to get to. They might even have an emergency, you feel me?” “Once I have a job, I’ll never do this again,” William Rios, 50, said on a recent afternoon as he asked   for a swipe in the station at 42nd Street and Eighth Avenue. “I’ve been   since 10:30 a. m. and I got tired and now I want to go home,” he said. Mr. Rios said he had been arrested for   in the past  —   a common complaint among men interviewed as they stood outside the turnstiles beseeching exiting passengers with, “Can I get a swipe?” Some forlornly flicked their wrists others, with more gusto, shot their hands far forward, elbows fully extended and flicked an imaginary MetroCard through the world’s longest card reader. Some stood politely to the side of the turnstiles others blocked the way. Between trains, a few scoured the ground for discarded MetroCards. From the police’s perspective, asking for swipes violates two rules: one against begging and another against blocking “free movement” in a station. (The New York City Transit Authority says that, though it is deprived of a fare, it has no problem with people using unlimited MetroCards to swipe in strangers.) Enforcement of these rules is “integral to maintaining the civility for each of our millions of riders,” Joseph Fox, the chief of the Police Department’s Transit Bureau, said in a statement. “Riders have come to expect, as they rightly should, to travel without harassment, without interruption, and without being subject to overt acts of criminality and disorder. ” Police Commissioner William J. Bratton has long regarded the subway system as the front line in the city’s struggle with criminals. In the early 1990s, Mr. Bratton, then chief of the subway police force, began cracking down on turnstile jumping, with great success. Turnstile jumpers, the police discovered, were sometimes armed and often wanted on warrants for more serious crimes. It turned out to be a very effective way to arrest criminals and, in Mr. Bratton’s telling, was the start of a policing strategy that has succeeded in beating back crime for more than 20 years. When Mr. Bratton became commissioner in 2014, he vowed to rid the subways of all kinds of   rule breakers, from panhandlers to “acrobats,” as he called the subway dancers.   were put on notice. The police say that a full   of those arrested for asking for swipes are known as “transit recidivists. ” A review of arrests of dozens of   revealed a few names matching those of registered sex offenders. But some who have been arrested for   describe themselves as   New Yorkers with little more than a few hopped turnstiles in their past. “They consider this panhandling, but this is just people getting home,” Chaazaq Washington, 20, said this month after his court appearance for a February arrest for soliciting a swipe. “It’s so petty  —   just because you make a hand gesture or ask for a swipe, they say this is breaking the law. ”   now face a ticket with a fine of at least $25 and as much as $50, or a notice to appear in court in Lower Manhattan at a later date. “They are given a ticket because they can’t afford a swipe and now they have to get to a courthouse?” mused Stephen Pokart, a Legal Aid lawyer who has been defending the poor in court for 42 years. “Now they’ll have to ask for a swipe both ways. ”'"}, "time": 1742628497.2923222}