{"duration": 0.08341050148010254, "input_args": {"text": "'At least six members of the Super   New England Patriots have said they will not visit the White House for the traditional meeting that championship teams have with the president. Running back LeGarrette Blount, defensive end Chris Long and defensive tackle Alan Branch on Thursday became the latest to announce that they would skip the visit. Long posted on Twitter that he “planned on skipping” in response to a column in The Daily News that urged him to skip. Blount revealed his decision on Fox Sports in a radio interview on “The Rich Eisen Show” later in the afternoon. “I just don’t feel welcome in that house,” Blount said. “I’m going to just leave it at that. ” Branch told Sirius XM Radio that he planned to spend time with family. A day earlier, the Pro Bowl linebacker Dont’a Hightower bowed out when he told ESPN, “Been there, done that,” having visited with a championship Alabama team. Tight end Martellus Bennett told reporters after the Super Bowl that he would not go: “It is what it is,” he said. “People know how I feel about it. Just follow me on Twitter. ” The outspoken Bennett had joked that he might move to outer space after Donald J. Trump was elected. The Pro Bowl safety Devin McCourty, a team captain,  told Time magazine: “Basic reason for me is I don’t feel accepted in the White House. With the president having so many strong opinions and prejudices, I believe certain people might feel accepted there while others won’t. ” Bennett and McCourty were in the news for their activism last fall, when they raised their fists in protest during the national anthem for one game. At the time, athletes in various sports were protesting racial oppression in the country. The number of Patriots absences may well increase. Running back James White said he had not made up his mind whether to go. “I’ll wait till the time comes and decide then,” he said. No date has been scheduled for this year’s ceremony honoring the Patriots. The ceremony for last year’s champions, the Broncos, took place in June. Perhaps no other team has as close an association with Trump as the Patriots. Just before the election, Trump claimed that he had the support of Patriots quarterback Tom Brady and Coach Bill Belichick. Brady, who displayed a “Make America Great Again” cap in his locker during the campaign, never explicitly endorsed Trump, but he spoke favorably of him and they have socialized. Trump also cited a supportive letter he had received from Belichick, and several news media accounts confirmed the letter was authentic. The team’s owner, Robert K. Kraft, has said he has considered Trump a longtime friend. Brady did not attend his team’s visit with former President Barack Obama at the White House, in 2015, citing family issues. But some athletes who have skipped the trip over the years have explicitly given politics as a reason. Bruins goalie Tim Thomas declined to visit the Obama White House with his teammates in January 2012, saying in a statement: “I believe the federal government has grown out of control, threatening the rights, liberties and property of the people. “Because I believe this, today I exercised my right as a free citizen, and did not visit the White House. ” Baltimore Ravens center Matt Birk cited his opposition to abortion as the reason for skipping a 2013 visit. A number of other athletes have skipped the ceremony while citing scheduling conflicts or family commitments. Presidents for years have invited sports figures to the White House, but the tradition of honoring championships teams there solidified under Ronald Reagan. Major professional champions and many college champions stop by for a presentation and a photo opportunity. Six Patriots, so far, won’t make the trip this year.'"}, "time": 1742563918.745284}