{"duration": 0.03134298324584961, "input_args": {"text": "'Kathy Griffin’s Facebook page was inundated with calls for a boycott of her nationwide comedy tour after a photo of her holding a severed head of President Donald Trump went viral on Tuesday. [“Call rt 66 hotel boycott her show,” one user wrote in a Facebook message referencing Griffin’s July 22 scheduled performance at the Route 66 Casino Hotel in Albuquerque, NM.  “DO NOT SEE HER SHOW, BOYCOTT THIS ANIMAL! !” another user wrote. The furor aimed at the    comedian was sparked after images went viral of Griffin posing holding up a fake, bloodied decapitated head meant to resemble Trump. The photos were taken by Los   photographer and artist Tyler Shields, who tweeted a short video of Griffin holding Trump’s head. KATHY GRIFFIN: https:  .  via @YouTube,  —   Tyler Shields (@tylershields) May 30, 2017,  Griffin is currently on a   comedy tour. Her next stop, according to her website, is on June 16 at Grass Valley Veterans Memorial Center in Grass Valley, California. Social media users, outraged at Griffin’s photo, called for both the tour and My Life on the   star to be boycotted. “She should be boycotted anywhere she is performing. Give her a taste of her own medicine. Disgusting, vile person,” one user wrote. “Disgusting human being. Whoever would buy a ticket to your show has to be as pathetic as you. Your show should be boycotted. I hope your tour is a total flop,” another Facebook user wrote. “Boycott this total scumbag. Youre part of the swamp!” another wrote. The comedian responded to the uproar in a statement posted to her Twitter account Tuesday afternoon. “OBVIOUSLY, I do not condone ANY violence by my fans or others to anyone, ever! I’m merely mocking the Mocker in Chief,” she wrote.   This article has been updated to correct the location of the next stop on Griffin’s comedy tour.  Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742628584.8758316}