{"duration": 0.04752397537231445, "input_args": {"text": "'Financial Markets , Gold , Housing Market , U.S. Economy bond bubble , dollar collapse , economic collapse , stock bubble admin \\nPosted from St. Martin (the French side, of course!). I kind of expected this to happen, as close friends and colleagues can attest. Trump is not only NOT going “drain the swamp,” he’s populating it with a different breed of swamp monster. His choice for AG is a red-neck, right-wing senator from Alabama who, 80 years ago, would have been a member of the inner circle of the Third Reich. Ditto for the names that have been floated for Secretary of State. As for Treasury Secretary, the names floated for the position bear the unmistakable mark of the Wall Street beast: $6$6$6. They are every bit as vile, if not worse, than the thieves that moved through there the last 12 years. Jamie Dimon? Steve Mnuchin? Give me an F-ing break. \\nIt is what it is. Out with the old, in with new old. James Kunstler penned another epic post that deserves a thorough perusal: For all practical purposes, both traditional parties have blown themselves up. The Democratic Party morphed from the party of thinking people to the party of the thought police, and for that alone they deserve to be flushed down the soil pipe of history where the feckless Whigs went before them. The Republicans have floundered in their own Special Olympics of the Mind for decades, too, so it’s understandable that they have fallen hostage to such a rank outsider as Trump, so cavalier with the party’s dumb-ass shibboleths. It remains to be seen whether the party becomes a vengeful, hybrid monster with an orange head, or a bridge back to reality. I give the latter outcome a low percentage chance. \\nThe stock market continued a stunning move higher last week despite evidence of widespread financial market turmoil signaled by the bond and currency markets globally. With evidence mounting everyday that the U.S. economy continues to deteriorate, the behavior of the U.S. stock market can only be explained as being a product of the enormous pool of liquidity created by the Fed – printed money plus rampant credit availability – that piled into any and all stocks moving higher. This will ultimately turn into a momentum move in the other direction that will inflict serious damage on the system. – Excerpt from the latest Short Seller’s Journal'"}, "time": 1742563849.7905407}