{"duration": 0.11446881294250488, "input_args": {"text": "'3 States Approve Recreational Marijuana; Nationwide Is Next Nov 9, 2016 2 0 \\nAs we reported last night , three states have approved the legalization of marijuana for recreational use, which includes California, Nevada and Massachusetts. As of the morning of November 9th, Maine is reportedly close to also approving the legalization, with 91% of the votes counted and a “yes” vote currently being the favorite. \\nIn addition to the three and possibly four states legalizing recreational use of marijuana, three states have approved the legalization of medical marijuana, which includes Florida, Arkansas and North Dakota. Marijuana States of America \\nWith California, Massachusetts and Nevada and possibly Maine approving recreational marijuana, they join Colorado, Washington, Oregon and Alaska as states who have already approved the same laws. \\nWith this in mind, we now have 7 states having approved the full legalization of marijuana. What is now to stop the rest of the country? Most likely nothing. There is a saying that “as California goes, so goes the nation.” \\nCalifornia has led the way in marijuana laws for the past 20 years and this latest step is yet another sign that the nation is quickly heading in the same direction. Undoubtedly, this will be a big topic for many legislators in the days and weeks to come. With 7 states now approved for recreational use, the people have gained even more leverage in the push for a nationwide approval. \\nThe arguments for those against be facing a tough situation as it will soon be very well known that a full 7 states have approved this measure, with many others with medical approval. Times are quickly changing. \\nMany see this as a positive sign in the awakening of humanity for a couple different reasons. \\nFirst is that marijuana has been reported by millions to have helped them to “wake up” and see through different distractions and illusions that society has put forth, through education, media, the medical system and politics itself. To some, this is direct evidence that the Elite has lost control and that the global awakening of humanity is spreading even quicker now. \\nThe other reason is that this will now allow for an even greater push for the legalization of industrial hemp to be grown in all 50 states once again. As many know, hemp is an excellent resource which can be made into clothing, food, medicine, shelter and many other things, as well as create new jobs. \\nEven the Establishment sees the writing on the wall. In a recent interview with Bill Maher , President Obama said that passage of the legalization measures on Tuesday could make the current federal approach to the drug “untenable.” In other words, what has just happened has made nationwide legalization unstoppable. Spread the good news! \\nLance Schuttler graduated from the University of Iowa with a degree in Health Science-Health Coaching and offers health coaching services through his website Orgonlight Health. You can follow the Orgonlight Health Facebook page or visit the website for more information on how to receive health coaching for yourself, your friend or family member as well as view other inspiring articles.'"}, "time": 1742628349.664426}