{"duration": 0.09519410133361816, "input_args": {"text": "'OXON HILL, Md.  —   Stephen K. Bannon brought the battle plan. President Trump brought the fight. A day after his secretive chief strategist laid out a   new definition of conservatism animated by attacks on “the administrative state,” globalism and the “corporatist media,” Mr. Trump delivered a visceral gut punch of a speech that executed almost all of the tactics that define the   philosophy of the   West Wing. Speaking to the Conservative Political Action Conference on Friday, Mr. Trump launched what was easily the most blistering attack on the media and corporate elites of his already bellicose and eventful presidency. His speech also included a promise to throw undocumented immigrants “the hell out of the country” and a recitation of his    campaign promises. It represented a   friendly takeover of CPAC, an establishment Republican group whose leadership once viewed the party’s surprise   as a noisy interloper. Mr. Bannon, the former Breitbart chief executive who has a hand in nearly every scripted public Trump utterance, had expressed a similar sentiment at the conference the day before. “If you think they’re going to give you your country back without a fight, you are sadly mistaken,” he said during an appearance with Reince Priebus, the White House chief of staff. “Every day, it is going to be a fight. ” His onstage discussion, it turned out, was a   preview of Mr. Trump’s populist broadsides, with an admonition to anyone who continues to underestimate the determination of the Trump White House to disrupt the Washington establishment. Mr. Trump’s less restrained approach energized CPAC attendees who had once viewed the     as a   celebrity curiosity  —   they serenaded him with chants of “Trump” and “U. S. A. ” And his message is resonating with Republican voters, over 80 percent of whom approve of his job performance, despite historically low levels of support among all voters. But Mr. Trump is intensifying his assault on his enemies on the eve of his first national address before a joint session of Congress, a time when most new presidents are moving in the opposite direction, pivoting from martial campaign rhetoric to the more positive, inclusive language of governance needed to build the coalition necessary to pass major legislation. On an operational level, Mr. Trump’s inexperienced but confident White House staff members  —   dominated by Mr. Bannon  —   are leaning on Hill Republicans to draft tax overhaul measures and a replacement bill for the Affordable Care Act. In the meantime, they have focused on enacting a series of   executive orders, an approach often adopted by presidents at the end of their terms when their legislative leverage has been exhausted. As they did during the campaign, Mr. Trump and Mr. Bannon believe they are tapping into an American public less interested in the standard optimistic tropes of presidential politics and more interested in someone who speaks truth to their anxieties. Moreover, aides to Mr. Trump say he fares best when he’s able to target  —   and nickname  —   an opponent, whether it is “Little Marco” Rubio, “Crooked Hillary” Clinton or the “Fake News” media. Mr. Bannon, bookish and prone to surrounding himself with   young acolytes, previewed Mr. Trump’s   during the Thursday session. “They’re corporatist, globalist media that are adamantly opposed  —   adamantly opposed to an economic nationalist agenda like Donald Trump has,” he said. “I think if you look at the opposition party and how they portray the campaign, how they portrayed the transition and now they’re portraying the administration, it’s always wrong. ” The attacks on the news media come at a time when the press has been reporting on the Trump campaign’s apparent connections to Russia, the botched rollout of Mr. Trump’s executive order on immigration and the forced resignation of Michael T. Flynn, the national security adviser, after less than a month on the job. “They’re very smart, they’re very cunning and they’re very dishonest,” Mr. Trump said on a day when his press secretary scrapped his daily briefing for an     gaggle for selected reporters. The move, people familiar with the situation said, was enthusiastically backed by Mr. Bannon. The symbiotic political and personal relationship between the two men  —   the rumpled   and the compulsively public and   president  —   is driving much of the momentum and dysfunction of the White House, aides say. For all his talk of creating a blueprint for a Trumpian conservatism that outlasts the president’s career, Mr. Bannon is not regarded as a   manager, and he let slip during his CPAC appearance that things in the White House have gone well  —   but only “to the degree we were planning” them. There is not a lot of daylight between Mr. Trump and Mr. Bannon on the issues, although the president often jokes that Mr. Bannon’s economic populist agenda makes it hard to tell if the former Naval officer and Goldman Sachs executive is “  or ” according to a Trump associate friendly with both. The biggest difference between the president and his chief strategist is that Mr. Trump is far less constrained by the dictates of any single philosophy  —   even Mr. Bannon’s vision of Trumpism  —   than Mr. Bannon, who sees history as a succession of movements and power struggles. And while Mr. Bannon described the president as “maniacally focused” on fulfilling his campaign promises, Mr. Trump often loses focus, as he did during numerous digressions from his scripted remarks on Friday. He unleashed the latest in a succession of surprise rhetorical attacks on longstanding American allies, extemporizing about a friend named Jim who had told him to avoid the “City of Lights” because after several terrorist attacks, “Paris is no longer Paris. ” Clearly reveling in the adulation of a room that had once been hard to win, the president alternated between a theme of dark days  —   once again singling out violence on the streets of Chicago  —   and light comedy. Speaking of a meeting with business leaders this week that included food producers, he quipped, “I like Campbell’s soup. ” He also joked about his first appearance at this annual conservative conclave. “If you remember, it was my first major speech. They said he didn’t get a standing ovation  —   because everybody stood,” Mr. Trump said of the speech, in 2011. “I had very little notes and even less preparation,” he said. “And then you leave, and everybody is thrilled, and I say, ‘I like this business. ’”'"}, "time": 1742563976.5203595}