{"duration": 0.2914748191833496, "input_args": {"text": "\"Share on Facebook The people of the world should ask Western leaders and their allies: Why are you prolonging this war? Why do you continue funding and enabling the terrorists? Isn't five years of civil war enough? Is overthrowing the Syrian government really worth so much suffering and death? WASHINGTON — (Analysis) In late April, President Barack Obama announced that 250 U.S. special operations troops are being deployed to Syria. Unlike the Russian and Iranian forces aiding anti-terrorism efforts in the country, the U.S. military personnel have entered Syria against the wishes of the internationally recognized government. In terms of international law, the United States has invaded Syria, a sovereign country and United Nations member state. This is the not the first time, though — Arizona Sen. John Mccain crossed into Syria without a visa to meet with anti-government fighters in 2013. While the new U.S. boots on the ground have officially been dispatched for the purpose of fighting Daesh (an Arabic acronym for the organization known in the West as ISIS or ISIL), they will most likely be working to achieve one of the Pentagon's longstanding foreign policy goals: violently overthrowing the Syrian government. As the terrorism of Daesh and other extremists grows more intense, and as millions of Syrians have become refugees, the heavy costs of the U.S. government's “regime change” operation in Syria should come into question. Education, Health Care And National Rebirth The independent nationalist Syrian government, now being targeted by Western foreign policy, was born in the struggle against colonialism. It took decades of great sacrifice from the people of Syria to break the country free from foreign domination — first by the French empire and later from puppet leaders. For the last several decades, Syria has been a strong, self-reliant country in the oil-rich Middle East region. It has also been relatively peaceful. Since winning its independence, Syria's Baathist leadership has done a great deal to improve the living standards of the population. Between 1970 and 2009, the life expectancy in Syria increased by 17 years. During this time period infant mortality dropped dramatically from 132 deaths per 1,000 live births to only 17.9. According to an article published by the Avicenna Journal of Medicine , these notable changes in access to public health came as a result of the Syrian government's efforts to bring medical care to the country's rural areas. A 1987 country study of Syria , published by the U.S. Library of Congress, describes huge achievements in the field of education. During the 1980s, for the first time in Syria's history, the country achieved “full primary school enrollment of males” with 85 percent of females also enrolled in primary school. In 1981, 42 percent of Syria's adult population was illiterate. By 1991, illiteracy in Syria had been wiped out by a mass literacy campaign led by the government. The name of the main political party in Syria is the “Baath Arab Socialist Party.” The Arabic word “Baath” literally translates to “Rebirth” or “Resurrection.” In terms of living standards, the Baathist Party has lived up to its name, forging an entirely new country with an independent, tightly planned and regulated economy. The Library of Congress’ Country Study described the vast construction in Syria during the 1980s: “Massive expenditures for development of irrigation, electricity, water, road building projects, and the expansion of health services and education to rural areas contributed to prosperity.” Compared to Saudi-dominated Yemen, many parts of Africa, and other corners of the globe that have never established economic and political independence, the achievements of the Syrian Arab Republic look very attractive. Despite over half a century of investment from Shell Oil and other Western corporations, the CIA World Factbook reports that about 60 percent of Nigerians are literate, and access to housing and medical care is very limited. In U.S.-dominated Guatemala, roughly 18 percent of the population is illiterate, and poverty is rampant across the countryside, according to the CIA World Factbook . What the Western colonizers failed to achieve during centuries of domination, the independent Syrian government achieved rapidly with help from the Soviet Union and other anti-imperialist countries. The Soviet Union provided Syria with a $100 million loan to build the Tabqa dam on the Euphrates River , which was “considered to be the backbone of all economic and social development in Syria.” Nine-hundred Soviet technicians worked on the infrastructure project which brought electricity to many parts of the country. The dam also enabled irrigation throughout the Syrian countryside. More recently, China has set up many joint ventures with Syrian energy corporations. According to a report from the Jamestown Foundation , in 2007 China had already invested “hundreds of millions of dollars” in Syria in efforts to “modernize the country's aging oil and gas infrastructure.” These huge gains for the Syrian population should not be dismissed and written off, as Western commentators routinely do when repeating their narrative of “Assad the Dictator.” For people who have always had access to education and medical care, it is to trivialize such achievements. But for the millions of Syrians, especially in rural areas, who lived in extreme poverty just a few decades ago, things like access to running water, education, electricity, medical care, and university education represent a huge change for the better. Like almost every other regime in the crosshairs of U.S. foreign policy, Syria has a strong, domestically-controlled economy. Syria is not a “client state” like the Gulf state autocracies surrounding it, and it has often functioned in defiance of the U.S. and Israel. It is this, not altruistic concerns about human rights, that motivate Western attacks on the country. Syria Needs Reform, Not Terrorism In 2012, Syria ratified a new constitution in response to the protests during the Arab Spring. In compliance with the new constitution, Syria held a contested election in 2014 , with international observers from 14 countries. One thing that distinguishes Syria from Saudi Arabia, Qatar, Bahrain, and various other U.S.-aligned regimes throughout the region is religious freedom. In Syria, Sunnis, Christians, Alawites, Druze, Jews, and other religious groups are permitted to practice their religious faith freely. The government is secular, and respects the rights of the Sunni Muslim majority as well as religious minorities. In addition to religious freedom, Syria openly tolerates the existence of two strong Marxist-Leninist parties. The Syrian Communist Party and the Syrian Communist Party (Bakdash) openly operate as part of the anti-imperialist coalition supporting the Baath Arab Socialist Party. Communists lead trade unions and community organizations in Damascus and other parts of the country. Though Syrian President Bashar Assad is an Alawite, his wife, Asma, is Sunni like the majority of the country. Historically, the biggest opponents of the Syrian government have been supporters of the Muslim brotherhood, with a bloody episode taking place in 1982. Hoping to heal the longstanding tension, President Assad has made many gestures of solidarity toward the Sunni community in recent years. He has made a point of engaging in religious practices not commonly done by Alawites, such as praying in mosques and studying the Quran. Shortly after fighting began in 2011, the Syrian government granted autonomy to Kurdish regions and transferred political authority to leftist Kurdish nationalist organizations . Syria's political system is certainly in need of reform and modernization, and representatives of the Syrian government such as U.N. Ambassador Bashar Al-Jaafari readily admit this. However, the civil war which has raged across Syria for the last five years, is not about reform, democratization or modernization. The BBC published a “guide to Syrian rebels” in 2013. Among them are not only the infamous “Islamic State” organization, which now horrifies the world, but also the Nusra Front, previously known as Al-Qaida in Syria. Other organizations with names like the “Islamic Front,” the “Islamic Liberation Front,” and the “Ahfad al-Rasoul Brigades” are also listed. While Western media presents the Syrian civil war as a “battle for democracy” led by “revolutionaries,” the primary goal of almost every insurgent organization is creating a Sunni caliphate — one that does not actually suit Sunnis though, but rather a perverted politicized version of Sunnism created by Saudi Arabia to ideologically control that region. The unifying religious perspective of the Syrian “rebels” is the interpretation of Sunni Islam practiced and promoted by Saudi Arabia, known as Wahhabism. Foreign Fighters, Chemical Weapons And Child Soldiers A large number of the insurgents are not Syrian. Impoverished people from throughout the Middle East have been recruited to fight against the Syrian government. Facilities in Bahrain train recruits to kill , and send them to Syria. Terrorist training facilities exist in many other U.S.-aligned Gulf states. Foreign fighters from as far away as Malaysia and the Philippines have been found among the ranks of the foreign Wahhabi insurgents that are trying to depose the Syrian government. The flow of violent insurgents into Syria is not accidental. It has been directly facilitated by the U.S. and its allies. The CIA has spent billions of dollars on training camps in Jordan for anti-government fighters . The Israeli government has made a point of aiding the Wahhabi extremists by providing them medical care in the occupied Golan Heights . Israel has also made a point of targeting allies of the Syrian government with airstrikes . While Western media has highlighted allegations that the Syrian government has used chemical weapons, Carla Del Ponte from the United Nations confirmed that the foreign-backed insurgents have long been been using sarin nerve gas and other chemical weapons. As the insurgents make life unlivable in Syria, kidnapping for ransom, bombing schools and hospitals, beheading people, torturing people, they do it with thousands of child soldiers among their ranks. Impoverished children from across the Arab world have been recruited to work toward violently overthrowing the Syrian government, according to UNICEF . Between 50 and 72 percent of the population lives in areas controlled by the Syrian government . Meanwhile, even USAID confirmed that the turnout in Syria's 2014 elections was more than 70 percent . While the barrage of foreign fighters and extremists, aligned with a minority of the population and armed by Western powers and their allies, is committed to bringing down the Syrian government, the Syrian people clearly disagree. The fact that the Syrian government remains strongly intact after a five-year onslaught shows that the country is dedicated to preserving its independence. Time magazine and other mainstream media outlets have even been forced to admit that President Assad is unlikely to be deposed. How Can The War End? As foreign fighters have flowed into Syria, hundreds of thousands of people have died over the last five years, and Western media continues to blame the Syrian government for the conflict. However, the war would have been a very short one if not for the foreign support given to the extremists. As an independent country with a centrally planned economy, Syria has serves as an example to the world. It has proven that without neoliberalism and Western economic domination, it is possible to improve living conditions and develop independently. The Syrian government has made huge sacrifices to aid the Palestinian people and their resistance against Israel, and this has been a contributing factor to Syria's inclusion on the State Department's State Sponsors of Terrorism list . Syria has close economic relations with Russia and the Islamic Republic of Iran. The war in Syria is not a domestic conflict. This is a war imposed on Syria by Israel, the U.S., and other Western capitalist powers. The primary promoter of Wahhabi extremism around the world has been the Kingdom of Saudi Arabia, a U.S. client state. Turkey and Jordan, U.S.-aligned countries bordering Syria, keep their borders open so that weapons, supplies and money can continue to flow into the hands of Daesh and other anti-government terrorists. At least 470,000 people are dead , and millions of others have been forced to become refugees, but Western leaders and their allies do not end their campaign. The insane chorus of “Assad Must Go” has transformed a small, domestic episode of unrest into a full-scale humanitarian crisis. The war has nothing to do with the calls for democratic reform and the peaceful protests of 2011. As Daesh now threatens the entire world, the consequences of the Wall Street regime change operation, promoted with “human rights” propaganda, are becoming far more extreme. The Syrian government rallies a coalition of Christians, Communists, Islamic Revolutionaries, and other forces who are fighting to maintain stability and defeat Takfiri terrorism. (The term “Takfiri” refers to groups of Sunni Muslims who refer to other Muslims as apostates and seek to establish a caliphate by means of violence.) The only real peace plan for Syria is for the U.S., France, Britain, Saudi Arabia, Turkey, Jordan, and other powers to end their neoliberal crusade. The internationally recognized and recently re-elected Syrian government could easily defeat the insurgents if foreign meddling ceased. As U.S. media bemoans the humanitarian crisis, somehow blaming on the Syrian government and its president, and the U.S. directly sends its military forces into the country, the people of the world should ask Western leaders and their allies: Why are you prolonging this war? Why can't you just leave Syria alone? Why do you continue funding and enabling the terrorists? Isn't five years of civil war enough? Is overthrowing the Syrian government really worth so much suffering and death? Related:\""}, "time": 1742564610.233693}