{"duration": 0.23303771018981934, "input_args": {"text": "'A gunman who claimed allegiance to the Islamic State killed 49 people and wounded 53 more when he opened fire in a crowded gay nightclub in Orlando, Fla. early Sunday. It was the worst mass shooting in American history. President Obama was in Orlando on Thursday to meet with victims’ families. Here is the latest: • The gunman, Omar Mateen, 29, was killed in a shootout with the police. Mr. Mateen, an American citizen whose parents were from Afghanistan, claimed allegiance to the Islamic State in a 911 call he made at the time of the attack, law enforcement officials said. He lived in Fort Pierce, Fla. • On Tuesday, a senior F. B. I. official said investigators suspected the gunman’s second wife, Noor Zahi Salman, might have been aware that he was plotting an attack, and the agency was trying to determine her level of involvement. Ms. Salman, the mother of his young son, told the F. B. I. that she had driven him to the Pulse nightclub at some point before the attack and that she had also been with him when he bought ammunition. NBC, which reported the development, said Ms. Salman, 30, lives in Port St. Lucie, Fla. with Mr. Mateen’s father. The woman told officials she had tried to talk Mr. Mateen out of any attack, but whether she knew of his true plans was unclear. • Mr. Mateen was born in Queens, New York, according to public records. His   Sitora Yusufiy, said her marriage to Mr. Mateen had been abusive, and that he had at times displayed erratic behavior. “There were definitely moments when he’d express his intolerance toward homosexuals,” she said. The marriage ended in divorce. • Mr. Mateen was removed from his job as a security officer at the St. Lucie County Courthouse in Fort Pierce, in 2013 at the request of county sheriff’s officials who had grown concerned about his demeanor and his “inflammatory” comments. The sheriff then informed the authorities, prompting an investigation by the Federal Bureau of Investigation, the sheriff’s office said Tuesday. Mr. Mateen was transferred to a job as a security guard at a nearby residential golfing community, leading him to lodge a discrimination complaint, an official with the private security company that employed him said on Tuesday. The F. B. I. director, James Comey, said Monday that the gunman was on a terrorism watch list from 2013 to 2014, but that months of investigation into his foreign travels, his inflammatory remarks and his motives did not produce enough evidence to charge him. • The global security company G4S, based in Britain, said Mr. Mateen had worked for it as a guard since 2007. A   said he had repeatedly complained to the company that Mr. Mateen used racial, ethnic and sexist slurs, and talked about killing people. • The Bureau of Alcohol, Tobacco, Firearms and Explosives said Mr. Mateen had legally bought both weapons used in the attack, a handgun and a long gun, in Florida within the last week. • Mr. Mateen opened fire inside the Pulse nightclub in Orlando, a popular gay club, at about 2 a. m. He was armed with an  assault rifle similar to the   and a handgun. • Mr. Mateen shot about   of the people in the packed club. Hundreds of panicked clubgoers escaped and fled into the streets. • As more police officers rushed to the scene, Mr. Mateen retreated to a bathroom where he is believed to have held four to five hostages. About 15 to 20 people were in another restroom, frantically texting friends and family for help. • The police chief, John Mina, said that when police negotiators began to talk with Mr. Mateen, he appeared “cool and calm. ” The gunman made statements that led officers to think he was going to begin killing more people, the chief said, and he spoke of having explosives. Mr. Mateen was killed by a police SWAT team when it raided the building about 5 a. m. with an armored vehicle and stun grenades. One police officer was wounded, and at least 30 people were rescued. • President Obama said that the attack was a kind of “homegrown extremism” because it appeared the gunman had been inspired by extremist information he found on the internet, but that there was no clear evidence he was part of a wider terrorist plot. • The City of Orlando set up a special web page where it released the names of victims. The New York Times has compiled brief portraits of the victims. • A staggering 90 percent of the 49 victims were Hispanic or of Hispanic descent, including Mexican, Colombian and Dominican, community leaders said. Of those killed, 23 were Puerto Rican. • Medical officials said the victims had deep, gaping wounds from the rounds fired from the assault rifle and handgun. In some cases, the rounds bounced around inside their bodies, inflicting internal injuries. • More people were killed in Orlando than in any previous mass shooting in the United States. The 2007 shooting at Virginia Tech killed 32 people, while 26 people were killed in the 2012 shooting at Sandy Hook Elementary School in Newtown, Conn. • This is the second mass shooting in the United States linked to sympathizers of the Islamic State since December, when a married couple killed 14 people in a rampage in San Bernardino, Calif. The Orlando shooting was the worst terrorist attack on American soil since Sept. 11, 2001. • The Islamic State claimed responsibility for the massacre in a statement released over an encrypted phone app. The group said the attack “was carried out by an Islamic State fighter,” according to a transcript provided by the SITE Intelligence Group, which tracks jihadist propaganda. • The gunman made a series of Facebook posts, according to Senator Ron Johnson, the chairman of the Homeland Security and Governmental Affairs Committee, including one in which he raged against the “filthy ways of the west” and another that warned of more attacks by the Islamic State “in the next few days. ” He even searched for references to the massacre while he was carrying it out, the senator wrote in a letter to Mark Zuckerberg, Facebook’s chairman and chief executive. • Mr. Mateen’s father, Seddique Mir Mateen, posted a video on his Facebook page early on Monday in which he expressed regret and confusion about why his son had carried out the mass killing. “I don’t know what caused this,” said Mr. Mateen, speaking in Dari, a language spoken in Afghanistan. “I did not know and did not understand that he has anger in his heart. ” • At a news conference on Monday, A. Lee Bentley, the United States attorney for Central Florida, said the investigators had collected a large amount of electronic and criminal evidence and were trying to determine whether Mr. Mateen acted alone. The statement by the Islamic State did not provide details about its relationship with Mr. Mateen. • The F. B. I. director, Mr. Comey, said Monday that there was no evidence directly linking the gunman to an outside group, though he appeared to be    —   that is, he claimed allegiance to the Islamic State but had no direct tie  —   like the husband and wife team behind the attack in San Bernardino last year. • Investigators continued looking into whether Mr. Mateen’s wife knew what he had planned, but officials have deflected questions about possible criminal charges against her. They are also scouring his past movements and possible accomplices. • Mr. Mateen told the police by phone that he would strap explosives to four hostages and place them strategically in the corners of the building, Mayor Buddy Dyer said on Wednesday. But investigators have not found any evidence of explosives.'"}, "time": 1742562708.9855177}