{"duration": 0.0815732479095459, "input_args": {"text": "'An unnamed Obama administration official compared “f —  ing weird” David Brock in the Daily Beast to Mugatu. Quite unfairly, writer Asawin Suebsaeng did not give Will Ferrell the chance to respond to the calumnious comparison. [The Media Matters founder seeks to make his Shareblue site (please click on the link —  they could use the traffic) “the Breitbart of the Left. ” But as Breitbart News ranks as the 41st most read website in the United States and Shareblue comes in as the 19, 198th, the aspiration comes across more as a delusion —  the kind of thing someone who insists “I invented the   necktie” would say.  Several of Brock’s fellow Democratic operatives wish they could trade him back to the Right. “There’s no question that his groups were the least effective of 2016,” one tells the Daily Beast. “If anything they did harm. ” The gist of the piece centers on whether a guy not in total control of himself should hold any control over the Democratic Party. “I hope Hillary truly understands now how bat$#!+ crazy David Brock is,” Center for American Progress President Neera Tanden told John Podesta in an email exposed by WikiLeaks last summer. The Daily Caller reported in 2012 of a paranoid Brock hiring armed guards to protect him from potential assassins, with this supersecret service allegedly whisking him off a Washington, D. C. roof for fear of invisible Lee Harvey Oswalds lurking in nearby windowsills. In 2002, the Drudge Report alleged that Brock “suffered a breakdown last summer and was committed to the psychiatric ward of Sibley Hospital in Northwest Washington. ” A source, alleging delusions and paranoia, told Drudge, “He spent time in the ‘The Quiet Room,’ there was just a mattress on the floor, and he had some books. He was so tired and stressed. ” Whether Brock belongs in such a place, his boys irregular, a cross between Phil Donahue’s do and Grandma Walton’s coif, certainly does. Aside from the supposed delusions and paranoia, Brock harbors an obsession: Donald Trump. Hillary Clinton once served as the focus of his fixations. But in an act similar to what psychiatrists call “transference,” Brock shifted his monomania from Hillary to the Donald, only in doing so his emotions went from positive to negative (like Mugatu’s   dynamic with assistant Todd). Shareblue’s front page currently features nine articles. All nine focus on Donald Trump. A Breitbart of the Left might include sports, celebrity, and gamer stories. Shareblue reads as all Trump all the time. The Donald consumes Brock the way Derek consumes Mugatu. That’s probably why consumers avoid Shareblue the way they did Derelicte. One article wonders if administration language indicating that Trump “receives” and “participates” in his daily briefing really means he does not read it. “Now that he has taken office, it appears that Trump may even be eschewing the normal Presidential Daily Briefing (PDB) process, in favor of  ” Tommy Christopher writes. Another piece by Alison R. Parker covers a speech by the “demagogue” president “filled with his typical bluster and fearmongering” that announced the withholding of federal funds from sanctuary cities, a “tumultuous and troubling reality. ” Diana E. Anderson, in noting similarities between Bill O’Reilly and the president’s takes on violence in Chicago, concludes, “Fox News appears to have extraordinary power over the new president  —   and that should scare all of us. ” This is the “Breitbart of the Left”? Less Mugatu, more Milo.'"}, "time": 1742563615.5129182}