{"duration": 0.18817377090454102, "input_args": {"text": "'You Are Here: Home » Latest Posts » Anxiety and Worry Increase Risk of Heart Disease Anxiety and Worry Increase Risk of Heart Disease Prev post Next post \\nby Ana Sandoiu – MNT \\nAnxiety is a serious health concern affecting a large part of the American population. Now, new research indicates that health anxiety might increase the risk of heart disease. \\nHealth anxiety might increase the risk of heart disease, research finds. In the United States, anxiety disorders are the most common mental illness, affecting 40 million adults, or 18 percent of the population. \\nAnxiety is a known risk factor for heart disease . Previous research indicates a connection between depression and anxiety and the risk of coronary heart disease . \\nA meta-analysis found that anxious people have a 48 percent higher risk of dying from a heart problem. \\nHeart disease is the leading cause of death among Americans, according to the Centers for Disease Control and Prevention (CDC), killing 365,000 people in 2014. New research suggests that the consequences of health anxiety are also serious and the condition should be treated properly. \\nHealth anxiety describes a patient’s excessive worrying over having a serious illness, and seeking medical advice in the absence of a physical disease. \\nPatients with health anxiety misread physical symptoms as serious illnesses, and they often seek repeated medical help for the same issues. In its most intense form, health anxiety becomes hypochondria . Health anxiety and heart disease \\nResearchers led by Line Iden Berge, from the Helse Bergen hospital in Bergen, Norway, examined the link between health anxiety and heart disease. The results were published in the online journal BMJ Open . \\nBerge and team worked with participants in the Norwegian Hordaland Health Study (HUSK). This long-term study followed participants over a period of 12 years, and it was a collaboration between the National Health Screening Service, the University of Bergen, and local health services. \\nThe 7,052 participants were born between 1953-1957. For the study, they had to answer questions about their health, lifestyle, and educational achievement. \\nBetween 1997-1999, they underwent blood tests, weight, height, and blood pressure measurements. Participants were also asked to report their anxiety levels using the Whiteley Index. Scores above 90 percent were considered to be anxiety cases. \\nOver the entire study period, 234 participants, or 3.2 percent of the entire cohort, had an ischemic incident – either a heart attack or acute angina . Health anxiety raised heart disease risk by 73 percent \\nDuring follow-up, twice as many participants with health anxiety developed heart disease, compared with those who did not report any anxiety. Around 6.1 percent of health anxiety cases developed ischemic heart disease (IHD), compared with 3 percent of non-cases. \\nBecause participants had been enrolled in a nationwide research project monitoring heart disease, their heart health was monitored extensively. The national program, entitled “Cardiovascular diseases in Norway,” was carried out between 1994-2009, so the study could track participants using national hospital data and death certificates up to 2009. \\nAfter adjustments for established cardiovascular risk factors, researchers found a 73 percent increased risk of developing IHD among cases with health anxiety. \\nEven considering established risk factors for IHD, such as smoking, high cholesterol , and education, health anxiety was a high risk factor for IHD. The risk of IHD also increased proportionally with the level of reported anxiety; the stronger the symptoms of health anxiety, the higher the risk of IHD. \\nRegarding gender, a very slight increase in IHD risk was noticed in women with health anxiety over their male counterparts. Trust your heart \\nCaveats to the results of the study include the fact that this is an observational study, telling us little about the cause-and-effect relation between anxiety and IHD. \\nAlso, health anxiety is often associated with other mental health issues, such as general anxiety and depression, so the different types of anxiety and ways in which they increase the risk of heart disease can be difficult to differentiate. “[Our study] further indicates that characteristic behavior among persons with health anxiety, such as monitoring and frequent check-ups of symptoms, does not reduce the risk of [coronary heart disease] events,” the researchers write. \\nOn the contrary, keeping the body in a constant state of alert might further increase the risk of heart-related incidents. \\nThis puts both patients with anxiety and doctors in a difficult position. Telling an anxious patient that their anxiety is not a symptom of heart disease might help, but on the other hand, informing them that health anxiety might induce heart disease over time could cause them even more anxiety. 5 Herbs That Relieve Anxiety \\nNervousness, difficulty in sleeping, depression and fearfulness can be symptoms of an anxiety disorder. What was once your body’s natural response to warn you of perceived dangers and prepare your mind to deal with stressors is now interfering with your daily chores, work output and even your relationships with our family, friends and spouse. You […] Acid-Alkaline pH Balance & Your Health \\nToday we’ll discus the Acid-Alkaline pH balance and how it plays huge role in the overall health and wellness of the human body. Original article by Kris Carr – Kriscarr.com You may have heard about pH or the acid-alkaline balance in your wellness travels. I was oblivious to this concept when I began my health journey. But, […] Top 3 Genetically Modified Food Products \\nby Christina Snider – Staff Writer Just like humans, every organism is composed of genetic materials. If scientists step in and begin to modify the DNA, it is referred to as genetic modification. While genetic modification can enhance the quality and taste of foods, improve their resistance to disease and pests and increase the overall […] Estimated 75% of world’s population lactose intolerant \\nDid you know approximately 75% of earths population is lactose intolerant? Don’t agree with that statement? Reading this may change your mind. Humans are the only species on the planet that drinks milk from other species. And although the statistics vary from race to race and country to country, overall it remains consistent. Most everywhere, […] First Ever Human Trial Finds Magic Mushrooms Beat Severe Depression \\nby Ocean Malandra – Reset.me Get ready world, “magic” mushrooms which contain the psychoactive compound psilocybin, may soon become the standard go-to for reversing what the World Health Organization says is the number one cause of disability on the planet: depression. A brand new first of its kind study published in The Lancet reports that psilocybin […] How To Enhance Your Health With Juices And Juice Fasting \\nBy Ben Kim – www.drbenkim.com I’m often asked to name one thing that can be done right away to get healthier. With respect to food choices, the best suggestion I have is to begin drinking freshly pressed vegetable juices. Drinking just one freshly pressed juice each day is a reliable way of infusing your body with […] Achieving Alkalinity to Treat Illness and Disease: Changing Your pH Balance \\nby Christina Sarich – Natural Society All life on earth has an ideal and balanced pH level which best suits its perpetuation. Human beings are no different. As ocean pHs have dropped by just fractions from around 8.2 to 8.1 due to increased CO2 deposits, coral reefs have started to die off at an alarming rate. […] World’s oldest yoga teacher spills secrets of youth and healing \\nby Raw Michelle – Natural News Tao Porchon-Lynch can balance all of her weight on her forearms, lifting her entire body up and parallel to the floor without the need for support from her legs. She also engages in competitive dancing, cutting a rug with dancing partners half her age. The big deal? She’s 95! Clearly, Porchon-Lynch […] How to Avoid Fluoride in Water and Toothpaste \\nHere’s how to limit your exposure to fluoride and protect your children’s teeth. By Matt Hall — Staff Writer So what are health conscious people supposed to do? Is fluoride in the water we drink, bathing, and cook with simply an inescapable part of modern life? Fortunately, no. There are several steps we can take […] What’s for Breakfast? How About Some Monsanto Weed Killer? \\nby Jason Best – Takepart.com Just how much of Monsanto’s most popular weed killer are you eating every morning for breakfast? A study finds the world’s most widely used herbicide turning up in a bunch of morning favorites. In an unsettling report released Tuesday by the Alliance for Natural Health, the nonprofit advocacy group details the results of […] New Technology Capable of Better Detecting GMOs in Food \\nby Ethan Huff – Naturalnews.com European scientists have come up with a new technology that is allegedly better able to detect the presence of genetically-modified organisms (GMOs) in food, animal feed and seeds. As published in the open-access journal PLoS ONE, a new study out of Slovenia explains how the new technology, known as Droplet Digital […] Awesome Pallet House Built For $500 \\nby Editor – Off Grid World The Pallet House. Reclaimed pallets can be used for constructing shelters, cabins, and homes. Building a pallet house from reclaimed pallets is an inexpensive way to build your off grid home or cabin. Get out there, get some pallets, build something! PALLET HOUSE – MULTIFUNCTIONAL GARDEN SHED OR CABIN […] Man says raw food diet has made him ‘almost superhuman’ \\nby Antonia – Natural News For fruitarian and endurance athlete Michael Arnstein, his 15-mile commute to work isn’t by car, bus or train. Instead, he runs to the office, jogging through residential neighborhoods and eventually New York’s Central Park, pausing only to enjoy fruit along the way. Before his run, he may enjoy a breakfast of […] 3 Herbs to Boost Your Lungs \\nUse the herbs Elecampane, Coltsfoot, and Mullein to significantly boost your lung function and help ensure you are getting oxygen to every vital organ. by Michelle Schoffro Cook – Care2.com Our lungs work overtime for us every day, ensuring that we have sufficient oxygen to power every bodily function. With increasing levels of pollution in our […] Join For Free! Discover Little Known Health Secrets and Useful Tips For Healthy Living! First Name '"}, "time": 1742562752.378815}