{"duration": 0.21541738510131836, "input_args": {"text": "'Artwork by Anthony Freda, AnthonyFreda.com \\n\\nTrump claims that Clinton’s policy on Syria would lead to World War 3. \\nLet’s fact check … \\nThe Washington Post points out that a vote for Clinton is a vote for escalating military confrontation in Syria and elsewhere: \\nIn the rarefied world of the Washington foreign policy establishment, President Obama’s departure from the White House — and the possible return of a more conventional and hawkish Hillary Clinton — is being met with quiet relief. \\nThe Republicans and Democrats who make up the foreign policy elite are laying the groundwork for a more assertive American foreign policy, via a flurry of reports shaped by officials who are likely to play senior roles in a potential Clinton White House . \\n*** \\nThe studies, which reflect Clinton’s stated views, break most forcefully with Obama on Syria …. call[ing] for stepped-up military action to deter President Bashar al-Assad’s regime and Russian forces in \\xadSyria. \\n*** \\nMost of the studies propose limited American airstrikes with cruise missiles to punish Assad …. \\n*** \\nLast year, Obama dismissed calls for a no-fly zone in northwestern Syria — a position advocated by Clinton — as “ half-baked .” \\n*** \\nEven pinprick cruise-missile strikes designed to hobble the \\xadSyrian air force or punish Assad would risk a direct confrontation with Russian forces, which are scattered throughout the key \\xadSyrian military bases that would be targeted. \\n“You can’t pretend you can go to war against Assad and not go to war against the Russians,” said a senior administration official who is involved in Middle East policy and was granted anonymity to discuss internal White House deliberations. \\nThe most liberal presidential candidate still running – Green Party candidate Jill Stein – says: \"It should clear to everyone that a vote for Hillary Clinton is a vote for war.\" — @ajamubaraka Watch live: https://t.co/0B6NJLNY5j \\n— Dr. Jill Stein (@DrJillStein) October 13, 2016 Under Hillary Clinton, we could very quickly slide into nuclear war with her declared policy in Syria. I call for a #PeaceOffensive . \\nShe explains : \\nHillary Clinton wants to start an air war with Russia. Let’s be clear: That’s what a no-fly zone means. It is tantamount to a declaration of war against Russia. \\n*** \\nClearly the Democrats are incredibly embarrassed about the nature of these [email] revelations, and they’ve created a smokescreen here to try and distract from that. But that smokescreen is pushing us to the brink of warfare with Russia now, where you have the U.S. head of defense, Ashton Carter, talking about nuclear war. We just did a dry run dropping fake nuclear bombs over Nevada. This is really dangerous stuff; this is not pretend. So we need to take a deep breath here, we need to step back and stop beating the war drums. In this context, Hillary Clinton is talking about starting an air war with Russia. Which could slide—you know, we’re on the verge of nuclear war right now. \\n*** \\nThe most likely nuclear threat right now is with Russia. There’s no doubt about that. When you have Mikhail Gorbachev, who was the prime minister of the Soviet Union during the Cold War, saying that the threat of nuclear war is hotter now than it has ever been in all of history, you’ve got to take that pretty seriously. And when you have Hillary Clinton then beating the war drums against Russia, and essentially saying that if she’s elected that we will declare war on Russia—because that’s what a no-fly zone over Syria amounts to. Shooting down Russian warplanes. \\n*** \\nHillary Clinton is a disastrous nuclear threat right now in a context where we’re already off-the-charts in the risk of nuclear war. She has stated in this context that she’s essentially opening up a battlefront with Russia. So to my mind, this emerges as the clearest and most present danger. \\nProminent liberal economist Jeffrey Sachs writes in the Huffington Post, in an essay bannered “ Hillary Is the Candidate of the War Machine “: \\nIt is often believed that the Republicans are the neocons and the Democrats act as restraints on the warmongering. This is not correct. Both parties are divided between neocon hawks and cautious realists who don’t want the US in unending war. Hillary is a staunch neocon whose record of favoring American war adventures explains much of our current security danger. \\nJust as the last Clinton presidency set the stage for financial collapse, it also set the stage for unending war. On October 31, 1998 President Clinton signed the Iraq Liberation Act that made it official US policy to support “regime change” in Iraq. \\nIt should be the policy of the United States to support efforts to remove the regime headed by Saddam Hussein from power in Iraq and to promote the emergence of a democratic government to replace that regime. \\nThus were laid the foundations for the Iraq War in 2003. \\nOf course, by 2003, Hillary was a Senator and a staunch supporter of the Iraq War, which has cost the US trillions of dollars, thousands of lives, and done more to create ISIS and Middle East instability than any other single decision of modern foreign policy. In defending her vote, Hillary parroted the phony propaganda of the CIA: \\n“In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including Al Qaeda members… “ \\nAfter the Iraq Liberation Act came the 1999 Kosovo War, in which Bill Clinton called in NATO to bomb Belgrade, in the heart of Europe, and unleashing another decade of unrest in the Balkans. Hillary, traveling in Africa, called Bill: “I urged him to bomb,” she told reporter Lucinda Frank. \\nHillary’s record as Secretary of State is among the most militaristic, and disastrous, of modern US history . Some experience. Hilary was a staunch defender of the military-industrial-intelligence complex at every turn, helping to spread the Iraq mayhem over a swath of violence that now stretches from Mali to Afghanistan. Two disasters loom largest: Libya and Syria. \\nHillary has been much attacked for the deaths of US diplomats in Benghazi, but her tireless promotion of the overthrow Muammar Qaddafi by NATO bombing is the far graver disaster. Hillary strongly promoted NATO-led regime change in Libya, not only in violation of international law but counter to the most basic good judgment. After the NATO bombing, Libya descended into civil war while the paramilitaries and unsecured arms stashes in Libya quickly spread west across the African Sahel and east to Syria. The Libyan disaster has spawned war in Mali, fed weapons to Boko Haram in Nigeria, and fueled ISIS in Syria and Iraq. In the meantime, Hillary found it hilarious to declare of Qaddafi: “We came, we saw, he died.” \\nPerhaps the crowning disaster of this long list of disasters has been Hillary’s relentless promotion of CIA-led regime change in Syria. Once again Hillary bought into the CIA propaganda that regime change to remove Bashir al-Assad would be quick, costless, and surely successful. In August 2011, Hillary led the US into disaster with her declaration Assad must “get out of the way,” backed by secret CIA operations. \\nFive years later, no place on the planet is more ravaged by unending war, and no place poses a great threat to US security. More than 10 million Syrians are displaced, and the refugees are drowning in the Mediterranean or undermining the political stability of Greece, Turkey, and the European Union. Into the chaos created by the secret CIA-Saudi operations to overthrow Assad, ISIS has filled the vacuum, and has used Syria as the base for worldwide terrorist attacks. \\nThe list of her incompetence and warmongering goes on. Hillary’s support at every turn for NATO expansion, including even into Ukraine and Georgia against all common sense, was a trip wire that violated the post-Cold War settlement in Europe in 1991 and that led to Russia’s violent counter-reactions in both Georgia and Ukraine. As Senator in 2008, Hilary co-sponsored 2008-SR439 , to include Ukraine and Georgia in NATO. As Secretary of State, she then presided over the restart of the Cold War with Russia. \\nIt is hard to know the roots of this record of disaster. Is it chronically bad judgment? Is it her preternatural faith in the lying machine of the CIA? Is it a repeated attempt to show that as a Democrat she would be more hawkish than the Republicans? Is it to satisfy her hardline campaign financiers? Who knows? Maybe it’s all of the above. But whatever the reasons, hers is a record of disaster. Perhaps more than any other person, Hillary can lay claim to having stoked the violence that stretches from West Africa to Central Asia and that threatens US security . \\nJakob Augstein notes in Der Spiegel: \\nTrump would probably be the better choice in the question of war and peace than Clinton. \\nClinton has expressly expressed the wish to establish a flight ban on Syria, or parts of it. *** In truth, it would be an act of war. The risks are unpredictable. Above all, the risk of a military conflict with Russia. \\n*** \\nThe highest soldier of the United States of America, General Joseph Dunford, President of the United States General Staff of the United States Forces, is certain. To control the entire airspace over Syria would mean war with Syria and Russia. Dunford’s predecessor in office estimated a few years ago that an effective flight ban over Syria would involve the use of 70,000 soldiers and a monthly cost of $ 1 billion. \\nBut the bottom line is Clinton’s proven historical track record … she’s at least partly responsible for war after catastrophic war and coup after disastrous coup in Libya, Syria, Kosovo, Haiti, Honduras and other countries around the world. \\nAnd it’s interesting, indeed, that the Neocons who got us into the Iraq war have endorsed Clinton instead of Trump . \\nTrump might speak in a crude, knee-jerk manner … but Clinton is probably more likely to actually get us into war .'"}, "time": 1742563133.528651}