{"duration": 0.05660843849182129, "input_args": {"text": "'NBC News made a “fundamental mistake” when its network executives thought Megyn Kelly was a “super star,” according to a television executive CNN interviewed.  Kelly, the former Fox News talent, has come under fire for her interview with Alex Jones, which is set to air on this Sunday on her Sunday Night with Megyn Kelly show. “They’ve made a fundamental mistake about Megyn which is they think she’s a super star,” the television executive reportedly told CNN. “What she is is a cable star, and that is a very different solar system. ” While promoting her show, Kelly told numerous outlets that she felt like she was born to be a mainstream media star. In a leaked recording that was released this week, Kelly even tells Alex Jones, “I’m a combination of Mike Wallace, Oprah Winfrey and Larry the Cable Guy. ” Kelly was resoundingly mocked after Jones released the audio. Mainstream media reporters and the families of the Sandy Hook victims also lambasted Kelly for telling Jones in the leaked audio, “It’s not gonna be some gotcha hit piece, I promise you that. ” CNN boss Jeff Zucker said that Kelly’s interview will only work if she is “holding up a picture of the dead kids at Sandy Hook and saying, ‘How dare you? ’” But as the New York Times observed, “NBC has not released a transcript of Ms. Kelly’s interview, leading some to speculate that her interrogation of Mr. Jones over his more contentious views  —   for instance, that Sandy Hook was a hoax and the Sept. 11 terrorist attacks were carried out by the United States government  —   was less than ferocious. ” As CNN pointed out, the first month of Kelly’s show has shown that wanting to be [Barbara] Walters, [Diane] Sawyer or [Oprah] Winfrey does not necessarily make it so. Establishing that reputation takes years. And in Kelly’s case, it requires a transformation from her former role as a cable news host in the center of the political fray into someone more trusted by the general public. ” “Had a trusted broadcast talent like Diane Sawyer or Lester Holt interviewed Jones, audiences may have given them greater benefit of the doubt,” CNN noted. “Critics of Kelly’s interview might have waited to see a Sawyer or Holt interview air before casting judgment based on a brief promo. ” After her supposedly “ ” interview with Russian President Vladimir Putin, Kelly did not receive stellar reviews even from her new mainstream media peers. Her interview with Erin Andrews for her second show did not draw rave reviews either. And despite NBC ginning up the hype machine in overdrive, Kelly’s ratings have tanked. Her debut show could not even beat out a rerun of 60 Minutes. Her second show lost to another rerun of 60 Minutes and could not even beat out a rerun of America’s Funniest Home Videos.  According to reports, NBC executives are realizing already that “people are not tuning in to watch Megyn. ” NBC executives are reportedly “freaking out” over the “ratings disaster” that Kelly has turned out to be, questioning the network’s $15 million investment in Kelly.'"}, "time": 1742564524.0848484}