{"duration": 0.047518253326416016, "input_args": {"text": "'In Italia la terra trema ancora, premier Renzi segue la situazione © REUTERS/ Emiliano Grillotti URL abbreviato 1 12 0 0 Il premier Matteo Renzi ha contattato il capo della Protezione Civile Fabrizio Curcio a seguito della forte scossa che è stata registrata nella parte centrale del Paese, riporta l\\'agenzia Askanews. \\nUn terremoto di magnitudo 5,4 si è verificato alle 19.11. L\\'epicentro del sisma è stato registrato ad una profondità di 9 km tra le città di Perugia e Macerata. Le scosse sono state sentite dagli abitanti di diverse regioni: Lazio, Marche e Abruzzo. \\nI sindaci delle città italiane nelle vicinanze dell\\'epicentro parlano di alcuni danni. ... © 2016 Sputnik. Tutti i diritti riservati Registrazione Cliccando su “Registra” si conferma il consenso al trattamento dei dati personali e l’accettazione delle nostre norme sull’Utilizzo dei dati personali. Registra Per favore inserisci il codice Ripristina Chiudere Regolamento \\nLa registrazione e l\\'autorizzazione degli utenti dei siti Sputnik tramite la creazione di propri account o mediante gli account dei social network presuppone l\\'accettazione delle seguenti regole: \\nGli utenti sono tenuti a comportarsi nel rispetto delle normative nazionali e internazionali vigenti, rispettando gli altri partecipanti alla discussione, i lettori e le persone menzionate nei loro post. \\nL\\'amministrazione del sito ha diritto a cancellare i commenti scritti in una lingua che non sia quella della maggior parte dei contenuti del sito stesso. \\nIn tutte le versioni dei siti sputniknews.com i commenti scritti possono essere modificati. \\nUn commento di un utente può essere cancellato nei seguenti casi: Non corrisponde al tema del post. Incita all\\'odio ed alla discriminazione razziale, etnica, religiosa, sessuale o sociale e viola I diritti delle minoranze. Viola i diritti dei minori, arrecando a questi ultimi danni di varia natura, compresi danni morali. Contiene idee di natura estremista o incita al compimento di attività illegali. Contiene insulti, minacce ad altri utenti, organizzazioni o individui, denigra la dignità o mina la reputazione commerciale. Contiene insulti o messaggi oltraggiosi nei confronti di Sputnik . Viola la privacy, rivela dati personali o dati di terzi senza il loro consenso o viola la segretezza di una corrispondenza. Descrive o fa riferimento a scene di violenza e crudeltà nei confronti di animali. Contiene informazioni su metodi di suicidio o incita a commettere il suicidio. Persegue obiettivi commerciali, contiene pubblicità occulta, propaganda politica fuorilegge o link a risorse online recanti tali informazioni. Promuove prodotti o servizi di terze parti senza autorizzazione. Contiene espressioni offensive o volgari e/o elementi lessicali che possono essere definiti come tali. Contiene spam, pubblicizza spam, forme di phishing, truffe commerciali e mailing list illegali. Promuove l\\'uso di stupefacenti e sostanze psicotrope, fornisce informazioni sulla loro produzione e utilizzo. Contiene links a virus e malware. E\\' parte di azioni volte a produrre un grande volume di commenti recanti contenuto simile o identico, \"flash mob\". Riempie la discussione di messaggi fuori tema o irrilevanti. Viola l\\'etichetta o asseconda comportamenti aggressivi, provocatori o volti ad umiliare gli altri interlocutori \"trolling\". Non segue le norme linguistiche, ad esempio è scritto interamente in maiuscolo oppure non è suddiviso in frasi di senso compiuto. \\nL\\'amministrazione del sito ha il diritto di bloccare l\\'accesso alla pagina ad un utente, oppure bloccare l\\'account di quest\\'ultimo qualora i suoi commenti violino le suddette norme, oppure rechino un contenuto giudicato assimilabile ad una violazione delle stesse. \\nL\\'utente può inoltrare richiesta di ripristino o sblocco del proprio account scrivendo a . \\nIl messaggio deve contenere i seguenti parametri: Oggetto del messaggio: Ripristino dell\\'account/sblocco dell\\'accesso Nome Utente Spiegazione delle azioni che hanno violato le suddette regole ed hanno portato al blocco dell\\'account. \\nQualora i moderatori ritengano sia possibile ripristinare l\\'account o sbloccare l\\'accesso, questo verrà eseguito. \\nIn caso di ripetute violazioni delle suddette regole l\\'account dell\\'utente verrà bloccato per la seconda volta, senza possibilità di venire ripristinato. \\nPer contattare i moderatori scrivere a . Log in '"}, "time": 1742628553.9058442}