{"duration": 0.06592512130737305, "input_args": {"text": "'Herbal tea can help with indigestion and insomnia \\nSaturday, October 29, 2016 by: David Gutierrez, staff writer Tags: herbal tea , sleep , digestion (NaturalNews) Drinking herbal tea is one of the easiest ways to treat a variety of common health complaints, including indigestion and insomnia. By learning the uses of a handful of medicinal herbs , you can take charge of your health and improve your quality of life.Since they are so easy to prepare and use, herbal teas are among the keystones of natural medicine .\"We use a lot of teas to help deliver the health benefits of the herbs,\" says Stephanie Caley of the National Institute of Medical Herbalists (NIMH).While you can purchase premade tea bags for many of the herbs below, you can also make them yourself.\"Once you find herbs you like that work for you, it\\'s nice to make your own blends from fresh or dried herbs,\" says nutritionist Amanda Hamilton.\"You\\'ll get multiple benefits from the different herbs as well as creating lovely flavours.\" Teas for digestion Everyone gets indigestion sometimes, so it can be helpful to have a handful of herbal remedies on hand to provide fast relief. According to Caley, her favorite herbs for gut upsets include chamomile, cardamom, ginger and peppermint.Chamomile functions as both an anti-spasmodic (relaxing the gut) and anti-inflammatory, thus providing broad-spectrum digestive relief. Ginger is particularly good for nausea, a benefit that has been proven in scientific studies. Peppermint is also an antispasmodic, and is so effective that it is sometimes prescribed by doctors as a treatment for irritable bowel syndrome. Cardamom pods should be crushed before steeping, for relief of indigestion and flatulence.Another digestion-promoting herbal tea , not mentioned by Caley, is rooibos. Rooibos calms the digestive system, perhaps due to its high content of the anti-inflammatory quercetin. Ease your mind, improve your sleep Another common complaint is trouble sleeping, which in severe cases may qualify as clinical insomnia. Yet many people who suffer from insomnia do not want to turn to potent and dangerous pharmaceutical drugs. For these people, Caley recommends chamomile, Valerian root, skullcap and lime flowers.Just as chamomile relaxes the gut, it has a tendency to relax the entire body and the mind as well. Caley particularly recommends it as a bedtime drink for \"anxious people,\" as well as for children, who tend to like its mildly sweet flavor. She recommends skullcap for people who tend to be kept awake by \"a mind that\\'s racing.\"Use of Valerian root as a sleep promoter has a long history in herbal medicine, and the practice now has some scientific backing as well. A 2002 meta-analysis of 18 studies found that Valerian root is an effective sleep promoter (hypnotic), with few side effects. It is now sold over-the-counter in Norway as a sleep aid.Less well known are lime flowers, which Caley describes as \"very calming.\" She notes that some of the volatile oils in lime flowers are believed to bind to the same receptors in the brain as pharmaceutical tranquilizers in the benzodiazepine family.Another remedy, not mentioned by Caley, is the popular beer ingredient hops. Hops is known to promote sleep and to ease stress and anxiety. Other medicinal benefits of hops include easing indigestion, headaches and fever.Another herb that can reduce stress and promote sleep if taken at bedtime is Withanian somnifera , also known as ashwagandha or winter cherry.Other natural ways to relieve insomnia include getting more exercise, improving your diet and avoiding looking at screens too close to bedtime.Of course, herbal teas can do more for you than just improving your digestion and sleep. Herbs such as nettle and ginseng can boost your energy levels without caffeine, while chamomile, peppermint, lavender, rose petals and lemon balm can all help balance your mood and relieve stress, anxiety and depression. Sources for this article include:'"}, "time": 1742563578.7601492}