{"duration": 0.04769468307495117, "input_args": {"text": "'Philippines President Rodrigo Duterte joked in an address to soldiers this weekend that he would protect them if they raped up to three women —  but not four —  a remark that has aroused the ire of feminist groups and recalled a major controversy during his presidential campaign. [The Philippine Star reports that Duterte made the joke while addressing the 2nd Mechanized Infantry Brigade on Friday, who would soon deploy into the increasingly deadly war zone in Marawi, Mindanao, where Duterte has imposed martial law. The jihadist Maute group invaded the city last week in response to a police raid on the hideout of Isnilon Hapilon, the head of Islamic State affiliate Abu Sayyaf. The Maute group has also pledged allegiance to the Islamic State, and its members appear to be cooperating with Abu Sayyaf.  “For this martial law, and the consequences of martial law, and the ramifications of martial law, I and I alone would be responsible,” Duterte told the soldiers, adding in Filipino, “Just work, I’ll take care of it. I will be the one to imprison you. If you have committed rape three times, I’ll take responsibility for it. If you marry four, son of a bitch, you’ll get beaten up. ” “Fight back.   …     I’ll give you everything you need,” he told the soldiers. Duterte previously told his army to “spare no one” in Marawi and has allowed warrantless searches and arrests on all of Mindanao, the southern island Duterte calls home. His spokesman, Ernesto Abella, explained the rape joke as an attempt to use “heightened bravado” to energize the troops. Duterte, he said, was “decisively acting, speaking with heightened bravado, that law and order would be brought back in these areas of rebellion. ” The joke has received wide condemnation from both relevant political entities and Twitter celebrities like Chelsea Clinton. Within the Philippines, politicians in the Duterte government have rejected it. “It is an injustice to our soldiers that what’s being implied is because it is martial law, they are already thinking, or that they have the license, to commit a crime as heinous as rape,” Vice President Leni Robredo said. “Duterte’s   comments only confirm some of the worst fears of human rights activists that the Duterte government will not just turn a blind eye to possible military abuses in Mindanao, but may actively encourage them,” Human Rights Watch’s Phelim Kine said in a statement. This is not the first time Duterte has come under fire for a joke about rape. During his presidential campaign last year, Duterte remarked that it was a “waste” that an Australian woman had been gang raped in his native Davao City, lamenting that he “should have been first” to have sex with her because he was the mayor at the time. Duterte refused to apologize and threatened to cut diplomatic ties with the United States if the government condemned the joke. He handily won the presidency and took over as head of state in June 2016. The Islamist insurgency in Marawi is the greatest challenge Duterte has faced as president so far. He responded to the raid of the city  —   in which jihadists have so far abducted priests, killed Christians and Muslim “traitors” who could not recite Islamic prayers, freed more than 100 jihadists from a local prison, and flown the Islamic State flag over the city’s mosques. “If I think that you should die, you will die. If you fight us, you will die. If there is an open defiance, you will die,” Duterte promised the terrorists last week. While Mindanao is home to a substantial Muslim population, the Philippines is an 86 percent Catholic country, with another six percent of citizens identifying as Christian  . Only about five percent of the country identifies as Muslim. Follow Frances Martel on Facebook and Twitter.'"}, "time": 1742564160.1668353}