{"duration": 0.09577631950378418, "input_args": {"text": "'We Are Change \\nA man posing as a construction worker destroyed Donald Trump’s star on the Hollywood Walk of Fame with a pickaxe and a sledgehammer early Wednesday morning, as bystanders stopped and watched.\\nThe vandalism was captured on video shortly before 6 a.m. The star, Trump’s name, and the camera icon sitting in the center were all destroyed. The cost of the damage is estimated to be around $2,500. \\nThe vandal identified himself as “Jamie Otis,” to Deadline Hollywood, and explained that he was planning to “extract the star to auction it off and raise funds” for the women who have accused Trump of being sexually inappropriate. He chatted casually with a person who filmed the incident on his cellphone. \\nBy the time that police arrived, the man had already left. He is described as a white male, and left behind the pick, sledgehammer, a construction hat, and vest, USA Today reports. \\n“We’re reviewing surveillance footage from local businesses and when the case is completed, it will be submitted to the district attorney for filing of a felony vandalism charge,” Officer Norma Eisenman told USA Today. \\nThe star was dedicated in 2007, and sat at 6801 Hollywood Blvd. by the Dolby Theatre — across the street from the busy Hollywood & Highland shopping and entertainment center. The Hollywood Chamber of Commerce has said in a statement that Trump’s star will be replaced immediately, and work has already began on it — though it will have to sit for a couple of days before it can be polished. \\n“When people are unhappy with one of our honorees, we would hope that they would project their anger in more positive ways than to vandalize a California state landmark,” Hollywood Chamber of Commerce president and CEO Leron Gubler said. “Our democracy is based on respect for the law. People can make a difference by voting and not destroying public property.” \\nGubler added that they intend to prosecute the vandal to the fullest extent of the law when he is located. \\nThe star has been a target of vandalism throughout the election season, by people repeatedly spray painting it — and even defecating on it. \\nIn February, the star was defaced with a large black swastika. \\nSomeone painted a swastika over Donald Trump\\'s Hollywood Walk of Fame star https://t.co/FvSKy7CuyY pic.twitter.com/k1Mw5irqcs \\n— Washington Examiner (@dcexaminer) February 1, 2016 \\n\\nIn May, someone spray painted a large mute sign over it. \\nDonald Trump’s Hollywood Walk of #Fame star was just enhanced with a muted #sign painted by Norwegian #artist Pøbel. pic.twitter.com/kBqQeJic5l \\n— All Public Art (@allpublicart) May 9, 2016 \\n\\nIt has disgustingly been covered in both human and animal bodily waste. \\nDonald Trump\\'s star on Hollywood walk of fame … covered in dog poop https://t.co/xDRH6Wea45 pic.twitter.com/lOB8gV2GjB \\n— NTXProgressive (@NTXProgressive) April 5, 2016 \\nI spit on Trump\\'s walk of fame star pic.twitter.com/BJ66IiGbQt \\n— Anna Švercl Hetzer (@anna_hetzer) March 13, 2016 \\nI didn\\'t even know Trump had a star on the Walk of Fame, but we discovered it this weekend… covered in urine. pic.twitter.com/bTTu0FvXuj \\n— Ken Peters (@brand_BIG) March 22, 2016 \\n\\n\\nIn June, it was vandalized again. \\nFolks wrote on Trump\\'s star. I\\'m tripping. I\\'m not sure if y\\'all can see that but it says \"F Donald Trump\" pic.twitter.com/bgcb0ox92Z \\n— Juice Welch (@GrapeJuiceMe) June 7, 2016 \\nA picture I took of Donald Trump\\'s star on the Walk of Fame in LA a few months ago pic.twitter.com/FnuKhRY7n4 \\n— Khalid (@WorldOfK_) March 10, 2016 \\n\\nIn July, a protester and street artist who goes by the name “Plastic Jesus” built a tiny wall out of concrete around the star. The wall was complete with barbed wire and “keep out” signs. \\n“Hollywood sight-seers on the famous walk of fame were confronted with an unusual edition to Trump’s Famous Star. Someone had built a 6? tall grey concrete wall around it. Complete with ‘Keep out’ signs and topped with razor wire. The unofficial addition to the iconic star appeared early Tuesday afternoon, to the amusement of onlookers,” Plastic Jesus wrote of the wall on Instagram. \\nStreet artist Plastic Jesus surrounds Donald Trump\\'s star on Hollywood\\'s Walk of Fame with a tiny barbed wire wall pic.twitter.com/nhk64pRCck \\n— BBC Newsbeat (@BBCNewsbeat) July 21, 2016 \\n\\nAnyone with information about Wednesday’s vandal is asked to call the Los Angeles Police Department at (213)972-2971. \\nThe post VIDEO: Trump’s Hollywood Star Smashed by Lunatic with Sledgehammer appeared first on We Are Change .\\n'"}, "time": 1742564081.700554}