{"duration": 0.07961273193359375, "input_args": {"text": "'Security Council Meeting of October 28th, 2016\\nConcept paper by the Russian presidency Voltaire Network | New York (USA) | 27 October 2016 français Español русский عربي 中文 Cooperation between the United Nations and regional and subregional organizations in the maintenance of international peace and security: Collective Security Treaty Organization, Shanghai Cooperation Organization and Commonwealth of Independent States As a centrepiece of its presidency of the Security Council, the Russian Federation plans to hold a debate on 28 October 2016 on the topic: “Cooperation between the United Nations and regional and subregional organizations in the maintenance of international peace and security: Collective Security Treaty Organization, Shanghai Cooperation Organization and Commonwealth of Independent States”.\\nIn view of the global nature of contemporary challenges and threats, the formulation of the collective approaches needed to tackle them effectively requires an enhancement of cooperation between the United Nations and regional and subregional organizations in the maintenance of peace and security.\\nIn relation to the United Nations this is primarily a function of its universal nature, in terms of both the membership of the Organization and its work, and also of its internationally recognized legitimacy. Regional organizations, in turn, often have a better understanding of the situation in their areas of responsibility, and in many cases, they are equipped with preventive and peacekeeping mechanisms which are adapted to local realities. In this regard it is important for the activities of regional organizations to be directed towards seeking peaceful, political solutions to emerging conflicts.\\nIt is precisely in this context that regular coordination with the main regional partners of the United Nations on issues of the maintenance of international peace and security is highly relevant. For instance, the Security Council regularly holds meetings on cooperation with the African Union, the Organization for Security and Cooperation in Europe and the European Union. In recent years there have been reviews of cooperation with the League of Arab States, the Association of Southeast Asian Nations, the Union of South American Nations and other regional actors.\\nAs is well known, cooperation between the Organization and its regional partners covers an ever broader range of issues. Peacekeeping and peacebuilding goals have been complemented by efforts to counter the proliferation of weapons of mass destruction and illegal flows of small arms and light weapons and to combat cyberterrorism and illegal migration — all of which are areas in which cooperation between the aforementioned organizations and the United Nations has been gaining momentum. This is of critical importance to the maintenance of peace and stability over the vast expanse of Eurasia, and especially in the Central Asian region.\\nIt is precisely in this sphere that three relatively young organizations are operating in the huge region from Eastern Europe to the Far East — the Collective Security Treaty Organization (CSTO), the Shanghai Cooperation Organization (SCO) and the Commonwealth of Independent States (CIS). These organizations are building their political influence in the world and making a significant contribution to strengthening regional and international security.\\nThe debates will focus on the contribution by CSTO, SCO and CIS to countering threats to peace and security in the region, including combating terrorism, drug trafficking and organized crime. The event will also provide an opportunity to reconfirm the commitment of these three organizations to the development of practical cooperation with the United Nations, including its Regional Centre for Preventive Diplomacy for Central Asia.\\nCSTO is a multifaceted structure which is capable of responding firmly to the wide range of contemporary challenges and threats that may be faced by its member States. In this regard, there is good potential for enhanced cooperation between the United Nations and CSTO in the area of peacekeeping. Within CSTO, intensive work is under way to develop its own peacekeeping capacity, including capacity that may be made available for United Nations peacekeeping operations. At the same time, CSTO is actively contributing to international efforts for post-conflict reconstruction in Afghanistan and for neutralizing the drug threat emanating from the territory of that country.\\nIts relations with the United Nations are successfully developing in many areas: combating terrorism and drug trafficking, peacekeeping, and control of organized crime. CSTO maintains and develops productive contacts with specialized United Nations structures, including the Counter-Terrorism Committee of the Security Council and the United Nations Office on Drugs and Crime.\\nEvery two years the General Assembly adopts a resolution on cooperation between the United Nations and CSTO. A resolution on that topic is scheduled for adoption at the seventy-first session in the context of the consideration of the agenda item entitled “Cooperation between the United Nations and regional and other organizations”.\\nThe legal framework for cooperation between the United Nations and SCO on issues of international peace and security in accordance with Chapter VIII of the Charter of the United Nations was created by the signing in 2010 of a joint declaration on cooperation between the secretariats of the two organizations. Currently SCO and the United Nations cooperate actively in such areas as conflict prevention and resolution, combating terrorism (for this purpose, a regional counter-terrorism structure is operating within SCO), non-proliferation of weapons of mass destruction, countering transnational crime and illicit drug trafficking and ensuring international information security.\\nIn this context SCO actively supports efforts by the international community and United Nations bodies to restore peace in Afghanistan and consistently advocates maintaining the central coordinating role of the Organization in the Afghan settlement process.\\nCooperation in ensuring security and countering contemporary challenges and threats has always been and will remain one of the priority areas of integrated cooperation among member States of CIS.\\nConstructive cooperation with international organizations is also a key factor in actively countering emerging threats. The CIS States are parties to all the most important international instruments governing cooperation in ensuring security, promoting disarmament, and countering contemporary challenges and threats and are making a significant contribution to their implementation.\\nJoint measures are being carried out taking into account the leading role of the United Nations and the need to develop constructive partnerships with other international bodies and their specialized structures, such as the Counter-Terrorism Committee, the United Nations Office on Drugs and Crime, the International Criminal Police Organization (Interpol), the International Organization for Migration, the Office of the United Nations High Commissioner for Refugees and the Financial Action Task Force on Money Laundering (FATF).\\nThe further strengthening and deepening of cooperation between the United Nations and CSTO, SCO and CIS on the basis of Chapter VIII of the Charter of the United Nations is playing a constructive role in promoting the goals of the Organization, including tackling contemporary challenges and threats. These regional organizations must actively position themselves in terms of using their potential in the interests of the United Nations. At the same time, the United Nations itself should continue to pay the necessary attention to increasing coordination and cooperation with those organizations, in strict observance of the prerogatives of the Organization and its Security Council.\\nIn this context we should like to suggest that Member States present their own vision of ways to strengthen security in the Eurasia region using existing regional mechanisms. It is obvious that stability in this macro-region will be the basis for economic growth and nation-building of the Eurasian countries and we would therefore welcome the views of delegations, including on linking security and development. We are convinced that here, in the United Nations, which has universal legitimacy, we will be able collectively to propose innovative approaches to issues of stabilizing vulnerable regions which may subsequently be applied to other parts of the world which are a focus of the Security Council.\\nThe debate will feature remarks by Mr. Ban Ki-moon, Secretary-General of the United Nations, Mr. N.N. Bordyuzha, Secretary-General of CSTO, Mr. R.K. Alimov, Secretary-General of SCO, and Mr. S.I. Ivanov, Vice-Chair of the Executive Committee of CIS. Member States of the aforementioned regional organizations and representatives of other interested States are also invited to take part in the meeting.'"}, "time": 1742628485.076262}