{"duration": 0.03317117691040039, "input_args": {"text": "'President Donald Trump has decided to withdraw from the Paris Climate Agreement, according to a report from Axios reporter Jonathan Swan citing two sources with knowledge of the decision. [The news was confirmed by several mainstream media outlets.  On Twitter, Trump indicated that an announcement was coming soon. “I will be announcing my decision on the Paris Accord over the next few days,” he wrote. “MAKE AMERICA GREAT AGAIN!” The decision wreaks havoc on former President Barack Obama’s legacy as president, despite pleas from world leaders for the United States to show leadership on climate change and remain in the agreement, Trump’s decision fulfills a key campaign promise to supporters of his run for president, widely supported by Republican members of congress who felt that the treaty unfairly jeopardized the American economy. Opponents of the climate deal were concerned after White House economic advisor Gary Cohn told reporters that the president was “evolving on the issue” during his trip overseas. His daughter Ivanka and    Jared Kushner reportedly channelled support for the deal behind the scenes at the White House, encouraging climate change activists that Trump might change his mind. Trump’s Secretary of State Rex Tillerson, the former Exxon CEO, also supported remaining in the treaty. On May 9th, Obama defended his climate change legacy, calling the agreement “the one that will define the contours of this century more dramatically perhaps than any other. ” In October 2016, Obama described the deal as “the best possible shot to save the one planet we’ve got. ” New York and Washington elites agreed, downplaying the future of coal as an energy source and urging more federal subsidies for wind and solar investments. Trump’s EPA Secretary Scott Pruitt and White House senior advisor Stephen K. Bannon urged the president to keep his campaign promise to kill the agreement and put American energy and job growth first.  '"}, "time": 1742628406.7114744}