{"duration": 0.09587883949279785, "input_args": {"text": "'Arvind Kejriwal promises to make Delhi pollution-free once he is made the Prime Minister Posted on Tweet \\nDelhi Chief minister Arvind Kejriwal who has off late come a under lot of pressure on the crumbling state of the Indian capital due to severe air pollution has promised his critics to clean up the air in the capital once he is elected as the prime minister of India. The AAP supremo claims that an imandar sarkar at the center will ensure that the future Delhi state government gets in line thereby making Delhi a smog free city. \\n“Doston, the center is not allowing the state to function and that’s why I need to become the PM to perform the duties of the CM. Once I become the PM of India, I’ll have all the power to rule the capital and so, besides cleaning its air, several new flyovers would be made, there would be no traffic jams, 15 lakh CCTVs would be installed, free Wi-Fi will be provided for all, new DTC buses would be inducted, Yamuna would cleaned and most importantly Delhi would attain full statehood,” said Kejriwal. \\n“Even corrupt Sheila ji could clean Delhi’s air significantly by decongesting Delhi through flyovers and metro and it was only possible because she had support from the corrupt center. Corrupt-Corrupt mil ke kaam kar lete they [Corrupt and corrupt worked together] . Once I become the PM, I will give all the support to the city just like the old times,” he added, while speaking at a press conference wearing a gas mask. \\nOn a question regarding state and center relations, Kejriwal said, “ Aisa bhi ho sakta hai [It might happen] that the future Delhi CM might not cooperate, but since we will be honest and strict, we will get the CM in line and make him perform all that we are not able to do now. In short I would not be a weak PM like Modiji,” said Kejriwal, and added, “And if the situation gets really bad, I can get Delhi under the center. And in the worst case scenario, I’ll become Delhi’s CM again. Whatever the case may be, I’ll ensure that Delhi becomes a clean and green city.” \\nAAP leaders have unanimously supported Arvind’s view point and claimed that they too need central ministry positions to solve all the problems of Delhi. \\n“If you want to fix the Delhi once and for all, the first step would be to help Kajariwal win the Punjab election and make him its CM. Once that is done we will take the next step and win the UP election and Kajariwal will be its CM also. Everyone knows that the party who wins the UP bags the center and thus by the 2019 he will become the prime minister of India to solve all the problems of Delhi state including air pollusion,” said AAP stalwart, Ashutosh. \\n(DMAN aka Divyamaan is the author of the spoof book ‘The Bogus Read’ ) Tweet About D-MAN \\nA jack of many trades who now wants to master some. Born wisecracker who makes every effort to get the maximum out of life. He facebooks here and tweets here .'"}, "time": 1742562233.3098447}