{"duration": 0.0713200569152832, "input_args": {"text": "'A high school principal in Connecticut has denounced students who chanted President Trump’s name during a recent basketball game, calling the chant “hate speech. ”[In a letter to the school, Canton High School Principal Andrew F. DiPippo insisted that chanting the president’s name at school functions will not be allowed, The Blaze reported.  “While students’ right to free speech and forming educated opinions about politics and current events is a cornerstone of our educational system, the exact point where political opinion converges with disrespect, discrimination or hate speech must be separated,” DiPippo wrote in his statement. “We have a reputation as a welcoming community and these students crossed this line with their comments and have damaged our reputation,” the principal added. The chant erupted during a game between Canton and the majority black and Hispanic Classical Magnet School of Hartford. Canton school administrators officially apologized for the chant that Classical players and coaches claimed were heard throughout the game. Along with the chant, Canton officials criticized students for carrying signs with Trump on them and for having Trump campaign items among the crowd. Canton senior Nathan Christopher disputed the claims from Principal DiPippo that the chants were racist. “I understand how the chant could be interpreted, but at the end of the day we are not racist toward anyone,” he said. Classical junior, Azaria Porter, said that one of the chants included a song with the words, “He’s our president. ” Hartford school district’s acting Superintendent Leslie   said such chants were “unacceptable conduct,” according to the Hartford Courant.   continued saying district officials, “will take every step necessary to ensure that our students and families are protected from physical harm and emotional harassment. ” Classical won the game  .  Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742563509.5861669}