{"duration": 0.03432655334472656, "input_args": {"text": "'Filmmaker Joss Whedon let loose on House Speaker Paul Ryan on Twitter this week, wishing him an unfortunate death at the hands of a certain horned mammal. [Violence solves nothing. I want a rhino to fuck @SpeakerRyan to death with its horn because it’s FUNNY, not because he’s a #GOPmurderbro,  —   Joss Whedon (@joss) January 14, 2017,   Whedon  —   a longtime Democratic Party contributor and an outspoken   celebrity activist  —   has been on a social media tear since shortly before the election, when he reinstated his Twitter account to launch an   political PSA featuring the stars of his Avengers movies. Earlier this week, the    director went after actress Nicole Kidman after she said that the country should unite in support behind Donald Trump. pic. twitter.   —   Joss Whedon (@joss) January 13, 2017,  Perhaps unsurprisingly, Whedon’s tweet about Ryan drew a swift response from the director’s social media followers: @joss Talented writer and director.  Epic films.  Poor judgment. pic. twitter.   —   Ken Zimmern (@KenZimmern) January 14, 2017,  . @joss People like you are why I stopped being a Democrat. Get the help you need before someone gets it for you. @SpeakerRyan,  —   Michelle (@LessThan1Week) January 14, 2017,  @joss this is beyond disappointing. You’re behaving like a child. How is this at all appropriate to say?  —   Sarah Quinlan (@sarahmquinlan) January 14, 2017,  @joss @SpeakerRyan Trump’s win was worth it just for this. the meltdown is beautiful,  —   Antoine Burke (@happyburkean) January 14, 2017,  Whedon has kept up his political activism since November. Shortly after Trump’s victory over former Democratic presidential nominee Hillary Clinton, the filmmaker tweeted that Trump could “not be allowed” to serve his first term in office. He also compared Trump to Nazi leader Adolf Hitler and, when Clinton supporters began rioting immediately following Trump’s victory, encouraged dissenters to keep protesting. This is simple: Trump cannot CANNOT be allowed a term in office. It’s not about 2018. It’s about RIGHT NOW,  —   Joss Whedon (@joss) November 14, 2016,  Voter suppressionRussian hackingFBI collusionHe has the officeBUT HE IS NOT WELCOME HEREKeep investigatingKeep protesting#NEVERtrump,  —   Joss Whedon (@joss) November 11, 2016,  Whedon’s “Important” PSA, released in September, became perhaps the most   celebrity political of the 2016 campaign, having been viewed more than eight million times since it was posted online. In the clip, Avengers stars Robert Downey Jr. Scarlett Johansson, Mark Ruffalo Don Cheadle and a slew of other celebrities remind ordinary Americans that Election Day is on November 8 and that voting is a serious matter.  The ad was widely mocked online, with one advertising company producing a   titled “Thanks Famous Actors” that subsequently went viral online.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742628565.6500597}