{"duration": 0.16194581985473633, "input_args": {"text": "'  TradCatKnight Radio is a quality program bringing you all of the top quests from around the world who are experts in their own specific fields. This program is highly listened to, unique and insightful. In addition I give talks for other radio shows/programs and have been see all over alternative media. I expose the infiltration/apostasy in the Catholic Church. I unmask FreeMasonry/New Age/New World Order/Zionism. I cover economics, health, prepping, survivalism, communist dumbing down of society, earth changes, signs of the times, prophecy, politics, geopolitics, \"conspiracies\", current events, global depopulation, Agenda 21, endtimes, satanic pedophile network, geoengineering, feminism, rise in demonic activity and MUCH more! Contact: Suggestions for special guests or to have me on your program/show.... apostleofmary@hotmail.com Host: Eric Gajewski, B.S., MBA Signs of the End: Nearly 50% Of Catholics Voted Clinton? By Eric Gajewski on November 11, 2016 \\nSigns of the End: Nearly 50% Of Catholics Voted Clinton? Signs of Times, Catholic Ain’t Catholic Anymore… By: Eric Gajewski \\nBuckle up because this blog is about to get “bumpy”. Upon moving through the news today I stumbled upon an article which stated that Trump won the Catholic vote. The article continued on relaying that 45% of those (self-identified) “Catholics” polled voted for Clinton? Yes, you heard me right. Nearly one out of every two people polled voted for the high ranking satanic witch herself. It truly is a sad time to be a Catholic. The good news, of course, is that, those who did identify themselves as “Catholic” are not in reality. Today we live in a cesspool of heresy and apostasy. I couldn’t imagine the remarks of some of the Church Fathers if they had lived in our time. Make no mistake I hold that Trump is a New World Order puppet but at least he is pretending not to be Satan. My goodness how low society has hit when self-professed Catholics vote for a satanic pedophile. Fifty percent of supposed “Catholics” voted for death itself and did these same 50 percenter’s forget their way home from the voting machines as well? \\nIt is truly not surprising. Take a look at what is going on the Vatican and you have your answer. From the top on down it is nearly wholly corrupt. The Synagogue has the highest seat now in the Vatican and has puppets/agents spread throughout all the world governments. Folks, voting for evil will not get rid of evil. Only God now can cure us of this disease in the Vatican and in Washington D.C. Stupid is as stupid does and when the supposed leader of the Church goes around making such idiotic statements which run contrary to the Faith the stupidity only tends to grow. I am certain that these Clinton supporters no longer have any fear of God by demonstrating their support for her. Lebron James the “Christian” (Illuminati puppet) even came out and supported her. \\nThe Church was meant to be the salt of the world. The statistics show that Obama won the “Catholic” vote back in 2012 so at least we had a drop in 5 percent over the last 4 years. I could not be any more sarcastic. This number should not even be one percent! In my most recent poll on TradCatKnight (which closed yesterday) I had 2 percent of the viewing audience say they would vote for Clinton. What in the hell is wrong with people these days? Is it the “chemtrail nanobots” activating inside the heads of men telling them to go vote for Satan? Is it the fluoride in the water which is specifically targeting the “Catholic” population alone? Or maybe just maybe it is the Marxist/Socialists who have hijacked our Church? Since Vatican II the Church has been overrun with heresy which is now being labeled truth. Hey…but they got to get with the times! Churchmen have completely lost their minds because they have lost God’s grace. Their hearts are ill and thus their minds rot and vice versa. Churchmen of the Conciliar Church (Vatican II) no longer are the salt but they are sugar. They are too busy trying to sugar coat everything and kiss up to the world. Some “Catholics” on their way home? \\nIt must have been those Ouija board playing “Catholics”. Apparently, 50% percent of these supposed Catholics missed that part in the Church’s teaching on voting for pro-choice politicians. Or did they? Have we arrived at that point in history where those claiming to follow Christ no longer even care about the basics? And if so how does this not indicate that Antichrist is right around the corner? Truly, a sign for our times. My good friends, I would argue that nine out of every ten “Catholic” isn’t Catholic these days due to this apostasy in the Church. These heretics showing up to vote are no more Catholic than Stephen Hawking is. Seriously, what Catechism do these “Catholics” read besides their Maxim magazine and Sports Illustrated (modern man’s new catechism). It truly is sad and frightening what I have to encounter out in “internet land” on a daily basis in regards to who labels themselves “Catholic”. Is there any hope with error so widespread? On the human level there is not which is why God will soon chastise this world like it has never seen. Men will see (they will wish they hadn’t) God’s distaste for liberalism, Marxism, Socialism, Americanism, Communism, Protestantism, Zionism, etc. Buckle up it is going to get bumpy. \\nWe all know we live in apocalyptic times, however, does it get any more apocalyptic than “Catholics” voting for Killery? Forget about that asteroid coming to end society for society is already lost and gone. As the Church goes so will the world and this perfectly summarizes where we are in terms of the times we live in. It is hard enough these days to try and convert those outside the true Catholic Faith and now I have to deal with this argument (that nearly half voted for Hillary). Again, this is not to say that Trump is not evil either. The reason people believe he is not evil is simply a distorted perception of him. What you see of him (in the mainstream media) is how the new world order wants you to perceive him. This “branding” will only make it easier to institute the race war and riots they have planned from the backlash of his election. \\nWhen will the voters realize the game has been rigged? Heck, even Hitler was funded by the Zionists and that was ancient history. You think it is any different now? The answer is the New World Order loves and wants the division they have created since this election and they plan on taking full advantage of it. Then, of course, the new world order will use this division to further solidify the One World Religion coming. The same principles for marriage ought to be applied for voting. Do you just settle? Do you continually make your bed with these puppeteers of the new world order? Can you imagine if you actually convinced yourself to marry the lesser of two evils? When will men await the arrival of the eagles? I have been saying for some time now “pray for the best but prepare for the worst” yet too many ride upon that “high of false hope” as this four year roller coaster keeps passing by. Will there be an outpouring of prayer out to God for real leaders (who are really outsiders) who will truly lead men through the Great Storm to come. It assuredly isn’t Trump nor Clinton because both who cash checks from the snakes head called “Israel.inc”. \\nP-R-S Model (Problem, Reaction & Solution) The Problem= Hillary Clinton Reaction= Need change, an “outsider”= Donald Trump (supposed Outsider) Solution= division and civil unrest (which ultimately leads toward a wanting of a “messiah” figure to come) \\nClinton Voters…Just in case you didn’t think America was doomed Related Posts:'"}, "time": 1742564492.7516296}