{"duration": 0.19350290298461914, "input_args": {"text": "'Molly Guy, the owner of Stone Fox Bride, a SoHo bridal shop, often finds herself catering to an unconventional client, one inclined to tweak or entirely dispense with tradition  —   and with it the wearing of a wedding veil. That bride, she said, “can barely stomach the idea of wearing a white dress, let alone a veil. ” Another type, Ms. Guy said, is more likely to conform. “Her mother and grandmother got married in a veil, and she will adhere to tradition. ” Yet a third, she said, reads Vogue and doesn’t care about the traditional: “She loves the accessory element of a veil. ” Whichever type of bride  —   in favor, opposed or simply on the fence  —   her decision to wear a veil, or reject it, is apt be fraught, heavily weighted by considerations of faith, family pressures, feminist principles and the no less compelling dictates of style. But what sets this bride apart from her mother’s generation is a ringing conviction that wearing a veil is less often a matter of custom than it is one of personal choice. Allison Shoening, 33, of Centennial, Colo. a project manager for a law firm, is to marry in September. She chose to wear a veil with the blusher, the portion that covers her face. “I struggled with the decision myself for a while,” Ms. Shoening said. “Over all, I like the look of a veil. It adds an   element to my wedding. ” And a wisp of decorum. “If I go strapless, I want to keep my look balanced,” she said. “I just don’t want everything bare. ” Others drop the veil, or at least the blusher, dismissing these elements as relics of male oppression, about as unwelcome on one’s wedding day as a pair of manacles. When she married four years, ago, Jessica Huseman, 26, left her head bare. “My   and I both find the idea of a veil to be a little silly,” she said. Pointedly, Ms. Huseman said: “We had this mutual agreement to share our lives. It was troubling, if you saw marriage as a partnership of equals, to wear a veil. ” “The idea of my husband lifting a veil over my face as his possession in front of our family and friends would have made me feel objectified,” she said. Those saying no to the veil included a number of women with deeply held religious convictions and strong family ties. Emily Dause, 30, who grew up in a family of evangelical Christians, saw no betrayal of her faith in replacing the veil with a headband for her coming May wedding. “It seemed to me that a veil is connected to being seen as a package, something to be given away on her wedding day,” said Ms. Dause, a teacher from Mechanicsburg, Pa. “It was disturbing that the veil has been viewed historically as connected to superstitions about warding off demons. ” She and others also see the veil as a symbolic reference to the virginity of the bride. Some brides sidestep the issue entirely, said Alexis Swerdloff, the    editor of New York Weddings. She said they replace the frothy length of cloth with a smaller, more discreet head covering, something like the birdcage (a small veil that cups the face) or the more   fascinator, an ornamental headpiece customarily embellished with a wisp of tulle extending slightly over one eye. Such choices tend to be governed less by custom than by taste. Wearing a fascinator, or alternately, a garland of flowers or   comb, “is a way of saying, ‘Oh, so, I’m a modern, cool bride, and I just like the way this looks,’” Ms. Swerdloff said. Meghan Boledovich, a restaurant forager at Print in New York, plans to wear a small veil when she marries in July. “I would wear it mostly because of how it looks,” she said. According to the Wedding Report, which tracks industry trends, based on government data and surveys of couples, the average amount spent on dress accessories (mostly veils, but other items, too) was $226 in 2015, a drop of 1. 3 percent from 2014. In a   culture, it’s not surprising that brides favoring the veil tend to be swayed by images of   muses like Princess Grace of Monaco, Bianca Jagger, Stevie Nicks or more contemporary figures, like Catherine, Duchess of Cambridge, or Jerry Hall, who married Rupert Murdoch in March with her head covered by a cloud of lavishly embroidered tulle. As with many stylistic choices, “These things really come down to what people seeing in magazines, on blogs and on the runway,” said Ms. Guy of Stone Fox Bride. For inspiration, she refers her clients to a roster of hip role models, Gwen Stefani and Solange Knowles, among others, never mind that on her wedding day, Ms. Knowles had subbed the veil for a     white cape. Lindsay Short, a senior accessories buyer for David’s Bridal in Conshohocken, Pa. said she is seeing an uptick in brides who wear veils. “In particular to a return to the cathedral veil,” she said. “Our customer tends to be the bride that wants the ball gown and the fairy tale. ” A recent resurgence of   formfitting gowns calls for the trailing veil and train, Ms. Short said. “It gives her that showstopping moment many brides still dream of. ” Kristen Maxwell Cooper, the executive editor of The Knot, said surveys last year of brides who use that   website showed that 57 percent bought a veil. In contrast, in 2013, only 31 percent of the brides surveyed said they bought one. “Sometimes choosing to wear a veil has nothing to do with tradition,” Ms. Cooper said. “The feeling is that it’s just something beautiful. If you’re going to wear it, it’s now or never. ” Mara Urshel, an owner of Kleinfeld Bridal in Brooklyn, said that the company is selling as many veils as it did four or five years ago, despite price increases: Some cost $6, 000 or $7, 000, or even as much as $10, 000, for the type of elaborately embellished variations some luxury houses now offer to match their gowns. (Veils more typically start at $300 and may go up to $2, 500.) Ms. Swerdloff, who skipped the veil at her own wedding this month, was somewhat startled to discover that, contrary to her expectations, most of brides who were photographed for New York Weddings’ spring 2016 issue did indeed wear a veil. So eager were some New Yorkers to make a style splash on their day of days, they insisted on wearing an ultralong veil, once relegated to the formal setting of a church or palatial estate, in the most informal surroundings. “I’ve seen a lot of long veils on   brides wearing short dresses, and getting married in a community garden,” Ms. Swerdloff said. For some    an elaborate veil remains the single most effusive expression of a long cherished fantasy. “I always imagined I would wear a cathedral veil,” said Allison Appell Cohen, 27, an account manager for Blue Cross Blue Shield of Texas in Dallas. “Every girl wants to be princess for a few hours,” Ms. Cohen said. “The veil is a statement maker, it’s so regal. Just to have it and the train of my dress trailing behind me: I knew that’s what I wanted. ” Others, loath to sacrifice tradition, cling to the veil’s symbolism. Karen Salva, 28, a location scout and makeup artist in the film industry, was married this month in Mystic, Conn. in a   Jewish ceremony, her face and hair concealed. “As I got to the huppah,” she recalled, “my mother lifted the veil up and presented my husband to me. ” Benjamin Stern, her fiancé, had covered her face with the blusher veil, a variation on a Jewish wedding custom known as the badeken. Ms. Salva was moved: “It was symbolically a way of for him to say: ‘Let me do this one last thing for you. Let me protect you and shelter you. ’” Posting on the wedding blog “Love My Dress,” Jennifer Cranham commented that she initially hesitated to wear a veil. “But now, it’s one of the things I’m most excited about,” said Ms. Cranham, who will marry this year. Her mother was as well. Ms. Cranham wrote that when she tried on her veil in the fitting room, her mother gazed at her raptly. “The dress didn’t get tears,” Ms. Cranham said. “But the veil did. ”'"}, "time": 1742562979.9771132}