{"duration": 1.2252850532531738, "input_args": {"text": "'Former Paramount Pictures CEO Sherry Lansing is making waves in Hollywood with the release Wednesday of excerpts from her new biography that shed light on some of the film industry’s most scandalous    secrets. [Excerpts from Lansing’s forthcoming book, Leading Lady: Sherry Lansing and the Making of a Hollywood Groundbreaker, were revealed Wednesday by its author and The Hollywood Reporter editor Stephen Galloway.  Lansing, who at age 35 became the first female president of 20th Century Fox in 1980, details the   battle behind one of her most memorable productions: Fatal Attraction.  “Everyone passed” on the project, Lansing said. “I begged John Carpenter [Halloween]. And it wasn’t just him. I begged everyone. ” Finding a director for the film quickly became a laborious task. Lansing had lined up director Brian De Palma, but he soured on Michael Douglas playing the lead role. Given a choice between De Palma or Douglas, Lansing went with the budding   actor. “It was one of those    moments,” Lansing said. “De Palma was the element that got us a green light, but Michael had been on the movie for two years, when everybody else rejected us. We said, ‘We’re sticking with Michael. ’” Flashdance director Adrian Lyne fell in love with the script and signed on to helm the movie, and Anne Archer was tapped to play Douglas’s wife, Beth Gallagher. The only missing piece to the puzzle was a leading lady. Susan Sarandon, Jessica Lange, Michelle Pfeiffer, Kirstie Alley, and Melanie Griffith, among others, had all been considered to play the role of Alex Forrest, the film’s emotionally unstable antagonist. While questions lingered about her “sexiness,” actress Glenn Close landed the role. One bombshell Lansing unleashes in her biography is the real reaction test audiences and producers had to the film initially namely, audiences   rejected the film’s initial ending, which showed Close’s character framing Douglas’s character for her murder and being taking away by police. “We did about six screenings,” Lansing said. “And at every single screening, when Anne says, ‘If you come near my family again, I’ll kill you,’ the audience bursts into applause. [  CEO] Frank Mancuso said, ‘I think they want Anne Archer to kill Glenn Close.’ And I looked at him speechless because I thought he was crazy. ” Late Paramount Pictures studio boss Ned Tanen rejected the original ending. He put it bluntly to the filmmakers: “They want us to terminate the bitch with extreme prejudice,” he said of Close’s character. “Adrian [Lyne] went nuts,” noted Lansing. “He felt that changing the ending was kowtowing to the lowest common denominator, and I agreed. Here was this wonderful film about how all your actions have consequences, and now they wanted to change the whole point. I felt it was morally wrong, and if I agreed to do it, I’d be selling out. ” Tanen and Paramount even offered to pay the filmmaker an additional $1. 5 million to shoot a new ending. “That was brilliant,” Lansing recalled. But Close reportedly refused to reshoot the ending scene to show her character being killed by Beth. “She came into Stanley’s office, and we couldn’t even get through the conversation with her,” said Lansing. The film’s creator and screenwriter James Dearden “had to pretend it was a great idea. ” “I had to sit there and tell her what the new ending would be, and tears were running down her cheeks. Glenn said, ‘You can take me in a straitjacket, but you can’t make me do it. ’” “I had a big talk to her about the theater, and how you play the show to    audiences, and then you adjust,” Douglas reportedly told Close. “The argument was, ‘It may not be the best for your character, but it’s best for the movie. ’” Close finally agreed to film the new ending, but never loved it. The reshoots were riddled with issues. “We went back to [the Gallaghers’ house] and other people had bought it, so we had to reconstruct it just the way it was,” said Lansing of the house the film was originally shot in. “It cost a fortune. Glenn had the worst of it, by far. She was dunked in the bath more than 50 times, and her eyes and nose became infected. ” The rest, as they say, was history. Fatal Attraction opened on Sept. 18, 1987, debuted at the number one spot at the box office, and went on to earn over $156 million on a $14 million budget. Read the full story and excerpts from Sherry Lansing’s upcoming biography here.   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742563883.7327287}