{"duration": 0.04744243621826172, "input_args": {"text": "'Drew Stratton November 5, 2016 Prep Blog Review: 13+ Essential Winter Survival Tips \\nI hate to tell you but winter is almost here. I hope you have already started preparing for the bad weather as you have so many things to do around your home and not only. \\nAs The National Weather Service has declared the week of October 31 to November 5 as Winter Weather Preparedness Week , let’s take a look at these 5 useful articles on this topic I’ve gathered for you for this week’s Prep Blog Review. 13 Tips You Need to Get Your Family Ready for Winter \\n“I have 13 tips you need to get your family ready for winter. It’s freezing outside! This picture was taken from my front door right here in Southern Utah a few years ago. We get ready for winter in different ways than up north, like Salt Lake City, Utah folks. They get a whole lot more snow than we get here. But we still have similar things we must all do to be ready for winter, no matter where we live. I must admit, I don’t miss the heavy slick snow storms up north. \\nWhenever the TV weather reports tons of snow…I am so glad I moved away from it. Or at least the real heavy snow. We get a little here, but it melts very quickly. Last winter was not the normal winter where I live. We had so many neighbors with frozen pipes and ice on their north facing driveways. Yikes!” \\nRead more on Food Storage Moms . How to Cope With Extreme Weather If You’re Stranded Outside \\n“People find themselves caught outside in freezing weather for a variety of reasons – maybe you have broken down and the car isn’t safe to stay in for some reason, you may be hiking and an unexpected storm blows in, or even you can’t make it out of the weather because someone is injured and wouldn’t make it on their own so you have to stay with them. There are dozens of variations on the theme and the important thing is knowing what to do about it.” \\nRead more on Underground Medic . What If Your Water Filter Freezes? \\n“Do you have a portable water filter? Do you keep one in your vehicle, perhaps in a GHB (get-home-bag) or BOB (bug-out-bag) or simply in your 72-hour emergency kit? Do you bring a water filter with you when you hike? \\nDoes the weather freeze where you live? Have you ever wondered if your water filter might be damaged if it gets below freezing? \\nMaybe you’ve not thought about it before, but you should…” \\nRead more on Modern Survival Blog . How to Store Water During Winter \\n“Water is the most important item to keep in your storage because it is essential to survival. However, this can become more difficult in the winter when temperatures drop below freezing. If your water freezes, you’ll need to use precious energy and heat to thaw it out for use again. But there are precautions you can take to keep your water storage from freezing in the winter.” \\nRead more on Peak Prosperity . 10+ Must Have Winter Preps \\n“ReadyNutrition Guys and Gals, “Old Man Winter” is starting to rear his ugly head. Yeah, so what? So there is a difference this year on three fronts. The first has to do with the weather itself, and the second is the situation in the U.S. and the world. \\nThroughout history winter has been (at times) so severe as to cause large numbers of deaths and great hardships. Throughout history warfare has been conducted during the winter months after the harvest has been taken in. Between you and I, the harvest is being taken in, and the whole world has been on the brink of war for quite some time. The third front: in the U.S., with the election.” \\nRead more on Ready Nutrition . \\nThis article has been written by Drew Stratton for Survivopedia. 19 total views, 18 views today'"}, "time": 1742563421.919431}