{"duration": 0.1047825813293457, "input_args": {"text": "'Written by John W. Whitehead Tuesday November 22, 2016 We Americans are the ultimate innocents . We are forever desperate to believe that this time the government is telling us the truth.” —Former New York Times reporter Sydney Schanberg Let’s talk about fake news stories, shall we? There’s the garden variety fake news that is not really “news” so much as it is titillating, tabloid-worthy material peddled by anyone with a Twitter account, a Facebook page and an active imagination. Anyone with an ounce of sense and access to the Internet should be able to ferret out the truth and lies in these stories with some basic research. That these stories flourish is largely owing to the general gullibility, laziness and media illiteracy of the general public, which through its learned compliance rarely questions, challenges or confronts. Then there’s the more devious kind of news stories circulated by one of the biggest propagators of fake news : the US government. In the midst of the media’s sudden headline-blaring apoplexy over fake news, you won’t hear much about the government’s role in producing, planting and peddling propaganda-driven fake news— often with the help of the corporate news media —because that’s not how the game works. Why? Because the powers-that-be don’t want us skeptical of the government’s message or its corporate accomplices in the mainstream media . They don’t want us to be more discerning when it comes to what information we digest online. They just want us to be leery of independent or alternative news sources while trusting them—and their corporate colleagues—to vet the news for us. Indeed, the New York Times has suggested that Facebook and Google appoint themselves the arbiters of truth on the internet in order to screen out what is blatantly false, spam or click-baity. Not only would this establish a dangerous precedent for all-out censorship but it’s also a slick sleight-of-hand maneuver that diverts attention from what we should really be talking about: the fact that the government has grown dangerously out-of-control , all the while the so-called mainstream news media, which is supposed to act as a bulwark against government propaganda, has instead become the mouthpiece of the world’s largest corporation—the US government. Veteran journalist Carl Bernstein, who along with Bob Woodward blew the lid off the Watergate scandal, exposed the media’s collusion with the government in his expansive 1977 Rolling Stone piece, “The CIA and the Media.” As part of the CIA’s Operation Mockingbird, which was started in the 1950s, intelligence reports were planted among reporters at more than 25 major newspapers and wire agencies, who would then regurgitate them for a public oblivious to the fact that they were being fed government propaganda. In some instances, as Bernstein shows , members of the media also served as extensions of the surveillance state, with reporters actually carrying out assignments for the CIA. Executives with most of the major news outlets including CBS, the New York Times and Time magazine also worked closely with the CIA to vet the news. For example, in August 1964, the nation’s leading newspapers—including the Washington Post and New York Times—echoed Lyndon Johnson’s claim that North Vietnam had launched a second round of attacks against American destroyers in the Gulf of Tonkin. No such attacks had taken place, and yet the damage was done. As Jeff Cohen and Norman Solomon report for Fairness and Accuracy in Reporting , “By reporting official claims as absolute truths, American journalism opened the floodgates for the bloody Vietnam War.” If such collusion happened in the past, you can bet it’s still happening today, only it’s been reclassified, renamed and hidden behind layers of government secrecy, obfuscation and spin . Thus, whether you’re talking about the Cold War, the Vietnam War , the Gulf War, the government’s invasion of Iraq based upon absolute fabrications , or the government’s so-called war on terror, privacy and whistleblowers, you can bet it’s being driven by propaganda churned out by one corporate machine (the corporate-controlled government) and fed to the American people by way of yet another corporate machine (the corporate-controlled media). “For the first time in human history, there is a concerted strategy to manipulate global perception. And the mass media are operating as its compliant assistants, failing both to resist it and to expose it,” writes investigative journalist Nick Davies . “The sheer ease with which this machinery has been able to do its work reflects a creeping structural weakness which now afflicts the production of our news.” This use of propaganda disguised as journalism is what journalist John Pilger refers to as “invisible government… the true ruling power of our country.” As I make clear in my book Battlefield America: The War on the American People , we no longer have a Fourth Estate. Not when the “news” we receive is routinely manufactured, manipulated and made-to-order by government agents. Not when six corporations control 90% of the media in America . And not when, as Davies laments , “news organizations which might otherwise have exposed the truth were themselves part of the abuse, and so they kept silent, indulging in a comic parody of misreporting, hiding the emerging scandal from their readers like a Victorian nanny covering the children’s eyes from an accident in the street.” So let’s have no more of this handwringing, heart-wrenching, morally offended talk about fake news by media outlets that have become propagandists for the false reality created by the American government. After all, as Glenn Greenwald points out , “The term propaganda rings melodramatic and exaggerated, but a press that—whether from fear, careerism, or conviction—uncritically recites false government claims and reports them as fact, or treats elected officials with a reverence reserved for royalty, cannot be accurately described as engaged in any other function.” So where does that leave us? What should—or can—we do? I’ll close with John Pilger’s words of warning and advice : Real information, subversive information, remains the most potent power of all — and I believe that we must not fall into the trap of believing that the media speaks for the public… [The public] need[s] truth, and journalists ought to be agents of truth, not the courtiers of power. I believe a fifth estate is possible, the product of a people’s movement, that monitors, deconstructs, and counters the corporate media… In the United States wonderfully free rebellious spirits populate the web... The best reporting … appears on the web … and citizen reporters. The challenge for the rest of us is to lift this subjugated knowledge from out of the underground and take it to ordinary people. We need to make haste. Liberal Democracy is moving toward a form of corporate dictatorship. This is an historic shift, and the media must not be allowed to be its façade, but itself made into a popular, burning issue, and subjected to direct action. That great whistleblower Tom Paine warned that if the majority of the people were denied the truth and the ideas of truth, it was time to storm what he called the Bastille of words. That time is now. Reprinted with permission from the Rutherford Institute . Related'"}, "time": 1742563536.4050362}