{"duration": 1.288360834121704, "input_args": {"text": "'The medieval basilica of St Benedict in Norcia, the town closest to the epicentre, was among buildings destroyed. The Basilica of St. Benedict is destroyed, flattened by most recent earthquake. #Terremoto pic.twitter.com/GQDl64LhFn \\n— The Monks of Norcia (@monksofnorcia) October 30, 2016 \\nAn evacuation of buildings in the region deemed vulnerable to seismic activity last week, following strong aftershocks from August’s quake, may have saved lives. \\nTremors from this latest earthquake were felt in the capital Rome, where the Metro system was shut down, and as far away as Venice in the north. \\nThe head of the national civil protection agency, Fabrizio Curcio, said there had been extensive damage to many historic buildings but no deaths had been registered. \\n“About 20 people are injured. As far as people are concerned, the situation is positive, but many buildings are in a critical state in historic centres and there are problems with electricity and water supplies,” he added. \\nPrime Minister Matteo Renzi has promised that everything will be rebuilt, saying resources will be found. \\n“We are going through a really tough period,” he said. “We must not allow the profound pain, fatigue and stress that we have now to turn into resignation.” \\nPope Francis mentioned the quake in his Sunday blessing in Rome’s St Peter’s Square. \\n“I’m praying for the injured and the families who have suffered the most damage, as well as for rescue and first-aid workers,” he said to loud applause. \\nAccording to Ansa the cathedral of Saint Maria Silver and the town hall were also reported to have been damaged along with the 4th century church in Rome commonly known as ‘St Paul’s Outside the Walls’. \\nThe news agency reported that cornices fell and cracks appeared in the walls after the quake struck central Italy and shook many buildings in the capital.'"}, "time": 1742562645.8726244}