{"duration": 0.1302030086517334, "input_args": {"text": "'The pilgrims have been coming to Nashville for as long as the Grand Ole Opry has been on the radio. They come for Fan Fair and Taylor Swift concerts or just to walk down Lower Broad in cowboy boots. Parents visit their children in college. Conventioneers deplane by the thousands. Nashville is a hip city now, with a food scene, an art scene and two poorly performing professional sports teams. With all the reasons to travel to Nashville, one might be surprised to learn that some people come just to see a small independent bookstore. It’s true. The Book Faithful journey to Music City because they still like their novels printed on paper. They come because they’ve heard about the shop dogs, or because someone told them years ago that bookstores were moving onto the endangered species list and they wanted to see one that was thriving in its natural habitat: in a strip mall, behind Fox’s Donut Den, beside   Paint Store. Some come in hopes of seeing a favorite author read, or catching a glimpse of the author who   the store. That would be me. Karen Hayes and I opened Parnassus Books in November 2011. This summer, when Pickles and Ice Cream Maternity went out of business, we took down the adjoining wall and doubled our space. Business is good, which, by bookstore standards, means we spring for employee health insurance and pay the rent. Karen and I are vocal supporters of the Shop Local movement, while at the same time benefiting from the Destination Bookstore travelers. It seems as if every time I’m in the back room signing special orders or meeting with staffers to pick a book for our First Editions Club, Bill, the tall Englishman who works the front, comes to tell me a book club has just arrived from Omaha or Bangor or Sweden. I go out and pose for group pictures, recommend books, give an impromptu tour. I always ask the same question, “What made you think I’d be here?” because seriously, I’m gone a lot. They always give me the same answer: I’m not why they came. They came to see the store. With its high wooden shelves and rolling ladders and dangling stars, Parnassus is  —   if I may say so myself  —   worth a visit, a reminder that a strip mall need not be judged by its parking lot. But there are many bookstores that could stand as the centerpiece of a vacation. Here are some categories to consider when searching for one. Before we opened Parnassus, I made a   tour of American bookstores. The best advice I got was this: If you want customers, you have to raise them yourself. That means a strong children’s section. If   have taken a bite out of the adult market, they’ve done very little damage to children’s books, maybe because even the most   parents understand that reading “Goodnight Moon” off your phone doesn’t create the same occasion for bonding. There are some knockout stores that sell nothing but children’s books, including the Curious George Store in Cambridge, Mass. Wild Rumpus in Minneapolis, Books of Wonder in New York, and Tree House Books in Ashland, Ore. as well as loads of general interest stores that do a particularly great job with their children’s section, like Women  Children First in Chicago and Greenlight Bookstore in Brooklyn. For many of us, children’s books are the foundation of bookselling, the cornerstone, the rock on which this church is built. Before going, be sure to check the bookstores’ events calendars for visiting authors. If I may make a sweeping generalization, children’s book authors  —   from those who write board books suitable for teething to those who write young adult fiction full of vampires and angst  —   are the nicest people on the planet. Not only will they talk to your child or young adult, they will relate to them, they will draw pictures for them, they will create an indelible link between reading and joy. I’m not sure why you’d be going to Greenwood, Miss. except for a mad desire to see TurnRow Book Company. It’s one of the most beautiful bookstores I know, and the sheer unlikelihood of its presence makes a traveler feel she’s stumbled into an oasis in the Mississippi Delta. Thanks to the Viking Range plant, the town also has a few   restaurants and a very pretty inn, but the bookstore is the reason to go. And since you’re in Greenwood, you’ve got to go to Oxford, a town defined by its writers. You can visit Faulkner’s home as well as the bookstore, or make that bookstores. Richard Howorth, the former mayor of Oxford, has three locations on the downtown square: the original Square Books Square Books, Jr. the children’s store and Off Square, which sells discount books and provides space for author events. Despite the enormousness of Ole Miss, these three stores are the backbone of Oxford. When was the last time you strolled around downtown Los Angeles near Skid Row? Never? I’m from Los Angeles and it took the Last Bookstore to get me there. The store’s tagline, “What are you waiting for? We won’t be here forever,” has a suitably apocalyptic ring to it, but the place is so monumental that it’s hard to imagine it going anywhere: 22, 000 square feet on three floors with new and used books, vinyl records and gallery space. The whole thing appears to have been made out of books, books that are folded and fanned and stacked into towering sculptures. The clientele is as eclectic and fascinating as the reading selection. It did my heart good to see so many tattooed kids with black nail polish and nose rings sprawled out in chairs reading books. As long as you’re going to places you never thought you’d go, head to Plainville, Mass. to see An Unlikely Story Bookstore  Café, which I hope will soon replace Disney World as the place all parents feel   to take their children. Jeff Kinney took part of the proceeds from his juggernaut series “Diary of a Wimpy Kid” and built his hometown a   bookstore  —   the ultimate fulfillment of literary civic duty. The building contains a dazzling bookshop, event space and cafe, and the top floor will soon be a Wimpy Kid museum, complete with movie props and the model for the Wimpy Kid Macy’s Thanksgiving Day parade balloon. (How do you know that your character is reaching the heights of Snoopy? You get your own parade balloon.) I’m a sucker for a little bookstore. In the right hands, the limited space can set off an explosion of personality and innovation. It’s like going to a French bistro with five tables and five things on the menu: You discover they’re exactly the right five things. New York City, land of skyrocketing rents and ubiquitous nail salons, has some of the best tiny bookstores in the world, including the Corner Bookstore, 192 Books and my favorite, Three Lives  Company. Sometimes what’s lost in square footage is made up for by a brilliant staff, or maybe it’s just that the people who work in tiny stores really do know exactly where every book is located. And they’ve read them. Little bookstores give off that same warm, snug feeling one gets from reading a novel in a comfy chair. Go look at the light in Newtonville Books outside Boston, or drive down the cape to Provincetown Bookshop, that essential last stop before hitting the beach. The novelist Louise Erdrich owns the tiny Birchbark Books in Minneapolis, a store that uses a chunk of its limited space to display an elaborately carved confessional box. You’ll wish every bookstore had one. In Washington you see the Vietnam Memorial, the new National Museum of African American History  Culture and Politics  Prose Bookstore. It’s where the Obamas shop, and it’s where the movers and shakers of our nation’s capital come to see what’s really going on. It also happens to be where I eat lunch, as they have the best bookstore cafe I know. Doesn’t everyone who visits Harvard go across the street to the Harvard Book Store, a shop as esteemed as the university? When you’re finished there (it will take all day) walk down Plympton Street to Grolier Poetry Book Shop. In Cambridge a store that sells nothing but poetry seems indispensable. But if you’re interested in Grolier’s aesthetic opposite, go to the fabulous Books  Books. It’s everything I love about Miami without any of the things I don’t love about Miami, a store where books are elevated to new heights of gorgeousness. Just walking in the door of either the Coral Gables or South Beach location makes me feel like an automatic hipster, a book hipster. I always leave with armloads of art books and travel books, things I never knew I needed but I do need desperately. And then, of course, there’s Powell’s: an entire block, a dizzying,   City of Books. The fact that Portland, Ore. celebrates being defined by its independent bookstore is really all you need to know about Portland. I went on my first book tour in 1992 when I was 28, and I have been going on book tours ever since. I have made it a point to go to bookstores in every town I’ve ever driven through. I go both as a writer and a reader, for business and for pleasure, and I have been in love with too many to make a comprehensive list here. Still, I have to call out some of my favorites, like Boswell Book Company in Milwaukee, lit by the internal fire of one Daniel Goldin, a stupendously great bookseller. And since you’re in Milwaukee, you won’t be that far from McLean  Eakin Booksellers in Petoskey, Mich. a personal favorite that proves Northern Michigan has a lot more to offer than cherries and apples. Malaprop’s was the heart and soul of Asheville, N. C. when Asheville was a sleepy little hippie town, and it’s still its heart and soul now that the city is cool and overcrowded, a position Malaprop’s maintained by being unabashedly true to itself. No bookstore ever made a strip mall look better than Book Passage in Corte Madera, Calif. Every author you could hope to see comes to read at Book Passage. And then there’s Explore Booksellers in Aspen, Colo. a town that’s gotten so expensive that the bookstore would have to sell Chanel bags alongside Michael Chabon novels in order to make the rent, so a group of people got together and bought it so that the town could have a bookstore All these bookstores will welcome you, as will those I failed to mention. They’re delicate little ecosystems based on a passion for books and a belief in community. They’re here for you, but they need your attention and support to thrive. Of course we’d love to see you at Parnassus. The shop dogs are lazy. They pile up in the office and sleep beneath the desks, but if you ask, we’ll wake them up and send them out on the floor. When you’ve gotten your recommendations from our brilliant staff, and listened to story time in the children’s section, and seen a couple of authors (and country music stars) shopping themselves, we’ll give you advice on where to go to dinner and hear music. Or maybe you just want to sit in a quiet chair and read your new book. Go ahead, that’s what we’re here for.'"}, "time": 1742628328.8389144}