{"duration": 0.06306028366088867, "input_args": {"text": "'Maritime authorities intervened to stop a National Geographic crew from baiting sharks off the coast of Long Beach in the midst of a local panic about great white sharks appearing near the shore, according to a local news report. [The Orange County Register reported Wednesday that “officials suspect that some media outlets aren’t satisfied with footage of naturally occurring shark sightings. ” It elaborated:  Long Beach lifeguard officials say they strongly suspect film crews are throwing fish or bait in the water near shore to attract sharks, also known as “chumming. ” “We’ve gotten some reports from citizens who have seen recreational boats out chumming,” Gonzalo Medina, Marine Safety chief, said. “Some fishing boats too. They’re trying to get video footage of the sharks. Some film crews are reportedly chumming within 100 yards of the shore. One official told the Register that authorities had stopped a National Geographic film crew: “We had a crew from National Geographic.   …     We talked with them, and they were very receptive. Ultimately, they used rubber fish attached to a line that they could pull back in. ” The crew was not issued a citation, the Register reports. In late April, a woman was attacked and severely injured by a great white shark while swimming at San Onofre State Beach in Orange County. Since then, great white sharks have been spotted near the shore in Orange County and in Long Beach. Though it is not rare to see juvenile great whites in Southern California waters, it is unusual to see mature sharks, especially near the shore. The news reports have frightened many swimmers and surfers as the summer season begins. Now, it seems, media companies may be chumming the waters to create the very news they hope to report. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742628493.8570027}