{"duration": 0.20003533363342285, "input_args": {"text": "'Réunion du Conseil de sécurité du 28 octobre 2016\\nDocument préparatoire de la présidence russe Réseau Voltaire | New York (États-Unis) | 27 octobre 2016 English Español русский عربي 中文 Coopération entre l’Organisation des Nations Unies et les organisations régionales et sous-régionales aux fins du maintien de la paix et de la sécurité internationales : Organisation du Traité de sécurité collective, Organisation de Shanghai pour la coopération et Communauté d’États indépendants La Fédération de Russie compte organiser, le 28 octobre 2016, un débat sur le thème « Coopération entre l’Organisation des Nations Unies et les organisations régionales et sous-régionales aux fins du maintien de la paix et de la sécurité internationales : Organisation du Traité de sécurité collective, Organisation de Shanghai pour la coopération et Communauté d’États indépendants », qui constituera un évènement phare de sa présidence au Conseil de sécurité.\\nAu vu de la dimension mondiale des problèmes et menaces actuels et de la nécessité d’élaborer des stratégies collectives pour les combattre efficacement, il est essentiel de renforcer la coopération entre l’ONU et les organisations régionales et sous-régionales dans le domaine du maintien de la paix et de la sécurité.\\nPour ce qui est de l’ONU, il s’agit avant tout de tirer parti de son caractère universel, aussi bien au niveau de ses Membres que de ses activités, ainsi que de sa légitimité mondialement reconnue. Les organisations régionales, quant à elles, connaissent souvent mieux la situation dans les régions relevant de leur compétence et, dans de nombreux cas, sont dotées de mécanismes de prévention et de maintien de la paix adaptés aux réalités locales. Il importe à cet égard que les activités des organisations régionales tendent à trouver des solutions pacifiques et politiques aux conflits émergents.\\nDans ce contexte, il est particulièrement important que l’ONU et ses principaux partenaires régionaux se coordonnent régulièrement sur les questions ayant trait au maintien de la paix et de la sécurité internationales. Ainsi, le Conseil de sécurité tient régulièrement des séances sur la coopération avec l’Union africaine, l’Organisation pour la sécurité et la coopération en Europe et l’Union européenne. Ces dernières années, un examen a également été mené sur la coopération avec la Ligue des États arabes, l’Association des nations de l’Asie du Sud-Est, l’Union des nations de l’Amérique du Sud et d’autres organisations régionales.\\nComme on le sait, la collaboration entre l’ONU et ses partenaires régionaux couvre un nombre toujours plus grand de questions. Aux activités de maintien et de consolidation de la paix sont venues s’ajouter la lutte contre la prolifération des armes de destruction massive et le trafic d’armes légères et de petit calibre ainsi que la lutte contre le cyberterrorisme et la migration illégale, domaines dans lesquels la coopération entre les organisations concernées et l’ONU est de plus en plus étroite. Cette coopération joue un rôle essentiel dans le maintien de la paix et de la stabilité à l’échelle de l’Eurasie et, plus particulièrement, en Asie centrale.\\nC’est précisément dans ce domaine qu’œuvrent trois organisations relativement jeunes dans une vaste zone s’étendant de l’Europe orientale à l’Extrême-Orient, à savoir l’Organisation du Traité de sécurité collective (OTSC), l’Organisation de Shanghai pour la coopération et la Communauté d’États indépendants (CEI). De plus en plus influentes sur la scène politique mondiale, ces organisations contribuent considérablement au renforcement de la sécurité régionale et internationale.\\nLe débat sera axé sur le rôle de ces trois organisations dans la lutte contre les menaces qui pèsent sur la paix et la sécurité dans la région, notamment le terrorisme, le trafic de drogues et la criminalité organisée. Il permettra également à ces organisations de réaffirmer leur volonté de renforcer la coopération sur le plan pratique avec l’ONU, notamment avec son Centre régional pour la diplomatie préventive en Asie centrale.\\nL’OTSC est une structure pluridimensionnelle à même de réagir résolument aux divers problèmes et menaces actuels auxquels peuvent faire face ses États membres. À cet égard, le resserrement de la coopération entre l’ONU est l’OTSC dans le domaine du maintien de la paix est prometteur. L’OTSC déploie d’importants efforts pour renforcer ses propres capacités de maintien de la paix, qui pourront aussi être mises à la disposition des opérations de maintien de la paix des Nations Unies. Elle contribue activement, en outre, aux actions menées sur le plan international pour reconstruire l’Afghanistan après le conflit et pour écarter la menace que représentent les stupéfiants provenant de ce pays.\\nSes relations avec l’ONU se révèlent fructueuses dans de nombreux domaines, comme la lutte contre le terrorisme et le trafic de drogues, le maintien de la paix ou la lutte contre la criminalité organisée. L’OTSC entretient et développe des rapports productifs avec les entités spécialisées de l’ONU, notamment le Comité contre le terrorisme du Conseil de sécurité et l’Office des Nations Unies contre la drogue et le crime.\\nTous les deux ans, l’Assemblée générale adopte une résolution sur la coopération entre l’ONU et l’OTSC, et il est prévu qu’elle en adopte une à sa soixante et onzième session, au titre du point de l’ordre du jour intitulé « Coopération entre l’Organisation des Nations Unies et les organisations régionales ou autres ».\\nLes fondements juridiques de la coopération entre l’ONU et l’Organisation de Shanghai pour la coopération dans le domaine du maintien de la paix et de la sécurité internationales au titre du Chapitre VIII de la Charte des Nations Unies ont été posés à la suite de la signature, en 2010, de la Déclaration conjointe sur la coopération entre les secrétariats des deux organisations. Actuellement, l’Organisation de Shanghai et l’ONU collaborent étroitement dans des domaines tels que la prévention et le règlement des conflits, la lutte contre le terrorisme (l’Instance régionale de lutte contre le terrorisme relevant de l’Organisation de Shanghai œuvre à cette fin), la non-prolifération des armes de destruction massive, la lutte contre la criminalité transnationale et le trafic de drogues, et la sécurité informatique internationale.\\nDans ce contexte, l’Organisation de Shanghai appuie activement les efforts déployés par la communauté internationale et les organismes des Nations Unies pour rétablir la paix en Afghanistan, se prononçant toujours en faveur du maintien du rôle central de coordination de l’ONU dans le règlement du conflit afghan.\\nQuant à la CEI, la sécurité et la lutte contre les menaces actuelles ont toujours été et demeurent un des domaines prioritaires de coopération entre ses États membres.\\nUne coopération constructive avec les organisations internationales est également essentielle pour contrer les menaces émergentes. Les pays de la CEI sont parties à tous les principaux instruments internationaux régissant la coopération dans les domaines de la sécurité, du désarmement et de la lutte contre les menaces actuelles, et contribuent efficacement à leur mise en œuvre.\\nDes mesures conjointes sont prises compte tenu du rôle moteur de l’ONU et de la nécessité d’établir des partenariats constructifs avec d’autres institutions internationales et leurs entités spécialisées, comme le Comité contre le terrorisme, l’Office des Nations Unies contre la drogue et le crime, l’Organisation internationale de police criminelle (INTERPOL), l’Organisation internationale pour les migrations, le Haut-Commissariat des Nations Unies pour les réfugiés et le Groupe d’action financière sur le blanchiment des capitaux.\\nL’élargissement et le renforcement de la coopération entre l’ONU et l’OTSC, l’Organisation de Shanghai pour la coopération et la CEI au titre du Chapitre VIII de la Charte des Nations Unies semble contribuer de manière constructive à la réalisation des objectifs de l’ONU, y compris à l’élimination des menaces et problèmes actuels. D’une part, ces organisations régionales doivent activement envisager de mettre leurs capacités au service de l’ONU et, d’autre part, l’ONU doit continuer d’accorder l’attention voulue au renforcement de la coordination et de la coopération avec ces organisations, dans le strict respect de ses propres prérogatives et de celles de son Conseil de sécurité.\\nDans ce contexte, nous invitons les États Membres de l’ONU à exposer leurs idées sur les moyens de renforcer la sécurité dans la région eurasienne avec l’aide des mécanismes régionaux existants. Force est de constater que la stabilité de cette vaste région est une condition sine qua non de la croissance économique et de l’édification de l’État des pays de l’Eurasie et nous serions par conséquent reconnaissants aux délégations de nous faire part de leurs vues, notamment en ce qui concerne les liens entre sécurité et développement. Nous sommes convaincus qu’ici, dans le cadre de l’ONU, qui jouit d’une légitimité universelle, nous serons tous ensemble en mesure de proposer des stratégies novatrices visant la stabilisation des régions vulnérables, susceptibles, par la suite, d’être mises en œuvre dans d’autres régions du monde qui sont au centre des préoccupations du Conseil de sécurité.\\nLe Secrétaire général de l’ONU, Ban Ki-moon, le Secrétaire général de l’OTSC, Nikolaï Bordiouja, le Secrétaire général de l’Organisation de Shanghai pour la coopération, Rachid Alimov et le Vice-Président du Comité exécutif de la CEI, Serguei Ivanov, feront un exposé lors du débat. Les États membres des organisations régionales susmentionnées et les représentants d’autres États intéressés sont invités à participer à la réunion.'"}, "time": 1742564130.9322903}