{"duration": 0.03139925003051758, "input_args": {"text": "'0 comments \\nEarlier this year, in a speech to the African Union while in Ethiopia, President Obama said, “I actually think I’m a pretty good president. I think if I ran again, I could win. But I can’t. The law is the law, and no one person is above the law, not even the president.” \\nObama may say he is not above the law, but it is abundantly clear that he thinks he is. He may need his head examined, though, if he actually believes he has been a “good president.” ISIS is running rampant worldwide, the national debt has skyrocketed, and Obamacare has been a massive failure, just to name a few things. \\nNow, the American people have spoken out in a poll. Apparently, they are not very happy that the president took it upon himself to assume they would vote for him a third time around. News flash, Mr. President, but many of us DID NOT vote for you the first or second time to begin with! \\nAccording to the Rasmussen Reports poll, only one-third of Americans would vote for Obama if he ran for a third term, assuming that was constitutionally possible. Perhaps the president needs a refresher course on fractions, because one-third isn’t exactly a majority… \\nThe results of the poll get worse for Obama, though. The amount of Democrats who would vote for him a third time is only 57 percent. That’s just a little better than half of the members of his own party. Turns out, we’re not the only ones who can’t wait for him to vacate the White House! \\nThe Conservative Post reports that Rasmussen also showed that 63 percent of all likely voters would not support a third term. Even among independents, 68 percent would vote for another candidate. 93 percent of Republicans would not vote for Obama for a third term, and we’re a little worried about that other 7 percent. \\nSHARE this report if you think Barack Obama is one of the WORST presidents in the history of America, NOT one of the best!'"}, "time": 1742563204.3597279}