{"duration": 0.05999302864074707, "input_args": {"text": "'LOS ANGELES  —   “We got one!” Those words, shouted by a   Annie Potts in the 1984 version of “Ghostbusters,” summed up the feeling on the Sony Pictures lot on Sunday, as the   studio released a remake of that comedy to solid results. The new “Ghostbusters,” directed by Paul Feig and featuring women in the main roles, took in about $46 million over the weekend at theaters in the United States and Canada. It was only good enough for second place, behind Illumination Entertainment’s “The Secret Life of Pets” (Universal) which collected an estimated $50. 6 million in its second weekend, for a new domestic total of $203. 2 million, according to comScore, which compiles box office data. But ticket sales for “Ghostbusters” were strong enough to merit revelry nonetheless. “We’re totally ecstatic,” Josh Greenstein, Sony’s president of marketing and distribution, said by phone. Resuscitating any film franchise that has been absent from theaters for 27 years (ever since “Ghostbusters II” arrived in 1989) is extremely difficult. In this case, Sony had the additional challenge of facing down internet trolls unhappy about the casting of Melissa McCarthy, Kate McKinnon, Leslie Jones and Kristen Wiig. In Hollywood, trouble like “Ghostbusters” faced before its release can either prompt damaging studio infighting, as executives squabble over what to do, or it can galvanize a management team in new ways. Sony, currently in last place among the six major studios as measured by annual domestic ticket sales, has undergone an extreme makeover in the last 17 months, with Thomas E. Rothman taking over as movie chief in February 2015. “The team really pulled together,” Mr. Greenstein said. Even so, Sony and Village Roadshow spent $144 million to make “Ghostbusters”  —   ads cost at least $100 million more  —   leaving the film a long way from profitability. Sony is counting on foreign ticket sales, although China, the world’s No. 2 box office market, is unlikely to clear the   film for release. Mr. Greenstein said he expected the generously reviewed reboot to perform well in the weeks ahead. “Paul’s movies have big, huge, high multiples, and there are no big comedies on the horizon,” he said. Amid more straightforward summer remakes and sequels, “the movie is both new and nostalgic, which makes it stand out,” he added. For the weekend, “The Legend of Tarzan” (Warner Bros.) was third, taking in about $11. 1 million, for a   total of $103. 1 million. Also of note: Woody Allen’s “Café Society” (Lionsgate) got off to a strong start in five theaters, collecting $355, 000.'"}, "time": 1742562059.4518836}