{"duration": 0.10639572143554688, "input_args": {"text": "'advertisement - learn more \\nThe main causes are an unhealthy diet, a sedentary lifestyle, and genetics, but considering how many people are affected by this issue and how much strain it is placing on our already overburdened medical systems, researchers are desperate to find other avenues to treat it. And through their efforts, they have now discovered that our gut plays a crucial role in weight management. \\nNew evidence suggests that gut bacteria alter the way we store fat, how we balance levels of glucose in the blood, and how we respond to hormones that make us feel hungry or full. If we have the wrong mix of microbes from birth, we may be predisposed to obesity and diabetes. \\nThankfully, researchers are starting to find the differences between the wrong and the right ones, and what factors determine those differences. Their hope is that, with this knowledge, they can prevent and maybe even reverse obesity. We also need to learn how to keep our gut microbes happy in order to avoid weight gain. This begins with redesigning our food choices. Understanding The Importance Of Microbes \\nWhile researchers have long known about microorganisms in the human body, only in the past decade did they come to understand that they outnumber our own cells 10 to 1. And rapid gene-sequencing techniques have discovered that the biggest and most diverse of the bunch live in the large intestine and mouth. \\nFrom birth, we build up our microbes, first from our mother’s bacteria and then from the environment around us. The genes of these microbes, collectively called the microbiome, have been diligently studied — researchers pinpointing their census, and now the kind of jobs they perform. advertisement - learn more \\nIt was first thought that gut microbes might play a role in obesity from studies comparing intestinal bacteria in obese and lean individuals. Researchers found that the gut community in lean people was very diverse, and they tended to have a wider variety of Bacteroidetes , which are a large tribe of microbes that work to break down bulky plant starches and fibers into smaller molecules in order for the body to use them as a source of energy. But obese people proved to have a much less diverse community. \\nOther studies pointed out that these discrepancies aren’t necessarily responsible for obesity; however, one series of experiments with “humanized” mice concluded that there is a cause-and-effect relationship , and that obesity may be preventative. So the obesity conversation is now turning to how we can shape our gut ecosystem to work in our favor. Keep Evolving Your Consciousness Inspiration and all our best content, straight to your inbox. How Diet Plays A Role \\nJeffrey Gordon of Washington University in St. Louis and his team of researchers came to the conclusion that highly processed foods have been linked to a less diverse gut community in people by feeding humanized mice a specially prepared unhealthy chow high in fat and low in fruits, vegetables, and fiber. Mice with obese-type microbes grew fatter when housed with lean cagemates. The researchers found that the unhealthy diet kept the bacteria from moving in and flourishing. \\nStudies have also found how diet can harm our gut bacteria and predispose us to obesity from the day we are born as well, showing that both formula-fed babies and infants delivered by cesarean section have a higher risk for obesity and diabetes than breast-fed babies or those delivered vaginally. For instance, Rob Knight of the University of Colorado Boulder and Maria Gloria Dominguez-Bello of N.Y.U. have found that when newborns traverse the birth canal, they ingest bacteria that helps them to digest milk . And babies raised on formula do not get substances in breast milk that both allow beneficial bacteria to thrive and prevent unhealthy ones from doing likewise. A Canadian study even concluded that a major reason for babies being more susceptible to allergies, asthma, eczema, and celiac disease, as well as obesity, may be due to them being fed formula instead of being breast fed . \\nAntibiotics may also play a role in obesity, with research finding that young mice given low doses of antibiotics develop about 15 percent more body fat than mice that are not given such drugs. “Antibiotics are like a fire in the forest,” Dominguez-Bello proclaims. “The baby is forming a forest. If you have a fire in a forest that is new, you get extinction.” What’s Next \\nScientists hope the work they are doing on understanding the microbiome will introduce a new generation of tools to treat and prevent obesity, but with so much research still to be done, and so many questions to answer, time will only tell what will come of these various studies connecting the dots between the gut and weight. \\n“Data from human studies are a lot messier than the mouse data,” explains Claire Fraser of the University of Maryland, who is studying the connection of obesity and gut microbes in the Old Order Amish population. \\nMany scientists are still developing potential treatments nonetheless, including Dominguez-Bello, who is conducting a clinical trial in Puerto Rico where she will monitor the weight and overall health of babies born by cesarean section who are immediately swabbed with a gauze cloth laced with the mother’s vaginal fluids and resident microbes. \\nThe Sacred Science follows eight people from around the world, with varying physical and psychological illnesses, as they embark on a one-month healing journey into the heart of the Amazon jungle. \\nYou can watch this documentary film FREE for 10 days by clicking here. \\n\"If “Survivor” was actually real and had stakes worth caring about, it would be what happens here, and “The Sacred Science” hopefully is merely one in a long line of exciting endeavors from this group.\" - Billy Okeefe, McClatchy Tribune'"}, "time": 1742563401.952445}