{"duration": 0.5522618293762207, "input_args": {"text": "'Joy points upward, according to Marie Kondo, whose name is now a verb and whose nickname is being trademarked and whose life has become a philosophy. In April at the Japan Society in New York, she mounted a stage in an ivory dress and silver heels, made namaste hands at the audience and took her place beneath the display of a Power Point presentation. Now that she has sold nearly six million copies of “The   Magic of Tidying Up” and has been on the New York Times   list for 86 weeks and counting, she was taking the next logical step: a formal training program for her KonMari method, certifying her acolytes to bring the joy and weightlessness and   trajectory of a   life to others. The humble hashtag that attended this event was #organizetheworld. Upon entering the Japan Society, the 93 Konverts in attendance (and me) were given lanyards that contained our information: our names, where we live and an option of either the proud “Tidying Completed!” or the shameful “Tidying Not Yet Completed!” In order to be considered tidy, you must have completed the method outlined in Kondo’s book. It includes something called a “    tidying marathon,” which means piling five categories of material possessions  —   clothing, books, papers, miscellaneous items and sentimental items, including photos, in that order  —   one at a time, surveying how much of each you have, seeing that it’s way too much and then holding each item to see if it sparks joy in your body. The ones that spark joy get to stay. The ones that don’t get a heartfelt and generous goodbye, via actual verbal communication, and are then sent on their way to their next life. This is the crux of the KonMari  —   that     nickname  —   and it is detailed in “The   Magic” and her more recent book, “Spark Joy,” which, as far as I can tell, is a more specific “The   Magic of Tidying Up” but with folding diagrams. She is often mistaken for someone who thinks you shouldn’t own anything, but that’s wrong. Rather, she thinks you can own as much or as little as you like, as long as every possession brings you true joy. Her book was published in the United States in 2014, quietly and to zero fanfare and acclaim. Kondo’s inability to speak English made promotional radio and   appearances hard sells. But one day, a New York Times Home section reporter happened upon the book and wrote an article discussing her own attempt at   her closets the book caught fire. Soon it was the subject of every kind of press: the adoring profile, the women’s magazine listicle, the feminist takedown, the personal essay, the   of harrumph (“The Real Reasons Marie Kondo’s   Magic Doesn’t Work for Parents”) the   folding demonstration, the joke on “The Mindy Project,” a parody book called “The   Magic of Not Giving a [expletive],” and another one called “The Joy of Leaving Your [expletive] All Over the Place. ” By the time her book arrived, America had entered a time of peak stuff, when we had accumulated a mountain of disposable goods  —   from Costco toilet paper to Isaac Mizrahi swimwear by Target  —   but hadn’t (and still haven’t) learned how to dispose of them. We were caught between an older generation that bought a princess phone in 1970 for $25 that was still working and a generation that bought $600 iPhones, knowing they would have to replace them within two years. We had the princess phone and the iPhone, and we couldn’t dispose of either. We were burdened by our stuff we were drowning in it. People had an unnaturally strong reaction to the arrival of this woman and her promises of   magic. There were people who had been doing home organizing for years by then, and they sniffed at her severe methods. (One professional American organizer sent me a picture of a copy of Kondo’s book, annotated with green sticky notes marking where she approved of the advice and pink ones where she disapproved. The green numbered 16 the pink numbered more than 50). But then there were the women who knew that Kondo was speaking directly to them. They called themselves Konverts, and they say their lives have truly changed as a result of using her decluttering methods: They could see their way out of the stuff by aiming upward. At the Japan Society event, we were split into workshop groups, where we explained to one another what had brought us here and what we had got out of “The   Magic of Tidying Up. ” Most of the women at the event could not claim “tidying completed!” status only 27 in the room did, or less than a third. One woman in my group who had finished her tidying, Susan, expressed genuine consternation that a bunch of women who wanted to become KonMari tidying consultants hadn’t even “completed tidying!” How were they going to tidy someone else’s home when they couldn’t even get their own in order? How could they possibly know how profoundly life could improve if they hadn’t yet completed their tidying? A woman named Diana, who wore    earrings, said that before she tidied, her life was out of control. Her job had been recently eliminated when she found the book. “It’s a powerful message for women that you should be surrounded by things that make you happy,” she said, and her and everyone else’s faces engaged in     incredulous agreement, nodding emphatically up and down, skull to spine and chin to chest. “I found the opposite of happiness is not sadness,” Diana told us. “It’s chaos. ” Another woman said she KonMaried a bad boyfriend. Having tidied everything in her home and finding she still distinctly lacked happiness, she held her boyfriend in her hands, realized he no longer sparked joy and got rid of him. During her lecture, Marie demonstrated how the body feels when it finds tidying joy. Her right arm pointed upward, her left leg bent in a display of glee or flying or something aerial and upright, her body arranged I’     and a tiny hand gesture accompanied by a noise that sounded like “kyong. ” Joy isn’t just happy joy is efficient and adorable. A lack of joy, on the other hand, she represented with a different pose, planting both feet and slumping her frame downward with a sudden visible depletion of energy. When Kondo enacted the lack of joy, she appeared grayer and instantly older. There isn’t a specific enough name for the absence of joy it is every emotion that isn’t pure happiness, and maybe it doesn’t deserve a name, so quickly must it be expunged from your life. It does, however, have a sound effect: “zmmp. ” Joy is the only goal, Kondo said, and the room nodded, yes, yes, in emphatic agreement, heads bobbing and mouths agape in wonder that something so simple needed to be taught to them. “My dream is to organize the world,” Kondo said as she wrapped up her talk. The crowd cheered, and Kondo raised her arms into the air like Rocky. She did not set out to become a superpower in the already booming world of professional organization. It just sort of happened to her, a natural outgrowth of a lifelong obsession with carefully curating her belongings. When she was a little girl, she read all of her mother’s homemaking magazines, and as early as elementary school began researching various tidying methods, so disquieted was her brain by her family’s possessions. Kondo recalls that the national library of Japan held a large collection of tidying, decluttering and organizing books, but it didn’t admit anyone under 18. Kondo spent her 18th birthday there. When she was 19, her friends began offering her money for her tidying services. At the time, she was enrolled at Tokyo Woman’s Christian University, studying sociology, with a concentration on gender. She happened upon a book called “Women With Attention Deficit Disorder,” by Sari Solden, and in it there was a discussion over women who are too distracted to clean their homes. Kondo was disturbed that there was little consideration that a man might pick up the slack in this regard, that a woman with A. D. D. was somehow broken because she couldn’t tidy. But, she conceded, buried in this outrageous notion was a core truth: that women have a closer connection to their surroundings than men do. She realized that the work she was doing as a tidying consultant was far more psychological than it was practical. Tidying wasn’t just a function of your physical space it was a function of your soul. After college she found work at a staffing agency but continued to take tidying jobs in the early mornings and late evenings, initially charging $100 per   block. Eventually she quit her job, and soon, even working at tidying full time, the wait list for her services reached six months. When she enters a new home, Kondo says, she sits down in the middle of the floor to greet the space. She says that to fold a shirt the way everyone folds a shirt (a floppy rectangle) instead of the way she thinks you should (a tight mass of dignified   fabric so tensile that it could stand upright) is to deprive that shirt of the dignity it requires to continue its work, i. e. hanging off your shoulders until bedtime. She would like your socks to rest. She would like your coins to be treated with respect. She thinks your tights are choking when you tie them off in the middle. She would like you to thank your clothes for how hard they work and ensure that they get adequate relaxation between wearings. Before you throw them out  —   and hoo boy will you be throwing them out  —   she wants you to thank them for their service. She wants you to thank that blue dress you never wore, tell it how grateful you are that it taught you how blue wasn’t really your color and that you can’t really pull off an empire waist. She wants you to override the instinct to keep a certain thing because an HGTV show or a   magazine or a Pinterest page said it would brighten up your room or make your life better. She wants you to possess your possessions on your own terms, not theirs. (This very simple notion has proved to be incredibly controversial, but more on that later.) She is tiny  —   just   . When I interviewed her, not only did her feet not touch the ground when we were sitting, but her knees didn’t even bend over the side of the couch. When she speaks, she remains   and smiling she moves her hands around, framing the air in front of her, as if she were the director on “Electric Company” or Tom Cruise in “Minority Report. ” The only visible possessions in her hotel room for a   trip from Tokyo were her husband’s laptop and a small silver suitcase the size of a typical man’s briefcase. She has long bangs that obscure her eyebrows, and that fact  —   along with the fact that her mouth never changes from a faint smile  —   contributes to a sense that she is participating in more of a pageant than an interview, which possibly is what it does feel like when   American interviewers whose gargantuan feet do touch the ground come to your hotel room and start jawing at you through an interpreter. Her ankles are skinny but her wrists are muscular. When she shows pictures of herself in places she has tidied, before she starts, she looks like a lost sparrow in a tornado. On the other side, in the “after” picture, it is hard to believe that such a creature could effect such change. Her success has taken her by surprise. She never thought someone could become so famous for tidying that it would be hard to walk down the street in Tokyo. “I feel I am busy all the time and I work all the time,” she said, and she did not seem so happy about this, though her faint smile never wavered. She sticks with speaking and press appearances and relegates her business to her handlers  —   the team of men who pop out of nowhere to surround any woman with a good idea. She feels as if she never has any free time. I spent a few days with her in April, accompanied by her entire operation (eight people total). I attended her “Rachael Ray” appearance, where she was pitted against the show’s   organizer, Peter Walsh, in what must have been the modern talk show’s least fair fight ever. Kondo was asked about her philosophies, and she relayed her answers through her interpreter, but when Walsh countered by explaining why an organizing solution Kondo offered was nice but didn’t quite work in the United States, his response was never translated back to Kondo, so how was she supposed to refute it? She stood to the side, smiling and nodding as he proceeded. Had she been told what Walsh was saying, she would say to him what she said to me, that yes, America is a little different from Japan, but ultimately it’s all the same. We’re all the same in that we’re enticed into the false illusion of happiness through material purchase. Kondo does not feel threatened by different philosophies of organization. “I think his method is pretty great too,” she told me later. She leaves room for something that people don’t often give her credit for: that the KonMari method might not be your speed. “I think it’s good to have different types of organizing methods,” she continued, “because my method might not spark joy with some people, but his method might. ” In Japan, there are at least 30 organizing associations, whereas in the United States we have just one major group, the National Association of Professional Organizers (NAPO). Kondo herself has never heard of NAPO, though she did tell me that she knows that the profession exists in the United States. “I haven’t had a chance to talk to anyone in particular, but what I’ve heard is that thanks to my book and organizing method, now the organizing industry in general kind of bloomed and got a spotlight on it,” she said, though I cannot imagine who told her this. “They kind of thanked me for how my book or method changed the course of the organizing industry in America. ” The women (and maybe three or four men) of NAPO would beg to differ. More than 600 of them descended on Atlanta for NAPO’s annual meeting in May. They refer to this gathering only as Conference, no article, the way that insiders call the C. I. A just C. I. A. I went along, too, in order to better understand the state of stuff in America, and to study Kondo’s competition. When you receive your Conference lanyard, you can add sticky ribbons to it that say anything from your level of participation in NAPO (chapter president, former board member, golden circle, NAPO Cares, etc.) to where you’re from (a choice of the 41 states represented) to what your state of mind is (Diva, Lazy, High Maintenance, Happy to Be Here, Really? Caution: Might Burst Into Show Tunes! ). Once you are completely categorized, you can enjoy Conference. At Conference, I met women who organize basements. I met women who organize digital clutter. I met women who organize photos. I met women who categorized themselves as “solopreneurs,” which, what’s that now? I met a woman who organizes thoughts, and please don’t move onto the next sentence until you’ve truly absorbed that: I met a woman who charges $100 per hour for the organization of thoughts. I heard the word “detritus” pronounced three different ways. I met a woman in camouflage (though the invitation begged us to confine ourselves to our native  ) who carried a clipboard and called herself Major Mom, and instead of an organizer she calls herself a liberator, like in Falluja. I went to a seminar on closets and pantries that I hoped would be, I don’t know, more spiritual than it was, or at the very least address the problem of the cans of beans I keep buying and not using  —   why do I keep buying them? Why am I not using them? Beans are a superfood, after all, and cheap, too. I like beans. But the woman droned on and on and on about shelving units and the pesky corner cabinets, how they misuse valuable space, but luckily there is a drawer or something that could help you fill that space, too, because negative space inside a cabinet is a crime no organizer worth her drawer dividers should find herself guilty of. Conference was different from the KonMari events that I attended. Whereas Kondo does not believe that you need to buy anything in order to organize and that storage systems provide only the illusion of tidiness, the women of Conference traded recon on timesaving apps, label makers, the best kind of Sharpie, the best tool they own (“supersticky notes,” “drawer dividers”) and the best practices regarding clients who wouldn’t offer their organization goals in a timely manner. I heard about the crises in the industry: that clients who printed out Pinterest pages and said, “I want that,” had unrealistic expectations that the baby boomers are downsizing for the first time that there is a rising generation that isn’t interested in inheriting their parents’ old junk. While NAPO members don’t share any standardized method for organizing  —   the group offers certification classes, but each woman I spoke with has her own approach  —   they are fairly unified in their disdain for this Japanese interloper. They have waged a war through their fuming blog posts and their generally disgusted conversations, saying that she is a product only of good marketing, that she’s not doing anything different from what they’ve been doing since she was in diapers. They don’t like that there’s a prescribed order for tidying they think you have to yield to what your client wants done and has time for. They don’t like the     tidying marathon, which on average is completed in six months sometimes organizing is a many years effort or an ongoing one. They don’t like that she hasn’t really addressed what to do with all your kids’ stuff and how to handle them. They don’t like that you have to get rid of all of your papers, which is actually a misnomer: Kondo just says you should limit them because they’re incapable of sparking joy, and you should confine them to three folders: needs immediate attention, must be kept for now, must be kept forever. At the     show, I stood in front of the booth of a man advertising his cleaning service, which can tidy up crime scenes as well as hoarders’ homes, and I asked some women eating spring rolls what they had against Kondo. The nice ones, struggling for something that wasn’t overtly bitchy to say, said they appreciated that the popularity of her book has brought attention to their industry, which still lobbies to be recognized by the government as an official occupation. (Until that happens, the NAPO women will have to continue calling themselves “interior designers” or “personal assistants” they would prefer “productivity consultants. ”) But they also feel as if they’ve been doing this for years, that “she just has one hell of a marketing machine, but she’s doing nothing that’s so different from us,” at least three of them said to me. Yet each organizer I spoke with said that she had the same fundamental plan that Kondo did, that the client should purge (they cry “purge” for what Kondo gently calls “discarding”) what is no longer needed or wanted somehow the extra step of thanking the object or folding it a little differently enrages them. This rage hides behind the notion that things are different here in America, that our lives are more complicated and our stuff is more burdensome and our decisions are harder to make. “It’s a book if you’re a   Japanese girl and you live at home and you still have a bunch of your Hello Kitty toys and stuff,” another NAPO member told me, which, while not the only thing a professional organizer told me that was tinged with an aggressive xenophobia and racism, it is the only one that can run in a New York Times article. They even hate Kondo’s verbiage. The word she uses, “tidying,” is annoying and arcane to them. “Tidying is what you do before your    comes over,” said one woman, while her two friends nodded. In addition, what Kondo offers is limited. Ellen Faye, the president of NAPO, told me the night before: “You know, I have a client who got me the book, who said, ‘Here, Ellen, read the book.’ I did page through it. I think her first book is kind of like the grapefruit diet that there’s nothing wrong with just eating grapefruit. It’s not going to get it all done. I mean grapefruit’s great for losing weight, and what she says is great for bringing order to your life, but it’s not the whole picture. It’s just a narrow slice. ” Ultimately, the women of NAPO said that Kondo’s methods were too draconian and that the clients they knew couldn’t live in Kondo’s world. They had jobs and children, and they needed baby steps and   and maintenance plans. They needed someone to do for them what they couldn’t naturally do for themselves. At the lounge, which included space for mindful coloring, I suggested to the organizers present that maybe the most potent difference between Kondo and the NAPO women is that the NAPO women seek to make a client’s life good by organizing their stuff Kondo, on the other hand, leads with her spiritual mission, to change their lives through magic. With her rigid     tidying marathon directive (no baby steps, no “slow and steady wins the race”) she is a little like the grapefruit diet: simple and extreme and incredibly hard, the way Americans like our renewal plans. A woman who was coloring heard my theory and rolled her eyes. Her name was Heather Ahern, an organizer in Massachusetts for nearly 13 years, and she deals mostly with a clientele who were surviving something hard: divorce, death, loss  —   when, for example, their loved ones have no idea how to access any of their online accounts and delete them. “Do you know how many dead people are on LinkedIn?” she asked me. (The correct answer to this is not: I don’t know, all of them?) “For some of my clients, just making it better is O. K.,” she said. “They don’t want a perfect house. There is no perfect house. ” But Kondo would agree with that. “I guess it’s the process,” Ahern said of what bothers her most about Kondo. Ahern’s philosophy is about process as much as about results. “I see that my clients are just too fragile to do that,” she said. We got up to go back to our rooms to briefly abandon our   casual for formal in preparation for the Black and White Ball, where the NAPO women would cut loose as much as their personalities would allow them by doing karaoke to Eminem and dancing to “Baby Got Back. ” Jenny Ning was   about being one of Kondo’s only employees who had not yet finished tidying(! ). What could Kondo possibly think of an employee representing KonMari Inc. to her American base not having her own house in order? We’d been through a lot together, Ning and I. Kondo needed an interpreter to speak with me, so I spent a lot of my reporting time outside our interviews with Ning. We attended the events and meetings, clueless in our    and I watched as she negotiated decisions about the certification program, which will cost around $1, 500 for a   session, and a newsletter they were toying with. Last year, when Kondo visited San Francisco, she came to Ning’s studio apartment, and Ning said she felt very ashamed when Kondo opened her closet. Kondo would visit San Francisco again to introduce the consultancy and maybe even before, and Ning told me she wanted to tidy and to show Kondo the progress. I asked if I could come along and maybe help Ning complete her tidying. When Ning was little, she loved to collect things: stamps, stickers, pencils. She was never overwhelmed by her stuff. She thinks of her childhood bedroom as “very happy. ” But as she grew into adulthood, she kept buying clothing: far too much of it. She went to work in finance, but she found the work empty and meaningless. She would come home and find herself overwhelmed by her stuff. So she began searching for “minimalism” on the internet almost constantly, happening on Pinterest pages of beautiful, empty bathrooms and kitchens, and she began to imagine that it was her stuff that was weighing her down. She read philosophy blogs about materialism and the accumulation of objects. “They just all talked about feeling lighter,” she said, with one leg folded under her and another on the floor as she sat on her bed, which no longer sparks joy and which she would sell in the coming weeks. Ning wanted that lightness. And here, at this moment in the story, Ning began to cry. “I never knew how to get here from there,” she said. Ning looked around her apartment, which is spare. She loves it here now, but that seemed impossible just a couple of years ago. She found Kondo’s book, and she felt better immediately, just having read it. She began tidying, and immediately she lost three pounds. She had been trying to lose weight forever, and then suddenly, without effort, three pounds, just gone. One day, she was texting a friend, saying that she thought she could live her ideal life if only she could work as Kondo’s assistant. It happened that Kondo was in San Francisco and, even better, she was speaking across the street from Ning’s finance job. After the talk, Ning tried to speak with Kondo, but she walked away with only a KonMari business card from one of Kondo’s associates. She didn’t hear anything initially when she wrote to the address. Undeterred, she quit her job and arranged a trip to Japan. There, she finally talked to associates of Kondo’s who told her of their plans to expand into the United States. Could Ning help? Could she! Ning worked free for KonMari Inc. for five months, before landing a salaried position. She donated the suits that she wore to her finance job and hung up all of her yoga clothing in her closet, even though, technically, KonMari does not endorse hanging leisure wear, but that is all she wears now, and all I’ve seen her wear, from the yoga class we did together to the professional events we attended. Ning has thrown away her collections. She has gone to her family’s home in San Diego and thrown away whatever was left there too. She wiped her tears and leaned in and told me, like a secret, that she has kept one collection: the stickers. She asked me if I wanted to see her album. She pulled it out from under her bed, pages and pages of Snoopy stickers and stickers of frogs and cupcakes and bunnies in raincoats playing in puddles and Easter baskets. She smiled down at them and touched a few while I thumbed through the pages. She asked if I wanted to watch her KonMari her pantry, and I said yes, of course I did. I sat next to her shelf full of books with names like “Secrets of  ” and “Move Your Stuff, Change Your Life” and “How to Be Idle” and “The Art of Serenity. ” We threw away expired gum and some Chinese healing herbs whose purpose Ning could no longer remember. A week later I was on another assignment, still using the same notebook from the Kondo story. As I flipped through it, passing through the pages of my notes from my time with Ning, I noticed that a tiny blue butterfly sticker had escaped her collection and landed on a page. When I saw the sticker, I froze and put my finger on it. I had had a sticker album, too. It had stickers that smelled like candy canes and purple. It had bubbly heart stickers and star stickers and Mork  Mindy stickers and Peanuts stickers, too. I went abroad for a year to Israel after high school. While I was there, the boiler in my house in Brooklyn exploded and a soot fire destroyed all our possessions. “Everyone is O. K. but there was a fire,” my father said when I called. What happened after I got off the phone still confounds me: I returned to my dorm room, and when my roommate asked me how things were at home, I told her they were fine, and we went to sleep. In the middle of the night, I woke my roommate up, telling her that my house burned down. She told me it was a dream, and I kept telling her I had just forgotten to tell her. She didn’t believe me for days. I never saw my sticker album again. I never saw anything again. After the place was cleared out, my mother was able to save a few photo albums, because they were closed when the soot invaded the basement and covered and ruined all the surfaces. When I look at the pictures, I don’t ever notice how young or cute my sisters and I were. I look in the background for the items that lie in the incidental path of my mother’s Canon. I try to remember what they smelled like or why we owned them or where we put them. I try to think of what my life would have been like if I’d returned home to what I left behind, the way my friends were able to return to their homes to what they’d left behind and keep returning, after they finished college and after they got married and after they had kids. I try to think of who I’d be if I weren’t in the habit of looking at my home before I left it each day and mentally preparing myself for the possibility that nothing I owned would be there when I got home that night. I try to know what feelings my lost objects, which I forget more and more as the years pass, would evoke if I could hold them in my hands, KonMari style, like a new kitten. Some would bring joy and some would not, but I’m not someone who thinks that joy is the only valid emotion. I try to remember what I no longer can because, in terms of my possessions, it is as if I was born on my 19th birthday. The reason I bring this up is to tell you that you could not have any stuff at all, much less too much stuff, and still be totally messed up about it. The reason I tell you this is so that you know that that tiny butterfly sticker has been the same burden to me as any hoarder’s yield. Nostalgia is a beast, and that is either a good reason to KonMari your life, or a terrible one, depending on how you want to live. The last time I saw Marie Kondo, we were in a hotel room in Midtown, a different one, and still the only visible objects in it were that metal suitcase and her husband’s laptop. But one item had been removed from the suitcase: a spray bottle that she keeps around. She sprays it into the air and the scent signals to her that she is finished working for the day, that her obligations, which seem endless lately, are done. I told her that, to my observation, a company trying to grow the way hers was trying to grow seemed at odds with the personality of someone who required such extreme measures for peace in the first place. “I do feel overwhelmed,” she told me, and she gave me one note of a quiet laugh. People demand a lot of her, not really understanding that you don’t go into a business like tidying if you’re able to handle a normal influx of activity and material. The world really likes her for her quirks. They make for good headlines and they certainly sell books, but nobody seems to be able to truly accept and accommodate them. I think the NAPO women have Kondo wrong. She is not one of them, intent on competing for their market share. She is not part of a breed of   “solopreneurs” bent on dominating the world, despite her hashtag. She has more in common with her clients. But when it comes to stuff, we are all the same. Once we’ve divided all the drawers and eliminated that which does not bring us joy and categorized ourselves within an inch of our lives, we’ll find that the person lying beneath all the stuff was still just plain old us. We are all a mess, even when we’re done tidying. At least Kondo knows it. “I was always more comfortable talking to objects than people,” she told me. At that moment, I could tell that if she had her way, I would leave the hotel room and she would spray her spray and be left alone, so she could ask the empty room if she could clean it.'"}, "time": 1742563340.0170338}