{"duration": 0.09939980506896973, "input_args": {"text": "'A judge in Maryland has granted a new trial to Adnan Syed, setting aside his conviction for the 1999 murder of his former girlfriend, in a case that was the subject of the first season of the hit podcast “Serial. ” Mr. Syed’s lawyer, C. Justin Brown, posted the news on Twitter on Thursday afternoon and confirmed by phone that the motion for a new trial had been granted by Judge Martin P. Welch of the Baltimore City Circuit Court. The decision to grant Mr. Syed, 35, a retrial was a major victory for an inmate who has long maintained his innocence and has exhausted all other avenues of appeal. He was convicted in 2000 in the murder of his former girlfriend, Hae Min Lee, and had served 16 years of a life sentence. “Serial” turned speculation about Mr. Syed’s guilt and whether he had received a fair trial into something of a national pastime in 2014. The show was downloaded more than 100 million times and won a Peabody Award for its role in illuminating flaws in the criminal justice system. At a news conference in Baltimore, Mr. Brown was asked if he thought there was any chance that the retrial could have come about without “Serial. ” “I don’t think so,” he said. On the possibility that Mr. Syed may eventually go free, Mr. Brown said: “I’m feeling pretty confident right now. This was the biggest hurdle. It’s really hard to get a new trial. ” On Thursday, Mr. Brown said that he had not been able to reach Mr. Syed to tell him the news, but by Friday, he said in a post on Twitter that his client had been “informed of the decision. ” The family of Ms. Lee has expressed pain and outrage at the attention surrounding Mr. Syed’s bid for a new trial. In a statement released through the Maryland Attorney General’s Office on Friday, the family said: “We continue to grieve. We continue to believe justice was done when Mr. Syed was convicted of killing Hae. ” For its part, the Attorney General’s Office said Thursday night that it had a responsibility to keep pursuing justice and “to defend what it believes is a valid conviction. ” Mr. Syed’s brother, Yusuf, 26, said in an interview on Thursday that the family had high hopes for a favorable decision, based on the strength of the legal arguments and the outpouring of support. “We really felt 100 percent that the judge would rule in our favor,” he said, adding, “We’ve been waiting 20 years for this. ” Rabia Chaudry, a family friend of Mr. Syed’s who introduced Sarah Koenig, the host of “Serial,” to the case, celebrated the decision online, thanking the judge and witnesses, among others. A production manager for “Serial,” Emily Condon, declined to comment on Thursday. The judge’s decision came after three days of postconviction hearings in February. Mr. Syed and his legal team had presented new evidence, including the testimony of a new alibi witness, and argued that his original defense counsel had been grossly negligent. The   proceedings were held before Judge Welch, a retired judge, who had granted Mr. Syed’s request for a hearing in November. Mr. Syed first filed a request for a postconviction hearing in 2010, but was denied. Mr. Syed’s defense had argued in February that the decision by Mr. Syed’s lawyer in the original trial, Maria Cristina Gutierrez, not to question a state’s expert, Abraham Waranowitz, about the reliability of evidence relating to cellphone towers constituted ineffective assistance. The judge’s decision to grant Mr. Syed a new trial turned on that issue. In a memo, Judge Welch wrote that Ms. Gutierrez’s failure to question Mr. Waranowitz “created a substantial possibility that the result of the trial was fundamentally unreliable. ” Judge Welch also said in the memo that the substantial public interest in the case did not affect his decision. “Regardless of the public interest surrounding this case, the court used its best efforts to address the merits of petitioner’s petition for postconviction relief like it would in any other case that comes before the court unfettered by sympathy, prejudice, or public opinion,” he wrote. Ms. Gutierrez was a prominent Baltimore defense lawyer in the 1990s whose career crumbled in 2001 when she was disbarred by consent after a state commission uncovered financial improprieties involving her clients. She told The Baltimore Sun at the time that her legal practice suffered in part because of her severe medical problems related to multiple sclerosis. She died of a heart attack in 2004. On Thursday, hundreds of fans of “Serial” took to social media, some of them to celebrate and others to emphasize that they still believed Mr. Syed was guilty. The podcast recently ended its second season, which told the story of Bowe Bergdahl, an American soldier in Afghanistan who was captured by the Taliban in 2009 and released as part of a prisoner swap in 2014.'"}, "time": 1742561712.1965814}