{"duration": 0.03436422348022461, "input_args": {"text": "'President Donald Trump signed two bills on Friday assisting law enforcement officers, vowing to back the community “100 percent. ”[“We are here today to reaffirm our unbreakable support for the American heroes who keep our streets, our homes, and our citizens safe, and they’ve been doing an amazing job under very adverse conditions,” Trump said during a signing ceremony at the White House.  Trump signed the Public Safety Officers’ Benefits Improvement Act, a bill to help streamline benefits for disabled officers and the families of fallen officers. “For too long, injured officers have suffered, and the children of fallen officers have put their dreams of college on hold while bureaucracy delayed crucial benefits, made it impossible for their families,” Trump said. “No longer. It’s unacceptable, and it’s going to end today. ” Trump also signed the American Law Enforcement Heroes Act, a bill allowing federal grants to help military veterans transition to careers in law enforcement. “America is proud of our veterans, and I think I can say a double proud or a triple proud,” he said. Referring to his decision to withdraw the United States from the Paris climate agreement, Trump joked that the two bills he signed Friday were “slightly less controversial than yesterday. ” Several members of the law enforcement community joined Trump in the Diplomatic Reception Room for the signing ceremony, including representatives from the Fraternal Order of Police and the National Sheriffs’ Association. Law enforcement officers from Maryland, Pennsylvania, Ohio, California, and Virginia were also present. “When a home is threatened, when danger visits our doorstep, when innocent lives are on the line, Americans turn to their courageous officers of law enforcement because we know they are here to serve and to protect us all,” Trump said, thanking them.'"}, "time": 1742562679.586304}