{"duration": 0.0692143440246582, "input_args": {"text": "'Home This Month Popular Are You On Pace To Reach Your Goals? Are You On Pace To Reach Your Goals? February 2, 2013 20 Comments Lifestyle \\nToday is February 2, 2013 and you’re one month closer to death. What have you done this year to improve yourself? Some may say New Years resolutions are cop-outs for actually setting reasonable goals, instead of starting today we say “In a week I’ll hit the gym and finally get ripped!” I like the idea of coming up with goals and plans to achieve them for January 1st of the next year. The start of each year is a mental rebirth, January 1 is a new snow begging for you to make fresh tracks in it, a blank canvas yearning to be painted on. \\nHowever, many do use New Years resolutions to feel better about themselves. They gorge themselves on baked goods, drink heartily and fail to exercise throughout the month of December telling themselves that “next year will be different” and “just one last time before I change.” This is not the case for us here at Return of Kings. We are different — writers, readers, and commenters all strive to build themselves into the man they want to be. \\nPersonally, I had some slip-ups through the month of January, but what sets the determined apart from the shambling masses is that we pick ourselves up and keep pushing forward one step at a time . I started the year off strong my days and nights booked full with dates, time with girlfriends, reconnecting with old friends. I eschewed online dating and become more social during the day time. I broke PRs on all of my lifts, dropped a few pounds, and sought coaching for the Olympic lifts. \\nMost importantly I held myself accountable for all of my actions. If I ate too much, drank too much or didn’t take opportunities I should have, I picked myself up and adapted. Push forward and give everything you have. How bad do you want it? What happens when you reach your goal? Do you aim higher, or do you stop there and remain content with being slightly above average ? If you choose the latter and have finite, concrete goals you are already anticipating the day you can quit building yourself. You’re doomed for failure.Don’t ever miss an opportunity to get better , take risks , analyze your successes/failures, and don’t stop until you’ve surpassed your goals. Then strive to be better, faster and stronger. \\nWhat are your goals for 2013? Are they SMART ? Do you have a purpose ? Do you want to have sex with more beautiful women, learn a language , lift more weight and make more money? Do you have an accountability buddy or do you journal and meticulously track your progress? \\nHow is your progress going? Feb 2, 2013 Western Cancer'"}, "time": 1742564606.7355237}