{"duration": 0.10718441009521484, "input_args": {"text": "'Print Email http://humansarefree.com/2016/11/overpopulation-lie-debunked-us-farmland.html Daily the mainstream media bombards us with news articles reinforcing the idea that humans are infesting the planet and overpopulating it like parasites sucking it dry of its resources. These bureaucrats have managed to convinced millions of their scheme, when in fact, it’s all a part of their plan to shove the ‘mass death’ agenda down people’s throats all while claiming they are ‘saving the Earth!’ It’s absurd! The truth is if all 6.9 billion of us stood shoulder to shoulder and gathered together in the same general location it would fill only the state of Los Angeles. Or if everyone in the world was given a small house and yard and were once again gathered together in the same general location, it would fill only the states of Texas, California, and New Mexico with room to spare.Don’t believe me? Let’s do the math. Texas has 171 million acres, California has 101 million acres, and New Mexico has 77 million acres , which is a grand total of 349 million acres of land. We can safely assume most households house two persons, (usually it’s more, but we’ll stick with two) If each household was given 0.10 acre (or 20 people per acre because there are 2 persons per household; which leaves plenty of room for a house and land); then we would have the total number of occupants at 6,980,000,000 persons (349 million acres x 20 people per acre). Which is more than enough room to house our 6,900,000,000 population. Keep in mind this doesn’t even take into consideration people living in apartments. The demographics can change based on how people are concentrated. See the map below. Thomas Malthus’ Overpopulation Lie Thomas Malthus, who is the originator of the overpopulation lie, was a British mathematician. His most studied work, “ An Essay on the Principle of Population as it Affects the Future Improvements of Society, with Remarks on the Speculations of M. Godwin, M. Condorcet and Other Writers ,” was first published around the late 1700′s. In it he stated, “Overpopulation would destroy the world unless war, famine, and disease rose to check human growth.” He theorized that when population increased and food production increased only arithmetically, then food production would no longer be able to keep up with the populace. He then declared that the world would be out of food by the year 1890. Obviously he was dead wrong and yet we still see his principles applied today. But how realistic is his belief that food would not keep up with demand? Consider this, it takes about 300 sq. meters to feed one person for a year. Since a kilometer is 1,000 meters, we could feed 3,333 people per sq. kilometer, but let’s use 3,000 people per sq. kilometer to make math easy. Meaning it would take 2,333,333 sq. kilometers (or 3000 ÷ 7,000,000,000) to feed the entire population for a year. The total farmland in the US is about 922,000,000 acres of land . There are 247.1 acres per sq. kilometer , meaning there is a total of 3,731,282 sq. kilometers (or 922,000,000 ÷ 247.1) of farm land. That’s more than the 2,333,333 sq. kilometers needed to feed the entire population. In other words, the farmland in the US can feed us all! So why does the Government Continue to Insist we are Overpopulated? That’s simple… MONEY, MONEY, MONEY, MONEY, MONEY! Along with many major corporations, they seek any opportunity to be billionaires. But even worse, these power elite — per the Georgia Guidestones — desire serious population reduction. Instead of the 6.9 billion population, they desire 500,000,000 people. Ultimately, their end game is EUGENICS! Al Gore , Bill Gates , Ted Turner , and others like them, are using their power, wealth, and influence to manipulate the masses. They believe they can decide who is worthy to live and die. Their eugenics agenda lives on, and the bought and controlled media continues to churn out propaganda telling us we have to die so that the Earth (and the elite) may live on. What a load of crap! In conclusion the world’s population is declining not increasing. As I see it fertility rates are rising, abortions are skyrocketing, contraception are in high demand, governments are limiting the number of children in China, we are eating sterilizing foods, and drinking fluoride water, which are all preventing us from any major population growth. Eventually we’ll enter a new paradigm in which the elderly outnumber the younger. In 30 years or so well see the full effect of what the power elite have in store for us. By Lisa Haven / Cover image Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related'"}, "time": 1742563872.3354185}