{"duration": 0.44960808753967285, "input_args": {"text": "'1681 Views November 15, 2016 No Comments Analyses The Saker \\nBy Aram Mirzaei \\nDescribed by the Western media as a “shadowy organization” involved in “clandestine activity” across the Middle East, not much is truly known about the “Islamic Revolutionary Guards Corps” (IRGC) in the West as Western governments and media outlets are having an increasingly difficult time figuring out the IRGC and the role it plays in both the domestic and foreign relations of Iran. You can’t understand Iran and its politics without understanding the IRGC, why it was formed and what role it plays in Iranian politics. \\nGuardians of the revolution- The Pasdaran and other armed revolutionary organizations \\nFormed on May 5 1979 following the Islamic Revolution, the Sepah Pasdaran-e Enghelabe Eslami (Army of Guardians of the Islamic Revolution, in Iran more commonly referred to simply as ‘Pasdaran’, meaning Guardians) was created to unite the different paramilitary forces that were present in the post-revolutionary Iran, to form a single force, loyal to the revolutionary government and to function as a counter balance to the influence and power of the regular military (Artesh) which was seen as untrustworthy because of its traditional loyalty to the Shah. \\nWhen the Pasdaran was created by decree from Ayatollah Khomeini in May 1979, its original members consisted of some 6,000 militia men who had fought the Pahlavi regime even before 1978, many of which had received guerrilla training with Palestinian and Lebanese groups, most notably the Shia Amal militia in Lebanon. \\nMany of the forces that had helped topple the Shah’s Pahlavi regime, like the Fedayeen-e Khalq and Mujahedin-e Khalq, had formed their own organized militias in the struggle, and many more armed groups were created more or less spontaneously during the chaos of the Revolution, as the raiding of armouries and army barracks made weapons widely available to opposition groups. The existence of many independent armed groupings certainly represented a potential threat to any one political faction trying to impose its authority over the post-revolutionary Iranian state. Although eventually growing to become the most important of the paramilitary organizations, the Pasdaran did face its fair share of competitors in enforcing revolutionary ideals. A particular challenge to the Pasdaran’s authority was posed by the plethora of komitehs (committees), makeshift, freelance bands of local Islamists that took control and allocated to themselves the powers of justice and administration over assorted neighbourhoods throughout the major cities of the Islamic Republic as the Pahlavi regime’s authority began to collapse. The triumph of the Pasdaran over these other organizations and centres of power was never preordained, but ultimately derived from the Pasdaran’s superior effectiveness as a guard for the emerging revolutionary government of Ayatollah Khomeini. \\nThe Pasdaran was from its inception an ideologically driven force that recruited heavily from the faithful supporters of the revolution’s spiritual leader Ayatollah Ruhollah Khomeini. Drawing lessons from the US and UK backed 1953 coup d’etat which saw the overthrow of the democratically elected government of Prime Minister Mohammad Mossadegh in favour of the young Shah Mohammad Reza Pahlavi, the revolution needed to rely on a force of its own rather than borrowing the previous Pahlavi regime’s units. Being one of the first revolutionary institutions, the Pasdaran legitimized the revolution and gave the government an armed basis of support to defend itself. Despite this move to counter the regular army of Iran, Ayatollah Khomeini decided not to disband the army altogether since he realized the dangers of doing this, as thousands of servicemen becoming unemployed would turn into potential enemies of the revolutionary government. Rather Khomeini replaced the Army’s commanders and wanted the Army and the Pasdaran to not view each other as rivals, but rather as two branches of the armed forces working towards a common goal. \\nThe Basij – The people’s militia \\nOn November 25 1979, Ayatollah Khomeini called for the creation of a youth militia which according to him should be a 20-million-man strong force. Article 151 of the constitution obliges the government to “provide a program of military training, with all requisite facilities, for all its citizens, in accordance with the Islamic criteria, in such a way that all citizens will always be able to engage in the armed defence of the Islamic Republic of Iran.” Formed through a merger of the komitehs (committees) and other various youth movements, the Sazman- Basij-e Mostazafin (The organization for mobilization of the oppressed), commonly known as simply Basij (the organized) was created in April 1980. \\nThe Basij was to serve as an auxiliary force engaged in activities such as internal security, law enforcement, organizing religious activities and ceremonies, and to help the revolutionary government in fighting against Baluchi, Kurdish and Turkmen separatists in the remote regions of Iran. While the Pasdaran was mainly open for men older than the age of 18, the Basij was intended to be for the youth, however people of all walks of life were eligible to join this organization. The Basij came to open local offices in almost every corner of Iranian cities, with every neighbourhood in every Iranian city having a local Basij office to both recruit people and to defend the Islamic Revolution during its first unstable years. \\nIn time, the Basij, along with the Pasdaran were to become an integral part of the revolutionary government’s ability to resist its enemies, both internal and external ones. \\nThe Nojeh coup plot of 1980 \\nIn 1980, the Basij helped to prevent a coup planned to overthrow the newly established revolutionary government when several officers and servicemen from the Iranian Army and former secret service loyal to the Shah were arrested at the Nojeh Air Base near Hamedan in western Iran. The plan was organized by Colonel Mohammad Baqer Bani Amiri, with the help of Shapour Bakhtiar, the last Prime Minister of the Pahlavi regime who provided financial support. The plan was also said to have been supported by Iran’s future arch-enemy, Saddam Hussein who had developed a deep animosity towards the revolutionary government. According to then-Iranian President Abolhassan Banisadr, the government discovered eight major cells, and exposed the plotters’ plan, leading to the arrests: “their plan was to give the appearance of a coup d’etat to restore the Shah, while the real aim was to provide a pretext to cover the Iraqi invasion. According to the information we received, the conspirators had set up a military camp in [the Iraqi city of] Solimanieh and planned to ignite a Kurdish revolt and organize demonstrations throughout Iran. Their strategy was simple: internal disorders would first disperse Iranian military forces, so that on the very first day of the Iraqi attack Saddam could occupy the whole Western part of the country.” According to the Basij themselves, a Basij member was planted inside the conspirators’ group and kept the revolutionary government informed of the activities of the counterrevolutionaries. This enabled them to swiftly act and prevent the coup attempt. \\nThe Iran-Iraq War \\nAs a result of the revolutionary government’s attempt to neutralize the potential threat of the Army acting as a counter-revolutionary force, the Army went down from 285,000 to around 150,000 troops at the outbreak the Iran-Iraq war. Perhaps even more damaging for the Iranian Army’s ability to conduct military operations was the forced removal of some 12,000 skilled and trained officers, constituting between 30 and 50 percent of the Iranian officer corps from the rank of major to colonel. Despite these difficulties on the Iranian side however, Saddam Hussein’s gamble that the time was ripe to strike a blow to his neighbouring country was proven to be a major miscalculation. For the revolutionary government, the war was treated as the perfect opportunity to demonstrate the resilience and vitality of the Iranian Revolution to the world. The Iranian people quickly mobilized and rallied to the defence of their country with great patriotic zeal, the Pasdaran developed to take on the size and shape of a full-fledged conventional army to counter the Iraqi threat posed against the gains of the Islamic Revolution. \\nThe Pasdaran’s role was largely focused on internal threats to the Islamic Republic, as opposed to the strictly external focus of the regular Army, however this was to quickly change with the Iraqi invasion as the revolutionary government advocated the rise and expansion of the Pasdaran to conduct large-scale military combat operations, unwilling to leave the fate of the Islamic Republic in the hands of the still strongly distrusted remnants of the professional and modernized Army of the Shah \\nThe war which came to be known in Iran as the Holy Defence thus became a defining moment for the Pasdaran, greatly expanding its responsibilities and importance within the emerging revolutionary Iranian state-structure. Relations between the Pasdaran and the regular Army throughout the war remained strained by mutual suspicions, historical grievances and resentments, political differences and uncertainty. A particularly recurring point of contention between the two organizations concerned the reliance on different military tactics,with the professional military insisting on well-planned and well-organized operations, while the ideologically driven Pasdaran argued that religious and nationalistic zeal, determination and superiority in manpower were enough. Pasdaran commander Mohsen Rezaei once asserted that: \\n“Unlike the army […] the Islamic Revolution Guards Corps is in charge of safeguarding the revolution and its gains […]. we in the Revolutionary Guards give primary importance to the ideological and political dimensions more than the military ones.” \\nThe Pasdaran came to see itself as embodying the spirit of the Islamic Revolution, where the will and dedication of the Iranian people had won out over the professional, modernized and “culturally contaminated” security organizations of the Shah’s Pahlavi regime, and sought to wage the war against Iraq along the same lines. This in practice meant a heavy reliance on lightly armed and manpower-intensive infantry attacks, with the ultimate goal of attaining Martyrdom, while the regular Army stressed the importance of conventional tactics incorporating modern, mechanized means of warfare. This constant rivalry severely complicated the ability of the Pasdaran and the Army to perform joint combat operations, and with the Revolutionary government tightening its grip over Iranian society, the favoured Pasdaran increasingly got the last say in the planning and execution of the Iranian war effort. \\nThe already close relationship between the Pasdaran and the Clerical establishment (Ulema) became even more apparent during the course of the Iran-Iraq War with several members of the Ulema joining the Pasdaran on the frontlines as part of a morale boost campaign, among them a young Ayatollah Khamenei dressed in a Pasdaran uniform. \\nThe Pasdaran enjoyed numerous privileges over the Army during the war, including superior pay and benefits and first call upon available arms and spare parts. With the Iranian population rushing to the defence of their country, the Pasdaran, soon developed from a revolutionary militia into an organized armed force outnumbering and rivalling the structure of the regular Iranian Army by absorbing and organising the thousands of highly motivated volunteers that flocked to the warfront. The extensive numerical increase in Pasdaran forces alone testify to their rise in power and influence during the war, doubling from some 20,000 – 30,000 in 1980 to around 50,000 during the first year of warfare, this number further increasing nine-fold by 1987, with the total forces of the Pasdaran consisting of close to 450,000 men as the war entered its final year. \\nThe Pasdaran’s manpower was mobilized through local-level branches of the Pasdaran offices that were established throughout Iran in parallel with the development of the Pasdaran’s national command structure. Many of the lower-level branches grew out of the komitehs or other groups that had seized power in their respective areas in the course of the Revolution, and above the local level the Pasdaran was organized into ten administrative regions, largely corresponding to the then-Iranian provinces. On top of these were the Supreme Council of the Sepah Pasdaran and the Pasdaran Commander. \\nOf the Pasdaran’s original members many belonged to the Mujahedin of the Islamic Revolution (MIR), a group loyal to Ayatollah Khomeini that was established in the course of the Revolution. Many MIR-members had left the Mujahedin-e Khalq (MEK) because of the MEK’s emphasis on what they perceived to be Marxist over Islamic ideology (the latter became an archenemy of the Islamic Republic in later years), the MIR strongly supported the Islamic character of the revolution. MIR members formed the leadership and the core of the Pasdaran, and this first group generally tended to be better educated and more politically sophisticated than the zealous volunteers that later flocked to the Pasdaran. \\nAlthough relying heavily on ideologically zealous manpower in massive infantry attacks at first, the Pasdaran came to incorporate more sophisticated armed services during the course of the Iran-Iraq War. The Pasdaran soon developed its own armoured and artillery units to reduce its reliance on the regular Army within these fields, and from September 1986 the Pasdaran also started with advanced artillery training. The Pasdaran further rivalled the structure of the Army by creating its own Air Force and Naval Forces, thus expanding into many areas that had previously been the sole domain of the Iranian Army inherited from the Shah’s days. The creation of the Sepah Pasdaran Air Force did however not play a significant role in the war due to the international arms embargo preventing Iran from importing new weapons or spare parts for the aircrafts left behind by the former Shah’s Air Force. \\nThe Sepah Pasdaran Air Force (later Aerospace forces) did however develop several missile units for air defence against Iraqi aircraft, and managed to fire several surface-to-surface SCUD missiles against military and civilian installations in Iraq. Despite its moderate participation in the war effort, the establishment of the Pasdaran Air Force nevertheless served as a symbol of the Pasdaran’s increased responsibilities and influence. The Sepah Pasdaran Navy however saw more direct action in the Iran-Iraq War. Unofficially in existence since 1982, it participated in the successful 1986 Faw offensive, and was formally inaugurated in 1987 to retaliate against Iraqi attacks on Iranian ships. In the last year of the war, from 1987-88, the Pasdaran Navy was given resources and publicity for its challenge to the US naval build-up in the Gulf, employing hit-and-run tactics from small naval crafts armed with RPG-7’s and missile units armed with Chinese Silkworm surface-to-surface missiles to harass US ships and reflagged tankers. \\nBasij during the war \\nAnother important component of the Pasdaran’s military forces was provided by the Basij-e Mostazafan. The Basij was as previously explained a mass mobilising popular volunteer militia, created following the call from Ayatollah Khomeini to establish a “20 million-man army” to defend the Islamic Republic from both internal and external enemies following the Iraqi invasion. Although the Basij as an organization was officially separate from the Pasdaran during the war and had its own commander, in practice it has always been part of the Pasdaran. The Basij was formally placed under Pasdaran control on January 1 1981, and the Pasdaran recruited, organized, trained and commanded all Basij units during the war, although it was not until 2009 that the control structure of the Basij was officially merged with that of the Pasdaran. The Basij served as a reserve pool of manpower for the Pasdaran, and military training for basijis generally consisted of a two week instruction program in the use of grenades and automatic rifles, heavily imbued with religious and ideological indoctrination with a focus on martyrdom and the promise of heaven for those killed in the war. The Basij was originally a volunteer and not a fixed force, whose members usually served a brief three month tour before returning to their homes, jobs or studies, and seasonal fluctuations made it hard to contemplate the exact capabilities of the basijis. The Basij nevertheless played an integral part in the Iranian war effort, and although the number of readily available basijis probably seldom exceeded 100,000 at any one time, by 1987 some 3 million Iranians had received Basij training, adding substantially to the potential power of the Pasdaran in a scenario of all-out mobilization. The creation of the Basij was thus another development strongly contributing to the rise of the Pasdaran in the course of the Iran-Iraq war. \\nAccording to an Iranian source personally close to me and speaking on the condition of anonymity, the creation of the Basij played an instrumental role in mobilizing the Iranian people to defend Iran from the Iraqi invasion. Every local Basij office was flocked with boys as young as 12 years old who wanted to join what became known as the Holy Defence in Iran. Mothers were proud of sending their sons to the front and according to the same Iranian source, young boys used to run away from home to join the Basij, often leaving behind them letters where they would apologize to their parents for running away but that they were proud to defend their homeland. These boys would often assume non-combat roles on the frontlines, such as cleaning weapons for the Pasdaran, cooking food for the soldiers at the front, helping to spread propaganda across restive regions such as Kurdistan and participating in mine-clearing operations. On some occasions however, these boys did partake in Iran’s infamous human-wave attacks which resulted in devastating losses for the Iranian side. \\nSepah Pasdaran after the war – building upon a legacy \\nMuch like Ayatollah Khomeini, the Pasdaran opposed the ending of the conflict with Saddam Hussein, and continued to dedicate itself to the slogan of “war until victory”, referring to the overthrow of Saddam Hussein’s Baathist regime and the export of the Islamic Revolution to the Shia majority Iraq. By 1988 however, there was a broad political consensus forming in the country around the need to end the war due to Iraqi counterattacks, American assaults in the Gulf and the exhaustion caused by the so called “war of the cities” phase of the war. Political leaders like Khamenei started to emphasise that Iran’s endurance, sacrifices and national solidarity throughout the long war had proven that Iran had already fulfilled its divine mission irrespective of obtaining a final victory, thus the need for further hostilities was no longer needed. \\nIn their book Iran and Iraq at War by Shahram Chubin and Charles Tripp, they assess that “If Iraq succeeds in holding out for a return to the status quo ante bellum, it will have withstood a siege from a country three times its size. Iran, by contrast, can take little glory from a peace that takes it back to the pre-war settlement.” \\nThis assessment fails to take into account several crucial facts. Firstly, with Iraq being the aggressor in this conflict and their return to the status quo ante bellum represented a triumph for Iran and the Sepah Pasdaran as they managed to deny Saddam Hussein his ambitions, thus costing him a lot of prestige and financial damage that the eight year long war had caused Iraq. Secondly, Iraq might have fought a country three times its size, but Iran had withstood the attack of a country that enjoyed massive superiority in terms of advanced weaponry, financial aid and international support while itself being under a heavy arms embargo. To shed some light on the “balance” in heavy military equipment, in 1987 estimates put Iraq’s capacities in battle tanks and combat aircrafts at 4,800 and 400-500 respectively, while the corresponding numbers for Iran at the time were approximated at 900-1,250 and 80-105. Against these odds, the Iranian achievement of obtaining a peace based on the pre-war settlement must be seen as a victory for Iran and the Sepah Pasdaran. Although not being able to claim a military victory from the conflict, the Pasdaran could none the less derive a huge amount of prestige from having managed to put up a formidable fight in what Pasdaran Commander Mohsen Rezaei characterized as “the war against the whole world”. \\nDuring the war, the Pasdaran grew to become a national actor, defending not just politically likeminded people but also the whole country against the Iraqi invaders. Iranians that were initially not positively inclined towards the Pasdaran or their ideology came to find themselves fighting for the same basic values of Iranian independence in the face of external danger and had to acknowledge the Pasdaran’s crucial role in defending the Iranian nation. By the end of the war, the Pasdaran had become a symbol of national resistance and represented the Iranian people to a much larger degree than before the war, thus adding to its legitimacy as one of the Iranian state’s most powerful institution. \\nFrom its early beginnings, the Sepah Pasdaran were involved in the struggle to control the outcome of the Islamic revolution, after the war, the Pasdaran however became to wield substantial political influence on its own merits. Pasdaran minister Mohsen Rafiqdoost justified the politicization of the Pasdaran, arguing that the Pasdaran was meant to defend the revolution also from within. Unlike the Army, the Pasdaran’s mission was to defend the purity of the revolution; this meant that it was not only a military task but also a political one. There has been a debate as to whether the Pasdaran should engage in politics or not, what however is clear is that their institutional strength has given them the political influence to have a say in Iran’s internal affairs. \\nWith the huge expansion of the Pasdarans’s organization in the wake of the Iran-Iraq War, the Pasdaran greatly increased its importance and power, making it able to determine and influence the appointment of officials in many other institutions, including the civilian leadership and even the regular Iranian Army. This was seen in the Pasdaran’s successful pressure to reinsert and promote Ali Seyyed Shirazi as commander of the Army’s ground forces in March 1981, and later the promotion of Ali Shamkhani, one of the Pasdaran’s most prominent figures after Rezaei, to become commander of the Navy in October 1989. \\nMany former and current Pasdaran members also rose to prominent positions within the post-revolutionary Iranian government. Early examples include Hasan Abedi-Jafari, a former member of the Pasdaran Supreme Council who served as Minister of Commerce until 1988, and Ali Mohammad Besharati, an anti-Shah guerrilla member, former director of the Pasdaran’s Intelligence Unit, and former member of the Pasdaran Supreme Council, who became Deputy Foreign Minister in 1984. \\nIt should however be said that the Pasdaran personnel did not necessarily remain a united and coherent group when they entered into politics, as factional disputes did indeed exist within the Pasdaran itself, with some former members distancing themselves from earlier hardliner policies. One such example is the current Iranian Defence Minister Hossein Dehqan, who himself is a Pasdaran member yet part of the Reformist cabinet of President Hassan Rouhani. \\nShortly after the war, at the time of Ayatollah Khomeini’s death in 1989, Pasdaran members, and associates held 5 out of 25 Cabinet positions in the Iranian government, setting a strong precursor for the Pasdaran’s later substantial involvements in civilian politics, not least experienced with the former Pasdaran member Mahmoud Ahmedinejad ascending to the presidency in 2005 through the Principlist Abadgaran alliance platform, widely believed to be a political front for the Pasdaran. The Pasdaran also got involved in other civilian spheres by establishing schools, research facilities and engaging in the procurement and distribution of goods. This has turned the Pasdaran into an independent business empire in addition to its role as the principal guarantor for the Islamic Republics survival. \\nTwo organizations closely affiliated with the Pasdaran were the Bonyad-e Mostazafan va Janbazan, the “Foundation of the Oppressed and Disabled”, and the Bonyad-e Shahidan, the “Martyr’s Foundation”. The Bonyad-e Mostazafan va Janbazan received the fortunes left by the former Shah’s Pahlavi Foundation and other properties confiscated in the course of the Revolution, including hundreds of companies, factories, housing units, agricultural lands and substantial holdings in the West. These massive assets were then used to reward the loyal supporters of the Islamic Republic and the Pasdaran. When the Iran-Iraq war broke out, the Bonyad-e Shahidan was created and given large funds dedicated to the war effort, especially to take care of the families of martyrs and wounded personnel from the Pasdaran and the Basij. Basically it served as a guarantee for those who lost family members in the war, that their beloved one’s efforts did not go in vain. The families of martyrs received a grant of 2 million rials (roughly $ 30,000 at the time), while those crippled and long-service volunteers were given priority in acquiring scarce goods, job, housing and medical care. \\nThe close relationship between the Pasdaran and the above mentioned foundations were cemented by the large degree to which Pasdaran members rotated in and out of or served simultaneously in these organizations, with one example being Pasdaran Minister Mohsen Rafiqdoost becoming head of the Bonyad-e Mostazafan after the war’s end in 1988. \\n(For more information on Iran’s domestic political landscape, please read my previous article on Iranian politics) \\nQods Force – Sepah Pasdaran’s foreign wing \\nThe Pasdaran also developed a foreign wing called the Qods Forces (Sepah-e Qods) dedicated to spreading the ideology of the revolution outside the country and to the wider Middle East region. During the Iran-Iraq war, the Sepah-e Qods provided support to the Kurds in Iraq that were fighting Saddam Hussein but it was also active in other parts of the world. Furthermore, the Sepah-e Qods also oversaw the formation and arming of the Badr Organization, the military wing of the Supreme Council for Islamic Revolution in Iraq, a Shia Iraqi political party and a staunch opponent of the Baathist regime in Iraq. The Badr Organization consisted of several thousand Iraqi exiles, refugees and defectors who fought alongside Iranian troops in the Iran-Iraq war. The Badr Organization and other Shia paramilitary organizations in Iraq are still very much aligned with the Islamic Republic and the Sepah Pasdaran whom they view as a role model for their future. \\nSince 1979 the Revolutionary government had supported the Shia Hezbe Wahdat in Afghanistan against the Afghan government of Mohammad Najibullah and the Soviet forces backing his regime. The Sepah-e Qods were sent to train and arm the Hezbe Wahdat militia in an effort to counter both the Saudi backed Wahhabi Afghan militia groups and the Soviet backed government. \\nConnections with foreign organizations and militias with the aim of exporting the Islamic Revolution, was to become a hallmark of the Sepah-e Qods who were also instrumental in creating the Lebanese Resistance movement Hezbollah in the midst of Lebanon’s civil war. This cooperation is still ongoing and Hezbollah heavily relies on the Pasdaran for weapons and ideological influences. Heading this special unit of Pasdaran members is the famous General Qassem Soleimani. \\nSepah-e Qods in Syria \\nOn September 16 2012, Sepah Pasdaran commander Mohammad Ali-Aziz Jafari announced that the Sepah-e Qods were present in Syria, however he added that “this does not mean that Iran has a military presence” and that the aid was limited. According to Iranian sources and security experts, the presence of Sepah-e Qods personnel in Syria rose to several hundred military specialists including several senior commanders with the primary task to gather intelligence and manage the logistics of battle for the Syrian Arab Army forces. Since the Russian intervention in Syria starting from September 30 2015, the presence of Sepah-e Qods personnel has also been boosted with General Qassem Soleimani having been seen on several occasions near the Aleppo frontlines, taking charge of several offensives in the area, most notably the 2015 South Aleppo offensive which saw joint Sepah-e Qods forces, Hezbollah and Iraqi paramilitaries capturing swathes of territory in the southern Aleppo countryside from the US-backed Jihadist militants of Jaysh Al-Fateh. During this time, several Sepah-e Qods commanders and officers have been martyred, most notably the famous General Hossein Hamedani who was killed on October 7 2015. \\nFurthermore, it was reported on Sputnik News that in November 2015, the Sepah-e Qods conducted a successful rescue mission of the Russian pilot who was shot down by Turkey over the Latakia province. The commander of the Sepah-e Qods Major General Qassem Soleimani got reportedly in touch with his Russian counterparts and said that a special unit had been formed and was ready for the rescue operation. He also explained that the squad was made up of men from the Lebanese Hezbollah and soldiers from the Syrian Special Forces, who had undergone special training under the guidance of Iranian instructors. Apart from this fact, the Syrian soldiers were familiar with the terrain. \\nGeneral Soleimani assumed command of the ground operation and Russian aircraft had to carry out air cover and enable satellite surveillance. Once the location of the Russian pilot was determined via satellite through the built-in GPS device, it became clear that the pilot was located six kilometers behind the front line between the Syrian army forces and the opposition forces. The Special squad that entered the territory controlled by militants was not only able to save the Russian pilot, but also destroy all of the remaining terrorists there who had the most modern weapons in their possession. All of the 24 fighters not only survived, but also returned to their base without injuries. [1] \\nAnother important mission of the Sepah-e Qods was to establish, train and arm various militias commonly known in Iran as the “Modafean-e Haram” (Defenders of the Holy Shrines). These groups include the Afghan dominated Liwaa Fatemiyyoun and the Pakistani dominated Liwaa Zeynabiyyon that fight alongside government troops battling the Jihadist militants. The Sepah-e Qods mainly recruit these personnel from the Shia Afghan and Pakistani populations that have vowed to defend the holy shrines of Shia Islam from attacks by the Takfiri militants of ISIL and Jabhat Al-Nusra who on several occasions have threatened to destroy these shrines. \\nBorn as a small militia in the midst of the revolutionary chaos of Iran in 1979, the Sepah Pasdaran has come to grow into the spine of the current political structure and a major player in the Iranian economy while achieving the status of self-sufficiency in the military field. With its rise to become a national power during the Iran-Iraq war, the Syrian war may very well prove to turn the Sepah Pasdaran into one of the most powerful regional forces to be reckoned with. The Essential Saker: from the trenches of the emerging multipolar world $27.95'"}, "time": 1742562039.9302897}