{"duration": 0.027809858322143555, "input_args": {"text": "'Another step towards global UFO disclosure. The Spanish Ministry of Defense has declassified 80 reports of alleged UFO sightings that took place between 1962 and 1995. The Spanish Ministry of Defense has declassified 80 confidential reports containing around 1,900 pages of alleged UFO sightings that were recorded above Spanish airspace between 1962 and 1995.\\nThe material is available to the public in the online library of the Spanish Ministry of Defense . The reports include the location of the sighting, the date, the summary of facts, considerations, conclusions and the proposed classification or declassification of each document.\\nThe declassification process of the documents began in 1991 when the Ministry of Defense decided to analyze the reports and reduce their classification level in order to make them available to the general public which demanded access to these documents.\\nFascinating accounts – inexplicable phenomena\\nOne of the most interesting UFO sightings was reported by pilots and crew when President Adolfo Suarez was traveling from Germany to Spain.\\nThe strange UFO was spotted at an undisclosed location. The encounter occurred when former President Adolfo Suarez, was on board an aircraft of the Spanish Air Force. The pilots and passengers onboard witnessed strange lights that could be explained. It remains unclear as to where the sighting took place. The report reads : “During night hours on February 25, 1980, onboard the 401st Squadron aircraft on a flight from Germany to Spain, Madrid with President Suarez, strange lights were observed by the pilots and passengers“.\\nFurthermore, the declassified documents reveal a number of different sightings that occurred over Spain when UFO’s were detected by radar but were invisible for pilots who were sent out to intercept them.\\nA document which dates to the 28th of November 1979 indicates that numerous individuals observed two UFOs in Madrid. A military plane was sent out to search for the UFOs. The pilot of the intercepting aircraft didn’t see anything, even though “the weather conditions were excellent” and “radar contact had been established four times” the report reads.\\nThat same report details other sightings, one of them occurred on November 27, 1979, when “lights in the sky, were observed by many people” and “unknown echoes” were recorded.\\nFurthermore, the report details how in 1971, a “luminous object was spotted following a T-33 in Talavera-Getafe route”; and in 1977, mystery lights were seen above Madrid.”\\nThe first UFO sighting over Madrid was recorded on December 11 of 1968. Two witnesses reported at 20.05 hours and 20.30 hours the presence “of a very bright object with changes in brightness,“ in the southwestern parts of the capital.\\nCheck out more about the declassified documents by visiting this link .\\nSource: Ancient Code \\n'"}, "time": 1742563418.4244373}