{"duration": 0.055776357650756836, "input_args": {"text": "'License DMCA We\\'re getting down to the wire. It\\'s been a tough haul. Actually, the campaign season has felt endless. But now is not the time to drop the ball. In the days remaining, it is essential to motivate other voters who may be sitting on the fence -- or are too disgusted -- to go to the polls about why that option is not viable. Actually, it\\'s dangerous. Their voices are crucial. Personally, it\\'s hard for me to understand how the issue of climate change can be put on the back burner by any American. Maybe I feel the urgency so deeply because I have been writing about the environment for five years. Okay, and the mother thing definitely kicks in; wanting to protect my kid, other people\\'s kids, and future generations. Still... it goes beyond that. It\\'s about the birds that are dying, the wildfires ignited by droughts, the chemicals in water that was previously used for fracking and are now irrigating our country\\'s fruits and vegetables. It encompasses the flooding, record temperatures, the lack of environmental justice for those who live in low-income communities, and the famines causing mass migration. Every time I write an article, it\\'s with the hope of putting a spotlight on a concern folks may not know about. I hope someone new is \"going to get it.\" - Advertisement - It\\'s tough when you are up against the big-money boys of the fossil-fuel industry and their supporters like the Koch brothers (who have their fingers in everything from Grand Canyon National Park to campaign funding). Yup, your state\\'s Attorney General, who is elected and tasked with being the \"People\\'s Lawyer,\" may be one of those people who have received money to jump on the lawsuit to derail the Clean Power Plan. Most of the media has dropped the ball on featuring stories on climate change and its ramifications. When guests appear on shows spouting disinformation, most interviewers don\\'t push back. News stories with hard scientific facts don\\'t get traction because they may not be \"sexy.\" Well, there\\'s nothing sexy about extreme weather. Just ask people who have been the victims of hurricanes, including New York City and environs. Homes destroyed, businesses wrecked, Manhattan subways deluged with water. Unfortunately, too many Americans still don\\'t get how climate change is the catalyst behind the challenges -- both now and in the future -- for America\\'s health, economy, and national security. It can be hard to hear that message when ads pushed by the American Petroleum Institute and individual oil companies (like Chevron and Exxon) are busy promoting the agenda that Americans have no choice except to choose between a robust economy and clear air. - Advertisement - Okay, I\\'m not naĂ\\x83ÂŻve enough to expect the fossil-fuel industry to elevate the conversation about renewable energy. They don\\'t want to promote what the growth of a green economy has to offer in terms of building a viable new job sector, that can implement change and employ workers. Donald Trump has made outrageous statements about the environment. Both he and Mike Pence are on the record as being climate deniers. Oh, and Trump wants to get rid of the EPA. Great. With no regulations on the table, big polluters will be able to get away with toxic dumping the same way Trump \"legally\" avoided paying taxes (see \" Halliburton Loophole \"). Who will suffer? Not the Exxon executive who didn\\'t want fracking in his backyard . It will fall to everyday Americans who be unaware of the toxins in the air, chemicals in the products they buy and ingest, unborn children at risk in the womb, and low-income communities and people of color who live daily without environmental justice. The list goes on.'"}, "time": 1742563524.597916}