{"duration": 0.031568050384521484, "input_args": {"text": "'That collective shriek of joy you’re hearing from the BeyHive? Beyoncé and Jay Z are expecting twins. Beyoncé, the cultural and music powerhouse, dropped the news in an Instagram post on Wednesday afternoon with a picture showing her cradling a baby bump: The announcement was yet another example of the Beyoncé’s penchant for tightly controlling her own narrative. She revealed she was pregnant in 2011 with a knowing belly rub at the MTV Video Music Awards, after a spirited performance of “Love on Top”  —   and a microphone drop. (A quick camera cut to Jay Z, born Shawn Carter, smiling    as Kanye West shook his rapper friend by the shoulders confirmed the message.) Their daughter, Blue Ivy Carter, was born on Jan. 7, 2012. While Beyoncé is famously averse to interviews and rarely discusses her personal life without setting the terms, she put the spotlight on her marriage with the release last year of the album and HBO film “Lemonade. ” It told the story of a struggling relationship, including explicit infidelity and, eventually, reconciliation. Many assumed the songs’ lyrics  —   which ranged from heartbroken to defiant to forgiving  —   were autobiographical, though the couple never revealed how much of the story was based in reality. (In her 2013 documentary, “Life Is But a Dream,” Beyoncé discussed having an earlier miscarriage. “About two years ago, I was pregnant for the first time,” she said. “I flew back to New York to get my checkup  —   and no heartbeat. ” Jay Z alluded to the experience in his song “Glory. ”) “Lemonade” is nominated for a leading nine Grammy Awards at the ceremony to be held on Feb. 12. Beyoncé is also scheduled to headline the second night of the Coachella festival in the California desert on April 15 and April 22. Things seem to be going well for the couple now  —   Beyoncé’s Instagram post was signed, “The Carters. ” The pair’s fervent and loyal fans responded with typical enthusiasm to the announcement: Twitter said more than half a million tweets were sent about the pregnancy within 45 minutes. Some Coachella ticket holders wondered about the status of Beyoncé’s scheduled performance. A representative for the singer did not immediately respond to a request for comment. Jay Z and Beyoncé are not the only musical duo with baby news. Pharrell Williams and his wife, Helen Lasichanh, recently welcomed triplets, according to reports.'"}, "time": 1742628582.2168448}