{"duration": 0.08772397041320801, "input_args": {"text": "'Amazon is mobilizing a July 12 collective “Day of Action” for tech corporations and social justice warriors to unite in rebelling against the FCC’s efforts to overturn Net Neutrality. The 12th falls on the 96th anniversary of Lenin’s call to deploy Russian communists to start civil wars around the world. [In a “workers of the world unite “for corporate interests, Amazon’s CEO Jeff Bezos has mobilized big tech corporate support from Mozilla, Reddit, Kickstarter, Etsy and Vimeo to fill the streets with   allies from the American Civil Liberties Union (ACLU) Electronic Frontier Foundation, and Greenpeace.  The Day of Action seeks to upend the May 18 vote by FCC Republican Commissioners Ajit Pai and Michael O’Reilly, over the opposition by Democrat Commissioner Mignon Clyburn, to overturn the Obama administration’s 2015 adoption of “Net Neutrality. ” The Democrats’ regulatory regime gave the U. S. government the effective right to take control of the Internet, create new taxation authority, and regulate the “fairness” of political thought under rules that once applied to the old ATT telephone monopoly. Under federal administrative law, the   FCC rule change allows a   initial public comment until July 17, and then another 30 days for replies to those comments by Aug. 16. Advocates of Net Neutrality called it a democratizing principle. But opponents complained that under Net Neutrality, corporate interests like Amazon, Netflix and Google’s YouTube could make huge profits by clogging cable delivery pipes with enormous amounts of data at no cost. The   publication The Nation classified the February 2015   FCC majority’s passage of “Net Neutrality” as “people power.“ But it appeared to be more about the “corporate power” that funded a record $139. 5 million in lobbying expenses by computer and Internet companies to influence the biggest regulatory expansion in decades. Naming July 12th the “Day of Action” will conjure 96th anniversary of the release of Vladimir Lenin’s Report on the Tactics of the Revolutionary Communist Party. Soviets cadres had believed that once Russian workers overthrew capitalism, it would cause spontaneous uprisings by the workers of the world that would quickly sweep capitalism into the dustbin of history. But after four years and no more worldwide revolutions, Lenin used the July 12, 1921 conclusion of the “Third Congress of The Communist International” publish Tactics to encourage Russian communists to export “civil war” and “openly revolutionary uprisings. ” July 12, 1948 was also the day President Truman used the Democratic Party Platform to expand Marshall Plan to fight communism: “Ours is the party under which were conceived the instruments for resisting Communist aggression and for rebuilding the economic strength of the democratic countries of Europe and Asia  —   the Truman Doctrine and the Marshall Plan. ”   protests against Trump administration policies have been led by Antifa (antifascist) groups who wear black clothing and   as well as scarves, sunglasses, ski masks and motorcycle helmets. Antifa forces shut down Berkeley in April and May by using fists,   pepper spray and heavy bike locks to prevent presentations by conservative speakers. The Urban Dictionary describes Antifa as: “  champagne    white boys who don’t like nationalists or fascists. They consider themselves to be rebelling against the establishment, whilst upholding all of its   correct views. ” By uniting corporate and social justice forces for a July 12 “Day of Action,” just days before the end of the FCC comment period to oppose dumping Net Neutrality, Silicon Valley could fill the streets of America’s biggest cities with large and potentially violent protests.'"}, "time": 1742562040.2453985}