{"duration": 0.03946805000305176, "input_args": {"text": "'Home / Military-Industrial Complex / In Light of Recent Attacks on Police, White House Considers Re-Militarization of American Cops In Light of Recent Attacks on Police, White House Considers Re-Militarization of American Cops Claire Bernish July 22, 2016 8 Comments \\nReactionary politics and legislation put us on hamster wheels guaranteeing a number of issues will never change, and militarized, brutal policing marks a prime example of this problem — particularly now, following a smattering of attacks on officers in Dallas and elsewhere . \\nIn a reactionary response to several shootings of officers, Pres. Obama now plans to review — and potentially repeal — the May 2015 ban on police obtaining military surplus equipment like riot gear, explosives, armored vehicles, grenade launchers, bayonets, and more. \\nIn an exclusive interview, Jim Pasco, executive director of the Fraternal Order of Police, and Bill Johnson, executive director of the National Association of Police Organizations, told Reuters changes to the ban on the transference of military equipment to law enforcement agencies nationwide will be reviewed by Obama in the wake of those attacks. \\nWhile violence from either side of the Thin Blue Line should be neither tolerated nor condoned, the militarization of police forces — in both equipment and training — has inarguably fueled the epidemic of police brutality that spawned these retaliatory attacks. \\nA repeal of even part of this ban, particularly as now-nervous officers increasingly view the public with suspicions any encounter could escalate without warning, will inevitably fan the flames on this nation’s powderkeg. \\nAccording to an unnamed White House official cited by Reuters , the administration regularly reviews rules concerning military surplus wares to ensure police receive the “tools they need to protect themselves and their communities while at the same time providing the level of accountability that should go along with the provision of federal equipment.” \\nAccountability, however — in contrast to the weapons and gear of war on American streets — is in extremely short supply. Countless questionable uses of excessive force by officers against civilians, including riot-clad, MRAP-backed harassment and menacing of otherwise peaceful protesters, have gone unanswered by disciplinary or punitive action. \\nImages from Ferguson, Missouri, during protests after Officer Darren Wilson fatally shot unarmed Michael Brown — of armored vehicles rolling down the street, riot gear-clad and heavily armed police launching the same tear gas banned internationally in war at protesters and journalists, alike, and cordoned-off ‘free speech zones’ — catapulted the issue of militarization into the glare of the national and world spotlights. \\nObama eventually succumbed to enormous pressure from human rights advocates, activists, and swaths of the public by implementing the ban not long afterward, citing “a substantial risk” of police “overusing” or “misusing” military gear — as clearly evidenced in Ferguson and elsewhere against, ever-so ironically, anti-police brutality demonstrations. \\nBut the retaliatory attacks on officers in several cities has twitchy cops begging for the return of the program of federal grants to obtain further equipment — though, notably, the ban did not affect departments’ obtainment of these goods from private defense companies. \\n“The White House thought this kind of gear was intimidating to people, but they didn’t know what purpose it serves,” Pasco stated without even a hint of irony. \\nThough protests in Ferguson did, indeed, turn violent, the overwhelming majority of protests against police violence have not — though officers in riot gear menacing peaceful demonstrators exercising constitutionally-protected rights of assembly and free speech often manufacture violence where none existed. \\nProtests in Baton Rouge over the shooting death of Alton Sterling evidence exactly that — demonstrators congregated peacefully at an intersection and permissibly on private property were pushed into streets and promptly arrested for … being in the streets. As the public is increasingly left without viable options to air grievances free of police intimidation — an issue even the non-activist segment of the public recognizes as inexcusable — backlash by the furious is a virtual guarantee. \\nRepealing the ban at a time of frayed law enforcement nerves will essentially allow military equipment to flood the country — a terrifying move as a growing number of cops have literally declared war on the people they putatively swore oaths to protect. \\nPasco and Johnson told Reuters White House chief legal counsel Neil Eggleston will be reviewing the ban. \\nMeanwhile, no move toward the reform of training that teaches police to view the public with heightened suspicion, if not as the outright enemy, remains a pipe dream of those calling for an end to State violence. \\nIn reviewing the ban — and to understand the outrage over the epidemic of police brutality — it would be wise for politicians, the public, and the administration to consider this simple cycle: unaddressed problems can only be compounded by reinforcing the source of the original problem. \\nToo bad the simplicity will be lost to the purely propagandized ‘war on cops’ narrative, anxious police, and a public eager to validate police force. \\nClearly, the escalation of this cycle won’t be halted anytime soon. Share'"}, "time": 1742628574.0019891}