{"duration": 0.1961987018585205, "input_args": {"text": "'by Dr. Mercola \\nMost people in the U.S. first heard of Zika virus about a year ago. It was October 2015 when officials in Brazil reported a possible association between infection with Zika virus and the birth defect microcephaly. \\nThe virus, however, was first identified in Uganda in 1947, in monkeys. Several years later, in 1952, Zika virus was found in humans in the same area as well as in the United Republic of Tanzania. Outbreaks have occurred ever since, although infections in humans were limited to Africa and Asia. \\nThe year 2007 marked the first large Zika virus outbreak, which took place on the remote Island of Yap, a tiny island in the Federated States of Micronesia. Then, in July 2015, Brazil reported Zika virus infection appeared to be linked to the autoimmune disease Guillain-Barré syndrome. \\nZika virus is transmitted primarily by Aedes mosquitoes, although it is sexually transmitted as well. \\nIt has since spread to a small area of the U.S. (southern Florida), but fewer than 1,000 U.S. pregnant women have lab evidence of Zika infection (this includes not only locally transmitted cases but also those that occurred via sexual contact). In other words, it’s extremely rare. \\nFurther, many questions remain about its risks. While the World Health Organization (WHO) says there is a “scientific consensus that Zika virus is a cause of microcephaly and Guillain-Barré syndrome,” [1] other experts have questioned this link. \\nDespite the many unanswered questions, efforts are underway to eradicate the disease, including by releasing controversial man-made and genetically engineered (GE) mosquitoes, with largely unknown effects to the environment. Army of Man-Made Mosquitoes to Be Released in South America \\nScientists are planning to release millions of man-made mosquitoes in Brazil and Colombia in 2017. \\nThe $18-million project, funded in part by the Bill and Melinda Gates Foundation , involves mosquitoes that have been infected with Wolbachia bacteria, which stops viruses from growing inside the mosquito and therefore from being transmitted between people. \\nThe Eliminate Dengue research program, which has been working to develop such mosquitoes for a decade, claims the method is “self-sustaining and has the potential to transform the fight against life-threatening viral disease.” \\nThe altered mosquitoes have been tested in open trials in dengue-affected communities since 2011, but not yet on the scale expected in Brazil and Colombia. The mosquitoes are expected to be released in large, heavily populated urban areas. \\nThe mosquitoes are described as a refinement of a natural method, as Wolbachia bacteria is present in about 60 percent of insect species, including some mosquitoes. However, it is not naturally occurring in Aedes mosquitoes. \\nIt took decades for researchers just to figure out how to introduce Wolbachia into Aedes mosquito eggs, but once they did they started experimenting with releasing them into the wild. Field tests suggest the bacteria spread to the vast majority of local mosquitoes, and as Eliminate Dengue said, is a “self-sustaining” system. \\nThat’s both the point and the problem. Other experimental GE mosquitoes have been genetically engineered to die in the absence of the antibiotic tetracycline (which is introduced in the lab in order to keep them alive long enough to breed). \\nThey were designed this way assuming they would not have access to that drug in the wild, a failsafe (though not a perfect one, especially since antibiotics are now showing up in waterways) to ensure that the GE insects could theoretically be removed from the environment. \\nIn the case of the Wolbachia mosquitoes, once they’re released (and they already have been), there’s no stopping them from mingling with wild mosquitoes. While this may help to reduce the spread of certain viruses (although this remains to be seen), it may also have other unintended, as yet unknown consequences. GE Mosquitoes Aim to Wipe Out Mosquito Populations \\nEliminate Dengue’s Wolbachia mosquitoes are only one variety of GE mosquito now circulating the globe. \\nBiotech company Oxitec has created its own variety, which has been genetically engineered to carry a “genetic kill switch,” such that when they mate with wild female mosquitoes, their offspring inherits the lethal gene and cannot survive. [2] \\nTo achieve this feat, Oxitec inserted protein fragments from the herpes virus, E. coli bacteria, coral and cabbage into the insects. Millions have already been experimentally released in Brazil, Panama and the Cayman Islands, and the GE mosquitoes have proven lethal to native mosquito populations. \\nIn the Cayman Islands, for instance, 96 percent of native mosquitoes were suppressed after more than 3 million GE mosquitoes were released in the area, with similar results reported in Brazil. [3] \\nOxitec, in partnership with the Florida Keys Mosquito Control District (FKMCD), also has plans to release the GE mosquitoes, which go by the name of OX513A, in Key Haven, Florida, an island of the Florida Keys located about one mile east of Key West. \\nResidents, however, are not overly keen on being guinea pigs in this experiment. A vote is expected November 2016 to determine if the GE insects will be released. Adding to the controversy of releasing GE creatures of any kind into the environment are the unknown consequences of wiping out mosquito populations. \\nWhile they’re primarily viewed as a nuisance and vector for deadly diseases like malaria, there may be “undesirable side effects” of eradicating them entirely, according to Florida University entomologist Phil Lounibos. BBC News reported: [4] \\n… [Lounibos] says mosquitoes, which mostly feed on plant nectar, are important pollinators. They are also a food source for birds and bats while their young — as larvae — are consumed by fish and frogs. This could have an effect further up and down the food chain. \\n… He warns that mosquitoes could be replaced by an insect ‘equally, or more, undesirable from a public health viewpoint.’ Its replacement could even conceivably spread diseases further and faster than mosquitoes today. Gene-Drive Mosquitoes Are Coming \\nGene-drive technology is incredibly controversial because it gives scientists the ability to control and potentially quickly eradicate entire populations of species. The technology allows a certain gene to spread to 99 percent of offspring instead of the typical 50 percent. \\nGene-editing tools like Crispr have made the use of gene-drive technology a reality. “By encoding the Crispr editing system itself into an organism’s DNA, scientists can cause a desired edit to reoccur in each generation, “driving” the trait through the wild population,” the New York Times explained. [5] \\nAt Imperial College London, for instance, a gene was created to cause female mosquitoes to become sterile. With gene-drive technology, the gene could cause mosquitoes in the wild to become extinct, fast. According to MIT Technology Review: [6] \\nA gene drive is an artificial ‘selfish’ gene capable of forcing itself into 99 percent of an organism’s offspring instead of the usual half. \\nAnd because this particular gene causes female mosquitoes to become sterile, within about 11 generations—or in about one year—its spread would doom any population of mosquitoes. \\nIf released into the field, the technology could bring about the extinction of malaria mosquitoes and, possibly, cease transmission of the disease. \\nEarlier this year, the National Academies of Sciences, Engineering and Medicine, the advisory group for the U.S. government on scientific matters, endorsed continued research on gene-drive technology, [7] even though the risks are immense. What Are the Real Risks of Zika Virus? \\nWe know there are risks of releasing man-made and GE organisms into the environment. The risks of Zika virus remain unknown, however. Chris Barker, a mosquito-borne virus researcher at the University of California, Davis School of Veterinary Medicine, told WebMD: [8] \\nI think the risk for Zika actually setting up transmission cycles that become established in the continental U.S. is near zero. \\nBarker expects Zika to go the way of other tropical diseases spread by mosquitoes, such as denguepop fever and chikungunya, in the U.S. with perhaps small clusters of outbreaks in southern states and little activity elsewhere. The rising panic of Zika is reminiscent of many past diseases that failed to cause the devastation health officials warned of. Remember SARs, bird flu, swine flu and Ebola ? Or even the measles “outbreak” in 2015? \\nThere was widespread fear, outrage and panic that the disease would sweep across the U.S., affecting populations from border to border. Calls for experimental drugs and vaccines were made and millions, if not billions, of dollars were spent. And for what? In most cases, the diseases fizzled out on their own, exacting a far less sensational health toll than the media and, often, the government had you believe. \\nAs reported by PRI, Zika’s million-dollar question is, where are the birth defects? Perhaps that question should be answered before man-made and GE mosquitoes are introduced into the environment, possibly permanently. PRI continued: [9] \\nTens of thousands of Zika cases have been confirmed or suspected in countries like Colombia, Venezuela and Nicaragua since late 2015. The infected have included thousands of pregnant women. But those infections have not led to a dramatic rise in reported birth defects like microcephaly, in which a baby develops an abnormally small head and brain. \\nThis is confounding to researchers … ‘Researchers are absolutely curious,’ said Julie Fischer, co-director of the Center for Global Health Science and Security at Georgetown University. “It’s an enormous relief that the surge in microcephaly cases that was first noticed in northern Brazil has not spread everywhere that the Zika virus has been detected.’ \\nSee Also :'"}, "time": 1742563740.890919}