{"duration": 0.04680633544921875, "input_args": {"text": "'In her   apartment on the East Side of Manhattan, on a recent Saturday afternoon, Barbara Roston was busy explaining that she was definitely not a thief. “It was a youthful indiscretion,” she said, “I didn’t mean to steal it. ” And yet, there it was, sitting on her desk: A faded green copy of “Gone With the Wind,” by Margaret Mitchell, that belonged to the Brooklyn Public Library. It was 57 years overdue. In her retirement, Ms. Roston, 72, decided to reread the book, which she had kept on her bookshelf for years, when she noticed the library’s markings. On the last page, stuck to the paper pocket, was a sticker explaining the library’s policy: “Give your NEIGHBOR a chance to borrow this book. Return it on or before DUE DATE SHOWN ABOVE. The fee is 5¢ per calendar day for each book kept overdue. ” This volume was due back on Nov. 18, 1959. After 20, 842 days since, Ms. Roston would owe the library $1, 042. 10. Ms. Roston, a Brooklyn native, checked out the book when she was 15. At the time she was a sales audit clerk at Macy’s, making $1 an hour. Since then, she has lived in Massachusetts and Illinois, was married (her first wedding dance was to “Tara’s Theme” from the film version of “Gone With the Wind”) raised four children and got divorced. All the while, the book had been with her. Until that Saturday this month, when she returned it. Ms. Roston is hardly the first New Yorker to have a really, really overdue book. In 2013, a guide to divorce was returned to the New York Public Library 36 years late. That same year, the New York library system received a copy of “The Fire of Francis Xavier,” which had been checked out in 1958. Today, the Brooklyn Public Library charges 15 cents for each day that a piece of print material is overdue. After a patron racks up a $25 balance, and after 60 days, the library may report the borrower to a collections agency. The Crown Heights branch of the Brooklyn Public Library is a squat building topped with a large clock on New York Avenue. When Ms. Roston entered, she grabbed the nearest librarian and began whispering. She slowly pulled the book out of a tote bag. What followed was a lot of hushed giggling. “Oh, wow, this looks like, from a really long time ago,” said Stefanie Sinn, a children’s librarian. “This is, like, a relic. ” “Well, I’m kind of a relic, too,” Ms. Roston said. The book was quickly shuttled to circulation. “We have a return, from the ’50s,” Ms. Sinn said. Fortunately for Ms. Roston, the book was not registered in the library’s computer system, so she did not have to pay a late fee. “I’ve seen books returned late, but never one this old,” said Lisa Rosenblum, the chief librarian of the Brooklyn Public Library, who later said she was delighted to have the book back in the library, “for its geeky, historical perspective. ” “I showed my younger colleagues how you used to have to stamp a card, and what an accession number is,” she said. “They just looked at me blankly. ” For her part, Ms. Roston made a $50 donation to the library. But the book will not be joining the library’s 59 other “Gone With the Wind” copies. It’s too old and fragile. Instead, the library plans to put it on display, Ms. Rosenblum said. “It’s a great reminder that it’s always important to return your books,” she said. “Even 60 years late. ”'"}, "time": 1742562003.5179565}