{"duration": 0.09654664993286133, "input_args": {"text": "'The latest attack against President Donald Trump for allegedly being too close to his and his family’s business interests suffers from a serious flaw: it is based on a trust agreement provision authorized by law and recommended by the U. S. Senate Select Committee on Ethics as well as the U. S. Office of Government Ethics. [The website ProPublica reported Monday that the documents governing the trust that holds Trump’s businesses were changed in February to instruct the trustee to make distributions to Trump when requested. “Trump can draw money from his more than 400 businesses, at any time, without disclosing it,” ProPublica explained.  According to ProPublica, this shows “just how little separation there actually is” between the Trump businesses and the U. S. government. To anyone familiar with the blind trust agreements signed by government officials, however, this is nonsense. Almost every trust agreement signed by U. S. government officials authorizes distributions upon request of the official for whom the trust is established. The sample blind trust agreement distributed by the staff of the Senate Ethics Committee is the model document used by senators and their staffs for setting up trusts. It authorizes precisely the kind of requests for distributions that has ProPublica scandalized. Section 7 of the agreement reads: There shall be no direct or indirect communication between an interested party and the Trusteee with respect to the Trust unless —   (A) It related to a request for a distribution from the Trust of cash or other unspecified assets of the trust or  …     Importantly, this is the only form of communication with the Trustee that doesn’t require written disclosure with the Ethics Committee. Just like Trump’s trust, the Senate model trust doesn’t require disclosure of requests for distributions. The Office of Government Ethics, an independent agency within the executive branch, uses very similar language in its model blind trust agreement. SEVENTH: There shall be no direct or indirect communication between an interested party or 21 any representative of an interested party and the Trustee with respect to the Trust unless the 22 communication is in writing and has the prior written approval of the Director, U. S. Office of 23 Government Ethics, and unless it relates only  —   (A) To a request for a distribution of cash or other unspecified assets of the trust  …     There’s a very good reason why both agreements allow government officials to request distributions from their trusts without requiring any prior disclosure: that’s what the law says. The requirements for a blind trust for government officials are set out in the Ethics in Government Act of 1978. The law bars most communications between government officials and their trustees but it explicitly allows for requests for distributions.   …    except for communications which solely consist of requests for distributions of cash or other unspecified assets of the trust, there shall be no direct or indirect communication between the trustee and an interested party with respect to the trust unless such communication is in writing and unless it relates only [to certain permitted topics]. In other words, the authorization of undisclosed requests from distributions in Trump’s trust agreement is fully in keeping with the law and the government’s standard agreements. The small change revealed by ProPublica brought Trump’s trust into further conformity with the trusts used by other government officials and U. S. senators. This is just another Gold Easter Egg: a story that falsely depicts something as a scandal because Trump does it when it is, in fact, totally normal.'"}, "time": 1742564515.1907554}