{"duration": 0.12819743156433105, "input_args": {"text": "'The anodyne welcome letter to incoming freshmen is a college staple, but this week the University of Chicago took a different approach: It sent new students a blunt statement opposing some hallmarks of campus political correctness, drawing thousands of impassioned responses, for and against, as it caromed around cyberspace. “Our commitment to academic freedom means that we do not support   trigger warnings, we do not cancel invited speakers because their topics might prove controversial, and we do not condone the creation of intellectual ‘safe spaces’ where individuals can retreat from ideas and perspectives at odds with their own,” John Ellison, dean of students, wrote to members of the class of 2020, who will arrive next month. It was a    rebuke to the protests calling for limits on what kinds of speech should be condoned on campus, and who should be allowed to speak, that have rocked Yale, Wesleyan, Oberlin and many other colleges and universities in recent years. Some alumni, dismayed by the trend, have withheld donations from their alma maters. The Chicago letter echoed policies that were already in place there and at a number of other universities calling for “the freedom to espouse and explore a wide range of ideas. ” But its stark wording, coming from one of the nation’s leading universities, and in a routine correspondence that usually contains nothing more contentious than a dining hall schedule, felt to people on all sides like a statement. Kevin Gannon, a history professor at Grand View University in Des Moines, dismissed the letter on his website as “a manifesto looking for an audience,” one that “relies on caricature and bogeymen rather than reason and nuance. ” The Heritage Foundation wrote on Facebook that the letter “will make you stand up and cheer. ” Other universities have made similar statements, but the message from Chicago is “clearer and more direct than I’ve seen,” said Greg Lukianoff, president of the Foundation for Individual Rights in Education, a leading critic of what it says are destructive speech restrictions at many campuses. “Sending a letter to freshmen is different than I’ve seen, at least in a long time, and certainly from a major university. ” Michael S. Roth, president of Wesleyan University, said the Chicago letter was, at least in part, a publicity stunt  —   “Gosh, is there any doubt?” he asked  —   and a way of “not coddling students, but coddling donors. ” Jeremy Manier, a University of Chicago spokesman, insisted there were no hidden motives behind the letter. And he said professors remained free, at their discretion, to use trigger warnings, the messages sometimes posted atop campus publications, assignments and other material, noting that they might be upsetting for people who have had traumatic experiences. Conservatives have been the loudest critics of campus political correctness, and hailed the Chicago statement as a victory. Mary Katharine Ham, a senior writer for The Federalist, a conservative website, wrote that it was “a sad commentary on higher education that this is considered a brave and bold move, but it is, and the University of Chicago should be applauded mightily for stating what used to be obvious. ” But while conservatives often frame campus free speech as a    issue, the dispute is often within the left. “Historically, the left has been much more protective of academic freedom than the right, particularly in the university context,” said Geoffrey R. Stone, a University of Chicago law professor who specializes in free speech issues. Conservatives “suddenly became the champions of free speech, which I find is a bit ironic, but the left is divided. ” Mr. Lukianoff said he and his group are often mistakenly called conservative, adding, “I’m a former A. C. L. U. person who worked in refugee camps. ” The dispute over free speech has ricocheted off campuses and around the country. In a commencement speech this year at Howard University, President Obama said: “Don’t try to shut folks out, don’t try to shut them down, no matter how much you might disagree with them. There’s been a trend around the country of trying to get colleges to disinvite speakers with a different point of view, or disrupt a politician’s rally. Don’t do that  —   no matter how ridiculous or offensive you might find the things that come out of their mouths. ” The University of Chicago has long been associated with the conservative school of economics that is named for it. It also takes pride in a history of free expression, like allowing the Communist Party candidate for president, William Z. Foster, to speak on the ornate   campus on the city’s South Side in 1932, despite fierce criticism. Mr. Obama taught constitutional law at the university law school. The university said Friday that Dean Ellision and the university president, Robert R. Zimmer, were not available to discuss the letter or what prompted it, but Mr. Manier referred queries to Professor Stone, a former university provost. Last year, a faculty Committee on Freedom of Expression, appointed by Dr. Zimmer and headed by Professor Stone,  produced a report stating that “it is not the proper role of the university to attempt to shield individuals from ideas and opinions they find unwelcome, disagreeable, or even deeply offensive. ” “We didn’t feel we were doing something, internal to the University of Chicago, that was in any way radical or different,” Professor Stone said Friday. It is clear that some colleges are retreating from the same free speech values, he said, “but my guess, if you asked most of these institutions 10 or 20 years ago, they would have said more or less what we said in our statement. ” Since Professor Stone’s committee produced its report, several other universities, including Princeton, Purdue, Columbia and the University of Wisconsin system, have adopted similar policies or statements, some of them taken almost verbatim from the report. And this week’s letter to University of Chicago freshmen draws from that and specifically cites the report as embodying the university’s point of view. Many academics say the concerns reflected in the University of Chicago letter, while real, are overblown. “I asked faculty if any had ever been asked to give trigger warnings,” said Dr. Roth, of Wesleyan. “I think one person said they had. ” There often seems to be a generational divide on campus speech  —   young people demanding greater sensitivity, and their elders telling them to get thicker skins  —   but a survey by the Knight Foundation and Gallup gives a murkier picture. It found that 78 percent of college students said they preferred a campus “where students are exposed to all types of speech and viewpoints,” including offensive and biased speech, over a campus where such speech is prohibited. Students were actually more likely to give that response than adults generally. But when asked specifically about “slurs and other language on campus that is intentionally offensive to certain groups,” 69 percent of college students said that colleges should be allowed to impose restrictions on such expression. Eric Holmberg, the student body president at the University of Chicago, said the letter suggested that administrators “don’t understand what a trigger warning is,” and seemed “based on this false narrative of coddled millennials. ” “It’s an effort to frame any sort of activism on campus as    just young people who are upset,” Mr. Holmberg said, “when in reality I’d say the administration is far more fearful of challenge than any student I know. ” Sara Zubi, a Chicago junior majoring in public policy, said the dean’s letter seemed contrary to some of the support programs the university has created or endorsed, like a “safe space program” for lesbian, gay, bisexual and transgender students. “To say the university doesn’t support that is really hypocritical and contradictory,” she said, “and it also just doesn’t make sense. ”'"}, "time": 1742564234.028905}