{"duration": 0.031693458557128906, "input_args": {"text": "'SnoopWall, Inc. CEO Gary Miliefsky joined SiriusXM host Alex Marlow on Tuesday’s Breitbart News Daily to talk about the massive ransomware attack that swept the world over the weekend. [Miliefsky said the details of the story sounded like something from a movie script: “This group called the ‘Shadow Brokers’ got ahold of NSA   eavesdropping worm code, malware that worms its way across vulnerabilities in Windows, and somebody merged it with ransomware and created the world’s first ransom worm. ”  “The software doesn’t just affect you if you click a link. You may click the link and get infected then have to pay the ransom. But it also worms its way across your Intranet looking for more computers with same vulnerability,” he elaborated. Marlow asked if the outbreak of this malevolent software was under control after the chaotic events of the weekend. “A lot of people worldwide have gotten concerned about it, but you’re not going to believe the numbers. Over the weekend, we thought it was slowing down. It started out, it hit about 100, 000 computers by Sunday. By the end of the day yesterday, it was about 179, 000. Today, sadly, the numbers are more than double. We’re at 367, 589 infected,” Miliefsky replied. “Most of them are offline. That means they’ve been unplugged from the Internet so that people can decide: ‘Do I wipe the drive and reinstall, or am I going to pay the fee? But I don’t want it to propagate to other computers.’ But there’s still about 426 computers online that continue to propagate the worm,” he added. Milifesky said his company’s technology, which he unsuccessfully tried to sell to the “big guys” in the computer industry, is focused on protecting “small to   enterprises where all the GDP really comes from. ” “And guess what? All of our customers in the SME [Small and   Enterprise] space can not get infected with this worm. We can block it in milliseconds,” he said. “I’ve had technology to do this for years, but I can’t sell it to the big guys. It’s called NetShield. ” He explained that NetShield is a corporate product that was the first software to “go on the offensive” against malware.  “For consumers, I have some great advice today,” he said. “I put a consumer advisory out, and you can just Google it, ‘SnoopWall consumer advisory.’ In the advisory, I have links to the current stats of the worm infection, what countries are getting infected in real time. But I also have a link to Microsoft’s TechNet page where they didn’t really want to tell everyone right away, two months ago they had the fix. So I have the link to the fix for every version of Windows in that advisory. ” Marlow asked about   reports that a North Korean hacking group appeared to be behind the ransomware attack. “I’ve been told by someone who’s connected to someone in Anonymous that there’s actually, believe it or not, a kind of Russian cyber arms dealer who sells weaponized malware, somewhere in Russia, and also hacks videogames, and that person may have sold it to North Korea,” Miliefsky said. “I don’t know much more, I’m told that on hearsay, but I’m passing that on to the authorities and I know they’re going to research it. ” Miliefsky said this was a “watershed moment in cybercrime history. ” “I have to tell you, drug crime in 2015 was bigger than any other form of crime worldwide. By 2016, cybercrime surpassed drug crime and reached $600 billion. This year, I’m predicting cybercrime will be a   industry. It is not going to go away. It is only going to get worse,” he warned. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. '"}, "time": 1742628487.0502188}