{"duration": 0.055165767669677734, "input_args": {"text": "'0 comments \\nThe Democrats are getting really nervous about Trump winning the election. They’re trying to do everything that they can to tear him down even more than Hillary is already. Obama even went as far as to say that the KKK will return! \\nPresident Barack Obama wants people in North Carolina to vote for Hillary Clinton, so he’s warning them that Donald Trump would tolerate the support of the Klu Klux Klan if he’s elected president. “If you accept the support of Klan sympathizers — the Klan — and hesitate when asked about that support, then you’ll tolerate that support when you’re in office,” he said. \\nObama added that Trump would “disrespect” the Constitution as president, citing the Republican nominee’s vow to put Hillary Clinton in jail. \\n“[Y]ou threaten to throw your opponent in jail without any due process … then imagine what you’ll do when you actually have the power to violate the Constitution along those lines,” Obama warned. \\nObama made his remarks at the University of North Carolina-Chapel Hill on Wednesday, saying that the fate of the world rests on their shoulders. \\n“I hate to put a little pressure on you, but the fate of the Republic rests on your shoulders,” he said as the audience laughed. “The fate of the world is teetering, and you, North Carolina, are going to have to make sure that we push it in the right direction.” \\nObama dismissed all of the negative ads and bad news that hurt Hillary Clinton as “noise” and “distractions,” that they should put aside. \\n“Every day is just hysteria and over-the-top coverage,” he said, admitting that even he was getting tired of politics. “I understand the feeling, I promise you.” \\nHe argued that the choice for president was simple, because Trump was a con artist who was unfit and not ready to be president. \\n“I mean, it’s strange how, over time, what is crazy gets normalized,” Obama said, referring to the multiple controversial statements made by Trump during the campaign. \\n“That is not the voice of America. That’s not the better angels of our nature,” he said. \\nIf you thought things couldn’t get any more ridiculous, you’re wrong. This accusation is taking things to a whole new level just days before voting. It’s nothing but a desperate, pathetic plea for help. Related Items'"}, "time": 1742562130.5107374}