{"duration": 0.15802812576293945, "input_args": {"text": "'By: The Voice of Reason | Provided that you are someone who doesn’t rely on the mainstream media for anything more than entertainment, and you get your actual “news” elsewhere, then you already know that, “[T]he Western central banking franchise system is totally broken, totally insolvent, totally corrupt,” and it’s been inviting the return of a Gold Standard for some time. More than likely, you also already know that it won’t be a United States Gold Standard that global financial system defers to when the U.S. Dollar finally takes it’s last gasp of air before dying on the operating table. The entire financial system of the Western banking system and the U.S. Dollar were built upon a debt-based monetary system, and the debt saturation process has run its full course. The days of the U.S. Dollar are numbered, and anyone who has followed the work of Dr. Jim Willie for even a short while, should already know that. However, Because of his sarcastic manner, and the informal atmosphere in which Dr. Willie often conducts his interviews, sometimes it can be difficult to understand (or take seriously), the points he is making. So, for anyone looking to better understand the basis of some of Dr. Willie’s more recent forecasts, the article below is written by Dr. Willie himself, and it contains all the details one could ask for that support the positions he has often discussed during many of his most recent prior interviews. The interview is about three weeks old, but it’s also his most recent. During the interview, just a few of the topics include how recent geopolitical and economic events have begun to severely fracture NATO, and how post-Brexit the European Commission is becoming largely irrelevant as a governing body. With respect to the death of the U.S. Dollar, Dr. Willie discusses how the Chinese will launch new short term RMB notes backed by gold, causing even more countries to abandon the U.S. Dollar when settling foreign trade debts. Then, to facilitate the U.S. Dollar’s transition from the slow precipitous decline we’ve seen in recent years, into a complete collapse, Dr. Willie explains how we should expect the IMF to soon back it’s Special Drawing Rights (SDR’S) with gold, in conjunction with the Saudi’s abandoning the PetroDollar for good. Stay tuned at the conclusion of Dr. Willie’s technical analysis below, for another good look into the death of the Dollar, in a full-length documentary titled, “End of An Empire: America Destroyed From Within /Death by Bank-ism.” Dr. Jim Willie Writes: The Western central bank franchise system is totally broken, totally insolvent, and totally corrupt. It invites the Gold Standard return. The entire financial system is built upon a debt-based monetary system. The debt saturation process has run its full course. The central bank heads have been covering the sovereign debt for the last five years, having rendered their balance sheets as ruined. Debt is at obscene levels, like $19.7 trillion for the USGovt. No debt limits are in place anymore, a signal that most likely it has already defaulted. A hidden game is underway, with control lost to the creditors, even as they attempt to salvage their debt holdings. The major central banks continue to manage badly the great game, where money is fake phony and a farce. A titanic battle is underway, where the Eastern nations are discarding their USTreasury Bonds, and doing so in tremendous volume while they set up the many platforms and pieces to the Gold Standard. The US Federal Reserve monetary policy of hyper-inflation has failed to revive the US Economy, failed to legitimize the debt securities, failed to halt the financial corruption, and failed to stem capital destruction. The official monetary policy has only succeeded in preventing the failures of almost all big Western banks. They are all insolvent, mostly supported by narco money laundering in the hundreds of $billions. The Eastern super-powers are leading a campaign to put aside the US$-based financial system, isolate it to the sidelines, while arranging a new system. The Gold-based system will be complete with its currency, sovereign debt securities, transfer systems, global offices, and debt rating agencies, maybe even debit cards. The East strives to install the Gold Standard as the remedy to the ongoing global financial crisis. The West has made exactly no movement toward solution, remedy, or enforcement against bond. Four graphs display the broken unfixable bizarre situation. Graph 1 – BALANCE SHEET DESTRUCTION Central bank balance sheets could take decades to normalize, so the conventional thinking goes. Their balance sheets will never return to normal. Most assets of toxic paper are far more worthless than junk bonds. A normalization process would require at least 50 years of more financial repression and deep corruption. A massive global debt writedown of sovereign bond is coming, on the back end of the Global Financial RESET. Think paradigm shift of the most disruptive type while power shifts eastward. The risk of war rises. The big Western banks find themselves in an impossible Catch-22 situation. The markets are addicted to QE and its destructive money hyper inflation. Federal Reserve policymakers have acknowledged that their $4 trillion balance sheet will not shrink any time soon. Also, Bank of England officials talk of crisis fighting tools as semi-permanent fixtures. In Asia, the Bank of Japan has developed a new monetary policy framework that features admitted infinite QE. The financial crisis the balance sheet volume to GDP ratios for the Bank of England and USFed have peaked at around 25%, the highest level ever recorded. Uncharted territory has been entered. The USFed balance sheet ratio to GDP previously reached 23% in 1940 during World War II. The Bank of England ratio approached 20% in the 1730s during the South Sea Bubble scheme, 1816/17 during the Great Re-coinage, the 1830s/1840s following other wars, and in the immediate aftermath of WW2. In every scenario above, the central banks managed to unwind their balance sheets. But then the great unwinding took decades, up to 60 years in some cases. This time is different. No economic growth is anywhere remotely on the current horizon, nothing sufficient to unwind the tremendous debt burden. This is where the conventional analyst turns stupid, even locked in fantasy. They assume the GDP growth has been around 3% in recent years, when it has been closer to minus 4% or minus 5% each year since 2008 in a fierce recession with strong feedback loops. We are not on the verge of economic expansion, which can relieve the balance sheet toxicity, but rather a financial reform to sweep away the USDollar and to render its USTreasury Bonds as near worthless paper. The next chapter will be centered upon the Gold Standard, first in trade payment, next in bank reserves, finally in currencies. READ FULL ARTICLE THE VOICE OF REASON is the pen name of Michael DePinto, a graduate of Capital University Law School, and an attorney in Florida. Having worked in the World Trade Center, along with other family and friends, Michael was baptized by fire into the world of politics on September 11, 2001. Michael’s political journey began with tuning in religiously to whatever the talking heads on television had to say, then Michael became a “Tea-Bagging” activist as his liberal friends on the Left would say, volunteering within the Jacksonville local Tea Party, and most recently Michael was sworn in as an attorney. Today, Michael is a major contributor to www.BeforeItsNews.com , he owns and operates www.thelastgreatstand.com , where Michael provides what is often very ‘colorful’ political commentary, ripe with sarcasm, no doubt the result of Michael’s frustration as he feels we are witnessing the end of the American Empire. The topics Michael most often weighs in on are: Martial Law, FEMA Camps, Jade Helm, Economic Issues, Government Corruption, and Government Conspiracy. Submit your review'"}, "time": 1742561770.0144396}