{"duration": 0.053060054779052734, "input_args": {"text": "'Singer Joy Villa’s album sales spiked significantly after the   ’s   Trump Grammys dress set social media on fire Sunday. [Villa walked the red carpet wearing a     dress decorated with Trump’s “Make America Great Again” slogan. Hours after unveiling the gown, digital sales for Villa’s album, I Make the Static, climbed to the top spot on Amazon’s list of top 100 digital albums.  The 2014 rock album’s sales also spiked, hitting the number seven spot on the iTunes top albums list, Fox News reports. According to the screenshot she shared, the singer’s album was beating albums by more   artists like Big Sean and Lady Gaga, the latter of whom performed during Sunday night’s ceremony. As of 9 a. m. Pacific Time on Monday, Villa’s album was at the #11 spot on the iTunes charts, while Lady Gaga’s The Fame was at #33 and Beyoncé’s Album of the   Lemonade was at #90. Blown away and overwhelmed by the positive feedback, Villa thanked her “amazing fans and supporters,” which she said had left her “speechless. ” “I’m speechless  …    you, my amazing fans and supporters have put me to #16 on the iTunes Top Albums Charts! ,” the singer wrote on Instagram.  🎶I’m speechless  …    you, my amazing fans and supporters have put me to #16 on the iTunes Top Albums Charts! 😯😱🎶#imakethestatic #itunestopalbum #itunescharts #joyvilla #joyvillagrammys #maga #godblessamerica @mwprinc @thorstenovergaard @officialandresoriano @itunes @realdonaldtrump, A photo posted by Joy Villa (@joyvilla) on Feb 12, 2017 at 11:32pm PST,  Villa said she wanted to make a statement and “go boldly and give no effs. ” The singer’s message was apparently   though not everyone liked it. From calls for her death to degrading insults, the   “tolerant” left smeared Villa for daring to express a political view not in accordance with their own. Last year, teenage classical singer Jackie Evancho saw sales of her albums skyrocket following news that she was to perform the National Anthem at Trump’s inauguration.   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742563521.1907113}