{"duration": 0.07282257080078125, "input_args": {"text": "'Home / Be The Change / Mark Ruffalo Delivers Mobile Solar Trailers to Standing Rock Camps in Preparation for Harsh Winter Mark Ruffalo Delivers Mobile Solar Trailers to Standing Rock Camps in Preparation for Harsh Winter Jay Syrmopoulos October 30, 2016 2 Comments \\nCannon Ball, ND – In a show of kindness and solidarity with the Standing Rock Sioux, actor Mark Ruffalo and Native Renewables founder Wahleah Johns presented Sioux tribal elders with mobile trailers equipped with solar collection arrays. The trailers provide a clean energy source for the protest encampment where over 500 Native American tribes have taken a stand against the Dakota Access Pipeline in the largest gathering of American Indians in modern history. \\n“This pipeline is a black snake that traverses four states and 200 waterways with fracked Bakken oil,” said Ruffalo, co-founder of The Solutions Project, a venture that works to transition society to clean and renewable energy. \\n“We know from experience that pipelines leak, explode, pollute and poison land and water. But it doesn’t have to be that way.” \\nThe solar trailers will allow for medical tents and numerous other critical facilities to be powered with clean energy, and represent exactly the healthy/abundant future of energy for which the Standing Rock Sioux are currently fighting. \\n“Water is life,” said Johns, a Navajo leader. “By leading a transition to energy that is powered by the sun, the wind and water, we ensure a better future for all of our people and for future generations.” \\nAccording to a report by EcoWatch : \\nJohns’ company, Native Renewables, promotes low-cost clean energy solutions for Native American families throughout the U.S., with an emphasis on job creation and on benefiting the community as a whole. The trailers were built by members of the Navajo nation and were financed by Empowered by Light and Give Power. \\nResearch led by Stanford Prof. Mark Jacobson, another Solutions Project co-founder, shows that it would be technically possible and economically beneficial to transition to 100 percent clean renewable energy in each and every state across the country. In North Dakota, for example, wind and solar energy would be the primary sources of clean power and transitioning to 100 percent renewables would create 30,000 jobs. \\nThe reality of the situation is that the Standing Rock tribe is fighting to protect their source of clean water. The Dakota Access Pipeline puts the tribe’s clean water supply, as well as that of millions of others, in danger, as the pipeline is scheduled to go directly under the Missouri River. \\n— Dan Zukowski (@danzukowski) October 25, 2016 \\nThe construction of the “black snake” marks the conglomeration of corporate/banking interests being elevated above that of the public interest. Furthermore, the ongoing construction has already desecrated sacred burial sites and cultural artifacts. “Around the world, more than 80 percent of the forests and lands with protected waterways and rich biodiversity are held by indigenous tribes. This is no coincidence,” Ruffalo said. “As so many of us suffer from polluted water, air and land in our rural and urban communities, the water defenders at Standing Rock are showing us another way.” \\nImagine how you would respond if an oil pipeline was being dug through the cemetery where your grandparents and great grandparents were buried. \\nMark Ruffalo taking a stand for the Standing Rock Sioux is a great example for all individuals, celebrity, and non-celebrity alike. Rather than simply donating some money to a cause, he has utilized his celebrity to bring much greater attention to the continued injustices being perpetrated against the Native American community. \\nIt’s clear that Ruffalo has taken a page out of Ghandi’s book, and is “being the change he wishes to see in the world.” \\nPlease share this inspiring human story — and take a stand for Standing Rock! Share'"}, "time": 1742562020.453464}