{"duration": 0.0487213134765625, "input_args": {"text": "'Home › POLITICS | US NEWS › BLOOMBERG-BACKED PENNSYLVANIA ATTORNEY GENERAL SENTENCED TO 10-23 MONTHS IN PRISON BLOOMBERG-BACKED PENNSYLVANIA ATTORNEY GENERAL SENTENCED TO 10-23 MONTHS IN PRISON 0 SHARES \\n[11/1/16] NRAILA – Back in August , we reported that Michael Bloomberg-backed then-sitting Pennsylvania Attorney General Kathleen G. Kane had been found guilty of criminal conspiracy and perjury in a case stemming from the abuse of her office. Kane’s sentencing hearing was held Monday, where Judge Wendy Demchick-Alloy sentenced the former attorney general to 10 to 23 months in prison. In 2012, Kane was elected Attorney General of Pennsylvania with the help of a $250,000 Bloomberg-funded ad campaign against her opponent. Even before assuming office, Attorney General-elect Kane attacked the Right-to-Carry by signing a letter opposing federal reciprocity legislation. Kane would go on to attack Right-to-Carry reciprocity again, unilaterally and illegitimately eliminating Pennsylvania’s recognition of non-resident Florida Concealed Weapon Licenses. According to the Philadelphia Inquirer , at the sentencing hearing, Demchick-Alloy admonished Kane for her conduct in leaking confidential grand jury materials as part of an attack on a political rival. Demchick-Alloy stated, “The case is about ego, ego of a politician consumed by her image from Day One… And instead of focusing solely on the business of fighting crime, the focus was battling these perceived enemies … and utilizing and exploiting her position to do it.” A colleague that testified at the hearing described Kane’s office by stating, “through a pattern of systematic firings and Nixonian espionage, she created a terror zone in this office.” In seeking a lenient sentence for his client, Kane’s attorney cited the consequences the convicted criminal had already suffered, telling the court, “She stands a convicted felon subject to public shame and public humiliation.” Further, the attorney argued that prison was a risk to Kane’s safety. According to the Inquirer, Demchick-Alloy appeared unimpressed, noting, “When you unfortunately dirty yourself with criminal behavior, you assume that risk.” Kane had faced a potential 12 to 24 years in prison for her crimes. Though Demchick-Alloy imposed only a fraction of the maximum sentence, Kane’s punishment should be enough to prevent her from obtaining a position where she could torment her political adversaries, or Keystone State gun owners. Post navigation'"}, "time": 1742561832.8881779}