{"duration": 0.023487567901611328, "input_args": {"text": "'Comments \\nVarious media outlets jumped the gun today when they raced each other to announce that the Federal Bureau of Investigation had reopened their investigation into Democratic nominee Hillary Clinton’s emails. But less than two hours later it’s clear that what actually happened has been blown way out of proportion and out of context. \\nFBI Director James Comey announced to Congress today that “investigators are examining newly discovered emails that ‘appear to be pertinent’ to the email probe. Although the FBI cannot yet assess whether or not this material may be significant, and I cannot predict how long it will take us to complete this additional work, I believe it is important to update you.” Clarifying: Comey doesn’t say the FBI is reopening the Clinton investigation per se, rather that it’s assessing newly found emails. \\n— Shane Harris (@shaneharris) October 28, 2016 \\nThe investigation is not “reopened”– technically, it was never closed. \\nThe new emails were not “hidden” or “recovered” or related to her email server in any way. \\nThe emails were discovered on the cellular device of former Congressman Anthony Wiener as part of an unrelated probe into whether or not Wiener was sending sexually explicit messages and photographs to minors. What the new emails contain is anyone’s guess, but they are not to or from former Secretary of State Hillary Clinton. Wiener’s soon-to-be ex-wife Huma Abedin is a longtime aide to Clinton. \\nThe media has been just as complicit as the Republican witch-hunters in Congress in perpetuating these baseless smears against the credibility of Hillary Clinton, one of our nation’s most dedicated public servants. \\nWhile Republicans are leaping on this news in hopes it will revive Republican nominee Donald Trump’s flailing campaign, these “developments” are nothing but a non-story from an overly impressionable media desperate for views on a slow Friday afternoon and deserves no more of your time.'"}, "time": 1742628453.1704054}