{"duration": 0.12958860397338867, "input_args": {"text": "'Derrick Rose had never attempted mindfulness sessions in his first seven years in the N. B. A. There had been moments with his therapist here and there that seemed similar, but nothing overseen by the Chicago Bulls. Just the thought of Tom Thibodeau, his old coach, looming over a meditation setting, his gravelly voice booming as he tried to instill calm, made Rose laugh. But in New York, Rose has come to enjoy new experiences, and in an organization run by a man nicknamed the Zen Master, that means taking part in team meetings based on mindfulness. That the Knicks take part in mindfulness exercises is not new. They have done so since Phil Jackson took over as team president in 2014. But after two years with George Mumford, a friend of Jackson’s, leading the sessions, Jackson has taken over himself this season. His influence, and the value of the sessions, is not that easy to gauge, since various Knicks have various opinions on the matter. But in general, most players said they found the exercises useful, even if they were not quite sure what they were doing. “It’s something different,” Rose said recently. “Something to relax you. Something to stimulate your mind and help you out in the long term as far as clearing your mind. There’s different things you can do I don’t take it for granted. Whenever I see those types of things, I try to focus in on it because you never know whether it gives you an advantage if you did. ” Jackson has long tried to keep his teams attuned to their inner selves. He first brought in Mumford, who now counts Michael Jordan and Kobe Bryant as pupils, to work with the Bulls in 1993. He was looking for someone to help the team deal with the burden of success: Chicago had won three consecutive championships. He knew of Mumford, who was working at a   clinic at the University of Massachusetts, through friends. While Jackson obviously believes in it  —   he did not respond to a request for comment for this article  —   describing what it entails is a little more difficult. Mumford admits it is difficult to talk about mindfulness and explain its aim. He compares it to improvisation, where actors and actresses confront the situations thrust on them and try to function inside those limits. The goal, he says, is to allow athletes to reflect and to slow down the mind  —   to get it into game shape. “This ability to step back and observe your experience in an uncritical way, you can actually understand how your mind works, how your body works, how the universe works, how basketball works,’’ he said. “And also understanding that when you’re performing at your best level, there’s usually a lack of  . ” Mumford will not say why he is no longer running the meetings for the Knicks, citing a contractual bind, but he has been replaced by Jackson at the head of the meetings. The Knicks have held this season’s mindfulness sessions since the start of training camp and try to have one once a week if they are at home. Before the team watches game tapes, the players, Jackson and Coach Jeff Hornacek will gather in the film room. The mindfulness meetings can then last upward of 15 minutes. Jackson leads the gatherings. Carmelo Anthony calls him “the mindfulness  . ” Jackson had done a similar stint when he coached the Lakers, but Sasha Vujacic, the Knicks guard who also played for Jackson in Los Angeles, says his impact had changed. “In L. A. it was completely different,” Vujacic said. “He was with us nonstop and had a big effect on everybody. Right now, I think it’s also getting there. It’s good. It’s him who is teaching us about that, and guys are picking up and learning about it. The minds are getting strong. That’s what matters. One mind, one breath. ” Jackson begins and ends each meeting with a message. Most have been focused on unity and finding the right state of mind  —   a   exercise. During the session, Rose said, the players are supposed to sit on the edge of their chairs, with proper posture, and to center their hands at the middle of their bodies. Jackson asks them to count to 10 and to count each breath, focusing on their awareness. For some, this is the first time they have earnestly tried any form of meditation. Others have had some previous experience. “I did a little bit,” Marshall Plumlee, the rookie center, said, referring to past attempts to meditate. “But I don’t think I really did it the right way, if there is a right way. The more I talk about it, I’m probably showing how little I know about it. What I’ve started trying to do with the Knicks I can tell you, firsthand, has helped me tremendously. ” Plumlee and some of his teammates have started using a phone app called Headspace that can be used to schedule short meditation sets throughout the day. Vujacic began meditating when he was a young player in Los Angeles and found it complemented his game. Now, he meditates on his own time. Anthony said he did, too. Jackson has also given the Knicks a book on the subject, “Mindfulness on the Go,” but that may be drawing less interest. “I didn’t read it,” Rose said. “Nobody really read it. ” Not every Knick is intrigued with the mindfulness regimen. Kyle O’Quinn declined to comment when asked about the sessions. Courtney Lee did not seem eager to talk about them, either. “It’s difficult to explain,” he said. “Just know it’s mindfulness, all right. It’s mindfulness. ” Yet, the meetings may be less an end than a means. Anthony says he finds them useful but that he gets more out of meditating outside the facility. Even Mumford says there is no one way or drill that works for every player. Some players practiced through yoga, while Dennis Rodman listened to music. Justin Holiday, new to the Knicks this season, said he thought the sessions were helpful “if you take it seriously. ’’ “I think you’re going to need to do it more on your own time, though,’’ he added. “Once a week is good, I guess. It kind of helps you figure out how to do it. But I think if you do it more yourself and find it in your space, then it does help. ” And, oh yes, the Knicks are   this season and showing some real promise for the first time since Jackson came aboard. Something to be mindful of, for sure.'"}, "time": 1742561936.681396}