{"duration": 0.05128121376037598, "input_args": {"text": "'The result of the 2016 election has thrown this country for a loop. Some celebrate the win of President-elect Donald Trump while others continue to mourn the current president’s ultimate transition of power. A number of Americans are excited to see what a non-politician will do in a political environment, while others are worried that he will maintain the antics that awarded him the Oval Office. The country continues to experience a great divide that has many Americans trapped between fear and faith.\\nThe previous perspective of the nation, according to some, included a series of victories and a country on an incline. However, others disagree by saying President Barak Obama is the worst “thing” to ever happen to the White House. Ironically, many of these same people “believe” racism did not exist until he became president. In the same vein, others feel the division crisis, which includes race, ethnicity, and sexual orientation among other issues will increase with the induction of Trump as the leader of the free world. Today, America is shrouded in a most un-American pessimism as many within this great country remain trapped between fear and faith.\\nOn one side of the divide, there are people who are fed up with the mistreatment and injustice they have experienced. These millennials have decided to take matters into their own hands with protests and other questionable behavior patterns. Undoubtedly, if hope continues to decrease, violence will increase and blood will continue to spill in the earth. \\nOn the other side, there are people who embrace the faith of a changed country “made great again” with the entrance of new authority. As such, Trump serves as a beacon of hope to his core supporters. He seemingly indulges their ambitions to maintain America’s system of oppression and inspires them in dangerous ways that have the potential to lead to serious consequences. Instead of seeking unity, Americans from all sides are fighting to be right. However, when hate overpowers love, no one is right.\\nIn order to understand the fear surrounding the election results, a conversation would need to take place in search of real issues. Not enough people are interested in problem-solving. Onlookers who criticize and judge a generation that is destroying their town as they march through the streets, only serve as fuel for their fury. People have called them animals and all sorts of derogatory statements, without realizing that it is a terrible thing to feel trapped or caged. Before adding insult to injury, it may help if “outsiders” were more empathetic to their experience.\\nThe crisis of America will not change simply by the transference of power; it can only be made better by the conveyance of love. It is time for Americans join together and bridge the gap between fear and faith with the spread love as they continue to seek change. Otherwise, things will get worse.\\nIn many corners of the country and across the globe, the calamity has been met with love, compassion, and sympathy as people from all lifestyles join in a time of celebration and mourning. Even still, if people are not careful hate will find a way to slide through the cracks. However, if given the chance love will always prevail.\\nPeople’s view of the election is based on their experiences. Allow them to embrace their feelings and encourage them to find peace. Today the sitting President and President-elect met for the first time and did just that! Why? Because love still trumps hate.\\nOpinion by Cherese Jackson (Virginia) \\nSource:\\nPoliticus USA: Trump Supporters Saying ‘Give Him A Chance’ Forget How They Treated President Obama\\nPhoto Credits:\\nTop Image Courtesy of Max Goldberg – Flickr License\\nInline Image Courtesy of DonkeyHotey – Flickr License\\nFeatured Image Courtesy of KAZ Vorpal – Flickr License    America , election , Hope , Protests'"}, "time": 1742628380.3042784}