{"duration": 0.05736541748046875, "input_args": {"text": "'College Republicans at UC Davis have challenged a statement from UC Davis administrators claiming that the group cancelled MILO’s event voluntarily. College Republican representatives are claiming that the administration intimidated them, lied to them, and largely took the decision to cancel without them. [Speaking to Breitbart News, UC Davis College Republicans executive director, Andrew Mendoza stated that the campus group was “absolutely” intimidated by campus faculty into cancelling the event. UC Davis administrators reportedly told the College Republicans that they would be “personally liable for property damage and injury to people and even death. ”  “They basically took the decision without us and consequently forced us to take responsibility for it. ” said Andrew Mendoza speaking exclusively to Breitbart News, “We were heavily pressured by the university police to cancel the event, as we were told people’s lives could be endangered if it went ahead. ”  All responsibility was placed on the young students, “We were told that if our insurance failed it would be on us. ” said Mendoza. Of course this is not legally accurate, colleges are required to keep speaker and students safe at their expense. The responsibility for the safety of students and MILO is on the college, not the event organisers.  UC Davis is still attempting to claim that there was never a risk of violence at the event and that protesters acted peacefully, despite video evidence that directly proves otherwise. “The police have been excellent, the students are being completely peaceful and respectful, and they are standing up for the rights of the community,” said a UC Davis college counsellor as protesters outside reportedly smashed windows and threw barricades at police. “UCD is denying that there were hammers there. ” said Kurtie Kellner, a communications director for the Davis College Republicans, “We were told by Milton Lang (Associate to the Vice Chancellor for Student Life, Campus Community and Retention Service) that there were in fact hammers at the event. ”  “Our concern was about hammers and the protesters using them on the glass to get into building when the Chief of Police suggested that they had more concerning weapons. This was the safety concern that led to our cancellation of the event. If there hasn’t been hammers, we wouldn’t have feared for  ’s safety, and we wouldn’t have felt pressured to cancel the event. ”  When asked for comment, UC Davis Associate Director Andy Fell said, “To reiterate the statement we issued last night, the DCR cancelled last night’s event on the advice of UC Davis police and officials because it was no longer possible to continue the event safely. ” Watch MILO’s full march through UC Davis to protest the cancellation of the event here.'"}, "time": 1742563377.929548}