{"duration": 0.1287393569946289, "input_args": {"text": "'By wmw_admin on November 5, 2016 Rebecca Rosenberg and Daniel Halper — New York Post Nov 4, 2016 Weiner on horse at The Recovery Ranch rehab centre. Click to enlarge \\nThis horse’s ass is getting touchy-feely with a new partner. \\nAs this exclusive Post photo shows, Anthony Weiner spent Friday morning getting a dose of “equine therapy’’ for his sex addiction at The Recovery Ranch at Nunnelly, TN, a tony woodsy respite for deep-pocketed patrons. \\nThe perverted former Queens pol wore a bright-blue riding helmet, green T-shirt, blue jeans and sneakers as he saddled up his poor animal and hopped aboard, accompanied by a blonde. \\nWeiner — who was caught obsessively texting other women, including an underage girl , while married to top Hillary Clinton aide Huma Abedin — looked pensive as he meandered through the trees at the expansive ranch. \\nBut he turned decidedly glum when approached by The Post and asked for comment. He refused to say a word before riding slowly off. \\nWeiner recently got in more hot water with the Democratic Party when authorities investigating his sexting scandal discovered he had e-mails on his computer that could be linked to the FBI probe involving Clinton’s private server. \\nThe bombshell development couldn’t have come at a worse time for Clinton, who faces Donald Trump in a presidential-race showdown Tuesday. \\nBut Weiner, 52, is now worlds away, putting his time in at the secluded recovery ranch after Abedin jettisoned him when it surfaced that he even sexted selfies with their 4-year-old son sleeping in the background . \\nWeiner is bunking down at The Ranch’s Swan Creek House, one of several lodgings catering to its addled well-heeled clientele about an hour west of Nashville. \\n“Nestled amid rolling hills dotted with mature oaks and maples, Swan Creek House is a 15,000-square-foot home that features warm and inviting living spaces and breathtaking views of the surrounding hills,’’ The Ranch’s Web site says. \\n“The home’s sprawling outdoor spaces include a pond, natural rock landscaping and rolling hills as far as the eye can see. \\n“Also situated on the property is a state-of-the-art equestrian center equipped with lights, heated water and a ¾ bath, as well as 12 stalls, a wash area and a vet area for the equine partners.” \\nThe center’s equine therapy ‘involves caring and interacting with horses in ways that provide valuable lessons in accountability and in how we relate to others,’’ the site says. \\nWeiner is without his cell phone in the 15-bed facility, which is specifically for sex addicts — who are kept strictly separate by gender. \\nPlunking down a cool $25,000 for the 35-day program, according to online reviews, the disgraced dad still has to make his own meals and clean up after himself. \\nParticipants get daily group therapy. In addition to riding on a horse at least once a week, they also get plenty of other physical activity such as rope-climbing, zip-lining, hiking and canoeing, as well has have access to a gym. \\nIronically, Rob Weiss, who heads the ranch’s sex-recovery unit, penned an article for the Huffington Post in 2013 in which he talked about Weiner and fellow sex-shamed former New York Gov. Eliot Spitzer — as well as Ariel Castro, the monster who held captive and raped three young Ohio women for more than a decade. \\nAnother center at the 2,000-acre ranch — which singer Rihanna reportedly once considered to get treatment for a “love addiction” — revolves around a Native American sweat lodge. \\nThe sweat lodge is designed to offer “opportunities for physical detoxification, spiritual connection and emotional processing,’’ the ranch’s Web site says.'"}, "time": 1742564353.9893954}