{"duration": 0.05175209045410156, "input_args": {"text": "'The former papal spokesman has denied rumors that Pope Benedict XVI resigned under “tremendous pressures,” including from the Obama administration, asserting rather that he did so under his own volition. [In response to recent statements by Italian Archbishop Luigi Negri that suggested Benedict had resigned under significant duress, Father Federico Lombardi (pictured) said Thursday that the Pope Emeritus must be taken at his word when he said he had stepped down “in full freedom and responsibility. ”  “There is no mystery to be revealed,” Lombardi said. “Benedict XVI is a man who put the truth first. How can someone so blatantly contradict what he said and then solemnly reaffirmed?” In statements earlier this week, Archbishop Negri claimed that the Obama administration may have been complicit in the “tremendous pressures” that led the former pope to resign in 2013. It is “no coincidence” that some Catholic groups “have asked President Trump to open a commission of inquiry to investigate whether the administration of Barack Obama exerted pressure on Benedict,” Negri said in an interview Monday, citing revelations by Wikileaks regarding efforts by the Democratic Party to influence the Catholic Church in the United States. Father Lombardi, who was papal spokesman during the Benedict years, noted that the former pontiff offered a substantially different account of his resignation from the one offered by Negri, and he did so “publicly before the cardinals gathered in Consistory and the world” and again in an interview book with Peter Seewald titled Last Testament. According to Father Lombardi, Negri’s comments have provoked questions and “unnecessary confusion. ” Negri, who claims to be Benedict’s “friend,” offers an odd demonstration of friendship in “triumphantly” contradicting what his friend has said, Lombardi observes. “I do not think it is necessary to think of terrible pressures from overseas,” Lombardi states. “We can easily think that his was a very wise and sensible decision, before God and before men. ” “I believe that several of his successors will be grateful,” he said. Follow Thomas D. Williams on Twitter Follow @tdwilliamsrome'"}, "time": 1742561848.5280266}