{"duration": 0.051543235778808594, "input_args": {"text": "'A German federal state is considering forbidding the deportation of all migrants who happen to witness, or are victims of, “right wing” crimes when in Germany. [Brandenburg’s state parliament became the first in Germany to offer migrant victims of crime extra rights last year, after a rise in recorded “right wing” attacks. The new   measure is being pushed by the Ministry of the Interior.  “In addition to consistently preventing and prosecuting criminal offences, special protection of the victims and special care are necessary if the victims are people of foreign origin” proclaimed a decree of the Ministry of the Interior, issued in December 2016. It is argued that new arrivals are uniquely vulnerable, without support networks in Germany, and deportation could make their lives harder. The regional parliament also “decided, among other things, to ask the regional government to make sure that victims of right [wing] violent crimes are offered the possibility of being issued with residence permits and tolerances  …    ” It is believed this measure could help deter xenophobia and “far right” attacks on migrants, as such activity will only result in more migrants being allowed to stay in Germany. Migrants who commit a crime, or share responsibility for a violent incident when in Germany, will be exempt from the new rule. A resolution issued by the parliament in April 2016, in response to rising numbers of reported “right wing” crime, said “the victims of racist violent acts are migrant women as well as refugees” and argued that “such offences would be particularly difficult if their stay in the Federal Republic is unsecured”. According to the decree, crimes linked to the “right wing” in Brandenburg increased by 23 per cent in 2015  —   the year the Chancellor Angela Merkel opened Germany’s borders to more than 1 million irregular migrants. According to Die Welt, the populist,   migration Alternative for Germany (AfD) party has been critical of the new proposed policy.'"}, "time": 1742561919.5396724}