{"duration": 0.07947492599487305, "input_args": {"text": "'It was early in March 2015, the filmmaker Ava DuVernay recalled recently, when she was approached by Lisa Nishimura, the vice president for original documentary and comedy programming at Netflix, who asked “if I had any story I wanted to tell. ” As it happened, Ms. DuVernay had been thinking “about an overview of where the United States currently stands in terms of mass incarceration. ” By September 2016, the resulting movie, “13th,” opened the New York Film Festival. In January, after screening in some movie theaters, being made available free to some academic institutions and streaming on Netflix, the movie received an Oscar nomination for best documentary feature. “13th” was one of several pictures produced by streaming services to make it to the Oscars this year, but Ms. DuVernay (who was coming off an intensive Oscar campaign for her 2014 film, “Selma,” when she first spoke to Netflix) said that awards weren’t her concern when making the film. Nor could she pursue them after “13th” was out she had already begun her next film, the fictional “A Wrinkle in Time,” adapted from the Madeleine L’Engle book. She also didn’t make press junket rounds ahead of awards season. What secured the nomination were two things: the movie’s extraordinary quality and the perspicacious marketing department at Netflix’s documentary division. A couple of months back, I wrote about some of Netflix’s original films, lightweight comedies of varying quality. Several developments suggest a widening of the company’s ambitions in documentaries. The service began streaming the Sundance Film Festival’s Jury Prize winner, the dark drama “I Don’t Feel at Home in This World Anymore,” a month after the movie won that prize. And, in what movie business journalists are almost unanimously terming a major coup, Netflix announced its acquisition of the rights to “The Irishman,” a   return to the gangster genre from Martin Scorsese, in late February. The documentary division, though, has been moving from hit to hit since the   series “Making a Murderer,” which, along with HBO’s “The Jinx” and the podcast “Serial,” gripped the public imagination with innovative approaches to true crime. Ms. DuVernay’s “13th” made the   lists of many film critics in 2016, and it wasn’t the only   documentary to be nominated for an Oscar this year “White Helmets,” about the war in Syria, actually took home a statuette in the Documentary Short category. Netflix also presented “The Ivory Game,” a Leonardo   exposé of elephant poaching. Flexibility of formatting is one component of this success story. On March 28, Netflix will premiere “Five Came Back,” about a group of prominent Hollywood directors and how they were changed by World War II, in three episodes. Mark Harris, the film’s screenwriter and the author of the book on which it is based (who is a longtime colleague and friend of mine) noted that had the project been picked up by a television network, “the directive would have been, ‘Please fill this   slot.’ Whereas with Netflix, the first thing they asked was ‘What should this be? ’” Ms. DuVernay recalled that Netflix’s commitment to making “13th” what she thought it should be remained consistent for the entire process. “After I started it, I realized that it needed to be about more than the immediate situation, and I wanted to add historical perspective” she said. “That meant an expanded budget, and expanded time. ” She noted that she wanted a      cut reduced to 100 minutes. “Lisa told me, ‘It can be two and a half hours.’ The   length was something I wanted. ” Ms. DuVernay added, “The division is filled with people who are real filmmakers, who have made documentaries, been in the editing room. ” What it looks like to the creator is borne in mind throughout the process Netflix’s goal over all, according to the filmmakers working with them, is to create distinctive stories. “In this line of endeavor, you hear about things like network notes, and that’s always a kind of vicious punch line,” Mr. Harris said. “We kept waiting for that moment, but it never came. [Netflix] was always constructive and supportive. ” Ms. Nishimura, the executive making all this possible, said she was lucky “to have come from a professional background that supports creators first. ” Before joining Netflix almost a decade ago, she worked with Chris Blackwell, the music entrepreneur who founded Island Records, at the indie film company Palm Pictures. When she joined Netflix, it was a DVD rental entity, and she was buying up titles and “overseeing relationships with creators worldwide. ” In the process, she discovered that audiences had a hunger for documentaries not always reflected at the box office. “Television ratings exist because of ads, which we’re free of, and box office has become so reliant on Friday night returns that it’s warped perceptions of what audiences want,” Ms. Nishimura said. “Just because a person doesn’t go see a documentary on a Friday night, it’s not a reflection on the film it’s just a reflection that maybe a documentary isn’t a film that a couple is going to want to see on date night. What we’ve discovered is that we can elevate storytelling and bring it to a global platform and create a cultural moment. ” (According to a Netflix spokeswoman, 73 percent of all subscribers  —   more than 68 million  —   watched at least one documentary on the site in 2016.) “Making a Murderer” certainly created a cultural moment, and “13th” did so on a scale that even its creators did not necessarily expect. “When we created it, we wondered whether or not it was a uniquely American story,” Ms. Nishimura said. “Really it’s a story of ‘the other,’ and how we treat each other as humans, and what can happen when that goes awry. And so it did get a response from a global audience. And will continue to. The docs live on our service forever. We’re allowing stories to continue to find their ceiling over time. ”'"}, "time": 1742562339.4160645}