{"duration": 0.21598243713378906, "input_args": {"text": "'FRISCO, Tex.  —   The Dallas Cowboys’ new headquarters is sparkly and showy and so     that it makes the team’s longtime base of operations  —   in Irving, about 20 miles southwest of here  —   look like your grandparents’   rec room. The complex is like an airy, marbled museum, with reminders, maybe every 10 steps, that the Cowboys once were a dynasty: Super Bowl rings, Super Bowl trophies and hagiographic displays of all five of the franchise’s Super Bowl victories. But the shiniest part of the Cowboys these days was not in the complex’s blueprints: It’s Dak Prescott, who came out of nowhere to become the team’s new franchise quarterback. Prescott, a rookie drafted in the fourth round out of Mississippi State, led the team to 11 victories in a row before Sunday’s visit to New Jersey to face the Giants, a feat that not even Troy Aikman or Roger Staubach can claim. But in a visit to Frisco last week, it became even more clear how much Prescott’s ascent, like the team’s gleaming new home, is yet another reminder of one man the Cowboys have left behind: Tony Romo. “I know he wants to play and I know he wants to be out there, but he’s been really good about everything,” Prescott said of Romo. “He’s telling me about   and things he sees with a defense, or things he has seen in the past. He’s great. ” The Great Tony Romo? You’ll have to think back a while to remember how great. Romo was the undrafted rookie who became a Pro Bowl player, leading the Cowboys to four playoff berths and posting only two losing seasons after taking over as the starter in 2006. But while his career propelled the Cowboys forward year after year, it is also sometimes remembered for what Romo did not do when it mattered most. There was the botched hold on a   attempt that probably cost the Cowboys a chance for a playoff win at Seattle in 2007. The loss to the Giants in the postseason a year later that spoiled a   season. The    fades. The poorly thrown balls and the dozens of sacks. And then there were the injuries, which continue to thwart him. Prescott is starting at all only because Romo broke a bone in his back in the preseason  —   after his 2015 season ended early, to boot. Now Romo, 36, is stuck in a position that’s dreaded by every top athlete who knows the clock is ticking on his career: He’s watching the young Prescott lead the greatest Cowboys team in years to the playoffs, and knowing that wherever they go, he will only be along for the ride. “He’s earned the right to be our quarterback, as hard as it is for me to say,” Romo said of Prescott in what amounted to an official concession speech last month. “What is clear is that I was that kid once. ” When Romo was that kid, it was all so much fun. He sang Journey’s “Don’t Stop Believin’” at his locker, and he joked with the reporters who scribbled down his every word. Even when he was injured, he would brush off his physical problems because he was absolutely positive that he would come back, even better than ever. Most of the time, he was right. “When things don’t go your way,” he once told me, “you just have to come right back and say: ‘Let’s try this again. Let’s have some fun. ’” Romo doesn’t look as if he’s having any fun now. The black vinyl seat at his locker was empty when I visited Texas last week. Next to it was a pile of papers with information about the Giants, and how the Cowboys would match up. Romo had scribbled notes in the margins, knowing full well that it was unlikely that he would play. He doesn’t need to talk with reporters, and so, generally, he doesn’t. It’s a jarring change. When I covered the Cowboys for The Dallas Morning News in 2003, just after Romo was signed as a rookie free agent, I could always find him on the blue leather couches in the locker room, a motivational book in hand, the dimple on his left cheek showing because he was nearly always smiling. For three seasons, Romo sat and watched the Cowboys burn through quarterback after quarterback: Quincy Carter, Drew Henson, Vinny Testaverde, Drew Bledsoe. Romo, a friendly son of Wisconsin, seemed to know his time would come. And just like that, midway through the 2006 season, it did. He came in for Bledsoe against the Giants, and he never looked back. O. K. that’s an exaggeration. He’s probably looking back now. And who would blame him for being nostalgic? Now likely closer to his 40th birthday than he is to starting in a Super Bowl, he must wonder if he will ever take a snap for the Cowboys  —   for anyone  —   again. Others on the team must be wondering the same thing, though they won’t admit it. “I want to do what gives us the best chance to have Tony contribute to a championship,” the owner Jerry Jones said on his radio show last week. “Tony’s ready to go Tony’s not done,” said Scott Linehan, the Cowboys’ offensive coordinator. Tight end Jason Witten, Romo’s close friend and his favorite receiver, struggled to even consider the idea that Romo might never throw him another pass. He fidgeted as he considered his answer and admitted that he didn’t really want to give one. He and Romo were rookies together. They became the franchise players together. They even became fathers at about the same time. “We’ve kind of grown up together and went from being kids to being men at the same time,” Witten said. “I know that Tony’s always going to be the same guy, no matter what situation he’s dealing with, and I also believe he can still get it done on the field. ” He paused for a moment before adding, “But this game doesn’t slow down for anybody, and Tony understands that. ” Walking through the locker room in Frisco on Thursday, Romo looked less like an N. F. L. starter and more like someone who had just rolled out of bed. Tousled hair. Unshaven face. Baggy sweatpants. Head down and silent. Across the room, Prescott engaged a crowd of reporters. He is now the star of the show.'"}, "time": 1742564615.8135374}