{"duration": 0.49964070320129395, "input_args": {"text": "\"by Lambert Strether \\nI’m about to take down the thermometers from the 2016 Fundraiser. Thank you, readers, for helping us to exceed our goals! However, if you somehow missed out, you can visit our fundraiser page to see how to contribute by check, credit or debit card, or PayPal . And thanks again for all your support! \\nBy Lambert Strether of Corrente . \\nTTP, TTIP, TISA \\nCETA: “EU’s Canada free-trade CETA deal could be back on as Walloons agree to last-minute deal” [ Telegraph ]. “Belgium’s Prime Minister Charles Michel said that Wallonia was now in agreement, and the regional parliaments may now agree to CETA by the end of Friday night, opening the door to the deal being signed. Mr Tusk said that once the regional votes had taken place, he will inform Canadian Prime Minister Justin Trudeau. Any extra concessions given to Wallonia may mean other countries will want to look again at the deal, however.” (The BBC’s headline, then — “EU-Canada trade deal: Belgians break Ceta deadlock” — is quite irresponsible. As is– \\nCETA: “Belgium breaks Ceta deadlock” [ EUObserver ]. Not quite: \\nBelgium’s political entities agreed to a declaration on Thursday (26 October), which gives their government a green light to sign Ceta, the EU-Canada trade pact. \\nThe agreement was promptly sent to EU ambassadors in Brussels, to be discussed later in the afternoon. \\nAfter a week of marathon negotiations, Belgian prime minister Charles Michel said that Thursday’s talks had calmed “outstanding concerns”. \\nAs part of the trade-off, Belgium will ask the European Court of Justice to clarify the proposed investment court system, which was one of the most controversial elements of the trade deal. \\nCeta was due to be signed off by EU leaders and Canada’s prime minister Justin Trudeau at a summit in Brussels on Thursday. Trudeau cancelled the trip during the night as no agreement had been reached in Brussels. \\nIt’s not known when the summit will take place, or whether the Belgian go-ahead was the last hurdle. \\nThe other 27 EU countries must first accept the Belgian deal. \\nAt their meeting on Thursday, EU ambassadors will be accompanied by lawyers and representatives of the EU institutions, who will examine the legality and consequences of the text. \\nThe Walloon parliament will vote on the agreement on Friday. \\nStill, how do we slay these undead deals? The same thing happened with TPP. \\nCETA: “The great CETA swindle” [ Corporate Europe Observatory ]. “The latest PR move is a “joint interpretative declaration” on the trade deal hammered out by Ottawa and Brussels and published by investigative journalist collective Correctiv last Friday. It is designed to alleviate public concerns but in fact does nothing to fix CETA’s flaws. In September, Canada’s Trade Minister, Chrystia Freeland, and her German counterpart, Sigmar Gabriel, had announced such a text to appease Social Democrats, trade unions and the wider public who fear that CETA would threaten public services, labour and environmental standards and undermine governments’ right to regulate in the public interest. Several governments, notably Austria, had linked their ‘yes’ to CETA to the declaration. [But] According to environmental group Greenpeace, the declaration therefore has the ‘legal weight of a holiday brochure’.” \\nLegal experts have also warned that the declaration “could be misleading for non-lawyers, who might think that the Declaration will alter or override the CETA”. But it does not change CETA’s legal terms – and it is these terms which have raised concerns. As Canadian law Professor Gus van Harten explains: “Based on principles of treaty interpretation, the CETA will be interpreted primarily according to the text of its relevant provisions…. The Declaration would play a subsidiary role, if any, in this interpretative process.” In other words, legally (and thus politically), the CETA text is far more important than the declaration – and the former could prevail over the latter in case of a conflictive interpretation. \\nThe post then goes on to analyze the provisions of the declaration in detail, comparing them to the text. (Readers may remember that TPP advocates have made the same sort of claim for the TPP Preamble, which the text also over-rides . So, the Belgians are smart to get a court ruling on this. And we might also expect the adminsitration to use similar tactics to (the toothless distraction of) the CETA “resolution” in the upcoming attempt to pass the TPP. \\n“Belgian officials were discussing a working document aimed at addressing Wallonia’s concerns on the trade deal. The document, published by Belgian state media RTBF, shows that Belgium is moving toward requesting additional safeguards for the agricultural sector ‘in cases of market turbulence.’ It also puts forward a number of requests regarding the investor court system, including ‘progressing towards hiring judges on a permanent basis'” [ Politico ]. This seems to be a different document from the “declaration”; it was leaked by a different source. Here is is; it’s in French . \\nTPP: “Eight major financial services industry associations made an appeal to congressional leaders to support passage of the TPP this year, arguing that the deal is ‘vital to ensuring that the U.S. financial services sector remains a vibrant engine for domestic and global growth'” [ Politico ]. What the heck is a “vibrant engine”? Maybe a screw loose or something? Needs a tightening to stop the shaking and shimmying? \\nTPP: “Health, labor and consumer groups are warning President Barack Obama to refrain from including a 12-year monopoly period for biological drugs in legislation to implement the TPP as a means for addressing congressional concerns over the pact. The groups argue that such a move could undermine future efforts to shorten that protection period under U.S. law” [ Politico ]. “The letter, signed by Doctors Without Borders, the AFL-CIO, AARP, Oxfam and Consumers Union, also expresses concern over reports that the administration is prepared to negotiate side letters with TPP countries to reinforce U.S. lawmaker demands that countries respect a 12-year protection period, which reflects U.S. law.” \\n“The case against free trade – Part 1” [ Bill Mitchell ]. \\n2016 \\nDays until: 11. That’s only one more than ten days! \\nCorruption \\n“As a longtime Bill Clinton adviser came under fire several years ago for alleged conflicts of interest involving a private consulting firm and the Clinton Foundation, he mounted an audacious defense: Bill Clinton’s doing it, too” [ Politico ]. \\n“The unusual and brash rejoinder from veteran Clinton aide and Teneo Consulting co-founder Doug Band is scattered across the thousands of hacked emails published by WikiLeaks, but a memo released Wednesday provides the most detailed look to date at the intertwined worlds of nonprofit, for-profit, official and political activities involving Clinton and many of his top aides. \\nThe memo at one point refers bluntly to the money-making part of Clinton’s life as ‘Bill Clinton Inc.’ and notes that in at least one case a company — global education firm Laureate International Universities — began paying Clinton personally after first being a donor to the Clinton Foundation. \\nI think it’s important for young women and girls to see that a corrupt dynasty can occupy the White House a second time. \\n“Inside ‘Bill Clinton Inc.’: Hacked memo reveals intersection of charity and personal income” [ WaPo ]. Gives “intersectionality” a new twist, eh? Rather a lot of detail in this; well worth a read. \\nWar Drums \\n“Societies Under Siege is a sophisticated account of how, and why, economic sanctions applied in recent years to South Africa, Iraq and Myanmar affected the politics of those three countries without achieving the goals that the Western politicians which dictated them intended” [ Asian Affairs ]. \\nThe Voters \\n“Goldman Sachs: Election Won’t End Like Brexit” [Barrons, via Across the Curve ]. “We think that the upcoming U.S. election won’t end up as another Brexit-styled surprise for for two reasons.” \\nFirst, and most importantly, whole both situations represented an opportunity for voters to endorse a change in the status quo, voters in the UK were asked to decide on an idea whereas in the US they are being asked to decide on a person. The distinction is illustrated in US polling by the difference between the small share of Americans who believe the country is moving in the right direction (29%) and majority who approve of the job President Obama is doing (52%). \\nSecond. While the polls conducted on the eve of the referendum vote showed “remain” with a 4.6pp lead, in contrast to the 3.8pp actual vote margin in favor of “leave”, an average of polls published by the Economist magazine the day before the election showed a tied race, and showed “leave” leading for much of the prior month. As much as 10% of the public in many of these surveys was also undecided. By contrast, Sec. Clinton has led the average of presidential polls consistently for more than a year, with the exception of one week in late July following the Republican convention, and for most of the last year her lead has been substantial, averaging 4pp since the last primary elections were held. \\nIncludes a wrap-up of polling methodologies as well. \\nThe Trail \\n“Win or lose, the Republican candidate and his inner circle have built a direct marketing operation that could power a TV network—or finish off the GOP” [ Bloomberg ]. Fascinating article. Son of Berlusconi? \\nRealignment \\n“For decades, Democratic presidential candidates have been making steady gains among upper income whites and whites with college and postgraduate degrees. This year, however, is the first time in at least six decades that the Democratic nominee is positioned to win a majority of these upscale voters” [ New York Times ]. “What these figures suggest is that the 2016 election will represent a complete inversion of the New Deal order among white voters. From the 1930s into the 1980s and early 1990s, majorities of downscale whites voted Democratic and upscale whites voted Republican. Now, looking at combined male and female vote totals, the opposite is true.” \\n“Elizabeth Warren, the Democrats’ Madame Defarge, and Bernie Sanders, winner of 22 millennial-fueled primaries, are going to guarantee the revolution’s purity in any Clinton presidency” [ Wall Street Journal , “The Warren-Sanders Presidency”]. “For starters, they have a list. Politico reported in early September that Sen. Warren and progressive policy groups such as the Roosevelt Institute are ‘developing a hit list of the types of people they’ll oppose—what one source called ‘hell no’ appointments—in a Clinton administration.'” Well, we can but hope that the Roosevelt Institute has improved since 2011 . Readers? \\nDemocrat Email Hairball \\nStats Watch \\nDurable Goods Orders, September 2016: “Flat is the takeaway from the September durable goods report” [ Econoday ]. “Capital goods data are mixed. The good news is a 0.3 percent rise in core shipments (nondefense ex-aircraft) and an upward revision to August which is now unchanged. These results should give a boost to the business investment component of tomorrow’s third-quarter GDP report. But the bad news is the indication on future core shipments as orders fell a very steep 1.2 percent. … A concern in the report is continuing contraction in unfilled orders….” But: “This series has wide swings monthly so our primary metric is the three month rolling average which improved but remains in contracton. The real issue here is that inflation is starting to grab in this sector making real growth much less than appears at face value” [ Econintersect ]. And but: “This should have been doing better by now, indicating that, in general, unspent income is still not being sufficiently offset by deficit spending, public or private” [ Mosler Economics ]. \\nJobless Claims, week of October 22, 2016: “Initial jobless claims fell” [ Econoday ]. “All of the data in this report are at or near historic lows. Employers are holding onto their employees even as employment growth has slowed this year.” But: “The trend of the 4 week moving average is continuing to marginally worsened. The trend of year-over-year improvement of initial unemployment claims is moderating – and this trend historically indicates a weakening GDP” [ Econintersect ]. \\nKansas City Fed Manufacturing Index, October 2016: “A year-and-a-half of unrelenting contraction makes for easy comparisons, a factor behind what is now a rising trend for Kansas City manufacturing” [ Econoday ]. “Not all the early indications on this month’s factory activity are positive but the data in this report, along with the Philly Fed and national PMI flash, are definitely positive and are pointing to a fast start for the fourth quarter.” And: “̌ The Kansas City region was hit hard by the decline in oil prices, and it appears activity is starting to expand again” [ Calculated Risk ]. \\nPending Home Sales Index, September 2016: “Final sales of existing homes picked up sharply in September as did contract signings. Pending sales rose 1.5 percent in the month for the best showing since April” [ Econoday ]. And: “[A]bove expectations” [ Calculated Risk ]. But: “The unadjusted data shows the rate of year-over-year growth slowed this month. Even though I view the minutiae of the data differently, I agree with the [National Association of Realtors’] bottom line. There is not enough inventory – and this is slowing sales volumes all whilst creating a price bubble.” (The Econoday summary does not mention the NAR bottom line.) \\nBloomberg Consumer Comfort Index, week of October 23, 2016: “[U]p an outsized 2.6 points” (but volatile) [ Econoday ]. \\nHousehold Income: “The September 2016 median is not significantly different than the median of $57,403 in December 2007, the beginning month of the recession that occurred more than eight years ago” [ Econintersect ]. “And the September 2016 median is now 0.8 percent lower than the median of $58,085 in January 2000, the beginning of this statistical series.” Thanks, Obama! \\nShipping: “[UPS] company said average daily shipments in the U.S. increased 5.7% in its latest quarter” [ Wall Street Journal , “UPS’s Revenue Tops Views”]. Hmm. Stuff is moving. \\nShipping: “Drewry estimates that [shipping container] revenue for 2016 may reach $143 billion, although this means a negative trend when compared to $218 billion earned in 2012” [ Guardian Nigeria ]. “We forecast industry profitability to recover next year, thanks to improving freight rates and slightly higher cargo volumes, and so record a modest operating profit of $2.5 billion in 2017,’ it said. …‘The fact that the order book is at a virtual standstill is a major positive as is rapidly increased scrapping. But even so, the next two years will still be very challenging on the supply side with annual fleet growth of between 5 per cent and 6 per cent and many more ultra large container vessels (ULCVs) to be delivered,’ Drewry said.” \\nRail: “Norfolk Southern felt the ongoing decline in commodities business, with revenue from coal and chemicals off by double digits. But the railroad is also slashing costs and says it’s on its way to productivity savings of more than $650 million. That could bring a big boost in profits if demand heats up” [ Wall Street Journal ]. \\nToday’s Fear & Greed Index: 45 Neutral (previous close: 43, Fear) [ CNN ]. One week ago: 38 (Fear). (0 is Extreme Fear; 100 is Extreme Greed). Last updated Oct 27 at 11:21am. It’s like the kids don’t want to go into the haunted house, even if it is starting to rain. \\nHeatlh Care \\n“Health Law Tax Penalty? I’ll Take It, Millions Say” [ New York Times ]. “Some consumers who buy insurance on the exchanges still feel vulnerable. Deductibles are so high, they say, that the insurance seems useless. So some think that whether they send hundreds of dollars to the I.R.S. or thousands to an insurance company, they are essentially paying something for nothing.” \\n“An expert explains what is broken with Obamacare — and how to fix it” [ Vox ]. Larry Levitt, expert: “I think of the mandate as going hand in hand with the subsidies. It is entirely possible that both the mandate penalty and the premium subsidy are too small to make coverage affordable and convince enough people that they should buy it.” Because markets. And shame, shame on Sarah Kliff for letting Levitt leave single payer off the table. \\n“Drug maker thwarted plan to limit OxyContin prescriptions at dawn of opioid epidemic” [ Stat ]. You can fit the players right into this post: “Credentialism and Corruption: The Opioid Epidemic and ‘the Looting Professional Class.'” \\nOur Famously Free Press \\n“Facebook’s Trending Algorithm Can’t Stop Fake News, Computer Scientists Say” [ Buzzfeed ]. \\nBy scaling internationally, Facebook is creating a situation whereby future Trending failures will potentially occur at a scale unheard of in the history of human communication. Fake stories and other dubious content could reach far more people faster than ever before. \\nFor Trending to become a reliable, global product, it will need to account for the biases, bad actors, and other challenges that are endemic to Facebook and the news media. Put another way, in order to succeed, the Trending algorithm needs to be better than the very platform that spawned it. That’s because fake news is already polluting the platform’s News Feed organically. A recent BuzzFeed News analysis of giant hyperpartisan Facebook pages found that 38% of posts on conservative pages and 19% of posts on liberal pages featured false or misleading content \\nImperial Collapse Watch \\n“Rise of the American Mercenary” [ The American Conservative ]. ” [T]he rise of the contractor to wage America’s military operations is Obama’s silent national-security legacy, with more dead contractors on his watch (1,540 as of March) and little or no transparency about who these contractors are and what they do. [Foreign Policy writer Micah Zenko] scoffed at Obama’s insistence that he has pursued a ‘fight U.S. footprint’ across these lonflict zones. “Were it not for these contractors, Obama’s ‘light footprint’ would suddenly be two or three times as large,’ Zenko wrote.” \\nGaia \\n” Globalization has greased the slippery slope from factory to landfill by enabling the global distribution of defective parts. Whether they are pirated, designed to fail or just the result of slipshod quality control, the flood of defective parts guarantee that the entire assembly they are installed in–stoves, vacuum cleaners, transmissions, electronics, you name it–will soon fail and be shipped directly to the landfill, as repairing stuff is far costlier than buying a new replacement” [ Of Two Minds ]. \\n“The U.S. Environmental Protection Agency (EPA) was slated to hold four days of public meetings, Oct. 18-21, focused on essentially one question: Is glyphosate, the world’s most widely used herbicide, safe?” [ Alternet ]. “However, the EPA Scientific Advisory Panel (SAP) meetings were ‘postponed,’ just four days before they were suppose to meet, after intense lobbying by the agrichemical industry, including Monsanto. ” \\nClass Warfare \\n“Iowans on their wages: ‘I’m not stupid or lazy. It’s just not there'” [ Des Moines Register ]. \\nNews of the Wired \\n“Ig Nobel perception prize winner Atsuki Higashiyama: ‘Psychology teaches us to be scientific and skeptical'” [ Japan Times ]. \\n“HIV’s Patient Zero exonerated” [ Nature ]. “A study clarifies when HIV entered the United States and dispels the myth that one man instigated the AIDS epidemic in North America.” \\n“I’m home! Now I will fumble for my phone in my bag, open up my Home app, find the light function, switch it on and voila! Illumination. I remember when I used to have to lift my finger and flip the switch. Ha! Losing those 10 seconds is worth feeling like I’m in the future! This is some cutting-edge shit. It’s too bad these smart lightbulbs helped take down the internet last week” [ Medium ]. Yeah, basically. \\n“IoT Growing Faster Than the Ability to Defend It” [ Scientific American ]. “[C]onsumers will likely start paying more attention when they realize that someone could spy on them by hacking into their home’s Web cameras.” \\n* * * \\nReaders, feel free to contact me with (a) links, and even better (b) sources I should curate regularly, and (c) to find out how to send me images of plants. Vegetables are fine! Fungi are deemed to be honorary plants! See the previous Water Cooler (with plant) here . And here’s today’s plant (Rainbow Girl): \\nRainbow Girl: “Honies and Russolas.. Just picked … And then sauteed (garlic, olive oil, butter)… with prosciutto & raviolis!” Yum! 0 0 0 0 0 0\""}, "time": 1742628357.278686}