{"duration": 1.6887609958648682, "input_args": {"text": "'  \\nI owe our readers an apology. \\nIn covering the ludicrous letter sent by FBI Director James Comey to Republicans that misleadingly suggested new emails had been uncovered implicating Hillary Clinton in criminal activity, out of an abundance of caution I gave Comey the benefit of the doubt . Maybe this wasn’t overtly partisan electioneering by a Republican FBI director abusing his position? Maybe he just screwed up massively? \\nThat generous interpretation has all but been torched by Comey himself. Days after his letter made its way to Hillary’s political enemies (including Donald Trump), Comey has yet to set the record straight. The scandal has completely fallen to pieces around him. His own behavior in producing the letter, legal experts say, bordered on criminal . But Comey remains silent. He doesn’t even have the decency to admit he screwed up. \\nAnd that silence has enabled Republicans to continue lying about what is happening. Trump himself tells his supporters that the FBI director is pursuing a “criminal investigation” against Clinton – a blatant lie that could easily be snuffed out with a single message by the suddenly bashful Comey. We are now leading in many polls, and many of these were taken before the criminal investigation announcement on Friday – great in states! \\n— Donald J. Trump (@realDonaldTrump) October 30, 2016 \\nInstead of setting the record straight, and doing a small part to repair the damage to American democracy he had done, Comey is telling sources that he will refuse to clarify the anti-Hillary letter until after the election . Trump is probably high fiving his campaign staff right now. \\nNBC’s Pete Williams (whose track record covering the botched FBI letter has been impeccable): Pete Williams reports that Comey is UNLIKELY to say anything more before the election \\n— Sam Stein (@samsteinhp) October 30, 2016 \\nSo having felt totally comfortable with hurting Hillary Clinton’s campaign (over what amounts to nothing), Comey now decides it would be unfair to Trump to come out with the truth. That is a level of partisanship that is hard to wrap one’s head around. \\nAnd sadly, many people seem to be unaware that this new Clinton scandal has been completely manufactured by Comey and the Republican Party. According to poll expert Nate Silver, the post-“FBI letter” polls show Clinton’s lead dropping. If Democrats keep their eyes on the prize, it shouldn’t cost her the election, but it may diminish her chances of succeeding in creating the landslide required to completely eradicate “Trumpism” from American politics. \\nYou may not find that on the law books anywhere, but that is a crime nonetheless. \\nFeatured image via Alex Wong/Getty Images Share this Article!'"}, "time": 1742563848.9425955}