{"duration": 0.03914642333984375, "input_args": {"text": "'November 25, 2016 - Fort Russ News -  RusVesna - translated by J. Arnoldski -  \\n\\n\\n\\nThe Syrian Army is breaking through the defenses of terrorist gangs in eastern Aleppo and new neighborhoods have been liberated.  \\nFollowing several days of fierce firefights with jihadist bandits, Syrian troops have occupied new neighborhoods in the Hananu district, which since 2012 has been a stronghold of armed gangs in eastern Aleppo. In addition, the Syrian Arab Army has taken control of the Jabal-Badro district.  \\n\\n\\n\\nOn Thursday, government troops liberated more than half of the Hananu district as a result of a rapid offensive in northeastern Aleppo. Active support was provided by the air force and artillery. \\n\\n\\n\\nLed by the elite Tiger Forces, the SAA took full control of the Hananu fire station, post office, an orphanage, the Farooq and Omar Ibn al-Khattab mosques, the industrial zone, marriage registration department, and also a number of residential buildings.  \\nThe SAA forces assaulting the area are facing down terrorists from the Jebhat al Fath ash-Sham grouping, formerly known as Jebhat al-Nusra. \\nEarlier, Syrian troops occupied the important Tell Zuhur hill, which gave them a decisive advantage. Control over the top of the hill east of the Hananu district has allowed government forces to observe enemy activity and direct shelling deep into the district.  \\nAfter dark on Thursday evening, fierce clashes continued in the area as the gangs attempted to strengthen their new line of defense.  \\nThe SAA, Tiger Force, and Palestinian militia brigades from Al-Quds are continuing their offensive on militant positions. \\nThe seizure of the Hananu district will open the road to the neighboring districts of eastern Aleppo held by the Islamists for government and allied forces. \\n\\nAccording to reports from frontline sources, the Syrian army and Palestinian Al-Quds militia have successfully managed to clear a large part of the Jabal and Badro districts of terrorists and seize the Muslim cemetery district.  \\n\\n\\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742564282.4967983}