{"duration": 0.12671804428100586, "input_args": {"text": "'Home / News / Hillary Insisted America Fact Check Her, So We Did…Here’s 6 Huge Lies From The Debate Hillary Insisted America Fact Check Her, So We Did…Here’s 6 Huge Lies From The Debate fisher 4 mins ago News Comments Off on Hillary Insisted America Fact Check Her, So We Did…Here’s 6 Huge Lies From The Debate Hillary Insisted America Fact Check Her, So We Did…Here’s 6 Huge Lies From The Debate Hillary Clinton stood before millions of Americans last night and told numerous lies, then said things like “Google it”, suggesting we fact check her…so we did and found 6 major lies, plus others. FACT CHECK #1 – Hillary Clinton claimed that Planned Parenthood “provides cancer screenings” and therefore should not be de-funded, in spite of controversy about abortion. Fact-Check: MOSTLY FALSE This is a repeated claim deployed in defense of Planned Parenthood, but it is not true, at least as regards breast cancer. As the left-leaning Washington Post ’s fact-checker wrote in 2015: When Democratic lawmakers or other supporters assert that Planned Parenthood “provides” mammograms, this is highly misleading language because it could be interpreted to mean that the group directly administers the X-rays. The group does not “provide” mammograms. Rather, the situation is similar to other clinics where patients are referred to a licensed facility that can provide biopsies, X-rays or other specialized services. It is slightly more accurate to say that women have “access” to mammograms via Planned Parenthood, though it’s still slippery language. FACT CHECK #2 – Hillary Clinton responded to a question about Supreme Court and gun rights by saying, “I support the Second Amendment.” Fact-Check: FALSE When Clinton made this statement she was responding to a question about the District of Columbia v. Heller (2008) decision: a decision dealing with the foundations of the Second Amendment; the very roots of what it protects. In the Heller ruling, SCOTUS reaffirmed that the Second Amendment protects an individual right to keep and bear arms. This decision has become a bulwark against leftists who have spent decades in academia, politics and journalism trying to persuade Americans that the Second Amendment protects a collective right. (If collective, the left could tie gun ownership to service in the militia and bar gun ownership for anyone save those who serve in the militia or today’s military or police forces.) So Heller is crucial. In fact, it is so crucial that it is not be a stretch to say the entire Second Amendment rests on it. Yet Hillary disagrees the Heller ruling. Her spokesman Josh Schwerin said Hillary believes Heller was “ wrongly decided .” So how can a woman who does not believe in an “individual” right to keep and bear arms support the Second Amendment? She can’t. Incidentally, Clinton made this point evident during the debate when she said her disagreement with the Heller decision was the way the SCOTUS applied the Second Amendment in that case. For those of you who may not know, Heller centered on Washington DC’s gun ban–which was subsequently struck down via the SCOTUS decision. To oppose the application of the Second Amendment in Heller is to oppose the fact that a gun ban was overturned. That is not supporting the Second Amendment. FACT CHECK #3 – Hillary Clinton said during the third presidential debate in Las Vegas on Wednesday that she “will not add a penny to the debt” if elected president. Fact-Check: FALSE Indeed, Hillary Clinton’s claim is not even close to true. The Committee for a Responsible Federal Budget predicts that under Clinton’s policies , the debt would increase by $9 trillion over a decade. “Clinton’s plan would increase both spending and revenue,” the Washington, D.C.-based independent non-profit’s analyst said . “Under our preliminary updated central estimate, she would increase primary spending by $1.65 trillion over the next decade, including about $500 billion of spending on college education, $300 billion each on paid family leave and infrastructure, and significant new health-related spending.” FACT CHECK #4 – Hillary Clinton claimed that “33,000 people a year…die from guns.” Fact-Check: FALSE This is a claim Clinton often makes to make gun violence appear to be raging out of control; to justify the government stepping in with more rules and regulations to keep the American people safe. However, a Fact-Check shows Clinton’s claim is not only false, but is exaggerated by 66 percent. She is using figures from 2013, and reporting them in a way that distorts what really happened with guns that year. Clinton first began making this claim in November 2015, repeated it in April 2016, and has since repeated it again and again. In April Breitbart News highlighted the method Clinton used to swell the numbers: In 2013, the Centers for Disease Control and Prevention (CDC) reported 11,208 firearm-related homicides in the United States. An additional 505 accidental firearm-related deaths occurred in the US–a figure that pales in comparison to the 38,851 deaths by accidental poisoning or the 30,208 deaths caused by falls. So Clinton and gun control proponents who think like her increase these figures by adding in suicides. In this way, 11,713 firearm-related deaths–homicides and accidental deaths–quickly become 32,888 “gun violence” deaths in 2013 and an impetus for gun control. FACT CHECK #5 – Hillary Clinton praised President Obama ’s economic performance, adding: “He has cut the deficit by two-thirds.” Fact-Check: FALSE This repeated Democratic canard relies on fraudulent accounting that only starts more than halfway through Obama ’s first year in office, after the $862 billion stimulus, the massive omnibus spending bill (“porkulus”), and the deployment of the Troubled Asset Relief Program (TARP), which was signed by Obama ’s predecessor but for which he voted. As Breitbart News noted when President Obama claimed in January to have cut the deficit by “almost three-quarters”: This is pure fiction. Obama has doubled the national debt, and it’s not because he cut the deficit. Rather, he spent staggering amounts of money in his first months in office–which he assigns, dishonestly, to the previous fiscal year, under George W. Bush. He “cut” (i.e. spent more gradually) from that spending, but only under protest, after Republicans took the House in 2010. The truth is that Obama vastly expanded the deficit in a doomed and ill-conceived experiment in Keynesian stimulus spending, much of which was wasted on priorities that helped Obama ’s political supporters — especially the public sector unions — but did little for the economy. FACT CHECK #6 – Hillary Clinton said “We at the Clinton Foundation spend ninety percent — ninety percent — of all the money that is donated on behalf of programs of people around the world and in our own country.” Fact-Check: FALSE Indeed, Clinton’s “ninety percent” claim is false according to her troubled charity’s own t ax filings . Peter Schweizer, president of the Government Accountability Institute , Breitbart News Senior Editor-at-Large, and author of Clinton Cash said the Clinton Foundation has spent as little as six percent of its total income on actual charitable endeavors. “If you actually look at the numbers of their filings and 990s, that’s what it indicates,” Schweizer said last month in an interview with SiriusXM host Alex Marlow on Breitbart News Daily . “The Clinton Foundation will say, ‘We assisted or facilitated in 100,000 kids getting immunizations.’ Well, okay, what does that mean? And they don’t really tell you. They don’t really explain to you how it works.” “So the number is absolutely correct, that six percent goes to other charities,” Schweizer continued. “The other 94 percent is in this stew of marketing, and management, and travel expenses, and sort of all these obscure things, that it’s really hard to dissect what is the end result of that 94 percent being spent.” What’s more? Political analyst Sean Davis, the co-founder of The Federalist and a former adviser to Sen. Tom Coburn and Gov. Rick Perry, examined the Clinton Foundation’s 2013 tax filings and found that “ Hillary Clinton’s non-profit spent more on office supplies and rent than it did on charitable grants.” “The Clinton Foundation spent nearly $8.5 million–10 percent of all 2013 expenditures–on travel,” Davis contends . “Nearly $4.8 million–5.6 percent of all expenditures–was spent on office supplies.” (Source: Check out over 20 more Fact Checks at Breitbart) So there you have it, folks. It was hard to narrow it down to just 6, but these were among the biggest lies of the night. '"}, "time": 1742562681.6153314}