{"duration": 0.12954974174499512, "input_args": {"text": "'Lots of people make a living from the seasonal business of Christmas  —   lights, trees, stocking stuffers,   eggnog  —   but the    business of Hanukkah products is tougher. Some entrepreneurs have made it work (or are trying) with quirky products whether earnest (like the Star of David tree topper) or mildly subversive (like the Santa Claus yarmulke or a   bong). Some purveyors of these seasonal products, like Neal Hoffman, never expected to be in the Hanukkah business. Mr. Hoffman was shopping in a Nordstrom in 2012 when his son ran up to him holding an Elf on the Shelf, the popular Christmas toy. That turned out to be both complicated and fortuitous: complicated, because Mr. Hoffman is Jewish, his wife is Catholic, and they had decided to raise their children Jewish. And fortuitous because of what happened next. “I was like, ‘Dude, you can’t have that,’” said Mr. Hoffman, who previously had worked at Hasbro, the toy giant. “‘You can have a’  —   and I was like, what would be Jewish I could rhyme with?” he said. “And then I said, ‘I’m going to get you a Mensch on a Bench. ’” After raising more than $22, 000 on Kickstarter, Mr. Hoffman produced his first run of Mensch on a Bench dolls for the next holiday season, and he has been selling them ever since. They come with a storybook that situates the bearded character, who wears a black hat and a Jewish prayer shawl, in the Hanukkah story: He watches over the oil in the Maccabees’ temple to ensure it burns for eight days. “Elf on a Shelf is a great product,” Mr. Hoffman said. “But they just left the Jewish market sitting there saying: ‘What about us? What about our kids? ’” That first year, 2013, sales of Mensch on a Bench, which retails for $30, reached about $100, 000, mostly through Mr. Hoffman’s own website. In 2014, Bed Bath  Beyond picked up the product and Mr. Hoffman appeared on “Shark Tank,” and sales climbed to $900, 000. Revenues were $800, 000 last year and will be about the same this year  —   which suits Mr. Hoffman, who works out of his home and enjoys the lifestyle of a niche product entrepreneur. “We pull in a   profit, I get to do something I love, and I work maybe 20 hours a week during most of the year,” said Mr. Hoffman, who this season introduced a plush talking toy, Ask Bubbe. Amy Kritzer, who with her brother Andrew owns Modern Tribe, an online Judaica store with an offbeat edge, said that Hanukkah accounted for about 40 percent of annual revenue. Popular this year is the Emoji Menorah from Rite Lite ($30) with each candle base wearing a different expression, and the Jewdolph Knit Koozie ($12) a bottle sleeve with a   reindeer whose antlers form a menorah, from Freakers. Also on the website is the Yamaclaus, a fluffy    Santa Claus hat in the shape of a yarmulke. Alan Masarsky started Yamaclaus with his boyfriend, Larik Malish. Both grew up in interfaith homes, and both were fans of the 2003 episode of “The OC” that popularized the term “Chrismukkah,” a portmanteau for a merged Christmas and Hanukkah celebration. On the episode, characters wore what they called a yamaclaus. The couple had no inkling of starting a business when, in 2011, they hosted a holiday party and made their guests a crude version of the beanies out of red construction paper and cotton balls. They were a hit, so they checked to see if the trademark for Yamaclaus was available (it was) and if they could raise $2, 500 on Kickstarter to start production (they did). In 2013, Yamaclaus ($11) began selling on the company’s website, which today accounts for about 70 percent of sales. Mr. Masarsky, a marketing manager at Facebook who lives in San Francisco, said    sales had increased 200 percent this year, as it had the previous two, but declined to provide more financial details. Yamaclaus wearers who post photos on social media tend to be in nonreligious settings. “Tons of our customers wear them when they’re lighting a menorah,” Mr. Masarsky said. “But not at shul  —   not at a synagogue. ” Michael Krasny, author of “Let There Be Laughter,” a book about Jewish humor, said many jokes make light of Jews’ “anxiety of being assimilated and turning into Christians. ” Products that intertwine Christian and Jewish culture may be a positive force, he said. “They can have it both ways,” Mr. Krasny said. “We can call it an homage to Christians at the same time as it’s bringing to the fore something that’s associated with Jewishness. ” Interfaith households are on the rise. From 2005 to 2013, 58 percent of Jews who wed married gentiles (usually Christians) compared with 35 percent who did so from 1970 to 1974, according to the Pew Research Center. Morri Chowaiki grew up in a Jewish home his wife, Marina, grew up in an interfaith one. “She always wanted a Christmas tree, and I was like, no way,” said Mr. Chowaiki, who in 2005, after they were married about a decade, relented. “I said, ‘All right, just don’t go crazy  —   if I walk into the front room and there’s a nativity scene there, I might have a little issue with it. ’” Ms. Chowaiki bought and decorated a tree, then unveiled it. And her husband was impressed  —   it was festooned with dreidels and blue and silver ornaments. But at the top of the tree: a   star. “I laughed and said, ‘You couldn’t at least find a Jewish star to put at the top of the tree? ’” Mr. Chowaiki said. She told him she had looked  —   and found nothing. By 2009, he had designed and trademarked one, the Hanukkah Tree Topper, and sold about 2, 000. By 2013, the product had been picked up by retailers including Bed Bath  Beyond and SkyMall and sold 35, 000 units  —   and earned Mr. Chowaiki a spot on “Shark Tank. ” On that episode, Daymond John, the investor who founded FUBU, purchased a 35 percent stake in the business for $50, 000, and Mr. Chowaiki agreed to license out the product to Kurt S. Adler, a wholesaler that specializes in holiday items. There are now several versions of the product available online, starting at about $12. Once the tree topper was licensed, Mr. Chowaiki ceased to be involved in    operations. And in April, Mr. John hired him to head the sales and retail division of his company, the Shark Group. The Menorah Tree grew out of a similar marital dynamic: Michael Patchen, who is Jewish, wanted something festive to suit his wife, Jenny, who is half Catholic and half Jewish. In 2006, Mr. Patchen and his brother, Alex, made a menorah out of wood and artificial pine garland, decorated it with ornaments and lights, and surprised her with it. Now they sell a metal version that is seven feet high, assembles like an artificial tree and sells for $295 on their website. They’ve sold in the “low to  ” since introducing the product in 2013, said Alex Patchen, who declined to be more specific. In 2012, David Daily had an idea for how to make the Hanukkah party he and his wife were hosting in Austin, Tex. memorable: a menorah bong. Mr. Daily, who owns Grav Labs, a glass bong and pipe manufacturer in Austin with annual sales of $12 million, made the bong himself. It was about two feet long and had eight bowls with stems that could hold candles. “I definitely had a Jewish experience growing up of enjoying cannabis with all my cousins,” Mr. Daily said. “And this menorah bong obviously is meant to be shared. ” Their guests were, in every sense, bowled over, but Mr. Daily never planned on marketing the menorah bong. It sat on a shelf in his home for a couple of years. Then an online head shop, 420 Science, borrowed it and made a video of it in action. It garnered about two million views on Facebook and YouTube and has been shared on social media about 100, 000 times. Grav recently produced 100 menorah bongs. At 14 inches, they are less cumbersome than the original. They cost $700 from retailers including 420 Science. But Dr. Dreidel may not be widely available until next Hanukkah. Hannah Rothstein, a conceptual artist, conceived of the dreidel in 2014 and has made fewer than a hundred of the wooden tops on a commission basis, charging $150. The dreidel features images of Dr. Dre, the rapper and record producer, and a   version will retail for about $40  —   barring complications. “I have not gotten any    letters from Dr. Dre’s lawyers,” Ms. Rothstein said. “And if he wants to go in on the idea, we could make a million together. ” Next year she also hopes to produce a Hanukkah homage to Macklemore, another   artist: the  .'"}, "time": 1742562473.670431}