{"duration": 0.09483790397644043, "input_args": {"text": "'by Pepe Escobar for RT \\nIn yet one more spectacular chapter of his running Marco Polo in reverse saga, Chinese President Xi Jinping made a strategic stop in Sardinia, Italy, on his way to the Asia-Pacific Economic Cooperation (APEC) summit in Lima, Peru. \\nWhy beautiful Sardinia? Certainly not for a yacht cruise in the Costa Esmeralda. This is all about, once again, the Chinese-driven New Silk Roads. \\nHuawei is building its largest European HQ in Sardinia. The Chinese want to buy the port of Cagliari. And fabulous pecorino sardo – serious contender for best sheep cheese on the planet – in powdered form, is already feeding millions of Chinese babies. \\nAs a casual extra bonus “Marco Polo” Xi, on Chinese national TV, exhorted his compatriots to invest in a massive tourist invasion of Sardinia. Now this is what a stimulus package in Europe is all about. \\nMeanwhile, lame duck President Obama, also on his way to APEC, is in Germany passing the caretaker “leader of the free world” baton to a dear-caught-in-the-headlights Angela Merkel. The headlights go by the name Donald Trump. \\nTPP six feet under \\nThe sight of an ebullient Xi side by side with a dejected Obama against the background of South America’s Pacific coast will be priceless. Those were the days, in the go-go 1990s, when Bill Clinton ruled APEC, imprinting the American agenda. Now Asia-Pacific has to come to grips not only with protectionist Trumponomics, but also the fact that Obama’s cherished TPP – the mercantile arm of the “pivot to Asia” – is, for all practical purposes, dead. \\nTrump’s transition team, led by Mike Pence, has advised him to bury TPP (grouping the US plus 11 Pacific Rim nations) for good within his first 100 days in office. And the road map goes still further, advising him to drop out of NAFTA as well if a long list of “concessions” is not met. \\nDejected US allies – mostly Japan, Singapore, Australia and New Zealand – who had all been counting on the ascension of Hillary and the enthronization of TPP, are bound to conduct “secret” meetings in Peru aiming at a revised deal. That would have to assume that Republicans in Capitol Hill might agree with Trump having a go at some sort of renegotiation. \\nThen there’s the – far-flung – possibility of a cut rate TPP excluding the US. The US and Japan account for roughly 60% of the combined TPP group’s GDP. A TPP without the US is another beast entirely. \\nAnd that leads us to Beijing’s subtle counter-offensive; promoting the anti-TPP along the lines of the still-under-discussion Regional Comprehensive Economic Partnership (RCEP), which groups East Asia. Japan and Malaysia, as well as non-Asian Australia – three key players – all support RCEP. \\nAs much as the Trump-China relationship may eventually land on the proverbial stormy seas, Beijing can now be confident that the China-excluding trade arm of the pivot to Asia is history. \\nHere’s the official spin, via Chinese Vice-Foreign Minister Li Baodong; “China believes we should set a new and very practical working plan, to positively respond to the expectations of industry and sustain momentum and establish a free-trade area in Asia-Pacific at an early date.” No TPP; more like RCEP. \\nAll those resets \\nA new Asia-Pacific trade deal will definitely represent a reset in US-China relations. \\nThen there’s that other crucial reset; with Russia. \\nLame duck Pentagon head Ashton “Empire of Whining” Carter “advised” Trump and his team not to cooperate with Russia over Syria. \\nHe was solemnly ignored. \\nRussian Deputy Foreign Minister Sergey Ryabkov said Moscow does want cooperation. But he also said Moscow does not intend to “persuade the Pentagon leadership to change something in this regard.” \\nDiplomatic translation: You – the Obama administration – as far as we’re concerned, are dead. \\nSo there will be a reset. It will be extremely complicated, and on a Trumpian deal-to-deal basis: NATO expansion to Russia’s borders; Crimea; US missile defense; color revolution attempts. It will concern all of Eurasia. And it will start with cooperation in Syria. \\nBeijing and Moscow have concluded that Trump is not an ideologue (in the neocon mould); he’s a pragmatist. Resets are inevitable. Even surprises. \\nTrump may be inclined for the US to join the Asian Infrastructure Investment Bank (AIIB), heavily demonized by the moribund Obama administration. His $1 trillion infrastructure plan is something that China has already pulled off – starting already in the late 1990s. Ellen Brown has a top suggestion; print money, and build all the infrastructure you need. \\nAn eventual US-Russia deal in Syria would ultimately benefit – who else – China. Mirroring the original Silk Road, China sees Syria as a crucial node of the New Silk Roads, currently cut off. Picture the day in a not too distant future when Xi will be stopping in Damascus to do trade deals. And to call for a stimulus package of Chinese tourists to visit a restored Palmyra. The Essential Saker: from the trenches of the emerging multipolar world $27.95'"}, "time": 1742561919.9681413}