{"duration": 0.21275830268859863, "input_args": {"text": "'MILTON, Ontario  —   It was a day for talking, not running. Snow was piled along the streets. The driveway was icy. Ed Whitlock’s shoulder hurt. His face had been puffy. He did not feel well enough for the cemetery. At a visitor’s urging, Whitlock showed his display of novelty trophies. A beer can for winning a series of races as a   . (“There’s still beer inside! ”) A coffee mug for becoming the first (and still only) person older than 70 to run a marathon in under three hours. A baseball for throwing out the first pitch at a minor league game. “It bounced three times to the catcher,” Whitlock said a few days before Christmas. “My arm is terrible. ” It is not his arm, but his legs and lungs that have made him a scientific marvel and octogenarian phenom. In October, at 85, he set his latest   record, completing the Toronto Waterfront Marathon in 3 hours 56 minutes 34 seconds and becoming the oldest person to run 26. 2 miles in under four hours. Having set dozens of   records from the metric mile to the marathon, Whitlock remains at the forefront among older athletes who have led scientists to reassess the possibilities of aging and performance. “He’s about as close as you can get to minimal aging in a human individual,” said Dr. Michael Joyner, a researcher at the Mayo Clinic who has studied performance and aging. Whitlock’s career has been as unorthodox as it is remarkable. For starters, he trains alone in the Milton Evergreen Cemetery near his home outside Toronto. He runs laps for three or three and a half hours at a time, unbothered by traffic or the eternal inhabitants or the modern theories and gadgets of training. At the Toronto Marathon, he raced in    shoes and a singlet that was 20 or 30 years old. He has no coach. He follows no special diet. He does not chart his mileage. He wears no   monitor. He takes no ice baths, gets no massages. He shovels snow in the winter and gardens in the summer but lifts no weights, does no situps or  . He avoids stretching, except the day of a race. He takes no medication, only a supplement that may or may not help his knees. What he does possess is a slight build: He is 5 feet 7 inches and weighs 110 to 112 pounds. He also has an enormous   capacity an uncommon retention of muscle mass for someone his age a floating gait and an unwavering dedication to pit himself against the clock, both the internal one and the one at the finish line. “I believe people can do far more than they think they can,” said Whitlock, a retired mining engineer who was born in greater London and speaks with British  . “You have to be idiot enough to try it. ” Four years ago, at 81, Whitlock underwent a battery of physiological and cognitive tests at McGill University in Montreal. One of the tests measured his VO2 max, the maximum amount of oxygen that can be consumed and used by the muscles during exercise. It is measured in milliliters of oxygen per kilogram of body weight per minute. The higher the number, the greater a person’s aerobic fitness. A top     skier might have a VO2 max of 90, compared to 20 for those living independently in their 80s. Mr. Whitlock’s score was an exceptional 54. That is roughly equivalent to someone of college age who is a recreational athlete, said Russell Hepple, an exercise physiologist who performed the tests on Whitlock at McGill with his colleague and wife, Tanja Taivassalo. A VO2 max reading of 54 appears to be unsurpassed for people tested in their 80s, said Scott Trappe, the director of the   laboratory at Ball State University in Muncie, Ind. who has studied Swedish   skiers who continued to perform at high levels into their 80s and early 90s, including the 1948 Olympic champion Martin Lundstrom. “There’s nothing higher than that in the literature,” Trappe said of Whitlock. “It’s phenomenal physiology. ” At McGill, Whitlock also underwent imaging and biopsy testing of his muscles. The smallest functional entity of muscle is called a motor unit, which consists of a neuron and the muscle fibers it activates. The number of functioning motor units declines with age. For example, a healthy young adult has about 160 motor units in the shin muscle, called the tibialis anterior, which helps lift the toes. In an octogenarian, that number could have declined to about 60 motor units, Hepple said, but Whitlock retained “closer to 100. ” This preservation might largely be explained, he said, by a chronically elevated level of circulating chemicals, called neurotrophins, which protect and nurture neurons, helping them survive. “That’s a big advantage,” said Hepple, who has recently moved to the University of Florida and is continuing to analyze his study of Whitlock and other aging athletes. “If you have more motor units, in the context of age, that would be reflected in better maintenance of muscle mass, which in turn would translate into better strength. ” Even though Whitlock’s Prince Valiant hair has long grown white and thin, a photograph of him running in his early 20s shows a physique remarkably similar to his octogenarian build, Hepple said. “It really is an astounding picture,” he said. “Normally a person of Ed’s age might lose a third to 40 percent of their muscle mass over that span. For him to have more or less the same mass as he had in his 20s, that’s really something. ” Beyond genetics, there are other factors that surely have contributed to Whitlock’s stunning endurance, said Joyner of the Mayo Clinic. He compared Whitlock to Joan Benoit Samuelson, the 1984 Olympic marathon champion who has continued to run   hour marathons into her late 50s and has said she will attempt the extraordinary feat into her 60s. Neither Whitlock nor Benoit Samuelson could be considered extroverts. Yet athletes like them who remain highly active as they age “haven’t killed off their inner  ” Joyner said. He described them, in general, as curious, relatively unconstrained and full of “physical and emotional vigor,” not so different from the older aunt or uncle who insists on shooting squirt guns at family reunions. “There are biological factors I’m not naïve about that,” Joyner said. “But the message with these people is not that they’re freaks. It is that a whole lot of aging, with a bit of luck, is under some volitional control. ” Inevitably, though, even Whitlock has made some concessions to growing older. His weight before the Toronto Waterfront Marathon in October dropped to 105 pounds, and he wonders whether he is experiencing some muscle wasting. His marathon time at age 85, 3:56:34, is more than an hour slower than the 2:54:48 he ran in Toronto at age 73 in what is widely considered his greatest masters race. Adjusted for age, that race was the equivalent of a runner in his prime completing a marathon in 2:04:48, which is less than two minutes off the current world record of 2:02:57. Writing in The New York Times, the running journalist Marc Bloom said that Whitlock’s performance in 2004 may have made him “the world’s best athlete for his age. ” For that startling race, Whitlock’s training log showed that he did 43 training runs of three hours apiece. He did not measure the distance, but his speed at the time suggested that a   run could cover more than 20 miles, perhaps as many as 22 or 23, not much shorter than the distance of a full marathon. “I was much better prepared for that race than I have ever been before or since,” Whitlock said. In 2016, he set another flurry of   records, including a half marathon run in 1:50. 47. But there were also more frequent interruptions in training  —   aches in his shoulder, knee, hip and groin. He was limited to 16 training runs of three hours for the most recent Toronto Marathon. His race pace of 9:01 per mile, while impressive, was nearly two and a half minutes slower than the 6:40 pace he ran at 73. “When you get to my age, the rate of deterioration is accelerating,” Whitlock said. “I’m sure every year, every six months, make a difference. I don’t seem to be able to consistently train. Whether that’s a permanent situation, I’m hoping not. ” The next looming marathon record is for age 90 and beyond. Fauja Singh of England ran 5:40:04 at the purported age of 92 in 2003, but his mark has not been ratified because he has been unable to produce a birth certificate. Otherwise, statisticians list the   record variously as 6:35:47 or 6:46:34. “We’ll see if I’m running when I’m 90,” Whitlock said. “You never really know if you’ve run your last race or not. I think I do have longevity in my genes”  —   an uncle lived to 107, he said  —   “but you never know, you might get hit by a bus. ” As a schoolboy in London in the 1940s, Whitlock said, he ran a mile in 4:34. He later belonged to the same running club, Walton Athletic, as did Chris Chataway, who paced Roger Bannister to the first   minute mile, in 1954, and Alan Turing, the mathematician who broke Germany’s Enigma code in World War II. Whitlock’s running career ebbed late in college when he sustained an injury to the Achilles’ tendon in his right foot. Upon graduating in 1952 from the Royal School of Mines at Imperial College in London, he emigrated to Canada, north of Toronto, and did not run for nearly two decades, until he was 41. “No one was running there at the time,” he said. “I was in no mood to be a pioneer. ” He kept in reasonable shape by refereeing soccer matches, cycling and walking. Whitlock’s long layoff from running, scientists said, probably saved wear and tear on his joints. He has also taken a year off three times to recover from aching knees. “He knows when to rest,” said Ken Young, a   of the Association of Road Racing Statisticians. Whitlock’s first marathon came in 1975, at age 44, out of parental concern. His youngest son, Clive, 14 at the time, had run every day for a year and wanted to attempt a marathon. “We did our best to try to persuade him out of that,” Whitlock said. “He was not to be denied. ” Father and son ran in 3:09, and four years later, at 48, Whitlock ran his fastest marathon, in 2:31. He became more devoted to the event after retiring and attempting to become the first person 70 or older to run 26 miles 385 yards under three hours. In running and exercise science circles, he has become “a rock star,” Trappe said Amby Burfoot, the winner of the 1968 Boston Marathon and a longtime editor at Runner’s World magazine who continues to run at 70, said, “For a guy who looks like a     wind could blow him down, Ed just keeps going and going, setting his own path and records and no one can come close to them. ” Asked why he kept running, Whitlock candidly said he enjoyed setting records and receiving attention. His approach remains pragmatic. He does not experience a runner’s high, he said, and does not run for his health. He finds training to be drudgery and even racing brings as much apprehension as joy. “The real feeling of enjoyment,” he said, “is getting across the finish line and finding out that you’ve done O. K. ”'"}, "time": 1742561926.777464}