{"duration": 0.06701350212097168, "input_args": {"text": "'Hillary In Prison Costume Annoys Liberals After They See Whatâ\\x80\\x99s Behind Her Posted on October 31, 2016 by Robert Rich in Politics Share This \\nA womanâ\\x80\\x99s Halloween costume is going viral after she snapped a quick picture and posted it to Twitter. Although a few panties were in a wad because she dressed as Hillary Clinton wearing a prison jumpsuit, liberals just about went into full meltdown after seeing what was behind her. \\nThe image was actually seen on the social media account of The Blaze reporter and famed conservative commentatorÂ Tomi Lahren Â after she shared one of her videos from Facebook. \\nAs it turns out, one of her subscribers had a picture that made for the perfect response. As can be seen, a woman decided to dress up as Hillary Clinton in a prison jumpsuit â\\x80\\x93 but thatâ\\x80\\x99s far from the complete picture. \\n— Mr. Cards (@MrCards007) October 21, 2016 \\nHitting her point home, it seems as though the womanâ\\x80\\x99s significant other decided to dress up as Donald Trump, who was actually hauling Hillary Clinton off to jail. The visual created reflects Mr. Trumpâ\\x80\\x99s promise given during the second debate when he said that he would put her in jail. \\nOf course, others seemed to have loved the idea so much that they decided to duplicate the idea while putting their own spin on things: so my parents dressed up as trump & Hillary for prison for the costume party… pic.twitter.com/9RVAx4834z \\n— Faith Sampson (@Faithh_Sampsonn) October 29, 2016 \\nEven a few kids got involved with the Halloween costume idea: Happy Halloween ! đ\\x9f\\x91ťđ\\x9f\\x8e\\x83 \\n— Donald J. Trump (@P0TUSTrump) October 31, 2016 \\nWith everything thatâ\\x80\\x99s come out during the recent days, thereâ\\x80\\x99s only one place that Hillary Clinton deserves to be. Between compromising the security of the American people through the use of her illegal email server to whoring out our country to fill her pockets, there isnâ\\x80\\x99t a single person who can argue that this woman is a criminal. \\nFortunately, it seems that FBI Director James Comey recently found his backbone and decided to actually start holding Hillary accountable. Letâ\\x80\\x99s just hope Trump wins this election by a landslide and can follow through with that promise to lock Hillary away once and for all.'"}, "time": 1742561906.3494198}