{"duration": 0.09271621704101562, "input_args": {"text": "'LOS ANGELES  —   Dead. Embalmed. Buried. A year ago, that is what most movie studios would have said about   musicals, pointing to a long line of box office calamities: “Rock of Ages,” “Burlesque,” “Jersey Boys,” “Across the Universe,” “Nine. ” The few    successes in recent decades have been adaptations of Broadway classics (“Les Misérables,” 2012) or marketed in misleading ways. When 20th Century Fox was selling Baz Luhrmann’s hit “Moulin Rouge!” in 2001, the studio was so afraid that people would stay home if they knew it was a musical that the trailer rather awkwardly tried to avoid singing at all costs. But Hollywood, excited in part by the critical and commercial success of “La La Land,” which cost Lionsgate $30 million to make and has taken in $132 million worldwide as it streaks toward the Academy Awards, is taking out its jazz hands again. There are roughly 20 musicals in the works at studios, according to the film database IMDBpro. Some are   adaptations of classic animated musicals, like “Beauty and the Beast,” directed by Bill Condon and set for release by Disney in March. Others are films (among them, “Wicked”) based on contemporary Broadway hits. Moreover, several studios  —   for the first time since the 1990s  —   are devoting meaningful resources to    films with original music. This year, Fox will release “The Greatest Showman,” which stars Hugh Jackman as the circus impresario P. T. Barnum it has a dozen original songs. Disney has “Bob the Musical,” about a man whose life becomes filled with song after a head injury. Universal Pictures won a bidding war for an untitled musical comedy starring Josh Gad, with original songs by the   Alan Menken and Stephen Schwartz. There are several reasons for renewed studio interest, said Marc Platt, a “La La Land” producer whose other projects include an original    film that will star Will Ferrell and Kristen Wiig and a sequel to “Mary Poppins” with a new score. “Thankfully, as much as Hollywood is interested in brands, I think people are still looking for originality and freshness,” Mr. Platt said. “Musicals can also be their own brand: They have an event status. I also think the ceiling on the audience is lifting. You’ve got a new generation of fans who have grown up with television shows like ‘Glee. ’” Mr. Platt added, “Music has a way of getting inside all of us and lifting us up. ” Put another way, there is an inherent entertainment proposition in musicals, a heightened emotional experience that people go to the movies to find. Mr. Platt, a former senior executive at Universal (and the father of Ben Platt, star of the hit stage production “Dear Evan Hansen”) has in many ways become Hollywood’s   producer of movie musicals. In 2014, he shepherded Disney’s adaptation of the Stephen Sondheim musical “Into the Woods,” which took in $213 million worldwide. As a major force behind “Wicked” on Broadway, Mr. Platt is working with Stephen Daldry (who directed the film version of “Billy Elliot”) to bring a movie version to theaters in 2019. “Yes, still on track,” Mr. Platt said of that   project. Nothing fuels a Hollywood boom (or a boomlet, as the case may be with musicals) like a track record of success. And some studio executives said that they were becoming more open to musicals because the animated variety had experienced such a renaissance. “Frozen” was a monster hit, selling $1. 3 billion in tickets worldwide. Over the past few months, three animated musicals  —   “Sing,” “Moana” and “Trolls”  —   have taken in a combined $1 billion at the global box office. Disney will release a singalong version of “Moana” (with lyrics on the screen, karaoke style) on Jan. 27. Some studios have also had recent success with   including films like “Pitch Perfect” that rely on pop hits and mostly keep the singing to stage settings. Television may also be giving film executives confidence specials like “The Wiz Live!” and “Grease: Live” have reintroduced    entertainment to a mass audience. Still, not everyone in Hollywood is convinced of a musical comeback. Kevin Goetz, chief executive of the film research company Screen   said in an email that he had no research indicating increased demand. “I think it’s a long shot to think that animated movies with music, which have been around for years now, have a material effect in increasing the desire to see   musicals,” he added. If “La La Land” is an exception to the box office rules, it is becoming quite an exception. On social media sites like Instagram and Facebook, young people  —   no prompting from Lionsgate, it promises  —   have been uploading videos of themselves singing “Audition,” one of the film’s showcase numbers. During the past week, the soundtrack has shot up the sales charts. “La La Land,” starring Emma Stone and Ryan Gosling as aspiring performers, won a record seven Golden Globe Awards on Jan. 8, including one for Damien Chazelle’s directing and one for Justin Hurwitz’s score. Powered by that publicity pop, the film took in about $14. 5 million over the weekend (its sixth in release) in North America. The producers of “La La Land” also include Jordan Horowitz and Fred Berger. The weekend’s No. 1 film was the   drama “Hidden Figures,” which collected a strong $20 million. Produced by Chernin Entertainment and Levantine Films and released by Fox, “Hidden Figures” has a domestic total after four weeks of about $54. 8 million.'"}, "time": 1742563840.9423132}