{"duration": 0.10909652709960938, "input_args": {"text": "'Select Page Dakota Excess Pipeline? Standing Rock Protectors Strip-Searched, Jailed for Days on Minor Charges – Video, Links, and Commentary Democracy Now! \\nWe discuss the crackdown on the resistance to the Dakota Access pipeline with Winona LaDuke, a Native American activist and executive director of the group Honor the Earth who lives and works on the White Earth Reservation in northern Minnesota, and Tara Houska, national campaigns director for Honor the Earth. Police have begun deploying military-grade equipment, including armored personnel carriers, surveillance helicopters, planes and drones. North Dakota Governor Jack Dalrymple activated the National Guard in late September. Roughly 140 people have been arrested. Some report being strip-searched in custody at the Morton County jail and being held for days without bond, even when they are facing minor misdemeanor charges. TRANSCRIPT This is a rush transcript. Copy may not be in its final form. \\nAMY GOODMAN : This is Democracy Now! , democracynow.org, The War and Peace Report . We’re broadcasting live from outside the courthouse and jail in Mandan, North Dakota. Water and land protectors, as they call themselves, report facing increasing repression amidst the ongoing resistance to the $3.8 billion Dakota Access pipeline. Police have begun deploying military-grade equipment, including armored personnel carriers, surveillance helicopters, planes and drones. North Dakota Governor Jack Dalrymple activated the National Guard in late September. Roughly 140 people have been arrested. Some report being strip-searched in custody at the Morton County jail, even when they’re facing minor misdemeanor charges. This is Dr. Sara Jumping Eagle, a pediatrician on the Standing Rock Sioux Reservation, a member of the Standing Rock Sioux Tribe. \\nDR. SARA JUMPING EAGLE : When I was taken to the jail, first I was taken by a corrections officer, transported from the protest site to the Morton County jail. And then, when they took me in there, you know, they had to take some basic information. And then, one of the things that they do is have you go into a small room, and there was a female officer there, and we had to—I had to take my clothes off, and then, I don’t know, basically— \\nAMY GOODMAN : Cavity search? \\nDR. SARA JUMPING EAGLE : No, not a cavity search, but I had to squat and cough. That’s what she said. I had to squat and cough and then put the orange suit on. \\nAMY GOODMAN : So you were put in an orange jumpsuit? \\nDR. SARA JUMPING EAGLE : Yeah, I was put in an orange jumpsuit. And then I was held there for several hours. And initially, you know, my family didn’t know where I was or didn’t—you know, they heard about it pretty quickly and were able to come and bond me out or bail me out. I don’t know what you call it. But I was in there for several hours. \\nAMY GOODMAN : How did it make you feel? \\nDR. SARA JUMPING EAGLE : It made me feel—you know, it made me think about my ancestors and what had they gone through. And this was in no way a comparison to what we’ve survived before, so just made me feel more determined about what I’m doing and why I’m here. \\nAMY GOODMAN : That’s Dr. Sara Jumping Eagle, a pediatrician, member of the Standing Rock Sioux Tribe. She was charged with disorderly conduct. LaDonna Brave Bull Allard, who founded the first resistance camp, the Sacred Stone Camp, on her own land April 1st, says her daughter was recently arrested, taken into custody at the Morton County jail, strip-searched in front of multiple male officers, then left for hours in her cell, naked and freezing, before the guards finally gave her clothes to wear. LaDonna Allard says her daughter was repeatedly asked by guards, “Who is your mother?” which Allard sees as an indication that her daughter was targeted because of who she is. Cody Hall from Cheyenne River Reservation in South Dakota says he was also strip-searched after he was arrested Friday, September 9th, held for three days without bail or bond, and then charged with two misdemeanors. \\nCODY HALL : As I exited out of the vehicles and entered Morton County, I came up an elevator, and as the elevator opened up, I was met with state police. And then, you know, of course, Morton County people were there to book people, but—and then, from there, started the process of the booking, and then, again, you know, went into a private room, where they ask you to, you know, get naked. You know, they had my arms. They, you know, kind of like extend your arms out. And you’re fully naked. And they have you, you know, lift up your genitals and bend over, you know, cough. And so, it’s really one of those tactics that they try to break down your mentalness of everyday life, because not every day do you wake up and say, “Hey, I’m going to get, you know, naked and have somebody search me today,” you know? That’s a private—you know, that’s a private feeling for you, when you get naked, so… \\nAMY GOODMAN : And four days later, when you were finally released—they hadn’t allowed you to go out on bail or bond for those four days—you came before a judge in the orange jumpsuit? \\nCODY HALL : Yes, yes, I sat in the court office in my orange jumpsuit, locked, you know, still handcuffed, exited out of the courtroom. And as I left the courtroom, there were 20 or so state police all in their bullet-proof vests, everything just looking, you know, like—you know, like they’re going into action of some sort. And then they literally had a line from the courtroom to the door that connects you to the county jail. And my mother walked out with me. And as we got to the door, they were opening the door up. And as I looked behind me, my mother and I, all of the cops then proceeded to kind of swarm, you know, like make, you know, that big wall as I entered in, which was, again, an overkill, you know, but that, too, though, to show a dominant force. \\nAMY GOODMAN : That was Cody Hall, who was arrested on two misdemeanors, held for four days, strip-searched here at the Morton County jail just behind us. \\nWell, for more on the resistance to the Dakota Access pipeline and the police crackdown, we’re joined by two guests. Winona LaDuke, Native American activist, executive director of the group Honor the Earth, she lives and works on the White Earth Reservation in northern Minnesota. And we’re joined by Tara Houska, national campaigns director for Honor the Earth. She is Ojibwe from the Couchiching First Nation. \\nWe welcome you both to Democracy Now! Winona, let’s start with you. We have spoken to you intermittently through this resistance. Where does it stand now? \\nWINONA LADUKE : Well, as far as we are in—I mean, I’m just looking at the big picture. Right now there is about 900,000 barrels per day of oil coming out of this state, and they project that into 2019. And so, what I’m trying to understand is, is that if that’s all they have and it’s already going out, why do they need another pipeline of 570,000 barrels of oil per day? In other words, they’re already meeting all their demand. For the next two years, that’s all the oil that’s in there. And this is really—what we call this is the Dakota Excess pipeline. \\nAMY GOODMAN : The Dakota Excess. \\nWINONA LADUKE : Dakota Excess pipeline. This is really about spites. It’s really about spite. \\nAMY GOODMAN : What do you mean? \\nWINONA LADUKE : It’s just really about hating. You know, it’s just really about trying to put something in across these tribes. It’s exactly what the chairman and you said before: If they wanted this pipeline so damn bad, they should have put it north of Bismarck, you know, and they should have—they should not have violated the law. The whole pipeline was approved through something called the Nationwide Permit number 12, which means they could it into a lot of little pieces and never do an EIS , and pretend like—you know, that’s intended for like if you have like a pipeline from a school to the water service center or something like that. It’s not intended for a 1,600-mile pipeline. Total misuse of the law, you know, and the president really needs to intervene and uphold the law…Read more and watch video at Democracy Now!'"}, "time": 1742628303.2158892}