{"duration": 0.060042619705200195, "input_args": {"text": "'President Donald Trump on Monday touched down in Israel for a   visit to the Jewish state, the second stop of his first foreign as U. S. president. [Trump was greeted at a red carpet ceremony at Ben Gurion International Airport near Tel Aviv by a large delegation that included Prime Minister Benjamin Netanyahu and his wife Sarah as well as Netanyahu’s cabinet, Israeli President Reuven Rivlin, government ministers and Knesset Members.  Trump’s tour here marks the first time a U. S. president visited Israel during a first presidential trip abroad. “Never before has the first foreign trip of the president of the United States included a visit to Israel,” Netanyahu said in his remarks at the airport ceremony. “Thank you, Mr. President. Thank you for this powerful expression of your friendship to Israel. Upon landing, Trump praised “unbreakable bond” between the U. S. and Israel. “On my first trip overseas as president, I have come to this sacred and ancient land to reaffirm the unbreakable bond between the United States and the State of Israel,” Trump said. “We love Israel, we respect Israel, and I bring the warmest greetings from your friend and ally, all of the people of the United States of America,” Trump stated. He continued: During my travels in recent days, I have found new reasons for hope. I have just concluded a visit to Saudi Arabia, where yesterday I met with King Salman and leaders from across the Muslim and Arab world. In that visit we reached a historic agreement to pursue greater and greater [cooperation] against terrorism. We have before us a rare opportunity to bring security and stability and peace to this region and to its people, defeating terrorism and creating a future of harmony prosperity and peace. But we can only get there working together. There is no other way. Mr. President, Mr. Prime Minister, I look forward to working with both of you during my stay. Natanyahu pointed out that in Saudi Arabia yesterday, Trump “delivered a forceful speech on terrorism and extremism, called on forces of civilization to confront the forces of barbarism. ” “For 69 years, Israel has been doing just that,” Netanyahu said. “We’ve manned the   of civilization. ” “In doing so we’ve protected all faiths, Muslims, Christians, everyone,” Netanyahu said. “Israel’s hand is extended in peace to all our neighbors, including the Palestinians,” Netanyahu continued. “The peace we seek is a genuine one, in which the Jewish state is recognized, security remains in Israel’s hands, and the conflict ends once and for all. ” “Mr. President, you just flew from Riyadh to Tel Aviv,” Netanyahu added. “I hope that one day an Israeli prime minister can fly from Tel Aviv to Riyadh. ” After the arrival ceremony at Ben Gurion Airport, Trump will travel by helicopter to Jerusalem and meet with Rivlin at the Israeli president’s residence.   From there he will continue to the Church of the Holy Sepulchre, one of the holiest sites in Christianity, and stop for a visit to the Western Wall before heading to a private social dinner with Prime Minister Benjamin Netanyahu. On Tuesday, Trump’s schedule includes a meeting with Palestinian Authority President Mahmoud Abbas in Bethlehem and a wreath laying ceremony at Israel’s Yad Vashem Holocaust memorial.  Trump will then give a speech at the Israel Museum in Jerusalem before departing the country. Trump will be in Jerusalem on Jerusalem Day, a national holiday here that marks Israel’s reunification of Jerusalem after the 1967 Six Day War and the establishment of Israeli sovereignty over the eastern sections of the city, which include the Old City, Western Wall and Temple Mount. Many will be watching to see if Trump uses the visit to announce a move of the U. S. embassy from the beach in Tel Aviv to Jerusalem, although reports put that as unlikely. U. S. law requires the relocation of the embassy to Jerusalem. However, President Obama signed successive waivers delaying the move. The current waiver expires on June 1. Numerous reports in recent days cited White House officials saying that Trump is not expected to use the visit to announce an embassy move. Still, that prognosis is subject to change. “The president has not made a decision yet and is still reviewing that,” White House spokeswoman Sarah Huckabee Sanders said last week. Focus will also be on whether Trump uses the trip to announce that the U. S. will broker new   talks aimed at creating a Palestinian state. There have been reports Trump is seeking to   talks for a period of six to twelve months without preconditions. The Palestinian Authority has a history of bolting talks and rejecting each previous Israeli offer of a state. These offers were made at Camp David in 2000, Taba in 2001, the Annapolis Conference in 2007 and again in 2008. The past few years, the PA also failed to respond to Prime Minister Benjamin Netanyahu’s unprecedented attempts to   negotiations aimed at creating a Palestinian state, including freezing Jewish construction in the West Bank and eastern Jerusalem, and releasing Palestinian prisoners. Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio. ” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.'"}, "time": 1742628458.159909}