{"duration": 0.08414959907531738, "input_args": {"text": "'Frank Gaffney, Center for Security Policy president, joined SiriusXM host Alex Marlow on Wednesday’s Breitbart News Daily to discuss Gaffney’s warning that things can get worse in Syria. [“The Syria situation is one that is fraught with peril, as I see it, for the United States at this particular moment in time,” Gaffney explained. “Because President Trump seems sorely tempted  —   and I think that tempting is not simply a function of the usual suspects, people who have been horrified by the humanitarian crisis there, the people there who think that it will be resolved, or at least diminished, by bringing Heaven knows how many refugees from Syria here and the like  —   but now from his own national security team that we must get involved, we must inject ourselves into the crisis in Syria. ”  “I think that’s folly,” he said. “It’s not because I’m indifferent to the suffering of the people there. It’s that I don’t see a good solution for, frankly, either the people of Syria or their neighbors or for us by making America part of this civil war. ” Gaffney said his specific concern is that “the idea that Assad is Hitler or something akin to him and must go, and Russia must help with that, raises, inevitably, the question: so what do we want there next?” “The choices, unfortunately, seem to be more of the same. At best, it’s an   supported by the Russians, supported presumably by the Iranians, supported by Hezbollah. Or, alternatively, it’s sharia supremacists of the Sunni stripe supported by the Saudis, supported by the Turks, supported by perhaps   or the Islamic State, or simply the Muslim Brotherhood. All very bad choices, in my judgment,” he said. Gaffney noted Russia has some concrete interests in Syria, including a   port in the Mediterranean.  “They have had the use of an airfield there as well. It’s been sort of a foothold for most of this period, certainly since ’67,” he said. “That’s been pretty much it for the Russians. They kind of lost their client relationship with the Egyptians. The United States became the dominant power in the Middle East. That base was important, and it remains so today. I think it’s been an incredibly critical vehicle for Putin to   himself, not just into Syria, but into the Middle East more generally during the Obama years. So it’s a big deal, certainly, for the Russians. ”  “It’s been the difference between holding on to power, perhaps even   his claim to much of Syria, and either death at the hands of the mob, as Qaddafi experienced, or exile for Bashar Assad,” he added. Marlow noted the lack of consistency in comments from various Trump administration sources about Syria, making it difficult to judge if removing Assad from power is an active goal of the United States or how much military involvement with Syria might be on the horizon. “Putting the best face on it, Alex, as you know, Donald Trump indicated that he was going to be unpredictable to our allies, and most especially to our enemies overseas,” Gaffney replied. “He thought that that was a virtue. And arguably it is, at least in a tactical sense. ” “But what you’re describing is part of what worries me,” he continued. “I’m afraid that in the absence of clarity about what we’re doing, you may well see the president do what he did last week  —   which is on the basis, it seems as much as anything, of the horrific imagery on television of children being gassed, he decided he was going to depart from what he said repeatedly was going to be his policy and inject himself at least in that very tactical way, in retaliation against the gas attack. ” “Here’s the kicker: the president is perilously close in some of these comments, particularly by some subordinates, to embracing what the Obama administration actually formally embraced, which is the   ‘duty to protect’ that is a formula for having the United States essentially become, if not the policeman of the world, the punisher of bad people around the world, without regard for the vital interests of the United States and the other demands on our resources  —   military and economic and so on,” he said.  “This is a moment for real care to be exercised,” Gaffney advised. “I think, as usual, I find myself much more sympathetic to the views that we’re hearing attributed to Steve Bannon, who seems to be kinda holding back on some of this stuff. But let’s face it, pressure is on from General McMaster, the national security adviser General Mattis, the secretary of defense, and others  —   certainly the whole coterie of Obama holdovers who would love to see this president become embroiled in Syria. I think that would be a very serious mistake. ” Marlow asked about rumors that President Trump’s decision to strike the Syrian airbase was influenced by emotional responses to pictures of suffering Syrian children from members of his family. “It’s not to say that that’s not a perfectly responsible and even humane reaction to the horrors that we’re seeing,” Gaffney said. “It’s just to say, is it consistent with our national interests? I think keeping people from using weapons of mass destruction is consistent with our national interests, and I think that’s sort of the underlying rationale beyond that humanitarian response. But we’ve got to be thinking more strategically. ” “Let me just throw one idea out that I think it’s high time we begin to address,” he offered. “There is in this mix that I mentioned mostly bad actors. There’s a group that has generally been very responsible, very helpful to us and I think a force for good in Syria, Iraq, and elsewhere. And that’s the Kurds. ”  “I think one of the things that, as the administration thinks strategically about what the end state is that they’d like to see, everything ought to be on the table, as they say. One is redrawing the maps to recognize reality. There is no homeland for the ethnic population that is arguably the largest dispossessed people in that part of the world, namely the Kurds,” he elaborated. “I personally think the President of the United States ought to be thinking about a Kurdistan in at least the parts of Syria  —   and maybe even Iraq or Iran for that matter  —   that are Kurdish, that have the opportunity or the basis for being safe havens for minorities that are currently very much at risk and are being helped by the Kurds,” he suggested. “This is a place where some creative thinking is warranted and might actually have a strategic value, whereas just responding   to the humanitarian crisis du jour is a formula for squandering resources and lives, probably American ones. ” “If we wind up embracing the Obama and U. N. idea of a ‘responsibility to protect,’ all bets are off on an America First sort of approach, either to national security or to rebuilding on the home front because there is no end of    people in all kinds of places,” Gaffney warned. “I think the president is now being buffeted by individuals who have come in who apparently do not agree with his priority of defeating radical Islamic terrorism, as he calls it, and who have, instead, have the view that we should align ourselves with people who are the prime movers behind radical Islamic terrorism. That would include, by the way, the Saudis. It would include the Turks. It would include the Qataris and others in the region. I think that’s a grave concern,” he said. “I think the idea that the president is going to transform the Chinese, the Russians, the North Koreans into benign actors through the force of our diplomacy or through our various emissaries going there and telling them what to do, is unlikely as well,” he judged.  “His planned and, I think, necessary focus on rebuilding what he called ‘peace through strength’  —   my old boss Ronald Reagan’s philosophy of how to protect the United States  —   is the way forward. You can begin to perhaps moderate others’ behavior by demonstrating that you have the will, you have the capacity to be a formidable adversary, and not have to use that force or that coercive pressure on the ground,” Gaffney said. He added a prediction that Secretary of State Rex Tillerson’s visit to Moscow would be “an early indicator of: is he going to be approaching that job as he did his last one, which is, essentially, as a guy who’s going to figure out how to do the bidding of the Russians  —   or is he going to be helping the President of the United States really institute this notion that America is a formidable force, and Putin is best advised not to be screwing around with us?” “Again, the philosophy of peace through strength in practice  —   watch for it, hopefully, in Moscow,” Gaffney concluded. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742628376.5388513}