{"duration": 0.11183929443359375, "input_args": {"text": "'Trump victory: A new political awakening 09.11.2016 Donald Trump\\'s historic Challenge victory over Hillary Clinton\\'s Establishment saw another law being written in the modern geopolitical rule book in a world where globalization has marginalized millions, for whom \"change\" can only mean something better. Trump translates as businesslike pragmatism... Donald Trump won a brilliant victory over Hillary Clinton for one clear reason: because he adoped a businesslike and pragmatic approach, directing his message at his target, dealing the cards throughout the game and delivering what people wanted to hear. The target Around a quarter of the electorate in the United States of America live on under one thousand USD per month; a substantial slice of the electorate is one paycheck away from the street. Globalization has meant little for these people, other than fewer jobs, as factories relocate abroad to the Philippines and as Filipinos come home to work for less and to drive down wages. Donald Trump understood the discourse of America\\'s blue-collar workers and on election day, they turned out en masse . The opinion polls Print version Font Size However, the Trump vote was also an anti-establishment one and this was the magical hidden number of voters who eluded the election pundits and opinion poll makers. Those who regard the Establishment as having failed them participate neither in re-electing the Establishment, nor in participating in any of its mechanisms, including opinion polls, so these cannot take into account a growing percentage of the population and this by far exceeds the three per cent margin of error the pundits work with. Today, the opinion polls have become meaningless. Dealing the cards Throughout the campaign, Donald Trump appealed as the dealer even on polemical issues. The Mexican Wall had Hillary supporters crying blue murder and had the Mexican President jumping up and down as the world media buzzed. But Trump dealt the card. Ditto women\\'s rights, immigration, Moslems, terrorists in America\\'s communities and all other sexy soundbites from start to finish. Trump was out there, sometimes visiting five States a day while Hillary Clinton became famous for her prolonged absences. Delivering what people wanted to hear Clinton, as the Establishment candidate, could only offer more of the same (how can you speak about \"change\" when you have been part of the system for three decades and how much change did Obama deliver?) Trump, as the Challenger, played his role to perfection, attacking the system, promising much more in terms of jobs, working conditions and prosperity. Foreign policy Again, Trump has been making the sounds of a businessman and a pragmatist in relation to foreign policy. A businessman likes a level playing field, a businessman likes to set and know and play by the rules, clear rules, a businessman has values, a businessman respects his partners and tries to get along with them. This, if the Trump presidency is not hijacked by a cabal of lobbies, if Trump himself is not neutered, or worse, will dictate a businesslike and fresh start for the international community. Conclusion Hillary Clinton\\'s embodiment of the Establishment, as an insider, saw her regarded as being out of touch in the corridors of power. The allegations surrounding the way the Clinton Foundation was perceived as a mechanism to facilitate favors in return for donations did nothing to further her cause and the arrogance with which she and the Democrats conducted policy, such as the interference in Ukraine, such as her giggling fit when told that terrorists had murdered Gaddafi, such as the continuation of the policy of siding with terrorists in Syria, served her political epitaph in this election and placed a heavy tombstone on her career. In a word, Hillary \"almost\" Clinton. For Trump, with both Houses in his favor, the cards are stacked for him to start dealing. I repeat, if the lobbies do not neuter him, or worse, he may be the best dealer the USA has had for many decades. And time will tell. Donald Trump may be out of the box but he is not out of his mind. Timothy Bancroft-Hinchey'"}, "time": 1742562381.289345}