{"duration": 0.09887981414794922, "input_args": {"text": "'In 2007, Maria Schneider said that she “felt a little raped” during the filming of an infamous rape scene with Marlon Brando in the 1972 film “Last Tango in Paris,” and that the tears she cried on screen were real. In 2013, Bernardo Bertolucci, the director of the film, confirmed that Ms. Schneider wasn’t told ahead of time that Mr. Brando would use butter as a lubricant for the simulated sex because he “wanted Maria to feel, not to act, the rage and the humiliation. ” Mr. Bertolucci’s comments did not receive widespread attention at the time, but rocketed into prominence over the weekend after they resurfaced in media reports about a Spanish nonprofit’s publicity campaign about violence against women. Several prominent figures in Hollywood responded on social media with anger toward Mr. Bertolucci and Mr. Brando, while wondering why Ms. Schneider’s story was not better known. “Inexcusable,’’ Ava DuVernay, a filmmaker, said on Twitter. “As a director, I can barely fathom this. As a woman, I am horrified, disgusted and enraged by it. ” Chris Evans, an actor, said on Twitter: “I will never look at this film, Bertolucci or Brando the same way again. This is beyond disgusting. I feel rage. ” Ms. Schneider was an unknown    French actress paid $4, 000 for her part in “Last Tango,” in which her torrid affair with an American businessman, played by a    Mr. Brando, included explicit sex scenes that shocked audiences. The scene in which Mr. Brando pins her to the floor and appears to force anal intercourse remains one of the enduring images from the film, and was part of the reason The Motion Picture Association of America gave the film an X rating. It was critically acclaimed Mr. Brando, who died at 80 in 2004, received an Academy Award nomination for Best Actor, while Mr. Bertolucci, 76, was nominated for Best Director. Ms. Schneider was not nominated but emerged as a sex symbol she had several leading roles in the 1970s, but her acting career declined later in the decade, while her personal life was marred by drug abuse and at least one suicide attempt. In 2011, she died of cancer at age 58. In an interview with The Daily Mail in 2007, she said the rape scene, which was shot in one take, left her feeling humiliated and attacked by both Mr. Brando and Mr. Bertolucci. “That scene wasn’t in the original script. The truth is, it was Marlon who came up with the idea,” Ms. Schneider said. “I should have called my agent or had my lawyer come to the set because you can’t force someone to do something that isn’t in the script, but at the time, I didn’t know that. ” Mr. Bertolucci said in 2013 that he and Mr. Brando thought of including butter in the scene on the morning it was filmed and purposely kept Ms. Schneider in the dark. “I didn’t tell her what was going on because I wanted her reaction as a girl, not as an actress,” he said. He said that Ms. Schneider hated him until her death, but the tactic was necessary to obtain the effect. “I feel guilty,’’ he said, “but I do not regret. ” While Ms. Schneider’s statements in her 2007 interview did not go unnoticed  —   they figured prominently in her obituary in The New York Times  —   neither it nor Mr. Bertolucci’s 2013 interview instantly received the kind of widespread attention that both gained this weekend. El Mundo de Alycia, a Spanish nonprofit, posted the video of Mr. Bertolucci’s interview to YouTube as part of a protest against violence against women in November. It began appearing in   outlets, including Elle, on Friday, and celebrities soon responded in force. In a statement on Monday, Mr. Bertolucci called the flap “a ridiculous misunderstanding. ” “Somebody thought, and thinks, that Maria had not been informed about the violence on her. That is false!” he said in the statement, according to Variety. “Maria knew everything because she had read the script, where it was all described,” he continued. “The only novelty was the idea of the butter. And that, as I learned many years later, offended Maria. Not the violence that she is subjected to in the scene, which was written in the screenplay. ” Those responding on Twitter included several   actors in Hollywood. Others on Twitter wondered why it took so long for the outrage to form.'"}, "time": 1742563942.148275}