{"duration": 0.23934292793273926, "input_args": {"text": "'Hillary Clinton was campaigning for her husband in January 1992 when she learned of the race’s newest  : Gennifer Flowers had just released tapes of phone calls with Bill Clinton to back up her claim they had had an affair. Other candidates had been driven out of races by accusations of infidelity. But now, at a cold, dark airfield in South Dakota, Mrs. Clinton was questioning campaign aides by phone and vowing to fight back on behalf of her husband. “Who’s tracking down all the research on Gennifer?” she asked, according to a journalist traveling with her at the time. The enduring image of Mrs. Clinton from that campaign was a “60 Minutes” interview in which she told the country she was not blindly supporting her husband out of wifely duty. “I’m not sitting here, some little woman standing by my man like Tammy Wynette,” she said. But stand by she did, holding any pain or doubts in check as the campaign battled to keep the Clintons’ political aspirations alive. Last week, Donald J. Trump, the Republican presidential nominee, criticized Mrs. Clinton over Mr. Clinton’s affairs and her response to them, and said he might talk more about the issue in the final weeks before the election. That could be a treacherous strategy for Mr. Trump, given his own past infidelity and questionable treatment of women. Many voters, particularly women, might see Mrs. Clinton being blamed for her husband’s conduct. It could also remind voters of a searing period in American history, and in Mrs. Clinton’s life. Confronting a spouse’s unfaithfulness is painful under any circumstance. For Mrs. Clinton, it happened repeatedly and in the most public of ways, unfolding at the dawn of the   news cycle, and later in impeachment proceedings that convulsed the nation. Outwardly, she remained stoic and defiant, defending her husband while a progression of women and   conservative operatives accused Mr. Clinton of behavior unbecoming the leader of the free world. But privately, she embraced the Clinton campaign’s aggressive strategy of counterattack: Women who claimed to have had sexual encounters with Mr. Clinton would become targets of digging and discrediting  —   tactics that women’s rights advocates frequently denounce. The campaign hired a private investigator with a   reputation who embarked on a mission, as he put it in a memo, to impugn Ms. Flowers’s “character and veracity until she is destroyed beyond all recognition. ” In a pattern that would later be repeated with other women, the investigator’s staff scoured Arkansas and beyond, collecting disparaging accounts from   employers and others who claimed to know Ms. Flowers, accounts that the campaign then disseminated to the news media. By the time Mr. Clinton finally admitted to “sexual relations” with Ms. Flowers, years later, Clinton aides had used stories collected by the private investigator to brand her as a “bimbo” and a “pathological liar. ” Mrs. Clinton’s level of involvement in that effort, as described in interviews, internal campaign records and archives, is still the subject of debate. By some accounts, she gave the green light and was a motivating force by others, her support was no more than tacit assent. What is clear is that Mrs. Clinton was in a difficult spot. She was aware that her husband had cheated earlier in their marriage, but by her telling, she also believed him when he denied the accusations levied by Ms. Flowers and others. Mickey Kantor, the chairman of Bill Clinton’s 1992 campaign, said that Mrs. Clinton wanted to separate fact from fiction and to size up the women making the claims. “Let’s say the woman has some   things that she has done in the past,” Mr. Kantor said. “Wouldn’t you want to know that, and evaluate it?” At the same time, a growing cadre of conservative groups and media outlets had begun focusing on the issue. Mrs. Clinton, those close to her said, viewed the attacks as a political crusade that demanded a stiff political response. And that determination to fight back inspired others in the campaign to do the same. “She’s the firefighter running to the fire,” Mr. Kantor said, “not away from it. ” Mrs. Clinton and her husband declined to be interviewed, and her campaign did not answer questions about her support of efforts to undermine the women. “The country closed the book on these matters close to 20 years ago, and there is nothing whatsoever new here,” her spokesman, Brian Fallon, said in a statement. Her campaign also released statements from James Carville, Mr. Clinton’s top campaign strategist, and two lawyers who worked for Mr. Clinton, saying that Mrs. Clinton had not overseen the counterattacks. “Those who took the lead in responding to those attacks at the time have plainly stated that Hillary Clinton did not direct their work,” Mr. Fallon said. Four years after Gary Hart fled a presidential race amid speculation about an affair, every accusation of womanizing was viewed as a mortal threat to Mr. Clinton’s campaign. Stanley Greenberg, a pollster for the campaign who had strategized with the Clintons in the fall of 1991 about how to handle the rumors of infidelity, recalled Mrs. Clinton’s acknowledgment that her husband had strayed. “It was an uncomfortable meeting,” Mr. Greenberg said in an interview for an oral history of Mr. Clinton’s presidency conducted by the Miller Center at the University of Virginia. “I remember Hillary saying that, ‘obviously, if I could say no to this question, we would say no, and therefore, there is an issue. ’” Weeks later, their first taste of trouble came in a Penthouse magazine story by a rock groupie named Connie Hamzy, who claimed Mr. Clinton had once propositioned her at a hotel in Little Rock, Ark. Mr. Clinton brushed off the story, saying that Ms. Hamzy had made a sexual advance toward him, George Stephanopoulos, the communications director of the 1992 campaign, recalled in his book, “All Too Human. ” But Mrs. Clinton demanded action. “We have to destroy her story,” she said, according to Mr. Stephanopoulos. In what became a common tactic, affidavits were collected, from an aide and two others who stated that they were with Mr. Clinton at the hotel and that Ms. Hamzy’s story was false. (Contacted recently, Ms. Hamzy said she stood by her account.) When the work was done, both Clintons called Mr. Stephanopoulos, together, to offer their thanks. The Gennifer Flowers story landed like a bomb weeks before the New Hampshire primary. Ms. Flowers, a lounge singer and Arkansas state employee at the time, sold Star magazine her story claiming an affair with Mr. Clinton that had lasted more than 10 years. In a meeting with aides, the Clintons scripted a unified defense that they delivered in the interview on “60 Minutes. ” With Mrs. Clinton nodding agreement, Mr. Clinton admitted to the TV audience to “causing pain in my marriage,” but denied an affair with Ms. Flowers. Mrs. Clinton professed sympathy for Ms. Flowers, saying she had been caught up in rumors through no fault of her own. But at a news conference the next day, Ms. Flowers reasserted her claims, playing excerpts from her calls with Mr. Clinton. The two could be heard discussing the attention the rumors were getting, and she joked about his sexual talents. Glimpsing the news conference in South Dakota, Mrs. Clinton directed an aide to get Mr. Clinton on the phone, Gail Sheehy, a journalist traveling with her, recalled in a recent interview. “It was a reaction of no surprise, but immediate anger and action,” said Ms. Sheehy, who also described her observations in a Vanity Fair article that year. “Not anger at Bill, but at Flowers, the press and Republicans. ” Back on a plane that night, Mrs. Clinton told Ms. Sheehy that if she were to question Ms. Flowers in front of a jury, “I would crucify her. ” Years later, Mrs. Clinton would say she had thought her husband had conquered his weakness in the late 1980s. The comment came in an interview with Talk magazine in 1999, after the Monica Lewinsky scandal nearly brought down his presidency. In that interview, as well as in conversations around that time with a friend, Diane Blair, she explained her husband’s straying: It was rooted in his childhood, when he felt pressure to please two women  —   a mother and a grandmother  —   who battled over him he was under great stress she herself had not attended to his emotional needs. “She thinks she was not smart enough, not sensitive enough, not free enough of her own concerns and struggles to realize the price he was paying,” Ms. Blair wrote in her notes of their talks. And, in Mrs. Clinton’s eyes, her husband’s encounters with Ms. Lewinsky were “not sex within any real meaning,” she told Ms. Blair. But in 1992, that unbending devotion to Mr. Clinton had an important effect. It had made a lasting impression on everyone around the couple, and helped keep the campaign from listing. She did not falter, even when her aide, Richard Mintz, told her she would have to call Ms. Wynette, who had taken offense to the “60 Minutes” reference. “Was this what she wanted to do? No,” Mr. Mintz said in an interview. “But she gathered herself together. She was composed and resilient. ” “It was the toughest week you could ever imagine. ” Weeks later, a small group of campaign aides, along with Mrs. Clinton, met at the governor’s mansion in Little Rock, and they made a pivotal decision: They would hire Jack Palladino, a private investigator known for tactics such as making surreptitious recordings and deploying attractive women to extract information. An aide to the campaign, who declined to be publicly identified because the aide had not been authorized to speak for the Clintons, said Mrs. Clinton was among those who had discussed and approved the hiring, which shifted the campaign to a more aggressive posture. Mr. Kantor, the campaign chairman, said he did not know whether Mrs. Clinton had specifically approved Mr. Palladino’s employment as the other aide recalled. But he said that she had seen a need for outside help. “She believed we had to deal with the issue directly,” Mr. Kantor said. Mr. Palladino, who did not respond to requests for an interview, reported to James Lyons, a lawyer working for the campaign. In a memo that he addressed to Mr. Lyons on March 30, Mr. Palladino proposed a   press on Ms. Flowers. “Every acquaintance, employer, and past lover should be located and interviewed,” Mr. Palladino wrote. “She is now a shining icon  —   telling lies that so far have proved all benefit and no cost  —   for any other opportunist who may be considering making Clinton a target. ” Soon, Ms. Flowers heard from   and others who said they had been contacted by a private investigator. “They would say that he would try to manipulate them,” Ms. Flowers recalled, “or get them to say things like I was sexually active. ” Karen Steele, who had worked with Ms. Flowers at the Roy Clark Celebrity Theater in Branson, Mo. was among those who received a visit. “I remember I got questioned about brothers Gennifer and I once dated,” she said. “It wasn’t warm and fuzzy. ” The information gathered by Mr. Palladino was given to Betsey Wright, a former chief of staff to Mr. Clinton in Arkansas who, with Mrs. Clinton’s support, was put in charge of dealing with accusations of infidelity. “Betsey Wright was handling whatever those issues were,” Susan Thomases, a friend of the Clintons who had served in the campaign, told the oral history project. “And it had been very comfortable because Hillary had let her do it. ” Through Ms. Wright, the digging into Ms. Flowers and other women would be passed on to reporters. Ms. Wright declined to be interviewed, saying in an email, “It is reprehensible that The New York Times is joining The National Enquirer and Donald Trump by dredging up irrelevant slime from the past. ” At the time, Ms. Wright boasted to The Washington Post of Mr. Palladino’s success in countering what she memorably called “bimbo eruptions,” and in defusing two dozen accusations of affairs, which she contended were false. In the cover story of an issue of Penthouse in which Ms. Flowers posed nude  —   she would earn at least $500, 000 selling her story to media outlets  —   Ms. Wright pushed allegations about her gathered by Mr. Palladino, including “résumé hype, attempted blackmail, manufacturing a     affair with Clinton to salvage a flopola singing career. ” Ms. Wright read to the Penthouse reporter a statement, taken by Mr. Palladino, that “when the richest of her many lovers would not leave his wife, or come across with more money, she staged a suicide attempt with wine and Valium. ” Mrs. Clinton herself took aim at Ms. Flowers in a June 1992 appearance on “The Arsenio Hall Show” better remembered for Mr. Clinton’s saxophone playing. Mr. Hall asked Mrs. Clinton about Ms. Flowers: “You know what her problem is?” “She’s got lots of problems,” Mrs. Clinton said. Ms. Flowers denied the accusations about her, calling the suicide story, in particular, “false and cruel. ” Mr. Clinton later admitted, during a deposition in the Paula Jones sexual harassment case, that he had sex with Ms. Flowers once. “You’ve got to believe that Hillary Clinton wanted to protect her husband and thought he was being unfairly charged,” Mr. Kantor said. “Does she know more today than she did then? Of course. ” Gloria Allred, a   women’s rights lawyer who was a convention delegate for Mrs. Clinton, said that digging up a woman’s sexual past was a classic shaming strategy. “Most people are not nuns, and most people aren’t Girl Scouts,” Ms. Allred said. “That doesn’t mean they’re not telling the truth. ” Told of Mrs. Clinton’s support for hiring Mr. Palladino, she said, “If Hillary signed off on a private investigator, let’s call it a minus. ” But she added, “It wouldn’t change my support for her because there are so many pluses for her, like her stance on abortion. ” “I’d like to hear from Hillary Clinton on the role she played. ” Mrs. Clinton’s campaign, asked about her role, released a statement from Mr. Lyons saying that Mrs. Clinton “was not involved in hiring” the private investigator. It also released a statement from Mr. Carville. “Hillary wanted us to defend the governor against attacks,” Mr. Carville’s statement said, adding: “It’s just ridiculous to imagine that she was somehow directing our response operation. That was my job, not hers. ” After Ms. Jones, an Arkansas state employee, accused Mr. Clinton in 1994 of having made an unwanted sexual advance, Mrs. Clinton begged Ms. Wright to “put a stop to it,” Ms. Wright recalled in Carl Bernstein’s book “A Woman in Charge. ” In a recent interview, Ms. Jones put it this way: “They sent out people to dig up trash on me. ” The Clintons saw Ms. Jones’s lawsuit in political terms it was eventually bankrolled by the conservative Rutherford Institute, part of what Mrs. Clinton would call a “vast   conspiracy” out to get the couple. But it would take a great toll. Before Mr. Clinton settled for $850, 000, without making any admissions, Ms. Jones’s lawyers were able to ask him in a deposition about Ms. Lewinsky. His lying about their affair ultimately led to his impeachment on charges of perjury and obstruction of justice. In her book “Living History,” Mrs. Clinton wrote that after Mr. Clinton admitted what had happened, she was left “feeling dumbfounded, heartbroken and outraged that I’d believed him. ” Friends wondered whether the marriage had reached its breaking point. But weeks later, Mrs. Clinton told her friend Ms. Blair that “they’re connected in every way imaginable, she feels strongly about him and family and Chelsea and marriage, and she’s just got to try to work it through,” according to Ms. Blair’s personal writings, which her family gave to the University of Arkansas after her death in 2000. While Mrs. Clinton considered the Lewinsky affair a “personal lapse” by her husband, she gave him credit for trying to break it off and manage someone who was a “narcissistic loony toon,” according to Ms. Blair’s papers. Soon after, Mrs. Clinton expressed pleasure to her friend that she and her husband were able to drive “their adversaries totally nuts” because they did not appear to be suffering. Ms. Blair wrote in that entry a direct quotation from Mrs. Clinton: “Most people in this town have no pain threshold. ”'"}, "time": 1742563294.497797}