{"duration": 0.33458924293518066, "input_args": {"text": "'The magician Derek DelGaudio sat in a Hollywood art gallery with several decks of cards before him. It was a February evening in 2011, and he faced a   audience of   people, whom he was keen to impress. Dressed in a black suit and matching Converse   he instructed an attendee to “time me for a minute. ” As the countdown commenced, he began dealing the cards wordlessly, with such force and rapidity that they soon overspilled the table. He finished off one deck and started on another, then another. When time was up, DelGaudio announced, “184 seconds in one minute  —   thank you very much,” then stood and walked away. Trick, as it were, over. The performance was titled “184 Seconds,” and with it, DelGaudio obscured a virtuosic feat within a pantomime of banality. A “second deal”  —   a    maneuver, often referred to simply as a “second” in the world of card magic  —   is when the magician appears to deal from the top of a deck but is in fact dealing the    card. Seconds usually aren’t tricks in themselves but rather are building blocks for more elaborate deceptions. In “184 Seconds,” DelGaudio set himself a daunting challenge: How many seconds could he execute in a minute? The answer to this question became the performance’s punning title. “184 Seconds” was anticlimactic by design, privileging invisible technique while eliminating any perceptible effect  —   all hat, in other words, and no rabbit. In envisioning his work, DelGaudio, who has a fervent fan base among magic aficionados, likes to nod to   conventions (pick a card, any card) only to slyly deconstruct them, in a manner that either heightens or thwarts their payoffs. His animating goal is not for observers to ask, “How did he do that?” but, “Why?” For DelGaudio, “184 Seconds” enacted what he calls “one of magic’s defining paradoxes”: that a magician’s slavishly honed talents of subterfuge must by definition remain invisible to others and thus easy for the uninitiated to dismiss as trivial. “There’s something beautiful about that,” DelGaudio told me, “and there’s something heartbreaking. ” DelGaudio, who is 32, has lived in Los Angeles since his 20s. A few years ago, Disney charged him with brainstorming   attractions for its theme parks. He also worked as a consultant on Christopher Nolan’s   film, “The Prestige,” and, for one stage show, as an assistant to the masterful Ricky Jay, who turned his own prodigious gifts for banter and prestidigitation  —   not to mention an encyclopedic knowledge of magic history  —   into a run of hit shows and beloved books. Jay gave magic a newfound degree of artistic respectability, a feat that DelGaudio wants to achieve, too, in his own way. His admirers have come to include magicians’ magicians, like Eric Mead and Michael Weber, a mentor and business partner of Jay’s who told me, “When it comes to a deck of playing cards, I’d put Derek up against almost anyone. ” They also include   illusionists like Penn  Teller and David Blaine, who met DelGaudio a decade ago. “I’d heard about this young genius everyone was buzzing about, and we finally met, in a diner, I think,” Blaine recalled. “A lot of magicians show me things, but Derek has move after move that’s just  . There are things he’s shown me, things I can’t tip to the public, that I use everyday. ” DelGaudio knows that when many of us think of magic, we summon cartoonish stereotypes: top hats and wands at children’s birthday parties   at   casinos G. O. B. on “Arrested Development. ” DelGaudio told me, “I daily suffer from the slings and arrows of being ‘a magician. ’’u2009” His conviction  —   one he articulates with winning passion and occasional   grandiosity  —   is that magic offers a means of exploring ideas just as complex, and of provoking emotions just as powerful, as those encountered in any other art form. To this end, DelGaudio devises performances that combine    with more theoretical preoccupations drawn from performance art, conceptual art and what’s known as relational aesthetics: a tributary of the first two in which spectators become indispensable, unpredictable participants in creating an artwork’s meaning. “The reason Derek’s so incredible is that he’s not trying to fool an audience,” Blaine says. “He’s trying to capture an emotion that lies deep within them. ” In seeking to bridge the disciplines of magic and fine art, DelGaudio has performed at both the Magic Castle (the exclusive conjurers’ club in Los Angeles) and the Kitchen (the   venue in Manhattan). He is as likely to refer in conversation to the legendary magician Dai Vernon as he is to cite Pierre Huyghe, explaining how that artist’s   motivated him to devise a routine illustrating the distorting power of memory. “I want to do for magic what Duchamp did for art  —   break it,” DelGaudio says. I met DelGaudio last spring at the Geffen Playhouse, on the west side of Los Angeles, where he was preparing to unveil “In  of Itself,” his newest solo performance. It would be his most elaborate attempt yet to realize his vision of magic as art. (The show opens early next month in New York, at the Daryl Roth Theater.) In an alley, members of his crew were cutting blocks of wood for some opaque purpose others   bricks gold. All were politely cagey: Staff members were asked to sign nondisclosure agreements before joining the production. A final dress rehearsal was to start shortly. DelGaudio had put in long days at the theater for weeks, but uncertainties lingered. “There are effects that we weren’t sure would work until just now,” he said. “And there are effects that we won’t know whether they work or not until they’re in front of an audience. We’re putting this into the world partially formed, discovering what it is by doing it, which is terrifying. ” (I will describe “In  of Itself” in detail. DelGaudio, who believes that foreknowledge of an effect won’t ruin seeing it live, is O. K. with me doing so. All the same, I include this parenthetical in case readers prefer to go in clean.) Standing nearby were DelGaudio’s wife, Vanessa Lauren, who was one of the show’s producers, and the director and veteran puppeteer Frank Oz, who has advised DelGaudio since he saw him perform in 2013 and who agreed to direct “In  of Itself. ” Oz’s involvement necessitated special security arrangements, including nightly escape plans, thanks to a horde of autograph seekers who, I learned, follow Oz everywhere, carrying Sharpies and “Star Wars” posters. (In addition to his work with the Muppets and on “Sesame Street,” Oz is the voice of Yoda.) Oz apologized to DelGaudio for the distraction. “So this is what it’s like to be a big celebrity,” DelGaudio replied, grinning. Also close at hand was Gil Cates Jr. the Geffen’s executive director, who told me that the playhouse slotted “In  of Itself” into its 2016 season before DelGaudio could really even describe it. Cates’s faith rested largely on the runaway success of DelGaudio’s last show, “Nothing to Hide. ” DelGaudio wrote it for two performers, enlisting Helder Guimarães, a gifted Portuguese magician, to join him onstage and refine effects behind the scenes. That show generated   lines in an initial run at the Magic Castle and drew notable attendees: Ricky Jay and Penn  Teller, Rick Rubin, Ryan Gosling and Eva Mendes. It moved to the Geffen in an expanded version in 2012 directed by Neil Patrick Harris, a lifelong magic enthusiast, and from there to the Pershing Square Signature Center, in Manhattan. In that show, DelGaudio’s conceptualist leanings were on playful display. In one of the moments DelGaudio is happiest with, Guimarães performed a trick focused on a folded card secured beneath an   glass. “This card has the potential to be a moment of astonishment, but if you saw it before I began, it would destroy that moment. . .. ” Guimarães began, narrating  . A volunteer was chosen to shuffle a deck and pick a card, which was presently revealed, somehow, as the one under the glass. “It was a fine trick,” DelGaudio told me, but it wasn’t done. Next, DelGaudio stood and performed it a second time. “This card has the potential. . .. ” he intoned, repeating the same spiel verbatim, asking the same volunteer to shuffle and choose again. A different card was picked  —   and discovered beneath the same glass. The trick mutated, through its repetition, into a meditation on the mechanics of surprise. “Every beat was exactly the same,” DelGaudio recalled. “All the dialogue was the same. But the ultimate effect wasn’t, because they’d just heard it and seen it. ” After one performance, Teller, who came several times, told him, “We’ve always wondered how to do a    effect, and you did it. ” (Penn  Teller have chased goals similar to those of DelGaudio, who saw them perform when he was young: They suffuse performances with metalevel prankishness and unexpected poetry, like Teller’s breathtaking “Shadows” effect, in which he cuts the petals from a spotlit rose by taking a knife to its projected silhouette.) Today DelGaudio looks back on “Nothing to Hide” with qualified enthusiasm. “It was a   magic show for people who didn’t know they could like magic,” he told me, “but the next step, with ‘In  of Itself,’ is using magic to express real ideas. ” When a magician intends not simply to fool his audience but also to engage it intellectually and emotionally, he faces a steep challenge: How do you make a series of thought experiments and cliffhangers add up to a satisfying dramatic whole, much less a powerful work of art? This question hung in my mind as the dress rehearsal began. Before entering, those of us in the audience chose small white cards from a display of 690, each one printed with a unique descriptor: I AM AN ACTIVIST, I AM AN AFICIONADO, down the alphabet past PARALEGAL to ZOOKEEPER. Wall text instructed us to “Choose how you would like to be seen,” and it was up to us to do so  —   cheekily or sincerely. “The show exists in the gap between you and your image of yourself,” DelGaudio told me, and these cards were among the more baldly theatrical means by which that gap would be explored. We filed into the darkened theater, where   seats were arranged on risers. It was as large a room as DelGaudio is comfortable performing in, because otherwise it’s difficult for everyone to enjoy clear views. On the stage there was a card table behind it were six large dioramas. One featured mail cubbies stuffed with envelopes. Another held a cracked pane of glass with one of the gold bricks lodged in its center: a window midshatter. The significance of these dioramas emerged and shifted during the show, sometimes through magical effects and sometimes simply though stories DelGaudio told, to the accompaniment of an original score by Mark Mothersbaugh. A recurring motif was the way we perceive and identify ourselves and how this does and doesn’t line up with the way that others perceive and identify us. In the penultimate effect, DelGaudio asked those of us who picked I AM cards that we felt accurately described us to stand up. Then, with unwavering eye contact, he addressed us individually by our chosen descriptors, even though he had not once seen our cards. This moment tottered right on the edge of hokey, calling to mind hucksterish traditions of   mentalism. (Was there a hidden earpiece at play, through which an assistant who had somehow kept precise track of our card choices and seat numbers was stealthily tipping off DelGaudio?) And yet, there was also something genuinely unnerving about being identified in this way. A magic trick has much in common with a thriller. The chief ingredients are suspense and resolution, and we tend to regard both forms, exceptions notwithstanding, as unserious entertainments, no matter how well engineered they are. But whereas in the archetypal thriller, our world is upended at the outset and the laws of reality reassert themselves by the end, the archetypal magic trick inverts this structure: Everything appears to be normal until the decisive moment when, inexplicably, it isn’t. Watching a trick to completion, we are not rescued from unreality but rather are marooned in it. DelGaudio takes this unsettled state as his opportunity to rattle people in profound, rather than merely fleeting, ways. DelGaudio also aimed, in the show, to bare himself to us. During an autobiographical passage, he recounted the night he discovered, at the age of 6, that his mother, who had been raising him on her own, was gay. DelGaudio came across her kissing a woman “I cried myself to sleep that night,” he says in the show, “not because she told me she was gay, but because that was the night I knew I’d never have a father. ” The Colorado town they called home was conservative, and tensions grew around his mother’s sexuality until someone hurled a brick into her parked car  —   DelGaudio gestured, at this point in the dress rehearsal, to the   diorama. “I learned the value of a secret,” he said. “How to keep one, how to protect one, how to create one. I learned to craft language I could hide in. ” When the story was over, DelGaudio dislodged the brick from the window and dropped it with a thud. Shortly afterward, he obscured the brick within a painstakingly assembled house of cards, then made it disappear. The cards tumbled gorgeously into the void left behind. Weaving a classic vanishing act into this confessional vignette, DelGaudio scrambled magic and memoir and revealed something of the psychological forces that might drive a boy into a corner of show business defined by obfuscation and control. The monologue, he assured me later, was “for the first time in a magic show an honest origin story. ” He went on: “You don’t become a magician because ‘my grandfather bought me a magic kit.’ It’s because your parents fought and told you you were worthless. It’s because you were in circumstances so bad you needed to escape. ” DelGaudio says that “In  of Itself” sprang from an interest in symbolic, rather than illusionistic, transformations. “I was thinking about how you can hold a pen and it means nothing to you,” he told me, “but if someone tells you the pen once belonged to Hemingway, suddenly this mundane object has a deep meaning and emotional power that you can’t really explain. The question was, How could I achieve that kind of transformation in a magic show?” After the first preview, I followed DelGaudio to his dressing room. The floor was covered with   pads he was housebreaking his new puppy, Chaplin. Our conversation returned to the brick. After making it vanish, DelGaudio asked two audience members to choose the coordinates of a Los Angeles intersection, naming cross streets on the fly. He then declared that the brick was, at that very moment, sitting on that corner  —   unremarkable to   if they even noticed it, and in this way transfigured back to a state of mute mundanity, like a Duchamp   in reverse. “If you go to that corner, right now, it’s there,” DelGaudio promised me. Pictures of gold bricks since posted to Twitter corroborate this. “I don’t know how they’ll react when they see it. But I like the idea that the show doesn’t stop when the lights go up. ” He plopped down on a cot, yanking off his shoes. “That might not be magic,” he continued, “but it’s something. ” DelGaudio owes his career to a tiny shop called Zeezo’s, in Colorado Springs. When he was 12, he went in, intending to buy a practical joke. The clerks steered him instead toward “The Expert at the Card Table,” a slender book from 1902 that cataloged techniques for the stealthy manipulation of playing cards. “Expert” was written by an enigmatic cardsharp named S. W. Erdnase. Even the basic facts of Erdnase’s life are unknown, down to his real name: S. W. Erdnase was a pseudonym adopted, maybe, by an E. S. Andrews (read it backward) an E. W. Sanders (shuffle the letters) or someone else entirely. Whoever he was, Erdnase achieved lasting fame: More than 100 years later, no practitioner of    worth his aces is without a copy, and his identity is one of modern magic’s foundational riddles. “He wrote the bible,” DelGaudio said, “and then he vanished. ” At first, DelGaudio didn’t much care about magic. His favorite entertainers were physical dynamos of classic Hollywood, like Chaplin, Keaton and Gene Kelly. But “Expert at the Card Table” pulled back the curtain on a discipline defined by virtuoso physicality of a sneakier sort. DelGaudio suspects that the clerks sold him the Erdnase with low expectations: It’s advanced reading for a kid. If so, “the joke was on them,” he said, because “three or four months later, I could do everything in the book. ” By ninth grade, DelGaudio was capable not only of exquisite second deals but also of significantly more difficult “center deals,” in which the dealt card comes from the middle of a deck. (DelGaudio says the move was once seen as a “unicorn. ”) He spent hours refining minuscule gestures: riffling a thumb up a deck until it caught the topmost card riffling again and catching two cards then three and so on. His fixation alienated him from his peers. Bullies took to “throwing pencils at me,” he recalled, adding: “It was rare to find someone at school I connected with. I wanted to go hang out at a bar and see a guy deal off the bottom of the deck. I wanted to go to pool halls and watch people shuffle cards or hustle. ” Magicians periodically came to Colorado Springs, working a circuit of corporate gigs and club dates. As a teenager, DelGaudio sought out these men (they were invariably men, magic being as enduring a boys’ club as they come) and took pilgrimages by Greyhound to meet others, in Aspen and Las Vegas. Several became his mentors and, as DelGaudio says, surrogates for his absent dad. One was David Williamson, a performer based in Ohio, who appeared yearly in Colorado Springs at the Broadmoor resort and whom DelGaudio met one afternoon at Zeezo’s. “I knew immediately that he was working on a high level,” Williamson told me. “You can tell if a magician’s any good in 15 seconds. ” His social circle came to consist of older magicians and, with them, card cheats, whose talents he was equally interested in absorbing and who “saw me as a novelty,” DelGaudio recalled. He came under the informal tutelage of crooked gamblers with sobriquets like Wolf and Rod the Hop. “I had a guy show me his 17 stab wounds from games he’d cheated in, to deter me,” DelGaudio said. “Like, ‘This is the life you want? ’’u2009” At points, DelGaudio told me, he contemplated abandoning magic altogether and exploiting his facility with cards in other ways. “I seriously considered becoming a gaming consultant for the casino industry, where they would basically hire me to prevent cheating,” he said. “I have friends who do that. ” He added that he occasionally put Erdnase’s lessons to more ethically dubious use: Around 2010, before the success of “Nothing to Hide,” he worked as a   “  dealer” at   private card games conducted in Beverly Hills residences. “You’re hired to deal cards and make sure nobody wins but the house,” DelGaudio explained, telling me that he was paid “a percentage of the winnings” for his services. (This milieu provided the backdrop for a pitch for a show that DelGaudio sold a few years ago to HBO.) DelGaudio found his cardsharp mentors inspiring, he told me, for the surprisingly high premium they put on craft. “In their world, money was the currency, but they still went above and beyond in developing their techniques. ” DelGaudio nodded respectfully. “At that point, it’s pure artistry. ” After the first L. A. preview of “In  of Itself,” DelGaudio, Frank Oz and Amy Levinson  —   the Geffen’s resident dramaturge, whose job is something like a sympathetic   critic  —   gathered for a meeting. The big note for DelGaudio was that the show did not yet feel fully coherent. “A bit more connection throughout feels necessary to me,” Oz said. Levinson agreed: “I think all the materials are in there, but you need to point more forcefully to them. ” DelGaudio frowned thoughtfully, sitting   on the floor. “We’ll want to emphasize it where it’s ambiguous,” he said, “but I tend to err on the side of not being explicit. ” Levinson said, “As corny as it sounds, I think you might want a sort of catchphrase that recurs throughout the entire show. ” “I need help with that, because my background is in ” DelGaudio told them. “I work in moments. ” I later recounted this exchange to the artist Glenn Kaino, a producer on “In  of Itself” and DelGaudio’s frequent collaborator. They met nine years ago, when Kaino, whose solo work has been in Whitney and Performa biennials, grew interested in incorporating magic into his practice “to interrogate systems of belief. ” The two men formed a   duo, naming it A. Bandit, and Kaino tutored DelGaudio in the history of conceptual art. Of “In  of Itself,” Kaino told me that “left to his own devices, part of Derek would be perfectly happy to do a show that is an experimental performance, to not have it be legible. If we were making an art show, we wouldn’t be worried about crafting some   thematic that takes people through the exhibition. But we feel, especially in a theater, that it’s incumbent on us to make our work more accessible, and that’s why Derek brought Frank on. ” DelGaudio’s aversion to accessibility can be extreme. He told me that he sometimes bristles at the sound of applause. “I kind of hate it, because it’s like it settles the account,” he said. “’u2009‘You did a thing, we clap, now let’s move on to the next thing.’ I’d sort of rather people sat there in confused silence. But Frank will remind me, ‘You’ve got to entertain people! ’’u2009” “In  of Itself” would go on to prove its appeal. Originally slated to close after six weeks, it ran for more than three months. But DelGaudio’s insistence that his work unfold on his own exacting terms has, in other ways, restricted his career’s growth. He has almost never performed on television, believing that magic is best experienced live. (The only exception to this, on a Spanish variety show, can be found on YouTube.) Similarly, he said, while his performances might travel, they are inherently “not scalable,” because he believes their power is compromised in bigger venues. Instead, he has augmented his living over the years by consulting on movies and other magicians’ acts and by performing at private functions. (One such gig was for the “Lost”   Damon Lindelof, who hired DelGaudio to perform at the 40th birthday party of his wife, Heidi.) “During ‘Nothing to Hide,’ we had offers to go perform on ‘The Daily Show,’ Fallon, Letterman,” he told me. “But my interest is in protecting the work, and we’re not famous enough to make demands. Like, we asked Letterman, ‘Can we have a rehearsal with the cameras and get final cut?’ They said no. In that case, we can’t do it, because cameras flatten the work, and God forbid they see something you don’t want them to see and then the piece is destroyed. So I decided I’d just rather not be famous. ” One morning, DelGaudio invited me to join him at the studios he shares with Kaino on the main tourist drag of Hollywood Boulevard, where “In  of Itself” was devised. A wheeled   board stood   to an aquarium full of coral. “We have three spaces in this building,” DelGaudio said. “This one, for prep one for storage one for secret stuff. ” He and his collaborators on “In  of Itself”  —   among them Oz, Kaino and Michael Weber  —   had used the board to diagram successive versions of the show. There were also sketches and printouts that served more abstract functions, like a drawing from 1822 that depicted a striking feature of the Royal Coburg Theater in London: a curtain covered top to bottom in mirrors, reflecting the audience back at itself. “I’d basically just sit here and stare at this board and think,” DelGaudio said. Among the   images was a rendition of the   diorama. Within its shelves, envelopes were arranged to create, in aggregate, the silhouette of an elephant. During the show, as DelGaudio climbs a ladder to retrieve envelopes from the cubby, he recounts the fable of six blind men who encounter an elephant and, each bumping into a different part, mistake the animal for different things: The man at the tail is sure he has found a snake the man at the tusks believes he’s holding spears. Through teamwork, they eventually discover the truth. “But what if they were wrong?” DelGaudio asks onstage. “What if that thing was some sort of magical creature that had a snake for a nose and   legs, and they convinced it it was an elephant? Maybe that’s why you don’t see those things anymore. ” When we make pronouncements about others and about ourselves, the subtext went, what do we get right and where do we err? This unlikely take on the elephant story segued into the show’s most astounding moment: an emotionally blindsiding trick that, in its ideal form, will leave a single audience member shocked and quite possibly crying at every performance. DelGaudio was so proud of it that, two weeks before I saw it at the first preview (moving a woman to tear up, as he’d intended) he described it to me: “There will be hundreds of letters in a mail cubby,” he said. “A person chosen at random will come up and randomly select a letter. I’ll have them imagine a person they know. Now imagine that person wrote you a letter. Now imagine it’s this letter you’re holding right now. Imagine it’s true. Now I have them open the letter, and they’ll begin to weep, because it’s a handwritten letter from that loved one to them. This will happen every night, and it’s impossible. ” Most crowd participation at a magic show is fake, a pantomime of audience agency that leaves the magician in full control. The letter trick brought to bear genuine emotions. Sometimes this meant tears (“It’s from my mother! ”) and sometimes it meant more inscrutable reactions: At one performance I witnessed, a woman responded to a letter from her husband with such a bizarrely blank affect that it undid the dramatic wallop. This was the price, DelGaudio told me, of creating an authentic moment onstage. After attending several shows, and after discussing the letter effect with DelGaudio and one of the letter getters, I tried to puzzle it out. My brain quickly overheated imagining the dizzying chain of obstacles and contingencies that DelGaudio and his collaborators must surmount for each performance: identifying attendees with sufficient time to obtain letters from families and friends procuring enough letters to guarantee that, when the attendee picks a letter, it will be addressed to them swearing the letter writers to secrecy making sure, at every show, that an attendee for whom enough such letters arrived would be picked, seemingly “at random,” by another member of the crowd and on and on. As DelGaudio put it, “My goal is to get you to the point where it’s easier to believe that a miracle happened than the truth of what we actually did. ” But the painstaking labor and nested logistical nightmares were not where his interest lay, of course. The point of pride for DelGaudio was that the letter, and the feeling of uncanny   that it ideally inspired in its recipient, were entirely real. “I wanted to make a magic effect that doesn’t end on a falsity,” he told me. “I don’t want to show people something amazing that doesn’t exist. I want to show people something amazing that’s true. ”'"}, "time": 1742628479.2602375}