{"duration": 0.07355475425720215, "input_args": {"text": "'We Are Change \\nAs disturbing revelations about Hillary Clinton’s inner circle come to light thanks to the Wikileaks revelations, it seems like an appropriate time to remind everyone that the former First Lady speaks to the dead for “therapeutic release.”\\n\\nClinton’s bizarre pastime was detailed in the 1996 book “The Choice” by Bob Woodward.\\nSome of the candidate’s favorite dead friends include Eleanor Roosevelt and Mahatma Gandhi. When it was suggested by one of her advisers, Jean Houston, the co-director of the Foundation for Mind Research, that she try speaking to Jesus Christ instead. Clinton refused and stated that speaking to Jesus would be “too personal.”\\n“Most people in the White House did not know about Hillary’s sessions with Houston. … To some of the few who did, the meetings could trigger politically damaging comparisons to Nancy Reagan’s use of astrology,” Woodward wrote.\\nClinton has not been very secretive about her penchant for speaking to the dead, either.\\nIn the 90s, she wrote about a discussion she had with Eleanor Roosevelt, and what she claims the spirit told her.\\n“She usually responds by telling me to buck up, or at least to grow skin as thick as a rhinoceros,” Mrs. Clinton wrote in a column about her seeking advice from the dead former First Lady.\\nBill Clinton even spoke about his wife’s conversations with the dead during a speech in 2012.\\nOn Friday, it was revealed that her campaign chairman John Podesta was invited by his brother to attend a “ Spirit Cooking ” dinner.\\nThe Podestas\\' \"Spirit Cooking\" dinner?\\nIt\\'s not what you think.\\nIt\\'s blood, sperm and breastmilk.\\nBut mostly blood. https://t.co/gGPWFS3B2H pic.twitter.com/I43KiiraDh \\n— WikiLeaks (@wikileaks) November 4, 2016 \\n\\nIn a shocking video, the woman who invited them, performance artist and occultist Marina Abramovic is seen painting the recipe for these “spirit dinners,” using what appears to be thickly coagulated blood. The recipe read, at one point, “mix fresh breast milk with fresh sperm, drink on earthquake nights.”\\n@CassandraRules #SpiritCooking #podestaemails27 #WikiLeaksPhase3 #PodestaEmails #SatanicHillary #wikileaks28 #WikiLeaks #MAGA3X pic.twitter.com/rwAOpo8FaS \\n— Aussies For Trump ?? (@DeplorableDan2) November 4, 2016 \\n\\nThe revelation sparked massive concerns that the candidate’s inner circle, and perhaps even herself, are participating in some very dark things.\\nA woman involved in occult blood rituals was invited to Hillary\\'s campaign launch. #SpiritCooking https://t.co/hVbiefAvIt pic.twitter.com/5cW8nw6AZs \\n— Johnny Ringo (@JR4Trump) November 4, 2016 \\n\\nAbramovic donated the maximum amount of $2,700 to Clinton’s campaign, and was personally invited to attend her campaign launch.\\nThe post Hillary Clinton Speaks to the Dead For ‘Therapeutic Release’ appeared first on We Are Change .\\n'"}, "time": 1742564620.9434426}