{"duration": 0.03787565231323242, "input_args": {"text": "'Donald J. Trump has regularly boasted about “The Art of the Deal,” his   autobiography, as a business bible that demonstrates the sharp negotiating prowess he would bring to the presidency. The book, released in 1987, details his rise to the top of New York’s real estate world it helped spawn his career as a reality television star and cemented his image as a winner with a golden touch. But Tony Schwartz, the book’s ghostwriter, who spent 18 months in the 1980s interviewing and shadowing Mr. Trump, says that it is really a work of fiction. In an interview with The New Yorker magazine for its July 25 issue, Mr. Schwartz explained publicly, and for the first time, what he learned from living in Mr. Trump’s world. Here are some highlights. Mr. Schwartz, a former magazine writer who said he worked on the book because he needed the money, told the writer Jane Mayer that he painted Mr. Trump in the most positive light that he could, thinking that a sympathetic character would be better for the book’s sales than a story about a cruel tycoon. If he could do it over again, however, Mr. Schwartz said the book would be titled “The Sociopath. ” “I feel a deep sense of remorse that I contributed to presenting Trump in a way that brought him wider attention and made him more appealing than he is,” Mr. Schwartz said. “I genuinely believe that if Trump wins and gets the nuclear codes, there is an excellent possibility it will lead to the end of civilization. ” “He’s a living black hole!” Mr. Schwartz said he used to tell his wife after long days with Mr. Trump. He described Mr. Trump as a painful interview subject who could not handle questions that required any depth to answer and who had little recollection of his youth. When pressed, Mr. Schwartz said, Mr. Trump would grow fidgety, angry and sometimes quit despite the fact that they were ostensibly working together on the book. He had no attention span, Mr. Schwartz said. “If he had to be briefed on a crisis in the Situation Room, it’s impossible to imagine him paying attention over a long period of time,” Mr. Schwartz said of Mr. Trump’s inability to focus. People often ask Mr. Trump why he is really running for president, and he has always responded by saying that he wants to make America great. Mr. Schwartz has a different theory, explaining the bid as part of a continuum of Mr. Trump’s need for attention. He recalled that as a young man, Mr. Trump was happy to receive publicity of any kind, luring the tabloids to chronicle his life. His turn as the host of “The Apprentice,” the NBC reality show, solidified him as a media star, and running for president was the next logical step, Mr. Schwartz said. “If he could run for emperor of the world, he would,” Mr. Schwartz said. Mr. Trump has driven many fact checkers to near madness in the last year, and Mr. Schwartz was not surprised. During the time he spent with Mr. Trump, he said, the businessman would regularly exaggerate or outright lie to get the upper hand. “Lying is second nature to him,” Mr. Schwartz told The New Yorker. “More than anyone else I have ever met, Trump has the ability to convince himself that whatever he is saying at any given moment is true, or sort of true, or at least ought to be true. ” It was Mr. Schwartz who coined the phrase “truthful hyperbole,” referring to Mr. Trump’s notion of harmless lies, in “The Art of the Deal. ” He said that Mr. Trump loved the phrase. Many celebrities have ghost writers who do the bulk of the work on a book, but Mr. Schwartz said he was struck by how Mr. Trump took all of the credit but did practically none of the work. After reviewing the manuscript on which Mr. Schwartz had spent more than a year, Mr. Trump returned it with a few scribbles of a red marker, removing the names of some people he decided he did not want to criticize publicly. Although Mr. Trump claims to be the author of the best business book of all time, Howard Kaminsky, the former head of Random House, which published “The Art of the Deal,” begged to differ. “Trump didn’t write a postcard for us!” he told The New Yorker. Mr. Trump pushed back against the accusation that he had little role in the production of the book, telling the magazine, “I wrote the book. It was my book. ” As for Mr. Schwartz, Mr. Trump called him and expressed disappointment at how disloyal he had been. “Have a nice life,” Mr. Trump said, according to Mr. Schwartz, before hanging up.'"}, "time": 1742628521.6152592}