{"duration": 0.031923770904541016, "input_args": {"text": "'Warning : array_key_exists() expects parameter 2 to be array, null given in /home/content/p3pnexwpnas07_data02/05/3222705/html/wp-content/plugins/widget-options/core/functions.widget.display.php on line 182 Home › POLITICS | US NEWS › #PODESTA27: CLINTON TEAM ‘DEFINITELY’ WITHHELD MORE EMAILS FROM CONGRESS #PODESTA27: CLINTON TEAM ‘DEFINITELY’ WITHHELD MORE EMAILS FROM CONGRESS 0 SHARES \\n[11/3/16] In the latest batch of emails leaked by WikiLeaks, involving the account of US Presidential candidate Hillary Clinton’s campaign director John Podesta, it has emerged that – far from appearing open in releasing 55,000 emails on personal accounts – her team knew more were still uncovered. \\nIn the run-up to the revelation that Clinton had made use of personal emails in her role as Secretary of State, instead of verified and secure government accounts, her team scrambled to limit the damage to her reputation by releasing emails in an effort to appear open and responsible. Her communications adviser Jennifer Palmieri wrote in an email: “Team — wanted to let you know that Cheryl is working with State to get agreement on release of the 55k pages of emails she have to State. The hope would be that we are able to say tonight to the press that we are working with State to get emails released soon.” \\n“Not sure where those discussions will land, but hope is either State agrees to release on >> timely basis or we pledge to release them ourselves in ten days/week. Assume you all would agree this is right move?” \\nIn reply, her media adviser, former senior adviser to Barack Obama in both his 2008 and 2012 campaigns for the White House, Jim Margolis, wrote to John Podesta asking: “If there is a release of the 55K, are there others that are not being released?” To which Podesta replied: “Definitely.” The revelation shows how worried the Clinton team were of the inflammable nature of the email affair which has dogged her campaign for nearly a year. Post navigation Warning : array_key_exists() expects parameter 2 to be array, null given in /home/content/p3pnexwpnas07_data02/05/3222705/html/wp-content/plugins/widget-options/core/functions.widget.display.php on line 182 Warning : array_key_exists() expects parameter 2 to be array, null given in /home/content/p3pnexwpnas07_data02/05/3222705/html/wp-content/plugins/widget-options/core/functions.widget.display.php on line 182 Warning : array_key_exists() expects parameter 2 to be array, null given in /home/content/p3pnexwpnas07_data02/05/3222705/html/wp-content/plugins/widget-options/core/functions.widget.display.php on line 182 Warning : array_key_exists() expects parameter 2 to be array, null given in /home/content/p3pnexwpnas07_data02/05/3222705/html/wp-content/plugins/widget-options/core/functions.widget.display.php on line 182 RESOURCES'"}, "time": 1742628583.4068959}