{"duration": 0.029933452606201172, "input_args": {"text": "'RIO DE JANEIRO  —   Every four years, the same questions tend to surface before the Summer Olympics: Will the host city be ready? Is Usain Bolt still the world’s fastest man? And what sort of cushy digs will the United States basketball players find for themselves? The Games are underway, Bolt is back to defend his sprinting titles, and once again, the men’s and women’s basketball players from the United States are avoiding the athletes’ village. Carmelo Anthony, Kevin Durant, Diana Taurasi and the rest of their   teammates are staying on a luxury cruise ship, docked at a pier on the other side of the city. If the team’s lodging seems standoffish, that is by design. U. S. A. Basketball, the organization that oversees the national men’s and women’s teams, has shunned the athletes’ village since 1992. The team stayed on a ship at the 2004 Games in Athens, then used hotels in Beijing in 2008 and London in 2012. “The boat we’re staying on is very nice, very secluded,” said Angel McCoughtry, who is playing in her second Olympics. “Let’s be honest  —   how can our men’s and women’s teams stay in the village? They would get bombarded, especially the men’s team. They won’t have peace. ” The players, particularly the men, are exceedingly well paid as professionals. But other highly compensated athletes seemingly have no qualms about mixing with the other Olympians in the village. Bolt, probably the biggest star of these Games, checked into the village the other day. Michael Phelps, the world’s most famous swimmer, ran into Novak Djokovic, the   men’s tennis player in the world, in the village and asked for a selfie. The United States women’s gymnastics team, the showpiece of the American delegation, is also in the village. In fact, a majority of the 554 American athletes stay there. Jerry Colangelo, the director of U. S. A. Basketball, said keeping the basketball players in seclusion was a matter of security. “Our players are probably the most recognizable athletes in the world,” he said, explaining the “extra precaution” being taken. “We have our own idea of how to do that,” Colangelo said. “We can’t just throw them in with  —   once the International Olympic Committee decided they wanted pro players, to allow pro players to play, we have to protect them. They’re very valuable assets. ” Fans are kept at a distance behind a guarded fence with metal detectors, but they have been sticking their cellphones through the fencing to take photographs of the ship  —   the Silver Cloud, part of the Silversea Cruises fleet, which can accommodate 296 people. U. S. A. Basketball officials are circumspect when asked about the accommodations. Reporters are invited to tour the athletes’ village, but not the ship, bobbing in place at the Pier Mauá. There are 46 N. B. A. players and 26 W. N. B. A. players at these Games representing many countries. Several who do not play for the United States seemed to be enjoying life at the village last week. Andrew Bogut, a couple of months removed from playing in the N. B. A. finals with the Golden State Warriors, was sitting in the village on Thursday, decked in a Team Australia   suit, eating food from McDonald’s with two teammates. Leandro Barbosa and Nene are staying there, too, along with all the other Brazilian Olympians. Manu Ginobili of Argentina posted on Twitter a view from his room in the village. Pau Gasol, Ricky Rubio, Jose Calderon and the other players of Spain snapped photographs around the village grounds all week. Tina Charles, who won a gold medal with the United States women’s team in 2012, said the team’s accommodations meant that “you’re not able to interact with athletes, you’re not able to see them every day, build relationships, build friendships that way. ” Maya Moore, appearing at her second Games, said she understood the pros and cons, but she said the ship made it easier to focus. “There is a level of socialization that happens in the village that takes energy,” she said. “Over the course of two weeks, it can wear on you, even if it’s a little bit. ” The Plaza Mauá, on the city’s eastern waterfront, where the ship is docked, was revamped as one of the legacy projects of these Games, with new museums and areas for outdoor activities. Warehouses along the pier are now used as event and party spaces. Taurasi, one of the women’s team captains, lightheartedly described the ship as having “a nice,   Russian décor. ” Jimmy Butler, a member of the men’s team, said there were a pool, a gym, social rooms and conference rooms. Players can order room service anytime. “Same thing we’d do in a hotel,” Butler said. “It just floats. ”'"}, "time": 1742628537.3998978}