{"duration": 0.041597604751586914, "input_args": {"text": "'First Lady Melania Trump turned to her favorite designer, Dolce  Gabbana, for a visit to the U. S. Supreme Court Thursday, where she and President Donald Trump attended the investiture ceremony for Justice Neil Gorsuch. [Paired with a subdued black pencil skirt and black,   stilettos, Melania was fashion forward in a more than $2, 300 sleeveless wool jacket with a bejeweled buckle in the back by Dolce  Gabbana, the First Lady’s favorite Italian fashion house.  The jacket is from DG’s   2017 collection and can be seen in the photo Melania posted of the ceremony on her Instagram account:  Congratulations to Justice Neil Gorsuch on today’s official investiture ceremony! It was an honor to witness unforgettable moment! A post shared by First Lady Melania Trump (@flotus) on Jun 15, 2017 at 7:32pm PDT,  Dolce  Gabbana has been Melania’s   design house for custom outfits and luxury,   looks. The designer duo’s more outspoken half, Stefano Gabbana, usually celebrates on his Instagram when the First Lady wears one of the brands’ creations, thanking her for being a “DG Woman. ” Most recently, Breitbart News reported how Dolce  Gabbana launched a “#Boycott Dolce  Gabbana” ad campaign to mock critics who continue to demand that they stop dressing Melania. Gabbana posted a screenshot of the Breitbart News story on his Instagram account Thursday, accompanied with heart and laughing emojis and the hashtags “#boycottdolceandgabbana” and “#allthelovers. ”  ❤️❤️❤️❤️❤️❤️ #boycottdolcegabbana ❤️❤️❤️❤️😂😂😂😂😂🌏🌍🌎 #allthelovers ❤️ A post shared by stefanogabbana (@stefanogabbana) on Jun 16, 2017 at 3:44am PDT,    John Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder. '"}, "time": 1742564498.3187282}