{"duration": 0.09523200988769531, "input_args": {"text": "'Arizona’s state board of education (SBE) has voted to “rebrand” Common Core, i. e. replace the existing Common Core standards with the same standards that contain only some minor changes. [“The Arizona Board of Education has voted to approve new education standards to replace the Common Core State Standards,” Education Week reports,  “But the changes are minor rather than a   repudiation of the   effort to set standards for what students should know in   arts and mathematics. ”  The prominent change in the standards is the addition of cursive writing lessons through fifth grade, an element that Common Core does not provide. In addition, Arizona’s standards will now require younger students to study the concepts of time and money, and to spell frequently used words. “These new standards represent the final step in the repeal and replacement of the common core in Arizona, and they reflect the thoughts and recommendations of thousands of Arizona citizens,” said state schools superintendent Diane Douglas in a press release. “The federally mandated Common Core Standards were initially adopted by the SBE in 2010 without a thorough public review, which deeply frustrated many Arizonans,” Douglas continued. “That lack of public input became an even larger concern as problems with the standards were identified, many of which were related to the resulting curricula. ” “Common Core has at last been eliminated,” the superintendent said. “[W]e now have excellent ELA and math standards developed by Arizonans for Arizona students. ” The “Common Core” standards were previously rebranded as the Arizona College and Career Ready Standards by former Arizona Gov. Jan Brewer (R). Douglas campaigned for her post in 2014, running on an   Core platform. In September, KJZZ in Arizona reported that Douglas endorsed Donald Trump in the 2016 presidential election with the statement that Trump “shares my belief that the federal government’s role in education needs to be reduced rather than expanded. ” Dr. Sandra Stotsky, an author of the celebrated Massachusetts ELA standards, was asked to review the draft of the Arizona ELA standards, and shared her recommendations to Douglas and Arizona Gov. Doug Ducey (R) with Breitbart News. Stotsky expressed her disappointment: If it is not possible to find a group of Arizona newspaper editors to rewrite the poorly written English language arts standards, then I suggest that Superintendent Douglas and Governor Ducey   all the 2003 Arizona literature standards in place of those in this draft document. Overall, they were quite good. For example, in grade 11, students are to read “works of American literature that reflect our major literary periods and traditions. ” Stotsky also pointed out that a   Core Thomas B. Fordham Institute reviewer observed in 2010  —   in a comparison of Arizona’s prior standards with Common Core: “Arizona treats literary and   texts distinctly and thoroughly and in more detail than the Common Core. ” Writing at education blog “Truth in American Education” about the Arizona standards, Shane Vander Hart observed, “There has been some technical changes, but as far as I can see most of the foundational problems still exist. The early elementary standards are still  . There is still an over emphasis on informational text. The math standards still do not adequately prepare students for STEM programs in college. ” “It’s unfortunate that Superintendent Diane Douglas, who campaigned on ending Common Core, put her stamp of approval on this process and these standards,” he continued.  “It is also disconcerting that these standards were voted on instead of allowing an additional month of review and public comment. Arizona can do better than this. ” At Ricochet, Arizona high school parent Shawnna Bolick writes, “In a shocking irony, the very person  —   Diane Douglas  —   who promised to ‘stop Common Core,’ recommended the ‘revised’ standards standards virtually identical to the Common Core state standards foolishly adopted by the SBE in 2010. ” Bolick explains that Ducey directed the state board of education in 2015 to have “teachers and parents to bring [standards] forward together,” and, citing the fast adoption of Common Core in 2010, to “make right the situation  …    with full transparency. ” She states, however, that, despite the formation of a standards development committee that included parent members, “for the past year and a half the standards were only being reviewed by ‘technical professionals’ and lobbyists in   meetings. ” “These individuals were largely   core individuals,” Bolick continues. “Multiple requests were submitted to the Arizona Department of Education to include parents or people with opposing viewpoints, but these were turned down each time. ” Bolick concludes that the state’s ‘bureaucratic tyrants” have “ ” Arizona’s standards. In a column at Breitbart News, Stotsky urged the elimination of state boards of education and departments of education, observing, “It is becoming increasingly clearer that the main groups oppressing parents, local school boards, and local teacher unions with Common   standards and tests (regardless of what they are actually called) are state boards of education and state departments of education. ”'"}, "time": 1742561837.8498344}