{"duration": 0.07430195808410645, "input_args": {"text": "\"You are here: Home / US / Project Veritas Reveals Who Was REALLY Behind Romney’s 47% Video Project Veritas Reveals Who Was REALLY Behind Romney’s 47% Video October 28, 2016 Pinterest \\nOnce again, the lengths to which the Democrats have to go to win elections was evidenced by a Project Veritas video released Wednesday night on Fox News’“The O’Reilly Factor.” In the video, we found out that the “bartender” who obtained video of former Gov. Mitt Romney’s infamous “47%” comments during his 2012 presidential campaign may have actually been part of a coordinated effort by Democrat operatives to tank Romney’s campaign — despite the truth of his comments. \\nScott Foval, who was fired from his post at Americans United for Change after Project Veritas began releasing their videos, revealed that there may have been more behind the “47%” video than just a bartender at the fundraiser taking footage on his own, with no direction from anyone else. \\nTwitchy reported : \\nIn Wednesday’s video release, Foval explains that the bartender who caught Romney’s devastating “47 percent” remarks on video during a fundraiser was part of a coordinated operation to sneak a video recording device into the event. That video eventually was passed along to David Corn of Mother Jones, who won a George Polk Award for his efforts. \\nThe story at the time, of course, was that bartender Scott Prouty brought a camera along in hopes of perhaps getting a photo with Romney — which somehow involved setting down the camera and hitting the record button. Progressives hailed Prouty as a hero for coming forward with the video. \\nYeah, not according to Foval. \\n“Bob [Creamer] got a hold of our guys who did the original insertions back in the 2000 and 2004 campaigns against Bush where they were inserting people and interrupting his fundraisers and rallies,” he told an undercover Project Veritas journalist. “And then, I don’t know if you remember, well from, they are the ones who negotiated to get that lawyer in in Florida who recorded the 47 percent video.” \\n“Wait, I thought that was a bartender,” the undercover PVA reporter responded. \\n“It was actually a lawyer at the event,” Foval said and added: “The lawyer took his phone and had the bartender walk around with it and set it up.” \\nFoval continued, “It was a whole coordinated operation to get the phone in because they had taken away all the cell phones from all the staff and so what they did was they set it up in the room.” \\nWhen Foval was asked about who the lawyer was, he claimed he didn’t know. “I have no idea who it is but they, the people who do the operations, they have a team of about 25 folks that this is what they do.” \\nOf course, Foval is walking back his comments, and Corn has claimed that it isn’t true. Then again, that’s what liberals always do when they’re caught — deflect, lie, pretend it didn’t happen, etc. etc. James O'Keefe's New Story About the 47-Percent Video Is Totally False. https://t.co/uFnbTTqOLk\""}, "time": 1742562403.8446422}