{"duration": 0.10390472412109375, "input_args": {"text": "\"on November 4, 2016 12:25 pm · \\nWe’ve all seen pictures of the Trumps in their home surrounded by tacky gold decor, complete with their young son Barron in a suit with toys in front of him while he stares at the camera off to the side of his parents. It’s a life most of us can never imagine while we’re paying our monthly bills. So what’s it like growing up with Donald Trump as a father? According to Scott Melker, a former classmate of Donald Trump Jr.’s, at the University of Pennsylvania, being the former reality show star’s son wasn’t what one might imagine. Or, given Trump’s temperament, it might be exactly what you’d imagine. \\nOn Facebook , Mekler told of the animosity Trump’s son had for this father. \\n“I was hanging out in a freshman dorm with some friends, next door to Donald Jr.’s room. I walked out of the room to find Donald Trump at his son’s door, there to pick him up for a baseball game,” he recalls. “There were quite a few students standing around watching, trying to catch a glimpse of the famed real estate magnate. Don Jr. opened the door, wearing a Yankee jersey.” \\nThen Mekler told of the moment Trump slapped his son in the face in front of others. \\n“Without saying a word, his father slapped him across the face, knocking him to the floor in front of all of his classmates. He simply said “put on a suit and meet me outside,” and closed the door,” Melker wrote. \\n“Donald Jr. was a drunk in college. Every memory I have of him is of him stumbling around campus falling over or passing out in public, with his arm in a sling from injuring himself while drinking,” he continued. “He absolutely despised his father, and hated the attention that his last name afforded him. His nickname was “Diaper Don,” because of his tendency to fall asleep drunk in other people’s beds and urinate.” “I always felt terrible for him,” he continued. \\nMekler said part of his reason for voting for Hillary Clinton is because “in light of what I saw that day, it is clear to me that Donald Trump lacks the temperament and basic social decency to run our country.” \\nTo be clear, we are not demonizing Trump’s son for having an alleged drinking problem during his college days. Whether Melker’s story is accurate or not, we’re not sure, but given Trump’s awful temper, it’s difficult to discount it. \\nPhoto by Saul Loeb-Pool via Getty. Share this Article! Share on Facebook Author: Conover Kennard Conover makes tea partiers cry as a hobby. She was Commander of Jade Helm15 during the failed takeover of the South. She's also one of the biggest arseholes on Twitter. At night, she can be found drinking Conservative tears while pulling off the wings of flies just because she can. She is the founder of a Marxist, Commie, Maoist, Socialist site and has contributed to several other sites, blah blah blah. She is an awful person but she doesn't like to brag about that. Search \""}, "time": 1742563477.673578}