{"duration": 0.10930609703063965, "input_args": {"text": "'Politico is reporting late Sunday that White House chief of staff Reince Priebus has an Independence Day deadline to clean up the messes he is responsible for in the White House. [“President Donald Trump has set a deadline of July 4 for a shakeup of the White House that could include removing Reince Priebus as his chief of staff, according to two administration officials and three outside advisers familiar with the matter,” Politico’s Tara Palmeri wrote late Sunday night:  While Trump has set deadlines for staff changes before, only to let them pass without pulling the trigger, the president is under more scrutiny than ever regarding the sprawling Russia investigation, which is intensifying the pressure on his White House team. Days after his return from his first foreign trip late last month, Trump berated Priebus in the Oval Office in front of his former campaign manager Corey Lewandowski and deputy campaign manager David Bossie for the dysfunction in the White House, according to multiple sources familiar with the conversation. Palmeri joined Breitbart News Sunday on SiriusXM Patriot Channel 125 to discuss the breaking news on Priebus out of the White House. Palmeri wrote that Bossie has been considered for deputy White House chief of staff and Lewandowski has been considered for a White House senior adviser role with a “portfolio that includes Russia,” but Trump told Lewandowski and Bossie they would not be going into the White House just yet  —   that Priebus deserves one last chance to get things under control in there. “I’m giving you until July 4,” Trump told Priebus, Palmeri wrote, citing a source with knowledge of the conversation. “I don’t want them [Lewandowski and Bossie] to come into this mess. If I’m going to clean house, they will come in as fresh blood. ” White House press secretary Sean Spicer  —   a staunch ally of Priebus  —   denied this claim. “Whoever is saying that is either a liar or out of the loop,” Spicer told Palmeri. But Spicer has previously been wrong about Palmeri. Back in March, Spicer told Breitbart News that Palmeri was “an idiot with no real sources” when she previously reported accurately that Priebus was in jeopardy of losing his job then. It turns out that is not accurate as, the very next day, Palmeri quoted an   conversation she had with chief White House strategist Stephen K. Bannon. Palmeri added that Independence Day is hardly the first deadline that Priebus has faced  —   and he has succeeded in surviving for now. “The Independence Day timeframe is timed with Senate Majority Leader Mitch McConnell’s deadline for passage of the health care bill through the chamber, which is also the start of the July 4th recess,” she wrote: Priebus took the brunt of the blame for the first failure to get a vote on the bill through the House, though the White House and Speaker Paul Ryan were ultimately able to secure its passage on a second try. Talk of Trump’s July 4th deadline has made the rounds in the White House, but insiders and those close to the president are not holding their breath, given the perpetual talk that Priebus and other senior staffers are on the way out. Trump’s first deadline for the firing of Priebus and many staffers that he brought on from the Republican National Committee was the   mark. The president then considered the idea of a Memorial Day shakeup when he returned from the foreign trip, and then most recently, July 4. People who have been considered as potential upgrades from Priebus, Palmeri wrote, include   campaign adviser David Urban and Blackstone executive Wayne Berman  —   among others who have been considered. Other names that have been floated publicly but are not mentioned in this piece include House Majority Leader Kevin McCarthy and White House National Economic Council director Gary Cohn. McCarthy’s role in Congress, since Congress has not done much in the way of helping Trump succeed, could be an impediment to him getting the job. Cohn’s leftist tendencies, meanwhile  —   as exhibited by his comments bashing the coal industry while in Europe last month  —   are a sign that the selection of Cohn would be a setback to the administration. Cohn is reportedly interested in other positions, too, including Federal Reserve chairman. An adviser to the president mocked Priebus’s predicament in a statement to Palmeri. “It’s become comical that every holiday becomes a referendum on Reince,” the adviser said. Priebus has even joked about how bad his situation is, per Palmeri, telling one person recently, “I’ve got one foot on a banana peel and another out the door. ” Now, Trump is considering sending him to Greece as ambassador. “Trump has weighed the idea of moving Priebus to the role of ambassador to Greece, because of his Greek descent,” Palmeri wrote. “Trump told Bossie, ‘that Priebus will enjoy Greece,’ according to two people with knowledge of the comment. ” But at least two   advisers questioned    whether Priebus was indeed on his way out on July 4 if he does not fix the place soon. “The White House is different [than the Trump Organization],”   Sam Nunberg said. “You can’t make quick changes, it’s an institution. Once someone is gone from there, they’re gone. With that said, I think Reince will be there for the long haul. ” Roger Stone, another longtime confidante of the president, told Palmeri that two “drastic personnel decisions” that Trump made in his business career were when he fired Trump Organization CEO Edward Tracy and Trump Atlantic City Associates CEO Nicholas Ribis. “He likened the firings to Richard Nixon’s ‘Saturday Night Massacre’ and called it ‘sudden,’” Palmeri wrote of her conversation with Stone. “He suggested that if and when Trump removes Priebus, it will be at an opportune time and with a landing pad. ” Stone told Palmeri, too, that after the fallout from the president’s firing of now former FBI director James Comey, he will likely remove Priebus more carefully if he does end up doing so. “I think it would be fair to say, that with the entire Comey controversy, that’s a pretty good reason not to make a change at this exact moment,” Stone said. LISTEN TO POLITICO’S TARA PALMERI ON BREITBART NEWS SUNDAY: '"}, "time": 1742562220.059093}