{"duration": 0.2777278423309326, "input_args": {"text": "'When Midtown Manhattan goes dark after hours, Chicken Delicious edges onto his piano stool at Mimi’s, tinkling some notes to start. He opens to the crowd with his soft Southern accent: “Good evening, everyone. My name is Chicken Delicious. I come from Mississippi. I live on the kindness of strangers. ” This is a reference to his tip jar. Mimi’s at midnight resembles those parties you used to hear about in New York, rowdy affairs of offbeat regulars for whom last call always seems far away. The Italian restaurant and piano bar, which opened on Second Avenue and 52nd Street in 1973, glows invitingly from its street corner in those hours with the warmth of Tiffany lamps. The sign above its bar reads, “What Happens at Mimi’s Stays at Mimi’s. ” Its regulars, mostly over 50, seem to appreciate this nightly time warp, and could themselves be extras from “Midnight Cowboy” or “Taxi Driver”: a Scandinavian brain surgeon who requests Beatles tunes, a Taiwanese man who sings   and hogs the microphone, a woman who keeps saying she needs to get home to her husband but keeps ordering another drink. But for evenings to hum like this at Mimi’s, much depends on Chicken Delicious, 74, who is the conductor of festivities, the metronome to which things swing. Chicken Delicious, a voluminous bald man, started at Mimi’s in 1996, and he may be one of New York’s most eccentric and unsung acts. He is not in guidebooks for tourists, but to those at Mimi’s, he is a kind of Midtown legend, performing every night except Mondays and Saturdays. Liza Minnelli has been known to go see him play. “In a city full of talent, Chicken is an icon,” Anders Cohen, the Scandinavian brain surgeon, said recently at the bar. “When he’s on he’s got the schtick. He’s got the  . And he can play it all. ” His humor is mildly crude and New  . “You used to play football in college didn’t you?” he recently taunted someone. “How did it feel always being the wide receiver? Or were you the tight end?” During a Billy Joel tune, he gave the chorus a Midtown twist: “I’m in a Tudor City state of mind. ” Outlandish masks are part of his act: the pope, a dog, Marilyn Monroe, a   baby, a fairy. He has made hundreds and keeps the collection at his home in Yonkers. He also narrates the tale of a persona in between tunes, one of a shy artistic boy from a fictional town in Mississippi who fled to New York to play the piano and make it big. He has described the town as “not quite Faulkner. ” During his set breaks, he waddles to the kitchen for baked French fries, which he likes blackened. If customers engage him during a break, he may ask for their “numbers” and start notating equations about their luck on a cocktail napkin. But every so often he will offer the details of his own luck. If he does, make sure to pay attention to the ornaments on his wrists and the peculiar sun pendant around his neck. Chicken Delicious’s path from the Deep South to a Midtown piano bar is a classic story of New York reinvention. But his story is stranger than most. He has crossed paths with Yoko Ono and her entourage, had a moment in the New York art world, and he helped create a voodoo love potion so powerful its effects could not be reversed. He was born Lewis Hunter Stowers III in 1943 and grew up in Jackson, Miss. Like the character in his act, he was a shy boy who often felt out of place. Mr. Stowers’s early passion was watercolors, and his paintings (he has scans of his work on his iPad) portray the landscape of his formative years: rickety roadside general stores, crumbling antebellum mansions, a dilapidated bowling alley on the edge of a swamp. He credits his mother, who died when he was 7, with instilling in him a love of piano playing. When he was 5, Mr. Stowers said, he ran away from home to crawl into a pit teeming with alligators. “My parents found me sitting on their heads,” he said. The alligators didn’t touch him, however, which he took as a sign that he was different. He studied art at a Christian college and motorcycled through Europe in his early 20s to, he said, “sleep in fields and eat yogurt. ” In the late 1960s, he started teaching art in New York as his own career as a painter was blossoming the New York Times art critic John Canaday even reviewed him, seeing in his work “echoes of   German romanticism adapted to juvenile (or even infantile) demonism. ” Then in 1969, Mr. Stowers met a mystic named Joseph Lukach and everything changed. This is a period his fans at Mimi’s know little about. The man who would become Chicken Delicious would bear witness to a chapter of occult history. Mr. Lukach was a short and rotund figure who wore   glasses and practiced a blend of   religions like Yoruba, Santería and Voodoo. Mr. Lukach, who died in 1995, never became as famous as the English occultist Aleister Crowley, but in the spheres of   witchcraft, he was considered a powerful witch and healer and counted Ms. Ono among his acolytes. “Witches U. S. A. ,” a popular book in the early 1970s that chronicled America’s occult scene at the time, devoted a full chapter to him. “Despite being    and weighing 200 to 250 pounds, depending upon the current state of his casual attitude toward dieting,” a passage reads, “Joe is as light as a perfectly   dumpling. ” It also said his most prized possession was a “   green Egyptian scarab set in heavy gold” that he wore on the little finger of his left hand. Though his relationship with Mr. Lukach later became troubling, initially Mr. Stowers was in awe of the abilities he saw. When Mr. Lukach was displeased by a pasta dish, he set the cook’s buttocks on fire, Mr. Stowers said, and on a weekend trip to a lake together, Mr. Lukach grew weary watching a   and made him flip into the water by slicing his finger through the air. “‘What are you doing?’ I asked him,” Mr. Stowers said. “‘Target practice,’ he told me. ” Mr. Stowers became Mr. Lukach’s apprentice, and they opened a small botanica together on the Upper West Side. He started managing Mr. Lukach’s meetings with clients, helping sell herbs and potions, and became a skilled palm reader and student of numerology. One of their   products was a love potion they believed was created by the infamous Louisiana Voodoo practitioner Marie Laveau. “He summoned her one night,” Mr. Stowers said. “She arrived and her dress was ruffling in the air. He said he wanted her love spell recipe and would she give it to him. She did. We made it. The ingredients were grisly. We bottled and sold it. “I told customers there is no antidote and they would say: ‘I don’t care. I want this person. I need them.’ Then they would come back six months later saying they wished they could get rid of this person more than anything. ” Mr. Stowers said that he still had some vials left and that they collected dust inside a box in his Yonkers basement. “I will never touch them,” he said. It was an exciting time to be a witch in New York. Conjurers of all kinds would hang out near Astor Place at Weiser Antiquarian, the oldest occult bookstore in America, and they shopped for ingredients for spells at Alberto Rendon’s botanica on 116th Street. On the side, Mr. Stowers became a fixture on the piano bar circuit playing at gay bars like the Painted Pony. “Everyone knew everyone,” Mr. Stowers said. “Not like now. There’s nothing unique about witchcraft in New York today. Everyone who wants to be a witch can say they’re a witch. You used to have to really know what you were doing in that world to be respected by others. ” But potions and incantations were not entirely new to Mr. Stowers. He had been having visions since he was a child. He said he started sleeping in cemeteries in his 20s. “That’s when I started working with the dead,” he said in his car outside Mimi’s recently as he hunted for a parking space. “That was when I started visiting the African spirit world. The gods talked to me. After that, a conga line of the dead started following me wherever I went. ” Mr. Lukach was merely empowering something that was inside him all along. He was finally able to conclude that an African deity named Oshun, who represents love and the arts, had protected him in that swamp when he was 5. “She had been watching me since I was a boy,” he said. Regarding Mr. Lukach, Migene   an author and expert on   religions, said, “It sounds like he was mixing various religions and beliefs and making his own special blend. ” She suggested he had fallen through the cracks of occult history, but added: “I don’t want to pass judgment, but this was a time people were interested in spiritualism. Everyone was looking for enlightenment. Bob Dylan was. The Beatles were. It was a period of  . But he may have been completely sincere in his beliefs. ” Interest in the occult was having a moment in pop culture around the same time. Rock bands like Led Zeppelin and the Rolling Stones were drawn to the dark teachings of Mr. Crowley. Mr. Stowers would enter this cultural moment himself. He and Mr. Lukach, he claimed, were psychics to Ms. Ono in the late 1970s. “She’d send a limo to pick us up and take us to the Dakota,” he said. “As Joseph and her would do readings together, I’d play the theme to ‘Rosemary’s Baby’ right there on John Lennon’s big beautiful white piano. She would call Joseph at all hours of the night if she had a good song idea and ask him, ‘Am I going the right way? ’” Mr. Stowers said he still had Ms. Ono’s “hand prints” from those days stored away in his home. He is mentioned briefly in the controversial 1988   biography “The Lives of John Lennon,” by Albert Goldman. Of a close friend named Sam, Mr. Goldman wrote that one June evening, Ms. Ono “told him that as a step toward his elevation he must go that very night to see a marvelous psychic whose name was Joseph Lukach. He would make a study of Sam and give him potions that would strengthen him spiritually. Sam was taken by limousine to Yonkers, where Joey was living with his companion, Hunter, in a suburban bungalow with a backyard and garage. ” (Ms. Ono did not respond to requests for comment.) By the end of the 1970s, the Yonkers house was filled with altars to deities like Oshun and Anubis, and students of Mr. Stowers and Mr. Lukach would commute from the city on weekends for lessons in their living room. Many of these people are no longer around, but Mr. Stowers remains in touch with a man named Peter, who joined Mr. Lukach’s circle in the late ’70s, and declined to use his surname to avoid association with his past in the occult. He is a veterinarian in Manhattan. “He could do things saints could do,” Peter recalled in a phone interview. “Things that Jesus could do. “We’d go there every week and meet in these groups. Hunter was always there. And he too began to open himself up to the universe and see things like Joseph could. ” But there had long been a darker side to their union. Mr. Stowers has described it as “servitude. ” In his mind, it was no ordinary apprenticeship, but rather a form of   slavery. Soon after they met, according to Mr. Stowers, he was compelled to obey Mr. Lukach, who chose his friends, the relatives he could speak to and even what he could eat. Mr. Stowers slept on the floor and made Mr. Lukach’s clothes by hand. “I was a free bird who was put in a cage for 20 years,” he said. He reflects calmly on this period now. “There is a tradition of a shaman choosing a whipping boy to break him and then remake him,” he said. “I had to be broken. I was lost. I was looking for him. I look back and wouldn’t change one thing about it because I wouldn’t be who I am now. ” Peter reluctantly admitted that Mr. Lukach, when inclined, could use his prowess as a healer for darker biddings. “He could use black magic on those that rubbed him the wrong way,” he said. When asked to elaborate further, he declined and said, “It’s best not to talk about this. ” When Mr. Lukach died in 1995, Mr. Stowers believed the spell of servitude was broken, but their students dispersed, and Mr. Stowers was left alone in the home filled with potions and Voodoo relics, where he still lives. “One of the great sadnesses of Hunter’s life is that none of these people who were supposedly so friendly to him are around anymore,” Peter said. “Once Joseph was gone, the thing that brought everybody there left as well. That is what happens when relationships are based on a desire to touch power. ” But Lewis Hunter Stowers III then started his transformation into Chicken Delicious. He still had the piano gigs, which he said Mr. Lukach permitted him because they brought home money. Over the years, he had kept his act simple: background music with little showmanship. After Mr. Lukach died, however, he suddenly felt like singing one night at a bar in Bay Ridge, Brooklyn. He did. And he liked it. “I’d never sang before,” he said. “I stood up and sang. I sounded terrible. They laughed at me. But I was finally out of my cage. ” In 1996, he auditioned at Mimi’s. A longtime bartender, Star, remembered his arrival. “When he first came here they said he was too wacky,” she said. “I told them: ‘Nonsense. Let’s hire him. ’” Another bartender, Laurie Bricker, also recalled his start. “Mimi’s will be around no matter who is behind the piano,” she said, “but when Hunter came here, a very special and psychic power arrived with him. ” The masks and the tale of the fictional Mississippi town developed soon after. So did his exotic pendants. “I make them all myself,” he said. “Each one represents a god or goddess I worship. I throw the bones every evening and ask them which I should wear. They tell me if it will be a hard night or if someone will need special care. I’m like a pastor. Each is an omen of how the night will be and what will be needed from me. ” Before a set at Mimi’s last month, Mr. Stowers drove around the block repeatedly in his car. This nightly search for a parking spot has become something of a ritual. “Jesus will help us find a spot,” he said. As he looped around the block, he explained how he took the name Chicken Delicious. First, he became Hunter Blue in 1998, because he dyed his hair blue, then he became Chicken Delicious in 2010, when a spirit told him he was becoming an old man. He said it told him: “Do this and they won’t think of you as an old man. Do this and they will think of you as an old chicken. ” “Now I’m just waiting for my next name,” he said. “I’m waiting for the next step in my evolution. ” At a red light, he offered divinations about my life: “You’ve been a nervous wreck. ” “You’re not an easy person and you will never be easy. ” “You have problems in your romance life. ” Eventually, a red Toyota pulled out in front of Mimi’s. “I told you Jesus would deliver,” he said, pulling into the space. “Some people think this all just fun. But there’s a depth happening. This is a distilling of many years of magic. What I’m doing isn’t obvious, but I find the people who are looking, even if they don’t realize it. ” Mr. Stowers hobbled out of his van, collected a bag of props and headed into Mimi’s, where regulars were gathering. He edged onto his stool. “Good evening, everyone,” he said. “My name is Chicken Delicious. ” He told them he came from Mississippi. “I live on the kindness of strangers. I’m going to show you what it means to follow a passion every day like I have for 74 years. ” Then he put on a mask and started to play.'"}, "time": 1742561724.043263}