{"duration": 0.19304275512695312, "input_args": {"text": "'With a fortune estimated at over $5 billion, Sumner M. Redstone could afford the best estate planning that money could buy. What he ended up with is a mess  —   no matter the outcome of the welter of lawsuits swirling around Mr. Redstone, the ailing media mogul who turned 93 last Friday. A lawsuit brought by Manuela Herzer, one of Mr. Redstone’s    romantic partners, stripped him of whatever dignity he might have hoped to retain by publicly revealing humiliating details about his physical and sexual appetites and his diminishing mental capacity. A medical expert said Mr. Redstone suffers from dementia that’s “toward the severe end of moderate. ” That case was dismissed last month, but the testimony was just the curtain raiser for a far more important showdown now unfolding between Mr. Redstone’s previously estranged daughter, Shari Redstone, and the man who had seemed to be his handpicked heir apparent, Philippe Dauman. The fate of the   CBS and Viacom hang in the balance. Mr. Dauman is the chief executive of Viacom, and was  —   until recently  —   Mr. Redstone’s longtime confidant and a trustee of the trust that controls 80 percent of National Amusements (his daughter owns the remaining 20 percent). National Amusements in turn owns 80 percent of the voting stock in both CBS and Viacom. Mr. Dauman now finds himself in the seemingly contradictory position of arguing that Mr. Redstone, as his lawsuit asserts, “suffers from profound physical and mental illness,” only months after he said in court papers filed in Ms. Herzer’s case that Mr. Redstone was “engaged and attentive. ” (Mr. Dauman maintains in his lawsuit that Mr. Redstone has deteriorated since then.) Mr. Redstone “now faces a situation where it appears that people around him are competing for control and each has their own objectives,” said Georgiana Slade, head of the trusts and estates group at the law firm of Milbank, Tweed, Hadley  McCloy in New York. “It seems that many people with an interest are attempting to influence decisions related to his estate, the trust and Viacom. But the real question should be: What does Mr. Redstone himself want?” While it may be an extreme example of the high stakes and chaos that can result, “the Redstone pattern is happening in epidemic proportions,” said Kerry Peck, an estate planning specialist and managing partner at Peck Ritchey in Chicago and a   of the book “Alzheimer’s and the Law. ” “Caregivers in particular, often younger women, are ingratiating themselves into the lives of older men,” Mr. Peck said. “They meet them at places you’d consider safe, like senior centers, churches and synagogues. They start as caregivers, and then they become romantic suitors. We’re seeing these scenarios with stunning frequency. ” As Americans live longer and more families are forced to cope with common    issues like dementia, the problem is getting worse. “It’s a huge issue nationally as the elderly population grows and their minds start to falter,” Ms. Slade said. “I’ve seen charities coming after people for multiple gifts: Sometimes these donors don’t remember that they already gave the previous week. Romantic partners, caregivers who take advantage of the elderly  —   we’re seeing it all. ” Elderly people may be especially susceptible to the influence of people who happen to be around them during their waning days. Ms. Slade and other Milbank lawyers were   to the public administrator overseeing the estate of Huguette Clark, the reclusive heiress who died in 2011 at the age of 104. Despite good health, she lived the last 20 years of her life in New York hospitals. She bestowed lavish gifts on various caregivers ($31 million to one nurse) and left the bulk of her $300 million fortune to her nurse and a charitable foundation controlled by her lawyers and accountant, to the exclusion of family members. The family challenged the will in court and Milbank, on behalf of the public administrator, sought to recoup the gifts for the estate. The cases were settled and family members said they hoped to call attention to a growing problem of elder abuse. “This is an issue for lots of people of even modest wealth,” said David M. English, a professor of trusts and estates at the University of Missouri School of Law and former chairman of the American Bar Association’s commission on law and aging. Professor English said the most common approach is the creation of a trust, either revocable (which means it can later be changed) or irrevocable, that anticipates such a problem and defines what the creator of the trust means by incapacity. This could be a much less rigorous standard than is typically applied by courts in the absence of such a definition. “The document should define the meaning of incapacity and, more importantly, indicate who determines incapacity,” Professor English said. Mr. Redstone created such a trust, but it cedes little control to others as long as he remains alive, and it doesn’t specifically define incapacity. According to his lawyers, his trust is irrevocable, but Mr. Redstone is the sole beneficiary as long as he’s alive, and he has the power to remove or add trustees unless he’s “incapacitated. ” “This can occur only if Mr. Redstone is adjudged incompetent by a court, or upon the delivery of a document signed by three doctors stating that, based on medical evidence, he is unable to manage his affairs in a competent manner,” according to a court filing by Mr. Redstone’s lawyers. Who controls the   board of his trust is critical, since the National Amusements trust will control Mr. Redstone’s assets, including his dominant stakes in CBS and Viacom, should Mr. Redstone die or be deemed incapacitated. Though long at odds with Ms. Redstone (who is a trustee, as is her son) Mr. Dauman and the other four nonfamily trustees seemed safely in charge as long as they retained Mr. Redstone’s support. But last month, Mr. Redstone abruptly dismissed Mr. Dauman and another longstanding trustee in what Mr. Dauman called “a shameful effort by Shari Redstone to seize control. ” Mr. Dauman and his   filed suit in Massachusetts (where Mr. Redstone’s trust was created) to have their dismissal deemed invalid on grounds that Ms. Redstone had isolated her father and was exercising undue influence over him, all claims that Ms. Redstone denies. The trial is scheduled to begin next week. Mr. Redstone’s lawyers filed suit in Los Angeles, seeking a ruling that the trustee changes were valid. Which court would prevail in the event of inconsistent rulings could be the subject of yet another round of litigation. Mr. Redstone’s mental capacity is a central issue in both the California and Massachusetts lawsuits. “In drafting a trust like this, you need very clear standards and protocols for determining capacity,” Ms. Slade said. An elderly client, she added, “will often require the assistance of a lawyer to protect him from himself in his old age. ” She emphasized that different decisions might require different standards for determining capacity. “The real question,” Ms. Slade said, “is does someone have the capacity for the decision at issue? It’s one thing to be deciding what you want for dinner and something very different to decide who should be running a major corporation. ”   trusts can make such distinctions. Mr. Redstone “could have avoided many of these problems if he’d created a trust that allowed a majority of trustees to conclude that he didn’t have the capacity to remove trustees,” Mr. Peck said. Trusts often contain such a provision that automatically goes into effect when the creator of the trust reaches a designated age, such as 75 or 80. But sometimes no amount of legal advice can save people from an unwillingness to face their own mortality and cede control while still in full control of their faculties. “There aren’t any sympathetic characters here,” said Jeffrey Sonnenfeld, a professor at the Yale School of Management and author of a book on corporate succession, “The Hero’s Farewell: What Happens When C. E. O.s Retire. ” “Sumner Redstone,” Mr. Sonnenfeld said, “brought this mess on himself. ”'"}, "time": 1742562358.6473782}