{"duration": 0.1404280662536621, "input_args": {"text": "'JERUSALEM  —   In a furious riposte a day after the United Nations Security Council’s adoption of a resolution condemning Israeli settlement construction, Prime Minister Benjamin Netanyahu on Saturday pledged to exact a “diplomatic and economic price” from countries who acted against Israel. Mr. Netanyahu also announced that he would halt his country’s contributions to several United Nations institutions, as well as   the presence of the body’s representatives in Israel. In a televised address at a Hanukkah   ceremony honoring wounded soldiers and the victims of terrorism, Mr. Netanyahu excoriated the Obama administration for not vetoing the Security Council’s measure. He said he would work with the incoming administration of   Donald J. Trump to rescind it. Describing the resolution passed on Friday as “distorted,” “delusional” and “absurd,” Mr. Netanyahu said it was “part of the swan song of the old world that is biased against Israel. ” “But, my friends, we are entering a new era,” he added. Mr. Netanyahu, who is expecting the incoming Trump administration to be more forgiving of Israel’s settlement activity in the occupied West Bank and in East Jerusalem, accused the Obama administration of carrying out a “disgraceful   maneuver. ” Mr. Netanyahu has already recalled Israel’s ambassadors from New Zealand and Senegal, two of the four countries that sponsored the resolution and pushed it through, and has ordered Israeli aid to Senegal be halted. There was also a report that Mr. Netanyahu had canceled a visit to Israel by the prime minister of Ukraine, because of that country’s vote in favor of the resolution. Mr. Netanyahu also said he had instructed the Foreign Ministry to   all of Israel’s relationships with the United Nations, a body that Israel has long viewed as biased against it, and said he was stopping 30 million shekels  —   about $7. 8 million  —   in funding to five United Nations institutions that are “particularly hostile to Israel. ” There is no complete consensus in Israel about settlement projects, and domestic critics of Mr. Netanyahu saw the resolution as a severe blow to his recent claims about Israel’s improved standing in the world. But Mr. Netanyahu tried to appeal to Israeli emotions by emphasizing that the resolution made no distinction between Jerusalem and the West Bank  —   considering the Jewish Quarter of Jerusalem’s Old City and the Western Wall, the holiest place where Jews can pray, as occupied territory. Israel wrested the West Bank and East Jerusalem, including the Old City, in the   war of 1967. Ehud Barak, a former Israeli prime minister and defense minister, said it was Mr. Netanyahu who had failed to make any distinction between building in East Jerusalem and the settlement blocs close to the 1967 lines, which Israel expects to be able to keep under any peace agreement with the Palestinians. “The principal enemy of the settlement blocs and the Jerusalem neighborhoods is Netanyahu himself,” Mr. Barak, an increasingly vocal critic of Mr. Netanyahu, said on Israeli television on Saturday night. Isaac Herzog, the leader of the   Zionist Union and head of the parliamentary opposition, said in a Facebook post, “The man who just a month ago told us that the world worships him, declared war this evening on the world, on the United States, on Europe, and is trying to calm us with conceit. ” Naftali Bennett, the education minister and leader of the     Jewish Home party in Mr. Netanyahu’s coalition, goaded Mr. Netanyahu to respond with more drastic measures, like annexing parts of the West Bank to Israel. “The time has come to transition from withdrawals to sovereignty,” he said.'"}, "time": 1742562711.335792}