{"duration": 0.06490397453308105, "input_args": {"text": "'\\nAccording to a new Wikileaks email, Bernie Sanders was just a Manchurian candidate and a Clinton puppet all along. We finally have confirmation of what we have suspected since Bernie said “people are sick of hearing about your damn emails” all the way back in 2015 during one debate. That was a big give-away and a huge red flag which many have raised back then but now we finally have irrefutable proof that Bernie Sanders was just a SCAM candidate and a con artist.\\nBernie’s ONLY role was gather millennials plus the angry people on the left, the Democrats who feel disappointed with the Obama establishment which could later be passed over to Hillary Clinton. These people would have never came directly to Hillary Clinton in the first place so they needed an intermediary, like a vessel. Some eventually came to Hillary but not too many since it was discovered that the nomination was stolen from Bernie and he didn’t protest at all.\\nNow yet ANOTHER email by Robby Mook who is Hillary’s campaign strategist and manager has come out thanks to Wikileaks where it appears that Hillary Clinton had “leverage” to use against Bernie Sanders in case he ever stepped over the line and that they had to “signal” him after he violated their “agreement”.\\nWikileaks Emails ID 47397 reveals the following disturbing information: \\nThis isn’t in keeping w the agreement . Since we clearly have some leverage , would be good to flag this for him. I could send a signal via Welch–or did you establish a direct line w him\\nWe now have written confirmation that there was an agreement between Hillary Clinton and false revolutionary Bernie Sanders from the beginning. So now we know why Bernie isn’t appalled by Hillary calling his supporters basement dwellers , bucket of losers and dumb millennials . Now we know why he continues to campaign with her despite being investigated by the FBI for child pornography, Satanic rituals and was even caught causing riots in places like Chicago with paid protesters dressed as Bernie Sanders supporters so they can get the blame.\\nIf you are a former Bernie Sanders supporter who feels disappointed after this one, here’s the reason why you should vote for Donald Trump and why we believe Trump is the real socialist you were all looking for.\\nSo despite everything, he’s still with her. Now we know why! I mean we always felt like we knew why but we didn’t have any proof. Now we have the proof to back up our claims.\\n'"}, "time": 1742563236.919518}