{"duration": 0.047374725341796875, "input_args": {"text": "'As the public turns against Pharma, government embraces it By Martha Rosenberg Posted on November 3, 2016 by Martha Rosenberg \\nPublic anger at Pharma and its outrageous prices has never been higher. \\nFirst a smirking Martin Shkreli, founder of Turing Pharmaceuticals, refused to explain or defend his price hike of the antiparasitic drug Daraprim from $13.50 to $750 on the Hill in February, a price hike that could put the life-saving drug out of reach for some. With clear derision for regulators and the public itself, he tweeted that lawmakers were “imbeciles” after he testified. \\nThen Mylan jacked the price of its EpiPen, an emergency allergy treatment that saves lives, to $600 up from $100 almost overnight this summer. After public uproar, Mylan offered EpiPen cost breaks to low-income people—a common Pharma ruse that simply shifts costs to others while letting Pharma keep its prices. \\nAnd even as U.S. Pharma companies profiteer on older drugs like Daraprim (and newer drugs like the hepatitis C drug Sovaldi, which costs $84,000 for a course of treatment), they try to duck U.S. taxes with overseas partnerships and incorporations. The same taxes that fund their drugs in Medicare, TRICARE, the VA and other U.S. entitlement programs. \\nPharma may be becoming one of the public’s most reviled sectors but the U.S. government is in the process of erasing the few regulatory firewalls that have existed and tolerating alarming conflicts of interest. \\nExhibit A is the nomination and confirmation earlier this year of Robert Califf as FDA commissioner despite financial links to 23 Pharma companies, including Johnson & Johnson, Lilly, Merck, Schering Plough and GSK, according to a statement on the website of Duke Clinical Research Institute which he directed. In disclosure information for an article in Circulation, Califf also lists financial links to Gambro, Regeneron, Gilead, AstraZeneca, Roche and other companies and equity positions in four medical companies. Califf “served as a director, officer, partner, employee, advisor, consultant or trustee for Genentech,” said the Medscape website. This is an FDA commissioner? \\nIn the past, someone so heavily funded by industry would not be considered for a government position regulating that very industry. Yet on PBS, Califf saw no problem with doctors and researchers receiving Pharma money and actually thought it desirable. “Many of us consult with the pharmaceutical industry, which I think is a very good thing,” he told host Susan Dentzer. “They need ideas and then the decision about what they do is really up to the person who is funding the study,” he said. \\nCaliff was an early cheerleader for the blood thinning drug Xarelto, which is now linked to at least 500 deaths and possible high level medical deception. \\nNIMH and NIDA also turn toward industry \\nOther branches of government are also tilting toward Pharma. In a recent editorial, John Markowitz, professor of clinical psychiatry at Columbia, lamented that at the National Institute of Mental Health (NIMH), under the leadership of recently departed director Thomas Insel, translational research (which tends to be Pharma focused) “has become virtually required for funding” with almost no clinical, non-drug research funded. \\nInsel, an early proponent of SSRI antidepressants (which he said “soothed people’s symptoms within weeks, much faster than standard psychotherapy”), left government to work at a billion dollar, semi-secret private venture between Google and Pharma last year. The CEO of the new Google life sciences venture is former Genentech chairman Art Levinson. As NIMH director while national alarm about toddlers on stimulant drugs was growing, Insel protested “under treatment” of children with ADHD drugs. \\nFinally, even as drug addiction, especially to opioids, becomes a leading cause of death in the U.S., Nora Volkow, director of the National Institute on Drug Abuse (NIDA), is looking to Pharma to find a “vaccine” for drug addiction. Shouldn’t Volkow know, as head of the institute, there is no “cure” or vaccine for addiction—that it is is widely viewed as a physical, psychological and spiritual disease? Has she ever talked to Michael Botticelli, director of the White House Office of National Drug Control Policy, for example, who, as an addict himself, advocates non-drug, non-Pharma, peer treatment for addiction? (And shouldn’t NIDA replace “drug abuse” with the non-judgmental “addiction”?) \\nVolkow and Insel ‘s love of industry has also caused them to conduct disturbing animal experiments reminiscent of the noir researcher Henry Harlow. The medical establishment is increasingly reconsidering such invasive and unnecessarily cruel research. \\nTo stay a Wall Street darling, Pharma is gouging on drug prices, fleeing overseas and forming semi-secret partnerships with cyber giants. The public is appalled—and government is helping out. \\nMartha Rosenberg is a freelance journalist and the author of the highly acclaimed “Born With A Junk Food Deficiency: How Flaks, Quacks and Hacks Pimp The Public Health,” published by Prometheus Books. Check her Facebook page. This entry was posted in Commentary , Health . Bookmark the permalink .'"}, "time": 1742628541.920992}