{"duration": 0.15216827392578125, "input_args": {"text": "'Assad: US waging proxy war in Syria against Russia & Iran 11/03/2016 \\nBLACKLISTEDNEWS.COM Despite claiming humanitarian motives, US actions in Syria are meant to undermine the power of Russia and Iran, with Washington trying to achieve this goal by directly supporting terrorists, Syrian President Bashar Assad has said. The US’ secret collaboration with terrorists is the reason why all attempts at a ceasefire and political transition in Syria have so far failed, the Syrian leader told Serbian newspaper Politika. The interview was also published by the Syria’s SANA news agency.\\n“Supporting the terrorists is a war of attrition against Syria, against Iran, against Russia, that’s how they look at it. That’s why not only this ceasefire – every attempt regarding ceasefire or political moving or political initiative, every failure of these things, the United States was to blame,” the Syrian president said. \\nAssad was referring to the deal negotiated by the US and Russia in September, which it was hoped would pave the way for a lasting truce in Syria. In practice, the agreement was derailed by armed groups, which had rejected it from the very beginning. The US pledged to convince the so-called moderate opposition to stick to the bargain and separate from terrorists, who would then be legitimate targets for a joint Russian-American air campaign. Washington didn’t deliver on this promise, however. \\nAccording to the Syrian president, a lasting ceasefire was not what Washington sought from the deal in the first place. \\n“They always ask for ceasefire only when the terrorists are in a bad situation, not for the civilians. And they try to use those ceasefires in order to support the terrorists, bring them logistic support, armament, money, everything, in order to re-attack and to become stronger again,” he said. \\nSometimes the US support for terrorist groups goes through its allies such as Turkey, Saudi Arabia and Qatar, Assad believes, while occasionally they provide direct support even to Islamic State (IS, formerly ISIS/ISIL), a group that the Washington-led coalition was supposedly formed to defeat. An example of this came during an American attack on Syrian Army troops near Deir Ez-Zor, which happened while the US-Russian truce was in force, and which the US claimed was the result of a mistake. \\n“They attacked a very big area. They didn’t attack a building to say, ‘we made a mistake.’ They attacked three big hills, not other groups neighboring these hills,” he said. “In less than one hour, ISIS attacked those hills. It means that ISIS gathered their forces to attack those hills. How did ISIS know that the Americans would attack that Syrian position? It means they were ready, they were prepared.” \\nHumanitarian mask, like in Yugoslavia, Afghanistan or Iraq Western media are currently focusing on civilian suffering in Syria and alleged atrocities committed by the Syrian government and its allies to justify deeper involvement in the war by whatever means the White House chooses, Assad said in the interview. \\n“You have a black-and-white picture; very, very bad guy against very, very good guy. It’s like the narrative of George W. Bush during the war on Iraq and on Afghanistan,” he described. \\n“The war in your country has been portrayed in the same way; as a humanitarian war where the West wanted to intervene in order to protect a certain community against the aggressors from the other community,” Assad said, referring to the Balkan Wars and the partitioning of Yugoslavia. “So, many people in the world believe that story, the same in Syria; they use the same mask, the humanitarian mask.” \\nWhile stressing any wrongdoing on the part of the government forces, the West ignores whatever atrocities the opposition commits, the president said. \\n“The terrorists killed during the last three days more than 80 innocent civilians in Aleppo, and wounded more than 300. You don’t read anything about them in the Western mainstream media,” he said. “They only single out some pictures and some incidents in the area under the control of the terrorists just to use them for their political agenda in order to condemn and to blame the Syrian government, not because they are worried about the Syrians.” \\n“They don’t care about our children, or about innocents, and about civilization, about infrastructure,” he added. “But actually, they only care about using everything that would serve their vested interests.” \\nThe Syrian president doesn’t expect the US approach to Syria to change, regardless of who wins the presidential election next week, he told the newspaper. Both Hillary Clinton and Donald Trump would be bad for his country, he said. \\n“We don’t see any good signs that the United States is going to change dramatically its policy toward what’s happening in the world… or to obey the international law, or to care about the United Nation’s Charter,” he said. \\n“It’s not about who’s going to be president; the difference will be very minimal, each one of them is going to be allowed to leave his own fingerprint, just personal fingerprint, but doesn’t mean change of policies. That’s why we don’t pin our hopes, we don’t waste our time with it.” \\nA year without interference to stop war Assad reiterated his assessment that if Syria were left to settle its problems without foreign interference, it would take it no more than a year to end the conflict, saying that “it is not very complicated internally.” \\n“Of course, that looks not realistic, because everybody knows that the United States wanted to undermine the position of Russia as a great power in the world, including in Syria. Saudi Arabia has been looking how to destroy Iran for years now, and Syria could be one of the places where they can achieve that, according to their way of thinking,” he said. \\n“But if we say that we could achieve that situation where all those foreign powers leave Syria alone, we don’t have a problem in solving our problem.” \\nThe president said Syria has existed as a multiethnic multiconfessional entity for centuries and has significant experience in overcoming differences. \\n“Without all different colors of the society – Christians, Muslims, and the different sects and ethnicities – you won’t have Syria. So, every Syrian citizen should feel fully free in practicing his rituals, his traditions, his beliefs. He should be free in order to have a stable country. Otherwise you won’t have Syria as a stable country,” Assad said. \\nThe war has been a huge ordeal for Syrian society, but it has made Syrians as a nation more united, not less, he added. \\n“Many Syrians before the war didn’t tell the difference between being fanatic and being extremist, between being extremist and being terrorist. Those borders weren’t clear for many,” the president said. “Because of the war, because of the destruction, because of the heavy price that affected every Syrian, many Syrians learned the lesson and now they know that the only way to protect the country and to preserve the country is to be homogenous, to live with each other, to integrate, to accept, to love each other.” \\n“That’s why I think the effect of the war, in spite of all the bad aspects of any war like this war, but this aspect was positive for the Syrian society. So, I’m not worried about the structure of Syrian society after the war. I think it’s going to be healthier,” Assad added.'"}, "time": 1742563811.333989}