{"duration": 0.0848076343536377, "input_args": {"text": "'Farm owner arrested for protesting Dakota Access Pipeline\\'s theft of her land \\n  Vicki Batts Tags: eminent domain , Dakota Access Pipeline , civil liberties (NaturalNews) There have been countless stories across the web that have documented those struggling to fight against the Dakota Access Pipeline. Native Americans, farmers, ranchers, landowners and environmental activists have joined together to oppose the pipeline and bring the project to a grinding halt.Just recently, 127 Native American activists were arrested at a construction site near the Standing Rock Sioux reservation in North Dakota. Despite the corporate media\\'s attempts to suppress information surrounding the controversial pipeline, concerns about the Dakota Access project have become increasingly visible.However, one issue has remained in the dark: the government\\'s abuse of eminent domain.Eminent domain is what gives the government the right to seize private, law-abiding citizens\\' properties for public use. Normally this means a road, a school or another public structure that will be used by the citizens of a town or which in some way serves them. However, the government can also seize private land if they can prove that it will provide some sort of \"public good.\" This loophole – and yes, it is a loophole – has allowed our government to steal land from taxpayers for years, and then give it to a private citizen or company. Such is the case with the Dakota Access Pipeline.This pipeline is not a public project; it is being conducted by a private company that will profit off their endeavors. And yet, in spite of all the land that will be destroyed and the people whose lives will be disrupted by this project, the government has still seen fit to steal land and give it to the pipeline\\'s creators under the guise of \"public good.\"In Iowa, a major conflict between farmers and the government has broken out. You see, the state government is trying to take their land, and consequently, their livelihoods, to make way for the pipeline .The state\\'s decision to hand over land owned by farmers to the Dakota Access LLC has been met with quite a lot of opposition – as it should have. Just last week, Calhoun County farmer Cyndy Coppola was arrested on her own property for protesting the government\\'s usurpation of her own land .Apparently, they expected farmers to idly sit back and watch them steal what they worked so hard for.Cyndy Coppola\\'s arrest has been ignored by the mainstream media, probably because it doesn\\'t align with their narrative that Big Government knows best. An injurious move at best, her arrest highlights everything wrong with the way our government is being run.The theft of privately owned land simply cannot be ignored any longer – it is unconstitutional for the government to give a tax-paying citizen\\'s land to a multi-billion dollar energy company so that they can make even more money. And it won\\'t just be the oil and gas companies that profit off this disgusting display of government; dozens of big banks and investment firms will also be taking home a piece of the pie. Food and Water Watch reported in September than 17 financial institutions loaned Dakota Access LLC a whopping $2.5 billion to launch their project. They noted that banks have also given a substantial number of resources to the Energy Transfer Family of companies, such as billion-dollar credit lines and revolving credits. In total, a staggering 38 banks have given this corporation over $10 billion in loans and credits.How many of those banks do you think have ties to our government? Goldman Sachs is on the list, as are several other infamous industry names.If you think the pipeline is being constructed to better our country, you\\'re wrong. It\\'s being constructed to make money for a group of elitist corporations – and they plan on taking down anyone and anything that stands in their way. Sources:'"}, "time": 1742561727.9493542}