{"duration": 0.04778480529785156, "input_args": {"text": "'Kara McCullough made the Miss USA pageant great again —  just not in the way the contest’s organizers intended. [Twenty months after Donald Trump sold the contest to   the pageant made every effort to separate itself from its former owner —  a move not lost on the media covering the event. The Associated Press, for instance, reported: “The pageant included a field of five new immigrants who spoke on air about the importance of diversity  —   as if to refute US President Donald Trump’s less than welcoming stand toward some immigrants and refugees. ”  McCullough, an   born in Italy, looked the part but refused to play it this weekend. Miss D. C. rejected feminism for equality. “So as a woman scientist in the government, I’d like to lately transpose the word ‘feminism’ to ‘equalism,’” she explained. “I don’t really want to consider myself  —   try not to consider myself like this   you know, like, ‘Oh, I don’t really care about men.’ But one thing I’m going to say, though, is women, we are just as equal as men when it comes to opportunity in the workplace. ” She further ran afoul of the politically correct when she described health care as an earned “privilege” rather than an awarded “right. ” She told her questioners, “I’m definitely going to say it’s a privilege. As a government employee, I am granted health care. And I see firsthand that for one to have health care, you need to have jobs. ” She won the judges but lost the judgmental. Calling the   Miss USA’s answers “dumb” and “ill informed,” the appropriately named Linda Stasi of the New York Daily News charged that “McCullough did all women a disservice with her remarks on healthcare, but she did more damage with her dismissal of feminism. ” Other cultural commissars carped. It’s incredibly sad that in 2017, a woman is striving to occupy a position of influence   no understanding of what feminism is. #MissUSA,  —   courtney (@seecourttweet) May 15, 2017,  Dear #kara mccullough You are sadly mistaken. Everyone has a right to healthcare. Maybe you should be stripped of yours. The ACA helps many!  —   Kizzy (@TrulyKizzo) May 15, 2017,  Happy to see a woman of color crowned Miss USA two years in a row, but Kara McCullough has some problematic views on healthcare and feminism,  —   mama cass (@_femalien) May 15, 2017,  It’s a beauty pageant. The job requirements don’t call for a nuclear scientist. But it helps that Miss USA works a nuclear scientist.'"}, "time": 1742561701.1374254}