{"duration": 0.07091760635375977, "input_args": {"text": "'at 4:08 pm 1 Comment \\nWith the neither the racist nor the Putin-puppet label sticking to Trump, team Clinton and its lobotomized surrogates have regressed back to square one: playing the woman card . \\nAs I noted in a post earlier this week, a professor of linguistics at Berkeley just published an article at Time claiming (with zero evidence of course), that the Hillary Clinton email server scandal only exists because she is a woman. Here’s a brief snippet of what she said: \\n‘It’s not about emails; it’s about public communication by a woman’ \\nI am mad. I am mad because I am scared. And if you are a woman, you should be, too. Emailgate is a bitch hunt, but the target is not Hillary Clinton. It’s us. \\nThe only reason the whole email flap has legs is because the candidate is female. Can you imagine this happening to a man? Clinton is guilty of SWF (Speaking While Female), and emailgate is just a reminder to us all that she has no business doing what she’s doing and must be punished, for the sake of all decent women everywhere. There is so much of that going around. \\nIt’s not about emails; it’s about public communication by a woman in general. Of course, in the year 2016, no one (probably not even The Donald) could make this argument explicitly. After all, he and his fellow Republicans are not waging a war on women. How do we know that? They have said so. And they’re men, so they must be telling the truth. \\nI know. It’s really hard to believe the above is real, but it is. \\nMoving along, President Obama himself is now getting in the mud. \\nHere’s what he had to say today in Ohio, according to NBC : \\nCOLUMBUS, Ohio — President Barack Obama said Tuesday that sexism is to blame for the tight race for the White House, telling an Ohio crowd that “Hillary Clinton is consistently treated differently than just about any other candidate I see out there.” \\nObama went on: “There’s a reason we haven’t had a woman president.” \\nSpeaking specifically to “the guys out there,” Obama told them to “look inside yourself and ask yourself, if you’re having problems with this stuff how much of it is that we’re just not used to it?” \\nYep, because the American public handily elected a black man twice, but somehow we all draw the line at a woman. Perhaps, just perhaps, the problem is with Hillary. \\nMoving along, all this reminded me of a very prescient comment made by Glenn Greenwald a couple of years ago, which I highlighted in the post, Glenn Greenwald on the 2016 Elections – “They’ll Probably Have a Gay Person After Hillary” : \\nHillary is banal, corrupted, drained of vibrancy and passion. I mean, she’s been around forever, the Clinton circle. She’s a fucking hawk and like a neocon, practically. She’s surrounded by all these sleazy money types who are just corrupting everything everywhere. But she’s going to be the first female president, and women in America are going to be completely invested in her candidacy. Opposition to her is going to be depicted as misogynistic, like opposition to Obama has been depicted as racist. It’s going to be this completely symbolic messaging that’s going to overshadow the fact that she’ll do nothing but continue everything in pursuit of her own power. They’ll probably have a gay person after Hillary who’s just going to do the same thing. \\nObama could’ve gone out on a high note, but he decided to go low. \\nSad!'"}, "time": 1742628305.292838}