{"duration": 0.0315556526184082, "input_args": {"text": "'USA Today reports: \\nAoun, 81, is an ally of Hezbollah, the Shiite militia and political party backed by Iran that has helped Syrian President Bashar Assad survive a five-year civil war on Lebanon’s border. \\nThe vote for Aoun, by 83 of parliament’s 127 members, shows Iran-backed political factions shouldered past those aligned with Saudi Arabia, replacing Syria as Lebanon’s chief foreign power broker. \\nAoun’s “victory now is a victory for Hezbollah and that alliance, and certainly a kind of black eye for Saudi Arabia,” said Paul Salem, vice president for policy and research at the Middle East Institute, a think tank in Washington, D.C. \\nSaad Hariri, a pro-Western and Saudi-oriented politician, formally endorsed Aoun last week after failing to garner enough support for the presidency. In return, Aoun is expected to appoint Hariri prime minister. \\n“It’s a power-sharing system,” Salem said. “In a way, the status quo will continue.” \\nU.S. State Department spokesman John Kirby congratulated Lebanon on the election results. \\n“This is a moment of opportunity, as Lebanon emerges from years of political impasse, to restore government functions and build a more stable and prosperous future for all Lebanese citizens,” he said in a statement. \\nAsked later about Aoun’s support from Hezbollah, which the State Department has designated a terrorist organization, Kirby said: “Let’ see what decisions he makes, what kind of leadership he exudes as president.” \\nThe U.S. routinely assesses its foreign assistance programs “and we will do that with Lebanon going forward,” Kirby said at a press briefing. \\nAoun’s election drew immediate praise from a top adviser to Iran’s supreme leader Ali Khamenei. \\nThe adviser, Ali Akbar Velayati, described the choice as a victory for Iran and its allies in Lebanon, because the Lebanese president is “a very significant ring in the chain of the Islamic resistance,” according to Iran’s government-owned Tasnim News Agency. \\nAoun, in his first speech after becoming president, pledged to fight corruption and protect Lebanon from the fires raging around it, referring to the Syrian civil war, according to the Associated Press. He also promised to liberate contested territory under “Israeli occupation,” according to Hezbollah’s Al Manar-TV, apparently referring to territory Israel considers part of the Golan Heights, which it conquered from Syria during the 1967 war. Saad Hariri and Michel Aoun \\nLebanon has been without a head of state since May 2014, when then-president Michel Suleiman’s six-year term expired. Since then, 45 sessions to elect a new leader have failed because of political infighting, the AP reported. Hezbollah leader Nasrallah and Michel Aoun'"}, "time": 1742564324.5274212}