{"duration": 0.0831308364868164, "input_args": {"text": "'A group of leftist activists wearing pink pussy hats disrupted a Christian opening prayer at Rep. Jack Bergman’s ( ) Thursday evening town hall in Gaylord, Michigan, shouting, “Separation of church and state!” as other constituents stood with their heads bowed in respect. [Dr. Derek Hagland, the assistant pastor at Grace Baptist Church in Michigan’s First District, had just taken the stage to recite an invocation when activists began chanting, “Separation of church and state!” to disrupt him:   “This guy was giving invocation,” Rep. Bergman’s communication director Farahn Morgan told Breitbart News. “He was not necessarily party affiliated in any way. That kind of reaction to him? It was the most aggressive that the crowd got during the entire event which was, quite honestly, shocking. ” She added that it was surprising that these activists refused “to engage in dialogue after months of demanding there be a dialogue. The display was upsetting for the constituents who attended and really wanted to participate in a dialogue and hear what the congressman thinks and share their thoughts with him in a constructive way. The activists’ behavior flew in the face of any constructive dialogue. ” She described the incident as “a coordinated fiasco. ” Video footage of the event, provided to Breitbart News by an attendee, showed some Republicans and community leaders standing with their heads bowed during the prayer, despite the disruptive chants. Some of the activists wore pink pussy hats, the same ones donned as a symbol of “resistance” during   Donald Trump protests across the nation following his inauguration:  Morgan also noted that the interruption did not sit well with some of Rep. Bergman’s Democrat constituents. “A lot of Democrats approached us tonight and said they were embarrassed and apologized. They said those activists did not represent them or what they are about. I thought that was an interesting dynamic. ” Bergman, a retired   general who served in the Marine Corps, also held a town hall on Wednesday evening:  “Last night, the crowd was certainly more orderly,” Morgan said. She added that there was also a prayer recited Wednesday evening, “but local media live streamed last night’s event and many local groups watched it and planned how to react to tonight’s town hall. ” She said the group Indivisible was most likely one of the main groups involved in the disruption. Morgan said Congressman Bergman felt “disappointed” by the display. Several hours earlier, he had tweeted his enthusiasm about holding constructive dialogue: Gaylord town hall is just starting! Looking forward to some constructive dialogue. pic. twitter.   —   Rep. Jack Bergman (@RepJackBergman) April 20, 2017,  “As a Christian, his faith definitely factors into his decision making. He also says the Constitution is ultimately the sort of guide and document that elected members of Congress have to abide by,” Morgan said. “He’s incredibly transparent about faith being an important part of his life. His faith is unequivocally what guides him, and he’s not apologetic about that at all. ” Recently, Rep. Bergman said, “We learned from England that mandated religion was not a good idea, and so we don’t mandate religion. ” Bergman, who serves on the Budget Committee, the Natural Resources Committee, and the Veterans Affairs Committee, was reportedly one of 54 freshmen congressmen to sign a letter agreeing to argue political issues without attacking those with whom he disagrees. According to the Traverse City Record Eagle, “He called the letter the hallmark of the House’s freshman class, plans on bringing that kind of civil discourse to his town halls and expects attendees to ‘treat adults like adults. ’” Follow Adelle Nazarian on Facebook and Twitter.'"}, "time": 1742564305.125029}