{"duration": 0.03493309020996094, "input_args": {"text": "'Conservative firebrand Ann Coulter had a tweet linking to a recent article flagged as “hate speech” by Twitter. [Ann Coulter posted a link to a recent article on her website titled “To Say, ‘Stop Raping Me!’ In English, Press ‘1’ Now” on Twitter earlier this week. She added the comment, “Liberals are all for rape, provided that the penis forcibly inserted in you is attached to an illegal immigrant. ”  Liberals are all for rape, provided that the penis forcibly inserted in you is attached to an illegal immigrant.  https:  .   —   Ann Coulter (@AnnCoulter) May 10, 2017,  Coulter said she received an email from Twitter support informing her that the tweet had been flagged as violating Twitter’s hateful conduct policy. Twitter’s policy defines hateful conduct as: Coulter replied to the complaint by stating, “This warning is absolutely in error! It has obviously been generated by a computer because a human would read the linked column and find the proof that this tweet is completely, 100% truthful  —   fact by fact, in    cases. It is not a joke, not ‘hate,’ it is just the truth. ” Twitter has a lengthy history of ignoring “hate speech” when it comes from those on the left, such as Ghostbusters (2016) actress Leslie Jones or rapper Talib Kweli, who called Breitbart News’ Jerome Hudson a “coon,” yet Coulter’s tweet was quickly flagged by the social media platform. Twitter’s warning email also noted, “if it is determined that the flagged content does not violate our hateful conduct policy, Twitter may still withhold content in Germany if the content appears to violate the laws of Germany. ” In April, Germany’s Cabinet approved a bill that would fine social media sites like Twitter up to 50 million euros “if they fail to swiftly remove illegal content such as hate speech. ” Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan_ or email him at lnolan@breitbart. com'"}, "time": 1742563789.0482147}