{"duration": 0.0516963005065918, "input_args": {"text": "'When I watch Donald Trump, I sometimes feel like Ingrid Bergman  —   not European and glamorous, but unnerved, as though I’m being gaslit, as in the famous plot of her old classic movie “Gaslight. ” The lights are flickering, but her character’s husband, who is secretly a seriously bad dude, is convincing her that no such thing is occurring. He is trying to get her to question her sense of reality, to think her mind is playing tricks on her  —   in short, to convince her that she is going slightly crazy, a tactic that can be scarily effective. Trump’s compulsive lies are a   fact of the campaign at this point, but I still questioned my own reality for a moment on Monday night whenever he fudged the truth  —   as when he implied that by saying Hillary Clinton did not have the presidential look, he meant she did not have the “stamina” (this is a lot like his saying that when he insulted Carly Fiorina’s face, he really meant her “persona”). I’d already seen a clip of him in which he goes after Clinton’s lack of a presidential look, specifically  —   but even so, I had that normal human response, a bit of  . Maybe it was taken out of context? I went back and looked  —   nope, there he is back in September, telling ABC’s David Muir, “I just don’t think she has a presidential look, and you need a presidential look. ” Trump tries to gaslight an entire country when he plays fast and loose with the truth or insists on   connections  —   each of which is an apt tactic for someone who often questions the mental health of women who dare to criticize him. If they are women with big careers, like Maureen Dowd, Mika Brzezinski and Debbie Wasserman Schultz, they are “neurotic. ” He called the Rev. Faith Green Timmons, a pastor who calmly and boldly interrupted him at her church in Flint, Mich. “nervous,” which is apparently the black woman’s (or   woman’s) version of neurotic. These women are not just wrong, to Trump they are suffering from a kind of mental or medical condition. “It’s organic, it’s biological,” the feminist writer Elaine Showalter, the author of “Hystories: Hysterical Epidemics and Modern Culture,” says. “It’s something that comes out of their gender  —   like whatever was coming out of Megyn Kelly. ” Women, he clearly believes, or wants us to believe, are emotional, guided by feelings rather than reason, which presumably makes them unfit to lead (or unfit to give Trump a hard time). All of this is why it was particularly interesting  —   subversive, even, in a   kind of way  —   to see Clinton say to Trump early in the debate, “Donald, I know you live in your own reality. ” She followed that up, not much later, with a laugh that led into: “Just join the debate by saying more crazy things. ” She seemed to hesitate before speaking that line it sounded about as spontaneous as her apparent new catchphrase “   . ” Planned or not, “crazy” was a clear provocation  —   it told us exactly how we were supposed to feel about the things Trump was saying. And it did something else. As anyone who has ever been gaslit knows, nothing drives a person more crazy than being told he  —   or usually she  —   is crazy. Trump performed as anticipated  —   you might even argue that the “crazy” line was a turning point in the debate. Soon after that, the lights started flickering. His already shaky syntax fell apart we had “a fed doing political things” labored digressions about how often he is audited, and how little he minds it mentions of a “big fat ugly bubble” and a “very   judge. ” Trump was leaning into the lectern, his face coloring and contorting even his sniffing seemed to pick up, not so much flulike as ticlike. What I would have given for Clinton to offer him a tissue. “Trump did one great thing,” the humor writer Paul Rudnick tweeted on Monday night. “He proved that men are overemotional, petty and silly creatures. ” Clinton came on stage dressed in a red flag she baited Trump, and he charged. Who had the more presidential look? The matador  —   or the bull? They say the camera never lies.'"}, "time": 1742628305.0239906}