{"duration": 0.11012721061706543, "input_args": {"text": "'It feels like almost every other week there is a new headline about Uber raising more money. “Uber Closes $1. 6 Billion in Financing. ’’ “Uber Turns to Saudi Arabia for $3. 5 Billion Cash Infusion. ’’ Last week, we got this one: “Uber to Raise Up to $2 Billion in   Market. ’’ If you add up all the money Uber has raised since it started in 2009  —   the idea was born when its founders became annoyed that they could not get a cab in Paris  —   the   app company is on its way to amassing a colossal $15 billion. That’s real cash, not some     valuation. (That figure is $68 billion.) It has done all this while still managing to remain a private company, and its chief executive, Travis Kalanick, has insisted that a public offering is not coming soon. “I’m going to make sure it happens as late as possible,” he has repeatedly said. Consider this: When Amazon went public in 1997, it raised $54 million and was valued at $438 million. So what exactly is Uber doing with all that money? And what does it say about Uber  —   and the financial markets  —   that the company has turned most recently to selling the equivalent of junk bonds? Yes, Uber has to finance an   war to gain market share in China and India. But there is more to it than that: Uber’s   is seemingly part of an unspoken strategy to mark its territory. Every time Uber raises another $1 billion, venture capital investors and others may find it less attractive to back one of Uber’s many rivals: Didi Chuxing, Lyft, Gett, Halo, Juno. In other words, Uber’s   efforts have seemingly become part of the contest: It’s not just a rivalry over customers and drivers it’s a war of attrition, a mad scramble to starve the competition of cash. At the moment, Uber’s success has had the opposite effect: It has spawned a long list of rivals, big and little guys who say, “We can do it too. ” But over time, as the smaller competitors run out of cash  —   after heavily subsidizing riders in an effort to steal business from Uber  —   venture capitalists should be less inclined to put up even more cash to go up against Fortress Uber. Uber’s   arms race comes against the backdrop of falling valuations for many Silicon Valley unicorns  —   private companies worth $1 billion or more. So there’s clearly a rush to take the money while it’s still available. “It’s not the second inning or even the sixth, it’s the 14th inning in a   baseball game,” Bill Gurley, the famed venture capitalist who has as a stake in Uber and sits on its board, warned on his blog about the state of Silicon Valley. He alerted investors about unicorns that come to them seeking funds: “You are not being invited to a special dance, you are being approached because you are the lender of last resort. ” The   industry has long been seen as a   game because of the “network effect”: The more customers sign up for Uber, the more drivers sign up, making it tougher for rivals to mount competition. There will most likely be only one or two significant players in any given market. (More on that in a moment, because there might be some cracks emerging in that point of view.) The question is whether the financing game is   too. And the even larger question is whether Uber’s   capital investments could ultimately act as a deterrent to investors who might consider supporting Uber’s competitors: Will they look at Uber’s balance sheet  —   it has some $6 billion in cash just sitting there  —   and throw up a white flag? So far, Uber is clearly winning the valuation game: It is worth more than virtually all of its rivals combined. But Uber still has formidable competition in the   arena: Didi, the market leader in China that is engaged in a   battle with Uber, just raised $7 billion,  some of which came from Apple. (Mr. Kalanick, too, was hoping to raise money from Apple and had planned to meet with executives at the iPhone maker the same week Apple announced its investment in Didi.) Perhaps strangely, several of the same investors that have backed Uber are also backing Didi in China, including BlackRock and Tiger Global, so it is hard to say that one service is deterring investment in the other  —   at least not yet. (It is worth noting that among the investor class, some may be hoping that Uber might one day merge its Chinese operation with Didi.) Uber’s most recent   effort  —   focused on the leveraged loan market  —   aims to avoid diluting the current base of shareholders. It has hired Morgan Stanley, Barclays, Goldman Sachs and Citigroup to sell about $2 billion in loans. By avoiding a traditional round of financing, the company also avoids the company having to risk trying to sell itself at an even higher valuation. Given the remarkably low interest rates, investors looking for yield may buy into Uber. Uber says it is profitable in North America, Europe, the Middle East, Africa and Australia  —   if you factor out taxes and interest payments. The challenge for Uber is breaking into China and India, perhaps the two largest markets in the world. Uber is currently on track to lose about $2 billion annually in those markets as it heavily subsidizes customers and drivers to gain market share. That means that Uber will have to pay up for the financing. But if Uber’s valuation continued to grow, it would be a bargain compared with the value of the equity. Uber is hoping to sell debt with a yield of about 4 or 4. 5 percent. Uber’s I. P. O. will probably come to pass in the next three to four years. That’s because some of the convertible debt it previously issued provides investors with a special discount if the company has not gone public by then. But by 2018 or 2019, at the rate Uber is going, who knows how much money Uber will have raised. It may need none. The question is whether it will have starved all of its competitors along the way.'"}, "time": 1742561924.7018929}