{"duration": 0.12198853492736816, "input_args": {"text": "'CARACAS, Venezuela  —   President Nicolás Maduro was chased at a routine political event by a crowd of angry protesters banging on pots and yelling that they were hungry, just days after thousands of Venezuelans took to the streets to call for his ouster, local news media reported on Saturday. Scenes from the confrontation late Friday, which also appeared in videos uploaded to social media, captured the attention of Venezuelans, many of whom blame the unpopular president for the country’s food shortages. In one video, Mr. Maduro tries to calm the   by walking among them, only to be surrounded as the furious crowd yells obscenities. “What is this?” an astounded voice behind the camera asks in one of the video clips. Mr. Maduro had traveled from the capital, Caracas, to Margarita Island off Venezuela’s northern coast to inaugurate a number of new public housing units and give a televised address. During the speech, he denounced his opponents’ calls for his removal from office, calling them “vampires” and saying they were preparing for violence. Foro Penal, a Venezuelan human rights group, said that 20 people had been arrested after the protest in the town of Villa Rosa on Margarita Island. Among those detained was Braulio Jatar, the director of a local news Web site called Reporte Confidencial, said the site, which had reported on protest against the president. Mr. Maduro’s office made no statement about the incident or the arrests. Venezuelan politicians wasted little time on Saturday in using the confrontation to advance their agendas. “The people of Villa Rosa in Margarita have no fear,” wrote Henrique Capriles, an opposition governor who lost to Mr. Maduro in the presidential election in 2013. “Through banging pots, Maduro was run out of town. ” Pedro Carvajalino, a   television anchorman, said the protesters had been sent by Mr. Capriles and other members of the opposition. “It was a lack of respect to presidential dignity,” Mr. Carvajalino said. On Thursday, Mr. Maduro’s political opponents organized a mass protest in the capital, a gathering they called “the taking of Caracas. ” It was the largest protest this year as many thousands descended on the capital from around the country, chanting, singing and venting frustration with the country’s chronic shortages, most critically of food. The organizers are trying to use rising anger against the president to propel an effort to recall him from office by means of a popular referendum. If the referendum happens this year and Mr. Maduro loses, Venezuelans will have the opportunity to elect a new president. But the government, which is responsible for organizing such a vote, wishes to hold it next year. If Mr. Maduro loses in 2017, the leftist vice president will serve what is left of his   term. Polls show that Mr. Maduro would be likely to lose a referendum. The confrontation in Villa Rosa suggests that the tide may have turned in an area that once supported the president. It voted for Mr. Maduro and his predecessor and mentor, Hugo Chávez, in previous elections by significant margins.'"}, "time": 1742563343.826094}