{"duration": 2.2561702728271484, "input_args": {"text": "'Home / BREAKING NEWS / BREAKING: Officer Charged for Killing Innocent Unarmed Father With His Hands Up on Video BREAKING: Officer Charged for Killing Innocent Unarmed Father With His Hands Up on Video \\nUPDATE: On Thursday afternoon, District Attorney Steve Kunzweiler directed his staff to file a first-degree manslaughter charge against Officer Betty Shelby in the fatal shooting of Terence Crutcher. According to the Tulsa World report: \\nA warrant has been issued for her arrest and arrangements made for her surrender. \\nKunzweiler filed the charge after reviewing dash cam video and helicopter video that captured the shooting. He also reviewed citizen 911 calls, witness interviews and other evidence, according to a news release from the District Attorney’s Office. \\n“Officer Shelby, although now charged, is presumed to be innocent under the law until a judge or jury determines otherwise,” the release states. \\nTulsa, OK — Tulsa Police Officer Betty Shelby fatally shot 40-year-old Terence Crutcher Friday night when he experienced car trouble after leaving night classes at Tulsa Community College — and now, dash cam video of the shooting shows the man’s arms were in the air when Shelby took his life. \\n“His hands were in the air from all views,” pastor Rodney Goss of the Morning Star Baptist Church, who viewed footage from both dash cams and a police helicopter prior to the public release, told the Tulsa World . “It was not apparent from any angle at any point he lunged, came toward, aggressively attacked, or made any sudden movements that would have been considered a threat or life-threatening toward the officer.” \\nPolice had thus far claimed Crutcher — whose SUV broke down in the middle of the road — approached the officers aggressively while refusing to obey commands to raise his arms, an action the helicopter pilot notes would perhaps be worthy of deploying the Taser. \\n“He’s got his hands up for her now,” the pilot says of Crutcher, adding a moment later the man appears uncooperative and may need to be tased. \\nOfficer Tyler Turnbough then deployed his Taser against Crutcher, but Shelby fired before the electric jolt could even knock him to the ground. Video from one patrol car’s dash can and that as seen from a police helicopter circling above clearly shows Crutcher not acting aggressively as the cops surround and then murder him. \\n“It wasn’t a matter of minutes, it was a matter of moments,” Goss noted. “As quick as the officer released the Taser from his hand, Terence was falling to the ground having already been shot.” \\nWorse, he explained, the officers seemed not to treat their victim with any concern, and made no moves to provide first aid after the tasing and shooting. \\n“After having been shot, a couple minutes it appears, but it seemed like a lifetime, went by before anyone actually checked with him as far as pulse — as far as whatever the case may be,” Goss said. \\nPolice on scene indeed appear infinitely more concerned with the panicked Shelby than they do with the man they just shot for no apparent reason, and footage bears out Goss’ statement it takes minutes for officers even to approach the dying man. As Crutcher lies mortally wounded on the ground, officers back away like frightened children, supporting Shelby by the arms. As the helicopter circles overhead, audio of the pilot shows he is quite startled by the inexplicable shooting. \\nGoss explained to the World that Crutcher moved slowly and deliberately throughout his brief interaction with the police. \\nBut the cops’ predilection to employ force might have been a forgone conclusion, as he said, one officer is overheard in audio inexplicably describing Crutcher — the father of four, who was taking a night class in music appreciation — as “one bad dude.” \\nAs Goss plainly summarized , “There was a perception problem before there was ever a shooting.” \\nAlthough authorities had refused to say whether or not a weapon was recovered at the scene, Crutcher’s twin sister, Tiffany insists her brother would not have been armed. \\n“One fact I do know is that my brother was unarmed,” she asserted in a news conference Saturday. “I’m just devastated.” \\nIn a press conference prior to the release of the video he called “very disturbing” and “hard to watch,” Tulsa Police Chief Chuck Jordan finally confirmed, “I’m going to tell you right now, right now, there was no gun on the suspect or in the suspect’s vehicle.” \\nCrutcher’s family, their attorneys, local pastors, and several activists were permitted to view the footage before police released it to the public. \\n“We wanted them to see it before it was released so they wouldn’t be blindsided by it,” Tulsa Police Sgt. Shane Tuell confirmed, according to ABC News . “We wanted to be able to have that intimate time with them, with their attorney, to see if they had any questions or concerns. \\n“With something of this magnitude, we’re trying an approach that we believe is necessary to further that transparency.” \\nShelby, on the force since 2011, and Turnbough, an officer since 2009 — who were named by police on Sunday — encountered Crutcher’s stalled SUV as they were responding to another call. Both have been given the paid vacation, otherwise known as administrative leave, customarily ‘rewarded’ after the use of fatal force. \\n“We have to let justice take its course,” Goss said prior to the announcement the Department of Justice would conduct an investigation into the fatal shooting. \\nActivists gathered outside the Tulsa County Courthouse to protest the killing of Crutcher and the ballooning epidemic of police violence, while community leaders urged the public to remain calm upon release of footage. \\n“Protests are not a problem,” Chief Jordan told the press. “I grew up in the 60s and it’s a very valid way of people to protect their rights.” \\nWhether calm and justice will ultimately prevail hinges on whether or not Shelby receives proportionate punishment for taking the life of a wholly and utterly innocent man whose only crime — apparently a capital offense — was having car trouble at an inopportune moment. \\nThis is what complying with police in America looks like. [ Editor’s note: While it was originally reported by multiple sources Terence Crutcher was a pastor , we have yet to confirm that information and have corrected the article to reflect this.] Share \\ni wonder what that cop dropped? Tom Harder \\nHe didn’t drop anything. That was the suspect hitting the ground. Steve Smith \\nfunny how you call the victim a suspect and not a PASTOR Antonio Cruz \\npastor or not, it remain a suspect, until the end of the investigation. grapesodabanked \\nSuspect of what? He was just a random guy whose car broke down and they ran into him on their way to another call. Antonio Cruz \\ni do not know, what he is suspect of, I do know, in legal matters, is just a denomination for anyone, in any circunstance anywhere. Sillywilly \\nso if your wife or your child breaks down on the side of the road they’re suspect of something huh? Antonio Cruz \\nthe answer is; yes anyone anywhere could be a suspect. Sevalo \\nSo, in your mind, inhaling and exhaling makes one a suspect. Antonio Cruz \\nPlease, for your own good, find a dictionary search for the word and then, come back, right now I am just wasting my time trying to make you understand, it is about semantics. Sevalo \\nFrom your posts that are filled with bad grammar and spelling errors, I suggest you consult not only your dictionary but also William Strunk’s The Elements of Style. Antonio Cruz \\nit might be because, english is not my first language, and my disability includes parcial hand movement and aphasia. in your case is just, the inability to understand your own language. Luke Yi \\nIf you are not familiar with terminology in English perhaps you ought neither correct others’ English, nor weigh in about the legal validity of certain language. \\nLawyers are experts in a very particular language. Luke Yi \\n“person thought to be guilty of a crime or offense” \\nNice try but you ought to learn to use the dictionary yourself Sillywilly \\nsuspect of what?? Having car trouble? billdeserthills \\nYou must know cops refer to themselves as Us and they refer to us as Them–they lump anybody else with the criminals just like the bunch of stupid gang members they resemble Sillywilly \\nnow that I can agree with BigJohnConnor \\nThe answer is that you are a fucking moron who has no concept of the law or what it means to be a free citizen. Luke Yi \\n“Could be” is distinct from “is” Jordan Manicom \\nHe was only a “suspect” to an assembly of fools. Steve Smith \\nHis morality when he joined the force. Butch Taylor \\nClearing Shelby and Turnbough of any wrong doing is promising to be the white wash cover up of all time. supersajin \\nLooks like paid vacation and a GoFundMe page is in those cops future… TroothFairy \\nDeath penalty for cops who pull shit like this. Reaves \\nWe can start by comparing whatever initial statement they gave to the videos we have. If an officer is intentionally deceptive, that should be a felony in its own right. TroothFairy \\nCompletely agree. Cops need to be held to a much higher standard than ordinary citizens. d marino \\nThey aren’t being held to ANY damn standard in today’s society. They are literally “getting away with murder”. billdeserthills \\nMuch like our politicians, they both break their oath of office all the time Jan Miller Saylors \\nI think some of the above comments would certainly apply to Hillary Clinton,talk about above the law……There is no excuse to shoot an unarmed person with his hands up in the air,that is cooperating with the officer. Kevin Rogers \\nBut he wasn’t cooperating with the officer… Officers don’t follow you to your vehicle when they feel threatened, they tell you to get on the ground. Christopher Pacella \\nthey are they take a oath and there word in a court of law means more then yours d marino \\nThey lie, a lot, even in court. Just like our high officials lie in court and nothing happens to the criminals of power (the cops, the lawyers, the Congressmen, the Judges, the President, etc.). edslides \\nYE and that is NOT discrimination. its called respect. it is expected of citizens, BUT doubly so, righteously so, for a man that swears an oath to uphold the law. accident? accidents have consequences. I kill a guy, i go to jail, period. read a few of your comments lately tooth fairy. you head is bolted on solid. it nauseates me how the cop had more compassion for the stupid fucking cunt that killed an innocent man that he/she/they had for the man they just shot. i AM SO FUCKING PISSED. David Hall \\nI am too, it just makes me want to puke. The sight of all the pussies cuddling up to the cunt that just murdered a man is beyond fucking words. All they cared about was her. The man is dying and they don’t give a fuck. And the low life scumbags wobder why America is against them and wants to kill all of them, every day we see why. This one takes it to a new low, even for the POS cowards and bullies. It really just makes me so fucking mad I could kill all of them POS and never lose a nights sleep. I used to wonder why guys would say when a cop was killed, good riddance…now I know why! What the fuck is the matter with the low IQ POS cops in the U.S. Thank God I don’t live in America. They have a real problem. soulshadow55 \\nDavid, I totally agree with you. Just out of curiosity, what country do you live in? Lliss \\nSpoken by a guy who’s been arrested several times! lol Reinhold Von Kirschmann \\nShe was charged with murder. Where’s your big mouth now? Point \\nHmm… You sound like someone who would definitely leave a dying person unhelped – possibly even cause a person to die in the first place. Which makes essentially indistinguishable from the subjects your essay. Luke Yi \\nThat’s not a very careful reading of the text, or the subtext, of david hall’s comment Point \\nI’m not certain there is much subtext to read from Mr. Hall’s post; I take his post as his pure and unadulterated feelings. He states the following: \\n“It really just makes me so fucking mad I could kill all of them POS and never lose a nights sleep.” \\nIf I ever deliberately caused harm to a person, I know I’d never have a proper night’s sleep again. The idea that Mr. Hall would feel good about the killings of multiple people – let alone his own proposal to do it himself – seems to me precisely the mindset that supports the continued killing of people. Justsomeguy151 \\nIt’s called justice, that’s why you hate it. Point \\nOh, that’s justice? Please, tell me more about your beliefs or opinions regarding justice. I am eager to hear them. \\nIt sounds suspiciously though, that if we all agreed to follow your concept of “justice,” that we would end up with one, solitary, very sad person. The last person, and the only one to actually experience this “justice.” And frankly, the only reason he’s left is because there’s no one left to blow his brains out. Luke Yi \\nI think that was david halls point by the way–that this cycle of violence, which is being perpetrated in part under the auspices of the law, is leaving families bereaved, helpless, hopeless, sad, and alone. \\nI myself feel this disconnection. I would rather it were any other way. \\nBut people, especially it seems white evangelicals, support “an eye for an eye” rather than the love and forgiveness suggested by the black families of the black victims at Emanuel African Methodist Episcopal Church who were murdered by a white supremacist. Jan Honeycutt \\nNo one in my church supports that the goes against the Bible. Luke Yi \\nI didn’t say anything about your church, Jan. I didn’t say anything about all Christians or all white people or all evangelicals. I said something that is true: some Christians advocate an eye for an eye. billdeserthills \\nThat ‘eye for an eye’ stuff is from the Torah–You need to figure out which bunch of people you are trying to c rap on sonny boy Luke Yi \\nIt’s in “Exodus” in the King James Bible. \\nNo one needs you to reinterpret my words \\nBut lies, distortions, and ad hominem as are par for the course aren’t you? Justsomeguy151 \\nEasy, hypocritical POS. You think thee should be zero consequences for pigs murdering civilians for nothing but if pigs got their traitorous heads blown off for murder, THEN its justice. get it, POS? Point \\nI see. So to you, justice is blowing peoples’ heads off? \\nI guess if either of us want to see justice in action, we’re going to have to go somewhere like China. I hear there is lots of justice there. Luke Yi \\nHe stated pretty clearly he’s upset by the situation. He employs the subjunctive tense rather than future tense to indicate a hypothetical. \\nAs I said you’re not reading text or subtext carefully. Subtext requires understanding the background, or where the author is arriving at this point from. \\nDavid never said he was going to kill someone; he said he’s upset. \\nOr perhaps you’re the kind of person who, when you say “I could just kill my brother for doing that!” is actually considering killing him. Justsomeguy151 \\nYou must be fucking stupid to think that. Point \\nWell then I guess you’re right, and I must be fucking stupid. \\nGreat chat, though. \\nI feel the same way, so glad to hear of your impending departure billdeserthills \\nI disagree, you aren’t related to a cop are you? Point \\nNo, I’m not. Should it make a difference? billdeserthills \\nI don’t wanna be calling you a copsucker, if you aren’t one Point \\nWell… I’m a scientist, so I guess I’d be a sciencesucker. \\nMeanwhile, I’ve made my viewpoints pretty clear in this thread. You’ve reviewed it pretty carefully already, since you’ve replied to several of my comments individually. \\nI suggest that we can talk about the ideas I’ve been representing (which are very interesting), or me (which is considerably less interesting) – but the topics are quite separate. Which would you prefer to discuss? billdeserthills \\nYou just done sucked the fun right outta this thread Point \\nA draw, then? \\nWho knows, if our viewpoints are so divergent, perhaps we can look forward to another go at it some other time. billdeserthills \\nYou for or against a man’s right to Demand Satisfaction? Point \\nAn interesting question: but I don’t know what you mean by “demanding satisfaction.” If it means you get to kill someone’s son because they killed your son, then no. I am against that. If satisfaction means that someone who harms or kills another person must answer for that in a court of law, then I am for it. \\nI would also like to know, if it is a right, where that right is documented? The only rights that I am aware that I have come from my U.S. citizenship, and are bestowed by the U.S. Constitution and the tributaries of law that emanate from it. When I travel outside my country, I’m no longer protected by my constitution. \\nI also believe strongly in the U.N.’s Universal Declaration of Human Rights (Paris, 1948). While it is not a document with legal status, it serves to guide a fragmented and contentious world stage towards recognizing and acknowledging a series of “fundamental rights”– an ideal towards which we can strive. \\nOne thing I do know: one does not have a “right” to something just because they claim it’s their “right.” I’m betting that people misunderstanding what their rights are – and are not – is a component in many examples of the continuing violence and contention between people now. Luke Yi \\nThose rights are actually not considered by the constitution or our founders to originate with the document or their ideas. \\nThe founders considered these to be natural rights, endowed to us merely by our existence. \\nOf course, they thought only wealthy white males were actually human adults, and everyone else was an object for use, including women, children, and other races. billdeserthills \\nLawyers seem to have made off with my right to ‘demand satisfaction’ then Point \\n…or, you never had such a right in the first place, and you simply invented it. billdeserthills \\nThe Right to Demand Satisfaction did exist at one time, it seems to have ended in the late 1800’s or early 1900’s as a so-called scientist I am surprised you never heard of it– I hope you don’t also think dueling pistols are something I made up as well, mr so-called fancypants scientist Point \\nHmm…“The Right to Demand Satisfaction.” Well, I guess we’ll just have to take your word on it. But honestly, it sounds like something you just made up. And “rights” simply don’t work like that. \\nIn regard to “dueling pistols,” I’m afraid the example is not related to your earlier claim of some sort of “right.” In fact, if I’m not mistaken, duels were a matter of a code of honor, and had very little to do with rights. \\nIt’s sort of interesting that you say your “Right to Demand Satisfaction” disappeared in “the late 1800’s or early 1900’s,” since it wasn’t long after that the modern concept of “rights” really began to enter our social consciousness. billdeserthills \\nToo bad the schools don’t do much of a job educating you kids these days Point \\nThat’s fine. We’re done with our chat though, correct? billdeserthills \\nI suppose, you don’t really seem intelligent enough to discuss much–You can’t even remember simple things others write, even when that writing would be easily referred to, you still get it wrong–Sounds like you are just a modern-made problem waiting to happen to your next employer, sucks to be that guy, I suppose Point \\nCheers. billdeserthills \\nI’m thinking you should definitely invest in a helmet, so you don’t fall down and cause yourself some brain damage Sounds like you need to preserve all the brain cells you can get Point \\nThat’s also fine. I thought we were done with our discussion? \\nSince you have had nothing to say regarding our original topic of discussion – despite your several ongoing comments – may I suggest that at this time, we allow others to express themselves, and our discussion can become part of the archive of this article’s comments? \\nCheers. billdeserthills \\nThis isn’t a piece of paper, there is plenty of room for saying nothing at all here–besides the mods need something to do. Point \\nThat’s going to be a problem for our friend, Billdeserthills, because he has indicated that a man has “a right to demand satisfaction.” He has also since indicated that “satisfaction” involves blowing someone’s head off. billdeserthills \\nActually I said nothing of the kind. So sad to see modern education at work– Point \\nMy bad – the person I intended to refer to is “Justsomeguy151.” billdeserthills \\nSounds like you are getting smarter, I hope it isn’t just more BS Point \\nCheers. billdeserthills \\nTotally unfounded–Hard to believe that You are actually a ‘scientist’–Real scientist’s use facts, before they shoot off they’re mouths–You should try it sometime–Facts can be your friend Luke Yi \\nWe intentionally do not hire cops with IQs much above the mean. I understand the reasoning employed in that decision but believe it’s a moral error billdeserthills \\nIt’s not just a ‘moral’ error–The money these so-called ‘police’ cost taxpayers Every Year could buy us all something real nice–Or even a whole bunch of Real Police Point \\nIn many jurisdictions, it sort of depends on why you killed the guy. Christopher Pacella \\ninnocent??? that nigger had his hands up. that means he was high on crack. Annica \\nWow and your hate is the reason why there’s still racial tension. Unarmed, hands up don’t deserve to be shot dead in cold blood. Period. No human deserves that. No matter their race. Bigot. Justsomeguy151 \\nBigoted fagot, you’re not funny. In fact, you deserve to be brutally murdered by the very same pig’s you suck off. Point \\nHuh… so you do like blacks, but you don’t like gays? \\nDo you have a list, or something so that we can know ahead of time who’s ok, and who’s not? \\nIt’s sort of weird, because usually people will either dislike both gays and blacks, or they won’t have a problem with either. But – eh – there’s no rules about these things. billdeserthills \\nAre You taking notes? Point \\nA list of the people who you don’t like. We’ve got blacks and gays so far. Anyone else? \\nI’m honestly not sure what your argument regarding gays is – I’ve read your comment a couple times, and it’s clear you don’t like them. What’s the point, though? \\nYou’re welcome to like or to not like anyone you want, in my opinion. I don’t know if it’s a “right,” per se, but I treat it as though it is. But, if you’re going to say things that aren’t in fact true, then – if it’s a topic I am familiar with – I’ll probably say something to you about it. billdeserthills \\nI don’t really know any black or gay people, so I can’t say I don’t like them Point \\nFair enough. Maybe I misinterpreted one of your earlier comments. Justsomeguy151 \\nI don’t dislike gays although I hate what they do and the Gay Agenda. A list for what? Are you an idiot? We are all responsible for own actions and gays always say “I just can’t help it, I was born this way” (even though there are former gays so yes, they can definitely choose), so their perversion should be OK. Well pedophiles say the same thing but not too many people are falling all over themselves to defend them. Luke Yi \\nI’m certain you’re wrong about “kill a guy…go to jail”— the law has many different ways of treating killers depending on the particular circumstances. \\nThat said I agree with the sentiment behind your expression Jan Honeycutt \\nIf we shoot a criminal on our property we go to jail. Mike List \\nNot sure ‘much higher’ is good, but the parameters of police conduct need to be communicated and understood in good faith, by police and their clients. Luke Yi \\nWhy wouldn’t higher standards be required of someone who in the course of their duties employs deadly force legally? Messier M41 \\nThey aren’t held to any standard, except whatever one they decide they want to be held to that day. If the military is being honored, then the police will say “we are just like them and we should be honored like them.” When they shoot unarmed people, the standard is “I was a scared little bitch and I wanted to make sure I got home to my family! How dare you question me!” freewheelinfranklin543 \\nIt is called Obstruction of Justice and it is a felony. Tmoney \\nObstruction of justice is a felony? The obstruction the officer was talking about was not answering questions which is bullshit because you don’t have to answer questions it’s called the 5th amendment. Even if he was charged and even if it went to court that type of obstruction would be a misdemeanor. Obstruction is a broad term and can be a felony, but things like people filming an encounter and interfering with an arrest is misdemeanor obstruction. James \\nI’ve got a better idea. put them in the stocks and subject them to a lifetime of public humiliation and abuse. edslides \\ndeath is too generous. put that useless twat n general population in a state penitentiary, remember how dahmer got justiced? shanked in the terlet. this shit has got to be nipped in the fuckin bud. sooner rather than later. i dont care what color you are, this is just straight up bullshit. looked down the barrel of a cop gun myself twice, once for walking, once for questioning a “cops” authoritah. Jordan Manicom \\nI would have killed the pig billdeserthills \\nNo you wouldn’t, I’ve had many people draw down on me and not all of them cops by a long shot–That ‘keepin it real’ bs isn’t worth a trip to jail–However you might second my desire to bring back Our Right to Demand Satisfaction? There was honor in that, someone gets slapped with a glove and someone gets killed (maybe) for their beliefs–Next time your politician disappoints you voting for the wrong side–Pistols at dawn scumbag! Or of course they could just run away, and look like dishonorable scum… Lliss \\nDid all of you guys on his blog get left back in at least one grade? You sound so infantile and dumb! billdeserthills \\nFuck off twat, I wasn’t talking to you Luke Yi \\nOf course pistols were quite inaccurate then. Modern pistols would likely make that a death sentence. Also, the best shot gets their way, rather than the best person. billdeserthills \\nDueling pistols are generally smooth bore, without rifling–They look to be intentionally created to be slightly inaccurate — Anyhow if you can’t shoot you could always hire someone to be your champion Luke Yi \\nWeapons were never designed to be intentionally inaccurate. Design of weapons has improved dramatically since the 1700s. billdeserthills \\nWhy weren’t the barrels rifled then? At the time rifle barrels were rifled, so the weapon makers knew about the accuracy potential of rifling a barrel–You are so smart, answer me that smarty pants freewheelinfranklin543 \\nDahmer wasn’t shanked. He was beaten(to a bloody pulp) to death with barbells. Lliss \\nAgain, Spoken by a cop hating guy who’s been arrested several times. Shut up Jerome Taylor \\nNo you shut up!! Point \\nNotice the number of people who so easily and blithely call for the death of other people. They’re sort of in the majority. \\nAnd I walk around with these people on the street, every day, people thinking that there are people who need to be killed. And I’m sure some of them think that I need to be killed. \\nWhen I realize how little respect my fellow Americans have for life, it makes me feel like we should have hyper-aggressive cops. \\nIf you’re calling for death, then I’m not even sure it matters why it should be so important whose death your calling for. The cops shot this man – he never bothered me, but you know what – there are plenty of people who he would have bothered. For example, America is filled with racists right now. They’ll be pleased. \\nMaybe this week, there will be another attack against police officers. Some people will be happy that some of them died. \\nI do know that there is almost no example where enough people were killed to solve whatever thing they thought was a problem. I know Hitler tried, but he missed some, and so whatever problem he thought existed because of jews, still exists. You – and a bunch of others – think that cops should be killed. Well, some folks think the same way, and have gone ahead and killed some cops. Turns out that we still have cop problems. \\nYou know what I don’t like about these cops? That they’re reckless with life. That’s who I don’t trust: people reckless with life. Those who call for violence, who support it, overtly or silently, are the foundation of many complex contemporary social ills. Luke Yi \\nI think you lost track of your point when you called for hyper aggressive cops–wouldn’t they kill people? Doesn’t that mean you’re calling for killing people, which is the opposite of what you stayed you were for? \\nAnd yes, killing people literally ended Hitler’s reign of terror, so that particular problem was solved in part by killing people. \\nYour message is confused and mixed, you might just want to rewrite that post altogether for posterity. Point \\nQuite fair; my prior comment got a little out of hand. \\nTo speak plainly: I am against all killing and injury of people. Regardless of reason. It’s an ethic I chose, and have developed based on what ultimately has been important to me, and in my honest opinion, to the long-term health of our society. \\nMy confusing post is in response to those who make the argument – and there are many here – that the cop should be killed. The essential theme I was attempting to communicate is that there is no situation where killing someone has ultimately lead to a better world. billdeserthills \\nYou are confused, the vast majority of people want to be peaceable and peaceful. Point \\nIf you need it pointed out to you, I’m glad to: the population I’m referring to in reference to the “number of people” are those who have commented on this story. Not the general population. Sorry you misunderstood. billdeserthills \\nThat just isn’t true, many people use these forums to blow off steam. I have blocked lots of people and even they had little actual desire to kill anyone. Put a gun in your pocket and you’ll see just how little it likely gets used Point \\nI’m quite sure that your view is the more “correct,” or more in-line with the intent of those posters. In fact, I’m sure I’ve “blown off steam” in the past also. \\nHowever: I consider that a very harmful steam. I consider it corrosive to the mind that creates the steam; I consider it poisonous to those who read it; and I feel that it is that very steam that – for a minority of us – eventually gives us the impetuous to harm another person. \\nAnd – frankly – such attitudes tend to be divisive rather than unifying. This really is a problem – the cops killing people (or – depending on what flavor steam percolates through your mind, a problem with black people) – and the solution is even more complex than the problem. Mind you, this site seems to have a bias on the political spectrum. There are other sites where I’m having conversations on this very same topic, only instead of telling people it’s wrong to want to kill – or wish the death – of a cop, I’m trying to get racists to tell me, sanely and rationally, their rationale for disliking black people. \\nSee how it almost ruined our friendship? And neither of us blew off any steam – you and I had contention because of others’ steam. \\nAnyway, I enjoy that we can have this chat. \\nPS – you’re right, if I put a gun in my pocket, it wouldn’t get used. The same is true for many of us, even the steamy ones. My concern is the minority of folks who will use their gun. Luke Yi \\nDifferent strokes for different folks, no? Sometimes people must express their anger or (as is common for men of my age) suffer stress related illnesses such as heart attack, stroke, or high blood pressure. Luke Yi \\nI’m not convinced they are the majority, by any means. palvadore \\nThe only reason LEOs behave so egregiously is because they are allowed to get away with smaller crimes. \\nAttacking the boot on our collective throat may help a little, but the solution is to look at those enabling the base corruption and immorality. The judges, DAs, Police Chiefs, and lawyers all have blood on their hands. Luke Yi \\nIt is ironic to me that the same folks who believe in arming up to defend themselves from the federal government, simultaneously seem to believe the local (poorly trained) police can do no wrong. Point \\nI’ve always thought that the only people who deserve capital punishment are those who support capital punishment. Aleix \\n“I’ve always thought that the only people who deserve capital punishment are those who support capital punishment”“I’ve always thought” \\nso you support yourself being given capital punishment. \\nThink about that \\nIs deadly ain’t it? billdeserthills \\nYou scientist folks sound backwards and all mixed up Point \\nI wouldn’t know. I only see one other person participating in our chat prepared to seriously discuss these issues, and I have no idea what he does for work. I wouldn’t be surprised if he’s associated with science. Perhaps anthropology – he’s got a strong, strong insight to the human psyche. billdeserthills \\nSo how is it that a ‘scientist’ such as yourself never heard of the scientific method? Point \\nYour question doesn’t really make any sense, I’m afraid. \\nI’m also getting a little bored with you. If you want to talk about me, it’s a very different topic. Start it elsewhere. I’ll remind you that the original topic addresses the desire of a rather sociopathic-sounding individual to see more people die in response to people dying. I think that’s a more interesting topic. billdeserthills \\nYou can quit talking anytime you like Tmoney \\nCan anyone sync up the helicopter video with the ground audio with the shot? Police stated they used a taser and then shot him. Could the taser caused him to drop his hand or was he shot and then dropped his hand as a result of that. Even if he dropped his hand his car broke down on the road. How did it even come to being at gun point surrounded by police and a helicopter. These are the questions people should be asking. Freethinker \\nMark my words. She will walk. They are all above the law. More than 1300 people were killed by cops last year. Out of 18 cases in 2015 in the US where cops were charged with manslaughter and or murder guess how many got convicted?…. [url=( http://thefreethoughtproject.com/record-number-cops-charged-murder-manslaughter-2015-single-officer-convicted )]ZERO[/url]Cops are untouchable and they know it. JW Mack \\nA job well done. Xman3 \\nWhy do you need some 5 officers, a helicopter to respond to a broken down vehicle and then kill the driver? And all of the high speed police cars endangering the public, again for a broken down vehicle? Tulsa obviously has too many police with nothing to do. Sillywilly \\nremember the old days when hanging was all the rage and everyone from miles around would come for a little excitement on a hot Friday night…kinda the same principle. Luke Yi \\nTulsa was the home of the worst race riot in American history, during which whites destroyed an entire black community, literally the wealthiest black community in America, leaving ten thousand people homeless and killing many. \\nNo whites were killed or injured in the riots, and no whites faced criminal punishment for their behavior. \\n6,000 blacks were arrested for trying to protect their homes and families and scores of blacks were killed \\nnever came across that story before \\nthanks \\nYou’re welcome. I’m still blown away. \\nHere’s a great documentary about the events: billdeserthills \\nCops are bored, they make their own drama–It’s their own version of a snuff film Lliss \\nNo you’re bored that’s why you are on a blog talking about people with real jobs. You would NEVER comprehend what it means to be a cop so just keep writing about shit you don’t understand billdeserthills \\nJust because you are an experienced ‘useful idiot’ doesn’t mean you actually know anything Luke Yi \\nhttps://youtu.be/2EeJ0U5pVi8 Lliss \\nTulsa is extremely busy. This man was on pcp and that amount of officers is necessary to attempt to diffuse a bad situation and cause the person to rethink their actions and comply. Obviously you know nothing about police work besides what you watch on tv Rena Aleman-Walker \\nWhen did they release the results of there findings from the body and blood? Just because thats what she said it must be true….. I don’t think so. I have looked on a few news websites and they say that his her claim but IT DOESN’T SAY IT IS A FACT!!! Again you are looking with your rose colored glasses. pray58 \\nLliss stop spreading lies, there has been no results from blood work, so where do you get your information, and you accuse people of excepting false information from the news and then you post hearsay! Luke Yi \\nSymptoms of PCP use, for those who make claims without evidence: \\nThey have dilated pupils. They have developed a temporary speech impediment (This can occur even when they are not on the drug). They do not move from one spot for hours. They are extremely sensitive to sound. They are seeing and hearing things that are not real. Their balance is off and they cannot walk without falling. Their eyes keep rolling back in their head. Their vision is blurry. They continually stare at nothing and are in a stupor state. They are having uncontrollable and irrational behavioral outbursts for no apparent reason KKN4LIFE \\nDAMN so Colin Kaepernick is STILL wrong and disrespectful grapesodabanked \\nKaepernick is just a racist who wants to make everything about black people vs white people. Hugh Culliton \\nActually, I think he just wants to see the law applied evenly, and to not see anymore unnecessary killings. I don’t think that meets the definition of “racist”. billdeserthills \\nI don’t think what he is doing is any more serious than flying the american flag upside down, or lighting it on fire and far as I can tell those things are still legal. obama refuses to place his hand over his heart when the pledge of america is recited, nor will he salute his men, so who is the real disrespectful person here? edslides \\nflying the flag upside down. do you understand why an AMERICAN might do that? billdeserthills \\nIt signals an emergency, far as I know, I bet google has all kinds of reasons It isn’t ‘sticks & stones’– it doesn’t hurt anyone Sungoddess \\nI don’t salute the flag either because liberty and justice for all is bullshit ,second the president does salute his soldiers. I am a veteran and you only salute officers. A flag which is a piece of cloth, a song and a pledge to a nation that has screwed over many races of people does not make you a better person, the way you treat fellow human beings is what matters . Lliss \\nWhat Kind of veteran are you? I think you’re lying billdeserthills \\nThat is all the bs I’m gonna read from you, twat–Begone palvadore \\nI agree with his point and I was enlisted and officer. Sungoddess \\nNot that I have to prove anything to you I served in the United States Army. I have no need to lie .what is your point anyway. Luke Yi \\nObama doesn’t refuse to put his hand over his heart during the pledge. In fact, he’s been photographed with hand over heart while reciting the pledge many times. \\nStop reading emails from your crazy great-uncle billdeserthills \\nPlenty of other disrespectful things obama does Luke Yi \\nWell then present the evidence of that, and I will answer that. \\nBut you’re wrong about what you said and now you’ve admitted it, though evidently you will continue to hold your unsubstantiated beliefs. billdeserthills \\nYou don’t find the thousands of lies obama has told to be disrespectful?–I suppose You think obama’s lies are unsubstantiated as well–What a wonderful ‘useful idiot’ you have become BigJohnConnor \\nYou are a fucking asshole. john \\nJust say you don’t like black people and want us to die. Do you think this pastor deserved what he got? Yes or no KKN4LIFE \\nWhite people have a 400 year head start on racism remember they are the one’s who created it DUH!! How is Kaep’s racism making YOU suffer? Luke Yi \\n/s Yeah, there’s absolutely no history in America of any race or gender dividing the whole country up by race and gender and making laws preventing some races and genders from being able to equally participate in society. /s \\nHonestly, anyone who still feels that way should match the $1,000,000 contribution Kaepernick made edslides \\nI have one word for you bill. A-S-S-I-M-I-L-A-T-I-O-N. if i moved to afghanistan, i would feel remiss if i expected them to respect my freedom of choice. they wouldnt. he can protest all he wants. when an American physically calls him out on his bullshit, will you stand by your comment? this aint the middle east. we dont care how you do it over there. pulll that shit here, you WILL be taken to task. come to my country and disrespect my country , we will kill you. thats our policy. billdeserthills \\nI don’t expect tolerance to intolerant muslim scum, and I don’t see what colin is physically hurting, by donating $1,000,000 towards people who have suffered. Why not put your money where your mouth is, get contributions from all your kkk and fake nazi friends & see if you can top $1,000,000?(mod please put barfing emoticon here) ThomasJefferson \\nI’m still trying to figure out wtf point it was that ed was stressing bill.His analogy, (ASSuming there even IS one) STILL eludes me. But, if indeed you did figure it out, an excellent response I must say. Luke Yi \\nI think there is a whole presidential campaign for that billdeserthills \\nI think you are confused billdeserthills \\nI just keep seeing more and more people the police kill & I’m not seeing anyone Else doing much about it–When You put up a million of your own money to fight this problem I may begin to pay attention. poopiepants \\nthanks for your insight ed. https://uploads.disquscdn.com/images/ca3f6ec0bcffbe818b2a7f93e1b48f118316ea463ca54175b44ee47199e6de76.jpg john \\nJust say you hate black people and we can call it a day. Do you defend this video or not? palvadore \\nThis has nothing to do with color. It’s just the latest example the media wants you to see. Cops kill more white men every year than blacks. The media just doesn’t want to show those examples. pray58 \\nWhere is you statistics for that statement, show proof! And I mean innocent white men being killed! palvadore \\nCan you meet your own demand and proove how many “innocent” Africans were shot by police? And please don’t use FBI statistics or anything that you can JUST fucking GOOGLE! Like the rest of us! \\nI protest police misconduct not because I give a care about the poor, poor, little black man that chose to live life with the evil white man. No! I protest for all the other races! Black lives don’t matter to me at all. Luke Yi \\nThat’s not our policy. Our policy is ensconced in the constitution, and it’s most important amendment, the 1st, which provides freedom of expression FiuToYou \\nI hope you’re being a satirist here! I feel you are. Colin is a patriotic hero!!!! KKN4LIFE \\nHUH? Colin is a WARRIOR! Jerome Taylor \\nMy point exactly!!! Stay tuned!! This ish is getting old, you think? Richard Norgard \\n“That looks like a bad dude, too. Must be on something’.” \\nI guess that makes it ok to kill him. Whatever happened to protect and serve? billdeserthills \\nThe police protect & serve themselves Lliss \\nThey definitely serves, keeping that dude outa somebody’s back yard Tricornes \\nI’ll take 10 dead idiots who won’t comply with police orders over one decent police officer getting a scratch on his pinkie. Reinhold Von Kirschmann \\nNotice how in the helicopter video, the guy says he looks like a bad guy, and me must be on something.. Guilty till proven innocent. Hope this domestic terrorist goes to jail. She is a murderer plain and simple. Good Canadian Kid \\nHe’s black, so in the eyes of a cop that makes him a bad guy and a drug user. edslides \\nnot that it matters, but male pattern baldness is kind of a white thing. gonna revisit this point, but it doesnt matter. murder is murder. Lliss \\nNo he was considered a bad guy because he wasn’t complying and he was considered a drug user because of his erratic behavior and the drugs found at the scene. Please be fair and stop the cop hating bullshit. Yonnie Pietrovito-Moncrief \\nLiar, liar, pants on fire. The usual excuses for cop killers. Jerome Taylor \\nYou noticed that too, huh?! Four cops with weapons drawn, because they felt endangered and their life threatened!! Now I’m convinced, Cops are pussies!! I’m sure their girlfriends are really proud of them!! ScarletPimpernil \\nIt’s common play – consider family court, for example. There, a girl says “he scares me and I’m afraid for our children. No evidence is provided to support the claim, but the guy is, often, forever ejected from his own children(‘s)(s’) lives. billdeserthills \\nWhat erratic behavior or what drugs found at the scene?!! What video are you watching?!! Luke Yi \\nOfficers did report finding PCP in the car, and the victim had a history of addiction. \\nHowever, according to this report, the vehicle had already been secured so officers knew there was no gun inside. \\nSad story all around: it seems a man with a medical problem driving home from a college class in music appreciation died for no good reason. \\nYou surmised all that from what’s not in the video. Good Canadian Kid \\nAnd the helicopter pilot was able to determine this just by looking at him? I’ll stop hating cops when they stop killing people who are having car problems. Sungoddess \\nWhat the hell us your deal are you just somebody who likes to chime in just to insult people with no facts ? Does that make you feel go about yourself you are exactly what I was talking about when I said bitch about not saluting a flag or standing for a song but can’t bother to be a decent human being. bumboclot \\nNobody on the ground would have heard that so it didn’t have anything to do with the shooting. But I did find it an interesting comment. Other than being a big black guy, and ignoring the cop’s commands, what made him a “bad guy” to that helicopter cop? I mean, he wasn’t a robbery suspect, he had a broken down car. I wonder what they were referring to. Lliss \\nThey were referring to the fact that 4 officers were trying to get him to comply with their orders to stop and instead he chose to keep walking away and reaching into his car for god knows what. That’s what they meant by seems like a bad guy. David Boccabella \\nWhen you get 4 excited officers – all screaming different orders – which one to you follow. Luke Yi \\nThey could have heard it as all officers have radios on them. Lliss \\nYea, normal people keep walking away from officers and reachin into their cars after being told to stop! He’s a BAD GUY you lame idiot. Keep watching the biased liberal news, increasing their ratings and making them rich off your dumb racist ass when the truth WILL come to light! The news is using all of you to promote their cop hating agenda! Not because they believe it but because it hypes the people and makes them rich!!! Read between the lines. They are biased! using words like “murder” and “gunned down” doesn’t she get her day in court? Isn’t she innocent before proven guilty?” Please you all are so one sided. You don’t want peace! You don’t want justice!! You want to be treated well and to treat others as badly as you feel you’ve been treated. That’s not justice! Keep watching he news. They’ll love you for it. Rena Aleman-Walker \\nYou say that she deserves her day in court but did he get his? No, why? Because he was killed by another cop who for some reson didnt do there job. That’s not justice to be shot in a street, they developed less abrasive measures to bring a person to there knees. Number two did she see why or understand what was going on? NO, that is WHAT IS INJUSTICE.o you shut up because you are looking at the situation just as biase as the rest . So get off your soap box and shut up like you keep telling everyone else. palvadore \\nNo matter the criminality or deprecation of the act, police officers will always find an out for other police officers. Rena Aleman-Walker \\nYou are RIGHT!!! Because they have a alliance, a brotherhood if you will. They are NOT going to break because if one does that one will get SOOO MUCH flack for it. They would make that one LIFE SOO MISERABLE. THEY would NEVER!!!! Rena Aleman-Walker \\nIt is ALWAYS BEEN HARD TO DO THE RIGHT THING!!!! I know that people say anything worth doing is never EASY but i think doing the RIGHT THING in the amidst of OPPOSITION IS EVEN HARDER. ScarletPimpernil \\nWhere is the proof they did not tell him to put his hands on his car and he was complying? Reinhold Von Kirschmann \\nThe window was closed you racist cop appologist. The reaching in the window was a police lie. But you don’t care about that. palvadore \\nA cop apologist doesn’t make someone a racist. Police misconduct is epidemic and against all citizens and non citizen alike. pray58 \\nLliss did he get his day in court, was he innocent before proven guilty, why does she have more rights then he got. Why is it alway deadly force when it comes to black men! Why were they bothering him any ways his car was broke down why all the harassment! Stop trying to justify this madness. Nicholas Hoey \\nWTF! All I am thinking is it shouldnt matter what you do for a living, if you kill anybody you must be judged just like everybody else! Luke Yi \\nWhat do you mean by bad guy? I didn’t hear anyone tell him to stop in any of the video I watched. And the vehicle had already been secured, so officers knew there was no gun. \\nLink the video and tell us the time code for when he is told to stop? \\nhttp://m.tulsaworld.com/news/courts/terence-crutcher-family-attorneys-allege-misinformation-from-police/article_392556ce-f698-54ed-9db9-fa9736493874.html?mode=jqm Reinhold Von Kirschmann \\nSo you stupid idiot, what do you have to say now that she’s been charged with murder huh? Loser troll with a big mouth and no brains! Shut up an go hide in your delusional world. Reinhold Von Kirschmann \\nShe was charged with murder, how come I don’t hear you flapping your ignorant mouth now huh? Loser Reinhold Von Kirschmann \\nHow come after she was charged with murder, I don’t hear you flapping your ignorant mouth now. Why so quiet? Fool Susan Miele \\nand so are all the cops with her and in the air above her; they passed judgement, failed to render aid to him and will now stay silent while the cops cook up their story. Rogue cops cost us money \\nFor all of their reckless behavior by these trigger happy fuck ups, It is time to start drug testing all cops. Training may be lacking but I will bet 5o percent of cops are on some type of illegal drug. Marc Tremmel \\nwouldn’t be surprised …but alcohol is their drug because it is “legal” police have a high rate of alcoholism billdeserthills \\nPolice steal plenty of other people’s drugs to help maintain their other habits. Evidence rooms find theft going on by police billdeserthills \\nLarge amount of steroid use going on too ThomasJefferson \\nLOL, unfortunately, they’re usually just drunks or on prescription poisons.One thing’s for sure, if they ALL had a little THC, administered to them before they were inflicted upon the world at the beginning of their shift, much of THIS type of insane tragedy would be avoided. Marc Tremmel \\nWhy is the police chief calling him a suspected? if all that happened was his car broke down???…what is he suspected of doing…the police are INSANE…talk about guilty before innocent…and the sentence is death no matter what the “crime” is ….Tulsa, ok are you kidding me!?! lmfao like that is a criminal hot bed for terrorists billdeserthills \\nDamage control– So do all the cops get a paid vacation? Jeffboy \\n“the ballooning epidemic of police violence,” it is just that it was covered up before now. bumboclot \\nYeah, more like the epidemic of camera coverage. The violence was always there. 2broke4 her \\nI wonder if they are going to do a sacrificial lamb, to keep this from going ballistic? Bob Btme \\nhttp://www.nytimes.com/1994/03/28/us/minister-who-sought-peace-dies-in-a-botched-drug-raid.html \\n>>>Minister Who Sought Peace Dies in a Botched Drug Raid \\nBOSTON, March 27— The Rev. Accelynne Williams, who for decades had comforted and counseled people throughout the Caribbean, retired to Boston six years ago to be near his daughter and to study the Scriptures. On Friday a police SWAT team searching for drugs broke down his apartment door without warning and handcuffed him. Minutes later, the 75-year-old minister was dead of heart failure. \\nThe police, it turned out, had misread a floor plan provided by an informer; they had intended to raid an apartment on the floor above Mr. Williams. sfulmer \\nIt looks like they form a wall to block the view of the camera after the shooting. Guy \\nIn other words. Please don’t riot and burn down our town, while we decide what sort of spin we are going to put on it ! \\nBroken down car in middle of road, = Death Penalty ! John Henry Gunderson \\nI am in no way trying to condone this, but it appeared to me, the man walked to his car, lowered his hands, and attempted to open the door of his vehicle. Good Canadian Kid \\nWatch the video again, their is more than ten seconds between the shot and when he falls to the ground. He lowered his hands AFTER he was shot! John Henry Gunderson \\nI’ll be the first to admit, the cops had no business pulling their guns on this man in the first place, and because of this, they need to be held responsible for what happened. But your the one who needs to watch the video again (I already did, about five times) The man lowers his hands, grabs the door, and then you hear the shot go off. Good Canadian Kid \\nNope, watch it again and compare it to the video shot from the cop car, it sure looks to me like the killer shoots then steps to her right and Terence drops his arm. This is at the beginning of the 22 second mark of the helicopter video. \\nIs there someone out there who can sync up both videos and play them at the same time? John Henry Gunderson \\nOn the dash cam you see him lowering his hands at the 50 sec. mark, then you here the shot fired and see smoke at the 52 sec. mark. Good Canadian Kid \\nWatch this video, it shows both the helicopter and the dashcam side by side, he had his hands up when shot. (at approx. 17 seconds) \\nhttps://www.youtube.com/watch?v=98R4e0RSry8 Lobo06 \\nThere is know accountabilty when chickenshit cops murder innocent people. She is on paid vaction giving and getting high fives for smoking another human being of color. Lobo06 \\nListening to these a-holes its clear they are going to cover thier backsides with all due speed and keep the white only club from getting what they so badly deserve. billdeserthills \\nCops are indemnified, they cannot be convicted of a crime, in most cases–Ever wonder why although 3 cops a day are arrested, you almost never hear of one going to jail? \\nNo way this will go unpunished. One week paid vacation, instead of two! *gasp* Jonathan Wint \\nTulsa Police Officer Betty Shelby must suck mean cock….Not black against White Its Humans Against Blue! Becouse in this country Only BLUE LIVES MATTER! d marino \\nWTF is the helicopter guy talking about this is “one bad dude” and “he must be on something” comments? Where is any indication for those comments to be made? \\nHe’s black and that’s oxygen he’s breathing. What other reason do they need? billdeserthills \\nDamage Control–Just that thin blue line sticking together anarchyst \\n…there WILL be a civil lawsuit…any award should be disbursed from the cops’ pension fund, NOT from the taxpayers. the cop should be charged and convicted just as any other civilian would be…with appropriate sentence carried out…it should be a felony, so he can never work in a police capacity ever again… Kurt Bailey \\nYou say ‘This is what complying with police in America looks like’??? Are you on drugs? He was not following orders because he was walking to his car and not getting on the ground. The officers had no idea what he had waiting inside that truck (gun, bomb) or if he would use that truck to ram them. This is BS race baiting media. Jordan Manicom \\nSo when the officers have no idea what is going on, they can shoot first and investigate later? They had no right to draw their weapons in the first place, anyone without their impunity would be charged for brandishing a weapon. DLHE \\nThey will lie their way out of it, started already, he came after her aggressively and did not obey her commands, notice how they back away in tandum, these fools have loss their freaking minds, kill people and walk away, say my fault, no sorry no nothing. Thomas D’Angelo \\nWhat’s with the side argument on the side of the police vehicle starting at 1:08? That lady cop knew something. It looked like she tried to arrest that cop, he refused, then she ran away. FiuToYou \\nMURDER of an innocent man by a policewomen or man , should be treated JUST like a murder! This is too much! Paid vacation!! What bull sh*t. Thrown in jail would be correct! microphone \\nI’m doubting the validity of this post. After all, what’s a “dash can”? SuperLuminal Man \\nAmerica is now a de facto police state —accelerating rapidly towards open tyranny. Michael \\nI just do not understand this – why were they even called to attend, a simple breakdown it is just weird billdeserthills \\nSomebody was too cheap for AAA–And he paid with his Life Robert Skinner \\nDo we know what he was reaching for in his right hand? Objecitvely speeking? Geelove \\nI thought both hands where up how could he be reaching for something? Robert Skinner \\nAs he was going towards the car? Or was that me, I watched both videos tommoulton \\nI didn’t know they give Blind Police Officers Guns? or are they playing the wrong dialog to this video? And this just happened? This has to stop. Donald Trump hasn’t won yet! So that Shoot first and ask questions after isn’t the Policy yet. Cornelius Kappabani \\nLooks like one major fucked up accident to me caused by the bullshit training of Officers and Police Protocols. Officer Shelby herself sounds surprised and frightened and I have a hunch she will quit whatsoever facing the reality she just murdered a very nice person and father with no criminal record or anything. And there is no point in demonizing Shelby. Sue the shit out of the City, make the Officials understand that Police Training and Protocols are the cause of innocent people getting murdered by Police. Only then will things change. Only then Officers will become responsible for their actions. Davida Sefireth \\nLooks like people in the US are going to have to just stay in the house – forever – cause if you go out and God forbid you have the misfortune of encountering some problem better hope the pigs don’t just happen by. \\n– why, having to bend down to tie your fucking shoe lace and they may shoot you to death thinking that you are going for a gun … or some kinda dirty bomb up your arse! \\nWhat they really want, it looks like to me, is to have everybody raise their arms and say yes boss, whatever you say boss. \\nI just watched “Free State of Jones,”– great movie! in it there is this line: “…everybody at some point becomes the rich mans n….”! \\nPoint is, to the rich we are all slaves! But first, they make some persons more obviously the slave than others, to create the social conditions for breeding the instruments of totalitarianism. \\nAnd, this black men kill more black men argument is just shit for distraction and excuse! – like what? – so maybe it isn’t that “bad” that white men kill some too?! Fuck that! These type of arguments use the fallout of systemic racism and poverty, to diffuse responsibility and confuse understanding about what systematic racism really is and how it metastasizes in a society. \\nRacism is a fundamental tool of tyranny – it excuses and normalizes the unlawful control of portions of a population. It fractures a population and authorizes terror. The purpose is always to maintain the power of the few over the many. The rich establish the roots of tyranny within a society through racism – it manifests a form of class ownership, ultimately providing the rich with the power and means to control large segments of society, effectively giving them ownership over the many and maintaining their position at the top. \\nThe rich in their endless greed for more – wendigo spirits ( https://en.wikipedia.org/wiki/Wendigo ) – will eventually utilize the mechanisms of control established through the apartheid state to bring all of humanity under their yoke of ownership. \\nThis is called totalitarianism! \\nFighting racism is fighting the systemic roots of tyranny. \\nIn circumstances like we see world wide today, when liberal democracies begin their decent into totalitarianism, by design, through the rise of fanatical nationalist fervour personified through the cult of the populous leader – classical totalitarianism, or fascism – or through the inversion of a democratic state into rule by corporate oligarchy – inverted totalitarianism, you always see the institutions of law and law enforcement radicalized beyond the scope of constitutional law – they become rogue entities serving the powers of gross ownership, that is the elite. \\nTherefore, I believe in what we see in the growing numbers of flagrant murders by police, is the transmutation of the police forces into the contemporary Gestapo. \\nThere are many subroutines effectively promoting this … like their training which proposes that police first must establish “compliance” and that any resistance or suggestion there-off is “disobedience” of authority legitimizing the use of lethal force. \\nCops are jacked up on the need to establish power and authority which subsequently turns citizens into victims! \\nThe new world order means 1% Masters and the rest Slaves with some slaves given power to be bosses while thinking that they are also masters so they will keep the rest of the slaves under boot! \\nWelcome to the New World Order Moparman \\nThose POS get away with killing innocent people over and over and over again they know they will get away with it so they keep doing it it is total 100% BS Wilfred Bankole Ademokun \\nWhat a BAD BAD NEWS, if we don’t get JUSTICE on this case, and the killer cops are freed, go after the killer cops get them down. an eye for an eye. THIS ARE WHAT THE REPUBLICANS INTRODUCE IN 1969. KILL THEM AND LET THEM LOOK LIKE CRIMINALS. Am sure the killer cops have family, they will bury their own son soonest. ANIMALS IN HUMAN SKIN. ibrownie \\nYou have just seen that your city is like every other city regarding above the law policing and killing of innocent citizen, the very citizens that pay their salaries. The whole world has now looked at America as a country that kills its people, sad to say but true, the audacity to have these officers on paid vacation is a slap in the face. Til the day I die I will never look at America the same. Rambro \\nMicah X Johnson, Gavin Eugene Long thank you brothers for poaching those pigs !!! Ibcamn \\ncops are pure criminals……..they have the god complex,judge dredd syndrome….cunts they all be,road pirates with guns….cops are criminals………. blastinbob \\nAnd the cops wonder why people run from the law this happens way to often the police are less and less trusted every day and it is their own fault. RS \\nIt’s time to nationally ban all police forces, stand then down and rethink what we need. bumboclot \\nRIP to the poor guy who commited the horrible sin of having his car break down on him. As for the cop, I’m not so sure that this is anything more than a completely incompetent moron doing a job that is WAY beyond her abilities. She is such a screw up, if she was my partner, I’d quit the force. NewHampshire \\nWell, so long as we allow the illegal training of our local cops by foreign terrorists, this will continue. http://www.salem-news.com/articles/november222011/adl-occupy.php Martha Nassauer \\nWhat do we expect, when a hairdresser needs 12 months of training, as opposed to under 6 months of training for law enforcement? Is anyone really surprised? With a GED/High School Diploma, under 6 months of training, and these psychos are wielding badges, deadly weapons, fast cruisers and a whole lot of superior thinking? palvadore \\nAmericans have no protection from a police officer no matter what crimes the police commit against you! \\nFalse reports, fabrication of evidence, torture, warrantless raids, abductions, force injections, harassment…those are just some of the assaults police commit against the law abiding population. Just try to report a crime in Kennesaw Ga and much worse may happen to you. \\nNo justice – period! That makes you and me slaves. Jeff Glebe \\nHow does this even happen? “Hi, officer, my SUV broke down..what’s that? No, no, I don’t have any weapons or drugs on me. As I was saying, my SUV broke down just over there…sure, I can put my hands up, is there something wrong? No, I don’t have a dead body in the back of my car, what makes you think that I…okay, I will walk calmly to the side of my vehicle. Officer, I really just need a tow…no, tow isn’t a ‘street word’ for I’m going to kill you.” Then the officer, goes, well, he sure looks dangerous, let’s go ahead and shoot him and make sure he isn’t a zombie or something. Dawn Mello \\nEnough of this shit. Cold blooded murder, plain and simple. Lliss \\nSaying “cops” and not “that particular. Cop” is just another example of prejudice: judging all of one group by the actions of one. STOP ALL PREJUDICE !!NO PREJUDICE IS JUST! Judge all people individually! STOP THE MADNESS!!! Rena Aleman-Walker \\nI dont understand any of this criminal cops. Nor the man in the helicopter for saying this looks like a bad dude. I mean how can you tell how he looks other then he is a black man. I MEAN REALLY THIS IS SO SAD!!This is the reason WHY I hate for my children to leave my sight. My sun’s are tall and large black men. In today’s White society that already means they are BAD…… this is shit!!! Marc Peek \\nHey, hands up or not, don’t walk away from the police and then reach into your car window. Nothin to see here. Move along. Point \\nInteresting article. However, by injecting emotionally-charged language and patronizing metaphors, you have ostracized those who support a reduction in police powers and authority, and those who demand an increase for it, or otherwise feel that the current operations of police are acceptable. \\nExamples include:“Police on scene indeed appear infinitely more concerned with the panicked Shelby than they do with the man they just shot for no apparent reason.” \\n“As Crutcher lies mortally wounded on the ground, officers back away like frightened children…” \\n“Both have been given the paid vacation, otherwise known as administrative leave, customarily ‘rewarded’ after the use of fatal force.” \\nUsually, an argument featuring such a degree of bias and hyperbole is something I would ignore. Except I’m also accustomed to it from those whose primary arguments are in support of some form of racism, nationalism, or other form of bigotry. \\nUnfortunately, though I agree with the theme of your article, the arguments presented serve to diminish its utility. Cheri \\nI have so much respect for most police, they lay their lives on the line every day to keep us safe, but this video sure looks like murder, I saw his hands in the air, this must be treated as a murder. John Cokos \\nI’m trying to sift thru the official bullshit scenario that gets presented at every cop related murder. Folks what you saw in that video was a Ritualistic Snuff Movie carried out In Cold Blood by uniformed Sociopaths. The level of cold blooded disregard at someone who’s life was pouring out of him is just about impossible to rationalize. This story has only three outcomes after all the usual spin down and parallel reconstruction of the event’s that took place: They circle the wagon and that bitch goes on getting a paycheck.Tulsa goes the way of Ferguson and all hell beaks loose. They throw her under the bus regardless because she is now a toxic asset. She is found guilty of reckless homicide, gets fired, goes to jail. STOP FUNDING PAID VACATIONS FOR COPS THAT MURDER PEOPLE IN COLD BLOOD. DAN BAILEY19 \\nTHIS FOR THOSE OF YOU ALL WHO IS SEEM TO THINK SOMEHOW THESE OFFICER WAS IN THE RIGHT I WENT BACK AND FOUTH VIEWING THIS I WANTED TO BE SURE OF WHAT THE ONES IN THE AIR WAS SAYING AND I NOTICE THAT HE SAID THAT HE WILL HAVE TO RECORD THIS AND THEN HE SAID HE IS WALKING AND RIGHT AFTER THAT HE SAID HE ‘S FOLLOWING ORDERS BUT ONCE HE GETS CLOSE TO HIS VEHCILE THEN HE WANT TO SAY HE IS A BAD DUDE BUT ALL THE WHILE THEY LET HIM WALK WITH HIS HANDS UP UNTIL HE GETS TO HIS VEHCILE THAN ALL AT ONCE NOW HE IS A THREAT SO THEY TASE AND SHOOT HIM IF SHE FELT THEARTENED WHY THEN YOU WAIT UNTIL HE GETS TO THE VEHICLE TO EMPLOY THE TASE AND THEN SHOOT HIM.YELL AGAIN YOU WANT TO COVER UP THE FACT THAT YOU WAS WRONG IN WHAT YOU ALL HAVE DONE BE BLESS AnonGirl \\nNothing will happen to the cop. She’s get desk duty after coming back from PAID leave and then go back out onto the field. The murderess will continue to patrol and may one day kill again if it happens. \\nThe video shows the officer LIED about how things went down. LIED again when she claimed he was reaching into his vehicle because the video shows the window was CLOSED. Tim G Tim \\nI’ve got to say, I love what the FTP does overall. But seriously, you are really stretching with this one and a few others in recent past. The police have an insanely difficult job (no dispute) and just to keep this simple…. the word “pastor” in the title of your article is strictly for shock value, hands down! It doesn’t matter if this man was a pastor, cartel hit man, or a saint. Do the police on scene know he’s a pastor?? And why in the fucks sake is he walking TO HIS OPEN VEHICLE WINDOW with guns pointed at him???? Just scratch your head with that one for bit. Plain and simple that is NOT an innocent behavior. I carry a concealed pistol and probably would have done the same thing. How could anyone justify walking to their open car window in that circumstance? This is insane. Those officers were justified. You are inciting hate and division and need to check yourself. Guy \\nYou’re wrong there dude ! The drivers side door window was up, proven because of the blood from the lung shot is both on the window and door ! \\nSo is you assumption of “Walking Away From A Cop, With Your Hands Up” Is justification for police murder. Unless, you are okay with the old adage, “I was in fear for my life” is ? \\nJust as the new and improved bandage of words like “Transparency, Building Bridges and Community Trust, are the new spin words of justifiable homicide ! \\nAll that proves one thing. Cops can kill with out remorse, for things as simple as perception of fear, all the while relying on Legal Immunity, Blue Union Membership, DA’s, The Court Legal System Setup and D.O.J.’s backing them up, in killing us ! How is that a good enough reason ? Considering, in the country of England with a population of over 35 million people, there has not been the amount of police shootings in the last 20 years, that has yet to equaled one year here ! Or the 53.000 people put in hospitals and seriously injured as the results of contact with our police, this year alone and the year isn’t over yet ! \\nNo, you are dead wrong about justification of the War that cops are waging against the American People. Why do you carry a concealed weapon ? If you felt safe, you won’t need too, all you would ever need to do is call a cop ! steve_2 \\nYou guys really should watch the video. When he was tazed and shot, his hands were not up, he was not complying with police commands to stop and raise his hands, and he reached inside the vehicle. As usual, obeying police commands is the way to not get shot. Good Canadian Kid \\nYou should really watch this video that syncs the dash-cam with the chopper-cam. His hands were clearly up when he was shot. BTW: his window was closed so I don’t even begin to understand where you come to the conclusion that he was reaching inside his vehicle… Donna Bohdanyk \\nI want to puke. Joseph Mentor Nichols \\nWell he’s obviously trying to open his car door for some reason. I don’t even know why he’s walking to his car unless they told him to lean against it. Still, why back to his driver seat? I’m so confused. \\nI would hate to think that this dudes lack of common sense got him killed. It would be much more comforting to find out that the police shot him for no reason. Tmoney \\nCan anyone sync up the helicopter video with the shot on the ground video. I believe he drops his hand only after being shot, but if the ground audio was in the helicopter video it would be a better view and catch the timing of the shot. SSJRomance \\nCrutcher was not following officers commands and started walking back to his vehicle. That was his first mistake and made officers nervous. The second mistake was he reached into his vehicle. Do the officers have to wait until he pulls out a gun? \\nThat’s what happened with the NY terrorist. The cop was yelling “show me your hands” and gave the perp too much time that allowed him to grab his gun and shot the officer 2 times. That is what officers are up against. Damed if you do damed if you don’t. Good Canadian Kid \\nHow do you know he wasn’t following commands, the cop that shot him never bothered to turn on her recorder(s). He was just as likely returning to his vehicle as ordered to get his drivers license / registration / insurance. \\nWhen she shot him, his hands were up, look at this video that syncs the dash-cam with the chopper-cam.'"}, "time": 1742564370.7783422}