{"duration": 0.056618452072143555, "input_args": {"text": "'Did you know that ancient sites like Easter Island, Nazca, Ollantaytambo, Paratoari, Tassili n’Ajjer and the Pyramids of Giza are all aligned on a single great circle? There is a mind-boggling connection among ancient structures that is indicative of a far greater meaning than we were aware of. \\n\\n\\nThere have been numerous theories that ancient structures around the globe were specifically positioned by its ancient builder’s thousands of years ago. Perhaps one of the best examples –according to many— is the Great Pyramid of Giza and its curious position on Earth. For those of you who didn’t know, the Great Pyramid of Giza is the most accurately aligned structure in existence and faces true north with only 3/60th of a degree of error. Furthermore, the weight of the pyramid is estimated at 5,955,000 tons. Multiplied by 10^8 gives a reasonable estimate of the earth’s mass. As you can see, ancient structures were built with a mind-boggling precision.\\n\\nBut the Pyramids at the Giza plateau do not stand solitary on Earth. In fact, there are countless other sites that seem to be connected somehow. If you take a look at other ancient sites like the Nazca Lines, Machu Picchu, Easter Island, Mohenjo Daro, and Tassili n’Ajjer among others and draw down their position on a map, you will notice a connection that points perhaps towards an ancient ‘code’ embedded within these structures.\\n\\nAs is noted by world-mysteries.com , ancient sites like Giza, Siwa, Tassili n’Ajjer, Paratoari, Ollantaytambo, Machupicchu, Nazca, Easter Island, Aneityum Island, Preah Vihear, Sukhothai, Pyay, Khajuraho, Mohenjo Daro, Persepolis, Ur, Petra are shown clockwise from Giza on the equal azimuthal projection. The projection is centered on the axis point in southeastern Alaska. Distances to any location from the center of an equal azimuthal projection are equally scaled. Since all of the sites on the great circle alignment are equally distant from the axis point at one-quarter of the circumference of the earth, the alignment forms a perfect circle halfway between the center and the outer edge of the projection.\\n\\nCheck out the image below to understand the complexity of this mysterious alignment. \\n\\n\\nJim Alison goes on to explain even further in a very intriguing chart: \\nThe chart below lists the distance of each site from the great circle and the distance of each site from the northern axis point. There are slight variations in the distance from the axis point to the great circle depending on whether the route from the axis point to different locations along the great circle crosses over the equator or Polar Regions. The mean distance from the axis point to the great circle is 6,218 miles. \\n\\nFurthermore, the alignment of these sites is easily observable on a globe of the Earth with a horizon ring. If you line up any two of these sites on the horizon ring, all of the sites will be right on the horizon ring:\\n\\nStart on the Equator, at the mouth of the Amazon River, at 49° 17′ West Longitude; go to 30° 18′ North Latitude, 40° 43′ East Longitude, in the Middle East, which is the maximum latitude the line touches; then go to the Equator at 130° 43′ East Longitude, near the Northwest tip of New Guinea; then to 30° 18′ South Latitude, 139° 17′ West Longitude, in the South Pacific; and then back to 49° 17′ West Longitude, at the Equator.\\n\\nAs you can see, there seems to be a connection among all of the above structures that form –to the surprise of many— a massive circle encompassing all major archaeological site son planet Earth. How this is possible remains a profound enigma.\\n\\nWhat are your thoughts? Were te ancient’s trying to tell future generations something? Or, is it possible that this fascinating connection is nothing more than another bizarre coincidence?\\n\\nAncient-Code \\nSOURCE '"}, "time": 1742561900.9149022}