{"duration": 0.1188511848449707, "input_args": {"text": "' America and Lackeys Insult People of the World\\nBy Finian Cunningham\\n SCF \" - And it\\x92s not just Russia that Washington is insulting \\x96 it\\'s the entire world. Such is the preposterous hypocrisy of US leaders and their international network of cronies.\\nUS client regime Saudi Arabia \\x96 the world\\'s most repressive \\x96 being given a seat on the UN human rights council over the weekend while Russia was forced out of it is just one glaring insult among many.\\nRussia\\x92s top diplomat was referring to US officials and Western allies accusing Russia of \\x93barbarism\\x94 and \\x93war crimes\\x94 in its ongoing military intervention in Syria.\\nYet these unverified, hysterical charges that Washington levels against Moscow in Syria are proven against the US and its allies who have committed huge war crimes in dozens of countries over recent years. Crimes that go unaccounted for.\\nLavrov cited the case of former Yugoslavia in particular where, in 1999, US-led NATO warplanes killed thousands of civilians in air strikes on public infrastructure. Since then, illegal overseas wars launched by Washington \\x96 in brazen violation of international law \\x96 have proliferated with a death toll counted in millions.\\nCurrently, US forces are bombing seven countries, including Iraq, Syria and Yemen, inflicting civilian deaths on a daily basis. Yet it is Washington and its Western minions who have the audacity to condemn Russia over its military operations to salvage Syria from a US-led covert war for regime change. That the US has orchestrated a criminal covert war in Syria since March 2011 \\x96 violating the human rights of millions of Syrians \\x96 is a shocking reality that only the servile Western media continues to conceal.\\nLast week, the Western propaganda campaign to demonize Russia scored a dubious \\x93victory\\x94 by having Russia dropped from the United Nations Human Rights Council (UNHRC). That move was achieved on the back of a media-driven agenda claiming that Russian air strikes were indiscriminately targeting civilians in the northern Syria city of Aleppo.\\nNever mind that Russian (and Syrian) aircraft have not been carrying out combat missions around Aleppo for nearly two weeks in order to facilitate humanitarian aid efforts in the war-torn city. Never mind that those aid efforts have been continually sabotaged by foreign-backed terrorist groups holding civilians under siege in eastern Aleppo for the past four years.\\nRussia\\x92s military intervention in Syria over the past year has helped Syrian government forces liberate hundreds of towns and villages from a reign of terror imposed by foreign-backed mercenaries, all of which are integrated with the internationally outlawed terrorist networks Islamic State (Daesh) and Nusra Front. None of this is given any acknowledgment by the West and its subservient news media, which instead inverts reality by amplifying spurious claims leveled against Russia by the terrorist sponsors.\\nThe battle for Aleppo is fully consistent with the objective of liberating Syria from a US-led criminal conspiracy to destroy the country and to replace the elected government of President Bashar al-Assad with a pro-Western puppet regime.\\nOver the weekend, Western media strained credulity by referring to \\x93rebels breaking the regime\\x92s siege on Aleppo\\x94. These so-called rebels are none other than Al Qaeda-linked terrorists of Nusra Front and its myriad offshoots, like Ahrar al-Sham and Jaish al-Fatah. It isn\\x92t the Syrian army and its Russian ally that are holding the city siege. It is the terrorists. And over the weekend their shelling resulting in dozens of civilians being killed, including reportedly 14 children in government-held western Aleppo.\\nEven the abjectly one-sided Western media could not conceal the slaughter by terrorist \\x93rebels\\x94 whom the United States and its allies have supported with money, weapons and training to do their geopolitical bidding in Syria since 2011.\\nMeanwhile, in neighboring Iraq, a US coalition that includes Britain, France and Turkey continued bombing the city of Mosul, ostensibly to defeat extremists holding a civilian population as human shields \\x96 extremists whom the US and its partners have covertly supported next door in Syria. US-led aerial bombardment of Mosul has resulted in heavy civilian casualties since the offensive was launched on October 17, according to local sources.\\nElsewhere over the weekend, Saudi warplanes, supported by the US, Britain and France, ratcheted up even more crimes against humanity. Some 10,000 people have been killed since the Saudi coalition began bombing the region\\x92s poorest country in March 2015. In an air strike on the Red Sea port city of Hodeida, Saudi warplanes attacked a prison, killing more than 60 inmates and security staff. It was just the latest atrocity in a litany of such deadly strikes on civilian centers, including hospitals, schools, markets, mosques, family homes and even funeral halls.\\nLast week, UN agencies reported that nearly half the Yemeni population of 24 million is facing starvation. Images of skeletal children are emerging, wracked by dysentery and cholera. This barbaric nationwide ordeal has been created by the Saudi regime and its Western patrons imposing a sea and air blockade on the country. It is no exaggeration to say that the whole Yemeni nation is an imprisoned population that is being bombed over and over without the slightest compunction for women and children being blown to pieces.\\nWithout American, British and French military support the Saudi slaughter in Yemen would cease immediately. Western-backed Saudi claims of Iranian subversion in Yemen, from allegedly supporting Houthi rebels, are a risible pretext. Washington and its clients are destroying Yemen simply because they can\\x92t abide a popular, genuinely pro-democracy uprising succeeding in a vital oil-rich region that underpins US hegemony through despotic Arab rule, as in Saudi Arabia and the other Gulf monarchical dictatorships.\\nOn the same weekend that Russia was sanctioned at the UNHRC, it was yet another blood-soaked orgy of state-sponsored terrorism carried out by the US, its allies and their mercenary surrogates.\\nThe US, Britain, France and Saudi Arabia are among the 47 member states represented on the Geneva-based human rights council. The Saudi feudalist monarchy, which executes prisoners convicted of \\x93sorcery\\x94 and other crimes by public beheading, and which bans women from driving cars, only obtained its seat on the UNHRC due to Britain fixing the votes.\\nRussia, which has stood against the terrorist-sponsoring aggression in Syria by Washington and its rogue-state partners, is singled out for sanction over allegations of committing violations.\\nThis censure is insulting because not only is it a travesty of justice. It is an insult to common intelligence which can see through the preposterous lies of the US and its accomplices.\\nThe utter disconnect and deception by Washington and other Western governments may fool some of the people some of the time, but over the long-run such corruption is coming unstuck. The turmoil, anger and disdain among ordinary people towards criminals in high office is reaching boiling point in the US, Europe and across the world.\\nThe more that these illegitimate rulers seek to justify their existence and criminal enterprises the more it offends ordinary human intelligence.\\nRussia is right to be aggrieved by the public insults that emanate from Washington and its lackeys. But Russia is certainly not alone in being grotesquely wronged. The whole world is aggrieved by putting up so far with an international oligarchy of thieves, exploiters and sponsors of terrorism. So far.'"}, "time": 1742563879.950863}