{"duration": 0.13637018203735352, "input_args": {"text": "'America’s Post-Trump Widening Divide November 19, 2016 \\nAn ugly side of Donald Trump’s victory has been the unleashing of bigotry against minorities and women with the President-elect only mildly reining in these belligerent followers, writes Michael Winship. \\nBy Michael Winship \\nA friend of mine who has dual Israeli-American citizenship tells the story of entering an elevator in Jerusalem shortly after a bullying right-wing government had taken over the country. The other passenger was ostentatiously puffing on a big cigar. My friend pointed to the no smoking sign and politely, in Hebrew, asked the man to douse his smoke. \\n“Eff you,” the man replied. “We’re in charge now.” Only he didn’t say, “Eff.” The Confederate battle flag, seen by many around the world as a symbol of white supremacy, has had a resurgence in public displays following Donald Trump’s victory. \\nSound familiar? Well, it’s a tiptoe through the tulips compared to what’s going on in the United States right now. Incidents of hate-related violence and other abuses have proliferated throughout this lovely land of ours. \\nThe presidential campaign and now the election results have further allowed the pinheads of society to let their racist, misogynistic, anti-Semitic and Islamophobic freak flags fly. Despite denials from many on the Right and the Trump transition team, this is really happening — unlike that avalanche of fake news stories that have been overwhelming social media. (And yes, I know have been scattered incidents in which Trump followers have been vilified on the streets, but far fewer.) \\nJournalists who investigated Trump, his businesses, family and associates have been mailed anti-Semitic screeds or threatened with violence and even death. Women who have reported on Trump have been sent the vilest sexist epithets. Kshama Sawant, the socialist city council member from Seattle who recently urged protests at Trump’s inauguration in January, has been targeted for email and phone attacks, some of which have suggested that she kill herself. \\nJust about everyone I know has a story or two or three from the last week and a half. My friend Deana tells of a part-Asian co-worker swung at by a white male who mistook him as being from the Middle East, of a friend’s boyfriend who was told to “Go back to Africa” on his Facebook page, of another friend’s middle-school-aged daughter and other girls who were pushed around by boys in her class, some wearing Trump T-shirts and shouting hateful things about women. \\nAn Upsurge in Ugliness \\nFrom the Southern Poverty Law Center (SPLC) : “Between Wednesday, Nov. 9, the day after the presidential election, and the morning of Monday, Nov. 14, [SPLC] collected 437 reports of hateful intimidation and harassment… Venues of harassment included K-12 schools (99), businesses (76) and universities (67). Common also was vandalism and leafleting on private property (40) and epithets and slurs hurled from moving vehicles (38).”   Trump and his running mate Mike Pence thank their supporters for the upset victory on Nov. 8, 2016. (Photo from donaldjtrump.com) \\nA new report from the FBI states that last year, hate crimes were up 6 percent, with a two-thirds increase in attacks against Muslims. According to their statistics, “There were 5,818 single-bias incidents involving 7,121 victims. Of those victims, 59.2 percent were targeted because of a race/ethnicity/ancestry bias; 19.7 percent because of a religious bias; 17.7 percent because of a sexual-orientation bias; 1.7 percent because of a gender-identity bias; 1.2 percent because of a disability bias; and 0.4 percent because of a gender bias.” \\nCamila Domonosket at NPR notes, “The FBI report is based on local law enforcement data. It almost certainly understates the scale of the problem: In 2014, the Bureau of Justice Statistics estimated, based on victim surveys, that 60 percent of hate crimes are never reported to police.” \\nHere in New York City, the police department reports that so far in 2016 , hate crimes have jumped 30 percent from the same period last year, “including a spike during last week’s hotly contested presidential election,” according to DNAInfo New York . “NYPD statistics show that anti-Muslim and anti-‘sexual orientation’ motivations were responsible for much of the rise.” \\nBut what was Donald Trump’s response to the reports of the upswing in hate crimes after his election? “I am very surprised to hear that,” he told 60 Minutes’ Lesley Stahl . “I hate to hear that, I mean I hate to hear that.” \\nLesley Stahl: But you do hear it? \\nDonald Trump: I don’t hear it — I saw, I saw one or two instances… \\nLesley Stahl: On social media? \\nDonald Trump: But I think it’s a very small amount. Again, I think it’s — \\nLesley Stahl: Do you want to say anything to those people? \\nDonald Trump: I would say don’t do it, that’s terrible, ‘cause I’m gonna bring this country together. \\nLesley Stahl: They’re harassing Latinos, Muslims — \\nDonald Trump: I am so saddened to hear that. And I say, “Stop it.” If it — if it helps. I will say this, and I will say right to the cameras: Stop it. \\n“Stop it.” Really? That’s all? You sounded like a parent telling the kids in the back seat to quit fidgeting. Make your condemnation swift, adamant and loud. We know you know how to do loud. Demand that it cease. \\nThe Bannon Factor \\nAnd while we’re at it, Mr. President-elect, the appointment of your campaign CEO Steve Bannon as counselor and chief White House strategist makes a hideous situation even worse. Cancel it. Steve Bannon, political adviser to   Trump. (Photo from YouTube) \\nThis is, after all, the person who — more than a year ago! — Joshua Green at Bloomberg BusinessWeek succinctly described as “the most dangerous political operative in America.” \\nJulia Zorthian at TIME magazine writes that as head of the alt-right news website Breitbart , “Bannon has given voice to some of the unsavory forces floating around the conservative movement’s fringe, including a resurgence of white nationalism. His appointment has fueled anger , with critics decrying Bannon’s connections to racist and anti-Semitic views.” \\nIn recent days, many of you have seen some of Breibart ’s headlines: “Bill Kristol: Republican spoiler, renegade Jew,” “Birth control makes women unattractive and crazy,” “Would you rather your child had feminism or cancer?” and “Gay rights have made us dumber, it’s time to get back in the closet.” \\nEven The Washington Post’ s Kathleen Parker, who cut Bannon some slack in a recent column , concluded that “he has been willing to strategically encourage people’s hate as a way of inciting them to action. How these methods will manifest themselves in the White House remains to be seen. But we can uncomfortably imagine that Trump under Bannon’s direction will do whatever it takes to get what he wants.” Swell. \\nSo hate speech and Steve Bannon: a perfect pair. Donald Trump, you’ve let this evil genie out of the bottle. Set an example for a country so viciously torn asunder. Use one of your two remaining wishes and end this madness. \\nMichael Winship is the Emmy Award-winning senior writer of Moyers & Company and BillMoyers.com, and a former senior writing fellow at the policy and advocacy group Demos. Follow him on Twitter at @MichaelWinship . [This article originally appeared at http://billmoyers.com/story/none-normal-un-american/ ]'"}, "time": 1742561847.5191374}