{"duration": 0.05835151672363281, "input_args": {"text": "'AHEAD of his much anticipated title fight against Eddie Alvarez, Conor McGregor took some time out of his busy schedule to relax and give the readers of WWN his guide of New York. \\nPound for pound the best city in the world. It’s box office baby. \\nThe 9/11 memorial was sad, but not as sad as Alvarez will be when I crash land a jumbo left hook in the seemingly structurally sound facade of a face. He will come crashing down. It will be an inside job, because he prepares like a chump. \\nMy focus remains on the battle ahead in Madison Square Gardens but I was thrown off my preparation when I learned there is no garden. It’s just a big fuck off arena forged out of metal for the fighting God. I would say Gods, but there is only one, me, Notorious. \\nI had anticipated doing my movement training with grass beneath my feet, so I headed to Central Park. It ain’t got a patch on Phoenix Park. I wouldn’t be the fighter I am today without Dublin’s back garden. Chasing the deer as a nipper helped me hone my quickness, my agility. \\nI studied the deer and the stag; their movements. So don’t be surprised if I enter the octagon with four hooves and antlers. I will do anything, all it takes to win. Anyway, back to the tour, I hear they filmed some Sex and the City shit in Central Park. \\nNo Sex in the City for Alvarez, though. He couldn’t score in a brothel above Coppers with 20gs in his pocket. What I am saying is that my opponent is challenged in the face department. His head is like a melted lasagne left out in the sun for weeks. Not even Donald Trump would grab him by the pussy. \\nSpeaking of that Fanta headed prick, I’m not in his weight class ‘cus I’m not obese, but I’ll knock him out all the same. I’ll be worth more than him by the end of 205 too. Where’s my Hollywood star, fuck it, I’ll take the whole Walk. \\nBut, back to the tour – it would be interesting to note, the actors in Sex in the City are not as rich as me. Chumps. \\nWhen you tour around New York, be warned, people will ask you for endless selfies if you are famous as I am. I love the fans, but obviously when in camp, you’ve got to watch what you’re eating, it can make you a little tetchy, so while reducing my food intake ahead of the weigh in, I like to reduce my selfie intake too. Running from overweight Americans barely counts for cardio, but you’ve gotta take every chance to gain the edge over your opponent. \\nI was told to try the New York pizza, but can’t do that until after my victory, in the mean time I might use it to throw around at the pre-fight press conference. A scalding hot slice slapping Eddie in the face might improve his chances with the ladies. \\nPeace out. I’ve off to chuck a few euro off the top of the Empire State building to let off some steam.'"}, "time": 1742562231.6102316}