{"duration": 0.1376786231994629, "input_args": {"text": "'Terrorists are being killed, locked up, and running scared now that a    has replaced an   . [Terror mastermind Hafiz Muhammad Saeed was placed under house arrest in Lahore on January 30, less than ten days after Donald Trump took office. For years, Saeed had been living in the open in Pakistan in spite of a $10 million American bounty for information leading to his arrest and conviction. And yet it took new leadership in Washington D. C. to force the Pakistani government’s hand in getting serious about fighting Islamic extremism.  Lost in the misleading reports about “Muslim bans” and debates about   vetting on refugees from the Middle East has been the Trump administration’s quiet but successful effort behind the scenes to advance policies that crack down on terrorism and the Islamist ideology that fuels it. On the campaign trail, Donald Trump vowed to take a new line toward Pakistan  —   the Islamist government that actively backed the Taliban in its infancy and, in turn, was pivotal in the fundamentalist movement’s ascent in Afghanistan. And Americans won’t soon forget that Osama bin Laden, once the world’s number one terrorist, was found in a conspicuous, $1 million compound in Abbottabad, only hundreds of yards away from a prestigious training center for Pakistani army officers. Though Saeed isn’t a name known widely in the United States and though his arrest barely registered in Western headlines, he was the chief planner behind the 2008 Bombay attacks that killed dozens of Indians. In 1990, he founded    (Army of the Pure) deemed by terrorist experts as “probably the most dangerous terror group in the world. ” The group, among other horrific exploits, orchestrated “India’s  ”: the 2008 rampage on the Taj Hotel and the Jewish Chabad House in Mumbai, which left 166 people dead and more than 600 injured. Up until the inauguration of Donald Trump, Pakistani officials considered Saeed a   state hero because of his willingness to attack Pakistan’s longtime nemesis, India. What changed? “It is (Indian Prime Minster Narenda) Modi’s insistence and Trump’s instigation,” Saeed himself asserted. Islamabad, he added, “is helpless before the pressure of Trump and Modi. ” On this issue, the terrorist is right. The Pakistani government correctly appreciates that, not only there’s a new and tough sheriff in town, but that he’s got a skilled and receptive partner: a new U. S.  alliance is a mortal threat to Islamist terrorism everywhere. President Donald J. Trump and Prime Minister Modi together are the worst enemies of terrorists. The two are kindred spirits: committed nationalists and willing to forego the niceties of the political elites in both countries to get things done on behalf of a population eager for more jobs and economic growth. I introduced Mr. Trump and Mr. Modi for their first meeting in July 2016. A deepened relationship between the US and India is already advancing the war against Islamic extremism by leaps and bounds. India is literally on the front line of the defense of freedom it shares a   border with Pakistan, a nuclear weapons nation and one of the world’s leading state sponsors of terrorism. (By contrast, the   border is roughly 1, 255 miles.) Moreover, 84 percent of Pakistan’s 180 million Muslims support sharia law as official law while only 28 percent hold an “unfavorable” view of ISIS. Trump and Modi, both proud unapologetic patriots and champions of entrepreneurialism, have been friendly for a while. This has become especially apparent though within the past several months. On October 15, the Republican Hindu Coalition held the Humanity United Against Terror charity event at the New Jersey Convention  Expo Center in Edison, New Jersey. In his speech,   candidate Trump promised India and the US would be “best friends. ” He continued, “There won’t be any relationship more important to us. ” After the election, he  —   revealingly  —   reached out to Modi before contacting the head of any major European nation. The White House subsequently issued a statement, stressing, “the United States considers India a true friend and partner in addressing challenges around the world. ” Quartz heralded the arrival of a “bromance. ” Robust and enduring is the bond between America, the world’s oldest democracy, and India, the world’s most populous democracy. It was from the very beginning forged by a mutual reverence for liberty and constitutional republicanism. It was quickly reinforced by a mutual passion for industry and innovation. And today it is further bolstered by a shared yearning to eliminate, once and for all, the scourge of Islamic extremism. We must rejoice that the people replaced an    with a   . We ought to celebrate the fact that, finally, the international relationship exists to strike at the heart of an enemy that Obama’s administration refused to even name. And, out of an unending love of freedom, we should welcome strengthened ties between Washington and New Delhi. Given its long overdue crackdown, Pakistan clearly recognizes the dynamics have fundamentally changed. If Islamic extremists didn’t also realize this after 10, 000 Indian Americans rose to their feet and loudly cheered Trump in October and more than two million Hindus voted for Trump in November, then they soon will. Shalabh “Shalli” Kumar is Chairman and CEO of   AVG Advanced Technologies. He was a member of Trump’s Transition Finance and Inauguration Committee and founding chairman of the Republican Hindu Coalition. You can follow him on Twitter @iamshalabhkumar.'"}, "time": 1742563590.0077589}